{
    "chapters":{
        "1":{
            "author_id":"gianthorse",
            "author_name":"GiantHorse",
            "choices":[
                "Friesian",
                "Clydesdale",
                "Dutch Warmblood",
                "More Breed",
                "Human/Anthro"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you?</span></div></span></div>",
            "created":1590469200,
            "id":2841435,
            "title":"Horse Breeds"
        },
        "12":{
            "author_id":"gianthorse",
            "author_name":"GiantHorse",
            "choices":[
                "Male ",
                "Female ",
                "Hermaphrodite "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you Male, female or the horse hermaphrodite </span></div></span></div>",
            "created":1590469200,
            "id":2841487,
            "title":"Clydesdale"
        },
        "123":{
            "author_id":"gianthorse",
            "author_name":"GiantHorse",
            "choices":[
                "The Lab",
                "Another scenario "
            ],
            "content":"<div class=\"\"><div> <span>How exactly did this happen?<br>\r\n<br>\r\nThe Lab<br>\r\nIn their quest for a cure for cancer the humans did some law breaking with the animal testing law, and they made you by genetically modified your DNA and made you now longer female but a mixture of both as well as hung. You and your dick were 5 feet long, but you were 8 feet tall and only knew this boring lab.<br>\r\n<br>\r\n</span></div></div>",
            "created":1590469200,
            "id":2841491,
            "title":"Hermaphrodite "
        },
        "15":{
            "author_id":"gianthorse",
            "author_name":"GiantHorse",
            "choices":[
                "Human tf into feral horse ",
                "Human tf into  anthro horse ",
                "Anthro horse male",
                "Anthro horse female ",
                "Anthro horse  hermaphrodite "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok how about </span></div></span></div>",
            "created":1590555600,
            "id":2841646,
            "title":"Human/Anthro"
        },
        "152":{
            "author_id":"gianthorse",
            "author_name":"GiantHorse",
            "choices":[
                "Male ",
                "Female "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you Male or female </span></div></span></div>",
            "created":1590555600,
            "id":2841648,
            "title":"Human tf into  anthro horse "
        },
        "1521":{
            "author_id":"gianthorse",
            "author_name":"GiantHorse",
            "choices":[
                "A wish",
                "Teleportation accident ",
                "A virus ",
                "Test drug",
                "Other seniorios"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just how did it happen?<br>\r\n<br>\r\nWish, Teleporter accident can be herm of you want.</span></div></span></div>",
            "created":1590555600,
            "id":2841649,
            "title":"Male "
        },
        "15211":{
            "author_id":"gianthorse",
            "author_name":"GiantHorse",
            "choices":[
                "Contuine",
                "Another senerio "
            ],
            "content":"<div class=\"\"><div> <span>Today was Marks's birthday and it wasn't going well. First he let go from his job due to the job have to many employs when he knew why they let him go they found out he was a furry and they hated furrys. Second his girlfriend dumped him leaving him to pay his rent by him self. Oh yeah and he would have to move due to a change in owner.<br>\r\n<br>\r\nAt least today couldn't get worse right oh no for mark it did he found out his girlfriend had bin cheating on him and it was her new boyfriend plan for her to dump him on his birthday. When looking for a place to work and stay it was know known he was a furry and pretty much ostrichied by everyone. The only good part of the day was the shooting stars and he thought hell why not wish on them he knew nothing would come of it.<br>\r\n<br>\r\n\"I wish I was my fursona\" Mark said. Mark's fursona was solid black Mustang he every made his cock solid black, but his fursona was hyper his nuts were near his knees and his cock was near the top of his chest and was only a foot short of being as wide. After making that his wish he went to bed.<br>\r\n<br>\r\nwhen he woke up he was still a bit groggy and went to the bathroom not even noticing to clops of the hard wood floor. He slapped water over his mussel and then he realized he had one and let out a whinny closing the door for the full body. he awoke the monster of a cock that sleepied he was more shocked that him walk with his nutts as big as they were didn't set him off. His cock was now fully erect and just as big and then he was loving this new body a bit to much that if he had not he would have realized that he grew at foot taller.<br>\r\n<br>\r\nHe was test driving his new cock and in only a few minutes he blew his hot, sticky and messy load all over the bathroom not that he cared he was going to leave today skipping the lease any way. Mark look at his clothes and smiled there was no need for those now, but he knew he had to get rid of them some how or else they might put two and two together not that anyone would believe them anyway. Just as long as he keeped his cool there would be no issue.</span></div></div>",
            "created":1590642000,
            "id":2842377,
            "title":"A wish"
        },
        "152111":{
            "author_id":"gianthorse",
            "author_name":"GiantHorse",
            "choices":[
                "Yes",
                "No humans deserve what they get"
            ],
            "content":"<div class=\"\"><div> <span>Mark had go rid of his clothes by throwing them in the garbage and then he thought to himself why not blow another load of horse cum on to the sheets of the bed ruining them. After he was done with that he was hunger and another foot taller not that he noticed or if he did he didn't care. He was now 9 feet 10 inches tall and his mind drifted to thoughts of eating humans,  but why he didn't like vore. Then he looked at his new body and just realized why not try it at least once he was no longer human him self, but he did need to be smart about it.<br>\r\n<br>\r\nIf too many people when missing the cops would think they have a serial killer in their city, but if that happens he who just move citys and do it again. He was thinking about who to try and eat frist his asshole boss or his cheating ex. No he was hungry now and couldn't wait to find them so a random person in a alley would have to do. He found one sleeping and he said softly \"I'm sorry but I'm hungry and well at the very least you will be warm\" as he opened his maw and stuck the unfortunate person in. To Mark's shock this was fairly easy the person head fit and Mark started gulping them down and then got to the torso before they started snuggling and that got Mark horny, but he was forced on his prey for now he could masturbate after the person was in his stomach. Finally the person legs dangling and flaring were left and Mark pushed them in and then there was nothing left of the person except the massive bulge in Mark's stomach.<br>\r\n<br>\r\nThat was an experience that I quite enjoyed he thought to himself. The human was still trashing in his stomach and it made Mark even more horny and the human only got to hear the delighted nays of a happy horse and no the human was trashing harder making Mark's body work faster on them.<br>\r\n<br>\r\nUnlike the other times the growth did get Mark's attention as he was slowly filling the alley more and more. Now this intrest Mark if he grew so big he wouldn't need to worry about anything ever again. Wait these dark thought was he getting to much of a power trip should he think about first <br>\r\n<br>\r\n</span></div></div>",
            "created":1590728400,
            "id":2842667,
            "title":"Contuine"
        }
    },
    "info":{
        "author_id":"gianthorse",
        "author_name":"GiantHorse",
        "brief_description":"Giant Feral and Anthro Horses",
        "created":1590528240,
        "description":"<td align=\"left\" class=\"norm\">This is a story about Horses growing to giant sizes.<br>\r\n<br>\r\nGrowth can be fast or slow, But not instantaneous.<br>\r\n<br>\r\nGrowth only for the Horses please.<br>\r\n<br>\r\nShrinking is allowed,1 inch being as small as you can go; but only Horses can only shrink back to their original size.<br>\r\n<br>\r\nNot every chapter has to have growth in it. The main idea is that there is a Horse bigger than normal.<br>\r\n<br>\r\n<span style=\"text-decoration:line-through\">No fattening stuff please </span>. Go nuts <br>\r\n<br>\r\nHumans can only be male and female. Horses should be the only one to be herm, you can add a reason for the herm if you want.<br>\r\n<br>\r\nHorses can be intelligent and smarter than humans <span style=\"text-decoration:line-through\">or normal. If they are smart, please give a reason why. </span>.<br>\r\n<br>\r\n<span style=\"text-decoration:line-through\">Scat stuff is allowed, but keep it to a minimum please.</span> again go nuts with scat<br>\r\n<br>\r\nTf is also allowed but only humans into Horse, not the other way around.<br>\r\n<br>\r\nHorses can be gentle, playful, rampaging, naughty whatever you want. That's up to you.<br>\r\n<br>\r\nThe Horses cannot talk unless you give a reason why they can.<br>\r\n<br>\r\nNo rules on sexual content.<br>\r\n<br>\r\nNo rules on vore either.<br>\r\n</td>",
        "id":2222817,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1590563460,
        "modified":1590742740,
        "pretty_title":"Giant Horses"
    }
}