{
    "chapters":{
        "1":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "Aliens did it ",
                "An Ancient Hunger Awakens ",
                "Water Water Everywhere",
                "More options",
                "Get Fat with the Sickness"
            ],
            "content":"<div class=\"\"><div> <span>5 choices, 5 scenarios in which the world and its inhabitants become completely saturated with fat <br>\r\n<br>\r\n1.) Aliens looking to enslave the populous bath the planet in fattening radiation, this storyline focuses on the changes this brings about to a small picturesque town and it's inhabitants. <br>\r\n<br>\r\n2.) Somehow someone awakens an ancient slumbering elder god of Gluttony and decadence, that person is made into the Gods Avatar of Fat and tasked with spreading the Chubby Gospel, the focus is the person and their world travels/influence <br>\r\n<br>\r\n3.) A Bioweapons lab manages to have it's latest weapon testing go wrong, the explosion causes the resulting fallout to enter the atmosphere and join in with precipitation process, causing any water source in the world to be ridiculously high in calories and fattening, this storyline focuses on the resulting effects in a Big City and it's inhabitants <br>\r\n<br>\r\n4.) More options<br>\r\n<br>\r\n5.) A strange new disease called Faterus is diagnosed, those affected gain weight over time in relation to how much they eat during the initial 24 hours of infection, the gained weight can't be lost  it's airborne and passed on via gaseous expulsions of those infected, this storyline focuses on the effects of this in the suburbs of a nameless city </span></div></div>",
            "created":1368939600,
            "id":1593102,
            "title":"The World is Round"
        },
        "11":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "She gets to work, and finds it packed with customers all eating themselves silly",
                "She gets to work, it's closed but her boss let's her in for a \"light snack\"",
                "Every food place in town is giving away it's goods to anyone who wants it ",
                "as she walks to work she see's the towns residents stuffing their faces "
            ],
            "content":"<div class=\"\"><div> <span>Julie Evans woke up in the picturesque town of quaintsville U.S.A like she did every morning, bored out of her mind that she was stuck in a small town in the middle of bugger all nowhere only good for the postcard picture value it provided for those lucky enough to get to visit and leave, but while they got to leave, she imagined she would be stuck in the town for another 24 years of her life, possibly more, until either the town suddenly blew up or if she was lucky enough to meet someone who could take her away from it all, but she doubted either option would happen. <br>\r\n<br>\r\nat 24 years old, Brunette, average build with average looks, in an average town, Julie knew she had no chances of getting out of the town she was born in for more than a vacation, there was no college anywhere near worth getting herself in debt for a degree in, there was no big city to commute to and get a job in, there was just the town and everyone she'd know her entire life and the passing tourist trade that would occasionally frequent the place<br>\r\n<br>\r\nGroaning to herself as she dragged her body out of bed, she walked in her usual morning daze past her housemate and best friend since highschool, Claire Synclaire, as she was busy preparing both of their breakfasts, Claire's one passion in life being the culinary arts, and went about her morning routine as she got ready for her shift at the local diner. <br>\r\n<br>\r\nClaire was the opposite of Julie in most ways, she was content to live in the quiet town, content to stay there as well, and she was content to do so while being a remarkably beautiful blonde with large breasts and a tight well toned body, Something Julie would occasionally find annoyance with, Claire possessed most things needed to get out of this dive of a town but she didn't see the point in using them, she could of been scouted by hollywood or be off cooking in some big fancy restaurant in a big city but she was quite happy to stay where she was. but she was Julie's friend, and kept her well fed and looked after while she let Julie stay in her spare room, Claire having inherited the house from her parents when they'd moved away a few years ago to travel the world after winning the lottery, they sent back souvenirs every so often which Julie loved to look at and marvel and imagine the wonders of anywhere but where she was.<br>\r\n<br>\r\nEmerging from the bathroom, all made up and ready for the day, Julie sat down at the breakfast table, ready for whatever it was Claire had prepared for her this morning <br>\r\n<br>\r\n\"Hey Julie, good nights sleep?\" Claire asked, adding the finishing touches to breakfast <br>\r\n<br>\r\n\"yeah it was alright, yourself?\"<br>\r\n<br>\r\n\"Well, yes and no, i kept getting woken up by some weird lights outside my window, but everytime i woke up i fell back asleep again, so it was just on and off on and off...but i feel really rested, but also a little bit hungry\"<br>\r\n<br>\r\n\"I can tell, jesus you planning on feeding a pet elephant you've not told me about?\" Julie asked in surprise after breakfast in all its entirety was put out in front of her, mountains of fried bread, towers of bacon, omelettes the size of small bike tires, it all smelled so good but Julie knew she couldn't eat it all, let alone make a dent in it, and she wondered how Claire could either <br>\r\n<br>\r\n\"well...most of this was about to go out of date...so you know...waste not want not etc\" <br>\r\n<br>\r\n\"this is all gonna go to waste when we don't eat it you know\" Julie replied but still tucked into the food in front of her anyway, Claire joining her as well <br>\r\n<br>\r\nnot realising where the time had gone Julie noticed her \"you're running late\" alarm she set as a precaution for if she ever was running late go off. <br>\r\n<br>\r\n\"oh shit!! now i'm going to have to run half the way, brilliant, thanks for the meal big enough to make me late and still not be halfway done\" Julie blurted out as she headed for the door, not noticing Claire completely ignore her as she did so, so intently focused on the food infront of her that she was <br>\r\n<br>\r\nAs Julie ran down her street in hopes of catching the bus and still making it with time to spare she didn't notice the distinct abundance of food delivery cars speed past her in the road, the drivers stuffing their faces as they drove all over town<br>\r\n<br>\r\nNor did she notice what looked nothing like a cloud move across and blot out the sun for a brief moment as a flash of bright light once again bathed the town in a strange glow<br>\r\n<br>\r\nWhat she did notice was her stomach rumbling rather ravenously as she ran.<br>\r\n<br>\r\n\"oh man, still hungry and not even close to work...today's gonna be such a pain\"   <br>\r\n<br>\r\n</span></div></div>",
            "created":1368939600,
            "id":1593118,
            "title":"Aliens did it "
        },
        "111":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "The Diner begins to run out of food, Shelia closes shop so the staff can eat",
                "No more food, sent home with pay, Julie spends it at an all you can eat buffet",
                "More food arrives, the staff and customers all just dig in like pigs at a trough"
            ],
            "content":"<div class=\"\"><div> <span>Arriving at work Julies heart sank even lower, the car pack was absoloutely rammed and inside was no different, she could barely get behind the counter for the amount of people inside, each one either stuffing their faces on the food they had in front of them, staring ravenously at the food in transit to them, or just yelling their orders to the the other staff who had already shown up and were near enough sprinting back and forth to keep them satisfied and fed on time, as she got into the staff room to throw her coat on a hook and lock up her stuff her boss ran into her, not paying attention to where she was going at all, a look of stress personified on her face as she chewed down on a power bar to try and keep her energy levels up. <br>\r\n<br>\r\n\"Julie, thank goodness you're here, we're rushed off our feet, this is the busiest we've ever been, but people have kinda just stopped ordering from the menu, they've just started throwing money behind the bar and asking for food to be brought to them as soon as possible, it's insane, just go to the kitchen, pick up a plate and take it to table 2, then 3, then 4, you get the idea right? RIGHT?!\" Her boss, Shelia Jenkins, frantically yelled at her, the normally calm plump woman looking remarkably stressed and out of character <br>\r\n<br>\r\n\"sure thing boss, you alright though? you seem a bit pale?\" Julie asked, <br>\r\n<br>\r\n\"i'm fine, i'm just so very fucking hungry and can't grab a minute or a bite to eat for myself\" Shelia replied, brushing her shoulder length black hair out of her face as she walked past to get back to the front of the diner and see if she could make some sense of the chaos<br>\r\n<br>\r\nJulie walked into the kitchen, her stomach still grumbling and the smells of the cooking food only making her hunger worse, still, she grabbed a plate in each hand and began her shift, finding the entire experience the most busy overworked time of her life, she was a constant motion machine, always moving, ducking in and out of people to get food to each table as each customer continued eating and stuffing themselves, men and women all over the place where eating with such reckless abandon she would of thought it very odd if she'd found time to stand around and think while working. the rest of the servers where in the same position, like a well oiled feeding machine they worked to keep the gluttonous patrons of their diner well fed and happy as waistlines everywhere expanded and trousers began to rip and tear. <br>\r\n<br>\r\nEventually </span></div></div>",
            "created":1369198800,
            "id":1595271,
            "title":"She gets to work, and finds it packed with cust..."
        },
        "12":{
            "choices":[
                "Keiko wakes up in her bed, chubby and with her wife.",
                "Keiko regains control when she's being picked up by her wife at the airport.",
                "A starving Keiko wakes up at the dinner table with her wife."
            ],
            "content":"<div class=\"\"><div> <span>Keiko Nishimura held up her hands in supplication. After all, abandoned tombs shouldn't have people in them and the twenty six year old researcher knew this tomb held no one living except for herself and sometimes, her crew.<br>\r\n<br>\r\n\"Who are you? What are you doing here?\"<br>\r\n<br>\r\nThe figure stepped into the light then, revealing a hugely fat woman, her eyes glowing red.<br>\r\n<br>\r\n\"My name would be impossible for you to pronounce with your limited tongue. You can call me Glut and you are the lucky mortal that gets to become my Avatar.\"<br>\r\n<br>\r\n\"Why me?\"<br>\r\n<br>\r\n\"Oh, I just needed the first mortal I came across. Nothing personal, but let's get to know you better.\" The figure moved impossibly fast, a tubby hand pressing lightly against Keiko's skull. All her life flowed into Glut's brain, the being smirking as she finished. \"Well, my dear Keiko, let's get you home to your beloved Diana, hmm?\"<br>\r\n<br>\r\n\"Do whatever you want to me, but please don't hurt her!\"<br>\r\n<br>\r\n\"I'm not going to hurt anyone, Keiko. I'm just going to expand horizons and your wife will be a wonderful first time. Now sleep and when you come to you'll be with your Diana again.\"<br>\r\n<br>\r\nKeiko passed out a moment later, thoughts of Diana the last thing she was aware of.</span></div></div>",
            "created":1368939600,
            "id":1593124,
            "title":"An Ancient Hunger Awakens "
        },
        "121":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "As she sleeps, Glut visits her in a dream, in a vision of gluttony and fattening",
                "she wakes up to find her and her wife in a strange fat dreamscape with Glut",
                "when she leaves for japan she mentions Glut to Diana, who researches the name"
            ],
            "content":"<div class=\"\"><div> <span>Keiko woke up with a sudden jolt and in a cold sweat, looking around she realised she was somehow back in her bed, the usual comfort of this being outweighed by the distressing fact that the last time she was awake she was in another timezone on the otherside of the world in a dig site she was still supposed to be at, she heard her wife wake up next to her, shaken away by Keiko's sudden moves <br>\r\n<br>\r\n\"what is it dear....go back to bed\" Diana moaned softly, as she planted a kiss on Keiko's gut <br>\r\n<br>\r\nKeiko soon realised there was something even more odder going on at this realization, she'd never had a gut before in her life, she'd always been a trim fit archaeologist, that's how she'd met her wife, the two of them going to the same college and studying the ancient historys of the world, She was always into the practical side of things while DIana was the theoretical, Her red headed counter part more at home with her head in a book then in a dank musky old tomb.<br>\r\n<br>\r\n\"Diana, what am i doing here, why do i have a gut, what's going on\" Keiko began to panic, Diana's embrace soon calming her down<br>\r\n<br>\r\n\"ssshhh dear, what're you talking about, you got home a week ago, the dig went well, you found something shiny and gave it to a museum to fund your next trip, you'd celebrated a bit too much in Peru and on the plane and when you got home, that's why you've got a jiggly little gut, calm down, you'll do what you always do, burn it off and go to your next adventure, your off to japan next week remember, something about a hidden temple in the....zzzzzzzzzz\" Diana had fallen back asleep, her head resting between Keiko's plump breasts as she dozed off <br>\r\n<br>\r\nKeiko was still worried, she remembered none of what had happened, all she remembered was a bright light and some big fat woman thing, or so she thought, maybe she had just been working too hard, maybe her wife was right, either way she couldn't worry about it with Diana looking so cute asleep resting against her, she kissed her wife on the forehead and lay back down to sleep, careful not to wake her wife up as she did so. </span></div></div>",
            "created":1368939600,
            "id":1593138,
            "title":"Keiko wakes up in her bed, chubby and with her ..."
        },
        "1212":{
            "choices":[
                "Keiko has an urge to make a huge breakfast, all for Diana.",
                "Diana's feeling starved and makes a pig of herself at breakfast.",
                "Diana decides she'll gain weight to console Keiko."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, Keiko, get up.\"<br>\r\n<br>\r\nOpening her eyes, Keiko found that she wasn't in her bed anymore. She wasn't apparently on Earth anymore judging by the green sky and large, alien, temple she found herself in. <br>\r\n<br>\r\n\"Hey Keiko, this is a weird dream, huh?\" Diana was right beside her and before the both of them was Glut, beaming at the pair.<br>\r\n<br>\r\n\"Hello you two. Tell me, are you hungry?\"<br>\r\n<br>\r\nDiana nodded, a hand going to her trim stomach, Keiko's own gut rumbling.<br>\r\n<br>\r\nGlut waved a hand, a feast appearing before their eyes. Diana dove in, stuffing her face like the proudest of pigs, a ripe fart easing out of her rear as her butt ripped through the back of her pants, followed by the rest of her body billowing outwards.<br>\r\n<br>\r\nKeiko wasn't far behind, soon plopping on her butt and bringing more and more food to her mouth, belches and farts ringing out from the married couple as they gorged and gorged.<br>\r\n<br>\r\nGlut looked on, a proud smirk on her face. Waddling close, she kissed Keiko on the lips and Diana shortly afterwards.<br>\r\n<br>\r\n\"That's it. This is just a fraction of what you'll look like after my influence is alive in the world again. You two will always be the biggest and Keiko, you will be my lovely Avatar. Now it's time to wake up and get some empty calories into your lovely wife here, Keiko.\"<br>\r\n<br>\r\nA blinding flash followed and Keiko woke up in her bed, Diana hugging her tightly, still sleeping.</span></div></div>",
            "created":1368939600,
            "id":1593143,
            "title":"she wakes up to find her and her wife in a stra..."
        },
        "12122":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "After Breakfast Aftermath, Glut appears before them again",
                "Keiko goes to read the findings, to try and find a clue about what was happening"
            ],
            "content":"<div class=\"\"><div> <span>Drifting back to sleep Keiko was woken a few hours later by the smell of bacon wafting through the house, bacon amongst other things, as she walked downstairs, not noticing the extra parts of chub that adorned her figure that hadn't been there last night she opened the kitchen door and was greeted by a rather odd sight. <br>\r\n<br>\r\nat the table was a mountain of food, Plates of french toast, fried bacon, scrambled eggs, stacks of pancakes drenched in syrup, omelettes the size of hub caps, if it was greasy or fattening and breakfast food, it was on their kitchen table, and sat down, making a pig of herself was Diana, anything that was within arms reach was getting devoured <br>\r\n<br>\r\n\"Diana dear...how long have you been awake for?\" Keiko asked, the smells of the kitchen getting her mouth watering but the unease of the gap in her memory and last nights dream keeping her level headed enough to not join her wife in gorging herself silly <br>\r\n<br>\r\n\"Dunno..bout 3 hours...had a weird dream...can't talk now...eating...got that big seminar today..need strength\" Diana managed to blurt out between gigantic bites and chewing the ever diminishing pile of food that was in front of her<br>\r\n<br>\r\n\"unless the department has a new bear fighting policy on seminar's don't you think this is all a bit overkill on the strength needing side of things?\"  Keiko tried to make light of the situation, not noticing her hand drift towards a lone doughnut as she absentmindedly got to work on a pile of them opposite Diana<br>\r\n<br>\r\n\"if you're worried i'm eating your half of breakfast don't be, yours is over there\" Diana mentioned rather defensively, getting annoyed that her wife was interrupting her breakfast and not even indulging in what she'd made her, she didn't even register this as unusual thinking, the two usually far too busy with other morning activities to make something this big for breakfast, or any other meal. <br>\r\n<br>\r\nKeiko turned around and saw the spare table from the dining room had been brought into the kitchen, and adorned with just as much food if not more than what Diana was currently munching away on, She would of questioned Diana further but she just felt so resoundingly hungry...<br>\r\n<br>\r\nThe sound of the fax machine in her office distracted her long enough to realize that while she might not remember what happened to her recently, she would still of written down her findings, this would be the academic copy coming through now, even then her notes would be all over the office for her to read and maybe work out what was going on. </span></div></div>",
            "created":1369026000,
            "id":1593427,
            "title":"Diana's feeling starved and makes a pig of ..."
        },
        "121221":{
            "choices":[
                "Helps feed Diana, starting the process of weight gain ",
                "Goes through more mental changes, including increased slobbiness and horniess"
            ],
            "content":"<div class=\"\"><div> <span>As Keiko makes her way over to the fax machine, she is stopped by a flash of bright light as Glut once again appeared before Keiko. Diana was too busy stuffing her face to notice the appearance of the big beautiful goddess, but Keiko could not help but stare. A lustful desire entered her brain, never before had she felt such strong sexual feelings for another person. Not only to be with her, but to be like her as well. Glut touched her hand on Keiko's shoulder and spoke directly into her mind.<br>\r\n<br>\r\n\"You and I are becoming one in the same, slowly your body is being changed and morphed to better fit in my image\"<br>\r\n<br>\r\n\"You mean...I can be just like you\" Keiko thought with wide puppy dog like eyes<br>\r\n<br>\r\n\"Not just like me..you will become my Avatar, my Representative on this earthly plane. our fattening influence will spread across this earth and turn it into an obese paradise, when enough people follow in our teachings and way of life i will be able to ascend from this astral plane onto earth, and rule the fattened world with you and your wife by my side. In order to truly fulfill my mission, I need you to spread the gospel of Chub to the masses all over the world. However, I will not cast such a daunting task on you just yet. Your first job will be to convert your lovely wife Diana into the first disciple. As you can see, I've already laid the foundations but there is still much work to be done. When I am finished with this conversation, your body will be complete in its physical transformation. You will be as large and sexually irresistible as I. You will not realize it because to you it will be as if you have always been that way. While physically your transformation may be complete, mentally you will still be changing. That takes a little while longer than the physical part. I have changed one aspect of your past to make it easier for you to convert others, notice how your wife is beginning to struggle with her binging, your influence and touch will cause any food being digested to be converted straight into fat. This should make it easier for you to pack on the necessary pounds that a disciple of Chub should have, we don't want any pesky tummy aches getting in the way of our mission do we?\"<br>\r\n<br>\r\nKeiko just shook her head no as she continued to stare at the large and drooping breasts of Glut.<br>\r\n<br>\r\n\"Good, now in a moment I will be gone. It will be as if I was never here. Let me give you a kiss goodbye.\"<br>\r\n<br>\r\nGlut leans down and locks lips with Keiko, initiating the transformation. Keiko's already slightly flabby body starts swelling with fat, as her stomach grows and sags down becoming quite the spare tire. Her boobs swell three sizes and droop down resembling Glut's which Keiko was so enamored with. Her ass, however, goes through the greatest changes, growing into a huge booty full of cellulite, hugging her panties until they are nothing more than a thong. By the time the transformation is over, Glut is gone and Keiko starts rubbing her head confused as to what she was just doing.<br>\r\n<br>\r\nShe looks back over at her wife, who has made quite the dent in her breakfast. Keiko notices all of the stains and crumbs on Diana's shirt and feels a large feeling of lust come over her. Part of Keiko knows that this is wrong, that she hasn't always been this large but that small voice in her brain is quickly shut down by her own hunger and horniness. As Keiko begins waddling over to her wife she..</span></div></div>",
            "created":1369026000,
            "id":1593447,
            "title":"After Breakfast Aftermath, Glut appears before ..."
        },
        "1212211":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "she's happy with her change and new weight of 450 pounds, she's horny as well",
                "the reality altering isn't working yet as they remember and miss being skinnier"
            ],
            "content":"<div class=\"\"><div> <span>As Diana began to struggle with the volume of food contained within her stomach, Keiko leaned over and began to rub her wifes taught tummy, letting out a soothing whisper into her ear <br>\r\n<br>\r\n\"It's fine dear, just keep eating, i'll help you fatten up\" she whispered sensually, Diana's look of distress and discomfort dissolving from her face as she renewed her efforts against the food mountain in front of her, slowly and steadily stuffing herself with whatever was within reach, Keiko helping bring more tasty treats to her waiting lips between bites to make sure her wife was constantly stuffed, <br>\r\n<br>\r\nas the mountain of food began to disappear more pounds began to pile onto Diana, her belly flowed out from her middle, covering her lap as her thighs and breasts plumped up along with them, every time she began to feel discomfort Keiko would rub her belly and the unease would melt away into additional pounds on Diana's figure. <br>\r\n<br>\r\neventually a good hour and a half of constant stuffing later Diana was blissfully glutted and content with herself and her wife as the pair leaned in for a make out session that helped begin to ease the sexual tension that had been building between them as Keiko had teased Diana throughout the stuffing session, breaking apart Diana slowly wobbled and rose to her fattened feet to find herself a lot heavier then she'd been a few hours ago </span></div></div>",
            "created":1369112400,
            "id":1594545,
            "title":"Helps feed Diana, starting the process of weigh..."
        },
        "12122111":{
            "choices":[
                "When they wake up They begin their fattening mission by visiting friends",
                "As they sleep Glut gives them both an added boon for their loyalty "
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size35\" style=\"\">BRAAAAP</font> Diana belches as she wipes the food crumbs off of her face. She looks down at her new voluptuous figure, a smile crosses her face. Proud of what she had accomplished. However, a small voice whispers in her head that something's not right but that thought leaves her as soon as she lays eyes on Keiko. Keiko, now weighing in at a cool 520 pounds although to Diana she had always been this way. As new memories begin shaping in her head, she remembers playfully teasing Keiko for her large appetite and obese body while Keiko would in turn tease her for her laziness and inability to find a job. Now that Diana was obese herself, she realize that there was nothing to tease about. That the only way to be in life was to stuff your face until you can't stuff your face anymore. She finds herself getting horny just thinking about how much fatter she will get as she waddles over to where Keiko is standing.<br>\r\n<br>\r\n<font class=\"size35\" style=\"\"><b>BRRRAP</b></font> Diana burps again, not even bother to excusing herself as a drunken look comes over her face. Without saying a word, she pulls Keiko over to her as they lock lips in a passionate kiss. Their large bellies and drooping breasts smooshing into each other. Diana grabs a hold of Keiko's fat ass and squeezes as Keiko lets out a moan. Keiko pulls Diana to the bedroom, and proceeds to lay down on the bed. Diana, tears off the tattered remains of her clothes as she helps Keiko to remove her huge panties. She lowers her head to Keiko's pussy, making extra care to hold her huge gut up. As she begins the process of pleasuring Keiko, Keiko could hear the whisperings of Glut in her ears as she congratulated her on a job well done. Diana lifts up her head, her eyes looking more glazed than before with a huge smile on her face. She is now the first disciple and her mental transformations have only just begun to take place.<br>\r\n<br>\r\nThe day progressed with the couple teasing and pleasing each other as they explored their new fattened bodies, eventually the two collapsed into a sweaty pile of flab and gluttonous lust on their bed, passing out from the pleasure of it all, Glut looking on from the astral realm in amusement.<br>\r\n<br>\r\n</span></div></div>",
            "created":1369112400,
            "id":1594728,
            "title":"she's happy with her change and new weight ..."
        },
        "121221111":{
            "choices":[
                "The three of them begin searching for other followers",
                "Mallory's intelligence comes back and she challenges Keiko Glut for ruling."
            ],
            "content":"<div class=\"\"><div> <span>    Keiko wakes up to find her room is a mess with empty boxes of pizza and dirty clothes strung out over the place. A strange voice in her head seems to be saying that something is not right, her room is usually spotless but she shakes it off as nothing as Glut's reality morphing magic begins to take hold again. She turns to her wife, loudly snoring next to her and smiles. Her wife Diana who used to be rail thin only a day ago is nearly as large as Keiko now, lying naked with her round ass bare and uncovered. Keiko smacks it to wake her up.<br>\r\n<br>\r\n\"Come on sleepyhead, it's time for breakfast.\"<br>\r\n<br>\r\nDiana just groans and lets out a tiny little fart which causes Keiko to laugh. As they both get up and slowly waddle their way out of bed, Glut appears in a cloud of smoke before them. Keiko and Diana bow before the voluptuous goddess who waves her hand for them to stand up.<br>\r\n<br>\r\n\"I am pleased with the progress my avatar and disciple have been making, however some further changes need to be made.\" I can no longer allow you two to be in a relationship, Glut has no need for partnership only followers.\"<br>\r\n<br>\r\nKeiko begins to protest as she grasps tightly to her wife. \"I will not have you take her away from me. I love her.\"<br>\r\n<br>\r\nGlut laughs in respons. \"Oh no, she will still be with you as your most loyal follower. Willing to do whatever she can to please you but I have bigger plans for you and you must have faith. I can see now that I must hasten the changes if we want to re establish my rule. I must merge with you, you will understand completely soon enough.\"<br>\r\n<br>\r\nGlut places her hand on Keiko's shoulder as a ripple of pleasure rushes through her body unlike anything she has felt before. Her eyes glaze over and she looks up at Glut.<br>\r\n<br>\r\n\"Is this what you desire?\" Glut asks<br>\r\n<br>\r\nKeiko nods her head<br>\r\n<br>\r\n\"Good, then you are ready\"<br>\r\n<br>\r\nGlut leans over and kisses Keiko as her spirit dissolves into Keiko's body. Keiko lets out an orgasmic moan as her body expands another 100 pounds. Her stomach rolling over itself, her breasts increasing in size and sagging down, her ass doubling in size, sweat pouring out of her body. As Glut's mind melds with Keiko, their personalities merge into a hybrid. They have become an entity known only as Empress Keiko-Glut.<br>\r\n<br>\r\nAs the blue smoke clears and the astral plain lifts Keiko Glut smiles.<br>\r\n<br>\r\n\"It has begun.\"<br>\r\n<br>\r\nA haze falls over Diana's mind, unsure of what she experienced. She turns to the new Keiko Glut and whispers.<br>\r\n<br>\r\n\"Keiko was I dreaming\"<br>\r\n<br>\r\nKeiko Glut pulls Diana over and kisses her. The fog in Diana's mind grows thicker as her reality is warped yet again. All her thoughts and ambitions are replaced with a desire to please Keiko Glut. To grow fatter and larger and provide her with nothing but pleasure.<br>\r\n<br>\r\n\"Oh Empress what can I do to please you.\"<br>\r\n<br>\r\n\"You can start by getting your fat ass into some clothes and make us a feast. You will be rewarded today for your loyalty. I will be giving you a lover and our second disciple. Do you remember our friend Mallory?\"<br>\r\n<br>\r\nDiana nods her head as she slowly smiles realizing what the Empress has planned.<br>\r\n<br>\r\n\"Good, now help me up. We have work to do.\"<br>\r\n<br>\r\nAfter a lengthy breakfast of a pound of bacon each and a dozen eggs, Keiko-Glut and Diana set off for Mallory's house without bothering to clean up after themselves. Keiko-Glut uses her magic to remove the crumbs and food stains but instructs Diana to not clean up for her amusement.<br>\r\n<br>\r\nThey reach Mallory's house and knock on the door. Mallory opens the door with a confused look on her face. Mallory is a 24 year old woman who has been friends with Diana for many years. She has plain brown hair with an average body and cute smile. She is fiercely intelligent and a loyal friend but has often been sceptical of Keiko and Diana'a relationship in the past. She has never liked Keiko much, thinking of her as a show-off who isn't as smart as she claims to be. Using nepotism to get to the top of her archaeology firm. Keiko has always known this but has kept quiet since Diana and Mallory were such good friends. Now with her mind merged with Glut's Keiko Glut wants to use this oppprtunity for revenge.<br>\r\n<br>\r\n\"Um hi Diana...Keiko. What brings you over?\"<br>\r\n<br>\r\nMallory can tell something is amiss, while the reality warping magic has caused her not to wonder about the size, she is perplexed at Diana'a slob like appearance and can't put her finger on her unease.\"<br>\r\n<br>\r\n\"We just wanted to stop by and say hello\"<br>\r\n<br>\r\nKeiko Glut and Diana waddle their way through the door. Keiko Glut sits on the reclining chair like a throne. Her excess body weight spilling over the chair. Mallory sits down on the couch while Diana smashes in next to her. A foul sour smell of sweat and body odor fills Mallory's apartment. Mallory involuntarily crinkles her nose at this causing Keiko Glut to snap.<br>\r\n<br>\r\n\"Does something smell bad Mallory?\"<br>\r\n<br>\r\n\"Oh no, it's nothing.\"<br>\r\n<br>\r\n\"Because I could have sworn you were implying my discip...err wife smelled bad\"<br>\r\n<br>\r\nDiana feigned a overexaggerated shocked look of hurt<br>\r\n<br>\r\n\"Do you think I smell bad Mallory\"<br>\r\n<br>\r\n\"No, no I would never do that, you are my friend.\"<br>\r\n<br>\r\n\"Well if you want something to smell bad we can arrange for that\"<br>\r\n<br>\r\nAlmost as if on cue Keiko Glut and Diana released a synchronized fart that almost shook the house causing Mallory to nearly gag.<br>\r\n<br>\r\nMallory was just about to protest when she felt a strange sense of arousal for Diana and a sense of overwhelming admiration for Keiko, not to mention an intense hunger.<br>\r\n<br>\r\n\"Very funny guys, is anyone else as hungry as I am?\"<br>\r\n<br>\r\n\"In fact we are\" Keiko Glut said licking her lips<br>\r\n<br>\r\n\"What can I make for you?\"<br>\r\n<br>\r\n\"Oh can you make us five hamburgers, three hot dogs, a pound of fries and a large sundae each? Just a light snack\" Diana asked.<br>\r\n<br>\r\n\"Umm I'm not sure I have that much food.\"<br>\r\n<br>\r\n\"Of course you do, it's all on the table behind you.\" Keiko Glut said as she subtly used her magic to make the food appear. \"But I actually don't feel that hungry anymore so you're more than welcome to help yourself.\"<br>\r\n<br>\r\nMallory turns around and gasps. How the hell did that happen she thinks. Before she questions it further her stomach lets out a huge growl.<br>\r\n<br>\r\n\"I suppose a few bites won't hurt.\"<br>\r\n<br>\r\nMallory walks over to the table and sits down. She gingerly picks up one of the burgers and takes a bite. Her eyes immediately grow wide with hunger as she begins taking huge bites out of the burger before shoving it in her mouth. She jams hot dog after hot dog down her mouth getting ketchup all over her fast. All the while Keiko Glut'a magic is taking effect on her body. Mallory's gut bursts out of her shirt, popping the button on her jeans. Her face grows a double chin, while her arms grow massive and flabby. By the time she reaches the two sundaes, she doesn't have the energy to get up dummy the table and get it on the other side.<br>\r\n<br>\r\n\"Uhh guys, I have a weird request. Can one of you get up and pour the ice cream down my throat?\"<br>\r\n<br>\r\n\"Oh, I will!\" Said Diana<br>\r\n<br>\r\nDiana wiggles out of the couch and waddles over to the waddle and picks up the ice cream. She waddles back to Mallory and begins pouring it into Mallory's mouth getting chocolate sauce all over her face and shirt.<br>\r\n<br>\r\n\"Geez Mal and I thougt I was the slob.\"<br>\r\n<br>\r\n\"You are Diana and I hereby christen you High Priestess of Slob and Mallory your loyal lover and follower and my personal servant.\"  Keiko Glut exclaims.<br>\r\n<br>\r\n\"What the fuck are you talking about?\" Mallory manages to choke out in between drops of ice cream.<br>\r\n<br>\r\n\"You heard her, and to make sure that big brain of your's doesn't get in the way, Diana it's time.\"<br>\r\n<br>\r\nDiana sets the ice cream down and removes her pants. She lowers her giant ass into Mallory's face and lets out a huge rancid fart that rattles the windows.<br>\r\n<br>\r\n\"We will have so much fun together Mallory, the Empress told me you may even get to massage her stinky feet.\"<br>\r\n<br>\r\nAs the gas seeps into her brain, Mallory finds her intelligence slowly filtering out only to be replaced by thoughts of sex with Diana, pleasing Keiko Glut and stuffing her face.\"<br>\r\n<br>\r\n\"Uhh, I no gots much brains but I gots lots of talents like this to please Empress\" the dopey Mallory said while unleashing a loud burp right into Diana's face.<br>\r\n<br>\r\n\"Excellent, you will make a great servant. You too go have fun for awhile, there's still work to be done.\"<br>\r\n<br>\r\n\"Yes Empress!\" They both exclaim as Diana pulls the now huge and ice cream and ketchup stained Mallory in for a kiss.\"<br>\r\n<br>\r\n\"Yummy, your lips taste like ice cream.\" Diana says as she sits on top of Mallory and begins making out with her while Keiko Glut smiles in amusement.</span></div></div>",
            "created":1481917440,
            "id":2250834,
            "title":"When they wake up They begin their fattening mi..."
        },
        "121221112":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "She and Diana both wake up ravenous, they hit up the food court at the mall ",
                "Keiko starts to wonder what she's being turned into, Diana goes food shopping"
            ],
            "content":"<div class=\"\"><div> <span>stirring from her sleep, for the second time in as many nights Keiko found her and her wife in Glut's dreamscape again, her wife already chowing down on the dream buffet that stretched before them<br>\r\n<br>\r\n\"why are we here again?\" she asked<br>\r\n<br>\r\n\"well my lovely servant, while the two of you might of succumbed to my will so easily, i'm not so niave as to think the whole world will ,that's why i'll be granting you and your wife a special boon, one my old followers in the times lost to your world used to have, an ancient gluttony based magic that will help you draw others to our fattening cause\" Glut told her, stroking Keiko's stomach as she did, before snapping both her fingers and enveloping the two in a bright light<br>\r\n<br>\r\n\"now, a brief demonstration, Diana here seems to be getting into the swing of things so i'll demonstrate through her\"<br>\r\n<br>\r\nKeiko was beginning to get a little bit worried<br>\r\n<br>\r\n\"now whenever the two of you stuff yourselves up, you'll be able to not only influence others around you to do the same thing, but you'll be able to store up the excess poundage and digestive discomfort that might come with such casual gluttony\" Glut explained as she motioned towards Diana's rapidly expanding belly, which soon began to envelop the rest of her body, giving her a vast almost spherical appearance, Diana barely noticed herself, so intently focused on the expanse of food before her she was still shoveling into her mouth<br>\r\n<br>\r\n\"but of course, all of this build up has to go somewhere, so, once either of you reach a certain...fullness...shall we say\" Glut continued, as Diana began to resemble a parody of gluttony, her body had swollen out to be almost spherical in shape, with her legs and arms sticking outwards from the shins and elbows, allowing her some limited mobility and eating capabilities., her face began to contort as she started to feel something build up within her <br>\r\n<br>\r\n\"this will happen\" <br>\r\n<br>\r\nKeiko rushed over to her wife to comfort her, fearing what Glut would do, when she'd waddled up next to her bloated fat wife Diana let rip one of the biggest, nastiest bouts of flatulence from her rear either of them had ever seen, deflating as she did so, the gas emanating from her ass visible to the eye. as Keiko breathed it in she felt herself grow more and more hungry, losing her will to the joys of gluttony as she began to join her wife in feasting on the food in front of them.<br>\r\n<br>\r\nGlut snapped her fingers again, Diana dissapeared from the Dreamscape while Keiko remained, snapped back to her senses<br>\r\n<br>\r\n\"so, do you see how good i am to you, making your task a much simpler one with this lovely spell of mine, now go, go and spread my influence my avatar, i grow tired of being stuck in this astral plane, remember, the fatter the world gets, the easier my return will be\" <br>\r\n<br>\r\nKeiko nodded as Glut kissed her on the lips, waking her up from her slumber </span></div></div>",
            "created":1371358800,
            "id":1612070,
            "title":"As they sleep Glut gives them both an added boo..."
        },
        "1212211122":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "Becky comes back with bags of greasy fast food, a \"light snack\" for keiko",
                "Keiko discovers a bit more about Glut's past and legends from her findings "
            ],
            "content":"<div class=\"\"><div> <span>Waking up with a jolt, Keiko looked around their room, Diana was just beginning to wake up as well, her stomach rumbling with anticipation for the day ahead <br>\r\n<br>\r\n\"hey dear, we really did a number on the fridge yesterday, i'm gonna go food shopping, anything you really want?\" she asked as she rubbed Keiko's vase belly <br>\r\n<br>\r\n\"surprise me\" Keiko replied quickly, kissing her wife in return, as she hurried to rise out of bed as quickly as her fat body would allow, \"i've got to go to the office today and check some records\" <br>\r\n<br>\r\n\"oooh, but what ever will i do if i'm stuck all home alone\" Diana moaned, with a grin on her face as she jiggled her own belly for effect \"all the food will be gone from boredom\" she joked<br>\r\n<br>\r\neventually, after getting dressed the pair both set off on their seperate errends for the day, Diana's mouth watering at the thought of the food waiting for her and the feast when she got it back home<br>\r\n<br>\r\nKeiko however had other plans<br>\r\n<br>\r\n\"i've got no idea what's coming over the two of us, but last night's dream was just too freaky, i need to understand this situation a bit better\" she thought to herself, careful not to air her thoughts out loud, while she was still finding it somewhat hard to believe that an ancient fat elder goddess was turning both her and her wife into her messengers on earth, she didn't want to risk annoying said deity.<br>\r\n<br>\r\nPulling into her parking space at the university and waddling from her car to the lab she noticed the amount of looks she wasn't getting, almost as if everyone around her was used to her being a 400 pound plus whale, eventually, huffing and puffing, still not used to the weight she was carrying, she got to her office, asking her receptionist Becky to pull up any information from the last dig they where on that wasn't already in her files on her desk<br>\r\n<br>\r\n\"let's get to the bottom of this\" keiko thought to herself, her stomach roaring at her in protest, she hadn't eaten since she woke up and she was beginning to feel a building hunger, buzzing Becky's extension on her phone she asked her receptionist to bring back a light snack with her from the vending machine as well </span></div></div>",
            "created":1372568400,
            "id":1620495,
            "title":"Keiko starts to wonder what she's being tur..."
        },
        "12122111222":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "She gets there, the rest of her team are fatter than she is ",
                "Meanwhile, Diana's adventure at the foodcourt "
            ],
            "content":"<div class=\"\"><div> <span>as she grazed away on the light snack of greasy fried chicken wings and deep fried pork rinds that Becky had brought to her as \"light\" snack (\"damn how much am i going to need to eat now, this isn't even making a dent in my hunger\") she browsed her way through the findings from the dig site, methodically going over every finding, every photo and every recorded instance of abnormality on site, from the start of the research she found nothing worth noting, just the usual fertility statues and the wall murals depicting the usual images for big harvests and bigger women. <br>\r\n<br>\r\n\"this is going nowhere\" she thought to herself, her belly growling in frustration at both the lack of anything that could give her a clue into what was going on but mainly due to the lack of food it was supposed to be getting. <br>\r\n<br>\r\n\"Arrgh and THIS!!\" Keiko groaned outloud as she jiggled her vast flabby belly up and down \"isn't helping either\" <br>\r\n<br>\r\njust as she was about to give up her search and resign herself to cafeteria to comfort eat herself into a stupor her email pinged her a notification. the subject line simply reading \"Gap in your memory?\" <br>\r\n<br>\r\nopening the email Keiko read it's contents <br>\r\n<br>\r\n\"Dr Lang, <br>\r\n<br>\r\nFor some reason the rest of us who where on the latest dig can't seem to piece together the events of march 23rd, all we can remember is that it was the day we where going to excavate the antichamber, then we all remember nothing for another 3 days back over here, but we have findings to show for those days, but no memory of discovering them or indeed recording them, <br>\r\n<br>\r\nIf you feel you could shed some light on the situation we'll be meeting in meeting room 2B later today to discuss further <br>\r\n<br>\r\nKind regards <br>\r\n<br>\r\nDr Penny Clark\" <br>\r\n<br>\r\nthe more Keiko thought about it the more she realised she did have a massive gap in her memory, she couldn't think what had happened, they where going into the anti chamber then she was in bed with her wife. if it had happened to the rest of her team as well maybe they could shed some light on the situation. or at least see if they remembered her thinner <br>\r\n<br>\r\nWaddling out of her office Keiko made her way towards the meeting</span></div></div>",
            "created":1376024400,
            "id":1643289,
            "title":"Keiko discovers a bit more about Glut's pas..."
        },
        "121221112221":{
            "choices":[
                "She felt sorry for them and used her new powers to slim them down...",
                "She hears Glut's voice and increases their appetites tenfold..."
            ],
            "content":"<div class=\"\"><div> <span>When she arrived at meeting room 2B, squeezing her pudgy frame through the doorway, Keiko saw the rest of her team waiting for her. Her jaw dropped as she looked around the room and set her eyes on a group of very large, very round young women. They had clearly undergone similar changes to herself and Diana, and she wondered if Glut had spoken to them as well...but that didn't seem right, she had chosen Keiko as her avatar. <br>\r\n<br>\r\nThe others were even bigger than she was. Doctor Penny Clark, her closest colleague, had somehow managed to squeeze herself into a pair of sweats that were ridiculously tight, revealing the expanse of her huge, flabby gut, while her huge butt cheeks overflowed her pants. Alicia, the once nubile blonde who served as their cartographer, was slightly smaller then Penny, but not by much; she was wearing what looked like a sheet wrapped around her five hundred pound body. The third member of the team, Liza, was the biggest of all, and sat on the floor with her titanic belly in her lap, her clothing in tatters. <br>\r\n<br>\r\n\"Wh...what...\" Keiko stammered, surprised by their bloated appearances. <br>\r\n<br>\r\n\"Something happened to make us all like this...but nobody else seems to remember!\" Penny said, waddling towards Keiko. \"They've all treated us as though we were always this big.\"<br>\r\n<br>\r\n\"We have to find a way to change baaaaaaaaaaack...\" Alicia moaned. <br>\r\n<br>\r\n\"It all happened so fast...as soon as I got home, I fell asleep and woke up with an extra hundred pounds!\" Liza said, her voice sounding deeper than it used to. <br>\r\n<br>\r\n\"So...none of you know why this is happening?\" Keiko asked. <br>\r\n<br>\r\n\"Not a clue, but it certainly isn't normal!\" Penny replied. \"It must be something to do with the antichamber. We have to find out why this is happening before it's too late.\"<br>\r\n<br>\r\n\"I don't want to be like this anymore,\" Liza moaned, tears streaming down her puffy cheeks. \"I can hardly move!\"<br>\r\n<br>\r\n\"Me either,\" Alicia said. \"I seem to be getting bigger by the hour. Pretty soon I'm worried I might be too big to move around at all.\"<br>\r\n<br>\r\nAs Keiko looked around at her colleagues...</span></div></div>",
            "created":1376802000,
            "id":1648056,
            "title":"Fat team"
        },
        "1212211122212":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "The fattening cafeteria feast and it's aftermath of answers ",
                "Glut decides to visit Diana and \"play\" with her "
            ],
            "content":"<div class=\"\"><div> <span>While she was looking around speechless at her team that she'd somehow managed to lead on the most fattening adventure of their lives that they remembered nothing about Keiko Groaned in annoyance as she realized the others had frozen mid conversation and a fog had begun to form in the room, slowly, waddling out from the mist Glut made herself known <br>\r\n<br>\r\n\"well well, you have been naughty my little avatar\" Glut grinned as she rubbed Keiko's belly, the latter unable to suppress a moan of pleasure at the goddesses touch <br>\r\n<br>\r\n\"trying to find out what's going on, trying to look a gift god in the mouth and brain storming when you should be out eating and expanding your waist lines. this isn't why i gave you all my blessing. not at all\" <br>\r\n<br>\r\n\"gave us all?\" Keiko asked, her mind still starting to cloud over at the fat goddesses touch <br>\r\n<br>\r\n\"oh yes, why just send back 1 Avatar when i could send back several, but i had to sure which one would be the best, you're currently winning\" <br>\r\n<br>\r\n\"What?!\" Keiko couldn't believe what she was hearing, her body was being bloated up beyond recognition and she wasn't even the supposed \"chosen one\" after all <br>\r\n<br>\r\n\"well look around, Liza's been stuffing herself silly, she's not spared any thought for anyone else,\" Images of Alicia in various stages of obesity flashed in front of the pair of them, her vast expanse of fat rolls jiggling as they expanded and burst through her clothes leaving her as the barely mobile blob that sat in front of them. <br>\r\n<br>\r\n\"Penny's been trying to exercise of all things!! she hasn't even enjoyed or splurged out once with my gift\" Keiko stiffled a giggle at the sight of Penny in the same sweat pants sprinting like a woman possessed on the treadmill as her figure just kept plumping up against her will. <br>\r\n<br>\r\n\"and the other one, Alicia, she's just been too busy lusting after herself\" Glut finished as she gave Keiko a rather interesting peep show of Alicia glutting herself while playing with her body as it fattened up around her <br>\r\n<br>\r\nall of these images faded away as Glut turned to face Keiko, giving her a soft kiss on the stomach as she did<br>\r\n<br>\r\n\"you're the only one whose shared my gift and enjoyed it with someone else, you and your wife are rapidly proving to be my new favourite play things and you'll only stay that way if you keep doing what your doing, you didn't discover the parts of my temple that showed what happened to those who squandered and wasted my gift did you\" Glut finished rather menacingly, the first time Keiko had seen her do so, \"you wouldn't want anything bad to happen to you or your wife now would you?\"<br>\r\n<br>\r\n\"What do you mean!? what happened when we released you! why don't we remember anything? What do you mean happen to Diana?\" Keiko was beginning to realize how out of her depth she actually might be, she'd released a fattening god of weight gain and gluttony and she was antagonizing her, she could think of smarter things to do with her time<br>\r\n<br>\r\nGlut's grin widened into a hearty smile as she laughed and jiggled Keiko's belly, causing her whole body to shake <br>\r\n<br>\r\n\"so many questions but so little done to get an answer my little one, maybe i'll tell you if you start doing your job as an avatar, you might be in the lead of my little contest but you could fall behind, I just came to you to have this conversation first, maybe i'll have it with one of the others next, maybe they'll do something for me that you wouldn't and you catch the raw end of a very bad decision\" <br>\r\n<br>\r\nKeiko shivered in slight fear, she turned to face Glut and began to nod her head <br>\r\n<br>\r\n\"ok, i'll do what you want, i'll start right now, but after that you tell me some answers\" she stammered before firming herself a bit \"but if you even think of hurting my wife, you'll have all of eternity to regret it\" she ended, her chunky face hardening somewhat in an attempt to threaten the deity that had complete control over her <br>\r\n<br>\r\n\"Oh you are adorable\" glut laughed as she rushed in to kiss Keiko on the lips, snapping her out of her trance and back into the real world <br>\r\n<br>\r\n\"I mean what even happened to us over there?!\" Liza finished, rubbing her lowermost belly roll as it grumbled in hunger finishing the conversation that Keiko had just missed out on <br>\r\n<br>\r\n\"you ok Dr Lang?\" Penny asked, \"you look like you spaced out for a minute there?\" she had a look of distrusting concern on her face as she finished her scentence, Keiko decided to get moving before Glut decided to do something she wouldn't like. <br>\r\n<br>\r\n\"yes ladies i'm more than fine, something happened to us out there, that much is obvious\" Keiko began, waddling around the women as she began to talk, \"something that has changed us, maybe not for the better but certainly not for the worse\" Keiko slapped Alicias ass as she said this, feeling a discharge or energy as she did so \"i mean what about you Alicia, you've always wanted bigger assets.\" <br>\r\n<br>\r\nAlicia moaned as she began to feel a hunger build up in her stomach<br>\r\n<br>\r\n\"and you, Penny, you've never been a fan of exercise have you, i mean you're always complaining and saying how much you wish you could just laze around\" Keiko placed a hand on Penny's belly, feeling the same jolt again as Penny let out a groan of slothful pleasure <br>\r\n<br>\r\n\"Liza, you just love yourself so much and now you get even more of yourself\" Keiko said, dropping all pretense as she placed both hands on Liza's belly, the shocked blob of a woman only realizing what had happened too late as the same blissful look adorned her face,<br>\r\n<br>\r\n\"now lets go take our minds off of this with something to eat shall we ladies, in fact lets get the whole faculty in on this\" Keiko grinned to herself, she'd just given all three of her colleagues the appetites of women 3 times their size, she didn't feel too good about it, but she made a point to remember all the bitchiness she'd had to suffer from them all at some point to make herself not too torn up about it, the faculty was just an added after thought, she might of been in a race she didn't want to be in, but she certainly wanted to stay on the good side of the fat god before she ended up bigger than Liza. she watched as the 3 women waddled as fast as they could out of the room in the direction of the campus cafeteria their fattening influence causing anyone who looked at them to follow them to their destination <br>\r\n<br>\r\nKeiko waddled herself along after them, she was beginning to feel a little bit hungry herself <br>\r\n<br>\r\n\"i'll transfer those findings to my hard drive when i leave, got to sell this act in the mean time, and i am still quite hungry\" she thought <br>\r\n</span></div></div>",
            "created":1376888400,
            "id":1648517,
            "title":"Whispers of Fat "
        },
        "12122111222121":{
            "choices":[
                "Keiko tries to find a way to free herself, before it's too late...",
                "Keiko gets to her office and finds Diana waiting for her, looking a lot bigger.."
            ],
            "content":"<div class=\"\"><div> <span>By the time the women reached the cafeteria, their stomachs were grumbling and rumbling at a considerable volume. Penny waddled in fastest, while Liza staggered behind her and Alicia ambled behind Keiko. They dropped all pretense of concern for their new weight gain and started grabbing at anything in sight. Keiko hadn't anticipated their sheer voraciousness, they had been consumed by their own gluttony by here mere touch...<br>\r\n<br>\r\nPenny had wandered to the kitchen, and was grabbing a tray full of burgers while Liza took the dessert cart and wheeled it to a free table, huffing and puffing as she went. Her clothes had been ripped and shredded before, but as she moved her huge girth across the room, the flimsy fabric started falling away, leaving her almost completely nude. This didn't seem to bother her, but the other students in the cafeteria were staring at her gluttonous display in disgust. <br>\r\n<br>\r\n\"This is going too far...\" Keiko gasped, before a wave a of hunger hit her, and her stomach protested angrily. She staggered forward, clutching her bulging belly, and swiped a handful of bacon from a nearby tray before cramming it into her mouth. <br>\r\n<br>\r\nAlicia, meanwhile, was slumped onto the floor, surrounded by excited looking men, who were cramming hot dogs into her open mouth. \"More...mmfmff...more!\" She groaned. <br>\r\n<br>\r\nKeiko staggered towards the table where Liza was trying to sit down, hoping to stop herself from the same ravenous eating that had consumed by colleagues. She arrived just in time to see Liza plonk her massive behind on a chair, which immediately buckled and broke under her weight, leaving her colossal, naked body on the floor. She grunted and managed to roll onto her side, before tipping the dessert cart over and stuffing her face. <br>\r\n<br>\r\nKeiko looked at her slobby friend in horror, before turning her attention to the rest of the room. The looks of disgust on the other students faces had been replaced by greedy smiles, and they were all helping themselves to extra portions now. While they had not been affected by Glut's power, they were still making pigs of themselves, and Keiko could see bellies bloating and clothes tightening as they ate more and more. <br>\r\n<br>\r\n\"Keiko, you have to try this!\" Penny suddenly appeared beside Keiko, brandishing a burger. <br>\r\n<br>\r\nBefore Keiko could object, Penny crammed the delicious burger into her mouth. Keiko chewed it up and instinctively reached for another from the tray, as Penny sat beside her and stuffed her own face. Keiko couldn't help herself, she had to eat more...she had to satisfy the hunger! Slowly but surely, her own belly began to expand and push against her shirt. Beside her, Penny's sweats were tightening as her massive figure bloated even larger. Her zip up top had ridden up over her flabby gut, and her ass was overflowing her pants, almost shredding them to pieces. <br>\r\n<br>\r\n\"URRRRRRRRRRRP!\" Liza belched from the floor beneath them. <br>\r\n<br>\r\nKeiko barely noticed, she crammed another burger into her mouth, then heard a sudden popping noise. She looked down, and saw that her shirt had exploded open, allowing her oversized gut to bulge free, while her breasts threatened to consume her bra entirely. \"I...I have to go...\" she groaned, trying to avoid this mess. She had to focus before she got too big. <br>\r\n<br>\r\nShe waddled away, leaving Penny to explode out of her sweats and break the chair beneath her increasing girth. As she walked from the cafeteria, she saw that Alicia was naked now as well, her male admirers rubbing her widening stomach and feeding her even more quantities of food. \"I'm soooooooooooooo huge...\" she was giggling to herself.<br>\r\n<br>\r\n\"Got to...get out of here...\" Keiko muttered. She couldn't let this happen. Her friends. Their pride. Their dignity. Their humanity. It could all be at risk. She had to do something, before she lost herself to this gluttonous creature. </span></div></div>",
            "created":1376888400,
            "id":1648552,
            "title":"The fattening cafeteria feast"
        },
        "121221112221212":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "Diana and Keiko finish \"lunch\" and go out to spread their fattening influence",
                "Keiko Resists everything, she won't cause the fatpocolypse "
            ],
            "content":"<div class=\"\"><div> <span>Keiko knew when she stumbled past her secretary stuffing her face at her desk, surrounded by bags of take out, that she was already beginning to inadvertently spread Gluts influence, but what she didn't know until she opened the door to her office how much her of her wife Glut had managed to spread. <br>\r\n<br>\r\n\"hey babe, thought i'd come surprise you at work with a little lunch\" Diana belched out as seductively as possible with her mouth already full of triple cheese bacon burger, sat on the remains of Keiko's desk which had obviously not been up to the challenge of her wife's voluminous weight Keiko had to do a double take to take in the scene before her <br>\r\n<br>\r\nWhile Diana and her had been roughly the same weight this morning, her wife's trip to the mall had put her firmly in the lead, if Keiko weight 500 pounds Diana was pushing 900 easily, her dual fold belly spread out and poured down her body into the gap between her fattened thighs, her rear pushing her a little bit higher off of the floor as it spread out behind her, her upper belly was framed by her mammoth breasts that pushed the boundaries of the fabric that still somehow contained them, her arms pushed outwards by fat rolls that encircled and enveloped her now fluffy biceps, while her free chunky hand caressed and stroked where her belly button used to be, her face looked like it was melting into her body as her chins had swamped her neck out of existence while her cheeks kept the same dainty smile that Keiko had fallen in love with look even more plump and adorable. she winked flirtatiously at her wife who simply stood there in hungry aroused shock at the sight of her fat wife surrounded by bags of fast food, take out and ice cream which apparently qualified as a \"little\" lunch <br>\r\n<br>\r\n \"how...how did..\" Keiko began, as she waddled closer to her wife, the lowest point of her belly touching her wife's own paunch as the two connected, sending a jolt of pleasure and excitement through both of them <br>\r\n<br>\r\n\"haven't you watched any TV recently Dear? i've been busy\" Diana whispered as she leaned in to kiss Keiko's breasts which had flopped out of her tattered bra long ago <br>\r\n<br>\r\nIt was then Keiko noticed the background noise of her offices tv in the corner, turning around and trying her hardest to ignore her wife's advances as she felt a pair of thick delicate hands begin to pull down her skirt and pants <br>\r\n<br>\r\n\"again today's top story, obesity epidemic sweeps suburban america, a unnamed shopping mall has been ground zero to a sudden wave of onset fatness as random acts of mass eating, looting and gluttony have spread across the area, with restaurants and supermarkets literally being eaten out of stock\" whatever the reporter was saying was being drowned out by her wife's teasing touch and kisses up her back as her bra was finally unhooked from behind, she could feel Diana's belly press up against her back rolls and the feeling was driving her wild, the images of chunky, fat, gluttonous obese men and women stuffing their faces on the news only helping along her feelings of lust <br>\r\n<br>\r\n\"what do you mean busy\" Keiko moaned out as she felt the back of neck be teased by Diana's tongue <br>\r\n<br>\r\n\"you know, spreading our influence\"<br>\r\n<br>\r\nKeiko froze as she realized what her wife had said, she remembered everything that had happened to the two of them in the last 24 hours and was helping the world slip into a fat state of lust filled decadence, Glut had gotten to the one person she thought she would always be able to count on, what if Diana really didn't want to stop this, as she was spun around to face her wife, their paunches squashing against each other as Diana shoved the first of many morsels of food past her lips following up with the most erotic kiss of their married life, Keiko was beginning to question whether she wanted a way to stop it either </span></div></div>",
            "created":1376888400,
            "id":1648570,
            "title":"Keiko gets to her office and finds Diana waitin..."
        },
        "1212211122212122":{
            "choices":[
                "Next morning, Keiko and Becky leave for Peru...",
                "That night, Keiko accidentally binges too much and outgrows her wife..."
            ],
            "content":"<div class=\"\"><div> <span>No. This had to stop. It was all going too far. When would this fattening plague end? When the whole world was too big and heavy to move around?! She looked at Diana, still stuffing her face, her titanic body bulging out even wider as she ate. Her wife had undergone a shocking transformation from the beautiful, slender woman she had once been to a ravenous, overweight eating machine. Keiko summoned all her will power to pull herself away from Diana. Her stomach had grown again, but unlike her wife's sagging gut, her belly only seemed to become more round after every meal. <br>\r\n<br>\r\n\"Wh...<i>URRRRP</i>...what is it?\" Diana asked, cramming another handful of fries into her mouth. <br>\r\n<br>\r\nKeiko couldn't risk speaking to Diana of her dissent or Glut would sense her treachery. Instead, she turned away from Diana and headed towards the door. Her clothes lay on the floor and every inch of her five hundred pound body jiggled and shook as she walked, but putting her clothes back on would have been a waste of time at this point. Her shirt and bra were ruined, and the struggle to squeeze into her pants would probably tear them apart anyway. She opened the door and squeezed through to find Becky, her secretary, still eating from a bag of food on her desk. <br>\r\n<br>\r\n\"Keiko?\" Becky looked up and wiped the crumbs from around her mouth. She was looking rather bloated, but had not yet succumbed to the same fattening as the others.<br>\r\n<br>\r\nKeiko pulled the food away from the desk and tossed it in the trash before standing over her assistant. \"Becky, I need you to listen to me and stop eating.\"<br>\r\n<br>\r\n\"But...I'm still hungry...\" Becky protested, rubbing her bulging stomach. She was a slender young girl with blonde hair and sizeable breasts, and her button up shirt was looking rather tight today. <br>\r\n<br>\r\n\"Get me everything you can find on the trip I took to Peru, and book a flight to the exact same location,\" Keiko said. She knew if she was going to beat Glut then she had to return to the place where this all began. She couldn't remember all the details of what had happened there...but she at least knew where to look for the temple. <br>\r\n<br>\r\n\"Erm, sure,\" Becky said, typing quickly and bringing up a flight booking. \"I think this was the one...yeah...that's it. There's a flight tomorrow morning if you can make it?\"<br>\r\n<br>\r\n\"Perfect,\" Keiko said. \"Book a ticket for yourself as well.\"<br>\r\n<br>\r\n\"M-me?\" Becky stammered. \"But you never take me with you.\"<br>\r\n<br>\r\n\"I need someone who still has enough control to stay in shape, I might not be as agile as I used to be,\" Keiko said, gesturing to her bloated, spherical gut. \"Just don't overeat, okay? Oh, and order me some new clothes...\"<br>\r\n<br>\r\nBecky blushed and nodded, then made the arrangements. Hopefully, she could avoid Glut's influence for the moment. She headed back inside her office and grabbed a burger from Diana's food pile with a resigned sigh. She had to keep up appearances or Glut would find out her plans...so she sat beside her huge wife and started eating.</span></div></div>",
            "created":1378962000,
            "id":1661838,
            "title":"Making plans"
        },
        "12122111222121221":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "They land without incident and get back to the dig site, they get some answers",
                "Glut visits Keiko while she naps on the flight to show how fat Diana has become"
            ],
            "content":"<div class=\"\"><div> <span>Standing the departure lounge of the airport Keiko and Becky looked like quite the odd couple, Keiko finished her day yesterday weighing in at the high end of 500, teetering on the edges of 600 pounds but still mobile thanks to the effect's of Glut's power over her, she hadn't heard from the goddess of gluttony since the incident at the university, she guessed her wife's fattening exploits at the mall would keep her busy for a while but that still didn't make her feel any better about her weight, squeezed into a dress that was at least on X too small for her XXXXL Frame, she could feel the stitches threatening to burst with any movement she made, her belly and breasts wobbling within like a human pile of jello, she looked angrily at her now chubby assistant Becky who had purchased it for her last night, not thinking to take into account how big she might become over night, also she'd taken the trouble to book her two seats all to herself.<br>\r\n<br>\r\n\"I still don't see why you had to book me two seats Becky\" Keiko hissed at her assistant, who still looked quite sheepish even at her bigger size, while not as corpulant as her boss had become the binging she did the previous day had packed at least another 50 pounds on her own body, bloating her up to 200 pounds of cute chubby blubber<br>\r\n<br>\r\n\"Well...you are getting...a bit...you know....\" Becky stammered back, not wanting to offend the human blob she would be spending a very long hall flight sat next to crammed into a window seat against. <br>\r\n<br>\r\n\"Yes I know I've gotten a bit 'you know' Becky that's why we are going back to....hang on what do you mean I've gotten fat?\" Keiko snapped back grabbing Becky by the shoulders in shocked realisation<br>\r\n<br>\r\n\"I..I Never said Fat miss Keiko!!\" Becky blurted out in terror <br>\r\n<br>\r\n\"No that's not what I'm getting at, You remember me being thinner?!\" No one else had remembered this, not her wife, not the other staff at the university, only the people at the dig site knew about their changes<br>\r\n<br>\r\n\"Well, I mean it was hardly difficult to miss, you've put on a few pounds since the last time you came here\" Becky replied, calming down a bit when she realized she wasn't in as much trouble as she thought, \"But no one else said anything, So I didn't want to be rude\" <br>\r\n<br>\r\n\"No one else noticed Becky! what's so special about you! How did you notice?\" Keiko let go of Becky as she finished, realizing they where making a bit of a scene and the two waddled towards there gate as the boarding call for the flight was announced <br>\r\n<br>\r\n\"I don't know Miss Keiko, I mean my family's originally from Peru near where we're going but I was born in the states, I don't really know a lot about the old country though, Just the findings that you've been bringing back from your trips there\" The two spoke in hushed tones as they settled into their seats for the trip. <br>\r\n<br>\r\nKeiko just sighed \"Well I guess there's no point with guess work, we'll just have to wait till we get there, maybe there's some answers left behind in the tomb we missed\"  </span></div></div>",
            "created":1416950460,
            "id":1893586,
            "title":"Next morning, Keiko and Becky leave for Peru..."
        },
        "121221112221212211":{
            "choices":[
                "The next morning, they explore the temple...",
                "Keiko hears a noise and wakes up in the middle of the night..."
            ],
            "content":"<div class=\"\"><div> <span>When the plane touched down, Keiko had some trouble disembarking; she barely fit through the plane doors at her current size, and they made her leave last (though Glut's curse seemed to be widespread now, as Keiko noticed tight shirts and unbuttoned jeans all around her). When they were off the plane, they grabbed their luggage and headed to a taxi to the outskirts of town. From there, they entered the jungle, hiring a boat to take them down river. Becky was only an office assistant, and unused to this kind of work; so Keiko made all the arrangements herself, despite feeling exhausted, sweaty and more than a little hungry. <br>\r\n<br>\r\nThe boat was small, and when Keiko parked her huge rump at one end, it nearly turned it over in the river, so she was sitting in the middle seat with Becky in front of her to balance things out. In the hot sun, Keiko was made to feel even more exasperated; her huge, portly body not suited to exploring work. Her dress clung awkwardly to her body, and she wanted to take it off and cool down in the water...but they were not yet at the dig site. <br>\r\n<br>\r\nBecky didn't look much different than usual, other than her bulging pot belly, which the slender girl barely seemed to notice. Keiko would have given anything to have a pot belly that size, unlike the huge spare tire she now possessed. Other than a few strained buttons on her shirt, Becky looked as cute as ever. She still wasn't sure why her assistant was so resistant to the alteration of reality, but was grateful that she wasn't just going crazy. For a while, she feared all this madness might just be in her head. <br>\r\n<br>\r\nWhen they finally reached the end of the river, they clambered out of the boat and set of on foot. It was getting dark now, and Keiko really needed a rest; her huge breasts heaving with every step, her belly jiggling and straining against her too-tight dress. Becky had a hamper full of food that she had packed, and some supplies Keiko had brought, and was struggling with them behind Keiko's huge butt. <br>\r\n<br>\r\n\"We...nearly there yet?\" Becky asked, out of breath. <br>\r\n<br>\r\n\"Nearly,\" Keiko said, feeling winded already. <br>\r\n<br>\r\nThey had to stop and rest three times before they reached the dig site. Becky set up two tents for them to sleep in, while Keiko set a fire and parked her blubbery butt down on a fallen tree beside it. Her whole body ached, but she was proud of herself for getting this far in her current condition. Becky had done a decent job of setting up the tents, but Keiko had a feeling hers would be a tight squeeze...<br>\r\n<br>\r\n\"So, what now?\" Becky asked, plonking herself down on the log beside her boss. <br>\r\n<br>\r\n\"We wait until morning, then explore the temple,\" Keiko said. \"With any luck, we can reverse what's happening.\"<br>\r\n<br>\r\n\"Right, you want anything to eat?\" Becky asked, gesturing towards the hamper behind them. <br>\r\n<br>\r\nKeiko's stomach rumbled noisily, as though in response to the question. She rubbed a pudgy hand over her beach ball sized gut and groaned. She knew she shouldn't, but the hunger was too great...besides, she hadn't eaten all day. \"Please.\"<br>\r\n<br>\r\nBecky went over and unpacked them both some food; she hadn't brought the usual rations that Keiko took on trips like these, instead, it looked like she was prepared for a party. She came back with a few chicken legs, a large tub of pasta and a chocolate cake. Keiko would have lectured her on packing more healthy snacks, but her belly gave another groan, and she started eating. It wasn't the gigantic feast she had been eating the last few days, but it satisfied her hunger, and that was all that mattered. <br>\r\n<br>\r\nBecky cleared away the mess, and the girls retired to their separate tents. Keiko squeezed inside her own tent and zipped it up, there was barely enough room to turn around in there, and every time she did, her huge ass rubbed against the fabric noisily. She was grateful that at least she could take her dress off now, and reached for the zip at the side. As she did, she felt a familiar tingling sensation across her body and stopped herself; looking down, she could see her bulging belly moving every so slightly, pushing out, bulging larger. <br>\r\n<br>\r\n\"Urghhh...\" She gave a grunt as the dress tightened even further. \"Oh come on, I barely even ate one full meal today!\"<br>\r\n<br>\r\nBut that didn't seem to matter to the curse; her belly widened, her breasts started rising like baking dough and her ass pushed out even further. She reached for the zip, to free herself of the dress before it got too small, but the second she moved her arm a large tear formed alongside the side, allowing her soft belly flab to spill out. She gave a moan of relief as her gut was freed from it's confinement. Before long, the other side of the dress had ripped open too, and Keiko could only watch as it's tattered remains fell to the floor. Her black bra and panties had, luckily, stayed on, but they were now skin tight as well. She kicked the remains of her dress away and lay down on her sleeping bag, knowing she would never actually fit inside the dam thing. It wasn't long before she fell asleep...</span></div></div>",
            "created":1417035720,
            "id":1894054,
            "title":"Journey to the temple"
        },
        "1212211122212122112":{
            "choices":[
                "They are suddenly ambushed...",
                "Keiko is growing attracted to Becky..."
            ],
            "content":"<div class=\"\"><div> <span>Keiko slept in her underwear, enjoying the cool night air on her plump body. She was sleeping peacefully, when a noise woke her up; she could hear a strange crunching, munching noise from outside her tent; perhaps a wild animal had found their food stocks? She was prepared to ignore it when she heard a sudden \"URRRRRRP!\" which sounded very human. Rubbing her eyes, she forced herself to her feet, which was a very difficult task nowadays. With a tired groan, she unzipped her tent and went outside. The fire was going again, and she could see the shadowy figure of Becky, sitting on the floor with her back to her. <br>\r\n<br>\r\n\"Becky? What are you doing?\" She asked, waddling forward. <br>\r\n<br>\r\n\"Oh...Keiko...I...uh...\"<br>\r\n<br>\r\nKeiko walked past her assistant and turned to look down at her. \"Oh no...\" she sighed. <br>\r\n<br>\r\n\"URRP!\" Becky belched noisily, blushing. Beside her, the hamper of food was totally empty, and she was surrounded by empty wrappers, chicken bones and crumbs. The buttons on her shirt were stretched apart, exposing the flabby pot belly beneath, and the top button of her shorts was wide open - whether by choice or it had popped open during her binge, Keiko wasn't sure. \"I'm sorry, I couldn't stop myself!\" She moaned. <br>\r\n<br>\r\nKeiko regretted not putting a lock on the hamper. She should have known that Becky wouldn't have been able to resist it all night, she knew all too well what the early stages of hunger were like; the ravenous, unstoppable urge to eat everything in sight. <br>\r\n<br>\r\nSuddenly, a button popped off Becky's shirt, shooting through the air and bouncing off of Keiko's massive gut, which now reached her knees. Becky looked down in surprise as she saw her stomach beginning to bloat even bigger, inflating like a balloon with the added pounds she had gained during her little feasting session. One by one, her buttons stretched apart and popped, each one firing off across the camp, followed by a shriek from the expanding blonde girl. When the last one burst off, the shirt hung open, displaying her perfectly round, bloated stomach. Her breasts seemed to heave forwards as the button popped, bulging out over the curve of her stomach and almost overflowing her strapless bra. <br>\r\n<br>\r\n\"My boobs!\" Becky squealed. \"My boobs are huge!\"<br>\r\n<br>\r\nShe was staring down into her cleavage in amazement when she heard another loud ripping noise from beneath her stomach. She clambered to her feet, nearly falling over in her food induced stupor, and Keiko saw that the seat of her shorts had ripped open down the middle. Becky turned to face her boss, looking very ashamed of herself. Her shirt hung open, her breasts were almost overflowing her bra, and her shorts would have fallen down if not for the size of her butt. She looked a good fifty pounds heavier, though her cute, attractive face didn't seem to have changed at all. <br>\r\n<br>\r\n\"I warned you,\" Keiko said. <br>\r\n<br>\r\nBecky just moaned, rubbing her swollen tummy with a sad look on her face. Unlike Keiko's, it was perfectly round and firm, stuffed full of food...</span></div></div>",
            "created":1417037700,
            "id":1894076,
            "title":"Keiko hears a noise and wakes up in the middle ..."
        },
        "12122111222121221121":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "They're brought before the chief who recognizes Gluts \"blessing\" on Keiko",
                "They're taken to a dining hut with the missing tourists, all huge and obese"
            ],
            "content":"<div class=\"\"><div> <span>Keiko didn't have time to comfort Becky, before either of them knew what was happening the clearing was suddenly filled with aggressive looking tanned women, all of whom where in a lot better shape than they where and holding more pointier sticks then they had. <br>\r\n<br>\r\nKeiko quickly bear hugged Becky to her, more for her own comfort that Becky's, she'd heard of this tribe on her last visit but they hadn't encountered them then, the lost tribe of Bellfa, they didn't take kindly to outsiders and had been known to kidnap tourists into the jungle who where never heard from again, not something she was in a hurry to experience but the angry shouting of the women and the pointing of the sticks showed her how many options she really have available. struggling to her fat feet and leading the dazed and hunger shocked Becky along she followed the tribe of angry shouting ladies through the jungle, horrific thoughts filling her mind at what awaited her and thoughts of her wife back in the states, probably too stuffed and fat to even know she'd left. <br>\r\n<br>\r\nEventually they arrived, and Keiko's heart plummeted even further with what she saw in the centre of the tribes village, suddenly the tribes name made a lot more sense as a mistranslation of belly fat when staring down at her in all her bronzed glory was a giant statue of Glut, laughing as it held it's huge belly in it's hands <br>\r\n<br>\r\n\"Oh great...I've found the original fan club\" Keiko moaned to herself, Becky's stomach growling in protest and hunger  </span></div></div>",
            "created":1417039680,
            "id":1894129,
            "title":"They are suddenly ambushed..."
        },
        "121221112221212211211":{
            "choices":[
                "Keiko is to be fattened...",
                "Kalia wants Keiko to fatten the entire tribe with her abilities..."
            ],
            "content":"<div class=\"\"><div> <span>The women lead Keiko and Becky past the golden statue and towards a large, straw hut at the far end of the street. Keiko's legs were starting to ache, but she did not want to show any weakness in front of the tribeswomen; who, considering they worshipped Glut, were in amazing shape. They could almost have been supermodels or porn stars, because they had slender, amazing bodies, accentuated by their golden chain-mail bikinis. They didn't talk much, but every so often would give Keiko a prod with their weapons. Becky ambled along beside her, trying to re-button her ruined shirt; her overstuffed belly still protruding past her burst shorts. Keiko had managed to grab a dress before they left, so she wasn't walking through the jungle in just her underwear.<br>\r\n<br>\r\nWhen they finally reached the hut, the two women were ushered inside, to the bottom of a set of steps, ascending to a large, wooden throne, on which sat a beautiful, bare breasted woman with long, raven hair. She rose at their approach and smiled. \"Welcome, blessed one,\" she said. <br>\r\n<br>\r\n\"You...you speak English?\" Keiko asked, surprised. <br>\r\n<br>\r\n\"Glut has given us much knowledge,\" the woman replied. \"I am Kalia, the chief of this tribe. We are all worshipers of the great Glut. Your coming was foretold.\"<br>\r\n<br>\r\n\"It...it was?\"<br>\r\n<br>\r\n\"Yes, in our ancient scrolls,\" Kalia began to descend the steps towards Keiko, her large breasts swaying back and forth with each step. \"But we must be sure. Remove her clothing, see if she bares the mark!\" She pointed to Keiko's large form. <br>\r\n<br>\r\n\"W-wait!\" Keiko tried to protest, but two of the more muscular women grabbed her arms and held her in place. Despite her bulk, she didn't really have the strength to resist them. Becky moved to help her, but another two women pinned her in place. \"I don't have any mark!\" Keiko protested. <br>\r\n<br>\r\nBut her protests fell on deaf ears; instead, one of the women grabbed the top of Keiko's oversized dress and ripped it clean from her body. Keiko gasped as she felt the cool air on her exposed belly, and gasped once more when the woman ripped her bra and panties away, leaving her completely naked and very embarrassed, all of her blubbery, four hundred pound body on display. <br>\r\n<br>\r\n\"She bares the mark,\" the woman who had stripped Keiko said, and Kalia clapped her hands together happily. <br>\r\n<br>\r\n\"What? No I don't!\" Keiko protested, blushing. <br>\r\n<br>\r\nKalia clicked her fingers and a servant girl ran into the room with a round mirror, she held it up so that Keiko could see the reflection of her huge gut, and sure enough, there was a strange, tattoo like symbol that Keiko did not remember being there before. \"What the hell...\" She muttered in disbelief. <br>\r\n<br>\r\n\"Now then, let us begin the ceremony!\" Kalia said. <br>\r\n<br>\r\n\"What ceremony?!\" Keiko asked. </span></div></div>",
            "created":1424985120,
            "id":1940578,
            "title":"They're brought before the chief who recogn..."
        },
        "1212211122212122112111":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "Keiko submits and eats, hoping to find an escape later ",
                "Keiko eats but channels all the new fat into Becky to stay mobile "
            ],
            "content":"<div class=\"\"><div> <span>\"As big as you are you must be bigger for our great goddess Glut to truly be free of the seals that bind her and break through to our mortal realm!\" Kalia announced, \"Only then will you both be able to spread your influence across this planet like the great fat wave of gluttony that has been foretold of in legend!\"<br>\r\n<br>\r\nKeiko gulped as she saw the other tribeswoman begin to bring in dish after platter after roasted pig on a spit into the hut, Becky stood beside her shaking in what Keiko thought was fear but could easily have been gluttony induced lust from the saliva dripping from her mouth in anticipation at the feast before them, <br>\r\n<br>\r\nThere was no way out that Keiko could see, she could barely waddle around as it was, whatever feast the chief had planned would surely push her into immobility if she let her have her way, and not only that, it would alert glut to her location, and she didn't want to see what the deity would have to say about her current plans or ideas of finding out how to stop the fatpocolypse she'd somehow managed to unleash on the world, <br>\r\n<br>\r\nshe could only see two ways out of this, she and Becky could consume all that was in front of her and hope they stayed mobile, Or Keiko could try and use her powers in a more selfish manner hoping Glut wouldn't notice </span></div></div>",
            "created":1425503640,
            "id":1943776,
            "title":"Keiko is to be fattened..."
        },
        "12122111222121221121111":{
            "author_id":"shirouta",
            "author_name":"Almacia",
            "choices":[
                "Keiko finds herself witnessing a vision of what is to come",
                "Keiko is reunited with her wife and is blessed by Glut once more in the astral "
            ],
            "content":"<div class=\"\"><div> <span>\"The chosen one of Glut will fulfill the prophecy meant for our tribe\" Kalia replied stoically as she walked over to Keiko gracefully.<br>\r\n<br>\r\n\"You will use Glut's gift to bestow upon us the greatest of all honors\" Kalia licked her lips as she sunk her hand into Keiko's soft fleshy belly. Keiko looked into Kalia's eyes as the chieftess knelt down before her and kissed one of her hanging breasts lovingly.<br>\r\n<br>\r\n\"You will make us your obese acolytes and we will help you to spread Glut's doctrine to the world.\" Kalia moaned as she bought her hand down atop Glut's mark 'OH GLUT YES!\"<br>\r\n<br>\r\n\"What are yo...\" Keiko stopped mid-question as Kalia's belly began to roar louder than anything she had heard today. She stepped back from Kalia slowly as the cheiftess rose her hunger ridden eyes to meet her chosen one's gaze.<br>\r\n<br>\r\n\"I will be your right hand...my lord\" Kalia winced as her stomach cried out even louder than before \"...feed us and fulfill our Goddess's will.\"<br>\r\n<br>\r\nKeiko opened her mouth to speak but found herself slipping into the astral plane, vision blurring and time stopping as Glut waddled into her peripheral vision. The Goddess of gluttony was larger than she was at their last meeting. Her blubbery belly now folded over itself into two hefty rolls, her bulbous breasts were now strained into tear drops, and her thighs and ass had dimpled and expanded to cartoon degrees. <br>\r\n<br>\r\n\"Well done my faithful avatar!\" Glut chuckled as she waddled closer to Keiko's side, stopping only when her belly pressed into her human servant's lovehandles.<br>\r\n<br>\r\n\"You unwittingly waddled your way right where I wanted you to...are you ready to fulfill your destiny?\"<br>\r\n<br>\r\n\"Do I have a choice in the matter?\"<br>\r\n<br>\r\n\"Now you are catching on\" Glut smiled as she leaned closer to Keiko's exposed ear \"it may not seem like you have a choice...but I am a kind Goddess Keiko.\"<br>\r\n<br>\r\n\"You have not realized it yet but my power is most at home within you, Do you understand why?\"<br>\r\n<br>\r\n\"I have no clue...\" Keiko whispered in reply as Glut smiled beside her \"does it have anything to do with your heavier appearance?\"<br>\r\n<br>\r\n\"You are a clever one\" Glut replied calmly as she placed a fat hand atop Keiko's marked belly \"continue to appease me and all will become clear.\"<br>\r\n<br>\r\n\"You cannot stay between planes much longer\" Glut sighed as she flooded Keiko's mark with a familiar energy. Keiko felt her body thicken and expand as Glut leaned in to kiss her.<br>\r\n<br>\r\n\"Feed them\" Glut whispered as she touched her lips to Keiko's \"...only then can our plans proceed as foretold.\"<br>\r\n<br>\r\nTime began to resume as Keiko's consciousness slowly returned to the material plane, she stood heavier and hungrier than she had ever felt before Kalia.<br>\r\n<br>\r\n\"So be it\" Keiko spoke promptly all the while noticing her voicer was slightly different slightly more like Glut's.<br>\r\n<br>\r\n\"We feast tonight...with Kalia at my left and Becky at my right!\"<br>\r\n<br>\r\n\"You honor me master\" Kalia smiled as she motioned for Keiko to follow her \"we have prepared a feast in the old ways...one fit for Glut herself.\"<br>\r\n<br>\r\nKeiko felt her feet move thoughtlessly as Glut's last words echoed in her head. She felt a strange fear start to well as the implications that Glut had found a way to merge a bit of her essence into her mind became more and more apparent. <br>\r\n<br>\r\n\"It has to be this infernal mark....\" Keiko thought frantically as her heart beat faster within her fat encased chest. She focused on centering herself as her yoga instructor had taught her long ago and felt some solace as Glut's influence retracted within her mind. She stopped, of her own accord, beside Kalia inside the feasting hall. <br>\r\n<br>\r\nShe stood winded as she took in the vast amounts of food that laid spread atop a series of altar-like tables. Her attention shot to the statue of Glut that rested behind the head of the table.<br>\r\n<br>\r\n\"A prophecy eh?\" She thought to herself as she made her way to the seat of honor \"I have no choice but to play along for now.\"<br>\r\n<br>\r\nShe felt Glut's influence rise up as her inner dialogue ended and she began to feel it grow more intoxicating as she took her seat in front of the statue. She felt her hunger pains grow unbearable as the first offerings of food were placed in front of her, Kalia, and Becky. She had already stuffed an entire roll into her gaping maw as Kalia spoke the ancient ritualistic words. Keiko felt her belly mark grow hotter with Kalia's chanting as she continued to shovel food into her mouth.<br>\r\n<br>\r\n\"For the great Goddess!\" Kalia shouted to her tribe before ripping into a full sized hen greedily \"dine for our master's approval! Dine until you embody gluttony itself!\"<br>\r\n<br>\r\nKeiko watched her belly swell from within herself as Glut took over her body temporarily during the feast. She felt her conscious merge with the Goddess's slightly as  her body began to take on the shape that her wife's had during the dream. <br>\r\n<br>\r\n\"Watch carefully messenger\" Glut's thoughts reverberated through her mind as her hands picked up their pace \"and know my strength!\"<br>\r\n<br>\r\nGlut turned her head to the left to allow Keiko to witness firsthand how obese Kalia was becoming. Keiko looked on in amazement as the dark-skinned beauty's body thickened beside her. The chieftess was already sporting a heavy keg that had begun to fold over atop her loincloth. <br>\r\n<br>\r\nGlut freed one of Keiko's hands and bought it to her devoted follower's belly without losing pace on her own feeding. Kalia's body erupted with fat the moment Keiko's hand made contact. The cheiftess's eyes rolled back in her head as Glut's power flowed into her body.<br>\r\n<br>\r\nHer already sizeable breasts cascaded across her folding belly on their way to the ground as her butt swelled up unforgivingly. Keiko looked on in awe as Kalia's breasts out paced the rest of her gain slightly more noticeably. Glut removed Keiko's hand only after her weight had surpassed 600 lbs.<br>\r\n<br>\r\n\"Thank you my master\" Kalia huffed as she rolled over to face her chosen one \"let your humble servant feed you as is my duty.\"<br>\r\n<br>\r\n\"Your loyalty has gained you our favor\" Glut spoke stoically as she bought her right hand down to Becky's swelling gut. Keiko felt her fear return as she was forced to watch Becky swell up beside her as Kalia stuffed her almost ready to burst stomach to its limit.<br>\r\n<br>\r\n\"Did you think I had no idea what you were planning Keiko?\"<br>\r\n<br>\r\nKeiko remained silent as Glut continued to consume every offering that Kalia presented to their lips. \"I know all about your plans to stop me...lets see you try when every person that you know or trust ends up my hedonistic slave!\"<br>\r\n<br>\r\n\"Stop\" Keiko felt herself pleading as Becky's belly began to fold over itself \"you made your point.\"<br>\r\n<br>\r\n\"No\" Glut replied coldly as she gestured for Kalia to feed the last required amount before her power could explode outwards \"we have made our point.\"<br>\r\n<br>\r\nKeiko felt Glut's influence recede to a sort of sleep like state as the last bit of food slipped down her throat. She felt her spherical body rumble heavily before the heaviest fart she had ever had exploded out of her dimpled cheeks.<br>\r\n<br>\r\nThe fat tribe members, Kalia, and Becky inhaled deeply and as on cue began to feed themselves with renewed vigor. <br>\r\n<br>\r\nKeiko was the last to fall asleep as Kalia and Becky laid suckling at her blubbery breasts.<br>\r\n<br>\r\n\"Just great\" Keiko yawned as she began to slip into sleep \"I can add lactation to my ever-expanding list of changes.\"<br>\r\n<br>\r\n\"Our changes\" Glut laughed as Keiko's consciousness slipped away into sleep's embrace.<br>\r\n</span></div></div>",
            "created":1436658420,
            "id":2006755,
            "title":"Keiko submits and eats, hoping to find an escap..."
        },
        "13":{
            "choices":[
                "Lucy...",
                "Katie...",
                "Samantha...",
                "Laurie...",
                "Reader's Choice..."
            ],
            "content":"<div class=\"\"><div> <span><i><b>\"Okay people, prepare for testing.\"</b></i><br>\r\n<br>\r\nThe lab was a cold, sterile, place. Isolated in the middle of the Nevada Desert, a secret from everyone except those with the highest military clearance. Top scientists gathered at the base to test new Biological weaponry, away from prying eyes. Doctor's in long white lab coats, technicians in dirty overalls and soldiers hurried down the secret base's corridors, rushing towards the staging area. <br>\r\n<br>\r\nThe weapon they were about to test was designed to weaken an enemy army by producing a chemical reaction in the water supply, which, when ingested by enemy soldiers, would cause them to gain weight at an alarming rate - until they were too fat and weak to fight back. The test missile was loaded into the launcher, as a countdown began. <br>\r\n<br>\r\n<span class=\"clred\"><b>10...9...8...7...6...5...4...3...2...1...<br>\r\n</b></span><br>\r\n<br>\r\nThe missile blasted off, the worker's on the ground staring up as they observed it's progress. Suddenly, one of the computer technicians spun around, his face flushed with horror. \"Something's wrong! It's going too high!\"<br>\r\n<br>\r\n\"Abort!\" Shouted one of the Doctors. \"Abort <i>now</i>!\"<br>\r\n<br>\r\nThe technician's scrambled to obey the order, but the machinery was now going haywire. \"We can't get a lock on it, sir! It's entering the atmosphere!\" The workers could only stare at the computer display in terror as the missile entered the Earth's atmosphere...and exploded. <br>\r\n<br>\r\n\"The fallout from that explosion...\" One of the Doctors gasped. \"It's entered the atmosphere now. It's going to spread.\"<br>\r\n<br>\r\n\"Then God save us all...\"<br>\r\n<br>\r\nThe sky rumbled...and it began to rain.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nA city nearby was one of the first places to feel the effects of the new Bioweapon; choose which of it's residents you will follow...<br>\r\n<br>\r\n<b><span class=\"cborange\">Lucy:</span></b> A 24 year old, busty, red head. Lucy is outgoing, confident, adventurous and is drop dead gorgeous. She is a struggling actress who works part time at a local restaurant. <br>\r\n<br>\r\n<b><span class=\"chunter\">Katie:</span></b> Katie is a 28 year old brunette who hates her boring office job. She used to have a great body, but recently she has begun to put on weight and her body has started to develop some curves. She blames her job for most of her problems and lives with her boyfriend, Scott. <br>\r\n<br>\r\n<b><span class=\"cnavy\">Samantha:</span></b> Samantha is a 26 year old fitness freak, obsessed with working out and taking part in various sporty activities. She has long blonde hair and a toned, athletic body. <br>\r\n<br>\r\n<b><span class=\"cgrape\">Laurie: </span></b>Laurie is a promiscuous 19 year old who left home early to find a job in the big city. She has raven black hair and a great body. She lives with her more conservative room mate, Kristen, who is envious of her friend's good looks and the attention she receives from men. </span></div></div>",
            "created":1369026000,
            "id":1593788,
            "title":"Water Water Everywhere"
        },
        "131":{
            "choices":[
                "She gets a cab to work, and arrives to find the place busier than usual...",
                "Lucy fails to get a cab and has to walk in the rain...",
                "Lucy gets a call back from an audition and has to skip work..."
            ],
            "content":"<div class=\"\"><div> <span>Lucy Collins stood before a tropical backdrop on a sound stage, wearing only a skimpy red bikini that clung to every inch of her slender, curvaceous figure. The beautiful redhead pouted, smiled and posed for the flashing cameras - wishing she didn't have to do this to make money. Her dreams of being an 'actress' had quickly been crushed when she had been turned down from pretty much every casting call she had attended; constantly told that she was 'not what they were looking for'. <br>\r\n<br>\r\nShe had been forced to get into modelling instead to try and put her name out there, which had meant months of skimpy lingerie shoots, underwear and swimwear modelling. Her body was slender, but nicely curved; with a round, firm butt, wide hips and big D cup breasts that she always ended up squeezing into the bras at these photo shoots. Her bright red hair tumbled down around her shoulders, and had become her trademark feature, along with her ample bust. <br>\r\n<br>\r\n\"That's great Lucy,\" the Director called over. \"I think we have all we need.\"<br>\r\n<br>\r\nLucy nodded and headed to the changing rooms. There was something satisfying about getting paid to show off her body, but she would have rather been acting with her clothes <i>on</i>. She changed out of the bikini and into her work clothes; a simple pair of jeans that hugged her hips and butt and a tank top that displayed her cleavage. It wasn't necessarily intentional, but it was hard to find good clothes that <i>didn't</i> draw attention to her curves. <br>\r\n<br>\r\nThe extra money she made at these shoots came in handy, but Lucy had to work part time at a diner downtown to make enough money to get by. It was pouring with rain when she stepped outside, so she decided to hail a cab for the trip downtown...<br>\r\n<br>\r\n</span></div></div>",
            "created":1370667600,
            "id":1607317,
            "title":"Lucy"
        },
        "132":{
            "choices":[
                "She reaches work, finds everyone soaking wet...",
                "She has a car accident...",
                "She gets hungry on the way to work..."
            ],
            "content":"<div class=\"\"><div> <span>\"I am getting <i>so </i>fat...\" <br>\r\n<br>\r\nKatie pulled up her pajama top and rubbed her bulging stomach. She had always had a great body, and a high metabolism which stopped her from putting on weight easily. But over the past few months, she had started to notice changes in her physique; her flat stomach had gradually bulged out and developed into a muffin top, while her breasts went up a cup size and her butt started widening. It was all down to her office job, she knew. She worked long hours that didn't allow her to get as much exercise as she used to, and there was vending machines all over the office that were just too tempting to ignore. Her increased snacking, combined with her lack of physical activity, had taken it's toll on her body. <br>\r\n<br>\r\n\"You're not fat,\" her boyfriend, Scott said from behind her. <br>\r\n<br>\r\nHe had been telling her that for a while, and she knew it wasn't true anymore. Scott would never know what it was like, anyway; he had a perfect body, muscled and toned and hard. She felt his hands wrap around her soft belly and blushed. She and Scott had moved to the city a year ago, having been in a relationship for the past four years - they had both applied for high paid jobs and been successful. Scott worked at a law firm with it's own private gym, which he used frequently. Katie, on the other hand, worked for an insurance company that had taken a lot of cut backs over the past few months, forcing her to spend more and more time in her office. <br>\r\n<br>\r\n\"My suits are so tight,\" Katie sighed, as her boyfriend kissed her neck gently. \"I can't believe I let myself go like this.\"<br>\r\n<br>\r\n\"You didn't,\" Scott repeated. \"Seriously babe, you need to stop worrying. You might have put on a few pounds, but no way are you fat. I bet you'll lose this weight in no time.\"<br>\r\n<br>\r\nKatie hoped he was right, she had been thinking she could get her old body back after some hard work and dieting, but she always seemed to put it off. \"Thanks...anyway, better get ready for work.\"<br>\r\n<br>\r\nKatie undressed and squeezed herself into a business suit that was overly snug around her curvy figure. The buttons stretched underneath her pudgy stomach, and her larger breasts created more cleavage than she used to have, but it was still a good enough fit. After kissing Scott goodbye, she hurried to her car and drove downtown, right through what looked like a thunderstorm. <br>\r\n<br>\r\n\"I can hardly see a thing...\" Katie complained as the rain poured down on her car. </span></div></div>",
            "created":1370667600,
            "id":1607323,
            "title":"Katie"
        },
        "1321":{
            "choices":[
                "Katie bumps into Jessica again...it looks like she's gained a few pounds.",
                "Katie's office gets a leak...",
                "Katie heads home at the end of the day, makes it home safely..."
            ],
            "content":"<div class=\"\"><div> <span>It was a slow drive to work. Katie didn't want to hit anyone, and the usual rush hour traffic was made even worse by the torrential down-pouring of rain. When she finally got to work and parked her car in the lot, she was thankful to be bone dry. It still hadn't stopped raining outside, but thankfully she had managed to avoid it all. She headed through the side entrance, up to the elevator and rode it up to her floor; she was a few minutes late, but she doubted anyone would notice. <br>\r\n<br>\r\nWhen the elevator doors opened, she saw her co-workers were coming in off the streets. Obviously, their trips in had not been as dry as her own, and they were huddled in the lobby shaking their umbrellas and squeezing water from their expensive suits. Jessica - a leggy blonde who was a few years younger than Katie and constantly wore short skirts and tight shirts as she flirted with the men in the office - was absolutely drenched, and a few of the guys were ogling her see through white shirt as she tried to dry herself off. <br>\r\n<br>\r\n<i>Slut.</i> Katie thought as she walked passed them to her office. <br>\r\n<br>\r\nIt was a fairly typical day for Katie. Every so often, a drenched executive would poke their head around her door and ask for some files and a secretary in a damp cardigan would enter to tell her a meeting had been scheduled for next week. When lunch time came, she brought out her home packed lunch, which was an attempt to be healthy. Her lunch box contained a salad, which she managed to eat in a few minutes, and which left her stomach rumbling for the next half an hour. <br>\r\n<br>\r\nEventually, she couldn't take the hunger anymore and made her usual trip to the vending machine. To her surprise, Jessica was there, her arms full of chocolate and candy. It was unusual to see the skinny blonde eat anything, let alone a load of junk food. Her suit was still damp from earlier, and looked liked it had shrunken a little with all that water, adding to her already impressive cleavage. Her boobs were stretching her undersized shirt most days but today they looked ready to pop out. <br>\r\n<br>\r\n\"Oh uh...hey Katie...\" Jessica said, blushing as she tried to hide her candy haul. <br>\r\n<br>\r\n\"Hey...\" Katie said, giving her a knowing look. <br>\r\n<br>\r\nJessica hurried off, one hand tugging at her skirt as she went. Katie rolled her eyes and bought herself a muffin before returning to her desk...</span></div></div>",
            "created":1370840400,
            "id":1608868,
            "title":"A Wet Office"
        },
        "13211":{
            "choices":[
                "Jessica stops growing for now, Katie tries to help...",
                "Jessica is still growing! Katie calls in some of the guys to embarrass her..."
            ],
            "content":"<div class=\"\"><div> <span>Later that day, as the rain continued to hammer against her window, Katie realized she needed to talk to that slut Jessica and ask her about a cancelled meeting next week. She hated talking to Jessica; who almost always gave her some excuse for why she had screwed up, blamed someone else and went back to flirting with the nearest guy. Katie rose from her desk and walked down the hall to Jessica's office, only to find the door was closed. <i>Open door policy my ass...</i>Katie thought. <br>\r\n<br>\r\nShe was about to walk away when she heard a moan from the other side of the door. Curiously, she leaned against the door and pressed her ear to the wood, only to hear another, slightly louder moan. Her curiosity not satisfied, she knocked the door. \"Jessica? You in there?\" She called. <br>\r\n<br>\r\n\"Don't come in!\" Jessica shouted back. <br>\r\n<br>\r\n<i>I bet she's screwing some guy in there...well, that's just the sort of thing that could get someone fired,</i> Katie thought with a smile. She pushed open the door, but there was no guy in there. Instead, she found Jessica struggling with her tight shirt. \"Jessica?\" She raised an eyebrow, closing the door behind her. \"What are you doing?\"<br>\r\n<br>\r\n\"Oh God...\" Jessica moaned. \"Something's wrong with me!\"<br>\r\n<br>\r\nThe sexy blonde turned to face Katie, revealing the source of her troubles. Her usually flat stomach was incredibly bloated, making the usually slender girl look nine month's pregnant! The button on her shirt were stretching apart, and by the looks of it, two had already popped open, revealing the bottom of her round belly. <br>\r\n<br>\r\n\"Jesus...what the hell? Are you pregnant?\" Katie asked, confused. <br>\r\n<br>\r\n\"No!\" Jessica snapped. \"How the fuck can I be pregnant?!\" <br>\r\n<br>\r\n\"Well...if you've got a better explanation...\" Katie rolled her eyes. <br>\r\n<br>\r\n\"Urghhhhhhhhhhhh...\" Jessica groaned in response as her shirt tightened even further. Her breasts were practically exploding out of the the top, and the prominent cleavage she always kept on display was spilling out uncontrollably. \"Help meeeeeeeee!\"<br>\r\n<br>\r\n\"I don't know what the hell is happening to you and...wait...are you...growing?!\" Katie leaned in for a closer look, and could see Jessica's stomach visibly swelling like an inflating balloon! She backed away nervously. <br>\r\n<br>\r\nAt that moment, Jessica's shirt finally ripped apart, buttons flying around the room as her breasts jutted forward with a wobble and rested atop her ball shaped stomach. She moaned even louder than before as her tits threatened to escape from her lacey black bra. Katie just stared on in amazement...</span></div></div>",
            "created":1371618000,
            "id":1613763,
            "title":"Jessica's blowing up!"
        },
        "133":{
            "author_id":"rpiii",
            "author_name":"rpiii",
            "choices":[
                "ass, and it was delightful!",
                "ass, and it was terrifying!",
                "exposed belly, and an odd lightheadedness..."
            ],
            "content":"<div class=\"\"><div> <span>After a normal three hour gym session, Samantha stepped out of the gym as sweaty as she'd ever been. As she strode over to her bicycle and mounted it she said to herself,<br>\r\n\"Wow, what a great workout! I'm totally gonna burn off all this winter weight quick at this rate.\" <br>\r\nOf course she was talking about the slight softness in her arms she'd developed and the feminine hips she'd grown into, even though she was still as thin as a rail, in her own mind she was fatter than ever, so far. <br>\r\n<br>\r\nAs she peddled out of the gym parking lot, she noticed the clouds thicken and darken all of a sudden, and before she could wonder whether it was about to rain or not, she could already feel the drops land her exposed skin. Little did she know that her painstaking fitness regime was stuck to in vain. <br>\r\n<br>\r\nShe first noticed an odd sensation in her...</span></div></div>",
            "created":1401990300,
            "id":1807565,
            "title":"Samantha..."
        },
        "1333":{
            "author_id":"rpiii",
            "author_name":"rpiii",
            "choices":[
                "In the hospital ",
                "Laying in the street",
                "Back at home, fat, happy, and normal. "
            ],
            "content":"<div class=\"\"><div> <span>When Sam had leaned back to view the raindrops as they fell, she felt them fall on her stomach, although she also felt... more stomach. Her belly was swelling and softening, her hips widened, arms softened, and her sports bra was entirely uncomfortable. She felt an odd, warm sensation overtake her and she lost her balance, also due in part to her very new fat. She fell and everything faded softly to a lush lavender color until she was unconscious. <br>\r\n<br>\r\nWhen she awoke, Samantha was...</span></div></div>",
            "created":1401990660,
            "id":1807568,
            "title":"exposed belly, and an odd lightheadedness..."
        },
        "13331":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "350 pounds, Sam is shocked and tries to rush out but can't get out of bed",
                "750 pounds, Sam is moved to a shared ward with other heavy victims"
            ],
            "content":"<div class=\"\"><div> <span>Samantha woke up in an unfamiliar place, she was in a bed she didn't recognize in a room she also didn't recognize, she could also feel a strange weight all around her, like she was trying to move through jello pudding but she wasn't yet awake enough to grasp everything that was going on, looking around she could see what looked to be nurses waddling up and down the corridor outside out of her room, she began to piece together she must be in a hospital so she at least began to relax <br>\r\n<br>\r\n\"Samantha Hernandez?\" a particularly plump nurse asked, holding a chart waddling into her room <br>\r\n<br>\r\n\"yes\" Sam groaned back, this weight was really getting her down but she was still so groggy she couldn't work out what it was <br>\r\n<br>\r\n\"You've been caught out a bit under the weather i'm afraid dear, like the rest of us to be honest, but you where found on the street and you seem to have taken the brunt of it\"<br>\r\n<br>\r\n\"the brunt of what?\" Sam asked, now beginning to get a bit worried. <br>\r\n<br>\r\n\"oh dear you don't know? the medias calling it the fat rain until we work out a better or more scientific name for it but to be honest that kind of sums it up the best, can't believe i was a size 8 this morning\" the nurse finished grumbling <br>\r\n<br>\r\n\"Fat rain?\" Sam began to worry a little bit more about why she was finding it hard to move <br>\r\n<br>\r\n\"Well yes, erm..as i said, you where out in it for a while before someone phoned for an ambulance to get your here...and we couldn't get to you as fast as possible due to the initial panic, it's kind of why your weight is now\" <br>\r\n</span></div></div>",
            "created":1402007160,
            "id":1807690,
            "title":"In the hospital "
        },
        "133312":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "continue with the news report",
                "talk to the other women"
            ],
            "content":"<div class=\"\"><div> <span>\"Your weight is now 750 pounds.\" informed the fat nurse.<br>\r\n<br>\r\n\"7-7-750!? gasped the shocked fitness fanatic. <br>\r\n<br>\r\nSamantha's eyed widened as she nervously looked down at her body. <br>\r\n<br>\r\n\"Surely it's a joke. It can't be real. This is just a dream.\" Samantha thought to herself in hopes of delusion.<br>\r\n<br>\r\nHowever it was no joke as Samantha painfully found out. As she looked down in hopes of seeing her tone body she only saw mounds and mounds of unfamiliar fat. She tried to move her limbs however this had grown to be an arduous endeavor with her arms and legs being smothered in fat. The sense of immobility alarmed the exercise junkie as she was so accustomed to agility. No longer possessing her former nimbleness, Samantha's arm slowly raised itself and with great strain too.<br>\r\n<br>\r\n\"No!\" she gasped staring at the hanging arm flab. \"H-how can this be? How could I get so fat!?\" Samantha screamed at the nurse, who like herself had been suddenly fattened by the 'fat rain.'<br>\r\n<br>\r\nUnlike the hysterical Samantha, the nurse retained her composure despite losing her thin physique \"Well Samantha you see you had the misfortune of finishing a heavy workout which had rendered you exhausted so when your body began accumulating fat from the rain it was too tired to handle the rapidly forming weight. To make matters worse you were riding a bike resulting in a crash leaving yourself exposed to the rain. Unlike most people, such as myself, who were walking they could find protection and minimize the fat accumulation. Unfortunately being unaccustomed to excess fat storage, you passed out from the combination of exhaustion and weight gain resulting in you crashing your bike totally exposed to the rain and unluckily left in the rain for quite some time. By the time rescuers came you were lying on the ground with your clothing in shreds.\" the nurse read from a clipboard.<br>\r\n<br>\r\nSamantha was filled with grief. She now looked at the obese nurse who still possessed mobility with envy, <br>\r\n<br>\r\n\"Well what can I do about this?! I NEED to be skinny!\" Samantha bellowed.<br>\r\n<br>\r\n\"As of now all we can do is place you in a ward with other victims such as yourself.\" the nurse stated waving in more nurses, all of them fat, to cart Samantha into the ward.<br>\r\n<br>\r\n\"But what about my weight? Can't you just give me liposuction!?\" Samantha yelled as she was wheeled off.<br>\r\n<br>\r\n\"Hey you're not the only victim around here missy. I've got my own body to worry about. I was 115 pounds yesterday.\" grumbled an annoyed nurse.<br>\r\n<br>\r\n\"Besides the waiting list for lipo is unimaginably long.\" added another nurse.<br>\r\n  <br>\r\n\"No there's got to be something!\" Samantha cried out to the fed up nurses.<br>\r\n<br>\r\nSamantha was pushed into the ward were other extreme cases were. All of the victims were devastated women who were now all obese blobs. Samantha was settled in and the nurses left, clearly busy with other victims. Samantha looked around seeing frightened women who were utterly in freaked out. She also saw a tv with the news on showing an obese news reporter. <br>\r\n<br>\r\n\"Even the news reporter? She was so thin.\" muttered Samantha. <br>\r\n  </span></div></div>",
            "created":1491070560,
            "id":2298187,
            "title":"750 pounds, Sam is moved to a shared ward with ..."
        },
        "134":{
            "choices":[
                "Laurie gets a job offer and has to rush out...",
                "Later, Kristen returns, soaking wet and starving...",
                "Laurie decides to call one of her guy friends to entertain her..."
            ],
            "content":"<div class=\"\"><div> <span>Laurie gave a tired yawn as she woke up and stretched her arms above her head. She rolled onto her side and saw the sleeping, naked guy she had brought back to the apartment last night; the result of one of her drunken nights on the town. She pulled back the covers, and kicked her feet over the edge of the bed - pulling back a curtain as she bared her naked, slender, perfect body to the morning sun. Her apartment was high up on the 20th floor of the building, and she loved to look down on the city below each morning. She stood up, turned around and saw that the guy in her bed was still asleep. She knew she would have to get him out of here before Kristen woke up...<br>\r\n<br>\r\n\"Hey,\" she said, trying to wake him. \"Get up.\"<br>\r\n<br>\r\nWhen he didn't move, she walked round to his side of the bed and prodded him in his muscular chest. <br>\r\n<br>\r\n\"Oooof...\" he grabbed at his chest as he groggily opened his eyes. \"Morning already?\"<br>\r\n<br>\r\n\"Yep,\" Laurie replied, picking his clothes from the floor and tossing them at him. \"You have to go.\"<br>\r\n<br>\r\n\"What, no breakfast?\" He grinned, pulling the covers back as he slipped his underwear on. <br>\r\n<br>\r\n\"Never,\" Laurie smirked. \"Now hurry up, before Kristen sees you.\"<br>\r\n<br>\r\n\"Let her see me,\" her lover smiled, cockily. \"Maybe she can join us next time?\"<br>\r\n<br>\r\nLaurie rolled her eyes. \"Just hurry up.\"<br>\r\n<br>\r\nLaurie slipped on her underwear and slowly opened the door, before ushering the guy, Jake, to the door. She practically pushed him out of the apartment. <br>\r\n<br>\r\n\"When will I see you again?\" Jake asked. <br>\r\n<br>\r\n\"Dunno,\" Laurie shrugged, slamming the door in his face. <br>\r\n<br>\r\n\"Was someone here?\" A voice asked from behind her. <br>\r\n<br>\r\nLaurie turned around to see Kristen standing in the doorway to her bedroom, rubbing her eyes tiredly. Unlike Laurie, Kristen was not quite as stunning as her room mate, but she was not entirely unattractive, possessing a pretty, freckled face and a shapely body. She was a little shorter than Laurie, but was actually a year older than her. She wore loose pajamas, unlike Laurie, who almost always slept in the nude. She had been disapproving of Laurie's nighttime activities in the past, so Laurie tried to conceal her gentlemen callers. <br>\r\n<br>\r\n\"Just getting the mail...\" Laurie lied. <br>\r\n<br>\r\n\"Anything?\" Kristen asked. <br>\r\n<br>\r\n\"Ermm...nope...\" Laurie said, hiding her empty hands behind her back and hoping that Kristen was too tired to notice. <br>\r\n<br>\r\nThey walked into the kitchen and sat down to breakfast; being a little strapped for cash lately, all they ate was a bowl of cereal each, washed down with a glass of orange juice. Laurie had decided that not having money was a helpful way to stay in shape, not that she had ever gained weight in her life. Her metabolism was incredibly high, and she worked out enough to keep her body in perfect condition. Laurie had nothing planned for the day, but Kristen was currently working as a temp for a housing agency and left in a hurry after she realized she was going to be late. <br>\r\n<br>\r\nLaurie was left lounging around the house in her underwear, watching TV and checking her phone; she had applied for more jobs than she could count since moving to the city, but hadn't had much luck so far. She knew she would need to find something soon, before Kristen started accusing her of skimping on the rent. <br>\r\n<br>\r\nOutside, she heard thunder clap, and crossed to the window as rain began to pour down. Suddenly, she was grateful she didn't have to go out today...</span></div></div>",
            "created":1369026000,
            "id":1593818,
            "title":"Laurie"
        },
        "1341":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "she does, she drives to town and gets treated to an odd view of a fattening city",
                "she doesn't, and so begins her great soaking fattening run across town for a job",
                "she finds an umbrella, she gets there dry, everyone else there is soaked "
            ],
            "content":"<div class=\"\"><div> <span>The day proceeded as normal for Laurie, she checked her emails, re read and re wrote her C.V about 5 times before deciding there were no ways to fluff it up further, and just generally resented the working world, 3 months she'd been unemployed and it was beyond the point of annoyance for her <br>\r\n<br>\r\n\"studied 4 years to compete with every other asshole in this city for an entry level internship, yaaaay\" she thought to herself, not seeing the point in getting out of her pajamas at any point today<br>\r\n<br>\r\nsuddenly her mobile went off, it was yet another recruitment agency she'd signed up to a few weeks ago, she'd lost track of who this one was but based on the last few digits she knew it was either about the catering gig or the accountancy position, either way she lit up a little bit as she answered the phone to be told that if she could get across town in 20 minutes, she'd be able to interview for a position at some shitty entry level job, but it was a shitty entry level job hiring now and one that paid better money then unemployment benefits, she'd never gotten dressed so fast in all her life, before long she was out the door dressed to impress in a smart looking business suit and skirt combo with heels that accentuated her height and a top that gave her enough cleavage that she'd either get the job or a meal ticket on the way back <br>\r\n<br>\r\nas she excited the lift to the lobby of her building she had a sudden realisation, her car was in the shop and Kristen had left her phone in the apartment, she had no way to get across town, but still had to be there in<br>\r\n<br>\r\n\"jesus shit monkey balls 14 minutes to go....do i have enough for a cab?\" she thought to herself, scouring her purse as she did so, walking out into the street and the torrential rainfall that awaited her and the city </span></div></div>",
            "created":1369026000,
            "id":1593856,
            "title":"Laurie gets a job offer and has to rush out..."
        },
        "13412":{
            "choices":[
                "She spots her reflection, her suit looks tighter than before...",
                "Another soaking wet woman is in there, ripping out of her clothes..."
            ],
            "content":"<div class=\"\"><div> <span>\"Crap!\" Laurie cursed as she reached into her purse and discovered she had spent the last of her money last night. Getting a taxi was out of the question, and she didn't have time to wait for a bus, even if she could have afforded the full fare. She had no umbrella or any kind of waterproof clothing, so she resigned herself to making the run across town. With no time to lose, she stepped into the pouring rain and hurried as fast as she could. <br>\r\n<br>\r\nUnfortunately, the high heels she had chosen to wear, combined with her tight skirt, restricted her movements somewhat. She knew she must have looked quite ridiculous, trying to run but only managing a girly sort of shuffle as her heels clacked against the wet pavement. The clouds above rained down upon her, drenching her in a matter of minutes. The cleavage exposing top she had chosen didn't do her any favors now either, merely causing the rain to flow quickly between her breasts and soak her entire chest. <br>\r\n<br>\r\nBy the time she had gotten across town, she knew it was too late. Her twenty minute time limit had expire, and it had taken her at least twice that long to get to the interview. Her hair was soaking wet and plastered to her face, her clothes dripping puddles of water on the floor and her shoes squelching as she walked to the reception desk. <br>\r\n<br>\r\n\"Laurie Daniels...\" she sighed, slapping her bag on the desk so hard it caused water to splash into the receptionists face. <br>\r\n<br>\r\nThe receptionist frowned, wiped her face and shook her head. \"You're late. The interviews are over. Next time, Miss Daniels, I suggest you get here on time.\"<br>\r\n<br>\r\nLaurie growled to herself and walked away. \"Bitch...\" she muttered under her breath. She couldn't believe it, all that effort for nothing. All she was get from today was a ruined suit and, most likely, a cold. She spotted a bathroom near the exit, and decided she could at least try and dry herself off a little before she left...</span></div></div>",
            "created":1369371600,
            "id":1596261,
            "title":"Soaked"
        },
        "134121":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "walking back she see's people expanding in the street, not noticing her own gain",
                "she bumps into Kristie, who has been keeping nice and dry "
            ],
            "content":"<div class=\"\"><div> <span>Walking into the bathroom, her shoes still squelching as she went, she put her bag up on the counter, wiping the smudged make up from her face along with a few forced back tears at the injustice of the whole thing, it's not like she wanted to be unemployed, hell she'd sleep with whoever it took to get her a job, but still nothing, just benefits and the kindness of hot guys who want to get in her pants. that's all she had at the minute and it infuriated her. <br>\r\n<br>\r\nLooking into the mirror, fixing her make up while she let her suit jacket dry off over the hand dryer she kept turning on and off to keep it going, she decided to just go back to her apartment and chill out for the rest of the day, but on the way back maybe see if she couldn't pick up a rich meal ticket on the way, she was after all in the business quarter of town, lots of hot single bankers and lawyers around. she'd need to do something about her hair though, she still looked like she'd been dragged through a swimming pool backwards <br>\r\n<br>\r\neventually she'd fixed herself up as best she could and got herself a little bit dryer, as she put her suit jacket back on she couldn't help but notice it was a little bit tighter, looking down she saw her midriff begin to poke out from under her shirt, <br>\r\n<br>\r\n\"oh just great, and now i'm bloated, stupid stress, stupid running, stupid job interview\" she cursed to herself as she went to leave the building, going past the still smug secretary as she could feel her judgemental eyes on her<br>\r\n<br>\r\n\"think's she's so good just cause she's got a job, bitch\" she thought, as she kept walking, pulling the shirt over her midriff as she walked, getting annoyed that it wouldn't stay down when she did so, it kept riding back up. not only that but her thighs where beginning to rub up against each other<br>\r\n<br>\r\n\"christ on sale how can this day get any worse\" she thought as she stepped back outside, somewhat relieved to at least see the rain had quietened down </span></div></div>",
            "created":1369458000,
            "id":1596614,
            "title":"She spots her reflection, her suit looks tighte..."
        },
        "1341212":{
            "choices":[
                "Laurie begins to feel very hungry, they stop for something to eat...",
                "They get home, Kristie jumps in a hot bath, while Laurie comfort eats"
            ],
            "content":"<div class=\"\"><div> <span>Laurie grumbled to herself as she walked back outside into the rain, which had barely let up since she had come inside. The sooner she got home, the better. She was just about to set off, when she saw a familiar figure walking towards her; it was Kristie, and she was carrying an umbrella! <i>\"I'm saved!\"</i> Laurie thought happily. <br>\r\n<br>\r\n\"Kristie! Kristie!\" Laurie waved excitedly, not noticing how her jostling had caused her shirt to untuck itself from her short skirt. <br>\r\n<br>\r\n\"Laurie? What are you doing down here?\" Kristie asked, welcoming her roommate under the umbrella. <br>\r\n<br>\r\n\"Ugh, stupid job interview that I was freaking late for, they refused to see me,\" Laurie said, rubbing her shoulders to keep herself warm as she joined Kristie under the umbrella. \"What about you? Thought you had a house viewing?\"<br>\r\n<br>\r\n\"It got cancelled, apparently the prospective owners weren't feeling too well,\" Kristie shrugged. \"Lots of people at work were off sick too, so they told me to just take the day off. Weird thing to say...but hey, I'm not complaining. As long as they pay me.\"<br>\r\n<br>\r\n\"If they'd given me some more notice I might have made it, I mean, who can get downtown in twenty minutes without a cab?!\" Laurie went on. \"And I'm soaking wet. Hope I don't catch a cold. This weather has ruined my best suit. I think it's shrunk or something...\"<br>\r\n<br>\r\nLaurie tugged at her clothing, which had begun to feel rather uncomfortable; the fabric chafing her stomach and thighs. Her breasts were still pretty damp, and her wet bra was becoming quite irritable as well. She couldn't wait to get home and jump in a hot bath. She and Kristie made their way back home; it was a long walk, but at least it was a dry one. Laurie didn't get much of a chance to dry off, but she would have plenty of time for that when she got back...</span></div></div>",
            "created":1369890000,
            "id":1600251,
            "title":"Kristie to the rescue!"
        },
        "13412122":{
            "choices":[
                "Laurie notices her belly bloating even larger...",
                "The next morning, Laurie and Kristie have gained a few pounds..."
            ],
            "content":"<div class=\"\"><div> <span>When they finally arrived back at the apartment, Laurie felt exhausted. She hadn't had the most tiring day, but the hurried trip downtown, combined with the stress of losing the job offer and the frustration at that smug secretary had left her feeling pretty tired. Her clothes were damp and uncomfortable, but she had been spared the rest of the downpour when Kristie had volunteered the use of her umbrella. While Kristie's surprise appearance had helped her to stay dry, she couldn't help but feel annoyed that her hard working room mate had caught her screwing up another job offer. <br>\r\n<br>\r\n\"You want to take a bath?\" Kristie asked, dumping her wet umbrella by the door. <br>\r\n<br>\r\nLaurie unbuttoned her jacket and threw it on the sofa. \"Meh...don't really feel like it,\" she shrugged. <br>\r\n<br>\r\n\"You sure? You might catch a cold?\" Kristie said. <br>\r\n<br>\r\nLaurie shook her head. \"Maybe later, I'm going to get something to eat first.\"<br>\r\n<br>\r\n\"Okay, mind if I use the bathroom then?\" Kristie asked. <br>\r\n<br>\r\n\"Go for it,\" Laurie said. <br>\r\n<br>\r\nKristie grabbed a towel and headed into the bathroom, while Laurie walked to her bedroom and began to slip out of her wet clothes. She knew she should have taken a shower, at least, but she just couldn't be bothered right now - she had spent enough time in the water today. She peeled off her soaking wet shirt and threw it in her laundry basket, then shuffled out of her skirt. Her habit of choosing tight clothing that drew attention to her figure had backfired today, making everything she was wearing uncomfortable and constricting. <br>\r\n<br>\r\nShe hurriedly removed her underwear and walked over to her mirror to take in her naked body; once again her attention was drawn to her stomach, which looked a little bloated, which was strange, as she had hardly eaten today. Maybe it was the stress? She certainly hadn't noticed it last night. Turning around, she admired the sight of her bare butt and ran her hand over her left ass cheek...did that look bigger too?! She gently ran a hand over her smooth ass and gave it a squeeze, and could have sworn it looked larger than normal...not that that was entirely unwelcome...it looked pretty dam sexy. Perhaps she had been unknowingly gaining weight? <br>\r\n<br>\r\nNo, that couldn't be right. She never gained weight. She was probably imagining things. Laurie pulled on her pajama bottoms and a loose tank top and made her way to the kitchen, where she grabbed a handful of junkfood and took up a seat on the sofa. She switched the TV on, lay back and began to munch down on her small feast of chips, nachos and cookie dough, served with a large bottle of pepsi. It was comfort food, and she knew it. </span></div></div>",
            "created":1371186000,
            "id":1610967,
            "title":"Comfort"
        },
        "134121221":{
            "choices":[
                "Laurie wakes up in the morning...does her belly look bigger?!",
                "Laurie wakes up for a midnight snack..."
            ],
            "content":"<div class=\"\"><div> <span>Laurie continued to much her junkfood as she watched some trashy reality TV show. When her cookie dough was gone, she went to the kitchen to fetch a tub of ice cream and a spoon, just as Kristie emerged from the bathroom wrapped in a towel. Kristie's body wasn't quite as toned and fit as Laurie's, and Laurie could make out her curves beneath the towel - but she was still in pretty good shape. She smiled as she hurried past Laurie and disappeared into her room, leaving Laurie to return to the couch. <br>\r\n<br>\r\nLaurie spent the rest of the night glued to the couch. Kristie emerged at one point to make herself a sandwich, after which she sat beside Laurie and advised her to eat something more substantial than chips and dip. Laurie wanted to argue, but knew that Kristie was making a valid point - but she had eaten so much junk at this point that she didn't feel like eating dinner. <br>\r\n<br>\r\nAfter Kristie had returned to her room, Laurie finished off the last of her Pepsi. \"URP!\" She belched noisily and scratched her belly absent mindedly, only to find it feeling a lot more full than earlier. When she glanced down, she was surprised by how bloated she was, and immediately pulled her tank top up to get a better look at her stomach. <br>\r\n<br>\r\n\"Oh man...I look stuffed!\" She moaned, rubbing her bulging belly. Strangely though, she didn't <i>feel </i>all that full. She couldn't remember the last time her stomach had looked this big...not even after a big meal. She rose from her seat for the first time in a few hours and pulled her top down, not noticing that it left her belly button on display. \"Guess I better go to bed.\"<br>\r\n<br>\r\nLaurie returned to her room and collapsed into bed, feeling like she had achieved nothing at all today. </span></div></div>",
            "created":1371358800,
            "id":1612032,
            "title":"Bloating"
        },
        "1341212212":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "Both in the upper 200's they turn the TV on and see it's not just them affected",
                "They don't notice the weight, only how filthy they are, they both take baths"
            ],
            "content":"<div class=\"\"><div> <span>It felt like she'd only closed her eyes for a brief moment before Laurie found herself opening them again, the only difference being that now her clock read 01:00 am and her stomach was growling like an aggravated doberman, shuffling to her feet, not noticing the extra pudge that had started to form around her mid riff or the extra thickness of her arms or how her breasts where straining against her night top, she made her way in a half sleepy drowsy walk to the kitchen to raid whatever she could find in the cupboards or fridge <br>\r\n<br>\r\nwhen she got in she was surprised to see she wasn't the only one in there as well, Kristie was already sat at their kitchen table, munching away on some microwaved deep fat fried snack. it was still too dark in their poorly lit kitchen and still too early in the morning for Laurie to notice the other wrappers and left overs that where strewn around Kristie's chair and staining her top, or that her usually meager tummy was bulging out over her sweatpants. Kristie either didn't notice herself or didn't care as she reached for a bar of candy to munch on while she fried herself some eggs, Laurie pulling a high fat chocolate cake out of the fridge to sate her growing hunger on, the two barely grunting in acknowledgement at each other. so focused where they on filling their stomachs<br>\r\n<br>\r\nan hour or so into their respective binge sessions they'd both discarded their tops and where eating with complete disregard for their dignity or modesty, their full breasts getting fuller and heavier with each pound of fattening treat that went into their gaping maws. Kristies sweat pants bulging out as her ass and thighs swelled while Lauries panties became more and more wedged up her ever expanding ass crack<br>\r\n<br>\r\neventually dawns first light began to creep in  through their blinds, looking at the microwaves clock Laurie saw it was just starting to turn 5. with thunder clapping off in the distance she could guess what the weather would be like again today enough to know she wasn't going outside even if someone phoned with a job interview, yesterday was bad enough she didn't need today being just as shit. she resolved to just take a lazy day on the sofa again, chilling out and grazing on chips and popcorn while wrapped up in her duvet. <br>\r\n<br>\r\nlooking over to share her plans with Kristie Laurie began to realize the state her roommate had gotten herself into, her usual trim and proper self looking disheveled and gluttonous, food stains adorning her face and newly acquired second chin, with her breasts flopping out onto her relatively larger tummy. <br>\r\n<br>\r\nLaurie gasped, surprised to find Kristie returning the expression as she saw Laurie and finally realized what she looked like too. </span></div></div>",
            "created":1371358800,
            "id":1612061,
            "title":"Laurie wakes up for a midnight snack..."
        },
        "13412122122":{
            "choices":[
                "Laurie and Kristie start feeling horny, they take a bath together...",
                "Laurie goes first, she freaks out when she sees herself in the mirror!"
            ],
            "content":"<div class=\"\"><div> <span>\"Urghhh...<b>URRRRRP</b>...\" Laurie belched and rubbed her bulging belly. For the first time, she noticed that her boobs were hanging out, and quickly covered herself up. She wasn't sure how she had gotten into this slovenly state, and couldn't even remember taking her top off...what had made her reveal herself to Kristie like that?! She groaned and tried to suppress another belch, but it was a useless effort, and she burped even louder than before. <br>\r\n<br>\r\nKristie went bright red as she covered up her own exposed boobs awkwardly. Her face covered with crumbs and sauce, she looked across at Laurie and gave a moan. \"How...how did we eat all that food?\" She asked in disbelief. <br>\r\n<br>\r\n\"I...I don't know...\" Laurie groaned, feeling so full she might burst. She couldn't believe how bloated she had gotten. Her bulging tummy was covered in food stains, and she looked a complete mess. <br>\r\n<br>\r\n\"I think I'm gonna pop...\" Kristie lent back in her chair. \"And I'm such a mess!\"<br>\r\n<br>\r\n\"Me too...\" Laurie said, astonished at how filthy she had become during her binge. \"We should clean up.\"<br>\r\n<br>\r\nKristie nodded and rose from the table, exposing the full expanse of her bare belly. Neither girl paid too much attention to their expanding waistlines as they slowly got to their feet, but if they had, they would have noticed an extra fifty pounds had been added to each of their bodies. Kristie had gained a slight double chin, and her thighs, breasts and butt had all swollen a little larger, while her arms and legs had definitely become a little chunkier. Her stomach bulged out considerably, but was not quite as globular as Laurie's new-found potbelly. <br>\r\n<br>\r\nUnlike Kristie, who had mostly gained evenly all over her newly chubbified body; Laurie had mainly packed her weight on in her breasts and belly. Her boobs had increased by at least one cup size, if not two, but had stayed quite firm so far. Her belly, on the other hand, had grown much softer, and resembled that of a pregnant woman's, large and round and very, very bloated looking. Her butt had gained a little padding, but was still relatively small when compared to her belly. None the less, her pajama bottoms had tightened around her expanded rear, exposing the top of her ass. <br>\r\n<br>\r\n\"Do you want to go first?\" Kristie asked. \"I took a bath earlier.\"</span></div></div>",
            "created":1371358800,
            "id":1612079,
            "title":"Bathtime"
        },
        "134121221221":{
            "choices":[
                "Laurie and Kristie gain another few pounds while they bathe...",
                "They are disturbed by a knock at the door..."
            ],
            "content":"<div class=\"\"><div> <span>Laurie eyed up her room mate...standing there in front of her half naked, hands covering her surprisingly ample breasts, and for the first time ever...she was turned on. Laurie had experimented with all sorts of things in college, and this wasn't the first time she had been aroused by a woman, but it was certainly the first time she had felt that way about Kristie. Her instincts took control, and she walked over to her friend and slid her hands down her bloated, messy stomach, exposing her own naked boobs in the process. <br>\r\n<br>\r\n\"Wh...what are you...\" Kristie shuddered, blushing. <br>\r\n<br>\r\n\"Let's take a bath together,\" Laurie said seductively. <br>\r\n<br>\r\nKristie went a deep shade of red and pulled away. \"But...I...we...\"<br>\r\n<br>\r\nLaurie didn't let her get far before she wrapped her hands around Kristie's chest, squeezing her breasts up against Kristie's hands as the nervous girl tried to keep herself covered. Slowly, Laurie ran her left hand down her friend's bare belly and slid it beneath her pajama bottoms, eliciting a soft moan from Kristie, who instinctively released her grip on her boobs and let them push up against Laurie's with a satisfied grunt. Their overstuffed bellies squashed together as Laurie caressed Kristie's ass - both girls still oblivious to their added poundage. <br>\r\n<br>\r\n\"About that bath...\" Laurie smiled. <br>\r\n<br>\r\nKristie just nodded eagerly. Laurie took her by the hand and led her into the bathroom, quickly turning on the taps to fill up the bathtub - it wasn't huge, but Laurie had entertained male company in there before and knew all too well that it could fit two people, at least. While the water began to rise and steam filled the air, Laurie pulled down her bottoms and perched on the edge of the tub, reveling in her nudity. \"Take those off,\" she gestured at Kristie. <br>\r\n<br>\r\nKristie, who was still looking anxious, gently shuffled out of her satin pajama pants and walked towards Laurie, who grabbed hold of her and pulled her forwards, gripping her plump butt cheeks with a cheeky smile. Kristie gasped, and Laurie looked up at her chocolate covered face and laughed. \"We really have to scrub you clean,\" she said. <br>\r\n<br>\r\nKristie giggled. \"Hey, you're dirty too,\" she playfully poked Laurie's boobs, which seemed to be smeared with ketchup. <br>\r\n<br>\r\nWhen the bath was finally full, Laurie climbed in first and beckoned Kristie to follow. The two bloated girls slipped into the water and began to wash the food stains from their arms and stomachs, wondering how they had managed to get so dirty from a single meal. Both remained completely oblivious to the extra fat that had accumulated on their still-slender frames, too horny to really pay attention to what was happening to them. Laurie tipped some soap into the bath and created a huge amount of bubbles, while Kristie poured some expensive looking oils over her breasts. Before she could start rubbing the oil in, Laurie was on her, massaging her tits eagerly. Kristie could only groan pleasurably in response...<br>\r\n<br>\r\n\"I can't believe we're...doing...this...\" Kristie panted. <br>\r\n<br>\r\n\"You have such nice tits...\" Laurie replied with a sultry smile, enjoying her soft and round her friend's boobs had become. She couldn't recall them looking this big before. <br>\r\n<br>\r\nKristie suddenly grabbed hold of Laurie and spun her around, so that she was on top of her, their wet bodies pressed together under the water. Laurie laughed, squeezed her friend's ass and washed the last of the mess from their bodies...</span></div></div>",
            "created":1371618000,
            "id":1613756,
            "title":"In the tub"
        },
        "1341212212211":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "Kristie eventually fattens up enough to burst out of the tub at 500 pounds.",
                "Laurie tries to help her out the tub, but a knock at the door demands attention"
            ],
            "content":"<div class=\"\"><div> <span>as the pair continued to scrub and tease each other, they might of failed to notice the weight being added to them, but they couldn't help but notice the bath getting rather tight, they where facing each other, straddling each other so their bloated slowly fattening bellies where smooshed together in jiggling erotic ecstasy as they both noticed a distinct lack of movement range available to them <br>\r\n<br>\r\n\"Hey Laurie, is this bath getting smaller?\" Kristie asked, gasping as Laurie continued to stroke and rub oil into her fattening breasts <br>\r\n<br>\r\n\"I don't see how it could be, we're probably just positioned wrong\" Laurie replied huskily, as she began to push Kristie back so she was resting against the back of the tub, her body pinned under Laurie's expanding girth  <br>\r\n<br>\r\nthis bought the two of them, at most, an extra minute or two before they found themselves once again rubbing against the sides of the bath<br>\r\n<br>\r\n\"It definitely feels like it's getting smaller\" Kristie moaned, as Laurie began to slip a hand underneath her lowermost belly roll <br>\r\n<br>\r\n\"you must be delirious with pleasure \" Laurie whispered to her as she began to nibble on Kristies earlobes, causing her roommate to bite her lower lip in wild excitement <br>\r\n<br>\r\nHowever eventually the two of them couldn't put off physics any longer, with Laurie being forcefully ejected from the tub by the force created by their rapidly expanding bodies <br>\r\n<br>\r\nall 280 pounds of her flopped down onto the cool laminate floor, water cascading down around her as she lay there, her belly now a full blown gut with multiple rolls, her breasts framing it as they had crept up several sizes, her ass spreading out against the floor as the two looked at each other and slowly started coming to a realization about their predicament.<br>\r\n<br>\r\n\"Kristie i don't think the tub's getting smaller\" Laurie blurted out, finally actually getting a look at Kristie's bloated form, firmly wedged into the bath as more and more of the fattening water seeped into her body, adding pound after pound to her already expansive form <br>\r\n<br>\r\n\"Laurie....i'm stuck\" Kristie replied, her voice still laced with lust. </span></div></div>",
            "created":1371618000,
            "id":1613789,
            "title":"Laurie and Kristie gain another few pounds whil..."
        },
        "13412122122111":{
            "choices":[
                "They switch on the TV and find out more...",
                "Laurie has a theory, she climbs back in the tub..."
            ],
            "content":"<div class=\"\"><div> <span>For the first time, Laurie saw the truth of their situation. As she heaved her body up from the tiled floor, her legs nearly buckled under her increased weight. Her previously round, bloated stomach had lost some of it's shape and begun to sag down. She struggled forward, horrified by the transformation she was undergoing, and moved in front of the mirror to examine the full extent of the damage. Her hands sunk into her soft, flabby gut, poking and prodding the extra flesh to make sure it was real. She turned to the side and saw her mammoth buttocks swelling and gave a moan of terror. <br>\r\n<br>\r\n\"Laurie! Help me!\" Kristie squealed from behind her. <br>\r\n<br>\r\nLaurie turned around so quickly that she nearly toppled over. Her beautiful, sexy body had vanished, replaced by a bloated, chubby figure she didn't recognize. She tried to stay focused as she made her way back to the tub, her walk now turning into a waddle. She had stopped swelling for the moment, but Kristie hadn't been so lucky. Laurie could see her stomach blowing up like a balloon, rising from beneath the water like a miniature Island as it grew rounder and fatter by the second. Kristie was trying to wriggle free, but it was no use, she was wedged firmly in place by her rapidly expanding body. <br>\r\n<br>\r\n\"Oh God...what's happening to us?!\" Laurie groaned, staring down at her chubby body in disbelief. \"This can't be real!\"<br>\r\n<br>\r\nKristie let out another moan and began to cry as she watched herself bloat up uncontrollably. Her stomach was now so large that it was making a squeaking noise as it pushed against the sides of the tub, continuing it's expansion. Her tits were heaving up and down as she began to breathe more heavily, and with each breath she took, they seemed to push out even more. On top of that, her butt was growing so wide that she was actually starting to inch up higher and higher, revealing more and more of her flabby gut. <br>\r\n<br>\r\n\"I don't want to be like this!\" Kristie sobbed. \"I'm so fat!\"<br>\r\n<br>\r\nLaurie made an attempt to pull her friend from the tub, but Kristie was definitely not going to budge. After a few minutes, Laurie had to take a step back, exhausted. She watched helplessly as Kristie gained a prominent double chin, her boobs sagged down over her massive gut and the bath creaked around her weight. She didn't know what to do...about herself...about Kristie...about any of this. What the hell was happening here?!<br>\r\n<br>\r\n\"Ooooourghhhhhhhhhhhhaaaaaaaaa!\" Kristie let out a scream as the tub gave up the struggle to contain her flab. Her belly popped up and over the sides of the tub and her entire body burst free, slamming her right onto her back at Laurie's feet. She was at least twice the size of her room mate now, absolutely gigantic, and barely recognizable as the petite girl Laurie knew. All five hundred pounds of her quivered and shook as she lay helpless on the floor, pinned under her own massive gut, sobbing uncontrollably.  <br>\r\n<br>\r\n\"This can't be happening...this can't be happening...\" Laurie repeated to herself as she stared at her pudgy reflection. </span></div></div>",
            "created":1371618000,
            "id":1613845,
            "title":"Huge Kristie"
        },
        "134121221221111":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "There was a knock at the door, Their normally fat friend had come round to visit",
                "The phone rang, it was one of Laurie's booty calls"
            ],
            "content":"<div class=\"\"><div> <span>Seeing that Kirstie had obviously gotten the heavier end of the the situation, Laurie put off her panic for a little while as she squatted down to comfort her friend, stroking Kristie's chins as she reassured her <br>\r\n<br>\r\n\"sshhh...i'm sure this isn't effecting just us...this is one of those things that the news'll be all over and have answers for, come on let's go see what's up\" She said, kissing Kristie on the forehead to help calm her down<br>\r\n<br>\r\n\"ok Laurie....i need some help getting up though\" Kristie muttered, as she struggled with all of her new weight <br>\r\n<br>\r\nEventually after much grunting and pulling Laurie got Kristie to her fat feet, which where themselves beginning to be draped in ankle fat, her legs the size of Lauries old waist and her belly sticking out far in front of her, her Breasts finally bigger then Lauries, Something Kristie would normally be happy about if she didn't have Laurie beat on Chin count and ass size as well<br>\r\n<br>\r\nHuffing and puffing the two waddled their way into the living room, wrapped in some towels to dry themselves off with and covering each other with blankets to afford some modesty to one another (their lust having dissipated some time ago) Kristie flopped down onto their sofa, wincing at the amount of space she took up on it and the sounds of protest it made as her weight hit it <br>\r\n<br>\r\n\"Hold on...i'll get us some snacks\" Laurie said<br>\r\n<br>\r\n\"are you....serious.....Laurie\" Kristie panted out, still quite winded from their walk across the apartment <br>\r\n<br>\r\n\"well, aren't you hungry as well\" Laurie shouted back from the kitchen, reappearing with two bags of chocolate covered pretzals for the two to graze on while they watched the news, Laurie turned the TV on to the central news station and flopped herself down in the remaining space left on the sofa <br>\r\n<br>\r\nimmediately the pair where shocked to see the normaly svelte and athletic news casters looking like bloated parodies of themselves  <br>\r\n<br>\r\n\"and once again the top story at the minute, all across America, with reports coming in from around the globe as well, the world seems to be undergoing some kind of fat metamorphosis, with scientists as yet still remaining silent about the cause or indeed any news of a cure, the general theory seems to be that any untreated water can cause or indeed exaggerate the symptoms of this fattening phenomenon\" Lorraine Bleathery read from the teleprompter, her bloated face staring into the camera, her normal trademark red dress having been replaced with a XXL Sweat suit that was a stark unflattering contrast from her usual attire<br>\r\n<br>\r\n\"yes Diane, health officials are warning all those effected to stay indoors and drink only boiled or bottled water, and if possible avoid going outside during wet weather, bathing or indeed, swimming, if that's what your into\" Keith Kelvinson huffed out bitterly, the fatter of the two news anchors, known for his joy of ocean swimming and diving, clearly was annoyed by the last point. as his quad chinned face jiggled away on the screen, Kristie began to feel a little bit better about her own situation <br>\r\n<br>\r\n\"so...we really shouldn't of had that bath then\" Kristie joked, muting the tv as she did <br>\r\n<br>\r\n\"sure seem's that way, but what do we do, we need food, we're almost out, it's nice enough weather outside, but which of us has clothes anymore to go down to the store and pick up supplies\" said Laurie, her stomach beginning to rumble as she did <br>\r\n<br>\r\n\"assuming there's any left\" <br>\r\n<br>\r\n\"oh god i didn't think of that......order takeout?\" <br>\r\n<br>\r\n\"takeout seems good\" <br>\r\n<br>\r\n\"and we'll get some baggy clothes online while we're here, so we can go sort something out more long term later on\" <br>\r\n<br>\r\n\"sounds like a plan\" Kristie huffed attempting to rise from the sofa to get to the phone, still pinned by her weight <br>\r\n<br>\r\n\"just stay here and keep watching the news, i'll do it\" Laurie giggled a bit, quickly stopping when she saw the look on Kristie's fat face <br>\r\n<br>\r\nAs Laurie waddled off to get to the phone Kristie settled back into the sofa and kept watching the news, the images of fattened blobs and obese celebrities cheering her up a bit more about her own weight. <br>\r\n<br>\r\nBefore Laurie could pick up the phone </span></div></div>",
            "created":1371790800,
            "id":1615234,
            "title":"They switch on the TV and find out more..."
        },
        "1341212212211111":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "Laurie asks her why she's really come round to \"visit\"",
                "Kristie drinks the entire 6 pack and notices the lids aren't actually sealed"
            ],
            "content":"<div class=\"\"><div> <span>Deciding to put off the phone call, Laurie waddled to their front door, looking through the peephole she saw a welcome sight and opened the door to Laurie and Kristie's mutual friend, Jasmine <br>\r\n<br>\r\n\"Wow Laurie, you do something to your hair?\" Jasmine joked, bustling her way past Laurie into the apartment, not waiting to be invited in, dragging in with her 4 full bags of groceries and goodies. <br>\r\n<br>\r\n\"sure, come in, why not, no no i insist\" Laurie muttered under her breath, closing the front door and following jasmine back into the living room. getting her first good look at their friend and finding herself caught in a mixture of annoyance and relief <br>\r\n<br>\r\nFortunately the fattening hadn't affected Jasmine, however annoyingly both Laurie and Kristie where now fatter then she was, which now made Jasmine the skinny one in the group for a change, much to Jasmines visible joy as she got a look at Kristie stuck to the sofa by her gut <br>\r\n<br>\r\nJasmine was just as fat and chunky as she normally was, weighing in at 250 pounds Laurie outweighed her by 30 or so pounds, Jasmine knew how to carry her weight though, coming from a Mediterranean family of chefs she was never likely to be thin anyway, so she'd embraced her weight and dressed and styled herself accordingly, her belly was wrapped up in a sultry sundress while her thighs where dressed in black tights that made her curves radiate her sexy voluptuous appearence even better, her arm fat draping down with her breasts bulging out atop her belly and her second chin framed nicely by her luxuriant raven black hair<br>\r\n<br>\r\n\"well, haven't you had a shower in the last few days then Jasmine\" Laurie asked rather bluntly, somewhat annoyed at now being fatter then her fat friend<br>\r\n<br>\r\n\"oh dear Laurie of course i have, i just happened to see 1st hand what exposure can do to people, you know my apartment overlooks the swimming lake, seeing people burst out of their swimsuits was amusing at first but i've been bathing with bottled water for the last day or two, anyway, i thought i'd come check up on you two, and it looks like it's a good thing i did\"<br>\r\n<br>\r\n\"what'd you bring\" Kristie huffed from the sofa, she was still attempting to wriggle from the sofa but still wasn't used to the weight enough to get up without help. <br>\r\n<br>\r\nJasmine opened the bags to reveal several days worth of food, even for girls their size, and more importantly 2 bags filled to the brim with bottled water<br>\r\n<br>\r\n\"this should help us see this out for a while, at least until the government sorts something a bit more long term out\" she said, smiling as she handed Laurie and Kristie bottles and swanned off to the kitchen to start cooking them some dinner <br>\r\n<br>\r\nKristie began to drink from the bottle, thankful to be able to drink something that wouldn't cause her to get any fatter, she had accumulated quite a thirst trying to get out of the clutches of their sofa. Laurie left a 6 pack of bottled water next to Kristie as she went to follow Jasmine into the kitchen, reminding Kristie not to drink it all at once (\"this has to last us a while remember girl\") <br>\r\n<br>\r\nin the kitchen Jasmine was humming away to herself, a smile on her wide face as she prepared dinner for the three of them, Laurie was less then optimistic about the situation. Jasmine might of been her happy fat friend, but she knew she was less then thrilled by the label no matter what she might of said in their social circle <br>\r\n<br>\r\n</span></div></div>",
            "created":1371963600,
            "id":1616393,
            "title":"There was a knock at the door, Their normally f..."
        },
        "13412122122111112":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "She balloons up from 500 pounds to well into the 800's and breaks the sofa ",
                "In the kitchen Laurie keeps asking Jasmine how she hasn't been infected so far"
            ],
            "content":"<div class=\"\"><div> <span>As Laurie and Jasmine had their little chat in the kitchen Kristie continued to drink from the bottles that Jasmine had left by her on the couch, she was insanely thirsty and couldn't drink it fast enough, her new weight was causing her to even be clumsy with something as simple as grabbing the bottles and twisting the caps off, she could even swear some of them just fell away. <br>\r\n<br>\r\n\"Hang on\" she thought to herself, \"Have I unscrewed these caps already or has the seal always been like this?\" <br>\r\nthe more she thought about it the more she dismissed it as paranoia, Jasmine was her friend, she wouldn't intentionally try and fatten her up with water, would she? <br>\r\n<br>\r\n\"Oh dear...I should probably get Laurie in on this to see what she thinks\" Kristie continued her inner monolouge as she watched the news footage of fat people waddling about confused and hungry in the rain, before she began to feel a rumbling in her stomach that she could only put down to what she'd been drinking.<br>\r\n<br>\r\n\"Uh oh....\" </span></div></div>",
            "created":1407447240,
            "id":1838712,
            "title":"Kristie drinks the entire 6 pack and notices th..."
        },
        "14":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "Fat Food",
                "Readers Choice",
                "Readers Choice",
                "Readers Choice",
                "More options"
            ],
            "content":"<div class=\"\"><div> <span>More options <br>\r\n<br>\r\n1.) Fast Food is deemed to be the only food, a highly addictive substance is introduced into a fast food chain, the populous grows fat on the resulting influx and mass availability of the delicious incredibly moreish food, the focus is on a college campus<br>\r\n<br>\r\n2.) Readers choice<br>\r\n<br>\r\n3.) Readers choice <br>\r\n<br>\r\n4.) Readers choice </span></div></div>",
            "created":1394313420,
            "id":1757468,
            "title":"More options"
        },
        "15":{
            "choices":[
                "Her hunger gets the best of her and she stops for a big meal",
                "She decides to go visit some of her friends",
                "A little extra weight of hers starts to show as time goes on"
            ],
            "content":"<div class=\"\"><div> <span>\"Faterus?\" Brandy asked, \"What the heck is that?\"<br>\r\n<br>\r\nBrandy, a young, 22-year old blonde woman, had woken up that morning with extreme pangs in her stomach. At first, she thought she was just really hungry. But after a rather large breakfast, she decided to visit the doctor's as her hunger didn't go away. The older, graying doctor confirmed as he looked through the results.<br>\r\n<br>\r\n\"It's a very complicated illness,\" he said, \"You're gonna be absolutely starving for the next 24 hours, no matter how much you eat or satiate yourself. You'll also be releasing gas quite frequently\"<br>\r\n<br>\r\n\"Where did it come from?\" she asked, clutching her growling stomach. The doctor just shook his head.<br>\r\n<br>\r\n\"We wish we knew,\" he replied, \"This symptom has only started popping up earlier this year, mainly overseas. You're the first one in this state showing signs of it that I know of,\"<br>\r\n<br>\r\nBrandy gulped.<br>\r\n<br>\r\n\"What's gonna happen?\"<br>\r\n<br>\r\n\"It's nothing serious or fatal, but you'll be experiencing some permanent changes. How much did you eat this morning?\"<br>\r\n<br>\r\n\"Oh... I had a whole box of cereal, and when that didn't work I tried drinking a bunch of soda...\"<br>\r\n<br>\r\nThe doctor calculated something in his head.<br>\r\n<br>\r\n\"Hmmm... 20-30ish pounds?\" he said.<br>\r\n<br>\r\n\"What are you talking about?\" Brandy asked.<br>\r\n<br>\r\n\"Well, for a while you won't change much. But over the next 24-hours, depending on how much you eat you'll gain permanent weight. From what we understand, it's impossible to lose if you gain it during your initial Faterus infection,\"<br>\r\n<br>\r\n\"WHAT!?\" Brandy gasped, \"Bu-but, I'm so skinny, much skinnier than my friends! Are you telling me I have to starve?\"<br>\r\n<br>\r\n\"Not completely starve, just maybe watching what you eat for the rest of the day. Your stomach is gonna constantly be miserable and starving, but you have to be careful of how you treat it,\"<br>\r\n<br>\r\nHe went to the nearby cupboard and took out some tablets.<br>\r\n<br>\r\n\"Unfortunately, stomach relievers don't help, but I hear you may need these gas tablets for your releases...\"<br>\r\n<br>\r\nBrandy just rolled her eyes as she took them. She didn't need gas relief right now, she needed some stomach relief.<br>\r\n<br>\r\n\"What am I supposed to do now?\"<br>\r\n<br>\r\n\"Just try to take it easy and try not to eat too much. It should mostly be gone after the period, but---\"<br>\r\n<br>\r\n\"Ugh, whatever, thanks,\" Brandy scoffed as she left the room.<br>\r\n<br>\r\nShe couldn't keep her mind focused as her stomach rumbled and churned. She was sooooooo hungry but was told she was gonna gain weight?<br>\r\n<br>\r\n\"No way, my metabolism is great!\" she thought, \"I'm not gonna turn into a lardass or anything!\"<br>\r\n<br>\r\nAs she walked outside, her butt rumbled a bit. PHHHFRT! A packed fart escaped her rear, entering the atmosphere. Brandy just scoffed as she toom out her gas tablets.<br>\r\n<br>\r\n\"Like I need these,\" she grunted as she chucked them into a nearby trash can, \"I can handle a little poot or two...\"<br>\r\n<br>\r\nShe walked off down the street, her released scent flowing through the city...</span></div></div>",
            "created":1380258000,
            "id":1670861,
            "title":"Get Fat with the Sickness"
        },
        "151":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "Keep the focus on Brandy (patient Zero) as she goes on a fast food binge crawl",
                "Brandy's roommate Scarlet walks past and snaps Brandy out of her food trance",
                "Brandy snaps out of this herself and runs out of the restaurant in panic "
            ],
            "content":"<div class=\"\"><div> <span>Brandy couldn't help but mull over what the doctor had said, but at the same time she also didn't see much point in worrying. <br>\r\n<br>\r\n\"A sickness that causes you to gain weight, yeah right like that's even a thing\" she laughed to herself before being silenced by her grumbling empty stomach as it roared in protest at being so empty, \"but everything else he said seems to be at least a little bit true..\" she moaned and tried to rub away the discomfort in her belly as best she could before she realised where it was she had walked to on auto pilot. she was standing in front of the neon sign of her local fried chicken joint, the smells from inside wafting out to her and causing her to waft out a few of her own smells as she power walked up to the till and ordered every bucket based item on the menu before sitting down surrounded by greasy fried chicken. <br>\r\n<br>\r\nHer body reacted on instinct as she began to slowly and methodically eat her way through the first bucket, her stomach beginning to give her a glimpse of satisfaction before it escaped out of her ass, grumbling and moaning in disappointment she started to work on the second bucket of chicken wings, dipping them in bbq sauce and the remaining grease deposits of the last bucket, she didn't pay any attention to anything else so enamored was she by the tastes and smells that she was devouring and the slight comfort brought to her by keeping her mouth full and her gut sated that she failed to notice the discomfort she was causing the other patrons or staff, her expulsions where becoming more and more pungent and more noticeable to everyone but her, it wasn't long before the rest of the restaurant, the staff included had started their own comfort eating binges to at least try and drown out the discomfort Brandy alone was causing them. <br>\r\n<br>\r\n</span></div></div>",
            "created":1380258000,
            "id":1670903,
            "title":"Her hunger gets the best of her and she stops f..."
        },
        "152":{
            "author_id":"novascreech",
            "author_name":"krawler",
            "choices":[
                "Brandy goes to the gym",
                "The girls feel sluggish",
                "Wendy notices Brandy's looking kindof fat"
            ],
            "content":"<div class=\"\"><div> <span>\"Hpmmh! I can't believe this. How can that doctor not have ANYTHING for my stomach pains. Gah! I've never been so hungry in my life.\" Brandy pouted as she strolled down the busy sidewalk. To make matters worse the streets were unusually crowded that afternoon. To make the situation more curious the crowd consisted entirely of women. Perhaps there was some sort of convention? \"Ugh why are there so many people out today? Can't I have a little space to myself?\" Brandy muttered as she slid her body through the mass of people walking the street oblivious to all of the contagious fumes she was emitting onto the vulnerable ladies. <br>\r\n<br>\r\n\"I'm so hungry!\" Brandy wailed as she clutched her stomach. \"I just have to take my mind off of my hunger. I should go visit my friends.\" <br>\r\n<br>\r\nBrandy traversed across the city, passing by inestimable ladies, to reach her friend Wendy's house. Wendy was Brandy's childhood friend. She stuck with her through thick and thin and was someone she could always rely on. Despite her loyalty, Brandy determined to withhold her Faterus disease from her, it was just too bizarre.<br>\r\n<br>\r\nAnswering the door, Wendy was joyous to see Brandy. \"Brandy! what a surprise!\" Wendy squealed whole-heartedly embracing the infected Brandy, wrapping both arms around her. \"You couldn't have come at a better time, I've got a bunch of guests.\" Wendy pulled Brandy inside eagerly dragging her to her friends. \"Everyone this is my good friend Brandy.\" Wendy's introduction was immediately met with a jaunty welcome. \"Brandy these are my friends from the gym, they're super fun.\" Brandy than scanned the room, observing fit athletic women. They were either super thin or athletically built. <br>\r\n<br>\r\nBrandy was than approached by one of the athletic girls. \"So you're Wendy's pal huh? You should come with us to the gym, its a girls only gym so you don't have to deal with lewd men.  We were actually just about to go before you arrived.\" suggested the haughty gal. \"Oh well uh I guess...\" Brandy reasoned a trip to the gym would take her mind off of her relentless hunger. \"Sweet! We'll go right after we finish lunch.\" the fit girl pointed at a table adorned with cake. \"Is that ...cake? I didn't think women such as yourselves would eat that.\" a befuddled Brandy admitted. \"I know right. These girls eat whatever they want but manage to burn it all off at the gym. Can you believe it.\" Wendy explained.<br>\r\n<br>\r\n\"Come on let's dig in!\" ordered the haughty woman. \"Oh I really shouldn't..\" Brandy attempted to decline but her stomach loudly growled. \"Oh come on! Eat up!\" commanded the fitness enthusiasts slicing a huge slab of cake and ramming it into Brandy. \"You know you shouldn't deprive yourself Brandy. Remember how anorexic you were in highschool.\" Wendy encouraged hearing Brandy's rumbling gut. Brandy, Wendy, and the gym girls gorged on tons of high calorie cake filling their bellies with the decadent dessert. Little did they know that they were all infected with Faterus the instant Brandy entered the room.</span></div></div>",
            "created":1524509280,
            "id":2483456,
            "title":"She decides to go visit some of her friends"
        }
    },
    "info":{
        "author_id":"yyy24",
        "author_name":"yyy24",
        "brief_description":"somewhere somehow someone has inadvertently caused the world to fatten up ",
        "created":1369005660,
        "description":"<td align=\"left\" class=\"norm\">Second Story, as the first one nears 100 chapters, <br>\r\n<br>\r\nthe basic premise, an event triggers the global fattening of everything, people, animals, everything gets fatter and fatter through some means or another <br>\r\n<br>\r\n- it can be fantasy based weight gain but please no \"and then she was 1000000 pounds after one cookie etc etc\" <br>\r\n<br>\r\n- male WG is fine, as is Animal WG, but these two things cannot be the driving point of the narrative, mainly additional points of it<br>\r\n<br>\r\n-And by animal I mean as a sideline \"oh look the cat got a bit chunky\" not \"anthro/furry shit\" <br>\r\n<br>\r\n- Slob is ok (to a point, no \"and then they ate each others shit) <br>\r\n<br>\r\n-  No 3 word long entries - try for a paragraph or two<br>\r\n<br>\r\n- \"ok how about this\" chapters, at all, they are so mind blowingly annoying and lazy <br>\r\n<br>\r\n- no death/vore/stupidly obscene amounts of scat<br>\r\n<br>\r\n- no underage shit <br>\r\n<br>\r\nother then that, go on ahead </td>",
        "id":1934177,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1524509280,
        "modified":1524509280,
        "pretty_title":"Global Faturation "
    }
}