{
    "chapters":{
        "1":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Master PC",
                "so it is written, so it shall be",
                "rings of king and queen",
                "mesmerizing music",
                "more methods"
            ],
            "content":"<div class=\"\"><div> <span>how will they do it?<br>\r\n<br>\r\n<br>\r\noption 1: a computer program called \"Master PC\" with the power to alter reality<br>\r\noption 2: a special notebook that makes whatever you write become reality(for eample, if Leo were to write down that the human race never had to create clothes and could handle the elements without any, then all the clothes in the world would disappear)<br>\r\noption 3: the rings, only you choose how they get them<br>\r\noption 4: a CD with a special song that makes any girl who hears it into the slave of the person/people mentioned in the song</span></div></div>",
            "created":1389416400,
            "id":1725637,
            "title":"method of hypnosis"
        },
        "11":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Call Leo",
                "Text Leo",
                "Type that she was no longer tired",
                "Type that Leo would accept him sleeping with his sister",
                "Have a female celebrity please her"
            ],
            "content":"<div class=\"\"><div> <span>Yui beamed to herself as she began driving into the firm backs*** of Kaitlyn Kare.  She was the latest victim of Yui's new computer. The Master PC was unique to say the least. Said to be owned by a powerful dominatrix to escape justice, it had fallen into the hands of Yui in an auction. On the floor below them, the Jugg twins lay exhausted, the Japanese bisexual girl having ploughed them thoroughly before moving on to Kaitlyn. <br>\r\n<br>\r\nYui had prepared a list of people she planned to sleep with. All were women save her best friend Leo Roar. Yui had always liked Leo, the only boy she ever truly loved. Of course, she did fantasize about being either being a girl or being inside the body of his delectable sister Leona. Of course, if she actually did sleep with Leona, she would lose Leo. And Yui didn't want that. Her hand massaged something soft and squishing of Kaitlyn, who grunted her approval. Yui maintained her position, feeling herself massaged as she routinely brought the weary Kaitlyn to one final orgasm, before she too joined the Juggs on the floor. <br>\r\n<br>\r\nYui grinned wearily as she typed in that the Juggs should entertain her by performing acts on themselves. She enjoyed the sights immensely as she contemplated how to proceed next.</span></div></div>",
            "created":1426338420,
            "id":1948044,
            "title":"Master PC (Yui's POV)"
        },
        "115":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "The Black Swans Salacious Babes",
                "One of the bisexual girls",
                "Other famous woman"
            ],
            "content":"<div class=\"\"><div> <span>A female celebrity would make her feel both loved and important. It would also be a great way of getting Leo's attention. She beamed as she scrolled through the list of celebs. She wanted a woman, someone old enough to both have experience and not freak out once the fun was over. She could youthen. An actress, but that was risky. Maybe a bi girl like Kristen Stewart or Anna Paquin was the go. Although Nat Portman and Mila Kunis were smoking hot together in Black Swan. \"Decisions, decisions!\" expressed a giggling Yui before settling on a choice.</span></div></div>",
            "created":1432073100,
            "id":1980317,
            "title":"Have a female celebrity please her"
        },
        "1151":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "A girl for each hole and chest mound",
                "Yui wants kinkier things",
                "Interruption by another girl"
            ],
            "content":"<div class=\"\"><div> <span>Yui decided to get the girls from Black Swan first. There was always time to get the Twilight and X-Men stars. A brief thought of Jennifer Lawrence and Anna Paquin head to privates flashed through her brain. She reached for her PC before pausing. Maybe she could try something new. \"I want two magic rings which can make anyone fall under the wearer's command!\" she typed. To her delight, her 3-D Printer gave her just what she desired. She put them on, grinning. \"When I finally tell you how I feel, Leo; you and I will wear these as rings and rule the World. Even if something happens to the computer, these rings will do the job. Now I need some ballet girls!\" she declared to herself, typing her command into the PC.<br>\r\n<br>\r\nShe beamed as she looked at the rings. \"Kaitlin, Jasmine, Jenny, your Mistress needs servicing! Give the other 2 a smack on the a** then return to duty!\" Their eyes flashed red as they declared their obedience to Yui. Yui felt wetness grow in her core as each girl receiving a well earned tap on each round cheek, leaving hand prints covering their delicious peaches. Jenny bent down taking Yui's front entrance. Yui cooed as Jenny lashed away at her dripping womanhood. A cry came out as Jasmine serviced the back entrance, providing well earned pinches to a tender r***. Kaitlyn began exploring Yui's left breast, while her hands grope her right and belly. A doorbell caused Yui to command the girls to respond in all their natural glory. Yui prayed it wasn't a pervert, but what she had ordered. The sight of 5 beautiful naked women entered the room made it all the better. \"Girls, please me with your tongues and fingers!\" she declared, imperiously. \"Yes Mistress Yui!\" they declared as they got to work.</span></div></div>",
            "created":1432910580,
            "id":1984818,
            "title":"The Black Swans Salacious Babes"
        },
        "12":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "I have a superpower which allows me to create reality altering notepads",
                "I inherited this reality altering notepad",
                "I took this reality altering notepad from a doubting Kaitlyn Kare",
                "I bought this at a magic store; a reality altering notepad!",
                "I was given this reality altering notepad as a reward for helping an old lady"
            ],
            "content":"<div class=\"\"><div> <span>Leo Roar was waiting on a bench in the Angelic Paradise Mall. It honestly was a stupid name for one of the largest malls in the country. He was waiting for his long term friend Yui; who told him she had some very exciting news. Yui was been Leo’s love interest if you could call it that for years. They were even attending Columbia together. <br>\r\n<br>\r\nBut Yui had always been with girls. He still remembered Senior prom, where she and the head cheerleader danced together. To his amazement, Yui was there…but with Kaitlyn Kare; his nemesis from high school. Kaitlyn was born when her mother security guard Chloe Kare was underage. This meant her mother was ultra strict with her and she had a harsh, bullying, conservative attitude about her.<br>\r\n<br>\r\nShe hated Yui because of her pink hair and sexuality and Leo because the school allowed him to attend the school because of his rare blood type. Only his sisters had the same blood type as him and Chatouiller Les Filles High (www.lewis.cx:8008/cyo/adu...index.html); founded by Marie Chatouiller and Sophie Les Filles; was the only school in the district. Since Leo’s father died; his mother Lenora had insisted that the family spend more time together.<br>\r\n<br>\r\nLenora had married her first boyfriend Leo’s father when she was 18; fresh out of high school. He was 23 year old Staff. Sgt. Tygrve Roar; a 5 time purple heart recipient. His father had died when Leo was just 5 during 9/11. Leo still remembered having his 6th birthday a few weeks later. Yui beamed at Leo as she beckoned Kaitlyn to sit down. Kaitlyn seemed almost under hypnosis as she obeyed.<br>\r\n<br>\r\n“Hi Leo! Guess what happened to me?” she grinned. “What?” you ask confused. She beamed as she made her revelation.</span></div></div>",
            "created":1389416400,
            "id":1725893,
            "title":"so it is written, so it shall be"
        },
        "121":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Let's do that!",
                "Let's build that Harem",
                "Let me thinking about it."
            ],
            "content":"<div class=\"\"><div> <span>\"I have a superpower which allows me to create reality altering notepads! Would you like me to prove it?\" she states. \"Yeah, because you are talking crap!\" replied Leo. She smirked, pulling out a notepad. \"Hmmm, I think I'll write Leo is wearing a sequin dress!\" she teases. \"Nothing will happen!\" stated Leo, with slightly less certainty. \"Really? Look down smart a**!\" she observed.<br>\r\n<br>\r\nLeo gasped when he saw he was wearing a blue, sequin dress with sparkles everywhere. \"Still don't believe me?\" she giggled. \"Okay, Okay! Turn me back, quick!\" Leo pleads. \"Hmmm...what if I made you a man hungry bimbo, to prove my point?\" she taunted. \"NO! Ok, you made your point! Please!\" he pleaded. \"What if I made you a girl down there?\" she continued. \"NO, please...\" \"I have already turned you back, Leo!\" she pointed out.<br>\r\n<br>\r\nLeo looks down, relieved to have his jeans back on and not female in that most private region. He breathed a sigh of relief as Yui giggled. \"So I created a second notebook, just for you! Oh, but I told it, you can't change me in any way and that includes dress sense! And that only you and I can use this notebook!\" she explained. \"This is awesome!\" Leo replied, thrilled. <br>\r\n<br>\r\n\"There is a price though!\" she continued. \"What?\" Leo asked, a little wearily. \"You agree to be my boyfriend! That is non negotiable! And if I choose to do so and I might, you agree to let me change you however I like. It may be to make you bigger in certain places.\" she stops, smiling at Leo. \"Or smoother in the same place!\" she leers at him, mischieviously. <br>\r\n<br>\r\n\"I like you too!\" Leo confessed, thrilled to learn this. He leans in to her kiss her, but she stops him with her finger. \"After! Now let's start building our harem!\" she squealed, excitedly. \"Harem?\" you asked. \"Well yeah, I'm bisexual, you know! You're not the only one who gets a girl, thank you very much! Now I wrote here that Kaitlyn would confess her innermost secrets to be and guess what? She is bisexual too, leaning like me heavily towards girls, but unlike me she has a massive submissive streak. I started barking orders at her and look at her now! She even agree to a three way between us! Now what do you think about that?\" she asked.</span></div></div>",
            "created":1389416400,
            "id":1725919,
            "title":"I have a superpower which allows me to create r..."
        },
        "1212":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "entry 1",
                "entry 2",
                "entry 3"
            ],
            "content":"<div class=\"\"><div> <span>\"First, let's build that harem,\" Leo said.<br>\r\n<br>\r\n\"Great!\"<br>\r\n<br>\r\nLeo smirked, and wondered for a moment what to write. After a minute, he smirked, and wrote down his first change to reality.<br>\r\n<br>\r\n<br>\r\nentry 1: All males except for Leonardo Fang Roar are replaced with female counterparts from a parallel universe, and every female in the world view Leonardo Fang Roar and Yui Ichigo Sakura as their king and queen, serving them hand and foot happily<br>\r\nentry 2: Jessica, Jenny and Jasmine Jugg and Chloe and Kaitlyn Kare are Leonardo Fang Roar's servants, having been saved by him when they were on the street and owe their lives to him<br>\r\nentry 3: the human race can survive cold and heat without clothes, and so have never invented them. also, all girls besides Yui Ichigo Sakura are always horny, and can't cum unless Yui Ichigo Sakura and Leonardo Fang Roar allow them to</span></div></div>",
            "created":1389502800,
            "id":1726238,
            "title":"Let's build that Harem"
        },
        "12122":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "...French maids, wearing skimpy maid outfits",
                "...his pets, wearing dog ears and anal plugs"
            ],
            "content":"<div class=\"\"><div> <span>'<i>Jessica, Jenny and Jasmine Jugg and Chloe and Kaitlyn Kare are Leonardo Fang Roar's servants, having been saved by him when they were on the street and owe their lives to him</i>.'<br>\r\n<br>\r\nLeo closed the book, and looked at Yui.<br>\r\n<br>\r\n\"Alright, what do you say we go to my place, and see what's new with my ex-landlord, the ex-cop and they daughters?\" Leo asked. \"Or should I say 'what's normal for them now'?\"<br>\r\n<br>\r\n\"Alright,\" Yui said, writing down that vulgar things in public was acceptable before taking off her clothes and stroking him off as they walked.<br>\r\n<br>\r\nOnce they got to Leo's place, they saw the five females who used to be bitches were now...</span></div></div>",
            "created":1389502800,
            "id":1726239,
            "title":"entry 2"
        },
        "121221":{
            "author_id":"jlharris99",
            "author_name":"jlharris",
            "choices":[
                "food on a naked plate",
                "sex time"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will Leo and Yui have Leo's servants do first? Will them have them fix them something to eat with one of the servants acting as the plate, or perhaps make them have sex with Leo and Yui?</span></div></span></div>",
            "created":1389934800,
            "id":1728851,
            "title":"...French maids, wearing skimpy maid outfits"
        },
        "1212211":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "wait for the food",
                "start with the MILF appetizer"
            ],
            "content":"<div class=\"\"><div> <span>\"Jen, Jaz, Chloe, Kait, fix us something to eat,\" Leo commanded. \"Jes, take off your clothes and lay down on the table. You'll be our plate.\"<br>\r\n<br>\r\nThey did as ordered, and Leo and Yui looked at Jessica. Do they wait for the food, or do they start with the MILF appetizer before them?</span></div></div>",
            "created":1389934800,
            "id":1728862,
            "title":"food on a naked plate"
        },
        "1212212":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "bondage time",
                "pure fucking"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what kind of sex will they do? bondage or just good ol' fashioned fucking?<br>\r\n<br>\r\n<br>\r\nAN: with either option, Chris writes down that he was the man of the house and his family obeyed his every command without question</span></div></span></div>",
            "created":1389934800,
            "id":1728863,
            "title":"sex time"
        },
        "1213":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "solo time in the mall",
                "n*** walk in the mall",
                "seduce a girl in the mall not Yui"
            ],
            "content":"<div class=\"\"><div> <span>\"Let me think about it! Where would we live or go? Would we move out of the dorms? Would we get jobs or magic some money? What do you think?\" he replied. Yui smiled, squeezing his hands. \"Sweetie, we can use the notepad to get girls like our dear Kaitlyn to earn their keep as maids! Equally we pool our money and invest in the share market. We invest say $2,000 in one cent mining company, and then use the notepad to make sure they find gold and oil. The share balloons up to about $20.00; we sell at $15 and we have $3,000,000. We do it again in 2 months time with a 10c share, buying $100,000 worth. It goes up to $30, we sell at $19 and we live off the interest forever! This way, we avoid problems with the government regulators, help others and make a fortune! We buy a nice house! And live happily ever after with a harem of say 10 girls?\" she suggested.<br>\r\n<br>\r\n\"But we don't have $2000!\" Leo points out. \"I actually have $5,000! Saved from all the odd jobs, babysitting and all the birthday and Christmas presents! So it will work out easy! And my dear boyfriend, we will do it together!\" she replied. Leo beams and squeezes it back. \"Now what do you want to do with our little submissive pervert?\" asked Yui. He took out his notepad and began to write.<br>\r\n</span></div></div>",
            "created":1389502800,
            "id":1726183,
            "title":"Let me thinking about it."
        },
        "12131":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "time for Jenny to take a stroll through the mall",
                "let's get another girl"
            ],
            "content":"<div class=\"\"><div> <span>Kaitlyn began to disrobe. Yui smiled at him, before writing something in her notepad. \"What did you write?\" he asked, wrapping his arms around her waist. She almost jumped, nearly losing the notepad. \"Be careful!\" she warned. \"Oh, are we sensitive?\" he teased. \"If you tease me, then I will make sure you spend time in a bikini! Permanently!\" she threatened, albeit teasingly.<br>\r\n<br>\r\n\"You're bluffing, but you're cute!\" he whispered into her ear, before kissing the back of her neck. \"Ohhh! Your lips are so soft!\" she mewled. Leo kept it up, before lifting Yui unto his lap. Jenny began her personal examination, her fingers tracing over the sensitive region delicately. Moans escaped her lips. \"What did you write?\" he asked. \"I made it that all women over 18 can enjoy solo time in public without recrimination! But Leo, there are still rules about what we can do!\" she explained as she enjoyed the show.<br>\r\n<br>\r\nLeo watched as Kaitlyn began to change the speed of her actions, from tracing to probing. It was clear from the sweet glistening down her exposed form that she was exerting a lost of energy. \"What rules?\" he asked. \"We are not omnipotent, darling! We still have to follow certain rules. I can't write \"we are rich!\" or \"we are wealthy!\" for instance. It won't work. The writing must have some level of specificity. For instance, I wrote that it was not illegal in any region in North America for female adults to engage in public solo acts! That's why in order to avoid suspicion, we must be careful. My power isn't permanent! When the letters begin to fade or the paper is torn, the writing's power fades. That is why I will prepare an amendment for Congress to put through later, allowing for certain things. Then it won't matter if the writing fades, it has become permanent! Equally while we can alter reality, we can't make ourselves immortal as we can't change ourselves. So we will instead, take the Elixir of Life from Harry Potter to maintain our youthfulness, indefinitely!\" she explained.<br>\r\n<br>\r\n\"If we can't change ourselves, then how can you turn me into a girl?\" he pointed out. \"I could give you a drink that turns you into a girl. Or invent a machine that will alter your clothes. But lucky for you, you are the only man I love, so I won't. I will still fantasise though about the two of us as a female couple, now and again!\" she responded. \"Well I will just have to work hard, to show you that I make a better man than I would a woman!\" he replied.<br>\r\n<br>\r\nShe beamed, resting her head against his shoulder as Kaitlyn complete her actions, bouncing on the chair at the conclusion. Leo noted how much she had released and wondered what it would look like if Yui was helping her to experience that. He also wondered if he would become hideously jealous of any girl that pleased Yui. On reflection, he concluded probably not. He whispered into her ear again \"What next?\" She turned to face him, a large grin on her face. \"How about....<br>\r\n </span></div></div>",
            "created":1389934800,
            "id":1729055,
            "title":"solo time in the mall"
        },
        "121311":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Jasmine Jugg",
                "Jenny Jugg"
            ],
            "content":"<div class=\"\"><div> <span>Leo smiled as he wrote the message. It wasn't long before Kaitlyn began her walk down the mall. Seeing her in her birthday suit pleased him greatly. She had always been a smug girl and to see her now, walking down the mall, unable to stop herself. Her body seemed to sway as she strolled down as if part of her was determined to indulge her private fantasy. Yui giggled as she watched. \"I am enjoying this immensely!\" she stated. \"Me too!\" Leo admitted.<br>\r\n<br>\r\nYui turned to him. \"Just so we are clear...you really do love me, don't you? This isn't just about the lifetime of wealth, the harem or the threat of becoming a girl? It's real?\" she asked, nervously. Leo beamed at her and kissed her gently on the lips. \"I thought you were a lesbian. Otherwise I would have told you. I see now I was half right!\" Leo smirked. Yui frowned at that. \"I can still become a full one, by fixing you remember?\" she pointed out.<br>\r\n<br>\r\nLeo smiled back. \"But you love me, so you won't! And I will be careful what I drink!\" he responded. Yui nodded, giggling a little. \"Yeah, I won't! Even though you would be an extremely sexy girl!\" she remarked. \"Sorry, you will just have to keep dreaming about that!\" Leo replied. \"Oh, I will! Speaking of which, have you ever dreamed of being the only guy in the World?\" she asked. \"What do you mean?\" he asked. \"Neither of us have fathers, grandfathers or uncles! We have no male cousins! So I propose we make ourselves King and Queen of the World! It will take a United Nations approval and several hours of writing, but we can pull that of. And as for the whole world, perhaps we write that a machine hovers around the world, replacing males with their female counterparts from say a women's only universe? Of course, first, let's build a private harem. But for now...who should be member number 2 of our harem?\" enquired Yui.</span></div></div>",
            "created":1389934800,
            "id":1729071,
            "title":"time for Kaitlyn to take a stroll through the mall"
        },
        "1213111":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Ok, if you'll do that, I don't require clothes",
                "Kiss me, soul mate!"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I want to teach Jasmine Jugg some manners! How do you propose we do that?\" Leo asked. \"Why don't you come up with a plan, darling?\" proposed Yui. Leo paused, thinking about it. He smiled when he had the solution. He took out a notepad and began writing. Yui notices a large sign appearing out of nowhere. \"A sale? Well that's not exactly novel, but it will get her here!\" <br>\r\n<br>\r\nLeo smiled, wrapping his arms around Yui. \"How about a special kiss?\" he proposed. She rolled her eyes \"You wish!\" \"I didn't mean for me! Wouldn't you like a special kiss?\" he ventured. \"Well....\" but Yui didn't finish her sentence as a girl come from nowhere, dropping to her feet. \"Wait that's Jasmine!\" noted Yui. \"Yep, I saw her in the crowd!\" revealed Leo. \"Okay, but...oh!\" gasped Yui as Jasmine exposed her lower half and got to work on the special kiss.<br>\r\n<br>\r\n\"I thought you'd like that! Not surprisingly I wrote that it was ok for this act to be public!\" he added. Yui began to buck as Jasmine continued. Leo resume his composition and Kaitlyn stopped walking. She made her way to where Jasmine was working her magic on Yui. Kaitlyn soon had Jasmine in a similar position, her clothes flung to the ground. Leo beamed as he wrote Jasmine's clothes out of existence.<br>\r\n<br>\r\nYui was moaning loudly when release finally came. Leo added an extra note and helped Yui to her feet. \"T-Thanks, that was nice, darling! Now....hey where are my clothes?\" she demanded. Leo grinned at her. \"Well, I thought I should get a better look! Before you complain...just see how you like it. Maybe walking around with only your upper body covered will appeal to you.\" he proposed. \"I...\" she began angrily, before Leo whispered something in her ear. She looked at Leo, stunned. <br>\r\n<br>\r\n\"If you stay this way for a little, I will do that for you!\" he revealed. \"You will?\" she expressed. \"Yep, but first you have to go all the way! Maybe I can help you while we watch these two vapid....women showing their natural inclinations!\" Leo answered as the two girls continued playing with their bodies. Yui paused, before stating</span></div></div>",
            "created":1390626000,
            "id":1732845,
            "title":"Jasmine Jugg"
        },
        "12131111":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "entry 1",
                "entry 2"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok, if you'll do that, I don't require clothes,\" Yui said.<br>\r\n<br>\r\nLeo nodded, writing the rest of Yui's clothes from existence. Then he wrote down that...<br>\r\n<br>\r\n<br>\r\nentry 1: \"Leonardo Roar's female counterpart from a parrarell universe will become a part of this world, and believe she's Leo and Yui's servant.\"<br>\r\nentry 2: \"All males in the world, save for Leonardo Roar, will be replaced with a female counterpart from an all-female universe.\"</span></div></div>",
            "created":1390626000,
            "id":1732874,
            "title":"Ok, if you'll do that, I don't require ..."
        },
        "121311111":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "new great granduncle Pantios Herman Roar passed away leaving a mansion to Leo",
                "Linda Howl wins a vacation, their house is free for Leo and Yui to use."
            ],
            "content":"<div class=\"\"><div> <span>Leondra appeared before the two lovers. Leondra Roar was 19 years old. 5 foot 9 (176 cms), blonde hair to her shoulder with piercing green eyes. She approached the two and knelt before Yui. \"OH beloved Mistress, how delighted I am to be in your presence!\" she declared. Yui was practically squeaking with joy. She pulled Leondra to her feet, pressing her lips against hers.<br>\r\n<br>\r\nLeo beamed as he watched the scene dissolve into its natural course, swiftly writing that lesbian expressions of physical love are not only legally permissible but entirely natural. His mind raced as he watched as the two girls hands travelled the course of their bodies. He felt that familiar stirring and debated whether to introduce him physically. <br>\r\n<br>\r\nAs Jasmine and Kaitlyn joined into what could only be described as the unfettered dream of every hot blooded heterosexual male to witness, Leo contemplated his actions. He was going to be the most powerful man in the world. He would be married to the greatest woman in this universe. The possibilities seemed endless. The harem would be built carefully but cleverly. While he wanted submission, Leo was not a cruel man by nature. He was too well brought up to indulge in abuse of his gifts by forcing girls against their will.<br>\r\n<br>\r\nAs the girls reached their final destinations of delight, Leo decided that this trip to the mall though fun was consuming time that he wanted to spend elsewhere. So he took out his notepad and wrote....</span></div></div>",
            "created":1390971600,
            "id":1734845,
            "title":"Leondra Roars!"
        },
        "1213111111":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "skip to when Leo and Yui's families move into the mansion",
                "Yui lets Leo join the fun"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><i>Leonardo Roar had a great granduncle named Pantios Herman Roar, who passed away a month ago, leaving a mansion for Leo, along with paid bills for a decade.</i><br>\r\n<br>\r\nLeo stopped there, and pocketed the book.<br>\r\n<br>\r\nWhat next?</span></div></span></div>",
            "created":1391058000,
            "id":1735326,
            "title":"new great granduncle Pantios Herman Roar passed..."
        },
        "12131111112":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "A Second wedding for Leo and Yui",
                "The first in a series of weddings for Leo and Yui"
            ],
            "content":"<div class=\"\"><div> <span>The girls finished their marathon and Leo called them over. \"So my love, are you ready to move into the mansion I wrote into existence?\" he asked. She beamed at him. \"Naturally!\" as she kissed him tenderly. They broke off the kiss as Yui wrapped her arms around him and Leondra; while Kaitlyn and Jasmine followed suit.<br>\r\n<br>\r\n\"So I was thinking about virginity and how you will you taking all of ours! So what about yours?\" she asked. \"Well you will be my first, so that's no problem!\" explained Leo. \"But uh...I plan for you be the first inside me both front and back as it were. And obviously the same with the other girls. What about your back?\" she asked, teasingly.<br>\r\n<br>\r\nLeo's eyes flew open as he shook his head vigorously. She laughed at that. \"Well then, I will simply have to do it with Leondra then....unless I write that you two swap bodies through a machine I write into existence. A machine that only I am immune to.\" she suggests. \"Yui, that's no funny!\" protested Leo. She giggled \"What's good for the goose is good for the gander!\" she declared.<br>\r\n<br>\r\n\"And the gander is a torturer!\" declared Leo, wiggling his fingers into her ribs. Yui dissolved into laughter as the other girls help Leo torture her. As he made her howl, Leo couldn't help but notice the naked girls were helping him rather than Yui. An interesting development. However her torment was brief as he called a halt and kissed her again. <br>\r\n<br>\r\nShe practically leapt into his arms as the kissing became more intense. Leo wasn't ready to lose his virginity in the open, but Yui opened her legs. Leo was astounded as he began expressing him to the woman he loved. It was so different to how he imagined. He was always told it tasted tangy and salty. But this tasted....like strawberries! Marvelling at how Yui accomplished the feat, he continued his actions. <br>\r\n<br>\r\nYui's reaction was clear as she bucked wildly. The other girls held her in place as Leo continued. His hands grasps at the tender fleshy part of her anatomy as he plunged his tongue deeper and moved around with greater alacrity. His reward was to be bathed as Yui experienced a torrent of release, like waves hitting the sand. It seemed endless, forcing him to close his eyes as he removed the essence from his face with his tongue. At last, she was concluded.<br>\r\n<br>\r\nYui was breathing heavily so Leo ordered the girls to carry Yui and make her laugh as they did so. Yui was beside herself with hysterics as they gently tested her body's sensitivity. \"I love you, Yui! I want to be married to you today!\" he declared. She could only nod in reply. Leo decided that it was time and he reached for his notepad.</span></div></div>",
            "created":1391058000,
            "id":1735332,
            "title":"Yui lets Leo join the fun"
        },
        "121311111122":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Wedding Number Two",
                "Details of Wedding Number One"
            ],
            "content":"<div class=\"\"><div> <span>Leo took his bride to his room. What a magic day it had been! Seeing Yui made up so beautifully made his heart pound. He had been sorely tempted to ruin everything by having every woman completely exposed. But seeing Yui in her white dress put everything in the shade. All the bridesmaids of which there were 10 complimented her beauty. Leo noted that all of them had been aged up to around 24. <br>\r\n<br>\r\nWhile time would come for the harem, today was all about Yui like it always should have. He gently put her down on the bed and began to undress her slowly. He felt her pulse quicken with excitement. \"Still wish I was a girl?\" he asked. \"I think I can live with having the one true man in the world!\" she exclaimed. \"So does that mean you want us to be the King and Queen of a girls' only world?\" he enquired.<br>\r\n<br>\r\n\"Not today! This night is about us!\" she replied as her body came into view. He could watch her all night. But that was not what was on his mind as he opened her legs and began to use his tongue. He supposed he could have written a machine to download the best way to do this, but tasting her for the first time was worth it. He was surprised at how easily he got the desired reaction as she moaned heavily. <br>\r\n<br>\r\nHe felt her spasm before she released herself on him. He trembled a little as he prepared for what he had dreamed about for years. \"I'll be okay, don't be nervous!\" she advised him. Forcing back the trepidation, he began what he hoped would the first of many encounters. Both of them were covered in sweat as Yui rolled unto him. \"Ok, lets make it that I'm on top from now on! I'm too weak to support this awesomeness!\" she stated.<br>\r\n<br>\r\nHe grinned before replying \"My legs support me!\" \"I have other uses for those! Besides if I'm on top, I can be disciplined gently by you!\" she pointed out. \"You want me to slap your...\" \"A little, not too hard! It keeps more warm!\" she declared as she rested her head. He stroked her head and grinned. \"Someone does a 180 and become submissive!\" he remarked. \"Say that again and its goodbye mr happy, hello lady parts!\" she responded.<br>\r\n<br>\r\nHe smirked at her empty threat. \"So you truly love me, Leo Roar? Even though I can turn you into a sexy woman whenever I want!\" she posed. \"Beyond question, Yui Roar-Sakura!\" he replied. \"No, its Yui Roar now! No hyphenated names! But I get first dibs on our harem! Just so you remember that we are on equal footing!\" she exclaimed. \"No problem sugar! Will you be self pleasuring as well?\" he teased her. \"You will as Cleo Roar if don't stop teasing me!\" <br>\r\n<br>\r\nYou smile and ran your fingers through her hair. She moaned appreciatively. \"Can't wait to do this again tomorrow!\" he declared. She grinned at him \"making next time you can be the wife!\" You laugh at that, though slightly nervous that Yui might actually do it. Nevertheless she falls asleep as you massage her, tiredness takes over and you close your eyes.</span></div></div>",
            "created":1391403600,
            "id":1737999,
            "title":"The first in a series of weddings for Leo and Yui"
        },
        "121312":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "the headmistress at their school",
                "a famous woman(reader's choice on who)"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's get another girl,\" Yui said.<br>\r\n<br>\r\n\"Sounds good, but who?\" Leo asked.<br>\r\n<br>\r\n\"I'll let you decide.\"<br>\r\n<br>\r\nLeo put on a thinking face for a moment until he decided on...<br>\r\n<br>\r\n<br>\r\nAN: with the second option, I mean someone like Selena Gomez, Brittany Spears, Pink, Lady Gaga, etc.</span></div></div>",
            "created":1390021200,
            "id":1729444,
            "title":"let's get another girl"
        },
        "12132":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Jenny Jugg",
                "Jasmine Jugg"
            ],
            "content":"<div class=\"\"><div> <span>Leo smiled as he wrote the message. It wasn't long before Kaitlyn began her walk down the mall. Seeing her in her birthday suit pleased him greatly. She had always been a smug girl and to see her now, walking down the mall, unable to stop herself. Yui giggled as she watched. \"I am enjoying this immensely!\" she stated. \"Me too!\" Leo admitted.<br>\r\n<br>\r\nYui turned to him. \"Just so we are clear...we really do love me, don't you? This isn't just about the lifetime of wealth, the harem or the threat of becoming a girl? It's real?\" she asked, nervously. Leo beamed at her and kissed her gently on the lips. \"I thought you were a lesbian. Otherwise I would have told you. I see now I was half right!\" Leo smirked. Yui frowned at that. \"I can still become a full one, by fixing you remember?\" she pointed out.<br>\r\n<br>\r\nLeo smiled back. \"But you love me, so you won't!\" he responded. Yui nodded. \"Yeah, I won't! Even though you would be an extremely sexy girl!\" she remarked. \"Sorry, you will just have to dream about that!\" Leo replied. \"Oh, I will! Speaking of which, have you ever dreamed of being the only guy in the World?\" she asked. \"What do you mean?\" he asked. \"Neither of us have fathers, grandfathers or uncles! We have no male cousins! So I propose we make ourselves King and Queen of the World! Of course, first, let's build a private harem. But for now...who should be member number 2 of our harem?\" enquired Yui. </span></div></div>",
            "created":1389589200,
            "id":1726883,
            "title":"n*** walk in the mall"
        },
        "121322":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "make her belly dance in public for fun(and stares)",
                "have her tied up to get tortured by the couple"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"How about Jasmine Jugg?\" Leo suggested.<br>\r\n<br>\r\n\"Sounds good to me,\" Yui said. \"So, what should we do to her?\"<br>\r\n<br>\r\n\"I have a few ideas.\"</span></div></span></div>",
            "created":1389589200,
            "id":1726887,
            "title":"Jasmine Jugg"
        },
        "1213222":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "attached to a wheel, with a bag near her called tactile stimulation devices ",
                "bound with wires attached to sensitive places"
            ],
            "content":"<div class=\"\"><div> <span>\"What's the one thing, Jasmine is vulnerable to?\" Leo asked an evil grin of his face. Yui paused before realising the implication. \"That is so right! I love doing that to a girl!\" she revealed. \"Well then, let's follow our little friend Kaitlyn as we plan how to get Jasmine!\" he suggested. Leo wrapped his arm around Yui, who rested her head on his shoulder.<br>\r\n<br>\r\nThey quickly caught up to Kaitlyn who was attracting quite a crowd. Quite a few people pointed and even a few girls ogled her as she went by. \"Leo, look ahead!\" she whispered. Leo saw Chloe Kare horrified walking towards her daughter. Leo took out his notepad and wrote \"Let Chloe fall to the ground, her pants wrapped around her ankles. When she wakes up, she finds and submits to us!\" <br>\r\n<br>\r\nChloe's pants become unknown as she falls to the ground with a thud. People laugh as Leo and Yui help Chloe to a bench. They catch up to Kaitlyn who is still walking. Leo notices a few tall guys looking at Kaitlyn with a menacing lust. \"Yui, see those guys?\" began Leo. \"Way ahead of you, lover!\" she states, writing something done. The guys disappear and three girls all as exposed as the days of their births approach Kaitlyn and join her. <br>\r\n<br>\r\n\"Wow, what was that?\" asked Leo. \"That my love was three guys, swapping with the alternates from a parallel world. I suspect those thugs are not enjoying their new world. I may have improved the three girls?\" she implied suggestively. \"Has she ever!\" thought Leo. A redhead, a silver haired and a raven haired girl all walked with Kaitlyn. Leo noted that there was not a hair anywhere except flowing from their heads.<br>\r\n<br>\r\nIt was a sight to drink in. \"Look at them sway! I am half tempted to join them and let my fingers run wild! Don't even try if you know what's good for you!\" she warned, half joking. \"Wouldn't dream of it babe! Though I thought it doesn't work on you!\" he observed. \"It only does, if I allow it. And I won't!\" she explained. \"We’ll see about that!\" thought Leo, privately. Truthfully Leo didn't think Yui was in any need of improving. But he would love to see her walk through the mall like those girls. <br>\r\n<br>\r\nShe looked at him, somewhat displeased. \"You are thinking of me doing what they are doing, aren't you?\" she asked, witheringly. \"Maybe!\" Leo stammered, a little surprised. \"I'll do it, when you do it with me as a girl!\" she pointed out. \"So never then!\" \"Yes, Leo, my love, never! I love to watch this but not to participate. Besides we still have to plan our retirement and getting Jasmine. Oh and don't look now but Khloe is coming towards us. And she is somewhat different!\" noted Jasmine. <br>\r\n<br>\r\nYou want to turn around but decide to enjoy the view. Khloe quickly appears and she is definitely different. You are about to comment, when you see a sight that stuns you. \"Yui, its Jasmine!\" he gasped. She turns and nods, whipping out the notepad and writing something down. The girls all disappear as the crowd dissipates without a single comment. \"Um...Yui what did you do?\" Yui grins. \"Look ahead!\"<br>\r\n<br>\r\nLeo does so and there is a swirling light. \"Because we can't alter ourselves, we need to use portals to teleport. So let's go!\" stated Yui. Delighted at how clever his girlfriend is, he leaps in, his hands firmly attached to hers. The light of the portal is blinding inside, causing him to shut his eyes. As they exit the portal, Leo opens them once more. They enter a basement where the girls are all bound in different positions. \"Let's start with Jasmine!\" suggests Yui. \"Great idea, you torture, I advice!\" Leo states.<br>\r\n<br>\r\nShe beams at him. \"Oh Leo, you perv, you!\" she teases. She approaches Jasmine who is.....</span></div></div>",
            "created":1389589200,
            "id":1726896,
            "title":"have her tied up to get tortured by the couple"
        },
        "122":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "nature walk to a crowded restaurant in the mall",
                "solo entertainer",
                "the world's greatest naturist masseuse"
            ],
            "content":"<div class=\"\"><div> <span>\"As you know a few weeks ago, my great-great-grandmother Rei passed at the age of 105! I was pretty sad to lose her, she was very supportive of my bisexuality. Anyway she left me this reality altering notepad! And it's awesome! It even replenished itself and works only for us!\" she explains. \"Us?\" asked Leo, still stunned that Yui was bisexual rather than a lesbian.<br>\r\n<br>\r\n\"Yeah, she left me the rules in her will. Apparently I can allow others to use it! So I wrote down that only I and you can use this pad! I tried it out and.....well Kaitlyn is completely under my control! Watch this!\" she declared. \"Kaitlyn, hop on one foot and say you like to be struck on your lower cheeks!\" she exclaimed. To Leo's amazement she did just that.<br>\r\n<br>\r\n\"Holy crap, Yui! That's amazing!\" he declared. She beamed at him, surprising him with a kiss. His eyes widened as she pressed herself against him, before she withdrew. \"Sorry! Didn't mean to...\" but Leo cut her off with a kiss of his own. He broke the kiss, smiling. \"You kiss like a girl! I love that!\" she exclaimed, kissing him again. She broke the kiss, this time with a broad grin. \"Love your lipstick!\" she teased.<br>\r\n<br>\r\nLeo grinned back, before pausing. \"What??\" he responded, reaching for his lips. He realised he had red lipstick on. She giggled. \"Sorry, couldn't resist! I kind of wrote in on you before you say me! I needed the laugh! I miss Granny Nan Rei!\" she revealed, her face falling. Leo pulled her to him. \"It's ok, Yui! She looking down on you, laughing heartily at giving me strawberry lipstick!\" he replied. <br>\r\n<br>\r\nShe laughed at that. \"Its blood red...and I was really tempted to make you a little more girly!\" she revealed. Leo's eyes bulged out of his sockets as he reached down to make sure he hadn't changed. \"You still have Mr Happy! Although a Ms Wet is way more fun!\" she explained. \"How would you know?\" he asked. \"I tested it on myself. Having a pair of soft lips beats a sausage every day!\" she explained. <br>\r\n<br>\r\n\"Ok, lets keep you the lips! I think I should be the only one with a sausage!\" he responded. \"Do we need a sausage?\" she teased. \"YES, we do!\" he exclaimed. She giggled again. \"I wrote that I would win the lottery this week! I didn't even need to alter that the jackpot! It's one hundred MILLION dollars! And the best part was that I lowered the gambling age to 18 just to be safe. Sadly that rose the drinking age to 25! It's a ying yang thing!\" she explained.<br>\r\n<br>\r\n\"I don't get it!\" Leo stated. \"Well, if you alter reality somewhere, it tends to have a flow on effect! So I lower the gambling age nationwide to 18, something else will go up! That's why the drinking age is 25 not 21!\" she concluded. \"So what should we do with our hypnotised Kaitlyn Kare? I used this to get her under my control!\" she explained, showing Leo a glowing gold watch. \"You and I are totally immune to it, but Kaitlyn isn't! What do you say to making this sexy witch get a taste of justice?\" she proposed.</span></div></div>",
            "created":1391144400,
            "id":1735782,
            "title":"I inherited this reality altering notepad"
        },
        "1222":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "do a hula dance in nothing but a grass skirt",
                "take off her clothes, and masturbate in front of a crowd",
                "hump the central water fountain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Let's make her do some solo entertainment,\" Leo said.<br>\r\n<br>\r\n\"Ooh, like what?\" Yui asked.</span></div></span></div>",
            "created":1391144400,
            "id":1735794,
            "title":"solo entertainer"
        },
        "1223":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Yui",
                "Himself",
                "Another girl"
            ],
            "content":"<div class=\"\"><div> <span>\"What did you have in mind?\" he asked. \"Well how would you feel about swapping bodies with her?\" asked Yui.<br>\r\n<br>\r\n\"Wait, what?\" gasped Leo. Yui laughed at his reaction, clutching at her sides. \"Your face! Hahahaha!\" she giggled.<br>\r\n<br>\r\n\"That wasn't funny!\" roared Leo. Yui kept laughing, shaking her head. \"That was hilarious, babe!\" she disagreed.<br>\r\n<br>\r\nLeo frowned, before a grin took over his face. He had to admit, Yui had quite the sense of humour. One of the many things he loved about her.<br>\r\n<br>\r\n\"I think we need to try something a little more interesting. Say give Kaitlyn a new career!\" she said, writing something on her notepad.<br>\r\n<br>\r\nKaitlyn began stripping immediately to Leo's delight. While Yui was the one he wanted to see bare, he would live with this.<br>\r\n<br>\r\nKaitlyn stood before them, exposed. \"Would you like a massage, master?' she asked Leo.<br>\r\n<br>\r\nLeo stared at Yui who giggled. \"She is the first naturist masseuse! So would you like to be her first client?\" she offered.<br>\r\n<br>\r\nLeo thought about it before deciding that the first client should be....</span></div></div>",
            "created":1393655760,
            "id":1753604,
            "title":"the world's greatest naturist masseuse"
        },
        "12231":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "It is legal for all women to perform any consensual s***** act (p***** n*****)",
                "All women want to t**** Yui!"
            ],
            "content":"<div class=\"\"><div> <span>\"You look stressed, babe! Maybe you need a massage!\" he suggested. Yui rolled her eyes at him.<br>\r\n<br>\r\n\"Please?\" he continued. Yui looked annoyed before Leo whispered \"I heard a rumour that you like a special kiss. Maybe you would like three?\" <br>\r\n<br>\r\nYui looked at him, hopefully. Leo nodded. \"You better starting writing. I am not doing that until you put it into your notepad.<br>\r\n<br>\r\nLeo grinned before writing</span></div></div>",
            "created":1395313380,
            "id":1763551,
            "title":"Yui"
        },
        "122311":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Jasmine gives Kailtyn a massage",
                "Kaitlyn gives Jasmine a massage"
            ],
            "content":"<div class=\"\"><div> <span>\"There you go sweetheart!\" he declared, showing her what he wrote. She frowned before picking up her pad and writing something down. A phone appeared in her phone. She began dialing someone. Leo was confused before she began speaking. \"I want you to come through the portal immediately!\" she commanded. She began writing and to Leo's delight, an exposed Jasmine Jugg came through the portal.<br>\r\n<br>\r\n\"Remove my clothes!\" she ordered Jasmine. Yui was soon as bare as she was born as Kaitlyn and Jasmine got to work. They massaged Yui's back as Leo eyed Yui's cheeks with great excitement. \"Ohhh! I am so going to turn you into a girl, beautiful boy!\" moaned Yui. Leo grinned, fully aware that this was an empty threat.<br>\r\n<br>\r\nThe girls were focused on Yui's back and neck, to Leo's slight annoyance. He wanted the girl to begin to explore Yui more carefully. He approached Yui and gently spread open her legs. He stared at the beautiful sight before me. Yui moaned a little as he blew on her. \"Sensitive, are we?\" he teased. \"Stop teasing! Ohhhh!\" she whimpered. Leo wrote something on his notepad and began granting Yui, the special kiss.<br>\r\n<br>\r\n\"Ohhh!!!YESSS! Keep going! YES!!!!\" she cried as his tongue explored her carefully. He couldn't understand why men complained about it. This was easily the best experience he had undergone. He felt Yui close her legs, trapping his head between her thighs. He was unaware that the girls had began massaging Yui's private cheeks area; which only accelerated her delight at the speed of his tongue or the pleasure from a few well chosen inhales of the lips.<br>\r\n<br>\r\nHis face began to feel locked as his neck felt tight. He managed to move around a little as he maintained the pressure. He was determined to help Yui reach her apex. It was surprisingly quicker than he expected as Yui surrendered to the pleasure. She bucked after her legs got stiff, before she relaxed, releasing Leo. Leo took a few final sips of the salty delight, before he rose to his feet.<br>\r\n<br>\r\nThe two girls continued to massage Yui, driving her further and further into a wave of releases. Their hands caressed the most sensitive parts of her skin, the massage was far more erotic than relaxing. Their hands were soon focused on the area below the belly button but above the knees. The 20 digits appeared to focus on these tender, erogenous zones, pushing Yui further into delight<br>\r\n<br>\r\nKaitlyn was the first to descend to the sacred place, tantalising Yui who lasted very little time before she experienced climax. Jasmine soon followed and Yui indeed had her third special kiss. After that, they moved her unto her back and explored her youthful frame from her shoulders and chest, down to her quivering soles. Leo was find it difficult to prevent himself from taking care of his own needs. He managed however to hold on as Yui's massage was over.<br>\r\n<br>\r\n\"Well that was great! Thank you, sweetheart! Now...hey! Where are my clothes?\" she gasped. Leo grinned before whispering in her ear. \"I'll give them back, once you make Kaitlyn and Jasmine do something fun!\" She glared at him, before grinning. \"Okay, my perverted boyfriend! If that's what you want!\" She reached for her notepad and wrote....<br>\r\n<br>\r\n</span></div></div>",
            "created":1397568300,
            "id":1779705,
            "title":"It is legal for all women to perform any consen..."
        },
        "1223112":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "began pleasing herself",
                "went to help in Jasmine's massage"
            ],
            "content":"<div class=\"\"><div> <span>Kaitlyn lays Jasmine on the table and begins at her shoulders. \"Ok, I did what you want! Can I have my clothes back now?\" demanded Yui, her hands covering up her goodies as she pressed her back against Leo. \"Hmmm, let me think, nope! It's too soon!\" he answered. \"People can see me! More than they should!\" she hissed. Leo smirked, pressing him against her. \"They are very lucky! Like I am!\" he whispered. Yui turned her head, glaring at him. \"Keep that up and I will be calling you Leora Roar!\" she snarled back.<br>\r\n<br>\r\n\"Is that even a name?\" Leo observed. \"It's Greek for Light!\" she replied. He paused before replying. \"You have though a lot about turning me into a girl; haven't you?\" She nodded, smiling. \"You would the hottest girl of all time! You're the only guy I have ever liked and you are hot! But as a girl, I would just melt!\" she answered. \"You mean drip!\" he remarked, resting his hand over Yui's most intimate place. \"Ohhhh! Yeah, that would be the best birthday present ever!\" she announced, gasping as Leo began his own massage. \"Look at them!\" he suggested as Kaitlyn's hands were on Jasmine's cheeks. Jasmine was making animalistic sounds as the rubbing got far more intimate.<br>\r\n<br>\r\n“They make a nice couple! But not as nice as the two of us; I think!” pointed out Leo.  “Keep going! Ohh, yeah!” moaned Yui as Leo’s thumb grazed her button. “I think someone’s going to have an accident!” grinned Leo as he continued his treatment. Yui bit her lip, rubbing herself against Leo. He could see her eyes closed as she ground further into his dexterous fingers. “Love the view!” he teased as Jasmine received more attention on her back entrance. Kaitlyn was spending far more time caressing and stroking the area below her back and above her knees than on the rest of her prone form.<br>\r\n<br>\r\nLeo felt excitement rush through him. He was barely able to contain himself. But he remembered what he wrote about women being able to engage in any public act they wished. He had not included himself in that. He didn’t dare surrender to his desires. But as Yui began bucking, this was proving to be a greater task than he anticipated. Yui collapsed as the juices fell from her. Leo went to help her up but a sort of frenzy seemed to take her. To his delight, she….</span></div></div>",
            "created":1401781320,
            "id":1806501,
            "title":"Kaitlyn gives Jasmine a massage"
        },
        "12231121":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "Jessica Alba",
                "Natalie Portman"
            ],
            "content":"<div class=\"\"><div> <span>She got on all fours, her head down. She managed to get one hand between her cheeks and another between her legs. With her right hand, she began pleasing her button. \"Uhhh, Leo!!! Pillow and lube, please!\" She moaned as her left hand trembled. Despite Leo's astonishment, he reached for the notepad. In no time, Yui had lubricated her back area and began to gently apply some TLC to the tender area. Leo was surprised to learn that women were capable of great pleasure through that region if sufficiently lubricated. He would note that Yui enjoyed it as she continued exploring herself.<br>\r\n<br>\r\nHer mewling enjoyment was something that Leo wanted to remember. He then realised there was a way. He reached for the notepad and wrote \"I would like a camcorder, please!\" A woman approached him, her camcorder focused on the scene of Sapphic and solo delights. \"For 2,500 dollars sir; you can have this!\" She declared, her focus and her device solely focused on the three girls and their lust filled actions. Leo replied \"I only....here!\" He responded, handing her the money. The notepad must have added the money to his wallet somehow. She took the money beaming, before she began to undress. Leo was stunned at the nonchalance of the people around him. Clearly this was common behaviour thanks to the reality altering notepad.<br>\r\n<br>\r\nThe girl soon latched herself on to Yui, her hands massaging her chest. Yui expressed her excitement at the unknown stranger's attention. Leo suddenly remembered who this woman was as she took Yui's left gland, swallowing and pulling on the tip as Yui reacted with grunting and closed eyes. This woman was....</span></div></div>",
            "created":1409524500,
            "id":1850013,
            "title":"began pleasing herself"
        },
        "122311212":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "The juices of Yuri Take Two",
                "Halloween surprise"
            ],
            "content":"<div class=\"\"><div> <span>Thor's own girlfriend Natalie Portman was in her birthday suit and massaging Yui's belly with her fingers as she engulfed her left melon in her mouth. To his astonishment there was another girl involved. Jasmine and Jenny Jugg were biting and licking Yui's peaches while Kaitlyn's lips were attached to Yui's nether region as her hands played with her thighs. 4 girls were playing with Yui's body as he recorded the whole event. He couldn't recall being so enthralled by any sight he had witnessed. That was until another girl began sampling the treasure of Yui's right side.<br>\r\n<br>\r\nIt was none other then Mila Kunis who had played Natalie's lover/rival in the appalling Black Swan film. Even more astonished was that Mila and Natalie were playing with their own regions as they played their role in destroying Yui's defenses and bring her to an Avatar like earth-shattering climax. But none of the girls ceased in their actions as they ploughed on through the Japanese-American's firm form. Leo felt himself winced as he became increasingly stiff. While he considered relief, he wasn't ready to disrupt this incredibly visual spectacle. He envisioned multiple orgy weddings for himself and Yui, the new King and Queen of the World.<br>\r\n<br>\r\nHe felt slightly embarrassed at the though of himself with a crown. Still he envisioned Yui in a tiny bikini, drenched in her own juices and felt satisfied. To his amazement, Yui promptly saturated Kaitlyn's face. The girls rose, bowed to the crowd who cheered them on, before turning around with their arms linked to their waists and bending over. Leo didn't think he could be more astonished than he already had been that day, but this sealed it. The girls promptly got down on all fours and moved to a different area of Yui to please. Yui was red and sweaty, but her plastered hair matted down, didn't block the delighted smile on her face.<br>\r\n<br>\r\nLeo waited with baited breath for the Yui centered extravaganza to continue.</span></div></div>",
            "created":1414877100,
            "id":1880208,
            "title":"Natalie Portman"
        },
        "12232":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "...pussy.\"",
                "...tits and mouth. I want you to be my first, Yui.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Does she massage cocks?\" Leo asked.<br>\r\n<br>\r\n\"Why, of course she does,\" Yui said.<br>\r\n<br>\r\n\"Then I'd like to have her massage mine with her...</span></div></span></div>",
            "created":1393688340,
            "id":1753726,
            "title":"Himself"
        },
        "124":{
            "author_id":"astrolight",
            "author_name":"Froslad",
            "choices":[
                "Changed himself or Yui first",
                "Changed the rules first",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"You now that magic store?\" She asked, hands behind her back. Leo nodded. \"They had this notebook,\" she produced a note book from behind her, \"One of kind, they said it can change reality. I thought you would like it\" she handed it to Leo.<br>\r\nLeo looked at it, <i>\"So this can change reality, can't hurt to try\"</i> Leo thought to himself.<br>\r\nHe got a pencil, opened the book and....<br>\r\n</span></div></div>",
            "created":1389502800,
            "id":1726268,
            "title":"I bought this at a magic store; a reality alter..."
        },
        "1243":{
            "author_id":"astrolight",
            "author_name":"Froslad",
            "choices":[
                "Uses the reality note again",
                "Test more anime logic",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span><i>\"I do love anime, and their logic is a whole lot better that ours,\"</i> he grinned to him self. Leo then wrote in the note book, 'The whole world will abide by anime logic, no one will think it;s suspicious, and Yui and I are the only people to notice the difference. Also, besides her body, Yui will be completely unaffected by any changes to reality.' Leo remove the pen from the paper, closed his eyes and sighed. \"Shame that will never happen,\" he despaired over getting his hopes up, and closed the book.<br>\r\n<br>\r\n\"What will never happen,\" a voice said in front of Leo, startling him, causing Leo to jump back in surprise bring the bench he was on an angle, it hovered there for a couple seconds, while he panics, then it feel down and all four legs, <i>\"That was strange\"</i> he looked to the one that had surprised up on him. It was Yui, but she was different. Her chest was bigger, each one was only slightly bigger than his head, and both did a synchronized tiny jiggle each time she inhaled. Her hair was now down to her waist, her skirt was half the size, and her shirt was much more revealing. \"Oh nothing Yui,\" he said, she nodded \"If you say so. By the way, I see things are a bit more like an anime.\"<br>\r\n<br>\r\nJust then Leo heard a voice. \"Hey Yui, Leo,\" a girls voice shouted, Leo turned and was surprised. It was Madeline, and she had changed, along with the more revealing clothing, her chest size was now about three time larger, and each step she took while running to them, her chest did a massive bounce, going from almost hitting her stomach, to covering her mouth. When she arrived, she wasn't even out of breath, however, as she stopped, the force knocked one of her breasts straight out of her shirt and bra, her shirt not even covering the top half of her breasts. Leo sat their staring, and his face, from top-to-bottom, turned red. Madeline got furious, \"You saw!\" she shouted embarrassed of her mind, punching Leo in the face, thought the bench, breaking it in half, and Leo rolled backward.<br>\r\n<br>\r\nWhen he stopped, his face was flat, and blood flowed out his nostrils, and a couple of teeth were missing. He stood up, and was perfectly fine again. No one bat an eyelid to this strange occurrence, even Madeline, after stuffing her breast back in, stormed off. Yui ran to Leo. \"Are you okay?\" she asked concerned.<br>\r\nLeo said he was fine, Yui accepted this want went about her business. A silhouette of Leo floated out of his back, \"That was great, this anime logic world is amazing!\" he shouted in his own head. The silhouette disappeared and Leo. \"What should I do now,\"</span></div></div>",
            "created":1389502800,
            "id":1726301,
            "title":"a world of anime logic"
        },
        "12431":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "she slapped him, begging him to reverse that change",
                "she started teasing him, showing she wanted him "
            ],
            "content":"<div class=\"\"><div> <span>Smirking, Leo brought out the notebook again. His first order of business was obvious. He made it so humans could survive in the cold in nothing but their birthday suits and never had to make clothes. Once that was done, Yui gasped as she saw she was naked. How does she react to this?<br>\r\n<br>\r\n<br>\r\nAN: with either option, Leo will write down that sexy babes from different anime also lived in town. also, that sex is more than welcome, even in public. so he could fuck anyone he wants and not get in trouble, even a married woman in front of her husband</span></div></div>",
            "created":1389502800,
            "id":1726321,
            "title":"naked world"
        },
        "12432":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "More anime logic",
                "More from reality note"
            ],
            "content":"<div class=\"\"><div> <span>Excited by all the anime going on, Leo started running around. His running seemed a lot faster than before. Every where he looked, the glorious ludicrousness that is the anime effect, was present. From peoples body functioning, to the law of physicals all together. When he ran passed the Opticians, inside Leo saw the biggest pair he ever seen, on the doctor. \"Well,\" Leo said to himself, \"Doctors in anime are know to have a great chest.\"<br>\r\n<br>\r\nIn all his admiration of the anime resemblance everywhere, he stopped looking where he was going, and soon stopped feeling floor under his own feet. LEo looked down to see himself, hovering in midair, in a running position, grinning at the situation, he fell. Leo crashed into the floor causing a dust cloud, and a small crater. No one even looked at him, he was unharmed. <br>\r\n<br>\r\nJust then, a gentle voice spoke to him, \"Do you need a hand?\" said a person with long blonde hair, large green eyes, and a rather conservative clothing, only their hands were exposed. Leo told hold of the slender hand in front of him, \"Thanks miss,\" he said as he was pulled up. \"I'm actually a boy,\" he said. Leo's eyes opened wide, perfectly white, and his teeth were outlined in a cartoon like way, \"I am so sorry,\" he bowed his head in apology, he laughed \"Everyone makes that mistake, take care,\" The strange boy said walking off. \"Not everything is great,\" Leo shook his head and.....</span></div></div>",
            "created":1389502800,
            "id":1726370,
            "title":"Test more anime logic"
        },
        "124322":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "his crush Yui, naked and looking very ticked. better try and make things better",
                "Unohana from Bleach wearing a skimpy nurse's outfit"
            ],
            "content":"<div class=\"\"><div> <span>\"This is awesome!\" Leo said, pulling out the Reality Note. \"Hmm, now what to write next? Oh, I know!\"<br>\r\n<br>\r\n'<i>The human race has evolved so that having clothes is no longer necassary and all females walk around in little to no clothing. They also like to tempt me into perverted situations, and public sex is allowed.<br>\r\n<br>\r\nFemale characters from various animated media are also citizens of this city.</i>'<br>\r\n<br>\r\nLeo closed the book, and smirked as he saw various naked women start to surround him. However, one stood out to him.</span></div></div>",
            "created":1389502800,
            "id":1726378,
            "title":"More from reality note"
        },
        "1243222":{
            "author_id":"astrolight",
            "author_name":"Froslad",
            "choices":[
                "She then got him into a perverted situation.",
                "He stuck with Unohana, but went to get Yui"
            ],
            "content":"<div class=\"\"><div> <span>Leo looked around, and saw an actually anime character, it was Retsu Unohana. But instead of her normal, soul reaper uniform, it was a uniform, that of a nurses. It was remarkable skimpy, it wrapped around the under half of her breasts, her waist, and her hips. Leo jumped down to the ground floor, landing in front of her. She was completely unfazed.<br>\r\n<br>\r\n\"Hey Unohana,\" Leo said, unable to look away from her her cleavage, that had no protection from sight.<br>\r\nUnfazed by his gaze \"Oh, good morning Leo.\" she smiled to him.</span></div></div>",
            "created":1389502800,
            "id":1726418,
            "title":"Unohana from Bleach wearing a skimpy nurse'..."
        },
        "12432221":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "she gives him a combination titfuck/blowjob",
                "she wants to check his potency, so he fucks her without a care"
            ],
            "content":"<div class=\"\"><div> <span>\"So, Leo, ready for your check-up?\"<br>\r\n<br>\r\n\"Yes, I am. Let's do it right here in front of everyone.\"<br>\r\n<br>\r\nShe eagerly agreed, and pulled down his pants and boxers, and got ready to give him his \"check-up\".</span></div></div>",
            "created":1389502800,
            "id":1726421,
            "title":"She then got him into a perverted situation."
        },
        "12432222":{
            "author_id":"astrolight",
            "author_name":"Froslad",
            "choices":[
                "Them two to use the note",
                "Something including him, her and Unohana, and maybe some others."
            ],
            "content":"<div class=\"\"><div> <span>Looking over Unohana's arm, he saw the anime style Yui again, his eyes and tongue heart to heart and shot from his head, and retracted, not giving up this chance, he looked to Unohana, \"Wait here and I will be back in a second,\" he said lifting his left leg up to his right shoulder, and dashed off in a flash, leaving a dust trail, in the corner of his eye, he saw half of Unohana's butt poking out of the cosplay. <br>\r\n<br>\r\nAs he was running he admired more of the non-sentical logic going on, The main one he saw was two muscular man, looking like they were about to fight. Each tensed their muscles, showing of to the other, the tensing tore all their clothes in there body to shred. Leo silently laugh, running full speed to Yui.<br>\r\n<br>\r\nIt was only a couple seconds until he reached up to her, unable to stop, he crashed into her, and they both flew of into a wall, shattering it, and a dust cloud formed. It soon settled, and Leo opened his eyes he saw frilly pink panties, surrounded by a short skirt. He looked up to see Yui's faced was flushed, red with embarrassment. She closed her eyes, and slapped hard, flinging his across the room, causing a large nose bleed. He figured this was strange, unscathed by the crashing into the wall, the position they were in when they landed, and how one slap could do this.<br>\r\n<br>\r\nYui calmed and ran over, concerned and filled with regret, she apologized. A minute later, when everything was fixed, even Leo's face and was forgotten, she asked, \"Did you want anything?\"</span></div></div>",
            "created":1395270000,
            "id":1763011,
            "title":"He stuck with Unohana, but went to get Yui"
        },
        "124322221":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "reader's choice",
                "reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"I want us to both use the note,\" he said.<br>\r\n<br>\r\n\"I gave it to you to use,\" she said.<br>\r\n<br>\r\n\"Yeah, but I trust you. Plus, I'm curious as to what you'd do.\"<br>\r\n<br>\r\nShe took the offer, and wrote down something he really liked.</span></div></div>",
            "created":1395322500,
            "id":1763572,
            "title":"Them two to use the note"
        },
        "1243222211":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "She wrote more",
                "Leo checked contacts to see if he had any more spouse (which he will have to)"
            ],
            "content":"<div class=\"\"><div> <span>She scribbled something down, hiding it from Leo. He learned over her shoulder, to see. \"Stop, wait till I've finished.\"<br>\r\nHe sat back, and waited. She finished a minute or two later, and handed Leo the book, and he flipped though the pages.<br>\r\nHe found where Yui had wrote the new changes.<br>\r\n\"Each person can have up to 5 spouses, a spouse of a spouse do not have to do anything with or like each other\" he mused, liking this, \"We are in charge of this country, and any one who meets us must obey everything we say, and they will have no objectives. \"<br>\r\n</span></div></div>",
            "created":1396139160,
            "id":1770341,
            "title":"reader's choice"
        },
        "13":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "purchase off the street from Benny and Bonnie",
                "find at Leo's doorstop",
                "a gift from Leo's late dad",
                "they hear voices, and follow them to the rings",
                "more ways to find them"
            ],
            "content":"<div class=\"\"><div> <span>here's a list of powers the rings possess<br>\r\n<br>\r\nmind control<br>\r\nperception control<br>\r\nsubliminal mind altering<br>\r\nbody alteration(no Gender-Bending)<br>\r\nteleportation<br>\r\nsummoning Benny and Bonnie, the spirits of the rings, the gold having Bonnie and the silver having Benny<br>\r\nopen sub-space portals, allowing them to grope people from long distances(for example, Lenora could be in Los Angelos while Leo and Yui are in Europe, and they could open a portal to grope Lenora without moving an inch)<br>\r\nopen up sub-dimensional wormholes, swapping boys with a female counterpart from another universe<br>\r\nduplication<br>\r\n<br>\r\n<br>\r\nAN: might update with more powers later on.</span></div></div>",
            "created":1389934800,
            "id":1728915,
            "title":"rings of king and queen"
        },
        "15":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Leo and Yui become day-walkers",
                "voodoo(they think they're fake, but are shocked when they try 'em out)",
                "voodoo(they think they're for real",
                "hypno porn DVD",
                "more methods"
            ],
            "content":"<div class=\"\"><div> <span>perhaps Leo and Yui get bitten by vampires when they're 10, but their mothers were secret vampire hunters and they killed the vampires before they sucked up too much blood, and one day, a delayed reaction to the bites and medicine their mothers gave them causes them to become like the MARVEL superhero Blade, gaining all the abilities he has plus mesmerism? or maybe they get voodoo dolls of everyone they know. or maybe they get a hypno DVD from some shady guy in an alley, and play it for their families on group movie night, not realizing it's a hypno porn DVD to brainwash all viewers besides the first two to touch it into being their sex slaves?</span></div></div>",
            "created":1389416400,
            "id":1725865,
            "title":"more methods"
        },
        "155":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "genie in a lamp(3 wishes)",
                "genie in a lamp(unlimited wishes)",
                "more methods"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe they find a magic lamp with a sexy genie, and rub it at the same time, both able to make wishes.</span></div></span></div>",
            "created":1389502800,
            "id":1726343,
            "title":"more methods"
        },
        "1552":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Leo made a wish",
                "Yui made a wish",
                "They agreed on a wish"
            ],
            "content":"<div class=\"\"><div> <span>Leo was at home, not really sure what to do, doing nothing, just lying around in his room, waiting for something good to happen. He sighed bored. The door bell rang, Leo doubted it was for him, so he left it to his mother, who soon answered the door. He heard a familiar voice, ask for permission to come in, his mother told them yes, Leo could hear gentle foot steps up to his room. The door opened, and Yui walked in, arms behind her back, \"Hey Leo, what you up to?\" Leo replied by saying he was doing nothing. <br>\r\n<br>\r\nShe smiled, \"Look what I got,\" she said producing a gold lamp from behind her back. \"I man gave this to me saying 'you and a boy, yes one close to you, are in need of this',\" She imitated the man ,\"I think he was talking about you, you are the boy closest to me. And he said it was a genie lamp.\" Leo was skeptical, bot entirely believing in genies, \"Have you rubbed it yet?\" Leo asked curiously. She shook her head, \"No, I wanted us both to rub it as the same time, so we would both be the master,\" she was being thoughtful. She held it out, wit the base in her right hand, and placed her left hand on it. Leo placed his left hand on it, Yui shouted rub and they did.<br>\r\n<br>\r\nSmoke poured and float out of the lamp, filling the whole room. The smoke faded, and a pink tailed genie floated there. She wasn't wearing anything apart from a band covering the mid section of her over-sized breasts. Red hair flowed from her head to her tail. \"Masters, I am here to grant any wish you may have, until you relinquish ownership of me,\" she said bowing. Yui looked excited, Leo asked \"Are we both your masters,\" the genie nodded.</span></div></div>",
            "created":1389589200,
            "id":1726999,
            "title":"genie in a lamp(unlimited wishes)"
        },
        "15522":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Another wish",
                "Investigate the new world"
            ],
            "content":"<div class=\"\"><div> <span>Yui stepped forward, and inhaled, \"I wish humans evolved the ability to resist low temperature to a point the cold doesn't even bother them, so less clothing is required,\" she said. The genie nodded, raised a hand, pointed to Yui, and a beam shoot from her index finger, and it hit Yui, causing a flash.<br>\r\n<br>\r\nThe flash died down, \"Wish granted,\" the genie announced. Yui was still stood where she a moment ago, but now she was just wearing lacy black underwear, Leo looked down an saw a simple pair of shorts, it was a little cold in the room, but neither Leo nor Yui took notice.<br>\r\n<br>\r\nLeo looked at Yui, \"Why did you wish that?\" he asked confused. \"Because I hate cold, and I didn't want to be bothered by it any more, and I didn't like clothing, that much, I don't mind this because it is so light.\"<br>\r\n<br>\r\nLeo looked at the genie, \"What now?\" he asked himself.</span></div></div>",
            "created":1389675600,
            "id":1727470,
            "title":"Yui made a wish"
        },
        "155221":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "wish 1",
                "wish 2"
            ],
            "content":"<div class=\"\"><div> <span>\"My turn to make a wish,\" Leo said.<br>\r\n<br>\r\n\"What is your wish, master?\" the genie asked.<br>\r\n<br>\r\n<br>\r\nwish 1: \"I wish we could touch any girl we wanted without getting in trouble whenever we want, including a police officer in the middle of a public place or a married woman in front of her husband.\"<br>\r\nwish 2: \"I wish me and Yui were the king and queen of the world, and everyone does whatever we say without question, never even considering turning on us.\"</span></div></div>",
            "created":1389675600,
            "id":1727518,
            "title":"Another wish"
        },
        "1553":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Leo and Yui says, you do",
                "magic cat",
                "another method"
            ],
            "content":"<div class=\"\"><div> <span>maybe Leo and Yui wake up one day where everyone else must do what they say when they start a sentence with \"Leo says...\" or \"Yui says...\"? for example, if Leo were to say to Mimi \"Leo says to flash her tits at everyone she sees\", she'll do it without complaint. or maybe they find a magic cat, and after discovering they're immune to it's mind control eyes, it helps give them a harem in exchange for a loving home</span></div></div>",
            "created":1396119540,
            "id":1770237,
            "title":"more methods"
        },
        "15533":{
            "author_id":"animeguy123",
            "author_name":"Mr. Anime Guy",
            "choices":[
                "Yes, of course.",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about a good old fashioned pendulum/pocket watch</span></div></span></div>",
            "created":1493561640,
            "id":2312988,
            "title":"another method"
        }
    },
    "info":{
        "author_id":"novahamm",
        "author_name":"Hamn8r",
        "brief_description":"a boy and his crush get something to obtain a harem",
        "created":1329334380,
        "description":"<td align=\"left\" class=\"norm\">I deleted my story \"MC ring\" to make room for this story. here, Leo and Yui will rule together.<br>\r\n<br>\r\n<u>Characters</u><br>\r\n1) Leo Roar- one of the main characters. 19 years old/blond hair to his shoulder/green eyes<br>\r\n2) Yui Sakura- Leo's childhood friend/crush, 19YO, long pink hair, blue eyes, CC cup, sweet and likes Leo too(he doesn't know it yet)<br>\r\n3) Lenora Roar- Leo's mother, 40YO, long black hair, blue eyes, DD cup, very strict towards Leo<br>\r\n4) Madeline Roar- Leo's older sister, 21YO, short black hair, brown eyes, D cup, loves to pick on Leo<br>\r\n5) Mimi Roar- Leo's younger sister, 18YO, short brown hair, blue eyes, C cup, loves to pull pranks on Leo<br>\r\n6) Leona Roar- Leo's twin sister, 19YO, blond hair halfway to her ass, green eyes, E-cup, heart-shaped ass, sees Leo as more than a brother and has a crush on him and Yui. she was born a few minutes after Leo. she also has a bit of a tickle fetish, and is ticklish all over, even her ass.<br>\r\n7) Linda Howl- aunt, 35YO, short brown hair, green eyes, DD cup, kind to Leo<br>\r\n8) Kayla Howl- cousin, 17YO, short brown hair, blue eyes, CC cup, loves to tease Leo<br>\r\n9) Junko Sakura- Yui's mother. 42 years old but doesn't look a day over 35, never mind one who's had five kids. Wears her pink hair short, has enchanting blue eyes, as do her kids, and likes to put her D-cup boobs on display.<br>\r\nMinako, Sachiko, and Tomoko Sakura- Yui's older sisters and triplets, 19 years old, they just finished their freshman year at the local university. According to Yui, they put a lot of work into looking identical--though they haven't gone quite so far as to get their fingerprints surgically altered to match. They like to wear their pink hair down to the middle of their backs and, like their mother, like to put their C-cup boobs on display, and are a bit jealous of Yui's larger breasts.<br>\r\n10) Masami Sakura- Yui's younger sister, 15 years old, she still looks much younger as she hasn't entered puberty yet. Wears her pink hair in long braids.<br>\r\n11) Dawn Jones- Yui's aunt. Shortly after Junko's birth, her father passed away and soon after her mother married a man from the US. He insisted that his daughter, two years younger than his stepdaughter, would have a \"good American name\". She got an odd mix of racial features--her mother's Asian heritage shows in her face and the rest of her colouration, but it's framed by shoulder-length golden blonde hair and contains vibrant green eyes, which she passed to her kids. She tends to dress modestly, but can't hide her F-cup tits and large butt.<br>\r\n12) Sandra and Veronica Jones- Dawn's daughters. Dawn also married a man from the US, shortly after he got her pregnant when she was 18. He was content to let her keep her last name and pass it to her daughters, but insisted that he would give them their first names. Fraternal twins, Sandra has her mother's hair and could pass for Caucasian except for her clearly Asian eyes, while Veronica is the opposite, with pink hair and Asian colouration contrasting with her almond-shaped eyes. Veronica prefers to wear her hair like her aunt's, while Sandra keeps her blonde hair as long as Yui's. They did both inherit their mother's curves, but unlike her love showing them off. They just earned bachelor's degrees from the same university that their triplet cousins attend.<br>\r\n13) Melissa Jones- six years older than Dawn, and her half-sister from her father's first marriage. Small with unremarkable Caucasian features, brown eyes and lanky brown hair. She never married and has no children. She has no curves at all, is very submissive and dreams of being a busty, curvy toy for a man to use.<br>\r\n14) Jessica Jugg- landlord, 38YO, , brown eyes, shoulder length black hair, single, harsh towards Leo, but kind to his family<br>\r\n15) Jenny Jugg- Jessica's daughter and Jasmine's twin sister, green eyes, short blond hair, E cup, loves to pick on Leo<br>\r\n16) Jasmine Jugg- Jessica's daughter and Jenny's twin sister, blue eyes, short blond hair, E cup, loves to pick on Leo<br>\r\n17) Chloe Kare- security guard, 35YO, brown eyes, dark brown hair to the middle of her back, FF boobs, big butt, slightly chunky, stern<br>\r\n18) Kaitlyn Kare- Chloe's daughter, 19YO, brown eyes, shoulder length brown hair, E boobs, nice ass, slim, doesn't like Leo, Yui, or their families<br>\r\n*Add any other characters you want, as long as they're at least 13 years old, you run them by me, and I approve. you'll have to IM me*<br>\r\n<br>\r\nRules for this story<br>\r\n1-15) <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.writing.com/main/view_item/item_id/1959115-Hamn8rs-rules\" target=\"_blank\">http://www.writing.com/main/view_item/item_id/1959115-Hamn8rs-rules</a><br>\r\n16) Leo and Yui are immune to any mind control<br>\r\n17) no one can resist their power<br>\r\n18) hardcore sex is welcome<br>\r\n<br>\r\nother than that go wild</td>",
        "id":1848392,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1493561640,
        "modified":1493561640,
        "pretty_title":"Leo and Yui's Hypno Harem"
    }
}