{
    "chapters":{
        "1":{
            "author_id":"chrisern",
            "author_name":"ShadowBlade",
            "choices":[
                "War of Iron",
                "Electric Soldier Enzarger",
                "City of Cancer",
                "Bloody Wastes",
                "Other setting."
            ],
            "content":"<div class=\"\"><div> <span>Story 1: The War of Iron:<br>\r\nIn the future, the worlds of space have opened up, and humanity has taken over the stars. When a split happens, the stars and planets are split into two groups-the fierce and violet New Stellar Empire, and the Democratic Republic of Sol Garga. With the new 'Myrmidon' mecha in mass production, it's a fierce arms race as the two sides duke it out for control of the system... Take control of a pilot serving Sol Garga, and leave your mark on this war!<br>\r\n<br>\r\nStory 2: Electric Soldier Enzarger<br>\r\nWhen the Hadean Empire invades from the sky, Jurota Makigami, a high schooler who likes to fiddle with electronics, finds himself on the side of a secret war against the alien empires, with the help of an intelligent robot named Enzarger, his creator, the eccentric scientist Norifumi Kyosuke, his daughter Maki, and an alien defector named Cerber. Can Jurota, Enzarger, and their help overthrow the reign of Emperor Hade?<br>\r\n<br>\r\nStory 3: The City of Cancer<br>\r\nIn the Golden Kingdom, all rebellion is quenched under the power of the state's Ex-Bios: Extremely small biological nanomachines that can morph and change into different forms. The military uses them for weapons and armor, but they have uses all around: medicine, law enforcement, and even construction, being strong and sturdy for houses to be made out of. In fact, in the Golden Kingdom, the whole city is made of the biological nano-machines, being a living organism into itself. But when cancerous growths with anti-city slogans and strange, biomechanical suits begin to appear, a revolution begins.<br>\r\n<br>\r\nStory 4: The Bloody Wastes<br>\r\nAfter a nuclear war destroyed Earth, the city of Neo Tokyo seeks a way to expand and grow, and so expeditions using the new Khaos mechanical units begins... a series of struggles against the mutants of the outside world occurs as ideas new and old clash.</span></div></div>",
            "created":1555630260,
            "id":2646500,
            "title":"Opening"
        },
        "12":{
            "author_id":"chrisern",
            "author_name":"ShadowBlade",
            "choices":[
                "Fear.",
                "Hate.",
                "Anger.",
                "Despair.",
                "Confusion."
            ],
            "content":"<div class=\"\"><div> <span><i>Deep in space</i><br>\r\n<br>\r\n\"Emperor Hade? We are set to begin our invasion of Earth.\" A man, with purple skin and reptilian scales, speaks from a bridge.<br>\r\n<br>\r\nThe man he's speaking to, sits on a throne, in a area filled with purple metal and green plastic. The man-Emperor Hade-stands up, moving his dark purple cape behind him, revealing his green suit with gold highlights.<br>\r\n<br>\r\n\"Excellent. Our Chimerae will destroy the world, and then we can raze it for the thing we so desperately need: Plutite.\"<br>\r\n<br>\r\n\"REDUCE TO SUB-SONIC SPEED! Our arrival shall be telegraphed with a grand appearance, and they shall know our attack.\"<br>\r\n<br>\r\n-----------------<br>\r\n<br>\r\nJurota would always remember that question \"Where were you when they came?\".<br>\r\n<br>\r\nHe was in his garage, fiddling with some computer parts.<br>\r\n<br>\r\nLet's back up a bit. Jurota Makigami. Age 17, finishing his 3rd year of high school in Japan, specifically the Chubu prefecture. Son to Tohru Makigami, a programmer, and Junko Makigami, a nurse.<br>\r\n<br>\r\nAs he fiddled with the circuit board, he noticed a sound, resounding. Coming from the sky.<br>\r\n<br>\r\nHe then saw the Arbitor-also known as the Mobile Hadean Base: Styxia.<br>\r\n<br>\r\nEveryone could see it.<br>\r\n<br>\r\nA voice seemed to resound from everywhere, and yet from nowhere at once.<br>\r\n<br>\r\n\"Foolish creatures of this backwater planet! Bow to your knew subjugators, and know true peace! Bow to the Hadean army!\"<br>\r\n<br>\r\nJurota felt a primal emotion in his heart.</span></div></div>",
            "created":1555634160,
            "id":2646536,
            "title":"Electric Soldier Enzarger"
        },
        "13":{
            "author_id":"chrisern",
            "author_name":"ShadowBlade",
            "choices":[
                "An ex-military person, kicked out for disobedience with a score to settle...",
                "An orphan, who has seen the city's cruelty face to face, and wanting justice...",
                "The child of one of the leaders, with a growing sense of responsibility...",
                "A revolutionary with a need for power-any power, no matter the cost...",
                "A religious person with a strong moral compass and a duty to do what is right..."
            ],
            "content":"<div class=\"\"><div> <span>In the city of Garowth, everything is life.<br>\r\n<br>\r\nNot just the trees, the animals, the people. The buildings of the city itself are tiny, living organisms.<br>\r\n<br>\r\nThey're called Ex-Bios. They're tiny, organic nanomachines, able to replicate the appearance of other materials like metal and stone. They have their own power generators, and the whole city, all buildings, are created out of them. Anything that appears inorganic is actually organic. Concrete. Clothing. Tools. Computers. Everything.<br>\r\n<br>\r\nSounds neat, right?<br>\r\n<br>\r\nWrong.<br>\r\n<br>\r\nFor most of the people living in this city, things are normal. They're blissfully unaware of anything viewing them, not knowing that the saying 'The walls have ears' is not only true in a figurative sense, but a literal one. Every Ex-Bio can see and hear anything around them.<br>\r\n<br>\r\nBut then, one year, something very strange happened.<br>\r\n<br>\r\nParts of the city began to act... strange.<br>\r\n<br>\r\nLike a human body developing a cancerous growth, the buildings warped and shifted. Anti-government slogans appeared as graffiti. Truths were revealed to anyone who was in there.<br>\r\n<br>\r\nAnd, nobody could surveil anyone that was in there.<br>\r\n<br>\r\nEx-Bios make great weapons. The city's army has cutting-edge weapons, both for range and for melee combat. They also have been injected with them, allowing them to have increased speed, strength and endurance.<br>\r\n<br>\r\nAnd so it was, that in these 'Blind' areas, that one person found something to help them fight back: A suit made of rogue Ex-Bios, with armor and weaponry. Adjustable. Sentient. Powerful.</span></div></div>",
            "created":1555792980,
            "id":2647427,
            "title":"City of Cancer"
        },
        "15":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "1. There is Only War",
                "2. Hail Britannia!",
                "3. Mobile Assault Division",
                "Other Choices?"
            ],
            "content":"<div class=\"\"><div> <span>Alright, how about these?<br>\r\n<br>\r\n1. There is Only War-In the far flung future of the 41st Millenium, war is what many only know. Among the towering super soldiers of the Adeptus Astartes, the Dreadnoughts, tomb-mechas piloted by once crtically engineered Space Marines, and Titans, collasal multi team mechas, as well as many others in between, wage war, for the glory of the God Emperor of Mankind<br>\r\n<br>\r\n2. Hail Britaiinia-The Holy Britannian Empire, having conquered most of the known world, has come under threat from Japanese insurgents. You are a new pilot for the Knightmare Frames, agile robots with firepower and speed. <br>\r\n<br>\r\n3. Mobile Assault Division-You play Sanjuro Makabe, a Mobile Combat Armor (MCA) pilot and Commander in the UCA Security Force. The UCA was originally formed by three dominant megacorporations (Andra Biomechanics, Armacham Technology Corporation, and Shogo Industries). Originally intended as a joint venture that would ensure the continued profitability of the three organizations that founded it, the UCA is now independent, and the dominant military power in existence. <br>\r\n<br>\r\nYour mission is to locate and assassinate a rebel leader known only as Gabriel. All of the action takes place either on the planet Cronus or on the spaceship Leviathan. The Leviathan is the flagship of the UCA and is commanded by Admiral Akkaraju. Cronus is the only known source of the biologically active material known as Kato, an incredibly powerful energy source essential to the process by which interstellar travel is possible. <br>\r\n<br>\r\nYour deadly enemy is The Fallen, a fanatical terrorist group lead by the mysterious Gabriel, threatens the balance of power on Cronus, and ultimately, control of Kato. You will fight them on your feet or from within one of the different types of Mobile Combat Armor, a giant mech which can run, duck, strafe, swim or transform into an ultrafast hovertank. </span></div></div>",
            "created":1555710420,
            "id":2646943,
            "title":"Other setting."
        },
        "154":{
            "author_id":"chrisern",
            "author_name":"ShadowBlade",
            "choices":[
                "Rage of the Sacred Knights",
                "Academy of Steel",
                "Tiny Robots, Big Power",
                "Another option"
            ],
            "content":"<div class=\"\"><div> <span>Alright, here are a few more settings.<br>\r\n<br>\r\n1. Rage of the Sacred Knights<br>\r\n<br>\r\nThe Paladyns-holy knights of the church-use sacred artifacts known as Seraphim to rule the masses with force. Seraphim are magical suits of giant armor that can be commanded remotely, or ridden in. When a young (gender) falls into a cave and discovers a trove of books, as well as a Seraphim named \"Lucifer\", however, a new age will begin...<br>\r\n<br>\r\n2. Academy of Steel<br>\r\n<br>\r\nAt Juubei Military Academy, young men and women are prepared for war and battle, not just on the ground, but in the cockpits of mechanical weapons known as 'Gears'. Follow a bright young new class, as they navigate the battlefield and the classroom. <br>\r\n<br>\r\n3. Tiny Robots, Big Power<br>\r\n<br>\r\nIrons are toy robots, able to be controlled remotely, for simple battles between children. But when a PMC produces weaponized Irons for use in their own deeds, a small group of brave boys and girls finds themselves on the frontline of a war going on right under their noses...</span></div></div>",
            "created":1555729500,
            "id":2647045,
            "title":"Other Choices?"
        },
        "1541":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off, what is the gender of our protaganist?<br>\r\n</span></div></span></div>",
            "created":1556343600,
            "id":2650940,
            "title":"Rage of the Sacred Knights"
        },
        "15411":{
            "author_id":"chrisern",
            "author_name":"ShadowBlade",
            "choices":[
                "Tristan fell unconscious when he landed at the bottom. He awoke later.",
                "Tristan managed to stay conscious as he landed at the bottom, seeing books..."
            ],
            "content":"<div class=\"\"><div> <span>Crash!<br>\r\n<br>\r\nThe ground caves out from under Tristan's feet and he falls... falls... falls deep into the earth.<br>\r\n<br>\r\nOf course, this was a far greater outcome than what would think of at first, but Tristan didn't realize it at first.<br>\r\n<br>\r\nHe had been looking out in the wilderness for food for the village.<br>\r\n<br>\r\nEvery village had to give up some of its food as a sort of tax to the Paladyns.<br>\r\n<br>\r\nNobody liked it, but they needed food both for the tribute and for themselves, and so, Tristan, Curran, and Emilia all had gone out to look for mushrooms, berries, and, if necessary, animals.<br>\r\n<br>\r\nTristan had been looking for mushrooms near the caves, when a loose rock fell in and it collapsed, sending him in.</span></div></div>",
            "created":1556405340,
            "id":2651504,
            "title":"Male"
        },
        "15412":{
            "author_id":"chrisern",
            "author_name":"ShadowBlade",
            "choices":[
                "Trista fell unconscious when he landed at the bottom. She awoke later.",
                "Trista managed to stay conscious as she landed at the bottom, seeing books..."
            ],
            "content":"<div class=\"\"><div> <span>Crash!<br>\r\n<br>\r\nThe ground caves out from under Trista's feet and she falls... falls... falls deep into the earth.<br>\r\n<br>\r\nOf course, this was a far greater outcome than what she would think of at first, but Trista didn't realize it at first.<br>\r\n<br>\r\nShe had been looking out in the wilderness for food for the village.<br>\r\n<br>\r\nEvery village had to give up some of its food as a sort of tax to the Paladyns.<br>\r\n<br>\r\nNobody liked it, but they needed food both for the tribute and for themselves, and so, Trista, Curran, and Emilia all had gone out to look for mushrooms, berries, and, if necessary, animals.<br>\r\n<br>\r\nTrista had been looking for mushrooms near the caves, when a loose rock fell in and it collapsed, sending her in.</span></div></div>",
            "created":1556405520,
            "id":2651505,
            "title":"Female"
        }
    },
    "info":{
        "author_id":"chrisern",
        "author_name":"ShadowBlade",
        "brief_description":"In a world of iron giants, what will you choose to do? Fully original mecha stories!",
        "created":1555626840,
        "description":"<td align=\"left\" class=\"norm\">Rules:<br>\r\n1. Keep nsfw stuff to a minimum. A bit of innuendo or some characters being in love is okay, sex scenes are not.<br>\r\n2. Play to the rules of the style. If a story is kid-friendly, keep it kid-friendly, if it's more realistic, it's okay to swear a bit.<br>\r\n3. Try to stay logical. It's okay for the shonen hero to pull a new weapon or ability out of nowhere to win a fight that seemed to not be able to be won, it's less okay in a serious sci-fi war setting.</td>",
        "id":2188618,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1556405520,
        "modified":1556405520,
        "pretty_title":"Mecha Interactive"
    }
}