{
    "chapters":{
        "1":{
            "author_id":"person543",
            "author_name":"person",
            "choices":[
                "Go straight home\"",
                "Make a quick stop at Wawa for a snack.\""
            ],
            "content":"<div class=\"\"><div> <span>Your name is Anthony, you were bored one day so you decided to invite two friends over. Their names were Samantha or Sam and Christine. They were pretty good friends. When you heard the door ring you knew it was them, and so you let them in. You went to the basement and found a ball. You guys started playing catch and it quickly turned into a dodge ball game. You managed to hit Sam in the face with the ball and she tried to tackle you. you could take her, but when Christine joined in to help her they pinned you down, and were sitting on your chest. Then you noticed that Sam seemed to be glowing, but when you told her that she thought you were making fun of her for having really light skin. So she turned around, put her feet on your face and said, \"Smell my sweaty feet Anthony.\" Her bare feet didn't smell very nice. Then you heard Christine say that Sam was glowing too. But at that time there was a really bright flash of white light and then you passed out. When you woke up you were under something that was pretty heavy and being pushed into the carpet. You couldn't see anything because what ever it was that was on top of you was covering your whole body. You tried to scream for help but as soon as you opened your mouth a foul salty fluid filled your mouth, and since there was no room to spit it out you had to swallow it. Then you heard voices. You could hear Sam and Christine talking but for some reason Sam was so much louder. You couldnt make out what they were saying but Sam seemed upset. Then you felt a whole lot of weight on top of you. Then you felt as if you were being lifted and a whole lot of light flooded your vision. Then as soon as it came in the light was gone and you were being pressed into the carpet, and then back into the air. Then it all made sense. The bad smell, the constant motion, and the foul liquid all added up to the conclusion that you were stuck to the bottom of a giant person's foot. Then the person laid down and let her sole's face up so you were exposed to the light and started to shout for help. The you saw Christine walk by and she saw you and started laughing. You said, \"Shut up, and help me!\" Christine said, \"Sam he's on your foot!\" Then you saw two giant white fingers peel you off of Sam's sweaty foot. She then picked up Christine and held you both in her giant hand, You were holding onto her giant thumb so that you wouldn't fall off her hand.\" Sam how did you get so big?\" You asked. Then she laughed and said, \"i'm not big, you two are just really small.\" \"how did we get this small?\" You asked her. She said, \"oh I think it is my fault. I'm not sure how i did it but i'm pretty sure i did do it.\" Then Christine said, \"Well you gonna fix us?\" \"I don't know how.\" Sam said. <br>\r\n     \"So we are suck like this forever?\" You asked. \"Well don't think of it that way, i'm sure you two can have some fun at this new size.\" She said. \"Easy for you to say, your normal sized.\" You said. \"Well you are gonna be stuck like this for a while so get used to it. And i have to go home now so I'm going to take u guys with me. and I don't have pockets so i don't know where to keep you guys...\" \"Why cant you carry us?\" You asked. \"Well i'm biking home so ill only have one free hand, so you can only carry one of you.\" She said. Christine said, \"You should put him in your shoe, if he took a nap under your foot then he must like your feet.\" Before you could say anything Sam had an evil smile on her face and put you in her shoe and told you to stay in between her toes so that you don't get hurt. Sam didnt want you to get hurt but she wanted to have a little fun with this too. You Listened to her and got between her giant sweaty toes and you heard her giggling whenever she curled her toes. Then you heard her asking Christine weather she should go straight home or stop for a snack. You couldn't hear what Christine said but you did hear Sam say, \"ok fine I'll....\"</span></div></div>",
            "created":1282366800,
            "id":940468,
            "title":"Typical day, or is it?"
        },
        "11":{
            "author_id":"person543",
            "author_name":"person",
            "choices":[
                "Made Christine normal sized temporarily",
                "Offered Christine some money",
                "Gave Christine something she really wanted.",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You heard Sam say, \"na lets just go home, he might die in there if I leave him with my feet for too long.\" <br>\r\nChristine said, \"aw sam ur feet cant be tht bad...\"<br>\r\nSam said, \" u wanna see for yourself?\" And before Christine could say anything sam closed her hand so she couldn't hear Christine. Then she took her foot out of the shoe you were in and realized that you were stuck to the bottom of her foot (again) but this time with your head in between her toes, she laughed and then spread her toes a little and put Christine's head between the next pair of toes. You heard her giggle as she put her shoe back on. Every now and then she would curl her toes just to make sure you two would stay between her toes. Aparently she was being tickled cuz she kept moving her foot around and it kept grinding your face into her toe jam. You weren't moving so you assumed it was christine trying to get her face out of in between Sam's toes, it wasn't working but she kept trying and Sam seemed to be getting tired of it. She slammed her foot on the ground and it hurt you and Christine. Christine screamed but you didn't. You could hear Christine crying a bit. When Sam got home she took you both out of her shoe but left you on her foot until she got to her room. then she took you guys off and held you in her hand. Then she saw that Christine had been crying. She got upset and tried to apologize to you two. \"I didn't mean to hurt you guys, i just wanted you to stop moving around.\" She said. <br>\r\n\"You have to be more careful with us, we are a little more breakable now u know....\" i said.<br>\r\nSam said, \"I know im sorry...\"<br>\r\n\"That doesn't make it OK to just put us under your feet!\" Christine shouted.<br>\r\nSam said, \"it was just a joke, I didn't mean to hurt you.\"<br>\r\n\"I don't care we aren't toys, we are normal people, just like you!\" Christine said.<br>\r\n\"You are a little smaller than a normal person, most people are not as small as one of my toes.\" Sam said<br>\r\n\"Well that is your fault\" i added in.<br>\r\n\"Would u like to spend some time in my sock?\" Sam said to you.<br>\r\n\"No,no ill stay out of it.\" You said.<br>\r\n\"See this is what i mean you are being completely unfair to us just because your bigger than us.\" Christine said.<br>\r\n\"Well i'm sorry but its just so easy because your tiny.\" Sam said. Before Christine could say anything, Sam said, \"OK how about i make it up to you.\"<br>\r\nThen she...</span></div></div>",
            "created":1286168400,
            "id":968313,
            "title":"Go straight home"
        },
        "111":{
            "author_id":"nike1235671",
            "author_name":"nike12367",
            "choices":[
                "Christine, sorry but I can make you normal size permenatly...",
                "Christine, take your foot off of him hes my foot slave not yours.",
                "Christine take your foot off him don't be mean."
            ],
            "content":"<div class=\"\"><div> <span>Sam said, \"well I think I can do something u might like.\" to Christine. And then Sam picked up Christine and her hand started to glow. She set Christine down and Christine asked what she did, Sam told her to wait and find out. We all stood there in scilence waiting for something to happen, then out of nowhere Christine started to grow. She kept growing until she was back to her original hight which was a little taller than Sam was. Christine was happy that she had been restored to full size and gave Sam a hug. Sam then left to go use the bathroom, and I was left with Christine. She picked me up and held me in her fist. It hurt because she wasn't being gentle at all. I complained to her and she just laughed at me. \"I can see why Sam liked having tiny people with her, it's fun.\" Christine said. I said, \"It's not fun from my point of view, I'd die if u accidentally dropped me.\" \"fine, I'll put u back down...\" she said. While she lowered me to the ground she pretended to drop me several times. When she put menon the ground she kept pretending to step on me. She pinned me down under her toe and told me to kiss it. I said, \"no way, I'm not your slave!\" she said, \" I don't think you are in any position to be yelling at me little guy. Then Sam walked in and said, \"...</span></div></div>",
            "created":1292734800,
            "id":1018484,
            "title":"Made Christine normal sized temporarily"
        },
        "1111":{
            "author_id":"username3141",
            "author_name":"ΩGIANTESSWRITER",
            "choices":[
                "To continue torturing in this room",
                "To go to the pool and take a quick swim with me",
                "To try to be a little more nice to me"
            ],
            "content":"<div class=\"\"><div> <span>Upon hearing the news, Christine popped a grin on her face as if she never heared the word sorry. As Sam undid the process of making Christine smaller, for good this time, Christine whispered over to Sam with a smirk on her face. I could tell this wasn't good...<br>\r\n<br>\r\nShe says...</span></div></div>",
            "created":1469941200,
            "id":2189169,
            "title":"Christine, sorry but I can make you normal size..."
        },
        "11112":{
            "author_id":"username3141",
            "author_name":"ΩGIANTESSWRITER",
            "choices":[
                "...Have more pooltime FUN!\"",
                "...Dry up and do something else\""
            ],
            "content":"<div class=\"\"><div> <span>Sam whispered back, \"Yeah, lets go!\" Christine knew just the place... I, on the other hand had no idea what was happening and was grabbed by Christine and got shoved into her shoe. Without a word, the girls biked to Christine's house and had come in. I felt the excruciating pain of Christine climbing into her room, then she stopped, did something and climed down and out into Christine's backyard. Then, she took off her sockless shoe. Light flooded my eyes and when I recovered, I was on Christine's head, with her and Sam both halfway in Christine's private pool! When Sam noticed I was awake, she picked me off and put me on dry land by the shallow end. The 2 then showed off their bikinis by posing in my face. After the showey stuff, the girls played a game with me, a splash fight... I was placed on an ocean cruise boat toy and the girls threw waves that were only about 5 inches high, but in my view, they were 60 ft tsunamis! The boat rocked in the waves as I stowed away in the cabin while I was assulted by waves in the pool. Sam got tired and put my boat of land. <br>\r\n<br>\r\n\"What's next?\" Asked Sam. Christine replied \"Let's...</span></div></div>",
            "created":1470027600,
            "id":2189464,
            "title":"The waters of torture"
        },
        "11113":{
            "author_id":"username3141",
            "author_name":"ΩGIANTESSWRITER",
            "choices":[
                "Shrinking and keeping all the boys in the city",
                "Showing me to their friends (all girls)"
            ],
            "content":"<div class=\"\"><div> <span>Once she heared Christine finish her sentence, Sam looked at me with pity in her eyes... But after a minute of thinking, Sam put a smile on her face, while putting her seemingly gigantic foot on me once again. \"Maybe not\" Sam proudly announced! Christine happily bent over and picked me up and clutched me in her hand, but much more loose then the last time, due to her good mood. \" Let me join in the fun too!\" Exclaimed an eager Christine, \" definetly!\" Replied Sam. Chistine had put me in a small vacant glass hampster cage, while she and Sam talked away for a while, speaking of ways to have \"fun\" with my mini form...<br>\r\n<br>\r\nAfter a while, they decided on...</span></div></div>",
            "created":1470027600,
            "id":2189442,
            "title":"Maybe Not..."
        },
        "111131":{
            "author_id":"username3141",
            "author_name":"ΩGIANTESSWRITER",
            "choices":[
                "The girls were there but the faces of Christine and Sam loomed over the city",
                "All the girls weren't there then all the missing girl faces loomed over the city"
            ],
            "content":"<div class=\"\"><div> <span>During their talk, I overheared Sam talking about a shrinking spell and Christine learning it. They left the room for a while and left me wonder about what might happen next... After a decent half-hour, the girls rushed back in and Christine shoved me in her breast pocket once again. I got nauseous of me going up and down because of Christine's running, but soon wasjoined by 10 three inch tall boys also stuffed in here. And then it all made sense! Sam had taught Christine to use the spell that shrank us to get more boy slaves and toys! They managed to fit all the boys in Christine's pockets, but made me wonder, what was Sam carrying? When the duo arrived at Sam's house, Christine sat down with her load while Sam seemed to go back and forth to get more and more of her's... Once we were all let out, we passed out and when we woke up, we were on the streets of our city! Everything was where it should but... </span></div></div>",
            "created":1470117840,
            "id":2190018,
            "title":"Becoming teen girl overlords"
        },
        "1111311":{
            "author_id":"username3141",
            "author_name":"ΩGIANTESSWRITER",
            "choices":[
                "*Use the giantess' POV* make something up",
                "*Use Anthony's POV* make something up"
            ],
            "content":"<div class=\"\"><div> <span>Seeing the two girl's faces looming over the city and them both knowing some kind of shrinking spell lead to one conclusion... The girls shrank the city and made us all toys! I saw Christine's seemingly gigantic knees and that the 30 ft statue had only reached up to there! Everyone only reached about her ankles and was helpless to stop the 2 seemingly 90 ft teens girls from making our city into a tiny toy! Sam proudly announced, laying to face the city, \" I love our new playground!\" Creating a thunderstorm sized gust with every word. Christine joined in and then helped Sam move their little city to a very large painted room with nothing in it to ensure nobody escaped! With Sam shutting the door, the girls went down the stairs causing tremours in the city. The next day, we were joined by all the other cities in the world in the same room, probably shrunken and put here too... soon Christine and Sam entered and stood in an unocupied space in the room.<br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1472708760,
            "id":2204476,
            "title":"Big girls need big toys..."
        },
        "111132":{
            "author_id":"username3141",
            "author_name":"ΩGIANTESSWRITER",
            "choices":[
                "Go take a swim in the pool",
                "Go back to my house and torture/decide what to do next"
            ],
            "content":"<div class=\"\"><div> <span>Sam took me out of the cage and placed me into her shirt pocket, while Christine pulled out her phone and called 2 other girls to come meet her and Sam at their old school scince there weren't enough students so it closed down and they never got to demolishing it... Anyhow, once they all arived, I was introduced to the rest of the group. There was Danielle, a 5' 2\" Chinese-American long haired brunette that's 14 years old and smooth perfect white skin. On the other hand, there was the 16 year old, extremely long haired blonde, Catherine. She stood at 4' 6\", very short for her age, but she was very smart and wore glasses. her hair touched the ground and she was happy seeing someone shorter than her a this age... After the intros, sam pulled me out of her pocket and held me out in front of the girls. \"here's our very own torture slave!\" Sam announced, placing me on a footstool. All the girls layed down on the floor, surrounding me on the stool. Everyone soon got up and Danielle sat on me to keep me from escaping. While the girls were talking of where to go next, I lay there thinking about the torture that I or maybe others could go through...<br>\r\n<br>\r\nWhat do they decide?</span></div></div>",
            "created":1470027600,
            "id":2189447,
            "title":"New introductions, Leading to new work..."
        },
        "1111322":{
            "author_id":"username3141",
            "author_name":"ΩGIANTESSWRITER",
            "choices":[
                "pool games and sockless shoe runs with me inside the shoe",
                "hide n' seek and model city making"
            ],
            "content":"<div class=\"\"><div> <span>During the conversation, Catherine suggested to go to her house and make me do stuff for them... The girls cheered at the suggestion and decided to go! Danielle, still sitting on me, let out a great big fart and then stuffed me to her sweaty gym sock she recently used doing laps on the track. At Catherine or Cathy's (as her friends call her) house, I was placed on a table while Sam suggested first... <br>\r\n<br>\r\n<br>\r\nAs she chose pedicures, she removed her socks as did everyone else and pulled out a bottle of pink nail polish and a shrunked paint roller that's big enough to cover 1/8 of her big toe each run. As an hour passed by, I had finished Sam but had to do the rest of the girls... 3 hours later I'd finished the rest of the giantess's feet. After having half an hour of rest to let the nails dry, Danielle chose next... <br>\r\n<br>\r\n<br>\r\nHairstyling! I had to struggle pulling back and putting a ponytail on each girl's head. Each head took 30 minutes to do, but Cathy's locks tooke me the rest of the day to do...<br>\r\n<br>\r\n<br>\r\nIn the morning, the other 2 girls had more of a playful mindset and chose...</span></div></div>",
            "created":1470120720,
            "id":2190032,
            "title":"Suggested torture"
        },
        "11113221":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Sam shrink Daniela and Catherine",
                "Sam shrink all."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><br>\r\nDaniele decides to put me in the shoe, and all were walking after every walk, I was stuck on her finger with sweat. The girls begin to discuss a bit, and Sam decides to shrink them.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1474426500,
            "id":2212691,
            "title":"pool games and sockless shoe runs with me insid..."
        },
        "1112":{
            "author_id":"person543",
            "author_name":"person",
            "choices":[
                "How Sam shrunk us to start with",
                "When she leads she had the power to sizeshift things",
                "If she COULD help me."
            ],
            "content":"<div class=\"\"><div> <span>Christine get your foot of of him he's my foot slave not yours.\" <br>\r\n\"What? Sam come on you can change me back like you did Christine right?\" I asked all worried. <br>\r\n\"well I'm only good at the female growth spell but I probably could try to make you normal... But I'd rather not.\" Sam said.<br>\r\n\"Sam come on I'm still person change me back now!\" I shouted \"I don't want to be this small forever!\" <br>\r\nSam said, \"well I'll change you back eventually, but I want you small for now, I'll change you back when I get bored of you. For now just behave and we won't have a problem.\"<br>\r\n\"problem? What do you mean by that? Are you gonna kill me? I'm not your toy! Fix me now!!\" I said <br>\r\n\"I don't think that you get the idea... You are the size of my little toe you can't force me to do anything. And this isn't behaving, so now I want you to do our nails.\"<br>\r\n\"How, I'm too small? I cant even climb onto your toes...\" I said<br>\r\nSam said I'll put you on my foot but first I gotta shrink some paint brushes so you have something to use. She left to go get some things and asked Christine what color she wanted and Christine said she wanted red, and Sam chose black. She left to go get the things and I started to shout at Christine. \"why the hell didn't you say anything? She's treating me like a toy or a pet! Weren't you the one getting mad about this before?\" I shouted.<br>\r\n\"I'm not gonna argue with her! She could shrink me too, I'm normal sized right now and I want to stay that way. You know she won't hurt you, she's just playing with you... Just listen to her and you'll be fine. Anyway, I actually needed to get my nails done so do a good job or I'll talk her into keeping you longer.\" I couldn't believe that my life was now in the hands of a teenage girl. Just then Sam walked in with the stuff and put me on her right foot and told me to start. I told her I still did not want to and reminded her that she could do it herself much quicker. She insisted that I do it because I was their little foot slave. By the time I was on Sams other foot I was already tired, and I still had to finish her foot and christine's two feet. Sams feet smelled terrible but it was proably because she rode her bike to and from my house with her old shoes and no socks, plus it was hot out. While I was doing Sams nails I saw the toejam in between her toes and prayed to god that I wouldn't fall into it. Then they started to talk about something. They were talking about:</span></div></div>",
            "created":1293598800,
            "id":1024684,
            "title":"Christine, take your foot off of him hes my foo..."
        },
        "112":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "You don't get any money because you're just going to be Sam's slave.",
                "Sam tells you that she's not ever going to pay Christine.",
                "Sam agrees to split the money she was going to give Christine among both of you."
            ],
            "content":"<div class=\"\"><div> <span>\"Alright Christine, what if I gave you some money?\" Sam said, smiling. <br>\r\n\"Money? How much..?\" Christine replied, skeptical.<br>\r\n\"Oh I dunno...a couple hundred bucks, maybe? How's that sound?\"<br>\r\n\"A couple hundred?! Sam that's fantastic, I forgive you for <i>everything</i>!\"<br>\r\nSam smiled. \"Good, that's what I like to hear.\"<br>\r\n<br>\r\nWait, why wasn't I getting offered compensation for the torture I've been through? She's been treating Christine way nicer than she's been treating me!<br>\r\n\"Hey, Sam!\" I yelled up to her, very frustrated.<br>\r\nSam's gaze turned from Christine and faced me. \"Yes?\"<br>\r\n\"Christine hasn't endured even half of what you put <i>me</i> through, where the hell is <i>my</i> money?\"<br>\r\nSam's smile faded from her face.</span></div></div>",
            "created":1365310800,
            "id":1567123,
            "title":"A Bribe"
        },
        "1122":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Christine had followed, and managed to catch part of the conversation.",
                "Sam decided to give you a taste of punishment, so you'll obey more.",
                "Sam brought you back to Christine. Do you tell her what Sam said?"
            ],
            "content":"<div class=\"\"><div> <span>But then her smile came back. \"Anthony, why don't you come with me for a moment? Christine, you stay here.\"<br>\r\nBefore you could reply, Sam's giant fingers wrap around your minuscule frame and Sam stands up and walks into the other room. She sets you down on a table and sits in the chair in front of you. Since you weren't under her foot, you had a moment to admire her beauty. Her ghostly white skin gave her the appearance of a near-albino, but it wasn't in a way that made it look completely white, nor like she had never been outside. It was just the right color to say that she was the lightest of skins, but not too light-skinned. And her platinum blonde hair cascaded down her shoulders, framing her head perfectly. But this moment of beauty was interrupted, because the smile disappeared from her face once again, and you figured you would not be receiving good news.<br>\r\n\"Anthony, I'm not really paying Christine.\" she said to you.<br>\r\n\"What? Why did you say you would, then?\"<br>\r\n\"To get her to stop whining about being 'treated poorly' and all that crap.\"<br>\r\n\"So there's not a chance I'm getting paid either?\"<br>\r\n\"Notta.\"<br>\r\n\"Damn. What are you going to do when Christine starts asking about the money?\"<br>\r\n\"I don't have to <i>do</i> anything. If she starts whining about wanting money I'll stuff her in my sock.\"<br>\r\n\"Wait, you're not going to return us to normal?\"<br>\r\n\"Of course not, Anthony. Well for one I don't know how, and for another, I don't want to pay her, and you're going to be the perfect slave.\" The smile had returned to her face as she said the last part. Not a warm, loving, friendly smile. But a wicked smile, one that said, \"I own you.\"<br>\r\n\"Slave? Excuse me? I will <i>not</i> be your <i>slave</i>!\"<br>\r\n\"You'll do whatever I say, if you don't want to spend a week in my sock.\"<br>\r\nYou backed down, because you have had enough of her gruesome feet.<br>\r\n\"Good boy.\" she said, very demeaningly, and with a smile. </span></div></div>",
            "created":1365310800,
            "id":1567138,
            "title":"Christine - Bamboozled"
        },
        "1123":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Sam punishes both of you for \"fighting\".",
                "Christine asks to be big so she can torment you (and collect her money)",
                "Christine realizes what Sam just did and becomes furious with her instead."
            ],
            "content":"<div class=\"\"><div> <span>And then her expression became one of annoyance.<br>\r\n\"Fine, Anthony, you can have some money too.\" she then turned to Christine. \"But that means you're getting less.\"<br>\r\nChristine turned to face you, and she didn't look happy.<br>\r\n\"So Christine will get fifty bucks and Anthony will get fifty bucks.\" Sam said, her annoyance becoming less obvious, and a sly smile taking its place. Wait a second, is she purposely trying to...?<br>\r\nChrstine tackles you into the large fibers of the carpet. \"Anthony you <i>jerk</i>! I was going to get plenty of money but now because of <i>you</i>, I'm only getting fifty stinking dollars!\" she screeched angrily, hitting you as hard as she could, which, frankly, wasn't that hard.<br>\r\n\"Yeah Christine, you tell him.\" Sam said, the sly smile growing bigger.<br>\r\nShe turned Christine on you on purpose!</span></div></div>",
            "created":1365310800,
            "id":1567140,
            "title":"Annoying Sam"
        },
        "11231":{
            "choices":[
                "Sam lifts her foot off of you at last. Looks like you're about to find out...",
                "You're being kept in the dark about it."
            ],
            "content":"<div class=\"\"><div> <span>''Alright, quit it you two.'' Sam sighed, emitting an exasperated sounding laugh, ''the pair of you both need to <i>chill!</i><br>\n<br>\nYou were busy trying to fend off a livid Christina, who has successfully climbed on top of your chest, and is making a very good effort of scratching your eyes out!<br>\n<br>\nHowever, neither of you notice the enormous foot crash down on top of you both, sending Christina's cleavage into your face, and the both of you squished further still into the carpet.<br>\n<br>\n''Ugh, you damn perv! Get outta my boobs!'' Christina flails, attempting to wriggle out of the situation whilst sandwiched between yourself and Sam's enormous foot. However, another surprise pops up when Christina is suddenly wrenched out from underneath Sam's foot, leaving you under there on your own.<br>\n<br>\nBarely able to breathe, and not really wanting to due to the smell, you try your best to listen to the muffled voices of the two girls:<br>\n<br>\n''That... funny. But NO!'' booms Sam. Christina squeaks back something inaudible in response, and Sam says to her, ''Nice try. But now... punished. I think I'll... in my...''<br>\n<br>\nChristina screams with what sounds like fear, while Sam just giggles sadistically, evidently enjoying her suffering. You can hear the sound of a zip being unzipped, and Christina's screaming becomes louder still. However, it is soon muffled, and followed by a lot of pleasured grunting noises from Sam. What the hell's going on?!</span></div></div>",
            "created":1418014800,
            "id":1899535,
            "title":"Time out!"
        },
        "112312":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "Play with Christine some more first ",
                "Push Christine all the way inside, and find some more girls."
            ],
            "content":"<div class=\"\"><div> <span>Keeping the shrunken boy pinned under her foot, Sam was more than happy to 'play' with her current captive. With both her jeans and panties around her knees, she held a helpless fifteen year old in her hand, and that fifteen year old was being constantly ground into her pussy.<br>\r\n<br>\r\n\"Nng! God yeah...\" Sam grunted, feeling the shrunken girl flail against her quivering sex. \"God dammit Chrissie, you feel so good...\"<br>\r\n<br>\r\n\"Let, me, gooo!\" Christine screamed for all she was worth, however her tiny voice was barely audible to Sam, who was tempted to simply push Christine and all five inches of her right inside.<br>\r\n<br>\r\nSquashing the tiny girl's face against her clit, Sam decided to...</span></div></div>",
            "created":1456722000,
            "id":2111157,
            "title":"Insignificance "
        },
        "1123122":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "At School",
                "At the mall",
                "Other (reader's choice)"
            ],
            "content":"<div class=\"\"><div> <span>Sam decided to push Christine all the way in. Sam's breathing quickened, and she bit her lip, concentrating with all her might to get the most explosive orgasm she could. Cum dripped out of her pussy, but no Christine.<br>\r\n<br>\r\nSmiling to herself, she knew that she officially had another teenager inside of her! <br>\r\n<br>\r\nThere was SO much more she could do, but she needed other participants, and for what she had planned, she needed females.<br>\r\n<br>\r\nWhere does she look?</span></div></div>",
            "created":1542656460,
            "id":2579685,
            "title":"Push Christine all the way inside, and find som..."
        },
        "114":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Put you in my sock",
                "Demand that you kiss my toes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"No,\" Sam said, \"I think I will...\"</span></div></span></div>",
            "created":1399006800,
            "id":1790347,
            "title":"Other"
        },
        "1141":{
            "author_id":"nerdnamedtom",
            "author_name":"Anerdnamedtom",
            "choices":[
                "Christine is crushed",
                "Sam was just kdding",
                "Something happens, and Sam forgets about her"
            ],
            "content":"<div class=\"\"><div> <span>Sam said something. No doubt was it sexy, dominating, and most importantly erotic. However, unfortunately, you wanted to know what it was like to be in her sock, so Christine didn't hear any of it.In fact, Christine was currently stuck at the bottom of a sock being held in the air. Before Sam put the sock on, she twirled it around, causing havoc to Christine. Christine, of course, had no idea what was happening, but was seeing a blur of green and feeling terrified. The erratic movement stopped, and Christine felt thankful. That was before, she was greeted by long, slender white toes. <br>\r\n      She tried to crawl back and away, but there was nowhere to go as Sam slowly teased the tiny, flexing and scrunching. Christine curled into a ball, hoping that if she was smaller she wouldn't be found. Since you're reading porn about giants crushing tinies, guess if she got away with it? No. She felt two digits touch her and grab her. The pressure was horrible, but she felt herself being moved by them. She opened her eyes when she felt the toes let go of her. She quickly noticed she was under Sam's arch. Then she noticed that the foot itself was moving too. Straight downwards. Sam declared, more loud than ever: \"GOODBYE FOREVER, CHRISTINE.\"</span></div></div>",
            "created":1471437960,
            "id":2197089,
            "title":"Put you in my sock"
        },
        "11411":{
            "author_id":"giovan",
            "author_name":"Joss64",
            "choices":[
                "Elle est contente ",
                "Elle n est pas contante et vous met dans sont autre chosette "
            ],
            "content":"<div class=\"\"><div> <span>Vous entendez christine hurler de toute ses force quand un BOOM se fit entendre .<br>\r\nQuand sam releva son pieds vous voyer une tache rouge sur ces chosette vous avez alors compris ce qui etais arriver a christine .<br>\r\nVous entender sam dire <br>\r\n《C est trop marent,elle est coller sous mon pied. Tu veut la voire Anthony? 》<br>\r\nElle retita alors sa chosette et dessendit son pied vers vous . <br>\r\n《 Ne t inquiète pas je ne vais pas t ecraser maintenan je conte te garder comme esclave. Si tu ne veut pas finir comme christine je te conseil d obeir a mes ordres et tu va commencer par lecher ceux qu il reste d elle .》<br>\r\nVous etiez terrifier et ne voulant pas terminer comme christine vous decider de lecher ces pieds <br>\r\n<br>\r\nMais ...</span></div></div>",
            "created":1514564640,
            "id":2434037,
            "title":"Christine is crushed"
        },
        "11412":{
            "author_id":"zerotheriolu",
            "author_name":"Zero The Riolu",
            "choices":[
                "Grow them to the size of her sole",
                "Grow Christine so they both have fun with you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She joked. \"I DONT crush you Christine, but i have Some thoughts of what to do\"<br>\r\n*Following choices*</span></div></span></div>",
            "created":1511983080,
            "id":2421859,
            "title":"Sam was just kdding"
        },
        "114121":{
            "author_id":"pancakeman1219",
            "author_name":"Pancakeman",
            "choices":[
                "Gym",
                "Mall"
            ],
            "content":"<div class=\"\"><div> <span>When you hear those words you feel yourself begin to grow but only slightly. You watch as sams foot gets shorter until your just tall enough to look between her toes “ you guys are so cute” she says looking at you with an evil grin. You look to your right and see the outline of Christine’s body now as big as the sole of the foot squirming in the sock “ your turn Sam said as she scooped you up in another sock your big enough so she can pin your body with her foot and play with your face with her toes. She moves your head between her big and second toe. You can already see beads of sweat coming from her foot” wow you guys feel great Sam says bringing squeals from Christine” I’ll figure out how to change you back but in the meantime I’ll go to the</span></div></div>",
            "created":1515399540,
            "id":2438193,
            "title":"Grow them to the size of her sole"
        },
        "1141212":{
            "author_id":"pancakeman1219",
            "author_name":"Pancakeman",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><div> <span>Sam gets to the mall her feet already sweating profusely. Sam walks for 4 hours as sweat flows into your mouth and toe jam forms around your face  you hear the loud sounds of the mall quiet down as you feel Sam taking off her shoes and socks and dump you on the floor. You land next to Christine who looks just as bad as you”how could you do that to us” Christine screamed at San” because I have control over you” she said back “I’m tired of your whining “ Sam said as she picked you both up. Her hand began to glow and you and Christine shrunk down to 2 Inches. She opened her panties and dropped you both in the</span></div></div>",
            "created":1515399960,
            "id":2438196,
            "title":"Mall"
        },
        "11412121":{
            "author_id":"pancakeman1219",
            "author_name":"Pancakeman",
            "choices":[
                "Pushes you further in",
                "Pees you out"
            ],
            "content":"<div class=\"\"><div> <span>You fall into Sam panties and they close sealing you inside as Sam gets up and keeps walking you and Christine get sucked more and more into her vagina. You both try frantically to escape but all you do is make her wet and make yourselves slide around more until your both inside her. The fleshy pink walls push and pull in andulating fashion that you can’t describe all you can see in the blackness is Christine and just barely. You feel Sam sit down and pull down her pants she</span></div></div>",
            "created":1515400260,
            "id":2438198,
            "title":"Front"
        },
        "1143":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "make you(Christine) kiss my ass",
                "shove Anthony up my vagina ",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"No,\" Sam said, \"I think I will...\"</span></div></span></div>",
            "created":1469941200,
            "id":2189328,
            "title":"Other"
        },
        "11433":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Make you normal size",
                "Kill you, put you out of your misery"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else?</span></div></span></div>",
            "created":1530745860,
            "id":2515109,
            "title":"other"
        },
        "115":{
            "author_id":"nerdnamedtom",
            "author_name":"Anerdnamedtom",
            "choices":[
                "The phone rings",
                "Christine is injured",
                "Sam laughs, enjoying the power"
            ],
            "content":"<div class=\"\"><div> <span>Sam looked down at the two, a kind of hunger in her eyes. Christine simply hoped it wasn't THAT kind of hunger. \"For being so nice and putting up with my feet for so long, I suppose I could give you front row seats...\" Before Christine even had time to think about what was happening, she was snatched up into the air by two pale appendages. Anthony watched in relative safety and noticed a cruel pattern where in Christine again had no time to think before she was transferred to another part of her body. \"Now, that should be comfortable... I mean, there's a lot of padding.\"<br>\r\n     Sam wasn't kidding. Christine was in a very soft place. However, the fact that she didn't get a say in the matter set her off again. She was only able to get a few words of her rant out before Sam poked her deeper into her cleavage, reducing the rant to muffled shouts. This was apparently very funny to Sam, and she let out what was to her a small giggle. For Christine, however, it was a very different story.<br>\r\n     Her whole world shook. It was like being stuck in an avalanche. There was bright white flesh everywhere but she couldn't tell where was up or down. All she could feel was a systematic bounce compressing and decompressing her from all sides. All in all, noone could blame her for the terror that grasped her harder than the giantess earlier. Perhaps the only person almost as scared as her was Anthony who was still at the girls feet, and was seemingly forgotten. The tension was suddenly cut with a sudden sound. </span></div></div>",
            "created":1471352340,
            "id":2196653,
            "title":"The breast possible outcome"
        },
        "12":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Put on your bra, very sweaty",
                "Put on your panties, front part",
                "Put on your panties, the back",
                "Decides to swallow her friend , to help digestion snack"
            ],
            "content":"<div class=\"\"><div> <span>Sam said, before going home, we will make a stop for a snack, Anthony is in my tennis, enjoying the smell of my foot, hahaha. And you cristine need to find a place for you, I can not take you in hand. Cristine is frightened before speaking something, Sam decides.<br>\r\n<br>\r\n</span></div></div>",
            "created":1472914980,
            "id":2205541,
            "title":"Make a quick stop at Wawa for a snack.\""
        },
        "121":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "The two talk, and go together the cafeteria",
                "The two talk, say goodbye, and give a big hug, crushing the poor Cristine"
            ],
            "content":"<div class=\"\"><div> <span>Sam decided, I'll take you in my bra, this a little hot, and sweaty, better than my feet, do not you think. No time to question, Sam opens the bra cup and throws the poor Cristine inside, cristine rolls, and falls down Sam's nipple was too hot, dripping sweat, and the sweat stink, Cristine cries when it is muffled by bra and giant breasts of her friend. Sam will the snack bar, by the way, is a friend.<br>\r\n<br>\r\n<br>\r\n<br>\r\nThe two talk, say goodbye, and give a big hug, crushing the poor Cristine</span></div></div>",
            "created":1472916120,
            "id":2205549,
            "title":"Put on your bra, very sweaty"
        }
    },
    "info":{
        "author_id":"person543",
        "author_name":"person",
        "brief_description":"A girl named Samantha accidentally shrank you and your friend.  ",
        "created":1282209660,
        "description":"<td align=\"left\" class=\"norm\">Your name is Anthony. It was a typical day, you were bored so you decided to invite your friends Samantha and Christine over. They agreed, because they liked to come to your house. Here is some info on them:<br>\r\n<br>\r\nChristine:She's a 5' 6\" tall 15 year old Puerto Rican girl. Shes has a bad temper and a nice ass, but she isn't always the smartest girl...<br>\r\n<br>\r\nSamantha: She's a 5' 4\" tall 14 year old American girl. She looks a lot like an albino, she has really light white skin and platinum blond hair. Shes a nice girl with a decent temper, and she likes to mess with you. She has been acting a little strange lately but you did not really want to bother her about it.<br>\r\n<br>\r\nAnthony (you): You're a 5' 8\" tall 14 year old Peruvian male. You have a not so great temper, and hate to be ordered around. otherwise you usually are pretty chill.<br>\r\n<br>\r\nYour parents are on a 2 year long trip, so they will not be around.<br>\r\nAddition rules: <br>\r\n1. no giant males<br>\r\n2. no parents involved<br>\r\n3. keep the storyline going, don't suddenly change the subject.<br>\r\n4. She shrank you two accidentally, but she decided Anthony is her slave, but she hasn't decided Christine's fate yet.<br>\r\n5. Anthony can't grow back.<br>\r\n6. No deaths<br>\r\n7. Otherwise add all you wish, im pretty ok with anything. <br>\r\n8. Please don't just add a one or two sentence chapter.<br>\r\n9. If you do add a one or two sentence chapter I may edit it to make it longer or change it up.<br>\r\n10. Otherwise have a good time.</td>",
        "id":1700467,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1542656460,
        "modified":1542656460,
        "pretty_title":"Sam's slave"
    }
}