{
    "chapters":{
        "1":{
            "author_id":"mateneal",
            "author_name":"Mateneal",
            "choices":[
                "Male",
                "Female",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a male, female, or other?</span></div></span></div>",
            "created":1395982800,
            "id":1769765,
            "title":"Pick Your Gender"
        },
        "11":{
            "author_id":"mateneal",
            "author_name":"Mateneal",
            "choices":[
                "Mateneal Webbs [Please do not add or alter anything within this story line]",
                "Alberich the Near-Sighted",
                "[Your character here!]",
                "[Your character here!]",
                "More Characters!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You may either follow the journey of your own character by adding another yours here..<br>\r\nOr follow the journey of another by picking it here...</span></div></span></div>",
            "created":1396057140,
            "id":1769778,
            "title":"Male"
        },
        "111":{
            "author_id":"mateneal",
            "author_name":"Mateneal",
            "choices":[
                "Next Chapter"
            ],
            "content":"<div class=\"\"><div> <span>My life, even as young child, was always filled with danger and uncertainty...<br>\r\nWould this day be my last? Would tomorrow be my end?<br>\r\nAll I can know is that I manage to survive, even when it seems improbable...<br>\r\n<br>\r\n**************************************************************************** ************<br>\r\n<br>\r\nThe rain could be heard pattering on the roof of our cabin, the roar of the wind and thunder occasionally rousing my mix of fear and odd sense of wonder. I sat up in my hay lined and fur padded bed to look out into the storm. Through my bedside window, I could see the wind and rain battering the limbs of the surrounding trees. It almost seemed that the trees were in battle with and unseen foe... <br>\r\nIn my awe brought on by the scene outside, I failed to notice that my creaked open and a the warm glow of a candle seeped through the crack. It wasn't until the warm glow reflect off of the window caught my eye between flashes of lightning that I turn to see the gentle, feminine features illuminated by the single flame at the tip of a candle.<br>\r\n<br>\r\n\"Mateneal...\" She cooed softly. \"What has you up at this hour?\"<br>\r\n<br>\r\nI simply looked back out the window, silently showing her the culprit.<br>\r\n<br>\r\n\"The storm? Nothing to be worried about, little one...\" She began, sitting down on my bed.<br>\r\n<br>\r\nShe went on telling me that the storm was one of the balancing forces of our world and that the thunder was the clashing of arms belonging to the good and evil spirits and the lightning was the sparks from the clashing. I somehow <i>knew</i> that to be true...<br>\r\n<br>\r\nI smiled at her comforting face, knowing not to question my mother's wisdom. We turned at watched the storm from my bed, listening to the thunder as I imagined the battle before us. This was a night to remember...<br>\r\n<br>\r\n<b><i>CRASH!</i></b> Our heads turned to the other room hidden behind the door, to the sound of footfalls against the wood floor...</span></div></div>",
            "created":1403116680,
            "id":1814086,
            "title":"The Journey Has Begun!"
        },
        "1111":{
            "author_id":"mateneal",
            "author_name":"Mateneal",
            "choices":[
                "He opens the door, revealing my mother...",
                "Another thief calls him away into another room...",
                "I gasped at the sight and the thief turns his attention to me!"
            ],
            "content":"<div class=\"\"><div> <span> Muffled shouting could be heard as several sets of footfalls bounced off the wood floor when more entered. Mother quickly went on to pick me up and opened a small trapdoor that led to a small store hidden at the end of my bed. \"Go, Mateneal.\" She ordered as she sat me on the top step. \"Be quiet, little cub...\" She whispered. I simply gave a worried nod and stepped down the steps quietly, believing that my mother would follow behind. Before I could react properly, my mother shut the door and left me alone with rays of of faint light trickling through small cracks in the floor. I could see my mother step over to the the closet and hid herself among the clothes and shut the door. Just after the click of the door latch, the door leading from the living room was kicked in. I could see the vague details of a burly man... A bare forearm tattooed with a black dragon coiled around it and a heavy goatee covering his lower half of his face. He slowly walked with a limp as he surveyed the room for anything worth taking. My mother, uncomfortably resting inside the closet, shifted around slightly until a small creak of a floorboard could be heard by me. The man immediately turned his head to the closet before an evil smile slowly crept across his face. He stepped over with nearly painfully slow footsteps, making both me and my mother fear that he found either of us. <br>\r\n<br>\r\nHe slowly reached for the doorknob...</span></div></div>",
            "created":1410373080,
            "id":1855180,
            "title":"The Bandit"
        },
        "112":{
            "author_id":"drunpleasant",
            "author_name":"Dr.Unpleasant",
            "choices":[
                "Bahn.",
                "Re'Bahn."
            ],
            "content":"<div class=\"\"><div> <span>Alberich the Near-Sighted was at a crossroads literally and figuratively.  Alberich was a big man, muscular and dressed in the typical <i>accoutrements</i> of a warrior, which is what he was. On his right arm, he carried a round shield, and over his left shoulder he carried a somewhat implausibly large warhammer, his weapon of choice. On his back, he carried a pack contianing some food and his few meagre pseronsal possessions The only other distinctive thing about him was the peculiar wire framework attached to the front of his helmet, which fixed two round, curved pieces of glass in place in front of his eyes. These were his <i>eyeglasses</i>, a relatively recent invention which helped mightily to compensate for the myopia which had inspired his nickname.<br>\r\n<br>\r\nThe literal crossroads that Alberich stood at was a sign that read, \"Bahn\", with an arrow pointing to the left, and \"Re'Bahn\", with an arrow pointing to the right. Alberich knew that this was what the sign said, as, unlike the vast majority of the warriors that he knew, he actually <i>could</i> read, the result of a childhood mis-spent actually listening to his teachers.<br>\r\n<br>\r\nThe reason he was at this literal crossroads resulted from the figurative crossroads he also found himself at.  He had until recently been in the service of Vrot the Remarkably Unpleasant, King of Snaelgaard, who had recently been removed from his throne in a manner that was, ironically enough, remarkably unpleasant.  Somewhat unsurprisingly, persons who had been members of Vrot's personal guard - as Alberich had - had found themselves generally unpopular in the wake of their former master's overthrow, even Alberich, who prided himself on the fact that he had never done any atrocities, and had, in fact, almost never killed anyone who wasn't trying to kill him.  Anyway, Alberich had found it expeditious to seek employment elsewhere, in something of a hurry.<br>\r\n<br>\r\nSo, here he found himself. To the left was the road to Bahn, ruled by King Spessnaack the Short-Tempered, who was said to pay well, but to also be quick to have people executed if he thought that they might be even remotely considering looking at him funny.  To the right was Re'Bahn, ruled by Spessnaack's second cousin, Queen Safiyerra the Virtuous, who was said not to pay so well, but whose personal executioner was said to cry himself to sleep at night because the Queen gave him so little to do.<br>\r\n<br>\r\nDecisions, decisions...<br>\r\n<br>\r\nIn the end, Alberich decided to go to...</span></div></div>",
            "created":1414533720,
            "id":1878805,
            "title":"Alberich the Near-Sighted"
        },
        "113":{
            "author_id":"masterstalin",
            "author_name":"masterstalin",
            "choices":[
                "He is sold to the North",
                "He is sold to the East/West",
                "He is sold to the South"
            ],
            "content":"<div class=\"\"><div> <span><i>Carrtians were the name of the mountainous equine-like tribes-people who lived in different tribes. Once, their chiefs met to join their tribes into one city, unified by culture. They suceeded, and for years lived in prosperity, warring against their neighboring states. After the peak of their prosperity however, an empire, whose citizens were humans and their leaders as well, came to induct the Carrtians into their empire. When the Carrtians refused, the Empire attacked!<br>\r\n<br>\r\nThey ransacked the city, killed the warriors, and desecrated their culture. The survivors were sold into slavery, and one of these slave was a boy named Cale, who swore on his name he would do anything to see this Empire fall. But for now, he is chained in bonds to them.<br>\r\n</i><br>\r\n<br>\r\n\"WAKE UP!\" said a slave overseer to a sleeping Cale. Cale woke up at the command of the slaver. He got onto his hands and hooves, still tearing from his sleep. His dream was a nightmare; the one where he remembered how he got separated from his family, his father was sold to an owner to the east; his mother was sold to the west. On the other side of the mountains that was his people's home, a village part way into the desert.<br>\r\n<br>\r\n\"QUIT YOUR CRYING!\" The slaver commands to him. He wipes the tears from his face as he's lead by his chain and collar. He and the slaver enter the auctioning floor as many potential masters await to buy him.<br>\r\n<br>\r\n\"Here we have a GOOD, Young lad with MUCH POTENTIAL!\" The seller boasted out. As he continued to ramble, Cale thought less of how much he was worth and thought of what vile owner he would have to work for until he died. The more he remained in chains, the more he couldn't think of a reason to live.<br>\r\n<br>\r\n\"Good news boy,\" The seller told him snapping him back into reality. \"You've been bought\" All Cale could think of was how much he hated his life. <br>\r\n<br>\r\n\"So who bought me?\" Cale asked.</span></div></div>",
            "created":1416970920,
            "id":1893759,
            "title":"Cale of the Carrtians"
        },
        "114":{
            "choices":[
                "Saron walks to the castle with the queen.",
                "Bandits come out to rob the Queen",
                "Saron transforms and flies the Queen to the castle."
            ],
            "content":"<div class=\"\"><div> <span>Out in the countryside full of trees and the occasional house a man standing eight feet tall with impressive muscles. Yet the man was actually a dragon who when in his true form stood 12 feet tall with a 30 foot wingspan. His scales were aqua in coloration. His eyes were a brilliant green and his hair as black as the night sky. He often wore the attire of a mercenary and hunted outlaws for a reward. He was currently sleeping by a stream, under the leaves of a Karus tree. Karus trees are magical trees that emit magic. In other words, they produce all the magic in the land of Re'Bahn. If any tree was cut down without withering of longevity, then a curse will spread across the land and the dark lords will rise again.<br>\r\n<br>\r\nAs the man was sleeping a lone woman coming from the west sat on the opposite side of the tree. She was carrying a small harp. She had piercing blue eyes, gorgeous red hair and stood at six feet tall. She also wore flowing white dress decorated with flowers of different colors. She breaths in and starts playing her. harp.<br>\r\n<br>\r\n\"The sun shines so bright as welcoming a new day for all of Re'Bahn <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/music2.png\" alt=\"*Music2*\" title=\"Music2\" border=\"0\" width=\"15\" height=\"15\"> . The birds fly in the sky singing of the wonders they have seen by the majestic river that flows through the land <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/music2.png\" alt=\"*Music2*\" title=\"Music2\" border=\"0\" width=\"15\" height=\"15\">. Everywhere I go I see heroes born and die <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/music2.png\" alt=\"*Music2*\" title=\"Music2\" border=\"0\" width=\"15\" height=\"15\"> . Despite the peace a dark cloud looms over the horizon <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/music2.png\" alt=\"*Music2*\" title=\"Music2\" border=\"0\" width=\"15\" height=\"15\">. Can some one tell me what I should do to save my fellow men <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/music2.png\" alt=\"*Music2*\" title=\"Music2\" border=\"0\" width=\"15\" height=\"15\">. O Guiding One, I ask you to hear my cries before they faint into the shadows <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/music2.png\" alt=\"*Music2*\" title=\"Music2\" border=\"0\" width=\"15\" height=\"15\">.\"<br>\r\n<br>\r\nThe woman takes a deep breath and watches a few water sprites dance along the river. The man yawns and gets up. He is surprised to see the woman by the tree humming as she plays her harp. The woman stops playing when see notices the man's large shadow.<br>\r\n<br>\r\n\"Greetings miss,  That was a lovely tune, yet it also sounded sad.\"<br>\r\n<br>\r\n\"Thank you mister...\"<br>\r\n<br>\r\n\"Saron Drakisu. What's a maiden such as yourself doing alone?\"<br>\r\n<br>\r\n\"I had business in another town. I am heading to Rasukan.\" The woman replied.<br>\r\n<br>\r\n\"Rasukan? Isn't that the city further down the road. I assume you came from Weeping Wallows. If you need an escort I can help you and keep you safe.\"<br>\r\n<br>\r\n\"That won't be necessary. I am the best swordswoman in the country.\"<br>\r\n<br>\r\n\"that may be true, but you can't put all the burden on yourself Your Majesty.\"<br>\r\n<br>\r\nThe woman gasps in surprise. \"How did you know I was the Queen?\"<br>\r\n<br>\r\n\"Only the queen has claim to that title. The lack of subtlety could mean life or death on the battle field.\"<br>\r\n<br>\r\n\"You sound wise for your age. I wouldn't mind the help. I believe 2,000 gold coins should cover the fee. Let us head off to the castle.\"</span></div></div>",
            "created":1434677280,
            "id":1994709,
            "title":"Saron Drakisu The Dragon Man"
        },
        "1142":{
            "author_id":"worshipper",
            "author_name":"worshipurmuscles",
            "choices":[
                "The bandits are no match for his muscles",
                "The bandits outnumber him, and he struggles",
                "The Queen scares them off with her sword"
            ],
            "content":"<div class=\"\"><div> <span>The queen and her eight foot escort walked towards the castle while exchanging pleasantries. The two were good company for each other. The Queen felt secure with him. After a bit, he had to excuse himself to take a leak. The Queen kept on walking. Suddenly, the sky grew dark and bandits seem to come from nowhere. The Queen struggled. Fortunately, the man caught up to the group quickly and prepared to defend his lady. He got his large fists ready as the bandits encircled him. The Queen was frozen with fear</span></div></div>",
            "created":1434687180,
            "id":1994816,
            "title":"Bandits come out to rob the Queen"
        },
        "11422":{
            "choices":[
                "Saron and the queen arrive safely in Rasukan",
                "They discover that the city is in ruins and that there are very few survivors"
            ],
            "content":"<div class=\"\"><div> <span>Tried as he might the bandits outnumbered Saron and the Queen. Even though he was outnumbered he was hoping not to transform into his true form to scare off a bunch of thugs, but they kept on coming like the plague.<br>\r\n<br>\r\n\"Saron!\" The Queen yelled as she noticed her escort get covered by the bandits.<br>\r\n<br>\r\n\"We got him! Someone hold him down before he breaks free!\"<br>\r\n<br>\r\n<i>I hate to do this since they're human, but they gave me no choice. No more mister nice dragon.</i><br>\r\n<br>\r\nSaron's eyes begin to glown as his skin turns aqua. His skin then hardens into tough scales and his cape turns into two huge powerful wings. As he transforms into his true form he begins growing in height until he is four feet taller than his human disguise.  His hands and feet sprout claws while his face develops a large snout. Finally to top off the transformation He sprouts two horns on his head and a tail on his rear end. The bandits who outnumbered him are frozen with fear. The queen stares at her escort in awe as she witnessed the transformation.<br>\r\n<br>\r\n\"You small time thieves thought you could take me down? I admit you were a challenge when I was in my human form, but in my true form I am much more powerful.\"<br>\r\n<br>\r\nSaron roars at the bandits. The bandits try to attack but Saron fire a fireball at one of them. He then proceeds to take down the bandits. He did so until there were three left. He then transforms back into his human form.<br>\r\n<br>\r\n\"I'm feeling quite merciful today and I hate to kill you three as well, but that what happens when you try to rob the Queen. Tell me who sent you and what are they after.\"<br>\r\n<br>\r\n\"You really don't know? It should be common knowledge to your kind, dragon. Our leader wants the queen as a sacrifice.  You see our leader is about to kill a living Karus tree. By doing this it should be easier to summon the Great Wicked One.\"<br>\r\n<br>\r\n\"I've heard enough!\"<br>\r\n<br>\r\nThe queen slays the bandit that Saron was holding. The other two bandits runs for the hills. The queen sighs.<br>\r\n<br>\r\n\"Thank you Saron. If you didn't transform we would of been dead.\"<br>\r\n<br>\r\n\"It wasn't easy, but they gave me no choice but to transform into my true form.\"<br>\r\n<br>\r\nThe queen gasps as she notices that Saron is bleeding all over.<br>\r\n<br>\r\n\"Saron let me dress your wounds. I know your kind has remarkable healing abilities, but with all that blood and all those wounds it would make it harder for your to survive. Take this and drink it. It should clot the bleeding and heal most of your wounds.\"<br>\r\n<br>\r\n\"Thanks your majesty.\"<br>\r\n<br>\r\nSaron drinks the potion and is healed of most of his injuries. His other injuries will take two days before they disappear.<br>\r\n<br>\r\n\"That's much better. We shouldn't be too far.\"</span></div></div>",
            "created":1434695580,
            "id":1994892,
            "title":"When Outnumbered Transform"
        },
        "12":{
            "author_id":"mateneal",
            "author_name":"Mateneal",
            "choices":[
                "[Your character here!]",
                "[Your character here!]",
                "[Your character here!]",
                "[Your character here!]",
                "More Characters!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You may either follow the journey of your own character by adding another yours here..<br>\r\nOr follow the journey of another by picking it here...</span></div></span></div>",
            "created":1396057320,
            "id":1769779,
            "title":"Female"
        },
        "13":{
            "author_id":"mateneal",
            "author_name":"Mateneal",
            "choices":[
                "Male Dominant Trans (C-Boy)",
                "Female Dominant Trans (She-Boy)",
                "Male Dominant Herm (Flat-Chested Herm)",
                "Female Dominant Herm (Breasted Herm)",
                "Ambiguous/Genderless"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your option below.</span></div></span></div>",
            "created":1396056420,
            "id":1769770,
            "title":"Other"
        },
        "131":{
            "author_id":"mateneal",
            "author_name":"Mateneal",
            "choices":[
                "[Your character here!]",
                "[Your character here!]",
                "[Your character here!]"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You may either follow the journey of your own character by adding another yours here..<br>\r\nOr follow the journey of another by picking it here...</span></div></span></div>",
            "created":1396057500,
            "id":1769780,
            "title":"Male Dominant Trans (C-Boy)"
        },
        "132":{
            "author_id":"mateneal",
            "author_name":"Mateneal",
            "choices":[
                "[Your character here!]",
                "[Your character here!]",
                "[Your character here!]"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You may either follow the journey of your own character by adding another yours here..<br>\r\nOr follow the journey of another by picking it here...</span></div></span></div>",
            "created":1396057620,
            "id":1769782,
            "title":"Female Dominant Trans (She-Boy)"
        },
        "133":{
            "author_id":"mateneal",
            "author_name":"Mateneal",
            "choices":[
                "[Your character here!]",
                "[Your character here!]",
                "[Your character here!]"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You may either follow the journey of your own character by adding another yours here..<br>\r\nOr follow the journey of another by picking it here...</span></div></span></div>",
            "created":1396057740,
            "id":1769783,
            "title":"Male Dominant Herm (Flat-Chested Herm)"
        },
        "134":{
            "author_id":"mateneal",
            "author_name":"Mateneal",
            "choices":[
                "[Your character here!]",
                "[Your character here!]",
                "[Your character here!]"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You may either follow the journey of your own character by adding another yours here..<br>\r\nOr follow the journey of another by picking it here...</span></div></span></div>",
            "created":1396057860,
            "id":1769786,
            "title":"Female Dominant Herm (Breasted Herm)"
        },
        "135":{
            "author_id":"mateneal",
            "author_name":"Mateneal",
            "choices":[
                "[Your character here!]",
                "[Your character here!]",
                "[Your character here!]"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You may either follow the journey of your own character by adding another yours here..<br>\r\nOr follow the journey of another by picking it here...</span></div></span></div>",
            "created":1396057980,
            "id":1769787,
            "title":"Ambiguous/Genderless"
        }
    },
    "info":{
        "author_id":"mateneal",
        "author_name":"Mateneal",
        "brief_description":"Become your medieval character and save the land. (or not!) [Anything goes!]",
        "created":1396055760,
        "description":"<td align=\"left\" class=\"norm\">In the lost land of Re'Bahn, your story begins...<br>\r\nThe story simply starts with you choosing your gender and character (OR ADDING YOUR OWN!) and doing with whatever you want!<br>\r\n<br>\r\nFrom it is to serve the queen in anyway you want to being the rouge assassin looking for the next piece of gold.<br>\r\nThe limits of your imagination has been removed for this entire story!<br>\r\n<br>\r\nFor the furry community, I welcome you as a brother in arms and encourage you to write as well!<br>\r\n<br>\r\n<br>\r\n<i><b>Warnng!</b></i> This story can contain any material that is not suited for the young or the faint of heart... <br>\r\n<br>\r\n<br>\r\n<i><b>YOU HAVE BEEN WARNED!</b></i><br>\r\nThis story is rated 18+ because the story could swing from PG to XXX with a single click.<br>\r\n<br>\r\n</td>",
        "id":1984000,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1434695580,
        "modified":1434695580,
        "pretty_title":"The Warriors of Re'Bahn"
    }
}