{
    "chapters":{
        "1":{
            "author_id":"sizeguy",
            "author_name":"Size Guy",
            "choices":[
                "Tim shrinks David and takes over the minds of the others",
                "Tim shrinks all three",
                "Tim makes them have an orgy",
                "Tim does something else"
            ],
            "content":"<div class=\"\"><div> <span>David and Ryan had been at the gym for two hours exercising vigorously. The two boyfriends went together three times a week and worked themselves to exhaustion, then stumbled into the steam room to relax. The two had different goals for themselves. Ryan—who was six feet tall and putting on weight—wanted to slim down, while his boyfriend, David, two inches shorter, wanted to tone up. <br>\r\n<br>\r\nAlso in the steam room that day was Pete, a younger straight guy they had never met before. David snuck an appreciative look, but he was too drowsy to get too worked up. <br>\r\n<br>\r\nThe three sat in companionable silence for a few minutes, until the door opened again and Tim walked in. Tim was also naked, although he had not been working out. As a warlock, Tim could take whatever form he wanted, and this time he chose a rather spectacularly muscled one that needed no gym maintenance. He just liked to wander around town and see what sort of interesting situations he could create.<br>\r\n<br>\r\n\"Hmm,\" thought Tim as he glanced over the three men and read their minds. He saw that Ryan was half asleep, Pete was thinking about his workout plans for the week and how this would affect his time with his girlfriend, and David was trying not to be very obvious about staring at him.<br>\r\n<br>\r\n\"I'll give him something to stare at,\" thought Tim. <br>\r\n<br>\r\nAn interesting situation had just occurred to him.</span></div></div>",
            "created":1175144400,
            "id":393885,
            "title":"Steamy in the Steam Room"
        },
        "11":{
            "author_id":"sizeguy",
            "author_name":"Size Guy",
            "choices":[
                "Ryan and Pete take their new pet home",
                "Ryan and Pete show their new pet to other guys in the locker room"
            ],
            "content":"<div class=\"\"><div> <span>David watched through half-closed eyes as the handsome warlock sat down across from Ryan and Pete. \"It's pretty hot in here, isn't it guys?\" said Tim in a deep voice.<br>\r\n<br>\r\n\"It's hot,\" said Ryan and Pete agreeably. David thought this was odd and gave them a strange look.<br>\r\n<br>\r\n\"You guys are getting hot for each other, aren't you?\"<br>\r\n<br>\r\nRyan and Pete nodded and began to gaze longingly at each other. David wanted to protest, but he couldn't seem to find his voice.<br>\r\n<br>\r\n\"Erections,\" said Tim, and Ryan's thick cock shot up to its full six inches immediately. Pete's was 7.5 inches.<br>\r\n<br>\r\n\"Nice. What are you waiting for?\"<br>\r\n<br>\r\nRyan and Pete were suddenly all over each other, kissing, groping, stroking. David watched in horror as his boyfriend practically raped the younger man in front of his eyes. He still could not bring himself to move or speak.<br>\r\n<br>\r\n\"OK, guys, here's the story,\" said Tim. He was watching the scene with much more delight than David, and his ten-inch cock was throbbing huge at the sight. \"Ryan and Pete, you guys are a couple now, madly in love. After you leave this steam room, you are going to move in togther and live happily ever after.\"<br>\r\n<br>\r\nDavid finally found himself able to talk. \"But wait! Honey, what about me! Why are you doing this?\"<br>\r\n<br>\r\n\"I just love this guy here, that's all. What was your name again?\"<br>\r\n<br>\r\n\"Pete. And I love you, too.\"<br>\r\n<br>\r\n\"But what about me?\" David said again.<br>\r\n<br>\r\n\"Oh, you can go, too, if you're going to make a fuss about it,\" said Tim. David suddenly felt himself falling. Through the thick steam, he saw the room loom larger around him. Ryan and Pete steadly grew in comparison.<br>\r\n<br>\r\nHe stopped shrinking at a foot tall. He could move again, and speak normally, but he was too stunned to do either. The giant warlock got to his feet and smirked down at him. \"Boys, meet your new pet,\" he said, as he stepped out of the steam room. \"Take good care of him.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1175144400,
            "id":393892,
            "title":"And David Makes Three"
        },
        "111":{
            "author_id":"sizeguy",
            "author_name":"Size Guy",
            "choices":[
                "David waits in the gym bag until the giants get him home",
                "David escapes the gym bag before Pete gets to his car"
            ],
            "content":"<div class=\"\"><div> <span>Bewildered, David stood on the wet tile floor and looked up through the steam at the giants towering overhead. He came up to about midcalf on his boyfriend and slightly higher on the other guy. They were looking down at him curiously and didn't seem particularly alarmed at how much things had just changed. \"I guess we should go home,\" Ryan said after a few moments of thinking.<br>\r\n<br>\r\n\"Can I move in with you?\" asked Pete, feeling Ryan's thick ass. \"I want to be with you forever.\"<br>\r\n<br>\r\n\"Of course,\" said Ryan. \"There's plenty of room.\"<br>\r\n<br>\r\nFrom below his knee, David started to protest, but neither of the giants seemed to pay much attention. Pete casually scooped him up, and they left the steam room for a quick shower before going to their lockers.<br>\r\n<br>\r\n\"Hey, put me down! Hey! Help! Someone help me!\" There weren't many other guys in the shower area to hear David's commotion, and none of them seemed to be paying attention. Pete used one hand to hold David still while he rapidly soaped off with the other. David could see that this stranger almost never took his eyes off of Ryan at the next showerhead over. The two giants were smiling at one another like goons.<br>\r\n<br>\r\nSoon, they were back at their lockers, which were near each other. The little man didn't stop screaming the whole time, but it was no use. After a few moments, Pete stuffed him in his gym bag along with his sweaty workout clothes and zipped it up. Not until he felt the vibration of the giant's footsteps walking out of the gym did David shut up. He knew he would have to save his energy for things to come.</span></div></div>",
            "created":1175403600,
            "id":394657,
            "title":"Headed Home"
        },
        "1111":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Sarah Follows Them Back to the Apartment, Then Spies on Them Through the Window",
                "Sarah Thinks She's Just Hearing Things, Then Walks Away ... David is Taken Home",
                "Meanwhile, Tim the Warlock is Having More Fun Elsewhere"
            ],
            "content":"<div class=\"\"><div> <span>David couldn't see anything, but he could still hear fairly well.  And he could tell that they were leaving the building, probably heading home.  He momentarily thought about trying to escape, but even if he could, where would he go?  He was only about a foot tall and he'd more likely frighten people than get any help from them.  No, his best option was to wait until he got home, then try to reason with Ryan, once he was let out of the gym bag.<br>\r\n<br>\r\nRyan and David's apartment was only about a block away, so there was no need to drive to the gym.  That's why he constantly felt like someone was carrying the bag he was in.  They were walking back to the apartment.<br>\r\n<br>\r\nAbout halfway there, David began to reconsider his decision to stay in the bag.  What if he couldn't reason with Ryan?  Normally, Ryan wouldn't fall for another guy like that, and from what he could tell, that Pete guy was straight, right?  So it certainly wasn't normal for <i>him</i> to suddenly be all gay for Ryan.  Well, all of that plus the fact that David had shrunk in size made this all irregular.  Both Ryan and Pete just took it all in stride that David was now only about a foot tall.  Under the circumstances, Ryan may not be in the right state of mind to listen to reason.<br>\r\n<br>\r\nJudging by how much time had passed, David had a feeling that there wasn't much more distance between them and the apartment, but then it happened.  Another voice!  And that meant another person.  Maybe if he shouted loud enough ...<br>\r\n<br>\r\nHe listened as hard as he could.  It was a girl's voice.  A teenager, maybe a little older.  \"Pete, why are you holding hands with that guy?\" she asked.  She knows that Pete guy!  This was even better.  Maybe she can talk some sense into him.<br>\r\n<br>\r\n\"Because he's my boyfriend,\" Pete answered.<br>\r\n<br>\r\n\"Boyfriend?  What, are you gay?\" she asked, sounding astonished.<br>\r\n<br>\r\n\"Well, yeah.  I thought you would have noticed,\" Pete said.  David's uneasiness with this situation just increased.  From what the girl said, it was clear that Pete wasn't supposed to be gay, but Pete insisted that he was, that apparently he had always been.  Talk about a mind fuck.  How was David supposed to reason with that kind of mental state.  Did Ryan even remember he and David being a couple?  Were Ryan's memories as changed as Pete's?  \"Listen, Sarah.  I know you think that we had something together, but it was all just for show.  I was afraid of how my family and friends would react if it came out that I was homosexual.  But now none of that matters.  I'm moving in with Ryan and I'm going to spend the rest of my life with him.\"<br>\r\n<br>\r\nThen David felt the bag moving again.  They were walking!  If he was going to make his move, now would be the time!<br>\r\n<br>\r\n\"Help!  Help me!\" David yelled as loud as he could, over and over.<br>\r\n<br>\r\nOutside of the bag, Sarah could have sworn she heard someone calling for help, but where did it come from?</span></div></div>",
            "created":1370451300,
            "id":1604819,
            "title":"On the Way Home ..."
        },
        "11111":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Sarah Somehow Gets David Out of There",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Sarah wasn't buying any of this.  She knew Pete.  He was as straight as she was.  More than once. they had already had sex, and there was never any indication that he was disgusted by it.  No, something else was going on.  Maybe hypnosis?  She heard that deep down the subject has to allow the hypnotic changes to happen.  But she didn't know that for sure.  It could be that Pete thinks he's gay because someone <i>made</i> him think that.  Or maybe Pete was just pretending to be gay?  If so, why?<br>\r\n<br>\r\nWhatever the reason, she decided to follow Pete and his \"new boyfriend\" and then spy on them.  She was going to get to the bottom of this.<br>\r\n<br>\r\nA few minutes later, she saw them walk into an apartment building.  Peering through the front window, she saw them enter an apartment on the first floor.  Okay, that's going to make it easier to spy.  She ran around to the side of the building, then, after hiding in a mass of shrubs, she looked through the window, into the living room.  She watched Pete and that other guy.  What was his name?  Ryan?  They were dropping their stuff off, then a moment later, they both headed to the bedroom, hand-in-hand.  Ugh.<br>\r\n<br>\r\nShe turned away, not wanting to see anymore (although, since Pete and Ryan were no longer in view., there was nothing to see anyway), but then some movement caught her attention.  She turned back in time to see Pete's gym bag open and a small man stick his head out.<br>\r\n<br>\r\nSarah blinked, wondering if she was in fact losing her mind.  Her boyfriend acting like he was gay, that was one thing.  But a one-foot tall man climbing out of a gym bag?  This was totally something else.  What the hell was going on?<br>\r\n<br>\r\nAfter she watched intently at the small man, he spotted her and looked immensely grateful.  He jumped down to the floor, then awkwardly made his way over to the window.  Once he was on the window sill, he shouted as loud as he could.  \"You have to help me!\"  His voice sounded so tiny, even though it was obvious that he was shouting.  \"This guy at the gym!  He turned me small like this and made my boyfriend fall in love with another guy!  I think he was a wizard or something!  You have to help me!\"<br>\r\n<br>\r\nSarah just stared.  A wizard?  Well, she didn't have any other explanation for the small man's existence.  As weird as it sounded.  If this was true, then her boyfriend really wasn't gay after all (not that she thought he was).  A wizard <i>made</i> him that way.  But how could she help?  Get another wizard to reverse what happened?  Up until today, she didn't think wizards even existed, and now she was supposed to go find another one?  Okay, one thing at a time.  She couldn't return her boyfriend to normal.  But maybe she could at least get the small man out of the apartment.  It was obvious that he feared what Pete and Ryan might do to him.  And Sarah didn't even want to <i>think</i> about what that might be.<br>\r\n<br>\r\n\"Wait there,\" she told the small man.  \"I'll get you out.\"<br>\r\n<br>\r\nThe small man looked relieved.</span></div></div>",
            "created":1389382380,
            "id":1725137,
            "title":"Sarah Isn't Buying It"
        },
        "111112":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Sarah Tries to Get David Out, But Is Caught By Pete and Ryan",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>David watched as the young woman (judging by her voice, he figured that she was Sarah, the person he heard earlier when he was in Pete's gym bag) removed herself from the shrubs, then disappeared from view.  He was so relieved to finally have someone help him.  Because he was sure that he wouldn't get any from either Ryan or Pete.</span></div></div>",
            "created":1389382680,
            "id":1725138,
            "title":"Sarah Wants to Help"
        },
        "1111122":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Tim Followed Sarah There and Used His Powers to Do Something to Her",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>David waited and waited and waited, but Sarah never got inside to help him.  He was starting to fear that something might have happened to her.</span></div></span></div>",
            "created":1389382860,
            "id":1725140,
            "title":"Where is Sarah?"
        },
        "11111221":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Shrink, Just Like David Had",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Earlier, when Sarah was following Pete and Ryan home, she didn't realize that someone else was following <i>her</i> at the same time.  It was Tim, the warlock who used his powers on Ryan, David, and Pete back at the gym.  He wanted to keep an eye on his three new playthings.  Well, imagine his surprise when he realized that he might be getting a fourth plaything out of this.  But what to do with her?<br>\r\n<br>\r\nHe watched Sarah making contact with David and vowing to help him out of his predicament.  Oh, how nice of her.  Well, Tim couldn't have that.  So the moment she ran to the front of the apartment building, he unleashed his magic on her, causing her to ...</span></div></div>",
            "created":1389383400,
            "id":1725144,
            "title":"A Spy Spying on Another Spy?"
        },
        "111112212":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Turn Into a Gay Man and Tim's New Lover and Loyal Servant",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The moment Sarah ran to the front of the apartment building, Tim unleashed his magic on her, causing her to ...</span></div></span></div>",
            "created":1389383520,
            "id":1725145,
            "title":"Tim Does Something Else to Sarah"
        },
        "1111122122":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Become a Lesbian and No Longer Interested in Helping David",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The moment Sarah ran to the front of the apartment building, Tim unleashed his magic on her, causing her to ...</span></div></span></div>",
            "created":1389383640,
            "id":1725146,
            "title":"Tim Does Something Else to Sarah"
        },
        "11111221221":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Meanwhile, Inside the Apartment, David Hides From Pete and Ryan",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>The moment Sarah turned the corner of the building, she was hit with a force that she couldn't identify, causing her to feel dizzy.  When her disorientation cleared, she reconsidered what she was doing.<br>\r\n<br>\r\nWhy the hell did she care about that Pete guy anyway?  If he wanted to date a guy, what was it to her?  She was only interested in girls, after all.  For a second, she felt like that was odd, that she shouldn't feel that way.  But she <i>was</i> a lesbian ... right?  Of course she was.<br>\r\n<br>\r\nAnd suddenly, she wondered why she was even there.  She no longer remembered David's plight.  In fact, she was a lot more interested in finding a girl.  She was just so damn horny right now and needed some pussy.  So with that, she left, leaving David to whatever fate Tim had in mind.</span></div></div>",
            "created":1389680940,
            "id":1727310,
            "title":"Sarah Becomes a Lesbian, Then Leaves"
        },
        "111112212212":{
            "author_id":"janis_en_femme",
            "author_name":"Janis",
            "choices":[
                "Sarah goes to the back room",
                "Back to Dave's problem"
            ],
            "content":"<div class=\"\"><div> <span>All Sarah cold think about was pussy. She loved pussy and tits and long hair and soft skin. With each step, her lesbian desire grew more intense.<br>\r\nThen she paused. Frozen in her tracks, she realized she knew nothing about being a lesbian.<br>\r\nYes, she was horny as hell and yes, she was a raving lesbian, but she didn't know what to do about it.<br>\r\nPulling out her phone, she searched for the nearest lesbian bar. She also searched on what she needed to do to attract a lesbian and how to eat pussy.<br>\r\nShe located a lesbian hang out just a few blocks away. She half ran and half walked as she read frantically on how to properly eat pussy.<br>\r\nShe strode in and absorbed the atmosphere. This is where she belongs. Fuck men. Who needed them, she thought over and over as she strutted up to the bar.<br>\r\nShe looked over the bartender, a stout women with spiked hair, tattoos and piercings. Sarah counted 9 piercings, one in the nose, tongue, several in the ears, and one in each nipple which the T-shirt did very little to hide. Sarah wondered if she had her clit pierced too.<br>\r\n\"Feel free to order when you're done taking inventory,\" the surliness of the bartender was not lost on Sarah.<br>\r\n\"A boiler maker!\" she ordered.<br>\r\n\"Coming right up!\"<br>\r\nQuick as a flash, a large stein of beer and a shot of whiskey appeared before Sarah. She downed them fast, shuddering as the alcohol hit her brain.<br>\r\n\"Another!\" she demanded.<br>\r\n\"Another?\" the bartender cocked an eye at the newcomer.<br>\r\n\"Another! I want to get drunk fast and I want to eat pussy!\" Sarah demanded. The other patrons stopped talking and turned to the origin of the outburst.<br>\r\nAnother large beer of stein and whiskey shot lay before Sarah, who was grinning ear-to-ear.<br>\r\n\"First time?\" the bartender asked while wiping the bar in front of Sarah.<br>\r\nDropping the shot in the stein, Sarah chugged the drink down.<br>\r\n\"Yeah,\" she slurred a bit, \"I just realized I'm a lesbian and I want to get started right away!\" She slammed her fist on the bar.<br>\r\n\"Take her to the back room,\" the bartender without turning away from Sarah. The bartender had seen this many time before. Some broad gets pissed off at her boyfriend of husband and decides she's gay. A few minutes in the back room and the regulars have a bit of fun and the newbie realizes she's not gay. Mostly a couple licks on their straight pussy sends them back running to the dicks they left. You never see them again.</span></div></div>",
            "created":1432941420,
            "id":1984983,
            "title":"Something Else"
        },
        "1111122122121":{
            "author_id":"janis_en_femme",
            "author_name":"Janis",
            "choices":[
                "A lesbian orgy erupts.",
                "Back to Pete and Ryan."
            ],
            "content":"<div class=\"\"><div> <span>Two tall women with dark hair, big boobs and tattoos, seized Sarah's arms and lifted her up.<br>\r\nThey noticed no resistance or trepidation on her face which was often the case with other \"newly-realized lesbians.\"<br>\r\nThey carried her to the back room followed by three other women of various descriptions.<br>\r\n\"I'll be there in a sec,\" the bartender shouted as she locked the front door.<br>\r\n\"Good,\" Sarah shouted back. \"I want to see what else is pierced.\"<br>\r\nThe bartender snickered at the alcohol-laced bravado.<br>\r\nDespite being a dark bar, the back room was well lit with several soft, cushion seats and sofas. Sarah was placed on her back on the large sofa in the middle of the room. A couple of women began kissing off to the side. They were obviously a couple who wanted to watch rather than join in. The excitement of virgin pussy turned them on.<br>\r\n\"We all get naked,\" said one of Sarah's guides. <br>\r\nUsually at this point half the newbies would run away screaming.<br>\r\nSarah inhaled as she flipped off her shirt and slide out of her jeans. Her bra and panties remained, teasing the women. She could tell they were getting aroused as they slipped off their garments. She gazed at all the lovely bushes and tits and curves and nipples. She could never remember being so turned on by .... she couldn't remember what those man parts were called anymore. She could barely remember even being with a man but she knew she did. She shook her head of those thought to enjoy the view.<br>\r\n\"Quit wasting my time. What do I do now? I want to be a full-fledged lesbian starting right now,\" she demanded her head clear of the alcohol haze from before.<br>\r\nA blonde women, petite with A-cup breast knelt before her and peeled off her panties. She shoved her head between Sarah's legs and stuck out her tongue. The blonde was waiting for Sarah to jump up screaming as so many did before. Sarah didn't move. <br>\r\nThe blonde kiss Sarah's public bone and Sarah shuddered. She slide her tongue up and down and along the folds of Sarah's cunt. She realized that Sarah was actually enjoying this.<br>\r\nThe others joined in. The tall-dark-haired women unsnapped Sarah's bra and begin sucking on her tits.<br>\r\nBy this time, the bartender was in the back room, she had removed her T-shirt and shoved her pierced nipple into Sarah's mouth. She was pleasantly surprised when Sarah accepted it willingly instead shouting, \"Eww that's gross.\"<br>\r\nEveryone could tell Sarah was in rapture. She licked and sucked around the metal barbell piercing. The sensation of having her tits sucked reverberated throughout her body. Having her pussy eaten by a woman seem to send her into a dream-like state.</span></div></div>",
            "created":1432942680,
            "id":1984994,
            "title":"Sarah goes to the back room"
        },
        "11111221221212":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "It's Hard to Watch, But He Sees His Boyfriend Ryan Having Sex With Pete",
                "They're Just Standing There Motionless ... Then He Hears Tim Talking to Them"
            ],
            "content":"<div class=\"\"><div> <span>Something happened to Sarah.  David was sure of it.  That meant that he was on his own.  He got down off the window sill and headed to the bedroom door, where he saw Ryan and Pete go earlier.  He needed to see what they were up to.<br>\r\n<br>\r\nLooking through the crack in the door, he saw ...</span></div></div>",
            "created":1433000880,
            "id":1985308,
            "title":"Back to Pete and Ryan ... And David"
        },
        "13":{
            "author_id":"sockerslave",
            "author_name":"sockerslave",
            "choices":[
                "David shrinks",
                "Pete shrinks",
                "Ryan shrinks"
            ],
            "content":"<div class=\"\"><div> <span>Tim closes his eyes and concentrates on his spell.... He puts into each of the young men's minds the sexual desire to explore each other right there in the steam room.  He also includes a side effect spell that will alternate each of them in size, but each one will change differently at different times.  <br>\r\n<br>\r\nWhen he opens his eyes, Tim is pleased to see that Ryan has started to go down on David.. but that David eyes are all on Pete.  Pete, without any self control walks over to David and stands above him.  He presses his now erect member into David's adoring face.  <br>\r\n<br>\r\nSuddenly, one of them begins to shrink...</span></div></div>",
            "created":1184648400,
            "id":426762,
            "title":"threesome"
        },
        "131":{
            "choices":[
                "Ride Ryan's massive schlong",
                "Used as human dildo",
                "Be joined in size by Pete"
            ],
            "content":"<div class=\"\"><div> <span>Ryan is mad that David has taken his mates attention. But, as he watches Pete pounding David's mouth, he notices David starts to gag. At first, he thinks it is because David is probably straight and has no experience. This idea quickly gets dropped as he figures out that David is shrinking. He's not gagging - he's choking on the monster cock ripping at his increasingly smaller throat. David pulled away just before a light flashed.<br>\r\n<br>\r\nRyan and Pete look down at David. He's only about 6 inches now. A feeling of power enters the horny giant men. Pete roughly picks David up and asks his boyfriend, \"So what do you think? He'd be fun riding on that horsemeat of yours or he is the perfect size of a dildo.\"<br>\r\n<br>\r\nRyan decides that David should...</span></div></div>",
            "created":1244953620,
            "id":707958,
            "title":"David shrinks"
        },
        "14":{
            "choices":[
                "Tim, the \"innocent bystander\",  has more tricks to play",
                "Pete shrinks before he reaches the door",
                "Tim gets up and tries to \"defend\" Pete from David",
                "David gets up and tries to apoligize...and seems to sucseed",
                "Ryan grows in his sleep"
            ],
            "content":"<div class=\"\"><div> <span>Tim's white, but toothy grin made itself present as he set in motion, what he called, \"Do What Men Want\", in the three men's minds. This was certainly going to be fun for the magic man.<br>\r\n<br>\r\nSuddenly, Pete couldn't stop thinking about his girlfriend and certain times they spent together; namely, what they did in bed. He knew where he was, and suspected that he had an audience, but he couldn't help but think of what he would do with her when he got home that day, nor could he stop himself from getting an erection from it. Then, before he could think of something less erotic, his hand began to stroke his five inch erection; it was smaller than he'd have liked it to be, but, as they say, don't mess with sucsess, and his girlfriend seemed to like it that size.<br>\r\n<br>\r\nDavid, who was normally much more inconspicuous in public when it came to admiring other guys, couldn't help but become entranced by what he saw; here was a complete stranger stroking himself off in a public place with only other guys around. True enough, he was normally embarressed to watch such a spectacle, and would have normally tried to get the guy to stop or leave, he couldn't help but keep his eyes firmly on the masturbation session that was going on beside him. He didn't even notice his own erection until he felt the slight warmth on his belly button; unlike Pete, genetics had been very gracious towards David, his cinnamon colored cock nine inches long and throbbing. Much like Pete though, he found himself masturbating at the sight of Pete's much paler erection, and he couldn't do anything about it.<br>\r\n<br>\r\nRyan, who was dead tired from all the exercise that he put himself through, just wanted to go to sleep; so, thanks to Tim, he did, slumping back onto the warm, tiled wall. However, just for the fun of it, Tim decided to make Ryan become erect as well, six inches long and as thick as a can of pop.<br>\r\n<br>\r\nThough Pete was, at first, completely in a world of his own while watching the mini-movie in his head (mostly about what he and his girlfriend would do when they got home), a slight snore from Ryan pulled him back to where he was: in a gym steam room with three other guys...one of whom was looking directly at his penis...and stroking his own at the sight! Pete was, understandably, upset. \"What the fuck man?! What the hell are you doing?!\", he said, though strangly not noticing that he was still stroking himself off.<br>\r\n<br>\r\nDavid's normally brown face just got darker as he was caught red handed, though he too didn't stop stroking his cock. \"I, I-I, um, uh,\", caught speachless, it was all he could do to say, \"We-well, you aren't stopping now, are you?\", pointing to Pete's still throbbing member and stroking hand.<br>\r\n<br>\r\n\"What?! I'm not jerking of for some...\", Pete angrely exclaimed before looking down and realizing that David was right. With what seemed to be a titanic effort, he pulled his hand away from his cock and stood up, his still erect cock bouncing in front of him. \"Faggot\", he finished, making for the door. David was at a loss for words.<br>\r\n<br>\r\nAnd of course, Ryan just slept through this, snoring occationally while he did.</span></div></div>",
            "created":1214197200,
            "id":547736,
            "title":"Tim does something else"
        },
        "142":{
            "choices":[
                "Tim shrinks Ryan",
                "Tim helps David get revenge",
                "Ryan wakes up"
            ],
            "content":"<div class=\"\"><div> <span>Pete adds a few other choice words as he heads for the door. It was pretty steamy in the room, so David was shocked to see the annoying guy flat out disappear. David tried shaking Ryan to tell him what happened. Ryan didn't respond. Maybe he was just overcome by the heat. He asked the handsome man that had entered the room if he saw the same thing.<br>\r\n<br>\r\nTim smiled and said, \"You mean, 'did I see that guy shrink?'\" David was totally confused until Tim came over, picked up the six inch man off the floor and held him up. Trying to cause more problems, Tim replies, \"Serves the jerk right after the way he treated you. Guess he's yours to dole out whatever punishment you think is appropriate.\"</span></div></div>",
            "created":1242849300,
            "id":694254,
            "title":"Pete shrinks before he reaches the door"
        },
        "143":{
            "choices":[
                "very confused. Tim didn't mess with his mind durring the exchange.",
                "extremely arounsed. Tim brings him to Pete's rear.",
                "embarressed. A hunky football player else enters the steamroom."
            ],
            "content":"<div class=\"\"><div> <span>Pete continued to march to the door, ignoring his decidedly \"straight\" cock, and simply tried to get to the safety of the lockerroom behind it. However, what looked like a wall of ebony flesh got between him and his desired destination. At first he just wanted to throw the guy against the wall (not that he could, but he wan'ted to) and keep on moving, but when the guy put his hands on Pete's shoulders, he couldn't help but feel, safe; cocky even. Here was a real man, one who wouldn't jerk off at the sight of another naked man, one who would defend him from anyone who would try to \"soil\" him. If only Pete knew who he was being \"back up\" by.<br>\r\n<br>\r\nWhile Pete felt that Tim wouldn't let David touch him, he didn't realise that it was Tim himself who was not only putting these foreign thoughts in his head, but also concockted the scenario in the first place. As he pulled Pete closer to his chest, the blond man's head fitting into the crevese between the two dark chocolate mounds some would call pecs, Tim couldn't help but think about the form he had decided to chose; there had been a body builder contest on TV in the gym lounge, and when he saw one contestant, an African-American man, who was at least a head above the next tallest person, he had decided to take on his form (with a few slight modifications, of course). It had worked out very well so far, bringing him much of the attention he desired, and of course many, many men to mess with. At the moment, he would play the part of a concerned friend, standing up for his fellow man. It did help that he had been around for over a hundred plays, operas and movies, most of which he played staring roles in.<br>\r\n<br>\r\n\"What the fuck man?! You daft or somethin'? Come on, don'cha know not to stare at anotha man's pride an' joy?\", he half yelled, half berrated, a heavy Jamaican accent making his deep voice slightly slurred. His face was questioning, angry, and a little hurt; a perfect inversion of what his body was saying. If anyone didn't look at Tim's face, one would think that he was embracing his over confident lover, who was smirking at the other man across the room. Pete himself didn't realise it, nor did it register in David's mind, but Tim's thirteen inch penis was full mast between him and the pale man, making the scene more comical than erotic; the fact that it was amost as large as a 2ltr soda bottle, and that Ryan was still snoring, didn't help. Tim's next words and expression changed that, though.<br>\r\n<br>\r\n\"You can't stare at them like a tv screen, man,\", he said, dipping his head down to Pete's blond, dripping wet head, \"you need to respect them,\" and kissed Pete's forehead, \"and give them a little bit o' sugar, right man?\".<br>\r\n<br>\r\nPete, despite having been degretorry towards homosexuals just a minute previously, still giving David a rather nasty expression, agreed with Tim whole heartedly, not realising the reather hard turn he was making. \"Yeah, just a little bit of sugar, and there's no trouble at all\", pulling Tim's mouth down to his and giving him a sloppy kiss on the lips, trying to get his tongue into the other man's mouth, entwining his fingers in the small, but tight braids the black man had.<br>\r\n<br>\r\nThroughout this entire exchange, David had gone from simply aghast to...</span></div></div>",
            "created":1214370000,
            "id":548203,
            "title":"Pete's omplete turnabout"
        },
        "1433":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Tim Turns Alex Gay and Makes Pete and Alex Fall in Love",
                "Tim Forces Alex's Body (But Not Mind) to Act Gay Towards David",
                "Tim Turns Alex Gay, Then Lets Him Leave to Go Find a Boyfriend"
            ],
            "content":"<div class=\"\"><div> <span>Throughout this entire exchange, David had gone from simply aghast to embarrassed, and maybe a little confused.  He was sure that that guy was homophobic, but now he was kissing that Jamaican dude.  And it wasn't just a peck on the cheek.  He was really going to town with it.<br>\r\n<br>\r\nJust at that moment, the door to the steam room opened and another muscular (although not as muscular as Tim) guy entered.<br>\r\n<br>\r\n\"What the hell is this?  I didn't know this was a place for fags to make out,\" the guy (whose name was Alex, Tim learned by probing the guy's mind) said angrily and disgustedly.  He was a football player for the local college and if there was one thing he hated more than anything it was faggots.  He turned to leave, but Tim stopped him.<br>\r\n<br>\r\nBreaking off his kiss with Pete, Tim pointed at Alex and said \"Stop right there, mon.\"  And Alex did.</span></div></div>",
            "created":1365004500,
            "id":1563863,
            "title":"A New Guy For Tim to Play With"
        },
        "14331":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "No, Tim Didn't Change Them, Yet",
                "Yes, Tim Changed Them ... David and Ryan Used to Be Totally Straight Guys"
            ],
            "content":"<div class=\"\"><div> <span>\"I was only keeping your boyfriend company until ya got here,\" Tim said.<br>\r\n<br>\r\n\"Boyfriend?\" Alex said, spinning around, disgusted by what this Jamaican was implying.  \"Hey, pal.  I'm not gay.  Just ask all the girls I fucked.\"<br>\r\n<br>\r\n\"Oh really?\" Tim asked.<br>\r\n<br>\r\nSuddenly, Alex felt really strange, really messed up.  What the hell was happening?  It felt like someone was going into his head and rearranging things in there.  He cringed, having a brief headache, then he looked back at the Jamaican.<br>\r\n<br>\r\n\"So you're not gay, huh?\" Tim asked.<br>\r\n<br>\r\n\"Of <i>course</i> I'm gay.  Just ask all the guys I fucked,\" Alex said, grinning.  Then he walked towards Pete and put his arms around him.  \"You miss me, baby?\"<br>\r\n<br>\r\n\"Only a little,\" Pete said, before giving his boyfriend a deep kiss.<br>\r\n<br>\r\n\"What the fuck is going on?\" David nearly yelled.  Tim moved towards him and forced him to sit down with him.  \"Did you just make those two gay?\"<br>\r\n<br>\r\n\"Yeah, mon.  I can make anyone gay,\" Tim said.<br>\r\n<br>\r\n\"Did ... did you make me and Ryan gay?\"  If Pete and Alex thought they were supposed to be gay lovers, then it wasn't out of the realm of possibility that the Jamaican might have done the same to David and Ryan, right?<br>\r\n<br>\r\nTim answered by saying ...</span></div></div>",
            "created":1408375860,
            "id":1843518,
            "title":"Alex and His Boyfriend Pete"
        }
    },
    "info":{
        "author_id":"sizeguy",
        "author_name":"Size Guy",
        "brief_description":"A warlock's prank in a gym steam room leaves three lives changed forever.",
        "created":1175223720,
        "description":"<td align=\"left\" class=\"norm\">David, Ryan, and Pete are in the steam room after working out at the gym. David and Ryan are long-time boyfriends, and Pete is straight and a stranger to them. They are all relaxing quietly in the nude when Tim enters. Tim is a warlock with many powers over the mind and body, and he's always up for some mischief. <br>\r\n<br>\r\n*<br>\r\n<br>\r\nThere are no rules for this story other than to keep it coherent. </td>",
        "id":1240162,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1433000880,
        "modified":1433000880,
        "pretty_title":"The Rearranged Life"
    }
}