{
    "chapters":{
        "1":{
            "author_id":"aidanw983",
            "author_name":"Aidan",
            "choices":[
                "Rose Tyler / Billie Piper",
                "Martha Jones / Freema Agyeman",
                "Donna Noble / Chathrine Tate",
                "Amy Pond / Karen Gillan",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The doctor is getting ready for another he has many places n companions to choose from</span></div></span></div>",
            "created":1330483020,
            "id":1286047,
            "title":"A start to a long journey"
        },
        "11":{
            "author_id":"aidanw983",
            "author_name":"Aidan",
            "choices":[
                "The Doctor",
                "The Daleks",
                "Micky",
                "Tickle her yourself",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will tickle Rose Tyler ?</span></div></span></div>",
            "created":1330483860,
            "id":1286059,
            "title":"Rose Tyler / Billie Piper"
        },
        "114":{
            "author_id":"aidanw983",
            "author_name":"Aidan",
            "choices":[
                "Go back to the apartment room",
                "Take her back to your place",
                "take her to an emply warehouse that was used for tickle torture"
            ],
            "content":"<div class=\"\"><div> <span>Its the Preasent day and your wondering round london and all of a sudden you hear a sound unlike any other u. You follow the sound to a bunch of appartments and find a mysterious blue box ( tardis ) placed right in the corner. You suddenly see two people leave the blue box chatting away at each other. you hardly notice the doctor however you couldn't seem to take your eyes off the stunning blonde haired rose tyler who was wearing a union jack t-shirt and a dark skirt as she was wearing black tights in high heels. You automatally watch her as she enters one of the apartment doors.<br>\r\n<br>\r\nAn hour later she comes back out and heads back down the stairs towards where you are standing you bump into her and immediatly start a convasation \" Hello. \" you say she stops in her tracks and looks at you puzzled before saying \" Hey do i know you. \" \"No and whats a fine beautiful young woman like you doing around her. \" You reply. She simply smiles at you and says \" Awww thanks and not much really just visiting my mum. You see i do alot of traveling around really and i don't get much time to see her.\" You quickly say \"What about me.\" with a smirk on your face. She simply smiles and laughs before saying \" Well i don't have to back for a few hours so we could start now.\" \"Exelent.\" you say. \"Where do you want to go.\" she says<br>\r\n<br>\r\n<br>\r\nWhere do you take her ?</span></div></div>",
            "created":1330486620,
            "id":1286083,
            "title":"Tickle her yourself"
        },
        "1142":{
            "author_id":"aidanw983",
            "author_name":"Aidan",
            "choices":[
                "Carrying on tickling her  feet",
                "Tickle her stomach",
                "Tickle her armpits"
            ],
            "content":"<div class=\"\"><div> <span>You decide to take her back to your place u then sit on your sofa and she joins you so u both just sit back and relax. You decide to ask her about her journey with the doctor and she says \"We do alot of running around after aliens,monsters you name it i've probally seen it.\" You say \" Wow u must be tired doing all that running about.\" \"well yes i am. do you mind if i rest my feet on you and lie down?\" she asked. \"No of course not be my guest.\" you say. She then takes her high heels off and stretching her black tighted feet on your body up to you. your chest. You slowly raise your arm over her feet. She doesnt seem fussed by it at all. Then you gently slide your finger down her sole she twitches and smiles before saying \" Please don't my feet are ticklish.\" you then ask her if you could continue she pauses before saying \"Of course but you must be gentle.\"You couldn't belive your luck.So you imediatly start to tickle her left sole this time little giggles escape her mouth you continue to tickle the left sole you can see her resisting the temptation of laughter so you move to her right sole which causes her to break out with laughter hahahahahahahahahahahahahahahastaahahahpphahahahahathathahatickleshahahhahasohah ahahbad. 10 minutes later you decide to give her a breather before starting again but this time u decide to tickle both feet at the same time by doing this she is a laughing mess HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAOMGHAHAHAHAHAHAHAHAHAHAHASTAHAHA PITHAHAHAHAHAHAHAHAHAHAHAHTICKLESHAHAHAHAHAHAHAHAHAAHTOHAHAHAHAHAHAMUCHHAHAHAHAH AHAHAHAPLEASEHAHAHAHAHAHAHAHAHHAAHAHA u decide to carry on tickling you intend to mke to most of it before she heads off so you decide to tickle her feet alot fast HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAPLESASEHAHAHAHAH AHAHAHAHAHAHAHAHHAHAHAI'LLHAHAHAHAHAHAHAHAHAHDOHAHAHAHAHAHAHAHAHANYHAHAHAHAH AHAHTHINGHHAHAHAHAHAHAHAHAHAHAHJUSTHAHAHAHAHAHAHAHASTOPHAHAHAHAHAHAHAHAHAHATHEHH AHAHAHAHAHAHATICKLINGHAHAHAHAHHAHAHIHAHAHAHAHCAN'THAHAHAHATAKEHAHAHAHAHANYHA HAHAHAHAHAHAHAHAMOREHAHAHAHAHAHAHAHAHAHA at that moment to decide to make a deal with her. \"If i can tickle you wheever andwherever i want and i'll stop deal?\".  HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAOKHAHAHAHAHDEALHAHAHAHAHAHAHAHA and with that you give her a brather she's not going anywhere any time soon.</span></div></div>",
            "created":1330749180,
            "id":1287921,
            "title":"Take her back to your place"
        }
    },
    "info":{
        "author_id":"aidanw983",
        "author_name":"Aidan",
        "brief_description":"Female characters of doctor who tickled. ",
        "created":1330481700,
        "description":"<td align=\"left\" class=\"norm\">The doctor and his companion are off on their adventures and end up in some ticklish situations traveling round the universe.<br>\r\n Tickle them yourself or any character from doctor who.<br>\r\n<br>\r\nRules<br>\r\n. Must be only female tickling<br>\r\n.No nudity,sex or anything similar<br>\r\n.swearing permited<br>\r\n</td>",
        "id":1851450,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1330749180,
        "modified":1330749180,
        "pretty_title":"Tickle the characters of doctor who"
    }
}