{
    "chapters":{
        "1":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Go to the Mall and Invite Tabitha to go with you",
                "Go to the Mall",
                "Decline invitation and Play video games with Tabitha",
                "Invite Jill over for video games",
                "Slumber Party with Jill and Linda"
            ],
            "content":"<div class=\"\"><div> <span>You bit your lip, turning to view yourself from a different angle in the antique stand mirror in your room. You pushed your belly out, feeling slightly light headed as you struggled to make it look as round as you could. Taking a deep breath, you relaxed your belly, watching it sink back into its normal flat position. You brought your hands to your stomach, feeling the muscle beneath your skin.<br>\r\n<br>\r\nYou sighed, turning to look from another direction. Last week you'd stumbled upon a website where the weight gain community was fairly active. It was the first time you'd really realized that you weren't alone in your desires. You'd always wanted to be fat, but everyone else seemed to think that was so horrible. You'd never shared your desires with anyone before, but after seeing that you weren't alone you found yourself intrigued by the community. <br>\r\n<br>\r\nTurning away from the mirror, you sat down in the chair at your desk, and turned on you computer.<br>\r\n<br>\r\nNodding your head, you waited patiently for the computer to boot up. You'd built the computer yourself, having always been fairly tech savvy. Though that was probably because your father's interests had rubbed off on you. After all, he had better be into technology since he was a programmer.<br>\r\n<br>\r\nFinally, the computer's login screen appeared, and you logged in. The screen was littered with icons for games, though you clicked on the one for internet.<br>\r\n<br>\r\nYou felt butterflies in your stomach as you logged into the site you'd found and navigated towards your profile. You clicked on the message icon, almost dreading what you were going to see. In an act of stupidity, or bravery, you'd made an account on the site and posted a couple pictures of yourself along with the tag that you were considering gaining weight. You were sure that everyone would laugh at you for wanting to do that, but you hadn't been able to bring yourself to take down the account. However, as you began reading the comments, you found a renewed sense of purpose.<br>\r\n<br>\r\nWhere you had thought there would be mocking replies to your desires, were instead words of encouragement from numerous people. There were responses telling you good luck on the gain, or that they were willing to help if you needed any encouragement or advice. You were astounded at how many people shared in your desire for you to gain weight, and were encouraging you to do so.<br>\r\n<br>\r\nThe butterflies gone, you leaned back in your chair, glancing at your flat stomach. You weren't alone. That was obvious now. However, you were still nervous. What if you didn't like it? What if you liked it too much? What would your family say? Or your friends?<br>\r\n<br>\r\nYour eyes were drawn to the thin girl in the photos on your account. Her long dark hair framed her thin face, while she had hardly any breasts to speak of. Her belly was smooth and flat, with just a slight hint of muscles beneath the surface. She had the brightest green eyes you'd ever seen, though they looked sad.<br>\r\n<br>\r\nYou sighed. You knew why, since that was you. Despite everyone telling you that you should be happy you were thin, you weren't. You didn't know from where the desire came, but you always had wanted to be fat. Still, you'd never really had the bravery to pursue that goal before now. Even now that you'd made your decision, you were doubting whether you could go through with it. Part of you wished you could trade places with your sister, Tabitha. She'd always been chubby, so no one seemed to really care that she was starting to plump up more. But you, they would definitely notice. That was the problem with being a thin girl your whole life. If you put on any weight at all, people would notice and say things.<br>\r\n<br>\r\nYou rubbed your flat belly, wondering what it would be like once it started getting fatter. You were determined to go through with it this time. You'd tried a couple times before to gain weight, but you'd always chickened out the moment you started seeing any chub on your thin frame. This time though, you were going to go through with it. At the very least, you could let yourself get as fat as Tabitha, and then if you didn't like it, it wouldn't be too hard to lose the weight. Plus it wasn't like anyone would really be able to call you fat. Chubby? Yes. But not fat.<br>\r\n<br>\r\nYou got up, walking back in front of the mirror and looked your small frame over from head to toe. You were the shortest in your family. Even shorter than Tabitha, despite the age difference. Actually, you were probably one of the shortest girls in school at only 4'8\". That meant that any weight you gained would be that much easier to notice since it would have a bigger impact on your width. <br>\r\n<br>\r\nGlancing at the calendar, you counted the days until school started back up from summer break. <br>\r\n<br>\r\n10. 10 days until school started.<br>\r\n<br>\r\nBiting your lip again, you tried to think of a reasonable goal for 10 days worth of gain. Previously, you'd actually gained weight fairly quickly since despite your size you had a rather large appetite if you let yourself. It hadn't taken very long for you to gain even a couple of pounds, though you shouldn't count on always being able to gain so quickly. You figured 3 pounds in ten days wouldn't be too bad a goal. Especially if you didn't want everyone noticing your gain right away. If possible, you wanted to delay the questions as long as possible. You had weighed yourself this morning as being 100 pounds, so it should be fairly easy to tell how much weight you gained from this point. <br>\r\n<br>\r\nYou almost jumped as you phone beeped, and you quickly grabbed it from the desk. It was Jill, one of your best friends, asking if you wanted to go hang out at the mall. You'd have to get dressed first, but it would give you an opportunity for delicious mall food. Though Tabitha had also asked if you wanted to play video games with her today, and that would mean being able to snack as much as you wanted. </span></div></div>",
            "created":1534136400,
            "id":2532805,
            "title":"Uneasy Beginnings"
        },
        "11":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Get food at the food court",
                "Check the supplement store",
                "Suggest Buffet",
                "Suggest Video Games",
                "Call it quits"
            ],
            "content":"<div class=\"\"><div> <span>You felt a pang of guilt as you messaged Jill back, saying you'd be there shortly. You sister had asked you to play games with her first. Though maybe she'd be up to going to the mall too. Her and Jill always got along really well since they were both into the same things, and you might win points with your mother for convincing your sister to leave the house.<br>\r\n<br>\r\nQuickly throwing on some clothes, you paused for a minute, feeling how loose they were on you. Shaking your head you, finished getting ready, and knocked on your sister's door before poking your head into the messy room. Tabitha was lounging on her bed with a controller in her hand as she focused on the video game on the screen. <br>\r\n<br>\r\n\"You come to join me finally,\" she said, not even taking her eyes off the screen.<br>\r\n<br>\r\n\"Actually, I was going to ask if you wanted to go to the mall with me and Jill.\" you started, \"I know there was a new game that came out and I was thinking of getting it.\"<br>\r\n<br>\r\nIt wasn't entirely a lie. You loved video games almost as much as your sister and Jill. You hadn't planned on getting the game today, but you figured that would be a good excuse to get Tabitha to join you.<br>\r\n<br>\r\nShe paused the game, turning towards you, \"I forgot that came out today. Let me just get some clothes on.\"<br>\r\n<br>\r\nYou shut the door as your chubby sister started pulling herself to her feet to get ready, and made your way to the kitchen and grabbed a granola bar while you waited for her. Finishing it quickly, you grabbed another and ate it.<br>\r\n<br>\r\nFinally, you heard Tabitha's door close again followed by the heavy foot falls of your chubby sister making her way downstairs. Her shirt was several sizes too small, and it looked like her jeans were digging into her waist uncomfortably, causing a noticeable muffin top. She followed you out into the driveway, where a lone car sat. It was old and worn, but at least it got you were you needed to go. <br>\r\n<br>\r\nBoth of you hopped in, and you began making your way to the mall, chatting with your sister about video games the whole time. Finally, you arrived and entered the mall at the food court. Instantly you could smell all sorts of savory scents in the air from the numerous restaurants that lined the large atrium. <br>\r\n<br>\r\n\"Heather! Over Here!\" you looked around for the person calling your name, and caught sight of another chubby girl waving at you and bouncing up and down. Her short hair bobbed up and down, and she kept having to push her thick glasses back up on her nose. Her large shirt did little to hide the fact that she was overweight, though it was probably more because it showed one of her favorite video games.<br>\r\n<br>\r\n\"Hey Tabitha!\" Jill said to them as they approached, \"What have you been playing lately?\"<br>\r\n<br>\r\nTabitha immediately launched into a detailed description of her video game exploits as they started walking towards the game store. <br>\r\n<br>\r\nYou smiled to yourself at the dynamic between those two. They could stay at it all day if you let them, though usually you were just as much involved in the conversation as they were. Still, at least you were able to hang out with both of them. It was a win-win. <br>\r\n<br>\r\nIt didn't take long before the three of you were striding into the game shop, where a healthy crowd of people were lined up to get the new game that had just released. Most of them were guys, though that didn't bother you too much. You'd always been a little tomboyish.<br>\r\n<br>\r\nYou found yourself looking over the crowd of people as you got in line with your friend and sister. Your eyes lingered on anyone who was overweight, as you wondered what it would be like to be one of them. You had to admit that you were jealous of Jill and Tabitha for their weight. You must look slightly out of place hanging out with the two chubby girls while you were so thin. Though if things went how you planned, you would fit right in with them soon in terms of weight. That thought caused you to blush and fidget nervously, though fortunately no one seemed to notice.<br>\r\n<br>\r\nYou were only half paying attention to the conversation that Tabitha and Jill were having as you slowly moved forward in line. Fortunately they didn't pay you much mind as you continued fantasizing about what it might be like to be chubby. Though theoretically you wouldn't have to fantasize much longer. <br>\r\n<br>\r\nEventually, it was your turn to pick up the game. You paid the cashier and waited for the other two to finish purchasing their copies. <br>\r\n<br>\r\n\"So, what should we do now?\" Jill asked, coming to stand beside you with Tabitha in tow.<br>\r\n<br>\r\nYou bit your lip as you tried to think what to do. You were pretty hungry, so maybe a trip to the food court was in order. However, as long as you were here, you also wanted to check out the supplement store for something that the people online said would help increase your appetite. If you were feeling really ambitious about gaining weight, you could always suggest the endless buffet place across the street. Or possibly invite Jill over to play games with you and Tabitha. Or just call it quits for today.</span></div></div>",
            "created":1534136400,
            "id":2532882,
            "title":"The Game Girls"
        },
        "113":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Get ice cream",
                "Just go home",
                "Suggest resting and getting food later"
            ],
            "content":"<div class=\"\"><div> <span>Your eyes couldn't help but take in the two chubby girls right in front of you, as you felt another pang of jealousy. You knew that you said you'd take it slow, but you wanted results now. You didn't want to be the skinny girl in the group any longer. You wanted to be one of the chubby girls. With that, you made up your mind.<br>\r\n<br>\r\n\"I was thinking we could go to the buffet place across the street.\" you said, already walking towards the exit. <br>\r\n<br>\r\nTabitha and Jill both expressed their excitement as they fell in stride with you as you made your way out into the heat of the noon sun. It only took about five minutes to walk to the buffet, but both your sister and friend were already sounding like they were out of breath by the time you made it to the restaurant. While you weren't free of sweat by any means, the other two seemed as if they'd just done a marathon. <br>\r\n<br>\r\nYou felt a stirring in your groin as you thought about what it would be like to be that out of shape. Where even a short walk across a parking lot exhausted you.  Smiling slightly as you let your eyes linger on the two chubby girls that were accompanying you.<br>\r\n<br>\r\n\"Why'd you stop? Let's get in there so we can sit down.\" Tabitha said, leaning on the side of the building while she tried to catch her breath. <br>\r\n<br>\r\nMaybe they were fatter than you gave them credit for. Though they were still only chubby by your standards.<br>\r\n<br>\r\nYou opened the door, letting the two girls enter before you. You loved watching the way their chubby bodies moved, and it was easier to look when you were behind them. <br>\r\n<br>\r\nThe three of you paid, then took a seat at an empty booth. Your mouth was salivating as you took in more food than you could ever hope to eat. The numerous smells assaulted your nose, begging for your attention as you struggled to decide what to have first.<br>\r\n<br>\r\nThe three of you separated and began loading up your plates. You licked your lips as you brought your plate back towards the table, determined to eat as much if not more than the other two.<br>\r\n<br>\r\nTabitha sat across from you, while Jill plopped on the bench beside you. You shivered in excitement as you felt her soft thigh press against yours, as your eyes danced between the chubby pair. It was easier to tell now that you were all sitting, but both your companions had definitely put on weight since the start of the summer. Though it seemed like Tabitha was the winner on that front. At the beginning of the summer, Jill had definitely been fatter than Tabitha, but that was no longer the case. Tabitha had to be at least a couple sizes bigger than Jill now.<br>\r\n<br>\r\nNot wanting to fall behind in your goal to eat as much as whoever ate the most, you switched your attention to the delicious food. Food always made you feel better, and you always had to be careful not to overindulge, but now you didn't care about that. You'd always had a massive appetite, but you hardly ever pushed yourself. These two though seemed to constantly push their limits as they indulged their desires. This had lead to them having truly massive appetites when they had the opportunity. Still you were going to keep up.<br>\r\n<br>\r\nBy the time you were on your fourth plate, you were starting to feel like you were going to burst, but the other two just kept going. Still, you weren't going to give up now. You went back and loaded up a fifth plate, and slowly began munching it down while surprisingly only Tabitha went back for a fifth. That meant that Tabitha was the one to match. <br>\r\n<br>\r\nWhen she finished that plate, she let out a loud burp before patting her stuffed belly, \"I think I've hit my limit.\"<br>\r\n<br>\r\n\"Me too.\" Jill chimed.<br>\r\n<br>\r\nYou set your silverware down, looking at your cleared plate, \"Me three.\"<br>\r\n<br>\r\nYou closed your eyes for a moment, trying to let your stomach settle from the massive meal you'd just ingested. You were pretty sure you were going to puke if you ate another bite.<br>\r\n<br>\r\n\"Hey, do you two want to go get some ice cream for desert?\" Tabitha chimed.<br>\r\n<br>\r\n\"I'm in if Heather's down.\" Jill said.<br>\r\n<br>\r\nYour stomach turned at the thought, but this might be the perfect opportunity to really push yourself. </span></div></div>",
            "created":1534309200,
            "id":2534159,
            "title":"Setting Trends"
        },
        "13":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Assure her that she's not fat and your mother is overreacting",
                "Suggest that maybe she should lose some weight",
                "Suggest that she should just keep doing what makes her happy",
                "Suggest that you both should gain weight to prove a point"
            ],
            "content":"<div class=\"\"><div> <span>Despite how tempting the offer was, you had already promised Tabitha that you'd play with her today. You sent a quick text to Jill that you were busy. Taking one last look in the mirror, you finished getting ready for the day and made your way to your sister's room, knocking as you entered.<br>\r\n<br>\r\nThe room was a mess, but that didn't bother you too much as you picked your way across the cluttered floor and plopped down on the bed next to your sister. She was still in her too tight pajamas which left her belly visible to anyone who looked at her. She didn't seem to care though as she hardly acknowledged you as she stayed focused on her game. You grabbed a bag of chips and shoved a handful into your mouth as you watched Tabitha's character move about the screen. <br>\r\n<br>\r\nYou spent the next little while munching on snacks while you waited for Tabitha to finish and play with you. Finally, she set down the controller on her soft belly, glancing at you.<br>\r\n<br>\r\n\"You ready?\" She asked.<br>\r\n<br>\r\nYou nodded and grabbed the other controller.<br>\r\n<br>\r\nThe hours crept by as you and your sister played together, munching on snacks the whole time until you heard a knock on the door.<br>\r\n<br>\r\nYou both turned and looked as your mother poked her head into the room, \"Look at this mess! And Tabitha, are you still in your pj's? Why don't both of you go outside and get some sun?\"<br>\r\n<br>\r\n\"It's not like I have anywhere to go.\" Tabitha shot, \"Besides we're spending time together.\"<br>\r\n<br>\r\nYou nodded in agreement, as you mother stepped inside the room and put her hands on her hips.<br>\r\n<br>\r\n\"This is why none of your clothes fit you anymore!\" She said, pointing a finger at Tabitha, \"And you, you'll end up looking like her if you keep spending all this time on games.\"<br>\r\n<br>\r\nYou felt your face go red, and turned away.<br>\r\n<br>\r\n\"I'm not that fat.\" Tabitha shot, \"besides, what does it matter?\"<br>\r\n<br>\r\nYour mother let out an angry sigh and left the room, while Tabitha was furiously focusing on the game.<br>\r\n<br>\r\nBiting your lip, you turned back towards the game then towards Tabitha, who seemed to purposefully be shoving as much food in her mouth as she could, all the while mumbling under her breath that your mother didn't even know what fat was. She kept going off on how she should show her what fat really was.<br>\r\n<br>\r\nFinally, she paused the game and turned to you, \"Do you think I'm fat?\"<br>\r\n<br>\r\n\"Where did that come from?\" you stutter.<br>\r\n<br>\r\n\"She's always getting after me for being a little overweight, and honestly, what does it matter? I always get good grades in school, and I help out around the house, so who cares if I spend some time playing video games instead of going outside. I mean, she's not exactly thin either.\" Tabitha ranted, \"I mean who cares if you put on some weight either? She acts like being fat is so horrible. I wish she would just get off my case. It's probably just because I'm the only one of her daughters who's not a twig.\"<br>\r\n<br>\r\nShe took a deep breath, looking at her obviously chubby belly as she tried to calm down. You sat in silence, watching your sister kneading her chubby belly, and wishing you could switch her places.<br>\r\n<br>\r\nYou bit your lip as you mulled over what you sister had said. Your mother definitely didn't get after you or Mary like she did Tabitha. And both you and Mary were fairly thin. This just strengthened your resolve that you needed to gain weight. At least then Tabitha wouldn't be alone in her weight.<br>\r\n<br>\r\n\"Do you think I should lose weight?\" Tabitha finally asked, still staring at her belly.<br>\r\n<br>\r\nYou were conflicted. On one hand you liked your sister being a little softer, and at least if she was still chubby your mother's ire wouldn't switch solely to you. On the other hand, you could give the socially acceptable response and suggest she lose some weight. Or maybe drop a subtle hint that she should gain more weight, that way you'd still look thin in comparison.</span></div></div>",
            "created":1534136400,
            "id":2532913,
            "title":"Gaming Sisters"
        },
        "14":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Go make lunch in the kitchen",
                "Raid the snack drawer",
                "Go for a walk",
                "Ask Jill and Tabitha if they want to go out to eat",
                "Go load up on fast food"
            ],
            "content":"<div class=\"\"><div> <span>You bit your lip as you tried to decide what to do. On the one hand, you wouldn't mind hanging out with Jill. On the other, it would be nice just to hang out and be lazy all day. Although, there was really no reason you couldn't have both. Jill and Tabitha got along great, and you were sure that Jill wouldn't mind a day of video games if you invited her over. <br>\r\n<br>\r\nYou quickly texted Jill, asking if she wanted to come over and play video games with you and Tabitha. Almost instantly the phone beeped again with a reply from Jill saying she'd be over soon. You quickly finished getting ready for the day, and made your way towards your sister's room.<br>\r\n<br>\r\nYou opened the door, peering into the darkened room. The blinds had been drawn shut, keeping it rather dim in the room, and the smell of dirty laundry mingled with that of the snacks that littered the room. Tabitha lay on her bed, her chubby frame illuminated from the light from the television that was displaying her game. You carefully picked your way across the cluttered floor, and sat down on the bed next to your large sister. <br>\r\n<br>\r\n\"Hey sis. Ready for some games?\" She asked, still focused on the screen in front of her.<br>\r\n<br>\r\n\"Yeah. Hey, I also invited Jill over.\" you said as you grabbed another controller.<br>\r\n<br>\r\n\"Sounds good.\" she said, as she shifted her soft frame over to make more room for you on the bed.<br>\r\n<br>\r\nYou shifted to a horizontal position next to your sister, feeling her soft body pressed slightly into yours.<br>\r\n<br>\r\nYour heart skipped a beat at the feeling of being so close to your sister. You still remembered when she was small enough that your bodies weren't always touching when you were both laying on the bed. Though since she'd been plumping up, the space between you two had grown smaller and smaller until it was nonexistent. Though you didn't mind. You loved feeling your sister's soft body pressing into yours. Even if it was giving you less and less room on the bed. Besides, you should enjoy it while you could. It wouldn't be long before there was too much of the two of you for you both to fit on the bed.<br>\r\n<br>\r\nA soft knock sounded at the door as it slowly creaked open, revealing a rather chubby girl poking her head into the room. She looked around before stepping inside and moving towards the chair next to the bed. <br>\r\n<br>\r\n\"Hey Jill,\" you said, hardly glancing her way, \"You can play next round.\"<br>\r\n<br>\r\n\"Alright.\" she said, plopping down in the chair which groaned in protest of the large teen.<br>\r\n<br>\r\nAfter the round was over, you passed the controller to Jill. You took the opportunity to grab one of the many snacks littering the room and began chowing down on it. <br>\r\n<br>\r\nYou sighed as you nestled deeper into the bed, pressing ever so slightly more into your sister. You had to admit, it would probably be pretty easy to gain weight if you took a few pages out of your sister's book and just stayed in bed all day playing video games. After all, you did love them almost as much as your sister did. It just seemed like life was always preventing you from constantly indulging yourself. Besides, you didn't necessarily want to get fat that quickly. Although, it might not be too bad if you did.<br>\r\n<br>\r\nA few hours went by as the three of you enjoyed time snacking and playing games. Tabitha and Jill had really seemed to master the art of eating while playing as they continued binging on snacks the whole time.<br>\r\n<br>\r\nYou found yourself thinking back to the beginning of summer break. Both Jill and Tabitha had definitely been thinner before the break started. That wasn't to say that they'd been thin, but they were definitely bigger than at the start. You found yourself jealous of their bodies as you looked over your fat friend and sister. To them they didn't really seem to care that they were overweight. They were completely comfortable just being themselves. And if that meant that they were getting fat, so what. You were just as jealous of that confidence in themselves as you were their bodies.<br>\r\n<br>\r\nYou got up, excusing yourself from the room as you made your way out into the hall.<br>\r\n<br>\r\nYou knew they would be able to keep themselves busy for a while. You just were feeling too jealous of them to hang around any longer. You wanted to look like that now! You knew that wasn't possible, but you still couldn't deny that for all your talk of wanting to take it slow you really did want the payoff immediately. You wanted the chair to strain under your weight. You wanted to be so large that you alone could fit on the bed, with no room for someone else. You wanted it.<br>\r\n<br>\r\nStill, now the question was; what to do now?<br>\r\n<br>\r\n</span></div></div>",
            "created":1534222800,
            "id":2533576,
            "title":"Power Play"
        },
        "145":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Go with them to get another fast food meal",
                "Decline the offer"
            ],
            "content":"<div class=\"\"><div> <span>You were lost in thought, letting your feet take you where they willed. You went downstairs, then walked out into the heat of the day. You climbed into your starter car and drove out of the driveway. As you pulled into a parking lot, your eyes lit up at where your body had taken you.<br>\r\n<br>\r\nYour mouth began salivating as you looked at the fast food restaurant before you, glad you'd come here. Sure you'd been snacking all day, but you probably should have an actual meal, and it wasn't like the other two would even notice that you were gone. <br>\r\n<br>\r\nYou proceeded through the drive-through and ordered two large meals. Waiting only a few minutes, you got your food and unwrapped the first large burger as you pulled out of the parking lot. It was so delicious as you bit into it, juices dripping down your chin. You ate ravenously, not even caring how many calories your large meal was adding to your frame. You hadn't even made it home by the time the first meal was gone and you started on the second, but you couldn't help yourself. You just needed to eat and enjoy yourself for a change. <br>\r\n<br>\r\nYou were sick of always being the thin girl. You wanted what your sister and Jill had. You wanted to be fat. You wanted the confidence to do what you wanted without worrying about whether people saw you as fat. You just couldn't take living the lie any longer. <br>\r\n<br>\r\nYou took a massive bite of your second burger, almost gagging yourself as you chewed the massive lump of food. You hardly realized that you had pulled into another fast food place and were placing an order until the cashier was collecting your money. You had already finished the second large meal by the time the cashier handed you another bag stuffed full of food. Your car was filled with the delicious scent of the fattening food as you drove away with several fries sticking out of your mouth. <br>\r\n<br>\r\nYou slowly ate this meal as you made your way back towards your house, starting to feel overly stuffed with food. Yet despite the slightly sick feeling, you felt good being so stuffed with food. There was something comforting about it. <br>\r\n<br>\r\nYou made your way inside, and back up to your sister's room where the other two were still playing games. <br>\r\n<br>\r\n\"There you are. Where were you?\" Jill asked as you entered the room.<br>\r\n<br>\r\n\"I needed some fresh air.\" you replied as you sat down on the bed.<br>\r\n<br>\r\n\"Well, me and Jill were waiting for you to get back so we could go get some food.\" Tabitha said, not even taking her eyes off the screen.<br>\r\n<br>\r\nYour stomach turned at the thought of more food, but you didn't want to arouse any suspicion from them.</span></div></div>",
            "created":1534914000,
            "id":2537356,
            "title":"Stress Eating"
        },
        "1451":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Get a Large Meal",
                "Get a Medium Meal",
                "Get a Small Meal"
            ],
            "content":"<div class=\"\"><div> <span>The room was spinning slightly, and your head felt light as you almost felt the blood rushing to your belly. Still, you didn't want them to grow suspicious of what you'd been up to as you made up your mind.<br>\r\n<br>\r\n\"Sure, I'm starving.\" you managed to say, suppressing a belch.<br>\r\n<br>\r\n\"Great. Let's go.\"<br>\r\n<br>\r\nA few minutes later, your car was filled with the sound of off-tune singing as the three of you sang along to the radio. Finally, you all broke out giggling and laughing as the music came to a close as you pulled into the parking lot of one of your favorite restaurants. Even before exiting the car you could smell the delicious flavors wafting to you, and despite still feeling beyond full, your stomach let out a growl of anticipation.<br>\r\n<br>\r\n\"Hurry up, lets go.\" Tabitha shouted into the car as she slammed her door shut, while Jill followed suit.<br>\r\n<br>\r\n\"Head on in, I'll catch up with you in a minute.\" you shouted at their backs as they entered the establishment.<br>\r\n<br>\r\nYou made sure you had everything you needed before closing your door and jogging inside. You cringed slightly as each quick step seemed to cause your overstuffed belly to bounce and slosh, reminding you of just how full you were. The smells were even stronger as you through open the door, joining the other two in line behind a young couple. You glanced at the menu and frowned slightly.<br>\r\n<br>\r\nYou weren't really that hungry, but you didn't want them to get suspicious of you, so you should probably order a meal. Though you weren't even sure if you could eat an entire meal right now. For your size, you'd always had a large appetite, and you were sure that you could probably rival Tabitha if you were to push yourself as much as she did, but you didn't know if you were ready to push your belly that much today.</span></div></div>",
            "created":1535691600,
            "id":2541181,
            "title":"Beyond Stuffed"
        },
        "14511":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Admit to wanting to be fat",
                "Keep silent"
            ],
            "content":"<div class=\"\"><div> <span>Your stomach made your choice for you, as you found yourself placing an order for a large meal. Enough time had passed that you were starting to feel like you could eat again, and you took advantage of that. Though if you weren't careful, you might start gaining faster than you wanted. Still, you didn't regret your decision to order a large meal.<br>\r\n<br>\r\nA few minutes later, the three of you were sitting at a table, waiting for you food to arrive. Despite how full you had been, you found your belly starting to gurgle in anticipation as you watched everyone eating their food happily. A low hum of people talking filled the air, though you were more focused on listening for your number to be called while Jill and Tabitha continued their discussion on video games. <br>\r\n<br>\r\nYou practically jumped to your feet when you finally heard your number called, and quickly strode over to get your food. You thanked the cashier and made your way back to the table. You sat down and started digging in, while the other two continued to wait for their food. Each bite elicited more saliva to fill your mouth as you savored the delicious flavors. You quickly forgot how full you were as you tried to eat as fast as you could. <br>\r\n<br>\r\n\"Wow! You must have been really hungry.\" Tabitha said, causing you to jump slightly.<br>\r\n<br>\r\nYou'd been so focused on your food, that you'd completely forgotten that you weren't alone, \"Yeah. I- uh.\"<br>\r\n<br>\r\n\"No need to make excuses.\" Jill laughed, \"We were just trying to get your attention, but you were so into your food.\"<br>\r\n<br>\r\nYou felt your face go hot, as you glanced down at the almost empty tray in front of you. Now that you'd stopped eating, you realized that you were really full, almost to the point of vomiting. <br>\r\n<br>\r\n\"Yeah, with the way you were eating, you'd think that you were the chubby sister.\" Tabitha said, patting her chubby belly as you felt yourself becoming aroused. <br>\r\n<br>\r\n\"Not that, that would be a bad thing.\" Jill said, still chuckling, \"I think you'd look cute as a chubby girl.\"<br>\r\n<br>\r\nYou couldn't bring yourself to look at the two chubby girls across from you as you took another bite of your burger, \"Do you really think so?\"<br>\r\n<br>\r\n\"Yeah.\" Jill laughed.<br>\r\n<br>\r\n\"Definitely.\" Tabitha said, \"I've seen you when you let yourself go, and you're pretty cute.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1535864400,
            "id":2541992,
            "title":"Hollow Leg"
        },
        "145111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Skin tight clothes that hug to your body",
                "Baggy clothing that would hide any weight that you've gained",
                "Flaunt your stuff with an outfit that leaves your belly partially exposed."
            ],
            "content":"<div class=\"\"><div> <span>\"The truth is, I, um, actually want to gain some weight.\" you mumbled, staring at the tray in front of you intently. <br>\r\n<br>\r\nYou didn't know why you said that. You were still not very comfortable with other people knowing about your secret desires, but something had made you feel the need to tell the two girls on the other side of the table. Perhaps it was the need for it to feel more real. Or just the guilt of keeping it bottled up for so long.<br>\r\n<br>\r\nThey just looked at you for a moment before Tabitha smiled, \"I already knew that.\"<br>\r\n<br>\r\n\"Wait, What? How?\" you almost shouted.<br>\r\n<br>\r\n\"You're really not as discrete as you think that you are. Always posing in front of the mirror and playing with your belly.\" Tabitha said, eating another fry.<br>\r\n<br>\r\n\"Yeah, even I had my suspicions.\" Jill said, smiling too.<br>\r\n<br>\r\n\"Does everyone know?\" you asked, feeling your heart sinking.<br>\r\n<br>\r\n\"I don't think so. I think its just because you hang out with us so often.\" Jill replied, leaning back on the bench, \"Besides, I kind of like being chubby too, so I kind of knew what to look for.\"<br>\r\n<br>\r\n\"Wait. You like being chubby?\" you asked, feeling genuinely surprised.<br>\r\n<br>\r\nJill chuckled, \"Yeah, I've always enjoyed being chubby, even if I did get teased. I love the way my body is, and the way it feels. I don't think I'd ever want to be thin. Not like I'm at risk of that. Honestly, I love being chubby.\"<br>\r\n<br>\r\nYou felt more confident in yourself after hearing Jill's confession, and despite your embarrassment, you felt more determined to gain weight than ever before. She wished that she could be as comfortable with being overweight as Jill was.<br>\r\n<br>\r\n\"Honestly, being chubby really isn't as bad as everyone makes it out to be. I mean, I get to enjoy all the great food that I want, and people don't expect me to do as much work as someone who's skinny.\" Tabitha chimed in, \"And it really doesn't cause me too many problems besides having to buy clothes a bit more often.\"<br>\r\n<br>\r\n\"If you want to gain weight, then you should just do it.\" Jill said honestly, \"Otherwise you'll just be unhappy your entire life. Even if you decide to change your mind later, at least you will know what its like.\"<br>\r\n<br>\r\n\"But what if people start to notice.\" You asked.<br>\r\n<br>\r\n\"They will, but most the time they'll just ignore it. And, what does it matter what some random hater thinks?\" Jill said.<br>\r\n<br>\r\nYou bit your lip, glancing at the empty tray in front of you as you contemplated what they were saying. It sounded like both of them thought you should go for it. But they'd always been chubby, so it wasn't like people would really care if they put on more weight. Still, it was encouraging to know that they didn't think you were weird for wanting to be fat. It actually felt like a huge weight had been lifted from you. You knew now that you were determined to at least get as chubby as Tabitha.<br>\r\n<br>\r\nYou felt closer to your two confidants now that they were in on your big secret, and they were really encouraging to you. They kept pushing you to gain weight over the next 10 days as you found yourself starting to plump up ever so slightly. They made sure that you had plenty of snacks, and took you out to eat often. They also encouraged you to be lazier, and join them more in their video game sessions. You had to admit, that you were honestly loving not having to worry about what you ate or did, or making sure that you got enough exercise to keep the weight off.<br>\r\n<br>\r\n109 flashed at you as you stood on the scale in the bathroom.<br>\r\n<br>\r\nA smile flitted across your face as you stepped off the scale. You'd aimed for 3 pounds, but thanks to your two compatriots, you had definitely exceeded that goal. Your belly was definitely slightly softer than it had been, and you were definitely looking less toned. However, it wasn't really too noticeable yet to anyone but you. Though, part of you was slightly disappointed that you hadn't put on more weight before school. You had almost hoped that you'd be able to go into school today and turn heads as people saw the real you.<br>\r\n<br>\r\nYou put the scale away, making your way back to your room as you shut the door behind you. You glanced at your wardrobe, trying to decide what to wear.<br>\r\n</span></div></div>",
            "created":1536901200,
            "id":2547712,
            "title":"Confession"
        },
        "1451112":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Go stand up for the girl and help her get her things",
                "Wait for the cheerleaders to leave before helping",
                "Just keep on walking"
            ],
            "content":"<div class=\"\"><div> <span>Glancing at yourself in the antique stand-mirror in the corner of the room, you admired your slightly puffy belly. You could hear your mother cooking breakfast downstairs, as well as Tabitha working on getting ready for school as well next door. The smell of bacon was wafting from the kitchen as your stomach let out a gurgle. <br>\r\n<br>\r\nYou bit your lip, turning towards the wardrobe. You weren't very fat yet, or at all for that matter, but you had been gorging yourself lately, and you didn't really want everyone to see you walking around looking pregnant after you stuffed yourself with food. Finally deciding, you grabbed some of your looser clothes that you had picked up on one of your previous weight gain attempts. <br>\r\n<br>\r\nDoing up the dark jeans, you found them practically falling off of you as you moved to grab a shirt. Pausing, you looked closer at them and frowned. These weren't your jeans, these were Tabitha's, which would explain why they were so big on you. Giving them an experimental little tug, you grabbed a belt and cinched them up, too lazy to switch clothes at this point. Next you grabbed a dark blue shirt that hung loosely from your body. You had picked it up about a year ago when you'd started trying to gain weight before. That time you had managed to put on a whole 30 pounds before you changed your mind. That had been the heaviest you'd ever been, though hopefully you'd break that record this time.<br>\r\n<br>\r\nFinishing getting dressed, you gave a little twirl, admiring how you looked in the mirror. With a smile, you made your way downstairs where Tabitha was already loading up a massive plate of food. You mother was standing by the stove, the sizzling of bacon coming from a pan in front of her as the delicious smell filled the whole room. You grabbed a plate and loaded it high with food, piling it higher than Tabitha had as you plopped in your chair next to your chubby sister. <br>\r\n<br>\r\nYou quickly devoured your meal before going back for seconds. Your mother didn't say anything as you loaded up your plate, but she shot you a suspicious glance as you sat back down and resumed eating. By the time you were finished with breakfast, you were quite full as you left the kitchen slightly slower than you'd entered it. You'd eaten so much that even with the baggy clothes on you could see the faint hint of your belly tenting the fabric. No one would call you fat, but it was definitely noticeable to you.<br>\r\n<br>\r\nFinishing grabbing your things, you headed out to your car with Tabitha following behind. She was starting her first year at high school, and you had offered to give her a ride. At her suggestion, you stopped and got both of you an after breakfast snack from one of the burger places on the way, adding to your already stuffed belly. <br>\r\n<br>\r\nFinally, you arrived at school as you saw several students getting off one of the buses and heading into the large building. Finding a parking spot, you and Tabitha went your separate ways as you started heading towards class. You were just about to enter the building when you saw a couple of the cheerleaders picking on one of the fattest girls that you'd ever seen. They had knocked her books to the ground, and she was struggling to pick them up while her belly was getting in the way.<br>\r\n<br>\r\nShe looked like a freshman, which was probably why you didn't recognize her. She had long dark hair that came down her massive back. She had practically no chin from how fat she was, looking like her head had just been plopped down on top of a ball of lard. Just one of her arms was probably as big around as your waist. Her whole body jiggled with even the slightest movements. You could see a few tears on her face as the cheerleaders laughed at her struggle.<br>\r\n<br>\r\nYou bit your lip, as you watched the scene before you. Those girls were such jerks for picking on someone just for being fat. Still, you didn't want to really make waves. They'd probably turn their attention to you if you tried anything. Still, if this was any indication, you were probably in for some teasing at some point anyway once you started getting fatter. </span></div></div>",
            "created":1540616400,
            "id":2569271,
            "title":"Still Uncertain"
        },
        "14511121":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Tell her about wanting to get fatter",
                "Suggest that you like fat girls",
                "Keep quiet"
            ],
            "content":"<div class=\"\"><div> <span>You don't know why you did what you did, but the next thing you knew you were striding towards the small group of girls, your fists clenched. Forcefully, you pushed through the group of girls laughing at the one struggling to pick up her things, and started gathering up her books and supplies before turning towards the now silent group.<br>\r\n<br>\r\n\"Come on, don't you have to be doing somersaults or something?\" you shot.<br>\r\n<br>\r\n\"Uh, why don't you just, like, mind your own business.\" shot the one that was obviously the leader. She was slightly taller than the others, and was thin as a rail. Her blond hair seemed perfectly styled, and she looked at you like one would an annoying bug.<br>\r\n<br>\r\n\"Yeah, nerd. She started it.\" shot one with curly dark hair. Her face was caked with make-up but you could still see the scars from some horrible acne she must have went through.<br>\r\n<br>\r\nYou felt your heart pounding and your blood boil, \"And what did she do?\"<br>\r\n<br>\r\n\"The fat tub of lard had the audacity to talk to me. Like, she needs to learn her place.\" Said the leader, \"Though, like, it seems she's not the only one.\"<br>\r\n<br>\r\nNext thing you knew, you were hitting the lockers behind you as she gave you a firm shove. You shook your head, trying to get your bearings as they laughed at you.<br>\r\n<br>\r\n\"What's the matter? Didn't you ever learn how to stand up like a big girl?\" The blond girl smirked. <br>\r\n<br>\r\nYou were just about to respond when the bell rang for class.<br>\r\n<br>\r\n\"We'll settle this later.\" The blond girl said as she started leading the group towards the gym.<br>\r\n<br>\r\nYou felt an arm on your shoulder, holding you back from chasing after them, \"Hey. They're not worth it.\"<br>\r\n<br>\r\nYou took a deep breath and turned towards the obese girl, who was wiping away a tear with her other hand. Now that you were closer, you could tell just how big she really was. She was easily over 300 lbs, maybe 400. Her face was round and youthful,  with bright green eyes. Her shirt, which seemed a little small on her, probably could have easily been a full length dress on you. You could see a the bottom of her stretch-marked belly sticking out of her shirt. Her jeans weren't done up, though they still looked tight on her, hugging closely to her large thighs. You couldn't help but feel aroused looking at the massive girl, and wondering what it would be like to be that fat.<br>\r\n<br>\r\n\"Are you okay?\" you asked, helping her pick up the rest of her things.<br>\r\n<br>\r\n\"Yeah. I'll be okay. I'm actually kind of used to that happening. I've always been the fattest kid in school.\" she said, patting her massive belly, \"I just can't help it. I love to eat. Anyway, do you know where room 201 is? That's my first period.\"<br>\r\n<br>\r\nYou smiled, \"Yeah, that's mine too. I can show you where its at.\" you said as you started leading her down the emptying hallway, \"So is this your first day here?\"<br>\r\n<br>\r\n\"Yeah. I was hoping high school would be different, but I guess that was unreasonable.\"<br>\r\n<br>\r\n\"Don't worry. Not everyone is like that.\" you said, glancing at her large belly.<br>\r\n<br>\r\n\"Yeah, I know I'm huge.\" she said, catching your gaze, \"and it's all self inflicted. I don't even have any medical conditions to blame it on. I've just always loved to eat, and never really saw a reason to work on losing this.\"<br>\r\n<br>\r\n\"Oh, uh, I, uh, I didn't mean to stare.\" you mumbled.<br>\r\n<br>\r\n\"Honestly, it's okay. I'm happy with my body, and the mocking by a few people is a small price to pay to enjoy myself.\" she said as you stopped in front of room 201, \"Anyway, how about I treat you to lunch for helping me out?\"<br>\r\n<br>\r\n\"Alright.\" you said, as you entered the room with her.<br>\r\n<br>\r\nAfter deciding on a place to meet, and exchanging names, you took your seat and watched Lana, that was the fat girl's name, try to take her seat at her desk. You were surprised the small desk could even support the massive girl's weight as she tried to squeeze into the small space. Her thighs squished against the bottom of the desk, and it seemed she could only get half her butt on the chair. Her belly was covering almost half the writing surface as she finally settled into her spot. <br>\r\n<br>\r\nClass was fairly boring, with the teacher mostly just going over the things they were going to learn about that year. You spent most of the period admiring the massive girl you'd saved earlier. You kept imagining that was you struggling to fit in your desk as your fat body made it almost impossible. You rubbed your legs together, feeling yourself getting extremely aroused as you watched the massive girl struggling to do even the simplest of tasks. What would it be like to get that fat? Would you ever let yourself get that fat? Could you even get that fat?<br>\r\n<br>\r\nYou shivered in your seat as you brought yourself to orgasm. You glanced around, your face turning red as you hoped no one had noticed you getting off to thoughts of being as big as Lana. Fortunately, it seemed you'd been discrete enough since no one was paying you any mind. You couldn't believe you'd actually brought yourself to orgasm in class. You just couldn't seem to get Lana out of your thoughts as the bell rang to signal the end of the period.<br>\r\n<br>\r\n You discovered that Lana also shared your second period, which was a cooking class, as she followed you to your next destination. You were excited to hear that you were going to be doing a lot of baking and sampling the treats, since that would definitely help you gain weight. It seemed that excited Lana too, since she was eagerly licking her lips as the teacher went over everything that they were going to make in class. As the period went on, you found yourself almost as excited as her for what was to come. In that moment, you didn't care if you got as fat as Lana as long as you got to enjoy all the sweets and treats you were going to be making.<br>\r\n<br>\r\n Finally, the bell rang signalling the start of lunch, and not a moment too soon. You were starving, and after all the talk of food, you didn't care what happened to your body as long as you got to stuff yourself for lunch. You and Lana slowly began making your way towards your car, the fat girl struggling to keep up with your slow pace. By the time you made it, Lana was huffing and puffing.<br>\r\n<br>\r\n\"Why'd you have to park so far away?\" she teased, plopping into the passenger seat, causing the whole car to shake.<br>\r\n<br>\r\nLana took you to a great all you can eat place where you both gorged yourselves on tons of food. You hadn't planned on pigging out in front of people, but you figured if anyone wouldn't judge you, it would be Lana. Lana was very open with her love of food, and spent most of the time talking about how she actually really liked being fat. She admitted that she hadn't always been this fat, but when she was about 8 she had decided that she wanted to gain some weight. Her parents had been pretty supportive, thinking that it was just a phase she was going through. However, even after they realized that she was just going to keep ballooning up, they were supportive of her. They made sure she had plenty of money for food, and had even let her try some meds she'd found online to help her slow her metabolism down. By the time she was nine she had gained almost 50 pounds, and it just kept going up from there. Now she was about 400 lbs, and she didn't regret it.<br>\r\n<br>\r\nFinally, she started asking you about what kind of body you were interested in. You'd just met, but you felt so comfortable around her. Still, maybe you should keep your fetish to yourself. It wasn't like you were that comfortable with your body yet.</span></div></div>",
            "created":1540702800,
            "id":2569818,
            "title":"Guardian Angel"
        },
        "145111211":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Wear Lana's Jeans",
                "Cut session off early and go home to get a change of pants",
                "Make do with what you got"
            ],
            "content":"<div class=\"\"><div> <span>You sat, thinking for a minute while you let your food settle in your belly. Despite how full you were, the savory smells around you were tempting you to return for more food. Lana sat across from you, her head tilted slightly to the side while she waited for your response. You bit your lip, listening to the sounds of dishes and other people around you while you tried to decide what to say. <br>\r\n<br>\r\nShe'd been extremely open with you about her desire to be fat. Still, it felt weird talking about your deepest secret with someone you'd just met today. <br>\r\n<br>\r\nYou took a deep breath, deciding it couldn't hurt to tell her, \"Well, I, um, I actually want to be fat too.\"<br>\r\n<br>\r\n\"Really,\" Lana said, looking skeptical, \"though I guess that would explain why you can't seem to keep your eyes off my belly.\"<br>\r\n<br>\r\n\"I've always been fascinated with fat girls, and I always wanted to be one, but I've never had the confidence to actually go for it.\" you continued, finding it getting easier now that you'd admitted it, \"I actually tried a few times to gain weight, but I never got really far.\"<br>\r\n<br>\r\nYou looked at your plate, feeling your face burning at your confession to almost a complete stranger. Still, she'd asked about your body preference. The silence stretched on as she just looked at you with a thoughtful expression.<br>\r\n<br>\r\nYou almost jumped as she finally spoke, \"Really? You're not just trying to make me feel better?\"<br>\r\n<br>\r\n\"It's the truth.\" you mumbled, \"I spent all first period fantasizing about what it would be like to be as fat as you.\"<br>\r\n<br>\r\nLana sat there for a moment before responding, \"Well, if you really want to gain weight, I'd be more than happy to help you. I've learned a ton about how to get fat, and it might help you. And if you really want to get fat, I still have a few products you can try. Though, I wouldn't recommend them if you aren't sure about getting fat, since once you take them it will make it almost impossible for you to lose weight.\"<br>\r\n<br>\r\nOnce Lana realized that you were serious, she began giving you all sorts of tips to get fat quickly. Though, all too soon it was time to return to school. The obese girl was all too eager to answer your questions as you made the short drive back to the school. At the massive girl's recommendation, you parked as close to the building as you could.<br>\r\n<br>\r\n\"See, if you want to be a fat girl, you have to start acting like a fat girl. Act like you're 200 lbs heavier than you are now, and soon, you won't have to imagine.\" She said, slowly climbing out of the vehicle, \"If you act like you're fat, you'll become fat.\"<br>\r\n<br>\r\n\"Makes sense.\" you said, closing the car door and starting to walk towards the school with the massive girl. <br>\r\n<br>\r\nYou smiled as you looked at the way her massive body moved. You had discovered that you both had exactly the same schedule, which meant you'd get a lot of time to admire the large girl. It was hard, but you tried to slow yourself down to her pace instead of making her rush to keep up with you. You decided that if you wanted to gain weight, you should probably just mimic Lana, since she was an excellent example of being fat.<br>\r\n<br>\r\nThe rest of the day went by without too much incident as you and Lana chatted off and on throughout the day. Despite just meeting the fat girl today, you were already starting to really like her. She was everything you'd always wanted to be, and she wasn't even done growing. <br>\r\n<br>\r\nLater, you and Tabitha spent the evening playing video games and snacking. Your mother made a big dinner, which you ate as much of as you could.<br>\r\n<br>\r\nThe next couple months were almost the same every day. A large breakfast, then school where you spent most of your time with Lana. She'd take you out to eat at the fattiest places she could think of for lunch. After school you'd spend most of your time working on homework or video gaming while snacking. Occasionally, you'd hang out with Jill and go binge on a fatty dinner. All the while you noticed your belly slowly starting to bulge. It was getting harder and harder to hide the fact you were gaining weight. At first it was just a slight bulge in your belly. Then you noticed that your face was starting to look a little more round. Then you noticed that your clothes seemed a bit tighter than they used to be. Your breasts were also starting to bulge more as you added more fat. Your muscles were also disappearing beneath a thin layer of fat.<br>\r\n<br>\r\nYou sucked in your belly, struggling to do up your jeans as you got ready for school. You could hear bacon sizzling in the kitchen, and your stomach was eager to partake. You'd weighed yourself that morning as 131 lbs, officially making you the fattest you'd ever been. You still weren't exactly fat, but you were definitely starting to look chubby. Finally getting the button done on your pants, you threw on the shirt that you'd worn your first day of school, surprised at how much better it was fitting now that you were starting to get chubbier. <br>\r\n<br>\r\nYou devoured the large meal your mother had made you before finishing getting ready for school. Once you were ready, Tabitha joined you in the car and you headed to school. You met Lana and made your way to class, matching the obese girl's speed as you tried to conserve your energy. Class was fairly boring, though you did make delicious cookies in your cooking class. Finally, it was time for lunch.<br>\r\n<br>\r\nYou and Lana went to the all you can eat place and began devouring the food. As you were just about to get your fourth plate, you heard a slight pop, and your jeans instantly felt looser. You glanced down, and felt your heart drop as you realized that your button had popped off. You just sat there, wondering what to do.<br>\r\n<br>\r\n\"Oh, looks like you popped your first button.\" Lana said casually, \"I do that all the time. If you want, I can lend you the spare jeans I've got in my bag.\"<br>\r\n<br>\r\n\"You keep spare jeans?\" you asked.<br>\r\n<br>\r\n\"Yep, ripping one pair in public is all it takes to convince you to always keep a spare handy.\" she chuckled.<br>\r\n<br>\r\nYou were sure that they'd be way to big for you, but at least you'd have some jeans. The other option was to cut your eating session short and go grab another pair from your home. Of course, you could also just make do with the jeans that you had now and hope no one noticed at school.</span></div></div>",
            "created":1540702800,
            "id":2569940,
            "title":"Another Ally"
        },
        "1451112111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Ignore the girls, and push past them with Lana",
                "Defend Lana verbally",
                "Punch the leader"
            ],
            "content":"<div class=\"\"><div> <span>You sighed, biting your lip, \"I guess I can wear your pair. At least then I won't have to worry about popping another button today.\"<br>\r\n<br>\r\nLana smiled, reaching for her bag, she opened one of the side pockets and pulled out a large pair of pants, \"Here you go, I think I might have a belt you can borrow.\"<br>\r\n<br>\r\n\"I don't think I've ever seen you wear a belt.\" you said, grabbing the pants and the large belt.<br>\r\n<br>\r\nShe chuckled, \"I used to wear a belt quite a bit because I'd buy my pants several sizes larger than I needed so that I could grow into them, and I'd wear the belt while they were still too big.\"<br>\r\n<br>\r\n\"Makes sense,\" you said, starting to make your way towards the restroom.<br>\r\n<br>\r\nYou were glad that the restroom was single occupancy so you wouldn't have to worry about anyone walking in while you were changing your pants. You shivered slightly as you removed your bottoms, exposing your legs to the cool air. The sounds of the restaurant were muffled in the small room, as the sounds of your movement seemed to echo around the tiled room. You were doing your best not to breath through your nose as it wasn't exactly the best smelling room you'd ever been in. The lilac air freshener didn't do much to mask the smell of a bathroom that probably didn't get cleaned as much as it should. <br>\r\n<br>\r\nYou frowned as you held up the large jeans. They were so large you could easily fit both of your legs into one of the jeans. Still, it was better than walking around with your underwear showing because you couldn't do up your pants. And at least this way, you could go back to eating once you were finished changing. <br>\r\n<br>\r\nPulling on the pants, it almost looked comical how big they were on you. All you could think of was a clown wearing the over large pants, except instead of suspenders, you had a belt which was cinched up almost as tight as it would go. It really put it into perspective just how much bigger than you Lana was. Of course it also didn't help that she was about 6 inches taller than you either. <br>\r\n<br>\r\nYou rolled up the pant legs until they were no longer dragging on the floor, examining yourself in the mirror. The pants looked massive on you, but it was better than the alternative. You didn't want anyone at school seeing your pink panties. Your shirt hung down just below the belt, tenting slightly away from your waist thanks to your chubby belly. It was almost impossible to hide the fact that you'd been putting on weight with your current wardrobe now. It was probably about time to go clothes shopping again.<br>\r\n<br>\r\nTaking one last look at yourself in the mirror, you strode back into the main part of the restaurant and proceeded to load up on more food. You were still somewhat self conscious about the fact that you were wearing pants that were far too big for you, but at least they were more comfortable as you stuffed your belly with food. <br>\r\n<br>\r\nAll too soon it was time to return to school. You'd thrown out your old jeans in the garbage in the restroom since you weren't exactly planning on fitting in them again anytime soon. You followed your massive friend to your car, watching her body jiggle and sway with each step she took. Her thighs rubbed together sensually and her butt had a very prominent sway to it. You watched as she slowly lowered herself into the passenger seat of the car. Her side of the car sunk by several inches under her weight, as you got into the drivers seat. Her belly was almost touching the dashboard, and you couldn't help thinking that she probably wouldn't ever be able to drive. By the time she was old enough, she'd probably be too fat to fit in the driver's seat.<br>\r\n<br>\r\nYou took a deep breath, trying to control your arousal as you started the car. Though it was proving to be quite difficult as she'd pulled up her shirt and was massaging her swollen belly. You licked your lips, wondering what it would be like to be that large. You glanced down at your own chubby belly, which paled in comparison to your massive compatriot. <br>\r\n<br>\r\n\"We probably should get going.\" Lana said, still massaging her belly, \"We don't want to be late for class.\"<br>\r\n<br>\r\nYou shook your head, steering the car out of the parking lot. You found yourself chewing on your lip as you tried not to look at the obese girl beside you. You had never really thought you'd get that fat, but you had to admit that you were fascinated with Lana. She was fairly confident, despite the tears she'd shed the first day you'd met her. She loved her body, and was enjoying letting herself get fatter. She claimed she wasn't particularly trying to gain right now, but her eating habits tended to cause her to gain anyway. Though it was easy to see why, since her eating habits were starting to rub off on you, and you were definitely gaining weight. You were still only borderline chubby, but you definitely weren't skinny anymore. <br>\r\n<br>\r\n\"Hey, is something the matter?\" Lana said as you pulled into the school parking lot, \"You've been really quiet since we left the restaurant.\"<br>\r\n<br>\r\nYou looked at the massive teen, feeling yourself growing moist just thinking about how big she was, \"Sorry, just a lot on my mind.\"<br>\r\n<br>\r\n\"I know they're a little big on you, but they don't look that bad.\" she said patting your leg.<br>\r\n<br>\r\nYou tried to conceal a shiver of excitement as she patted your thigh, and you felt goosebumps forming on your arms and legs, \"Yeah, you're right.\"<br>\r\n<br>\r\n\"I'll tell you what, you can even keep them.\" she teased, opening the car door, \"I've got plenty of other pairs, and who knows, they might fit you someday.\" <br>\r\n<br>\r\nYou got out of the car, and started following Lana into the school, \"Are you sure?\"<br>\r\n<br>\r\n\"Yeah, that's what friends are for.\"<br>\r\n<br>\r\n\"Thanks!\" you said, raising your voice above the din in the hallway.<br>\r\n<br>\r\nSuddenly someone stepped in front of you, blocking your path. You stopped, taking in the three girls in front of you, feeling your heart sinking. <br>\r\n<br>\r\n\"Look, the two whales are sharing clothes now.\" smirked the tall blond girl, \"What's the matter? Don't your clothes fit you anymore?\"<br>\r\n<br>\r\nYou felt your face go red as the three girls laughed. You could tell that several of the other students were taking notice of the scene that was starting to form.<br>\r\n<br>\r\n\"Just ignore them.\" Lana said, coming to stand beside you.<br>\r\n<br>\r\n\"Oh look, the whale can speak. I thought it was too fat to use its mouth for anything besides eating.\" The blond girl said, cocking her head to one side.<br>\r\n<br>\r\nYou could see Lana clenching her fist, as she took a step towards the three girls.<br>\r\n<br>\r\n\"Careful, it looks like it wants to squash us,\" said one of the dark haired girls.<br>\r\n<br>\r\nThe three of them laughed, as the blond one took a step forward, \"Well it'd have to be able to catch us first.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1540789200,
            "id":2570264,
            "title":"Things to Come"
        },
        "14511121111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Can't think of anything so you tell the truth",
                "Claim something spilled on your jeans and so you'd borrowed these",
                "Claim they got ripped by three bullies on the cheer-leading squad"
            ],
            "content":"<div class=\"\"><div> <span>You took a step forward, grabbing Lana's warm wrist, \"It's not worth it. Come on.\"<br>\r\n<br>\r\nYou shouldered your way through the athletic girls, almost gagging on the overwhelming smell of their perfume as you lead Lana towards your class, while they continued to laugh and taunt you, \"Someone really needs to teach those three a lesson.\"<br>\r\n<br>\r\n\"I agree.\" you said, trying to get your own temper under control, \"but we aren't going to win in a fight against them in the hallway. Besides, the principal loves them, so we'd probably be the ones who got in trouble.\"<br>\r\n<br>\r\nYou released Lana's wrist as you entered the classroom, both of you taking your seats and lowering your voices, \"You're right, but we have to do something or they'll just keep harassing us.\"<br>\r\n<br>\r\nMost of the students were still talking in hushed tones as they waited for class to start. Even when you'd been thinner and not openly gaining, you'd never really been apart of any of the small groups standing and sitting around the room. Your mouth salivated as you caught the scent of cake coming from the cooking classroom below you, reminding you of how delicious yours had been, almost distracting you from your conversation.<br>\r\n<br>\r\n\"Like I said, I agree. But we need to be smarter than them.\"<br>\r\n<br>\r\n\"That's not hard, a bag of rocks is probably smarter than the three of them together.\"<br>\r\n<br>\r\nYou chuckled slightly, glancing at the teacher as he started writing some things on the board, continuing in a whisper, \"They're used to always getting their way. We need to show them that they can't have their way with us.\"<br>\r\n<br>\r\n\"Do you have any ideas?\"<br>\r\n<br>\r\n\"No, but I'll think about it.\"<br>\r\n<br>\r\nYou turned your attention to the lesson, though your mind quickly began to wander as the teacher droned on in the warm classroom. Even with it getting colder outside, the ovens in the room below helped to keep this room especially warm and comfortable. You tried to think about what you could do to those three that would get them to stop teasing you for good. They were definitely more athletic than both of you, so you couldn't really beat them at anything physical. On top of that, the principal loved them. He always turned a blind eye to their mischief. If you were going to do anything to them, you first needed to get the principal to acknowledge that they were stuck up brats. Though, that was easier said than done.<br>\r\n<br>\r\nYou and Lana stayed fairly quiet the rest of the class, both of you lost in thought. When the bell rang for the end of class, you grudgingly made your way into the cooler hallway, shivering slightly. You and Lana didn't talk much as you made your way through the noisy hallways. You both stayed quiet as you took your seats in your last class, hardly focusing on the lesson as you continued thinking about how to get your revenge.<br>\r\n<br>\r\n By the time school was over, you still had no idea of how to get back at the three girls. Still, you knew you needed to do something. The two of you left the classroom behind everyone else. You'd learned that Lana was never in a hurry to get anywhere, and often just let everyone else go first. Though you couldn't really blame her with all that weight she was carrying around.<br>\r\n<br>\r\n\"I've got nothing.\" Lana said, as you walked with her towards her bus, \"We need to learn more about them if we're going to hit them where it hurts.\"<br>\r\n<br>\r\nYou threw your head back, staring at the darkening autumn sky. Even though it wasn't even four yet, the days were starting to get dark, signally that winter was just around the corner. Despite the crisp air that was giving you goosebumps, Lana seemed to be sweating. You kicked at the multicolored leaves on the ground as you walked, listening to the rustle of your footsteps mixing with Lana's heavy steps. You took a deep breath, smelling the wonderful fall scents. You caught the scent of fresh cookies mingling with the leaves, carried to you on the chill breeze. <br>\r\n<br>\r\n\"Me neither,\" you finally said, stopping in front of the entrance to the bus, while Lana lifted her legs onto the first step with some effort.<br>\r\n<br>\r\n\"Well, I guess I'll see you tomorrow.\" Lana said, huffing from exertion.<br>\r\n<br>\r\n\"You know, if you ever want, I can give you a ride home.\" You said as she reached the top of the stairs.<br>\r\n<br>\r\n\"Maybe I'll take you up on that offer sometime. And I can introduce you to my family.\" she said through her panting breaths.<br>\r\n<br>\r\nYou chuckled, \"Sounds good.\"<br>\r\n<br>\r\nYou waved goodbye as you turned to start making your way towards your car. You wrapped your arms around yourself as you shivered. You really should start bringing a jacket. Though, you should probably make sure your jacket actually fits you. Actually, you should probably go through most of your clothes and see what still fits you. <br>\r\n<br>\r\nTabitha was already waiting at the car when you arrived, bundled up in a black jacket, which bulged around her chubby belly, \"Took you long enough.\"<br>\r\n<br>\r\n\"Sorry, I was walking Lana to the bus.\" you said, unlocking the car.<br>\r\n<br>\r\n\"You've been spending so much time with Lana, I'm beginning to wonder if there isn't more going on. Tabitha laughed as she plopped into your car.<br>\r\n<br>\r\nYou felt your face go red, \"What do you mean?\"<br>\r\n<br>\r\n\"You know what I mean. You're always staring at her, admiring her body. And you always are hanging out with her at school and going to lunch together.\" Tabitha said, adjusting her seat.<br>\r\n<br>\r\n\"We're just friends, if that's what you're implying.\" you said, turning your blushing face away from your sister.<br>\r\n<br>\r\n\"Oh, so that's why you're wearing her pants.\" Tabitha laughed.<br>\r\n<br>\r\nTabitha continued to tease you most of the ride home, as you did your best to deflect her prying questions. Still, it got you thinking. Maybe you did like Lana as more than just a friend. Though you didn't even know if Lana swung that way. You didn't even know if you swung that way. It was something you hadn't really given much thought. You'd always thought boys were pretty good looking, but you also found yourself attracted to Lana in a way that you were pretty sure went beyond just friendship.<br>\r\n<br>\r\nYou opened the front door, thankful for the warm air that quickly enveloped you as you stepped into the hallway. You could smell something savory coming from the kitchen, though you couldn't quite tell what it was. Your mother poked her head around the doorway from the kitchen.<br>\r\n<br>\r\n\"Welcome hom- Heather! Where are your jeans?\" She said, rushing towards you.<br>\r\n<br>\r\nYou felt your face flush. You'd completely forgotten that you weren't wearing your jeans, and that you'd borrowed Lana's. Still, you didn't want to invoke a lecture about gaining weight by admitting that you'd burst your button. You needed to think of something quickly.</span></div></div>",
            "created":1540789200,
            "id":2570281,
            "title":"Plotting your revenge"
        },
        "145111211113":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Go to Lana's after school",
                "Go shopping with your mom after school",
                "Ask Lana if she wanted to come clothes shopping with you and your mom"
            ],
            "content":"<div class=\"\"><div> <span>You glanced at Tabitha as she stepped into the house, confused as to the tense situation. Suddenly, a thought crossed your mind on how to kill two birds with one stone. At least for the moment. You didn't generally like other people to fight your battles, but right now you needed more time to think of how to really get your revenge. Hopefully, this didn't come back to bite you.<br>\r\n<br>\r\nSummoning all your effort into trying to cry a little, you looked your mom in the face, \"I was defending a girl at school from some bullies and they shoved me, and my jeans got caught on an open locker and ripped, and so the girl let me borrow an extra pair of jeans she had for standing up for her.\"<br>\r\n<br>\r\nYou stood there, a single tear rolling down your cheek as you watched your mother, hoping that she would believe you. Tabitha had moved off to the side, and was attempting to keep a straight face at your bold lie. Well it was only partially a lie. You had stood up to some bullies in defense of Lana, but that wasn't how your pants had ripped. <br>\r\n<br>\r\n\"Oh, I'm so sorry! That was really brave of you to stand up for that girl! Who were the girls?\" your mother asked, placing her arm around your shoulder.<br>\r\n<br>\r\nYou did your best to sound like you were trying not to cry as you responded, \"Three girls on the cheerleading squad. I don't know their names though.\"<br>\r\n<br>\r\n\"Well, that is unacceptable. Something needs to be done to those girls. I'll call the principal first thing in the morning. And tomorrow after school, we can go to the mall and pick you up some new clothes.\" She said, leading you into the kitchen where it looked like she was just finishing dinner.<br>\r\n<br>\r\n\"Alright. I didn't want to get anyone in trouble.\" you lied, taking your seat at the table as your mother loaded up an unusually large portion of food for you.<br>\r\n<br>\r\n\"Well. I'm glad that you told me. This needs to be taken care of.\" She said, placing the plate in front of you, \"Now eat up. I'm sure you're hungry, and maybe some delicious pasta will make you feel better.\"<br>\r\n<br>\r\nTabitha walked past you and loaded up large plate of food before moving to sit down at her spot, as your mother shot her a glare. The food was delicious, and you quickly cleaned your plate and got seconds. You had to do your best to keep a straight face as Tabitha kept looking at you and shaking her head as she snickered to herself. She knew the truth since you'd told her in the car, but she wasn't going to say anything. <br>\r\n<br>\r\nAfter dinner you made your way to your room, grabbing an armful of snacks on your way out of the kitchen. You closed your door behind you as you turned on the TV in your room, and booted up your gaming console. You had finished all of your homework in class, and so you had plenty of time to just relax tonight. You moved in front of your stand mirror, smiling slightly at what you saw.<br>\r\n<br>\r\nYour shirt was definitely starting to get tighter on your body, especially with your food baby. The jeans you were wearing still looked massive on you. You shivered despite the warmth in the room as your hand brushed your crotch, the denim teasing your slit. Your other hand tickled your slight double chin, feeling the softness that was starting to form under your face. <br>\r\n<br>\r\nYou had been so nervous about gaining weight before school started, and honestly, you were still uncertain about how big you wanted to get, but you didn't regret the weight that you'd gained so far. You pushed your belly out, seeing how big you could make it look as your shirt rode up slightly, tightening around your middle. Lana was so big and beautiful in your eyes, but you didn't know if you could bring yourself to get that big. After all, once you were that big it would probably be almost impossible to lose the weight. Still, like Lana, you hadn't really been trying to gain weight as quickly as you were, but mimicking her lifestyle definitely seemed to lead to that result. Honestly, it was starting to become harder not to gain weight as you became lazier and started indulging yourself more often. Maybe you'd just enjoy yourself and see where it took you. <br>\r\n<br>\r\nYou nodded to yourself, deciding that was what you were going to do. You stripped down to your underwear, taking one last look at your fattening body before moving towards the TV and started gaming. You continued to snack as you played late into the night, before finally retiring to bed. Sinking into a deep sleep in the soft comfort of your mattress, you slept soundly all night. Only waking when your alarm went off.<br>\r\n<br>\r\nYou stretched, enjoying the soft patter of rain on your window as you lay in bed. You could smell something cooking in the kitchen that made your stomach gurgle in anticipation and your mouth start salivating. You pulled your quilt closer to you, trying to stave off the cool morning air.<br>\r\n<br>\r\nAfter a few minutes you pulled yourself out of bed, and started getting ready for school. Your mother had made another large meal for you, almost insisting that you needed to eat more as she shoved a third plate at you. You weren't sure what had come over her, but you weren't complaining. Finally, you and Tabitha left for school, feeling almost uncomfortably full from your massive breakfast.<br>\r\n<br>\r\n\"So, you still want to get fatter?\" Tabitha asked, looking at her own full belly.<br>\r\n<br>\r\n\"I think I'm just going to enjoy myself. If that means that I get fat, then okay.\" you said, glancing at your chubby sister, \"Honestly, I don't want to feel like I have to get fat, because then it just becomes a chore.\"<br>\r\n<br>\r\nTabitha laughed, \"You're starting to understand. Most people get fat because they're happy, not because they're trying to get fat.\"<br>\r\n<br>\r\n\"Yeah. I think I am starting to get that.\" you mused.<br>\r\n<br>\r\nThe two of you rode the rest of the way in relative silence, broken only by the rain on the car and the windshield wipers every few moments. Finding a parking spot near the entrance to the building, you and Tabitha split up to go to your respective classes as you took one last look at the overcast sky before stepping inside where Lana was waiting for you.<br>\r\n<br>\r\n\"Hey!\" she said, walking beside you as you both made your way towards first period.<br>\r\n<br>\r\nThe hallway was rather crowded as most of the students choose to hang out inside today, and there was a louder than normal buzz as numerous people had conversations with each other. You almost didn't hear the bell to get to class over the hubbub in the school. Still, it wasn't like you were really in a rush since you had plenty of time to get to class. <br>\r\n<br>\r\n\"I was wondering if you wanted to come over after school.\" Lana surprised you as you both entered your first class, \"I was thinking it was time to show you where I live.\"<br>\r\n<br>\r\nYou stopped, looking at Lana for a few moments. You knew that your mother wanted to take you shopping tonight, but you were sure she would understand if you decided to hang out with Lana instead. </span></div></div>",
            "created":1540789200,
            "id":2570345,
            "title":"Sowing Seeds"
        },
        "1451112111133":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Get a couple sizes larger",
                "Get several sizes larger",
                "Get the biggest clothes you can find"
            ],
            "content":"<div class=\"\"><div> <span>\"Actually, I was going to ask if you wanted to come clothes shopping with me and my mom after school. I need some new clothes since I've been gaining weight.\" the words were out of your mouth before you even realized what you were saying. <br>\r\n<br>\r\nYou felt your face heating up as Lana just looked at you for a second, finally she smiled, \"I'd love to!\"<br>\r\n<br>\r\n\"Great! You can just come home with me and Tabitha after school, and I can drop you off at home later.\" You said, coasting towards your seat with Lana following closely. <br>\r\n<br>\r\n\"Sounds good.\" Lana said, plopping heavily into her desk as she tried to adjust her fat to be more comfortable.<br>\r\n<br>\r\nThe teacher stood up in front of the class and started talking about some theorem or another, though you found it hard to concentrate as he droned on. You were glad the class was a little on the cool side or you might've been tempted to fall asleep as you mulled over what you'd done.<br>\r\n<br>\r\nYou hadn't planned on asking Lana to join you, but you hadn't wanted to hurt her feelings by declining her offer. You really did need new clothes if the fact that Tabitha's jeans were starting to fit you better was any indication. Still, you probably should've asked your mother if it was okay. You were pretty sure it would be, though you weren't sure how she would react to seeing the size of your new friend. If she thought Tabitha was starting to get fat, then she was going to think she was staring at a whale when she saw Lana. It might scare her into being stricter about trying to stay thin if she thought you might end up like her. <br>\r\n<br>\r\nThese thoughts continued as your first class ended and you made your way through the noisy halls towards your cooking class. Lana had to push you out of the way of several crowds of people as you walked, hardly paying attention to what was going on around you. <br>\r\n<br>\r\nYou were glad that the dessert you were making in cooking class proved to be especially difficult since it helped you to keep your mind off of the anxieties that were plaguing you about the future. When you were done, you devoured your dessert, savoring the sweetness as you contemplated what it would be doing to your waistline. <br>\r\n<br>\r\nAt lunch, you did your best to stuff yourself to your absolute limit, trying to make sure that your belly was nice and stretched for when you went clothes shopping. Hopefully, it would make you seem a few sizes bigger and give you some more time before you had to buy clothes again. Though a lot of that would depend on how quickly you put on weight. It seemed like you were starting to put on weight quicker and quicker lately as you started getting lazier and stuffing yourself more. <br>\r\n<br>\r\nThe last two classes flew by as the end of the day approached. It was still raining when school let out. You and Lana met up with Tabitha on your way to your car, Lana slowing the group down considerably with her slow pace, though it was getting easier to match her pace and not rush as much. You were glad when Lana and Tabitha discovered that they had a lot in common and started bonding. At Lana's request, the three of you stopped to get some food on the way home. All of you stuffed yourselves on the greasy, fattening food until you were sure that you'd burst if you took another bite. <br>\r\n<br>\r\nFinally, it was the moment of truth. You'd texted your mother during lunch to let her know that Lana would be coming with you tonight, and she'd said it was okay. Still, hopefully she didn't act too embarrassing around your massive friend. You closed the car door, and made your way through the cold rain towards the front door. It opened with a click as you stepped inside. You breathed a sigh of relief as you stepped into the warmth of the house, smelling something delicious coming from the kitchen. <br>\r\n<br>\r\nYour mother stepped out of the kitchen, taking in the three of you as Lana closed the door behind her, \"Oh, you must be Lana! I'm Heather's mom! It's so nice to meet you!\"<br>\r\n<br>\r\nLana smiled as your mother strode forward to shake her hand, a warm smile on her face, \"Thanks for letting me come.\"<br>\r\n<br>\r\n\"Of course. I'm so happy to see Heather making friends. Anyway, I hope your hungry because I thought I'd make us all lunch before we went to the mall. Got to make sure my growing girls get enough to eat.\" She hadn't even finished speaking as she stepped back into the kitchen, signaling them to follow her.<br>\r\n<br>\r\nThe three of you followed the delicious smells towards the kitchen. Your eyes went wide as you took in the huge feast before you. Your mother quickly shoved a massive plate into your hands, loaded with food. You and Tabitha looked at each other, both of your faces mirroring the confusion you felt. It was really starting to seem like your mother was actually trying to fatten you up now. Still, you weren't going to turn down delicious food. <br>\r\n<br>\r\nDespite having just stuffed yourselves at the restaurant, you couldn't help but load up on the delicious food your mother had made. It was so addicting. It almost felt like you were getting hungrier as you ate. By the time the three of you were finished with the massive meal, your shirt was struggling to cover all of your bloated belly. Lana leaned back in her chair, which creaked dangerously at the large girl. Even Tabitha seemed larger than normal after the meal. <br>\r\n<br>\r\nAfter hardly any time, your mother had you and Lana in her vehicle and you were heading towards the mall, \"Well, I guess I know who Heather borrowed those jeans from yesterday.\" your mother said after riding in silence for a while.<br>\r\n<br>\r\n\"Yeah, I guess it is kind of obvious.\" Lana chuckled, rubbing her swollen belly.<br>\r\n<br>\r\n\"You must have a big appetite, as a girl your age should.\" Your mother said.<br>\r\n<br>\r\nYou could help but notice that your mother seemed to be having a hard time keeping her eyes off of Lana's belly. And it wasn't in the disgusted way either. It almost seemed like she was excited at how big Lana was. Though, that was strange considering how firm she usually was about staying thin. Now that you thought about it, she had been looking at you in about the same way since you showed up in Lana's pants. It was almost like anticipation.<br>\r\n<br>\r\n\"Yeah, my parents are really good about making sure I get enough to eat.\" Lana said, relaxing in the seat.<br>\r\n<br>\r\n\"It's nice to see a girl who gets enough to eat.\" Your mother said, almost to herself, \"It would be good if my daughters had your appetite.\"<br>\r\n<br>\r\nThe three of you rode the rest of the way in silence. Your mother had brought umbrellas, though Lana seemed to be too big to fit under hers. Still, it did provide her a little reprieve from the chilly deluge. You made your way into the crowded mall, looking around at the numerous shops that lined the walls. <br>\r\n<br>\r\nYou were surprised when your mother led the way to a plus size store. You knew you were getting chubby, but you didn't think that you'd quite reached the point where you needed this place. Most of the outfits looked like they'd be too big for your body right now. <br>\r\n<br>\r\n\"This is where I usually do my shopping.\" Lana whispered to you as you walked through the many displays, \"Though, honestly I think they might be too big for you right now.\"<br>\r\n<br>\r\n\"Me too.\"<br>\r\n<br>\r\n\"Though, it would probably save you money in the long run if you just grew into them.\" Lana laughed, turning her attention to a shirt that almost looked big enough to be a tent.<br>\r\n<br>\r\nYou started browsing through the tent like shirts, surprised that they made clothes this big. It would be interesting to get some clothes to grow into, but you weren't even sure that you wanted to get that big yet. Though, a part of you wanted to buy the biggest clothes in the store and aim to eventually fill them. However, it would probably be better just to aim a few sizes bigger than you were now. Still, maybe a compromise somewhere in between would be best. If you did go big, you could always steal Tabitha's clothes for now. She was a couple sizes bigger than you, so her clothes would definitely fit you. And if needs be, Lana might have some old clothes that were too small for her.</span></div></div>",
            "created":1541566800,
            "id":2574636,
            "title":"Big Expectations"
        },
        "14511121111333":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Keep gaining at the same pace",
                "Slow down",
                "Try to maintain weight"
            ],
            "content":"<div class=\"\"><div> <span>You bit your lip, watching Lana look over the massive clothes in front of you. She was so massive. Still, it wasn't like it would be the first time wearing clothes that big. You glanced down at your own bloated belly, hardly seeming like a bump next to your giant friend who jiggled and flowed with every movement she took. Your eyes followed the massive girl as she struggled to move her girth. <br>\r\n<br>\r\nAlmost instinctively, you found yourself stepping towards the massive clothes feeling the fabric in your hands. It felt just like any other clothes you'd ever worn. Though, it also seemed to be filled with potential. The potential for what you could one day become. You continued chewing your lip as you felt a stirring in your groin. Memories sprang to your mind of all the girls you'd seen online who could easily fill these clothes. They all seemed so happy, and here was Lana, with a big smile on her face as she struggled to find clothes big enough to contain her mass.<br>\r\n<br>\r\nSlowly, you took the dark blue shirt off the rack, holding it up to your small body. It almost looked like a dress with abnormally large sleeves and neck next to your mostly thin frame. After all, even though you were starting to plump up, you still wouldn't really call yourself fat. You were just starting to reach the point were you didn't consider girls thin anymore.<br>\r\n<br>\r\n\"I think that color would look good on you.\" Lana said, glancing your direction, \"Though you'd have to gain a bit of weight for it to really fit you.\"<br>\r\n<br>\r\nYou blushed, lowering the massive shirt as you glanced around. Anyone who saw you would probably think you were crazy, or really confused as to the fact that what you were holding wasn't a dress. You breathed a sigh of relief as you spied the empty area around you and Lana.<br>\r\n<br>\r\n\"I just can't help, but wonder what it would be like to grow into these.\" You said, raising the shirt back to your body.<br>\r\n<br>\r\n\"You could always find out.\" Lana chuckled, \"I think you'd look good at that size.\"<br>\r\n<br>\r\nYou found yourself blushing more, though this time it wasn't for fear of others seeing you. The way Lana kept eyeing you, made you wonder if she might be seeing more than just a friend. Though, you'd also been wondering how you really felt about Lana. You bit your lip as you looked away from the enormous girl.<br>\r\n<br>\r\n\"Don't you think I'd look weird in such big clothes though?\"<br>\r\n<br>\r\nLana waddled towards you, putting a thick arm around your narrow shoulders, \"I think you could make it work.\"<br>\r\n<br>\r\nYou shivered at her touch. Her body was warm and soft, seemingly trying to engulf your small body as she pulled you closer. You'd never been this close to her before, but a part of you didn't want her to let go. However, all too quickly, she relinquished her grip on you. You felt unusually cool as you stepped away from the warmth and comfort of her embrace.<br>\r\n<br>\r\nYou took a deep breath, trying to focus on picking out clothes. You ended up grabbing several of the biggest shirts and pants you could find before going to look for your mother. She was browsing some nice dresses along one wall, looking carefully at a flowery design.<br>\r\n<br>\r\n\"I think I have what I want.\" you finally said, gesturing with your armful of massive clothes.<br>\r\n<br>\r\nYour mother's eyes went wide for a moment as she saw the clothes you'd picked, though you could also swear she smiled for a moment, \"Oh good! I guess that will give you a little room to grow. I'll just be a couple more minutes.\"<br>\r\n<br>\r\nYou went back to wait with Lana while your mother finished looking at dresses. You watched the lights reflecting in the tile floor as you walked, your footsteps clicking with each step. Your mother was definitely behaving differently. She had always been so strict about trying to stay thin, though it wasn't like she'd ever really tried to stop either you or Tabitha when you'd started getting fatter. However, now she was acting almost like she wanted you to get fatter. And Tabitha too. Still, maybe she was just trying to be nice after you told her about standing up for Lana. That was definitely a possibility. If so, then it was very likely that she would return to normal soon.<br>\r\n<br>\r\nIt didn't take too much longer for your mother to finish her own shopping. Even Lana had picked out a couple new clothes as the three of you made your way to the checkout. Your mother took the two of you out to eat on the way home, making sure that you loaded up on food. She then invited Lana to stay for dinner and made a massive dish of lasagna. <br>\r\n<br>\r\nThe next day at school, you wore one of the outfits that you'd picked out, doing your best to make it look like a dress, and hide the fact that you were wearing a belt just to keep the pants up. Though, it was hard not to notice the strange looks you were getting from your lame attempt to disguise the truth. The shirt was obviously just that, and noticeably too big for you, and the bunched up fabric of the jeans created a weird effect in the shirt. Though, it definitely did a good job of hiding the weight that you'd put on. <br>\r\n<br>\r\nOver the next few weeks, you tended to get by with Tabitha's clothes as they seemed more your size now. Though they rapidly seemed to be shrinking. You had expected your mother to lay off of stuffing you to the limit, but as time went on it almost seemed like she was trying harder to fatten you and your sister up. Her efforts were definitely paying off if she was trying to fatten the two of you up as you watched Tabitha starting to balloon up, quickly outgrowing her current size of clothes. Though, you found that you seemed to be gaining on your now definitely fat sister. <br>\r\n<br>\r\nIt was like it was getting harder not to gain weight as you watched your body growing bigger everyday. You weren't even sure if you could stop if you wanted to as you continued to stuff yourself day in and day out. You mother always made sure that you ate to your absolute limit throughout the day. She seemed to be encouraging you to spend more time with Lana too, who's lazy lifestyle seemed to be rubbing off on you more and more everyday.<br>\r\n<br>\r\nYou struggled to do up the pants you'd planned to wear for the day, feeling them cutting into your soft belly as you lay back on your bed. It had been almost 6 weeks since your mother's strange change in behavior, and it was definitely starting to show in your body. This had been one of Tabitha's jeans before she outgrew it a couple weeks ago, and it seemed like you weren't far behind as you finally got the button up. You stood up, noticing how your belly folded around the jeans, creating a nice muffin top.<br>\r\n<br>\r\nYou smiled as you stuck a finger in your deepening belly button, savoring how deep it was starting to feel. Your other hand felt the slight bumps formed by the stretchmarks that were starting to form on the sides of your belly, looking like red streaks through your rounding midsection. Your breasts looked like they were starting to bulge from your bra, a remnant of a smaller you. The fabric of the jeans looked skin tight on your thick thighs as you moved in front of the stand mirror. You had a definite double chin, and you were definitely what you'd call chubby. Even in the massive clothes you'd gotten a few weeks ago it was getting hard to hide your protruding belly. Though it wasn't really like you were trying to hide it. You were definitely getting more confident in your body.<br>\r\n<br>\r\nYou glanced at your computer, smiling as you saw the reactions to your most recent post. You'd done a weigh in for your followers on the weight gain website that you tended to stick to. You'd been 166 as of this morning, meaning you'd gained almost a pound a day lately. Though from how much you were eating, it didn't really surprise you. However, it did seem like you were starting to slow down as you got bigger. Though that was probably just because your body was requiring more food just to maintain your weight as it had to work harder to move the heavier you around. <br>\r\n<br>\r\nYou were definitely starting to notice that physical activity was starting to get a bit more difficult. Not to the point of being unbearable, but you were starting to notice the way your belly squished when you bent over. Or how you were a bit more out of breath from activities that had once been simple and easy. Still, you were excited at the changes.<br>\r\n<br>\r\nYou took one last look at your body in the mirror before continuing to get ready for school. That was one thing that you also noticed. More people were starting to notice your weight gain, and while many of them didn't explicitly say anything you could tell that they were starting to view you differently. Most of them just ignored you, but it seemed like more and more you were starting to be classified as one of the chubby girls. Though that was what you were, you hadn't expected it to happen so fast.<br>\r\n<br>\r\nHowever, you needed to decide where you were going to go from here. Were you going to keep gaining at the rate you were. Or were you happy with your current size for the time being. You could also try to slow down a bit and savor the journey.</span></div></div>",
            "created":1541653200,
            "id":2575236,
            "title":"Pushing Boundaries"
        },
        "145111211113331":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Agree to go to the game release tonight",
                "Go to Lana's house after school",
                "Compromise and suggest going out to eat as a group, then splitting up"
            ],
            "content":"<div class=\"\"><div> <span>Finally dressed, you followed your nose down to the kitchen where your mother was waiting with another large breakfast for you. Tabitha was already at the table, devouring a massive plate of eggs and bacon. However, you noticed that her plate paled in comparison to yours as you plopped down at the table and started eating the hearty meal. You barely had time to taste each bite before you were shoveling another into your greedy mouth. <br>\r\n<br>\r\nYou glanced up from your meal as Tabitha let out a loud belch, pushing her plate away from herself and leaning back in her chair. She had definitely gotten fatter over the last few weeks, but there was no denying that you were catching up as you glanced at your own soft midsection. You were probably as fat now as Tabitha had been about 3 weeks ago. Though it was hard to tell since she was taller than you, so maybe that made you a bit fatter. <br>\r\n<br>\r\nFinishing your meal, you brushed your teeth before heading to school with your fat sister in tow. She didn't really seem to mind the fact that she'd put on weight lately, especially since your mother seemed to have stopped giving her lectures on the dangers of being lazy. You made a stop at Lana's house on the way. The morbidly obese girl slid into the back, taking up almost half the long seat. She'd put on a few pounds, though nowhere near what you'd done.<br>\r\n<br>\r\nThe three of you spent the ride chatting about food and video games, two of your favorite subjects now. Whenever you weren't eating or doing schoolwork, you were playing video games. Though, eating usually found its way into the other activities these days. Still, you had to admit that you were pretty happy with the way things were going lately.<br>\r\n<br>\r\nYou parked as close as you could to the door, looking out at the gray skies as you turned off the engine. Almost immediately you could feel the warmth leaving the car as tendrils of cold seemed to seep in from all sides. You wrapped your arms around your torso, watching your breath as you let out a big sigh. You glanced at Tabitha, who despite wearing about the same things you were, seemed a bit more comfortable as she opened her door, releasing the last of the hot air.<br>\r\n<br>\r\nYou glanced at the back seat as you heard the rear door opening. Lana was pulling herself out of the car, rocking it back and forth with her movements as you watched a single bead of sweat roll down the large girl's face. She wasn't even wearing jacket, but she seemed to be completely unaffected by the cold. It would be nice to have as much natural insulation as she did you thought as you stepped out of the car, your boots splashing in a pile of slush.<br>\r\n<br>\r\nA few snowflakes drifted through the air, almost invisible against the monochromatic sky. The three of you sloshed through the dirty slush of the parking lot towards the door. Lana was moving slower than usual in the unsafe terrain, though you couldn't blame her since it would probably be almost impossible to get her back up if she fell. Still, the thought of being so fat that you couldn't get up seemed to stir something in your groin as you tried not to get too excited. <br>\r\n<br>\r\nYou were happy for the warmth that enveloped you as you stepped into the noisy hall. First bell hadn't rung yet, which left most of the students socializing in the hallways. You spotted Jill near her locker, waving the three of you over. The three of you waddled towards the other fat girl. You still weren't too fat, but you'd been taking lessons from Lana in how to waddle, though she said that you'd eventually just start doing it as it eventually became easier than walking normal. <br>\r\n<br>\r\n\"How's it going?\" You asked coming to a stop near Jill.<br>\r\n<br>\r\n\"Good! Hey I was going to ask if the three of you wanted to go to the game release tonight. I already pre-ordered it and didn't really want to go by myself.\" Jill said, tugging on her skin tight shirt as it started riding up on her belly. <br>\r\n<br>\r\nYou weren't the least bit surprised as Tabitha respond, \"Of course. I've been waiting for this forever!\"<br>\r\n<br>\r\n\"Actually, I'm just getting mine delivered to my house.\" Lana said, \"I hate standing around if I don't have to.\"<br>\r\n<br>\r\n\"Alright, well how about you Heather?\" </span></div></div>",
            "created":1541826000,
            "id":2575875,
            "title":"Keep the Pace"
        },
        "1451112111133312":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Stay quiet, you don't love her like that",
                "Confess your attraction to her",
                "Confess your attraction and ask for something to help be as big as her"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I'm just going to go to Lana's after school. I don't want her to get lonely.\"<br>\r\n<br>\r\n\"I'll be fine if you want to, go with those two.\" Lana chuckled.<br>\r\n<br>\r\n\"It's fine either way.\" Jill said, closing her locker.<br>\r\n<br>\r\n\"Yeah, I'm going to go to Lana's after school.\" you finally said, as the four of you started waddling down the hall. <br>\r\n<br>\r\n\"Are you sure?\" Tabitha asked, panting slightly as she heaved her heavier body down the hall, \"It seems like you haven't been hanging out with us as much.\"<br>\r\n<br>\r\n\"I know. I... I just want to make sure Lana doesn't feel left out.\" you whispered, glancing back at the massive girl a few feet behind you, \"she doesn't really have any other friends.\"<br>\r\n<br>\r\n\"Alright, I see your point.\" Tabitha smiled.<br>\r\n<br>\r\nA few minutes later, Jill and Tabitha were waving goodbye as you and Lana made your way into first period. There were still a few people chatting as they waited for class to start, though none of them really paid attention to the two of you as you plopped into your seats. Lana's desk was seeming smaller every day, though so was yours. You were definitely starting to fill a bit of the empty space with your girth, though you had a long way to go before you could almost cover your desk like Lana.<br>\r\n<br>\r\nSchool was pretty typical, as you and Lana went through the day, until it was finally time to go home. Tabitha decided she'd just get a ride home with Jill, which meant that you and Lana could just go straight to her house after a pit stop at a fast food place. You loved watching Lana eat, filling out her soft body with more and more fat. You found yourself almost mesmerized by her body as you admired the obese girl. <br>\r\n<br>\r\nYour hand found its way to your own belly, feeling the softness of your thickening waistline. You found the world around you drifting away as you imagined what it would be like to be as fat as Lana. You pictured yourself almost stuck in your desk every time you sat down. Or how you'd be panting with exertion after just a few minutes of standing. You pictured yourself struggling even to pull your weight out of bed as you fought the immense force of gravity on your body. The more you thought about it, the more you wanted it now. Though you weren't sure how you'd get as fat as her that quickly. However, she did mention that she had some meds she could give to you that would help you to gain weight. Smiling, you finished your meal.<br>\r\n<br>\r\nSoon you were arriving in front of the small house that Lana lived in. There were a few barren trees in front of the pale yellow of the house. It looked like it was in desperate need of a new coat of paint, though you kind of liked the character of the aging look. Parking the car, you and Lana slowly made your way inside. You shivered slightly as you entered the house, closing the door behind you. They always kept the house cooler than your family since they definitely had more natural insulation.<br>\r\n<br>\r\nYou made your way towards Lana's room, which was on the first floor since she hated going up and down stairs. There was a slightly larger room that she could've used on the second story, but she wasn't too concerned about it since her eventual goal was to be stuck in bed anyway. <br>\r\n<br>\r\nThe two of you ended up playing video games for a while. Her parents made sure to bring you plenty of food to snack on as you played late into the evening. However, you found yourself almost unable to keep your eyes off the massive teen next to you. She'd lifted her shirt up, revealing a massively stretch marked belly which seemed to flow over her lap. The way the two of you were situated meant that you could occasionally feel it rub against your exposed arm, continuing to arouse you. </span></div></div>",
            "created":1542517200,
            "id":2579319,
            "title":"A weighty decision"
        },
        "14511121111333123":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Get a midnight snack in the kitchen",
                "Bring the snack to your room",
                "Resist the urge for a midnight snack"
            ],
            "content":"<div class=\"\"><div> <span>Taking a deep breath, you leaned back on her crowded bed, taking in the view of the massive teen next to you. Slowly, you moved your hand closer to her belly. Lana had stopped playing too, noticing your steady advance as she just watched your hand, a look of longing on her face as you felt the warmth of her flesh begin to envelope your hands. <br>\r\n<br>\r\nYou spent the next little while massaging Lana's soft belly, feeling the fat filling your hands. Lana had closed her eyes, seeming to be enjoying your touch as you continued your loving endeavor. Finally, after a while you leaned back on the bed, revealing your own plump belly. <br>\r\n<br>\r\n\"So, um, I'm not sure how to say this.\" you started, watching Lana's face for any sort of reaction, \"I think I like you as more than a friend.\"<br>\r\n<br>\r\nAt first nothing seemed to happen, but then Lana's face split into a huge smile, \"Me too.\"<br>\r\n<br>\r\nYou relaxed at her response, feeling like a weight had been lifted from your shoulders, but you weren't done yet, \"There's more. I decided that I want to be as fat as you, if not fatter. I want both of us to get so fat we can't move. So I was wondering if there was anything you had on hand that could help me get fatter quicker.\"<br>\r\n<br>\r\nYou bit your lip, watching Lana intently, \"I want that too. As a matter of fact I do have something that could help you with that. I didn't want to take it since I was already so big, but for you it might help you to catch up with me. Be warned though that once you take it, there's no going back. Are you sure you want this?\"<br>\r\n<br>\r\n\"Yes.\" you said confidently. You'd never been more sure of anything else in your entire life. You wanted to spend all your time with Lana, and you wanted what Lana already had. The body you'd always dreamed of, but hadn't had the courage to get.<br>\r\n<br>\r\nLana smiled, moving towards a small nightstand by her bed and pulling out a small white pill, \"This is one of the strongest things I could ever find. One dose is enough to permanently slow down your metabolism to a crawl. It will make it super easy to gain weight to the point that it will almost be impossible not to gain weight, even if you did decide to try dieting. Once people take this, they report that they've been gaining at least a pound a day. However, most of those people are immobile now, and if they aren't they're really close. They said that it got to the point where they just couldn't stop gaining weight even if they wanted to. Are you sure you want that? No one's been able to go more than 3 years without becoming immobile after taking it. Most people can't even make it 2 years. The average is a little over a year. I didn't take it because I at least wanted to make it through high school before becoming immobile.\"<br>\r\n<br>\r\nYou bit your lip, looking at the plain white pill, then to your fat friend. If you took it, then you'd probably be immobile before you could graduate from high school. Though, if you could hold out three years, then you'd be able to graduate. However, you weren't sure that you'd be able to resist the temptation to just let yourself grow as fast as possible. Still, as long as you had Lana you didn't care. Taking a step forward, you took the pill from her, plopping it into your mouth and swallowed it down with only a little difficulty.<br>\r\n<br>\r\nLana just looked at you as you smiled at her, poking out your belly, \"Well, I guess you'll just have to take care of me, won't you?\"<br>\r\n<br>\r\n\"I guess I will.\" Lana said, still seeming dumbfounded that you'd just done that, \"Not like I have a choice now.\"<br>\r\n<br>\r\n\"Just think of this as added motivation to make it through high school.\" you winked at her.<br>\r\n<br>\r\nShe chuckled, moving to place her hands on your exposed belly. She moved her face closer to yours, whispering in your ear, \"You're going to be my fat whale soon. I'm going to enjoy taking care of you as you continue to grow and grow and grow. I'll stay mobile as long as I can just to fatten you myself.\"<br>\r\n<br>\r\nYou smiled as she moved her lips closer to yours. You closed your eyes, as you felt her lips brush against yours, the faint scent of cherry filled your nose as the warmth seemed to spread from her to you. You moved your arms as far as they could go around her thick waist, pulling her into a soft embrace as the two of you locked lips. It felt good as her body seemed to be trying to engulf you in its girth, though if things went as planed, it would be the other way around soon. <br>\r\n<br>\r\nYou enjoyed each others loving touch as you cuddled together on her large bed for the rest of the evening. You were still beaming from ear to ear when you finally got home that night, greedily eating the massive dinner that your mother had prepared for you. You were going to be fatter than Lana, and make her take care of you and continue to fatten you until you were the fattest girl ever. There wasn't anything anyone could do to stop you now, not even yourself. Still, you were interest to see how your life would change as you got fatter and fatter.<br>\r\n<br>\r\nAs you made your way up to bed, you felt your stomach growling despite the large meal that you'd just eaten. You knew you were destined to become immobile, but you should probably try not to arouse to much suspicion. Still, it couldn't hurt to get a midnight snack before bed could it? Although, if you just grabbed some food and brought it to your room, you were less likely to be discovered, but you wouldn't be able to eat as much as if you just stayed in the kitchen.</span></div></div>",
            "created":1542566940,
            "id":2579327,
            "title":"A Growing Friendship"
        },
        "145111211113331231":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Go Get Food with Tabitha",
                "Stay and binge on snacks with Tabitha",
                "Call it a night. With two of you, it would be harder to remain undetected"
            ],
            "content":"<div class=\"\"><div> <span>Biting your lip, you plopped down on your bed, listening to your family doing their nightly routine. You were doing your best to ignore the gnawing hunger that seemed to be slowly devouring your insides as you snuggled deeper into your warm bed. It felt like forever before you finally decided that you just couldn't take it anymore. <br>\r\n<br>\r\nYou slowly hopped to your feet, creeping across your floor towards your shut door. Carefully, you turned the handle until you heard a soft click. The door creaked slightly as you opened it, causing you to cringe as you glanced towards down the dark hall at your parents closed door. You held your breath, waiting.<br>\r\n<br>\r\nA few minutes passed before you finally relaxed, feeling relieved that your parents hadn't woken up, or at least bothered to investigate. Still, it was possible that they just didn't care. Though you didn't want to press your luck.<br>\r\n<br>\r\nCarefully, you picked your way down the hall, moving mostly from memory as you made your way past your sister's room. You smiled to yourself as you heard the slight sound of snoring coming from within. The stairs creaked lightly with each step you took as you descended towards the kitchen, and your waiting snack.<br>\r\n<br>\r\nFinally in the kitchen, you made your way towards the snack cupboard, throwing it open. You didn't even hesitate as you grabbed the first package you spotted, ripping into it with a ravenous determination. You were starving and the only thing standing between you and food was a thin plastic wrapper. Quickly, you shoved a cookie into your mouth, savoring the rich flavor as you grabbed another, then another. Soon the whole package was gone. Frowning, you bit your lip as your stomach let out another low growl.<br>\r\n<br>\r\nYou had lost count of how many packages you'd eaten when you froze. You heard the unmistakable creaking of the stairs as someone descended towards your midnight feast. You glanced at the pile of wrappers around you in the dim light, as your head swiveled towards the door to the front room. <br>\r\n<br>\r\nYour heart was racing, there was no time to hide the evidence of your feast as the person reached the bottom of the stairs. Frantically, you ducked behind the counter, knowing that you'd be discovered the moment whoever it was came around the corner. Still, maybe they weren't going to come into the kitchen. You didn't know why, since that was the only real place someone would be going at this hour. Still, you could hope.<br>\r\n<br>\r\nYou heard the floor creaking as whoever it was entered the kitchen. You cringed at each heavy footfall, knowing that in a moment you would be discovered. You held your breath, hoping against hope that the intruder to your feast would be too tired to notice you or care about your late night binge.<br>\r\n<br>\r\nYou turned your head as the person finally turned the corner around the counter. You could feel your heart beating fast as you braced for the inevitable. This was it. Your mother was going to discover you gorging yourself on food, and try to put a stop to your feasting.<br>\r\n<br>\r\nYou let out a sigh of relief as Tabitha turned the corner, stopping as she caught sight of you. You smiled slightly at the way her shirt failed to cover her protruding belly, and her pajamas seemed to cut into her middle uncomfortably by the way she kept tugging at them. <br>\r\n<br>\r\n\"What are you doing here?\" She asked quietly.<br>\r\n<br>\r\n\"I was hungry.\" you whispered.<br>\r\n<br>\r\n\"Me too. I just couldn't sleep with how hungry I was tonight.\"<br>\r\n<br>\r\n\"Me neither.\"<br>\r\n<br>\r\n\"Well, I guess since we both couldn't sleep, we might be able to sneak out for a midnight run at the burger place. Unless you wanted to just keep snacking here.\"<br>\r\n<br>\r\nIt was definitely tempting, though it would be risky. There was a good chance your parents would hear you leaving or returning, and that would be hard to explain to them. Still, you'd be able to get as much food as you wanted if you went out. And it would definitely be a lot fattier.</span></div></div>",
            "created":1542854760,
            "id":2580425,
            "title":"Burning the Midnight Oil"
        },
        "1451112111133312311":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Take her hand",
                "Stick your hands in your pocket",
                "Pull her in for a Kiss, you are a couple and you don't care who knows"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go!\" You whisper, listening to your stomach continuing to grumble in anticipation.<br>\r\n<br>\r\nYou faintly see your sister smile as she begins creeping back the way that she came. You took one last look at the snack drawer, before following her across the cool wooden floor. It was hard to make out much in the dark, but you were able to find the shoes that you'd left by the front door, grabbing your coat as quietly as you could from the front closet. Once Tabitha was ready, you opened the door.<br>\r\n<br>\r\nYou both shivered as a cold breeze intruded into the house as snow swirled around in the light from the porch light. You patted your coat pocket, making sure you had your keys and wallet as you rushed towards your car with Tabitha following behind. Even with a coat on, it only took moments for the cold of winter to start cutting through you to the bone. You glanced at Tabitha who didn't seem to be quite as uncomfortable despite her jacket not closing all the way with her new girth. It really was time for her to get new clothes if she was going to keep fattening up.<br>\r\n<br>\r\nThe two of you rode in relative silence as you made your way to one of the 24 hour burger places. Not wanting to show off your pajamas, the two of you went through the drive-through. You made sure to order plenty of food for the both of you, which you both quickly devoured before returning home. You finally felt full after enough food for 3 or 4 people as you turned off the key.<br>\r\n<br>\r\nYou glanced at the dark windows of your house as you felt your heart fluttering. This was the moment of truth. Hopefully, your parents hadn't noticed the two of you missing in the middle of the night, though that was a long shot. Still, there was always the chance that you got lucky.<br>\r\n<br>\r\nThe two of you waddled towards the front door, your feet leaving deep tracks in the fresh snow. You shivered, hoping that it would snow enough before morning to cover any trace that the two of you had left during the night. You pulled your house key out of your warm pocket, and unlocked the front door, slowly turning the handle as you tried not to make any noise. <br>\r\n<br>\r\nYou cringed as the door slowly creaked open, hoping that no one would notice the two of you returning if they hadn't noticed you leave. You glanced around the dark room, the only light coming from the front porch as you bit your lip.<br>\r\n<br>\r\nYou breathed a sigh of relief as you took in the empty room. You could hear your father snoring from your parents bedroom, and there didn't seem to be any sign that someone had gotten up during your midnight adventure. Still, you couldn't help feeling a bit guilty. You'd never purposely broke curfew just for food before. Although, you couldn't remember ever feeling that hungry before. <br>\r\n<br>\r\nYou tiredly made your way to bed, quickly falling asleep as you snuggled into your warm sheets. Your dreams were filled with food and gluttony as you fattened yourself up with Lana, quickly becoming immobile.<br>\r\n<br>\r\nYou were still smiling as you woke to a soft rap on your bedroom door, \"Breakfast is ready.\"<br>\r\n<br>\r\n\"Alright,\" you replied, smelling the unmistakable smell of bacon.<br>\r\n<br>\r\nFaint light filtered in through your window, as you sat up, peeking through the blinds. The snow hadn't let up at all last night, and was still continuing to blanket the scene below. You shivered as your quilt fell away from your shoulders. It was definitely going to be a cold day. It would be really nice to be as fat as Lana right now, since she never seemed to get cold. <br>\r\n<br>\r\nYou got dressed and ready for the day before heading down to the kitchen where Tabitha was already gorging herself on a mountain of food. You couldn't help but stop and take in the sheer amount of food on the table. Your mother seemed to have made enough for an army. However, you quickly sat down and dug in as your belly let out a loud growl of anticipation. You didn't realize how hungry you'd been as you stuffed yourself with one of the biggest meals you'd ever eaten. <br>\r\n<br>\r\nAfter eating, you and Tabitha finished getting ready before heading to pick up Lana on your way to school. You and Lana shared a knowing smile as she got into the back seat, while Tabitha snacked on some chips she'd brought with her. It took longer than normal to get to school since the roads were so bad, but when you finally arrived you let out a sigh of relief.<br>\r\n<br>\r\nTabitha quickly jumped out of the car, yelling that she was going to be late to class if she didn't leave now. You stayed to help Lana out of the car, steadying the obese girl as you walked towards the school. As you walked inside the warm building, you felt something brush your exposed hand. You glanced down and noticed Lana's hand very close to yours, seeming to try to discreetly clasp your exposed hand.<br>\r\n<br>\r\nYou bit your lip, glancing around the still crowded hallway. You hadn't really thought about sharing your relationship with the world this quickly, but at the same time, people were bound to find out eventually. Still, you didn't know if you were comfortable with it quite yet.</span></div></div>",
            "created":1543458840,
            "id":2583226,
            "title":"Irresistable Offer"
        },
        "14511121111333123111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "A special day of stuffing at an all-you-can-eat buffet",
                "Go over to her house",
                "Invite her to your house"
            ],
            "content":"<div class=\"\"><div> <span>Warmth fills your hands as you take her warm hand in yours. You glance around the noisy hallway at the many students going about their activities as you and Lana walk hand-in-hand. You begin to relax a little as you notice that no one seems to really be paying attention to your small displays of affection for your new girlfriend. Though, it wasn't like you'd be the only lesbian in the school. You knew that there were others. Still, your choice in girl, coupled with your own recent gain would probably be enough to get people's attention.<br>\r\n<br>\r\nYou relaxed, not realizing how much you'd tensed up, as you finally released Lana's hand as you took your seat for first period. You found your mind wandering to what your future would be like as you Lana grew fatter together. The room was nice and warm, and the teacher was going on about something, but you were finding it harder and harder to keep your eyes open as you kept glancing at your obese friend. It wouldn't be too long before you were as fat as her.<br>\r\n<br>\r\n\"Heather!\" you jolted upright as a ruler slapped down next to your head with a loud crack.<br>\r\n<br>\r\nYour cheeks turned dark red as everyone started laughing at your rude awakening. You hadn't even realized that you'd drifted off, \"Sorry. I didn't sleep well last night.\"<br>\r\n<br>\r\n\"That may be, but my classroom is not the place to be sawing logs.\" This garnered more laughter from the other students.<br>\r\n<br>\r\n\"Sorry.\" you mumbled, lowering your gaze from your teacher's stare.<br>\r\n<br>\r\n\"Just make sure it doesn't happen again.\"<br>\r\n<br>\r\nYou made sure to focus on staying awake through the rest  of the class, though you were sure that nothing your teacher had said was going to stick. Still, you didn't want to draw anymore attention to yourself. You sighed as the bell finally rang to dismiss you from first period. <br>\r\n<br>\r\n\"Are you okay?\" Lana asked, getting to her feet and taking your hand as you left the classroom.<br>\r\n<br>\r\n\"Yeah, I just didn't get a whole lot of sleep. I got home and had dinner, but I was still so hungry that I couldn't sleep. So I got up to grab a snack, when Tabitha came down and we both went out to get some food since we were so hungry.\"<br>\r\n<br>\r\n\"And you didn't even invite me?\" Lana feigned indignation.<br>\r\n<br>\r\nYou chuckled, \"Well, I figured at least one of us should be well rested to try to keep the other's awake. Thanks for that by the way.\"<br>\r\n<br>\r\nLana chuckled with you, \"Well, sorry no one mentioned that I'd have additional duties today besides listening to that lame lecture.\"<br>\r\n<br>\r\nYou and Lana continued teasing each other as you made your way to your cooking class. Despite your obvious closeness, no one really seemed to be paying too much attention to the two of you as you walked through the halls with clasped hands. You were even finding it easier to relax as you finally entered the warm classroom. Your stomach growled with hunger as you caught the lingering scent of gingerbread coming from the warm ovens. <br>\r\n<br>\r\nYou loved gingerbread, and you were glad that you were finally getting the chance to learn to make it. This would be just another fattening dish you could make yourself to help your weight gain. You and Lana each ended up eating your entire tray of gingerbread before leaving class. Though you were still starving as you and Lana began making your way towards your car to go to lunch.<br>\r\n<br>\r\n\"Oh, look the whales are holding hands.\" came a voice behind you, causing both of you to turn to see who it was.<br>\r\n<br>\r\nYour heart sank as you saw the three cheerleaders striding towards the two of you. They were all smirking, obviously pleased that they had something else to tease you about.<br>\r\n<br>\r\n\"What do you want\" you shot.<br>\r\n<br>\r\n\"Oh I was just noticing that you've finally made it past the stage where you share clothes,\" Said the one in front loud enough that people were starting to pay attention to the confrontation.<br>\r\n<br>\r\n\"So what?\" Lana shot.<br>\r\n<br>\r\n\"Nothing, just making an observation,\" said the girl, pushing between the two of you as her cronies followed. <br>\r\n<br>\r\nAll eyes were on the two of you as the cheerleaders left smirking. They'd done the damage, and now everyone knew that the two of you were a couple. Still, at least the worst of it was over, you hoped. <br>\r\n<br>\r\nThe next few weeks didn't go much better with the cheerleaders. You and Tabitha were both fattening up quite quickly, which just gave them more ammo to use against you and Lana. This continued until the day when it was finally obvious that you were fatter than Tabitha, then they really started to pester you.<br>\r\n<br>\r\nYou looked at yourself in the stand mirror, taking in the numerous stretchmarks that were starting to cover your bulging belly. Your underwear looked several sizes too small on your fat body as you squeezed your soft belly in your hands. You glanced at the tent like clothing that you'd been wearing lately. It was still far too big for you, but not as bad as when you'd first got it. Though now you didn't have any of Tabitha's clothes to wear since you were fatter than her. <br>\r\n<br>\r\nYou smiled as you continued to play with your belly, which growled as you caught a whiff of breakfast coming from the kitchen. Your mother had been absolutely stuffing the two of you with food, though you weren't exactly complaining. Still, it was odd how she'd gone from lecturing you about getting fat to practically trying to fatten you up as fast as possible. Still, you had a long way to go from the 210 that you'd weighed in at that morning.<br>\r\n<br>\r\nYou looked at your round face sitting atop your fatter boobs which were practically bursting out of your bra as they rested on your swollen belly. You were definitely getting to the point where you thought of yourself as really fat. Your underwear was digging into your soft waist almost uncomfortably as you adjusted them on your thick thighs. You were definitely starting to notice that your butt was swelling up as well.<br>\r\n<br>\r\nYou didn't have school today, but you were still planning on hanging out with Lana. Your mom had taken that surprisingly well when you'd told her that the two of you were a couple. If anything she'd seemed really happy. Still, you hadn't decided what you were going to do with her yet, and you should probably text her and let her know.</span></div></div>",
            "created":1543528320,
            "id":2583686,
            "title":"Accommodating Hand"
        },
        "145111211113331231112":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Peak inside the open door",
                "Don't peak, but ask Lana about it",
                "Ignore it."
            ],
            "content":"<div class=\"\"><div> <span>You took one last look at your scantily clothed body, admiring how fat you were becoming, before grabbing your phone from the bed. You  didn't really feel like hanging around your family today, and as much as you would enjoy going to the all-you-can-eat buffet, you didn't feel like being around strangers today either. Despite how much you were enjoying your new body, you still felt embarrassed when others would look at your flabby belly.<br>\r\n<br>\r\nYour fingers slid across the cool screen, letting Lana know that you'd be over once you finished breakfast. Hitting send, you tossed your phone back onto the bed before grabbing a blue shirt that was far too big for you, though not as big as it had been when you'd gotten it. You still had a ways to go, but you were definitely starting to fill it in a bit. You figured in another 100 lbs or so it would probably look just right on you, and since you were sure you'd gain that, it was just a matter of how long it would take to reach that.<br>\r\n<br>\r\nYou were definitely starting to feel fat, you thought as you continued to look at your protruding belly. You were starting to really notice the extra weight that you were carrying around in everything that you did. Though it made sense since you'd gained over 100 pounds since the start of the school year. Still, you were loving the way that you could feel your belly bounce with every step you took. Or the way that your thighs were starting to really press together. You also loved feeling your breasts getting heavier on your growing frame as they hung lower and lower with fat. Still, the thing you probably loved the most was how your face was rounding out, looking softer every day. <br>\r\n<br>\r\nLifting your belly, you let it drop, feeling the weight drag on you as you smiled. You couldn't resist the smell of breakfast anymore as you threw on the blue shirt, which hung loosely from your frame. Despite how chubby you were, these large clothes did a fairly good job of making you look thinner than you actually wore. Though it came at the cost of looking like your clothes were trying to eat you alive. Struggling slightly, you pulled your loose pants on and grabbed the belt that you used to hold them up. Though the pants still fell off you if you didn't have a belt on, the belt itself was starting to grow extremely tight on your fat body, cutting painfully into your waist even at the loosest it would go. You made a mental note to ask Lana if she had an extra belt that you could borrow.<br>\r\n<br>\r\nFinally dressed, you made your way downstairs to the kitchen. Your mother was cooking more food by the stove, while Tabitha was devouring a mountain of food. Even though you were fatter than her now, that wasn't to say she wasn't fat. She had been packing on the pounds almost as quickly as you had, and she was definitely getting quite thick even though she was taller than you. Honestly, if you both were the same height she would probably be fatter than you by a good twenty pounds. <br>\r\n<br>\r\nYou took your seat at the table, pulling your plate towards you as you dug into the mountain of food. You couldn't stop yourself once the first bite had crossed your lips as you shoveled food into your mouth at an alarming rate. You'd lost all semblance of self control when it came to food. Though it wasn't like you really wanted to stop. Your stomach had stretched so much that you could easily hold three to four times the amount of food that you could when you started, and you were pushing that limit with every meal you ate. It was getting to the point where there was a visible difference in the size of your belly before and after every meal.<br>\r\n<br>\r\nWhen you'd finally finished the massive feast of a breakfast, you thanked your mother and grabbed your coat before stepping outside into the gray morning light. You shivered as you left the warmth of your home and were instantly surrounded by the frigid air of winter. You were noticing that the cold was starting to effect you less and less as you got fatter and fatter. Still, you weren't to the point that Lana was in being able to resist the cold. You could see each exhale of your breath as you waddled towards your car while snow swirled around you in an endless dance. You glanced back towards the front door as you opened your car door, smiling at the deep tracks you'd left in the snow. They were definitely getting deeper as you got fatter. <br>\r\n<br>\r\nIt took you longer than normal to get to Lana's thanks to how slick the snow packed roads were. You didn't mind though, since you'd rather make it there slowly than not at all.<br>\r\n<br>\r\nFinally, the small house came into view, emerging from the gray backdrop like a ghost materializing before you. You eased your car into the driveway before making your way towards the front door. You knocked and waited shivering on the doorstep. After a few moments you could hear the heavy footfalls of your massive girlfriend approaching. A moment later they stopped on the other side of the door, which swung wide to reveal the smiling face of the obese teen. <br>\r\n<br>\r\n\"What took you so long?\" Lana chuckled, moving aside so you could step into the warmth of the house.<br>\r\n<br>\r\n\"Roads were horrible.\" You replied, stomping the snow off your shoes before stepping inside. <br>\r\n<br>\r\n\"Well, I'm glad you're here now!\" She pulled you into a soft hug, and you found yourself getting aroused as your chubby body sunk into her obese one. <br>\r\n<br>\r\n\"Me too\" you said as before pulling her closer for a kiss. <br>\r\n<br>\r\n\"So, what did you want to do?\" She said breathlessly, and you didn't think it was just because of the physical activity of coming to open the door.<br>\r\n<br>\r\n\"I was thinking some video games with lots of snacking.\" you said, moving towards her room before stopping, \"Actually, I'm going to go use the restroom first. Go ahead and grab the snacks, I'll be right down.\"<br>\r\n<br>\r\n\"Sounds good.\" Lana said as she began making her way towards the kitchen. <br>\r\n<br>\r\nYou made your way slowly upstairs, panting by the time you reached the top. You were definitely starting to become less physically capable. You stopped, placing a hand on the cool wall as you tried to catch your breath for a moment. <br>\r\n<br>\r\nYou cocked your head to the side as you noticed that one of the doors was open. You knew it was the biggest bedroom, the one that Lana passed up because she hated going up and down stairs, but you'd never actually seen it. Still, you'd never seen the door opened before, and whenever you asked to see it, Lana always came up with some excuse. You were curious to see what Lana could possibly be hiding, though at the same time you didn't want to betray her trust. Maybe it would be better just to ask her about it again. It had been a while since you asked, and you both were definitely closer now.</span></div></div>",
            "created":1544374680,
            "id":2587574,
            "title":"New Faces"
        },
        "1451112111133312311122":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Get mad and Storm out",
                "Express understanding",
                "Ask if you could meet him"
            ],
            "content":"<div class=\"\"><div> <span>You bit your lip, staring at the open door. After a few moments you jumped as you heard something coming from inside. Was that where Lana kept her pets? That wouldn't make any sense though since she never talked about any pets. Was someone trying to break into the house? That also wouldn't make any sense, since there were plenty of easier places to get to on the first floor.<br>\r\n<br>\r\nTurning around, you quickly made your way downstairs, ignoring the pleasurable feeling of your jiggling body. You poked your head into the kitchen, spying Lana loading up a tray full of food. She stopped as she saw the panicked look on your face, \"What's wrong?\"<br>\r\n<br>\r\nSpeaking in ragged bursts from your short adventure, \"I think there's something in the large bedroom. The door was open and I could hear noise coming from inside.\"<br>\r\n<br>\r\nLana's face fell as she set the tray on the counter, \"I knew I forgot to do something. Yeah, there's something in there. It's my older brother.\"<br>\r\n<br>\r\nYou stood there, just looking at Lana for a few moments, \"You have a brother?\"<br>\r\n<br>\r\nLana moved to sit in the chair that was near the cupboards, easing herself down as sweat beaded on her forehead, \"Yeah. We don't really talk about him because most people wouldn't understand. I know you probably will, but I could never find the time to tell you.\"<br>\r\n<br>\r\nYou moved a chair closer to her, scraping it along the ground before plopping into it, \"Understand what?\"<br>\r\n<br>\r\nLana looked at the ground for a few minutes, and you were just about to repeat yourself when she finally spoke, \"My brother was the one who really made me want to get fatter. I saw how happy he was, and it just sort of resonated with me. Honestly, he was the whole reason I knew about the pill that you took.\"<br>\r\n<br>\r\nThis was a lot to take in, but you nodded for her to continue.<br>\r\n<br>\r\n\"Well, there isn't too much more to it. He had always been chubby, but then he decided to see what would be like to be fat. He was having trouble gaining weight and so he started to look for products to help him. That's when he discovered the pill that you and he both took.\"<br>\r\n<br>\r\nSuddenly it hit you, but you needed to hear it for yourself.<br>\r\n<br>\r\n\"After that he couldn't stop gaining, even after he passed his goal. He kept gaining until finally he couldn't even get out of bed. He relies on us to take care of him. I grew to love the idea of being that fat that someone would have to take care of me, but I could never bring myself to take the pill. Though that didn't stop me from getting fatter. He still is getting fatter to this day since the pill won't let him stop. So now you know my family's secret.\"<br>\r\n<br>\r\nThat would explain why she wanted to make sure you were sure about taking the pill, but you were still curios as to why she would keep her brother secret. So what if he was immobile? Was that really so embarrassing for her family, or was there more to it than that. Still, she had lied to you, even after you had started getting closer. </span></div></div>",
            "created":1544884620,
            "id":2589373,
            "title":"Shared Secrets"
        },
        "14511121111333123111223":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Get mad at Lana for keeping him from you",
                "Thank him for the compliment and kiss him on the cheek",
                "Ask him if you could feel his fat"
            ],
            "content":"<div class=\"\"><div> <span>\"Can I meet him?\" was all you managed to say.<br>\r\n<br>\r\nLana sighed, \"I guess so. He's kind of shy, though.\"<br>\r\n<br>\r\nLana pulled herself to her feet and waddled past you. You watched her large hips swaying for a moment before following after he as she struggled up the stairs. Finally, she made it to the top, sweat drenching her forehead as her body jiggled and shook down the hallway, stopping with some effort in front of the slightly open door. You crept forward, craning your head to peer into the open door.<br>\r\n<br>\r\nYour mouth sagged open as you finally saw Lana's brother. The room was sparsely furnished, with only a king sized bed a stand with a tv on it, and a nightstand where a laptop computer was charging. It was hard to see any exposed surface on the bed though as it was all covered by a flesh colored blanket. Though, that's when you noticed that there was a torso rising from the midst of the blankets, and it finally hit you. That was Lana's brother.<br>\r\n<br>\r\n\"Hey Matthew.\" Lana said, causing the boy to look up from his video gaming, \"Just thought you might want to meet my girlfriend I've been telling you about.\"<br>\r\n<br>\r\nHe looked up from his game, turning to spy you in the door as you cautiously stepped into the room, \"So, you're the girl who Lana is always talking about. Nice to finally meet you. They're all a little over protective of me, but I really don't mind the company.\"<br>\r\n<br>\r\nHis voice was rich and clear, and you couldn't help wanting to hear him talk more as you slowly moved farther into the room.<br>\r\n<br>\r\nNow that you were in the room proper, you could get a sense for just how fat he really was. You didn't know why, but as you looked over the massive boy in front of you, you found yourself growing wet and it was all you could do not to rush forward and start feeling him up. He was so fat that he completely covered the surface of the bed and then some. His fat was sagging off the sides of the bed,  which is what made it look like a blanket. His torso rose from almost the middle of the bed, blending seamlessly into the fatty blanket. <br>\r\n<br>\r\nYou shifted, trying to hide your blushing face, \"Hey. I'm Heather.\"<br>\r\n<br>\r\nHe reached out a hand, and you cautiously stepped forward and took it, savoring the warmth as it enveloped yours, \"I don't get many visitors since most people don't even know I exist, but I'm glad I can finally meet you.\"<br>\r\n<br>\r\nHe turned to look at Lana, still holding your hand, \"You really got lucky with this one. She's beautiful.\"<br>\r\n<br>\r\nLana's face turned almost as red as yours as she sputtered, \"Well, um, I, uh, I guess I did.\"<br>\r\n<br>\r\n\"Don't be so modest! She's absolutely stunning, especially with that nice soft belly. Though from what you've told me, she won't be small for too long.\"<br>\r\n<br>\r\n\"I told him that you had taken the other pill, and he's wanted to meet you ever since, but I just couldn't find the right time to tell you.\" Lana shuffled her feet as she glanced at the floor.</span></div></div>",
            "created":1544886600,
            "id":2589379,
            "title":"A Big Meeting"
        },
        "145111211113331231112232":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Spend Most of your free time with Lana over the next couple of weeks",
                "Spend most of your free time with Matthew over the next couple of weeks",
                "Spend time with your other friends"
            ],
            "content":"<div class=\"\"><div> <span>You didn't know what came over you, but you found yourself making your way towards the massive boy, stopping beside his bed. You couldn't believe how fat he was as you placed a hand on the blanket of fat, feeling how soft it was. And warm.<br>\r\n<br>\r\n\"Thanks for that!\" You said, leaning into the massive boy and giving him a small kiss on the cheek, \"I hope we get to spend more time together!\"<br>\r\n<br>\r\nYou lingered for a moment, letting your hands rub over the flesh of the obese boy, as you felt an immense stirring in your loins. You could feel the warmth radiating from his massive body as you continued to hover over him, watching his face turning redder with each moment. Part of you wanted to do him right now, though you didn't know why. Perhaps it was because this was the type of body that you'd always dreamed of. Or maybe it was the knowledge that you would be looking like him soon. Or maybe it was just to get some sort of response out of Lana.<br>\r\n<br>\r\n\"What was that?\" Lana said, putting her hand on your shoulder.<br>\r\n<br>\r\nGrudgingly you stepped back from the boy, looking at your girlfriend, \"Well, he was being polite and...\"<br>\r\n<br>\r\nThey both just looked at you as you trailed off, not knowing what you were going to say. Especially since you didn't even really know why you did it.<br>\r\n<br>\r\n\"It's okay Lana. She was just trying to be nice.\" came the rich voice of Matthew from behind you.<br>\r\n<br>\r\n\"Yeah.\" you mumbled, Looking anywhere in the room but at Lana.<br>\r\n<br>\r\n\"Alright.\" Lana sighed, taking a wobbling step back from the bed, \"Well, I guess it couldn't hurt for us to spend some time up here now that you know about Matthew, and I'm sure he'd love the company.\"<br>\r\n<br>\r\nYou bit your lip as you thought about what had just happened. Lana seemed to give up that fight way too easily. You were probably going to have to deal with it later. Though right now, you found you couldn't get enough of that massive boy. <br>\r\n<br>\r\nOver the next few hours you spent most of the time in Matthew's room. Lana stayed fairly quiet most of the time, reaffirming your belief that there was going to be a part two later. Though you couldn't seem to help wanting to be close to Matthew. You found out he was only 20 years old, though he'd been stuck in bed since he was 15. He definitely didn't seem as shy as Lana would've had you believe as he talked most the time. He even let you try his feeding tube. It was hard for his family to always be around to feed him, so they had the feeding pump installed so he could get meals whenever he needed them. You filled your belly as much as you could with the mixture he said was mostly just fat to get him the calories his body needed because of the pill. If he didn't get enough calories he could die from starvation despite his size, which is why he just kept growing.<br>\r\n<br>\r\nYou couldn't help but realize that you would eventually be just like Matthew. Unable to move from wherever you got stuck, and unable to lose weight lest you died. Still, something about that thought made you really happy. You felt bad though for hurting Lana's feelings, but you couldn't help it with Matthew right there. It was like a dream come true. Still, maybe you should make it up to Lana by spending more time with her over the next couple of weeks. Though you really wanted to spend as much time as you could with Matthew. Although the other option was just to spend some time with your other friends and give both of them, and you, a little space to figure things out. <br>\r\n<br>\r\nYou were pretty sure that whomever you spent time with would influence how much weight you gained over the next few weeks. Matthew would probably propel you the quickest towards your goal, though Lana probably wouldn't be too much slower. However, your other friends weren't near the gluttons that the first two were.</span></div></div>",
            "created":1545246480,
            "id":2590889,
            "title":"Stirring the Pot"
        },
        "1451112111133312311122322":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Suggest some alone time with Lana",
                "Admit your attraction to Matthew",
                "Try to have both"
            ],
            "content":"<div class=\"\"><div> <span>A steady hum filled the air as a sweet creamy flavor washed over your tongue. Everything was dark and a soft warmth enveloped you on all sides. Still, you found yourself smiling around the rubbery tube in your mouth as you settled deeper into the pillow-like surface around you. Your body resisted as you tried to snuggle yourself as deep as possible into the warm embrace. A sweet musk tickled your nose as you inhaled the scent, letting yourself relax more.<br>\r\n<br>\r\nGoosebumps dotted your body as another pair of hands joined in on rubbing your tight belly beneath your soft shell, \"You know, it always surprises me how much you can drink.\"<br>\r\n<br>\r\nOpening one eye, you turned towards the figure that was embracing you as you removed the hose for a moment, \"It's not my fault I'm always so hungry.\"<br>\r\n<br>\r\n\"Well, you are the one who always feels like stuffing yourself to the limit at every possibility.\" you heard Lana scoff from the end of the bed.<br>\r\n<br>\r\nYou turned your attention to the flabby girl. The image on the TV was frozen as the game controller sat untouched in her lap. She was looking at you and Matthew as you nestled into his all-encompassing belly. Your thick arms continued their rounds on your expanding belly as you returned Lana's glare.<br>\r\n<br>\r\n\"Even still. I could die if I don't eat enough food.\"<br>\r\n<br>\r\n\"That doesn't mean you need to immobilize yourself by the end of the year. Though I wouldn't be surprised if you were already stuck on Matthew with how much time you spend there.\"<br>\r\n<br>\r\nYou bit your lip as you looked down at your protruding middle. Your shirts no longer drowned your body in their size, and it had been a while since you'd needed a belt, though your pants were still loose. Despite your size, pink flesh surrounded you on all sides as it flowed off the bed. You sunk deeply into it as you shifted slightly and your hands moved to caressing your flabby bed. It felt like grabbing a cloud as you massaged Matthew's blanket-like belly.<br>\r\n<br>\r\nYou turned back towards Lana, who looked like she was waiting for a response, \"You know I still love you. It's just... It's just that this has been pretty much a dream come true. I mean even my mom has been trying to stuff me as full as possible all the time.\"<br>\r\n<br>\r\n\"Well, I thought that our together time would have less people involved. I mean if you'd rather be with Matthew, that's fine. Just say it though. I mean we can still be friends, but I don't like feeling like your more interested in him than me.\"<br>\r\n<br>\r\nYou continued chewing on your lip as you watched Lana intently. Even through her loose clothes you could see her body jiggling with every move she made. You could see her chest rising and falling with each breath she took, as sweat beaded on her brow despite the chill in the room. You wracked your brain, trying to think of how to respond. On the one hand you definitely still found Lana attractive, but on the other you found yourself enthralled with Matthew. He was like an omen of what was to come for you. On top of that he was really kind and always tried to make you feel special.<br>\r\n<br>\r\nHowever, it wasn't like he could really go anywhere or do anything outside of his room. Despite having people wait on him hand and foot, he was stuck in his bed, and there was no way that would ever change. Eventually you'd become immobile too, and there was the possibility that you'd never be able to see him again after that. Though part of you was hopping that maybe you'd reach that point while you were still in his embrace. Then you'd be stuck together forever. Though, he still wouldn't be able to take care of you once you reached immobility.<br>\r\n<br>\r\nLana was also really kind. Kind enough that even if you weren't a couple anymore she'd probably still take care of you. Despite how jealous she'd been lately, she was always looking out for you and trying to make things easier for your growing body. She'd even been limiting how much she was eating so she would be able to take care of you once you were immobile. </span></div></div>",
            "created":1546358700,
            "id":2597133,
            "title":"Bigger Ambitions"
        },
        "14511121111333123111223222":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Give him a goodbye kiss",
                "Just leave",
                "Kiss and Call him your boyfriend"
            ],
            "content":"<div class=\"\"><div> <span>\"Well...?\" Lana asked.<br>\r\n<br>\r\nYou glanced back and forth between Lana and Matthew, biting your lip. Matthew's hands had stopped their massage of your belly, and Lana's controller had fallen to the floor. They both were watching you intently as you tried to make up your mind. You wished that you could have both, but you weren't sure if either of them would be okay with that. Your hands drifted towards Matthew's encompassing belly as you felt a stirring in your groin. <br>\r\n<br>\r\n\"Lana, I still love you.\"<br>\r\n<br>\r\n\"but...\"<br>\r\n<br>\r\n\"But, I also love Matthew.\"<br>\r\n<br>\r\n\"Are you sure?\" came Matthew's voice from behind your ear.<br>\r\n<br>\r\n\"Yes.\"<br>\r\n<br>\r\nLana glanced over her brother, and you were pretty sure you could see tears forming in her eyes, \"I was pretty sure that was the case.\"<br>\r\n<br>\r\n\"I'm really sorry....\" you mumbled. <br>\r\n<br>\r\nMatthew's hands had resumed rubbing your fat belly, though it almost seemed like there was a renewed vigor to them. Still, you couldn't help feeling a tear well up in your own eyes as you watched Lana slowly pull herself to her feet and excuse herself, mumbling something about being hungry.<br>\r\n<br>\r\nYou turned your head to look back at Matthew, taking in his deep brown eyes, \"Do you think she'll be alright?\"<br>\r\n<br>\r\n\"She'll be fine\" he whispered.<br>\r\n<br>\r\nYou smiled at his comforting touch and sank back into his flesh, closing your eyes as you guided the feeding tube back towards your lips.<br>\r\n<br>\r\nYou spent the next few hours just cuddling with Matthew as he played with your belly. Lana never came back upstairs, though you did hear someone going in and out of the kitchen several times. You knew she was hurt by your choice, but Matthew was everything you aspired to be now. On top of that, he was kind and gentle and really seemed to enjoy spending time with you. Though, that could probably be attributed to the fact that it wasn't like he got many visitors. <br>\r\n<br>\r\n\"I guess I better be getting home. My mom will freak if I miss dinner.\" you finally said, removing the hose from your mouth and patting your stuffed belly as you swallowed the last of the sweet liquid.<br>\r\n<br>\r\n\"It really is like she's trying to fatten you and Tabitha up.\" Matthew said, leaning back into his own belly.<br>\r\n<br>\r\n\"Yeah, I think the only reason I'm managing to stay ahead of Tabs is because of the pill I took.\"<br>\r\n<br>\r\nHe chuckled as you slowly started climbing towards the edge of the bed, \"You really will need to introduce me to her before she gets too fat to come here.\"<br>\r\n<br>\r\nYou shivered slightly as you left your warm bed, your feet hitting the chilly floor, \"You jest, but I almost think she might become immobile before me. She's gotten even lazier about just laying in bed and snacking when she isn't at school.\"<br>\r\n<br>\r\nYou tugged on your shirt, straining to get it to cover your protruding belly. You'd never imagined that you'd actually get this fat when you started, but you were so excited to keep gaining now. You couldn't help, but get a flutter of anticipation every time you looked at Matthew. Eventually, you'd be as big as him, if not bigger. <br>\r\n<br>\r\nAs you began waddling towards the door, you noticed that Matthew seemed to be watching his hands as he wrung them. </span></div></div>",
            "created":1547233620,
            "id":2602156,
            "title":"Straight Arrow"
        },
        "145111211113331231112232223":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Early night to bed",
                "Video games with Lana",
                "Chat with Jill"
            ],
            "content":"<div class=\"\"><div> <span>You smiled, padding heavily back towards the bed, fighting the continuous sway of your body. Matthew looked up at you expectantly, as you leaned over his belly, letting your hands sink into his flesh as you brought your face closer to his. You closed your eyes, breathing in his sweet scent as you felt a warmth on your lips as they brushed against his. You both stayed motionless for a long while. You weren't sure how long you stayed there, lips locked together. Yet you just wanted to stay in that moment.<br>\r\n<br>\r\nFinally, you felt him pull back slightly. You opened your eyes, staring into his deep brown ones as you whispered, \"I love you.\"<br>\r\n<br>\r\n\"I love you too.\"<br>\r\n<br>\r\n\"I'm so glad to have you as my boyfriend.\"<br>\r\n<br>\r\n\"And I'm glad you choose to be my girlfriend.\"<br>\r\n<br>\r\nSlowly, you stood back up. The weight of your belly kept threatening to drag you back into Matthew's belly as you pushed yourself up, as if it too didn't want to leave the fat bed behind. Reluctantly, you turned away and started waddling back towards the door and down the stairs. Lana was nowhere to be seen as you left through the front door, shivering as the cold air hit you. You quickly cleaned the thin layer of snow off your car as you watched more flakes threatening to undo your work as you hopped inside and started the engine.<br>\r\n<br>\r\nIt wasn't a very far drive back to your house, but the slick roads limited how fast you could go. Fortunately, you made it home without much incident and let yourself back inside. Instantly, the smell of dinner hit your nose, and your still stuffed belly let out a growl of anticipation. You slowly followed your nose into the kitchen, glancing around at the massive spread of food.<br>\r\n<br>\r\nTabitha was leaning back in her chair, her swollen belly practically filling the area between her and the table. You mother smiled at you as she placed another large plate in front of Tabitha, who greedily began shoveling the food into her mouth. On instinct, you sat down at your place and began devouring the large feast before you. You really were fattening up so quickly.<br>\r\n<br>\r\nYou were only about halfway through with your meal by the time Tabitha slowly heaved herself to her feet and began dragging her heavy body out of the kitchen. You loved watching Tabitha as she struggled to move her obese body, especially after a large meal. Her round belly protruded greatly from her middle, swaying side to side with each heavy step she took. Her face had gotten so round as well, though you loved how youthful it made her look. Her arms were probably as thick as a thin person's legs, while her legs were probably almost as thick as a steering wheel. She was panting by the time she'd reached the exit of the kitchen, struggling to move her massive body.<br>\r\n<br>\r\nStill, you probably weren't in much better shape than her. Especially since you were definitely the fatter of the two. Your almost unending gluttony was really starting to pay off. You weren't even finished eating and you could already feel your own belly pushing into the table, while your shirt had almost no hope of fully covering your taught orb of a belly. You were pretty sure that your legs were almost half again as large as Tabitha's and your arms were definitely thicker. <br>\r\n<br>\r\nYou finished your meal, leaning back in your chair which creaked in protest of your heavy body. You still had time before bed, unless you wanted to have an early night to let all the food you'd eaten digest. Still, you always enjoyed playing video games with Tabitha, especially since her room was filled with snacks. Though, you hadn't really talked to your other friends lately, so maybe you could tell Jill the big news about Matthew.</span></div></div>",
            "created":1547744760,
            "id":2604154,
            "title":"Rebound"
        },
        "1451112111133312311122322232":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Tell Tabitha about the pill that you took",
                "Change the subject and ask if she wants to go get food, your treat",
                "Lie and just say you're being hopeful"
            ],
            "content":"<div class=\"\"><div> <span>Panting, you heaved your body into a standing position as you used the table to steady yourself. After a few moments you took a couple slow steps towards the exit. You loved how much your body shook and jiggled with every movement that you took as you made the short, yet long, trek upstairs towards Tabitha's room. You knocked once before letting yourself in and closing the door behind you.<br>\r\n<br>\r\n\"Hey.\" Tabitha said from her prone position on the bed. <br>\r\n<br>\r\nYou glanced around the dimly lit room as you plotted your best path through the cluttered room. The smell of sweat and food created an interesting aroma that you couldn't decide if you liked or hated. Tabitha was laying on her stomach, which billowed out form underneath her as she focused on whatever game she was playing, though from the sounds and what you could see on the screen it looked like a shooter of some sorts. <br>\r\n<br>\r\nCarefully you began making your way across the barely visible floor towards the wooden chair beside her bed. You plopped down on the cool surface, scrunching your face as it creaked ominously in protest of your sudden weight. You shifted back and forth as you tried to get as much of you as you could onto the chair. Each time feeling the chair shifting and cracking under your large posterior.<br>\r\n<br>\r\n\"Mind if I watch?\"<br>\r\n<br>\r\n\"Sure.\"<br>\r\n<br>\r\nYou smiled at your sister's lack of sociability. When she was in the zone it was hard to get her to say more than a word or two at a time, even to you. However, it seemed like she was spending more and more time engaged with video games. Though, that was probably one of the major contributors to how quickly she was gaining weight. She used to be at least a little concerned with staying a little active, but ever since you'd confessed your desire to gain weight and your mother had started acting strangely she seemed to have lost whatever restraint she'd had.<br>\r\n<br>\r\n\"It seems I'm not the only one that was holding back.\"<br>\r\n<br>\r\n\"What do you mean?\"<br>\r\n<br>\r\nYou frowned, realizing that you must have said that out-loud, \"Just that we both seem to have put on a lot of weight lately.\"<br>\r\n<br>\r\nTabitha turned away from her paused video game, facing you as she grabbed a bag of cookies from beside her, \"I guess we have.\"<br>\r\n<br>\r\nYou took one of the cookies she offered you and shoved it into your mouth. Followed by another. Then another. Within a few minutes, the two of you had completely devoured the entire bag. You leaned back in your chair, patting your full belly. You glanced at Tabitha who seemed to be watching you intently.<br>\r\n<br>\r\n\"I remember when I struggled just to eat a whole bag of these in one sitting,\" you mused, closing your eyes, \"Now I could probably eat a whole shelf of them and still be hungry.\"<br>\r\n<br>\r\n\"Good thing mom seems to be keeping us pretty well stocked.\"<br>\r\n<br>\r\n\"It's weird though, isn't it?\"<br>\r\n<br>\r\n\"What is?\"<br>\r\n<br>\r\n\"Mom used to be so strict on us gaining weight, and well, now it seems like she's trying to fatten us up.\"<br>\r\n<br>\r\n\"Are you complaining?\"<br>\r\n<br>\r\n\"No, I just think it's weird is all.\"<br>\r\n<br>\r\n\"I guess it is. Though I've been enjoying it too much to really question it.\"<br>\r\n<br>\r\nChuckling you opened your eyes and poked Tabitha in her soft middle, \"I guess that's obvious.\"<br>\r\n<br>\r\n\"You're one to talk.\" Tabitha said, grabbing your exposed belly in her hands, filling it with warmth.<br>\r\n<br>\r\n\"Well I already told you that I wanted to get fat. What's your excuse?\"<br>\r\n<br>\r\nTabitha leaned back against the wall, rubbing her soft gut, \"I guess I just never really cared what my weight was. And now that mom practically seems to be force-feeding us, I just let myself go. On top of that it just seems to be so hard to do anything physical anymore so I just lay here in bed eating and playing video games.\"<br>\r\n<br>\r\n\"I know what you mean. I'm beginning to really hate stairs.\"<br>\r\n<br>\r\n\"Forget stairs. Even walking to the bathroom is becoming a chore.\"<br>\r\n<br>\r\n\"Yeah.... and I love it.\"<br>\r\n<br>\r\n\"Honestly, it doesn't bug me very much either. Especially since I don't really have to do anything besides go to school now. Still, with having the next couple weeks off, I'm not sure if I'll be able to leave this bed once the breaks over.\"<br>\r\n<br>\r\n\"I bet mom would still make you go to school.\"<br>\r\n<br>\r\n\"I dunno. She hasn't really pushed me to do my homework or anything. Not that I have any since I get it done in class.\"<br>\r\n<br>\r\nStraining to reach around your belly, you grabbed a bag of cookies from the floor, ripping it open and shoveling them into your mouth, \"I guess she hasn't really been getting after me either. If anything, she seems to want me to spend as much time with Matthew and Lana as I can. Though, that definitely has added to my waistline. Speaking of, we really need to introduce you to Matthew, he's dying to meet you before you get stuck in here.\"<br>\r\n<br>\r\n\"I bet you'd get stuck before I would, porky.\"<br>\r\n<br>\r\nYou tossed the empty package of cookies away, grabbing another, \"It's still weird being the fat one now. Not that you aren't fat, but I'm just used to being the thinner of the two.\"<br>\r\n<br>\r\n\"I remember when you first told me that you wanted to be fat. You were so thin, and though I'd seen you get chubby a couple of times, I never really imagined that you'd get as fat as you have.\"<br>\r\n<br>\r\n\"Well, honestly, I never imagined it would happen either. To either of us.\"<br>\r\n<br>\r\nYou tossed the empty package by the other one, grabbing yet another bag of cookies as you watched Tabitha rubbing her belly. Despite how fat she was, you were definitely fatter. Though that didn't mean you didn't like admiring her soft body. It was easier to look at her than yourself now. It was at the point where you really needed a mirror to get the full effect of your body. You couldn't believe how quickly either of you had put on weight, even with your mother seeming to be trying to fatten you up. Though, when you pushed your belly to its limit with every meal, it made sense that you'd eventually be able to eat more and more.<br>\r\n<br>\r\nYou tossed another empty package on the growing pile and grabbed another bag of cookies as you continued to watch Tabitha. You could hardly recognize her from what she had looked like a few months ago. She had always been on the heavier side, but she hadn't been anywhere close to what she was now. She'd probably put on at least a hundred pounds, probably more. Though you were in the same boat.<br>\r\n<br>\r\nYou didn't weigh yourself everyday anymore since your weight seemed to fluctuate quite a bit. On top of that it was getting to be a chore to pull the scale out, and the less times you had to do it, the better. Still, a couple days ago you had been 260, and you figured that you were probably even heavier now. Even though you'd looked fatter than your sister for quite a while, you knew that you'd only just recently actually passed her in weight. That was one advantage she had with her extra height. Though, now you really were the bigger sister in more than just appearance. Still, it wasn't like she was far behind... yet.<br>\r\n<br>\r\nYou were brought back to the present as Tabitha poked your full belly, \"So, tubby, you going to eat all my snacks or are you going to share?\"<br>\r\n<br>\r\nYou glanced at the large pile of empty packages that was forming, then to the almost empty package in your hands before offering it to Tabitha, \"You know Mom was the one who bought them, so technically they're free game.\"<br>\r\n<br>\r\n\"But they're in my room.\"<br>\r\n<br>\r\n\"That doesn't count. What would you do if I just took all of them into my room?\"<br>\r\n<br>\r\nTabitha chuckled, tossing the empty package onto the pile before ripping open another, \"I'd probably be a lot thinner.\"<br>\r\n<br>\r\n\"Maybe that's what I should do to save you from yourself.\"<br>\r\n<br>\r\n\"If anyone needs to be rescued from themselves, it's you, porky. At the rate you're going you might end up fatter than Lana.\"<br>\r\n<br>\r\n\"That's the goal.\" you mumbled.<br>\r\n<br>\r\n\"What was that?\" Tabitha laughed, \"Did you just say you were going to be fatter than Lana? I know you've been putting on weight, but I doubt that you'll ever beat her in size.\"<br>\r\n<br>\r\n\"Well.... The thing is.... Never mind...\"<br>\r\n<br>\r\n\"What, you can't just say that then change your mind!\" You grunted as Tabitha hit you with a pillow, \"You have to tell me!\"<br>\r\n<br>\r\n\"Oh, just for that, I'm definitely not telling now.\" you chuckled as Tabitha panted from her short exertion.<br>\r\n<br>\r\n\"Do you have some plan on how to catch up with Lana? I mean your definitely growing quickly, but come on...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1549226280,
            "id":2612233,
            "title":"Growing with Sister"
        },
        "14511121111333123111223222322":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "All you can eat buffet",
                "Load up at a fast food place",
                "A 'light' snack at a fast food place"
            ],
            "content":"<div class=\"\"><div> <span>You fidgeted with your fingers, watching them intently. You could feel Tabitha's gaze on you as she waited for an answer to her question. You weren't sure if you should tell her about the pill you'd taken. She might think you were weird for being so determined to be fat. Though, she also might just think you were willing to do what you had to to get your goals. Still....<br>\r\n<br>\r\nYour stomach let out a low growl, causing both of you to jump slightly at the unexpected noise. Tabitha started giggling when she realized what the sound was, poking your belly.<br>\r\n<br>\r\n\"I can't believe you're still hungry after how much you've had tonight.\"<br>\r\n<br>\r\nYou sighed, seeing an opportunity, \"Yeah. I usually eat more at Lana's, but I know mom wanted me to come home for dinner. Maybe we should go grab some food?\"<br>\r\n<br>\r\nTabitha leaned her back against the wall as she sat on her bed, her belly resting on her thighs, \"Sure. I could go for a little more food, and I'm sure mom wouldn't mind us getting a late night snack.\"<br>\r\n<br>\r\nYou scoffed, \"No kidding. I half expect her to be waiting outside the door with food.\"<br>\r\n<br>\r\nThe chair creaked under you as you pushed yourself to your feet. You tugged on your clothes, shifting your body from side to side as you tried to make sure you were at least mostly covered before you offered a pudgy hand to Tabitha. She leaned forward, clasping your hand as you felt her weight threatening to pull you over as she hoisted herself to her feet. Panting, you braced her as she wobbled as her body struggled to support its own weight.<br>\r\n<br>\r\n\"Huh, maybe I will get stuck before you.\" Tabitha chuckled, trying to catch her breath, \"It's getting to the point where it's getting hard to get up without help.\"<br>\r\n<br>\r\nYou stuck your index finger in her belly button, causing her to recoil away, \"Well maybe you could handle your body better if you actually got up and moved occasionally.\"<br>\r\n<br>\r\n\"But it's so hard.\" Tabitha whined.<br>\r\n<br>\r\n\"Hey, even I'm fatter than you and I can still get up by myself.\"<br>\r\n<br>\r\n\"Well that's because you always have to get up to go to Lana's house. Honestly, I bet that's were you end up getting stuck.\"<br>\r\n<br>\r\nYou found yourself blushing as you started stepping through the minefield of a room towards the door. You could hear the heavy footfalls of Tabitha behind you placed your hand on the cool knob. Slowly you turned the knob until you heard a slight click, then creaked the door open to reveal the dark hallway beyond.<br>\r\n<br>\r\n\"So where did you want to go?\" Tabitha asked, struggling to stop her heavy body as she came to a halt beside you.</span></div></div>",
            "created":1550955240,
            "id":2622024,
            "title":"Appetizing Distraction"
        },
        "145111211113331231112232223221":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Tell the truth",
                "Say they went to pick up a video game",
                "Say they went to visit Lana"
            ],
            "content":"<div class=\"\"><div> <span>You turned towards Tabitha, a smile splitting your face as your stomach let out another growl, \"How would you feel about a feast at that buffet place?\"<br>\r\n<br>\r\nTabitha smiled, \"I am pretty hungry.\"<br>\r\n<br>\r\nAs silently as you could manage, you crept downstairs and towards the front door. You could hear the sound of your dad snoring coming from your parents room. The faint smell of diner lingered in the house, causing your stomach to growl again as you reached the bottom of the stairs. Tabitha was right behind you, though you could hear her heavy breathing as she placed a hand on the wall.<br>\r\n<br>\r\n\"Man, I really am getting out of shape.\" she whispered.<br>\r\n<br>\r\nYou just shook your head and plodded towards the front door. A wave of cold air washed over you as you slowly opened the door, revealing the white scene beyond. A light snow was falling, glittering in the light cast from the porch light as it drifted down to the ground. Carefully, you stepped onto the lightly dusted porch as you tested how slick the ground was. Being extra careful, you slowly started walking towards your car as you tried not to slip on the icy ground. <br>\r\n<br>\r\nFinally arriving at your vehicle, you glanced back at the dark house. Everything seemed quiet, though you were hoping that the sound of your car starting wouldn't wake anyone up. <br>\r\n<br>\r\nYour car rocked back and forth as you climbed inside the drivers seat, and again as Tabitha lowered herself into the passenger side.  You closed your eyes as you stuck your key in the ignition and turned it. The engine roared to life, seeming to echo in the still night. There was no going back now. If someone had heard that, there was nothing you could do. <br>\r\n<br>\r\nPutting the car in reverse, you left the driveway and proceeded down the snowy roads towards the buffet place. You were happy that they were open 24 hours, otherwise you'd have to settle for fast food. Not that fast food was bad, but sometimes you wanted to mix it up a little bit.<br>\r\n<br>\r\nA few minutes later, the two of you were wandering around the warm buffet, loading your plates up with food. Everything smelled so good, making your stomach rumble in anticipation as your mouth started salivating. Returning to the booth with a full plate, you instantly began digging into the delicious feast with Tabitha shortly behind.<br>\r\n<br>\r\nOnce you started, you just couldn't stop yourself as you went back for plate after plate of food. It was like you just went on autopilot as you shoveled more and more food into your waiting mouth. It seemed like no matter how much you ate, you never seemed to get any fuller. Though, Tabitha seemed to be in the same boat as she continued eating and eating right along with you. You quickly lost track of time as you feasted, hardly even remembering that you weren't alone. <br>\r\n<br>\r\nFinally, the two of you sat back in your seats, absolutely stuffed with food. You had definitely eaten more than Tabitha, though it wasn't like she hadn't had a ton of food. You could feel your belly pressing into the table. You let out a soft belch, looking at your obese sister across from you.<br>\r\n<br>\r\nHer shirt had long since become unable to cover her squishy belly as she rubbed her stuffed middle. Her eyes were half-lidded, making her look like she was in a stupor. You couldn't help feeling a little turned on by how sexy and fat your younger sister looked. Still, you were even bigger than her. Slowly you got to your feet, feeling the weight of your belly dragging you down slightly. Your legs were shaking from the extra weight, and you were feeling ready to lay down and go to bed.<br>\r\n<br>\r\nHelping your sister to her feet, the two of you waddled back to your car. A few minutes later you were pulling back into your driveway. You felt your heart skip a beat as you noticed the living room light was on. You glanced over at Tabitha who had a look of terror on her face. <br>\r\n<br>\r\n\"What do we do?\" Tabitha asked</span></div></div>",
            "created":1553825760,
            "id":2636463,
            "title":"Midnight Feast"
        },
        "1451112111133312311122322232211":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Breakfast",
                "Weigh Yourself"
            ],
            "content":"<div class=\"\"><div> <span>You took a deep breath, glancing down at your swollen belly poking out of your shirt as it rested heavily on your lap. You could see that Tabitha was in a similar situation in the passenger seat of the car, though you were definitely the bigger of the two.<br>\r\n<br>\r\nYou took a deep breath, trying to stay calm as you thought of what to do. It was obvious that you two had been binging and you were sure that your mother would notice right away. That didn't leave you a whole lot of options for how to explain the situation outside of the truth. Still, maybe the truth would be the best option anyway.<br>\r\n<br>\r\nIt was weird, but your mother had almost done a complete 180 in terms of your weight. Where she had complained about how you and your sister were going to get fat, now she seemed to be trying to make you fat. Long gone were her complaints about how lazy you and your sister were. Replaced with complaints that you needed to eat more, and rest more.<br>\r\n<br>\r\nYou took another deep breath, \"I think we should tell the truth.\"<br>\r\n<br>\r\n\"WHAT! ARE YOU CRAZY?!\" Tabitha shouted, a look of horror on her face.<br>\r\n<br>\r\n\"No, think about it. Mom's practically been encouraging us to get fat lately, and maybe she'll let us off easy if we just claim that we were still hungry after dinner.\"<br>\r\n<br>\r\nTabitha rolled her eyes, \"Well if you really think that's for the best, I guess we can try it.\"<br>\r\n<br>\r\nYou just nodded, opening the car door and letting in the cold of the outside which caused goosebumps to form on your exposed skin. Tabitha shivered slightly as she opened her door and heaved her heavy body out of the car. You watched her for a few moments as she closed the door and began waddling towards the front door.<br>\r\n<br>\r\nYou found yourself felling slightly aroused as you watched your sister moving her obese body. Even though you were definitely the fatter of the two now, you still loved admiring your sister's fat body. It was different than looking at your own body in a way. Though, there was no denying that you loved looking at your body too.<br>\r\n<br>\r\nSlowly, you got to your feet, and closed the car door before following after your sister. Both of you were panting by the time you'd finished the short trek to the front door, and despite the cold you could feel a few beads of sweat on your forehead. <br>\r\n<br>\r\nTaking one last deep breath, you opened the door and let your sister step inside before following her into the warmth of the home. Your eyes were instantly drawn to your mother sitting in one of the armchairs as she watched the two of you enter. <br>\r\n<br>\r\nYou and Tabitha took one last glance at each other before your mother spoke, \"Where have the two of you been?\"<br>\r\n<br>\r\n\"We were hungry and so we went to get some food.\" you replied, looking your mother in the eyes.<br>\r\n<br>\r\nShe let out a loud sigh, \"Did you not get enough at dinner?\"<br>\r\n<br>\r\nBoth you and Tabitha shook your heads in unison. You knew you weren't going to avoid all trouble, but you were hoping that your mother's recent change in heart would at least dampen your punishment if you told the truth. Or at least most of the truth. She didn't need to know your full reasoning for trying to distract Tabitha with food.<br>\r\n<br>\r\n\"Hmm, I guess I need to do better about making sure both of you are fed then.\" She replied with a devious smile, \"Now both of you go to bed.\"<br>\r\n<br>\r\nThe two of you glanced at each other before waddling upstairs to your respective bedrooms. Closing your door behind you, you quickly changed into your too-small pajamas and climbed into your bed. It didn't take you long to drift off to sleep.<br>\r\n<br>\r\nYour dreams were filled with food and fat, as even in your sleep you couldn't restrain yourself. Though all too soon you found yourself waking to the smell of breakfast cooking though your room was still mostly dark. Your stomach let out a loud growl of anticipation at the thought of food as you slowly heaved yourself to a sitting position on the side of your bed. <br>\r\n<br>\r\nYou gave a futile tug on your shirt, knowing there was no way you were going to get it around your soft middle as the waist of you pajama bottoms cut into you painfully. It was definitely time to get some new clothes despite having got some just a couple weeks ago. That was just how fast you were growing now.<br>\r\n<br>\r\nHuffing, you managed to raise your body a few inches off the bed before gravity dragged you back down. You tried again, getting a little bit further off the bed this time before failing. Panting, you took a minute to ready yourself before trying again.<br>\r\n<br>\r\nYou couldn't help smiling at the difficulty you were having. Just yesterday you'd been bragging to Tabitha that you could still get up by yourself just fine, but here you were, struggling just to get off your soft bed. You really were getting huge. You remembered when you could do anything you wanted with hardly any trouble. Now, however, even the simplest things were starting to become difficult. <br>\r\n<br>\r\nYou rocked yourself back and forth, using your momentum you finally managed to get to your feet. You couldn't help feeling turned on by how out of shape you were getting as you slowly made your way towards the kitchen. As you entered the hall, you could see a light on in the kitchen, and hear the sounds of someone preparing food, though you were sure it was your mother. Tabitha's door was still closed suggesting that she was still asleep, though when she didn't have class to worry about, she seemed to like to sleep in. <br>\r\n<br>\r\nFollowing the delicious smells coming from the kitchen, you made your way downstairs, your heavy footfalls announcing your presence to everyone in the house, though you couldn't really step lightly anymore. Your mouth was salivating before you even turned the corner and entered the kitchen, but what you saw filled your ravenous belly with delight.<br>\r\n<br>\r\nThe table was laden with the biggest breakfast that you'd ever seen. There were eggs and bacon, pancakes, waffles, and almost every other type of breakfast item all piled high before you. Your mother glanced at you from her position near the stove where she was working on some more bacon.<br>\r\n<br>\r\nYou mother smiled at you as you entered, \"I figured I needed to do a better job of keeping the two of you fed so you won't have to make midnight trips for food anymore, so dig in.\"<br>\r\n<br>\r\nYou mumbled a quick thanks as you plodded towards your spot at the table, and sat down heavily. Your chair groaned in protest, but held firm as you began loading up your plate with food. You didn't know how many times you refilled your plate before Tabitha finally arrived at the table rubbing sleep from her eyes, but no matter how much you ate, it seemed like you hardly made a dent in the pile of food. <br>\r\n<br>\r\nThe two of you sat in relative silence as you feasted to your hearts content. Finally you sat back in your chair patting your full belly. You glanced around the kitchen realizing that your mother had snuck out at some point, leaving the two of you alone to eat. Slowly, you turned your gaze to the pile of empty dishes between you and Tabitha.<br>\r\n<br>\r\nYou spent the remainder of the day resting and eating the massive meals that your mother kept making for you and your sister. The next day was mostly the same except you went and spent some time with your new boyfriend, though that was still mostly just spent eating the extremely fattening substance that was pumped through the feeding hose. You were a bit surprised that Lana came and joined the two of you for a little while though.<br>\r\n<br>\r\nThe next couple of weeks went by in much the same fashion, with you and your sister constantly being fed to the point of feeling like you were going to burst. It didn't take long for the constant supply of food to have a noticeable effect on both of you. As the weeks went on you found yourself more and more eager to eat and push your belly to the limit, while Tabitha seemed to be in the same boat. It was getting to the point where you almost couldn't go more than a few minutes without eating or you felt like you were going to starve. Even Tabitha who had seemed mostly indifferent about eating seemed to be making a much more active effort to constantly binge.<br>\r\n<br>\r\nYou awoke to the familiar smell of breakfast cooking as your belly let out a loud growl of anticipation. You stretched, feeling the weight of your body as you scratched at you soft belly. You lay in bed, trying to get the motivation to begin moving your obese body.<br>\r\n<br>\r\nSighing, you continued to stare at the ceiling as you realized that today was the last day of the winter break. You were definitely going to have to grab some new clothes before you went back to school tomorrow, you thought as you tugged on your overly tight shirt. Both you and Tabitha had definitely gained a lot over the holiday. You more than her, but that wasn't to say  her gain wasn't significant. You were sure she was probably the fattest girl in her grade by now, though you were definitely going to be a big contender for that spot in your grade now too. <br>\r\n<br>\r\nYou glanced at the mountain of a belly that was rising above you as you lay in bed before beginning the long process of getting to your feet. Huffing and puffing, you wiped a bit of sweat from your brow as you finally got out of bed. Now, did you want to go weigh yourself first, or just jump straight into breakfast.</span></div></div>",
            "created":1560627060,
            "id":2673750,
            "title":"Confessions"
        }
    },
    "info":{
        "author_id":"malchior",
        "author_name":"Malchior",
        "brief_description":"Heather has always been a thin girl, but she harbors a secret desire to get fat",
        "created":1534178460,
        "description":"<td align=\"left\" class=\"norm\">On the surface Heather seems like just an ordinary 16 year old High School student, but she's always felt different than everyone else. While most girls dream of being thin and athletic, Heather has always wondered what it would be like to be fat. Embarrassed with her taboo desire to gain weight, she's always tried to fit in with the thin crowd, however, while on the internet she discovered an entire community of people who loved getting fat and sharing their experiences. Realizing she wasn't alone in her desires, she found a new confidence to indulge that part of her. This story follows her experiences in trying to realize her dream of getting the soft body she's always wanted, and how her life changes based on her decisions.<br>\r\n<br>\r\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br>\r\n<br>\r\n- Please Contribute<br>\r\n<br>\r\n- A couple notes about Heather, so we can maintain a consistent personality and story, which isn't to say it might not change as time goes on, but here is the starting point. Heather has one older sister (22), and one younger sister (13). Her mother is a stay at home mom, and her dad makes good money as a programmer, though he is rarely home since his job is so demanding. Her older sister, who's name is Mary, is married  and has one child (a son) who is still an infant. Mary has always been a fitness nut, and loves running marathons or other activities. Her younger sister, who's name is Tabitha, loves video games and is fairly lazy. Tabitha has always been a little on the chubby side, though not really fat. However, lately Tabitha has been softening up more as her lack of physical activity and constant snacking have started to catch up with her, though she really doesn't seem to care one way or the other. Heather's mother, has always been plump, however, she's always getting after Tabitha to do more physical activities and pointing out that she's going to get fat if she keeps doing what she's doing. Despite this though, she doesn't do anything to stop the lazy binging, and seems to have an attitude of letting her children make their own choices. Despite wanting to get fat, Heather has always been self conscious about her weight, and even though she's decided to indulge herself, she's still very timid with her weight. She has a couple good friends who are her age. Jill is a slightly chubby girl who loves anime and video games, and is very kind to everyone, despite being bullied when she was younger. Linda is an average girl who is very outgoing and has little sense for personal boundaries. <br>\r\n<br>\r\n- This story is focused more on the life of Heather as she begins indulging her desires and the everyday experiences that a fattening girl would go through. Please keep this in mind as you add well written chapters.<br>\r\n<br>\r\n- Please keep all gains reasonable for the amount of time that they occur over. There is no magic or rapid expansion as this story aims to be a bit more realistic in scope. That isn't to say that she can't become massive or have breast expansion, but it can't just happen over night or instantly. Any chapters that don't have at least a semblance of realism will be removed. <br>\r\n<br>\r\n- Sex is allowed, but please don't focus too much on it. This isn't a story about sex.<br>\r\n<br>\r\n- Finally, have fun with this. I hope that this can become a group effort that we all build on and enjoy.</td>",
        "id":2166083,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1560627060,
        "modified":1560627060,
        "pretty_title":"Taboo Desires"
    }
}