{
    "chapters":{
        "1":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Ben",
                "Kevin",
                "Gwen",
                "People from the old show"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now, let's see, who's gonna get tickled?</span></div></span></div>",
            "created":1209618000,
            "id":526478,
            "title":"Which Character?"
        },
        "11":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "not tell Kevin",
                "tell Kevin",
                "not tell Kevin, but tickle Ben later"
            ],
            "content":"<div class=\"\"><div> <span>After the threesome of, Ben, Gwen and Kevin, decided to go and find Grandpa Max and defeat the alien invasion. They had just defeated a squadron of aliens and found out that some people have alien powers. Unfortunately, the boy they met, who had Heatblast's powers, couldn't join their group, so they just drove away, waiting for another clue towards Grandpa Max's location. <br>\r\n<br>\r\nOn the way back to their homes, the group was trying to get to know each other. \"So Kevin, what have you been doing these past 5 years?\" Ben asked.<br>\r\n\"Oh, not much, I've made a living for myself by selling parts to aliens through the black market. But, I promise I won't anymore,\" Kevin replied.<br>\r\n\"Good, so, did your plans always work, or were they foiled sometimes?\" Gwen asked.<br>\r\n\"Well, I have a very good, or should I say bad record on the subject, but I did have this one mistake. It was really embarrassing, I couldn't show my face around my clients for a month,\" Kevin replied.<br>\r\n\"Ooh what,\" Ben inquired.<br>\r\n\"Well, as long as you promise not to laugh. One time I was selling some invincible shields, and a little girl came up to me. I tried to shoo her away, but she poked me in the back and I collapsed. I was the laughing stock of the black market, forever.<br>\r\n\" HAHAHA!\" Ben yelled, laughing at this fact.<br>\r\n<br>\r\n\"Hey, Ben you said you wouldn't laugh and you have a big secret, too\" Gwen said, \"Maybe I should tell Kevin, 'your weakness'.\"<br>\r\n\"NO!\" Ben yelled,\" I'm sorry Kevin, Gwen please don't tell.\"<br>\r\nGwen then decided to...</span></div></div>",
            "created":1209618000,
            "id":526691,
            "title":"Ben's Secret"
        },
        "111":{
            "choices":[
                "grabed Ben and pulled him down",
                "missed"
            ],
            "content":"<div class=\"\"><div> <span>Gwen did think, but did not tell Kevin.Gwen said: nah, never mind. Kevin stopped the car and said:Tennyson, out of my car. Ben refused. Ok, are we gonna play it that way?<br>\r\nKevin pushed Ben out of the car and lock the doors of the car. The windows of the car where so fat, that he could not hear one thing. He did see that Kevin was asking something to Gwen. Ben stood outside for at least 20 minutes. He did see Gwen talking to Kevin and Keving began to laugh. Gwen and Kevin looked at Ben. Ben know he was in trouble. he transformerd into big chill and drove of. Gwen and Kevin did the car door open. Gwen used her mental power and.....</span></div></div>",
            "created":1330971420,
            "id":1289437,
            "title":"not tell Kevin"
        },
        "112":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "feet",
                "upper body"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay Ben, I won't tell him, I'll show him,\" she said, chanting a spell and chaining his arms up and his feet to the dash board.<br>\r\n\"NO! Please, don't do this,\" Ben begged.<br>\r\n\"Sorry Ben, but you said you wouldn't laugh, so I've got to,\" Gwen said, pulling up his shirt.<br>\r\n\"What are you doing?\" Kevin asked.<br>\r\n\"Showing you his weakness,\" Gwen replied, \" You see, my little cousin here is extremely and insanely TICKLISH!\"<br>\r\n\"No way!\" Kevin exclaimed, \" I can't believe it! TICKLISH! Wow, that's so surprising, if I had known, I would have sooo taken advantage of that.\"<br>\r\n\"Which is why, I'm telling you now, since you have changed sides,\" Gwen explained.<br>\r\n\"So wittle cousin, are you stiw ticklewish,\" Gwen said, \"I haven't tickled him in 5 years. But, considering how he's struggling and how panicked he is, he's obviously is.\"<br>\r\n\"Yes, I am, but please don't tickle me. You know I can't take it,\" Ben pleaded.<br>\r\n\"Sorry couz, but I can't resist,\" Gwen said, mischieviously.<br>\r\n\"Let's start with your...</span></div></div>",
            "created":1209618000,
            "id":526709,
            "title":"Ben's Weakness"
        },
        "1121":{
            "author_id":"joker_goc",
            "author_name":"joker",
            "choices":[
                "keep tickling his feet",
                "try his uper body"
            ],
            "content":"<div class=\"\"><div> <span>Kevin and Gwen took off his shoes and socks, revealing his soft, ticklish feet. <br>\r\nBen then said to himself, \"I won't laugh, I won't laugh........\". <br>\r\nBut as Kevin asked, \"Ben are you alright?.\" <br>\r\nBen replied \"I'd be fine if you didn't... HAHAHAHAHAHAHPLEEEEASESTAHAHAPIT AHAHA HAHAHAHAHAHAHAHAHAHA STAHAHAHAP PLEEEEASE STAHAHAHAP THE TICKLING HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA AAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHHAHAHA.......................\". This continued for over an hour, and by the time it was over, Ben was almost tickled to death, so Gwen suggested to stop for a moment cause he couldn't even breath, but Kevin replied, \"NO\".<br>\r\nSo Gwen said, \"Okay then, where should we tickle him now?</span></div></div>",
            "created":1214542800,
            "id":549948,
            "title":"Ben's Feet"
        },
        "1122":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Gwen goes right for his feet",
                "Gwen and Kevin tickle his belly"
            ],
            "content":"<div class=\"\"><div> <span>\"Just so you know Kevin, Ben's most ticklish spot is his feet, but we'll start up here, so he doesn't faint right away,\" Gwen said.<br>\r\n\"He's that ticklish!\" Kevin asked.<br>\r\n\"Yep, now let's get started,\" Gwen said, grinning.<br>\r\n\"NO! Please do-HOHOHON'T PLEHIHIASE DON'T TICKLE MEHIHI I CAN'T HAHAHA TAKE IT HAHAHA HAHA NOOOOHOHOHO HIHIHAHA HIHIHEHE hahahehe okay you tickled me now please stop,\" Ben yelled, as Gwen tickled his ribs and arm pits.<br>\r\n\"Sorry Ben, but that's not all the torture. Now were going I'm going to take it up a notch or two. All that is to be decided is how to do it.</span></div></div>",
            "created":1209618000,
            "id":526721,
            "title":"Start of the Torture"
        },
        "11222":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Ben escaped",
                "Gwen and Kevin started to take of his shoes"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I don't want to wear you out right away so, Kevin, why don't you join in and help tickle...\" Gwen started.<br>\r\n\"PLEASE say his feet, PLEASE\" Kevin interrupted.<br>\r\n\"No, no, no, he'll only be able to withstand a little tickling on his feet. So, we'll tickle his 2nd most ticklish spot, his belly!\" Gwen continued.<br>\r\n\"NO, come on guys just let me out,\" Ben pleaded.<br>\r\n\"I don't think so, here we go!\" Kevin replied.<br>\r\n\"OH HOHOHO COME ONHAHAHAH HAHAHA HEHE I'M TOO HOOHOOHOO TICKLISH HAHAHA HIHIHI HEHEHAHA!\" Ben screamed through his laughter, as Gwen and Kevin tickled his soft, smooth belly. Scribbling their fingers all over his belly and flanks, making him laugh and squirm. Just then Kevin had a wonderful idea, he took in a big breath, lowered his lips to Ben's belly-button and blew a big, long raspberry.\"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAH NOOOOHOHOHOHOHOOHOOOO hohahahaha haha,\" Ben screamed through his frantic laughter. \"Please hi let he me hi go ho, that was terrible,\" Ben said, still, giggling from the raspberry.<br>\r\n\"Well, I think your upper body has had enough,\" Gwen replied.<br>\r\n\"Oh, tha..., wait, no you don't mean,\" Ben said, shaking, as Gwen and Kevin reached toward his sneakers. \"NO! Please, Please don't tickle my feet! I'll do anything!\" Ben begged.<br>\r\n\"Tempting, but I think we'll stick to torturing you,\" Kevin replied.<br>\r\n\"Yeah, I agree,\" Gwen concurred.<br>\r\n\"Noo! Please!\" Ben exclaimed.<br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1209618000,
            "id":526770,
            "title":"Ben's Belly"
        },
        "112222":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "poking her in a pressure point and knocking her out",
                "saying,\" Okay, your right\""
            ],
            "content":"<div class=\"\"><div> <span>\"NO! Please don't,\" Ben begged, as Gwen and Kevin slowly unlaced his shoes. They grabbed the heel of each shoe and slowly slipped them off his feet, revealing his soft, white, ankle high socks. \"Please don't hihihihihi hahahahaha HAHAHAHA AHAHAHAHA NOOHOHO HOHOHOHOHO HAHAHAHAHA DOHOHOHOHN'T,\" Ben screamed laughing hysterically.<br>\r\n<br>\r\n\"Wow! Ben, I never thought you were this ticklish, and we haven't even taken off your socks yet,\" Kevin said.<br>\r\n\"NO, Gwen, please you can't let him take of my socks,\" Ben begged.<br>\r\n\"Yeah, come on Kevin, he's had enough. Let's let him out,\" Gwen agreed.<br>\r\nKevin replied by...</span></div></div>",
            "created":1209618000,
            "id":526794,
            "title":"Finally Ben's Feet"
        },
        "1122221":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "content":"<div class=\"\"><div> <span>\"Sorry Gwen,\" Kevin said, as he laid her down on the chair.<br>\r\n\"What did you do to her?!\" Ben shouted.<br>\r\n\"Don't worry, I just knocked her out, she'll wake up and be as good as new in 15, maybe 20 minutes and that's how long I have to tickle your bare feet,\" Kevin said.<br>\r\n\"NO, 20 minutes, if you tickle me for that long I'll die!\" Ben exclaimed.<br>\r\n\"Then, you'll be the first to die from laughter,\" Kevin replied.<br>\r\nKevin reached over to Ben's feet and slowly started to pull off his socks, off his, ankles, slowly moving over his heels, past his arches and finally sliding them off his toes. Even though he tried to hold on to them with his toes, he failed and the socks popped off his feet, leaving his, soft, pale and smooth soles and his cute bubble-like toes.<br>\r\n\"Wow, Ben your feet are really soft, you must take really good care of them,\" Kevin said.<br>\r\n<br>\r\n\"Well, not rea-EEEEEEEE NOOOOOOO HOHOHOHOHO PLEASE STOHAHAHAHAP HAHAHAHAHAHAHA AHAHAHAHAH AAAAHAHAHAHAHAHAH AHAHAHAHAHAHAHA DON'T TICKLE MY BARE FEEEEET HIHIHIHIIHIIH AHAHAHAHAHAHAHAHAAAAHAH HAHAAHAHAHA!\"<br>\r\n\"You are the most ticklish person I have ever met,\" Kevin said, \"But, I think I'll try something else,\" Kevin said.He grabbed Ben's toes and pulled them up making them taught and some how the magic that was binding him kept them there.\"Well that's handy,\" he said.<br>\r\n<br>\r\nKevin then scribbled his fingers all over the sin underneath Ben's toes and even in between his toes causing Ben to convulse in hysterical laughter, \"AAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH! HIHIHIHIHIHIHIHIIHIHIHIHIHIHI AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA! NOOOOOOOO HOHOHOHOOHOOHOHOHOOHOHOOOHOOHOHO PLEEEEASE DON'T TICKLE THERE! AAAAAAH I CAN'T TAKE IT! I'M GOING TO DIEEEEEEEE! AHAHAAHAHAHAHAHAHAHAHAHAAHAHAHA! NOOOoo ho hoo oh ho...!\"<br>\r\nBen screamed, beside himself with hysterical laughter, just before he fainted because of his delirious laughter. \"Well, its been 14 minutes, he held out longer than I thought. I guess I'll let him out now,\" Kevin said.<br>\r\n<br>\r\nAfter letting him out he waited until Ben and Gwen woke up. Once they had, he apologized and hoped he would they would forgive him. \"I'm really, really sorry,\" Kevin said. <br>\r\n\"I guess it's okay,\" Gwen said, \"I mean we did, beat you up like all the time.\"<br>\r\n\"Well, I don't think it's okay! You almost killed me!\" Ben shouted.<br>\r\n\"Oh, come on Ben I think your over reacting,\" Gwen argued.<br>\r\n\"Fine, but you better never do that again, EVER!\" Ben shouted again.<br>\r\n\"I'll try,\" Kevin and Gwen said simultaneously. </span></div></div>",
            "created":1209618000,
            "id":526846,
            "title":"Kevin's Revenge"
        },
        "12":{
            "choices":[
                "Socks",
                "Tied",
                "Tickle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>His black thin socks will be taken off his feet and he will be tickled as he is tied</span></div></span></div>",
            "created":1253250000,
            "id":762335,
            "title":"Kevin"
        },
        "123":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "Continue the sexy torture",
                "Give the poor man a break"
            ],
            "content":"<div class=\"\"><div> <span>Ben was tying Kevin up in thick ropes too make sure kevin wasn't decieving him again. If Kevin passed this test their was no way he would turn on the tenneson team. Gwen was away on a trip and Grandpa agreed with ben's test so both the men brought numerous plumber alien tickle torture devices and was ready to test kevin's loyalty. The boy's let kevin in on the plan but kevin wasn't readily going to be tortured so he was screaming loudly, yelling with his foul mouth. So Ben removed one of his worn smelly boots and exposed his a smelly tan foot and placed the boot on Kevin's face covering his mouth, nose, and extending too his forehead and secured it with rope. Tears were running down kevin's face from the horrible stench eminating from the boot. \"Ewh your feet smell like ass!\", Kevin was revolted that Ben didn't wear socks with his boots intensifying the stench. Alright he's ready both the boy's said and they each sat down in from of Kevin. They both removed one of Kevin's huge Black worn loafer's exposing very thin sheer nylon's, they didn't see the point, as they could see straight through the extremely thin socks. They both shrugged and took a wiff of both loafer's, \"Pee You!\", they both said. You should be the one too talk kevin your feet almost smell worse then Ben's! Ben chuckled at the nylons. \"Your gonna need alot more then this too protect yourself from our finger's muahahaha\", said Ben running his index finger down the sweat filled nylon. \"AHAAA!!!\" Kevin bellowed from the toxic boot. \"Wow your more ticklish then we thought little man\", said Grandpa, running his meaty index finger down his designated nylon. \"BAHAHA!\" kevin echoed again. \"STOOOOP!\". \"I don't think so both boys said, as they were just getting started. Grandpa had a major foot fetish so he immediately started hungrily licking and nibbling on his nylon getting roars out of Kevin, and Ben started rapidly tickling his nylon. By now Sweat and Tears were running down Kevin's face in despair. \"NOHAHAHAHAHAHA *crying*!\" Kevin blurted. *Bahahahahaha* This is fun Grandpa!\" Ben said. \"You haven't seen fun till you've munched on his smelly dogs!' Grandpa replied laughingly. \"Come on Ben try it!\" Grandpa replied again. \"Okay it's not really my thing but I'll try it Ben said running his tongue down the sweaty nylon\" \"Yummy! Salty! Sweet! Delicious!\" Ben said again. \"Iknow!\" Grandpa said, tearing through the thin nylon with his teeth and ripping the rest off exposing his Pinker soles, arches, and toes. \"Wow they taste even better without the extremely thin fabric lightly covering them!\" Grandpa exclaimed. Ben quickly followed tearing the sheer nylon with his teeth. Kevin lying back blushing, crying, sweating, and belowing finally beginning to accept it.</span></div></div>",
            "created":1294290000,
            "id":1030465,
            "title":"Tickle"
        },
        "1231":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "content":"<div class=\"\"><div> <span>They mutually decided to continue the sexy torture, and after Grandpa had sucked on Kevin's real toes for a while they both agreed to let Ben fly solo for a bit. So Ben sat on his stomach with his face dug into the pink, smelly, sweaty feet, and Grandpa went down to Ben's feet and removed Ben's other boot and started licking the sole of it pleasurably. *mmmmmmm* Ben said. Ben started too vigorously lick Kevin's foot getting more roars out of him, but Kevin would never admit this but as much as it tickled it actually felt good and good to be worshipped for once. While ben was doing his part, Grandpa was down and Ben's feet Massaging the size 11 stinker's and slipping his tongue down them every once in a while, Ben didn't mind Cause Grandpa's done it before and it felt good. So back up north Ben was intensifying the torture with all ten finger's teasing the soles and arches and His tongue slipping through the long toes enjoying every second of it while Kevin was bellowing in despair while Ben and Grandpa were Chuckling at the S.O.S screams as they were the only one's to here the muffled yells. Grandpa decided to take charge again and asked Ben too sit parallel to Kevin, and Ben propped both their smelly feet up for Grandpa too worship kevin was nodding and sweating so Ben wrapped one of his arms around Kevin's shoulders and ran his finger's through Kevin's pretty hair, occasionally tugged on it once in awhile making him scream and the other arm up his shirt too squeeze his nipple, making him cringe in pain. While Ben was keeping Kevin preoccupied Grandpa was worshipping both the sexy young men's smelly feet, Captured in pleasure. Be then Put Kevin in a headlock and shoved his tongue in Kevin's ear, while Grandpa was nibbling on his toes forcefully. All the torture made Kevin pass out, So Grandpa slipped both loafer's back on and massaged and worshipped Ben's feet and they both awaiting Kevin too wake up so they can repeat the horrible torture again hopefully now Kevin will never decieve the Tenneson team.</span></div></div>",
            "created":1294290000,
            "id":1030502,
            "title":"Continue the sexy torture"
        },
        "1232":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "They never came back",
                "They come back with the torture devices",
                "Ben make's kevin worship his dirty foot"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Boy's decide to give the poor man a break and ben slipped Kevin's loafer's back on and they both left too cook up more torture option's. They hoped that waiting was a torture of it's own.</span></div></span></div>",
            "created":1294290000,
            "id":1030506,
            "title":"Give the poor man a break"
        },
        "13":{
            "author_id":"beastatnight",
            "author_name":"beastatnight",
            "choices":[
                "charmcaster",
                "ben",
                "grampa",
                "hex"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who gets to tickle her?</span></div></span></div>",
            "created":1209618000,
            "id":526614,
            "title":"lucky girl"
        },
        "131":{
            "choices":[
                "tickleds there feet and toes",
                "took gewn and ben powers",
                "she just tape gewn and ben feet up"
            ],
            "content":"<div class=\"\"><div> <span>so gewn so to ben im going to see what going on but she ran in to charmcaster gewn sy what are donig he charmcaster sy to kidnap ben gewn sy what no you dont bute then charmcaster sy your power gewn is to good for me but took this and gewn is now back at age 10 she sy what charmcaster sy now your power gewn try s to blast coarm but she punched gewn in the stomach and tied gewn arms up and tied gewn legs up tied gew hands behand her back took off gewn shoes and socks and tickled gewn beer feet and toes gewns no not there hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh im tickleds in my feet hhhhhhhhhhhhhhhhhhhhhhhhh so charmcaster tape gewn motuh shut to gagged her gewn sy mmmmmmmmmmhpmhpmhpmpm there brat that wil keep you out of my way and te make do you can get free took this and then hex corm noe he took yuo down way i go for ben so charmxaster trund ben back to age 10 and tied ben up with rope and tape his mouth and tickled his feet  now that kidnap you and gewn no can stop me ben sy mmmmphphmpmhpm charmcsater tied ben and gewn to chair and then she</span></div></div>",
            "created":1213678800,
            "id":545160,
            "title":"charmcaster"
        },
        "1311":{
            "author_id":"ak4797",
            "author_name":"asdasd",
            "choices":[
                "kill ben and hade sex with gwen ",
                "kill than both ",
                "she tickled tham"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>than she took thar power and than </span></div></span></div>",
            "created":1265173200,
            "id":830004,
            "title":"tickleds there feet and toes"
        },
        "13111":{
            "author_id":"ak4797",
            "author_name":"asdasd",
            "choices":[
                "suck no gwens tits ",
                "ticked gwens tits"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>than she ripper off gwends shert and gwen did not have a brow on sooooo she </span></div></span></div>",
            "created":1265173200,
            "id":830007,
            "title":"kill ben and hade sex with gwen "
        },
        "131112":{
            "author_id":"ak4797",
            "author_name":"asdasd",
            "choices":[
                "let he go ",
                "go ob"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>soo gwen she stoop that you bich than she was ticked in he tit and than gwen sy hahahahahahahahsthahahahahohahahahp pleess i will dow eny thing </span></div></span></div>",
            "created":1265173200,
            "id":830011,
            "title":"ticked gwens tits"
        },
        "1311121":{
            "author_id":"ak4797",
            "author_name":"asdasd",
            "choices":[
                "a trick",
                "did as she was toled "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>than she let gwen go un tied he and made he be a foot sucking slave so she made gwen suck on he feet but gwen hade </span></div></span></div>",
            "created":1265173200,
            "id":830013,
            "title":"let he go "
        },
        "13111211":{
            "author_id":"ak4797",
            "author_name":"asdasd",
            "choices":[
                "than tickled he",
                "fuck here"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>wen she was in joing it to muck she cloos here ive and gwen tied up so charmcaster and tickled he and  lick on he tits and suck on he pussy and than made charmcaster he seex andtickling slave </span></div></span></div>",
            "created":1265173200,
            "id":830020,
            "title":"a trick"
        },
        "132":{
            "choices":[
                "arms",
                "belly",
                "feet"
            ],
            "content":"<div class=\"\"><div> <span>Gwen awoke from a nap only to find herslef tied down to her bed. She struggled to free herself but to no avail.<br>\r\n<br>\r\nSomeone help me please cried Gwen. Nobody can hear you cuz, and Ben walked out of the drakness. Ben, what is going on here demanded Gwen.<br>\r\n<br>\r\nWell cousin, weve done the alien hunting for years now and ll this time I have wondered one thing, are you by chance ticklish.<br>\r\n<br>\r\nGwen screamed, Ben please dont tickle me.<br>\r\n<br>\r\nWhere does Ben begin?</span></div></div>",
            "created":1220850000,
            "id":579895,
            "title":"ben"
        },
        "1322":{
            "choices":[
                "feet",
                "pits",
                "sides"
            ],
            "content":"<div class=\"\"><div> <span>Ben starts blowing rassberries in gwen's tummy. Stop haha ben haha thahat tickles hahahahaha. Ben grabbed a feather and moved it up and down gwens belly. So you are ticklish. Yes I hahaha am now hahaha stohahahap. I wonder where else your ticklish at.</span></div></div>",
            "created":1364538480,
            "id":1559790,
            "title":"belly"
        },
        "13222":{
            "choices":[
                "tickle sides",
                "turn into 4 arms and tickle both sides and pits."
            ],
            "content":"<div class=\"\"><div> <span>Ben wiggled his fingers on her pits. No not the pits HAHAHAHAHA. Quen was laughing harder now. Ben started digging in her pits with index finger and then the thumbs. Gwen eploded with laughter. Wonder if yur ticklish somewhere else. But I want to tickle you here as we'll. What should I do.</span></div></div>",
            "created":1364538780,
            "id":1559793,
            "title":"pits"
        },
        "132222":{
            "choices":[
                "gwen asks for more",
                "ben leaves her alone"
            ],
            "content":"<div class=\"\"><div> <span>Ben turned to 4 arms. No not 4 arms. 4 arms tickle her pits and sides at the same time now. Gwen couldn't talk now from to much tickling. She started to enjoy it now for some reason now. Ben stopped after 2 minutes because gwen looked like she was gonna pass out. </span></div></div>",
            "created":1364539080,
            "id":1559798,
            "title":"turn into 4 arms and tickle both sides and pits."
        },
        "1322221":{
            "choices":[
                "charm caster comes up there",
                "ben comes up there"
            ],
            "content":"<div class=\"\"><div> <span>Ben let her catch her breath. Hey gwen you thirsty? Yes I am, can you please get me some water. After gwen had something to drink she asked ben why did you stop tickling me, I was starting to actually like it. Really then how about some more 4 arms? Ben turned into 4 arms and tickled gwen for about a hour. She then passed out. Gwen woke up on a building tied to a pole. Who's there?! Nowone answered.</span></div></div>",
            "created":1364539500,
            "id":1559804,
            "title":"gwen asks for more"
        },
        "13222212":{
            "choices":[
                "4 arms",
                "nothing he calls kevin"
            ],
            "content":"<div class=\"\"><div> <span>Ben walks up onto the building using the fire exit. Ben what are you doing, untie me. No can do gwen I want to tickle you some more. No not anymore I'm getting tired and it's getting late. Gwen it's 2 p.m how is it late? I just don't want tickling right now. But I do. Ben turned into...</span></div></div>",
            "created":1364607900,
            "id":1560310,
            "title":"ben comes up there"
        },
        "132222121":{
            "author_id":"razgriz3",
            "author_name":"Dokary Razgriz",
            "choices":[
                "The phone call is Sunny, and Ben lures her to his house...",
                "The Call is Julie and Ben tricks her into meeting him in the woods. ",
                "The phone call is from Charmcaster, and she wants to join the fun... "
            ],
            "content":"<div class=\"\"><div> <span>Ben looks at Gwen and reaches into his pocket, pulling out a roll of duct tape. \"Since you don't want to be co-operative Gwen, I guess I'm just going to have to tickle you regardless, but first, I think I better shut you up.\" He says as he tears a strip of tape from the roll. \" Ben please don't do this I'll do any....Mmpph Hmmm hmmm \" Gwen said as Ben pressed the tape down skin tight over her lips. \"Shut up Gwen. Now, the fun can begin. Ben transforms into 4 arms,  he begins tickling Gwen all over her cute belly and sides, as Gwen squirms and thrashed about in her bondage, laughing behind her gag.  Ben continues tickling Gwen until she passes out from the torture.  As she passes out, Gwen's cell phone rings, and Ben looks at the caller id after changing back to himself smiling to himself as a new tickle playmate has just entered the game...</span></div></div>",
            "created":1506988020,
            "id":2395524,
            "title":"4 arms"
        },
        "1322222":{
            "author_id":"razgriz3",
            "author_name":"Dokary Razgriz",
            "choices":[
                "His bedroom to tie her to his bed",
                "The basement to hogtie  her"
            ],
            "content":"<div class=\"\"><div> <span>Gwen passes out from the intense tickle torture. Ben smiles at that, then transforms back to normal before gently prying open Gwen's mouth and stuffing it with a rag. Ben then gets a roll of duct tape and uses several strips to seal Gwen's mouth shut, making sure she won't be able to scream for help when she wakes up.  Ben checks all the knots, making sure the ropes are escape proof, then closes and locks her room from the outside, so no one will find Gwen. <br>\r\n<br>\r\nAfter making sure Gwen's not going anywhere where Ben hears the doorbell and walks down stairs to see Julie standing there outside the front door. Ben opens the door \"Hello there Julie\"  \" Hello Ben, is Gwen  home? We were supposed to go shopping for bikinis today, but she hasn't answered my calls? \" Ben can't believe his luck, as both his cute cousin and his girlfriend are about to be his tickling victims. \"Abby don't you come in for a bit and wait for her Julie, I'm sure Gwen will show up soon.\" Julie enters the house as he quietly locks the door behind her,  with her back to him, Ben grabs Julie, clamping a hand over her mouth he drags her towards...</span></div></div>",
            "created":1506827220,
            "id":2394545,
            "title":"ben leaves her alone"
        },
        "1323":{
            "choices":[
                "Other foot tickle",
                "Stops",
                "Grandpa comes in"
            ],
            "content":"<div class=\"\"><div> <span>\"Lets see if you are ticklish\" says Ben with a smirk. Ben reaches over to gwens shoes and one by one he took her shoes off<br>\r\n\"Lets try with the sock on first\" \"NO!!! Please ill do any thing Just please no tickling.<br>\r\nNot bothering to listen he makes spider like actions which cause gwen to scream with laughter. He slowly reamoves the sock and then gwens face lights up a bright red<br>\r\n</span></div></div>",
            "created":1361677140,
            "id":1538438,
            "title":"Going for the feet"
        },
        "13233":{
            "author_id":"razgriz3",
            "author_name":"Dokary Razgriz",
            "choices":[
                "Ben and grandpa leave Gwen there until she escapse",
                "Gwen becomes a tickle torture slave for both of them. "
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n Grandpa Max walks in the room, seeing Gwen tied up he looks to Ben with her sock in his hand. \"What are you waiting for Ben? Gag her.\" He says as Ben smiles and shoves the sock into Gwen's mouth before she can even begin to plea. Ben holds the sock in place with his hand while Grandpa gets a pillow case and hands it him. \"Use that over her mouth and nose, make sure it's tight. Ben ties the pillow case in place, then Grandpa inspects the restraints and gag. \"That should hold her for a few days. Come on,  she's not going anywhere. </span></div></div>",
            "created":1506829440,
            "id":2394574,
            "title":"Grandpa comes in"
        },
        "133":{
            "author_id":"razgriz3",
            "author_name":"Dokary Razgriz",
            "choices":[
                "Grandpa continues to tickle torture Gwen.",
                "Someone else kidnaps Gwen and tickle tortures her",
                "Gwen manages to escape, only to be tied up tighter by Grandpa."
            ],
            "content":"<div class=\"\"><div> <span>Gwen wakes up in the back of the Rust bucket, wearing only her bikini as the old RV goes down a highway, she tries to move, only to find herself strictly hogtied, her ankles drawn up behind her back, tied touching nearly her elbows, her wrists bound to her thighs and knees. Gwen tries to ask what is going on, only to find her mouth has been sealed shut with duct tape. She tries to break look of her restraints only to find her manta powers are being blocked somehow. The Rust bucket comes to a stop, and after a minute Grandpa Max comes back and opens the door to the room Gwen is in.<br>\r\n<br>\r\n \"You have an your to escape Gwen, if not, you'll get more of this.\" He ticked her helpless feet, causing Gwen to rock in laughter as he torments her.. </span></div></div>",
            "created":1506807300,
            "id":2394395,
            "title":"grampa"
        },
        "1331":{
            "author_id":"tko27",
            "author_name":"Tko37",
            "choices":[
                "Lick her navel",
                "Pick up a feather"
            ],
            "content":"<div class=\"\"><div> <span>He then move's up to her bare belly and starts tickling it this causes Gwen to laugh harder.He pick's up a feather duster and uses it to tickle her navel with it. Gwen starts crynig from the laughter.She pulls at her bonds but is unsucesfull in escaping g<br>\r\nGradnpa then.</span></div></div>",
            "created":1564883940,
            "id":2696774,
            "title":"Grandpa continues to tickle torture Gwen."
        },
        "13311":{
            "author_id":"tko27",
            "author_name":"Tko37",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This causes her to loose it . Granda starts licking her sides and giving her raspberries she passes out after 10 min of intense tummy licking.<br>\r\n</span></div></span></div>",
            "created":1564884060,
            "id":2696776,
            "title":"Lick her navel"
        },
        "14":{
            "author_id":"lordpasture",
            "author_name":"LordPasture",
            "choices":[
                "ben",
                "gwen",
                "cooper",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Back to the past huh? Pick!</span></div></span></div>",
            "created":1229230800,
            "id":619743,
            "title":"People from the old show"
        },
        "144":{
            "choices":[
                "tickle julie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about ben's girlfriend  </span></div></span></div>",
            "created":1272603600,
            "id":875960,
            "title":"other"
        },
        "1441":{
            "choices":[
                "ben",
                "gwen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who will tickle her</span></div></span></div>",
            "created":1272603600,
            "id":875962,
            "title":"tickle julie"
        },
        "14411":{
            "choices":[
                "she is chained to the celing",
                "she is chained to the table in X position"
            ],
            "content":"<div class=\"\"><div> <span>ben and julie were at ben's house alone and julie admits to ben \"ben there is something I should tell you\", ben replies \"what is it julie?\" she says this is a little weird but I just love to be tickled and I'm super tickilish. Ben replies by saying \"really because I love to tickle people\" 10 minutes later julie is in a bikini and,</span></div></div>",
            "created":1272603600,
            "id":875965,
            "title":"tickled by a boyfriend"
        },
        "144112":{
            "choices":[
                "Piedi",
                "Ascelle"
            ],
            "content":"<div class=\"\"><div> <span>10 minuti dopo Julie è legata ad un tavolo in posizione X, Ben le si avvicina e le chiede:\"Allora,dove vuoi che ti faccia il solletico?\",\"Dove vuoi\"rispose Julie\"Ma sappi che soffro il solletico da morire soprattutto sotto i piedi,alle ascelle ed alla pancia,dove mi vuoi solleticare?\"</span></div></div>",
            "created":1306731600,
            "id":1116154,
            "title":"she is chained to the table in X position"
        },
        "1441121":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "He stops",
                "He keeps tickling her"
            ],
            "content":"<div class=\"\"><div> <span>Ben bends down and squats next to Juilies sweet ticklish feet. \"Well, your feet look pretty ticklish if you ask me!\" he said. \"Lets start here!\" He strokes his index finger down the length of her foot. Juilie shreiks and giggles. Ben then begins to spider tickle her feet with all fingers. She is writhing and squirming to try and get free. \"Why are you trying to escape?\" asked Ben. \"I thought you LOVED being tickled.\" HHAHAHAHAHAHAHAHAHAHAHAHAHA! PLEASEHAHAHAHASTAHAHAHAHAP!!! I CAN'T TAKE HAHAHAHAHA IT HAHAHAHHAHAHAHAHAHAHAHAHAHAH! DON'T!!!!!! STAHAHAHAHAHAHAHP!!!! PPPLLEASE!!!!!!\" she begged. \"Don't stop?\" Ben asked \"Okay suit yourself!!!\"  HAHAHAHAHAHHHAHAHAHAHHHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHSTAHAHAHAHP P!!! ITS UNBAREABLE HAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAH!!!!!!!!!!!!!\"  Juilie begs and pleads and laughs her head off for the next 2 hours. Then what happens?!</span></div></div>",
            "created":1343899800,
            "id":1395971,
            "title":"Feet"
        },
        "14411212":{
            "author_id":"bobbysmithd",
            "author_name":"Bob",
            "choices":[
                "Hips",
                "Armpits"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does Ben tickle the bikinied beauty now?</span></div></span></div>",
            "created":1343899920,
            "id":1395972,
            "title":"He keeps tickling her"
        }
    },
    "info":{
        "author_id":"tklwizard",
        "author_name":"wizkid",
        "brief_description":"A story of the characters of Ben 10 Alien Force were they get tickled.",
        "created":1209626520,
        "description":"<td align=\"left\" class=\"norm\">This FanFiction is about the characters of Ben 10 Alien Force, created by Duncan Rouleau, Joe Casey, Joe Kelly and Steven T. Seagle. This story will mainly be about tickling with the main plot involving some one getting tickled.<br>\r\n<br>\r\n- No killing<br>\r\n- No sex<br>\r\n<br>\r\nPlease add on, but follow the restrictions, too.</td>",
        "id":1420769,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1564884060,
        "modified":1564884060,
        "pretty_title":"Ben 10 Alien Force Tickle Story"
    }
}