{
    "chapters":{
        "1":{
            "author_id":"unknowndevil",
            "author_name":"DeVil",
            "choices":[
                "Rukia",
                "Orihime",
                "Other Girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>choose the main girl?</span></div></span></div>",
            "created":1193115600,
            "id":456259,
            "title":"choose??"
        },
        "11":{
            "author_id":"unknowndevil",
            "author_name":"DeVil",
            "choices":[
                "male",
                "female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>first... choose The shrunken sex.</span></div></span></div>",
            "created":1193288400,
            "id":456955,
            "title":"The Shinigami girl"
        },
        "111":{
            "author_id":"unknowndevil",
            "author_name":"DeVil",
            "choices":[
                "Ichigo",
                "Renji",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who will be The lukiest man ever??</span></div></span></div>",
            "created":1193288400,
            "id":456960,
            "title":"The lukiest man..><\""
        },
        "1113":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Yes",
                "Someone else.",
                "*Extra option incase anyone can use change title when using this*"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You (as yourself)</span></div></span></div>",
            "created":1597902840,
            "id":2888254,
            "title":"Other"
        },
        "112":{
            "author_id":"iysaotome",
            "author_name":"IYSaotome",
            "choices":[
                "Orihime",
                "Tatsuki",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which girl will Rukia shrink?</span></div></span></div>",
            "created":1200978000,
            "id":489539,
            "title":"Rukia's shrunken female victim"
        },
        "1123":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Yes",
                "No",
                "More choices",
                "More choices",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You as yourself?</span></div></span></div>",
            "created":1600406280,
            "id":2905215,
            "title":"Other"
        },
        "12":{
            "author_id":"unknowndevil",
            "author_name":"DeVil",
            "choices":[
                "male",
                "female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who gets shrink??... male or female..?</span></div></span></div>",
            "created":1193288400,
            "id":456939,
            "title":"The Shrunk..!!"
        },
        "121":{
            "author_id":"unknowndevil",
            "author_name":"DeVil",
            "choices":[
                "Ichigo",
                "Uryu",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok.. who will be the shrunk..?</span></div></span></div>",
            "created":1193288400,
            "id":456947,
            "title":"The little man..!!"
        },
        "1211":{
            "author_id":"tinyman568",
            "author_name":"m",
            "choices":[
                "shrinks ichigo down to 6 inches",
                "does it somewhere else",
                "shirnks ichigo down but what size?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One day while practing her powers she discovers that she has the abilite to shirnk things. she then notices that ichigo is passing by and ask him to come over here.</span></div></span></div>",
            "created":1200891600,
            "id":489377,
            "title":"Deicison time"
        },
        "12111":{
            "author_id":"trogdorshot",
            "author_name":"lewis123",
            "choices":[
                "digests him...",
                "Lets him out after tormenting him..."
            ],
            "content":"<div class=\"\"><div> <span>Orihime walks towards Ichigo and sprays him with the shrinking solution as he immediately almost becomes just 6 inches tall as she giggles and snatches him up.<br>\r\n<br>\r\n\"Awww you look so cute Ichigo!\" Orihime giggles and licks Ichigo. \"And you are so very yummy!\" She licks her lips and looks at Ichigo with a mischievous smile.<br>\r\n<br>\r\n\"No Orihime please don't!\" He screams but it is to late she pops him in her mouth and swallows hard.<br>\r\n<br>\r\n\"Mmmm Ichigo!\" She moans as she feels a small bulge travel into her belly.<br>\r\n<br>\r\nShe then...</span></div></div>",
            "created":1403030280,
            "id":1813624,
            "title":"shrinks ichigo down to 6 inches"
        },
        "1213":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Yes",
                "Someone else.",
                "*Extra option incase anyone can use change title when using this*"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You (as yourself)</span></div></span></div>",
            "created":1597902900,
            "id":2888255,
            "title":"Other"
        },
        "122":{
            "author_id":"unknowndevil",
            "author_name":"DeVil",
            "choices":[
                "Rukia",
                "Tatsuki",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>witch girl will shrinking by Orihime..??</span></div></span></div>",
            "created":1193288400,
            "id":456953,
            "title":"female"
        },
        "1223":{
            "author_id":"unknowndevil",
            "author_name":"DeVil",
            "choices":[
                "yes...",
                "no..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about Chizuru?</span></div></span></div>",
            "created":1246165200,
            "id":715659,
            "title":"Other"
        },
        "12231":{
            "author_id":"unknowndevil",
            "author_name":"DeVil",
            "choices":[
                "Orihime still wants more toys!",
                "Nothing... she set with her friends like normal."
            ],
            "content":"<div class=\"\"><div> <span>Orihime was enjoying her day as any normal day in her life. It was early morning at the school, Inoue and Tatsuki were gathered along with Rokia and the other girls for lunch time on the roof. As usually they chatting eating and having fun, Orihime stood up to change her position but she faced winds blowing her skirt and reviling her panties and her cute butt \"ahhh\" Orihime embarrassed as she covered her panties, but Chizuru jumped and huged her butt \"yaay, you have a beautiful butt Orihime I wish if I can be near it all the time\" Chizuru said happily \"hey Chizuru chan stop it that’s embarrassing. Rokia was looking at them and having things goes all over her mind, thinking about all what just happened.<br>\r\nAfter the school at orihime's house Rokia came looking for Inoue, she knocked the door and Inoue opened the door …<br>\r\n\"hey Rokia chan come in\"<br>\r\n \" thanks orihime\"<br>\r\n\"so whats brings you here to my house??\"<br>\r\n\"Well… I wanna talk to you about Chizuru!!\"<br>\r\n\"What about her??\" <br>\r\n\" today she was like…\"<br>\r\n\"ahh that’s pervert girl she always do that\"<br>\r\nDo what??\"<br>\r\n\"you know touching my breasts and my butts!!\"<br>\r\n\"oh yea and I was thinking… you know… giving her what she really wants\"<br>\r\n\" no way!! Its not like im lesbian..!!\"<br>\r\n\"I meant in different way\"<br>\r\n\"What do you mean??\"<br>\r\n\"oh yea it just came in my mind!! Do you want to have a shrinking person with you as your toy??\"<br>\r\n\" that’s well be sweet and cute\" orihime jumped up and down happily.<br>\r\n\" so what if I can give you a shrinking person??\"<br>\r\nOrihime looked at Rokia…\" that’s impossible you know that,don't you?\"<br>\r\n\"hee hee , no its not.. I got the spell with me\" Rokia was smiling evilly<br>\r\n\"REALLY!! But who ganna be the shrunken person\" orihime looking at Rokia with wonder<br>\r\n\"Chizuru ofcourse\"<br>\r\n\"ehhh… but shes my friend!!\" Orihime disappointed<br>\r\n\" she said she wanna be near your butt all the time… so she might wanna be your toy…\"<br>\r\n\"but…\"<br>\r\n\"no butts… exept the one she'll go\" Rokia gaggles<br>\r\n\"ehhh\" orihime blushed as she heard that<br>\r\n\"listen to me Orihime… she want it so whats the problem\"Rokia gets closer to orihime as she starts to huge her <br>\r\n\" having a person up my butt..!!\" orihime with a red smoky face<br>\r\nRokia touching and rubbing orihime's round butt \" come on orihime you are helping her like this… she want it.. she wished for it…!!!\"<br>\r\n\" I know but its still\" orihime looking away<br>\r\n\"and I know you already love it orihime… you didn't have this big, bueatiful round ass just for show..!!\"<br>\r\n\"mm… ok\" orihime was dead embarrassed<br>\r\n\"that’s my girl… tonight I'll teach you the shrinking spell\" rokia get up<br>\r\n\"ok rokia chan\"<br>\r\nOrihime called chizuru and told her to meet up with her behind the school tomorrow.<br>\r\nAfter when rokia taught orihime the spell, orihime went to take a bath. After the shower she looked at the mirror at the soap in her hand, she imagined that was chizuru and she noticed the difference in sizes and how big her hips for the soaps then she set at the chair to clean her self she again measured the size between the soap and her butt they were big enough to swallow whole the soap. Orihime got excited and start rubbing the soap on her butt checks thinking its chizuru, but when she got to her butt hole she stopped, she looked at her back at her pink hole she the pushed the soap in..but it was big to fit it inside she then picked 1 inch from the soap and push it all the way in. she injoy it as she rubbed her finger inside her butthole along with the soap, and when she took her finger out the soap as no longer there<br>\r\nOrihime looked at her butt rubbing it.. thinking of how many ways she could use a shrinking person for.<br>\r\n------------------------------<br>\r\nThe next day at the school during the the lunch time…<br>\r\nChizuru was waiting very happy that orihime wants to see her privately, now that orihime arrived, orihime looked worried and embarrassed…<br>\r\n\"hey orihime, whats wrong?\"<br>\r\n\"chizuru chan…\" orihime blushed<br>\r\n\"what is it sweety\"<br>\r\n\"d..d.d.do you love me, chizuru chan??\" <br>\r\n\"yes I do, Im really in love with you sweety \"<br>\r\n\"t..then would you b..be m..my toy?? P..please\" orihime bowed a 'lil bit <br>\r\n\"huh!?... well if it possible then I really want to be your toy forever sweety \"<br>\r\n\"eh~, really is that really chizuru chan?? Forever??\" orihime graped her hand<br>\r\n\"yes sweety I'll do whatever you want\"<br>\r\n\"then I'll shrink you down and I'll keep you as a toy forever,ok?? i..it's not impossible, I can do it!!\" orihime grabbed chizuru's hand<br>\r\n\"but its sound impossible for me… heh I'll be your toy sweety if you shrink me down right now hehe\"<br>\r\nOk I'll show you\" orihime then aimed her hand at chizuru \" hadoku 31 shrinking!!\" orihime fired the spell at chizuru and then she passed out…<br>\r\nFew minutes later, \"oh, my head… what just happened ohhh\" chizuru try to recover then a voice from above called her \"are you ok chizuru chan??\" chizuru looked up to see a gigantic face of orihime she was at the size of 1 inch tall on orihime's giant palm.<br>\r\n \"ahh o..orihime chan?? W..why you so b..big??\"<br>\r\n\"eh..im not big!! \" orihime wondered<br>\r\n\"t..then you really shrunk me down to this size??\"<br>\r\n\"yes you said you love me AND you wanna be my toy IF I can shrink you..hehe\" orihime said playfully <br>\r\n\"n..no t..this is cruzy\" chizuru looking at her size<br>\r\n\"but…\" orihime almost crying <br>\r\nChizuru notice that she hurt orihime's feelings the sighted \"ok..ok orihime chan I really love you and I except to be your toy I won't mind to be shrunken with the girl I love\" she smiled back.<br>\r\norihime looked at her in her palm \"are you really sure about it??\"<br>\r\n\"yea im, what you don't believe me huh?\"<br>\r\n\"ah n..no I believe you\" she blushed after hearing that<br>\r\n\"ok sweety time to find a place for me until you finish class and go home,so where are you going to put me .. in your pocket or back bag .. OR it might be up your breast or somewhere in your beautiful body.. hehe\"<br>\r\nOrihime blushed deeply \" don't say that!! Chizuru chan..I..I thought about it recently and that’s why I shrunk you to 1 inch tall s..so that I can…\" orihime couldn't say it<br>\r\n\"come on sweety no need to be shy… tell you what… Im going to accept the place that you going to keep me in it whatever it is..ok?\" <br>\r\nOrihime looked at her tiny toy \" ok.. I was thinking about keeping you up… m..my ass in my b..butthole\" orihime was not sure if chizuru well take it or not <br>\r\nChizuru looked at her mistress \"ok I'll go up your ass its looks beautiful, big and its attractive I didn't know that you was planning to make it my home\"<br>\r\nOrihime's face turned really red now she can't take it any more…<br>\r\n\"so.. are you going to put me in your ass or what\" chizuru asked to break orihime's silent<br>\r\n\"a..ah..o..ok… chizuru… thank you for being my toy\" orihime kissed her, she then while she was setting she pulled herself up a little to reveal her gigantic ass to chizuru. Orihime put chizuru in her index finger then she brought her down to her ass chizuru now in awe of the gigantic size of her love's butt \"ok chizuru I'll take off my panties and then I'll insert you up my ass..ok\"<br>\r\nOrihime pulled her panties away from her crack as she insert her finger along with chizuru until she reached her pink hole chizuru start tuching and kissing orihime's hole and orihime start moaning as the pleasures went through her body. Chizuru stopped kissing as orihime's finger moved \"ahhh what the.. moffh\" she criedwhen suddenly orihime start pushing her all the way in orihime blushing as she closed her eyes \"come on go in chizuru it not the right time for that\" and then suddenly her hole starched and swallow chizuru and her finger orihime surprised and let out a moan as she looked at her butt from her back and start to feel the tiny toy in her asshole \"is that good chizuru??..it feels good for me I hope you like it in there… ok time to close the door..byebye\" she pulled her finger and let her panties snap back again and her skirt covered her panties leaving nothing but orihime setting alon in the back yard…<br>\r\n<br>\r\nShe stood up and patted her butt with her hand to clean it from the dust, she stopped tuching her roundy butts they looked normal but she can't believe there is a person inside it now and that person actually is her friend chizuru. Orihime  smiled sshe enjoyed the sensation she looked around to make sure no one there, she put her hands up her head and start dancing and shaking he hips knowing that she shaking her tiny toy as well.<br>\r\nInside her butthole, chizuru was trying to get herself a position to get comfy \"oh I can't believe that im actually inside orihimes ass… its smells her but it's not that bad\" suddenly her home start shaking and throwing her every where right and left then its get easier then herder and again throwing her every way..\"ahh what the hell with orihime she's shaking her butt like…oh dancing…noo\"<br>\r\nOut  side, orihime was i=enjoying shaking chizuru up her butt \" hemm..hem..yay.. yaa\" she finally took a spin then a final shake for her hips \"yay..that was cool\" she rubbing her butt satisfying about what happened \"ok time for lunch\" she took a deep breath then looked at her butt and then start pushing chizuru out she let chizuru's face looking out from her butthole chizuru all what she can see is to cheeks sealing her way out. Orihime then tightened her butthole on chizuru then gives her butt a pat shaking her cheeks like a jell-o and start walking to her friends. Chizuru's face now is rubbing by orihime's butt cheeks one goes up and the other one goes down as she walking thanks to orihime not all chizuru's head was out her butthole only her face as just like she's lookin outside otherwise orihime's buttcheels could give chizuru a neck pain orihime just wanted to feel chizuru in her butt when she walk.<br>\r\nOrhime tokk the stares wnd went to the roof where the others are… <br>\r\n</span></div></div>",
            "created":1246165200,
            "id":715661,
            "title":"Chizuru's new life"
        },
        "122311":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Go when the time is right.",
                "DO IT NOW!!"
            ],
            "content":"<div class=\"\"><div> <span>Orihime opened the door and saw her classmates (not the known/main cast characters) and they were<br>\r\njust about to eat lunch, Orihime looked in her space again and went drifting in her mind. Orihime thought<br>\r\n\"You know since Rukia has shown me this spell it felt...kinda fun, and with that I got a tiny Chizuru in my <br>\r\nbutt.\" Then,she realized something, and smiled and spoke in her mind, \"Also, I don't mind putting \"ROOMMATES\" for Chizuru in my ass with this spell.\" (Story note: NEVER TRUST ORIHIME WITH A<br>\r\nSHRINKING SPELL!!) What did she do next?</span></div></div>",
            "created":1399751580,
            "id":1794434,
            "title":"Orihime still wants more toys!"
        },
        "1223112":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Ichigo and Rukia",
                "Rangiku Matsumoto "
            ],
            "content":"<div class=\"\"><div> <span>     As she thought of that idea, Orihime whispered the spell and during those student's conversation they they instantly became surprised and became scared. They all looked up and saw Orihime and said about what the hell is going on as Orihime picked them all up and said innocently \"Oh my! you all became so small so fast!\" and she admits to those students that she shrunk them all to become her ass hotel guests and become roommates for her passionate volunteer Chizuru so she won't be lonely and she giggled. The students reaction was like an \"ARE YOU OUTTA YOUR MIND?!!\" kind of way and became horrified. Then Orihime grabs tightly to the classmates and slipped out of her skirt and panties and viewed her bare and perfect ass and bent forward stuck each of them one by one and moaned from each one that had entered through her asshole.<br>\r\n<br>\r\n      After that last one she pulled up her panties and skirt and giggled at the movement that the classmates were giving her inside her clean colon and inside they were scared to death. She then shook and danced with MORE people in her ass plus Chizuru and suddenly each time she danced, one of the students kept on bumping on her opposite end of her asshole inside her and moaned in pleasure each time that happened. Soon after that she wanted more and more and more people to be living inside her ass and feel the sensation flowing in her. Literally and figuratively. Soon someone came to Orihime in her moment of pleasure. Who was it? <br>\r\n</span></div></div>",
            "created":1408138320,
            "id":1841869,
            "title":"DO IT NOW!!"
        },
        "12232":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Yes",
                "No",
                "More choices",
                "More choices",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You as yourself?</span></div></span></div>",
            "created":1600406400,
            "id":2905216,
            "title":"no..."
        },
        "13":{
            "choices":[
                "Yoruichi",
                "Rangiku",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Not sure? Try these hotties out!</span></div></span></div>",
            "created":1277355600,
            "id":905765,
            "title":"Other Girls"
        },
        "132":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who gets shrunk??</span></div></span></div>",
            "created":1294722900,
            "id":1033223,
            "title":"Rangiku"
        },
        "1321":{
            "choices":[
                "Hitsugaya",
                "Gin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>O.K. which guy?</span></div></span></div>",
            "created":1294722960,
            "id":1033224,
            "title":"Male"
        },
        "13212":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Yes",
                "Someone else.",
                "*Extra option incase anyone can use change title when using this*"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure?</span></div></span></div>",
            "created":1597902960,
            "id":2888256,
            "title":"Gin"
        },
        "132122":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Yes",
                "Someone else.",
                "*Extra option incase anyone can use change title when using this*"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You (as yourself)</span></div></span></div>",
            "created":1597903020,
            "id":2888258,
            "title":"Someone else."
        },
        "1322":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Rukia ",
                "Momo",
                "Soifon",
                "Nel ",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will it be?</span></div></span></div>",
            "created":1600406640,
            "id":2905220,
            "title":"Female"
        },
        "13225":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "You as yourself",
                "More options.",
                "More choices",
                "More choices",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1600406700,
            "id":2905221,
            "title":"More choices"
        },
        "133":{
            "author_id":"dante-uchiha",
            "author_name":"Reiko-sama",
            "choices":[
                "Hinamori",
                "Soi Fon",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe one of this?</span></div></span></div>",
            "created":1287032400,
            "id":974822,
            "title":"Other"
        },
        "1333":{
            "author_id":"kozan-wolf",
            "author_name":"Kozan",
            "choices":[
                "Habelle or her fractions",
                "Lilienete (Stark's fraction)",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about the arrancar girls?</span></div></span></div>",
            "created":1288414800,
            "id":983582,
            "title":"Arrancars?"
        },
        "13333":{
            "author_id":"kan101",
            "author_name":"Neo Space",
            "choices":[
                "Nel.....",
                "Other...."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about.</span></div></span></div>",
            "created":1356152340,
            "id":1492574,
            "title":"other"
        },
        "133332":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Rurichiyo Kasumiōji",
                "Karin Kurosaki",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about?</span></div></span></div>",
            "created":1597903440,
            "id":2888259,
            "title":"More girls"
        }
    },
    "info":{
        "author_id":"unknowndevil",
        "author_name":"DeVil",
        "brief_description":"Bleach's girls shrinking the other characters..^^  add and have fan.",
        "created":1193198280,
        "description":"<td align=\"left\" class=\"norm\">To the writers:<br>\r\n<br>\r\nJust NO DEATHS..&gt;&lt;\"<br>\r\n<br>\r\n</td>",
        "id":1337526,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600406700,
        "modified":1600406700,
        "pretty_title":"Bleach shrinking story"
    }
}