{
    "chapters":{
        "1":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "try to be human/digimon again",
                "sleep a little longer",
                "eat the first meals in one thousand years",
                "get normal clothes",
                "try to make more biomerges"
            ],
            "content":"<div class=\"\"><div> <span>the war had raged for a thousand years and becaue he north half of the world was genraly more wealthy the d-reaper attacked the high amount of technology so now the south half contained all humanity and the northern hemisphere was no more than ash from the war. the government sent a military party to find glorygallentmon who was now unconsiousface down in ash because of exustion. when the human soldiers found him they were in awe, his armour was a dirty and tarnished silver but in the right light would shine like a cd and th edges of the metal plates were coverd with glowing blue digi symbols and his once wight wings had changed to a metalic black couler and coverd in holes where the feathers had become like burnt charcole and the once glowing power crystals (like bihumon) were dull and misty on the ground. the soldiers tried to wake him but he had battled for milenia without sleap, so they were afraid of what he might do to them if they disturbed him. slowly they lifte him onto a streacher which was difficult due to him being bigger and heavier than normal humans. they took him to earths new capital and waited for his slumber to end...<br>\r\n<br>\r\ntwo weakes later not a second had passed when someone was not looking at him as gradualy as his power recoverd a glowing mist enveloed his body (also like bihumon) and the power crystals started to shine and levitat as a sighn that he was awakening. glorygalentmon had sufferd from amnisia because of the physical truma so those around him explained all about how he became a biomerge and how they fought and defeated the d-reaper and when they were finished he decided that the first thing that he should do was to...<br>\r\n<span class=\"clred\"><u><b>(important note from this point onwards the role of glorygallentmon shall be played first person)</b></u></span></span></div></div>",
            "created":1288933200,
            "id":987294,
            "title":"return to life"
        },
        "11":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "digivolve to gigimon",
                "digivolve to a differnt form",
                "see what this body can do",
                "return to glory gallentmon",
                "get some non red clothes"
            ],
            "content":"<div class=\"\"><div> <span>you stand up and say simpy in your double echoey voice \"ok here it goes\" you shone with a dul yellow light and the light got brighter and brighter until nothing could be picked out and then the yellow light left and you said \"uh.. um.. i feal weird\" then you cover your moth with suprise... you wre not seperate beings, you were still a biomerge, just a growlmon version of a biomerge. This had never happend before and so it shocked you at first, you had large yellow iris's and longish wight hair, you had growlmons tail and ears, wepons on your han which reminded you of growlmons claws and you had growlmons black symbols on your skin and you were wearing red clothing <br>\r\n(for an artists impresion use this link <a rel=\"nofollow\" href=\"http://nicole1725.deviantart.com/art/Gijinka-Growlmon-colored-9879715?q=favby%3Amegidramon95%2F39611234&amp;qo=23\" target=\"_blank\">http://nicole1725.deviantart.com/art/Gij...</a>)<br>\r\n<br>\r\nyou looked at yourself and said \"hmm... perhaps being merged forso long has made this pernement\" and you thought to yourself \"how would i look if i was gigimon\"</span></div></div>",
            "created":1288933200,
            "id":987421,
            "title":"that is... unusual?"
        },
        "114":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Readers choice",
                "Readers choice",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>[Akward......]<br>\r\n(I don’t get it?)<br>\r\nThe sheer awkwardness of the situation, along with unfamiliarity with this body, was enough to convince you to return to GloryGallentmon. You would get used to it later. “It seems I am unable to spilt back into the two that formed me.” Not that you really wanted to.....<br>\r\n<br>\r\n(Why not, Takoto-mon?)<br>\r\n[My family.....wouldn’t be alive, Gulimon. Humans have limited lifespans....and a thousand years has passed. They’re long gone.]<br>\r\n(HUH?)<br>\r\n</span></div></div>",
            "created":1541080800,
            "id":2571485,
            "title":"return to glory gallentmon"
        },
        "12":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "justimon",
                "megagargomon",
                "sukuyamon",
                "hiandromn (assuming that kenta was able to biomerge with gardromon)",
                "you wake up before you see"
            ],
            "content":"<div class=\"\"><div> <span>a the waking world begins to fade away you find yourslef in a dream or perhaps a vision. you are walking along a feild of ash where the battle against the D reaper had taken place with somone who ws wearing a mask, you didnt know who they were but you could tell that they were a friend. the masked figure begins to speak \"i am proud that one of us was able to defeat the D reaper, i suppose the biomerges are as strong as the legends go... but theres a problem, something that we didnt see coming, it happend to me and it happend to you but the others died before it happend to them. as you know when humans die they go to some sort of afterlife, nobody is sure whatit is but it is something and whene a digimon dies they get reconfigured but we have been bound together for so long that it is now impossible for us to be seperated so we cannot leave this oblivion.when you wake up i need you to find my corpse in this feild\" you then come to a corpse with the same mask on lying in the ash still in the dream. \"when you find it keep it somewher safe and then fin calumon,he will be able to bring me back becase i am part digimon.\" you can now feel that youre starting to wake up and in the last few seconds of the dream you ask \"but who are you?\" the figure slowly removes the mask and you see that it is...</span></div></div>",
            "created":1290920400,
            "id":1003511,
            "title":"sleep a little longer"
        },
        "121":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "justimon",
                "calumon",
                "both"
            ],
            "content":"<div class=\"\"><div> <span>Searching for the body of a fallen comrade somewhere in the north hemisphere would have been near impossible but also you would have to search for calumon but this would not be beyond reach all you had to do was find one of them and have the humans send out a search party to find the other so which would you search for?</span></div></div>",
            "created":1302152400,
            "id":1083537,
            "title":"justimon"
        },
        "1212":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "they know and tell you",
                "they dont know but try to help",
                "they are not friendly"
            ],
            "content":"<div class=\"\"><div> <span>Calumon was a small weak digimon that could not really fight or defend himself but he did not age or die and he held the power that made digimon digivolve , he was about the size of a small dog and he was somewhere in one of the two worlds so you decide to start by asking the sovereign if they know where he is</span></div></div>",
            "created":1302152400,
            "id":1083714,
            "title":"calumon"
        },
        "122":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "megagargomon",
                "calumon",
                "both"
            ],
            "content":"<div class=\"\"><div> <span>Searching for the body of a fallen comrade somewhere in the north hemisphere would have been near impossible but also you would have to search for calumon but this would not be beyond reach all you had to do was find one of them and have the humans send out a search party to find the other so which would you search for?</span></div></div>",
            "created":1302152400,
            "id":1083536,
            "title":"megagargomon"
        },
        "1222":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "they know and tell you",
                "they dont know but try to help",
                "they are not friendly"
            ],
            "content":"<div class=\"\"><div> <span>Calumon was a small weak digimon that could not really fight or defend himself but he did not age or die and he held the power that made digimon digivolve , he was about the size of a small dog and he was somewhere in one of the two worlds so you decide to start by asking the sovereign if they know where he is</span></div></div>",
            "created":1302152400,
            "id":1083715,
            "title":"calumon"
        },
        "123":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "sukuyamon",
                "calumon",
                "both"
            ],
            "content":"<div class=\"\"><div> <span>Searching for the body of a fallen comrade somewhere in the north hemisphere would have been near impossible but also you would have to search for calumon but this would not be beyond reach all you had to do was find one of them and have the humans send out a search party to find the other so which would you search for?</span></div></div>",
            "created":1302152400,
            "id":1083535,
            "title":"sukuyamon"
        },
        "1232":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "they know and tell you",
                "they dont know but try to help",
                "they are not friendly"
            ],
            "content":"<div class=\"\"><div> <span>Calumon was a small weak digimon that could not really fight or defend himself but he did not age or die and he held the power that made digimon digivolve , he was about the size of a small dog and he was somewhere in one of the two worlds so you decide to start by asking the sovereign if they know where he is</span></div></div>",
            "created":1302152400,
            "id":1083716,
            "title":"calumon"
        },
        "12321":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "\"Gallantmon!\" (Calumon)",
                "\"Help!\" "
            ],
            "content":"<div class=\"\"><div> <span>You quickly transported yourself to the digital world after have a group sent out to look for Sakuyamon's body.<br>\r\nYou immediately found yourself at the lair of the four sovereign, but only appeared to be there, Azulongmon.<br>\r\n\"Greetings, young one,\" said the old digimon, \"finally awake after your long nap?\"<br>\r\n\"How'd you...\" you began to ask, \"nevermind, I'm searching for Calumon.\"<br>\r\nAzulongmon looked the biomerge in the face.<br>\r\n\"And of what use is the catalyst to you?\" he asked.<br>\r\n\"There's a chance that with his help I can bring back one of my fallen friends.\"<br>\r\nAzulongmon thought for a moment, then he said, \"You will find the catalyst in the ash field of the destroyed city, he's looking for another of your freinds who survived the war.\"<br>\r\n\"Another one?\" you asked.<br>\r\n\"I can't tell you anymore than that, good luck though.\"<br>\r\nYou nod, then trasport yourself back to the ash feilds and begin your search for Calumon.<br>\r\nNot long after you hear a voice, yell...</span></div></div>",
            "created":1358053200,
            "id":1508149,
            "title":"they know and tell you"
        },
        "123211":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "Impmon and Sakuyamon's body",
                "Henry and Terriermon?"
            ],
            "content":"<div class=\"\"><div> <span>You turn in the direction of the cheerful voice to have you vision blocked by a white blur.<br>\r\nThe thing let go of your face to reveal itself as Calumon.<br>\r\n\"I found you.\" he said.<br>\r\n\"You were looking for me?\" you ask.<br>\r\n\"I've been trying to find all of my freinds.\"<br>\r\n\"Well,\" you say, \"I'm actually glad I found you. I need you to come with me so that we might be able to one of our friends back.\"<br>\r\n\"But we can't go yet.\" said Calumon.<br>\r\nGallantmon was confused, \"Why not?\"<br>\r\n\"I found something.\"<br>\r\n\"You found something?\"<br>\r\n\"Actually, two somethings,\" said the little digimon, \"follow me and I'll show you.\"<br>\r\nCalumon floated off, and, not wanting to lose your only chance to bring back Sakuyamon, you followed at a close pace.<br>\r\nSoon, your surrondings become strangely familiar.<br>\r\nCalumon finally stopped and moved so you could his discoveries.<br>\r\nYou were amazed to see...</span></div></div>",
            "created":1358053200,
            "id":1508163,
            "title":"\"Gallantmon!\" (Calumon)"
        },
        "1232112":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "The search party with Sakuyamon's body",
                "Another old comrade"
            ],
            "content":"<div class=\"\"><div> <span>You were dumb founded at seeing the tamer and digimon sitting before you sitting on the ground before what was left of the Hypnos Towers. They appeared to be the same age they had been when you'd thought they'd died.<br>\r\n\"How...,\" you began, \"I remember seeing you get destroyed.\"<br>\r\n\"Funny,\" said Henry, \"remember the same thing.\"<br>\r\n\"And it's not exactly a pleasant memory.\" Said Terriermon.<br>\r\n\"It's impossible that you survived.\" You said.<br>\r\n\"You think I don't know that?\" Asked Henry, \"I've been trying to figure this out since Calumon found us and woke us up, but Terriermon and I have no memories past our supposed destruction.\"<br>\r\nTerriermon tilted his head at you just then.<br>\r\n\"So what do we call you?\" He asked.<br>\r\nThe question confused you.<br>\r\n\"He raises a good question,\" said Henry, \"you're not really the the Takato we use to know, and Guilmon's not really a name I can see myself calling you.\"<br>\r\nYou merely chuckle, \"You can call me whatever you like.\"<br>\r\nHenry smiled, \"Takato it is then.\"<br>\r\nCalumon then yelled for joy, \"Yay, we're a team again.\"<br>\r\nThat reminded you the other reason you were there, just as the sound of feet approaching reached your ears.<br>\r\nYou all turn to see...</span></div></div>",
            "created":1358139600,
            "id":1508570,
            "title":"Henry and Terriermon?"
        },
        "12321121":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "Resurrection (It worked and Sakuyamon is back)",
                "Resurrection, kinda (She's alive, but she's a digi-egg)"
            ],
            "content":"<div class=\"\"><div> <span>The search party approached carrying the unmistakable form of a body.<br>\r\n\"Gallantmon, sir,\" said the one that appeared to be the leader, \"we found the body shortly after you showed up. We thought it best to bring it straight to you.\"<br>\r\nYou thank them then look at the body. It was definitely the one you'd seen in your dream, but the damage was so extensive that it was hard to tell what its original appearance was.<br>\r\n\"So who's this?\" Asked Henry.<br>\r\n\"If my dreams are right,\" you said, \"and I'm not crazy, I think it's Sakuyamon.\"<br>\r\n\"Really?\" Asked Terrerimon as he jumped onto Henry's shoulder to get a better look, \"That's what's left of Rika?\"<br>\r\nRika, the name sounded so foreign to you, but so familiar at the same time. From what your we're told, Rika had been one of your closest freinds before she was felled by the D-Reaper, but what had happened before she was beaten was a bit of mystery to everyone.<br>\r\n\"Hey Takato,\" said Henry, \"why find her body?\"<br>\r\n\"In my dream,\" you say, \"she said that she and I had both been able tho completely fuse with our digimon. She said that because of this, Calumon could bring her back.\"<br>\r\n\"No kidding?\"<br>\r\n\"No, which is why I must ask Calumon to try and do it.\"<br>\r\nCalumon looked a little about it, but nodded at the night and floated over to the body. He closed his eyes as he landed on the chest and got into a position that made it look like he praying.<br>\r\nAfter a while a bright light surrounded the body.<br>\r\nWhen it was finally gone...</span></div></div>",
            "created":1358139600,
            "id":1508612,
            "title":"The search party with Sakuyamon's body"
        },
        "123211211":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "Head back, but leave message for any other friends",
                "Stay and search for friends"
            ],
            "content":"<div class=\"\"><div> <span>Hovering over where her dead body had been not but seconds ago was Sakuyamon.<br>\r\nShe looked much different from what Henry remembered. Her armor was now white with gold markings on it. 2 1/2 foot long blades were attached to her left gauntlet and held a double headed naginata in hands. Four beautiful golden wings were on her back, and though none of them were as large as yours, they were still quite lovely. Golden orbs floated around her.<br>\r\n\"Wow,\" said Henry, \"I guess you miss a lot when you get killed first.\"<br>\r\nSakuyamon landed on the ground in front of you.<br>\r\n\"Hello Gallantmon,\" she said in her double voice, \"any memories flooding back to you?\"<br>\r\nYou thought for a moment about what she could mean when you realized that you did remember something, Sakuyamon changing her form shortly before being beaten by the D-Reaper, and her name.<br>\r\n\"You're ShiningSakuyamon,\" you said, \"you were the last of us to fall before I became GloryGallantmon.\"<br>\r\nSakuyamon smiled, \"So there is a brain still inside the goggled head after all.\"<br>\r\nShe turned to look at Henry and Terriermon, \"Surprising to see you two. I thought that you...\"<br>\r\n\"Were the first destroyed by the D-Reaper, we know,\" said Terriermon, \"and we'd appreciate it if people would stop reminding us.\"<br>\r\n\"So where do we go from here?\" Asked Gallantmon.<br>\r\nThe man from the search party approached, \"Sirs, I suggest we head back to the Southern Hemisphere and figure everything out from there, and from there you can all change into much more comfortable clothing.\"<br>\r\n\"Not a bad idea, but what if more of my friends are alive here?\" Asked Gallantmon.<br>\r\nThe three reunited friend discussed it for a few minutes then decided... </span></div></div>",
            "created":1358226000,
            "id":1509202,
            "title":"Three Together Again"
        },
        "1232112111":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "Mostly Human",
                "Mostly Digimon"
            ],
            "content":"<div class=\"\"><div> <span>You and your friends turned to your search party.<br>\r\n\"We've decided to head to the Southern Hemisphere,\" you said, \"but we want to leave something for anyone of our friends to follow.\"<br>\r\nThe leader of the party nodded, and then he had a few of his men set up a small camp with instructions on how to get to the capitol.<br>\r\nThen, with the help of you and Sakuyamon, everyone quickly got back home.l<br>\r\n\"So Rika,\" said Henry as he looked something to change into, \"how are you and Takato going to change clothes if you're in armor and are technically digimon?\"<br>\r\n\"Armor dose come off Brianiac.\" Said Sakuyamon, \"In addition, Gallantmon and are human enough to where we look human, but digimon enough to be able to store our armor in a type of pocket dimension.\"<br>\r\nYou looked at her, \"How do we do that?\"<br>\r\nSakuyamon smiled and began to glow, and when the glow was gone an adult female human stood before you.<br>\r\nShe had white long white hair in a ponytail, blue eyes, and fox ears. She wore a white shirt yellow sleeves and a yellow heart on it. She had on a pair of blue jeans.<br>\r\n\"Wow,\" said Terriermon, \"you look like an adult Rika mixed with Renamon.\"<br>\r\n\"That's because I kind of am.\" Said Sakuyamon, \"Now it's your turn Gallantmon.\"<br>\r\n\"Okay, what do I do?\" You ask.<br>\r\n\"Just concentrate on the closest thing you have to a memory of your former self.\" She said.<br>\r\nYou nod then concentrate.<br>\r\nSoon a glow surrounds you and you feel a tingling sensation.<br>\r\nWhen it stops you look at your new form to see...</span></div></div>",
            "created":1358362920,
            "id":1509874,
            "title":"Head back, but leave message for any other friends"
        },
        "12321121111":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "A digimon attacks",
                "They're wanted by the human leader"
            ],
            "content":"<div class=\"\"><div> <span>You now looked like an adult human male with sharp, claw like fingernail and markings like Guilmon's on your arms. You wore a red and black, hooded shirt with short sleeves. You also wore a pair of black sweat pants and tennis shoes. A quick look in the mirror revealed that you had yellow reptilian eyes and a pair of black rimmed goggles say on top of your head of white, spiky hair.<br>\r\n\"And it looks like you're still a Gogglehead.\" Said Sakuyamon.<br>\r\nYou hadn't noticed earlier, but Sakuyamon's was now that of a single person's, and you had a feeling that it must be that of Rika's only older.<br>\r\n\"Gogglehead?\" You asked in your own single voice.<br>\r\n\"That amnesia really got you deep didn't it?\" Asked Sakuyamon.<br>\r\n\"I guess so?\"<br>\r\n\"Well, that stinks.\" Stated Terriermon while his tamer continued to look for new clothes, \"I wonder if you even remember any family?\"<br>\r\n\"Everything's a blank except for what the people here have told me.\" You say.<br>\r\n\"It's probably best that you don't remember,\" said Sakuyamon, \"they're all gone now anyway.\"<br>\r\nHenry let out a rather loud sigh, \"That means I've woken up in a world with no Mom, or Dad, or even Suzie. Yet I look like the last battle was just yesterday instead of 1000 years ago.\"<br>\r\n\"It is strange,\" said Sakuyamon, \"and we did watch you get destroyed.\"<br>\r\n\"And the only part of you that seemed damaged in any way was your clothes.\" You said.<br>\r\n\"Speaking of which,\" said Henry, \"I better go change into the ones I've found.\"<br>\r\nHenry walked into the bathroom and walked out a few minutes later wearing an exact copy of his old outfit.<br>\r\n\"So what now?\" You ask.<br>\r\nBefore any one could answer...</span></div></div>",
            "created":1358964480,
            "id":1515085,
            "title":"Mostly Human"
        },
        "123211211111":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "\"Hey, I'm on your side!\" (Beelzemon)",
                "\"Where is Jeri!\" (Leomon"
            ],
            "content":"<div class=\"\"><div> <span>A soldier ran in through the door to stand before you and your comrades.<br>\r\n\"Sirs,\" said the soldier, \"a digimon is attacking the city.\"<br>\r\nAll of you jump to your feet.<br>\r\n\"It looks like we're needed.\" Said Sakuyamon.<br>\r\nYou nodded, and Henry pulls his D-Power out of his pocket.<br>\r\n\"Can I help?\" Asked Calumon.<br>\r\n\"Just stay here Calumon,\" said Henry as he search for the right card, \"we don't want you getting hurt.\"<br>\r\nThe cream puff nodded.<br>\r\nLight surrounded you and Sakuyamon, and you both soon were wearing your armors, ready to fight.<br>\r\nHenry slashed a card.<br>\r\n\"Digi-Modify, Matrix Digivolution!\"<br>\r\n\"Terriermon Matrix Digivolve to... Rapidmon!\"<br>\r\nThe android rabbit stood ready.<br>\r\nYou all ran outside, but, as you did, you hear the digimon call something surprising in a familiar voice.</span></div></div>",
            "created":1359123600,
            "id":1516601,
            "title":"A digimon attacks"
        },
        "1232112111111":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "Jeri",
                "Ryo and Monodramon"
            ],
            "content":"<div class=\"\"><div> <span>You turned to see the demon lord digimon floating in the air.<br>\r\nHe looked a bit different though.<br>\r\nHe had four black wings and a huge gun on his back. His coat was a long trench coat and two pistols on his waist. Tail with a blade on it twitched behind him, and he had on metal gauntlets.<br>\r\nHe quickly evaded shots being fired at him and didn't even appear to be trying to fight back, and then you saw something in his hands, no, not something, someone.<br>\r\nIt's...</span></div></div>",
            "created":1359468960,
            "id":1519406,
            "title":"\"Hey, I'm on your side!\" (Beelzemon)"
        },
        "12321121111111":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "Attack the General",
                "Use you pull and ask them to stop"
            ],
            "content":"<div class=\"\"><div> <span>Laying unconscious in Beelzemon's arms was Jeri looking the same as the last time you saw her, but a little worse for ware,<br>\r\n\"How could she still be alive?\" You thought.<br>\r\nThat didn't even matter though, you had to protect them, but how to get the people to stop firing?<br>\r\nYou thought for a moment then decided.</span></div></div>",
            "created":1361380980,
            "id":1536023,
            "title":"Jeri"
        },
        "123211211111112":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "To bring Beelzemon and Jeri to the hospital",
                "To allow them to head outside the city for a moment with Beelzemon"
            ],
            "content":"<div class=\"\"><div> <span>You fly up into the sky just as the people fire Beelzemon again, but with a quick wave of your hand the attacks are deflected.<br>\r\n\"Stop shooting,\" you yell, \"this digimon may appear evil, but he is a close friend. Do not destroy him.\"<br>\r\nThe humans stop firing and lower their weapons, and then one finally notices Jeri laying in the demon lord digimon's arms.<br>\r\n\"Sir!\" He yelled, \"he has a hostage!\"<br>\r\n\"This isn't a hostage you idiot!\" Yelled Beelzemon, \"I found her in the northern hemisphere and was bringing her back to her friends.\"<br>\r\nSakuyamon floated up next to you, \"Gallantmon, is that who I think it is in Beelezemon's arms.\"<br>\r\nYou simply nod.<br>\r\n\"If certain people figure out who she is,\" the shaman continued, \"I could be very bad, especially for her.\"<br>\r\n\"Sir,\" called the human general to Beelzemon, \"what would you have us do?\"<br>\r\nYou thought for a moment, and then you said...</span></div></div>",
            "created":1363096020,
            "id":1548636,
            "title":"Use you pull and ask them to stop"
        },
        "1232112111111121":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "Crying",
                "Transforming"
            ],
            "content":"<div class=\"\"><div> <span>The general's eyes went wide for a moment at the mention of Jeri's name, but he directed you and the other to the hospital. There you had Jeri placed in a private room.<br>\r\nAfterwards you the others stepped outside to wait. You and Sakuyamon took your human forms and Beelzemon, now LordBeelzemon, de-digivolved to Impmon.<br>\r\n\"So Terriermon,\" said Impmon, \"what's it like ta die and come back from the dead?\"<br>\r\n\"You should know since we all thought you were dead, too.\" Said the rabbit.<br>\r\n\"Could you two not argue?\" Asked Henry.<br>\r\n\"Yeah,\" said Sakuyamon, \"respect the dead.\"<br>\r\n\"Watch it Rika.\" Said the blue haired boy.<br>\r\n\"Why'd you call her that?\" Asked Impmon.<br>\r\n\"I can't see myself calling her Sakuyamon.\" Said Henry.<br>\r\nJust then, Calumon popped up.<br>\r\n\"Oh look,\" said Impmon, \"it's the cream puff, I gonna look for you next.\"<br>\r\n\"Wanna play?\"<br>\r\n\"Not now Calumon,\" you say, \" we're waiting for news on Jeri.\"<br>\r\n\"Aw, but she doesn't want to play either.\"<br>\r\nThe group gave him a look.<br>\r\n\"She said she was hurting.\"<br>\r\nThat brought everyone to their feet and they ran and opened the door to see Jeri...</span></div></div>",
            "created":1365085860,
            "id":1564613,
            "title":"To bring Beelzemon and Jeri to the hospital"
        },
        "12321121111111212":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "Says she needs to think and flys off",
                "Agrees and try to see if she can turn back"
            ],
            "content":"<div class=\"\"><div> <span>They stood in shock as Jeri started to grow taller and her body become shapely. Her hair became a little wild and spiked down at the bottom. Her arms became longer and her nails grew to sharp points. Weird looking wings grew from her back that looked familiar to me somehow. Her clothes had torn to shreds during her but she was covered by a red thing that seemed to attached to her, and her skin became a light blue and on some parts a light purple.<br>\r\nIt finally hit you that she looked exactly like the clone creature that of her that the D Reaper had made.<br>\r\n\"What happened to me?! came Jeri's voice from the creature.<br>\r\nThe sound slightly distorted, but it was Jeri's.<br>\r\n\"Where am I?\" She asked.<br>\r\n\"Jeri,\" said Henry as he slowly approached, \"just stay calm. You're in a safe place.\"<br>\r\n\"It won't be safer for her much longer,\" said Sakuyamon, \"someone here sees here like this and there'll be big trouble.\"<br>\r\n\"What are you talking about Rika?\" Asked Henry.<br>\r\n\"Come on Henry,\" said the semi-human, \"you're the Brianiac. Jeri was in the D-Reaper's core, and she helped it into to world 1000 years ago. Extended exposure to that much chaos has warped her DNA. To the people here, that's enough to think of her as the D Reaper.\"<br>\r\nJeri and everyone else in the room was horrified by Sakuyamon's words, the girl turned creature began to cry.<br>\r\nYou couldn't stand to see her sad, your memories were limited of the time before you fell into your sleep, but something told you that in a past life, you cared about her deeply.<br>\r\nI stepped forward.<br>\r\n\"Jeri,\" you said, \"you may not recognize me like I am now, but I was Takato.\"<br>\r\nJeri looked up, tears still streaming down her face, \"Takato?\"<br>\r\n\"Yes, I was Takato,\" you say, \"now I know this new form is unnerving and the people here may agree with what happened 1000 years ago, but that is the past and you can make the future better.\"<br>\r\nJeri stopped crying for a moment and then thought about what you were saying.<br>\r\nThen she...</span></div></div>",
            "created":1365171960,
            "id":1565472,
            "title":"Transforming"
        },
        "123211211111112121":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "Henry",
                "Takato"
            ],
            "content":"<div class=\"\"><div> <span>She pushes the building window open, and before you or anyone else could stop her, she flew off.<br>\r\nHenry ran to the window.<br>\r\n\"Jeri!\" He called, but the girl was nowhere to be seen.<br>\r\n\"We have to find her,\" said Sakuyamon, \"if the people here see her, it won't be good for her.\"<br>\r\n\"Sakuyamon is right,\" said Impmon, \"if these people go crazy just when a Virus type like myself shows up, then imagine what'll happen if they see something from the D-Reaper.\"<br>\r\nEveryone in the room agree, then ran out to search for her.<br>\r\n----–----------------------------------------------------------------------- ------------------------------------------------<br>\r\nMeanwhile<br>\r\nJeri had landed in a rougher part of the Southern Hemisphere and was silently walking through alleys.<br>\r\nShe knew that Takato was right about the past, but Sakuyamon was right, too, the people here would still hold a grudge against her.<br>\r\n\"Maybe it would just be better if I went back to the Northern Hemisphere and didn't return here.\" She said to herself.<br>\r\nJust then, she heard a cry for help from a nearby alley. She peaked in to see a little girl with her foot caught in wire fence.<br>\r\nJeri slowly approached.<br>\r\nThe little girl looked up at Jeri and gasped in fear, and she screamed as Jeri bent down. The girl shut her eyes expecting the end, but it didn't come.<br>\r\nShe opened her eyes and saw that Jeri had moved the fence so her foot was free.<br>\r\n\"Tha...Thank you.\" The little girl.<br>\r\nJeri just smiled.<br>\r\nShe heard footsteps behind her and turned to see other more people. The little girl then ran past Jeri and past the people too happy Jeri was there. Jeri nervously waved.<br>\r\nThe people jumped a bit at the motion.<br>\r\n\"I don't want any trouble,\" said Jeri as she stood to her full height, \"I was just helping.\"<br>\r\nJeri noticed that all the people had things like clubs.<br>\r\n\"I'm really a nice person if you get to...\"<br>\r\nJeri was cut of by someone throwing rock at her head, and then it was like wildfire as all the people surrounded her and started to hit her with the clubs.<br>\r\nShe thought she would be beaten to death, but then they all stopped when they heard someone yell.<br>\r\n\"Get off her!\"<br>\r\nWho was it.</span></div></div>",
            "created":1365181860,
            "id":1565578,
            "title":"Says she needs to think and flys off"
        },
        "1232112111111121211":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "An hour later",
                "The next day"
            ],
            "content":"<div class=\"\"><div> <span>They entire group turned to see Henry, Gargomon, and the little girl Jeri had helped.<br>\r\n\"A tamer,\" said one of mod members, \"you would help this thing?\"<br>\r\nHenry scowled, \"You bet I would. Gargomon.\"<br>\r\nThe rabbit dog thing fired his gun at the alley's back wall. The people ran away, scared for their lives.<br>\r\nHenry approached Jeri, she in the fetal position and crying her eyes out. The little girl walked up with Henry very cautiously.<br>\r\nJeri was bruised, though if you were far away you barely notice because of her color, and a cut on her head was bleeding.<br>\r\nHenry pulled a small first aid kit from his pocket and bandaged the cut.<br>\r\nThe little girl watched, surprised at how this boy was helping a creature that she'd alway been told was evil.<br>\r\nOnce Henry was done he stood up and looked at the crowd of people that had returned after Gargomon had scared them off.<br>\r\nHenry scowled at them again, \"You people make me sick.\" He said, \"She didn't do anything to this little girl except help her and you people attack her.\"<br>\r\nThe people began to mumble to each other.<br>\r\n\"You call her monster, but look at what you did. The only monsters I see here stand right before me. Jeri here is human, if any of you even care, and she may've made some mistakes, but she doesn't deserve what you people did to her.\"<br>\r\nHenry finished his speech spit on the ground, as if to say the people who did this were like the dirt beneath his feet.<br>\r\nJeri had stopped crying and sat up by the time Henry had finished and Henry helped her the rest of the way up and then Henry, Gargomon, and Jeri began to leave.<br>\r\nThe little girl stepped in front of them for a moment and handed something to Jeri, it was a little yellow flower.<br>\r\n\"Thank you.\" Said the girl.<br>\r\nJeri smiled, \"You're welcome.\"<br>\r\nWith that they left the alley and Jeri saw you and ShininigSakuyamon in armored forms standing waiting for them.<br>\r\n\"Well Brainiac,\" Said Sakuyamon, \"I doubt you made any fans with that one.\"<br>\r\n\"Just get us back to the hospital in the Capitol.\" Said Henry.<br>\r\nYou happily obliged the request and all of teleported back to the hospital room.</span></div></div>",
            "created":1365195780,
            "id":1565677,
            "title":"Henry"
        },
        "12321121111111212111":{
            "author_id":"towermon222",
            "author_name":"DigimonFan2322",
            "choices":[
                "Clothes",
                "Training"
            ],
            "content":"<div class=\"\"><div> <span>An hour later, after everything had been explained to select number of people about what had happened to, you and the others were in Jeri's room.<br>\r\n\"So are you okay now Jeri?\" Asked Henry.<br>\r\n\"I'm fine,\" said the girl, \"I'm just not use to this whole D-Reaper form.\"<br>\r\nSakuyamon smiled, \"Have you even tried to get out of it.\"<br>\r\n\"It's the first thing I tried to do when I land in that part of the city, but it wouldn't go away,\" Jeri began to tear up again, \"What if I'm stuck as this monster for the rest of my life.\"<br>\r\n\"Here come the waterworks.\" Said Impmon.<br>\r\n\"Shut up Impmon!\" Shouted Henry.<br>\r\nEveryone, even you, give Henry an odd look.<br>\r\nHe approached and sat down, \"Jeri, we're going to do everything we can to try and fix this, but you can't start crying every time you think of the possibility of being stuck like this.\"<br>\r\n\"But...\" Jeri started to say.<br>\r\n\"And another thing, you're not a monster,\" said Henry, he then paused and blushed, \"in fact you look great even like this.\"<br>\r\nYou were surprised by the comment, not that he was wrong, Jeri did look nice even in the form she was in, but all of the memories you had access to pointed to the fact that you had had a crush on Jeri, and Henry had never shown that he liked her that way, too.<br>\r\n\"You really mean that?\" Asked Jeri.<br>\r\n\"Yeah,\" said Henry, \"I mean, you could use some clothes, but otherwise you look as just as good as did in your pervious form.\"<br>\r\nJeri started to tear up again and wrapped her arms around Henry.<br>\r\n\"Oh brother.\" Said Terriermon.\"<br>\r\n\"Be quiet Terriermon.\" Said Henry, like he was having trouble breathing.<br>\r\n\"Jeri,\" you said, \"don't suffocate him.\"<br>\r\nJeri apologized and let go.<br>\r\n\"Looks like we have more work to do than finding her an outfit.\" Said Sakuyamon, \"She needs to know how to control her own strength.<br>\r\n\"Well,\" said Henry, \"What do you suggest first.\"</span></div></div>",
            "created":1365435960,
            "id":1567930,
            "title":"An hour later"
        },
        "124":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "hiandrmon",
                "calumon",
                "both"
            ],
            "content":"<div class=\"\"><div> <span>Searching for the body of a fallen comrade somewhere in the north hemisphere would have been near impossible but also you would have to search for calumon but this would not be beyond reach all you had to do was find one of them and have the humans send out a search party to find the other so which would you search for?</span></div></div>",
            "created":1302152400,
            "id":1083534,
            "title":"hiandrmon"
        },
        "1242":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "they know and tell you",
                "they dont know but try to help",
                "they are not friendly"
            ],
            "content":"<div class=\"\"><div> <span>Calumon was a small weak digimon that could not really fight or defend himself but he did not age or die and he held the power that made digimon digivolve , he was about the size of a small dog and he was somewhere in one of the two worlds so you decide to start by asking the sovereign if they know where he is</span></div></div>",
            "created":1302152400,
            "id":1083717,
            "title":"calumon"
        },
        "125":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "calumon",
                "comrade",
                "both"
            ],
            "content":"<div class=\"\"><div> <span>Searching for the body of a fallen comrade somewhere in the north hemisphere would have been near impossible but also you would have to search for calumon but this would not be beyond reach all you had to do was find one of them and have the humans send out a search party to find the other so which would you search for?</span></div></div>",
            "created":1302152400,
            "id":1083533,
            "title":"you wake up before you see"
        },
        "1251":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "they know and tell you",
                "they dont know but try to help",
                "they are not friendly"
            ],
            "content":"<div class=\"\"><div> <span>Calumon was a small weak digimon that could not really fight or defend himself but he did not age or die and he held the power that made digimon digivolve , he was about the size of a small dog and he was somewhere in one of the two worlds so you decide to start by asking the sovereign if they know where he is</span></div></div>",
            "created":1302152400,
            "id":1083721,
            "title":"calumon"
        },
        "13":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "a nurse says you have a vistor",
                "you just wait for the bread",
                "the news reporters get in",
                "you get a flash back",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>as you had just woe up yor thinkigastill rathe simple butas you woke you noticed your surroundings, yo were in a hospital with news reprters loking threw the window in the door who the nurses had kept out due to you needing quiet whilst you recoverd, nurse urrn  youand said \"master gallentmon, it's good to see that your awake, you mu b hungry can i gt you anything?\" you were glad that she asked you because due to spening hundreds of years with the only other living thing being the thing that you hated most out of all living things you were not used to asking for things. you replied \"yes thanks if its not to much trouble i would like a loaf of bread in the shape of a dragons head\". she was about to get it for you when she asked \"why?\" and you explained that it was the last meal you ate before the battle began.</span></div></div>",
            "created":1291006800,
            "id":1004489,
            "title":"eat the first meals in one thousand years"
        },
        "14":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "a ghost f an old fried apears",
                "eat something",
                "go to the digital world",
                "make more biomerges",
                "get a house"
            ],
            "content":"<div class=\"\"><div> <span>the streets of earth have changes so much with time that its rather ailen to you now, you look around one or two shops but most of the stuf is to small so you have some clothes tailored for you and send your rusty old armour awway to be cleaned and polished.</span></div></div>",
            "created":1289106000,
            "id":989216,
            "title":"get normal clothes"
        },
        "15":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "permision from the sovreighn",
                "the humans",
                "the digimon",
                "the gate",
                "the number"
            ],
            "content":"<div class=\"\"><div> <span>making biomerges was simple you needed a human and a digimon and if you could get them the digimon to reach ulitimet leavel on the layer of the digimon sovrieghn with their human partner nearby then they would do so. but to do this you would need; permision from the digimon sovreighn, a gate to the digital world, humans, digimon and to decide how many you intend to make. which is most important aka that you should do first</span></div></div>",
            "created":1289106000,
            "id":988783,
            "title":"defenders of earth"
        },
        "151":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "get the humans",
                "build the gate",
                "skip to the part when im training the humans"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>getting permision didnt mean that you actualy had to be in the digital world you simple sent each one of them an e-mail whent they each replyed with permision you decided what to do next</span></div></span></div>",
            "created":1289106000,
            "id":988970,
            "title":"permision from the sovreighn"
        },
        "152":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "children",
                "teengers",
                "adults"
            ],
            "content":"<div class=\"\"><div> <span>one more thing to decide is their age. on one hand if they are young they can get to know their digimon betteer and it will be more liklt that they biomerge and children would not be corupted by greed or power. on the other hand if they are more mature you would not have to get permision from the parents and would be more likly to want to be a biomege so which age</span></div></div>",
            "created":1289106000,
            "id":988787,
            "title":"the humans"
        },
        "153":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "in training",
                "rookie",
                "champion"
            ],
            "content":"<div class=\"\"><div> <span>\"what level should the digimon be? if theyre weak they will get to know their partners better and be more likly to biomerge but if theyre srong they will terrify their tamers at first but it wont be a shock when they digivolve\" you mutter to yourself as you remember how growlmon terrified takoto at first.</span></div></div>",
            "created":1289106000,
            "id":988788,
            "title":"the digimon"
        },
        "1531":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "1000",
                "100",
                "10"
            ],
            "content":"<div class=\"\"><div> <span>because your still in the capital you ask for a computer and log into the internet and search for \"digimon wiki\" (it exists today) you look at all the in training digimon and think how many you will need. this is important because the more you have the stronger the team but the less you can focus on individuals.</span></div></div>",
            "created":1289106000,
            "id":988789,
            "title":"in training"
        },
        "1532":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "1000",
                "100",
                "10"
            ],
            "content":"<div class=\"\"><div> <span>because your still in the capital you ask for a computer and log into the internet and search for \"digimon wiki\" (it exists today) you look at all the rookie digimon and think how many you will need. this is important because the more you have the stronger the team but the less you can focus on individuals.</span></div></div>",
            "created":1289106000,
            "id":988790,
            "title":"rookie"
        },
        "1533":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "1000",
                "100",
                "10"
            ],
            "content":"<div class=\"\"><div> <span>because your still in the capital you ask for a computer and log into the internet and search for \"digimon wiki\" (it exists today) you look at all the champion digimon and think how many you will need. this is important because the more you have the stronger the team but the less you can focus on individuals.</span></div></div>",
            "created":1289106000,
            "id":988791,
            "title":"champion"
        },
        "154":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "enter the gate",
                "dont enter the gate",
                "give up"
            ],
            "content":"<div class=\"\"><div> <span>being a biomerge you are the only person on earth who knows how to build a gate, although many humans offerd to help you turrned them down but you did ask them for rescources but most of the gate was basicly made ofpaperclips and string due to your genius. it took three days but the gate is finaly complete, it looks like a circle of metal coverd in scrap but when you turned it on there were no strange lights or special effects, you could just see the igital world through the gate. if you go through the gate you can find digimon such as the sovreighn digimon or simply live there. on the other hand if you stay in reality you could find humans for the biomerge project but you could simply give up on project biomerge and forget about earth.</span></div></div>",
            "created":1289106000,
            "id":988958,
            "title":"the gate"
        },
        "1542":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "get those parts, ASAP ",
                "let’s stop and plan",
                "why not try to relax"
            ],
            "content":"<div class=\"\"><div> <span>you decide not to enter the gate, asmuch of a genius as you are(a thousand years of knowledge and an unlimited internet connection go a long way), you didn’t trust the gate to stay open forever, or stay together all that well. you shut it off and begin to procure information for ways of reinforcing the digital gate. what’s more, you needed to find willing candidates to become biomerges in the first place, along with figure out how many you would be willing to train. while you found ways of reinforcing the gate, you would need a certain material, and that would take some time to get. you could order that and then takes sometime off to reflect or relax......</span></div></div>",
            "created":1541078460,
            "id":2571476,
            "title":"dont enter the gate"
        },
        "1543":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "figure out what the world is like",
                "We shall defend our worlds."
            ],
            "content":"<div class=\"\"><div> <span>....Well, give up was a bit TOO dramatic. <br>\r\n<br>\r\nIt’s only now, looking at the digital world, that you realise that maybe, the Earth does not need a guardian. From what you saw of the human world, it looked to be very peaceful, and united. <br>\r\n<br>\r\nYou were trying to plan ahead to stop a future that may never come. Maybe, instead of leading an army, your best choice of plan was to hang up your weapons. Of course, first impressions never give the full story...</span></div></div>",
            "created":1541078880,
            "id":2571477,
            "title":"....does today need the warriors of a future?"
        },
        "15432":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "The Biomerge Army plan continues.",
                "We shall inform the Sovereigns."
            ],
            "content":"<div class=\"\"><div> <span>Looking at the digital world(My home), you saw nothing but peace. The human world [My home] also looked peaceful.<br>\r\n<br>\r\n(But That really was Never the case, Takoto-mon. The Digital world never was peaceful. It’s a constantly moving, changing place, always evolving...like us Digimon!)<br>\r\n<br>\r\nBut peace was fragile, and hard to obtain. It had to be fought for, and sacrifices had to be made. Sacrifices....like your comrades made to weaken and deposed the D-Reaper. Sacrifices that cost happy endings.<br>\r\n<br>\r\n[Wasn’t humanity built on top of sacrifice? It’s nothing new........we beijfited from sacrifice in the long run!]<br>\r\n<br>\r\nThe truth of the human world was that it had a nice outside covering a apathetic and corrupt inside. Was that worth fighting for?<br>\r\n<br>\r\n(The opposite of Impmon!)<br>\r\n[How do you know that for sure? Sounds like you’re getting cynical. Is that what Gallantamon is? No. Optimism, Freindship, Love, Chilalvery and Courage. Those drive a white knight. That’s what you are.]<br>\r\n<br>\r\n......I cannot fight for everlasting peace. As worth it as it would be...<br>\r\n<br>\r\n[Maybe you can! With a little help! If peace is worth fighting for, then fight for it! Fight for it with fellow knights!]<br>\r\n<br>\r\n(Giving Up would disappoint Leomon and Jeri-mon.)<br>\r\n<br>\r\n.........you’re right.<br>\r\nSakyuramon(Renamon)[Rika]......<br>\r\nMegaGalagomon(Terriermon)[Henry].......<br>\r\nBezellemon....<br>\r\nIf I gave up now, I would be spitting in the face of the sacrifices you made for both worlds.<br>\r\n<br>\r\nWe shall defend the world in your place.<br>\r\n([ We are one Digimon, with one goal. We are GloryGallantmon. And we shall protect both our worlds till the day the universe ends. ])</span></div></div>",
            "created":1541080140,
            "id":2571481,
            "title":"We shall defend our worlds."
        },
        "155":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "1000",
                "100",
                "10"
            ],
            "content":"<div class=\"\"><div> <span>the new biomerges would need your tuition so the more you have the less you can focus on indevidals but the more biomerges you have the less is necissary from the individuals so this is allabout balance (keep in mind there were only four biomerges to begin with)</span></div></div>",
            "created":1289106000,
            "id":988784,
            "title":"the number"
        },
        "1553":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "the gate",
                "find humans",
                "ask government to find the humans"
            ],
            "content":"<div class=\"\"><div> <span>ten was a logical awnser because biomerges is quality not quantity. making a simple decision is fair enough but now its time for action if you create a gate you can find the digimon and sovreighn digimon but if you find the humans first then they can decide which digimon they want and if you are going to choose to find the humans how, if you select them by hand you would know that they have morality but if you ask the government to select them it would be fast and ou could focus on other things</span></div></div>",
            "created":1289106000,
            "id":988786,
            "title":"10"
        },
        "15532":{
            "choices":[
                "yes he has inner strength",
                "no he could turn under pressure"
            ],
            "content":"<div class=\"\"><div> <span>you decide to find the humans yourself as you want to see their potential.you leave the government building and you walk past many people all of them look at your body in awe.because of your powers you can see a humans spirit.<br>\r\nyou were getting annoyed by everyone bowing to you.even young children were doing it.as you were walking by a soccer field a ball rolled over to you and stopped by your feet.you pick it up and look around from where it came from.<br>\r\nyou see a group of young humans all huddled together.they seemed to be deciding who will get the ball.this is pointless one boy yelled as he turned away from the group.he walked up to you.asked for the ball.you could see he was different from the others.he had more of a fiery personality.<br>\r\nrecruit him for the biomerge project?</span></div></div>",
            "created":1298178000,
            "id":1057333,
            "title":"find humans"
        },
        "155321":{
            "choices":[
                "yes",
                "no wait for time and let the humans settle away from home"
            ],
            "content":"<div class=\"\"><div> <span>he agreed eagerly to help.you quickly gathered nine other humans.you decided that the group should be seven boys and three girls between the ages of ten to fifteen.the boy from the soccer field was called Shane.the humans all followed you to the digital world.the humans are:<br>\r\nShane,fifteen,fiery personality,dragon spirit.<br>\r\nDonald,fifteen quiet personality,beast spirit.<br>\r\nDaniel,thirteen,happy personality,holy spirit.<br>\r\nThomas,fourteen,cocky personality,aquan spirit.<br>\r\nRyan,twelve,talkative,insect spirit.<br>\r\nAlex,eleven,hasty personality,ice spirit.<br>\r\nScott,fifteen,friendly personality,air spirit.<br>\r\nSara,fourteen,cold personality,aquan spirit.<br>\r\nCierra,thirteen,quiet personality,holy spirit.<br>\r\nMelody,fifteen,friendly personality,beast spirit.<br>\r\nTheir spirit should determine their partner.as you are about to enter the portal the government stop you.<br>\r\ntry to get past them?</span></div></div>",
            "created":1298178000,
            "id":1057335,
            "title":"yes he has inner strength"
        },
        "1553211":{
            "choices":[
                "Train",
                "Skip to ultimate and try biomerging"
            ],
            "content":"<div class=\"\"><div> <span>you quickly push the humans through and follow behind them.the portal was destroyed.you know another way back but you decide to wait for the heat to die down.you look around but you cant see any of the humans.you look for ages and you reluctantly decide to sleep for the nightwhen you wake up you hear voices around you.you get up and see all the humans and that they all have found their partners.<br>\r\nShane/Dorumon<br>\r\nDonald/Gabumon<br>\r\nDaniel/Patamon<br>\r\nThomas/SnowAgumon<br>\r\nRyan/Kunemon<br>\r\nAlex/Tapirmon<br>\r\nScott/Falcomon<br>\r\nSara/Syakomon<br>\r\nCierra/Salamon<br>\r\nMelody/Mikemon<br>\r\nthe digimon bow in your presence.you look at the most dangerous one Dorumon as he could digivolve wrong if pushed like I did once.What now?</span></div></div>",
            "created":1298178000,
            "id":1057340,
            "title":"yes"
        },
        "15532112":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "start to train them",
                "the sovereign attack"
            ],
            "content":"<div class=\"\"><div> <span>The humans and their Digimon all looked eager to become the new protectors of earth so you created a portal that lead to the land of the Digimon sovereign, you decided it would be a waste of time to ask their permission as you would soon have ten young biomerges on your hands besides even if the sovereign did attack they wouldn’t be able to beat him anyway and you hadn’t forgotten what zhqiaomon had said about the original biomerges and if he remembered it he wouldn’t show his face.<br>\r\nOnce in the land of the Digimon sovereign you unlocked one of your gauntlets to reveal the red catalyst tetrahedron, you did miss calumon but as the catalyst it was easier to control. You tossed the catalyst into the air and a crimson fire engulfed ten humans and ten biomerges and ran off of ten brand new biomerges they were:<br>\r\nShane/Dorumon            alphamon<br>\r\nDonald/Gabumon          metalgarurumon x<br>\r\nDaniel/Patamon             Seraphimon<br>\r\nThomas/SnowAgumon  icebancholeomon<br>\r\nRyan/Kunemon              HerculesKabuterimon<br>\r\nAlex/Tapirmon               kentaurosmon<br>\r\nScott/Falcomon              ravemon<br>\r\nSara/Syakomon               AncientMermaimon<br>\r\nCierra/Salamon                Ophanimon<br>\r\nMelody/Mikemon              MirageGaogamon</span></div></div>",
            "created":1298178000,
            "id":1057765,
            "title":"Skip to ultimate and try biomerging"
        },
        "155321121":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "yes",
                "no stay as gallantmon "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>At this point you may change point of view to one of the new biomerges<br>\r\n</span></div></span></div>",
            "created":1302152400,
            "id":1083588,
            "title":"start to train them"
        },
        "1553211211":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "yes",
                "no, a difernt biomerge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about<br>\r\nShane/Dorumon  alphamon<br>\r\n</span></div></span></div>",
            "created":1302152400,
            "id":1083589,
            "title":"yes"
        },
        "15532112112":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "yes",
                "no, a difernt biomerge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about<br>\r\nDonald/Gabumon  metalgarurumon x<br>\r\n</span></div></span></div>",
            "created":1302152400,
            "id":1083590,
            "title":"no, a difernt biomerge"
        },
        "155321121122":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "yes",
                "no, a difernt biomerge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about<br>\r\nDaniel/Patamon  Seraphimon<br>\r\n</span></div></span></div>",
            "created":1302152400,
            "id":1083591,
            "title":"no, a difernt biomerge"
        },
        "1553211211222":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "yes",
                "no, a difernt biomerge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about<br>\r\nThomas/SnowAgumon  icebancholeomon<br>\r\n</span></div></span></div>",
            "created":1302152400,
            "id":1083592,
            "title":"no, a difernt biomerge"
        },
        "15532112112222":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "yes",
                "no, a difernt biomerge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about<br>\r\nRyan/Kunemon  HerculesKabuterimon<br>\r\n</span></div></span></div>",
            "created":1302152400,
            "id":1083593,
            "title":"no, a difernt biomerge"
        },
        "155321121122222":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "yes",
                "no, a difernt biomerge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about<br>\r\nAlex/Tapirmon kentaurosmon<br>\r\n</span></div></span></div>",
            "created":1302152400,
            "id":1083594,
            "title":"no, a difernt biomerge"
        },
        "1553211211222222":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "yes",
                "no, a difernt biomerge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about<br>\r\nScott/Falcomon ravemon<br>\r\n</span></div></span></div>",
            "created":1302152400,
            "id":1083595,
            "title":"no, a difernt biomerge"
        },
        "15532112112222222":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "yes",
                "no, a difernt biomerge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about<br>\r\nSara/Syakomon  AncientMermaimon<br>\r\n</span></div></span></div>",
            "created":1302152400,
            "id":1083596,
            "title":"no, a difernt biomerge"
        },
        "155321121122222222":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "Cierra/Salamon  Ophanimon",
                "Melody/Mikemon  MirageGaogamon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about either of the last two</span></div></span></div>",
            "created":1302152400,
            "id":1083597,
            "title":"no, a difernt biomerge"
        },
        "155321122":{
            "author_id":"megidramon",
            "author_name":"megidramon",
            "choices":[
                "the biomerges win",
                "zqiaomon wins"
            ],
            "content":"<div class=\"\"><div> <span>The ground starts to tremble as zhqiaomon appears and with flames  flowing all around him he says “ i was willing to tolerate this human-digimon abomination when there were four of you and you were saving all of reality but you come here to my domain and spoil the ground with your discusting spawn walking on it” zhqiaomon was not reely that angry, the main reason he was lashing out like this was because he felt threatend as though you had created the biomerges to destroy him for his insults before the great war. Suddenly he roars “phoenix fire” as he breathes an inferno of rage that engulfs the new biomerges but as the smoke clears they are unharmed “ok guys i was going to train you by having you fight some stray dramon but this is much better” </span></div></div>",
            "created":1301374800,
            "id":1078147,
            "title":"the sovereign attack"
        }
    },
    "info":{
        "author_id":"megidramon",
        "author_name":"megidramon",
        "brief_description":"be gallentmon in the future of a paralel universe in which the juggernaut was never used",
        "created":1288911360,
        "description":"<td align=\"left\" class=\"norm\">in this paralel universe they decided not to use the juggernaut to destro the d-reaper of fear of what it might do to the biomerges and so one by one the biomerges die in fighting the d-reaper exept gallentmon who has digivolved to a level higher than the sovrieghn digimon and is now called glorygallentmon. he has just won the war and in this first person experience gallentmon has to readjust to normal life</td>",
        "id":1722075,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1541080800,
        "modified":1541080800,
        "pretty_title":"digimon without juggernaut"
    }
}