{
    "chapters":{
        "1":{
            "author_id":"ndrly",
            "author_name":"Tolchok",
            "choices":[
                "Explore this device some more",
                "Get up for breakfast",
                "See if it really had changed her name"
            ],
            "content":"<div class=\"\"><div> <span>Michelle woke up. It was July 10, 2009. Today was her 16th birthday. She felt quite excited. She could already smell the pancakes.<br>\r\n<br>\r\nShe could also feel a bit of a pain underneath her pillow. She lifted it up to find what looked like a computerised organizer. There was a note attached.<br>\r\n<br>\r\n\"Happy Birthday\"<br>\r\n<br>\r\nThere was no return address, nor name of the sender. She picked it up and pressed the button. A red laser shot out of it. She pointed it around the room. She pointed it at herself. The device then lit up to show her her personal details.<br>\r\n<br>\r\nName: Michelle Janice Richards<br>\r\nHeight: 4' 10''<br>\r\nPhysical birthday: July 10, 1993<br>\r\nMental birthday: July 10, 1993<br>\r\nBra size: B<br>\r\nShoe size: 16<br>\r\n<br>\r\n\"Ho hum\" she thought. She noticed that she could edit it. She thought, \"Hm, never thought of myself as a Michelle, more like Liz\". She changed her name thusly.<br>\r\n<br>\r\n\"Liz, time to get up!\", she heard her mother calling.<br>\r\n<br>\r\nDid her mother just call her what she changed her name to?<br>\r\n<br>\r\nShe decided to...</span></div></div>",
            "created":1249794000,
            "id":741901,
            "title":"The Beginning"
        },
        "11":{
            "author_id":"lloydie16",
            "author_name":"Chrissy",
            "choices":[
                "The Mall",
                "Home",
                "School",
                "Park",
                "Friends House"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where should she explore the device more?<br>\r\n</span></div></span></div>",
            "created":1251090000,
            "id":749428,
            "title":"Explore this device some more"
        },
        "111":{
            "author_id":"pinkbirdo",
            "author_name":"Gatonom",
            "choices":[
                "A clothing store.",
                "The food court",
                "Somewhere else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Michelle heads to the mall, upon arriving she looks around at all the subjects for her power.  She decides to start off at:</span></div></span></div>",
            "created":1323579600,
            "id":1238255,
            "title":"The Mall"
        },
        "1111":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Janice shrieked in horror and revulsion, SHE wasn't a lesbian.",
                "With Ed dealt with Michelle thought of other wrongs to right.",
                "She turned her attention to the manstealer, now."
            ],
            "content":"<div class=\"\"><div> <span>Michelle's fist curled angrily into a tiny fist, when she spotted Ed at the Mall. He was hanging around with that slut Janice. It only took her a moment to think up her vengeance. Her fingers trembled in anticipation as she typed his name into the device. His details popped up on screen in a flash.<br>\r\n<br>\r\nName: Ed Miller<br>\r\nHeight: 5' 11''<br>\r\nPhysical birthday: June 15, 1991<br>\r\nMental birthday: June 15, 1991<br>\r\nBra size: N/A<br>\r\nShoe size: 10<br>\r\n<br>\r\nShe snorted, he'd always claimed he was 6' feet tall. It was the least of his lies, she thought, anger still filling her veins. She retyped his name, and a few other details until she was satisfied. At the bottom of the screen, the button pulsed ready to be pushed.<br>\r\n<br>\r\n<span class=\"cgreen\"><b>Initiate Change</b></span><br>\r\n<br>\r\nShe stabbed it with more fury than she intended, and waited for the effects to become obvious. Soon, Eddie was coughing, his voice cracking as it rose higher. His muscles were wasting away as they softened and vanished. Height was next, and mass, as Ed was swimming in his clothes.<br>\r\n<br>\r\nThe clothes followed once the bodily changes were complete. Edwina felt her baggy clothes shift, becoming skin tight and showing off her sumptuous new body and it's curves. As even that awareness faded, she posed, displaying herself, flaunting herself. Edwina was proud of her body, proud of her knowledge of the Law, she giggled at the powerlessness of the cops. She was still street-legal.<br>\r\n<br>\r\nName: Edwina Miller<br>\r\nHeight: 5' 1''<br>\r\nPhysical birthday: June 15, 1991<br>\r\nMental birthday: June 15, 2001<br>\r\nBra size: JJ<br>\r\nShoe size: 10<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://weallhavefetisheslikeinflation.tumblr.com/image/143565196324\" target=\"_blank\">http://weallhavefetisheslikeinflation.tu...</a><br>\r\n<br>\r\nSnaking one crimson clawed hand around Janice, she gave her girlfriend's bust an appreciative squeeze. Allowing her nails to scrape teasingly over the plump, pert, firm flesh.</span></div></div>",
            "created":1482901200,
            "id":2255787,
            "title":"A clothing store."
        },
        "1112":{
            "author_id":"amel1995",
            "author_name":"amel1995",
            "choices":[
                "herself",
                "her best freind and her boyfreind",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>she deside to go to the food court where she find 5 poeple there. three girls around 21 on one and one couple in the other , the girls where giving the couple a hard time because the women wight about 350 pound while the man weight about 460 pound and the three girls were very fit and toned one of them you cn clearly see her abs fromher t-shirt that looks like a bra under her F cup tits. So Liz shakes the things up a bit and make the couple very fit by giving the man a very muscular body and the women a porn ster body.<br>\r\nwhile one of the girl is turnef*d to a midle aged man with flabby gut and the other is a not so hot 40 year old women that looks like board more than a women and the third one is a 4 year old girl.<br>\r\nwho do she change next</span></div></div>",
            "created":1360386000,
            "id":1528169,
            "title":"The food court"
        },
        "11122":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "he was dressed quite fashionably",
                "He was dressed in girl's clothes",
                "he was dressed identically to Nadine"
            ],
            "content":"<div class=\"\"><div> <span>Michelle was passing through the mall looking for other interesting targets when she spotted her friend Nadine, looking through clothes at a Forever 21, her boyfriend Nick was there doing his best to appear engaged and interested but You knew Nick was never that into shopping<br>\r\n<br>\r\nShe pulled up Nicks information and scanned through the list until she found something fun.<br>\r\n<br>\r\n<b>Favorite Store</b><br>\r\n<br>\r\nShe then Copied Nadine's favorite stores into Nicks information.<br>\r\n<br>\r\nWhen she looked back at the couple, Nick was dressed differently</span></div></div>",
            "created":1546120860,
            "id":2595648,
            "title":"her best freind and her boyfreind"
        },
        "111221":{
            "author_id":"piney1",
            "author_name":"Pinetree",
            "choices":[
                "Dressed as a character from a franchise",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Nick no longer looked how he did previously. He wasn’t wearing a pair of blue jean pants with a T shirt and a pair of black tennis shoes that were practically falling apart anymore like he usually does. Rather than that he looked quite charming. On his feet rather than old damaged tennis shoes he had on a pair of brown leather dress shoes. They were so polished one could see their reflection in them. What was once a pair of blue jeans was replaced by a pair of dress pants. They had a pinstripe design with the two colors being a light gray and a dark gray. To match the rest of the clothing nick has a dark blue dress shirt tucked into his pants but on the outside of that he was wearing a suit jacket. It was black but had decorative pieces of metal such as a gold chain in his pocket attached to his pants loop looking like a pocket watch. He had a pair of black sunglasses covering his eyes similar to the ones sene in the matrix and his hair was nicely brushed. It looked as if it was done by a professional barber. Michelle is trying to figure out how that goes with the information she out in but she realizes how. The reason it makes sense is because nick is</span></div></div>",
            "created":1569526080,
            "id":2723776,
            "title":"he was dressed quite fashionably"
        },
        "112":{
            "author_id":"lloydie16",
            "author_name":"Chrissy",
            "choices":[
                "His Name",
                "His Hieght",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There she See her Brother Chris.<br>\r\n<br>\r\nShe decisides to change something about him.<br>\r\n<br>\r\nWhat does she Change</span></div></span></div>",
            "created":1251090000,
            "id":749530,
            "title":"Home"
        },
        "1121":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Your exboyfiend. (a real jerk)",
                "Your best friend.",
                "A teacher."
            ],
            "content":"<div class=\"\"><div> <span>\"I wonder what will happen if I change his name from Chris to Christina.\" you thought, working with the editor. \"Maybe I'll get a cute little sister rather than an annoying little brother.\" the idea made you giggle as you pressed the edit button.<br>\r\n<br>\r\n\"Christina!\" mom called. \"Can you help me in the kitchen?\"<br>\r\n<br>\r\n\"Coming mom!\" came a feminine voice.<br>\r\n<br>\r\nYou blinked and saw your little brother, now a little sister, wearing a pink dress and mary janes as she gingerly skipped into the kitchen to help mom. Stunned and awed, you looked at the personal info editor, a mischievous grin forming onto your face. \"I can have a lot of fun with this.\" you whispered.<br>\r\n<br>\r\nWho do you try the editor on next?<br>\r\n</span></div></div>",
            "created":1297659600,
            "id":1053993,
            "title":"His Name"
        },
        "1122":{
            "author_id":"swtsngbrd",
            "author_name":"Songbird",
            "choices":[
                "Liz is getting powermad. What happens next?",
                "Liz is stunned. What happens next"
            ],
            "content":"<div class=\"\"><div> <span>Michelle, now Liz, always hated that her brother was so tall. He always called ehr Squirt. Well, she would show him! <br>\r\n<br>\r\n\"HA! no more 6'3\" for you Chris\" she said with a mischevious smirk. \"Let's see how you like being 4'2\"!\"<br>\r\n<br>\r\nShe giggled just a little louder than she planned as Chris shrunk before her eyes!<br>\r\n <br>\r\n\"Hey dude! What's going on? Why am I shrinking? MOM!!!\"</span></div></div>",
            "created":1252645200,
            "id":758779,
            "title":"His Hieght"
        },
        "11221":{
            "choices":[
                "Chris tell his mother.",
                "Liz tries out the other things on the laser. "
            ],
            "content":"<div class=\"\"><div> <span>  \" You know Chris you liked being tall. Lets find out why!\" she said as she changed her height to his old height of 6' 3\", Chris watched in horror as Liz began to grow right infront of his eyes, from being tiny mousy Liz to amazon Liz. He tried to look her in the face but her breasts, two huge orbs blocked his view. <br>\r\n<br>\r\n   \" Haha, I am a giant!\" she shouted for fun. Chris, who used to be bigger than her was afraid of what would she do to him now she was bigger. \" You are so small from up here, hope the air is alright.\" she teased him. Chris tried to hit by punching her in the stomach but Liz did not budge. \" You will regret that.\" said Liz.<br>\r\n<br>\r\n  With one puch to his gut, Chris was sent sprawling onto the floor. \" Someone bigger is in charge now little Chris!\" said Liz. </span></div></div>",
            "created":1258002000,
            "id":790714,
            "title":"Liz is getting powermad. What happens next?"
        },
        "112211":{
            "author_id":"hydrologic",
            "author_name":"HydroLogic",
            "choices":[
                "Liz measures Chris",
                "More size changing"
            ],
            "content":"<div class=\"\"><div> <span>Chris struggles to get up off the floor and looks up at Liz. He is completely frightened that his littler sister is now so much bigger than he is, so he runs off to tell his mother what just happened. On his way there, the effects of the reality device start to kick in. He no longer remembers his old life as the taller older brother. Instead he thinks he has always been 4'2\" and his \"little\" sister was always 6'3\". \"Why did I punch her?\" thinks Chris, \"I know it would just make her mad. Oh well, I'll tell mom and she'll put Liz in her place.\"<br>\r\n<br>\r\n\"Mom! Mom!\" Chris yells. \"Liz hit me!\"<br>\r\n<br>\r\n\"What's that, dear? Liz hit you? I'm sure she didn't mean it. You probably just got in the way of her elbows again.\"<br>\r\n<br>\r\nLiz walks into the room, her head only inches from the top of the door frame. \"Hi, mom.\"<br>\r\n<br>\r\n\"What's all this I hear about you hitting little Chris?\"<br>\r\n<br>\r\n\"Oh, it's nothing mom. I just wasn't looking where I was going. You know it can be hard to see him since he's so small.\"<br>\r\n<br>\r\n\"But mom!\" Chris yells. \"She's lying! She did it on purpose!\"<br>\r\n<br>\r\n\"Now, now Chris. I'm sure she didn't mean it,\" his mom says sympathetically, \"You just have to look out where you're going. Now why don't you go hug your little sister and tell her you're sorry.\"<br>\r\n<br>\r\n\"But mom!\"<br>\r\n<br>\r\n\"No buts. Just do what I said, young man.\"<br>\r\n<br>\r\nChris looks back at his sister. Liz has her arms already stretched out ready for the hug. \"Come on little Chris, give your little sister a big hug.\" She's loving every moment of this. Chris begrudgingly hugs her. Liz pulls him in tighter against her stomach. In the process of the hug, she uses the device to expand her breasts a bit. They surge out and are now resting over the top of Chris's head. Just one of them is bigger than his head.<br>\r\n<br>\r\n\"Little Chris, is it just me or do you look taller than usual? Maybe you're finally getting that growth spurt.\" They are still in the hug and Chris tries to look up at her, but is greeted with her boobs on his face. \"How tall are you again Chris?\" Chris is happy to hear that maybe he's finally getting taller. \"You know how tall I am. I've been 4'2\" since elementary school.\"<br>\r\n<br>\r\n\"Hmm, I don't know. Let's go measure you.\"</span></div></div>",
            "created":1339736400,
            "id":1360480,
            "title":"Chris tell his mother."
        },
        "1122111":{
            "author_id":"hydrologic",
            "author_name":"HydroLogic",
            "choices":[
                "Get ready for school",
                "More size comparisons"
            ],
            "content":"<div class=\"\"><div> <span>Liz takes Chris's hand and leads him up to her room. Chris is having trouble keep up with her long strides.<br>\r\n<br>\r\n\"Ok Chris, why don't you go stand over by the door.\" Liz fetches the measuring tape she always kept in her drawer. When she used to be 4'10\", she would check her height every day hoping she would get taller. But now, it has other uses.<br>\r\n<br>\r\n\"Now how tall did you say you were Chris?\" Liz gets on her knees so she can get a more accurate measurement.<br>\r\n<br>\r\n\"Umm, I've been 4'2\" for years now. Do you really think I could be taller?\"<br>\r\n<br>\r\n\"Maybe,\" says Liz. \"Now stand up straight.\" As she's measuring him, she uses the device to shrink him 2 more inches. \"Come on Chris. Stop slouching. I told you to stand up straight.\"<br>\r\n<br>\r\n\"I am!\" Chris complains.<br>\r\n<br>\r\n\"Well this can't be right...<br>\r\n<br>\r\n\"What is it?\"<br>\r\n<br>\r\n\"It says you're only 4 feet even.\"<br>\r\n<br>\r\n\"What?! There's no way!\" Chris stands back and looks at the measurement. He's shocked at what he sees. \"I've been 4'2 for years! That can't be right!\"<br>\r\n<br>\r\n\"Now Chris...\" Liz says, \"I know you're short, but that doesn't give you an excuse to lie.\"<br>\r\n<br>\r\n\"But I...\" He start to think about it. Was he really only 4'0\" and he's been lying all this time? He rationalizes it as he must have told the lie so many times, he actually started to believe it.\"<br>\r\n<br>\r\n\"You know Chris, sometimes I feel like the older sister having to teach you your lessons. I guess I was wrong about your height though. You're not getting taller. In fact, in some ways, it seems like you shrunk.\" She laughs. \"But it's still not very nice to lie, even if it's just about how tall you are\"<br>\r\n<br>\r\n\"I know...\" Chris looks up at Liz's imposing figure. He's far enough back that he can see her face over her breasts. After all these years he's still frightened of his \"little\" sister. His fear mixed with his shame of lying causes him to look down. \"I'm sorry...I guess I just wanted to seem taller...\"<br>\r\n<br>\r\n\"It's okay, little Chris. Just don't let it happen again. And look at me when I'm talking to you.\" She takes a step towards and puts her hands on her hips.<br>\r\n<br>\r\nChris looks up at her, barely able to see her face looking down at him past her breasts. \"I'm sorry. It won't happen again.\"<br>\r\n<br>\r\n\"Good. Now, since I measured you, why don't you measure me? I've been feeling a lot taller lately.\" She hands him the measuring tape and stands next to the door.<br>\r\n<br>\r\nHe looks at the measuring tape and then back at Liz waiting to be measured. \"Sis...\"<br>\r\n<br>\r\n\"What is it? What are you waiting for?\"<br>\r\n<br>\r\n\"Umm, I don't think I can reach...\"<br>\r\n<br>\r\n\"Nonsense. You're not that short. Just try.\"<br>\r\n<br>\r\nChris tries to reach up to measure her, but his hands only reach to her shoulder level. Liz is enjoying every moment of this torture.<br>\r\n<br>\r\n\"See sis? There's no way I can reach.\"<br>\r\n<br>\r\nLiz looks down at him and smiles. \"Try standing on your toes. You can make it.\" Chris tries standing on his toes and reaching as far as he can, but still doesn't make it anywhere close to her head. Liz eventually gets tired of it and says, \"Okay Chris, maybe you're shorter than I thought. Why don't you go get my chair and use it to measure me?\"<br>\r\n<br>\r\nChris feels humiliated, but he knows better to disobey his sister. He brings the chair over next to her. He gets up on it and it looks like he can reach now. He starts to bring the measuring tape up to her head, but as he's just about to reach the top, Liz uses the device to make herself slowly grow taller. Liz is getting a kick out of watching him and can't help but smile. Every time he's just about reached, she grows a little bit, and he has to reach even farther. Eventually she stops when she's 7 feet tall, thankful for the tall ceilings.<br>\r\n<br>\r\nChris doesn't want to disappoint her again, so he keeps trying. Liz can see that he's trying to avoid touching her breasts while trying to measure. She uses the device again to make her boobs a little bigger. They surge forward and knock Chris off the chair and he falls to the ground. \"Short and clumsy. What am I going to do with you, brother?\"<br>\r\n<br>\r\n\"I'm sorry sis. I don't think I can reach even with the chair.\"<br>\r\n<br>\r\n\"Ugh...\" She sighs. \"Do I really have to do everything?\" She bends down and picks him up so that he's eye level with her. \"There. Now can you finally measure me?\"<br>\r\n<br>\r\nHe reaches up and says, \"Wow sis, you're 7 feet even. That's taller than I thought you were.\"<br>\r\n<br>\r\n\"Aww, that's sweet, Chris. I have been noticing I was getting taller lately.\" She puts him down on his feet and she's amazed that his head only comes up to the top of her hips. She giggles at how tiny he looks next to her.<br>\r\n<br>\r\nChris looks up and up and up at Liz, his mouth hanging open. Was she always this tall? Memories start to form in his mind. He now remembers having to watch his little sister grow and grow and grow. She's only 16 and already 7 feet tall with no sign of stopping.<br>\r\n<br>\r\nLiz sees him staring at her. \"What are you looking at?\"<br>\r\n<br>\r\n\"Nothing. You're just so tall...\"<br>\r\n<br>\r\n\"Aww, thanks. See? You can be so nice when you want to be.\" She ruffles his hair. \"You're just so cute when you're small.\"</span></div></div>",
            "created":1339736400,
            "id":1360533,
            "title":"Liz measures Chris"
        },
        "11221111":{
            "author_id":"hydrologic",
            "author_name":"HydroLogic",
            "choices":[
                "Liz changes Chris's personality",
                "Liz makes Chris smaller"
            ],
            "content":"<div class=\"\"><div> <span>Their mom calls from downstairs, \"Chris. Liz. I'm leaving for work. You better be getting ready for school up there.\"<br>\r\n<br>\r\n\"Why don't you help me get ready for school, little Chris?\" says Liz.<br>\r\n<br>\r\nHe always hated being called \"little Chris.\" Every time he heard it, he'd get a little angrier inside. And this constant humiliation he was getting from her was just adding to it. He dare not show it though. He knows he stood no chance against her. He holds his anger in and responds, \"Okay, what do you want me to help with?\"<br>\r\n<br>\r\nShe bends at the waist so that her face is right above his so that she can make him feel even more cut down to size. \"Hmm, you can help me pick out my outfit for school!\"<br>\r\n<br>\r\nHe thinks to himself: Why does she always have to treat me like a little kid, bending over just to talk to me? I know I'm short, but I'm still the older brother and she should treat me with some respect.<br>\r\n<br>\r\nChris eventually says, \"Fine. I'll help I guess.\"<br>\r\n<br>\r\nLiz notices the defiance in his voice. She wonders if she should do something about it, but decides against it...for now. \"Great. Can you go get my new heels I bought? They're in my closet.\"<br>\r\n<br>\r\nHe goes over to the closet and sees too many heels to count. Girls, he thinks, they have so many shoes. \"Uhh, which ones are they?\"<br>\r\n<br>\r\n\"Oh they're new, so they're still in the box.\"<br>\r\n<br>\r\nChris looks around but he doesn't see any box. Eventually it occurs to him to look up. There it is. Of course, he thinks, she would put it out of my reach. He doesn't say anything about it though. If he wants to gain respect as the big brother, he needs to do things on his own and not ask for help. But how is he going to get the box? He thinks for a moment. Maybe if he jumps up and grabs a hold of the rack, he can knock the box down so he can get it. Sounds good, but he wonders if he can put it into action. He attempts to jump and after a few tries, he actually reaches it. He tries to use the other hand to knock the box down, but loses his hold with the other hand and falls down, bringing a few of Liz's shirts and hangers down with him. He land with a thud and knocks a few of her shoes around too.<br>\r\n<br>\r\nLiz was entertained watching the whole thing, but now she's angry. She walks over to the closet. \"Really, Chris? I guess you're just too little to do anything right. You're just a little boy.\" She grabs the box of shoes and picks Chris up with her other arm and carries them both over to her bed. She puts the shoes down on her bed and puts Chris on the floor.<br>\r\n<br>\r\nShe bends all the way down and looks him right in the eye. \"You're so short, little Chris. You're just too tiny to help me with anything. You're so useless.\" Liz continues to berate him and each insult hits Chris like punch in the stomach. Chris is getting angrier and angrier, but still too scared to show it.<br>\r\n<br>\r\n\"Just go get my jeans, will you?\" Liz says. \"The ones with the hearts on them. They're in the bottom drawer of my dresser. You think you can reach it, shorty? There's no way you can mess this one up, little man.\" Liz begins to undress until she's standing there just in her bra and panties.<br>\r\n<br>\r\nChris says nothing and walks over to her dresser. He takes a little too much time and Liz gets impatient waiting for him. She walks over to him. \"Really shorty? Can't even find a simple pair of jeans?\" She picks him up and sets him down behind her. She turns back towards the dresser and bends down to get her jeans. As she bends down, she can feel her butt push against Chris's face. Chris doesn't know what to do. His face is being smothered by his little sister's giant ass, but if he moves from his spot, she might get mad at him.<br>\r\n<br>\r\nLiz uses the device to grow her butt, further smothering Chris's face. His head is almost completely surrounded by her growing ass. Liz stands back up having found her jeans. She turns around towards Chris, completely towering over him, barely able to see him past her breasts. She decides to tease him a little more.<br>\r\n<br>\r\n\"Aww, you're just a little perv, aren't you little Chris? I bet you liked my ass on your face.\" With every sentence she bends down a little more towards him. \"You can't get any other girl so you perv on your own sister. You're just a short little boy and no girl is ever going to want you because you're just too tiny.\"<br>\r\n<br>\r\nThat was the final straw. Chris couldn't take it anymore. He thinks to himself, maybe if he can take out just one of her legs he can hurt her enough and have time to run away. Liz is bent about halfway down to his face, so maybe she'll be a little bit off balance. Not to mention her enormous breasts.<br>\r\n<br>\r\nChris decides to go for it and, using all his strength, he makes a run for one of her legs. He runs into it and he just bounces off of it and falls to the ground. He looks up at Liz and she's angrier than ever. He gets back up and tries to make a run for the door.<br>\r\n<br>\r\nLiz just reaches out with her long arms and grabs the back of his shirt. \"I'm going to make sure you never do anything like that to me ever again...\"</span></div></div>",
            "created":1339736400,
            "id":1360557,
            "title":"Get ready for school"
        },
        "112211112":{
            "author_id":"hydrologic",
            "author_name":"HydroLogic",
            "choices":[
                "Get washed up for school",
                "Tease Chris some more about his size"
            ],
            "content":"<div class=\"\"><div> <span>Liz holds Chris by his wrists so he can't get away. \"You're never going to do that to me ever again, little Chris.\"<br>\r\n<br>\r\nShe uses the device to make him start to slowly shrink and she sets a delay so he won't accept the changes as reality yet. She wants him to experience the shrinking.<br>\r\n<br>\r\n\"Just let me go!\" Chris yells. \"I'm your big brother. You can't keep me here.\"<br>\r\n<br>\r\n\"You're my big brother, huh? You don't look so big from up here.\" She stands up to her full height. She can already see Chris getting smaller.<br>\r\n<br>\r\nAt first, Chris doesn't realize anything, but eventually notices that his eye level, which is usually even with Liz's hips, is starting to drop.\"What's happening? Why do I feel so weird? Why do you look taller?\"<br>\r\n<br>\r\nInches melt away from Chris. Slowly he gets smaller and smaller. Liz lets go of his wrists. In a few seconds he won't be able to even reach the doorknob. There won't be anywhere for him to run. Liz just stands over him emphasizing her \"growing\" size from his point of view.<br>\r\n<br>\r\nChris looks around the room and sees that everything is growing along with Liz. \"I'm shrinking! How are you doing this? Wasn't I already small enough?\"<br>\r\n<br>\r\n\"Don't worry, little Chris. In a few moments, it'll all seem normal again.\" Chris continues to dwindle. He isn't even as tall as Liz's legs.<br>\r\n<br>\r\nChris whines. \"Please Liz. Make it stop. I'm sorry. I didn't mean it. I was already too short to begin with! Please just change me back to that height and I'll behave. I don't want to be smaller.\"<br>\r\n<br>\r\n\"Oh you'll be sorry. You can be sure of that.\" Liz feels a rush of power as Chris slowly gets smaller and smaller. He's too frightened to even run away. Soon Chris's shrinking stops and he's left at 2 feet tall.<br>\r\n<br>\r\nChris is now barely taller than Liz's knees. He looks up and up and up at his giant sister, completely shocked at what just happened. How did his little sister shrink him? How was he going to get through life at 2 feet nothing. It was already hard enough at only 4 foot. \"Liz... I'm sor...\"<br>\r\n<br>\r\nLiz interrupts him with a swift kick to the stomach. He falls onto his back. Liz puts her foot down on top of him, making him unable to get back up. Chris is so small that her foot takes up his entire torso and then some. Liz uses the device to make her feet a few sizes bigger. She savors every second of watching her toes creep up ever so slowly onto his face. Her feet stop growing just as her toes completely cover Chris's mouth.<br>\r\n<br>\r\nChris watches in pain as her toes get closer and closer to his face. Chris thinks, is she getting bigger or am I getting smaller again? He's about to say something just as Liz's toes cover his mouth.<br>\r\n<br>\r\n\"Now listen up, little Chris. No, you're not just little anymore, are you? You're itty bitty Chris now. You will never attack me again. You got that, teeny tiny Chris? I'm the big little sister and you're going to do whatever I tell you.\"<br>\r\n<br>\r\nAs Liz continues to reprimand Chris, the changes of reality start to solidify in Chris's mind. He no longer remembers shrinking. He believes he was always 2 feet tall. Why did I even attack her?, thinks Chris. Temporary insanity? I must have been insane to try anything. I'm barely taller than her knee. Just one of her legs is at least twice as strong as my entire body. What did I think I would accomplish by attacking her?<br>\r\n<br>\r\n\"...Do you understand me, little Chris?\" Chris tries to nod his head, but can barely move because of her foot. \"Kiss my toes if you understand.\" Chris knows he as no other choice. He begins kissing her toes. Liz wiggles her toes in delight and laughs. \"Haha, little Chris. Just my foot has complete power over you. Okay, you can get up now.\" She keeps him pinned with her foot. She can feel him struggle underneath her foot. \"Come on, Chris. Get up already.\"<br>\r\n<br>\r\n\"I'm trying,\" Chris says a little muffled under her toes.<br>\r\n<br>\r\n\"Oops, is my little foot keeping you down?\" Liz removes her foot and Chris starts to stand back up. She uses her toes to push him over again and Chris falls down. \"Oops, I guess I don't my own toes' strength.\"</span></div></div>",
            "created":1339822800,
            "id":1360698,
            "title":"Liz makes Chris smaller"
        },
        "1122111122":{
            "choices":[
                "She takes him downstairs and makes him some food?",
                "She changed herself so she started producing milk?"
            ],
            "content":"<div class=\"\"><div> <span>Liz again shrinks Chris and makes him 20.00 inches long, but then realised her can't tease him so she makes him remember everything.<br>\r\n<br>\r\nChris looks at Liz and screamed what the hell, Liz smiles and picked him up putting him on her hip.<br>\r\n<br>\r\nAww don't you look sweet, try picking on me now big brother or should I say baby brother.<br>\r\n<br>\r\nLiz walks shouts him in a room and she goes shopping and gets Chris some pink nappies, tights, dresses, dungarees and romper suits.<br>\r\n<br>\r\nLiz returned dresses Chris like a baby girl, he is still shouting at Liz.<br>\r\n<br>\r\nShe smiles and say you must be hungry?</span></div></div>",
            "created":1451451600,
            "id":2081377,
            "title":"Tease Chris some more about his size"
        },
        "11221111222":{
            "author_id":"ned1957",
            "author_name":"Ned1957",
            "choices":[
                "Pees",
                "Poops"
            ],
            "content":"<div class=\"\"><div> <span>She picks Chris up whilst unbuttoning her blouse, Chris looks horrified wondering what his sister is up to, she releases her left breast from her bra &amp; forces Chris's face towards her hardened nipple, Chris is too weak to fight his sister &amp; as his mouth is forced onto the nipple he can only open his mouth &amp; latch on, as He's suckling he becomes drowsy, as He's drifting off to sleep he has an accident in his diaper.<br>\r\nWhat happens next?</span></div></div>",
            "created":1525085280,
            "id":2486274,
            "title":"She changed herself so she started producing milk?"
        },
        "112211112221":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Make him her child and baby",
                "His gender "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Liz quickly changed Chris although she has reduced her hight to about 5'8 now so it's easier to look after Chris...<br>\r\n<br>\r\nShe look at her device and decided to change Chris again... </span></div></span></div>",
            "created":1541078100,
            "id":2571474,
            "title":"Pees"
        },
        "11222":{
            "author_id":"0000w",
            "author_name":"0000w",
            "choices":[
                "Reality changed",
                "Reality stayed the same"
            ],
            "content":"<div class=\"\"><div> <span>Liz was stunned by what happened. She shrunk her older brother! From a tall 6'4 to a measly 4'2? She couldn't believe it! She actually started to panic in her head, denying what just happened. Liz then changed his height on the device. She then heard a crash. She looked at her brother and saw that half his body was in the ceiling! Checking the device, she saw she changed to number higher than 6'4. It was 14'2! She panicked again, but because of her panic, she didn't notice her brother's foot kick her away. Getting up, she realized she dropped the device somewhere.<br>\r\n\"Liz!\" She heard her brother call out to her.</span></div></div>",
            "created":1477803600,
            "id":2230330,
            "title":"Liz is stunned. What happens next"
        },
        "1123":{
            "author_id":"lloydie16",
            "author_name":"Chrissy",
            "choices":[
                "Shoe Size",
                "Bra Size",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok We have</span></div></span></div>",
            "created":1251090000,
            "id":749534,
            "title":"Something else"
        },
        "11231":{
            "author_id":"lloydie16",
            "author_name":"Chrissy",
            "choices":[
                "Do My Chores any Tiey My Room",
                "Or Let Me Give you a bit of a Make over"
            ],
            "content":"<div class=\"\"><div> <span>She Says \"i know ill change his shoe size from a size 14 to a size 5\" <br>\r\n<br>\r\nSuddenly his feet begain to shrink. Chris started to walk funny because the shoes he was wear are too big for him.<br>\r\n<br>\r\nChris then said \"Michelle i know it was you how did you do it?\"<br>\r\n<br>\r\nMichelle just Smiled and said \"i dont know what your on about\"<br>\r\n<br>\r\nChris Says \"know what am i going to do?\"<br>\r\n<br>\r\nMichelle Says \"you have 2 options your First option is go and buy new shoes and your second option is    You could borrow my Shoes\"<br>\r\n<br>\r\nChris just stands there and says \"Well my first option is gone because I don't have much money Soooo im going to have to borrow your shoes\"<br>\r\n<br>\r\nMichelle Laughts and says \"You Ant borrowing my shoes that easy first you have to do something for me\". Chris Says \"What ?\"<br>\r\n<br>\r\nMichelle Says \" Well you Could<br>\r\n</span></div></div>",
            "created":1251090000,
            "id":749552,
            "title":"Shoe Size"
        },
        "112312":{
            "author_id":"lloydie16",
            "author_name":"Chrissy",
            "choices":[
                "So she gives you a manicure",
                "She paints all your nails"
            ],
            "content":"<div class=\"\"><div> <span>Chris Says \"I ant Tieying Your room and doing your Chores\" Michelle Says \"Well make over it is\"<br>\r\n<br>\r\nChris Then he Says \" And I Ant having any makeover\".<br>\r\n<br>\r\nThen Chris's Phone rings he answer it and says \"hello\". Michelle Asks \"who is it?. Chris Blanks her.<br>\r\n<br>\r\nChris then hangs up and shouts \"Yeesss\". Michelle says \"What you shouting for ?\"<br>\r\n<br>\r\nChris says \"Im going to the mall tomorrow\". Michelle then says \"No you ant\". Chris says \"why ant I ?\" <br>\r\n<br>\r\nMichelle replys with \"Well what shoes are you going to wear to the mall\" . Chris realises.<br>\r\n<br>\r\nMichelle then says \"So what are you going to do chris\" Chris Says \" Well I guess ill \"<br>\r\n<br>\r\nMichelle sligly inturrupts \"By the way Tieying my room and doing my chores is nolonger available\"<br>\r\n<br>\r\nChris looks at her realy mad and says \"ok ill have a Makeover.\"<br>\r\n<br>\r\nA Smile now appear on Michelles face.<br>\r\n<br>\r\nShe says lets start with your nails there horrific </span></div></div>",
            "created":1251090000,
            "id":749570,
            "title":"Or Let Me Give you a bit of a Make over"
        },
        "1123122":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "do another task",
                "Screw it wear the heels"
            ],
            "content":"<div class=\"\"><div> <span>Michelle paints all of chris's nails, then does his makeup, then styles his hair as girly as possible, and lastly makes him wear a dress of hers...<br>\r\n<br>\r\n\"fine are we done now, can i borrow a pair of shoes and go back to normal.\"<br>\r\n<br>\r\n\"yep, here you go\" michelle says handing him a pair of high heels<br>\r\n<br>\r\n\"I'm not wearing these!\" he shouts \"give me tennis shoes<br>\r\n<br>\r\n\"hey the deal was a makeover for a pair of shoes, you got shoes, if you want another pair you'll have to do something else for me, or you can got to the mall in your boy clothes wearing those shoes</span></div></div>",
            "created":1296450000,
            "id":1045116,
            "title":"She paints all your nails"
        },
        "11232":{
            "author_id":"luigirules123",
            "author_name":"Tim",
            "choices":[
                "D D",
                "J J"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to change his bra size but what to?  </span></div></span></div>",
            "created":1302238800,
            "id":1084471,
            "title":"Bra Size"
        },
        "112321":{
            "author_id":"janis_en_femme",
            "author_name":"Janis",
            "choices":[
                "Chris develops DD breasts",
                "Liz's father walks in between Liz and Chris"
            ],
            "content":"<div class=\"\"><div> <span>Liz holds the device toward her brother and reads:<br>\r\nNames: Christopher Robin Richards<br>\r\nHeight: 5'10\"<br>\r\nPhysical Birthday: April 10, 1990<br>\r\nMental Borthday: April 10, 1990<br>\r\nBra Size: N/A<br>\r\nShoe Size: 9<br>\r\n<br>\r\nLiz makes an adjustement and clicks the device in the direction of her brother, when suddenly:</span></div></div>",
            "created":1308978000,
            "id":1134263,
            "title":"D D"
        },
        "1123211":{
            "author_id":"janis_en_femme",
            "author_name":"Janis",
            "choices":[
                "It's a sisterly kiss on tgeh cheek.",
                "It's a deep, loving kiss."
            ],
            "content":"<div class=\"\"><div> <span>With each step he takes, you see his chest blossom in feminine glory. By the time he steps out of his bedroom, he is sporting a pair of luscious DD breasts. He doesn't react to them or even seems to notice anything different.<br>\r\nHe sees you and says, \"Happy Birthday, honey!\" His voice is very soft and feminine. \"I picked you up a little something,\" as he hands you a gift-wrapped box.<br>\r\nYou take the gift, but stare at him with your mouth open.<br>\r\n\"Close your mouth, honey, or something will fly in,\" he giggles. \"I know must look a mess. Another late night. Mom and Dad still think I'm a female impersonator. But I was voted the Number One She-male stripper at the club last night. It's that just to die for? But It's just another one of our little secrets. I just love that I have someone in this family that I can be myself with.\"<br>\r\nChris lean in to give you a kiss.</span></div></div>",
            "created":1308978000,
            "id":1134268,
            "title":"Chris develops DD breasts"
        },
        "11232112":{
            "author_id":"janis_en_femme",
            "author_name":"Janis",
            "choices":[
                "Chris is about to climax",
                "Liz needs more"
            ],
            "content":"<div class=\"\"><div> <span>Liz feels Chris's tongue invade her mouth. At first, she resists then welcomes it. She wraps her arms around Chris who lifts her up and carries her into his bedroom.<br>\r\n\"Now, for your real birthday present,\" Chris whispers.<br>\r\nHe carries Liz over to his bed and gently lays her on top of it. He kisses Liz all over her body as she begins to relax and enjoy. Oddly enough, she felt like this wasn;t the first time they were together. And, besides, she rationalizes, this really isn't her brother Chris. Chris isn't a she-male and she can change him back anytime. So she leans back and enjoys the loving attention of kisses from Chris the she-male.<br>\r\nShe finds herself very turned on by him as he undresses her. he kisses her neck as he removes Liz's nightshirt. He trails his tongue along her neck to her breasts. He suckles and nuzzle each one.<br>\r\nWhile Liz's head is spinning in sexual delight, Chris deftly remove her panties with one hand while carressing her breast with the other.<br>\r\n\"Oh my god,\" Liz gasps as Chris' finger slips into her warm pussy.<br>\r\n\"I see you're just as horny as me,\" Chris whispers hotly. He stands up and remove his shirt to remove a pair of amazing pert and large breasts. The sight of these get Liz extremely excited.<br>\r\nFor a brief second, Liz wonders if she may be gay but sexual passion takes over and Liz lunges at the huge tits and begins sucking on a large nipple. It feels like Liz has done this a dozen times before and each time it is as thrilling as the first. She is so involved with her new-found breast obsession that she doesn't notice Chris out of his shorts.<br>\r\nChris gives Liz a gentle push away from his tits. At first Liz pushes back until she sees his hard 9-inch cock. On pure instinct, Liz slides her mouth over it and begin sucking.<br>\r\n\"Silly girl, how many times do I have to tell you, lick don't suck,\" Chris giggles. He leans back on the bed but Liz's mouth never leaves his cock. \"Should I tell you how I do it?\"<br>\r\nLiz nods her head and Chris shivers with sexual excitement. <br>\r\n\"OK, do exactly as I say,\" Chirs whispers.<br>\r\n\"First, kiss the shaft and cup your hands around my balls.\" Liz follows his  directions exactly.<br>\r\n\"Next trail your tongue up to the top. Give a quick kiss to the head. Now put you lips around the head and slide up and down. Up and down. Now start licking the head. Feel each ridge with your tongue and  ahhh! Oh darling, you've gotten so good at this!\"</span></div></div>",
            "created":1308978000,
            "id":1134282,
            "title":"It's a deep, loving kiss."
        },
        "112321122":{
            "author_id":"janis_en_femme",
            "author_name":"Janis",
            "choices":[
                "A dress",
                "A strap-on dildo"
            ],
            "content":"<div class=\"\"><div> <span>\"I need you inside me,\" Liz growls. Liz and Chirs filp over. Now Liz is on her back with legs spread and Chris kneels with his lovely cock pointing to his magnificent tits. He leans in.<br>\r\nChris's cock presses against Liz's lips and slowly deliberately slides inside her.<br>\r\nChris begins thrusting but Liz loses als sense of time. Each hump releases new level of pleasure in Liz' brain.<br>\r\nIn what seem like hoursor second, she cums. Stifling her moan so no one hears, Liz bucks her hips against Chris. They grip each other tightly as they cum. They grip tighter then relax. They collapse.<br>\r\nAs the afterglow settles, Liz begins to wonder about her new-found sexuality. Is she gay, bisexual, straight, perverted? Strange how one change creates so many ripples of effect.<br>\r\nChris sighs with relief.<br>\r\nHe sits up and giggles.<br>\r\n\"Go on open our present,\" he insists.<br>\r\nLiz unwraps the gift and sees:</span></div></div>",
            "created":1308978000,
            "id":1134286,
            "title":"Liz needs more"
        },
        "1123211222":{
            "author_id":"janis_en_femme",
            "author_name":"Janis",
            "choices":[
                "a significant other",
                "a family member"
            ],
            "content":"<div class=\"\"><div> <span>\"I was hoping I'd be the first one you'd use it on,\" Chris whispers close to Liz' ear.<br>\r\nLiz wonders who else she would use it on. It feels hard and soft at the same time. It looks to be about a foot long and it's pink with many tiny ridges along the shaft.<br>\r\n\"Let's try it on,\" Chris insists as he straps the harness around your hips.<br>\r\nIn less than a minute, Liz's is sporting a long fake cock. She takes a quick glance in the mirror and is turned on by the sight of her with a cock between her legs.<br>\r\n\"I know the first person you want to use it in is:\"</span></div></div>",
            "created":1308978000,
            "id":1134294,
            "title":"A strap-on dildo"
        },
        "11232112221":{
            "author_id":"janis_en_femme",
            "author_name":"Janis",
            "choices":[
                "boyfriend",
                "girlfriend"
            ],
            "content":"<div class=\"\"><div> <span>\"Its all you;ve been talking about for weeks,\" Chris giggles. \"Every night you been telling me that you can't wait to buy a strap-on and use it on Sam.\"<br>\r\nLiz wrinkles her forehead.<br>\r\n\"Oh I must have fucked you silly. Have you forgotten that Sam is your:\"</span></div></div>",
            "created":1308978000,
            "id":1134297,
            "title":"a significant other"
        },
        "11232112222":{
            "author_id":"janis_en_femme",
            "author_name":"Janis",
            "choices":[
                "your mother",
                "your father"
            ],
            "content":"<div class=\"\"><div> <span>Liz covers Chris' mouth when she hears a noise outside his bedroom door.<br>\r\nLiz sees the doorknob jiggle.<br>\r\n\"Did you lock the door?\" Liz asks nervously.<br>\r\n\"Of course not. The strap-on dildo wasn't a secret. I couldn't afford it on my own.\"<br>\r\nThe door open and reveals</span></div></div>",
            "created":1308978000,
            "id":1134300,
            "title":"a family member"
        },
        "112321122221":{
            "author_id":"janis_en_femme",
            "author_name":"Janis",
            "choices":[
                "Liz makes a change or two",
                "Liz puts it back and waits to see what happens next"
            ],
            "content":"<div class=\"\"><div> <span>Liz's mother, Emily,  open the door and is standing in just her bra and panties.<br>\r\n\"Oh, that looks wonderful. Did you two start without me?\" she jokingly scolds.<br>\r\nChris blushes.<br>\r\n\"Well, isn't that a fine how-do-you-do!\" she chides.<br>\r\nEmily reaches out and hugs Liz.<br>\r\n\"Happy Birthday, darling,\" she sings as she pulls you closer.<br>\r\nEmily kisses Liz deeply. Again Liz feels before-unknown sexual stirrings. Emily stops and smiles.<br>\r\n\"A bit shy today,\" she says. \"If you'll excuse us, Chris.\"<br>\r\nEmily leads Liz to Liz's bedroom.<br>\r\nStill wearing the strap-on, Liz feels the fake cock wobble with each step she takes.<br>\r\nEmily guides Liz to her bed and turns to close the door.<br>\r\nShe sees the organizer and points it at her mother as she walks to the door. <br>\r\nThe readout shows:<br>\r\n<br>\r\nName: Emily Amanda Richards<br>\r\nSex: F<br>\r\nHeight: 5' 2''<br>\r\nPhysical birthday: March 4, 1970<br>\r\nMental birthday: March 4, 1970<br>\r\nBra size: C<br>\r\nShoe size: 13<br>\r\n</span></div></div>",
            "created":1308978000,
            "id":1134306,
            "title":"your mother"
        },
        "1123211222211":{
            "author_id":"janis_en_femme",
            "author_name":"Janis",
            "choices":[
                "Liz and mother continue",
                "Someone interrupts"
            ],
            "content":"<div class=\"\"><div> <span>Quickly, Liz changes her mother's bra size. With her newfound breast fixation, Liz increases it to DD.<br>\r\nAs mother turns around, her breasts balloon out. She almost topples over, but catches herself in time. She leans over Liz and Liz leans towards the mountainous pair of mammaries.<br>\r\nLiz's mouth seizes one huge nipple as her hand surrounds the other. <br>\r\nShe relishes the sheer delight of these magnificent pair. Again she breifly wonders if she is gay because sher does enjoy these so much.<br>\r\nHer mother twists onto the bed. She impales herself on the strap-on dildo. With a slow methodic rythym, she rides her daughter's dildo. <br>\r\n\"That's it. Suck those babies dry,\" she moans.<br>\r\nIn a quick flip, Liz is on top. Her lips never leave those gigntic tits. Almost on their own, her hips begin thrusting back and forth. Thes huge tits allow Liz to pound her mother while not forgoing the pleasure of their company.<br>\r\nHer mother grab her ass to increase her frantic pace.</span></div></div>",
            "created":1309496400,
            "id":1138492,
            "title":"Liz makes a change or two"
        },
        "11232112222112":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Liz's Dad",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then, right at that moment, someone interrupts Liz and her mom.  But who?</span></div></span></div>",
            "created":1404104400,
            "id":1820562,
            "title":"Someone Interrupts"
        },
        "11233":{
            "choices":[
                "Birthday (Physical age )",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else then?</span></div></span></div>",
            "created":1410670800,
            "id":1856663,
            "title":"Something else"
        },
        "112331":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "25 years old.",
                "5 years old",
                "0 years old (unborn)"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size5\" style=\"\">How old does she make him?<br>\r\n<br>\r\n1. 25: her brother is now much older than her.<br>\r\n<br>\r\n2. 5: her brother is now a lot younger than her.<br>\r\n<br>\r\n3. 0: her brother hasn't been born yet and is back inside their mother's womb.</font></span></div></div>",
            "created":1570655580,
            "id":2730590,
            "title":"Birthday (Physical age )"
        },
        "13":{
            "choices":[
                "Her mom",
                "Her dad",
                "Herself",
                "Her Sister",
                "Someone Else"
            ],
            "content":"<div class=\"\"><div> <span>Michelle was curious.  Did her mother really just call her Liz or was she just hearing things?<br>\r\n<br>\r\nMichelle went and got her driver's permit from her purse.  Sure enough her name now read Elizabeth Janice Richards.<br>\r\n<br>\r\nMichelle wondered if this device would work on other people as well, so she decides to try it on</span></div></div>",
            "created":1251090000,
            "id":749522,
            "title":"See if it really had changed her name"
        },
        "131":{
            "choices":[
                "Gender",
                "Physcial or Mental birthday",
                "Bra Size"
            ],
            "content":"<div class=\"\"><div> <span>Michelle wasn't sure how to point this device at her mom without her noticing, but she decided to just point it at her anyways.  As soon as she turned the device on, her mom froze up.  Michelle pointed the device at her mom and read her mom's personal information:<br>\r\n<br>\r\nName: Emily Amanda Richards<br>\r\nSex: F<br>\r\nHeight: 5' 2''<br>\r\nPhysical birthday: March 4, 1970<br>\r\nMental birthday: March 4, 1970<br>\r\nBra size: C<br>\r\nShoe size: 13<br>\r\n<br>\r\nMichelle decides to change her mom's...</span></div></div>",
            "created":1251090000,
            "id":749524,
            "title":"Her mom"
        },
        "1311":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Change Her Mom Back to Normal",
                "Change Something Else About Her \"Second\" Dad, Besides His Gender",
                "Do Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Michelle (or Liz, as everyone else knew her as, in the new reality) decided to change her mom's gender from female to male, just to see what would happen.<br>\r\n<br>\r\nOne moment, her mom was there, then the next, there was a man standing in her place, wearing men's clothing, and looking like her mother's brother, if she had <i>had</i> a brother.  Her original dad walked into the room and did something that startled Michelle.  He kissed the man who used to be her mom!<br>\r\n<br>\r\n\"Have a great day, honey,\" Michelle's new dad said, before her original dad left for work.  Michelle wasn't sure how she felt about this.  She wasn't against homosexuals or anything, but seeing two guys kissing, especially if one of them was her father ... it just felt a little unsettling.<br>\r\n<br>\r\nHer new dad sighed, after her original dad was gone.  \"I love that man,\" he said, before walking off to clean up the kitchen.<br>\r\n<br>\r\nLooking down at the device, she saw that her mom-turned-second-dad's stats were different, stating that <i>his</i> name was now Emmett Mandell Richards.  It seemed that the device automatically changed her name to a man's name when her gender was altered.<br>\r\n<br>\r\nShould Michelle change her mom back to normal, or do something else?</span></div></div>",
            "created":1400302800,
            "id":1797578,
            "title":"Her Mom Becomes a Gay Man"
        },
        "1312":{
            "choices":[
                "Physical Birthday",
                "Mental Birthday"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Michelle wasn't quite sure what the difference between physical or mental birthday was so she thought that would be a good place to start.<br>\r\n<br>\r\nShe decides to change her mom's</span></div></span></div>",
            "created":1251090000,
            "id":749526,
            "title":"Physcial or Mental birthday"
        },
        "13121":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "27 years old. (already given birth.)",
                "17 years old (pregnant?)",
                "7 years old (pregnant?)"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size5\" style=\"\">How old does she make her?<br>\r\n<br>\r\nWARNING: If the subject's body is physically incapable of giving birth at the set age minus the offspring's current set age, then the subject's offspring will be sent back to the subject's womb!<br>\r\n<br>\r\n1. 32: she gives her mother a bit of a more youthful look.<br>\r\n<br>\r\n2. 20: may make it so that Michelle and her siblings return to their mother's womb because their mother couldn't give birth when she was a child.<br>\r\n<br>\r\n3. 7: may make it so that Michelle and her siblings return to their mother's womb because their mother wasn't even born when she was supposed to give birth to her children.</font></span></div></div>",
            "created":1570661100,
            "id":2730621,
            "title":"Physical Birthday"
        },
        "13122":{
            "choices":[
                "Herself",
                "Sister"
            ],
            "content":"<div class=\"\"><div> <span>She decided to change her moms mental age from March 4, 1970 to March 4, 1984. She clicked this to happen and noticed her mom pick her cell up and ring her friends to organise a girly night out. This was proof as your mom never went out anymore. She decided to use it on someone else <br>\r\n</span></div></div>",
            "created":1269752400,
            "id":858327,
            "title":"Mental Birthday"
        },
        "1313":{
            "choices":[
                "Race...",
                "Mental/Physical Birthday ",
                "Unlocks new features"
            ],
            "content":"<div class=\"\"><div> <span>She thought that it would be funny to go downstairs and watch her mother undergo some changes. She laughed at this and decided that her mom might look good with a new pair of breasts. She typed in her mothers name and changed the bra size from C to EE. She watched as her mothers breasts were growing. However her mom didnt notice she just thought they'd been like that the whole time. Although the shirt was smaller than usual and her breasts were nearly exploding through. Michelle pointed the device at her mother again....</span></div></div>",
            "created":1264914000,
            "id":828512,
            "title":"Bra Size"
        },
        "13131":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Michelle realised she'd accidentally triggered the race change.",
                "Fingers still trembling she reset her bust to more modest dimensions."
            ],
            "content":"<div class=\"\"><div> <span>As Michelle pointed the device at her mother once more, she wondered how she'd look if she were Asian. She'd always found Japanese women to be polite and slender, and thought she'd look amusing with a significant bust.<br>\r\n<br>\r\nA cough stopped her, and as she pounded on her chest, she was forced to confront a consequence. Heredity was still in effect, as she was still her mother's child. She watched with horror and surprise as her own bust swelled forth, gaining both weight and prominence as it grew. Her arms flapped wildly, futilely as her bust grew and grew. Undaunted by her distress. Her good looks were undiminished, but she knew no man would look beyond her bust.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://weallhavefetisheslikeinflation.tumblr.com/image/140215590659\" target=\"_blank\">http://weallhavefetisheslikeinflation.tu...</a><br>\r\n<br>\r\nHer finger trembled as she retyped her own name, dreading the confirmation of her details. <br>\r\n<br>\r\nName: Michelle Janice Richards<br>\r\nHeight: 4' 10''<br>\r\nPhysical birthday: July 10, 1993<br>\r\nMental birthday: July 10, 1993<br>\r\nBra size: FF<br>\r\nShoe size: 16<br>\r\n<br>\r\nShe was even bustier than her mother, and being even shorter, it made her look even more top heavy. A new family curse.</span></div></div>",
            "created":1482901200,
            "id":2255782,
            "title":"Race..."
        },
        "131311":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "A knock at the door snatches her attention from herself.",
                "Looking out the window, she realises the city has changed, too.",
                "The writing on the device seemed to shift and become incomprehensible."
            ],
            "content":"<div class=\"\"><div> <span>As the changes continued, Michelle saw her skin darken. Not merely taking on a healthy tan, but changing tone, too. It became more olive, smooth and perfect. From the corner of her eye, she also spotted her hair darkening.<br>\r\n<br>\r\nIt was turning pure black. Michelle recognised this as herself turning Asian, Japanese if she had to guess.<br>\r\n<br>\r\nBut one part of her wasn't. Her bust was far beyond what you'd see in the West let alone with a petite Japanese girl. But that was nothing compared to how her rump had expanded. Her ass was full, round and impossibly pert. It just didn't fit her. Hell, it'd probably suit a horse, she thought. She almost doubted it was real.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://78.media.tumblr.com/16b7a6a0a589dae6387cc612f6b0f997/tumblr_op6mdlNEfQ1w2lwkto3_r1_1280.jpg\" target=\"_blank\">https://78.media.tumblr.com/16b7a6a0a589...</a><br>\r\n<br>\r\nShe was tempted to confirm it was real with a playful slap. But the thought of it rippling... would it ever end?<br>\r\n<br>\r\nIt felt as real, as fleshy as her bust. This was truly her body. A shudder raced down her spine, goosebumps visible all over her body. Her eyes noticing them in the depths of her cleavage.</span></div></div>",
            "created":1515319320,
            "id":2437817,
            "title":"She'd accidentally triggered a race change, too."
        },
        "13133":{
            "choices":[
                "She uses the new ability on her mother",
                "more"
            ],
            "content":"<div class=\"\"><div> <span>She points the device at her mother again and hears a ding sound coming from the device. She looks at it now and appeared on the screen is:<br>\r\n<br>\r\nName<br>\r\nHeight <br>\r\nPhysical Birthday<br>\r\nMental Birthday<br>\r\nBra Size (women only)<br>\r\nShow Size<br>\r\nCurrent Personality eg. Bitchiness, really nice etc</span></div></div>",
            "created":1264914000,
            "id":828513,
            "title":"Unlocks new features"
        },
        "131331":{
            "author_id":"tmansl997",
            "author_name":"tmansl997",
            "choices":[
                "Mother daughter sex?",
                "More changing!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She smiled and changed her mother's current personality to \"horny\". Her mom stopped what she was doing and began rubbing her chest and crotch longingly. Liz felt a little horny just watching her.</span></div></span></div>",
            "created":1282021200,
            "id":937553,
            "title":"Now it's \"personal(ity)\""
        },
        "1313311":{
            "author_id":"username32",
            "author_name":"Serene",
            "choices":[
                "To have sex with her mother",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Liz had never thought of herself as a lesbian but seeing her mother rubbing herself was starting to turn her on. She reached up to her own B cups and decided…</span></div></span></div>",
            "created":1332219600,
            "id":1299022,
            "title":"Mother daughter sex?"
        },
        "13133112":{
            "author_id":"username32",
            "author_name":"Serene",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She could use the device to make her mother instantly orgasm...?</span></div></span></div>",
            "created":1332219600,
            "id":1299024,
            "title":"Another way"
        },
        "132":{
            "author_id":"tmansl997",
            "author_name":"tmansl997",
            "choices":[
                "Height",
                "Physical birthday",
                "Gender"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How should daddy be changed?</span></div></span></div>",
            "created":1287205200,
            "id":975993,
            "title":"Her dad"
        },
        "1323":{
            "author_id":"tmansl997",
            "author_name":"tmansl997",
            "choices":[
                "Use it on herself",
                "Use on sister",
                "Mess with it a bit and see what happens"
            ],
            "content":"<div class=\"\"><div> <span>Liz pointed the editor at her dad and swapped his gender from male to female. She also adjusted Bra size to DD cup. In hardly any time at all, she had a second mom. Her original mom walked in and said \"Have a good day at work, sweety!\" They then kissed each other lovingly and 'mom' left for work. Liz held back a laugh as she watched this. \"Sigh... I love that woman.\" her mom said before walking off to clean up the kitchen. What should Liz do now?</span></div></div>",
            "created":1287205200,
            "id":975998,
            "title":"Mom's a lesbian!"
        },
        "133":{
            "author_id":"totalotaku",
            "author_name":"Rolf Halfhearted",
            "choices":[
                "Her mental/physical age",
                "Her bra size",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What should she change?</span></div></span></div>",
            "created":1315630800,
            "id":1184942,
            "title":"Herself"
        },
        "1331":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "Mental",
                "Physical"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size5\" style=\"\">Mental or Physical age?</font></span></div></span></div>",
            "created":1570656060,
            "id":2730596,
            "title":"Her mental/physical age"
        },
        "13312":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "Older",
                "Younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size5\" style=\"\">Older or younger?</font></span></div></span></div>",
            "created":1570656240,
            "id":2730599,
            "title":"Physical"
        },
        "133122":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "10 years old.",
                "1 year old.",
                "0 years old (unborn)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size5\" style=\"\">How Young?<br>\r\n<br>\r\n1. 10 years old.<br>\r\n<br>\r\n2. 1 year old.<br>\r\n<br>\r\n3. 0 years old: she is an unborn baby back inside her mother's womb.</font></span></div></span></div>",
            "created":1570656420,
            "id":2730600,
            "title":"Younger"
        },
        "1331222":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "Yes (baby treatment)",
                "No (normal treatment)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size5\" style=\"\">Does everyone think she's a 1-year-old e.g. her mother still breastfeeds her?</font></span></div></span></div>",
            "created":1570661520,
            "id":2730623,
            "title":"1 year old."
        },
        "1332":{
            "author_id":"totalotaku",
            "author_name":"Rolf Halfhearted",
            "choices":[
                "No, she's had enough.",
                "Yes, just a little.",
                "Yes, quite a bit."
            ],
            "content":"<div class=\"\"><div> <span>Okay... well, Michelle (or rather Liz - despite expectations, she was having trouble getting used to her name change) had always wanted to be taller, with bigger breasts... but bigger breasts would do for now. She pointed the gun at herself, pulled the trigger, and changed her bra size from \"B\" to \"DD.\"<br>\r\n<br>\r\nInstantly, her boobs plumped out. It felt... weird, really, having weight on her chest. She could already tell there were going to be some balance issues. She had always been good at PE, and her track team membership was proof of that, but... maybe breasts this big weren't a good thing. She changed it back down to \"C.\"<br>\r\n<br>\r\nSo, did... did she still want to try being taller?</span></div></div>",
            "created":1315630800,
            "id":1184948,
            "title":"Her bra size"
        },
        "1333":{
            "author_id":"gen.brimstone",
            "author_name":"Blaze Sulfer",
            "choices":[
                "her height",
                "her shoe size",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Height or shoe size?</span></div></span></div>",
            "created":1410670800,
            "id":1856916,
            "title":"Something else"
        },
        "13332":{
            "author_id":"d-man72",
            "author_name":"D-man72",
            "choices":[
                "Change herself more",
                "Change someone else"
            ],
            "content":"<div class=\"\"><div> <span>Liz looked down at her small feet. At a children's size 16, she has the smallest feet in the family. Even her younger sister, who was 2 inches shorter, was wearing a size 6.5 in women's! She decided, she wanted bigger feet. She erased her previous shoe size and began typing in. She wanted big feet, and she meant BIG! Finally deciding on a size, she entered her new size.<br>\r\n<br>\r\nShoe size: 15.5 women's. She made sure to type in womens, she didn't want smaller feet. She felt a pleasurable sensation in her feet. She smiled as she saw them stretching longer, becoming bigger. Her toes touched the floor and continues to elongate. Finally, her feet stopped at 12 inches long. She was happy with the results. She turned back to the screen, seeing what else she could change.</span></div></div>",
            "created":1499317200,
            "id":2348545,
            "title":"her shoe size"
        },
        "134":{
            "choices":[
                "Stacy. She always wanted bigger breasts.",
                "Gwen, the head cheerleader. She would be funny with the mind of a toddler.",
                "Mark, the local bully. He wouldn't be so scary if he was short."
            ],
            "content":"<div class=\"\"><div> <span>Heading downstairs, she pointed it at her sister. It read:<br>\r\n<br>\r\nName: Rachael Kay Richards<br>\r\nHeight: 4' 2''<br>\r\nPhysical Birthday: September 2, 1995<br>\r\nMental Birthday: September 2, 1997<br>\r\nBra Size: A<br>\r\nShoe Size: 14<br>\r\n<br>\r\nThat threw her for a loop. Apparently, her sister was mentally younger than she was physically. That exposed a whole range of questions she didn't want to deal with. Without a second thought, she changed the Mental Birthday entry to match the Physical Birthday one.<br>\r\n<br>\r\nFor the rest of the morning, Michelle watched her sister to see what differences were there. Was that bit of politeness always there, or was that her acting more mature? Was the fact that she spent more time getting ready today because she was more mature about the way she looked, or was it all just imagined? Michelle never did figure it out, because it was soon time for school.<br>\r\n<br>\r\nAs she got on the bus and sat down, Michelle wondered exactly where the device had come from. Was it a gift from some higher spirit? Was she the benefactor of some strange mad scientist?<br>\r\n<br>\r\n\"Liz?\"<br>\r\n<br>\r\nWere there aliens out there that decided to give her the device? And if so, why her?<br>\r\n<br>\r\n\"Liz? Liz, you listening?\"<br>\r\n<br>\r\nOr was this something more sinister? Did some sort of Terminator-esque robot come back in time to give it to her in a plot to have her change history? (Never let it be said that Michelle didn't have a good imagination.)<br>\r\n<br>\r\n\"Hey, Liz! Are you in there?\" Michelle was prodded out of her thoughts by her best friend, poking her in the side of the head. Still on her 'how did I get the device' train of thought, she could say only one thing.<br>\r\n<br>\r\n\"Wha...?\"<br>\r\n<br>\r\nHer best friend shook her head. \"Come on, Liz. Snap out of it. I've been calling you for the past two minutes.\"<br>\r\n<br>\r\nMichelle sighed. \"I'm sorry, Stacy. I've just had some strange things happen to me today.\"<br>\r\n<br>\r\n\"Do these 'strange things' have anything to do with that PDA you have in your hand?\" asked Stacy.<br>\r\n<br>\r\nMichelle looked down. She was still holding the device. Apparently in her rush to get out the door, she had neglected to put it down. She looked around carefully. No one seemed to be listening. \"Actually,\" she started, \"they kinda do. It was hidden among my birthday gifts this morning, and it is... well, itseemstobeamagicpersonchangingdevice.\"<br>\r\n<br>\r\nStacy blinked. \"Um... could you please repeat that last part? I didn't quite catch that last part.\"<br>\r\n<br>\r\n\"It... seems to be a magic person-changing device.\"<br>\r\n<br>\r\n\"Yeah, Liz,\" said Stacy incredulously, \"why don't you pull the other one?\"<br>\r\n<br>\r\nMichelle shook her head. \"Stacy, I'm telling the truth. Look, I'll show you!\"<br>\r\n<br>\r\nMichelle looked around at who was sitting close. She needed to change someone who wouldn't be noticed. She finally settled on...</span></div></div>",
            "created":1252558800,
            "id":758664,
            "title":"Her Sister"
        },
        "1341":{
            "choices":[
                "Liz changes herself",
                "Stacy wants more changes",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Here, I'll prove it.\" And Liz changed Stacy's bra size to C and hit apply. A few seconds after, Stacy grabbed her chest as her breasts started to grow. The entire time, both girls were almost screaming, Stacy in delight and Liz in partial horror and surprise. Ten second laster Stacy had a bra size C and the bra she was wearing had broken. He shirt was tight and you could faintly see he nipples, which were erect. She was clearly enjoying this.<br>\r\n<br>\r\n\"Oh my god! I have boobs!\" Stacy said, in a voice that everyone in the room could hear.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1252904400,
            "id":760679,
            "title":"Stacy. She always wanted bigger breasts."
        },
        "13411":{
            "author_id":"pinkbirdo",
            "author_name":"Gatonom",
            "choices":[
                "Physically",
                "Mental"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she change herself?</span></div></span></div>",
            "created":1323493200,
            "id":1237767,
            "title":"Liz changes herself"
        },
        "134111":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Fighting her fading intellect, she dove for the computer.",
                "Stacy cackled with amusement, snatching the computer up and away.",
                "A ricochet means Stacy starts to expand too."
            ],
            "content":"<div class=\"\"><div> <span>Liz decided as the older sister, she should also be the <i>bigger </i>sister. Unfortunately, she stabbed the enter button after setting her new bust, without checking what she'd typed.<br>\r\n<br>\r\nHer gargantuan, <b>HH</b>-cup, that she'd planned to use to teach Stacy a lesson had actually been typed as <b>YY</b>.<br>\r\n<br>\r\nThankfully her back strengthened to accommodate her new bust. But it still toppled her to land on the nearby chair. Her bust bouncing painfully, as it settled in her lap.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://78.media.tumblr.com/bf580d69a38b88c05f0bd5eaa3af3433/tumblr_olodnoXOmc1w2lwkto3_r1_1280.jpg\" target=\"_blank\">https://78.media.tumblr.com/bf580d69a38b...</a><br>\r\n<br>\r\nEven her T-shirt strained to contain her bust. Her excited nips pushing against the stretched fabric. Liz felt the flood of hormones flush through her body, as it too rose to adjust to altered physique. Stacy looked on in fascinated horror and confusion, not knowing that Liz had made a mistake.<br>\r\n<br>\r\nLiz's breath came in animalistic rasping breaths, as she fought to control her instincts. Arousal mounting with every heaving gasp. Her lungs filling with her own scent, her own pheromones driving that higher, her blood overwhelmed with her lust too.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1514869200,
            "id":2435950,
            "title":"Liz physically changes herself."
        },
        "1341113":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "The sisters fight for control of the editor.",
                "Sparks fly, as the editor surrenders to overheating.",
                "Liz discovers she's now illiterate, even more of a lusty, busty bimbo."
            ],
            "content":"<div class=\"\"><div> <span>Stacy's amusement at her sister's transformation was loud and long. Pointing at her sister, stuck in the chair, the sheer weight of her bust enough to pin her down. Her long outstretched hand, leading to a stabbing forefinger, that sank deep into Liz's abundant, lavish titties.<br>\r\n<br>\r\nBut she resisted the temptation to tweak and tease those immense nipples, a reduced state of restraint coming into effect. Liz gasped at each poke from her sister's fingers. Her attempts to cradle her bust, to protect it. Her attempts to shepherd it so she could stand up without jiggling wildly were useless.<br>\r\n<br>\r\nHowever, Stacy's pleasure evaporated as she felt a warmth in her bust. In moments, she too was growing, each breath sending pulse after pulse of arousal down her spine. Her modest, but proud <b>C</b>-cups, racing past <i>E</i>-cup, and further up the alphabet with each passing second.<br>\r\n<br>\r\nGlaring at the computer, she tried to see how it had betrayed her to this fate. But, it was simple genetics, as she and her sister shared DNA, she was doomed, destined to share the same busty body-type.<br>\r\n<br>\r\nTerrified of making things worse, she refused to change the controls. Pacing back and forth, even as she felt her blue top struggle to hold her bust, as her nipples swelled until they dwarfed her sisters. Poking further out, her hands barely able to reach them. They were too wide, too round, too fat for her to hide in her fists. The attempt to hide them simply making her weak-kneed. Instead she opened her hands offering them like inadequate shelves for her magnificent bust.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://78.media.tumblr.com/62a0cc2dc58d3af4b7d2050acac7f616/tumblr_olodnoXOmc1w2lwkto4_r1_1280.jpg\" target=\"_blank\">https://78.media.tumblr.com/62a0cc2dc58d...</a><br>\r\n<br>\r\nIt was Liz's turn to laugh, her laughter quickly rising in tone, to an ear-piercingly shrill giggle. As Stacy looked wide-eyed and innocent, the image of a bimbo personified.<br>\r\n<br>\r\n\"Stop it... stop it...\" Stacy squealed. Her own voice girly and equally high.<br>\r\n<br>\r\n\"P<b><i>w</i></b>ease....\" Her pleading stopping, as she heard the lisping tone undercutting further her threats, her authority. Her lips now lush and full, distorting her speech.<br>\r\n<br>\r\n\"<b><i>W</i></b>isping Stacy...\" Liz's sing-song mocking, ending just as quickly on hearing her own lisp.</span></div></div>",
            "created":1514934060,
            "id":2435954,
            "title":"A ricochet means Stacy starts to expand too."
        },
        "13412":{
            "choices":[
                "Liz takes the device back",
                "They use it on someone"
            ],
            "content":"<div class=\"\"><div> <span>\"What else can that thing do?\" Stacy asked<br>\r\n\"From what I can tell, name, height, physical birthday, mental birthday, shoe size, and, obviously, bra size.\"<br>\r\n\"I wonder...\" Stacy snatched the device out of Liz's hands and started editing something.<br>\r\n\"What are you doing?\"<br>\r\n\"You'll see.\" <br>\r\n\"Seriously, Stacy, what are you doing?\"<br>\r\n\"Just wait, I'm almost done.\" She hit apply.<br>\r\n\"So, what did you change?\"<br>\r\n\"Have you not been listening, you have to wait.\" <br>\r\n<br>\r\nJust as Stacy finished talking the change started. The first thing Liz noticed was her boobs got bigger still. Then she noticed her getting  little taller.<br>\r\n\"Now will you tell me what you did?\"<br>\r\n\"Fine, I made my boobs bigger, I'm three inches taller, and I am now older.\"</span></div></div>",
            "created":1258606800,
            "id":794059,
            "title":"Stacy wants more changes"
        },
        "1342":{
            "author_id":"kaitar0",
            "author_name":"kaitar0",
            "choices":[
                "\"You did that to Gwen?\"",
                "\"Come on, Gwen ALWAYS does things like that.\""
            ],
            "content":"<div class=\"\"><div> <span>Michelle decided that adjusting the mental age of the head cheerleader Gwen should work.  Pointing the device at her the info comes up<br>\r\n<br>\r\nName: Gwen Moumont<br>\r\nHeight: 5' 6\"<br>\r\nPhysical birthday: November 1, 1992<br>\r\nMental birthday: November 1, 1992<br>\r\nBra size (women only): D<br>\r\nShoe size: 9<br>\r\n<br>\r\nA little editing and you finish with:<br>\r\n<br>\r\nName: Gwen Moumont<br>\r\nHeight: 5' 6\"<br>\r\nPhysical birthday: November 1, 1992<br>\r\nMental birthday: November 1, 2004<br>\r\nBra size (women only): D<br>\r\nShoe size: 9<br>\r\n<br>\r\nYou can't help but laugh as the beautiful Gwen goes from maturely swinging her hips to gleefully skipping along.  She was still graceful and drawing all the boys attention, just now it was because she was a bit (well, alot) child-like and manic.  You snort back a laugh as she does an cartwheel in the middle of the mall's hallway... in a miniskirt... with a thong on underneath.<br>\r\n<br>\r\nYou turn back towards Stacy and ask her, \"Do you believe me now?\"</span></div></div>",
            "created":1309842000,
            "id":1141140,
            "title":"Gwen, the head cheerleader. She would be funny ..."
        },
        "13422":{
            "author_id":"kaitar0",
            "author_name":"kaitar0",
            "choices":[
                "Target Gwen again.",
                "Someone else."
            ],
            "content":"<div class=\"\"><div> <span>\"Come on, Gwen ALWAYS does things like that,\" Stacy says incredulously, \"She's got a sexy body and she's really agile and perky, but she is immature!\"  Appearantly, you can't just show her without letting her use it.  You decide against that for now and just play with your new toy.  It might be a private show but Stacy is here for the New Reality commentary.  So far that has been ironic as hell, Gwen called Stacy an immature brat just yesterday.<br>\r\n<br>\r\n\"Maybe I was just imagining things,\" you say with a lie, \"You go on ahead I got to go to the bathroom.\"<br>\r\n<br>\r\n\"Oh, ok,\" Stacy says, \"I'll make sure to get us a nice table!\"  With that Stacy walks off with a wave towards the food court.<br>\r\n<br>\r\nMeanwhile, you sneak off towards the bathrooms pondering interesting targets.  There's Gwen and the couple of cheerleaders with her, though the cheerleaders are all blushing with embarassment from Gwen's cartwheel just now.  You also see a pair of sister's out shopping, one looks to be around 16 or 17 while her little sister is perhaps 12, and then there's the staff innocently getting ready for the morning rush.</span></div></div>",
            "created":1311138000,
            "id":1150794,
            "title":"\"Come on, Gwen ALWAYS does things like that..."
        },
        "134221":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Make Gwen very tall, it'd be funny with her mental state. ",
                "Change something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to...</span></div></span></div>",
            "created":1355115600,
            "id":1485381,
            "title":"Target Gwen again."
        },
        "1342211":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Extremely tall (seven to nine feet tall)",
                "Ridiculously tall (anything above nine feet)"
            ],
            "content":"<div class=\"\"><div> <span>You go into the toilets and enter a cubicle, not wanting to be disturbed. You check Gwen's info again:<br>\r\n<br>\r\nName: Gwen Moumont<br>\r\nHeight: 5\"6'<br>\r\nPhysical Birthday: November 1, 1992<br>\r\nMental Birthday: November 1, 2004<br>\r\nBra Size (Women Only): D<br>\r\nShoe Size: 9<br>\r\n<br>\r\nYou'd already reduced her mind to that of a child, but you could still change some other things about her. You could change her name, but that would be a bit boring. Making her feet larger or smaller could make it impractical for her to walk if taken too far, and you didn't want that to happen. <br>\r\n<br>\r\nMaking up your mind, you select her height and begin to make the immature cheerleader taller and taller...<br>\r\n<br>\r\nThe question is, just how tall do you make her?</span></div></div>",
            "created":1374210000,
            "id":1630590,
            "title":"Gwen Growing Up"
        },
        "13422112":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Ten feet tall",
                "Bigger!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You begin o increase Gwen's height to ridiculous extremes, lowering her mental age a touch and increasing the size of her breasts as you do so. How big does Geen end up at?</span></div></span></div>",
            "created":1376370000,
            "id":1645308,
            "title":"Ridiculously tall (anything above nine feet)"
        },
        "135":{
            "author_id":"lloydie16",
            "author_name":"Chrissy",
            "choices":[
                "Her Brother",
                "Her Couison",
                "some one else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok Maybe you could choose out of</span></div></span></div>",
            "created":1252990800,
            "id":761046,
            "title":"Someone Else"
        },
        "1351":{
            "author_id":"lloydie16",
            "author_name":"Chrissy",
            "choices":[
                "edit him",
                "tell him about the power",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>She wonders around for a bit then she sees her brother Chris.<br>\r\n<br>\r\nWhos Personal info is<br>\r\n<br>\r\nName: Chris<br>\r\nHeight: 6'4<br>\r\nPhysical Brithday: 16/11/1992<br>\r\nMental Birthday: 16/11/1992<br>\r\nBra Size: N/A<br>\r\nShoe size: 13<br>\r\n<br>\r\nNow she seen him she desides to</span></div></div>",
            "created":1252990800,
            "id":761050,
            "title":"Her Brother"
        },
        "13511":{
            "author_id":"lloydie16",
            "author_name":"Chrissy",
            "choices":[
                "Name",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok What do She Edit</span></div></span></div>",
            "created":1252990800,
            "id":761064,
            "title":"edit him"
        },
        "135111":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "Nothing seems to happen",
                "Her brother changes into a female version of himself"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She wonders what happens if she changes her brother's name to a girl's name? She just has to find out, so she changes his name to Melinda Joyce. As she watches...</span></div></span></div>",
            "created":1289883600,
            "id":994778,
            "title":"Name"
        },
        "1351111":{
            "author_id":"astrolight",
            "author_name":"Froslad",
            "choices":[
                "Michelle messed with Chris more.",
                "somethingelse"
            ],
            "content":"<div class=\"\"><div> <span>Michelle watched as for several minutes as............nothing happens.<br>\r\nSHe looks at his info in the device again:<br>\r\nName: Melinda<br>\r\nHeight: 6'4<br>\r\nPhysical Brithday: 16/11/1992<br>\r\nMental Birthday: 16/11/1992<br>\r\nBra Size: N/A<br>\r\nShoe size: 13<br>\r\n\"So it did work,\" She said to her self.<br>\r\n\"What worked, Liz,\" her brother asked her, without caring.<br>\r\n\"Oh, nothing, Mel,\" Michelle lied.<br>\r\n\"Whatever,\" Chris said not caring.<br>\r\n\"Melinda, I need to talk to you!\" Their mother called.<br>\r\nChris groaned, as he got up, and walked of.<br>\r\n</span></div></div>",
            "created":1367989200,
            "id":1586523,
            "title":"Nothing seems to happen"
        },
        "13511111":{
            "author_id":"numbuh7",
            "author_name":"JamieBlonde",
            "choices":[
                "The changes are instant",
                "Someone gets in the way of the beam"
            ],
            "content":"<div class=\"\"><div> <span>Michelle figures, if Chris is going to be called Melinda from now on, he (or she?) should have the body to go with it. You set her Bra Size to a C cup and her Shoe size to an 8, and then went to go find her to apply the changes. <br>\r\n<br>\r\nName: Melinda Richards<br>\r\nHeight: 6'4<br>\r\nPhysical Birthday: 16/11/1992<br>\r\nMental Birthday: 16/11/1992<br>\r\nBra Size: C<br>\r\nShoe size: 8<br>\r\n<br>\r\n<br>\r\nYou aimed the device at Melinda...</span></div></div>",
            "created":1446958800,
            "id":2058529,
            "title":"Michelle messed with Chris more."
        },
        "1351112":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "She leaves her new sister as she is",
                "She changes Melinda's age"
            ],
            "content":"<div class=\"\"><div> <span>As she watches, her brother begins to shrink and get thinner. Well, thinner in some places! As he shrank, his hair was growing out, breasts were pushing out on his chest, his waist narrowed while his hips widened. His clothing changed too. Soon, in place of her brother was a sister wearing a pink top, a jean skirt and looking very feminine indeed! She also did not seem to notice that she had changed at all.<br>\r\n<br>\r\nMichelle walked in, \"Hi Mandy! what's up? Anything new?\" She was shocked when her 'once brother' actually giggled!<br>\r\n<br>\r\n\"Hi Liz! Oh yes! You know that cute guy I like? Mike. Well, I think he was trying to ask me out today in class, but he is just so shy! Do you think I should just do it for him?\"<br>\r\n<br>\r\nShe laughs, \"Why not? You can do it sis!\" Michelle realized that the device must change reality. Just like her name was now Liz to everyone, Chris was now Melinda, and even she did not know she had been changed. She checked her new sister's stats:<br>\r\n<br>\r\nName: Melinda Joyce<br>\r\nHeight: 5'<br>\r\nPhysical Brithday: 16/11/1992<br>\r\nMental Birthday: 16/11/1992<br>\r\nBra Size: B<br>\r\nShoe size: 8</span></div></div>",
            "created":1289883600,
            "id":994781,
            "title":"Her brother changes into a female version of hi..."
        },
        "13511122":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "She makes Melinda older",
                "She makes Melinda younger"
            ],
            "content":"<div class=\"\"><div> <span>Michelle decides she likes the idea of having a sister instead of a brother. No more problems with her brother leaving the toilet seat up! But she also did not like that her new sister was close enough in age to her to be direct competition for boys. Of course, that was easy to change! She edited Melinda's information to make her...</span></div></div>",
            "created":1289883600,
            "id":994831,
            "title":"She changes Melinda's age"
        },
        "135111222":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "She takes Melinda out for ice cream",
                "She decides to try things out on some others"
            ],
            "content":"<div class=\"\"><div> <span>She always wished that she had a little sister to look up to her, so she edited Melinda's information some more:<br>\r\n<br>\r\nName: Melinda Joyce<br>\r\nHeight: 3' 1\"<br>\r\nPhysical Brithday: 16/11/2005<br>\r\nMental Birthday: 16/11/2005<br>\r\nBra Size: 0<br>\r\nShoe size: girls 3<br>\r\n<br>\r\nMichelle watched her shrink even more. Soon she was a tiny, five-year-old girl who was watching kid shows. She looked adorable in her little pink sundress with her long, straight hair! Melinda did not even notice anything had changed! This was going to be great!</span></div></div>",
            "created":1289883600,
            "id":994838,
            "title":"She makes Melinda younger"
        },
        "1351112221":{
            "choices":[
                "It looks like your maternal instincts are kicking in?",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>She always wished that she had a little sister to look up to her, so she edited Melinda's information some more<br>\r\n<br>\r\nLiz decided she wanted a baby sister she she changed her again too.<br>\r\n<br>\r\nBut though she wanted a little revenge so she decided to give her sister her mind back but regress her body to that of a baby that is a few days old.<br>\r\n<br>\r\nName: Melinda Joyce<br>\r\nHeight: 18 in. (45.7 cm)<br>\r\nPhysical Brithday: 16/11/2010 <br>\r\nMental Birthday: 16/11/1992<br>\r\nBra Size: 0<br>\r\nShoe size: girls: New Born <br>\r\n<br>\r\nLiz then picked her up and smiled at her, bless you look so cute sis.<br>\r\n<br>\r\nShe started crying someone come up and said she sounds hungry, you know there is a sheltered area over there where you can feed her with out teenage boys starring at you.<br>\r\n<br>\r\nIt took liz a few seconds to realise the person thought she was breast feeding.<br>\r\n<br>\r\nLiz looked at the women and said no she's my sister not my daughter.<br>\r\n<br>\r\nSorry but you know?</span></div></div>",
            "created":1446958800,
            "id":2058278,
            "title":"She takes Melinda out for ice cream"
        },
        "1351112222":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "More revenge",
                "She decides to help some people instead"
            ],
            "content":"<div class=\"\"><div> <span>Michelle goes outside and takes a walk, wondering how she might use this. As she was walking, she bumps into a senior girl at her school. It is Stephanie, one of the snootiest girls in the school. She is also one one the prettiest, which adds to her bad manors. She is tall and build to attract boys. She sneers at Michelle, \"Watch where you are going to low-class slut!\"<br>\r\n<br>\r\nMichelle steps out of her way, and as she watches her go, she decides that Stephanie needs a lesson. She points the editor at her:<br>\r\nName: Stephanie Hinshaw<br>\r\nHeight: 5' 8\"<br>\r\nHair: Blonde<br>\r\nPhysical Brithday: 5/9/1993<br>\r\nMental Birthday: 15/9/1993<br>\r\nBra Size: 36D<br>\r\nShoe size: 6<br>\r\n<br>\r\nShe smiles and makes some changes:<br>\r\n<br>\r\nName: Stephanie Hinshaw<br>\r\nHeight: 5' 8\"<br>\r\nHair: Dirty Blonde<br>\r\nPhysical Brithday: 5/9/1993<br>\r\nMental Birthday: 15/9/1997<br>\r\nBra Size: 32A<br>\r\nShoe size: 6<br>\r\nComments: Straight hair. No fashion sense. Poor family. Lives in trailer park. Four weeks pregnant by her boyfriend, Mike Roberts.<br>\r\n<br>\r\nAs soon as she hit enter, Michelle marveled at the way Stephanie shrank! Soon, she was a shabbily dressed smaller girl with awful hair! Michelle laughed, she would not be so arrogant anymore! And Mike was known for his poor treatment of girls. If she was smart, she would never marry him, but with the younger mental age, she just might do it.</span></div></div>",
            "created":1310360400,
            "id":1145630,
            "title":"She decides to try things out on some others"
        },
        "135112":{
            "author_id":"lloydie16",
            "author_name":"Chrissy",
            "choices":[
                "Height",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok What About</span></div></span></div>",
            "created":1252990800,
            "id":761065,
            "title":"Something Else"
        },
        "1351121":{
            "author_id":"0000w",
            "author_name":"0000w",
            "choices":[
                "Her brother noticed the change when he put the magazine down",
                "She didn't notice the change to the house"
            ],
            "content":"<div class=\"\"><div> <span>Liz wanted to test the device more, but not on herself. She came into the hallway before the living room and saw her older brother siting on the couch. He was wearing a white v-neck and a black jacket and jeans. He was reading a magazine. Liz pointed the device at him and showed his stats. She first changed his height. She made him from 6'4 to 7'4. She saw him slowly grow to his new height and then he shifted his position on the couch. Liz was baffled. She then changed him a few more times. His heights increased to 8'4, and his muscles grew to that of a bodybuilder. Afterwards, Liz approached her brother.</span></div></div>",
            "created":1477803600,
            "id":2230338,
            "title":"Height"
        },
        "1351122":{
            "author_id":"lloydie16",
            "author_name":"Chrissy",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok she changes his Birthday</span></div></span></div>",
            "created":1252990800,
            "id":761066,
            "title":"Something Else"
        },
        "13511221":{
            "author_id":"lloydie16",
            "author_name":"Chrissy",
            "choices":[
                "Metal",
                "Physical"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Birthday does she change.</span></div></span></div>",
            "created":1252990800,
            "id":761067,
            "title":"Yes"
        },
        "135112211":{
            "author_id":"technogravity",
            "author_name":"Technogravity",
            "choices":[
                "Older",
                "Younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Older or younger</span></div></span></div>",
            "created":1532387220,
            "id":2523846,
            "title":"Metal"
        },
        "135112212":{
            "author_id":"technogravity",
            "author_name":"Technogravity",
            "choices":[
                "Older",
                "Younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Older or younger</span></div></span></div>",
            "created":1532387280,
            "id":2523847,
            "title":"Physical"
        },
        "1351122122":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "5 years old.",
                "1 year old.",
                "0 years old (unborn)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size5\" style=\"\">How young does she make him?<br>\r\n<br>\r\n1. 5: turn him into a child.<br>\r\n<br>\r\n2. 1: turn him into a baby.<br>\r\n<br>\r\n3. 0: turn him into an unborn baby inside their mother's womb.</font></span></div></span></div>",
            "created":1570656000,
            "id":2730595,
            "title":"Younger"
        },
        "13511222":{
            "author_id":"lloydie16",
            "author_name":"Chrissy",
            "choices":[
                "Bra size",
                "Or Shoe Size"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok now you have two more options. So what does she change his</span></div></span></div>",
            "created":1252990800,
            "id":761070,
            "title":"No"
        },
        "135112221":{
            "choices":[
                "C cups",
                "another choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you decided his bra size.<br>\r\nYour brother didn't wear bra and he is always looking girl boobs, you will do him a favor.<br>\r\nSo, you decide</span></div></span></div>",
            "created":1285995600,
            "id":967360,
            "title":"Bra size"
        },
        "1351122212":{
            "author_id":"connorbey3",
            "author_name":"blaze master",
            "choices":[
                "yes",
                "bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>FF cup maybe?</span></div></span></div>",
            "created":1296363600,
            "id":1044843,
            "title":"another choice"
        },
        "13511222121":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "\"No, sweetie. You're a woman now.\" her mother assured her trying to calm her.",
                "Christine's father hid behind the newspaper, faking invisibility.",
                "The family retriever bounced around her feet, eager to please."
            ],
            "content":"<div class=\"\"><div> <span>Michelle decided the quickest cure for Chris's obsession was a short, sharp, shock. Rather than ease Christine into the distaff side. Perhaps to find the joy that a proud, pert bust could provide. She carefully selected the options. While she and Chris would be aware of the changes, Christine would simply be her sister, as far as the rest of the family, the rest of college, hell the rest of the world were concerned.<br>\r\n<br>\r\nIt grated that she had to make Christine the elder sister. Though, and a smile spread across her face, she'd certainly be the bigger sister, she thought.<br>\r\n<br>\r\nName: Christine<br>\r\nHeight: 5' 0\"<br>\r\nPhysical Birthday: 17th June 1990<br>\r\nMental Birthday: 17th June 1990<br>\r\nBra Size: Custom<br>\r\nShoe Size: 8 (Permanent 3\" arch)<br>\r\n<br>\r\nShe imagined her new sister tottering about her tiny, cute feet. Her little toes aching from walking.<br>\r\n<br>\r\nA preview image popped up in a window, and Michelle had to contain her glee. Smothering the giggle that was rising towards hysteria. She managed to tap the button, and initiate the change.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://68.media.tumblr.com/7b7ebaedb3fc7ac648e08f5c969cb6e9/tumblr_ojow21gx2j1w2lwkto3_r1_1280.jpg\" target=\"_blank\">https://68.media.tumblr.com/7b7ebaedb3fc...</a><br>\r\n<br>\r\nA high, piercing, very girly shriek split the air almost immediately, followed by the crash of a door. Michelle raced to her own door, just in time to see Chrissie, race past. Her shirt taking a moment longer to become a blouse. She almost fell half way down the stairs as her bust threw her off balance.<br>\r\n<br>\r\nHer breathing heaving, her chest copied that, and she sobbed incoherently in front of her mother. Her hands trying to push her sumptuous breasts back, to restore a masculine chest. Moments later, terrified of touching her full titties, and those scarily big nips, as if touching them was contagious or would confirm their reality.<br>\r\n<br>\r\n\"I'm not a girl...\" she sobbed. Her long black hair brushing back and forth over her shoulders as she shook her head.</span></div></div>",
            "created":1490677200,
            "id":2295932,
            "title":"Chris to Christine, a surprise introduction."
        },
        "13511222122":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Michelle calls to her sister through the wall.",
                "Chrissi's hormones overpower her rational mind, as she explores her body.",
                "Michelle moves onto her next target."
            ],
            "content":"<div class=\"\"><div> <span>His preference was always greedy, always for more. You decide, he... soon to be she, should embody that very ideal. Making allowances for his ignorance... innocence, you also ensure she'll be blessed with nips to match.<br>\r\n<br>\r\nMichelle typed Chris' name into the editor. Before taking a second to correct/adjust it appropriately.<br>\r\n<br>\r\nName: Chris<b><i>tine</i></b><br>\r\nHeight: 6'4<br>\r\nPhysical Brithday: 16/11/1992<br>\r\nMental Birthday: 16/11/1992<br>\r\nBra Size: N/A<br>\r\nShoe size: 13<br>\r\n<br>\r\nShe lowered her height too, taking a full foot from her height. She'd regain some of that if she wore heels. Tapping her lips she mused what size bust Christine might prefer. GG-cup, she finally decided. Hair didn't need any musing, naturally blonde, she sent the changes.<br>\r\n<br>\r\nThe walls ripples momentarily, as reality adjusted, and the image of her sister filled one window.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://78.media.tumblr.com/598b7cffba09fdeeb706317eeb069db9/tumblr_ownwlul3KR1w2lwkto1_1280.jpg\" target=\"_blank\">https://78.media.tumblr.com/598b7cffba09...</a><br>\r\n<br>\r\nA hiss of sympathy slipped between her clenched teeth, those nipples would constantly be distracting her, a persistent itch to drive her to distraction. When the image moved, Michelle jumped she hadn't realised it was a video. But Christine was panting low like an animal. Barely suppressed emotions fought to a stand-still.<br>\r\n<br>\r\nSitting up Chrissi was pulled forward the rest of the way, by the inertia of her bust.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://78.media.tumblr.com/fd0401263779f6c347fad9091ce2f731/tumblr_ownwg1M2lF1w2lwkto1_1280.jpg\" target=\"_blank\">https://78.media.tumblr.com/fd0401263779...</a><br>\r\n<br>\r\nHer ponderous bust swinging beneath her like a cow waiting to be milked. A smirking smile played across Michelle's face, at least she wasn't suffering. Perhaps she might appreciate being more balanced.<br>\r\n<br>\r\nEyes flicking back over Chrissi's data, she decided, that GG, didn't merely refer to her sister's sumptuous bust. But, should also hint at her other proportions, that Chrissi should have a counter-balancing rear. An equine ass, to remind her of the Geegee's, of the love of horses that every young woman should embrace.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://78.media.tumblr.com/b16e539c9742104d4dbc891f41cd2d09/tumblr_ownwg1M2lF1w2lwkto3_1280.jpg\" target=\"_blank\">https://78.media.tumblr.com/b16e539c9742...</a><br>\r\n<br>\r\nA purr slipped from Chrissi's lips as her hips widened, her pelvic cracking loudly, but painlessly. She was just as blind to the last change as to all the rest.</span></div></div>",
            "created":1507352400,
            "id":2397650,
            "title":"bigger is better. Though maybe not for Chris."
        },
        "135112222":{
            "author_id":"wolfcommander",
            "author_name":"Wolfwriter",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Chrissy, why did you so abruptly narrowed it down to two choices? Here goes the next choice:<br>\r\n<br>\r\nDid she change his gender? And his clothing?</span></div></span></div>",
            "created":1258606800,
            "id":793986,
            "title":"Or Shoe Size"
        },
        "13513":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Slutty?",
                "Fashionable"
            ],
            "content":"<div class=\"\"><div> <span>she chose  the personality, and a large text box appeared, in it she typed Chris looks up to his little sister so much that he will start doing everything she does, including dressing like her, in fact he is on her way to ask her to allow him to wear her clothes and help him do so.\" and afterwards she changed his sizes to match hers.<br>\r\n<br>\r\nChris turned and walk towards her, looking a bit shorter than before and said \"umm sis you know how you're so cool and how much I look up to you, and how you're my idol.... I uh was wondering if I could start dressing like you since you're so fashionable and all and uh...\"<br>\r\n<br>\r\n\"shh, its ok, of course you can, I'll even help you, here come to my room I'll pick something out for you\"<br>\r\n<br>\r\n\"you will! great! thank you so much sis your the best!\"<br>\r\n<br>\r\nin your room you decide what to dress chris as</span></div></div>",
            "created":1295845200,
            "id":1041074,
            "title":"Something Else"
        },
        "135131":{
            "author_id":"pinkbirdo",
            "author_name":"Gatonom",
            "choices":[
                "A Bit Slutty",
                "Insanely Slutty"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How slutty?<br>\r\n<br>\r\nSlutty:<br>\r\nLow cut blouse/dress, heavy/full makeup, thong, etc.<br>\r\n<br>\r\nInsanely Slutty:<br>\r\nFull, slutty makeup. bikini,  etc.</span></div></span></div>",
            "created":1323493200,
            "id":1237766,
            "title":"Slutty?"
        }
    },
    "info":{
        "author_id":"ndrly",
        "author_name":"Tolchok",
        "brief_description":"Michelle has found a device that analyses your personal details and can change them.",
        "created":1249863660,
        "description":"<td align=\"left\" class=\"norm\">For her 16th birthday, Michelle has received a mysterious gift. It appears to be a laser, but when she points it at herself, it only shows her personal information. She decides to edit it as a joke, but it turns out that the device can actually change her.<br>\r\n<br>\r\nShe can change her name, her age, her height, any personal information about herself, and others. Other people will accept the change as if reality had always been that way.<br>\r\n<br>\r\nShe can edit...<br>\r\n<br>\r\nName<br>\r\nHeight<br>\r\nPhysical birthday<br>\r\nMental birthday<br>\r\nBra size (women only)<br>\r\nShoe size</td>",
        "id":1589640,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1570661520,
        "modified":1570661520,
        "pretty_title":"Personal Info editor"
    }
}