{
    "chapters":{
        "1":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Animal",
                "Anthro",
                "TG",
                "Bimbofication",
                "Other Choices"
            ],
            "content":"<div class=\"\"><div> <span>The sunlight shone brightly through the window which woke Jay from his dream, his dream was now pretty hazy the only parts he can remember were him running but he just shrugged it off like most dreams he has. the clock read 10am and Jay decided to grab some breakfast before planning his day, as he ventured downstairs he noticed a note on the table in the living room so he walked over and picked it up \"Be back tomorrow, Love Mum and Dad\" Jay sighed and dropped the note on the table heading to the kitchen \"they are always out for days on end i rarely see them\" he muttered to himself as he grabbed some bread and put it in the toaster. Jay stood by the toaster and waited as Lola wandered down \"hey where are mum and dad?\" she asked Jay simply shrugged \"no idea i just know they'll be back tomorrow\" he pointed towards the note on the table which Lola picked up and threw back down in a huff \"look I'll be going out soon so make sure your around to let me back in\" Jay heard the toaster go off and he turned and grabbed his toast \"did you lose your key again?\" he asks now slightly angry and Lola nods her head \"yeah it's in my room somewhere\" before heading back upstairs to leave Jay alone.<br>\r\n<br>\r\nAfter an hour Lola came back down now dressed to go \"I'm off bro\" she said and left without waiting for a goodbye, so Jay was left alone like always then again he could always call up one of his friends to hang out with,  but before he could decide the doorbell went off so Jay went to the door and opened it to see the local postman \"hey Mr Johnson hows your wife?\" Jay asked, Mr Johnson laughed a little \"She's fine Jay just a little under the weather\" Jay nodded and smiled taking the post \"well you tell her i said hey and that i hope she gets well soon\" Mr Johnson nodded and waved before leaving and Jay closed the door flicking through the post \"mums, mums, mums, dads, Lola's, hey whats this?\" Jay mumbled as he held up a small box \"i don't remember ordering anything\" Jay placed the mail on the table and opened the box to see a small bottle of Perfume \"oh it's perfume looks like a free sample\" he said looking the bottle over, \"this could make a good gift for mum or even Lola\" he said as he pulled the cap off and sprayed some taking a sniff \"hmm not bad this could make a good gift\" he said with a smile and as he put the cap back on and set the bottle down he began to feel a little odd.<br>\r\n<br>\r\nWhat Happens Next?</span></div></div>",
            "created":1344747600,
            "id":1403362,
            "title":"Waking Up to a Brand New Day"
        },
        "11":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Canine",
                "Feline",
                "Equine",
                "Bovine",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Type of Animal</span></div></span></div>",
            "created":1344747600,
            "id":1403369,
            "title":"Animal"
        },
        "111":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Dog",
                "Wolf",
                "Fox"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Type of Canine?</span></div></span></div>",
            "created":1344747600,
            "id":1403373,
            "title":"Canine"
        },
        "112":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Cat",
                "Lion",
                "Other Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Type of Feline?</span></div></span></div>",
            "created":1344747600,
            "id":1403374,
            "title":"Feline"
        },
        "113":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Donkey",
                "Horse",
                "Zebra"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Type of Equine?</span></div></span></div>",
            "created":1344747600,
            "id":1403375,
            "title":"Equine"
        },
        "114":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Cow",
                "Bull"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Type of Bovine?</span></div></span></div>",
            "created":1344819480,
            "id":1403376,
            "title":"Bovine"
        },
        "115":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Porcine",
                "Other Animal (Free Choice)",
                "Other Animal (Free Choice)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some More Choices</span></div></span></div>",
            "created":1344747600,
            "id":1403372,
            "title":"More Choices"
        },
        "12":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Canine",
                "Feline",
                "Equine",
                "Bovine",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Type of Animal?</span></div></span></div>",
            "created":1344819900,
            "id":1403387,
            "title":"Anthro"
        },
        "121":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Dog",
                "Wolf",
                "Fox"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Type of Canine?</span></div></span></div>",
            "created":1344819960,
            "id":1403389,
            "title":"Canine"
        },
        "1211":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Husky",
                "German Shepherd",
                "Other Breed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Breed?</span></div></span></div>",
            "created":1347765300,
            "id":1428505,
            "title":"Dog"
        },
        "12111":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Take A Nap",
                "Go For A Walk"
            ],
            "content":"<div class=\"\"><div> <span>Jay felt light headed and stumbled a little as he made his way to the couch \"I must not have eaten in a while\" he mumbled to himself yet he didn't feel all that hungry, Jay remained seated for a good 20 minutes before he felt good enough to stand up and another thought crossed his mind \"maybe I'm allergic to something in the perfume? ugh man it could be anything\" he muttered as he rubbed his face, Jay made his way to the kitchen grabbing a glass and filling it with water \"I'd best not worry about it\" he said to himself before drinking the water and setting the glass down and Jay began to decide on what to do next should he take a nap or go for a walk?</span></div></div>",
            "created":1347766440,
            "id":1428528,
            "title":"Husky"
        },
        "121111":{
            "author_id":"blkfox05",
            "author_name":"blkfox05",
            "choices":[
                "Jay walks a few blocks downtown toward the emergency clinic",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>Jay, ultimately decided to take a nap, laziness winning over as he curled up on the brown leather couch in the main room, flipping on the TV.   Nothing much was on as he yawned, moving from channel to channel stopping on one about dogs and how they had developed unique skills to read humans, like always looking at the left side of their owners face first to determine expression and mood.  Jay started to drift off almost immediately, feeling very odd and groggy and a little warm, passing out with his navy blue hoodie on, head crashing onto the pillow.  Several hours passed as Jay dreamed of running in fields on all fours, wagging his fuzzy tail and bouncing around, being a silly dog, always noticing a figure off in the distance, watching him, smiling and enjoying his company, knowing that he made her happy, being her pup.   He ran up to Korleena.. somehow he knew her name, sitting like a good obedient pup and wagging as she gave him a treat and petted him, the last thing he remembered was looking into her beautiful eyes, entranced.  He awoke with a start, hearing gunfire and seeing Predator was on TV.  It was late.. really late, the sun was already going down and the clock on the Directv menu read 7pm.  \"Damn.. I wasted the whole day sleeping\"  Jay reached down to the uncomfortable lump in his pants pocket, producing an Iphone 4s, checking for messages.  A few friends had texted him as well as one bot advertisement.  Jay dropped the phone.  It wasn't a shocking message that had bothered him though.  It was his hairy arm, or rather.. furry?  It looked like well.. fur.. a soft white fluffy fur.  In a panic, Jay rolled over fumbling for the lamp switch, turning it on and staring in shock at his furry hand and arm, panicking as his other looked the same.  To make matters worse his fingernails were more claw-like now in appearance, dark and curled around like an animals complete with soft, tough black pawpads underneath his fingers and palm.  His hand felt okay more or less.. if you could say that although it was slightly harder to grasp things now and everything just felt weird.   <br>\r\n<br>\r\nHe quickly hopped off the bed and ran through the kitchen and then upstairs to the upper bathroom, tearing off his hoodie.  Yup.  Fluff, white fluffy fur all over his body although his face just seemed slightly more hairy than usual.  he quickly put his hoodie back on and located some gloves to wear.  Fortunately it was getting cold out this time of year so no one would think twice about him covering up his furry paw-like hands.  \"Damn, it must have been something in that perfume or maybe my sister played a joke on me.. damnit this isn't funny!\" Jay said, still in denial thinking this was all some embarrassing elaborate hoax as he dressed up and quickly dry shaved the extra hair off his face, looking more or less passable to go downtown now at least.   Jay was debating calling the perfume company directly or the poison hotline or maybe just seeing if the emergency clinic was still open this late.  Maybe they'd be able to remove this stuff.. must be some expensive glue.  He made sure to grab some cash and leave the kitchen door unlocked in case his sis came home early from her party (he assumed given how social she was with her new friends lately).   <br>\r\n<br>\r\n</span></div></div>",
            "created":1347842640,
            "id":1429290,
            "title":"Take A Nap"
        },
        "1211111":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Someone Notices Jay",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Jay left his house and began walking towards the clinic his mind racing with thoughts and questions, but he felt more afraid than anything since he had no clue as to his sudden furriness was he seeing things? he was just happy no one would be able to see him clearly in the dark and he secretly hoped the clinic would find out what was wrong with him, as he got lost in thought he soon found himself in front of the clinic and he was feeling lucky as it was still open so he ventured in and got himself a slot before he sat down his face starting to itch a little so he idly scratches it</span></div></div>",
            "created":1347843780,
            "id":1429301,
            "title":"Jay walks a few blocks downtown toward the emer..."
        },
        "12111111":{
            "author_id":"blkfox05",
            "author_name":"blkfox05",
            "choices":[
                "Jay is admitted to the doctor just as he's about to talk to Emma",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>As Jay absentmindedly rubs his face he doesn't notice his long time friend Emma sneaking up behind him.  \"Boo!\" she says, making Jay jump.  He turns around to see Emma, a friend he's known since they were kids.  \"Emma! you scared me! but it's good to see you, what are you doing here.. is everything alright?\"  Emma grins but then gives Jay a more serious look, \"Oh, I just came to give a coworker a ride to the clinic, she wasn't feeling well, but I'm sure she'll be fine.. but what about you Jay?  You don't look so well.. and ..  did you forget to shave.. ?  This isn't like you?  How are things going anyway, it's been a few months now, I've been thinking about you lately.\"  Jay just shrugs and rolls up his sleeve to a startled look from Emma before sliding it back down, \"Yea, I didn't sleep well, had some disturbing dreams earlier, but otherwise okay and yea, I think Lola did this to me, that annoying little brat, always playing pranks when my guard is down but I'll get her back.  I think it's some kind of expensive glue so I decided to come here although I feel kind of stupid wasting the doctors time over such a small matter\" Jay says, looking around seeing a few people that are legitimately sick, a woman with a coughing child, an older man rubbing his chest every once in a while and another guy about Jays age that looked like death warmed over.  \"Ah, yes, Lola.. you'd think by now she'd have grown up.. and wow.. that looks like a really expensive prank to pull.  it almost looks.. real.. can I .. touch it?\"  she say, curiosity taking over, sliding back his sleeve despite his protests, rubbing his soft silky fur, which.. Jay had to admit felt pretty good, sending shivers up his spine, having brief flashes of wagging and being petted, shaking it off suddenly, pushing Emma's hand away.   She looked at him more seriously, \"What is it?\"  Jay answered, \"Oh, nothing, sorry, was daydreaming.. I'm still a bit tired, heh.\"   Emma then softened a bit, \"That.. fur, you know.. feels really nice actually.. heh sorry, I know it's bothering you though, I hope they'll have some glue remover and well you mentioned dreams.  I had an odd dream too last night.  Was a weird day in general, some sample of perfume came in although I haven't tried it yet, although my coworker did,  she said it made her light headed.  That's why we're here now.  I hope it wasn't a chemical reaction like an allergy or something.\"  She said, suddenly lost in thought, ignoring the glare from Jay after mentioning how soft the fur was.  He was immediately concerned about the perfume though.  This was just too much of a coincidence he thought.  </span></div></div>",
            "created":1347847080,
            "id":1429330,
            "title":"Someone Notices Jay"
        },
        "121111111":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Jay declines the ride",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>Jay grumbled to himself as his name was called by a nurse so he stood up gave Emma a nod and made his way to the doctors room, as he walked in the doctor looked him over and ushered him to a seat which Jay did fast \"now what is the problem\" the doctor said in a flat tone \"well my sister played a prank on me at least i think she did, and i just want to know if you can remove this glue\" Jay said as he pulled off his hoodie and gloves showing his fur, the Doctor made a close inspection and examined it before he sat back \"i don't think that is glued on young sir, i can't tell you what is causing this I'm afraid but if symptoms persist for more than 4 days i want you to come back for a thorough examination\" Jay nodded and stood up with a sigh \"thanks anyway doc\" he said as he left feeling a bit down, as he left the office he went back to Emma who must of waited for him while he was in there \"well?\" she asked but Jay shook his head \"the Doctor said it wasn't glued on i must be having some freaky reaction to something\" Emma nodded and stood up \"listen i can give you a ride home if you want?\" Jay scratched his face again thinking</span></div></div>",
            "created":1347848580,
            "id":1429339,
            "title":"Jay is admitted to the doctor just as he's ..."
        },
        "1211111111":{
            "author_id":"blkfox05",
            "author_name":"blkfox05",
            "choices":[
                "Jay leaves the hospital",
                "Jay heads for the library instead"
            ],
            "content":"<div class=\"\"><div> <span>Jay's face brightened a little at Emma's offer, *oh that's alright, I moved back in with my parents so I'm only a few blocks down the road but maybe we could catch up later or meet for coffee?*  Emma nodded and held his hand, feeling his pawpads now, looking at him a bit worried now, \"Oh okay.. \"   Jay responded a bit perplexed, \"What is it Emma?\"  \"Oh nothing.. \" She replied, certain that those were real dog pawpads.  She would know since she owned a dog, noticing how Jays paws.. er hands.. whatever they were felt very real, the pads even a bit sweaty like a nervous dogs would be.   It was too weird but it would have to wait until she dropped off Becca at her house, and then, it was off to the library.  She suspected something supernatural, like in the horror movies she loved to watch but didn't want Jay teasing her or worse alarming him.  Keeping calm was always the best practice in any situation.  \"Well text me later if you're feeling better okay Jay? Keep in touch\"  she said, leaning in and giving him a kiss on the cheek before heading out with a pale faced red haired girl, short of stature and slim in a loose green outfit.. who's face looked a bit unshaven as well.   \"Emma wait!\" Jay called out but it was too late, she had already walked to her car and left, as Jay wanted to ask about the perfume, completely distracted by the reunion with his childhood friend.  They used to hang out all the time but just didn't anymore due to work and time constraints.  Jay started to walk out but could have sworn he heard a weird sound from around the corner of the hall, like a dog laughing but it was short and only lasted a moment.   He was still wondering how any known drug could give him real pawpads or anything similar but didn't want to alarm Emma.  Maybe he'd take a sidetrip to the library, it stayed open late on the weekends for students and as part of a youth stay out trouble program.  This was too much like something out of one of these cheesy sci fi flicks he had grown up watching with Emma late night on weekends.  Could this be really happening he thought? Maybe he was turning into a werewolf... but.. those aren't real.. are they..?</span></div></div>",
            "created":1347850380,
            "id":1429365,
            "title":"Jay declines the ride"
        },
        "12111111111":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Jay wakes up inside the house",
                "Jay wakes up in the garden"
            ],
            "content":"<div class=\"\"><div> <span>Jay decided to leave the Hospital he still felt drained even though he slept for most of the day but felt he needed more sleep, his walk home felt longer than the walk there \"feel so tired\" he mumbled as he made his way along the path to his home, he turned a corner and as he passed by a small house his legs gave way and he fell into the garden asleep feeling exhausted</span></div></div>",
            "created":1347852420,
            "id":1429378,
            "title":"Jay leaves the hospital"
        },
        "122":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Cat",
                "Lion",
                "Other Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Type of Feline?</span></div></span></div>",
            "created":1344820020,
            "id":1403391,
            "title":"Feline"
        },
        "123":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Donkey",
                "Horse",
                "Zebra"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Type of Equine?</span></div></span></div>",
            "created":1344820020,
            "id":1403392,
            "title":"Equine"
        },
        "124":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Cow",
                "Bull"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Type of Bovine?</span></div></span></div>",
            "created":1344820080,
            "id":1403393,
            "title":"Bovine"
        },
        "125":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Porcine",
                "Other Animal (Free Choice)",
                "Other Animal (Free Choice)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More Choices</span></div></span></div>",
            "created":1344819900,
            "id":1403388,
            "title":"More Choices"
        },
        "15":{
            "author_id":"jbrey",
            "author_name":"jbrey",
            "choices":[
                "Sissyfication",
                "Readers Choice (Choose New TF Trigger)",
                "Readers Choice (Choose New TF Trigger)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More Choices</span></div></span></div>",
            "created":1344747600,
            "id":1403367,
            "title":"Other Choices"
        }
    },
    "info":{
        "author_id":"jbrey",
        "author_name":"jbrey",
        "brief_description":"You get to Choose my TF",
        "created":1344816120,
        "description":"<td align=\"left\" class=\"norm\">This is an interactive that let's the reader TF me the following are TFs I'll allow<br>\r\n<br>\r\nAnimal<br>\r\nAnthro<br>\r\nTG<br>\r\nBimbofication<br>\r\nSissyfication<br>\r\n<br>\r\nAll TFs made are to be temporary but can last for as long as the reader chooses (try not to make it permanent)<br>\r\n<br>\r\n<br>\r\nNow to lay down some ground rules<br>\r\n<br>\r\nNo killing any characters<br>\r\nIt's to be done in 3rd person<br>\r\nNo toilet stuff<br>\r\nNo violence<br>\r\n<br>\r\n<br>\r\nOther Things:<br>\r\n<br>\r\nI live with my parents<br>\r\nI have no Girlfriend<br>\r\nI'm a Guy<br>\r\nI'm Bisexual So keep it that way please<br>\r\n<br>\r\n<br>\r\nNow Onto characters<br>\r\n<br>\r\nJay: Me basically, I'm a Shy 22 year old that lives with his parents<br>\r\n<br>\r\nStella: Mum (44) An outgoing woman who enjoys cooking<br>\r\n<br>\r\nTroy: Dad (47) A gym enthusiast and someone who enjoys sports<br>\r\n<br>\r\nLola: Sister (23) Older Sister who has a more naughty side to her she also has no boyfriend<br>\r\n<br>\r\nDavid: (22) A friend who helps get me through troubling times<br>\r\n<br>\r\nGreg: (21) Another friend who likes to joke around<br>\r\n<br>\r\nLexi: (22) An old college friend who i have a crush on<br>\r\n<br>\r\nEmma: (23) A friend who i grew up with and enjoy having around for support</td>",
        "id":1885064,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1347852420,
        "modified":1347852420,
        "pretty_title":"I Become Transformed"
    }
}