{
    "chapters":{
        "1":{
            "author_id":"flatworld",
            "author_name":"TheDude",
            "choices":[
                "Harry Potter",
                "Ron Weasley",
                "Hermione Granger",
                "Some Teacher",
                "Some Other Student"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well...The first step is to choose who you are.</span></div></span></div>",
            "created":1109739600,
            "id":238240,
            "title":"Person"
        },
        "11":{
            "author_name":"rebel",
            "choices":[
                "yea u sick purv",
                "no..."
            ],
            "content":"<div class=\"\"><div> <span>hey wuts up ron said harry nuthin much replied ron ... harry then says ron i hav to tell u sumthin that u cant tell ne 1 els do u promise... of course harry..good well heres it is hary sighs im gay ive always been and u wanna kno who is so hot draco malfoy omg i wanna make out wit him so bad.. Oh my gosh harry are you serious..yes i am ron ..can we still be friends ...yea we can ...then hary says and i kinda hav a crush on u and i kinda thought mayb u were gay 2 and if u wanted to hav sex wit me ...Oh my gosh harry!!!!!...u think im a freak..</span></div></div>",
            "created":1115521320,
            "id":249000,
            "title":"harrys true feelings"
        },
        "112":{
            "author_name":"rebel",
            "choices":[
                "hermoine walked in",
                "keep makin love"
            ],
            "content":"<div class=\"\"><div> <span>No harry i dont its just im gay and i love you too and my greatest fantasy is to hav sex with you...thats y i always smacked ur ass and stuff and said it was an acident..said ron....YES!!! said harry all exited then they went up to the common room that night wen no 1 was ther and harry gave ron a blow job while ron gave harry one then harry fucked him up the ass....and then </span></div></div>",
            "created":1115521500,
            "id":249001,
            "title":"harry and ron"
        },
        "12":{
            "author_id":"flatworld",
            "author_name":"TheDude",
            "choices":[
                "Overcome your fears and magical incompetence",
                " Help your friends",
                "Make a name for yourself",
                "Discover your sexual Identity",
                "Go insane and attempt to destroy Hogwarts"
            ],
            "content":"<div class=\"\"><div> <span>You are Ron Weasley. You are tall, lanky, and have red hair. You have horrible luck and can't stand to be alone in the dark.<br>\r\n<br>\r\nYou love rodents, your mother, Harry Potter and Will and Grace.<br>\r\n<br>\r\nNo one really know you exist. You are just that kid who knows Harry Potter.<br>\r\n<br>\r\nIt's your sixth year of Hogwarts. <br>\r\n<br>\r\nYour Mission this year is to...</span></div></div>",
            "created":1109826000,
            "id":238331,
            "title":"Ron's Introduction"
        },
        "124":{
            "author_name":"rebel",
            "choices":[
                "hermoine walks in while they makin love",
                "harrys \"wand\" goes off"
            ],
            "content":"<div class=\"\"><div> <span>ron was staing at harry potter one day wen it clicked in his mind he was gay becausse that explains why he always has dreams of harry naked and havin sex with him he told harry this and harry told ron he was gay to and they gave each other blow jobs and but fucked each other and then </span></div></div>",
            "created":1115521740,
            "id":249003,
            "title":"harry and ron make love"
        },
        "125":{
            "author_id":"flatworld",
            "author_name":"TheDude",
            "choices":[
                "The Library",
                "The Bomb Shop"
            ],
            "content":"<div class=\"\"><div> <span>You HATE your life.<br>\r\n<br>\r\nYou HATE the world.<br>\r\n<br>\r\nYou HATE Harry Potter for being such of a glory hog.<br>\r\n<br>\r\nYou HATE Hermione for being so perfect.<br>\r\n<br>\r\nYou HATE Malfoy, Snape, and Filch.<br>\r\n<br>\r\nYou HATE that you have a small johnson.<br>\r\n<br>\r\nYou want to destroy the school. The best place to start is...</span></div></div>",
            "created":1110171600,
            "id":238803,
            "title":"Ron HATES"
        },
        "1251":{
            "author_name":"rebel",
            "choices":[
                "harry liked it",
                "ron is expelled"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ron decides that was a bad idea so ... he goes in the bathroom jacks off thinkin of harry cuz rons gay and then he raped harry in the but and...</span></div></span></div>",
            "created":1115521980,
            "id":249005,
            "title":"changes mind"
        },
        "13":{
            "author_id":"flatworld",
            "author_name":"TheDude",
            "choices":[
                "Become an unstopable witch",
                "Vanquish your enemies",
                "Help your friends",
                "Lose you virginity",
                "Go insane and destroy Hogwarts"
            ],
            "content":"<div class=\"\"><div> <span>You are Hermione Granger. You love hogwarts. You love magic. You love cats. You love your parents. You love Desperate Housewives.<br>\r\n<br>\r\nYou love many things.<br>\r\n<br>\r\nYou are a budding adolescent girl. You are becoming a powerful witch. You do well in school.<br>\r\n<br>\r\nBut, you near perfection has cost you. You have many enemies.<br>\r\n<br>\r\nBut, you also have many friends.<br>\r\n<br>\r\nIt's your sixth year at Hogwarts. What is your mission this year?</span></div></div>",
            "created":1109826000,
            "id":238330,
            "title":"Intoduction to Hermione"
        },
        "134":{
            "author_id":"abbie_joy17",
            "author_name":"LittleMissMalfoy",
            "choices":[
                "Draco Malfoy",
                "Fred Weasley",
                "Ron Weasley"
            ],
            "content":"<div class=\"\"><div> <span>As you sat in the girls dormitories you realised how boring you really were. You were bossy and snappy. You never thought of getting a proper boyfriend whilst at Hogwarts. <br>\r\n <br>\r\nJust then Lavender walked in. You weren't the BEST of friends but you were pretty close and knew she would help you if you needed help. To be honest, right now you needed help!<br>\r\n<br>\r\n\"Hey Lavender,\" you say smiling weakly, she returns your fretting and your smile.<br>\r\n<br>\r\n\"Whats up Hermionie you look really pissed?\" she said studying you carefully.<br>\r\n<br>\r\nYou sigh and look at you hands \"I don't know, just think that its time that I change, you know?\" Lavender nodded. <br>\r\n<br>\r\n\"Well if your gonna change your gonna need some help\" she smiled winking at you. \"And to be honest, the first place we should start is your appearance\"<br>\r\n<br>\r\nYou got up and looked at your self in the full length mirror. Lavender was right. You were plain and simple nothing special. You smiled at Lavender letting her know she was right. <br>\r\n<br>\r\n\"Lavender, help me, please?\" you said desperately. She grinned and agreed.<br>\r\n<br>\r\n\"If you wanna be perfect, I'm gonna need a little more help\" she said. Taking out her wand she said \"expecto patronum\" six bunnies, pearly White appeared and then hopped off through the walls. What seemed like two minutes later Ginny, Parvati, Padma, Luna and Cho walked into the room, all with dertermined yet happy faces.<br>\r\n<br>\r\nCho twirled her wandband a chair appeared from no where. <br>\r\n<br>\r\n\"Hermione sit here for us please.\" she said indicating to the straight back chair infront of her. You sit. All six girls stand around you examining you all over. <br>\r\n<br>\r\n\"Okay at the moment I think we should sort out her hair\" said Padma taking a section of your hair in her hand. \"We should straighten it and use this thing I got from my mum, it makes your hair stay straight, permanently!\" she said, the others agreed.<br>\r\n<br>\r\nThey all set to work, it took almost four hours to get You absolutely perfect, but when you looked on the mirror it was like looking at a totally different person. You looked amazing. Your hair was straight, sleek and shiny. You had a pair of lowrise hip huggers on, you were so glad of your perfect, natural size 8 figure, your b-cup chest, which looked bigger in your emerald green tight fit plain t-shirt.<br>\r\n<br>\r\nYou felt great you hugged and thanked everyone, but they hadn't quite finished with you.<br>\r\n<br>\r\n\"Okay no means to be rude, but are you virgin?\" asked Parvati, you blush slightly and nod. \"Well, I'm gonna be honest with, the first time it kills you, but it releases a lot of stress, trust me, you need a man!\" <br>\r\n<br>\r\nYou grinned, you had been thinking about having sex quite slot recently but the thing was that you really were stuck cause you didn't know who you liked.<br>\r\n<br>\r\nAfter another hour of talking about sex and showing how the best way to do your make up was, you were finally ready to face the male population. <br>\r\n <br>\r\nYou hadva small amount of foundation under eyes to cover the bags, two coats of mascara and your eyelashes looked false, they were so long, you had a small amount of eyeliner on too just to define you eyes, they sparkled against the sun fluttering through the window.<br>\r\n<br>\r\nAll the girls hugged you and you walked from the dormitory together, you left the empty common room and made your way, with the girls, to the great hall were the evening feast was just begining. <br>\r\n<br>\r\nYou were nervous but confident.<br>\r\n<br>\r\n\"Hermione you look great, now stop playing with you hair\" said Ginny nudging you playfully in the ribs. \"Okay girl knock them dead!\" She encouraged.<br>\r\n<br>\r\nEveryone gave you confident smiles. You breathe deeply. Cho walks through the doors and the rest of the girls follow in a line, you were in front of Ginny and Luna. <br>\r\n<br>\r\nEveryone in the hall is tooling into their food, talking loudly to one another, you, Ginny,  Lavender and Parvati sit down next to Ron and Harry who look at you in awe.<br>\r\n<br>\r\n\"When you've finished growing, would you to pick up your jaw it appears to be in my lap\" you joke, Ginny winked at you, she was sat across from you next to Harry on her other side Parvati, you were inbetween Ron and Lavender.<br>\r\n<br>\r\nOnce the feast had done, you met with the girls and you decided that you wanted your first time to be with....</span></div></div>",
            "created":1203291660,
            "id":499258,
            "title":"Ch-ch-ch-Changes"
        },
        "1341":{
            "choices":[
                "Find him",
                "Run into Harry and Ron on the way"
            ],
            "content":"<div class=\"\"><div> <span>\"No\" said Ginny \"Absolutely not\".  Everyone staired at you like you were some freak of nature.  \"Look, I just figure It should be with someone I don't care about.  That way I won't be so nervous\" \"You know, she has a point\" said Cho.  Lavender and Pavarti started to agree with her, but Ginny was not about to give in.  \"Hermione, you're like turining into a traitor!  You cant have sex with him!\" \"It's my verginigy Ginny, I can do whatever the hell I want with it!\" you siad and stormed out of the room to find Draco.</span></div></div>",
            "created":1289599200,
            "id":992425,
            "title":"Draco Malfoy"
        },
        "14":{
            "author_id":"flatworld",
            "author_name":"TheDude",
            "choices":[
                "Snape",
                "McGonagall",
                "Hagrid",
                "Flitwick",
                "Filch (the caretaker)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, which teacher?</span></div></span></div>",
            "created":1109739600,
            "id":238241,
            "title":"Teacher"
        },
        "145":{
            "author_id":"flatworld",
            "author_name":"TheDude",
            "choices":[
                "Harry Potter and Co.",
                "Draco Malfoy and Co."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are Filch. The squib. You can see magical things. You just can't perform magic. Sucks to be you. The students are always making you look like a fool. You must exact vengeance. But first who will you exact vengeance on?</span></div></span></div>",
            "created":1109826000,
            "id":238342,
            "title":"Filch"
        },
        "15":{
            "author_id":"flatworld",
            "author_name":"TheDude",
            "choices":[
                "Hannah Abbott (Hufflepuff prefect)",
                "Cho Chang (ravenclaw girl)",
                "Colin Creevey (kid with camera)",
                "Angelina Johnson (black girl, Gryffindor Chaser)",
                "Draco Malfoy (Punk kid)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well...Which one?</span></div></span></div>",
            "created":1109739600,
            "id":238243,
            "title":"Some Other Student"
        },
        "151":{
            "author_id":"scaryy",
            "author_name":"Drogan",
            "choices":[
                "No Hannah Abbot",
                "Yes who am I? "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or are you a new girl or boy custom made?<br>\r\n</span></div></span></div>",
            "created":1599135120,
            "id":2896651,
            "title":"Hannah Abbott (Hufflepuff prefect)"
        },
        "1512":{
            "author_id":"scaryy",
            "author_name":"Drogan",
            "choices":[
                "Male",
                "Female",
                "Somewhere inbetween"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First question in hand is are you male or female? </span></div></span></div>",
            "created":1599320160,
            "id":2898044,
            "title":"Yes who am I? "
        },
        "15121":{
            "author_id":"scaryy",
            "author_name":"Drogan",
            "choices":[
                "Your famaly is well known",
                "Unknown maybe muggleporn"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you're a male then. Are you a new kid of an already existing famaly? Or are you from an unknown family? Muggle porn perhaps? </span></div></span></div>",
            "created":1599320340,
            "id":2898045,
            "title":"Male"
        },
        "151211":{
            "author_id":"scaryy",
            "author_name":"Drogan",
            "choices":[
                "Weasley, seriously another one? ",
                "Some other name"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what's your famalys name? </span></div></span></div>",
            "created":1599320640,
            "id":2898049,
            "title":"Your famaly is well known"
        },
        "1512112":{
            "author_id":"scaryy",
            "author_name":"Drogan",
            "choices":[
                "Yeah",
                "No someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Malfoy, a pureblood kid maybe Dracos twin brother. (I know the weasley are purebloods too but they don't care that much, the malfoys however do care.) </span></div></span></div>",
            "created":1599321960,
            "id":2898056,
            "title":"Some other name"
        },
        "15121121":{
            "author_id":"scaryy",
            "author_name":"Drogan",
            "choices":[
                "First day at hogwarts, the sorting hat will decide how this story goes!",
                "On the way to hogwarts you encounter someone. "
            ],
            "content":"<div class=\"\"><div> <span>So you're Dorian Malfoy, your father luscious gave Draco his name while your Mother Narcissa named you. As his twin your at the same age as Draco 2 seconds younger, what he never fails to remind you of, however these 2 seconds made him the heir so father was mainly focused on his education and status. So your mother started to give you a little more attention to equalize the lacking interest of your Father. However through the first years of your life, you learned to:<br>\r\n-fly with a broom<br>\r\n-a good amount of spells (you actually learned faster then Draco, so Lucius tried to slow you down but Narcissa teacher you more in secret/Draco as well of course)<br>\r\nThese spells are<br>\r\n-Alohomora<br>\r\n-wingardium leviosa<br>\r\n-expelliarmus<br>\r\n-stupor<br>\r\n-flipendo<br>\r\n-repairo<br>\r\n<br>\r\nAlso some potions are known to you.<br>\r\n-Anti paralysis potion<br>\r\n-Antidote to common poisons<br>\r\n-Blemish blitzer<br>\r\n-Confusion Concoction<br>\r\n-love potion antidote<br>\r\n-Polyjuice<br>\r\n<br>\r\nAll in all your fathers mothers and privat teacher made you very strong and smart, but you haven't had much time to be a child, your only 'social contact' is your twin brother, as the letters came that both of you are invited to hogwarts Draco was excited and happy, you however where unsure, all these strangers, to be away from home, you where scared. As your father rested his hand on your shoulder (he rarely touches anyone) he said \"don't worry once your in slytherin with your brother just follow his lead everything will be fine.\" than he turned to Draco \"make me proud son.\" Draco nodded in respond \"of course and don't worry about my Little brother here I will take care of the scared cat.\" he flashed me a grin, I was upset he made fun of me \"HEY I'M NOT SCARED!\" Dracos grin turned to a full smile \"yeah yeah as always, no seriously I think our schooltime will be awesome!\" I nodded as mother came to us as well she hugged both of us tightly whe she hugged me she whispered to me \"make sure Draco doesn't make to many enemies he can be a little out of term as you know.\" I whispered back of course Mother. \"</span></div></div>",
            "created":1599324000,
            "id":2898062,
            "title":"Yeah"
        },
        "151211211":{
            "author_id":"scaryy",
            "author_name":"Drogan",
            "choices":[
                "Slytherin.\" obviously",
                "Not Slytherin\" the hat said suprisingly"
            ],
            "content":"<div class=\"\"><div> <span>As you and the other kids entered Hogwarts you where greeted by an elderly Woman named Minerva McGonagall, she eyes all children like she's reading them this very second \"Follow me children, and don't be noisy when we enter the great hall, all other students are there, no one wants to start the first year with a bad impression.\" as she turned her back to us Draco whispered \"the first teacher is a stuck up ancient old witch great.\" I immediately saw her head turning to him, fuck she heard that whispering back to him \"hey, we don't know her yet, don't judge her to quick.\" he shrugged displeased with my answer, but McGonagall turned away again and leaded us further through the castle. Until we stood before a giant door wich she opened by raising both her hands, we saw a giant hall with a massive tables all filled with students in the same color each. They all applaud, as we walked past them, at the amend was an old hat, behind the hat where the teachers table, dumpledore sits in the center, I also know Snape he's the head of Slytherin and Father told us he's a good man. Before I could grasp everything McGonagall started to read names. \"Hannah Abbot.\" a blond girl walked towards the Hat and Minerva put the hat on her head, \"Hufflepuff\" it said rather loudly Minerva continued \"Hermione Granger\" she was very unsure and nervous. \"Gryffindor.\" she seemed to relax a lot, Draco turned to me \"hmpf I thought th mud blood would go to huffloser house.\" you where slightly confused \"how do you know she's a....\" you didn't wanted to say that word \"father told me which person's I should keep distance to and why.\" hmm \"DRACO MALFOY step forward at once!\" it semms we didn't hear Minerva and she became a little impatient, Draco than walked over to the hat, and even before the hat rested on his head \"Slytherin!\" he was happy, but I heard a redheaded boy telling a black haired glasses wearing boy \"all wizards that turned bad where in Slytherin.\" is that true? But why would it be? \"Dorian Malfoy.\" the redhead continuous \"there are two of them!\" I walked slowly towards McGonagall and sat down, she put the hat on my head \"hmmm m.\" </span></div></div>",
            "created":1599390420,
            "id":2898370,
            "title":"First day at hogwarts, the sorting hat will dec..."
        },
        "1512112111":{
            "author_id":"scaryy",
            "author_name":"Drogan",
            "choices":[
                "In the chambers ",
                "Draco has an idea"
            ],
            "content":"<div class=\"\"><div> <span>Whew that will please Father, who knows what would have happened if I was not on Slytherin like my brother. While everyone in Slytherin Clapped there hands and greeted me, the two boys from earlier eyed me with suspicion. \"Ronald Weasley\" McGonagall said with a firm voice, I saw the redheaded boy jump up in suprise. seeing him walk awkwardly towards the hat was funny since his big mouth was shut down instandly. \"A Weasley again..... Gryffindor!\" he relaxed just like Hermione before him, it seems Gryffindor was there first choice anyway. \"Harry Potter\" was called by McGonagall and the whole room Gasped and started to whisper \"that is Harry Potter.... He who survived...... Yes..... You know who....... That's crazy.... I hope he joins my house.....\" The elderly woman raised her voice again \"SILENCE\" everyone got quiet an instand she turned to face Harry \"now let us proceed.\" with that Harry sat down and the hat was calm and quiet, Harry whispered something no one could here as the hat loudly pronounced \"NOT SLYTHERIN HMMM?\" what that's what he's whispering........ What why not our house? I thought what other Slytherin where now whispering towards each other. Guess he made a whole house he's enemy now. \"BUT SLYTHERIN WOULD HELP YOU ACHIEVE WHAT YOU Desire no? Still not slytherin........ Well than GRYFFINDOR!\" Harry walked to the Gryffindor table happy obviously, the hat sorted all other kids but I was now paying attention towards an older student who started to explain the basics to us, he's actually a fith grader and one of the prefects of slytherin, while we ate and listened the time was like rushing in top speed soon Dumbledore pronounced that the feast is over and the head boys should now lead the new students to there chambers. </span></div></div>",
            "created":1599417540,
            "id":2898493,
            "title":"Slytherin.\" obviously"
        },
        "15121121111":{
            "author_id":"scaryy",
            "author_name":"Drogan",
            "choices":[
                "I don't have questions",
                "I do have some"
            ],
            "content":"<div class=\"\"><div> <span>\"Follow me, My Name is Fren Gouldron I'm you head boy this year, don't ask stupid questions until I'm done with everything.\" he said while he already walked ahead, after a few seconds we started to follow him quickly. \"These are the stairs, they're enchanted to move randomly, so I suggest you plan enough time to get to your classes, I don't want to you to lose points for Slytherin only because you think, you need only 5 minutes to be on point, the stairs might just crush this plan. However we do not need to use them now we can go straight, to the dungeons underground the sea, come now. \" he leads us towards a not moving stair that leads underground in front of us is another group of newbies the hufflepuff. Our headboy spoke again \"the hufflepuff are 'sadly' our neighbor down there, however they don't bother us mostly, I suppose they accept our superiority.\" as we reached the ground Fren gave us the signal to stop. We saw the Hufflepuff standing there motionless for 2 minutes, then they walked out of our sight. \"The head boy of Hufflepuff explained how to open the hufflepuff chambers, we are strictly forbidden in the other houses rooms so we are not allowed to now how to open their gate, let's proceed.\" as we walked past the hufflepuff rooms, we saw another room on the right side \"Attention kids this is the most important room for you, it's the potion classroom, it's important because it's Snapes class, Snape is our head teacher, so he decides most of your rewards........ And punishments, he can either back you up belief me that makes your time a lot more easy or you go to his bad side, and well let's say that's complicates stuff, so be sure to be on point have your homework done. \" I nodded while Draco raised his eyebrow looking at me \"relax you don't gave to make an effort our Father backs us up so whatever.\" I shaked my head \"we can't just rely on Father, he isn't here with us we must work to get better ourselves.\" the other kids stepped away from us while Fren approached \"I don't know why your talking while I explain stuff, but nonetheless Dorian is right your Father isn't here, in Hogwarts you can only rely on yourself to improve or you might end up with a job above your skills.\" Draco shrugged \"don't act all bratty with me 5 points deducted from Slytherin.\" Draco was shocked \"what why would you...\" Feen snipped his fingers \"a head boy has responsibilities to Hogwarts not only his own house secondly you need to learn to behave correctly, so you earn points instead of losing more, you will see your popularity will be hugely impacted by your points, don't worry now -5 points won't give you a bad relation, but we had once a girl in Slytherin she had - 25 points at the end of the year. The next year was pure torture for her at the end she run into the forbidden forest and never came back.\" Draco gulped, and Fren walked forward again right to the next Gate \"this is our gate to open it you must phrase the password now its a word some years it's a sentence, it changes so even if someone fibds out the password next year it's useless, this year the password is rather simple.\" he turns to the gates and says \"Heir\" the gates open up and we entered a room that has much space and is filled with luxury everywhere. \"Now the main Common room, here we have most our free time also it's the meeting point if I need to talk to any of you. To the left is the female wing to the right the male wing, any questions?\"</span></div></div>",
            "created":1599439200,
            "id":2898681,
            "title":"In the chambers "
        }
    },
    "info":{
        "author_id":"flatworld",
        "author_name":"TheDude",
        "brief_description":"A Harry Potter Interactive. What is new?",
        "created":1109709720,
        "description":"<td align=\"left\" class=\"norm\">Hey! This is a Harry Potter story at Hogwarts.<br>\r\n<br>\r\nAnything Goes. I will up the rating as need be.</td>",
        "id":944711,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1599439200,
        "modified":1599439200,
        "pretty_title":"Harry Potter, etc..."
    }
}