{
    "chapters":{
        "1":{
            "author_id":"joobjoob",
            "author_name":"JoobJoob",
            "choices":[
                "1 inch",
                "1/2 inch",
                "2 inches",
                "1 foot",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lets start off with choosing some basics of the story :D<br>\r\n<br>\r\nFirst how small will you shrink?</span></div></span></div>",
            "created":1583486760,
            "id":2797299,
            "title":"It begins.."
        },
        "11":{
            "author_id":"joobjoob",
            "author_name":"JoobJoob",
            "choices":[
                "Home",
                "School(highshcool or college)",
                "Work",
                "Park",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>and now, where will you shrink?</span></div></span></div>",
            "created":1583486940,
            "id":2797300,
            "title":"1 inch"
        },
        "111":{
            "author_id":"james.foley",
            "author_name":"James F",
            "choices":[
                "One of your roommates",
                "Can't worry about that, one of your roommates is comming",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Your name was Jim, you were 22.  You were unemployed, but had an interview set up for this afternoon.  You resently moved into a house that was already occupied 5 attractive women, who were all between the ages 22-26. You woke up, got some breakfast, and then sat on the couch by the window, and watched some T.V.  You heard some footsteps coming our way, but before you saw who it was, you felt tingly, and closed your eyes for a while, then you opened them, and everything was bigger.  \"What? did I shrink?\" you asked.  what caused this?</span></div></div>",
            "created":1585180980,
            "id":2807170,
            "title":"Home"
        },
        "1111":{
            "author_id":"2protagonist",
            "author_name":"2Protagonist",
            "choices":[
                "Amy or Katie",
                "June or Stacey",
                "Jessica or Chealsey"
            ],
            "content":"<div class=\"\"><div> <span>Your new roommates were:<br>\r\n<br>\r\nAmy You will soon find out, she had the worst gas of your roommates, but she was nice enough, and cool, B-cup breasts, average saized butt, hazel hair Down to her shoulder.  24<br>\r\n<br>\r\nKatie is a writing.com interactive chapter writer, and sometimes, she turns to you for inspiration.  She has long brown, average height and build, B-cup breasts, and average size butt, sometimes has gas, may be playful, or pull pranks, to get a fun story.  You Don’t know that she’s a writer yet though.  22<br>\r\n<br>\r\njune, she is kinda tomboyish, as you saw with her sense of humor,and in the future will learn that she has a tendency to be gross.5’10” dark hair down to her shoulders, C-cup breasts, sizeable butt, but not enourmous 23<br>\r\n<br>\r\nStacey Super athletic, has C-cup breasts, large butt, and loves to mess with you she is 5’11”, and has Long black hair 22<br>\r\n<br>\r\nJessica, pretty tall, 5’11” C-cup boobs she easily had the largest butt of your roommates, can be careless, and forgetful.  Blonde 24<br>\r\nYou looked around, then saw someone approaching, it was Jessica.  “Hey Jessica, down here!” you said.  Jessica looked down at you and while giggling said.  “Awww, you’re so cute.” “Jessica, What the heck happened?” you asked.  Jessica leaned forward, giving you a nice view of her boobs, “Well last night I got a call from a friend of mine, saying that she was kicked out of her old apartment, and needed a place to stay, I thought about kicking you out, then my friend said that since you didn’t have a job yet, if you shrunk it wouldn’t cause any problems, and our new favorite guy will be 10 times cuter!!” she said, excitedly.  You were taken aback by her honesty, and excitement about this, “But how is this possible?” you asked.  “Well, a couple weeks ago I bought this small spray bottle of shrinking serum, from some girl, that was about my age, so I just used all of it to shrink you, and the rest of your stuff.” She said.  “Jessica this is crazy turn me back now!” you yelled.  I can’t, I don’t have an antidote.” She said.  So you’re saying I’m stuck like this forever?” you said, Upset and angry.  Jessica saw this and tried to reassure you.  “Sorry little Jim, I didn’t buy an antidote, and besides, it’s probably way better for you to stay small.” She said.  “what do you mean!?” you asked.  “Well, now you won’t need to work, help clean up, pay rent, and you’ll be living with 6 hot babes.”  Jessica said.  It did peek your interest, but you still weren’t sure.  “ooh and bonus, I know how much guys love butts and boobs, so now you will sometimes be up close and personal with enourmous butts and boobs.” She said.  “Like look at this she said turning around and bending down so her gargantuan butt was over you.  “Wow” you said/ That cheered you up.  “Okay, I guess I might be able to live with being small.” You said, also you didn’t really have a choice, and Jessica was so cute you couldn’t stay mad at her.  “Yaaay” Jessica said, picking you up, and pushing you against her bosom, as a type of hug.  “Hey girls, get down here I’ve got something to show you!” she said excitedly.  The girls made their way towards Jessica.  “What is it?” Amy asked.   “Come here, I’ve got something to show you.” She said. They all circled around Jessica, and then she showed you to them.  They all had confused looks on their faces,  “What is it?” Stacey asked,  “Wait is that a tiny Jim?”  Stacey asked.  “Yep, I shrunk him so we'd have enough room for my friend Chealsey to live here, She’ll be taking his room.”  Jessica said.  “He’s so cute can I hold him?”  Kim asked holding her hand out.  Jessica dropped you in her cupped hands. “Wait, so where will he be sleeping?”  Kim said.  “Hmmm I haven’t thought about that yet.” Jessica said.  You were being passed from girl to girl. “I want him in my room, we can do all sorts of things together.”  June said, smirking.  “No I want him, for special reasons.” Amy said, giggling.  “No he should room with me, I could use a workout buddy.”  Stacey said smirking. “I shrunk him he should be in my room., or maybe with Chealsey.”  Jessica said.  “He’d be fun to room with, I want him.”  Katie said.  “Now hold on, don’t I get a say in this?!” you yelled. The girls looked at you and then Katie said.  “Yeah Jim should pick.”  “Okay Jim you pick.” Jessica said, winking, and rubbing her butt.  <br>\r\n<br>\r\nYOU thought about your experiences with these girls so far, and pros and cons of each girl.<br>\r\n<br>\r\nAmy fun to hang out with, similar interests, very cute, but hasn’t spent a whole lot of time with you, and you’ve heard from the other girls she has gas, but that might not be true, however you went in the bathroom after her once and it smelt really bad.<br>\r\n<br>\r\nKatie kinda reserved, and mysterious, very pretty nothing bad to say about her, but nothing too good either, could go either way.<br>\r\n<br>\r\nJune, kinda tomboyish, fun to hang out with, but can be gross, has no problem burping or farting near me which is good and bad.<br>\r\n<br>\r\nStacey was hot, but exercising a lot, means sweating a lot, could be good to get more exercise, but could also be bad, she also like teasing you with her body, which at your size might get out of hand.<br>\r\n<br>\r\nJessica, besides the fact that she shrunk you she’s also been ditzy and clumsy, and oblivious, like when she sat on your phone and got it lodged in her buttcrack, and barely noticed.  <br>\r\n<br>\r\nChealsey, you didn’t even know her yet, but she convinced Jessica to shrink you, also there was this girl in highschool who picked on you and teased you a lot in highschool, who was also named Chealsey, so it might feel weird.  but pro you'd get your room for a little while<br>\r\n<br>\r\nI choose…<br>\r\n</span></div></div>",
            "created":1598232600,
            "id":2890315,
            "title":"One of your roommates"
        },
        "11111":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "Amy",
                "Katie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one will it be? Secret writer Katie? Or bad gas Amy?</span></div></span></div>",
            "created":1601333280,
            "id":2911837,
            "title":"Amy or Katie"
        },
        "112":{
            "author_id":"keffobbled",
            "author_name":"keffobbled",
            "choices":[
                "Cassidy",
                "Abby",
                "Samantha"
            ],
            "content":"<div class=\"\"><div> <span>You are the new student in school, having just moved from across the country. You’re name is David and you are 18 years old.<br>\r\n<br>\r\nSoon after moving, you made friends with Cassidy, the typical blonde, sexy popular girl and your new next door neighbor. She’s ditzy and oblivious to how rude she is, but has a great body, even considering how much junk she eats. She’s a cheerleader, has 2 gym classes and 1 swimming class, and wears the same blue crop top, basketball shorts, and hot pink sneakers every day. Her hair is curly, spiraling down to just above her waist, and her eyes are a deep blue, pairing nice with her light skin and blue outfit.<br>\r\n<br>\r\nDuring your first day at school, at lunch, you meet Abigail, the nerdy, artsy girl with a gross sense of humor. Abby wears small framed glasses and lets the bangs of her dark brown hair flow halfway down her forehead. She ties her hair into three braids that go just below her neck before stopping. Every day, she wears blue jeans and a sweatshirt, both of which fit snugly around her slightly plump ass, breasts, and stomach. She adorns long black boots with zippers on the side, with green paint splattered on them from art class. She also participates in the school’s Marching Band. <br>\r\n<br>\r\nAbigail introduces you to her friend Samantha. Samantha is short and thin, with light brown hair that grows straight down to the sides of her cheeks. Samantha wears large, circular glasses, a dress, and sweatpants, along with socks and sandals. Samantha is self-reserved, and gets easily embarrassed, which turns out to be quite a problem for her, since she gets gassy when she’s nervous. She doesn’t have any particularly specific or unique traits, but still is cute and funny if she decides to talk to you.<br>\r\n<br>\r\nWhile at school, you shrink while talking to...</span></div></div>",
            "created":1588400700,
            "id":2828630,
            "title":"Shrunken in High School"
        },
        "12":{
            "author_id":"joobjoob",
            "author_name":"JoobJoob",
            "choices":[
                "Home",
                "School(highshcool or college)",
                "Work",
                "Park",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>and now, where will you shrink?</span></div></span></div>",
            "created":1583487060,
            "id":2797301,
            "title":"1/2 inch"
        },
        "13":{
            "author_id":"joobjoob",
            "author_name":"JoobJoob",
            "choices":[
                "Home",
                "School(highshcool or college)",
                "Work",
                "Park",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>and now, where will you shrink?</span></div></span></div>",
            "created":1583487120,
            "id":2797302,
            "title":"2 inches"
        },
        "14":{
            "author_id":"joobjoob",
            "author_name":"JoobJoob",
            "choices":[
                "Home",
                "School(highshcool or college)",
                "Work",
                "Park",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>and now, where will you shrink?</span></div></span></div>",
            "created":1583487120,
            "id":2797303,
            "title":"1 foot"
        },
        "143":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Locker Rooms. Alot of sweaty women post workout.",
                "Workout Area. Alot of currently sweaty women.",
                "Yoga Session. Less sweat but alot of different poses."
            ],
            "content":"<div class=\"\"><div> <span>It was a day like any other to you. Waking up in the morning and heading off to work. You worked at a gym that frequently had gender-specific days, and today was the female one. Male workers were still allowed to come but all workers, in general, had been screened to make sure they wouldn't do something stupid. The thing is, they didn't think of the possibility of someone liking the smell of people working out, of all things, which is a category you fell under. You never told anyone but secretly relished in the smell of sweat that came off the female patrons as they worked out with you as a spotter. <br>\r\n<br>\r\nAnyway, back to the now. As you opened the door you were greeted by one of your co-workers at the front desk. She said hi, you said hi back, standard formalities. Before you went into the back however, you decided to use the washroom. You went into the stall and right before you closed the door you felt a sense of vertigo swing over you as your world spun. When the burst of nausea ceased, you noticed you had shrunk all the way to a foot, not even reaching most people's knees unless they were really short.<br>\r\n<br>\r\nYour first thought was to run out of the washroom, so run out you did. Thankfully it was women's only day so you didn't encounter any giants on your way out. When you got out a long pair of legs strode right in front of you. Right before you called out, the smell of sweat coming from her had you entranced. It wasn't like you were 2 inches tall, subject to die at the flick of a toe. Perhaps you could have some fun and not have to get someone's attention right away.<br>\r\n<br>\r\nWith this thought in mind, you headed to...</span></div></div>",
            "created":1585741200,
            "id":2811495,
            "title":"Working at the Gym."
        }
    },
    "info":{
        "author_id":"joobjoob",
        "author_name":"JoobJoob",
        "brief_description":"Shrunk down on accident, you are suddenly forced into situations that are very unpleasant.",
        "created":1583486580,
        "description":"<td align=\"left\" class=\"norm\">You don't know  why or how but you were shrunk. Now you have to survive, but everyone around you usually fails to notice you and you get stuck in unpleasant situations constantly.<br>\r\nExamples include, you are forced to endure feet, butts, and all sorts of things in between.<br>\r\n<br>\r\nThis 18+ story<br>\r\n<br>\r\nFeel free to add entries, but be aware if I deem them too short or not fitting, I may change them.<br>\r\n<br>\r\nThis is my first thing im making on writing.com so hopefully this will be fun :)<br>\r\n<br>\r\nRULES:<br>\r\nFemale giantess interactions only, the only male interactions allowed are minor, such as talking to someone, or carrying a tiny somewhere.<br>\r\n<br>\r\nBasically anything goes, however the main character is immortal and does not die, they flatten instead.(this can be subject to change if i <br>\r\ndeem your entry is a good end and the path went on for long enough.)<br>\r\n<br>\r\nI want each path to go on for a good amount before you try and add any ends, certain exceptions apply if I think it fits.<br>\r\n<br>\r\nHaving a willing tiny go through this stuff is allowed As well. The tiny doesn't have to hate it<br>\r\n<br>\r\nRules may be added later as I deem fit, and decide on more.<br>\r\n<br>\r\nI hope you enjoy :D</td>",
        "id":2215006,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1601333280,
        "modified":1601333280,
        "pretty_title":"Adventures when your tiny stink"
    }
}