{
    "chapters":{
        "1":{
            "author_id":"bulletin12",
            "author_name":"Bulletin",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">The snow was falling quietly from the pale sky covering the whole valley. Not even the light of dawn could help differentiate the sky from the ground. The only thing that could be seen clearly were the big dark rocks scattered all around and the silhouette of a man walking on the snow. He was moving at a slow pace, trying his best not to fall asleep and holding dearly on the backpack containing his few belongings. If you saw him face to face you would notice tiredness in his eyes, but if you were more thorough you would notice that this were the eyes of a man that had nothing else to lose… other than his life.<br>\r\n<br>\r\nHis name was Oswald and despite his 19 years of age he had lived through quite a lot. He could still clearly remember the day he left his family and home to pursue his dreams, the roads he walked day and night, the hotel room where he questioned his motivations, the restaurant where he met the people that could help him achieve his goals, the dark alleys where he escaped from bandits, his visit to the most beautiful city of the country and of course he could remember that fateful night were everything went to hell. He had lost everything, there was nothing for him to go back to and nothing to look forward. Life had beaten him, and he couldn’t get up, not from this. That’s why he was currently traveling to the nearest town in hopes of start a new life in a place where nobody knew him and where he could live the rest of his days in peace. The chances of getting there alive were slim but he didn’t care. He just wanted to get away from the past, from the memories, from the pain.<br>\r\n<br>\r\nHis destiny wasn’t too far away, he could still make it. Unfortunately, he encountered a great obstacle in the middle of his way. A steep hill covered with enormous rocks that extended from left to right and seemed to go on forever. His only option was to climb it and so he did. Carefully and steadily he climbed the hill, placing each step carefully and making sure to grab on the rocks with defined shapes or on their gaps. Thankfully the hill wasn’t too high so it wouldn’t take him long to reach the top. He didn’t know that in the next seconds his life would take an unexpected turn when he placed his left hand on a smooth black rock to steady himself. When he made his next movement, he was suddenly stopped by something that grabbed his arm. He realized with horror that his hand was fused with the rock he touched, and it seemed to slowly be absorbed by it. In a desperate attempt he started to pull his hand repeatedly out of the rock, but his efforts only managed to sink it deeper. In a matter of seconds the rock had already absorbed past his elbow and he started screaming when he felt something touching his arm on the other side, he thought he was going to lose his arm or worse, be absorbed completely by this damned rock. Through his desperation he didn’t notice the strange glowing symbols that were forming on the strange rock, these were growing and forming new patterns until the entire rock was glowing in a blue light. When Oswald finally noticed this, he made one last effort to free himself by pulling with all his strength. But the rock abruptly stopped glowing and revealing a white surface that used to be black and with this sign it finally released him. But Oswald didn’t register when this happened causing him to be propelled backward with the sudden release of force. Before he could realize what just happened he was at the edge of the small rock he was standing on, about to fall directly into the rocks at the bottom, he didn’t have to be a genius to know that at this height the fall would be lethal. And so, he was ready for the worst when something stopped his fall, he felt a tightening on his neck, he tilted his head to see what stopped his fall only to be shocked at seeing a black hand coming through the rock that trapped him seconds ago grabbing his scarf. He tried to process what was happening, but before he could think clearly, the pressure on his neck disappeared, the scarf came off his neck leaving him to fall to his death. <br>\r\n<br>\r\nOn the way down he saw all his life pass in front of his eyes in milliseconds, his triumphs and failures, the people he loved and the people he hated, the places he visited in his journey, the dreams he once had and failed to make reality. All of that converging to this moment, the end. Maybe it was for the best, after all, he wasn’t even sure if he could live a quiet life after everything that happened. It was time to leave his all problems behind and rest. He closed his eyes and waited for the impact that would finish everything. Three second passed… nothing, five seconds passed… still nothing. Something was wrong, he could still breathe, feel the chilling cold and his heart pounding wildly. Was he already dead? Then why he didn’t feel anything change? Was this how death worked? No, that can’t be. Something else happened. But what exactly?<br>\r\n<br>\r\nHe decided to open his eyes and what he saw took his breath away. He was floating mere centimeters from the ground. He slowly moved his hand to touch the ground and when that happened his body fell to the ground. Now he was freaking out, he started to back away until his back collided with a rock, he sat there panicked trying to make sense of what was happening to him. First it was that strange rock, then the hand that came out of it and that something that stopped his fall. But as much as he tried, he couldn’t make sense of any of this. He was convinced he had finally lost his mind. Until he heard something.<br>\r\n<br>\r\n“Master!?” Someone yelled with concern. “Are you alright!?”<br>\r\n<br>\r\nOswald remained in silence for a few seconds. A lot of questions were flooding his mind; “Who is this? Did they call him master? Could this person be…?”<br>\r\n<br>\r\nHe finally responded “H-hello? Who is there?”<br>\r\n<br>\r\nThe mysterious voice immediately responded “Wait a second, I’m coming down there”<br>\r\n<br>\r\n“Down there… that means” He tilted his head up but he didn’t spot anything else in the hill other than the usual snow and rocks. But suddenly he heard something near his position. He quickly looked around and he finally saw it, the stranger that was talking to him. <br>\r\n<br>\r\nIt was some kind of… dragon, standing mere meters away from him. It was naked, however, due to the anthros having internal genitals and female reptiles lacking breasts, he couldn’t identify their gender. Their body was of slim constitution, but with a well-defined musculature. They had digitigrade legs with three clawed toes on each foot and five clawed fingers on each hand. They had a long and pointy tail that swayed from side to side behind him. They had a pair of long black horns on their head, these were slightly bent on opposite directions. They lacked scales leaving their skin exposed, however their skin was smooth and shiny, like it was made of porcelain. While most of the body was a ebony black (including the claws and the horns) there were white patches here and there; the palms of their hands were white just like the soles of their feet, a great portion of the upper part of their body was white; starting by the lower jaw, following the front of the neck and going all the way down their until reaching the belly and the proximal part of the thighs was covered in white. Both of their eyes had cyan irises that glowed brightly. Something strange about his body was how uniform it was, there was no clear frontier between the flesh and the claws or the horns, it was like they were fused together forming a singular piece. However, the weirdest thing about them was the strange glowing mark on their forehead, it looked like a rose, for lack of a better word and just like their irises it glowed in a cyan color.</div></span></div></div>",
            "created":1584610860,
            "id":2803611,
            "title":"The beginning (Part 1/3)"
        },
        "11":{
            "author_id":"bulletin12",
            "author_name":"Bulletin",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">As much as he wanted to contemplate this weird looking dragon, reality called for his attention right at the moment he heard the dragon speak.<br>\r\n<br>\r\n“Master?” They asked.<br>\r\n<br>\r\n“Huh?” He answered in confusion once he came to his senses.<br>\r\n<br>\r\n“I said, I am so glad that you are ok” They said with a face that expressed concern while they approached him.<br>\r\n<br>\r\n“Oh, yeah that uh” The way this dragon’s voice sounded was so strange, he was hoping to identify their gender after hearing their voice, but it was indistinguishable from male and female. It also sounded quite young and now that they were getting closer, he could notice that they didn’t seem to be older than fifteen years old. He didn’t know how to approach the situation until, he saw the scarf they were carrying in his right arm, his scarf.  Something clicked in his mind. “Wait, you” He said in a cold voice, pointing a finger to them.<br>\r\n<br>\r\nThe dragon suddenly stopped, taken by surprise for the way Oswald addressed them. “You are responsible for this, aren’t you?” He said in an accusing tone while getting up. “Somehow you were in that weird rock; you grabbed my arm trapping me against my will and you made me fall to my death”<br>\r\n<br>\r\nThe dragon made a sharp gasp, bringing his hand to their mouth and taking a step back. “Master, I-I d-didn’t meant for this to happened” They said in a broken voice. “I just…”<br>\r\n<br>\r\n“Oh no, let me guess” He interrupted with anger building up inside him. “You are someone who happens to have magic of your own and you thought it would be a great idea to use such gift to pull pranks on people in the middle of nowhere. But this time your plan backfired when you were about to be responsible for homicide, am I right?”<br>\r\n<br>\r\n“No!” They yelled.<br>\r\n<br>\r\n“No wait, I get it. You think you are so special for having something not many have. And developed a superiority complex, believing you had the right to treat people like your personal entertainment doing petty things like scaring someone to death” He said almost in a mocking tone. “Is that way you go around naked?”<br>\r\n<br>\r\n“I swear none of that is the truth. I was just acting by instinct; I wasn’t conscious of what I was doing” They said getting on their knees and bringing their hands together in an apologetic gesture. Their face was the epitome of remorse “I never meant to cause you any harm, I swear!”<br>\r\n<br>\r\nBy this point Oswald couldn’t bring himself to keep putting pressure on the dragon. It seemed they truly were sorry for their actions. But he still had some questions he needed to be answered.<br>\r\n<br>\r\n“You stopped it, didn’t you? You stopped me from falling to my death” He said quietly.<br>\r\n<br>\r\nThe dragon slowly raised his head to look him in the eye. “Twice. The first time I failed to save you. The second one, I resorted to my powers” They said while wiping their tears off. “I’m so sorry”<br>\r\n<br>\r\nNow he was starting to feel bad. This person never meant any harm, they continuously showed concern for his wellbeing and even made it up to them by saving his life. And there he was assuming the worst of them.<br>\r\n<br>\r\n“H-hey, I… I’m sorry, I shouldn’t have assumed those things about you” He apologized sincerely.<br>\r\nThe dragon tilted their head. “No master, you had every right to be mad at me. I almost caused your death by accident. I don’t deserve forgiveness for that”<br>\r\n<br>\r\n“N-no I don’t think that justifies…” Suddenly he realized something. “Wait a minute, why do you keep calling me like that?” He asked<br>\r\n<br>\r\nThe once again tilted their head. “Call you like what?”<br>\r\n<br>\r\n“Master, you keep calling me master. Why?”<br>\r\n<br>\r\nThey seemed puzzled by the question. “Because you are my master?”<br>\r\n<br>\r\n“Uh… no, no I’m not your…” He couldn’t help but rub his temple. “Listen, I think we started with the wrong foot, so let me introduce myself” He pointed to himself with both hands. “My name is Oswald, what’s your…”<br>\r\n<br>\r\n“Oswald!” The dragon said loudly, interrupting him. “Os-wald, Oooswald, Ooouswaaald” They said his name in different pronunciations. Once they stopped, they drew a big smile on their face, revealing sharp fangs. “It’s a pleasure to meet you master Oswald” They said with a reverence.<br>\r\n<br>\r\nOswald for his part couldn’t help but feel uncomfortable for the way this dragon addressed him. “A pleasure to meet you too… Anyway. What’s your name?”<br>\r\n<br>\r\nWith that question the smile erased from their face. “Name?” They said bringing their hands together. “I don’t have a name; you still haven’t given me one”<br>\r\n<br>\r\nWith this answer Oswald remained in silence for a few seconds before answering. “You are the strangest guy I’ve ever meet; you know? <br>\r\n<br>\r\nThe dragon once again made a concerned expression. “W-what do you mean master?”<br>\r\n<br>\r\n“What do I mean? Where to even begin” He said looking to one side and then back to them. “To start, you have magic of your own, then you caused me too to fall to my death only to save seconds after, you keep calling me master for no reason and now you are telling me you don’t have a name” Then he gave them a quick look. “And that’s not to mention how weird you look. What kind of dragon are you?”<br>\r\n<br>\r\nNow the dragon seemed perplexed. “Master, I think you are very confused about what I am, and I cannot blame you. I just can’t expect that everyone to know about my existence”<br>\r\n<br>\r\n“Your existence? What do you mean? He asked.<br>\r\n<br>\r\n“Master, do you recognize this mark” The pointed with a finger to the symbol on their forehead.<br>\r\n<br>\r\nHe would be lying if he said he hadn’t seen that mark before, but he couldn’t remember what in meant. “More or less. I remember having seen it before but not what it meant”<br>\r\n<br>\r\n“Mmm” They were rubbing their muzzle. “Do you recognize the mark at the back of your left hand” They pointed to him with a finger.<br>\r\n<br>\r\n“Mark? I don’t have any mark at the back of my…” His words faltered when he realized that indeed he had a symbol at the back of his left hand. It looked very similar to the mark the dragon had on their forehead, with the difference that this one didn’t look like a rose but like a hydrangea with lines that resembled thin stems accompanied with petals that extended all across his forearm, as it were a tattoo, a tattoo that glowed in a cyan color. He couldn’t believe he hadn’t realized of the presence of this mark on his arm before. “It had been there the whole time! I didn’t either realized about the condition of my left sleeve, it is all teared apart! Am I really that blind?” He thought to himself. But the most shocking part about this revelation was that… he recognized this mark and what it meant. <br>\r\n<br>\r\nHis blood froze and a very uncomfortable feeling invaded his boy. Upon looking back at the dragon, he immediately backed away, holding his left hand. The fear was building in his heart.<br>\r\n<br>\r\n“Master?” Once again, they showed concern for him. “Are you ok”<br>\r\n<br>\r\nMany thoughts were flooding his mind as he came with an explanation about this, but all lead to one answer, one he couldn’t accept unless he confirmed his assumptions.<br>\r\n<br>\r\nHe looked at the dragon in front of him and asked. “Are you the Enori?”<br>\r\n<br>\r\nWith a very quiet voice the dragon answered “Yes”<br>\r\n<br>\r\nOswald’s entire world began to collapse in front this revelation. Like a lighting striking his head, everything came back to him. This strange dragon, their ambiguous gender, their powers, the way they addressed him as “master” the strange rock that trapped his arm, the mark in the dragon’s forehead and the other one in his left arm. It all made sense now, he finally remembered all he learned in he learned in school and in books about this creature. The rock they were hiding in wasn’t such thing, it was a capsule, containing their inert body and this thing wasn’t a dragon, it was something far more unique and so much more special. It was the Enori. The first lifeform to have ever existed in the world, who possessed the greatest power in the galaxy. And as the first lifeform to have ever existed in the world they didn’t have a specified gender and any resemblance to dragons was pure coincidence. Actually, it would be more accurate to say the dragons looked like them. He couldn’t let their appearance fool him, in just a blink of an eye this creature could become an enormous titan that could stomp entire countries with just a couple of steps, shot lasers from their eyes that could destroy entire planets, create empty dimensions, control the minds of anyone, cure any illness, move anything with their mind and more, so much more. However, this creature couldn’t live nor desire on their own. Due to the great amount of power contained in their soul, it kind of messed with its stability forcing it to remain uncomplete and because they were a being who always had so much power nothing ever challenged them, they never had to make an effort accomplish anything and thus the never developed a desire of their own. That’s why they needed someone else to give them the rest of the soul they lacked and the desire to move their actions towards some purpose. In short, someone who would become their master. Without one the Enori would simply remain in a vegetative state inside their capsule, waiting for someone to free them from their prison. </div></span></div></div>",
            "created":1584611880,
            "id":2803612,
            "title":"The Beginning (Part 2/3)"
        },
        "111":{
            "author_id":"bulletin12",
            "author_name":"Bulletin",
            "choices":[
                "A Peaceful Life",
                "A Better Future for The World",
                "More Paths"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">A spiritual connection was required, this process was know as the “Intertwining of Souls”, it was very simple, someone just had to make contact with the capsule the Enori were trapped in, once this happened, both of their souls would intertwine completing the soul of the Enori, waking them from their vegetative state and break free from their prison and their master of the would receive the mark who identified them as such. The Enori would inevitably see the person who liberated them as their “master” whom they would dedicate their devotion and whom they considered the only person in the world who could give them a purpose by serving them. This process was automatic and involuntary, it does not discriminate, which meant, anyone could become their master and probably could happen accidentally. It was not surprise that a lot of people through history had become the master of the Enori, be either intentionally or unintentionally. With the Enori at their service many used them for their selfish goals, others tried to make the world a better place, others caused unbelievable amounts of chaos and destruction around the world, others became kings or queens destined to lead their empire to glory, others simply tried to live peaceful lives and others rejected them leaving them in their vegetative state. Many believed that it was a cruel to control the life of such majestic creature just to satisfy the desires of mortals, but what this people failed realize was that it was in their nature to serve their masters, it was how they worked, it gave them purpose and it made them happy. Wouldn’t it be cruel to deny them that happiness? Of course, it was up to debate.<br>\r\n<br>\r\nNow, he was the next to receive the mark, the new master of the Enori. He could barely believe it. To think that such powerful entity would want him to be their master. It was just so… absurd.<br>\r\n<br>\r\n“MASTER!!” The Enori screamed and shook him repeatedly.<br>\r\n<br>\r\n“Uh, what?” He said as he regained his consciousness. “What happened?”<br>\r\n<br>\r\n“You were paralyzed the whole time!!” They said alarmed. “I tried to call your attention, but you wouldn’t respond”<br>\r\n<br>\r\nIt seemed that the epiphany he was having had completely disconnected him from reality.<br>\r\n<br>\r\n“Oh, yeah, I... I’m sorry to have worried you, It’s just…” He tried to get his thoughts in order, before looking at them in the eye. “You truly are the Enori… and I’m your… Oh gods” He slowly seated on the cold ground, still trying to probe if this was not a wild dream he was having.<br>\r\n<br>\r\n“Master, I’m so sorry, all of this is my fault” They said while they crouched to see him in the eye, both hands on their shoulders. “I should have tried to explain everything to you from the very beginning”<br>\r\n<br>\r\nOswald had his head down grabbing his head with both hands. “Never in my life I thought I would be in this situation, not even on my wildest fantasies. That I would ever find the Enori, the most powerful and ancient creature of the world and intertwine my soul with theirs. But here I am” He brought his hands down and just rubbed his fingers. “Out of all the people on the world I had to do it. It just seems so impossible, so surreal”<br>\r\n<br>\r\nHe suddenly felt something covering his neck. He realized it was his scarf covering his neck once again. He looked up to see the Enori’s face. This time it showed an understanding expression, it radiated a warmth he had almost forgotten.<br>\r\n“This is real. You are my master and I couldn’t be happier about it” They kneeled, getting closer to Oswald. “I don’t know how much it will take for you to feel comfortable with me, but I’m sure we will find a way and in time we will form a meaningful connection” Out of nowhere they gave him a hug. Oswald was taken by surprise by this, despite the chilling cold, he could feel the unnatural warmth that radiated the Enori’s body, it felt… good. “I will always be by your side and you can count on me whenever you need it. This day shall be remembered as the beginning of something great” The got closer to his ear and whispered: “It is truly my pleasure to meet you, master Oswald”<br>\r\n<br>\r\nA sensation emerged from the bottom of Oswald’s heart. It had something to do with his current situation and the Enori he just bonded with. Even though he couldn’t think that clearly right now, he was sure of what he was feeling. With the new relationship he had with the Enori he could only think of…<br>\r\n<br>\r\n<b>A peaceful life (Can I still live a normal life with the company of the Enori?)</b>: Oswald had enough of great ambitions, he just wanted to have a peaceful life, away from the problems of the past. But now it seemed that the Enori had become a part of his life. Can he still live a normal life despite all of this?<br>\r\n<br>\r\n<b>A better future for the world (With the Enori by my side I can make the world a better place, for everyone)</b>: Oswald always knew the world wasn’t perfect, but after experiencing its dark side he knew that everything could change for the better if someone had the power to do so. And now he had the opportunity to bring some light into the world.<br>\r\n</div><br>\r\n</span></div></div>",
            "created":1584612360,
            "id":2803617,
            "title":"The Beginning (Part 3/3)"
        },
        "1111":{
            "author_id":"blitz2",
            "author_name":"Helpinghand23 ",
            "choices":[
                "He spots someone ",
                "Everyone asleep ",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Regardless he decided to continue on his path now with Enori by his side he deduced that he wants to live a normal life. As he goes toward the town.</span></div></span></div>",
            "created":1586240460,
            "id":2814724,
            "title":"A Peaceful Life"
        },
        "11111":{
            "author_id":"blitz2",
            "author_name":"Helpinghand23 ",
            "choices":[
                "An women ",
                "A man"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who do you spot</span></div></span></div>",
            "created":1586240580,
            "id":2814726,
            "title":"He spots someone "
        },
        "1113":{
            "author_id":"bulletin12",
            "author_name":"Bulletin",
            "choices":[
                "Thirst for Power",
                "Art Dream",
                "More Paths"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\"><b>Thirst for Power (With the Enori’s power I can conquer the world!)</b>: The resent Oswald had for how the world treated him was immense. He had great ambitions to be in positions of power, but the world didn’t even give him a chance. People insulted him, ridiculed him, hurt him to the point of losing his noble intentions. At the end he was left with nothing, nobody expected him to rise from his misery. But nobody would have also thought that he would bound with the Enori. Now the world had what was coming to them. Who would oppose him know?<br>\r\n<br>\r\n<b>Art Dream (The Enori can help me become the artist I always wanted to be)</b>: Oswald always dreamed to be a successful artist, being able to get his work to be recognized and serve as an inspiration to others. But unfortunately, people weren’t very interested in his vision. Nobody wanted to support his work and the few help he received was for selfish reasons. When he went bankrupt, he knew he had to abandon his dream and move to a place where he could live a simple life with the only consolation that he coud still make art for himself. But now with the Enori he had a second chance to make his dreams a reality. And who knows, maybe the Enori would end up loving the world of the arts.</div><br>\r\n</span></div></div>",
            "created":1584612660,
            "id":2803622,
            "title":"More Paths"
        },
        "11132":{
            "author_id":"bulletin12",
            "author_name":"Bulletin",
            "choices":[
                "Visual Artist",
                "Musician",
                "Other Options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of artist is Oswald?</span></div></span></div>",
            "created":1584632160,
            "id":2803708,
            "title":"Art Dream"
        },
        "111323":{
            "author_id":"bulletin12",
            "author_name":"Bulletin",
            "choices":[
                "Actor",
                "Dancer",
                "Other Options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1584632460,
            "id":2803710,
            "title":"Other Options"
        },
        "11133":{
            "author_id":"bulletin12",
            "author_name":"Bulletin",
            "choices":[
                "The Roulette of Fortune",
                "Adventurer's Soul",
                "More Paths"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\"><b>The Roulette of Fortune (With the help of this Enori I can become the richest person in the world!)</b>: Oswald started his journey in hopes to become some influential and millionaire. With hundred of luxuries at his reach. But life slapped him with the hard truth of reality. After bad inversions, terrible loses at gambling and bad luck in general he lost everything he had. He couldn’t do nothing more than tried to live a modest life far away. Until he accidentally bonded with the Enori. Now he had a chance to recover from his loses and gain so much more. This had to be the luckiest day of his life. What else could it be!?<br>\r\n<br>\r\n<b>Adventurer’s Soul (With the Enori as my loyal companion I can travel around the world, go wherever I want, meet whoever I want, and no one would be able to stop me)</b>: Oswald had always been a free spirit, he went wherever the wind took him and his thirst for adventure was insatiable. But all good things came to an end when he was left for death by the people he trusted. He barely made it out alive and the experience really took a toll on him. He preferred the tranquility of a peaceful life than the many risks that came with a life of adventure. But now that he had a loyal companion by his side that could protect him against the dangers of the world, nothing could stop him now.</div></span></div></div>",
            "created":1584612840,
            "id":2803628,
            "title":"More Paths"
        },
        "111333":{
            "author_id":"bulletin12",
            "author_name":"Bulletin",
            "choices":[
                "Revenge",
                "Rejection",
                "Even more paths!"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\"><b>Revenge (Before I didn’t have a chance, but now with the Enori by my side I can get revenge on the people who ruined my life!)</b>: Oswald hoped to achieve his goals but he couldn’t do it alone. He needed the help of people with the resources to make his dreams a reality. Fortunately, he found the help he needed with people who shared his vision. They had the power, the money, the influence to help him. He shared his projects with them and his plans to make them work. For a time, all was going great, in wouldn’t take long for the project to come to fruition. But what he didn’t realize was that these people didn’t care about him, they only cared about his ideas and once they had everything, they wanted from him the decided to dispose of him. The took everything from him, everything except his miserable life. Betrayed by the people he thought were his friends he moved on. He decided to live a life away from people who could hurt him again. The hatred was still prevalent in his heart, but there was nothing he could do about it. Until now.<br>\r\n<br>\r\n<b>Rejection (no, no, no, no, No, NO, NO!!! I’m not your master! You are not my servant, companion, squire, whatever!!)</b>: Oswald never asked for this. He just wanted to leave a peaceful life. But now that the Enori was in his life it would no longer be possible. He didn’t want them on his life. They had to reject the Enori’s offer, hopefully they would understand and leave him alone.<br>\r\n</div></span></div></div>",
            "created":1584613080,
            "id":2803630,
            "title":"More Paths"
        }
    },
    "info":{
        "author_id":"bulletin12",
        "author_name":"Bulletin",
        "brief_description":"What would someone do when the most powerful being of the world is at their service?",
        "created":1584609000,
        "description":"<td align=\"left\" class=\"norm\"><div align=\"justify\">This story takes place in a magical world called Endos in the late stage of an industrial age, were humanity coexist with all kinds of anthropomorphic creatures (from cats and dogs to dragons and griffons). And our human protagonist, Oswald, happens to accidentally form a spiritual connection with the most powerful being of the world, the Enori, a creature that can only live by intertwining souls with another sapient being who becomes their master to whom they offer their servitude and swears their relentless loyalty and unconditional love. By forming this master/servant relationship with the Enori, Oswald must now deal living with the only creature that has the power to destroy planets. What kind of relationship will he develop with the Enori? How will he guide their power? Will he try to make the world a better place, will he try to conquer it, or will he simply try to live a normal life with his strange companion? The decision is yours.<br>\r\n<br>\r\nBefore starting with this story there are some things that are relevant to know.<br>\r\n<br>\r\n<b>How does magic work in this world?<br>\r\n</b><br>\r\nMagic works in the form of magical items. In this case magic crystals called Nubal that grows from trees and works by applying pressure on them. There exist a wild variety of them and each has their uses; like electric crystals that can be used to power machinery, incendiary crystals to create lighters or flamethrowers, ice crystals to refrigerate, healing crystals to cure wounds, antigravitational crystals to create flying ships, etc. Anyone can use them and cultivate them for their own needs, but if they are studied properly, they can be exploited to their true potential.<br>\r\n<br>\r\nHowever, there does exist exceptional individuals who have magic of their own. They are a minority in the world, which also makes them very famous.<br>\r\n<br>\r\n<b>What is the setting of this world?<br>\r\n</b><br>\r\nThis is a magic world occurring in the last stage of the industrial age. So, expect things like railroads, boats and dirigibles energized by nubal crystals, phone booths, guns with all kind kinds of ammo, etc.<br>\r\n<br>\r\n<b>Something to know about anthros in this world?<br>\r\n</b><br>\r\n-Yes, female reptiles don’t have breasts for obvious reasons.<br>\r\n<br>\r\n-All anthros have internal genitalia. So not a huge deal if one for some reason appears naked.<br>\r\n<br>\r\n-Any anthros that have wings (birds, birds, dragons, griffons, etc.), they have them on their back leaving both of their arms free. And they can fly with them, but logically this would also mean that they can’t fit through narrow spaces and can’t be very agile considering the huge appendages on their back limiting their movements. There are also some dragons who don’t have wings.<br>\r\n<br>\r\n-Dragons can’t breathe fire<br>\r\n<br>\r\n<b>What is the Enori?<br>\r\n</b><br>\r\nIt’s an immortal genderless creature that is as old as the world itself and possess a great and ancient power that cannot be compared to any others. However, their life depends in the spiritual connection they form with a sapient being who, in their own words, becomes their master and to whom they dedicate their life to serve and fulfill its wishes. The reason behind this behavior can be explained by 2 principles:<br>\r\n<br>\r\n1)\tIncomplete Soul: The soul is the force of life; all are equal and anything that lacks it cannot be considered alive. However, the Enori presents an anomaly in this regard. Their soul is missing its other half, a direct consequence of so much power contained in just one soul, messing with its stability. For this reason, the Enori cannot live by itself, they must intertwine their soul with another sapient creature that will provide them with the part of their soul they lack. This leads to the next principle.<br>\r\n<br>\r\n2)\tPurpose: Once the Enori stablishes a connection, they cannot help but to feel devotion for the person responsible for bringing them life. They recognize their master as the only one that can give them a purpose and thus the only one they listen to.<br>\r\nWhat happens when the Enori does not have a master?<br>\r\n<br>\r\nIf they do not possess a spiritual connection, then they remain in a vegetative state inside an indestructible capsule (not very different from an egg) waiting for someone to touch the surface of their prison and start an intertwining of souls. This process is automatic and involuntary, which can lead to accidents.<br>\r\n<br>\r\n<b>How do they look like?<br>\r\n</b><br>\r\nStrangely, they look like an anthropomorphic dragon with some noticeable differences. They do not have wings and neither scales, instead their skin has the texture property of porcelain. Their skin is black and white, and its patterns changes each time they come back to life, just like the shape of their two medium sized horns. They have digitigrade legs with three toes on each foot and five fingers on each hand. The have a long and pointy tail. Their claws and horns are fused with their skin making their body look very uniform. Their iris is a cyan color that glows brightly. The interior of their body is also cyan colored that glows. In their forehead the have a mark that looks like a rose that just like their eyes is colored cyan and glows. And due to their genderless nature, they don’t have genitals.<br>\r\n<br>\r\n<b>What is their personality?<br>\r\n</b><br>\r\nTheir personality varies a lot depending on the person they intertwine souls with and the relationship they develop with them<br>\r\n<br>\r\n<b>What is their general behavior?<br>\r\n</b><br>\r\nThey tend to be very affectionate and a bit overprotective with their master. They are always ready to serve them in any way possible. Unfortunately, they are not willing to leave their master alone nor respect their privacy for the fear of something happening to them while they are not by their side.<br>\r\n<br>\r\nThey are docile when interacting with other people but are always prepared in case they have something against their master.<br>\r\n<br>\r\nThey get immediately triggered when their master is being threatened or attacked and will proceed to neutralize the threat by any means necessary. The only thing that can stop them from using lethal force against the enemy is their master.<br>\r\n<br>\r\n<b>What can they do with their powers?<br>\r\n</b><br>\r\nThey can do almost anything. The variety of their powers is immense.<br>\r\n<br>\r\n<b>What can’t they do?<br>\r\n</b><br>\r\n-They don’t have any power that might break the continuity of time and space (time travel, jump to other dimensions, rewrite history, etc.)<br>\r\n<br>\r\n-Resurrect the dead<br>\r\n<br>\r\n-They can’t grant immortality other than through longevity<br>\r\n<br>\r\n<b>What do they utterly refuse to do?<br>\r\n</b><br>\r\n-Destroy the world they and their master were born<br>\r\n<br>\r\n-Abandon their master<br>\r\n<br>\r\n-Hurt their master<br>\r\n<br>\r\n-Obey an order that might bring harm to their master<br>\r\n<br>\r\n<b>Can they die?<br>\r\n</b><br>\r\nNo. They can only be put in suspension and that only happens if their master die. Other than that, they are indestructible.<br>\r\nWhat happens if their master dies?<br>\r\n<br>\r\nIn the incredible case the Enori fails to protect their master from death, they will immediately lose their spiritual connection, return to their vegetative state and teleport randomly to another part of the world. They will lose all memories of their deceased master, only keeping basic knowledge of the world, their communication skills and their desire for a master.<br>\r\n<br>\r\n<b>Can the Enori grant immortality to their master?<br>\r\n</b><br>\r\nYes, but only the longevity type and this depends on their master decision.<br>\r\n<br>\r\n<b>What happens if someone refuses to be the Enori’s master?<br>\r\n</b><br>\r\nThe Enori will desperately try to prove to their master they are worth keeping around. If their master keeps rejecting them, they’ll become more anxious and their spiritual bond will weaken. This process can last for months until the Enori finally comes to the conclusion their master does not want them in any way possible and with this realization their spiritual bond will be severed permanently, causing the Enori to go back to their vegetative state and to randomly teleport to another part of the world.<br>\r\n<br>\r\n<b>Rules:<br>\r\n</b><br>\r\n-This story is narrated in third person. Thank you.<br>\r\n<br>\r\n-As you can already tell from the description, the protagonist already has a predeterminate gender and name. But you are free to determinate his personality considering his ambiguous background. This is to avoid the creation of many characters that may end up not having a story developed.<br>\r\n<br>\r\n-The protagonist can die. Keep in mind that this is a huge deal because this would bring the storyline to an end. I don’t recommend doing this unless the story has enough development to be finished in a satisfactory manner and benefits the storyline in general.<br>\r\n<br>\r\n-Try to be consistent with the writing.<br>\r\n<br>\r\n-Please respect the 13+ rating. Sex, drugs or alcohol can only be implied. Violence can be shown at moderate levels.<br>\r\n</div></td>",
        "id":2216257,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1586240580,
        "modified":1586240580,
        "pretty_title":"Bound by Soul"
    }
}