{
    "chapters":{
        "1":{
            "choices":[
                "She meets a friend on the road.",
                "She encounters a odd-behaving stranger.",
                "She makes it to the town and sets up her cart."
            ],
            "content":"<div class=\"\"><div> <span>Rose opened her bright green eyes to the world in the face of the early morning sun. She got up, per usual, and walked outside to her favorite place in the world, the garden of roses. Something seemed right about this place: the warm wind calmed her thoughts, and the scent of roses permeated the air, filling her with an overwhelming feeling of joy. <br>\r\n<br>\r\nIt was dying day; the day on which every month Rose would hide who she really was through the use of black berry extract her mother made from the berries that came from the same wondrous garden that made her so happy. The name held a duel significance, for actual dye was used, and every time she had to disguise herself, a little bit of her individuality passed away inside. <br>\r\n<br>\r\n\"Rose!\" her mother, Ana, shouted from the window, \"Come in and let us begin.\"<br>\r\n<br>\r\nRose went in and sat by the tub of water, and Ana poured the pitch black sludge over her daughter's long flowing hair. When all of her hair was covered, Ana meticulously dried her it, ensuring that all streaks of red were dutifully covered over. <br>\r\n<br>\r\n\"I need you to go to the market today, my dear,\" Ana said, smiling at her beautiful adopted daughter, \"Our cloth is selling wonderfully, and there is only a small amount left. I must go visit my sister in her town, Uppsala.\"<br>\r\n<br>\r\n\"Oh, I see. You're getting rid of me for the day. We both know that your sister hates me. She's the only one that really knows my secret.\"<br>\r\n<br>\r\n\"Well, you always have been able to see right through me,\" Ana sighed. <br>\r\n<br>\r\n\"Don't worry, mother. I'll go, and hopefully I'll be able to sell the rest of our remaining cloth today,\" Rose tried to comfort her mother the best she could. <br>\r\n<br>\r\nThey kissed goodbye, and Rose gathered the things on their old rickety cart to take it into the main part of the town. She set off down the worn path. </span></div></div>",
            "created":1321051860,
            "id":1221532,
            "title":"The Beginning of the End"
        },
        "11":{
            "author_id":"vivianalee",
            "author_name":"..LetMeThink..",
            "choices":[
                "A stranger approaches the cart",
                "A palace guardsmen approaches the cart",
                "A young lord approaches the cart",
                "A fight breaks loose in the market"
            ],
            "content":"<div class=\"\"><div> <span>Rose carefully tied the scarf around her chin and checked the ropes to ensure the cart didn't spill it's contents on the way one last time. Despite the heat she wore a scarf on her head to protect it from the brutal sun; dye was especially sensitive on dying day and caused her hair to take on a greasy, crust-like matting on her forehead. Still, she wore it often to ensure that the color didn't fade. She and her mother learned that the hard way when she was much younger and much more a tomboy, and much more gray. <br>\r\n<br>\r\nWith a wrinkling of her nose- she hated the smell of black berries and her hair still stank of it -she hauled the cart over her home's raised threshold (to keep good luck in and bad luck out) and started on her way. <br>\r\n<br>\r\nThe roads weren't especially crowded today, what with it being so hot and windy on a Thursday, which was slow anyway. She was making good time when a shout from behind halted her in her tracks. <br>\r\n\"Rose!\" Karigan shouted, \"Rose wait up!\" <br>\r\n<br>\r\nThe girl stopped by her cart panting, some of her blonde hair falling out of it's tight bun. Karigan was an upper middle class girl (in Rose's eyes, at least. There was no Official middle class) and the daughter of the best and cheapest tailors in the area. Still, the girl, a year younger than Rose, about sixteen, dressed modesty and held herself more proudly than any Lady Rose had seen. She often flattered Rose by saying she learned her poise from watching her for years.<br>\r\n<br>\r\n\"What are you doing in this blasted heat? And on such a slow day?\" Karigan asked.<br>\r\n<br>\r\nRose smiled. \"I'm selling the last of mother's cloth. It's been making good rounds so we thought we'd bring it out for another day.\"<br>\r\n<br>\r\n\"We?\" Karigan said, making a show looking around them, \"Has she dyed herself to match the scenery, your mother?\"<br>\r\n<br>\r\nRose almost flinched at the word dyed, but forced a smile. \"No, she's visiting her sister; Aunt Mari.\"<br>\r\n<br>\r\n\"The one that hates you?\"<br>\r\n<br>\r\n\"Precisely.\"<br>\r\n<br>\r\nKarigan nodded sympathetically and began walking with her, leaning her head back to look at the swift clouds.<br>\r\n\"What are you doing out?\" Rose asked.<br>\r\n<br>\r\n\"Getting some flour, butter and peaches for mother. A rich client is coming tomorrow and she wants to make sweets to impress him,\" she glanced at Rose with a raised eyebrow, \"He's young.\"<br>\r\n<br>\r\n\"Ah, I see,\" said Rose. <br>\r\n<br>\r\nKarigan's mother was itching to marry her off to some rich suitor, calling her daughter Lady from a young age. Her father, on the other hand, could wait more than a few years to see his only child go and deeply interrogated every man that so much as glanced at her. \"I must be sure you will be in good hands,\" the man woulds say scruffily and declare every gentleman swine.<br>\r\n<br>\r\nThe girls chatted about each other's problems, agreeing sympathetically and laughing at rude comments like best friends did in private company and before they knew it they had reached the town. Karigan helped Rose set up the cart and promised to return after she ran her errands to talk some more and skipped away, literally. <br>\r\n<br>\r\nRose sat back and loosened her scarf in the shade, grateful for the wind and took the quiet time to organize her ever busy thoughts.</span></div></div>",
            "created":1321159560,
            "id":1222271,
            "title":"She meets a friend on the road."
        },
        "114":{
            "author_id":"vivianalee",
            "author_name":"..LetMeThink..",
            "choices":[
                "Falls in a puddle/Cart splashes her",
                "Hair color runs out and down her face",
                "Stranger sees her and offers help/scarf"
            ],
            "content":"<div class=\"\"><div> <span>Rose was sitting at the cart baking in the sun for a sum of uneventful minutes. Although the wind was strong it was hot, but promised shade soon with rolling clouds, still Rose was tempted to fan herself in the stuffy corner of the market. <br>\r\nKarigan had left her sight about fifteen minutes ago, leaving her to stare at other bored venders and their children who glanced back at her with glazed expression. Most had spots in the shade and were making good business, Those were the regulars with food and other necessary products that lived close enough to make more than weekly or biweekly trips to the market, they also had the sense to get there ealier enough to get a good spot. Even the haberdasher looked cozy for goodness sake! Not for the first time that day, Rose cursed her hair dye and sat back with a pout, glaring at a high up window.<br>\r\nAs she watched it, the window's curtain twitched to the side and a small, pink face appeared in the crack. The small face lead a dirty head into the open, soon followed by a scraggily dressed boy and his brown and white kitten. The boy picked his way across the roof and poked his head over the side to stare down at the fruit vendor with slightly old apples. <br>\r\nThe boy reached down his hand and the kitten quickly scurried down it, speared an apple behind the man's back with tiny claws as it dug it's nails into the boy's sleeve. The boy winced but didn't falter, grabbing the kitten's tail with the other hand and hauling both arms back onto the roof, kitten and all. Rose laughed at the site, admiring such teamwork and stealth from ones so young. The boy bit out of the apple and gave the piece to the kitten who nawed on it gratefully, but the juice cause the fruit to slip from his dirty hand and fell back to the vendor, landing at the feet of a young, lowerclass man. <br>\r\n\"Hey!\" the vendor yelled. \"What do ye think your doin? Stealin from me, eh boy?!\" <br>\r\n\"Pardon?\" the man replied, aghast. <br>\r\nThe vendor pointed to the apple at their feet. \"Think ye sly, do ye? We don't appreciate havin a thieve in our mists, do we Horris?\" the vendor directed the last bit to another large vendor, a grubby man that sold over-ripe fish.<br>\r\nThen man took a step back as the larger men approached him, Rose sat up in her seat, ready to pack and flee if things turned bad.<br>\r\n\"How could I have possibly taken that?\" the young man said prouldy, surprising Rose with his fine speech and accent, \"it has a bite out of it and I've been standing in front of you all the while.\" <br>\r\n\"Don't use some fancy logic on me boy, I trust me eyes, not pretty words yu scholar's done spout. Now pay up, and interest for trying to thieve me!\"<br>\r\nThe young man took another step back, reached into his pouch, then turned and ran. Right into Rose and her cart.<br>\r\nThe two tumbled to the ground as the vendors roared with laughter behind him. <br>\r\n\"Serves ye right boy, hope ye get a splinter!\" the larger one, the fish vendor, shouted. <br>\r\nThe man stood and spat at their feet, causing them to rile up again. Before he could think, the boy turned and tripped over Rose and her destroyed wears. He scrampled to his feet, falling into Rose further and ripping the scarf off her head. She cried out and he seemed to notice her for the first time. He started to apologize and pull her to her feet, but was snatched up by one of the large men. <br>\r\nThey hauled him to the end of the street and threw him to the ground  where he scrambled unceremoniously to his feet and started down the road, Rose's scarf still attached to his belt where it had snagged. <br>\r\nRose sighed at the bad luck and got to her feet, dusting herself off and testing for sore spots. Just as she had gathered all of the cloth into her arms, not an easy bundle to carry, the rain started. She hadn't even noticed the clouds roll in and cursed her misfortune. Before leaving, she dropped the cloth onto the pile of mud and wood, ruined already by the rain she knew someone would have better use for it, like the boy and his kitten. Rose was now concentrating on getting home before the dye ran out of her hair in the rain.</span></div></div>",
            "created":1321295520,
            "id":1223083,
            "title":"A fight breaks loose in the market"
        },
        "1143":{
            "choices":[
                "The stranger asks to speak with her again.",
                "Rose leaves the stranger to survey what had happened to her hair.",
                "The stranger dallies at the gate, continuing the conversation."
            ],
            "content":"<div class=\"\"><div> <span>Rose ran down the road as fast as she could, fearing that her secret would be shown gleaming to the rest of the world. Before long, she flew past the stranger that held the fault of her misfortune that afternoon.<br>\r\n<br>\r\n\"Miss, wait! I believe I have something of yours!\" Rose could hear his light footsteps behind her as he got closer and closer. She tried desperately to outrun him, but he obviously was much faster than she. Finally, he overtook her and planted himself in front of her, blocking the road ahead. \"Greetings, lady, I must express my sincere apology for crashing into you earlier. You see, I just can't abide by being falsely accused of a crime I did not commit, no matter how petty.\"<br>\r\n<br>\r\n\"Yes, well, it did not seriously hurt me, except for a few bumps and bruises. My biggest loss was of my cloth and my cart. My mother will be greatly unhappy that I lost them. If you excuse me, I really must be getting back to her.\"<br>\r\n<br>\r\nThe stranger, however, did not seem interested in letting her pass by. \"This would probably be yours, correct?\"<br>\r\n<br>\r\nHe held out Rose's scarf, which she snatched out of his hands. With one quick motion, she pulled her hair up and into the scarf, hiding the dripping mass from view. Now relieved of the fear of being found out, she looked at the stranger carefully for the first time. He was a tall, strapping young man, one who was muscular without being overbearing. His hair was a dark brown, almost to the point of ebony, and there was a strip of light freckles that stretched across the bridge of his nose. The most notable aspect about his appearance, however, were his striking green eyes that seemed to reflect what little light there was out in the rainstorm. This man was most definitely not unattractive. <br>\r\n<br>\r\n\"Yes, thank you, sir. I'm Rose, by the way.\"<br>\r\n<br>\r\n\"Hello Rose. I do like that name. Roses are my favorite flower, you know.\"<br>\r\n<br>\r\n\"Mine too. We have a whole garden of them at home. But you haven't mentioned your name, sir.\"<br>\r\n<br>\r\n\"Oh, of course! My name is Thomas, a pleasure to make your acquaintance.\"<br>\r\n<br>\r\n\"And yours as well.\"<br>\r\n<br>\r\nBy this time, they had reached the gate surrounding the rose garden, and.... </span></div></div>",
            "created":1321308240,
            "id":1223158,
            "title":"Stranger sees her and offers help/scarf"
        },
        "11431":{
            "author_id":"vivianalee",
            "author_name":"..LetMeThink..",
            "choices":[
                "Thomas calls on her later that night (before Rose's hair is re-dyed)",
                "Thomas calls on her the next morning and her father finds him untrustworthy"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I can make it up to you, the loss of your trade I mean. I really am terribly sorry that I caused your misfortune,\" said Thomas.<br>\r\n<br>\r\n\"Oh, well..thank you. That would be incredible, but it was expensive cloth. Hard to replace and too much to pay for; fifty pents worth to say the least,\" Rose said.<br>\r\nThomas gazed thoughtfully over her gate and into the garden. As they watched Rose's mother appeared and saw them standing there, she was obviously alarmed by the sudden rain and no doubt a stranger at her threshold with her only child did not help matters. The short woman quickly made her way to them.<br>\r\n<br>\r\n\"I will make it up to you somehow,\" Thomas said, looking back at Rose with luscious eyes, \"I swear.\"<br>\r\n<br>\r\nRose opened her mouth to respond but could manage no words, all she could do was stare stupidly at him and blush.<br>\r\n<br>\r\n\"What do ye want?\" her mother's harsh voice pulled Rose back to herself.<br>\r\n<br>\r\n\"Mother, this is Thomas. He's walked me home, that's all,\" Rose said with a slight bow of respect.<br>\r\n<br>\r\nThomas dipped into a lower bow himself and Rose flushed again; it was the bow of a young man looking to court. Her mother didn't miss it, of course, and flushed herself.<br>\r\n<br>\r\n\"You daughter fails to mention, ever so kindly, that I also brought her some misfortune in the market this evening. I would like to formally apologize,\" Thomas said.<br>\r\n<br>\r\n\"Misfortune?\"<br>\r\n<br>\r\n\"Aiy. I was caught up in a bit of misunderstood trouble and two men attempted to wrestle with me. I landed on your cart and, it seems, ruined some of your family's precious cloth and knocked Rose to the ground. I do believe we have made amends, but, again, i do apologize and wish to make it up to you.\"<br>\r\n<br>\r\nAna glanced uneasily between the two, unsure of what to say or do. Rose had never recieved a call from a suitor before, and they weren't even sure if this was a call or not. The woman cleared her throat and drew herself upright.<br>\r\n<br>\r\n\"Thank you for ensuring my daughter's saftey, we will speak of this further in more pleasant conditions,\" Ana said formally.<br>\r\n<br>\r\nThomas smiled; it was neither a denial nor an acceptance of his wish to court Rose (if he wished that at all, perhaps he just did not know his bows), but it was an offer for him to return and to stake his claim officially in the presence of her father, or to pay up and get out. Rose could help but hope it would be the frist one.<br>\r\n<br>\r\nThe boy bowed again and bid Rose a good morrow before making his leave. Slowly, Rose unhitched the gate and stepped onto the muddy path. <br>\r\n<br>\r\nAna took her hands and smiled at her with a gleam in her eye. \"Let's get you cleaned up,\" she said, then left her to stand ni the rain and gather herself before following her inside. <br>\r\n<br>\r\n<i>This isn't a dying day,</i> Rose thought, <i>it is a day of exposure, renewal. My hair is sure to be clean of the ink and my heart has beat faster than ever before, what strange things to feel!</i></span></div></div>",
            "created":1323109500,
            "id":1235180,
            "title":"The stranger asks to speak with her again."
        },
        "11433":{
            "author_id":"mothergoddess",
            "author_name":"Goddess",
            "choices":[
                "Rose apologizes and explains what happened at the market",
                "Rose defends her mother by sassing her Aunt Mari",
                "Rose says nothing, fearing her hateful Aunt Mari"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, thank you for returning my scarf sir--\"<br>\r\n<br>\r\n\"<i>Thomas</i>, remember?\" he said with a smile. Now that they weren't running from pursuers and hurrying out to the rain, he'd finally got a good look at her. Such beauty, befitting the name, even with the dreary old scarf. Though he did wonder why she'd ever want to cover up.<br>\r\n<br>\r\n\"Yes. Thomas,\" she said, suddenly shy. \"Well, I better be getting inside. I'm not looking forward to telling my mother that I've lost her cloth and cart.\" This was true. Rose's mother was a kind and understanding woman, but Rose didn't enjoy disappointing her. <br>\r\n<br>\r\n\"About that,\" Thomas said, reaching for his pouch. \"It was I who ruined your mother's cloth and cart, so it is only right that I should pay for it.\" He held out several pieces of coin, almost double what the cloth and cart were worth.<br>\r\n<br>\r\n\"Thank you...Thomas.\" Rose was astonished, and she didn't turn down the kind gesture. Her mother had raised no fool. After all, he <i>did </i>ruin the cloth and cart. She stared down into her palm at the coins, and then back at Thomas. Perhaps it was his honesty, mixed with a few good looks (if she were honest), that suddenly made her heart skip a beat. <br>\r\n<br>\r\nThomas swung the wooden gate open for Rose and bowed as she passed through. \"Until next time, Rose,\" he said as he watched her close the gate. <br>\r\n<br>\r\n\"Until then, Thomas.\" At that, she turned an entered house, closing the door behind her. She leaned against the door for a moment, eyes closed, beaming from ear to ear. It was the sound of her aunt's cruel voice that yanked her head from the cloud she was in.<br>\r\n<br>\r\n\"What are you grinning at <i>girl</i>?\" Aunt Mari said, with a contempt Rose had heard in no other's voice. \"Ana, what is the meaning of this? You said she wouldn't be here!\" she yelled, angrily, as she stood to ready herself for departure. <br>\r\n</span></div></div>",
            "created":1539025680,
            "id":2561151,
            "title":"The stranger dallies at the gate, continuing th..."
        }
    },
    "info":{
        "author_id":"vivianalee",
        "author_name":"..LetMeThink..",
        "brief_description":"In a world where red hair is a bad omen of death & misfortune a girl is raised in disguise",
        "created":1321035540,
        "description":"<td align=\"left\" class=\"norm\">Rose was a beautiful young woman, the kind everyone knew, loved and looked up to. She was intelligent, clever, creative and caring; a sensitive young girl that didn't pick and choose among the classes but accepted everyone, warts and all, and helped others when she could. Women adored her and she was their most trusted friend; men fell for her and followed her to the end. Little did they know she had a secret, a deep secret hidden so far from the light even she forgot about it, until her little secret showed it's roots from time to time. Literally. <br>\r\nRose was borne and raised in Strintom in a time long ago, a beautiful country between the coast and the mountains, where many lived and folk tales flourished. The masses were all superstitious and things like a fox in the road, starting a journey at twilight and killing a lady bug were known as bad luck. The worst of them all was something no one could control, although they may try; being borne with red hair. Like Rose. <br>\r\nThe young woman was birthed by an upperclass woman who swore for months to adore her child, boy or girl, but when her child came out with a full head of curly red locks she was aghast and threw her to the streets. There she was found by a gentle and compassionate old woman who named her for the bright, copper color her locks held and took her home to a life of a merchant's daughter. <br>\r\nWhen she brought the girl to her sister's to woo over the child the lady screamed in horror and made a sign to ward evil before fleeing. That night the woman dyed her hair black as ink, black as night, and raised her with cautious eyes. Word soon reached her that the girl's mother had perished, but the woman did not falter in loving and raising Rose, she only held her tighter as if to sheild her from the cruelty of the world and blamed the mother's death on karma and failed promises.</td>",
        "id":1825323,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1539025680,
        "modified":1539025680,
        "pretty_title":"The Black Rose"
    }
}