{
    "chapters":{
        "1":{
            "author_id":"quickj121",
            "author_name":"Aly",
            "choices":[
                "you will become your girlfriend during the night",
                "you shall become your girlfriends best friend during the night",
                "you shall become your little sister during the night",
                "you shall become your older sister during the night",
                "you have the ability to switch bodies with any female by kissing her on the lips"
            ],
            "content":"<div class=\"\"><div> <span>you are jo. you were walking home one day from school. when you go through a park to get to your house faster, you run into an old lady who stare at you and says, \"your a very pretty girl.\" you just ignore her and keep walking, after all she is the nut who lives in the park. so you get home and have a normal night, you tease miley your 6 year old sister, you get in an argument with your older sister becky. you yell at your parents, and go to bed.<br>\r\nyour lying in bed just waiting to get to sleep and remember the old nut, and then you hear the doorbell ring.<br>\r\nbecky yells, \"jo its for you!\"<br>\r\nyou go downstairs to find a ups delivery man with a yellow envelope. you sign and open it. there is a note that says...</span></div></div>",
            "created":1237266000,
            "id":662052,
            "title":"choices"
        },
        "11":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "freak out",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You laugh and throw the paper out. You return to bed and fall asleep. You are tossing and turning all night, you had a horrible nightmare. And then you wake up to a weird sounding alarm. You snooze the clock and lay back down. You put your hands behind your head and feel long soft hair. You sit up really fast and look down. You see the body of your girlfriend Riana!<br>\r\nYou stand up and start to freak out. You try to figure out what happened, but you can't think right. Finally you remember the letter you got last night and curse it. You feel your bladder ready to explode so you go into the bathroom. You stand in front of the toilet but then remember you’re a girl. So you sit down and do your stuff. Standing up you look in a mirror and see just again the pretty face of Riana…<br>\r\nSo you decide to...<br>\r\n</span></div></div>",
            "created":1456232460,
            "id":2108345,
            "title":"you will become your girlfriend during the night"
        },
        "12":{
            "author_id":"quickj121",
            "author_name":"Aly",
            "choices":[
                "explore a little",
                "take a shower and get ready for school"
            ],
            "content":"<div class=\"\"><div> <span>you lauph and throw the paper out. you return to bed and fall asleep. you are tossing and turning all night, you had a horrible nightmare. and then you wake up to a weird sounding alarm. you snooze the clock and lay back down. you put your hands behind your head and feel long soft hair. you sit up really fast and look down. you see the body of your girlfriend rianna's best friend, katy. you stand up and start to freak out. you try to figure out what happened, but you can't think right. finally you remember the letter you got last night and curse it. you feel your bladder ready to explode so you go into the bathroom. you stand in front of the toilet but then remember your a girl. so you sit down and do your stuff. standing up you look in a mirror and see just how hot you really are. so you decide to...</span></div></div>",
            "created":1237266000,
            "id":662608,
            "title":"you shall become your girlfriends best friend d..."
        },
        "13":{
            "author_id":"quickj121",
            "author_name":"Aly",
            "choices":[
                "you scream and then faint",
                "you look in a mirror and see your sisters body",
                "you begin to cry since you have the emotions of a six year old"
            ],
            "content":"<div class=\"\"><div> <span>you just crumple up the paper and think yeah right. and so you fall asleep and have the most comfortable nights sleep you ever had. you hear knocking and then your mothers voice saying  \"get up and get ready for school honey.\" now you think thats weird since you usually wake up to an alarm, not to mention she called you honey. so you sit up and some black hair falls in your face. you just wave it away without thinking and stand up. but you feel kinda weird, and everything looks big, and what are you doing in your sister's room, and why are you wearing a night gown? you look down and see the body of a little six year old girl. <br>\r\n<br>\r\nwhat do you do?</span></div></div>",
            "created":1237271880,
            "id":663541,
            "title":"you shall become your little sister during the ..."
        },
        "132":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "your older sister, Becky.",
                "your mother.",
                "Rianna, who was your girlfriend."
            ],
            "content":"<div class=\"\"><div> <span>You jumped from the bed and ran to the full length mirror hanging on the closet door. There, in your reflection, you saw your little sister, Miley staring back at you! Your first reaction was to scream but then you were hit with another shock. Your little sister sleepily walked up to the mirror and stood right beside you! \"What's wrong, Jo?\" Yawning, she asked. \"Did you have a nightmare?\"<br>\r\n<br>\r\n\"Miley! Somehow I turned into you!\" Panicked, you wailed. \"I was your big brother yesterday, don't you remember?!\"<br>\r\n<br>\r\nMiley, still half awake giggled tiredly. \"You're silly, sis.\" Lightly, she said. \"We better get dressed, we have to go to school.\"<br>\r\n<br>\r\nYou gawked at your little sister as she walked out of the room towards the bathroom. Once she had closed the bathroom door, you hard your cellphone ding; you had a text message. Shaken, you found your phone on a nightstand that was not there the night before. The message read, 'Enjoy your new life, Joanna'. -The Gypsy you ignored.<br>\r\n<br>\r\nThe second you read the message, it vanished and someone grabbed the cellphone from you. \"Give that back, kiddo!\" Irritated, a female voice said. \"It's not a toy for you to play with!\"<br>\r\n<br>\r\nYou looked up, startled and saw...<br>\r\n</span></div></div>",
            "created":1506558660,
            "id":2392814,
            "title":"You are a twin to a six year old girl!"
        },
        "133":{
            "author_id":"quickj121",
            "author_name":"Aly",
            "choices":[
                "your body",
                "your older sister",
                "your girlfriend"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you start to cry, not able to control yourself, and then ______________ walks in.</span></div></span></div>",
            "created":1237266000,
            "id":662059,
            "title":"you begin to cry since you have the emotions of..."
        },
        "1333":{
            "author_id":"quickj121",
            "author_name":"Aly",
            "choices":[
                "Rianna, it didn't work",
                "Miley, your little sister",
                "you faint and wake up in that body."
            ],
            "content":"<div class=\"\"><div> <span>your girlsfriend rianna walks into your (sister's) room. she walks over to you and gives you a hug. \"it's alright, everything will be alright.\"<br>\r\nyou stare up at her, almost glaring \"you did this to me?! how, why, what was the point?\"<br>\r\n\"last week, last week you argued with me, you said that being a girl would be easy, you said that you could do it without complaint, well, i could have sworn i've already heard complaining, now as for the how, that letter you got was powdered in a potions that i made, it made you switch bodies with whoever the maker decided on. now that i know it works, i can have more fun.\"<br>\r\nshe takes out a vile containing a thin white powder in it. she takes it out and sprinkles it on herself. \"i shall become jo quin!\" and all of a sudden she faints.you go over to her, moving akwardly as your not yet used to your new body and slap her face trying to wake her up.<br>\r\nwhen she finally wakes up who is in her body?</span></div></div>",
            "created":1237524720,
            "id":663546,
            "title":"your girlfriend"
        },
        "14":{
            "choices":[
                "Find your body",
                "Something Else",
                "Something Else",
                "Something Else",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>You see the note and possibly in a way to keep this from happening you try to not to go to sleep, pulling an all nighter as it were. But, as you get up to go to the restroom your world shifts, the lighting changes, it seems you are not moving but the world around you is. And as you take your next step you look down to find long black hair draping over your shoulders. You find your sisters tanned legs supporting you, her toenails painted bright pink and her breasts sitting atop your chest restrained by a black bra. <a rel=\"nofollow\" href=\"http://media.photobucket.com/image/hints%20some%20people%20can%2527t%20take%20them/stylish313/Logos/om.gif\" target=\"_blank\">http://media.photobucket.com/image/hints...</a> What do you do?</span></div></div>",
            "created":1339652160,
            "id":1359232,
            "title":"Older Sis!"
        },
        "141":{
            "choices":[
                "Hey sis you look sexy, what you doing in here?",
                "What going on, why are you me and me you?",
                "Something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You get up and immediately go into your room and see your body in your bed.<br>\r\n<br>\r\nYou shut the door and walk up to the bed, your old body opened his eyes.<br>\r\n<br>\r\nAnd says?</span></div></span></div>",
            "created":1463576160,
            "id":2149920,
            "title":"Find your body"
        },
        "1411":{
            "author_id":"secretgoat",
            "author_name":"Ralsei",
            "choices":[
                "You new naked body",
                "Your old body in his underwear ",
                "By both your old and new body "
            ],
            "content":"<div class=\"\"><div> <span>You realize that your sister wasn’t wearing panties and your boobs bounced so much on your way here that your bra broke off. You were glad you didn’t have that on your new boob anyway. You say to your body “just wanted to show you what a real woman looks like”. You then look at yourself in your mirror and started getting turned on by...</span></div></div>",
            "created":1577918340,
            "id":2767976,
            "title":"Hey sis you look sexy, what you doing in here?"
        },
        "15":{
            "author_id":"quickj121",
            "author_name":"Aly",
            "choices":[
                "when you come to you're your sister",
                "when you come to you're yourself, but with sisters personality",
                "nothing happens"
            ],
            "content":"<div class=\"\"><div> <span>you think yea right and go back to bed. but you cannot stop thinking about that letter, i mean what if it is true? you have to try it, you can't resist. it's 10:00 and you get up to call your girlfriend when your little sister walks in. \"kiss goodnight?\" you go to kiss her on the forehead, but decide, why not try it now? so you give her a quick peck on the lips and pass out.</span></div></div>",
            "created":1237266000,
            "id":662614,
            "title":"you have the ability to switch bodies with any ..."
        },
        "151":{
            "author_id":"quickj121",
            "author_name":"Aly",
            "choices":[
                "run away and keep the body for a while",
                "try to switch back by kissing",
                "pretend to be miley and make her think she's you"
            ],
            "content":"<div class=\"\"><div> <span>you wake up on the floor. you stand up but everything seems big and you feel wierd. you look down and see your self laying on the bed out cold. you walk over to the mirror and see miley staring back. you walk around and feel as light as a feather, after all you did weigh 180 and now you weigh maybe 60. you go over to your body and see it waking up so you decide to...</span></div></div>",
            "created":1237266000,
            "id":662619,
            "title":"when you come to you're your sister"
        },
        "1511":{
            "author_id":"quickj121",
            "author_name":"Aly",
            "choices":[
                "no your body died in the fire",
                "your body is standing there glaring at you"
            ],
            "content":"<div class=\"\"><div> <span>you decide to run out of the room and down the hallway to miley's (your) room. you shut and lock the door and lay on her bed. you are intrigued at being a six year old girl and decide to stay up late, but your new body is tired and you fall asleep, you wake up to your mother screaming and banging on the door. you feel hot and see smoke everywhere. you quickly stand up and unlock the door. your mother picks you up (reminding you youre your sister)and runs out the door. you get outside and see the house in flames. is your body outside?</span></div></div>",
            "created":1237350960,
            "id":662625,
            "title":"run away and keep the body for a while"
        },
        "15111":{
            "author_id":"quickj121",
            "author_name":"Aly",
            "choices":[
                "do you tell her who you are",
                "you kiss her on the lips hoping to change."
            ],
            "content":"<div class=\"\"><div> <span>you can't find your body anywhere. you ask your mother where jo is, and she starts looking for him. after a few hours went by a firman came out and told your family he was sorry, but they found your body. you start to cry, you can't help it. your tears won't stop. you cry for what seems like forever. when you finally stop you see your girlfriend on the ground crying harder than you were</span></div></div>",
            "created":1237351140,
            "id":662626,
            "title":"no your body died in the fire"
        },
        "1512":{
            "choices":[
                "you're back in your old body.",
                "nothing happens."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide you want to switch back with your old body. Your old body is still knocked out so you kiss it on the lips and then...</span></div></span></div>",
            "created":1456072440,
            "id":2107444,
            "title":"try to switch back by kissing"
        },
        "15121":{
            "choices":[
                "Yes, tell her what happened.",
                "No, concentrate on your next move."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The next moment you see Miley standing in front of you having just kissed you on the lips. She's unsure of herself what she just did, so she excuses herself and returns to her room.<br>\r\n<br>\r\nDo you stop her on her way out?</span></div></span></div>",
            "created":1470256560,
            "id":2190715,
            "title":"you're back in your old body."
        },
        "151211":{
            "choices":[
                "Miley again.",
                "your mother who steps inside the room."
            ],
            "content":"<div class=\"\"><div> <span>\"Wait, don't you want to know what happened Miley?\" You ask your little sister. She turns around with a great smile on her face as you knew her reply.<br>\r\n<br>\r\n\"Yeah, what happened Jo?\" She asks sitting next to you.<br>\r\n<br>\r\nYou explain to her you can switch bodies and you just tried it on her. She has that grin on her face that shows she thinks you're joking with her.<br>\r\n<br>\r\n\"You think I'm joking right?\" You ask her as you push her down with just a finger. She giggles as a reply to it which meant a yes.<br>\r\n<br>\r\n\"I'll show you.\" You tell her and so you decide to swap with...</span></div></div>",
            "created":1483719780,
            "id":2259893,
            "title":"Yes, tell her what happened."
        },
        "1512111":{
            "choices":[
                "You agree to it.",
                "You disagree. "
            ],
            "content":"<div class=\"\"><div> <span>You kiss her once again on the lips and the next thing you know, you're standing opposite your body. Fortunately for  you, Miley wasn't knocked out like before. <br>\r\n<br>\r\n\"See, what did I tell you?\" You tell your sister putting your hands at your hips.<br>\r\n<br>\r\n\"I'm you.\" Miley says in a squeaky voice as she holds out her hands in front of her. They're way bigger than her own. To show her how much difference it is, you put your hands on Miley's hands. <br>\r\n<br>\r\n\"This is neat.\" Miley says as she jumps up and down like only a six year old would do. \"Everything looks tiny, even you.\" She points at you. She then looks concerned. \"There is something underneath here too, it's not like my pee, pee.\" Miley absent minded rubbed your crotch. <br>\r\n<br>\r\n\"It's nothing special. But what do you think of my powers? Cool isn't it?\" You tell her. <br>\r\n<br>\r\n\"Yeah. So can we stay like this?\" Miley asks in a pleading tone. <br>\r\n<br>\r\n\"Miley, we can't. Tomorrow's a school day for me. And for you as well.\" You remind Miley.<br>\r\n<br>\r\n\"Please. We can do it before school starts. Please.\" Miley bats her eyelashes as trying to persuade you. In the past it worked countless times with you and a lot of other people, but then she didn't look like a seventeen year old guy. <br>\r\n<br>\r\nHow do you respond to Miley's request?</span></div></div>",
            "created":1501505280,
            "id":2362291,
            "title":"Miley again."
        },
        "15121111":{
            "choices":[
                "Yes, you wake up at the break of dawn.",
                "No, your mother has to wake you up."
            ],
            "content":"<div class=\"\"><div> <span>It's that she's your favorite little sister, or else you wouldn't have done something like this. <br>\r\n<br>\r\n\"Fine, we'll do it. But we really need to swap back first thing in the morning.\" You tell her. Miley grins as she grabs you and holds you tight in her hug. \"You're the best bro.\" She says with a high pitch in her voice. <br>\r\n<br>\r\n\"That's okay, just let me go, it's way too tight.\" You tell her after which she lets go. <br>\r\n<br>\r\n\"Now I'll go sleep in your room and you sleep in my room, okay?\" You tell Miley after she just nods her head. You give her a wink when you leave your room and head to Miley's room. It isn't too bad, the room is really pink and smells of flowers and such. And your bed is surrounded by all her cuddle toys which leaves you almost no room to get into. Lying on your bed you examine your hands, they are really small. Everything about you is small. You just hope that you wake up early in the morning so that you can go swap back with Miley. After holding Mr. Tuddles, Miley's favorite toy, you fall deep asleep.<br>\r\n<br>\r\nAre you awake early?</span></div></div>",
            "created":1506260400,
            "id":2390690,
            "title":"You agree to it."
        },
        "151211111":{
            "choices":[
                "Miley wakes up and is confused.",
                "Miley snores and continues sleeping."
            ],
            "content":"<div class=\"\"><div> <span>When you open your eyes you have to think for a second where you are. The room is brighter and you don't have pink wallpaper. As you stretch your arms you see the small arms and hands you now got. It then hits you that you are inside the body of your sister Miley. It still feels weird being inside her body. Her arms are way shorter than yours not to mention your legs and feet. Everything is smaller than before. But then you remind yourself you would swap back with Miley first thing in the morning. You step out of Miley's bed and quietly open the door. Luckily nobody is up yet. You tiptoe to your room. It was surprisingly easier making less noise like her. <br>\r\n<br>\r\nWhen you open the door you can see your old body lying in bed with the sheets pulled off. It was a warm night last night after all. When you come closer you are amazed how big you look like this. Those big broad shoulders, that physique. Looking like Miley makes you realize you are quiet big. Not to mention your package. Apparently Miley got a morning wood while she was still asleep. You could see your member sticking out your boxer shorts. So embarrassing. <br>\r\n<br>\r\nYou try not to look at it as you walk closer to your bed and crawl upon it. You have to kiss your old body again on the lips. Licking your lips you pucker them as you aim straight for your own lips. At that moment....</span></div></div>",
            "created":1528659720,
            "id":2505362,
            "title":"Yes, you wake up at the break of dawn."
        }
    },
    "info":{
        "author_id":"quickj121",
        "author_name":"Aly",
        "brief_description":"you are a guy who, for some reason or another, becomes a female",
        "created":1237270800,
        "description":"<td align=\"left\" class=\"norm\">you are just a normal, average 17 year old boy. you are a senior in high school and play on the baseball team. but one day you somehow gain the ability to become female.<br>\r\n<br>\r\nrules: anything goes, except gay sex. keep characters the same, use good ENGLISH and i  specify english.<br>\r\n<br>\r\ncharacters:<br>\r\n<br>\r\njo quin, you, average 17 year old high school senior. 6' 1'' broad shouldered.<br>\r\n<br>\r\nrianna, girlfriend, 17, blonde hair, blue eyes, average breasts, 5' 9''. nice girl.<br>\r\n<br>\r\nkaty, rianna's best friend, blonde hair blue eyes, b cup 5' 4'', rich family, very popular, doesnt hate you but doesnt like you either<br>\r\n<br>\r\nmiley, little sister, 6, black hair brown eyes.<br>\r\n<br>\r\nbecky, older sister, 22, beautifull, perfect figure, nice ass, big breasts, real party girl.<br>\r\n<br>\r\nrose, mother, chubby, chort, medium breasts, 42, black hair.<br>\r\n<br>\r\nrobert, father, stern 45<br>\r\n<br>\r\n<br>\r\nplease add and rate</td>",
        "id":1539637,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1577918340,
        "modified":1577918340,
        "pretty_title":"becoming female please add"
    }
}