{
    "chapters":{
        "1":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Naruto",
                "Fullmetal Alchemist",
                "Soul Eater",
                "Dragonball Z",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Scott and you’re a typical teenager with a typical life. You live with a normal family and go to a normal high school. Your interests include hanging out with your friends, playing video games, and most of all, watching anime. Anime was a popular thing where you lived; almost everyone at school was interested in it. It was common for you and a friend to suddenly start a conversation involving anime. You were no otaku, but you did occasionally buy manga or a DVD set. <br>\r\n<br>\r\nYou also had another interest; size changing. Every time you surfed the Internet, you would always visit your favorite macro sites. There were always new stories to read and pictures to see. You especially liked material involving anime characters. There was just something about your favorite anime characters being tiny and at the mercy of a gigantic world that amused you.<br>\r\n<br>\r\nToday you were walking home from school on what appeared to be another normal day. After saying bye to your friends, you headed into your house and up to your room. After tossing your backpack on the floor, you slumped onto your couch and relaxed. As you stared up at your ceiling fan, you wondered what you should do.<br>\r\n<br>\r\n“Hmm…I could play that new game I got today.” you say as you glance over at your console. “There’s also that anime series I’ve almost finished. …oh, I wonder if any of my sites have been updated!” You get up off the couch and make your way over to your personal computer. As you approach it, something else catches your eye. You glance over at your TV and see that it’s turned on and displaying a white screen. “What the-?” you mumble as you look down at your feet. The remote wasn’t on the floor so you hadn’t stepped on it. You look back at the television to see the screen begin to glow brighter. The white light slowly begins to fill the room and something clicks in your head.<br>\r\n<br>\r\n“Oh crap! I read about this! This is what happens just before an unexpecting victim is shrunken and sent to an anime world!” Your eyes widen as you start to back away from the glowing TV. You accidentally trip over your feet and land hard on the floor. You don’t take the time to nurse your hurting butt as you crawl away from the television. “Please no! I like my life; I don’t want to leave it!” you tell the strange phenomenon, but it’s only response is an increase in brightness. You whimper as you shield your eyes; the white light consuming you.<br>\r\n<br>\r\n…and then it retracts. The light zooms back into the TV and disappears. You slowly open your eyes and look around, expecting everything to be huge. Nothing has changed, however. You’re still in your room and the TV is turned off. You at it blankly for a few moments before you begin to laugh hysterically. <br>\r\n<br>\r\n“Oh wow…did I really just do that?” you ask yourself as you chuckle some more. You get back to your feet and rub your sore buttocks. You feel incredibly stupid and are glad no one is currently home. Being sent to another world? Being shrunk? Like that could ever happen…<br>\r\n<br>\r\nHowever, unbeknownst to you, it had happened. Your room now had an uninvited visitor. A very small visitor. To start; what anime is this person from?</span></div></div>",
            "created":1275195600,
            "id":891526,
            "title":"Not a Typical Day"
        },
        "11":{
            "author_id":"vashorchihide",
            "author_name":"Male Stomper",
            "choices":[
                "naruto",
                "squad 7",
                "squad 8",
                "squad 10",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you walked off thinking of how strange that was. while on the floor of your living room was/where</span></div></span></div>",
            "created":1302411600,
            "id":1085893,
            "title":"Naruto"
        },
        "112":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Sasuke Uchiha",
                "Sakura Haruno",
                "Kakashi Hatake"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character is it? </span></div></span></div>",
            "created":1474816980,
            "id":2214482,
            "title":"squad 7"
        },
        "1121":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "In the middle of his action figure collection.",
                "In a shoe box."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey,you,do you have an explanation for this? And where am I?!\" shouted a very familiar voice.Scott looked down and saw,now the size of an action figure,Sasuke Uchiha from Naruto,in the flesh.The teenaged version of him from Shippuden,with the Rinnegan on his left eye.He pickked him up by the collar of his shirt.\"You're kidding me.You...the real Sasuke?You got sent here....and got smaller?\"<br>\r\n\"Did you do this to me?!\" he cried.<br>\r\n\"No,of course not! I was just playing video games and my TV started to glow and this happened!\" said Scott.He started to think.\"I need to hide you somewhere in the meantime.I don't want my parents to see you.\"<br>\r\nWhere should he hide Sasuke?</span></div></div>",
            "created":1474817340,
            "id":2214486,
            "title":"Sasuke Uchiha"
        },
        "115":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Akatsuki",
                "Another village outside of Konoha?",
                "Other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then which group do he/she belong to?</span></div></span></div>",
            "created":1485103260,
            "id":2267381,
            "title":"others"
        },
        "1151":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Itachi Uchiha",
                "Pain/Nagato",
                "Other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it from Akatsuki then?</span></div></span></div>",
            "created":1485103320,
            "id":2267382,
            "title":"Akatsuki"
        },
        "11511":{
            "author_id":"sasuke-sama",
            "author_name":"Sasuke-sama",
            "choices":[
                "Scott acepts",
                "Scott dosen't have the time."
            ],
            "content":"<div class=\"\"><div> <span>\"Why am I smaller al of a sudden?\" Asked a familiar voice.You looked down.On the table near the couch,now the size of an action figure,stood Itachi Uchiha,Sasuke's older brother from Naruto.<br>\r\nItachi looked up to you.<br>\r\n\"Tell me.\" he asks Scott in a calm tone.\"Is this world a giantic one,or was I the one getting smaller? This must be some kind of Genjutsu.<br>\r\n\"No,it's not. You got sent here to this world and gotten smaller.\" Scott explained to him.<br>\r\nItachi looked down.\"So it's true then.How will I get back to my world and return to my normal size?\" he asked.<br>\r\n\"I can't help you with that.\" said Scott.<br>\r\nItachi didn't show his emotions,but Scott could tell he was disapointed.He looked up to you.\"In the meantime,can I ask you a favor?\" he asked.\"While I'm in this world,I would like to see how is it compared to the elemental nations.\"</span></div></div>",
            "created":1485103740,
            "id":2267393,
            "title":"Itachi Uchiha"
        },
        "12":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Edward Elric",
                "Alphonse Elric",
                "Roy Mustang",
                "Both of the Elric Brothers",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who has shrunken?</span></div></span></div>",
            "created":1275195600,
            "id":891547,
            "title":"Fullmetal Alchemist"
        },
        "124":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "\"..a friend.\"",
                "\"...your new master!\""
            ],
            "content":"<div class=\"\"><div> <span>Edward Elric woke up with an aching head. He picked himself off of the strangely soft ground and tried to collect his thoughts. The last thing he remembered was talking with his brother when a mysterious light had appeared out of no where and sucked them into it. <br>\r\n<br>\r\n“Ugh…what happened? That was almost as bad as when I opened the Gate.” the sixteen-year-old State Alchemist said as held his head with an automail hand. He glanced around and only became even more confused. He wasn’t in his apartment, that’s for sure. He was in a bedroom of some kind…and everything was HUGE. “Al! Can you hear me, Al! Alphonse!”<br>\r\n<br>\r\n“Over here!” yelled Ed’s younger brother. The blond teen looked over to see his brother waving to him a few feet away. Ed ran over to him and placed a hand on Al’s shoulder. <br>\r\n<br>\r\n“You okay, Al?”<br>\r\n<br>\r\n“Yeah, I’m fine. My head hurts a little. Hehe, this is actually the first time I hurt my head since getting my body back!” Al said, smiling happily. “Anyway, where are we, Ed? Did we…shrink?”<br>\r\n<br>\r\n“Looks that way, but I don’t recognize this place at all.” Ed replied as he glanced around. The room contained many things that he hadn’t seen before, such as the computer. His world didn’t have computers. “Come on, Al, let’s take a look arou-”<br>\r\n<br>\r\nEd was interrupted by a sudden booming noise. The noise startled the two brothers and they looked around for the source of the noise. A second boom echoed through the room and the two teens turned their sights to the direction of the second boom. They were horrified to see you, a humongous giant, quickly approaching them. Your sneakers alone were bigger than cars to the two alchemists. <br>\r\n<br>\r\n“B-Brother…wh-who’s that?” Al asked, shaking in fear.<br>\r\n<br>\r\n“I don’t know, but I think we should RUN!” Ed exclaimed as he shoved his brother forward and two took off together. They ran just far enough to avoid your giant sneaker as it came down where they had just been standing. The Elric brothers look up as you maneuver around the TV to find out why it had suddenly turned on. <br>\r\n<br>\r\n“Ed…I’m scared.” Al says as he continues to stare up at you. <br>\r\n<br>\r\n“Don’t you dare cry, Alphonse!” Ed said, grabbing his brother by the shoulders. “Your fifteen! You’re not going to cry because of something like this. We’ve encountered worse, right?”<br>\r\n<br>\r\n“Yeah…you’re right.” Al said, sniffing. “I’m not a crybaby!” Al expression changed to a serious look, but Ed just chuckled at it. “Okay, not let’s…”<br>\r\n<br>\r\nOnce again, Ed was cut off when you took another step toward them. The brothers looked up just in time to see the bottom of your shoe hanging over them. They both screamed at once in an effort to get your attention.”<br>\r\n<br>\r\nThankfully, it worked. You heard something underneath your shoe and planted it down somewhere else. You gazed down and could make out SOMETHING in the rug. They looked like bugs…but no bugs you’ve come across made that sound. You squatted down to get a closer look and were shocked by what you saw. There, staring up at you, were two tiny humans. Not just any humans, but the Elric brothers from Fullmetal Alchemist!<br>\r\n<br>\r\n“What the-?” you mumble as you rub your eyes, thinking that bright light was making you see things. When you looked again, however, the small alchemists were still there. You just stared at them in disbelief.<br>\r\n<br>\r\n“Hey! What did you do to us, you giant!” Ed yelled up at you, seemingly unintimidated by your size.<br>\r\n<br>\r\n“Me?” you ask, blinking a few times. “I didn’t make you so small…”<br>\r\n<br>\r\n“SMALL?! WHO ARE YOU CALLING SMALLER THAN THE AVERAGE HOUSEFLY?!” Ed screamed at the top of his lungs. He angry leaped for you, but Al was quick enough to grab his brother by the arms and hold him back.<br>\r\n<br>\r\n“Brother, calm down! You’re going to get yourself killed!” Al pleaded with his brother who fought against the hold. You couldn’t help but chuckle a bit, despite the many questions that filled your head. You didn’t care about the how or why, just that two anime characters you knew so well were in your room and bug sized. It was like a dream come true!<br>\r\n<br>\r\nAl was still holding Ed back when the two teens noticed a shadow cover them. They looked up and saw your hand quickly descending upon them. The younger Elric released his brother and the two of them ran in the opposite direction, but it was futile. You easily snatched them up and stood up to your full height. The Elrics were only around two or three inches tall, so they easily fit in your fist. You opened your hand and saw the two teens sitting on your palm, slightly dazed from the sudden movement.<br>\r\n<br>\r\n“What’s the big idea, you oversized punk! Put us down or else!” Ed threatened, but you weren’t intimidated at all. To you, Edward was like an angry little bug. It was funny, if anything else. <br>\r\n<br>\r\n“Don’t be like that. I’m…”</span></div></div>",
            "created":1275195600,
            "id":891560,
            "title":"The Brothers and the Giant"
        },
        "1241":{
            "choices":[
                "Ed and Al Attack You"
            ],
            "content":"<div class=\"\"><div> <span>Alphonse blinked a few times while Ed still continued to glare up at you suspiciously. \"Yeah right! What kind of a friend are you who treats his buds this way!?\" <br>\r\n<br>\r\n\"Um....I didn't do anything.\" You say annoyed.<br>\r\n<br>\r\n\"You try to step on us, then you pick us up without a warning or asking!\" Ed screams.<br>\r\n<br>\r\n\"Oh! About that....Well....Sorry.\" you say sheepishly. <br>\r\n<br>\r\nEd still seems suspicious of you but Al has lightened up a bit, \"Um....Who are you?\" <br>\r\n<br>\r\n\"I'm Scott, nice to meet you Al...And you too Ed.\" <br>\r\n<br>\r\nAlphonse and Edward look at each other for a moment, then both look suspiciously up at you. \"H-How do you know who we are?\" Alphonse asks.<br>\r\n<br>\r\nYou blink a few times. \"Well.....Its a long story.\"<br>\r\n<br>\r\n\"We don't have time for long stories! We need to get back to Central!\" Ed yells. <br>\r\n<br>\r\nYou sigh, wishing the brothers liked you as much as you liked them. <br>\r\n<br>\r\nYou sit down carefully on the sofa and open your palm up so the brothers would be more comfortable. \"Look guys, I'm trying to be nice to you. But it's gonna be hard if you can't trust me and keep accusing me of stuff I didn't do. I don't know how you got here, See....here in this world...you don't exist. The only reason I know of you two is because....in this world you are the main characters of a comic book and tv show.\" <br>\r\n<br>\r\nYou expect the brothers to be shocked and horrified, yet their response is anything but. They simply collapse in laughter! <br>\r\n<br>\r\n\"Wha-.....Whats so funny!? I'm being serious here, Theres no such thing as Alchemy here!\" <br>\r\n<br>\r\n\"Thats bullcrap....You're a bad liar.\" Both brothers get up and face you on your hand. <br>\r\n<br>\r\nYou begin to grit your teeth in anger. \"I'm telling the truth! You want proof? I've got all the proof you need!\"<br>\r\n<br>\r\nYou roughly throw them on the couch and begin to rummage through your dvd collection. <br>\r\n<br>\r\nYou come back up with a copy of FullMetal Alchemist Brotherhood. You wave the gigantic dvd in their faces. \"Look familiar?\" You ask them mockingly. <br>\r\n<br>\r\nEd and Al look stunned. \"T-That doesn't prove anything!\" Ed and Al shout in denial.<br>\r\n<br>\r\nYou sigh, hoping it wouldn't have come to this. <br>\r\n<br>\r\nYou would hate yourself for doing this for a long long time, but you hated being called a liar. You smirk, \"How's mom doing Ed?\" <br>\r\n<br>\r\nEd looks up at you in shock, as does Al. <br>\r\n<br>\r\n\"No.....You can't......\" <br>\r\n<br>\r\n\"Oh thats right....dead.....Or to be more precise.....she's now a pus spewing souless abomination because of you two.\" <br>\r\n<br>\r\n\"SHUT UP!!!!!!\" Alphonse and Ed scream at the top of their minute lungs.</span></div></div>",
            "created":1275195600,
            "id":891579,
            "title":"\"..a friend.\""
        },
        "12411":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "You catch up to the brothers.",
                "Someone else enters the room."
            ],
            "content":"<div class=\"\"><div> <span>Ed and Al are really pissed off now. If they were normal sized, you’d be in deep shit. However, you simply look down at the puny alchemists without any fear. Ed is the first to act; he claps his hands together and presses his human palm against his automail. He expects it to morph into a blade…but nothing happens. No alchemic reaction of any kind occurs. He looks down at his arms in confusion. <br>\r\n<br>\r\n“See? What did I tell you? Alchemy doesn’t work because you’re not in your world anymore!” you explain to him again, but he isn’t listening to you. <br>\r\n<br>\r\n“You can’t fool me, giant! You must of done something to disable our alchemy!” the blond shouts back, raking his brain to figure out exactly how you managed to do that.<br>\r\n<br>\r\n“Why should we believe a jerk like you?” Al asks, just as pissed off as his older brother. “You know about our mother…but plenty of people know! You haven’t proven anything!”<br>\r\n<br>\r\nYou wince at his words. He’s right…their transmutation of their mother was just uncommon knowledge. It didn’t prove they weren’t in Amestris anymore, but simply pissed them off. Good going, you.<br>\r\n<br>\r\n“Look…I’m sorry. I shouldn’t have said that. Maybe if I tell you…” You try and convince the duo again, but they don’t give you the chance to try. The Elric brothers lunge forward and jump off the couch. They land on your pants legs and begin punching and kneeing you. Due to their small stature, their blows barely register with you. You just look down at them wonder how you’re going to set things right.<br>\r\n<br>\r\n“Come on, guys, stop. I don’t want to accidentally hurt you.” You reach down and try to grab the brothers, but they’re quick and manage to avoid your fingers. You’re starting to get annoyed again, but finally manage to pinch Alphonse between your thumb and index finger. Once you do, Al retaliates by biting your finger. You yelp and pull your hand back to examine it. Al had managed to break the skin on your finger and a tiny amount of blood seeped out of the wound. You put the finger in your mouth and sucked on it while giving Al an angry glare. “Why you little…”<br>\r\n<br>\r\nMeanwhile, Ed used the distraction caused by his brother to climb up to your crotch area. With a wicked grin on his face, Ed reared his automail fist back and punched you right in the family jewels. To you, it only felt like a light flick, but even being flicked there was going to hurt. You take your finger out of you mouth and reach of Ed, but he and Al are already sliding down your pants to the floor. Before you can grab them, the pain from Ed’s punch starts to register with you and you bite your lip. The pain quickly travels up to your stomach and you collapse onto the couch with your hands holding it. In the corner of your eye, you spot the Elrics’ tiny forms running away from you.<br>\r\n<br>\r\n“W-Wait! I’m not mad! Please, just listen to me!” you say as the pain begins to subside.<br>\r\n<br>\r\n“Hurry, brother! He’s about to get up again!” Al yells as he glances back at you.<br>\r\n<br>\r\n“Look straight ahead, Al! Don’t look back!” Ed replies as he desperately looks around for someplace to run to.</span></div></div>",
            "created":1275195600,
            "id":891637,
            "title":"Pissing Off The Elrics = Bad Idea"
        },
        "124111":{
            "choices":[
                "Check The Bottoms Of Your Brother's Feet...Freaking Him Out",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You quickly roll off the couch, ignoring the pain in your nuts and get up. You wince as you crawl towards them, they're heading right towards..... \"Oh....crap.\" <br>\r\n<br>\r\nYour older (by one year, you're 15 while he's 16) brother: Tommy's room! While you were a little of this and a little of that. Your older bro is a total metal head, he's about your size, a bit taller though. He's got emo style black hair and you can usually find him in his room blasting Metallica, Atreyu, Iron Maiden, or AC/DC. And when you say blasting, you mean he's got his stereo waaaaaay up! <br>\r\n<br>\r\nYou can hear the bass of Metallica's 'The House Jack Built' already, he's got his door cracked. Your brother is a typical teenager, he's not fat but he's not into sports. Neither of you are much, you're both pretty skinny but not enough to be considered malnourished or show your ribs or anything. Your brother's room is messy, you and him get along somewhat, he's into darker anime like Hellsing though. <br>\r\n<br>\r\nYou can see the Elric brothers heading down the hallway, damn they're fast for shrimps! \"Shit....don't!\" They're into the room before you can stop them, and before you can get up you find yourself face to face with your brother's socked feet, apparently the obnoxious dude decided to turn off the stereo and listen to his Ipod. He doesn't see you down there and trips over you, his heel busts your lip and you get a taste of dingy sock and blood. <br>\r\n<br>\r\n\"GAH!!\" he yelps as he finds himself sprawling on top of you.<br>\r\n<br>\r\nOnce you both recover, Tommy rips out his earphones and begins yelling at you. \"What the hell man!? What were you doing down there in front of my room?\" <br>\r\n<br>\r\nA horrible thought occurs to you at that moment, what if the brothers were stomped by your brother on accident?</span></div></div>",
            "created":1275195600,
            "id":891736,
            "title":"Enter Tommy"
        },
        "1241111":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "You manage to find the Elrics.",
                "Too late, Tommy's back."
            ],
            "content":"<div class=\"\"><div> <span>As the two of you sat there on the floor in front of the open door, you knew you had to find out whether or not your older brother had really killed Ed and Al or not. Before Tommy had a chance to stand up, you reached for one of his socked feet and carefully examined the bottom of it. You really hoped you didn’t find the squashed remains of the Elrics…even though it would have been their fault to begin with. Thankfully, you didn’t see anything on his right foot. Before you could release your brother’s foot, Tommy kicks you in the face and sends you backwards. Al had bit your finger, Ed had punched you in the nuts, and now Tommy had busted your lip and bruised your nose. Today was beginning turn very sour…<br>\r\n<br>\r\n“Dude, what’s your problem?!” Tommy shouts at you while your hands hold your nose. Thankfully, he hadn’t broken it or anything. “Do you have some kind of foot fetish now?” Tommy stands to his feet and you quickly follow him.<br>\r\n<br>\r\n“What? No!” you reply. “I was just checking to see if you stepped on…something.” You can’t exactly tell him he may have stepped on the Elric brothers. <br>\r\n<br>\r\n“Stepped on something?” Tommy picks up his feet one at a time and checks the bottom of them. “I don’t see anything.”<br>\r\n<br>\r\nYou breath a sigh of relief. Ed and Al were still alive; probably in Tommy’s room somewhere. You had to find them before your metal head of a brother got to them first. <br>\r\n<br>\r\n“Listen, Tommy, can I check your room for something?”<br>\r\n<br>\r\n“Go into my room? What’d you lose, a bug? Is that why you wanted to make sure I hadn’t stepped on something?”<br>\r\n<br>\r\n“It’s really important that I find them…it…whatever.” you mutter the last part, confusing your brother further. <br>\r\n<br>\r\n“I don’t care, but be quick about it. I’m just heading downstairs to grab a snack. Once I get back up, you’re getting out. Understand?”<br>\r\n<br>\r\n“Sure.” you reply before Tommy steps aside and allows you to enter his room. The sixteen-year-old puts his headphones back on and walks toward the stairs. Inside his room, you quickly scan the floor, but see no sign of the brothers. They must be hiding, but there were so many places for them to be in this messy room. There were clothes, bags, paper plates, and all kinds of junk scattered around the floor. You get on your hands and knees and look under his furniture. When you don’t find them, you start ransacking through the trash on the for any sign of two teenage brothers. <br>\r\n<br>\r\nLittle did you know, the Elrics were right next to you in a plastic cup. They peeked out at you through the opening and started whispering to each other. <br>\r\n<br>\r\n“Brother, did you see that? We’re in his brother’s room now!” Al exclaimed, just loud enough for his brother to hear him.<br>\r\n<br>\r\n“I know…but we can’t go anywhere as long as that jerk is here.” Ed responds, glaring at you while you search desperately for them.<br>\r\n<br>\r\n“Ed…he seems really worried about us. Almost everything is dangerous to us at this size; maybe we should trust him.”<br>\r\n<br>\r\n“Are you kidding? He almost stepped on us and then he goes and insults Mom! We’re better off by ourselves.”<br>\r\n<br>\r\nAl simply nods and returns to watching you carefully. He’s still mad at you for saying that about their mother, bur he’s never been one to allow hate to cloud his judgment.<br>\r\n<br>\r\nMeanwhile, downstairs in the kitchen, Tommy was heating up a couple slices of leftover pizza in the microwave. He set the timer to one minute. One minute until you were kicked out of his room and the Elric brothers were left alone with him.</span></div></div>",
            "created":1275195600,
            "id":891782,
            "title":"Brothers and Brothers"
        },
        "12411112":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Ed spots a bag of chips with some crumbs in it.",
                "That pizza sure looks good..."
            ],
            "content":"<div class=\"\"><div> <span>“Damn it, where are they?!” you curse as you continue to search through your bro’s room. Today was starting to really suck. First you suffer several small injuries when you only wanted to help, and then the Elric brothers run into one of the worse places possible! You were starting to get really aggregated by the time your eyes fell upon the cup where the brothers were hiding. The two teens had moved to the back of the cup, so you didn’t see them. As you reached to grab the brothers’ hiding spot…<br>\r\n<br>\r\n“Time’s up, little bro; get out.”<br>\r\n<br>\r\nYou panic as you retract your hand and look over at your brother. In one hand he’s holding a can of soda while the other holds a plate of pizza. He looking at you sternly.<br>\r\n<br>\r\n“Please, Tommy, just a few more minutes!” you beg, but your brother simply walks past you, places his snack on his side table, and begins pushing you out of his room.<br>\r\n<br>\r\n“No. This is my room and my personal time! I’ll help you find whatever you lost later or something…” Tom replies as he pushes you out the door. You spin around and stop him from slamming the door in your face.<br>\r\n<br>\r\n“If you find something…odd, will you promise to give it to me?”<br>\r\n<br>\r\n“Yeah, yeah.” Tom rolls his eyes and shoves the door closed, making sure to lock it too. You start banging on the door now.<br>\r\n<br>\r\n“Hey! You promise you won’t so anything? Are you listening? Answer me!” you shout, but your voice and your knocking is soon drowned out by the sound of his obnoxious metal. You grit your teeth and slam on the door one last time before going back to your room. There’s nothing you can do now. You don’t entirely trust your brother, so you hope for the brothers’ sake they remain unnoticed until you have the chance to search again.<br>\r\n<br>\r\n***<br>\r\n<br>\r\n“Brother, what is that horrible music?!” Al yells as he covers his ears. <br>\r\n<br>\r\n“I have no idea!” Ed replies, also covering his ears to block out the loud music. The blond alchemist glances outside the cup and sees Tommy head banging near the stereo. After a few moments he walks over to his bed and lays down on his stomach. His pizza and soda are on the floor nearby and he has his nose buried in a magazine.<br>\r\n<br>\r\n“Hey, brother, what are we going to do now? The door’s closed; we can’t get out!”<br>\r\n<br>\r\n“We’ll just have to stay here until we get an opportunity to escape. I promise I’ll figure out what happened to us and get us back to Central!”<br>\r\n<br>\r\n“But, Edward, what if Scott was telling the truth? What if we really are in another world? Alchemy doesn’t work here and there are things I’ve never seen before…”<br>\r\n<br>\r\n“You can’t believe what that giant says, Alphonse! Have you ever heard of anyone traveling to another dimension? It’s not scientifically possible! People don’t just pop into another world magically!”<br>\r\n<br>\r\n“I don’t see any other explanation…” Al mutters under his breath before sitting down in the cup. Just a few minutes later, Al spoke up again, “Uhh…brother. I know this is a bad time, but I’m kind of hungry…”<br>\r\n<br>\r\n“Ever since you got your body back, you’ve always been hungry!” Ed retaliates.<br>\r\n<br>\r\n“Well, I didn’t eat anything in over a year! Cut me some slack.”<br>\r\n<br>\r\n“Ugh…what do you think we’re supposed to eat?” Ed glances around the room, searching for something to appease his brother. </span></div></div>",
            "created":1275282000,
            "id":891959,
            "title":"Alone With the Metal Head"
        },
        "124111121":{
            "choices":[
                "Tommy Peers in and Sees Two Tiny Boys",
                "Tommy Peeks Inside and Sees Two Bugs That Need Stomped on"
            ],
            "content":"<div class=\"\"><div> <span>Ed climbed up to the edge of the cup and spotted a large bag of Lays' Sour Cream N' Onion chips laying below them. \"Psst, Hey Al! There's a bag of chips on the floor below! Come on lets go!\" Ed attempted to vault over the paper cup, but he was too heavy for the empty cup to handle his weight, and Ed ended up flying off the cup as it tipped over. He landed hard onto the floor, Al tumbled out and landed on top of him. \"Ow.....Ed....Are you okay?\" Al said as he slowly got up. <br>\r\n<br>\r\n\"Yeah....C'mon Al lets dig in!\" Ed said trying to force a smile. <br>\r\n<br>\r\nAl smiled hungrily as the boys ventured into the bag, which was littered with flakes big enough to fill the Elric's bellies. <br>\r\n<br>\r\n\"Wow.....It's like a cave that goes on forever!\" Al said as the empty paper crinkled under their feet. <br>\r\n<br>\r\n\"Yeah...Hard to believe we used to eat out of these things back home!\"<br>\r\n<br>\r\nAl reached down and picked up a crumb big enough to fill up his hand. He took a noisy bite and chewed, he swallowed after he had tasted enough. \"Ed! These are delicious! Did you manage to see what flavor they are?\" Al said shoving some more into his mouth.<br>\r\n<br>\r\nEd smiled, \"Yeah....It said they are Lays sour cream and onion.\" Neither brother knew what a Lays was though. Ed realized he was pretty hungry too. He picked one up on his brother's advice and took a bite, his eyes widened. \"Whoa...For something that sounds so nasty these taste amazing!\" He thought. <br>\r\n<br>\r\nSuddenly the bag started to shift, as Tommy, having again switched off the music since he couldn't really concentrate on the magazine with it on, heard the crinkling in the bag and decided to investigate it.</span></div></div>",
            "created":1275282000,
            "id":892160,
            "title":"Spotted!"
        },
        "1241111211":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Tommy plays with the two brothers.",
                "The Elrics attack him, but it doesn't go very well..."
            ],
            "content":"<div class=\"\"><div> <span>Tommy picked up the bag, thinking whatever you lost had gotten inside of it. When he peered inside of the bag, it took the teenager a moment to notice something other than crumbs at the bottom. Two tiny figures were looking up at the giant eye that was staring into the bag. Tommy blinked for a few seconds and said nothing. What was he supposed to say? Two boys were inside the bag of chips and they were so tiny! Not only that, but they looked familiar…<br>\r\n<br>\r\n“Holy crap…where have I seen you before…” Tommy muttered before reaching one of his hands into the bag. The brothers shouted and scattered, but the bottom of the bag was unbalanced and Edward was easily caught between two of the giant teen’s fingers.<br>\r\n<br>\r\n“No, Edward!!” Al shouted as his elder brother was taken from him. Tom brought Ed close to his face and smirked.<br>\r\n<br>\r\n“No way in hell…aren’t you Ed? From Fullmetal Alchemist?”<br>\r\n<br>\r\n“I’m Edward Elric, a State Alchemist! Put me down, you giant!” the blond bug yelled, struggling wilding in Tom’s hold.<br>\r\n<br>\r\n“Whoa…you can talk. This is some weird shit…” Tom dropped the bag with Al still in it and used both his hands to examine the miniature teen. Ed tried to fight the fingers, but there was nothing he could do to stop the bigger and older male from poking and prodding him. “Amazing…are you what Scott lost? Haha…I never would of thought.” <br>\r\n<br>\r\nAs Tom played around with Ed, Al crawled out of the bag and tried to make a run for it. Tom, however, spotted the fleeing boy.<br>\r\n<br>\r\n“Where do you think your going, little guy?” you brother asked as he raised one of his socked feet and lowered it onto the boy. Edward screamed for him to stop, but Tom’s foot continued to descend until it had covered his little brother. Ed, thinking his brother had just been crushed, stared down in shock. Tom saw Ed’s expression and chuckled. “Don’t worry, I didn’t crush him.”<br>\r\n<br>\r\nTom lifted his foot to show Al, lying on his stomach and still dazed from being covered in smelly sock. Tom reached down and snatched up the younger Elric and deposited him into his palm with Ed.<br>\r\n<br>\r\n“How long was Scott hiding you guys from me? He had  a lot of explaining to do…”<br>\r\n<br>\r\n“P-Please…leave us alone!” Al shouted up at the giant, but Tom just laughed in his face. Al really didn’t like Tommy compared to you. <br>\r\n<br>\r\n“Tough luck, kid. To tell you the truth, I’ve never really been into FMA. It has a bunch of badass characters, but I could never stand you two as main characters. That being said…aren’t you supposed to be a suit of armor or something?” Tom asked as he poked Al, easily toppling him over onto his back. Even then, he continued to poke and prod Al like he was some kind of toy and he was trying to figure out how he ticked. Ed shouted at Tommy, but the giant just ignored the angry bug’s words. </span></div></div>",
            "created":1275282000,
            "id":892179,
            "title":"Tommy's Discovery"
        },
        "12411112111":{
            "choices":[
                "Strips His Crusty Socks Off....Time for a massage.",
                "Suddenly There is a knock at the door"
            ],
            "content":"<div class=\"\"><div> <span>Tommy smirked evilly and got an idea. He tossed both boys up into the air, \"WHOAAA!!!\" they screamed as they were thrown high up in the air and their stomachs threatened to regurgitate the chips. Tommy caught them again and switched them each to their own hand, \"AL!!\" Ed screamed leaping from the hand that held him to the one that held Al. <br>\r\n<br>\r\nHowever Tommy just closed his fist around Ed, and to Al's horror, threw him across the room! Edward smacked against the door, hard enough to knock him out and bust his head open. Al sat there shocked at the giant's sadism, he couldn't stop staring at his brother's body...wondering if he was dead. <br>\r\n<br>\r\n\"Now....Are you gonna do what I say or will that happen again? Maybe to you this time if he's dead....Heh!\" Tommy smirked as he stomped over to the spot where Edward lay. <br>\r\n<br>\r\n**Outside in the hall**<br>\r\n<br>\r\nYou heard the loud <i>thwack</i> of Ed's body smacking against Tommy's door, and you rushed down the hall. <br>\r\n<br>\r\nYou put your ear up to the door and listened. <br>\r\n<br>\r\nThis is what you heard.<br>\r\n<br>\r\n\"Nope....I can feel him breathing...but his heads bleeding pretty bad....Think I should fix him up or maybe I should just make an example of him?\" <br>\r\n<br>\r\n\"No! Please don't let him die!\" <br>\r\n<br>\r\nYou were horrified, from what you heard, Tommy had found the brothers and had done something to Edward! You quietly tried the knob, damn, locked! <br>\r\n<br>\r\nYou had an idea though, you just hope Tommy wouldn't let Edward die in that amount of time! Your brother wasn't a bad person, he wouldn't....would he? <br>\r\n<br>\r\n\"Maybe he doesn't know they're as real as he is...\" you think as you race down into the living room to grab something to use in your plan. <br>\r\n<br>\r\nMeanwhile Al is crying for Tommy to save his brother. \"Please! I'm begging you! He's all I've got!\" <br>\r\n<br>\r\nTommy just rolls his eyes, \"Oh please, you're both just fictional characters in an anime....You can't really die the same as a real person could. You're not real, so how can you die!?\" <br>\r\n<br>\r\n\"B-But-\" <br>\r\n<br>\r\n\"No buts! I'm putting you to work right now! You may not be real, but you can provide me with some amusement for awhile before I decide you ain't worth the aggravation.\"  Tommy says as he.....</span></div></div>",
            "created":1275282000,
            "id":892389,
            "title":"Just In Time!"
        },
        "124111121111":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Tommy prepares to finish Ed off...",
                "Tommy actually helps him."
            ],
            "content":"<div class=\"\"><div> <span>Al watched as Tommy turned around and started walking away from Ed’s body. Al tried to keep his eyes fixed on his brother, but the giant’s huge body was blocking his vision.<br>\r\n<br>\r\n“No! You can’t just leave my brother there; he’ll bleed to death!” Al cried, banging his fists against your brother’s hand.<br>\r\n<br>\r\n“Shut up. You’re not real people; so why should I care?” Tommy replies as he seats himself on his bed.<br>\r\n<br>\r\n“W-We’re not fictional! We’re just as real as you!” Al shouts, tears streaming down his eyes. Ed had told him not to cry, but he couldn’t help it.<br>\r\n<br>\r\n“Yeah, yeah, yeah. What do think we’ll happen if he dies? Nothing, that’s what! The anime will still continue and people will still be posting loads of fanart on the Internet. You anime dudes can’t die like normal people.”<br>\r\n<br>\r\nAl just stared up at Tom with sadness, fear, and confusion. He didn’t understand what he was saying. Anime? Fanart? Internet? None of it made any sense! All he cared about was his bother was bleeding to death and this giant wasn’t doing anything to help him! When Tommy placed Al down by his feet, the younger Elric immediately spun around and moved to run. He barely got one foot in front of the other when Tom stomped his foot down threateningly.<br>\r\n<br>\r\n“Don’t you dare move, bug, or do you want to die before your brother does?”<br>\r\n<br>\r\n“I don’t care about me! I don’t want my brother to die!”<br>\r\n<br>\r\n“Well then…I’ll tell you what,” Tommy suddenly grips the end of his sock with his hand and tugs it clean of, sending white fluff everywhere. He places the foot in front of Al, which completely dwarfs him in size. “Give my foot a nice massage and maybe I’ll fix up poor Edward.”<br>\r\n<br>\r\n“B-But…he might die first!” <br>\r\n<br>\r\n“You better get rubbing fast then! How about this; if you do a good job but he ends up dying, I promise to keep you alive.”<br>\r\n<br>\r\nAl glared up at Tom with anger. The giant teen just didn’t get how much he loved his brother. Still, Al needed to obey or else this cruel giant would just crush him and Ed like bugs. Still sniffling, Al approaches Tom’s bare sole and touches it with his hands. Just an hour ago, he had loved being able to touch things again and feel them. Now, as he was touching this sadist’s sweaty fleshy foot, he was disgusted. Al moved his hands up and down, rubbing the teen’s rough sole. Tom grinned evilly down as he humiliated the younger boy. Bet he never through he’d be doing this after getting his brother back…<br>\r\n<br>\r\nAs Al massaged your older brother’s foot, he occasionally glanced back at his brother with a worried expression. Ed was still unconscious and not moving. He seemed so far away now, so Al couldn’t determine how badly his head was bleeding. <br>\r\n<br>\r\n*a couple minutes later*<br>\r\n<br>\r\n“Mmmh…that feels good, kid.” Tom cooed as he relaxed his head back.<br>\r\n<br>\r\n“Please…is this enough? You have to check on my brother!”<br>\r\n<br>\r\n“Ugh.” Tom reached down and roughly grabbed Al off the floor. “If it’ll shut you up…” <br>\r\n<br>\r\nTom stood up and stomped over to Ed’s prone body. Once he was standing over it, he reached down and pressed a finger against the alchemist.<br>\r\n<br>\r\n“Hmmm…looks like he’s still breathing…for now. He’s really durable, isn’t he?”<br>\r\n<br>\r\nAl breathed a sigh of relief and said, “Are you going to help him? Please, you have to!”<br>\r\n<br>\r\n“Don’t order me around, brat! I’ll help him…sure…”</span></div></div>",
            "created":1275282000,
            "id":892432,
            "title":"Bad Time for a Massage"
        },
        "1241111211112":{
            "choices":[
                "Run!",
                "Threaten To Break The Cd if he doesn't let the Elrics go!"
            ],
            "content":"<div class=\"\"><div> <span>Tommy carefully picked the unconscious Ed. Careful not to make him lose more blood. He brought him over to his dresser, he opened the drawer and pulled out a box of band-aids. \"Um...shouldn't you disinfect the wound before-\" <br>\r\n<br>\r\n\"Shut up!\" Tommy snarled.<br>\r\n<br>\r\nThough the shrimp was right, \"You stay here squirt. And don't get any ideas about running away or else!\" Tommy said stomping out of the room to go get some disinfecting spray from the bathroom. However he carelessly left the door open a crack! Al saw this and when he was quite sure Tommy was gone, he dashed over to his brother and began to drag him towards the door. <br>\r\n<br>\r\nHe wouldn't have made it all the way from the bed to the door at that size, had you not showed up at exactly the right moment! You were surprised to find your bro's door open, you hesitantly peeked inside and saw no one. You went in, your brother's favorite Cd in hand. \"Ok...If I know Tommy he'll do anything to keep this....Even give up his new toys! <br>\r\n<br>\r\nAlphonse saw you come in, and began to scream for help, anyone was better than your brother. \"HELP! HELP!! You've got to help him! Please!!!\" <br>\r\n<br>\r\nYou looked down at the carpet and saw Alphonse dragging Edward towards you. You stooped down and gently picked them both up. \"Quick! Hide us! He's coming back soon!\" Alphonse yelled with tears in his eyes You nod and place them gently in your pocket. You hear movement behind you, \"Hey! What are you doing in here!? And what the fuck are you doing with my Cd!?\"<br>\r\n<br>\r\nCrap....</span></div></div>",
            "created":1275282000,
            "id":892465,
            "title":"Helpful!"
        },
        "12411112111122":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "You and Alphonse talk.",
                "Alphonse is tired and falls asleep."
            ],
            "content":"<div class=\"\"><div> <span>You turn around to face your older brother and his pissed off glare. He slowly walks toward you, forcing you away from the door. Even though the two of you got along most of the time, when you didn’t it was never good. Tommy could be really intimidating when he wanted to be and you were embarrassed your brother, older by just one year, intimidated you so much. Maybe his emo-style haircut made him look more threatening…<br>\r\n<br>\r\nWhile Tommy glared at you, his eyes glanced over to where he had left the two boys. They were, much to his annoyance, gone.<br>\r\n<br>\r\n“Little brat; what did I tell him? I was all ready to help his brother, too.” Tom’s gaze turns to your pocket, which is rustling a bit. “You have them, don’t you? Give them back so I can teach the younger one a lesson!”<br>\r\n<br>\r\n“No! They don’t belong to you, Tommy!” you reply, backing away from your brother.<br>\r\n<br>\r\n“Oh, so they’re yours? Come on, Scott, they don’t even qualify as pets! They’re bugs! Fictional bugs, to be more accurate.”<br>\r\n<br>\r\n“No they’re not! They’re alive just like you and me and I want to help them.”<br>\r\n<br>\r\n“You’re such a softie; that’s why you like all those kiddie anime. Just give me Al; you can have Ed.” your brother says as he reaches a hand for your pocket. You quickly hold the CD with both your hands.<br>\r\n<br>\r\n“Back of Tommy, or I snap this in two!”<br>\r\n<br>\r\n“You wouldn’t dare! That’s my favorite album! Put it down!”<br>\r\n<br>\r\n“Give me the Elrics or else I’ll drop it in two pieces!” It looks like you have your brother on the ropes, but in truth you were a bit nervous. Unlike the Elric brothers, this CD was replaceable. You hoped your brother cared about it enough to exchange the two boys for it.<br>\r\n<br>\r\n“Ugh…fine.” Tommy shoves something into your chest. You grab the objects, which are a bottle of disinfectant and some band-aids. <br>\r\n<br>\r\n“What are these for?” you ask, puzzled. <br>\r\n<br>\r\n“You better tend to the short one before he bleeds to death.” is Tommy’s only response before he walks past you. Your eyes widen as you gaze into your pocket. Al is right at Ed’s side, who is bleeding heavily from the head. <br>\r\n<br>\r\n“What the fuck did you do, Tommy?!” you shout at your brother, but he has already returned to looking through his magazine and chowing down on pizza. You give him one last angry look before you dart out of the room and into your own. After locking the door, you kneel by your bed and gently deposit the two alchemists onto your mattress. <br>\r\n<br>\r\n“Hurry!!” Al shouts, still crying for his brother’s life. <br>\r\n<br>\r\n“I know, I know!” you reply as you grab a tissue from your bedside table. “Can you move his hair out of the way?”<br>\r\n<br>\r\n“Sure…” Al moves over to Ed’s head and lifts his golden hair off his forehead. His face twists as he sees the big gash in his brothers head. You quickly use the tissue to dab up the blood and then spray the tip of your finger with the disinfectant. You rub it onto the older boy’s forehead and then turn your attention to the box of band-aids. You take out the smallest one you can find.<br>\r\n<br>\r\n“Okay, let’s see here…” You tear the band-aid into an even smaller piece and gently wrap it around Ed’s head. It looks like he’s wearing a headband like the kind placed on patients with heavy head wounds. After the treatment, you sigh heavily and sit down on the floor.<br>\r\n<br>\r\n“Is…Is he going to be alright?” Al asked, not looking up from his brother’s face.<br>\r\n<br>\r\n“I don’t know. I didn’t see exactly how much blood he lost…” you reply, also worried about Ed. You’re confident he’ll recover though; he’s been injured worse before…although those times he had a hospital to go to.<br>\r\n<br>\r\n“Um…thank you.” you hear Al say. You look down at your bed to see the boy smiling up at you. His face still shows signs of his tears. You smile back down at him and tell him it was no problem. </span></div></div>",
            "created":1275368400,
            "id":892554,
            "title":"Saving the Elrics"
        },
        "124111121111221":{
            "choices":[
                "Has A Change of Heart About You",
                "Is Still Suspicious Of You..but not as much"
            ],
            "content":"<div class=\"\"><div> <span>You decide to try to make Alphonse more comfortable around you, and first on the list is apologizing for insulting their mother! \"Um..Al?\" <br>\r\n<br>\r\n\"Y-Yes?\" Alphonse says nervously looking up at you. <br>\r\n<br>\r\n\"I'm sorry about what I said. I really am, I can't begin to imagine the suffering you two were put through all your lives because of it. But I promise I'm your friend, I'm not like Tommy at all. I would never hurt either of you!\" You say smiling kindly at Alphonse.<br>\r\n<br>\r\n\"It's okay Scott, You helping Ed is enough for me to forgive you.\" Alphonse says patting your hand. <br>\r\n<br>\r\nYou smile wider, he was your favorite character by far. He was such a good guy. <br>\r\n<br>\r\nSuddenly Edward began to stir, \"Brother!\" Alphonse shrieked hugging Edward tight, \"Oh Ed, I'm so glad you're okay! I don't know what I would've done without Scott!\" <br>\r\n<br>\r\nYou blush at this. <br>\r\n<br>\r\nEdward opens his eyes and sits up, hissing in pain. <br>\r\n<br>\r\n\"Oww....What happened?\" <br>\r\n<br>\r\n\"My dickhead brother threw you and you were knocked up pretty bad. Its ok now though, I'll make sure he doesn't bother either of you.\"<br>\r\n<br>\r\nEdward looks up at you with narrowed eyes, \"We don't need protection! We need to go home! Now send us back!\" <br>\r\n<br>\r\n\"B-But I-\" You stammer. <br>\r\n<br>\r\nAl butts in, \"Brother...He saved our lives. He's not as bad as we thought. I think he didn't have anything to do with us coming here either. Maybe instead of yelling you should thank him?\" <br>\r\n <br>\r\nEd blinked a few times, \"You....saved us from that guy?\"<br>\r\n<br>\r\nYou nod. <br>\r\n<br>\r\nEdward...</span></div></div>",
            "created":1275368400,
            "id":892848,
            "title":"Talking"
        },
        "1241111211112212":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "You ask the brothers if they need anything else.",
                "Suddenly, you hear the phone ring downstairs."
            ],
            "content":"<div class=\"\"><div> <span>“Hmph, well thanks I guess.” Edward replies, folding his arms over his chest and turning away from you.<br>\r\n<br>\r\n“Ed! Don’t be rude; he saved your life!” Al shouted at his brother. One moment he was begging for his brother’s health, and now he’s angry at him?<br>\r\n<br>\r\n“So? I still don’t trust him. He may of saved us because he has another use for us. You shouldn’t trust people you don’t even know.”<br>\r\n<br>\r\n“Brother…”<br>\r\n<br>\r\n“It’s okay, Al.” you tell the younger boy, smiling down at Ed despite the scowl he was giving you. “Do you at least trust me enough to keep you safe?”<br>\r\n<br>\r\n“…yeah, I guess so. It’s better being around you than just wandering around waiting to be stepped on. Don’t go thinking we’re friends, though!” Ed started getting to his feet, but once he did he wobbled for a second and fell down. <br>\r\n<br>\r\n“Careful, Ed!” you say. “That wound in your head is pretty bad. You shouldn’t try to move so soon.” Edward scoffs and sits up again. His brother sits next to him and places hand on his shoulder. “Hey…are you two hungry?”<br>\r\n<br>\r\n“We ate some chips in your brother’s room, but not many.” Al replied, still feeling a bit hungry. He was worrying so much about Ed that he had forgotten.<br>\r\n<br>\r\n“Wait right here; I’ll be right back!” you tell them as you stand up and walk out the door. Once in the hall, you tiptoe down the stairs so Tommy doesn’t know you left the Elrics unprotected. He’s blasting his music again, though, so he probably won’t notice. A couple minutes later, you walk back into your room holding some cookies in your hand. “My mom made these last night; they’re chocolate chip.” You go to hand the brothers a cookie, but notice it’s giant to the boys. You chuckle and apologize before breaking the cookie into smaller chucks and putting the crumbs in a pile. The two bothers reach into the pile and start nibbling on the food.<br>\r\n<br>\r\n“These are really good!” Al says after swallowing his second bite. “Your mom’s a really good cook!”<br>\r\n<br>\r\n“Thanks.” You turn your head to Edward. “How are they, Ed?”<br>\r\n<br>\r\n“They’re fine…” the blond teen replies simply. <br>\r\n<br>\r\n“So, where is your mother?” Al asks as he finishes off his first crumb and reaches for another.<br>\r\n<br>\r\n“She and my dad left town of a few days. It’s just me and Tommy here right now.”<br>\r\n<br>\r\nYou and the Elric brothers sit there and talk for a few more minutes while easting cookies. After about ten minutes, Al sighs and pats his full stomach.<br>\r\n<br>\r\n“That was great. Thanks a lot, Scott!” Al thanks you as he smiles up at your face. You smile back and scoop the remaining crumbs into your hand before sending them all down your esophagus. You lick your lips and stare back at the brothers. You had rescued them from your brother and had somehow managed to get on their good sides. So…now what?</span></div></div>",
            "created":1275368400,
            "id":892892,
            "title":"The Elrics' Giant Protector "
        },
        "12411112111122121":{
            "choices":[
                "You decide to put in the dvd to show the boys",
                "There is a knock on your door"
            ],
            "content":"<div class=\"\"><div> <span>\"Um...Do you guys need anything else?\"<br>\r\n<br>\r\nAl is about to speak up when Ed butts in, \"Yeah as a matter of fact we do! We want a damn good explanation of what the hells going on!\" Ed says angrily. <br>\r\n<br>\r\nYou stare at the boys for a moment, seeing that Alphonse is as curious as his brother to know what is going on, you sigh and decide to explain. <br>\r\n<br>\r\n\"Sigh....I guess you guys deserve a real explanation. But please try to listen to me this time!\" Suddenly you get an idea. You stand up off the floor and walk over to your shelf to start looking through your dvd collection. <br>\r\n<br>\r\n\"What are you looking for Scott?\" Alphonse asks. <br>\r\n<br>\r\n\"You'll see!\" You say as you continue looking.<br>\r\n<br>\r\nA few seconds later you find what you are looking for, and hide it behind your back. \"Okay guys...Promise me you'll at least consider that I'm telling the truth this time!\" You say sternly.<br>\r\n<br>\r\nAl nods without question, where Ed 'hmphs' <br>\r\n<br>\r\n\"Ed! Do you want him to help us or not!?\" Al lectures his brother. <br>\r\n<br>\r\nYou bring the dvd out from behind your back and place it flat on the bed. It was a new one, it just came out. <br>\r\n<br>\r\nIt was the new dvd release of Fullmetal Alchemist: Brotherhood. Episodes 1-13<br>\r\n<br>\r\nEdward looks down at the square object and his eyes go wide. \"W-What is this!?\" Ed demands.<br>\r\n<br>\r\n\"I told you....You guys are fictional characters in my world. This recording shows everything from that fateful night....To when you meet Greed.\" <br>\r\n<br>\r\nAl and Ed look up at you in shock. \"You know about the homunculi!?\" Edward and Al shout in astonishment.<br>\r\n<br>\r\n\"Sure...everyone does. Like I said, everyone who's ever read about you or watched this on tv knows alot about you.\" <br>\r\n<br>\r\nEd shifts uncomfortably, as if he doesn't like the idea of his privacy being invaded by thousands of people from another world. <br>\r\n<br>\r\nAl however blinks confusedly, \"So um....everyone from this world knows everything about us?\" <br>\r\n<br>\r\n\"Don't get me wrong Al! Not everything......Just...the core stuff that involves your adventures. Trust me, Alot of people would be thrilled at the chance to even meet you guys! Think of yourselves as celebrities in this world....only you're really really popular fictitious celebrities.\" <br>\r\n<br>\r\nAl looks down for a second, and you try to cheer him up. \"It's ok Al! You still exist! It's not like my brother said! He was wrong! You just being here proves you're as real as I am!\" <br>\r\n<br>\r\nAl smiles up at you, \"Thanks Scott! That means a lot to hear that!\" </span></div></div>",
            "created":1275454800,
            "id":893229,
            "title":"The Truth"
        },
        "124111121111221212":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Al peeks out of the pocket to look at the outside world.",
                "Chris has to stop by his house for a moment."
            ],
            "content":"<div class=\"\"><div> <span>“Do you want to see for yourselves?” you ask, about to open the DVD case.<br>\r\n<br>\r\n“Um…no, that’s alright.” Al responds. “It’s not that I don’t believe you, it’s just I’d feel kind of weird watching myself.” Al chuckles nervously and scratches the back of his head.<br>\r\n<br>\r\n“Yeah, we’ll just take your word for it, I guess.” Ed follows.<br>\r\n<br>\r\n“Okay, I understand.” You put the DVD back on your shelf when suddenly you hear a knock at the door. “Who is it?”<br>\r\n<br>\r\n“It’s me.” a voice replies. The Elric brothers haven’t heard it before, but you know it too well. You walk over to the door, unlock it, and reveal the face of your bud Chris. <br>\r\n<br>\r\n“Hey there, Scott!” Chris greets you with a smile. Chris is one of your best friends and the two of you are a lot alike. You both like the same anime and you both have an older brother. His brother, Michael, is friends with Tommy. One thing that separates you from Chris is his body shape. While you are thin and not really into sports, Chris is closer to a jock and loves sports and exercise. Sometimes you wonder how he finds the time to play sports and watch anime…<br>\r\n<br>\r\n“Chris…how did you get in?” <br>\r\n<br>\r\n“Your brother let me in.” he replies, motioning over to Tommy’s door.<br>\r\n<br>\r\n“Oh…what re you doing here?”<br>\r\n<br>\r\n“What am I doing here? Don’t you remember? We were going to hang out today!”<br>\r\n<br>\r\n“Oh, right!” you say as you face palm. “I totally forgot!”<br>\r\n<br>\r\n“Geez, man, what were you doing that made you forget?” Chris asks as he tries to look past you and into your room. You quickly move and block his vision with your body.<br>\r\n<br>\r\n“N-Nothing! I’ll be right down; wait for me at the door.” you quickly say before closing the door. Chris stares blankly at the door for moment before silently mouthing “okay” and heading off. You walk back over to your bed and kneel down in front of the Elrics.<br>\r\n<br>\r\n“Shit! What am I going to do now? I can’t leave you guys here with my brother!”<br>\r\n<br>\r\n“Why don’t you take us with you?” Al suggests.<br>\r\n<br>\r\n“What about Ed? He’s injured; I can’t just-”<br>\r\n<br>\r\n“Don’t worry about me.” Ed cuts you off. “If you really have seen all my battles, you should know how tough I am!” <br>\r\n<br>\r\nYou seem to agree with him, as you quickly nod and scoop up the tiny brothers. They’re placed back in your pocket where they’ll be safe…unless they purposely try to climb out.<br>\r\n<br>\r\n“You better not be taking us somewhere to experiment on us!” Ed says, still not trusting you 100%.<br>\r\n<br>\r\n“Ed, be quiet.” Alphonse replies, rolling his eyes. A slight chuckle escapes your lips as you grab your wallet and place it in the opposite pocket. With that, you’re out the door. You yell to your brother that you’re heading out, but he probably can’t hear you because of his music. When you get to the front door of your house, you see Chris standing there with a can of soda in each hand. You place your hands on your hips and scowl at him.<br>\r\n<br>\r\n“Yeah, just take stuff out of the refrigerator like it’s yours.” you say sarcastically.<br>\r\n<br>\r\n“Hey, I was thirsty.” he laughs as he hands you your soda and takes a sip of his. With that, you’re both out the door.</span></div></div>",
            "created":1275454800,
            "id":893287,
            "title":"Your Buddy Chris"
        },
        "124111122":{
            "author_id":"nezuminom",
            "author_name":"NezumiNom",
            "choices":[
                "Down the hatch",
                "Guillotine of teeth"
            ],
            "content":"<div class=\"\"><div> <span>Smiling, Al's attention turns to the oversized plate nearby. \"Looks like we don't have to figure that out ourselves. Look!\" Ed turns his head to where his brother was pointing, and his eyes widen. \"Oh man....\" he licks his lips, suddenly feeling hungry, too, but his more rational side kicks in, \"Wait a minute...isn't that the plate that guy just brought in? Maybe it isn't safe.\"<br>\r\n<br>\r\n\"Aww...but...\" Al looks at his brother, eyes pleading, \"It won't be dangerous if he doesn't catch us. Besides, e won't miss a couple of little nibbles, right?\" Rolling his eyes, Ed nods and the two dart over, quickly getting up on the plate and to the large, meaty pizza.<br>\r\n<br>\r\nHowever, after only managing a couple bites, a sense of vertigo hts them as their platform is lifted swiftly up. Ed darts to the edge, but quickly regrets it as he looks down. In a matter of seconds, they had been whisked up over a hundred feet. \"Great, Al, just great! I told you it was dangerous! How the heck are we supposed to get down?!\"<br>\r\n<br>\r\n\"U-uhh...b-brother...\" Alphonse trembled from his spot on the pizza slice, \"I don't think that's our biggest our problem right now...\"<br>\r\n<br>\r\n***<br>\r\n<br>\r\nA rather bored look on his face, Tom's mind is elsewhere, wondering why the heck his little brother had been acting stranger than usual. What was it he could've lost in HIS room, anyways? He sighs and shuts the magazine,his other arm reaching down to pick up the plate. He pushes himself up to a better position, laying on his side, his snack beside him as he flips on the TV. Not paying to much attention, he would even notice the little extra topping as he lifted the slice up for a bite.<br>\r\n<br>\r\n***<br>\r\n<br>\r\n\"ALPHONSE!!\" Ed shouted as the pizza was whisked away, jumping to grab onto a stringy rope of cheese. Scaling up, he saw the shadow of the giant's face leer over the pizza. He climbed quicker, trying to get to his brother before the giant's teeth did.<br>\r\n<br>\r\nOn the slice, Al was backing up as best he could, but the cheese and various bits of sausage slowed him down. He looked up to find he had barely covered any ground, either. But worse than that, he saw the gaping mouth of the giant, saliva strung down the teeth and pooling around the tongue. He inched quicker away, seeing the faded white collumns descend.<br>\r\n<br>\r\nEd's hand grabbed the edge of the crust, about midway on the slice. A sudden force had slip off, however, and a deafening sound of breaking bread and torn meat met him. He looked over, trying to find his brother among the the bits of sausage and pepperoni that sat crumpled just in front of where the bite was. Nothing.<br>\r\n<br>\r\nPuling himself up a little more on his rope, he looked up to see the giant's jaw moving rather mechanically, methodically. \"A-Al...?\" He wasn't sure how to respond. He was as frozen with shock as the first day he had thought he had lost his little brother. Which could've just happened again. His hands loosened for a moment, but quickly regained their hold. then he saw the chewing cease. And a sickening noise hit him hard, making his heart sink.<br>\r\n<br>\r\nA slightly visible lump traveled down the male's throat with a rather audible gulp. And part of him knew, the part that was still thinking as logically as always, that his brother was there, being swallowed right before his eyes by this...this beast.<br>\r\n<br>\r\n\"You...YOU F--KING STUPID OVERSIZED SKYSCRAPER OF A MONSTER!!\" He hoisted himself up the cheese further, cursing and shouting all he could. \"You better not have hurt Alphonse or so help me I swear I'll kick your city-sized a--\"<br>\r\n<br>\r\nA forward motion forced him further down, the cheese nearly stretched to its limits. A row of shadowed white pillars came down on the bottom of the crust, and Ed could guess their was a matching set above. The chunk tore free easily, and Ed found himself being separated from the rest of the pizza. His lifeline of cheese started to tear at the base, and he was faced with either plummeting to his death, or....<br>\r\n<br>\r\nIt seemed his fate lie much worse than just a fall and break of the neck. Obviously nothing was to be left behind, and giant greedily slurped up the cheese with Ed at its end, being pulled in by the tongue. Before he had time to even scream, he tumbled into the giant's mouth.</span></div></div>",
            "created":1359176400,
            "id":1517736,
            "title":"That pizza sure looks good..."
        },
        "1241111221":{
            "author_id":"nezuminom",
            "author_name":"NezumiNom",
            "choices":[
                "Bottle 1",
                "Bottle 2"
            ],
            "content":"<div class=\"\"><div> <span>Pacing outside your brother's room, you wonder how you could possibly get the alchemists back now. How were you supposed to lure your brother out? He's already suspicious, so he wouldn't fall for anything too easily. Still concerned about the brothers, you lay on the floor and peer under the door, trying to spot the Elrics(maybe it'd be easier at this angle, anyways?)<br>\r\n<br>\r\nOut of the corner of your vision, you can see some small speck darting over the floor...it was the, you just knew it. Sighing you sit back up, glad to see they're unharmed. But how to get in...<br>\r\n<br>\r\nLooking back under the door, you find you can't see them anymore, figuring they must've hidden. Yours eyes move slightly to see your brother busy snacking on leftover pizza. Great. There's no way to get him out of his room when he's eating already.<br>\r\n<br>\r\nWait. Eating. Brothers suddenly not there. Pizza. Ed and Al. The fragments rearrange slowly in your mind, and you focus in on the slice, a bite already taken out of it. But that was impossible, wasn't it?<br>\r\n<br>\r\n***<br>\r\n<br>\r\nThe lumps and chunks of food are shoved around to the large teeth, the squishing and tearing and grinding deafening. Ed's hands are busy either covering his ears or helping to keep away from the smashing teeth. After what seems likes hours of chewing and gnawing, the masticated wad is shifted. Ed moves to the side, fumbling and sliding around the slick tongue. The sticky pieces of saliva have drenched him, and some remnants of the bite are glued to his clothes and hair.<br>\r\n<br>\r\nWith a shaky sigh, he slumps against a tooth and he hears the gulp that sends down the actual meal. He had been lucky to have dodged the serrated molars and being swallowed himself. But Al hadn't. Ed was still pondering on how he could Al out, as he knew his little brother would've known to avoid the teeth as much he did,<br>\r\n<br>\r\nHis victory was short lived-however, as he felt a rish of air come from the front of the maw. The sudden light had him seeing spots fro a moment, but that was soon over as some plastic tube eclipsed the outside world. It entered most of the mouth, thin and white, and it took the alchemist a moment to realize it was straw that was squished between lips and tongue. The saliva and ari and other bits of leftover food were tugged back as the giant began to suck up his drink.<br>\r\n<br>\r\n\"Haven't you had enough alreayd, you big--gack!\" A splash of fizzy dark liquid splashed him the face. While he had been able to hold onto the tongue for some suppoert before, the soda wettened his hands and lubricated his body. \"No, dammit! I'm not gonna be--!\" His leg was tugged on briskly by the esophagus, the sheer force of the swallow draggin him down. The drink sloshed down on him in gulping waves, pushing him further and deeper.<br>\r\n<br>\r\nAnd suddenly his grip broke, his wrist twisting as his head slipped by the uvula, through the epiglottis, and down, down, down, past the point of no return.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nA rush of panic overcame you, fearing the worst. They were there one moment, actually running in the direction of the plate, now that you think about it, and gone the next. And you had to get them back, somehow. Whether they were alive, you weren't sure, but you were going to give it the benefit of the doubt. But what was the chance that the two shrunken alchemists had climbed onto a slice of pizza willingly and not only got themselves eaten but also somehow survived such a thing?<br>\r\n<br>\r\nTossing the thought aside in the haste of things, you bang on the door, shouting your brother's name to get his attention. You look under the door once more, to see your brother bring a drink away from his face, belch rather unceremoniously, and walk over to the door. \"What do you want now?\" He shouts, opening the door as you stand up.<br>\r\n<br>\r\n\"You, uh...\" Well, what did you expect to tell him? As your mind races for an excuse, he stands there impatiently tapping his foot, waiting for an answer.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nThe flesh constricting, the little alchemist can't even struggle as he's guided down the giant's throat, the natural peristalsis forcing him closer and closer.<br>\r\n<br>\r\nHis feet got caught in a tighter fit, squeezing down to his knees. The  below seemed much hotter, but much more spacious. And he realized what that meant. He wriggled and writhed in the muscle's grip, trying to stay up and away from the stomach.<br>\r\n<br>\r\nA powerful gulp sent him the rest of the way in, shoving him down and into a pile of partially-digested food. \"Ugh...\" he took in a breath, but immediately regretted, recoiling and backing up, \"Wh-what the hell? Is this really...? ...ggg...DAMMIIIT...\" He shouted and kicked the nearest object, which just so happened to kick back with a shout.<br>\r\n<br>\r\n\"Gah! A-Al? Is that you?\" He couldn't see in the lightless organ, reaching out a hand to touch his brother's soggy head. The younger brother replied, taking his brother's hand in his, \"Who else would be in here with you?\" Ed laughed nervously, \"Right. Speaking of here...\"<br>\r\n<br>\r\nA rumbling sounded around them as the walls contracting, shoving them both into the deeper part of the stomach, which was filled up to their waists with soda and other fluids. \"Nng...We gotta get out, quick.\" Ed felt around, finding the lining of their prison again. He hadn't known much about the fundamentals of a digestive system, but he knew enough chemistry to know what would happen to them if they were left at the mercy of such acids for much longer.<br>\r\n<br>\r\n***<br>\r\n<br>\r\n\"I-I wanted to, uh, say I'm sorry for acting so weird earlier, first off...\" you stutter, wondering how to phrase it. How ere you supposed to ask that kind of thing anyways? 'sorry for bugging you, but you accidently ate two shrunken fictional anime characters, and I'd like them back before they're digested alive?' No, you needed a lie at a time like this.<br>\r\n<br>\r\n\"And?\" Your brother tilted his head, arms crossed.<br>\r\n<br>\r\nSmiling, you say, \"I just, well...I'd like to make it up to you. Maybe I could make you one of those sundaes you like?\" A plot was forming in your head, a devious one. You'd get hounded for it later, but it would have to do for now. With a suspicious stare, your brother slowly nods. \"The sundaes with the marshmallows in 'em?\" You eagerly nod back at him, \"Yep, and those little peanuts.\"<br>\r\n<br>\r\nRubbing your head playfully, although roughly, he replies, \"That's a good little servant. Maybe next time you lose something in my room, you'll leave it be.\" He grins triumphantly. \"Oh, of course, I've learned my lesson, Tommy,\" you say as you dash down the kitchen.<br>\r\n<br>\r\nThe little apology treat is whipped up in minutes, but now you have a choice as you open the medicine cabinet, seeing two bottles that could help you with your predicament. Even if your brother didn't swallow the Elrics, you could still consider this some revenge for him taking ten bucks and your earbuds from you last Tuesday.<br>\r\n<br>\r\nOne bottle is simply an off-brand medicine for upset stomachs. Of course, if one isn't sick to beign with, then it's more like the opposite effect, a perfect way to get them back up and out, so to speak. Although that may be rather unsafe as it could increase digestion momentarily.<br>\r\n<br>\r\nThe other does a bit of a...disagreeable choice. A simple muscle relaxant that could ease them out a safer yet more unsuitable way.<br>\r\n<br>\r\nSo, which to use...</span></div></div>",
            "created":1359262800,
            "id":1517805,
            "title":"Down the Hatch"
        },
        "12411112211":{
            "author_id":"nezuminom",
            "author_name":"NezumiNom",
            "choices":[
                "All is well...well, as well as well can get in this situation.",
                "Too late.........."
            ],
            "content":"<div class=\"\"><div> <span>If you were in their position, you'd probably rather go with something less unsanitary. Well, both of them are already pretty messy, but you know what you mean.<br>\r\n<br>\r\nBreaking open the capsule, you sprinkle the powder within onto the whipped cream, then take a cherry and place it right on top of that. After sticking a spoon in, you dart upstairs and begin knocking on your brother's door. After a couple of impatient seconds, he opens it, smiling, and takes his treat. \"Good work, little bro. ow, uh, go do your homework or something. And don't bug me again. Oh, and take this to the trash, will ya?\"<br>\r\n<br>\r\nAfter shoving the paper plate that once held the pizza into your hands, he practically slams the door in your face, but you don't care. You've done what you need to. You start to take the plate, but notice something shiny sticking out of a leftover bit of cheese.<br>\r\n<br>\r\nGasping, you pull out the silver trinket. If your proof before wasn't enough, this was. Ed's pocket watch. The one he kept on him at all times. You put it in your own pocket, tossing the plate like a frisbee into the bathroom trash just behind you(across form your brother's room). And, just to make sure, you peer under your brother's door. To your delight, he's already wolfing down the ice cream with plenty of whipped cream on it. Now, to just wait and watch...<br>\r\n<br>\r\n***<br>\r\n<br>\r\n\"Grrrr! If only I had my alchemy!\" Ed shouted, punching the stomach wall, although the only response he got was another rumble from it. \"Your insides would be transmuted into pudding by now!\" Although their consumer couldn't hear them, Al decided not to point that out and just let Ed blow some steam off. After kicking and banging and screaming, Ed finally slumped down next to Al. \"So, got any other plans, Alphonse?\"<br>\r\n<br>\r\nAl shook his head, looking around. They'd been in here for only a couple minutes, but the air already seemed to be out. And to make things worse, the acids were starting to get to them. The system gurgled and churned again, a bit more violently, shoving them into an undiscernable lump of processed food. \"Well, we gotta think of something, fast.\" Suddenly a glob of something cold fell right on top of the state alchemist.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nShoveling another spoonful in, Tommy was simply happy he'd finally gotten through to his little brother. It was about time he was treated right around here. And his brother really did make the best sundaes. He halted however, the next bite right in front of his mouth. Something was wrong.<br>\r\n<br>\r\nA gut-wrenching pain shot though him, his insides groaning and protesting against him. He started to shout out, but gagged. This wasn't going to end well. Storming out the bedroom door, he didn't even notice you standing with the bathroom door open rather expectantly, letting him in. He slammed the door behind him, and you burst out laughing.<br>\r\n<br>\r\nNow, you just had to hope the alchemists were alright.<br>\r\n<br>\r\n***<br>\r\n<br>\r\n\"Hasn't this guy had enough already?!\" Pulling himself out, he wipes off the ice cream. Their space seemed to be  getting smaller and smaller by the second. The muscles of their prison squeezed tighter, forcing the alchemists andtheir little safe spot to be drenched in fluids. Another lump of ice cream toppings landed amongst them.<br>\r\n<br>\r\nThe stomach shuddered and contorted, getting uncomfortably hot and cramped, more so than before. \"Great,\" Ed said, his face squished so his words were muffled some, \"Just great. When I get my alchemy back, this guy is the first to go.\"<br>\r\n<br>\r\nThe acids at their feet were roiling now, tingling them. \"Brother...\" Al said, a tinge of panic in his voice, \"Any ideas yet?\" Swearing Ed, replied, \"No. If we tried to just crawl back up, we'd get swallowed back down. That is if we could even pry apart the opening first.\" Trying to keep one foot out of the bile, he grimaced as it just rose even more. \"This isn't right....\"<br>\r\n<br>\r\n\"Tell me about it,\" Al added, \"I just got my body back. I don't wanna be digested!\" Ed shushed him, thinking. \"No, I mean the process. It isn't this fast. Digestion doesn't kick in so violently like this.\" Dipping a gloved finger into the fluids, he examined it. \"See? It's even kinda thicker than its supposed to be, if my chemistry's right. Something's messing with the composition of the HCL and pepsin, like a reverse antacid.\"<br>\r\n<br>\r\nThe organ constricted around them, groaning and bunching up. \"Hmm...Al, this could either end really well for us,\" the acids doubled up, reaching their waists and then torsos, \"Or really, really bad.\"</span></div></div>",
            "created":1359464640,
            "id":1519387,
            "title":"Bottle 1"
        },
        "124111122111":{
            "author_id":"nezuminom",
            "author_name":"NezumiNom",
            "choices":[
                "\"Well, you see, uhm...y-you're...anime characters.\"",
                "\"So...how exactly did you even get here? And why are you so, heh heh...small?\""
            ],
            "content":"<div class=\"\"><div> <span>Retching and gags and inhuman noises came form behind the door, and for a moment you felt kinda bad...but then you remembered who it was that was in there, and that it for a good cause. After a few moments, you knock on the door, asking, \"Everything alright, big bro?\" You stifle a laugh, but the door suddenly slams you in the face, your brother shouting your name.<br>\r\n<br>\r\nRunning seemed to be the beast option here, and so you were subject to quick chase scene before you re-routed to the bathroom, shutting the door in Tommy's face and locking it. \"You'll pay for this, you little--\" He began shouting and cursing and banging on the door, you laughing all the while.<br>\r\n<br>\r\n\"If you're done with your gloating,\" Ed's voice reached you, making you stop, \"We'd like to get cleaned up as soon as possible.\" Turning, you see the two alchemists standing on the rim of the seat, drenched in...well, you didn't really want to think about what that was. Instead you pick them up and place them by the sink, turning on the faucet for them.<br>\r\n<br>\r\n\"Sorry about all that,\" you say, feeling somewhat guilty, \"I shouldn't have made you run off like that.\" Sliding down under the water, Al sighs, \"No, don't apologize. If anything, we owe you an apology. And some thanks, too.\" He elbowed his brother, who was busy trying to wash out his hair, the ponytail undone and his coat tossed aside. Huffing, he adds, \"Yeah. Thanks. And uh...s-sorry....\"<br>\r\n<br>\r\nGrinning, you take a washcloth off the towel rack and set it down for them to use to dry. \"It's alright. How about a fresh start then? And maybe we can exchange some explanations.\" Nodding, Ed and Al get cleaned up (although you note they'd need some new clothes, preferably ones that aren't partially chemically melted), and walk over to the edge of the sink. You carefully extend a hand to them, hoping they'll come with you.<br>\r\n<br>\r\nEd steps on, warily, followed by Al. After checking to make sure Tommy had given up the chase, you sneak out of the bathroom and walk back to your room, shutting the door behind you. \"So, uh, this is my room...\" you say, unsure how to start, \"You can stay where you like, I guess. Seems you won't take up much space, heh.\" Although Ed glares, he doesn't say anything, letting you go on.<br>\r\n<br>\r\n\"So, first off..\" What were you supposed to tell them? Perhaps maybe starting with the fact that they're fictional characters could work. Or maybe asking them how they got here. Hmm...</span></div></div>",
            "created":1359499680,
            "id":1519756,
            "title":"Escape"
        },
        "1241111221112":{
            "author_id":"nezuminom",
            "author_name":"NezumiNom",
            "choices":[
                "\"...that new movie premiere!\"",
                "\"...that party that one guy's throwing and inviting everyone to!\""
            ],
            "content":"<div class=\"\"><div> <span>Immediately, Ed's face turns red, and you can practically see the little anime vein pulsing on his temple. \"I'm not usually this height! If I were my real size, I bet I'd be way bigger than a giant like you! So don't call me a mouse-sized quarter-pint who can even reach the rim of a glass?!\" Huffing, he sits at the edge of your hand, which you lower to let him onto the desk by your bed. Al starts apologizing, but you can't help but laugh.<br>\r\n<br>\r\n\"What's so funny, huh?!\" He shouts, to which you try and cover your chuckling with a small cough. \"Oh, uh, nothing,\" you say, although really you weren't so much laughing at him, more like you were just enjoying being able to actually see one of Ed's little freak-outs. \"Anyways, that didn't really answer my question.\" Sitting on the chair in front of them, you wait a few moments for Ed to calm down, then they speak.<br>\r\n<br>\r\n\"To be honest, we don't know what happened, ourselves. We just kinda wound up here after this bright light flashed around us. It could be alchemic, but I haven't ever heard of anything like this happening.\" His story brings a bell to mind, and you glance over at the tv in your room. \"Now that you mention it, my television did get this odd white glow to it.\" The elrics follow your gaze, looking at the large screen. \"Although,\" you add, \"I guess that sorta makes sense with you two of all people to end up here, since you're ani--\"<br>\r\n<br>\r\n\"I'm hooome!\" Your dad calls out, interrupting your statement. \"Oh, geez, I almost forgot, my dad was bringing one of my friends by. Umm....\" you try to think of what to do with them, but they answer for you, \"We kinda wouldn't mind going with you, just so we don't get caught by someone else, but if it's too much trouble, it's fine.\"<br>\r\n<br>\r\n\"No, no, it's no trouble!\" You say, glad that they want to tag along. \"Okay, hmm...\" You try to think of how to hide them, hearing your friend coming down the hallway, calling your name. \"One second!\" You say back, then grab your jacket and the two brother, putting them in your pocket. \"You okay in there?\" You ask, to which a couple of muffled voices reply something back.<br>\r\n<br>\r\nYour friend enters shortly after, and whirl to face him, trying to look inconspicous. \"Hey, man, what's up?\" He smiles back, fixing his  shaggy blonde hair some. \"Not much, just lookin' forward to hangin' out with my favorite bro.\" You two exchange a fistbump and exit your room, heading to the living room.<br>\r\n<br>\r\nWaving to your dad, you say, \"We'll be back at ten or so k?\" He stops you and asks, \"Where're you going, exactly?\"<br>\r\n<br>\r\n\"Oh, just back over to his house,\" you point to your frined, smiling earnestly. Nodding, your dad lets you two go off, walking.<br>\r\n<br>\r\nAfter you're a couple houses away, your friend asks, \"So, where' we really going? 'cause I know we aren't studying at my house.\" With a wry smile, you reply, \"'Course not. We're going to...\"</span></div></div>",
            "created":1359588420,
            "id":1520612,
            "title":" Why so small?"
        },
        "13":{
            "choices":[
                "Soul",
                "Black Star",
                "Death the Kid",
                "All Three At Once!",
                "More Duo Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Character shrinks?</span></div></span></div>",
            "created":1275714000,
            "id":895089,
            "title":"Soul Eater"
        },
        "131":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Climb down the desk and make for the door!",
                "There's an open window right behind him...head that way!",
                "Too late! Scott's already coming back!"
            ],
            "content":"<div class=\"\"><div> <span>\"Ungh....jeez...not cool...\" Soul muttered to himself, holding his head as he slowly looked around. He appeared to be on a vast plain of some kind, with strange wiry roots growing up around him. He got to his feet with a wince, his entire body aching like he had been beaten with a metal pipe. He had been having a completely ordinary day. Maka woke him up, he got dressed, they ate breakfast, they went to school, he got into a fight with Black Star...\"Wait...something was weird about that...\"<br>\r\n<br>\r\nHe thought back to the moment, Black Star polishing his bicep as he shouted, \"Get ready to get hit by my newest technique Soul! It's gonna hit you so hard you're going to get blasted into another DIMENSION!\"<br>\r\n<br>\r\nSoul groaned as  he remembered the punch, right to his gut. It had knocked him clear backwards off his feet and he had even blacked out momentarily! \"That moron...\" Soul growled, low in his throat. \"When I'm through with him he's going to wish--\"<br>\r\n<br>\r\nTHOOM!<br>\r\n<br>\r\n\"What the hell...?\" Soul said, looking around for the source of the sudden, deep noise. His eyes slowly widened as he began to take in the area around him. A gigantic wooden construct with metal knobs...a dresser? An enormous white slab raised high into the air, material dangling from the sides...a bed? A vast structure stretching along a wall with plush looking mats...a couch?<br>\r\n<br>\r\nTHOOM!<br>\r\n<br>\r\nInterrupting his thoughts was that booming sound once more, coming from somewhere behind him! He quickly whipped around, his mouth dropping open as he gazed up...and up...and UP at a colossal giant walking slowly towards him, his enormous feet crashing into the ground with every step!<br>\r\n<br>\r\nTHOOM! THOOM! THOOM!<br>\r\n<br>\r\n\"Not cool...not cool!\" Soul shouted, his head craning back as a massive bare sole suddenly loomed into view, casting him in its shadow. \"Hey..HEY! YOU GIANT FREAK! DON'T YOU DARE STEP ON ME!\"<br>\r\n<br>\r\nScott stopped as he heard what sounded like a tiny squeak coming from the floor. It was only a momentary hesitation however as he figured that he was just hearing things, his foot coming down...right on top of something sharp! \"YEOWCH!\"<br>\r\n<br>\r\nHe leaped backwards, grabbing his foot with both hands, hopping up and down on the other. Down on the ground, it was like being caught in an intense earthquake, Soul's miniature body getting thrown left and right! \"I MUST HAVE STEPPED ON A TACK!\" He heard a booming voice say from above. Soul, who had landed on his back, looked up as he saw the giant teen crouch down in front of him, an angry look on his face. Soul gulped, the face seeming to grow in size as it got closer, descending on him like the moon falling from the sky, stopping just inches above the spot where he was supine. \"Hmmm...\" Scott said in a quieter voice, examining the creature on the ground. \"You're not a tack...just some funny looking bug...I don't see any spikes on you though...\"<br>\r\n<br>\r\nBefore Soul could say anything, he was covered by gigantic hand, the thick fingers wrapping tightly around his tiny body like a vice grip, lifting him up to dizzying heights. Scott's fingers slowly spread again as he brought his hand up to his face, examining his find in the better light. Soul slowly got to his feet, brushing himself off, only to be pushed right back down immediately against the warm palm. He struggled against the single digit but he was powerless, his hands doing nothing to stop the prodding and rubbing of his little body. \"HEY! KNOCK IT OFF!\"<br>\r\n<br>\r\nScott's expression went from amused to shocked as he heard that tiny voice clearly this time, quiet and squeaky as it was. \"Did...Did you just say something?\" He asked in awe.<br>\r\n<br>\r\nSoul sighed, hands in the pockets of his jacket, and said, \"Yeah. I did! I'm not some dumb bug or a tack or anything like that! My name is Soul Eater Evans and I'm a weapon from the DWMA! So if you think you can just mess with me you've--\"<br>\r\n<br>\r\n\"OH MY GOD!\" Scott bellowed, the sound intense enough to send Soul flying across the man's palm, smacking into the curled fingers behind him. \"You are! You're really him! Holy crap this is amazing! I was JUST watching you on TV last night! You look JUST like you do on the show! You even SOUND the same! This is too awesome! I've got to be dreaming!\"<br>\r\n<br>\r\nSoul grit his teeth, annoyed at this titanic idiot, and turned his arm into a scythe, cutting neatly into Scott's fingers. \"OUCH! H-Hey...you stabbed me in the foot earlier too, didn't you? You little punk...\"<br>\r\n<br>\r\nBefore Soul knew what was happening, the fingers had curled around him again, holding him tight, cutting off his air supply slightly. \"You know, you're a whole not nicer in the show. How about you stow the attitude and tell me why you're here?\"<br>\r\n<br>\r\n\"Off to a bad start...\" Soul thought to himself, wincing as he felt the strength in those fingers. If Scott so much as increased his grip a little Soul would end up a red smear against his palm! \"I don't know how I got here! I was just...fighting with Black Star and he punched me and...I ended up here!\" Soul was finding it hard to believe HIMSELF that Black Star may have actually managed to punch him into a separate dimension but...that seemed to be the case here. \"Anyway...what do you mean you watched me on TV last night?\"<br>\r\n<br>\r\n\"Oh!\" Scott said, moving over to his desk, depositing Soul on top of an object there. \"Look, see?\"<br>\r\n<br>\r\nSoul found himself standing on smooth, plastic surface, his own face grinning up at him. \"What the...?\" Soul mumbled, looking at the bigger picture. Everyone was there! Maka, Black Star, Tsubaki, Kid...and blazoned across the top of it were the words Soul Eater in a black, spiky font. Judging by the size and shape of the thing he was standing on, he guessed it was some kind of DVD...but how?<br>\r\n<br>\r\n\"See? Around here, you're a character in a TV show!\" Scott said brightly, snatching Soul up by the back of his jacket, letting him dangle between thumb and index finger. He opened the DVD up and showed him the discs inside. \"I've got the whole series! Still working on the manga though.\"<br>\r\n<br>\r\n\"T-There's a manga too?!\" Soul shouted, this new revelation shocking him once more.<br>\r\n<br>\r\n\"Well, yeah, and video games probably too but none ever come out in America...\" Scott said, sounding slightly bitter about it. \"Anyway, what's it like living in a world like that, with all the demons and fighting and stuff?\"<br>\r\n<br>\r\nSoul looked up at the sparkling, interested eyes of the giant before him...and jabbed him in the finger with his scythe arm again! \"OUCH!\" Scott yelped for the third time that day, dropping Soul in a heap on his desk. \"Stop DOING that!\" He thundered, slamming his open palm against the desk, right next to Soul. \"What the hell's your problem?!\"<br>\r\n<br>\r\n\"My PROBLEM is that I'm trapped in this...this weird world and all YOU can think about is yourself! How about helping me get OUT of here?!\" Soul shouted right back.<br>\r\n<br>\r\nScott glared down at the tiny, vulnerable Soul and slowly smirked. \"Yeah...you ARE trapped here. All alone with me.\"<br>\r\n<br>\r\nSoul felt his blood run cold...he didn't like where this was going. Before he could so much as apologize, that finger descended from the heavens once more, jabbing Soul painfully in the gut. He felt his body slowly slide across the desk, getting closer to the edge!<br>\r\n<br>\r\n\"So if you WANT my help and DON'T want to end up as a pathetic stain on the bottom of my foot...\" Scott said threateningly, pressing his finger down even harder against Soul's body. \"Do. Not. Piss. Me. Off.\"<br>\r\n<br>\r\nThe finger was removed after that, leaving Soul wheezing and gasping for breath. Scott sighed and shook his head slightly. \"Honestly...you were always my favorite character too. I don't want to have to hurt you you know. I'm going to get some bandages for my hand and foot. Don't you move! I'll be right back.\"<br>\r\n<br>\r\nHaving given this order, Scott turned and left, leaving Soul alone to contemplate his situation. He was trapped in a different dimension, at the hands of a man who had made it clear he was not to be defied, with no hope for escape unless he played along with his stupid games! He gritted his teeth as he slammed his fists against the desk top. \"This is the exact OPPOSITE of cool! I'm not just a stupid bug, I'm not just a stupid character in a TV show, and I'm NOT going to just stay here and get humiliated by that dumbass!\"<br>\r\n<br>\r\nSoul swiftly jumped to his feet, taking stock of the room around him. What would be the best plan of action?</span></div></div>",
            "created":1396987140,
            "id":1775490,
            "title":"Watch Your Mouth"
        },
        "134":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "You glance down and see a few bugs crawling up your pants. ",
                "Black Star punches you, getting your attention. ",
                "You stand up and leave your room, unknowingly bringing along a few passengers."
            ],
            "content":"<div class=\"\"><div> <span>Soul Eater Evans woke up to the bright light of your bedroom light. His crimson eyes fluttered open as he adjusted to the unusually bright light he was staring at. Once his eyes had adjusted, he noticed the ceiling of the room he was in. It wasn’t the color of HIS bedroom ceiling and he never remembered it being so high up. Puzzled, the albino weapon sat up and glanced around. His eye widened in shock as he noticed how everything was huge.<br>\r\n<br>\r\n‘What the hell is going on?!” shouted a teen, but not Soul himself. Soul looked next to him and saw none other than Black Star standing there. The meister looked around and suddenly noticed Soul sitting next to him. “Whoa, Soul?! What are you doing here?”<br>\r\n<br>\r\n“Hell if I know.” Soul replied as he stood up and put his hand sin his pockets. “One minute I’m taking a nap and the next I’m here. You?”<br>\r\n<br>\r\n“Same thing. I just finished a workout and laid down for a minute.”<br>\r\n<br>\r\n“My story is also similar.” came a third voice, who Soul and Black Star recognized as Death the Kid’s. The suited young man appeared next to them, looking equally confused. <br>\r\n<br>\r\n“You too? Man…” Soul scratched his head as he tried to figure out what the heck was going on.<br>\r\n<br>\r\n“I take it nether of you have anything to do with this?” Death’s son asked, glaring at the two males a sif they were the culprits. <br>\r\n<br>\r\n“Heck no! If it was us, why would we shrink ourselves?” Black Star shouted. <br>\r\n<br>\r\n“Because your…ahh, forget it.” Kid glanced around the room again. “Whoever did do this has horrible taste. This room isn’t symmetrical at all!” <br>\r\n<br>\r\n“I’m going to find whoever did this and give them a piece of my mind!” the blue haired teen said as he clenched his fist and took off without another word.<br>\r\n<br>\r\n“Hey! Where are you going?!” Soul yelled after his friend, but he didn’t stop.<br>\r\n<br>\r\n“Just leave him.” Kid said as he started to walk forward. “Lets try and find any clues that can tell us where we are.”<br>\r\n<br>\r\n“Who made you boss?” Soul muttered under his breath as he followed Kid. The two walked across your carpet until they came to a large structure; your couch. As Soul approached it, he accidentally tripped over something and fell flat on his face.<br>\r\n<br>\r\n“Arg, damn it!!” Soul cursed as he got back to his feet. “Well…this isn’t a dream.”<br>\r\n<br>\r\n“I could of told you that. Try to watch where you’re going so you don’t trip over…” Kid looked at what Soul had tripped on and was suddenly suppressing his laughter. Soul looked at him confused until he looked down and saw that he was standing in some kind of fabric. It suddenly dawned on him that it was a pair of boxers you had left on the floor. <br>\r\n<br>\r\n“Oh god! Not cool!” Soul cried as he jumped off the boxers. Kid would of erupted into laughter at this point if a sudden booming noise hadn’t distracted him. Soul and Kid were both startled by this booming sound as it got closer and closer. The ground under their feet started to vibrate and they watched as your gigantic form appeared beyond the couch. How the heck had they not seen you?!<br>\r\n<br>\r\n“Holy crap…” Soul muttered as he gazed up at your towering form. Both boys were in such awe of your size that they probably would have been crushed if you got any closer. Thankfully, you stopped right in front of them and seated yourself on the couch. Soul and Kid watched as you grabbed the TV remote and pointed it at the screen.<br>\r\n<br>\r\n“I hope it still works.” you say as you click on the TV and start flipping through the channels, making sure they were all coming in clearly. <br>\r\n<br>\r\n“Hey, Soul, wasn’t Black Star running in the same direction this giant came from?” Kid asked. <br>\r\n<br>\r\n“You’re right!” Soul exclaimed as he look at your gigantic sneakers. What if you had stepped on him? <br>\r\n<br>\r\n“Hey guys! Up here!” Black Star shouts, earning his two friends’ attention. Soul and Kid looked up to see the muscular meister standing on top of your shoe. You were completely oblivious to the tiny Black Star.<br>\r\n<br>\r\n“Black Star? What are you doing up there?” Kid asks. Black Star merely folds his arms over his chest and laughs.<br>\r\n<br>\r\n“I found this guy and knew right away he was the one who did this to us! I’m going show him why I’m the BIG guy, even when shrunken!” Black Star answered. Before either of the two boys could shout back, Black Star started climbing up your pants leg. <br>\r\n<br>\r\n“Damn him!” Kid cursed as he ran over to your shoe and jumped on top of it. <br>\r\n<br>\r\n“You guys are going to get yourself killed!” Soul shouted at his two friends, but they weren’t listening. The red eyed weapon stood there for a moment before breathing a heavy sigh and following Kid. As you flipped through the channels on your television, you had no idea there were two meisters and a weapon in the room with you…and climbing you to boot! </span></div></div>",
            "created":1275714000,
            "id":895121,
            "title":"Two Meisters and a Weapon"
        },
        "1341":{
            "choices":[
                "Brush them off and continue watching Tv",
                "Squash Em!",
                "See What Kind of Bugs They Are"
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately for the the two miesters and the weapon (who had gotten past your shoe and began to scale your pants now), you just happened to drop the remote. \"Damn.\" You sigh as you reach down to pick it up, that's when you notice three unusually large bugs crawling up your jeans. <br>\r\n<br>\r\n<br>\r\n<br>\r\nLuckily for the boys they were in good shape and used to physically demanding tasks such as this, so they didn't tire easily. However when the large remote clattered to the floor below them and they saw you leaning down to them to get it, they froze. <br>\r\n<br>\r\n\"Don't move!!\" Kid yelled. <br>\r\n<br>\r\nThat was when your eyes locked onto them, they couldn't tell from your expression whether or not you were going to brush them off as bugs or not, either way they were-\"Black Star NO!!!\" Kid and Soul screamed at the same time when Black Star jumped straight toward your face! \"AAAAAAARGH!!!\" He yelled out as he flew through the air and came to rest on the tip of your nose. <br>\r\n<br>\r\n\"Gah!!\" You yelp in surprise when Black Star lands on your nose and begins to attack. \"Ow!!\" You yell out in pain.<br>\r\n<br>\r\n\"Idiot!!\" Soul yelled as he and Kid held on for dear life as Black Star's attacks surprised you and caused you to jump.<br>\r\n<br>\r\nYou angrily pluck the bug off the tip of your nose and flick it across the room. Black Star was knocked unconscious by the force of it and ends up sailing somewhere onto the sea of carpet. <br>\r\n<br>\r\nYou look down at your pants and see the other two bugs....</span></div></div>",
            "created":1275800400,
            "id":895711,
            "title":"Brave Bug"
        },
        "13411":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "The door behind Black Star suddenly opens.",
                "Black Star reaches the couch after several minutes. "
            ],
            "content":"<div class=\"\"><div> <span>Your stare turns into a glare as you spot the two bugs clinging to your pants. Was your room infested now? Did these bugs think they could just crawl on top of you. The two teens could only watch was you bent down and brushed them off your pants. They were helpless against your gigantic hands and were easily swept off the fabric toward the carpet. Luckily, the force wasn’t as bad as when Black Star had been flicked, so they were still conscious hen they hit the floor.  Soul groaned as he rubbed the back of his head and looked up. <br>\r\n<br>\r\n“Oh, geez…”<br>\r\n<br>\r\nYou glaring down at him with a look of annoyance. Soul didn’t like that look at all; it’s as if you were looking at him like he wasn’t a human being at all, but something less. <br>\r\n<br>\r\n“Does he think we’re bugs or something? Do I look like a bug?! Bugs are not cool, like I am!” Soul says, but you’re not trying to hear him so none of his words reach your ears. However, his question was still answered. <br>\r\n<br>\r\n“Damn bugs. I’m going to have to scrape you off my shoes now…” you say, your voice sending chills down Soul’s spine. Before you can even raise your foot, however, your attention turns to the TV. “Holy crap! I didn’t know this was on now!” <br>\r\n<br>\r\nSoul watches as you forget about him completely and sit back down on the couch. Your attention is glued to the flickering lights of the screen and for now it seems like he’s in the clear. The white haired weapon breaths a sigh of relief and gets to his feet.<br>\r\n<br>\r\n“That was a close one, eh Kid?” he asks, but gets no response. He quickly take takes a look around, but cannot find the snappy dresser anywhere. “Shit, he must of fallen somewhere else!” The sharp toothed teen ruffles his hair before choosing a direction and begins walking. This room was gigantic and there was a giant who thought he was a bug in it. How was he supposed to survive, let alone find his friends?<br>\r\n<br>\r\n***<br>\r\n<br>\r\n“Ugh…that was unenjoyable.” Kid muttered as he got to his feet with a little effort. A quick glance around showed him that Soul was nowhere in sight. His situation just got worse and worse. As he tried to think how it could get any more worse, your foot suddenly stomped down next to him. The Shinigami jumped back in fright and looked up at your seated form. “I can’t believe how big he is. At that size, he might even be stronger than father!”<br>\r\n<br>\r\nKid knew being around you was dangerous. He had seen what you did to Black Star. One of the strongest guys he knew…merely flicked aside like a bug! If he spent too much time near your feet, he might end up under them!<br>\r\n<br>\r\n“I need to think this over again…and do it anywhere but here.” Kid told himself as he carefully walked around your feet. You didn’t notice him at all, since your eyes were glued to the TV. Perhaps that was a good thing, since the first thing you would probably do if you saw a pesky bug skittering around your feet would be to stomp it…<br>\r\n<br>\r\n***<br>\r\n<br>\r\nOn the other side of the room, near the door, Black Star was laying unconscious on the floor. Someone as tough as him wouldn’t be out for long, though, as the blue haired meister quickly regained consciousness and sat up in full alert. <br>\r\n<br>\r\n“What? How’d I get over here?!” he shouts as he looks around, puzzled. His eyes fall upon you, sitting on your couch like nothing had just happened. The muscular ninja’s face twists into one of anger as he hops to his feet. Everything was coming back to him now. “That bastard! How dare he flick me! I’m the guy who will surpass God! This time I’ll defiantly clobber you!” Black Star speeds off at max speed toward the couch. However, at his small size, his fastest seemed like a crawl to the average person. It would take him awhile to trek across your room.</span></div></div>",
            "created":1275886800,
            "id":895741,
            "title":"Separated "
        },
        "14":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "goku",
                "kid gohan",
                "vegeta",
                "piccolo",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>whos it gonna be</span></div></span></div>",
            "created":1307336400,
            "id":1120793,
            "title":"Dragonball Z"
        },
        "141":{
            "author_id":"giant237",
            "author_name":"Broken",
            "choices":[
                "Kid Goku",
                "Adult Goku (DBZ)",
                "Adult Kid Goku (GT)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Goku?</span></div></span></div>",
            "created":1432093620,
            "id":1980422,
            "title":"goku"
        },
        "145":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "kid goku",
                "teen or gohan (buu saga)",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok hoow about these guys</span></div></span></div>",
            "created":1307336400,
            "id":1120794,
            "title":"even more dbz guys"
        },
        "1453":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "tien",
                "krillin",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok so how about these</span></div></span></div>",
            "created":1307336400,
            "id":1120796,
            "title":"more dbz men"
        },
        "14533":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "goten ",
                "trunks (future   or kid )",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about goten or  trunks    maybe both</span></div></span></div>",
            "created":1307336400,
            "id":1120798,
            "title":"how about goten or trunks"
        },
        "15":{
            "author_id":"pokemon54321",
            "author_name":"poky",
            "choices":[
                "Bleach",
                "Pokemon",
                "One Piece",
                "Sonic",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or these....</span></div></span></div>",
            "created":1288760400,
            "id":985961,
            "title":"Other"
        },
        "151":{
            "author_id":"pokemon54321",
            "author_name":"poky",
            "choices":[
                "Single character",
                "Multiple character",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want the character alone or with company?</span></div></span></div>",
            "created":1318482000,
            "id":1205678,
            "title":"Bleach"
        },
        "152":{
            "author_id":"keyblade",
            "author_name":"Dr. Shrink",
            "choices":[
                "Ash.",
                "Max.",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Who from Pokemon?\"</span></div></span></div>",
            "created":1317445200,
            "id":1198421,
            "title":"Pokemon"
        },
        "1521":{
            "author_id":"tummytuck",
            "author_name":"t.nolan",
            "choices":[
                "Start Your New Game!",
                "Finish That One Anime",
                "Check The Forums"
            ],
            "content":"<div class=\"\"><div> <span>Ash wakes up with a pounding head ache. Pounding!<br>\r\n<br>\r\nHe groans as he tries to stand, but only falls back onto his butt.<br>\r\n<br>\r\n\"Brock? Max?\" he calls out, but there's no answer.<br>\r\n<br>\r\n\"Pikachu?\" he calls, and he stands as he realizes that he's without his friends, and without his beloved Pokemon.<br>\r\n<br>\r\n\"Hello?\" he calls out. \"Anybody there?\"<br>\r\n<br>\r\nYou can't hear the shrunken boy shouting for your name, as he's much too small. You think about starting your new video game, or finishing that anime you're almost done with. Or maybe check out the forums to see if there's any macro anime updates!</span></div></div>",
            "created":1584245160,
            "id":2801633,
            "title":"Ash"
        },
        "15212":{
            "author_id":"tummytuck",
            "author_name":"t.nolan",
            "choices":[
                "He Can't Stop Readjusting His Balls",
                "He Can't Stop Picking His Wedgie",
                "Ash Is Missing In Some Scenes"
            ],
            "content":"<div class=\"\"><div> <span>\"I really should finish that one anime,\" you say to yourself.<br>\r\n<br>\r\nAsh, standing in the middle of your room, is shocked to see you, to say the least.<br>\r\n<br>\r\n\"Whooooooah!\" he shouts as he beholds your gigantic (5'5\") size.<br>\r\n<br>\r\n\"Holy magikarp!\" he screams as you begin to stomp towards him. Well, your computer.<br>\r\n<br>\r\nHe runs away from you, towards your computer, but your sneaker'd feet easily catch up to him. Your left foot slams down, mere inches away from his shrunken body. The massive impact sends him flying into a pile of clothing, which he pathetically sinks into.<br>\r\n<br>\r\nYou boot up your most prized possession, and take a seat, ready to catch the final episodes.<br>\r\n<br>\r\nAsh sinks further, and further into the mass of fibers. He finds what appears to be a network of tunnels in the pile of clothing.<br>\r\n<br>\r\n\"Huh, wonder where this leads to?\" the boy asks himself. \"Maybe to the way out if I'm lucky!\"<br>\r\n<br>\r\nAsh crawls through the tunnel, until he hits a seemingly dead end room. The room is round, a little musky smelling, but it's really beautiful. The cotton walls are printed with the pattern of a beautiful purple, and gold galaxy.<br>\r\n<br>\r\n\"Wow,\" Ash says, completely amazed.<br>\r\n<br>\r\nJust as you begin to hit play, there's a sudden knock at your door, and it swings open to reveal one of your very many brothers, Adam. You mean... Ugh, <i>Satoshi</i>.<br>\r\n<br>\r\nAdam has the very blessed ability to appear normal, having good looks, the ability and passion to play basketball, and pretty good social etiquette, but he negates alllll of that with his cringey, weeby love for anime. Especially for Pokemon. He loves Pokemon to such an extent that he refuses to answer to Adam, and <i>must</i> be addressed as Satoshi. But you never do. Despite all his cringe, though, he happens to be one of your many best friends, easily because of how close in age the two of you are. You wish you could say that about Tommy.<br>\r\n<br>\r\nI mean. You like Pokemon, too, but not like Adam does. It's so easy to get under his skin, too. Referring to the main character as Ash instead of Satoshi. Calling every Pokemon Pikachu. Except Pikachu. And of course calling it Pokemans. Gosh. Well, you love him anyways. But...<br>\r\n<br>\r\n\"Adam, why are you naked?!\" You ask, averting your gaze.<br>\r\n<br>\r\n\"I'm not naked, I have a T-Shirt on!\" he argues.<br>\r\n<br>\r\n\"I can see your junk!\" You retort.<br>\r\n<br>\r\n\"Yeah, actually, I can't find my favorite underwear,\" he says as he enters your room, and begins rifling through the pile of clothing by your chair.<br>\r\n<br>\r\n\"You have a favorite pair of underwear?\" You ask incredulously, turning to him, only to turn away once again after catching a glimpse of blindingly white butt cheeks.<br>\r\n<br>\r\n\"You don't?\" he asks.<br>\r\n<br>\r\n\"No,\" you say, shaking your head.<br>\r\n<br>\r\n\"Found 'em!\" he says, and you turn to see him triumphantly holding a pair of custom galaxy print Bjorn Borg boxer briefs.<br>\r\n<br>\r\n\"Oh, great, oh, fuck!\" You say as you shield your eyes from the unsightly thing hanging between his legs.<br>\r\n<br>\r\nAdam puts on his underwear, which hug is bulge, and dip into his butt crack, showing off each cheek. He pulls at the wedgie, and readjusts his crotch, getting comfortable.<br>\r\n<br>\r\n\"Hey, do you want to watch Pokemon?\" he asks, still picking at his wedgie, and his bulge.<br>\r\n<br>\r\n\"You mean Pokemans?\" you ask, and you laugh as he starts to go off.<br>\r\n<br>\r\nYou go to your TV, and put on a Pokemon VHS tape before sitting on your bed.<br>\r\n<br>\r\n\"I'll be right back!\" Adam says, and he runs out the room, before returning with the star of the show, a custom made Satoshi plushie. He settles in on the bed, wiggling his hips to rub an itch in his butt, and readjusting his bulge once again.<br>\r\n<br>\r\n\"Wouldn't it be so cool to meet Satoshi?\" he coos, unaware that his hero, idol, and lifelong obsession is struggling to survive beneath the immense weight of his smelly, titanic teenage number one fan.<br>\r\n<br>\r\nAs you watch Pokemon with your slightly older brother, Adam, you notice that:</span></div></div>",
            "created":1584250740,
            "id":2801677,
            "title":"Finish That One Anime"
        },
        "1522":{
            "author_id":"keyblade",
            "author_name":"Dr. Shrink",
            "choices":[
                "Into a shoe.",
                "On some clothes.",
                "Into a wall."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Oww. My head.\" Max says as he gets up from off the floor.<br>\r\n<br>\r\n<br>\r\n\"Huh? Ash? May?! Where did you-\" Before Max could finish talking, a giant foot came down next to him. When it did, the impact sent him flying...</span></div></span></div>",
            "created":1317445200,
            "id":1198424,
            "title":"Max."
        },
        "155":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Death Note",
                "Inuyasha",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, how about these choices. </span></div></span></div>",
            "created":1434636720,
            "id":1994331,
            "title":"More Anime to choose"
        },
        "1553":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "MAR Marchen Awakens Romance",
                "Ranma 1/2",
                "Nope, more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok, here's some more to choose from. </span></div></span></div>",
            "created":1434636840,
            "id":1994332,
            "title":"More anime"
        },
        "15533":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yes, let's go Plus Ultra!!",
                "Something else",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a more recent choice. <br>\r\n<br>\r\n<b>My Hero Academia</b><br>\r\n<br>\r\n</span></div></span></div>",
            "created":1584366720,
            "id":2802306,
            "title":"My Hero Academia"
        }
    },
    "info":{
        "author_id":"dark_lord666",
        "author_name":"Dark_Lord",
        "brief_description":"What happens when an anime guy is shrunken and transported...to YOUR world?",
        "created":1275245940,
        "description":"<td align=\"left\" class=\"norm\">Most anime shrinking stories follow a usual formula. Someone from the real world is shrunken and transported to an anime world. They must then survive the gigantic world populated by giant anime characters. <br>\r\n<br>\r\nHowever, what if the opposite happened? What if an anime character is shrunken and transported right into your room? What would they do in the new, giant world? What would YOU do if you found them?<br>\r\n<br>\r\n~Rules~<br>\r\n<br>\r\n1. This is a m/m story only. If you want a giantess or SW story, go somewhere else please.<br>\r\n2. Only anime characters can shrink and they cannot grow (unless they are somehow being returned to normal size).<br>\r\n3. No one line chapters unless it's a choice chapter.<br>\r\n4. Any type of interaction is allowed. You may do whatever you want with the tiny anime characters. Their fates are in your hands...<br>\r\n5. The shrunken characters are not invincible.<br>\r\n6. Other than yourself, you may introduce other characters. They could be your brother(s), your friend(s), or other acquaintances.<br>\r\n7. Do not spam the story.<br>\r\n8. Please add and have fun!</td>",
        "id":1677681,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1584366720,
        "modified":1584366720,
        "pretty_title":"Small World of Anime"
    }
}