{
    "chapters":{
        "1":{
            "author_id":"vault-dweller",
            "author_name":"Demon-Lord-Raiju",
            "choices":[
                "Falahar",
                "Ryuuka",
                "Mei",
                "wyvern choices",
                "eastern choices"
            ],
            "content":"<div class=\"\"><div> <span>ok, here are your first choices. don't like'em? click five.<br>\r\n<br>\r\n1. Falahar: Black western dragon, on the small side for his kind, but still very imposing. looking for a mate.<br>\r\n<br>\r\n2. Ryuuka: red western dragon, hot headed, tries to solve his problems on his own. headstrong, determined. interested in a female.<br>\r\n<br>\r\n3. Mei: a pink western dragon with blue eyes. she's independent, kind, but also prideful and headstrong. looking for a mate.</span></div></div>",
            "created":1383368400,
            "id":1687712,
            "title":"the beginning,"
        },
        "11":{
            "choices":[
                "Weight Gain",
                "Muscle",
                "Magic",
                "Both Weight and Muscle gain",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you picked Falahar. He might be a bit on the lean side, but he is average height for a dragon even though he is dwarfed by almost every female he comes across. So how should he grow?</span></div></span></div>",
            "created":1406091600,
            "id":1832678,
            "title":"Falahar"
        },
        "111":{
            "choices":[
                "Fahalar decided to force a village into feeding him.",
                "Fahalar decides to set up traps to lure his prey to his cave.",
                "Fahalar meets a dragoness who is willing to help him."
            ],
            "content":"<div class=\"\"><div> <span>Falahar is a black western dragon of average height, unfortunately his slender stature is a big turnoff for dragonesses. Even though he could scare villagers like no tomorrow his kind ridiculed him for being small. This made Falahar angry. One day he was trying to catch some prey when he spotted another dragon getting feed by dragonesses. He noticed that the dragon a fat fat green dragon, practically a dragon that was ready to mate guessing by his size. Then an idea came to Falahar's mind. If he wanted to show dominance he would would need to put on weight. He then imagined himself as a very obese black dragon getting feed by several lovely dragonesses. His mind was made up. Fahalar decided that he was way overdue for what he desevered.</span></div></div>",
            "created":1406091600,
            "id":1832732,
            "title":"Weight Gain"
        },
        "113":{
            "author_id":"qwew80",
            "author_name":"dvorak0000",
            "choices":[
                "A Modified healing spell makes him pack on the pounds",
                "An ancient potion fills him with liquid",
                "An odd artifact has strange results"
            ],
            "content":"<div class=\"\"><div> <span>Falahar was more than a little frustrated. His search for a mate had been fruitless, in no small part due to his lacking stature. He was a black dragon, with a dark gray chest and underbelly. While many of his peers in his clan easily broke fifteen feet high on all four legs, Falahar strained to reach ten. Some of the taller humans matched his chest in height, and he was easily the smallest in his colony, only managing to be intimidating with training and some well-placed enchantments. Guys and girls alike turned him down in favor of more sizeable partners.<br>\r\n<br>\r\nIt didn’t help that he preferred studying the intricacies of magic to any sort of physical activities - so much time cooped up in caves full of books, dashing from project to project, wasn’t exactly the best for a dragon’s health. Even his fellow mages turned him down, either too wrapped up in research of their own or nervous around a dragon with such careless research methods.<br>\r\n<br>\r\nHis frustrations were compounded by his struggles to bulk up, one way or the other. At first, he thought exercise would solve the problem, but he struggled to maintain a consistent routine, often getting distracted with a new research project. Even with his best efforts to eat healthy and workout, he could never maintain more than a slender, somewhat toned body.<br>\r\n<br>\r\nThen, it hit him: why not use magic instead? Falahar was more inclined to magic than most, and if it was successful, he could even help others this way! In a rush, the black dragon began pouring through any source of arcane information he could find for an easy way to put on some muscle, and potentially increase his own height.<br>\r\n<br>\r\nThrough his latest studies, Falahar found a number of false starts. But eventually, he would find something workable...<br>\r\n</span></div></div>",
            "created":1557278100,
            "id":2656786,
            "title":"Magic Expansion"
        },
        "1131":{
            "author_id":"qwew80",
            "author_name":"dvorak0000",
            "choices":[
                "Falahar manages to stop the spell, and is only left chubby",
                "Falahar can't stop the spell, and is rendered nearly immobile",
                "Falahar stops the spell, but there will be side effects later"
            ],
            "content":"<div class=\"\"><div> <span>A spell, Falahar decided, would both be the fastest to try and the easiest to get started on. He poured through some healing spells, and discovered one specialized for healing muscles. If done right, this could be changed to build muscle instead. <i>If I can get this to work on myself, Falahar reasoned, there’s no reason I couldn’t get this to work on other dragons, too! I could help everyone bulk up, and there’s no way I wouldn’t get a mate then! </i> Caught up in ambition, the small dragon quickly constructed runes on a copy of the healing spell, not realizing the mistakes he was making in his haste to experiment.<br>\r\n<br>\r\nHe stuffed the spell page he was working on with some research materials and writing utensils, and took off for an isolated clearing some distance away. Falahar didn’t think to tell anyone where he was going - he wanted this to be a surprise. Immediately upon arriving, the black dragon pulled out his makeshift spell and set to work.<br>\r\n<br>\r\n<i>Let’s see…</i> Falahar began forming mana around his body, visualizing the runes on the piece of paper in front of him. As he continued casting, his body began to slump from fatigue, the spell sapped his energy. <i>I’ll need to make this more efficient, but no major issues so far.</i> Finally, as Falahar neared exhaustion, his body flashed with light and the spell was cast.<br>\r\n<br>\r\nAt first, nothing happened. Falahar waited, eyeing his body from head to tail to try and detect any increase in muscle. <i>Hm… perhaps too much of the original spell was retained. I’m surprised a spell that took up that much energy ended up doing nothing, though…</i> As the black dragon’s thoughts turned inwards, however, changes began occurring all over his body. Slowly, his toned body began to disappear, replaced with layers of adipose. His belly went from near concave, to flat, then started to poke out as if Falahar had just finished a massive meal. The fat spread to the rest of his body, his legs gradually thickening, causing Falahar to subconsciously widen his posture as he paced. As his thighs went from from bony to bubbling, his neck and face became chubbier, the telltale signs of a second chin forming. Even his tail and wings began rounding out at the base, inches piling on as the minutes passed. What was once a thin, toned dragon looked as if he had more than doubled in weight over the last few minutes.<br>\r\n<br>\r\nFinally, the dragon stopped his pacing and began to sat down - before realizing he hit the ground far sooner than normal. In a panic, he looked down at his body, terrified of what he saw. His stomach looked bigger than a late-term pregnancy, his legs more than twice as thick as when he first cast the spell. His tail had become far less dexterous, and after getting up in a panic, Falahar noticed his body slightly jiggling with his movements. <i>Of course</i>, Falahar realized, <i>All that mana had to go somewhere! But why would the spell do this?!</i> Panicked, Falahar rushed over to his materials, desperately trying to engineer a counterspell as his frame continued to magically expand.<br>\r\n</span></div></div>",
            "created":1557278820,
            "id":2656793,
            "title":"The wrong kind of bigger"
        },
        "1132":{
            "author_id":"qwew80",
            "author_name":"dvorak0000",
            "choices":[
                "Falahar is swelling with water",
                "Falahar is being filled with some kind of juice",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Deep in the back of the library where Falahar spent his time studying, the black dragon found an old, poorly-preserved scroll, seemingly forgotten in the back of the shelf. Pouring through its damaged contents, Falahar soon realized something - this was an ancient set of recipes for potions! The scroll had likely sat undiscovered for decades, maybe even centuries, and described a number of research project undertaken by a mage some time ago.<br>\r\n<br>\r\nEach entry in the scroll was made up of a target for the potion, a list of ingredients and preparation instructions, and a description of the potion’s actual results. Most of the experiments ended in duds, or were a less efficient recreation of an already-existing potion, but one in particular caught Falahar’s eye - the very last potion created. The opening statement of this potion seemed to have been damaged; Falahar could just make out a few words - ‘size,’ ‘grow,’ and the like. The ingredients were also unusual - some of the herbs here were either very rare or extinct, and rarely used in alchemy, with the rest being various strengthening agents. Finally, the results section was also greatly diminished, with only one line: ‘Abandoned due to duration of effects.’<br>\r\n<br>\r\nFalahr was was fascinated by this potion, and resolved to brew it immediately. If the potion was only a temporary muscle enhancer, then perhaps the addition of some modern techniques could improve the duration, or even make it permanent! Thankfully for the eager dragon, the library was well-stocked with most of the ingredients he would need; the rest would just require some substitutions.<br>\r\n<br>\r\n<i>Let’s see here…</i> The black dragon though to himself, organizing glass jars of herbs and beakers of glowing liquids into his pack.<i> I’ll need to go into the woods and gather enough elderflowers, plus I’ll need to find a small lake, but other than that I should be ready.</i><br>\r\n<br>\r\nAfter sealing his pack and confirming his destination, Falahar sped off into the nearby forest, scanning the trees for the flowers he needed. Not much time had passed before everything was gathered, and the small dragon soon set to work, hoping to cure his diminutive stature.<br>\r\n<br>\r\nIt took some time before everything was brewed, but Falahar soon had a complete potion in his claws. Despite his earlier excitement, the mage was starting to get nervous. The dark blue, slightly translucent potion shimmered with arcane energy, and seemed stronger than most potions he had encountered. Still, the dragon was focused on his goal, and after steadying himself, leaned his head back and drank the potion in one big *gulp*. <br>\r\n<br>\r\nFalahar could immediately tell something was wrong - the potion tasted bitter, and energy crackled on his tongue as the lukewarm liquid slipped into his stomach. The dragon let out a small belch and put a forearm on his paunch to steady it - only for it to swell right underneath his claws. A look down only confirmed his fears, the dragon’s belly sloshing as it filled outwards. In surprise, Falahar instinctively shot upwards, but found flight far more difficult as the liquid weighed him down. It was clear to anyone something was wrong with Falahar, his distended stomach inching outwards.<br>\r\n<br>\r\nRealizing that he was going to be grounded soon one way or the other, Falahar landed, his belly scraping the earth as he did so. The dragon was caught off balance by this, and landed on his rear, his paunch pooling in front of him. In a desperate bid to stop the swelling, the dragon tried hugging his stomach with his forearms - but they could barely wrap around his swollen form, and squeezing only succeeded in causing the dragon to let out a loud belch.<br>\r\n<br>\r\nBy this point, the liquid was starting to pool into other parts of his body - his chest and thighs started to swell, body losing some of its definition as the liquid caused it to grow. Falahar knew he only had so much time before he was rendered too big to move - but in order to engineer some solution to stop the swell, he first had to determine what was inside him in the first place. <br>\r\n</span></div></div>",
            "created":1557294960,
            "id":2656874,
            "title":"An ancient potion fills him with liquid"
        },
        "1133":{
            "author_id":"qwew80",
            "author_name":"dvorak0000",
            "choices":[
                "Falahar starts filling with air",
                "When he goes back to the colony, everyone seems to want to keep Falahar well fed",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Deep in the bowels of the library, far from where most students of magic studies, Falahar was lost in thought. In his search for magical muscles, the black dragon had only discovered duds, and was now forced to turn to a rather unreliable source - ancient magical relics, stored far below the surface. Distracted as he was, the dragon didn’t notice the figure standing in his way until - <br>\r\n<br>\r\n“Oh!” Falahar exclaimed, bumping into the rear of the dragon in front of him before falling on his own behind<br>\r\n“Hm? Is someone there?” The other dragon asked, turning around to face Falahar.<br>\r\n<br>\r\nInstantly, Falahar recognized this dragon - it was Haestra, a fellow student and researcher. Haestra was one of many dragons throughout the colony Falahar had a crush on - the researcher was so passionate about his work, and eager to share his findings with others. Falahar could sit and listen to him for hours.<br>\r\n<br>\r\nRight now, though, the black dragon had other priorities. “Uh, s-sorry about that, Haestra, didn’t see you there,” Fallahar said, embarrassed. “Oh, it’s all right, I’ve just been doing some reading,” the larger dragon said as he moved to the side. “What brings you down here today?”<br>\r\n<br>\r\n“Oh, well, recently I’ve been trying to, ah, p-put on some muscle,” explained Falahar, lightly blushing, “and I thought it would be good to find a relic to help.” “Hmm… I may have something to help with that.” “R-Really!?” Falahar exclaimed. “I’ve been doing some research into this small device.” As he said that, Haestra pulled a small sphere with holes on top from his bags.<br>\r\n<br>\r\n“This is some kind of incense burner. The idea is, you place something in here,” Haestra explained as he began lecturing, twisting the top and pulling it off, “and then light it on fire. Then, depending on what’s inside, magical incense is released. We thought there was some symbolic relationship to what is burned and its effects on the user, but right now we’re not sure there’s any correlation…”<br>\r\n<br>\r\nAs Haestra got caught up in explaining, Falahar sat and admired the dragon before him. Haestra’s scales were a grey-blue color, with a sky blue underbelly and white claws. He towered over Falahar, but was far less intimidating, if only because he didn’t try to be. It was only when Haestra held up a bag that Falahar realized he hadn’t been listening.<br>\r\n<br>\r\n“If you could test those combinations for me, that would greatly enhance my research efforts,” Haestra said eagerly. “Uh, s-sure, no problem!” “And as long as you follow my instructions, these ingredients should give you the best chance at the changes you seek.” Wow, thanks so much Haestra! I’ll report back to you as soon as possible!”<br>\r\n<br>\r\nExcited by the prospects of his easy solution, Falahar secluded himself a short distance away from the colony. As much as he wanted to get started right away, though, he soon ran into a problem - he didn’t actually know what he was doing.<br>\r\n<br>\r\nRummaging through the bag given to him, the black dragon removed an almost random assortment of items. Some plant specimens here, an animal pelt there - other than all the items nominally being flammable, there was no discernible pattern. Falahar vaguely remembered something about what to combine with what, but couldn’t remember the specifics.<br>\r\n<br>\r\n<i>Urg… I don’t want to have to go back and ask Haestra what to do again, then he’d know I wasn’t listening to him. Hm… I’ll just put a little bit of everything in, what’s the worst that could happen?</i> Falahar took a little bit of every ingredient he had retrieved into the burner, then lit it with a quick burst of flame and stepped back.<br>\r\n</span></div></div>",
            "created":1558324680,
            "id":2661718,
            "title":"Incense"
        },
        "11331":{
            "author_id":"qwew80",
            "author_name":"dvorak0000",
            "choices":[
                "Another dragon finds him...",
                "...But they get caught in the incense"
            ],
            "content":"<div class=\"\"><div> <span>As the incense burner caught aflame, a shimmering, light crimson smoke began emanating from it, clouding the air. Falahar leaned in and took a deep sniff, muscles relaxing and face forming a relaxed smile as the surprisingly pleasant scent filled his lungs.<br>\r\n<br>\r\nHuh, maybe mixing it all together wasn’t such a bad idea after all. This is pretty relaxing… The black dragon took a particularly large breath, his chest and stomach lightly swelling with air, and appreciated the aroma before breathing out.<br>\r\n<br>\r\nWhat the dragon failed to notice, however, was that each breath out did not cause his stomach to return to normal - in fact, every breath Falahar took of the incense was steadily bloating him outwards, each one more than the last. As his belly and chest continued to grow, the expansion spread out to Falahar’s entire torso.<br>\r\n<br>\r\nAfter about half a minute of appreciating the incense in silence, Falahar realized something was wrong, and looked down at his chest. By that point, his torso had grown considerably wider, and was starting to hamper the dragon’s movements with his limbs. Startled, Falahar pushed his arms against his bloated belly in a meager attempt to stop the expansion, but only managed a slight indent. His hide grew more and more taught, and his scales began spreading out, unable to cover the whole body.<br>\r\n<br>\r\nBy now, Falahar’s uncontrollable expansion had caused him another problem - his limbs were beginning to be swallowed by his growing torso, threatening to render the dragon immobile.  But by the time the black dragon realized this, he had yet to make a move distancing himself from the source of his increase in size - the burner. If the dragon’s growth continued unabated, he would become spherical, stranded in the clearing until someone rescued him.<br>\r\n<br>\r\nFalahar rushed away from the device - or tried to, anyways. his inflating body spread his legs wide, forcing him into a slow waddle. His belly had grown to the point it scraped the dirt underneath the dragon, making a small divot and slowing his progress further.. The dragon attempted to take off, but by this point his wings had been constricted, not able to provide the level of control required. Falahar’s waddle slowed to a crawl, then a standstill as his body continued to grow and constrict his limbs, his face tipping forward from his forward velocity. By this point, Falahar was downright spherical, his head and limbs barely sticking out from the rest of his body.<br>\r\n<br>\r\nThe black dragon could do little more than wiggle his body or turn his head slightly - most other motion was off-limits by this point. The dragon was now a near-perfect sphere, his head barely sticking out of his body, with only the tips of his claws and hind legs visible. The black ball’s tail had also bloated considerably, thickening with air to match his body’s expansion. And as the dragon sat there, he felt a faint tug upwards - Falahar was floating! In a panic, the sphere opened his maw as wide as he could, and clamped down on a nearby branch. Although the dragon was safe from floating away, he showed no signs of deflating on his own, and the incense was still burning away…<br>\r\n</span></div></div>",
            "created":1558324920,
            "id":2661719,
            "title":"Air Panic"
        },
        "115":{
            "choices":[
                "Falahar goes to search of it today.",
                "He searches for it tomorrow.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>It was mating season yet again. Falahar could feel it in the air, and, mostly, in his member. The hard flesh hung bobbing below his waist with a sack of seed just ready to blow.<br>\r\n<br>\r\nHe gave a sad sigh. It was mating season, but Falahar would not be recieving any mating season this year. He was far too thin, making unactractive to females. He lay down and started to stroke his member, dreaming that it was a dragoness blowing him off.<br>\r\n<br>\r\nHe didn't realise it, but a shadow was creeping up behind him. \"Abba!\" Falahar yelled in surprise. She was a green colored dragoness with a black underbelly. She had spikes beginning from the top of her head to the base of her tail. The dragoness known as Abba smirked, saying,\"gottcha red-handed, didn't I?\" Falahar blushed, rolled over, and said in a anoyed tone,\"well, if you're not going to help me, then you should leave.\"<br>\r\n<br>\r\nShe smiled at him, saying,\"I would, I got a mating session with another dragon.\" Falahar frowned. \"Then way are you here?\" he asked. Her smile broadened. \"I came to give you some advice,\" she answerd. Falahar cocked his eyebrow. \"What is it?\" he asked, becoming ever so curious.<br>\r\n<br>\r\nShe walked to him, and, much to his surprise, started to stroke his member. Falahar let loose a shudderd moan, feeling her paw over his penis. \"It's a place where all dragons go to get bigger,\" she said. Falahar's interest sparked up. \"Where *gah* is it?\" He asked.<br>\r\n<br>\r\nShe then reached with her paw to his forehead and touched it. Bright images flashed through Falahar's mind. When she was done, he knew exactly where it was. \"I believe you can find it on your own,\" she said, getting up and leaving the cave.</span></div></div>",
            "created":1452489720,
            "id":2087532,
            "title":"Reader's Choice"
        },
        "1151":{
            "choices":[
                "Next",
                "Next",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Falahar left his cave in search of the mysticle place Abba inprinted into his mind. The search led him far; out of the valley of the dragons and into the lands that lay behond it.<br>\r\n<br>\r\nHe flew through the air, searching for the markings that would lead him to the place. He finaly spotted it. There, on the forest's floor, was a long crack in the surface.<br>\r\n<br>\r\nIt wide enough to tack Falahar's vorm with no restraint, and he dove right in. It was dark, but, through the use of some kind of magic, was able to light the way for himself.<br>\r\n<br>\r\nHe landed on the trench's floor and spotted a portal. It stood at the end of the trench and made some sort of humming sound. With little hesatation, Falahar went through the portal.</span></div></div>",
            "created":1452863280,
            "id":2089501,
            "title":"The search."
        },
        "12":{
            "author_id":"vault-dweller",
            "author_name":"Demon-Lord-Raiju",
            "choices":[
                "To become a water store for the colony.\"",
                "To be forcefed to immobility\" ",
                "To work in the gem mines\"",
                "To become a broodmother.\"",
                "To investigate a disturbance with Lilika\""
            ],
            "content":"<div class=\"\"><div> <span>Ryuuka the red dragon lay in his den one sunny morning in May, having spent the previous night terrorising human villages for his own amusement, now laying on his side in his cave, he snoozed with a smirk on his muzzle.<br>\r\n<br>\r\nSoon, the young dragon finally woke up, yawning as he stretched his legs, sharp claws digging little divots into the earth at his feet, shaking his head some, his long crimson mane falling over his yellow eyes as he trod out into the morning sunlight, laying down on a rock to sun himself. <br>\r\n<br>\r\n\"heh, stupid humans always make the funniest noises when i burn their houses down.\" he chuckled to himself, remembering the previous nights 'fun' vividly, having crept into the village under the cover of night, he set fire to their gunpowder reserves and made off with two lovely plump cows as a prize, smirking as the remnants of the meal still kept him licking his lips in pleasure.<br>\r\n<br>\r\n\"oh? and just how many houses did you burn down this time Ryuuka?\" came a stern feminine voice, shocking Ryuuka into a sitting position, looking round with a fearful look at the large blue female sat behind him, eyes clearly unimpressed.<br>\r\n<br>\r\n\"L-Lilika h-hey, whats up...?\" Ryuuka stammered out, trying to act casual as he looked at his crush, blushing some. Lilika sighed, shaking her head. \"Honestly Ryuu, how many times have the elder dragons told you NOT to cause trouble for the humans? its because of stunts like these that they hate us so much.\" she scolded, making the smaller dragon male adopt a more submissive stance.<br>\r\n<br>\r\n\"...about fourteen times...probably fifteen now...\" Ryuu muttered, making Lilika groan as she sat down heavily. Lilika, unlike most dragons her age, was quite large, and not in terms of sheer size. If a human saw her, they would probably say she was fat, like obese levels of fat, her crystal blue scales shone bright across her large belly, strong as steel, but soft due to the fat they enclosed, her legs were wide and meaty, like cones, giving her a visible waddle when she walked, her rump was massive, her fat tail draped over it lazily, and her mane was pure white, long enough to fall over her green eyes some. <br>\r\n<br>\r\nDespite the criticism she received for her weight from the elders, Lilika was one of the most coveted dragoness' in their colony, having turned down many a horny male during breeding season, and only really speaking to Ryuuka out of them all.<br>\r\n<br>\r\n\"Thats just it Ryuu, the elders are deciding your punishment as we speak...\" she said, frowning at Ryuu, who looked shocked.<br>\r\n<br>\r\n\"P-Punishment!? b-but i didn't think it warranted punishment...\" he said, quivering as he knew how harsh the elders got during punishments, cowering like a newborn hatchling.<br>\r\n<br>\r\nLikila sighed. \"doesn't matter what you thought, now come on, they asked me to fetch you.\" she said, giving him the stern gaze he knew he couldn't refuse, making him whimper and follow her swaying rump through the forest to the 'Dragons village' within the nearby mountain, having to help Lilika get through one of the smaller entrances.<br>\r\n<br>\r\nInside on of the large chambers, there sat five gigantic elder dragons, each the size of a human village, dwarfing the adolescent dragons before them. Ryuuka sat at the center of their gaze, small and helpless as he looked up at the elders, who all gazed at him thoughtfully.<br>\r\n<br>\r\n\"Ryuuka...are you ready to receive your punishment...?\" the central elder, Skaldanir asked, his voice calm and authoritative, enough so to make Ryuuka a bit more relaxed, he knew that no matter what his punishment was, a dragon would never kill another dragon.<br>\r\n<br>\r\n\"Y-Yes...Elder Skaldanir...\" he said, still afraid, but willing to atone. Skaldanir sighed, nodding. \"very well, your punishment will be...</span></div></div>",
            "created":1413608400,
            "id":1873673,
            "title":"Ryuuka"
        },
        "122":{
            "choices":[
                "Next feeding session",
                "Mating",
                "a few months later"
            ],
            "content":"<div class=\"\"><div> <span>...your punishment will be to be force fed to immobility.\" Skaldanir said.<br>\r\n<br>\r\n\"What?! That means I'll just be another brood father.\"<br>\r\n<br>\r\n\"This is exactly what we have in mind as your punishment. For you to truly learn how to be a responsible patriarch you will become a brood father and provide children for our clan. For the next year you'll have three mandatory stuffing sessions a day and will be required to mate with at least one female throughout the day. Your first feeding session starts immediately. Enjoy your days of mobility while they last, because you'll spend the rest of your days fathering children from within your cave.\"<br>\r\n<br>\r\nRyuuka couldn't believe this was happening. His days of being rough and tough were ending and his life as a large immobile brood father were just about to begin.<br>\r\n<br>\r\n\"Looks like I'm finally going have a mate that's compatible with me. I'll definitely enjoy that belly of yours.\" Lilika said as she picked up Ryuuka for his first stuffing session.<br>\r\n<br>\r\n<i>This shouldn't be bad, as long as I mate with Lilika. Who knew she wanted to mate with a fat dragon.</i><br>\r\n<br>\r\nDuring the stuffing session Ryuuka is forced to eat whatever he's given. By the end of his first session Ryuuka bell was distended due to the excess food. Ryuuka rubbed his developing gut as he walked back to his cave.</span></div></div>",
            "created":1413954000,
            "id":1875818,
            "title":"To be forcefed to immobility\" "
        },
        "1222":{
            "choices":[
                "Ryuuka finishes the food and passes out",
                "Lilika brings more food while Ryuuka continues eating",
                "next day"
            ],
            "content":"<div class=\"\"><div> <span>When he got back to his cave he noticed a group of females in his cave. By what he guessed there had to be at least twelve dragonesses in total. Ryuuka was startled not expecting so many dragonesses to come flocking to his cave.<br>\r\n<br>\r\n\"Oh, Ryuu! We've come to make love.\" The group said in a pervy tone as they forced a strange liquid down his mouth.<br>\r\n<br>\r\nAs the liquid went down Ryuuka felt his instincts kick as he started fondling his first mate in a lustful manner.<br>\r\n<br>\r\nThe process continued for a good five hours before the mating ended. TItinina, the elder who was tasked with supervising the ritual gave Ryuuka a drink of the same water before he passed out. While Ryuuka was asleep a few dragons hauled in large amounts of food for Ryuuka's next feeding session. Whenever males mate with a female their metabolism lowers and they often eat more than usual. Ryuuka continues to sleep until a large gurgling wakes him up.<br>\r\n<br>\r\n\"That was some strange dream. I thought I just mated with a dozen females or something... That wasn't a dream. Dang my member feels so sore and why do I feel like I haven't eaten in days?<br>\r\n<br>\r\nBefore Ryuuka could think things over he lunged at the food in his presence and began stuffing himself silly.</span></div></div>",
            "created":1415250000,
            "id":1882424,
            "title":"Mating Ritual"
        },
        "1223":{
            "choices":[
                "Go somewhere and have a getaway",
                "Mate",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>A few months has passed since Ryuuka has been forced to gain weight and become a brood father and the results are definitely noticeable. Whenever male dragons mate with females their metabolism lowers thus resulting in some weight gain. This usually happens when an adolescent is preparing for adulthood and it takes a few years before their bodies develop a larger and more muscular frame to carry the weight, however brood fathers do develop muscle while mobile, but they often grow larger and fatter in order to protect hatchlings and to breed larger offspring for the larger the parents the larger the offspring. This means that brood fathers can produce some of the most powerful offspring by just overindulging. Now Ryuuka is slightly larger than Lilika and has started to en joy all the attention he gets from every dragoness when he waddles by. It can even be said that his weight gain made him one of the most desirable males in the colony. But Ryuuka would turn down most pervy females, for he had only eyes for Lilika and was hoping that Lilika would become his sole mate for they only mated a few times throughout last four months due to the fact that he had to mate at least once a day.<br>\r\n<br>\r\nRyuuka was currently watching his unhatched children from his many mates that he mated with and was waiting for Lilika to come for his feeding session.<br>\r\n<br>\r\n\"Hey there Big Papa. Are you guarding our kids? It's time to feed you so you can become bigger and fatter.\" Lilika said as she rubbed her mate's large belly.<br>\r\n<br>\r\n\"Come on Lilika, can I just stay this size and mate? I at least want to teach the kids how to fly and to show them how a real dragon gets a mate.'<br>\r\n<br>\r\n\"We can't have you not learn your lesson. Plus your fate is to become a responsible brood father and raise kids for the colony while being big and fat.<br>\r\n<br>\r\n\"Not if I have a say. I'll become the toughest and strongest brood father alive!\" Ryuuka exclaimed as he started to take flight.<br>\r\n<br>\r\n\"Dang I thought you wouldn't be able to do that anymore.\"<br>\r\n<br>\r\n\"I've been training in-between my feeding sessions. If I'm going to be the biggest brood father must as well try to delay immobility by building my strength.\"<br>\r\n<br>\r\n\"Oh Ryuu. You large cutie. If you're not hungry yet we can always feed you to the brim when that handsome gut growls. So what do you want to do big guy.\"<br>\r\n<br>\r\n\"Let's see... I can't leave the eggs unless I use magic to seal the cave and I still need to mate today.</span></div></div>",
            "created":1414645200,
            "id":1879519,
            "title":"Big Brood Father Ryuuka"
        },
        "123":{
            "choices":[
                "Ten other adolescent dragons",
                "Lilika and her cousin Draxius",
                "Six other dragons"
            ],
            "content":"<div class=\"\"><div> <span>\"Very well, your punishment will be to work in the gem mines. A good hundred years should definitely teach you some responsibility.\"<br>\r\n<br>\r\n\"One hundred years! I'll be an adult by then!\"<br>\r\n<br>\r\n\"Should of thought of that before Ryuuka,\" the female elder to Skaldanir's right said. \"Just be grateful that you only have to work there until adulthood. Don't worry though, you're not the only one being sent there. Your twin sister will be joining you too.\"<br>\r\n<br>\r\n\"I understand Lady Teranovis.\"<br>\r\n<br>\r\n\"We're glad you see things our way. You'll start your new job immediately.\" Skaldanir said.<br>\r\n<br>\r\nRyuuka bows before the elders. He then flies off to the gem mines. Fifteen minutes later he spots his sister at the entrance of the mine.<br>\r\n<br>\r\n\"What are you doing here? Here to gloat while a dragoness such as myself has to mine out gems?\"<br>\r\n<br>\r\n\"Not exactly Mei. I actually have to work alongside you.\"<br>\r\n<br>\r\nThe pink dragoness raises an eyebrow and then grins.<br>\r\n<br>\r\n\"Looting villages again? That's what I got busted for. Man you do the exact same things I do.\"<br>\r\n<br>\r\n\"Zip it Mei. All that matters is we have a job to do. Now who do we meet?\"<br>\r\n<br>\r\n\"What do we have here? So it's the trouble making twins. You can come inside you two.\" A deep masculine voiced boomed.<br>\r\n<br>\r\nThe sibling look at each other before entering. Once inside they see a massive muscular dragon.<br>\r\n<br>\r\n\"Glad you could make it. You two are the first new recruits to arrive. The others should be here soon. Today I'll give you a tour of the mines. Tomorrow you'll be assigned to a group. Looks like the others are here.\"<br>\r\n<br>\r\nRyuuka and Mei look at the entrance of the mines and see...</span></div></div>",
            "created":1446786000,
            "id":2057522,
            "title":"100 Years of Labor"
        },
        "1232":{
            "author_id":"equestor",
            "author_name":"Equestor",
            "choices":[
                "Road trip of the mine",
                "The next day",
                "Month later"
            ],
            "content":"<div class=\"\"><div> <span>Ryuuka didint hide his shock when he saw both of them in their massive frame's<br>\r\n<br>\r\nDraxius like cousin Lilika was one of the largest dragons in the colony, but not only for his size. If seen by a human they would consider him obese. His emerald scales glistened brightly across his massive belly and was strong as diamond, but also soft due to his multiple layers of fat. His legs were thick and meaty. Many would say that Draxius was stronger than most given to all the weight he carries everyday. Whenever he walked it was he had a heavy waddle that would cause the ground to shake if he didn't tread lightly. His rear was huge and his fat tail casually covered it. His mane was jet black, but it was shorter than Mei's. His red eyes added some ferocity to his usually cuddly appearnce. In short an opposite version of his cousin. When they both were standing talking to each other it looked like an opposite mirror of themselfs<br>\r\n<br>\r\n<b>- And what are you doing here? -</b> asked Ryuu afhter a few minutes of gawking. Lilika turned her massive body, which was jiggling and answered<br>\r\n<b>- Well i just brought food for you and while at it visit you and my dearly cousin  who runs this place.</b><br>\r\nRyuu was more confused<br>\r\n<b>- As a fresh meat here, you need to know the rules -</b> boomed the red muscular dragon. The one which greeted him. He was almost as tall as Draxius. He had red scales all over his body looking like a strong chainmail on his body. Very well defined huge muscles. Broad shoulders and arm muscles bigger then Ryuu legs. And that tail which was twice as big as his. Yet compared to the warden he looked like a twig - he continued <b>- Once in full moon or month if you prefer we restoke our supplies.<br>\r\n-Why?<br>\r\n- Becouse we are closing. And we need food. -</b> Draxious added patting his massive belly<b> - As the warden here i have to be sure we get enough supplies. Becouse when we seal the exit with magic will last for 30 days. We will work during that time and only once a month we can visit friends or the outside world<br>\r\n- That sounds cruel.<br>\r\n- Well -</b> Said Mei<b> - it is a puinshment afther all. At least we can meet up with others with that one day.<br>\r\n- Is there a way out if something goes south?<br>\r\n- Yes there is -</b> answered Draxious.<br>\r\n<b>- Where is it?<br>\r\n- Where you have to go... Wait. Almost got me there </b>- laughed the warden. <br>\r\n<br>\r\nWith all of that, Ryuu realized its going to be a long prison life. Lilika and Draxius shared their goodbyes with themselfs. Lilika to the goodbye added<br>\r\n<b>- And watch for Ryuuka he is a trouble maker.</b><br>\r\nDraxius just smiled and noded, Ryuu only gave her an annoyed experssion. An then Draxius chanted the magic spell and then the doors were sealed. Later Draxious assienged Ryuu and Mei ti the thier group. Suprsingly he landed with the red muscular Dragon called Igniverus or \" Igni \" for short. There was also a 2 dragons in the group. A small and shy yellow dragoness whos been senteced 20 years ago and the doubled in size of Igni Fenir a balck dragon with multiple scars on his muzzle chest and his left paw. He he's been sentenced 50 years. Afther that...</span></div></div>",
            "created":1581245760,
            "id":2784745,
            "title":"Lilika and her cousin Draxius"
        },
        "12323":{
            "author_id":"equestor",
            "author_name":"Equestor",
            "choices":[
                "Try to free her simself",
                "Get the others to free her"
            ],
            "content":"<div class=\"\"><div> <span>Its been a month since Ryuu was send to froced labour to attend his sins. During that month He learned a few things. First the layout of the mines. It wasnt just a big hole in the mountain going into diffrent eleveator shafts. In fact it was a maze with lots of caverns. At the first day he and Mei studied the payout so they wont get themselfs lost. Most of the mines shafts were not discovered and it was easy to get lost. But when you know where to go you could find interesting things in it. Caverns that contain things to live here like lairs to sleep in, storage for food and gems, dinning cavenrs to eat, workout cavners which were huge to streach out youre wings or just work out to get stronger. There even was a library, something Mei was monstly interested in.<br>\r\n<br>\r\nSecond thing he learned was the crew that work here. Not all of the workers were actually convicts. Some dragons like to dig in the mines. Which shoudnt be a suprise, couse dragons like shining gems and crystals. What was suprising was that they were ok with the closing. Ryuu was just passing by them sharing with them room in the dinning room and greeting once in a while. Usually he was with his crew. He knew that the black scarred dragon Fenir was sentenced becouse he was very aggresive towards other dragons and almost cippled the other one in a \"friendly\" duel. Ryuu was stayng away from him as far as possible. Besides he wasnt much of a talker. Once he wanted to greet him he just grunted and said<br>\r\n<b>- Listen, if you manage to survive 1 week here MAYBE i will learn youre name. For now leave.</b><br>\r\nEven afther the week he was not too friendly. He once heard that he wasnt that bad, since an accident that happend 50 years ago. He was trying to hang out with \"Igni\" Mei and the yellow shy dragoness. But Igni and Mei were busy with each other. Ryuu was teasing Mei for finding a mate, but she was ignoring that fact. Since these 2 were busy with each other there was the shy dragoness he only knew her name. It was Viv and usually when they were alone it was only an akward silence accured or just saying what to do today. Becouse of that he felt lonely here.<br>\r\n<br>\r\nThe third thing was how to work here, He did not expect that in labor theres is so much... work. The work looked like that there we assigned by the warden which elevator shaft they should go. They were given a map, so they wont get lost. The start to dig and get out the gems, crystals or other minerals. Usually they were using their tails as sickles or horns to get out some of the materials. Afther geting enough of them they were packing then on saddle backpack's carring on their back and going to the entry of the shaft, then coming back and repeat. Ryuu was extreamly weary. He did not understand who would be able to train in the training room afther that. He then noticed why. Once during carring his backpack he listned how some of the drgonesses miners liked big buffed miners, but only if there were beefer then them. It was quite supring becosue the females were very buffed. Ryuu decided since he is stuck here maybe some muscles will improvve his social skills and have someone to talk to or even to mate. Maybe he had strong dedicaion to it, he was not going to exhausted himself. He still hated that hard work. Sometimes he was even sneaking out with the backpack and going the longer way just to train on its own and just to get out of all the insults of Fenrir and yells of other dragons. <br>\r\n<br>\r\nOn one of thie offsite routes he walked passed one of the abonded shafts. Suddenly he heard something coming from that direction. He only looked there and since he did not see anything he was heading back to his duties. But then he heard<br>\r\n<i>-..me...yone...ear me. elp...me...ease</i><br>\r\nThat time he perked up his hears to hear it more clearly afther a prelonged pause, he was about to shrug it off thinking was only the wind. But again this time still distant, but more clearly.<br>\r\n<b><i>-Anyone can hear me! Help! Someone! Please? </i></b>- the voice seemed feminine with a begging tone. Almost like a whimper. Sensing and adventure opportunity and not ignoring the calls of help he headed towards and yealled back<br>\r\n<b>- Im here! Hello?! Where are you?</b><br>\r\n<i><b>- Ple... Yes finally a fading light of hope was rekindled brigther. Thank the heavens. Please come and help me! </b></i>- answered the voice<br>\r\nRyuu seemed a bit confused becouse the yell was preatty loud like she was close by, but the voice was calling him from far away. Anyways he was going following instructions.<br>\r\n<b>- Do you see youre surroudings?</b><br>\r\n<b><i>- No sorry, but keep yealling i can tell if you are close or not. </i></b><br>\r\n<b>- Youre quite far, how can you tell, echo here is very strong.</b><br>\r\n<i><b>- You ask ill answer just to get pshyced im psycho.</b></i><br>\r\n<b>- What?!</b><br>\r\n<i><b>- Sorry i meant dont get psyched im psychic.</b></i><br>\r\n<b>- Wait do you...?</b><br>\r\n<i><b>- Read youre mind like a book, well yes and no. Yes i can hear youre thoughts, but im not diving deeper. Dont worry youre secrets are kept for you. And yes thats is a relief.</b></i><br>\r\nRyuu had some doubts, but his concerns went to rest when the voice reasurred.him that is ok, and he could hear in her something voice was honest and really needed help. Plus he found that her style of saying things was interesting. Some time later he heard<br>\r\n<i><b>- Yes! You are here i can sense as you stand near.</b></i><br>\r\nRyuu quickly looked around searching where the voice would be. The o0nly thing he saw was a big cavern with lots of boulder lyeing around and broken wooden pillars and of course stone walls.<br>\r\n<b>- Still cant see you<br>\r\n<i>- What is it that you see, you are close it must be.</i><br>\r\n- The only thing is see is some boulders, stone walls and... Hey what a cool looking low relief. It looks like its coming out of the wall.<br>\r\n<i>- Can you describe it?</i><br>\r\n- Well it looks like its been hit. It shielding her head with her paw and wing. <br>\r\n<i>- Its me im stuck here, thats why i could not move</i><br>\r\n- Thats you? -</b>asked Ryu, while poking the statue <b>- can you feel it?<br>\r\n<i>- Well feel some poking?</i><br>\r\n- It is. Too bad i cant see youre face<br>\r\n<i>- Maybe youll see it when you get me out of this stone hell that is my prison.</i><br>\r\n- Ok, ok i'll...</b></span></div></div>",
            "created":1581539940,
            "id":2786484,
            "title":"Month later"
        },
        "1233":{
            "choices":[
                "The mining hall.\"",
                "meal room.\"",
                "training room.\""
            ],
            "content":"<div class=\"\"><div> <span>Ryuuka and Mei look at the entrance of the mines and see six other dragons. There were three males and three females. Most of whom were here on their own accord unlike Mei and Ryuuka.<br>\r\n<br>\r\n\"Looks we got ourselves a hero. Try not to cause a cave in miss herodragon.\" A dragoness teased Mei.<br>\r\n<br>\r\n\"That's completely rude! Just because I try to stop tyrants doesn't mean I try to destroy things in the process!\" Mei pridefully responded.<br>\r\n<br>\r\nRyuuka rolled his eyes. He knew Mei was being sarcastic, but sometimes her ego can cause trouble despite her kind nature.<br>\r\n<br>\r\n\"Would you two just knock it off. Our boss isn't going to start the tour if we bicker like young drakes.\" Ryuuka said as he rolled his eyes at the dragonesses.<br>\r\n<br>\r\nBoth dragonesses quiet down as the white muscular dragon in charge of the mines stares at them.<br>\r\n<br>\r\n\"Now that everyone is here it is time for the tour. I am Draxon and I will be in charge of every mining expeditions. You will all work twelve hours a day. Meals will be provided daily. If you're lucky we might be able to hunt something in the mines. These mines are larger then you think, so don't wander off by yourselves. Always take take a buddy or two. Any questions before we leave?\"<br>\r\n<br>\r\n\"No sir!\" Every dragon said in total submission to older and larger dragon.<br>\r\n<br>\r\n\"Very well. Our first stop is...\"</span></div></div>",
            "created":1446908160,
            "id":2057823,
            "title":"Six other dragons"
        },
        "124":{
            "author_id":"vault-dweller",
            "author_name":"Demon-Lord-Raiju",
            "choices":[
                "that night.",
                "one day later.",
                "the mating ritual."
            ],
            "content":"<div class=\"\"><div> <span>Ryuuka went stiff when his elder said that, fear in his eyes as he looked up at the five elder dragons, who were all in agreeance. \"B-B-Broodmother....?\" he asked, his voice breaking as Skaldanir slowly lowered his head, nodding, eyes pitying as he looked down at Ryuuka. \"Yes...you haven't earned the right to be a Patriarch of the colony....so instead, you shall become a matriarch.\" he explained, Ryuuka's eyes filled with fear as the large dragon slowly raised a claw, one of its digits glowing with elder magic as he touched Ryuuka's chest, making him cry out as the magic began to change him.<br>\r\n<br>\r\nRyuuka fell onto his back, writhing in pain as his body changed, his ribcage becoming slimmer, as his hips widened some, his entire body's musculature compacting into its slim feminine counterpart as his eyes became more feminine and weak, his mane grew out longer and his tail grew some as well, his already feeble size diminished in his new female form, however, one last thing was to change, as Ryuuka screamed, his male sexual organs morphed into female ones, a new slit opening up beneath her tail as two small glands formed between her legs, inactive in her virgin state. Now a female, Ryuuka slumped to the ground, twitching some as the remnants of the magic left her, panting and aching all over.<br>\r\n<br>\r\nLilika frowned in pity at the new dragoness, slowly waddling over to her and nuzzling her. \"Ryuu....stand...the elders aren't finished addressing you...\" she said gently, using her tail to lift the slim dragoness into a standing position, waiting for her to get onto her shaky legs, and look back at the elders, who all looked down at the new Ness with no emotion, Skaldanir however, seemed pained, as he lowered his head to look at the female teens, inspecting Ryuu for any signs of damage, before rising again. \"you will be given a few days to adjust...then you will be mated to one of the colony's males. you are dismissed...\" he said, getting up and walking out of the chamber with his fellow elders, their footsteps thundering as they left.<br>\r\n<br>\r\nRyuu stood there, feeling humiliated and weak as Lilika helped her stay standing, before guiding her out of the chamber to another part of the colony, where the broodmothers rested, there were a few broodmothers in at the time, and they all turned to look at the new arrival with some curiosity as she was brought in by the respected Adolescent, who helped Ryuu over to a bed of straw, laying her down to rest, before laying beside her.<br>\r\n<br>\r\nRyuu just lay there on the straw bed, despondent as she realised what a mistake she'd made, closing her eyes tight as a few tears leaked out, she cried for a while, before feeling a strange warmth next to her, looking up to see Lilika laying right next to her, something that she never usually did, her long, thick tail draped over Ryuu to keep her warm and cuddle her to the fat dragoness' side.<br>\r\n<br>\r\n\"...L-Lilika...? what are...you doing?\" she asked, looking very confused at the crystal blue dragon, who smiled as she nuzzled the smaller red dragon. \"guess now would be a good time to tell you I like females...\" she said, smiling as Ryuu gawked at her. \"w-what?!\" she asked, incredulously, staring at her crush, who merely smiled and nuzzled her. \"Yup, and i even persuaded Skaldanir to give you to me after your mating~\" she said, nuzzling Ryuuka, who was in overload, unaware if she should feel happy she got the female she always wanted or sad that it was going to be her having the chicks.<br>\r\n<br>\r\n</span></div></div>",
            "created":1413694800,
            "id":1874136,
            "title":"To become a broodmother.\""
        },
        "1243":{
            "author_id":"vault-dweller",
            "author_name":"Demon-Lord-Raiju",
            "choices":[
                "Ryuu wakes up in Lilika's room, startled by her belly and udders.",
                "Ryuu wakes up hungry, needing food for her eggs.",
                "Ryuu wakes up in Lilika's room, finding herself oddly aroused by her new body."
            ],
            "content":"<div class=\"\"><div> <span>Two long days later, Ryuuka sat anxiously waiting with Lilika, who had already claimed ownership of Ryuu in the intervening days, something she found a bit humiliating to say the least, but she couldn't focus on that right now, she was too busy staring at the group of males who had gathered, each one charged with giving her children, meaning she wasn't getting off easy, there had to be at least twelve!<br>\r\n<br>\r\n\"Ohh....i'm not sure about this Lil...\" she said, voicing her concerns, worried by her new life swiftly approaching, however, Lilika gently licked her cheek, nuzzling her to calm her down some. \"hey...whatever happens, you'll still have me by your side Ryuu...I promise...\" she said, making her girlfriend smile some before her attention snapped back to the group of males, who had just finished drinking from an odd pool of water, elder Skaldanir beckoned her over to them, gesturing to the pool of strange green water. \"come...drink...\" he encouraged, giving her a gentle nudge of encouragement, making her bush and slowly lean down, drinking a few mouthfuls of the strangely sweet water, before bringing her head up, making a face like she'd just eaten a rotten fruit, before her eyes widened, and then shifted towards the males in her company, their throbbing members scents' intoxicating as she slowly lay down, looking to her first Mate with lust.<br>\r\n<br>\r\nThe horny male saw the cue, slowly walking around behind her and watching her lift her tail up, revealing her waiting slit for him, her heat intense even to a dragon as he plunged in, drawing a long drawn out moan from the virgin ness, who started to pant as her lover furiously humped, the love making hot and fast as Ryuu began to embrace her new female instincts, her tail stroking her lovers abdomen as he finished his work, leaving her ready for the next, the relay of lovers going on for a good four hours, Lilika sort of pained to watch as it ended, Ryuu laying on the floor of the chamber, belly bulging some with the seed of her mate's, before Skahldanir brought over a small bowl filled with the same water from the spring, making Ryuu drink it before she passed out, panting gently in her sleep.<br>\r\n<br>\r\nThen, before Lilika's eyes, Ryuu's belly began to bulge, slow at first but growing in speed, swelling out till it reached her legs in width, a massive dome of reed scales, and, when Lilika looked behind Ryuu, she saw two sagging, full udders beneath her tail, blushing some herself as she sat back to attention, ready to hear the elder address her.<br>\r\n<br>\r\n\"Lilika...you are now appointed as this young mothers surrogate mate, this is after you requested as such, your request is granted, keep her safe and happy.\" the elder said, looking down on the young pregnant ness he'd raised as his own since hatching, before sighing, leaving with the tired boys, Lilika slowly putting Ryuu on her back and waddling out to her own cave in the mountain.<br>\r\n<br>\r\nwhat happens next?</span></div></div>",
            "created":1413954000,
            "id":1875758,
            "title":"the mating ritual."
        },
        "12431":{
            "choices":[
                "Mate",
                "Lilika explains the guilt he had and why he chose to become  a male"
            ],
            "content":"<div class=\"\"><div> <span>When Ryuuka woke up she was in Lilika's room, but that wasn't the problem. The problem was she was a male turned into a brood mother. She looked at horror as she noticed her belly and utters sagging. She was overcome by her hormones.<br>\r\n<br>\r\n\"This is terrible! I was willing to accept any punishment, but this is too extreme!\"<br>\r\n<br>\r\n\"Calm down Ryuu. I'll be here for you.\" said a somewhat familiar but oddly masculine voice.<br>\r\n<br>\r\nLilika enters the cave revealing to Ryuuka that he was now a male. As a male Lilika had every feature typical of a male. He had tons of muscle hidden under his fat frame and his white mane was slightly shorter. Ryuuka notices that Lilika is also taller, but probably the fattest males that she has seen.<br>\r\n<br>\r\n\"Is that you Lil?\"<br>\r\n<br>\r\n\"It is Ryuuka. When I said I liked girls I meant it, so I decided to become a guy. Now my love shall we have some fun with our new bodies?\"<br>\r\n<br>\r\nRyuuka was still in shock from this but was finding herself attracted to Lilika's new masculine body.<br>\r\n<br>\r\n\"Thanks Lil. This should make this more bearable.\" Ryuuka said as she cuddled against her large and in charge boyfriend. \"What should we do first Lilika?\"</span></div></div>",
            "created":1413954000,
            "id":1875911,
            "title":"Startling changes"
        },
        "12432":{
            "author_id":"vault-dweller",
            "author_name":"Demon-Lord-Raiju",
            "choices":[
                "Lilika returns, bringing with her a strange artifact.",
                "Meanwhile, in a powerful sorcerers lair."
            ],
            "content":"<div class=\"\"><div> <span>Ryuu frowned as she slowly came to, groaning as she lifted her head, looking about groggily, and blushing as her eyes fell upon her expanded midriff and udders, blushing before a loud growl came from her belly, along with hunger pains, making her blush and stand, grunting at the weight of her new belly, which let out another growl as she adjusted to the swinging of her udders, blushing heavily. \"urg...alright alright...i'm getting you some food...\" she said, trying to soothe her belly as she waddled to another room of Lilika's alcove, smiling some when she saw the crystal blue ness breathing fire into life in an indented part of the wall, meant to emulate a human fireplace, sending a soothing warmth into the sub-cave.<br>\r\n<br>\r\n\"mm...that feels better....\" Ryuu cooed as she walked over to Lilika, who looked up, smiling as she waddled over, licking Ryuu's cheek. \"Morning 'Big-Momma'~\" she said, smiling at the pink that tinged Ryuu's cheeks. \"aw...i'm not that big yet am I?\" she asked, looking at herself, self consciously, making the much more gravid dragoness chuckle as she nuzzled her. \"oh hell no, not yet.\" she said, smiling as she led Ryuu to the fire, laying her down and going to fetch something to eat, coming back with some salted elk, which Ryuu quickly scarfed down, much to her own surprise as she licked her lips.<br>\r\n<br>\r\n\"heh, guess those eggs give you one hell of an appetite eh Ryuu?\" she asked, making Ryuuka blush and nod. \"yeah...feels like they're taking everything i have...\" she said, blushing.<br>\r\n<br>\r\n\"ah don't worry Ryuuka, theres plenty more where that came from.\" she said, licking Ryuu's cheek as she went to get more, Ryuu smiling some at the pretty view of her girlfriends rump as she waddled away, before bringing back a couple of cows, Ryuu salivating at the mere sight of them, letting Lilika take one, she quickly wolfed the second down, moaning happily as it finally filled the hole, feeling satisfied, she lay on her side next to the fire with Lilika, smiling as her tail wagged, Lilika smiling at how adorable the young mother looked with her big belly and udders, nuzzling her some before letting her sleep.<br>\r\n<br>\r\nA few hours later, Ryuu woke up again, noticing Lilika was gone, probably out on an errand for the elders, she thought, as she slowly got to her feet, blushing as she felt her belly swing side to side a bit, taking a step forward before she looked down, seeing she seemed a bit pudgier, tentatively poking her chest with a claw, she frowned as it sunk in some, before she yawned, feeling her belly growl.<br>\r\n<br>\r\n\"what? again? ughhh but i just fed you a few hours ago!\" she groaned, angry, before she sighed as another growl filled the air, making her slowly walk into Lilika's larder, looking at all the meats and other foods, before picking a couple of elk and eating them, sighing as that seemed to satiate her black hole of a stomach, before she walked out and looked around some, having never been in Lilika's cave, she decided to explore, seeing the usual dragon stuff, bed, fire, and to Ryuu's admiration, a very impressive hoard of gold and jewelry in the corner, which she smirked at, before walking back to her place at the fire, sighing as she sat down, placing a paw to her belly, able to feel the eggs within shifting around some.<br>\r\n<br>\r\n\"...dam....am i really cut out to be a mother...?\" she asked herself, before looking at a large golden mirror in Lilika's hoard, seeing her reflection, no longer a powerful beast, but a weak, pregnant female, who probably couldn't fight her way out of a sack anymore, let alone a human village, it was disgraceful, and she hated it. Then there was the worry of actually caring for her hatchlings, however many she was going to be having. Worry. Worry. Worry.<br>\r\n<br>\r\nwhat happens next?</span></div></div>",
            "created":1413954000,
            "id":1876007,
            "title":"Ryuu wakes up hungry, needing food for her eggs."
        },
        "124322":{
            "author_id":"vault-dweller",
            "author_name":"Demon-Lord-Raiju",
            "choices":[
                "Back with Ryuuka.",
                "Later at the castle."
            ],
            "content":"<div class=\"\"><div> <span>Meanwhile, in a far off castle, the home of Gellot the Great, one of the greatest, and most just wizards of all time, and head envoy between dragons and humans. The wizard sat in his library, drinking a cup of tea and sighing to himself as he stroked his long white beard, anxiety building in the pit of his stomach as he looked to the setting sun in the sky.<br>\r\n<br>\r\n\"...oh meridian preserve us...I do not know how much longer i can go on like this...\" he said to himself, taking a sip of his tea as he tried to ease his mind, thoughts of the last dragon attack still fresh in his mind. It was true he had a very strong friendship with the elders of the dragon colony in the mountains, but, to his regret, it seemed that with every generation of adolescents after those elders there were more who deemed humanity as ilk instead of equals, as they had been established during the long pact years, with more and more young dragons attacking villages and being slain by knights out of vengeance, it was horrid, the peace treaty was holding back all out war by the thinnest of threads, but he dreaded the day when the dragons unanimously decided they were better than humans, for the war that would come after that would be a horrid and messy affair to say the least.<br>\r\n<br>\r\nLooking out the window, he smirked as he saw his young apprentice Wallin, doing his chores magically around the castle farm, tending to the cattle and other animals with care, however, as he watched, he saw his student bring one severely emaciated calf they'd found a while back out into the middle of the courtyard, before standing before it and preparing to cast a spell, piquing the old wizard's interest as he leant against the windowsill watching, then his eyes went wide as the thin, bony calf swelled out, growing fat and healthy, then even more so, then to his astonishment, the calf became a large ball of fat, head, hoofs, tail and udder sticking out of its round engorged body at the ends of cone like limbs, a fat neck and stumpy tail base, making the wizard remove his glasses to check he wasn't seeing things.<br>\r\n<br>\r\nWallin seemed just as surprised as his instructor, staring at the huge ball of a cow in amazement, before getting up to check the beast was alright, and sighing with relief as the calf gently nuzzled his hand affectionately, that being one of the few acts of movement it could manage as the young apprentice slowly rolled it to a stall, magically enlarging it to make room for the calf.<br>\r\n<br>\r\nGellot watched in amusement, smirking, before his mind began to wander, wondering what that spell would do to a dragon, which made him laugh, before realizing the idea wasn't as mad as he first thought, quickly running down to his apprentice, the gears in his head turning.</span></div></div>",
            "created":1414645200,
            "id":1879559,
            "title":"Meanwhile, in a powerful sorcerers lair."
        },
        "125":{
            "choices":[
                "Lilika and Ryuuka are ambushed",
                "Ryuuka asks Lilika what she likes in a male",
                "Ryuuka  and Lilika spot the warlock, but Ryuuka does something foolish"
            ],
            "content":"<div class=\"\"><div> <span>...to investigate a disturbance with Lilika. There's been rumors of a warlock who's been kidnapping the hatchlings and I want you two to find out if this is the case. Hopefully by putting you two on this case will help the both of you.\"<br>\r\n<br>\r\n\"Thank you elder for showing me such kindness.\" Ryuuka said with a sigh of relief.<br>\r\n<br>\r\n\"Just be thankful I wasn't in a foul mood. I could have made you a brood mother.\" Skaldanir warned.<br>\r\n<br>\r\nRyuuka shakes with fear of the thought of being a mating slave to the other dragons while he would be laying eggs or if the elders decided to make him a brood father which is similar except he would be completely immobile and still a male, but at the mercy of any dragoness who needed a quick mate.<br>\r\n<br>\r\n\"One more thing if the warlock is planning anything, regardless if he has hatchlings or not don't do anything stupid.\" a female elder warned.<br>\r\n<br>\r\n\"Thank you Madam Titinina.\" Lilika responded as she and Ryuuka made their way out.<br>\r\n<br>\r\nLater...<br>\r\n<br>\r\n</span></div></div>",
            "created":1413694800,
            "id":1874220,
            "title":"To investigate a disturbance with Lilika\""
        },
        "1252":{
            "choices":[
                "Later that night Ryuuka starts raiding Lilika's game that she caught.",
                "They find the warlock",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Later as Ryuuka and Lilika were in mid-flight searching for the warlock's fortress Ryuuka decided that now would be a good time to try to use a pickup line on Lilika.<br>\r\n<br>\r\n\"Lilika, what do you look for in a mate? There must be some reason why you turned down every male that has had guts to talk to you.\"<br>\r\n<br>\r\n\"Not now Ryuuka. We have to find that warlock and report back to the elders.\"<br>\r\n<br>\r\n\"I know that, but we should stop and find some game soon. Surely someone as gorgeous as you needs all her strength.\"<br>\r\n<br>\r\n\"Please stop. You're starting to sound like every other guy that's fallen for me.\"<br>\r\n<br>\r\nRyuuka grins as his plan seems to be working.<br>\r\n<br>\r\n\"I'm not trying to be rude. We've been friends for a long time. Surely you can tell me what you like in a guy.\"<br>\r\n<br>\r\n\"I'll tell you. Let's just land first. I just have to check if anything got caught in any of my traps that I set up.\"<br>\r\n<br>\r\nThe two dragons land in a forested area and Lilika checks her traps. A few moments later Lilika is seen hauling in a few deer and a large net full of fish from the stream.<br>\r\n<br>\r\n\"That's more than I catch. No wonder the guys are anxious to mate with you.\"<br>\r\n<br>\r\n\"This is more than I get for a normal meal. There should be more than enough to feed for a few meals.\"<br>\r\n<br>\r\n\"Lilika, are you going to answer my question?\" Ryuuka asked in his usual hotblooded manner.<br>\r\n<br>\r\n\"What I look for in a mate is someone who has an interesting personality and bigger than me.. All the other guys have been way too small for my liking.\" Lilika grudgingly replied.<br>\r\n<br>\r\n\"Bigger than you how?\" Ryuuka asked.<br>\r\n<br>\r\n\"My ideal mate has to be fatter than me. Usually dragonesses like their dragons big.\" Lilka answered.<br>\r\n<br>\r\n\"So if a guy asked you out and he was as fat or fatter then you'll give him a chance?\" Ryuuka asked knowing that he found a way to get Lilika to eventually mate with him despite having to overindulge to do it.<br>\r\n<br>\r\n\"The answer's yes.\" Lilika replied as she rolled her eyes at Ryuuka.<br>\r\n<br>\r\nRyuuka and Lilika eat their meal before heading after the warlock. Ryuuka made sure to eat a bit more so he dtart putting on weight in order to impress Lilika.<br>\r\n<br>\r\n</span></div></div>",
            "created":1413781200,
            "id":1874638,
            "title":"Ryuuka asks Lilika what she likes in a male"
        },
        "12521":{
            "choices":[
                "Ryuuka and Lilika resume their search",
                "Lilika tries forcefeeding Ryuuka"
            ],
            "content":"<div class=\"\"><div> <span>Later that night when Lilika was fast asleep Ryuuka decided to raid the game that she caught. Ryuuka greedily dug into the game. For hours he stuffed himself. Normally Ryuuka would not do this, but he figured that there is no point in staying lithe if the dragoness he loved wanted a fat dragon. Hopefully he and Lilika can find out what happened to the missing hatchlings soon.<br>\r\n<br>\r\n<i>I must put on weight. Lilika wouldn't want to mate with me if I'm too thin for her.</i> Ryuuka thought as he forcibly forced more food into his muzzle.<br>\r\n<br>\r\nUnfortunately, Ryuuka was barely able to make a dent in the overabundant game.<br>\r\n<br>\r\n\"Too full. Must rest.\"<br>\r\n<br>\r\nRyuuka collapses from exhaustion. The commotion briefly woke up Lilika. She checked her game that she caught and found Ryuuka sleeping beside it. She then noticed that Ryuuka's belly was distended from his binge.<br>\r\n<br>\r\n<i>So he's trying to get fatter for me. This should be interesting to watch. If he can get big enough I may have to accept his mating proposal.</i> Lilika thought to herself as she fell back asleep.<br>\r\n<br>\r\nThe next day...</span></div></div>",
            "created":1436850000,
            "id":2007796,
            "title":"Ryuuka's Late Night Binge"
        },
        "125211":{
            "choices":[
                "A little girl torturing hatchlings",
                "A magical lamp"
            ],
            "content":"<div class=\"\"><div> <span>The next day Ryuuka and Lilika set off to find the missing hatchlings. Ryuuka overindulged himself during breakfast to prove to Lilika that he's willing to get fat for her. During their flight the two adolescents engaged in a conversation.<br>\r\n<br>\r\n\"Hey Ryu, were you eating my game last night while I was asleep?\"<br>\r\n<br>\r\n\"What makes you say that?\" Ryu said as he subconsciously rubbed his bulging belly that he was starting to grow.<br>\r\n<br>\r\n\"Maybe it's that belly you recently acquired. You're still too small for me if you think you can propose to me at that size.\"<br>\r\n<br>\r\n\"That's why I'm trying to get bigger. You did say that you preferred heftier dragons.\" Ryuuka teased Lilika.<br>\r\n<br>\r\n\"That's if someone bigger than you doesn't try to hit on me first.\"<br>\r\n<br>\r\n\"Fortunately for me none of the other males know that.\" Ryuuka said in a cocky tone.<br>\r\n<br>\r\n\"Ryu, look down there. Do you see what I see?\"<br>\r\n<br>\r\n\"I sure do. Let's check it out.\"<br>\r\n<br>\r\nLilika and Ryuuka notice...</span></div></div>",
            "created":1437973200,
            "id":2013120,
            "title":"Ryuuka and Lilika resume their search"
        },
        "12523":{
            "choices":[
                "The next day Ryuuka is tasked with gathering a rare mineral from a local cavern",
                "Ryuuka needs to fetch magiwood from the Mystical Raven."
            ],
            "content":"<div class=\"\"><div> <span>Later that night when Lilika was fast asleep Ryuuka decided to go for a midnight flight and to catch some game so he can reach a size where Lilika would like to mate with him. Everything was going well until he saw a bear stuck in the bushes.<br>\r\n<br>\r\n\"This should be an easy catch.\" Ryuuka said to himself as he preceded to swoop down.<br>\r\n<br>\r\nHowever, When Ryuuka preceded to go near the bear he was immediately caught in a net made from pixie dust. The difference between fairies and dragons lies in the fact that dragons are naturally good, but have a bad rep due to mischievous dragons and dragonesses such as Ryuuka and Mei, who is also in Ryuuka's sister. Fairies on the other hand, appear innocent but are murdering psychopaths. There are exceptions but it is rare to see a good fairy since they're mostly interested in mutilating their victims or blaming dragons for mass murder.<br>\r\n<br>\r\n<i>Great, I can't break out of this stupid net. Looks like my punishment was death by fairies. I shouldn't have fallen for that trap.</i> Ryuuka thought as he tried to break free.<br>\r\n<br>\r\n\"I finally got you. It's time to pay for your crimes murderer.\" Said a human dressed in a regal outfit.<br>\r\n<br>\r\n\"Are you talking about last night? That was just a prank. The only things dead are two cows. Other than that I was bored.\" Ryuuka responded.<br>\r\n<br>\r\n\"Your actions have caused an uprising where the people started to massacre each other and the the fires caused some to suffocate to death. Because of you a band of brutes are enslaving my kingdom. It's your fault that Dago von Stein has overthrown my father.\"<br>\r\n<br>\r\n\"Dago von Stein? Is he the warlock I'm supposed to hunt? The elders sent me on a mission to investigate a warlock who has been kidnapping hatchlings. I'm also sorry for the troubled I caused. If you let me go I can do my job so the elders don't banishment me from the clan.\"<br>\r\n<br>\r\n\"Nice try dragon, but you are not going off easy. You'll rebuild every village you burned down until their bustling strongholds. Refuse and be prepared to meet my enchanted blade.\" The swordswoman responded.<br>\r\n<br>\r\n\"Ok I'll help you, but promise me to let me out and tell me more about this Dago.\"<br>\r\n<br>\r\nThe swordswoman free Ryuuka from the net.<br>\r\n<br>\r\n\"You're good to go, but take me to your encampment so no pervert attacks me while I slumber.\"<br>\r\n<br>\r\nRyuuka lifts the bear and puts the swordswoman on his back. When he returned the that night Lilika was ticked off.<br>\r\n<br>\r\n\"You had to do something foolish despite Madam Titinina telling you not to.\"<br>\r\n<br>\r\n\"But Lilika, I was just hunting for some game until I fell for a trap. I even have the bear and the princess to prove it. Trust me that princess ordered me to help her rebuild the villages I burned last night. I didn't have a choice. It was either help her or die.\"<br>\r\n<br>\r\n\"Fine, but as long as we get our mission done.\"<br>\r\n<br>\r\n\"Don't worry ma'am. As a swordswoman I promised to reveal Dago's whereabouts. He's taken over my father's castle and is using his pets to torture people.\"<br>\r\n<br>\r\n\"He's using the hatchlings as his slaves! That's child cruelty. hatchlings need to be with their parents. Not serving a warlock.\"<br>\r\n<br>\r\n\"Let's rest. Your friend has a lot of work to do tomorrow.\"</span></div></div>",
            "created":1413954000,
            "id":1876152,
            "title":"The Swordswoman's Revenge"
        },
        "125231":{
            "choices":[
                "Ryuuka feels slightly stronger",
                "underwent a growth spurt and is starting to plump up while getting stronger."
            ],
            "content":"<div class=\"\"><div> <span>The next morning the swordswoman explained to Ryuuka that he needed to head to Coalburn Caverns to mine dexterium. A rare material that is said to be formed when diamonds are enchanted with magic. The Coalburn Caverns is the only place to find them, but rumors have it that they can regenerate as long as they retain their magic. So Ryuuka flew to the caverns and preceded to enter.<br>\r\n<br>\r\n\"This is the first time I've been here. There should be a few dragons around that should know where this dexterium is. The sooner I rebuild those villages the more time I'll have to get fat for Lilika, yet I wonder if she'll mind some extra muscle though. Defibtely don't want to become a brood father. Those guys are fat beyond belief and all they do is mate and eat all day.\" Ryuuka said to himself.<br>\r\n<br>\r\nAS Ryuuka went deeper into the cavern he could hear heavy grunts. He was certain he ran into some of his kind. When Ryuuka peered into the chamber his mouth dropped as he saw three extremely buff adults carrying large slabs of minerals. The adolescent became nervous, since he won't become an adult until he's mated at least once. For dragons the mating ritual marks the first steps of adulthood and it's not until after mating that dragons go through strange growth spurts ranging from buff or obese and usually gaining a few feet in height immediately after unlike the slow growth of adolescents.<br>\r\n<br>\r\n\"Yo! I need some dexterium! I'll just go take some if you're too busy!\" Ryuuka said as he started using his tail to grab some minerals.<br>\r\n<br>\r\n\"Hold a moment kid! Aren't you supposed to be serving your punishment and not fooling around here,\" glared the massive green and white dragon.<br>\r\n<br>\r\n\"That's what I'm doing. I found a lead on the warlock, but my source refuses to tell me until I rebuild the villages I burned down.\" Ryuuka replied.<br>\r\n<br>\r\n\"Looks like Skaldanir knew what he was doing when he sent you on that mission with Lilika. My younger bro. was burning with jealousy when he found out that you two were sent out together. He's been trying to come up with a way to attract Lilika from right out under your claws.\" The silver dragon replied.<br>\r\n<br>\r\n\"I found out what attracts Lilika. She's not interested in males smaller than her.\" Ryuuka said hoping not to reveal too much about his plan.<br>\r\n<br>\r\n\"That rules out almost every adolescent and by big she probably means a tough and sturdy dragon with a big appetite. The Blue and gold dragon said. \"Go ahead kid and take what you need. Carrying this stuff should really help you get stronger. It's incredibly heavy.<br>\r\n<br>\r\nRyuuka picks up a shard of dexterium and is surprised to find the material nearly weighing him down.<br>\r\n<br>\r\n\"This stuff is heavy. I'll have to take over one piece at a time. Thanks dudes.<br>\r\n<br>\r\nRuyuuka than leaves with a small bag of dexterium which was starting to regenerate as he walked back to the village. It was nightfall when Ryuuka arived and he was starving. The swordswoamn gives Ryuuka to bulls to devour for his hard work. Tomorrow Ryuuka would have to use his fire breath to sculpted the dexterium into a wall and start using it around the houses. The next morning...</span></div></div>",
            "created":1414040400,
            "id":1876386,
            "title":"Mining some Materials and Loot"
        },
        "1252312":{
            "choices":[
                "Ryuuka rushed the work and gets scorned",
                "Ryuuka finishes the work and is given a feast for his work"
            ],
            "content":"<div class=\"\"><div> <span>The next morning when Ryuuka woke up he felt oddly different. H e then stares at his reflection in the water and is surprised to see the changes. In the water was a slightly taller, more muscular, and fatter version of himself.<br>\r\n<br>\r\n<i>What the blazes is going on here? Is this one of those random dragon growth spurts? I know upon mating they're common in adults, but we adolesacents rarely get them. Who cares. Maybe Lilika would want to forge a deal and become my mate.</i><br>\r\n<br>\r\n\"There you are. You have to mold the dexterium so they people can be safe from that warlock and his pets.\" said the swords woman as she was carry a few canteens.<br>\r\n<br>\r\n<i>I forgot. I have to fix all the villages that I burnt down before this princess tells me where to find that hatchling napper.</i><br>\r\n<br>\r\nRyuuka flies to the village and starts molding the dexterium with his fire breath.<br>\r\n<br>\r\n**********************************<br>\r\n<br>\r\nA few hours later....</span></div></div>",
            "created":1414904400,
            "id":1880767,
            "title":"Growth Spurt"
        },
        "12523122":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "food dishes ",
                "live animals"
            ],
            "content":"<div class=\"\"><div> <span>There, finally done. All the villages that were burned down are repaired and the dexterium will help the villages against magic.<br>\r\n<br>\r\n<i>“Dragon! There you are, the village people would like to thank you for your help and the reward is a giant feast. “said the swords women as she was surround by a few villagers.</i><br>\r\n<br>\r\nRyuuka flew into the center of the village and found a few tables brimming with food.The tables were filled with different types of meat. From deer to to beef to huge meaty pork dishes. There even live food, several cows and oxen, a few fat deer, and some round and fatty horses.<br>\r\n<i><br>\r\nSo much food. I don’t know where to start.<br>\r\n<br>\r\nLet’s start with the.....</i></span></div></div>",
            "created":1462440420,
            "id":2143466,
            "title":"Ryuuka finishes the work and is given a feast f..."
        },
        "125231221":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "a large farewell feast for him",
                "the swordswoman with her information"
            ],
            "content":"<div class=\"\"><div> <span>Ryuuka decided to eat the food dishes. He knew that the animals are not going anywhere. Ryuuka dragon started with the pork dishes. He left each plate and started to stuff himself. The meat dishes tasted heavenly and Ryuuka soon started to chow down on the food dishes. <br>\r\n<br>\r\nAn hour late and Ryuuka let out a large burp and he patted his bloated stomach.  He looked like he swallowed a ball the size of a small house. He felt sleepy and let out a yawn. Just when he was about to take a nap to digest his meal, he heard some talking to him.<br>\r\n<br>\r\n“Hey dragon! You upheld your part of the deal and I will do duty my end of the deal. Give me a few days as one of my contacts have information on the warlock and the magical defenses he uses to protect himself and the castle form outside threats. The information is buried in a mountain of paperwork. I need to find it. Also, we found that we have a lot of left over dexterium and the forge masters have craft you a large pendent for to wear or give a gift to someone special. “said the swordwoman as she explained her situation.<br>\r\n<br>\r\nRyuuka understood and bid them goodbye and soaked up the cheer from the happy villagers. He noticed that the sun has gone down and the moon has come out with the stars.  The dragon soon fell fast asleep. When he woke up due the sound of birds chirping. He saw….<br>\r\n<br>\r\n</span></div></div>",
            "created":1514947620,
            "id":2436045,
            "title":"food dishes "
        },
        "13":{
            "choices":[
                "to work in the gem mines.\"",
                "Become a brood father.\"",
                "Gain weight until you're immobile.\"",
                "Find a new source of water.\"",
                "Investigate issues that have been plaguing our colony.\""
            ],
            "content":"<div class=\"\"><div> <span>It was a long night. Mei had just finished raiding a city, but the reason is not what most of her kind would assume. Unlike Ryuuka who does it out of fun, Mei does it to liberate people from corruption. She had just finished scaring the warlord of the city into treaty his people like they're actual people and tools to meet an end. This however was against dragon law. Dragon law states that dragons are not to meddle in human affairs, and that it is up to the dragon elders to decide whether to intervene or not, but Mei's sense of justice causes more harm than good.<br>\r\n<br>\r\n\"What a night. Hopefully that human warlord learned his lesson. I can't scum like him are let loose.\"<br>\r\n<br>\r\nMei manages to get some rest before a guest appeared. By then she was awake. A grin formed on her muzzle as remembered the previous night's heroics. Her white mane partially draped her back as she stood on her feet.<br>\r\n<br>\r\n\"Last night was great. Hopefully that tyrannical warlord learned his lesson.\"<br>\r\n<br>\r\n\"Tell me more. How many homes did you scorch just to bring justice one man to justice?\" came a deep and powerful masculine voice, shocking Mei into a sitting position. She then gazes at the large green male with an embarrassed look who's eyes showed disappointment.<br>\r\n<br>\r\n\"Dra... Draxius! I didn't mean to. I was just trying to rescue them from a tyrant. No one died or got hurt, so it can't be that bad, right?\" Mei said in the calmest tone possible as she looked at her crush, while blushing a bit. Draxius sighed and shook his head. \"I understand Mei, but the elders specifically told you NOT to meddle in the affairs of humans. It's due to your recklessness that humans hate us!\" Draxius said in a scolding tone. Mei  stared at the larger male dragon with shock. She wanted to protest, but the disappointment in Draxius' eyes made her at a loss for words. After regaining some composure Mei's ego came out with vengeance.<br>\r\n<br>\r\n\"At least I'm proactive. I've saved countless lives! Humans should be thankful that I saved them from tyranny.\"<br>\r\n<br>\r\nDraxius shakes his head. \"You don't get it. The elders are waiting for you. I was asked to fetch you.\" Draxius groaned.<br>\r\n<br>\r\nNow Draxius wasn't like other dragons his age. He's one of the largest dragons in the colony, but not only for his size. If seen by a human they would consider him obese. His emerald scales glistened brightly across his massive belly and was strong as diamond, but also soft due to his multiple layers of fat. His legs were thick and meaty. Many would say that Draxius was stronger than most given to all the weight he carries everyday. Whenever he walked it was he had a heavy waddle that would cause the ground to shake if he didn't tread lightly. His rear was huge and his fat tail casually covered it. His mane was jet black, but it was shorter than Mei's. His red eyes added some ferocity to his usually cuddly appearnce.<br>\r\n<br>\r\nDespite criticism from the elders, Draxius was the most coveted male. He would often turn away many a pervy female during breeding season, and only speaking to Mei.<br>\r\n<br>\r\n\"Let's go. The elders are deciding your punishment as we speak.\"<br>\r\n<br>\r\n\"Punishment! Why should I get punished for stopping evil!\" Mei said, as a tear rolled down her face.<br>\r\n<br>\r\n\"It doesn't matter. You deliberately broke dragon law. You should have asked the elders before going on your own.\"<br>\r\n<br>\r\nMei was fuming, but she sighed as she followed her hefty companion to the Dragons' Village in the nearby mountain. Mei even helped Draxius get through the smaller openings. Once inside Mei was overcome with remorse as the village sized elders gazed down at her.<br>\r\n<br>\r\n\"You know why you are here.\" A female elder boomed.<br>\r\n<br>\r\n\"I know, but...\"<br>\r\n<br>\r\n\"We don't want to hear it. Your intentions are noble, but you often forget that your actions have consequences. It's counterproductive to save a village if you almost destroy it in the process.\" The central elder said.<br>\r\n<br>\r\n\"I realize that Lord Skaldanir. But you don't realize that there's a tyrant who's been kidnapping hatch...\"<br>\r\n<br>\r\n\"Actually we are aware, but you can't just rush in there. Therefore your punishment is...\"</span></div></div>",
            "created":1446858780,
            "id":2057658,
            "title":"Mei"
        },
        "133":{
            "author_id":"warpoffman",
            "author_name":"Warp Planechase",
            "choices":[
                "She pigs out",
                "She is force fed",
                "Draxius has to feed hee"
            ],
            "content":"<div class=\"\"><div> <span>She seemed shocked at the idea. \"Wh-wh-what?\" She stammered out. She was perplexed, thinking they were joking. But the serious glares told her they were as serious as ever. She feels a large talon grasp her shoulder, and she is suddenly flanked by a pair of guards. They lead her away, amid must protesting, to a large cave. The smell of food fills the air, making her stomach rumbles she blushes a bit.</span></div></div>",
            "created":1461549600,
            "id":2138927,
            "title":"Gain weight until you're immobile.\""
        },
        "14":{
            "author_id":"warpoffman",
            "author_name":"Warp Planechase",
            "choices":[
                "Amalkash",
                "Abhangi",
                "Ankitanila"
            ],
            "content":"<div class=\"\"><div> <span>Amalkash- older male wyvern, very wise, is a great flyer<br>\r\n<br>\r\nAbhagni- young female, wants to start a family, thinks she isn't pretty enough to be wanted<br>\r\n<br>\r\nAnkitanila- plump female with odd black !markings on her wings. She is knowledgeable in the art of healing </span></div></div>",
            "created":1461549180,
            "id":2138922,
            "title":"wyvern choices"
        }
    },
    "info":{
        "author_id":"vault-dweller",
        "author_name":"Demon-Lord-Raiju",
        "brief_description":"create a dragon and have them experience the joy's of expansion.",
        "created":1383396780,
        "description":"<td align=\"left\" class=\"norm\">this story revolves around the wonderful creatures called dragons, and how you want them to get bigger and rounder.<br>\r\n<br>\r\nrules.<br>\r\n<br>\r\n1. no smut outside of a pregnancy story.<br>\r\n<br>\r\n2. non of the filthy fetishes like scat.<br>\r\n<br>\r\n3.try and make it readable.<br>\r\n<br>\r\n4. don't be shy, if there isn't an expansion you like, write it in!<br>\r\n<br>\r\n5. try to keep the foul language to a minimum.<br>\r\n<br>\r\nill be supplying some basic dragon starting characters, what you do with them, is up to you.</td>",
        "id":1961104,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1581539940,
        "modified":1581539940,
        "pretty_title":"Dragon expansion interactive"
    }
}