{
    "chapters":{
        "1":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Russos",
                "Suitlife"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's story to start with?</span></div></span></div>",
            "created":1272776400,
            "id":877107,
            "title":"Begin!"
        },
        "11":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Justin and moseby",
                "Max, Zack, and Cody ",
                "Jerry"
            ],
            "content":"<div class=\"\"><div> <span>It was a Friday evening when Max came in to justins room. <br>\r\n\"hey justi-in\" max said as he tripped. \" I see you already packed.\"<br>\r\n\"yep just getting a few last minute Things together.\" he said. \"oh! Max Im having trouble bending, will you put my shoes on me, I know you like it and you can do anything you want down there and we can do it on the boat, you and me.\" <br>\r\n\"REALLY!? Okay!\" max asked excitedly.<br>\r\nMax looked at justins soft, tasty-looking toes. He plunged down and put justins succulent big toe in his  mouth and sucked it like a lollipop  and moved down each toe until justins toes were all wet. Then max lifted both feet together and ran his tongue along the balls and arches fo justins feet. Max decided it was enough and slid justins tube socks on ( not without a little tickling though ) and then his high top converse.  They packed and left for the cruise.  When the three male russos came on the boat they were greeted by mr moseby who they remembered from he teen cruise. Then Zack and Cody ran up. Both groups invited them into a private area Jerry went to their room, max with Zack and Cody, and justin with mr. Moseby. <br>\r\nWho do you want to be </span></div></div>",
            "created":1272776400,
            "id":877138,
            "title":"Russos"
        },
        "111":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Licked justins body all over",
                "Suck the equipment",
                "Undressed and had a vice versa"
            ],
            "content":"<div class=\"\"><div> <span>Mosbey and Justin walked into his office and Justin was prodded to sit down. Justin sat down in a recliner and mosbey put the footrest up. Mosebey and Justin talked for a while until a silence appeared. <br>\r\n\"remember a couple months ago on the teen cruise?\" mosebey asked.<br>\r\n\"how could I forget?! Alex turned me blue so you let me stay in your office and you told me your favorite color was blue and threw my flip flops off my feet and commended to lick my feet et cetera.\"<br>\r\n\"mmmmm... May I? Worship your feet I mean.\"<br>\r\n\"why else would I agree to come here?\" Justin replied.<br>\r\nMoseby threw justins shoes down on the floor after pulling a chair over. Next were the socks and before he took them off and ran his nose along the feet. Next he pulled a ziploc bag out of his pocket and stuck justins socks in it and zipped it closed.  Now he was left only staring at justins soft feet.  He picked up the left foot and comensed to kiss each toe biggest to smallest then down the middle of the arch and transferee to the other foot then licked his beautiful feet. <br>\r\n\"now, don't think I'm crazy and run around the boat telling everyone about it but I wanna play with your manhood... Please?\" he asked.<br>\r\n\"I guess my pants, under or otherwise, won't be on for much longer.\" Justin said with a smile.<br>\r\nMoseby jumped for Justin and unbutoned his jeans then ripped the boxers from justins body throwing those into a ziploc as well.  He then proceeded to lick justins feet  as well as getting him to jerk off. Then he... </span></div></div>",
            "created":1272862800,
            "id":877337,
            "title":"Justin and moseby"
        },
        "1111":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "KISSED JUSTIN",
                "Took his clothes off and asked for the same",
                "Asked for max"
            ],
            "content":"<div class=\"\"><div> <span>Moseby than looked at Justin and grinned. He licked justins left leg and once he got to the crotch he started the other leg. Justins equipment was standing tall as mosbey licked around the penis and up to the abs and stomach. Next he sucked on justins pecs and then to the neck. Next he...</span></div></div>",
            "created":1273208400,
            "id":879694,
            "title":"Licked justins body all over"
        },
        "1113":{
            "choices":[
                "took it  his mouth",
                "took it in his hand"
            ],
            "content":"<div class=\"\"><div> <span>wrapped his hands around justins cock and took each succulent toe if his mouth. he smelt right under each toe and it smelt amazing and he began to suck on justins throbbing dick .... and blowing for 5 minutes until justin came  all over moesby and he licked it all up.<br>\r\n\" your turn said justin......<br>\r\n<br>\r\nmoesby sat down and justin(still naked) kissed moesby hard on the mouth and ripped off his tipton jacket and kissed both nipples making them hard.<br>\r\n<br>\r\nhe reached down and took off his tennis shoes and began to smell his sweaty knee high socks... taking big whiffs of the musty stench and rubbing his face in moesbys socks.<br>\r\n<br>\r\nthey smelt amazing and he rubbed them all over justins dick ....he felt so hot and he took off the socks....he was greated by moesbys sweet dark chocolate feet with nice toes and perfect nails .... they smelt like leather and sweat he let his tongue slip out and run around his african feet and tatsed wonderful <br>\r\n<br>\r\nhe popped each toe into his mouth and rubbed his soles all around his face and sucked on his big toe for what seemed like forever<br>\r\n<br>\r\nhe then ripped off his shorts and undies and they were both naked.... <br>\r\n<br>\r\nmoesbys big black dick was rock hard and oozing...<br>\r\n<br>\r\nthen justin</span></div></div>",
            "created":1275022800,
            "id":890677,
            "title":"Undressed and had a vice versa"
        },
        "11131":{
            "choices":[
                "Moseby licked up his own cum",
                "Justin walked in"
            ],
            "content":"<div class=\"\"><div> <span>he saw moesbys huge 9 inch dick and put it inside his warm teen mouth<br>\r\n<br>\r\nhe began to suck and kiss moesbys dick and getting it nice and wet in his warm mouth <br>\r\n<br>\r\nmoesby began to squarm and then justin rubbed his soft soles across moesbys dick causing him to explode and come all over justins feet</span></div></div>",
            "created":1275022800,
            "id":890680,
            "title":"took it  his mouth"
        },
        "111311":{
            "choices":[
                "They arrive holding hands",
                "They arrive barefoot and kissing"
            ],
            "content":"<div class=\"\"><div> <span>After moseby shot his load all over justins feet, he proceeded to lift up justins cum soaked foot, and slowly lick his own juice off, making sure he got in between each and every toe. Justin then plunged forward and kissed moseby, tasting the cum still in his mouth. \"woah i love cum, first max's then dads, now yours, i love it\". Moseby seemed stunned, justin had eaten his own fathers cum, he found that incredibly hot. Mr moseby then suggested that justin should invite both max and jerry to come and have some fun.</span></div></div>",
            "created":1280984400,
            "id":930785,
            "title":"Moseby licked up his own cum"
        },
        "1113112":{
            "author_id":"jdawg16",
            "author_name":"Recess Gang",
            "choices":[
                "YES",
                "Let's leave them alone"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jerry and Max, walk into the room, surprised at the sight of Justin and Moseby naked, licking up each others cum.<br>\r\n\"OH MY GOD!\" exclaimed Max. \"Dad, we should join them!\"<br>\r\nJerry exclaimed....</span></div></span></div>",
            "created":1282767960,
            "id":943925,
            "title":"They arrive barefoot and kissing"
        },
        "11131121":{
            "choices":[
                "Justin kisses his dad",
                "Max licks Justin's feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Yes we fucking should!\" Jerry exclaimed, as he entered the room and approached his oldest son, \"Why don't you give daddy a kiss and some of that lovely sweet cum!\"</span></div></span></div>",
            "created":1302478080,
            "id":1085779,
            "title":"YES"
        },
        "112":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Zack",
                "Cody"
            ],
            "content":"<div class=\"\"><div> <span>Max Zack and Cody:<br>\r\n<br>\r\nMax and the twins left for zack's room (Marcus was out and about while at port) so they talked and it came to the point of talking about last time they were together, on the teen cruise.  <br>\r\n\"Remember last time when I gold you both our little family secret? Max asked.<br>\r\n\"oh yeah,\" Cody replied, \" your family's male members have a male foot fetish and you worshipped our feet.\"<br>\r\n\"mmmmmm,\" Zack remembered, \"I missed that while you were gone.\"<br>\r\n\"you want me to do it now?\" max asked them hopefully.<br>\r\n\"YES!!!\" the two replied.<br>\r\n\"okay... Who to start with...\"<br>\r\n</span></div></div>",
            "created":1272862800,
            "id":877916,
            "title":"Max, Zack, and Cody "
        },
        "1122":{
            "author_id":"jdawg16",
            "author_name":"Recess Gang",
            "choices":[
                "Ripped off his shorts",
                "Continued worshipping his feet"
            ],
            "content":"<div class=\"\"><div> <span>Max and Zack quickly got to work, ripping off Cody's shoes and socks. Max began licking each toe, getting in between them, urging Zack to do the same on the other foot. Zack followed, and he noticed a slight lump in Cody's shorts. Zack and Max then...</span></div></div>",
            "created":1282695000,
            "id":943273,
            "title":"Cody"
        },
        "11221":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Max and Zack pleasure Cody's body causing him to erupt again",
                "Max returns the favor on Zack's bare feet and toes",
                "Zack and Max take a shower and pleasure each other"
            ],
            "content":"<div class=\"\"><div> <span>leaving Cody completely naked. He has quite a erect member that shocks even his brother Zack. Max is surprised he's that big and goes down on Cody before Zack can react. Zack nibbles on his brother's toes as Max satisfies Cody. Zack feels Cody close to exploding as he splays his toes and erupts into Max's mouth causing him to gag. <br>\r\nCody goes into a relax, bliss state as Zack looks over at Max and then at Max's shoed feet. Max lays down next to Cody on the bed as Zack unties Max's shoes and pulls them off. He rubs his socked feet for a bit before taking the socks off with his teeth. Max's bare feet are stout, yet very tan and slender with pedicured toes. <br>\r\nZack asks \"Max, your bare feet are exquisite! Can I suck on your toes?\" Max replies \"By all means, just don't tickle them too much. I love being barefoot, but I have to wear shoes to make my mom happy. The only time I can be barefoot is when I'm in the shower or on set.\" Max splays his toes as Zack engulfs his two big toes into his mouth and sucks on them.</span></div></div>",
            "created":1516075380,
            "id":2441416,
            "title":"Ripped off his shorts"
        },
        "112213":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Cody sucks on Max's toes",
                "Max sucks on each brother's big toe at the same time",
                "Zack and Cody pleasure Max's bare feet at the same time"
            ],
            "content":"<div class=\"\"><div> <span>Max enjoys his toes being sucked on, but wants to return the favor on Zack. Instead, Zack releases Max's toes from his mouth and begins to undress himself and then strips off Max's clothes. The naked boys walk to the bathroom and take a shower together washing each other all over. <br>\r\nCody wakes up a moment later and joins them in the shower. Max and Zack lather up Cody all over and wash him from head to his cute toes.</span></div></div>",
            "created":1516117140,
            "id":2441576,
            "title":"Zack and Max take a shower and pleasure each other"
        },
        "1122132":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "content":"<div class=\"\"><div> <span>After rinsing and drying off each other, Max has Zack and Cody lie down on the king size bed and begins by inserting one big toe of each boy into his mouth and sucks on it. Zack and Cody go wild and their penises become erect. After exploding on their own chests, they switch places with Max and tantalize his bare toes and whole body making him excited as a result.</span></div></div>",
            "created":1516286580,
            "id":2442391,
            "title":"Max sucks on each brother's big toe at the ..."
        },
        "113":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Justin came and helped",
                "Max came and helped",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Jerry walked to their room with the security man serving as their concierge while the other was visiting family.  Kirby opened the door and said,<br>\r\n\"ooh I gotta lay down after walked down 'dem' small hallways!\" he collapsed on the bed and breathed very heavily.<br>\r\n\"your feet must hurt hah?\" Jerry asked.<br>\r\n\"oooooh yes they do.\" kirby replied with some pain.<br>\r\n\"I'll massage them for you...if you want, that is\" Jerry told.<br>\r\n\"ooooh would 'ya' ?\" Kirby asked thankfully.<br>\r\nWithout reply Jerry kneeled down and took kirbys shoes off of his feet and quietly smelled the shoes.  He then took off the socks from his feet.  After massaging the feet thoroughly he started to suck on the toes and licking the soles.  Kirby asked, \" whatch' y'all doin' down their to my piggies?\"<br>\r\n\"worshipping them.\" Jerry replied.<br>\r\n\"oh cool.\" Kirby replied happily. \"don't forget the other one...\"<br>\r\n\"okay.\" he said.<br>\r\nSuddenly... </span></div></div>",
            "created":1272949200,
            "id":877923,
            "title":"Jerry"
        },
        "1132":{
            "choices":[
                "A barefoot justin enters",
                "Mr Moseby calls kirby"
            ],
            "content":"<div class=\"\"><div> <span>\"wow dad, are you licking his feet?\" said max with a smile.<br>\r\n\"yeah, do you wanna join me son, ive always had a thing for your feet\"<br>\r\n\"id love to join dad, but first you gotta take your socks off, i wanna play with your feet\" Max couldn't believe it, all his life he had wanted to lick his dads feet, and now was his chance. Max leant down behind jerry, and slowly peeled his dads socks off, almost teasing him as he did it. Once his dads feet were bare, he lunged in a sucked his big toe, while jerry was sucking kirbys feet so passionately. Just then...</span></div></div>",
            "created":1280725200,
            "id":928947,
            "title":"Max came and helped"
        },
        "11321":{
            "choices":[
                "zack + cody walk in",
                "Zack + cody call justin"
            ],
            "content":"<div class=\"\"><div> <span>Justin and Moseby finished their meeting, and Justin put all his clothes back on, apart from his shoes and socks. After this, he walked back across the ship, so he could go and relax in his room. When Justin got back to his room, he heard faint moans coming from inside, and he curiously pushed the door open. He was shocked, yet amazed at what he saw, his brother sucking his fathers toes, while he was worshipping the feet of the concierge. \"oh, dont invite me!\" he shouted loudly, and the others all turned around. He then explained to them that he also loves feet, and had just finished playing with mr moseby. Without asking, justin quickly bent down behind his brother, and immediately slipped of his sweaty flip-flops, and started hungrily eating his ticklish toes. Then, almost simeltaneously, justin and max got up, and pulled jerry's pants and underwear off. </span></div></div>",
            "created":1280898000,
            "id":929783,
            "title":"A barefoot justin enters"
        },
        "12":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Let me try",
                "Get your brother",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Zack woke up remembering that it was the guys only cruise. He then looked across from him and saw Marcus ' bare feet peeking from underneath the covers. Zack then tip toed over to Marcus feet and kneeled down and sucked on Marcus big toe. He then licked his soles and as he did so he looked up, savoring the taste. But he looked up to seearcus staring at him. <br>\r\n\"I've wondered why my feet are wet every morning.\" Marcus stated.<br>\r\n\"are you...angry...furious... Maybe happy?\" Zack asked.<br>\r\n\"I'd say interested. It feels kinda good to have people at my feet again.\" Marcus replied.<br>\r\n\"cool, anything oud like me to do to them?\" Zack questioned.<br>\r\nMarcus answered...<br>\r\n</span></div></div>",
            "created":1272776400,
            "id":877313,
            "title":"Suitlife"
        },
        "121":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Mr moseby",
                "Cody",
                "Woody"
            ],
            "content":"<div class=\"\"><div> <span>Marcus answered, \" let me try!\"<br>\r\n\"um...okay how about we do it together?\" Zack asked.<br>\r\n\"great!\" Marcus exclaimed, \" the layer together with marcus' feet in sacks face and zacks feet in Marcus face. Zack felt Marcus' mouth around zacks first three toes and Zack gnawed lightly on Marcus' heels.<br>\r\nTheir moans were heard apparently because about fifteen minutes later there was a knock on the door.  By this time Zack and Marcus were completly naked. Zack peered out the door to see who it was, hiding the fact that he was naked. Who He saw outside the door was...</span></div></div>",
            "created":1272776400,
            "id":877316,
            "title":"Let me try"
        },
        "1211":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Zack",
                "Marcus"
            ],
            "content":"<div class=\"\"><div> <span>Mr. Moseby looked at Zack and said, \"What were you doing in here to cause such a roucus!?\"<br>\r\nwell we were... Who asked?\" Zack prodded skipping away from the mAin subject.<br>\r\nYour next door neighbors for the cruise. The russos.  Ahhh that amazing justins feet!\" it was too late. Zack heard the feet part and brought mosbey in the room.  <br>\r\nZack! Marcus! Your both naked!\" he exclaimed, \" ya we got a little crazy after he found out about the foot fetish thing of mine.\" Zack told him.<br>\r\n\"oh so maybe you two would...let me... Worship your feet... But once we aren't doing it we act as we normally do. Angry.\" mosbey said.<br>\r\nThey all agreed and he started with...  </span></div></div>",
            "created":1272862800,
            "id":877361,
            "title":"Mr moseby"
        },
        "1213":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "marcus\\woody worship zack",
                "marcus\\zack worship woody",
                "woody\\zack worship marcus "
            ],
            "content":"<div class=\"\"><div> <span>woody stood at the door excited;<br>\r\n\"what are you guys eatin' in here?<br>\r\n\"each others feet!\" marcus exclaimed blissfuly.<br>\r\n\"ooh! can i try? cody has deprived me since bailey dumped him.\"<br>\r\nZack opened the door revealing his lack of clothes. woody licked his lips staring at Zack.</span></div></div>",
            "created":1286591340,
            "id":971381,
            "title":"Woody"
        },
        "122":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Lick my feet",
                "Get woody ",
                "Play with eachothers equipment"
            ],
            "content":"<div class=\"\"><div> <span>GET YOUR BROTHER TO HELP<br>\r\n\"get your brother in here to worship my feet too.\" Marcus said.<br>\r\n\"sure, just help me drag him in.\" <br>\r\nThey went across the hall in robes with rope,  a long bamboo pole, and a sock/ gag then walked to codys room.  They walked in and gagged Cody then tied him hand to hand and foot to foot. He woke up as they put him on the pole. Woody woke up and looked at them.<br>\r\n\"you guys gonna eat Cody?!\" he seemed excited.<br>\r\n\"nmmmf wmmfy hmmmmf!\" Cody tryed to yell but was muffled by the sock.  Woody grabbed a fork and knife from under his pillow as well as an apple.  <br>\r\n\"here's an apple, he'd cook better on the rotisserie with an apple than a sock.\" he told them.  <br>\r\n\"umm woody we aren't gonna eat Cody unless we get stuck with no food...\" Marcus told him. <br>\r\nThey left a mildly depressed woody as they entered Zack and Marcus's room.<br>\r\nMarcus and Zack put the hanging Cody across the beds so he was hanging between them. Marcus took the sock out of  cody's mouth and said,<br>\r\n\"you are gonna worship my right foot while Zack does the left.\"  <br>\r\n\"really?! Finally! My 3month plan worked here too!\" Cody celebrated.<br>\r\nThey untied him and they got to it directly; taking cody's clothes off.  Marcus had the two of them stand across from eachother and told them to give him a foot massage first.<br>\r\n   They did and marcus' moans were very hardening. So they finished his feet and Marcus was surprised and said:<br>\r\n\"you guys are good at this. And so synchronized! How'd you get it down?\" <br>\r\nZack took this one, \" the bellhop at the tipton, Esteban, would take care of us sometimes so he told us to do this and we got it down.\"<br>\r\n\"cool, now...\"</span></div></div>",
            "created":1272776400,
            "id":877330,
            "title":"Get your brother"
        },
        "1222":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Tickle Zack",
                "Tickle Cody",
                "Tickle Both"
            ],
            "content":"<div class=\"\"><div> <span>\"Why don't you get Woody,\" Marcus suggested, grinning as he watched to two blonds lick his feet.<br>\r\n\"Hmm...\" Cody mumbled, still worshiping the boy's feet.<br>\r\n\"Alright,\" Zack agreed, standing and pulling back on his clothes, before leaving to get Woody.<br>\r\n\"Ya know Marcus...\" Cody muttered, still licking the feet in front of him. \"I love doing this and all, but I wish I could take someone doing this to me! But I know I couldn't!\"<br>\r\n\"What'd ya mean?\" Marcus asked curiously.<br>\r\n\"Well,\" The blond replied licking some more. \"Both Zack and I are INSANELY ticklish, especially on our feet.\"<br>\r\n\"Reeeally?\" Marcus said grinning.<br>\r\n\"What!? We're having ice cream in here!? Oh... no! Even better!\" The chubby boy said happily, kneeling at Marcus's feet.<br>\r\n\"Actually,\" Marcus said, pulling his feet back. \"I think it's Zack and Cody's turn!\"<br>\r\n\"What?\" Cody asked, a little shocked.<br>\r\n\"What, you don't want us to?\" Woody wondered.<br>\r\n\"N-no! It's just...\" Cody muttered, blushing.<br>\r\n\"Come on Cody! I can't wait!\" Zack exclaimed, plopping down on his bed.<br>\r\n\"Okay, Cody, you can get up here,\" Marcus said, as he went and grabbed a bunch of ropes, tying Zack down.<br>\r\n\"Alright!\" Cody agreed, laying down on the other bed as Woody tied him down.<br>\r\n\"Okay, are you ready Woody?\" Marcus asked.<br>\r\n\"Ready for what again?\" He wondered.<br>\r\n\"To tickle them!\"</span></div></div>",
            "created":1272949200,
            "id":878185,
            "title":"Get woody "
        },
        "1223":{
            "author_id":"masterpowell",
            "author_name":"bunny boy",
            "choices":[
                "Marcus carrys on and cums ",
                "The boys pounce on him"
            ],
            "content":"<div class=\"\"><div> <span>Marcus pulled his feet away and looked up at the two blonds\"If you want to carry on with my feet pull your pants down.\" Confused the brothers pulled down their pants to reveal their underwear and their quite erect rods. Marcus looked at them both and said \"Now pull your underwear down.\" Again the boys followed their orders and showed their hard sticks. Marcus was very excited at this site and a devilish idea sprang to his mind. With a grin he said \"Touch each other.\" Unsure, the boys did as they were told and rubbed each others pricks Cody moaned as Zack pulled on his package. \"Sorry.\" said Zack letting him go. \"No,don't stop,it's nice.\" Marcus, at this point, was very hard and couln't fight the urges he pulled down his pants and rubbed himself.</span></div></div>",
            "created":1276059600,
            "id":897071,
            "title":"Play with eachothers equipment"
        },
        "12232":{
            "author_id":"masterpowell",
            "author_name":"bunny boy",
            "choices":[
                "He lets them carry on and cums in their faces",
                "He warns them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The boys knock Marcus over and begin to lick his feet Marcus is very close to the end and doesn'twant the boys to stop.</span></div></span></div>",
            "created":1276059600,
            "id":897073,
            "title":"The boys pounce on him"
        },
        "122321":{
            "author_id":"jdawg16",
            "author_name":"Recess Gang",
            "choices":[
                "Suck each other",
                "Have Marcus suck them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He pulls their faces into his bulging rod, mere seconds before the cum sprays all over the twins faces. Zac and Cody lap up every drop, and they to, begin to....</span></div></span></div>",
            "created":1282626000,
            "id":943193,
            "title":"He lets them carry on and cums in their faces"
        },
        "1223211":{
            "author_id":"jdawg16",
            "author_name":"Recess Gang",
            "choices":[
                "Swap Cum",
                "Stop and watch the video"
            ],
            "content":"<div class=\"\"><div> <span>The twins lay down in bed, tickling each others feet on the way. They get into the 69 position, and they slide their lips over each others hard pricks, their rods swelling up even more. They moan in pleasure, as Marcus grabs his video camera. He takes a video of them, moaning along too. The twins cum simultaneously in each others mouths, painting each others lips white. Marcus suggests that they....</span></div></div>",
            "created":1282690320,
            "id":943197,
            "title":"Suck each other"
        },
        "12232111":{
            "author_id":"jdawg16",
            "author_name":"Recess Gang",
            "choices":[
                "Answer it right away",
                "Stop to put clothes on first"
            ],
            "content":"<div class=\"\"><div> <span>Cody begins french kissing Zack, dropping the cum in his mouth into Zack's mouth. Marcus turns the camera off and joins the fun. He pulls Zack, and they lay on the bed. Marcus opens his mouth, and Zack opens his, letting the twin's combined cum to drip into Marcus' waiting mouth. Marcus then drips cum into Cody's mouth. Cody then swallows it, savouring the taste in his mouth. He smiles gleefully after doing so. Suddenly, someone knocks on the door. They.....</span></div></div>",
            "created":1282767000,
            "id":943906,
            "title":"Swap Cum"
        },
        "122321111":{
            "author_id":"jdawg16",
            "author_name":"Recess Gang",
            "choices":[
                "Justin Bieber",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Marcus runs towards the door right away, not bothering to cover himself up. To his surprise, its his friend from thee biz...(guest appearance)</span></div></span></div>",
            "created":1282767660,
            "id":943919,
            "title":"Answer it right away"
        },
        "1223211111":{
            "choices":[
                "Took off his shoes and socks",
                "Took turns kissing"
            ],
            "content":"<div class=\"\"><div> <span>\"You probably should clean the cum from your face when your finished you know.\" Justin said as he entered the room filled with the smell of teenage sex. \"Let me get it for you.\" He said as he lent forward and licked the side of Marcus' face, savouring the taste of the juicy goodness. \"Hey Justin, do you wanna join us? I'm sure we have a lot more where that came from!\" said Zack eagerly, wanting to get Justin involved too.<br>\r\n\"Sure, I'd love to!\" exclaimed Justin. First they...</span></div></div>",
            "created":1294428120,
            "id":1030944,
            "title":"Justin Bieber"
        },
        "12232111111":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "...lick my feet?",
                "...jerk me off whe giving my feet a massage?"
            ],
            "content":"<div class=\"\"><div> <span>Zack and Cody looked at each other and looked at the sitting JB.  They synchronized as they took his shoes off and smelt the beautiful stench. They both bowed their heads and took the socks off with their teeth.  They looked at his beautiful feet and asked him what to do next.  <br>\r\n\"How about you guys...\" </span></div></div>",
            "created":1294543080,
            "id":1031765,
            "title":"Took off his shoes and socks"
        },
        "122321111111":{
            "choices":[
                "JB licks feet",
                "Other..."
            ],
            "content":"<div class=\"\"><div> <span>An excited pair of twins dived at the feet of one of the worlds most famous teenager, and started sucking his big toes at the same time, while staring straight into his eyes. Next, JB simulated sucking cock, by making a love heart shape with his hand, followed by him shoving his two fingers into his mouth, sucking them furiously.</span></div></div>",
            "created":1301152920,
            "id":1076492,
            "title":"...lick my feet?"
        },
        "1223211112":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Taylor Lautner",
                "Robert Pattison"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here are some more choices</span></div></span></div>",
            "created":1286590560,
            "id":971375,
            "title":"other"
        },
        "122321112":{
            "choices":[
                "Mr Moseby forces cody to rim Zack",
                "Mr Moseby forces Marcus to suck his toes"
            ],
            "content":"<div class=\"\"><div> <span>Cody stands up, quickly slipping on a pair of boxers while zack and marcus make out on the bed. He opens the door to find mr moseby standing there in just a tight pair of boxers. \"i heard you were having some fun, so i thought i'd come and join you\" he said just before he dived at codys face and licked the remaining cum off his cheeks. </span></div></div>",
            "created":1286096940,
            "id":967684,
            "title":"Stop to put clothes on first"
        }
    },
    "info":{
        "author_id":"xaviergrey",
        "author_name":"Xavier grey",
        "brief_description":"Where te wizards guys and suitelife guys are practiced and practice in or feet fetish",
        "created":1272841080,
        "description":"<td align=\"left\" class=\"norm\">Just male characters from wizards and suitelife <br>\r\nplot:<br>\r\nit's a men only cruise on the as tipton and the male Russos are vacationing.  Suitleife are having moseby pretend to be their adopted father and Marcus his nephew with woody pretending to be their cousin</td>",
        "id":1669511,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1516286580,
        "modified":1516286580,
        "pretty_title":"Wizards and suitelife male foot fetish"
    }
}