{
    "chapters":{
        "1":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "choices":[
                "Try to help people out on the streets.",
                "Try to escape.",
                "Stay put."
            ],
            "content":"<div class=\"\"><div> <span>You are awoken by the sound of the alarm on your phone going off. You turn it off and get out of bed, ready to start your morning routine. Just when you are about to head to the bathroom to take a shower, you hear screams come from outside. You glance out the window and see the strangest thing you've ever seen: Monsters are eating people. You see multiple monsters swallowing people whole, and some are just tearing into their victims. You freak out and try to think of something to do. You could go out and try to help someone or try to escape this madness, or you could stay in the safety of your home, and wait it out. the police should fix this, right? The fact that a monster just burped up a police officer's hat makes you worried. you have to decided what to do.</span></div></div>",
            "created":1502001180,
            "id":2365560,
            "title":"Rude Awakening"
        },
        "12":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "choices":[
                "Tuck and Roll",
                "Attempt to brake."
            ],
            "content":"<div class=\"\"><div> <span>You decide that it would be best if you just got out of here, and so you head out to your car. You get in and start it up. Luckily, it still works and no monsters or anything has touched it, so that's good. You shift out of first gear and drive off. For a little while you have to drive slowly, as there is people everywhere in the streets, trying to avoid getting eaten alive, but after that, you manage to be able to pick up speed, and you start to think you're home-free. Just drive to the nearest town or maybe even another state. No problem. Well, it WOULD be \"no problem\", if it weren't for the fact that a frog creature maybe 10 foot tall is sitting in the road, mouth agape. If you keep driving, you're going drive right down it's throat, and unwilling serve yourself and your car up for digestion. You could always try and brake. Of course, your brakes never really worked. You bought this car at a used car place that went under for legal reasons. You could also sacrifice the car and jump out and run. Who knows how that could work out, though? You could easily break some bones or even break your neck down that. You're not a stunt man. You have to decide fast, cause in a couple minutes, you and your car are gonna be sitting in the gut of a 10 foot tall frog creature.<br>\r\nWhat do you do?</span></div></div>",
            "created":1502029740,
            "id":2365670,
            "title":"Try to escape."
        },
        "121":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "choices":[
                "...Run into an alley.",
                "...Run back home.",
                "...Go into a nearby warehouse."
            ],
            "content":"<div class=\"\"><div> <span>You make the decision to abandon the car and jump out. You try to tuck and roll as you hit the pavement, and you recover in time to see your car go driving off into the frog's mouth, where it crushes it with it's jaws, and sends it sliding down to it's steamy gut. You get up and...</span></div></div>",
            "created":1502036640,
            "id":2365712,
            "title":"Tuck and Roll"
        },
        "1211":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "choices":[
                "...Prick your finger with the switchblade.",
                "...Refuse to cut yourself with the knife."
            ],
            "content":"<div class=\"\"><div> <span>You run down an alley, attempting to escape whatever is happening to the town, and maybe even the entire world. You turn a corner and are met with a guy armed with a gun. He looks to be in his mid-30s and has what you would describe as a \"Burt Reynolds\" mustache. \"Stay back! How can I know you're human?\" He asks, while holding you at gunpoint. You assure him that you are in fact human, and he asks for proof. You ask him what proof he needs, and he specifies that the monsters bleed a sort of bluish-yellow, so he tosses you a switchblade, and tells you to cut yourself, and show the blood. You refuse at first, but the man says that if you don't give him proof that you're human, then he'll shoot you. So you...</span></div></div>",
            "created":1502037240,
            "id":2365720,
            "title":"...Run into an alley."
        },
        "12111":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "choices":[
                "Attempt to save the man.",
                "Run away."
            ],
            "content":"<div class=\"\"><div> <span>You take the blade, and stick the index finger on your right hand with it. You then knead the finger until a little red gem of blood appears, and you show the man that you are, in fact, a normal human. He lowers his gun and apologizes for almost shooting you. He explains that he is attempting to make his way to the police station, and that since the roads were mostly unsafe, he was going to cut through a nearby warehouse, and go down into the sewers, and get to the station that way. You ask him if you can come with him, as you don't want to be alone when there's monsters swallowing everyone in town. Plus, he has a gun. He agrees to let you come with him, and tells you to keep the switchblade for protection. You two proceed to head to the warehouse, and find that the main doors are actually unlocked, so you head inside the relative safety of the warehouse. The entire place is lit by beams of sunlight shining through windows on the roof. The lights are off. You two proceed forward, with the guy going first and you lagging behind. He puts his arm out and tells you to stop, saying that he just heard something. he readies his gun and looks around the place, and doesn't see anything, so he tells you to continue cautiously. A few minutes into walking, you two stop again, as what appears to be a naga of some sort comes slithering into view. The man draws his weapon and takes aim, ready to shoot. You grip the switchblade tighter, not knowing if it would even be effective in the situation.<br>\r\n<br>\r\nBefore the man can pull the trigger, the naga speaks up. \"Wait! I'm not dangerous,\" she says, holding her hands in the air. The guy tells her that he doesn't believe her, and that she's probably just like the other monsters running amok outside. She assures him that she isn't a threat, and actually wants to help survivors. The man slowly lowers his gun, and begins to creep over to the naga, slightly believing her. If she was gonna eat him, she'd have done it without revealing herself like that, right?<br>\r\n<br>\r\nJust when he gets over to her, she grins a huge, fanged grin, and proceeds to unhinge her jaw. The guy raises his gun, but it is smacked from his hand by the naga. She grabs him and shoves him in her mouth, and begins to swallow, while you watch on in horror. You could try and save the guy. After all, he's your best hope for survival. But, you could also make a run for it and try to get to the station yourself. the guy could be a distraction so you don't get eaten.</span></div></div>",
            "created":1502042100,
            "id":2365753,
            "title":"...Prick your finger with the switchblade."
        },
        "121111":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "choices":[
                "...Get caught by the tongue.",
                "...Make it to the surface."
            ],
            "content":"<div class=\"\"><div> <span>You grip the switchblade tighter, take a deep breath, and run towards the naga, with the intention of stabbing her and saving the guy from getting fully swallowed. You swing the knife at her, and manage to slash her across the midsection, causing blue-yellow blood to leech out. She reacts in pain, and involuntarily coughs the guy up, and after tending to her wound, she grabs you by the arms and hoists you up, ready to gulp you down instead. You try to cut her again with the switchblade, but she's holding your arms too tight. You can't move them. She starts slowly sliding your head into her mouth, and is about to start swallowing when the guy grabs her attention. \"Hey snake!\" He yells. The naga turns to face him, with your head and shoulders in her mouth and throat. He's aiming his gun at her, and before she can react, he fires, and kills her. She collapses on the ground, with you still in her mouth. the guy runs over and pulls you out. \"Thanks.\" You say, catching your breath. \"Don't mention it. Now, let's get to the police station,\" He responds. He helps you to your feet and the two of you run away from the dead naga corpse, and out of the warehouse. He lifts a manhole cover and you two proceed down. The smell is unbearable, but you figure that you can stand the smell of sewage more than the smell of a stomach. After a couple of hours of walking, you two come across a ladder leading to the surface. The guy tells you to wait while he goes and checks it out, and soon you're down in the sewers by yourself. You start hearing wet footsteps in the distance, and ask if it's safe. He says that it seems safe, and tells you to come on up. The footsteps are getting louder and louder. As you start climbing, you glance over to see a long-necked humanoid lizard creature turning the corner. You start trying to climb as fast as you can. The creature spots you, and launches a long, sticky tongue at you. Your heart is racing as you climb up the ladder, and you...</span></div></div>",
            "created":1502056140,
            "id":2365859,
            "title":"Attempt to save the man."
        },
        "1211111":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "content":"<div class=\"\"><div> <span>Despite your best efforts, you're not able to climb the ladder fast enough, as the tongue wraps around your torso and pulls you towards the lizard creature's waiting maw. You try to yell for the guy's help, but the tongue is so tight that you can barely yell or scream as you get pulled toward your slimy demise. Once you get to the creature's mouth, it clamps it's jaws around you, breaking your back in the process. You're still barely conscious, and can barely feel getting swallowed. After you get deposited into the thing's stomach, you pass out from the pain of your back being broken, and while you're asleep, the lizard creature begins digesting you. You never awaken.<br>\r\n<br>\r\nYou're <span class=\"clred\"><b>MONSTER FOOD</b></span>.</span></div></div>",
            "created":1502122260,
            "id":2366184,
            "title":"...Get caught by the tongue."
        },
        "1211112":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "choices":[
                "Candace (Female)",
                "Shaun (Male)"
            ],
            "content":"<div class=\"\"><div> <span>You clamber up the ladder as fast as you can and manage to dodge the sticky tongue by mere seconds, and you get to the surface and reunite with the guy. He tells you that the police station should be north of where you guys are now, and you two start walking when you notice something at the end of the alley you emerged into: A werewolf. About 9-10 foot tall. You alert the guy of the creature's presence, and after his heart clearly drops, he tells you to follow him, and you both start running in the general direction of the police station, all the while, being chased by a werewolf looking to grab two human snacks. You two manage to get to the station, but the front gate is closed and locked. The guy starts pounding on it and yelling for someone to come and open the gate. Two police officers come running out, and upon seeing you and the guy, they open the gate. \"Inside, now!\" one of them yells at you two, as he and the other officer begin to open fire on the werewolf. The two officers realize that the bullets aren't working, and decide to close the gate back and run back inside. They manage to get it closed and locked back, and the werewolf stops and runs off after a few seconds. Just when the officers think they're in the clear, the werewolf lands in front of them and, before they can react, it grabs the both of them, and swallows them one by one. It then jumps over the front gate and dashes off, in order to find somewhere to digest the two humans in it's gut. Meanwhile, you and the guy are in the station, talking to Lt. Victor Harrison, who is the \"head\" of the shelter that the station has been turned into. He asks what your names are. \"I'm Joseph, and this is...um...um...\" The gun guy responds, being obviously clueless as to what your name is.<br>\r\nYou respond with \"My name is...\"</span></div></div>",
            "created":1502123160,
            "id":2366189,
            "title":"...Make it to the surface."
        },
        "121112":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "choices":[
                "Candace (Female)",
                "Shaun (Male)"
            ],
            "content":"<div class=\"\"><div> <span>You tense up, and decide to just run away and let the guy get swallowed whole. You run out of the warehouse and into an alleyway. You quickly notice about 4 monsters at the dead end of the alley, all but one having squirming bellies. The one without a victim runs toward you, mouth agape. You take off running toward the street and exit the alley. Once you get out, you see a few more monsters, all looking more than happy to stuff you down their hungry gullets. They start running towards you. Realizing that it may be no use to run from them, you hunker down and wait for one of them to eventually gulp you down. Before any of them can grab you, however, they're all gunned down. You look up, and see three police officers. \"Are you alright?\" one of them asks as he runs over to you. You respond that you're just a bit shaken up and that otherwise, you're fine. He explains that a good bit of police officers were still alive at the police station, and they had turned the place into a makeshift shelter for survivors. He asks you if you want to come with him and the other two officers, and you say yes. Anywhere has to be better than the voracious streets, right? During the drive back to the station, the officer attempts to make conversation while driving, \"So, you got a name?\" You respond with 'My name's...\"</span></div></div>",
            "created":1502139180,
            "id":2366279,
            "title":"Run away."
        },
        "12112":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "content":"<div class=\"\"><div> <span>\"No fucking way,\" You yell, throwing the switchblade to the ground. You tell him that you don't have to prove that you're human because All the monsters don't look human, so it would make no sense that you were a monster. Before you can finish what you're saying, the man fires, and sends a bullet flying straight through your brain. You fall to the ground, lifeless. The man picks up the switchblade and runs off, and your body is soon discovered by one of the monsters, which ends up gulping it down and running off to eat more people.<br>\r\n<br>\r\nYou are <span class=\"clred\"><b>DEAD</b></span>.</span></div></div>",
            "created":1502037480,
            "id":2365722,
            "title":"...Refuse to cut yourself with the knife."
        },
        "1212":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "content":"<div class=\"\"><div> <span>You get up and take off running back to your house. Maybe it would've been a better idea to stay there. Your car probably would be digesting in the belly of some frog monster. You pass multiple people getting eaten, and even manage to avoid getting eaten yourself a few times, and make it home in one piece. You take a short breath, and then open the door. Before you stands an 8 foot tall werewolf with black fur. You start to run away, but just as you turn, the werewolf grabs you with both paws, and proceeds to stuff you into it's mouth and starts to swallow. That doesn't seem to be fast enough, as it begins to shove you deeper into it's throat, thus speeding up the whole swallowing process. Within a minute or two, it manages to shove you all the way down it's throat, and into it's stomach. It's tight, but not uncomfortable. You can stretch your legs slightly. The werewolf lets out a guttural <span class=\"cbgreen\"><b>BEEEEEEEEEEEEEEEEEEEEEEEEEELCH!</b></span> and pats it's now distended belly. You start yelling for the werewolf to let you out, but it ignores your cries for freedom, and dashes off to find a place to safely digest it's little snack. After a couple of weeks, you're fully digested, and absorbed into the werewolf's body. Atleast you would experience the fall of humanity...<br>\r\n<br>\r\nYou're <span class=\"clred\"><b>MONSTER FOOD</b></span>.</span></div></div>",
            "created":1502051160,
            "id":2365834,
            "title":"Woof Woof?"
        },
        "1213":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "content":"<div class=\"\"><div> <span>You decide to run to a nearby warehouse, and are surprised to find that the doors are unlocked. You run inside. The place is only lit by sunlight, since the lights are off. You hear the sounds of screams, gulps, and burps from outside, and run to hide behind some boxes, incase one of those things comes in. You sit there for a good 15 minutes, until you feel something brush up against your leg. You instantly jump back, not sure whether it was a rat or a monster. You turn to see a female naga standing about a foot behind you. Before you can get up and run, her tail wraps around you, and you're pulled very close to her. You attempt to break free from the coils, but they're too strong. You're trapped. You beg her not to eat you, and to just let you go. She chuckles, and proceeds to unhinge her jaw, and push you into her mouth with her tail, all the while, you're struggling as hard as the coils allow you to, but it's all in vain. She get you halfway into her mouth, and begins to start swallowing. After a few minutes, your legs are all that's sticking out. She pushes them into her mouth with her hand, and takes one final gulp, sending you down into her steamy gut. You curl into a ball, as there's not much room to move. You try to struggle to get free, but you can't even move your arms enough to do so. The naga lets out a small burp, followed by an \"excuse me.\" She then slithers off, in order to find a place to digest her human meal. For you, the horror of monsters eating people is over. You'll be digested by one of these creatures, but for the rest of humanity, it may just get a whole lot worse.<br>\r\nFarwell...<br>\r\n<br>\r\nYou're <span class=\"clred\"><b>MONSTER FOOD</b></span>.</span></div></div>",
            "created":1502050440,
            "id":2365824,
            "title":"Got a fear of snakes?"
        },
        "122":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "content":"<div class=\"\"><div> <span>You slam on the brakes, and they actually start to slow your car down. You start to feel relieved when they work, but the relief soon flees your body as you notice that you're so close to the creature that you won't be able to come to a complete stop, and that you're going to go driving right down the thing's gullet. You can't jump out at this point, cause you'd most likely get eaten by it anyway. Your first instinct is to brace your face with your arms as your car continues to slow down, and it manages to slow to a stop by the time it's in the creature's mouth. You feel slightly happy that it stopped when it did, but then, your world shakes around you as the frog creature stands up and takes a huge gulp, sending you and your car plummeting into it's dark stomach. You turn on the headlights in order to light the place up, and try to figure out a way to escape this situation. Before you can come up with any good ideas, the stomach begins to fill with gastric acid, and it quickly starts to eat away at your car, causing it to melt away and lower into the pool of caustic liquid. You climb out on the roof, and start looking around for some way to escape this digestive fate. Just when you see a possible way out, the headlights go out, due to the circuitry for them being digested. You're plunged into darkness, and pull out your phone, in order to have some light. You pull it out and use the screen light as a torch. You notice that only the very top of your car is still above the acid, and it is quickly getting higher, until it finally begins to creep onto the roof. You look down in horror as the roof begins to give way to the caustic substance, and holes start to form. It doesn't take long for the part of the roof you're standing on to give way, sending you falling into a pool of digestive liquid below.<br>\r\n<br>\r\nYou're <span class=\"clred\"><b>MONSTER FOOD</b></span>.</span></div></div>",
            "created":1502036160,
            "id":2365707,
            "title":"Need some iron in the diet."
        },
        "13":{
            "author_id":"tsarbacon",
            "author_name":"Dank Memes",
            "content":"<div class=\"\"><div> <span>You decide not to risk going outside and getting eaten, and you proceed to barricade all exits, in order to prevent any of those things busting in and gulping you down.Afterwards, you sit down and turn on the TV, hoping that there's something about this on the news. maybe advisories are in effect for citizens. Who knows. You flip the TV on and turn it to the local news channel. They're in the process of talking about the situation and telling citizens what to do. They say that it is best to stay in your home, as the creatures are all very dangerous, being able to swallow a fully grown human whole. The anchors are interrupted by a monster that looks somewhat like an anthropomorphic hippo. It comes in and, within seconds, manages to send both of them into it's gut, which is now bulged out pretty far, as it has two human beings in it. It then lets out a very loud <span class=\"cbgreen\"><b>BRAAAAP!</b></span><br>\r\nand then proceeds to waddle off. Before the channel goes off the air, you can hear people behind the camera getting eaten as well. Then it cuts off abruptly.<br>\r\n<br>\r\nYou are left stunned by what you just saw, and fear that this may not be getting better soon. You suddenly hear a loud crash come from upstairs. It startles you quite a bit, and you soon decide to investigate the noise, so you grab a baseball bat and head upstairs to see just where that sound came from. There's only two places that the sound could've come from: Your bedroom and the bathroom. You open the bathroom door, and see nothing. No broken mirror or anything. So you move on to the bedroom door and open it, gripping the bat tighter with each inch the door opens. You see that there's nothing in your bedroom, but your closet door is slightly ajar, and your window is open, so you conclude that either another person is in your closet, or one of those monsters is in there. You hope that it's another person, and you slowly creep over to the closet and begin opening it. Before you can ever get it fully open, a fuzzy arm comes out of the closet, and grabs you. You're pulled into the closet and quickly eaten by some monstrosity. It is followed by a guttural <span class=\"cbgreen\"><b>BELCH!</b></span>.<br>\r\n<br>\r\n<br>\r\nYou're <span class=\"clred\"><b>MONSTER FOOD</b></span>.</span></div></div>",
            "created":1502028840,
            "id":2365667,
            "title":"Just another victim..."
        }
    },
    "info":{
        "author_id":"tsarbacon",
        "author_name":"Dank Memes",
        "brief_description":"Monsters are devouring people!",
        "created":1502000820,
        "description":"<td align=\"left\" class=\"norm\">Waking up in the morning is pretty great. If you're a morning person, that is. But not even morning people would be able to handle the vorish insanity that has taken hold of the world and all of Humanity. Will you manage to survive all the voracious monsters that are eating people? Or will you just become yet another victim of these mysterious creatures? That's for you to decide.</td>",
        "id":2130312,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1502139180,
        "modified":1502139180,
        "pretty_title":"The Day Humanity Got Ate"
    }
}