{
    "chapters":{
        "0":{
            "author_id":"dage",
            "author_name":"Dage",
            "choices":[
                "Emma Watson",
                "Hayden Panettiere",
                "Lucy Liu",
                "Megan Fox",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Your father and I will be out of the house tonight,\" your mother explains, as she distracts herself with her phone, \"so we hired a celebrity babysitter.\"<br>\r\n<br>\r\n\"Ooh, who is it?\" you ask excitedly. <br>\r\n<br>\r\n\"It's...</span></div></div>",
            "created":1388289060,
            "id":1716385,
            "title":"Some Alternative Choices"
        },
        "05":{
            "author_id":"dage",
            "author_name":"Dage",
            "choices":[
                "Emma Stone",
                "Lindsay Lohan",
                "Jennifer Lawrence",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some other sitters include...</span></div></span></div>",
            "created":1388289720,
            "id":1716390,
            "title":"Other Choices"
        },
        "054":{
            "choices":[
                "Mila Kunis",
                "Margot Robbie",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1445199180,
            "id":2048974,
            "title":"Other"
        },
        "1":{
            "author_id":"hannah94",
            "author_name":"Hannahbell",
            "choices":[
                "Allison Mack",
                "Ariana Richards",
                "Jessica Fox",
                "Kirsten Dunst",
                "Olivia Hallinan"
            ],
            "content":"<div class=\"\"><div> <span>“Why can’t we go with you mummy?” Sarah asked<br>\r\n<br>\r\n“We want a weekend away and we have been invited to a party at one of our old school friends whose birthday is this weekend.” Rachael said “Don’t worry we will be back on Sunday night, we’ll only be away for two nights. You’ll be fine. We’ve arranged for a babysitter to look after you for the weekend and I think you will be surprised when you meet her.” <br>\r\n<br>\r\n“Why who is she?” Steven asked curiously<br>\r\n<br>\r\n“You’ll have to wait and see, if I tell you who she is then it will spoil the surprise.” Nigel said <br>\r\n<br>\r\n\"Oh please tell us Dad, we want to know!\" you ask <br>\r\n<br>\r\n\"No you'll have to wait kids.\" he replied<br>\r\n<br>\r\nAfter having your tea later that evening, your mother asks you, your brother, and younger sister to get into your pyjamas. As you are doing that there is a knock at the door.<br>\r\nYour father opens the door and invites the girl standing on the doorstep inside.<br>\r\n<br>\r\n“Kids your babysitter is here, can you come down and meet her?” Nigel calls upstairs.<br>\r\n<br>\r\nYou, your brother and sister race along the landing and down the stairs, as you reach the bottom of the stairs, you see standing in the hallway, none other than the stunning young actress:<br>\r\n<br>\r\n</span></div></div>",
            "created":1167800400,
            "id":370592,
            "title":"Meeting your babysitter"
        },
        "11":{
            "author_id":"hannah94",
            "author_name":"Hannahbell",
            "choices":[
                "Sarah wants to show Allison round the house",
                "Your elder sister Gemma comes downstairs"
            ],
            "content":"<div class=\"\"><div> <span>As you, Sarh &amp; Steven race downstairs you see standing in the hallway Allison Mack.<br>\r\n<br>\r\n\"Wow, our babysitter is Allison Mack aka Chloe Sullivan, great I love Smallville, it's one of my favourite shows.\" Sarah said happily.<br>\r\n<br>\r\n\"Well thank you little girl.\" Allison said.<br>\r\n<br>\r\n\"This is Sarah, my youngest daughter.\" Nigel said \"And these are my other two children, Steven and Dominic.<br>\r\n<br>\r\n\"I'm very glad to meet you all, you seem lovely children and I am looking forward to looking after you for the weekend.\" Allison replied smiling down at the three children.<br>\r\n<br>\r\n\"Well we are ready to go. Do you want us to show you round Allison, so you know where everything is?\"<br>\r\n<br>\r\n\"It's alright Mum, we'll take care of that.\" Steven replied<br>\r\n<br>\r\n\"OK then kids, see you Sunday. Thanks Allison.\" your father said as he and your mother went out of the house closing the door behind him.<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\n</span></div></div>",
            "created":1167800400,
            "id":370640,
            "title":"Sarah's happy to see Allison Mack"
        },
        "111":{
            "author_id":"rebel13",
            "author_name":"golda",
            "choices":[
                "Allsion shrinks you guys",
                "You guys shrink mysteriously and Allison sees you",
                "You guys shrink mysteriously and Allison does not see you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you and the other children show Allison around the house</span></div></span></div>",
            "created":1193029200,
            "id":455637,
            "title":"Sarah wants to show Allison round the house"
        },
        "1111":{
            "author_id":"bobbyman910",
            "author_name":"irishman",
            "choices":[
                "Strip down and have sex with you",
                "Put you all in her breasts",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, she pulls out a gun and shoots all of you.  You all shrink down to 2 inches tall.  Then she picks you up and walks into the room you gave her.  She lays on her bed and picks up Steven and drops him down her panties.  She then picks up Sarah and puts you in her sock.  Then she picks you up and puts you in her bra.  Then she walks out of her room and goes to the kitchen.  She called one of your sisters friends and asks if she could go to their house for the weekend.  They say yes and your sister goes over their.  Then Allison locks all the doors and starts to play with you guys.  What does she do?</span></div></div>",
            "created":1266296400,
            "id":837368,
            "title":"Allsion shrinks you guys"
        },
        "11111":{
            "choices":[
                "Lunch",
                "Play a game"
            ],
            "content":"<div class=\"\"><div> <span>Allison takes all of the clothes off of you and your siblings. She decided to take turns with you. She got out a cage and put you and Sarah in the cage and goes up to her room, taking Steven.<br>\r\n\"I can't wait to see what she has planned next!\" You say excited.<br>\r\n\"I know right? I mean, a real famous actress as our babysitter! Almost anything can happen!\"Sarah replies. She then suddenly frowns. \"You know, if we are shrunk for Saturday and Sunday, are we going to eat while shrunk, and if so, what are we going to consume?\" You simply shrug. After s few more minutes, Allison comes back downstairs and trades Steven for Sarah. When she leaves, you notice Steven looks a little tired.<br>\r\n\"Are you okay?\" You ask.<br>\r\n\"Yeah, that was fun.\" He says.<br>\r\n\"I wonder if Sarah will have fun.\"<br>\r\n\"It was like a beautiful cave calling to me.\" Steven then sits down after saying it. You just giggle a little. After a few minutes, Allison comes back down with Sarah. Allison is just wearing a bra and panties. Sarah looks tired and a little wet. Allison puts her down and brings her smooth fingernails to pick you up. She grabs you by the feet and dangles you.<br>\r\n\"You're next.\" She says and takes you to her bedroom. When you two get up there, she tosses you on the bed. She takes her bra and panties off and climbs onto the bed with you, laying on her back and picks you up.<br>\r\n\"Don't tell the others, but I think that you're the cutest.\" She says and kisses you. She starts to have her way with you. It feels amazing. You get a little wet, but that's fine with you. When she is done, she washes you off and takes you to the others. \"So, what do you want to do now?\"</span></div></div>",
            "created":1475623080,
            "id":2219078,
            "title":"Getting personal with Allison"
        },
        "12":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "\"Will you play hide and seek with us?\" you ask",
                "\"Can I show you something Ariana?\" Steven asks"
            ],
            "content":"<div class=\"\"><div> <span>You are first to the bottom of the stairs, as you look to see who your babysitter is your eyes light up.<br>\r\n<br>\r\nStanding in the hallway is the lovely, stunning actress Ariana Richards.<br>\r\n<br>\r\n\"Miss Richards, are you our babysitter?\" you ask in amazement.<br>\r\n<br>\r\n\"Yes I am Dominic, your father has asked me to watch over his children and he thought I would be the perfect babysitter.\" Ariana replied.<br>\r\n<br>\r\nYou have a lump in your throat and don't know what to say.<br>\r\n<br>\r\nYour brother is equally stunned as he comes downstairs and sees Ariana in the hallway.<br>\r\n<br>\r\n\"Kids I just have to discuss some things with your babysitter and then we'll be away. Give us a minute.\" your mother said.<br>\r\n<br>\r\nShe and Ariana went into the kitchen.<br>\r\n<br>\r\n\"Right kids you'll be good for Ariana won't you. She doesn't normally do this, but when I said it was me who wanted a babysitter she was happy to oblige. So don't let me down!\" your father said.<br>\r\n<br>\r\n\"We won't Dad.\" you, Steven &amp; Sarah replied<br>\r\n<br>\r\nYour mother and Ariana came out of the kitchen.<br>\r\n<br>\r\n\"Right kids see you later.\" your mother said.<br>\r\n\"Ariana knows where everything is and if there is any problem she has my number. OK.\"<br>\r\n<br>\r\n\"Yes mum.\" Sarah replies. Have a good weekend.\"<br>\r\n<br>\r\nYour parents go out the door and climb into the waiting taxi.<br>\r\n<br>\r\nAriana closes the door as the taxi goes down the drive.<br>\r\n<br>\r\n\"Right what would you like to do first?\" she asks</span></div></div>",
            "created":1167800400,
            "id":370648,
            "title":"First things first"
        },
        "121":{
            "choices":[
                "It grabs Steven",
                "It grabs you",
                "It grabs you, but the hand belongs to Gemma!"
            ],
            "content":"<div class=\"\"><div> <span>\"Of course I will\" Ariana says. The three of you jump for joy. \"Let me do something first.\" She puts her hand on each of you for a second, and then you black out. When you wake up, you're in Sarah's bedroom, except everything is huge. Sitting on Sarah's bed is Ariana, she is wearing a blue mini skirt, short white socks and a white tank top. She notices you are awake. \"Well hello there Dominic, you're finally awake. As you can see, I shrunk you so we can play hide and seek.\" She says while smiling.<br>\r\n\"Where are the others?\" You ask.<br>\r\n\"I don't know, they're shrunk somewhere in this room and already went and hid, the rules are you can hide anywhere in this room as long as you stay in the room, oh and if I catch you, I will do fun something to you, if I don't find you, I will do what you want me to do.\"<br>\r\n\"Alright then.\" You say. Both of you stare at each other.<br>\r\n\"Well what are you waiting for? Go and hide, here I'll close my eyes and count to 70 seconds.\" She does as she says and you take off in the closet. You climb to the top of Sarah's dollhouse and grab onto one of her shirts. You climb up until you get to a shelf above. You rest for a few seconds, then hide behind a basket.<br>\r\n\"Hey, glad you could make it.\" You jump a little and turn to see the owner of the voice was Steven.<br>\r\n\"Hopefully she won't find us here.\" You say, then notice that both you and Steven are in your underwear. \"Is Sarah only wearing underwear also?\" You ask. Steven nods.<br>\r\n\"Underwear and a bra\" he says. You decide to move behind an old doll sitting on the shelf.<br>\r\n\"If she gets one of us, let's not say that the other one was here, ok?\" Steven nods. He looks around the basket.<br>\r\n\"She has Sarah! Ariana looks to be placing her into a bottle.\" He says. Then he quickly hide behind the basket. \"She's coming this way!\" Both of you are dead quiet, suddenly both of you see a hand between the basket and doll. Who does it grab?</span></div></div>",
            "created":1476579120,
            "id":2223780,
            "title":"Hiding in the closet"
        },
        "1213":{
            "choices":[
                "Ariana gives up",
                "Ariana finds him",
                "Ariana leaves the room"
            ],
            "content":"<div class=\"\"><div> <span>Gemma pulls you out and looks at you. Both of you are surprised.<br>\r\n\"Dominic!?\" She says with wide eyes.<br>\r\n\"Gemma!?\" You say, really confused.<br>\r\n\"Wha . . Why are you so small?\" Suddenly, Ariana puts her hand on Gemma's shoulder.<br>\r\n\"Yeah um, my fault. I wanted our game to be more interesting, if you know what I mean.\" Ariana said and winks. Gemma thought for a minute and nodded. She gave you to her.<br>\r\n\"Is anyone else shrunk?\"<br>\r\n\"Yes, Sarah.\" You point to the bottle. \"And Steven.\" Gemma nodded.<br>\r\n\"Well, as long as you three are safe. I guess it's alright.\" Gemma said, then left the room. Ariana looks at you.<br>\r\n\"Where is Steven, by the way?\" She asks. You just shrug. You puts you in the bottle and keeps looking. Finally, after about 10 minutes . . .</span></div></div>",
            "created":1482681780,
            "id":2254211,
            "title":"Wrong seeker"
        },
        "122":{
            "choices":[
                "No, she doesn't appear to know where you are",
                "Yes, she knows exactly where you are",
                "Gemma suddenly comes outside and asks what she is doing"
            ],
            "content":"<div class=\"\"><div> <span>Steven brings Ariana to his room to show his plush toys. Meanwhile, Sarah and you wait in the living room on the couch.<br>\r\n\"I wonder what kind of fun we're going to have.\" You tell Sarah.<br>\r\n\"Maybe we can play tag out in the yard.\" Sarah says.<br>\r\n\"The yard is a little small, isn't it?\" Suddenly both of you shrink.<br>\r\n\"It's not small anymore.\" You turn around to see Ariana leaning on the back of the couch.<br>\r\n\"So does that mean we can play tag?\" Sarah asks. Ariana nods.<br>\r\n\"Wait, where is Steven?\" You question.<br>\r\n\"Hold on.\" Ariana pulls Steven out of her pocket and shows them. Ariana then grabs them and brings them outside. \"I'll go easy on you, so don't worry.\" All three of you get a running start. Ariana crouches and starts to crawl towards Sarah. You're running to the Daisies and Steven is running to the fence. You watch Ariana pick up Sarah with her mouth. She sucks on her, pulls her out of her mouth and then places her in her pocket. Ariana then walks to Steven and traps him with her hand with ease. She places him in her pocket also. Does Ariana turn towards you?</span></div></div>",
            "created":1475634900,
            "id":2219138,
            "title":"Giantess tag"
        },
        "13":{
            "author_id":"hannah94",
            "author_name":"Hannahbell",
            "choices":[
                "Go and find Jessica, maybe she can help",
                "Find somewhere safe and let Jessica find you"
            ],
            "content":"<div class=\"\"><div> <span>\"My name is Jessica and I am your babysitter for the weekend.\" the girl replied. You, your sister, and younger brother stood open mouthed at Jessica standing in the hallway.<br>\r\n<br>\r\nYour father introduced Jessica to his children. \"This is Dominic, that's Sarah and Steven. Our other child Gemma whose 17 is round at a friends at the moment but she'll be back later on this evening.\" he said<br>\r\n<br>\r\n\"Dad, is this really our babysitter, Nancy from Holyoaks?\" Steven asked <br>\r\n<br>\r\n\"Yep the same one.\" Jessica replied \" How old are you cutie?\" she asked softly<br>\r\n\"Steven and I am 4 yrs old.\" your brother replied shyly<br>\r\n\"That's a nice age. I have a brother myself and he is so cute and playful that I love being around him.\" <br>\r\n<br>\r\n\"Right we'll see you kids on Sunday evening, I'm sure you'll make Jessica feel at home.\" your father said.<br>\r\n<br>\r\n\"We will Dad.\" Sarah replies as she took Jessica's hand and led her upstairs to show her around.<br>\r\n<br>\r\nSarah led Jessica up the stairs and showed her the room where she would be sleeping which was the spare room. Jessica put down her bags and lay down flat on the bed.<br>\r\n\"Oh this is very comfortable.\" she said<br>\r\nYou then showed her your room. It is alot smaller than the spare room but has plenty of space for storing things in.<br>\r\n\"This is a very nice room. Not that tidy but very nice. So what are you in to Dominic.\" Jessica asked you.<br>\r\n\"I love reading Adventure and Challenge books.\" you reply pointing out your collection of books behind your bed.<br>\r\n\"Who's your favourite author?\" Jessica asked<br>\r\n\"I haven't got a favourite author.\" you reply<br>\r\n<br>\r\nAfter Jessica has had a good look around your room she heads for the door.<br>\r\n\"I am going to get changed and then we shall play a game downstairs?\" she asks<br>\r\n\"Whatever. I don't mind what game, I'm up for anything.\" you reply<br>\r\n<br>\r\nJessica goes into the spare room and shuts the door. As you hear the door close you suddenly feel dizzy, at once you collapse to the floor and begin to shrink.<br>\r\n\"What's happening to me.\" you cry as you slowly shrink down in size.<br>\r\n<br>\r\nEventually you stop shrinking and find yourself under a bundle of clothes. You see that they were the clothes you were wearing before you shrunk.<br>\r\nThen thankfully you see that you still wearing your underpants so your not completely naked.<br>\r\nAs you walk along the landing you see that your sister Sarah and your younger brother Steven have also shrunk.<br>\r\nWhere do you go to now?</span></div></div>",
            "created":1167800400,
            "id":370600,
            "title":"3 shrunken youngsters"
        },
        "131":{
            "author_id":"hannah94",
            "author_name":"Hannahbell",
            "choices":[
                "Go in and have a look",
                "\"Its probably safer if we wait outside\""
            ],
            "content":"<div class=\"\"><div> <span>You decide to go find Jessica, after all she is your babysitter. <br>\r\n<br>\r\n\"It's probably best if we stay together now we are this size, if we split up it could be dangerous.\" you say<br>\r\n<br>\r\n\"Good idea.\" Steven replied<br>\r\n<br>\r\nYou, your sister and brother slip under the crack in the spare bedroom door. <br>\r\nThen Steven rememberd something. <br>\r\n\"Jessica said she was going to get changed, should we go in and risk seeing her naked?\" Steven asked.<br>\r\nYou think for a moment. The prospect of seeing a beautiful young actress,changing intrigues you amd your brother, but do you dare spy on her?</span></div></div>",
            "created":1167800400,
            "id":370606,
            "title":"To the room where Jessica is changing"
        },
        "1311":{
            "author_id":"kjggffds",
            "author_name":"Jifghf",
            "choices":[
                "Run away with your siblings",
                "Stay and look up the towel",
                "Hide in a pile of clothes"
            ],
            "content":"<div class=\"\"><div> <span>You and and your siblings go inside and look around. She is nowhere to be seen. Suddenly, you hear booms...presumably footsteps, you go to investigate and find a Jessica fox in a towel all wet. Phew... She wasn't naked.<br>\r\nShe starts walking towards you your siblings run...</span></div></div>",
            "created":1563668460,
            "id":2689924,
            "title":"Go in and have a look"
        },
        "1312":{
            "author_id":"hannah94",
            "author_name":"Hannahbell",
            "choices":[
                "\"Yeah OK, lets climb on\"",
                "\"No that's too dangerous\""
            ],
            "content":"<div class=\"\"><div> <span>\"Its probably safer if we wait outside\" Sarah said \"Besides I wouldn't want two boys spying on me if I were getting changed.\" she said<br>\r\n<br>\r\nWith that the door opened and Jessica's huge figure came out of the room.<br>\r\n<br>\r\n\"Kids I am going to the kitchen for some food, if you want anything come on down.\" Jessica said<br>\r\n<br>\r\nYou, Sarah and Steven cover your ears as Jessica's voice nearly bursts your eardrums.<br>\r\n<br>\r\nThere is a huge foot next to Steven, it is Jessica's, she is standing on the landing waiting for a few seconds.<br>\r\n<br>\r\n\"Should we jump on her foot and get a ride downstairs?\" Steven asked<br>\r\n<br>\r\nDo you agree?</span></div></div>",
            "created":1167800400,
            "id":370609,
            "title":"Seeing the mighty Jessica Fox"
        },
        "14":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "Will you play a game with us?",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Racing to the stairs you see that stood at the bottom is none other than Kirsten Dunst herself.<br>\r\n<br>\r\nAs fast as you can, you reach the bottom of the stairs. Kirsten is your favourite acrtress and you love her films. Both you and Steven like Small Soldiers.<br>\r\n<br>\r\nYou don't know what to say and feel very shy.<br>\r\n<br>\r\n\"Well nice to meet you three.\" Kirsten said in a soft gentle voice.<br>\r\n<br>\r\nShe was standing in the hallway wearing a black top and black jeans with a sliver belt round them.<br>\r\n<br>\r\n<br>\r\nYour parents said goodbye and went.<br>\r\n<br>\r\nKirsten led you into the living room and sat down on a chair.<br>\r\n<br>\r\n\"Well kids what would you like to do now I am here?\" Kirsten asked</span></div></div>",
            "created":1167800400,
            "id":370651,
            "title":"Meeting Kirsten"
        },
        "141":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "She shrinks you! (gentle giantess route)",
                "She shrinks you! (evil giantess route)",
                "She just plays a normal game with you... for now..."
            ],
            "content":"<div class=\"\"><div> <span>\"Will you play a game with us?\" you ask<br>\r\n<br>\r\nKirsten looks at you and smiles. <br>\r\n<br>\r\n\"Sure kid, what kind of game do you have in mind? I'm fine with anything, really...\"<br>\r\n<br>\r\nShe then winks at you, and you begin to blush. You still haven't gotten over the shock of having your favorite actress of all time as your babysitter. Nervously, you respond to her.<br>\r\n<br>\r\n\"Ummm... I didn't really have anything in mind... Is their anything that you wanted to do Miss Kirsten?\"<br>\r\n<br>\r\nKirsten starts to giggle at your nervousness, and a broad smile forms on hr face.<br>\r\n<br>\r\nJust what kind of game did she have in mind?!<br>\r\n</span></div></div>",
            "created":1301288400,
            "id":1077992,
            "title":"Letting Kirsten choose what to play..."
        },
        "1411":{
            "choices":[
                "Awesome",
                "Terrible",
                "Scary"
            ],
            "content":"<div class=\"\"><div> <span>\"Well kids, i have been working on this ray for about a month, but problem is i have no clue what it does can you help me? Kirsten asked. \"Oh sure\" You three said.<br>\r\n<br>\r\n2 minutes later<br>\r\n----------------------------<br>\r\nShe had fired the ray at them and you all had shrunk to I inch tall <br>\r\n\" I BET THE WORLD LOOKS REALLY DIFFERENT BEING 1 INCH TALL.\" Kirsten boomed. \"Could you please be a little more quiet!\" You yelled to her. \"Oh sorry.\" Kirsten said. \"Wow this is....... </span></div></div>",
            "created":1309267140,
            "id":1136301,
            "title":"Shrunken Kids"
        },
        "142":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "10 centimetres",
                "2 inches"
            ],
            "content":"<div class=\"\"><div> <span>\"I am playing on my computer at the moment. I will finish the game I am playing.\" you said <br>\r\n<br>\r\n\"What about you Sarah, and you Steven?\" Kirsten asked<br>\r\n<br>\r\n\"I'm reading a book.\" Steven replied<br>\r\n\"I'm playing with my dolls.\" Sarah said<br>\r\n<br>\r\n\"OK when your ready we can play some games if you like.\" replied Tracy<br>\r\n<br>\r\nYou climbed the stairs and went into your room still thinking about how gorgeous Kirsten was.<br>\r\nWhen you had finished your computer game you stood up to go back downstairs.<br>\r\nThen the feeling of pain hit you. Within seconds you collapse on the floor and black out. When you wake up you find you have shrunk. But what size are you?</span></div></div>",
            "created":1167800400,
            "id":370662,
            "title":"You've shrunk, but how small are you?"
        },
        "1422":{
            "author_id":"tsoalonx",
            "author_name":"Megaman",
            "choices":[
                "Do as she says",
                "Run Away",
                "Beg her for mercy"
            ],
            "content":"<div class=\"\"><div> <span>Kirsten came in the room and spotted you immediately. She picked you up and you saw her beautiful face with a sinister yet gentle smile. She also had Jenny, Steven and surprisingly Gemma in her other hand. She went to her room and placed you all down by her feet. \"Wow, I can't believe I actually have my very own foot toys.\" \"We are not your toys, I don't care how famous you are, you can't do this to us. Now unshrink us now!\" \"Aww how cute, little Gemma doesn't want to be my toy. Well I can fix that.\" Kirsten suddenly dropped her into her right nylon and inserted her foot back in. She picked at Gemma until she was in her toe crevice so she wouldn't be squished. \"Now for the rest of you. I want a foot massage.\"</span></div></div>",
            "created":1213765200,
            "id":545821,
            "title":"2 inches"
        },
        "14221":{
            "author_id":"shrinkfeet",
            "author_name":"iamtheman",
            "choices":[
                "You watch her torture Gemma by rubbing her all over her bare feet",
                "She takes off her nylons and tells you to lick her bare feet"
            ],
            "content":"<div class=\"\"><div> <span>You are so afraid that you decide to do what she demands. You run up to her giant feet and begin rubbing them with your small hands. You turn around and you notice Jenny and Steven are gone! You figured they ran way. You were all alone massaging Kirsten's nylon covered feet as your older sister layed there in between her toes.<br>\r\n\"Are you having fun?\" Kirsten said with a giggle.<br>\r\n\"No not really. Can you make me big again?\" you say as polite as you can.<br>\r\n\"Ha! Of course not! This isn't supposed to be fun for you!\" her voice made the ground shake beneath you.<br>\r\n\"Then who's having fun?\" you ask confused.<br>\r\n\"I am! I love having my giant stinky feet massaged! Especially by little tiny foot slave kids!\" said Kirsten.<br>\r\n\"You've done this before?\" you asked with shock.<br>\r\n\"That's why I babysit! You thought I did it because I like kids or because I need the money? Ha! I'm a million dollar actress! I don't need babysitting money and I hate kids! Kids should be tiny like you and forced to be slaves to beautiful women like me! Keep rubbing you little slave!\" she shouted as she wiggled her giant toes.<br>\r\n\"Please no! Your feet smell bad!\" you whine.<br>\r\n\"What? That's no way to speak to your goddess! You must be punished!\" she said with an evil smirk.<br>\r\n\"What are you going to do to me?\" you ask nervously.</span></div></div>",
            "created":1226552400,
            "id":607391,
            "title":"Do as she says"
        },
        "142212":{
            "author_id":"redz028",
            "author_name":"hey you 64",
            "choices":[
                "make you lick their feet",
                "smother you with their feet"
            ],
            "content":"<div class=\"\"><div> <span>\"Lick my feet\" she booms.  You walk up to her feet and they smell awful.  You lick once, and you pass out.  When you wake up, Gemma is big again, and also bare foot.  \"Sup lil bro, how about you do what we say, and nobody gets hurt.\"  And with that, your sister and Kirsten...</span></div></div>",
            "created":1338767700,
            "id":1351647,
            "title":"She takes off her nylons and tells you to lick ..."
        },
        "15":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "show her round the house",
                "play a game with her"
            ],
            "content":"<div class=\"\"><div> <span>As you rush down the stairs, eager to meet your babysitter you see a tallish girl with long black hair standing in the hallway.<br>\r\n<br>\r\n\"This is Olivia, your babysitter for the weekend kids\" your mother says.<br>\r\n<br>\r\n\"Hello children, nice to meet you.\" Olivia replied.<br>\r\n<br>\r\n\"She's an actress kids, and she's agreed to babysit you.\" your father says<br>\r\n<br>\r\n\"What programmes you been in?\" Steven asks.<br>\r\n<br>\r\n\"Quite a few, mostly TV programmes, I've not done many films yet.\" Olivia replied.<br>\r\n<br>\r\nSarah came downstairs and spotted Olivia.<br>\r\n<br>\r\n\"Your Ellie from Girls In Love.\" she said with excitement.<br>\r\n<br>\r\n\"I am little girl, and you obviously watch that show, what's your name.\" Olivia said <br>\r\n<br>\r\n\"Sarah.\" your sister replied.<br>\r\n<br>\r\n\"Right Olivia, thanks for babysitting my children, we'll see you Sunday evening. Hav a nice time kids and be good for Olivia.\" your father said.<br>\r\n<br>\r\n\"We will Dad!\" you reply.<br>\r\n<br>\r\nOnce your parents have gone Olivia asks you what you'd like to do first.<br>\r\n<br>\r\n</span></div></div>",
            "created":1167800400,
            "id":370658,
            "title":"Your babysitter- Olivia Hallinan"
        },
        "152":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "Olivia swallows Steven whole",
                "She spits him out of her mouth, she was only playing"
            ],
            "content":"<div class=\"\"><div> <span>\"I know a game that all kids love, how about we play cat and mouse. You three can be the mice and I'll be the cat.\" Olivia said.<br>\r\n<br>\r\n\"OK. I like that game. Gemma plays it quite alot with us, as the house is so big there's plenty of places to hide.\" Steven said.<br>\r\n<br>\r\n\"Right I'll count to 50 while you go and hide.\" Olivia said as she closed her eyes and began to count. \"50, 49, 48, 47, 46, 45....\"<br>\r\n<br>\r\nYou, Sarah &amp; Steven ran off in search of a good place to hide.<br>\r\n<br>\r\nYou hid in the airing cupboard, Sarh hid in the kitchen and Steven hid behind the sofa.<br>\r\n<br>\r\nYou could hear Olivia's voice in the hallway.<br>\r\n<br>\r\n\"10, 9, 8, 7, 6, 5,4,3,2,1 Ready or not I'm coming to find you.\" she said<br>\r\n<br>\r\nAll of a sudden dizzyness hit you and you hit the floor. <br>\r\n<br>\r\nSteven felt the same as he was hiding behind the sofa, he hit the floor and blacked out.<br>\r\n<br>\r\nSarah felt herself feeling tired and fell asleep.<br>\r\n<br>\r\nWhen you woke up you noticed everything was much bigger than when you had first hidden.<br>\r\n<br>\r\nYou slide out under the airing cupboard door and head for the stairs.<br>\r\n\"This should be fun, I'm small and Olivia probably won't be able to find me at this size.\" you say<br>\r\n<br>\r\nSliding down the skirting you hit the carpet at the bottom of the stairs. You enter the living room and see Olivia's huge figure at the other end of the room. She is crawling on all fours.<br>\r\n<br>\r\n\"You three kids are good at hiding, I can't find you anywhere.\" you hear her say.<br>\r\n<br>\r\nYou hear a small voice from behind you. \"Dom, behind you.\"<br>\r\n<br>\r\nYou turn round to see your brother Steven standing behind you. He is the same size as you.<br>\r\n<br>\r\n\"What happened to you?\" you ask<br>\r\n<br>\r\n\"I'll ask the same question.\" Steven said<br>\r\n<br>\r\n\"Where's Sarah, is she the same size as us?\" you ask.<br>\r\n<br>\r\n\"Yep, she's behind the sofa absolutely terrified.\" Steven replied.<br>\r\n<br>\r\n\"Look out, Olivia's coming towards us.\" you say and dived for the sofa.<br>\r\n<br>\r\nOlivia was puzzled. \"Where are those kids?\" she asked herself.<br>\r\n<br>\r\nThen she spotted something moving by the sofa. She crawled across the floor and to her amazement she saw two little people by the sofa.<br>\r\n<br>\r\n\"What happened to you two?\" she said as she lent down to get a closer look, \"Oh my, look how cute you are!\" she exclaimed excitedly. she cupped you in her hands and brought you close to her face, her mint smelling breath surrounded you in warmth. <br>\r\n<br>\r\n\"Steven, Dominic it is you?\" she said shocked<br>\r\nYou and Steven were rather frightend by the whole thing and were shaking rather violently. Olivia's excited eyes turned to comforting ones as she tried to cheer you up, \"Aww im sorry, maybe i should have told you before I shrank you, but dont worry I wont hurt you. I wouldn't dream of hurting a child...especially one I'd been given responsiblity over. but that dosent mean I can't have a little fun!<br>\r\n<br>\r\n\"Please Olivia what are you going to do to us?\" you ask<br>\r\n<br>\r\n\"Come on, cheer up! think of all the fun things we can do! plus dont worry i can change you back in a day or two,\" \"I hope,\" she muttered under her breath. <br>\r\nSteven felt better, and he was even a little excited. <br>\r\n\"Your father said you like playing games boys?\" Olivia said<br>\r\n<br>\r\n\"Now what would a cat do when it caught a mouse, do you think.<br>\r\n<br>\r\n\"It would probably eat it.\" Steven said<br>\r\n<br>\r\n\"Very good. and exactly right.\" Olivia said.<br>\r\n<br>\r\nIt dawned on Steven and he was scared.<br>\r\n\"Olivia you don't mean you are going to...\"<br>\r\n<br>\r\n\"Yep I am.\" she said <br>\r\n<br>\r\nHer face was so close you you that her lips almost touched you. She grinned revealing a wall of white gleaming teeth, \"Well, your not going to just stand there are you?\" just as she said that you ducked under her chin and ran. Before you could make it much farther she sat down and you nearly ran into her skirt. You backed up but ran into her legs which she had folded behind you. She grined, a grin that you didn't find to comforting, and reached inbeween her legs. She softly pinched you between her thumb and fore finger and lifted you up. She balanced her self with the other arm as she lifted you above her head. She laughed and light from the window lit her entire cavornous mouth. \"Mmm, you look like one tasty mouse,\" she ran her tounge across her teeth. \"What?! no please don't eat me! you said you were not going to hurt me!\" \"Oh don't worry honey this wont hurt a bit,\" she brought you closer to her face and dangled you by your feet. She opened her mouth and out stretched her tounge licking you and covering you in saliva. Then she released you and you fell down into the dark cavern. you were sloshed around in the darkness as she purred and moaned in delight. <br>\r\n&gt;&gt;remember she wont hurt him&lt;&lt;<br>\r\n<br>\r\nYou scream in terror<br>\r\n<br>\r\n\"Olivia please don't eat my brother.\" you plead<br>\r\n<br>\r\nOlivia was purring like a cat and giggled. Then she tipped her head back <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1167800400,
            "id":370677,
            "title":"Olivia catches Steven"
        },
        "1521":{
            "choices":[
                "She makes you her slave",
                "She puts her mouth down to you and chomps you in half as well"
            ],
            "content":"<div class=\"\"><div> <span>She tilted her head, back but also opened her mouth so everyone cold hear his screams. The last thing Everyone heard was Steven screaming for help as he was digested in her stomach acids. \"He was delicous! How about I do her in as well.\" Oliva said. She put on her High Heels, and crushed Sarah. Her Body still had remains though. She picked the Dead Sarah, up and bit her right in half. She slowly grinded bothtop and bottoms parts with her molars. The massive blood and guts flowed down her lips, but slurped them up loudly. \"They were delicous.\" Olivia said. She then looked at you with an evil grin.</span></div></div>",
            "created":1318782480,
            "id":1207517,
            "title":"Olivia swallows Steven whole"
        },
        "15211":{
            "author_id":"iplayroblox",
            "author_name":"KittyLover99",
            "choices":[
                "What does Olivia desire you to do?"
            ],
            "content":"<div class=\"\"><div> <span>Olivia says to you, \"Don't worry, I won't harm you one bit. Really, I won't!\" She looks down on you and grins good-naturedly. \"All you have to do is be my servent and you'll stay alive.\" You shakily reply, \"Y-y-y-yes, ma'am! I will do what you want me to do, anything to stay alive!\"</span></div></div>",
            "created":1336265940,
            "id":1330288,
            "title":"She makes you her servent"
        },
        "152111":{
            "choices":[
                "Clean her teeth",
                "Clean her feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She wants you to . . . </span></div></span></div>",
            "created":1399501500,
            "id":1793095,
            "title":"What does Olivia desire you to do?"
        },
        "1521111":{
            "choices":[
                "Yes",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She puts you on your teeth and you start cleaning. Your worried she might lie and eat you like the others. Does she eat you?</span></div></span></div>",
            "created":1400541900,
            "id":1799195,
            "title":"Clean her teeth"
        },
        "15212":{
            "content":"<div class=\"\"><div> <span>She picked you up and brought you to her face.<br>\r\n\"Please don't! Just leave me, and I won't tell.\" You say, crying. She just shakes her head.<br>\r\n\"I don't believe you, don't you know that mice like to lie?\" She puts you on her teeth. With your top half sticking out. She closes her lips and bites you. Your top half falls into her hand.<br>\r\n*GULP*<br>\r\n\"Now, because you are the cutest, I will end you in a satisfying way.\" She says. She places your top half between her breasts, and crushes you. She walks out, smiling. No one found out what really happened. The police questioned her, but because the bodies weren't found and she is a famous actor, Olivia went free.</span></div></div>",
            "created":1479074400,
            "id":2236618,
            "title":"The sexy way to destroy evidence"
        }
    },
    "info":{
        "author_id":"hannah94",
        "author_name":"Hannahbell",
        "brief_description":"Nigel/Rachael Benson are away for a weekend, a young actress to babysit their 3 children.",
        "created":1167851880,
        "description":"<td align=\"left\" class=\"norm\">Your name is Dominic, you are 6 years old.<br>\r\nDominic Benson (6): image taken from Fotosearch<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img413.imageshack.us/img413/9741/dominicbensoncx6.jpg\" target=\"_blank\">http://img413.imageshack.us/img413/9741/dominicbensoncx6.jpg</a><br>\r\n <br>\r\nYou have a younger brother Steven (4) and 2 sisters Jenny (8) and Gemma (17).<br>\r\n<br>\r\nSteven Benson (4): image taken from Fotosearch.<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img407.imageshack.us/img407/1369/stevenbensonsk1.jpg\" target=\"_blank\">http://img407.imageshack.us/img407/1369/stevenbensonsk1.jpg</a><br>\r\n<br>\r\nSarah Benson (8): image taken from Corbis.<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img297.imageshack.us/img297/4455/sarahfx4.jpg\" target=\"_blank\">http://img297.imageshack.us/img297/4455/sarahfx4.jpg</a><br>\r\n<br>\r\nGemma Benson (17)<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img413.imageshack.us/img413/16/gemmapy1.jpg\" target=\"_blank\">http://img413.imageshack.us/img413/16/gemmapy1.jpg</a><br>\r\n<br>\r\nYour parents Nigel (38) a director of a financial company and your mother Rachael (39) a secretary for a computer firm are going away for the weekend and they have arranged a babysitter to look after you for the weekend.<br>\r\n<br>\r\nNigel &amp; Rachael: taken from Fotosearch<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img413.imageshack.us/img413/6971/nigelrachaelbensonlf2.jpg\" target=\"_blank\">http://img413.imageshack.us/img413/6971/nigelrachaelbensonlf2.jpg</a><br>\r\n<br>\r\nTo your amazement the babysitter your parents have got is a stunning young actress.<br>\r\nThe actress who baby-sits you is either:<br>\r\n<br>\r\n&gt; \tAllison Mack                        <br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img407.imageshack.us/img407/775/allisonmackwu8.jpg\" target=\"_blank\">http://img407.imageshack.us/img407/775/allisonmackwu8.jpg</a><br>\r\n<br>\r\n&gt;\tAriana Richards<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img407.imageshack.us/img407/4276/arianayr4.jpg\" target=\"_blank\">http://img407.imageshack.us/img407/4276/arianayr4.jpg</a><br>\r\n<br>\r\n&gt;\tJessica Fox<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img407.imageshack.us/img407/1852/jessicafoxvl4.jpg\" target=\"_blank\">http://img407.imageshack.us/img407/1852/jessicafoxvl4.jpg</a><br>\r\n<br>\r\n&gt;\tKirsten Dunst<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img297.imageshack.us/img297/2123/kirstendunstul5.jpg\" target=\"_blank\">http://img297.imageshack.us/img297/2123/kirstendunstul5.jpg</a><br>\r\n<br>\r\n&gt;\tOlivia Hallinan<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img407.imageshack.us/img407/1986/oliviahallinanhp0.jpg\" target=\"_blank\">http://img407.imageshack.us/img407/1986/oliviahallinanhp0.jpg</a><br>\r\n<br>\r\nOnce your parents leave, the actress you pick offers you a drink and having drunk it, you, Jenny and Steven all shrink in size.<br>\r\nYour elder sister Gemma does not shrink.<br>\r\nNow your babysitter is in charge. What will she do with you now you are all shrunk?<br>\r\n</td>",
        "id":1197641,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1563668460,
        "modified":1563668460,
        "pretty_title":"A Giantess Actress As Your Babysitter"
    }
}