{
    "chapters":{
        "1":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Blake shrinks...",
                "Joana grows...",
                "Blake shrinks (other)...",
                "Blake shrinks (other one)...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before starting the story select what do you want:</span></div></span></div>",
            "created":1222405200,
            "id":596517,
            "title":"What will it be?"
        },
        "11":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "He goes to Joana's house...",
                "He's meeting Joana at the mall...",
                "They're going to study for the test, so they are going to the library...",
                "Reader's choice...",
                "Reader's Choice 2..."
            ],
            "content":"<div class=\"\"><div> <span>Blake had a very hard day at school, with mountains of homework and other stuff. But now the day finished and now the only thing he had on mind was to meet his girlfriend, Joana. Later, he went to his car (a black Jetta, was given to him by a rich aunt) and drove to go where Joana's. Without knowing what was going to happen to you...<br>\r\n<br>\r\n(NOTE: Shrinking size is to 2 cm, and his voice is still audible if he isn't under anything...you know what do I mean, don't you?)<br>\r\n<br>\r\nWell, then, where does he go?</span></div></div>",
            "created":1222405200,
            "id":661755,
            "title":"Blake shrinks..."
        },
        "111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Blake shrinks, Joana looks for and finds him...",
                "Blake shrinks and unfortunely...Joana doesn't find him...*ouch*"
            ],
            "content":"<div class=\"\"><div> <span>Blake drives to Joana's house, parks his car in a nearby place and goes to his girlfriend's house. He rings the bell and Joana opens the door. She says: -\"Hi Blake, how was your day at school?\"- -\"Not so bad...\"- Blake answers because she knew everything that happened there since she was in the same classroom. Blake comes in and Joana tells him to sit in the couch, she got a movie and wanted him to watch it with her. Blake was very tired because he plays in the soccer team and has a job (computer repairing, al teast, oh his own, without mention the hard studies since 11th grade was lethal...-__-\") He felt rarely warm and couldn't help but fell asleep in the couch while Joana went for the movie...<br>\r\n<br>\r\nNow...what will happen to him?</span></div></div>",
            "created":1222405200,
            "id":587504,
            "title":"He goes to Joana's house..."
        },
        "1111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana wants to play with Blake...",
                "Joana and Blake do Joana's homework (Blake at this size didn't need to n_n)",
                "Reader's Choice (Taking a bath together, Watch the movie, whatever you want)"
            ],
            "content":"<div class=\"\"><div> <span>Blake woke up, and felt everything strange, starting with asking himself Where the heck was him? It was a brown soft thing, and after some seconds he saw the rest of the room and realized that he had shrunk -\"WHAT THE...AM I SHRUNK??!!- thought to himself. Then, he thought -\"T...This...this is impossible...people don't shrink, that just happens on Sci-Fi or...I don't know...Fantasies?...or...Is this a strange dream? or...\"- He was cut off when he heard booming steps, he saw his now gigantic girlfriend walking toward the couch.<br>\r\n<br>\r\nBlake pinched himself, believing that this couldn't be nothing but a Nightmare, but it wasn't...he was really 2 cms tall...-\"Blake?...Blake?...Where are you?\"- Joana said -\"Ah, crap\"- Blake thought -\"Where did he go?\"- muttered Joana and walked toward the couch. -\"Oh, Dammit...I'm gonna die in the stupidest way ever!!\"- Joana turned around and was about to sit on her boyfriend without even knowing it. He stared at her now gigantic and beautiful ass, paralyzed by the fear and the awe...But the fortune goddess was on his side, Joana stopped because she saw the control on the couch's pillow she was going to sit on and took it with her hand, and inmediately looked at a strange tiny thing. Blake thought for a moment -\"Thank god, I didn't want to die as a cushion...\"- but he was cut off again when he noticed that Joana was looking at him, and got her hand closer to him, trying to pick him up.<br>\r\n<br>\r\nBlake instinctively tried to avoid it but naturally Joana's hand was faster than the shrunk guy, and  having taken him, she looked with a closer view. -\"Can this be a bug?\"- -\"Oh f@#k, I was so close...\"- Blake muttered and was interrupted by Joana's soft voice -\"Blake...is that you?\"-. He couldn't believe it, she recognized him!! He was so happy in this moment but soon talked to her because he didn't want to make her believe that she was just hallucinating. -\"Yeah...It's me, Joana\"- Blake said -\"How did you get...this small??\"- -\"I don't know\"-Blake said, saddly, and lowered his head. Joana tried to comfort him -\"Why are you sad?, I mean this is bad but I'm with you, and I won't let anything bad happen to you,my love\"- You could't help but smiled shyly, and Joana continued -\"And you are SO CUTE when you smile...\"-<br>\r\n<br>\r\nWhat happens next? (By the way Blake won't change size except if he's able to return back to normal, and his voice is still audible to a normal person, I repeated this just in case)</span></div></div>",
            "created":1222491600,
            "id":590597,
            "title":"Blake shrinks, Joana looks for and finds him..."
        },
        "11112":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "There was a spark in Joana's eye's",
                "Someone enters..."
            ],
            "content":"<div class=\"\"><div> <span>Blake sat down in the palm of her hand and started to think. He raked his brain for a solution but found none, he slowly turned around and gazed into Joana's huge hazle eyes. He shrugged his shoulders and sighed, Joana wanted him to feel better...<br>\r\n<br>\r\nMinutes of silence pass, Joana's brown hair gentily swayed at a small draft. Blake looks at her and smiles <br>\r\n'I'm lucky to have her' he thinks to himself as she perked up,<br>\r\n\"Why don't we just take your mind off it. I'm sure it'll ware off\" She said softly as she stroked Blake's head. Blake blushes and smiles up to her, she gets out her pencils and a book. <br>\r\n<br>\r\nJoana giggled as Blake tried to lift up a pencil but fell over due to the weight. In the end they were both laughing. When they stopped, Blake showed her the spelling mistakes she had made. They both talked while they worked and it was a fairly relaxed evening. Up untill...</span></div></div>",
            "created":1222491600,
            "id":587944,
            "title":"Joana and Blake do Joana's homework (Blake ..."
        },
        "11113":{
            "author_id":"spongebob1234",
            "author_name":"Trisha",
            "choices":[
                "Blake falls into her food...",
                "Blake falls into her pants..."
            ],
            "content":"<div class=\"\"><div> <span>They two watched the movie. She set him on her head. Blake sat at the front of her head.  An hour in, she is hungry. He, being nearly weightless, is forgotten temporary by her. She stands up and goes to kitchen for something.<br>\r\n<br>\r\nBlake tumbles down and falls into her really huge boobs.  As she walks, Blake slides between them. he felt so nice in between those huge and soft beautiful breasts, then, he fell asleep because the only he heard was Joana's heartbeats, the most beautiful sound that Blake had heard ever, it brought forgotten memories to him and then, he slept for a while. Then... </span></div></div>",
            "created":1223096400,
            "id":591423,
            "title":"Forgotten"
        },
        "111131":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Saw Blake in there...",
                "Ate her food..."
            ],
            "content":"<div class=\"\"><div> <span>Blake fell down from Joana's beautiful and huge breats, and landed son something soft, no as Joana's but at least it stopped his fall, he saw that he was on a steak, which Joana had taken from kitchen. She got the fork and the knife and before eating she asked to Blake (not knowing where was he) -\"Hey Blake, do you want some of this steak?\" She suddenly remembered 'Oh my...he was on my head...and I FORGOT IT!!' she became desperate and looked for him frenetically in the way she had walked and then she thought 'If..I...stepped on him? Oh no!' And she checked her shoes. There was nothing. If she crushed her beloved boyfriend, it should be a red stain, or in the floor, but there was anything. She sighed in relief 'At least I didn't kill him'. She continued looking for but her stomach groaned and decided to eat some of her steak before continue searching Blake. So, she came to the table and... </span></div></div>",
            "created":1223182800,
            "id":591427,
            "title":"Blake falls into her food..."
        },
        "1111311":{
            "choices":[
                "Watch TV",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Joana came back to the room and sat down on the couch. She grabbed the plate and was just about to cut a piece off when she noticed a small lumpy thing on it. She looked closer and gasped when she realized it was Blake. \"Oh Blake! I'm so sorry! I shouldn't have been so careless! I promise to be more careful from now on!\" They then...</span></div></div>",
            "created":1240808400,
            "id":682716,
            "title":"Saw Blake in there..."
        },
        "11113111":{
            "choices":[
                "Joana decides to do something else...",
                "She steps on him and he doesn't die or avoids her foot on time.."
            ],
            "content":"<div class=\"\"><div> <span>They watch more T.V. and that's when Joana had an idea. -\"Hey Blake\"-, she said. -\"Can you rub my feet?, they are killing me\"-. Blake remained silent for a moment but decided to not dissapoint her, anyway, there wouldn't be anything wrong with giving his girlfriend a foot rub. He hadn't such a thing as a foot fetish at all. When he was down at her feet he relized they were the size of the titanic. When he was rubbing her feet he some how started to lick and suck her toes. Joana giggled, enjoying that...</span></div></div>",
            "created":1246251600,
            "id":719854,
            "title":"Watch TV"
        },
        "1111312":{
            "author_id":"asdfs",
            "author_name":"asdfs",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Joana ate her food, digesting Blake.</span></div></span></div>",
            "created":1321938000,
            "id":1227266,
            "title":"Ate her food..."
        },
        "111132":{
            "author_id":"darkmatt29",
            "author_name":"darkmatt",
            "choices":[
                "He goes in her @!~@#!@",
                "He gets to her back pocket to be safer (Bad move?)"
            ],
            "content":"<div class=\"\"><div> <span>Blake slipped down, falling inside Joana's pants. Then, after some walking, unknown to him where or what was she doing,  she got very sweaty he fell in her pants, and after an hour she got too involved, so she forgot Blake was small and when went to the bath room and did #1 then...  </span></div></div>",
            "created":1227330000,
            "id":610795,
            "title":"Blake falls into her pants..."
        },
        "1111321":{
            "author_id":"ben888",
            "author_name":"acc1201bj",
            "choices":[
                "Toy",
                "IN the mouth you go"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After she got done with her number 1 she pulled her pants up very tight which made Blake go into Joana's pussy.  only his head was sticking out when she found out he was down their. WAT DID SHE DO?</span></div></span></div>",
            "created":1276232400,
            "id":898058,
            "title":"He stays in her panties!!"
        },
        "11113211":{
            "author_id":"ben888",
            "author_name":"acc1201bj",
            "choices":[
                "readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she decided he could be used as a dilldoo so she started pushing him in and out very fast and she came on him. after she was done she left him inside her mouth and started playin with him.</span></div></span></div>",
            "created":1276232400,
            "id":898059,
            "title":"Toy"
        },
        "1112":{
            "author_id":"theredcabinet",
            "author_name":"Keen Bean",
            "choices":[
                "Blake has a close up view of Joana's pink short shorts...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>    When Blake awoke it was to his dismay that he had shrunk to 2 cm tall! Everything was so huge at this height. The buttons on the couch were as big as cars.<br>\r\n    Blake suddenly heard a thunderous noise coming his way. It was Joana! She had found the movie and was coming back in the room. Blake looked up in wonder at his beautiful girlfriend, her long tan legs leading up to her big ass. She was wearing a pair of pink short shorts.<br>\r\n   \"Hey Blake whered you go?\" she said, causing Blake to shake with the vibrations of her voice, \" I found the movie.\" Blake tried to yell out to her that he was minimized on the couch but she couldn't hear him in his tiny form.<br>\r\n   \"Oh well\" she said approaching the couch \" I guess i'll just have to start the movie without him\"<br>\r\n   \"No wait! Joana don't sit down!\", screamed Blake as Joana towered over him.<br>\r\n   But Joana couldn't hear her 2 cm tall boyfriend and leaned her ass over his tiny body to sit down...<br>\r\n<br>\r\n</span></div></div>",
            "created":1223010000,
            "id":667452,
            "title":"Blake shrinks and unfortunately...Joana doesn'..."
        },
        "11121":{
            "author_id":"theredcabinet",
            "author_name":"Keen Bean",
            "choices":[
                "Joana gets up to get some popcorn...",
                "Joana gets even more comfortable..."
            ],
            "content":"<div class=\"\"><div> <span>Blake let out a muffled yell as Joana's huge ass came rushing down on top of him, crushing him between her ass and the couch cushions.<br>\r\nJoana made herself comfortable by wriggling her ass into the couch putting intense pressure on Blake as Joana's huge soft ass completely enveloped him. Blake could hardly breathe and felt his body aching with pain as Joana realized she was sitting on something.<br>\r\n<br>\r\n\"Ew! It feels like I just sat on something squishy!\" exclaimed Joana as she sat up from the couch. She looked down at where she was sitting<br>\r\nand didn't see anything, not knowing that it was her boyfriend she was sitting on and he was now stuck to her beautiful pink shorts ass.<br>\r\n\"Oh well, maybe it was just my imagination\" Joana said as she slowly lowered herself back onto the couch.<br>\r\nBlake tried to yell out but his yells were muffled by her ass cheeks which fully surrounded him. Blake felt her crushing down on him again and wondered how long he could take being smooshed under her ass...</span></div></div>",
            "created":1223096400,
            "id":742375,
            "title":"Blake has a close up view of Joana's pink s..."
        },
        "111212":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "But nothing, he's dead",
                "He still resisted for a while and eventually peel's off"
            ],
            "content":"<div class=\"\"><div> <span>Blake tried to scream but his voice wouldn't come out. Joana was killing him and she didn't know! He gulped as he heard a fatal sound.<br>\r\n<br>\r\nJoana yawned. It was a fairly relaxing day. She leaned back, oblivious to Blake's presence. She let her arm's drape loosely around the back of the chair. She clicked her fingers and wiggled into the chair. She brought her long legs up and hugged them.<br>\r\n\"Mmmh\" she said quietly in happiness. <br>\r\n<br>\r\nBlake was being smushed and crushed and squeltched. Soon there was a small red stain on her favourite shorts getting ironed into the material. Blake was nothing more then a small splat on Joana's pink shorts.<br>\r\n<br>\r\nBut...</span></div></div>",
            "created":1223182800,
            "id":591407,
            "title":"Joana gets even more comfortable..."
        },
        "1112122":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "There is a strange bug and a red stain...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>After some minutes, Joana felt a warm thing benneath her...and remembered that some time before she felt a squishy thing, and she was thinking <br>\r\n-\"It may be a bug, so...it wouldn't matter ...\"- she mutered  <br>\r\n-'Damn...this is my dead end...!'- thought Blake to himself, and then heard<br>\r\n -\"But...bugs aren't warm...I wonder...What would it be?\"- As she sat up again to see what did she sit on...</span></div></div>",
            "created":1223182800,
            "id":591410,
            "title":"He still resisted for a while and eventually pe..."
        },
        "11121221":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana sees the bug closer and...It was Blake?!",
                "Someone enters..."
            ],
            "content":"<div class=\"\"><div> <span>Blake felt himself like he was about to die, he could barely breathe and thought <br>\r\n'Oh dammit...this is my end...who could imaginate that I'd die as my girlfriend's cushion?...Ugh...' But before he fell unconscious, the inmense pressure over him was being relieved and Joana's colossal ass got up from the couch. She turned around and bent down to see what was it where she was sitting, she saw a red stain and a rare tiny bug. She thought to herself <br>\r\n'This is weird...In Sciences the teacher told that bugs don't have red blood and this one does?'- She decided to pick it to take a closer view, being that injured it wouldn't be able to sting if ti even was poisonous.<br>\r\n<br>\r\nBlake opened his eyes, and seeing everything slowed down and blurred, he saw in desperation how a giant hand came to grab him, and, instinctively, he tried to run away to save his fading life and barely moved. Anyways, even at 100% he wouldn't be faster than a normal hand so, Joana caught him and brought nearer to her beautiful face. Blake only watched how her goddess-like girlfriend was seeing him disconcerted, and tried to hope the best...or worse....</span></div></div>",
            "created":1223182800,
            "id":591419,
            "title":"There is a strange bug and a red stain..."
        },
        "111212211":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana decides to try to heal Blake...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>-\"Blake...Is that you?\"- asked Joana before she thought that this may be impossible <br>\r\n-\"Ugh...Y-Yeah...Joan-na...It's me...\"- said a very injured Blake. Joana was now shocked, her boyfriend shrunk and she didn't even know it!! and even worse...she sat on him, crushed him under her weight and nearly killed him!!<br>\r\n<br>\r\nTears started to form in Joana's eyes, as she said <br>\r\n-\"Blake, I'm, I'm so sorry...I didn't want to hurt you...I didn't even imagined that you would be this small\"- As Blake barely answered <br>\r\n-\"Don't worry Joana...I know you w-wouldn't hurt m-me intentionally...ugh\"- he almost fainted and Joana screamed -\"Blake!!!\"- she started to cry <br>\r\n-\"Please don't die...please, forgive me. I...I love you and  can't see you so wounded\"- she said in her crying <br>\r\n-\"You are not safe with me...I'm a stupid\"- <br>\r\n-\"J-Joana...don't say such things...cough...You're the only person I'd be safe with\"- Joana stopped her cry and then gave him a soft hug, being careful to not squeeze him in her big breasts, trying to not think that he was bleeding and that she crushed him so brutally with her enormous rear... </span></div></div>",
            "created":1223182800,
            "id":638839,
            "title":"Joana sees the bug closer and...It was Blake?!"
        },
        "1112122111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "In between her boobs...",
                "Other..."
            ],
            "content":"<div class=\"\"><div> <span>Joana felt so bad being the one who hurt so horribly Blake, and the one who Blake never would expect it...<br>\r\n<br>\r\nShe decided to try to heal her helpless boyrfriend and said -\"Blake, I'm so sorry, seriously, but I'll do everything to heal you\"- then, she licked him softly and saw the pain in his eyes, she never liked Blake to get injured. She just couldn't support the idea. Blake was so hurt and tired that he'd force himself if tried to speak. Before he could say anything she took him in her hand and said -\"I'm gonna take you to the hospital, with Karina's (her mother wass a doctor) and 'm sure that there will be something to help you\"- Then, smiling for a moment, she put him carefully...</span></div></div>",
            "created":1223269200,
            "id":591822,
            "title":"Joana decides to try to heal Blake..."
        },
        "11121221111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "They get to the hospital...",
                "Something happens..."
            ],
            "content":"<div class=\"\"><div> <span>Joana placed Blake carefully in between her huge and soft breasts and said with some happiness <br>\r\n-\"These two won't crush you, and you'll be safe and warm in there untilI get to the hospital\"- Blake answered a faint -\"OK...\"- In fact, he was too wounded to talk or enjoy this ride. He barely was awake and he knew he has to be because if he fell asleep he could not wake up again never, and the grief this could cause to Joana..Then, he got comfortable in his girlfriend's boobs. He felt it so nice and adding he was injured and the only sound he heard was Joana's heart (except for the steps that were muffled by her body), he couldn't help and fell asleep. Joana was walking to the hospital and decided to check out Blake and found him sleeping, she woke him up with her soft voice -\"Blake...- and she rubbed her finger on his head, he woke up after some seconds and Joana continued <br>\r\n-\"We're going to the hospital and please don't fall asleep, you look so cute and I know you're very comfortable but I'm afraid you die while sleeping\"- <br>\r\n-\"Uh...ok Joana...I won't sleep\"- Blake answered sleepy. Joana caressed him again and walked to the hospital. Where Karina should help them...</span></div></div>",
            "created":1223269200,
            "id":591872,
            "title":"In between her boobs..."
        },
        "111212211111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Karina has a way to help him...",
                "Something happens"
            ],
            "content":"<div class=\"\"><div> <span>Joana got to the hospital and walked inside, then she asked for Karina and went to  Karina's mother's office. She knocked the door and Karina opened. She sat on the red sofa and then talked to her. They took some minutes talking and Joana told her that something happened to Blake, and began to cry when she said she hurt him by sitting on and crushing him. Karina was in disbelief. Joana was the last person in Universe who would hurt Blake. Then Joana got him out from her breasts and gave to Karina to take a closer view. Blake was still sleeping, since he was so injured, he slept a lot. Karina noticed that he was more that simply crushed and Joana told her that she got comfortable on the couch not knowing she was killing the love of her life.<br>\r\n<br>\r\nKarina woke up Blake by rubbing her indez¡x finger on his little head -\"Um...Joana, did we arrive, he said before opening the eyes\"- Karina said -\"Yes Blake, you're in hospital\"- He shivered instinctively because Karina now was huge to him (he barely accustomed to Joana, who...crushed him...) and noticing this she said -\"Don't be afraid neither me nor Joana. She loves you and I'm your friend. You're safe with both of us\"- That calmed Blake and the Karina said -\"Maybe medicine is too far from changing size of things or...people, but I've got a way to help you now\"-</span></div></div>",
            "created":1223355600,
            "id":592759,
            "title":"They get to the hospital..."
        },
        "1112122111111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Healing and making him stronger to crushing...",
                "Just healing him (whatever)..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well before continue. How do you want Karina to heal Blake?</span></div></span></div>",
            "created":1223442000,
            "id":592762,
            "title":"Karina has a way to help him..."
        },
        "11121221111111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Blake's healed",
                "It didn't work??!! Damn!! And...what happened to Blake?!"
            ],
            "content":"<div class=\"\"><div> <span>Karina put Blake on Joana's palm and went for a thing. After some minutes, she returned. It was a strange electrode little machine -\"My mom just received this on morning for her researchs and experiments\"- -\"What is it? I don't wanna be a guinea pig!\"- Blake said, a bit upset to be an experiment object. -\"No, you won't be. This has been prooved by their creators\"- -\"What does that thing do?\"- asked Joana -\"Well, this machine does 2 things: It heals someone and the secondary effect is making them a lot stronger\"- -\"Why is so small?\"- Joana said -\"It's this size since only has been prooved on rodents, and now that Blake is...ummm...at this size...It should work on him\"- -\"SHOULD?!\"- Blake shivered in some fear -\"Aw, c'mon. This better works or you may die by bleeding because there isn't a micro surgery system in this hospital, and even if it would, you'd be discovered and caught by scientists\"- -\"Uh...okay...\"- Blake accepted forced by his situation-<br>\r\n<br>\r\nShe put him inside the little machine and turned it on. There was some electricity sparks since that worked with ions. It lasted about ten minutes and then stopped. Karina said -\"It's already. Let's see how's Blake, He should be good as new\"-</span></div></div>",
            "created":1223442000,
            "id":592768,
            "title":"Healing and making him stronger to crushing..."
        },
        "111212211111111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "They both arrive to Joana's house...",
                "Something happens in middle of the way?"
            ],
            "content":"<div class=\"\"><div> <span>Blake got out from the little machine (which was a little tank with a green liquid and two electrodes, its size it's due to the fact that only it has been proved on rodents and other small animals) Blake was completely healed and even his clothes were as new (no blood as before). He felt himself a bit strange and he opened and closed his hands a few times. Then Karina said -\"I'm glad it worked on you! Now you're completely healed\"- Blake was silent for a moment and then Joana asked -\"Blake...are you ok?\"- -\"Uh...yeah...I am...but I still feel weird\"- Karina laughed and said -\"I told you there was a secondary effect\"- -WHAT?!\"- Joana and Blake both shouted, Blake slapped his forehead as Karina comforted him -\"It's not a bad one. If there were posiblities that this machine hurt you, believe me, I'd never test it on you\"- Blake was relieved, after all, Karina has been a very long friend of him, even longer than Joana (Blake and Karina met since 9 years old). Joana took Blake a bit roughly this time and she hugged him. It was a very tight hug and Blake felt himself sinking in Joana's breast as Karina continued -\"Blake, your whole body is about 90% more resistant, so, you can't be crushed anymore, except with an intense force like an intentional stomp, which you would even resist and I don't think Joana would even think about do that to you\"- Joana was still huggin Blake and Karina concluded -\"But don't hope to be able to lift up your girlfriend or even me...your muscles are only about 15-20% stronger only\"- Then Joana released her hug and they three talked about many things for about two hours. Then Joana and Blake said goodbye to Karina and went to Joana's house.</span></div></div>",
            "created":1223614800,
            "id":593519,
            "title":"Blake's healed"
        },
        "1112122111111111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana was now a lot more affectionate...",
                "Joana was still sad to know that she crushed him..."
            ],
            "content":"<div class=\"\"><div> <span>After some minutes of walking for Joana (Blake was going in between her breasts again, despite he wasn't hurt but Joana put him in there as a little gift) they arrived to her house. Joana went to her room and then woke up Blake, who couldn't avoid to sleep with her heartbeats as music. He was still sleepy and Joana put him out of her breasts. He was standing on the bed with Joana. then, she grabbed him softly with her hand as she got him closer to her face. Blake could see in her eyes that...</span></div></div>",
            "created":1223614800,
            "id":593522,
            "title":"They both arrive to Joana's house..."
        },
        "11121221111111111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "She asks Blake what part of her body does he like the most...",
                "They are going to sleep..."
            ],
            "content":"<div class=\"\"><div> <span>Blake saw a kind of spark in his girlfriend's beautiful brown eyes and knew what was going to happen...Always that spark appeared when Blake was injured after his combats and a few times when he did something that resulted to be cute for her (mostly not knowing it, when they weren't lovers).<br>\r\n<br>\r\nJoana said with a very soft voice -\"I love you Blake...I love you so much\"- and gave him his life's biggest hug, while she felt Blake sinking in her big breast, and she liked this very much. Blake enjoyed this also, feeling the warm of Joana's flesh and the softness, which was very rare to him since he always has been obligated to sleep on the hard and cold floor by his mother, who hated him even before his birth.<br>\r\n<br>\r\nAfter more than 10 minutes, Joana released Blake from her hug and brought him closer to her face...again. For some reason, Blake at his new size seemed to be even cuter to her eyes, and without saying anything, Joana started to lick him slowly, soaking with her warm tongue (giant for Blake). Then she gave him several kises and rubbed him against her breasts. Then she sits him on her palm and...</span></div></div>",
            "created":1223701200,
            "id":594535,
            "title":"Joana was now a lot more affectionate..."
        },
        "111212211111111112":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "They now will sleep...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Joana said -\"Blake, After all what we passed today, I'm tired. Do you want to sleep?\"- -\"Uh...Yeah\"- Blake thought that answer a little since he was healed and he had full energy but he wouldn't miss such chance. Joana hugged him again but this time only for some seconds and then she smiled. Joana always loved Blake and that size made him cuter, maybe for the fact that now he needed her to protect and care him, or for her maternal instincts which she always has gotten with Blake.<br>\r\n<br>\r\nShe decided to take a shower before sleeping (Blake didn't need to since that the green machine's liquid healed and cleaned his body entirely). So, she locked the door and left Blake on her bed while she went to take a bath. Blake waited patiently, and walked around the room for some minutes, he wanted to test his new abilities. He felt as he had a new body, and it was great. he enjoyed this a lot. Then he heard the bathromm door open and he quickly climbed to the bed again.</span></div></div>",
            "created":1223787600,
            "id":594552,
            "title":"They are going to sleep..."
        },
        "1112122111111111121":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "What a nightmare!!!"
            ],
            "content":"<div class=\"\"><div> <span>Joana laid on the bed and then said <br>\r\n-\"Come here, Blake\"- As she put him in between her breasts, Blake blushed and Joana laughed a little and said -\"Don't be embarrased...You're my boyfriend and I can't leave you on the cold nightstand. You have to sleep with me\"- She smiled <br>\r\n-\"You'll be warm and safe in here\"- Joana kissed him and they both said good night and began to sleep... <br>\r\n<br>\r\nBlake woke up when Joana did also and moved, she said <br>\r\n-\"I'll take a bath before going to the school...Stay here\"- She smiled and went to the bathroom. Blake decided just to wait her, but he suddenly felt weakened, which was strange since that the machine strengthened him, and dismayed. He was unconscious about 10 minutes. When he woke up, he couldn't recognize the place where he was...and shivered when he realized that...HE SHRANK FURTHER!! to a millimeter tall...-\"Oh...this is bad\"- The he realized he was paralyzed and he thought <br>\r\n-\"Dammit machine, I'm sure this is a very bad side effect if just K...\"- he was cut off when he heard tremendous booming sounds and saw his now kilometric girlfriend approaching the bed. She immediately looked for him -\"Blake? Blake? Where are you?\"- She continued searching and got very stressed <br>\r\n-\"Blake? Where did you go? This is not fun!\"- she said very worried, thinking that the first time she almost killed him was because she didn't see him, she never would want to crush him again... The time elapsed and she was getting late, so, she decided to dress and then continue her search. <br>\r\n-\"Oh damn! Wait Joana! Don't sit down on me...again!!\"- Joana was towering over him and she couldn't even figure out what happened to Blake, and she sat down on the bed. Blake was frozen when he saw almost in slow motion how Joana turned around and sat down. Her huge ass now looked like a planet!! In fact, each of her buttocks were as huge as one. And the worst...it was going to crush him to dust definitively. Joana stopped for a moment and thought if she wasn't gonna crush her boyfriend again underneath her big ass, so she checked the bed and despite Blake cried and waved his arms (he wasn't paralyzed anymore), she couldn't notice her one millimeter tall boyfriend, and turned around to sit down again. Blake saw in fear how her gargantuan rear came rushing down on top of him, and felt the weight of Joana's glutes. <br>\r\n-\"I ...I am going to die...\"- said to himself Blake, he now was so small that Joana wouldn't feel him under her and maybe she never would know that he died beneath her gigantic rear.<br>\r\n<br>\r\nBlake felt himself under an inmense pressure, underneath his girlfriend enormous backside, it felt like being crushed by a soft but still heavy planet, all that weight on his body. Despite he was stronger, he knew he wouldn't be able to resist for long. And suddenly felt every bone of his body breaking, one by one, and started to bleed as he was being ironed on his girlfriend's big buttocks. Blake saw some remembers of his life and knew that this was the end <br>\r\n-\"J...Joana...maybe you'll never know you killed me...but...I love you...ughhhhhh\"- those were the last words Blake could said muffled by the flesh before being totally crushed. Feeling how his body was destroyed and even how his lungs were squashed and the air going out of them...Then...</span></div></div>",
            "created":1223874000,
            "id":749745,
            "title":"They now will sleep..."
        },
        "11121221111111111211":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "A new day awaits for the two lovers...",
                "They wake up at the next day..."
            ],
            "content":"<div class=\"\"><div> <span>Blake felt himself as he died really and then he woke up and gasped...-\"Whoah!!...uh...it was just a nightmare\"- he muttered to himself...definitively being crushed under his girlfriend traumatized something in his mind, but he calmed and sighed deeply. He has cold sweat but was still ok...then a movement made him alert, it was Joana, she yawned before talking to him -\"Blake...are you ok?\"- And she brought him close to fer sleepy face -\"It was nothing, Joana\"- and she answered -\"I heard you\"- -\"You WHAT?!\"- Blake thought that he must have begged for mercy in his nightmare -\"You were screaming 'Please...don't kill me' 'Don't sit down' and I guess that those were your words like being before to die: 'Joana...I hope you don't worry about me. I love you' and some things like those...\"- Then she looked at him sadly -\"You're still afraid of me\"- -\"No, Joana! It's just that being...crushed...scared me...I felt so weak and unnoticeable...\"- Joana was now surprised, in the whole years she knew him...he had seen him sad, angry or normal, but never scared...Even fighting big guys like Ivan didn't make him afraid about it...but now...it was different. Joana felt more affectionate since she knew this, his poor boyfriend was feeling weak and vulnerable, so, she hugged him tightly and said -\"Don't worry, my love. You'll never will be hurt again. Now you're with me and I'll have to die before something bad happens to you\"- Joana kissed Blake and put him between her breasts again -\"Now, we must sleep, tomorrow will be a new day\"- she winked and Blake quickly fell asleep again...she looked at him for some moments, he looked so cute to her, almost like a baby who neede her to survive in that cruel world. She rubbed her index finger on his head and closed her eyes to sleep...</span></div></div>",
            "created":1224046800,
            "id":602780,
            "title":"What a nightmare!!!"
        },
        "111212211111111112112":{
            "author_id":"luigip",
            "author_name":"Luigi P.",
            "choices":[
                "Joana comes out of the shower...."
            ],
            "content":"<div class=\"\"><div> <span>Blake woke up on Joana's boobs. It was hard day for him yesterday, but Blake had one thing in mind: This day would be better. He decided not to move, because Joana could get worried if Blake wasn't there. Blake just looked at the ceiling, as most teens do when they are thinking. Blake wondered if he would ever be normal sized again. He would let that thought go to the back of his mind for now. Joana started to wake up. She started to talk her shrunken boyfriend.<br>\r\n<br>\r\n\"Hey, sweetie.\" Joana said.<br>\r\n\"Huh? Oh, hey Joana.\"  Blake said. \"Sorry for that. I was thinking.\"<br>\r\n\"Thinking about what?\" Joana said. <br>\r\n\"I thought about how I would be able to live at this size.\" Blake said. \"Now I know how a bug feels.\"<br>\r\n\"Don't worry about that Blake, just relax.....\" Joana said. \"I am going to get ready for school, so just stay there.\"<br>\r\n<br>\r\nJoana headed for the shower. Blake thought about not going or going with Joana to school. He also thought about if Cinthya would catch him there. He also wondered why he thought about these things...<br>\r\n</span></div></div>",
            "created":1225256400,
            "id":601618,
            "title":"Dont Think too hard....."
        },
        "1112122111111111121121":{
            "author_id":"luigip",
            "author_name":"Luigi P.",
            "choices":[
                "Let's skip ahead to Lunch!"
            ],
            "content":"<div class=\"\"><div> <span>Joana came out the shower, and started to head toward Blake, who was looking around. <br>\r\n<br>\r\n\"Blake, I think I might take you to school with me today.\" Joana said.<br>\r\n\"Ok,\" Blake said. \"I think that's a good idea. Where shall I reside? In your purse, pocket, or whatever else you can think of.\"<br>\r\n\"I think I shall keep you in the purse.\" Joana said. \"If I were to have you in my pocket, I would probably put something in there and you would risk the chance of crushing you. I'll put in one of the pockets I barely use.\"<br>\r\n\"That would be fine.\" Blake said, trying to keep his mindset clear of any threating thoughts.<br>\r\n<br>\r\nJoana, being 17 and all, drove to school. It wasn't a long drive, about 10-15 minutes. Blake, however, was only in Joana's boobs for the time being, so all the bumpy roads to school wouldn't make him fly, and besides the boobs were big, so Blake was secure.<br>\r\n<br>\r\nThey soon arrived to school. Joana put Blake in the purse. Blake wondered how he was going to explain his absence in school. If he was this way forever, at least Joana is always going to be for there him.</span></div></div>",
            "created":1225688400,
            "id":603625,
            "title":"School..."
        },
        "11121221111111111211211":{
            "author_id":"luigip",
            "author_name":"Luigi P.",
            "choices":[
                "To Blake and Cinthya.",
                "Stay with Joana."
            ],
            "content":"<div class=\"\"><div> <span>Joana was very careful with Blake for half of the school day, giving him air, and sneaking him pieces of chips she had gotten before classes started, Blake was impressed by Joana's increased caring and awareness for him. Guess being shrunk and almost being crushed and killed changes everything. <br>\r\n<br>\r\nBut, Cinthya was in some of Joana's morning classes. She had seen her putting things inside her purse and saw her talking to her purse, which isn't normal. Cinthya planned to see what was in her purse.<br>\r\n<br>\r\nAt lunch, Cinthya sat next to Joana, who was suprised at this. Then she offered to give Joana a Mountain Dew, which Joana took. Now, this pop can make you go to the bathroom after lunch, and Joana didn't use the bathroom at all since this morning.<br>\r\n<br>\r\n\"I have to go to the bathroom.\" Joana said. \"Can you watch my purse?\"<br>\r\n\"I'll be glad to,\" Cinthya said, putting on a fake smile.<br>\r\n<br>\r\nJoana ran off, and Cinthya looked in her purse, and digging in the purse gave her the benefit of finding Blake, who was like; OH $%#@! And this wasn't going to be good for Blake. Cinthya put Blake in her purse, and as soon as Joana came back, Cinthya gave Joana her purse back, and quickly left.</span></div></div>",
            "created":1225688400,
            "id":603644,
            "title":"Cinthya+ a small Blake= OH NOES!!!"
        },
        "111212211111111112112111":{
            "author_id":"luigip",
            "author_name":"Luigi P.",
            "choices":[
                "Cinthya isn't intent on killing Blake, just revenge, GTS Style.",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Blake, who was in Cinthya's purse, was freaked out in a number of ways, Like how the heck did he thought and knew that Cinthya was going to capture him? What was Joana doing? He thought that she was in SUPER panic mode right now. And what was Cinthya going to do with him, due to the fact she hated him. There was going to be hell to pay for Blake when he got to Cinthya's house. Blake then wondered, is this somekind of twisted conspiracy? Soon, he saw light for the first time in a while. It must have been hours since lunch that he saw light. He didn't want to see light. <br>\r\n<br>\r\n\"Hi, Blake.\" Cinthya said with a smile, an evil one at that.<br>\r\n\"Hi.....Cinthya.\" Blake said.<br>\r\n\"So how long you have been this way?\"<br>\r\n\"About a day.\"<br>\r\n\"I think I am going to enjoy this.\" <br>\r\n\"LET ME GO BACK TO JOANA!\" Blake said in anger, he knew it was wrong in this case.<br>\r\n\"You think you have the right to talk to me like that at YOUR size?\" Cinthya said. \"I mean, I could kill you Blake. It wouldn't take me any effort.\"<br>\r\n<br>\r\nThat's the last thing Blake wanted to think about. DEATH. It would ring in his mind for a long time until he was back to normal. After having a near a death experience, he didn't want to think about DEATH. Even when that healing machine made him stronger tu crushing, he felt instinctively that he couldn't be inmortal and in some point, if Cinthya wanted to kill him, she would do it...<br>\r\n<br>\r\n\"Please, just don't kill me.\" Blake said. \"Do whatever you want, just don't kill me.\" Said with some desperation while thought in a way to escape, or something...<br>\r\n<br>\r\nWhat was going to happen to Blake.</span></div></div>",
            "created":1225861200,
            "id":606817,
            "title":"If Blake's not in a death trap, he's close to one."
        },
        "1112122111111111121121111":{
            "author_id":"luigip",
            "author_name":"Luigi P.",
            "choices":[
                "Continue."
            ],
            "content":"<div class=\"\"><div> <span>Blake's situation was horrible. He was lucky that Cinthya didn't kill him. Cinthya had lot of things in store for Blake. She was going to show him how much she wanted him. And Blake knew how girls would crazy over not getting a boy.<br>\r\n<br>\r\n\"Blake the first thing you can do is massage my feet.\" Cinthya said.<br>\r\n\"....Ok.\" Blake said, he was neutral toward feet.<br>\r\n<br>\r\nIt was horrible. Cinthya's foot odor was horrible. He could barely breathe. He had to make sure to get most of Cinthya's feet, or else he would be punished. He had to rub and lick them. Blake soon passed out from the odor; for the smell was so purid, so stinky, Blake at his current size passed out.</span></div></div>",
            "created":1226379600,
            "id":606831,
            "title":"Foot Massages can KILL?"
        },
        "11121221111111111211211111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Continue Blake and Cinthya...",
                "Joana decides to do something..."
            ],
            "content":"<div class=\"\"><div> <span>Blake woke up after two or three minutes, even at his current size, he was more resistant than average, with the eyes still closed, decided not to move and pretend to be unconscious for a while, and began to think, the first what came to his mind was what the hell happened...Joana wouldn't hand him like that, Cinthya must have used a trick, and...HOW could Joana be fooled that easily?...Then, he thought what else would have Cinthya in store for him...the foot were horrible, but...what else would come out?, Would she step on him? or eat him as a snack? Blake wasn't able to imaginate more things, those two were horrible enough to not sleep in three days...<br>\r\n<br>\r\nAbout an hour before...In school...<br>\r\n<br>\r\nJoana went to get her purse and saw that Cinthya left... she thought she wouldn't watch her things since she still probably hated her because of Blake... Cinthya was wrong anyways, She didn't really love him and Joana knew who was he truly... Cinthya only knew the fighting guy who beated many times many bullies around the school...who strangely was pretty smart for not being a nerd (And Blake ISN'T a nerd...he never studies for tests, excepting by Math and Physics, numbers aren't his area) and she wanted him even knowing Joana was his girlfriend (They were together since the end of 9th grade, and Cinthya appeared about 4 months later, in first semester of high school). Joana din't think much about it and went to her last classes...<br>\r\n<br>\r\nWhich were Chemistry and Biology, she was so busy and didn't talk to Blake, not knowing that even if she did, she would be speaking alone. The final bell rang and everyone got out from the classroom... Joana remembered about her tiny boyfriend and said <br>\r\n<br>\r\n-\"Honey, I'm sorry for not saying anything... But at last it's time to go home...\"- She had no answer <br>\r\n<br>\r\n-\"Huh?\"- Joana checked her purse and didn't find Blake... -\"Blake?!\"- She was getting worried about him... Why Blake wasn't in her purse? <br>\r\n<br>\r\n-\"Blake...please, this isn't fun\"- Joana was begging to Blake, hoping that only all it was a simple joke of her shrunk boyfriend...<br>\r\n<br>\r\nThen Joana was getting in panic, and tried to step back with her mind and regain what happened in all that day... but before she could get it, many thoughts came to her mind, a tiny Blake falling from her purse in any moment and being stepped or sat on by people, even her... 'that can't be...I've been very careful...And when I sat on him the first time, I felt him clearly...' Joana only had a weak relief that at least she didn't kill him... She looked in the places where she was until the lunch time and didn't find any stain (if he was crushed his stain would be still there, janitors clean school half hour after last ring), and, Joana really didn't want to find a little stain like it was on her couch when she sat on him (which Joana doesn't want to remember or mention EVER)<br>\r\n<br>\r\nJoana the got it... Blake disappeared just in the moment she left her purse and Cinthya \"watched\" it and mysteriously left before she was done in the bathroom... Cinthya definitively took him... The question is... Will Joana rush in Cinthya's house and fight her to get Blake back (for the ones who like catfights...) or will she plan a smarter method?<br>\r\n<br>\r\nGoing forward, to Blake's torture moment...<br>\r\n<br>\r\nBlake was still with his eyes closed when he felt a finger push him on his stomach <br>\r\n<br>\r\n-\"Hey lazy bug! Time to worship me!!\"- Cinthya got tired of waiting Blake unconsciousness, and after putting him on her palm, she said with an evil smile <br>\r\n<br>\r\n-\"Guess what task have I for you now?\"- Blake thought, like he was talking to his girlfriend 'Joana...What are you doing!! Come here and smack this bitch's face'  <br>\r\n<br>\r\n-\"argh...I can't save myself...dammit...What now?\"- Blake sighed and asked to his \"master\"...</span></div></div>",
            "created":1229230800,
            "id":619857,
            "title":"Continue."
        },
        "111212211111111112112111112":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana decides to rush in and save Blake right now... ",
                "She decides to plan a smarter way to get him back..."
            ],
            "content":"<div class=\"\"><div> <span>Joana got very angry and said to herself how could she be fooled by that bitch like that...and what would she be doing to Blake right now... -\"I have to do something...but what?\"- Joana was thinking up something... Though her anger was blocking some ideas, she just couldn't hang on the fact she practically gifted him to Cinthya... -\"That Cinthya...When I get back Blake I'm gonna kill her with my own hands...\"-<br>\r\n<br>\r\nAs it was said in the previous chapter, what would happen next?<br>\r\n<br>\r\n(NOTE: Despite the Choice 2 is the one which girls use the most, and Joana would, we should remember about Joana's protectiveness. Read the storyline where Blake fights a strange boy named Blaze...there is told a story about how Joana protected Blake in an amazing way...[Wanna know?, read it...] And this is why I'm giving those two choices)</span></div></div>",
            "created":1229230800,
            "id":643855,
            "title":"Joana decides to do something..."
        },
        "1112122111111111121121111122":{
            "choices":[
                "It was Friday Morning",
                "It was Monday Morning"
            ],
            "content":"<div class=\"\"><div> <span>Joana thinks...what if i snuck in at night (6 hours later) Cynthia is sleeping and Joana has no idea where he is so she checks EVERYWHERE and evantually find him but by 3:00AM AT 6:00AM they get back to Joana's house Joana was so tired she missed that day of school the next morning...</span></div></div>",
            "created":1285218000,
            "id":961838,
            "title":"She decides to plan a smarter way to get him ba..."
        },
        "11121221111111111211211111221":{
            "choices":[
                "They went Home.",
                "They went to the movies"
            ],
            "content":"<div class=\"\"><div> <span>On friday morning (today blake stayed home from school) Joana went to school and Cynthia Fought with Joana.(CATFIGHT!)Joana beat Cynthia with a smack in the face with a yardstick Cynthia spent the whole weekend in the hospital. (sorry i mention it now but Blake woke up after Joana was gone)When Joana go Blake told her thank you for rescuing and Joana kissed him on the cheek.That day they went to burger king and obviously Blake only ate like less than an ounce of bread.</span></div></div>",
            "created":1285218000,
            "id":961840,
            "title":"It was Friday Morning"
        },
        "111212211111111112112111112212":{
            "choices":[
                "Fell in a Bra",
                "Fell in Panties"
            ],
            "content":"<div class=\"\"><div> <span>Then Blake went to the movies with Joana Blake got in free because he was unnoticable when they were done at the movies Went back home and went to sleep. You probably already know where Blake sleeps...(if you READ all he chapters till now and not skipped them) When they woke up it was saturday morning.(Best morning for teenagers ever!) When blake woke up he accidentally rolled over into one of Joana's open undergarment drawer.(Joana unaware becuz she was sleeping)</span></div></div>",
            "created":1285218000,
            "id":961842,
            "title":"They went to the movies"
        },
        "1112122111111111121121111122121":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He fell in and didint even notice he thought he was stilll in bed cuz it was the same color soooooooo Joana put it on and didint feel blake so It eventually became so tight Blake was once again squashed!</span></div></span></div>",
            "created":1285218000,
            "id":961845,
            "title":"Fell in a Bra"
        },
        "1112122111111111121121111122122":{
            "choices":[
                "A contest to stay up all day and night",
                "A party"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He fell in Joana put them on BUT Joana felt him and took him out and said how did you get in there. Blake said I donno I woke up there. So then Joana finished getting Dressed Then went to go do Saturday stuff like...</span></div></span></div>",
            "created":1285218000,
            "id":961846,
            "title":"Fell in Panties"
        },
        "11121221111111111211211111221221":{
            "choices":[
                "SO they spent the weekend having fun"
            ],
            "content":"<div class=\"\"><div> <span>So then they started after Breakfast.They agreed on the rules:<br>\r\n1.No Coffee<br>\r\n2.No breaks(Bathroom breaks only Dinner and lunch breaks too)<br>\r\n3.No watching TV<br>\r\n4.No Entairtainment<br>\r\n5.No doing really anything hat would keep you awake<br>\r\n6.Total silence<br>\r\nBEGIN(18 hours later)                                       <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n                                                                       <font class=\"size5\" style=\"\">BLAKE WINS!!</font><br>\r\n</span></div></div>",
            "created":1285218000,
            "id":961847,
            "title":"A contest to stay up all day and night"
        },
        "111212211111111112112112":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Goes with Karina and Lillian(?) for help...",
                "Gets angry and goes with Cinthya to get his boyfriend back..."
            ],
            "content":"<div class=\"\"><div> <span>After some minutes, when Cinthya got away, she talked to Blake -\"Sorry for leaving you alone Blake, but no one knows about you in here\"- There was no answer from the purse, Joana thought he may be sleeping and called him with a soft voice -\"Blake? Are you ok, right?\"- There was still no answer...-\"Blake, please just answer me\"- As you can expect, there was no answer since Blake wasn't in there, she decided to pick him up carefully, and, digging with her fingers in the purse, she didn't find him, and after checking the whole purse, she was beginning to get in panic, and said -\"Blake, this is not fun\"- And, seeing that she was talking alone, she became in super panic, and she even checked near places, and the floor, Blake couldn't have gotten that far, and...he wouldn't be such stupid to go to the floor or seats to get crushed...<br>\r\n<br>\r\nJoana was now very afraid and then, remembering what happened, she analyzed slowly and got it...Why would Cinthya give her a Mountain Dew, knowing its effect...She slapped her forehead and then she thought to herself 'How could I be so stupid to let Cinthya fool me like that? Why did I trust on the girl who wanted my boy for herself? Dammit, Blake must be suffering right now...' Then, trying to not cry, she...</span></div></div>",
            "created":1226379600,
            "id":606826,
            "title":"Stay with Joana."
        },
        "111212211111112":{
            "author_id":"supe",
            "author_name":"Guychief",
            "choices":[
                "It's a sucess!",
                "Too much power! "
            ],
            "content":"<div class=\"\"><div> <span>It's been an hour, and nothing happened. \"Blake? Are you OK?\" Joana asked.<br>\r\nBlake was asleep.<br>\r\n\"Blake wake up!\" Joana said loudly.<br>\r\n\"Huh? Wha? What?\" He said with a startle.<br>\r\n\"Don't do that! I thought you were gone.\" Joana said with trembling tone.<br>\r\n\"Hmm...nothing\" Karina said.<br>\r\n\"There has to be something!\" Joana yelled with tears in her eyes.<br>\r\n\"Umm...may I?\" Blake said.<br>\r\nBoth of them looked at him.<br>\r\n\"Umm, what if you just add a little more power to the machine?\" Blake asked<br>\r\n\"But too much power might kill you!\" Joana said<br>\r\n\"But too little power does nothing.\" Karina countered.<br>\r\nJoana said nothing.<br>\r\n\"OK, if you can add more power to it, I'm ready!\" Blake said<br>\r\n\"OK\" Karina replied<br>\r\nShe adds more power to the machine, what happens?</span></div></div>",
            "created":1238389200,
            "id":668863,
            "title":"It didn't work??!! Damn!! And...what happen..."
        },
        "1112122111111122":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "She falls on Blake",
                "She regains ballance"
            ],
            "content":"<div class=\"\"><div> <span>Blake heard the gears in the machine slowly grind into place. He felt the vibrations of the little machines power course through his veins. Blake let out a small smile as he felt his bones and blood slide into place once more, harder and better then before. The electricity started to try to escape from the wires like it was alive and Blake could hear the panic in his friends voices.<br>\r\n\"What's wrong?\" Blake asked, a second later his eyes shot open. His mouth quivered slightly before letting out a scream. His pupils vanished behind a strange mist and his body began to glow.<br>\r\n<br>\r\n\"Turn it off!\" Joanna yelled. She ran through the waving wires of the machine and kicked away the plug. They watched in disbelief,<br>\r\n\"Impossible! It has no power!\" Karina yelled, stepping away from the evil machine.<br>\r\n<br>\r\nBlake screamed louder as he watched his sice explode in a beam of light. The light beams began to shater his very existence as he watched in horror.<br>\r\n\"No! It can't end! Not like this!\" Blake yelled, clenching his fist as a wave of fire fell over him.<br>\r\n<br>\r\n\"Blake!\" Joanna and Karina yelled as they fell across the room from the explosion. Joanna slowly opened her tear filled eyes. Her heart rate slowed, time seemed to stop. <br>\r\n\"Blake!\" she yelled, but her voice seemed muffled to her. A tear fell down her cheek as the sprinklers came on. Hr brain smashed its self onto her skull, trying to get out. <br>\r\n\"Please.. no\" She muttered, stumbling towards the destroyed machine.<br>\r\n<br>\r\nBlake looked at the ocean, a smile on his face. He gently kicked a wave as Lith sat next to him.<br>\r\n\"Blake... Joanna still needs you...\" lith spoke in unearthly tones. Her clothes were made out of leafs and her hair was naturally green. She smiled, none of the sand around her seemed to want to cling to her bare feet like they did to Blake.<br>\r\n\"I know..\" Blake said, watching the water rise and fall, <br>\r\n\"Lith... is this death?\" Blake asked, looking towards the girl. He felt like he knew her all his life. She smiled, \"No, death is much darker then here. This is limbo, where your fate is decided.\"<br>\r\n<br>\r\nSilence moved the clock forward.<br>\r\n<br>\r\n\"Lith...\" Blake questioned, before Lith read his mind with a smile, <br>\r\n\"Why is limbo a island with a forest and trees, without any others? There are places for different people, evil people who has done murder would be in a house filled with people who have the same guilt in their hearts. Good people that are pure of heart go to a clouded place with a golden gate.\" Lith smiled, <br>\r\n\"Yet we are alone, because we are different Blake. You will find it out later.\" Blake looked at the girl, questions bubbled in his eyes.<br>\r\n\"Wait! Lith! Why am I different? Lith!\" Blake yelled, getting up. He fell to the ground. He looked at his foot, then at the shifting sand. His eyes shifted towards Lith.<br>\r\n\"Bye Blake.\" Lith said with a smile. She watched Blake get dragged under the ocean of sand. A smile spread onto her gentile lips as she turned and walked into the Jungle before her.<br>\r\n<br>\r\n\"Joana!\" Blake yelled, opening his eyes. He groaned slightly as he saw Joana slowly wobble towards him. \"Oh crap...\" Blake muttered as she stumbled forward.</span></div></div>",
            "created":1238821200,
            "id":670726,
            "title":"Limbo"
        },
        "11121221111111221":{
            "author_id":"supe",
            "author_name":"Guychief",
            "choices":[
                "Joana",
                "Karina"
            ],
            "content":"<div class=\"\"><div> <span>She falls right on top of him...<br>\r\n____________________________________________________________________________ _____<br>\r\n\"GAH\"! Blake yelled out, sitting up from a normal sized bed.<br>\r\nHe looked around, everything was normal.<br>\r\n\"I-It was...a dream?\" he said to himself, breathing heavily. <br>\r\nThen he felt the ground shake, he panicked.<br>\r\nHe jumped out of the bed to look out the window, and sees a giant eye looking through it.<br>\r\n\"Holy sh--\" he yelled falling backwards<br>\r\n\"Blake! You're okay!\" said a female voice.<br>\r\nThe eye moved back, and the roof came off  revealing...</span></div></div>",
            "created":1239426000,
            "id":674367,
            "title":"She falls on Blake"
        },
        "111212212":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "Blake is invincible! But... ironed onto Karina's butt...",
                "Blake is fixing himself on the chair..."
            ],
            "content":"<div class=\"\"><div> <span>Joana looks up. She shrugged her shoulders and went to open the door,<br>\r\n\"Hello! Don't think you got away that easily!\" Said a mysterious voice. <br>\r\n\"What now?\" Blake muttered, his broken arms and legs started to fix themselves, Blake smiled \"nice side effect\" His smile vanished as a black thong flew overhead...<br>\r\n<br>\r\nKarina had almost forgot the sleep over. She threw on a mini skirt and a tank top and sprinted for Joana's house.<br>\r\n\"Hello! Don't think you can get away that easy!\" She said cheerfully and Joana offered her a seat. Karina jumped over the seat and landed heavily. Her feet dangled over the arm of the chair and her back rested on the other arm. Something felt warm and squishy under her right buttock but she ignored it, instead she just wiggled her butt into a more comfortable position. <br>\r\n\"So.. what do you want to do?\" She asked, not knowing she was sitting on Blake. <br>\r\n\"Uh... do you want to play truth or dare?\" Karina nodded her head and she slid onto the floor, They had both heard voices... the guests had arrived.</span></div></div>",
            "created":1223701200,
            "id":594071,
            "title":"Someone enters..."
        },
        "1112122121":{
            "author_id":"zero323",
            "author_name":"zerothegodslayer",
            "choices":[
                "yes he managed to dodge and jump on type for a ride down stairs.",
                "no he is stepped on my joanas pink and white socks. ( brand new or used? )"
            ],
            "content":"<div class=\"\"><div> <span>Karina slide of the chair and onto the floor but took Blake with her. Her butt slamed on to the floor breaking Blake's arms and legs. \"Hey how about we watch a movie instead of play truth or dare?\" Said karina. \"Ok, I will go get some drinks and popcorn\" said joana. \" I will be right back need to go.\" Said karina as she gets up. Blake's moves with her still stuck to her mini skirted ass.when ever her ass moved he did. His body was in the worst pain of his life. It felt like he got ran over 20 times over.<br>\r\n<br>\r\nKarina walks up stairs and to the bathroom. On her way Blake in stuck from her ass and fell to the floor.he waits the time he need to regen his bones and he is good as new. He starts to walk back down stairs when tremors start up. He looks around to find out joana was coming up stairs to her door to get something. <br>\r\n<br>\r\nHer foot falls get closer and closer as her pink and white striped socks draw near. Blake moves out of the way in time now to be stepped on. The karibe walks out the bathroom and starts to walk back down.Blake manages to dodge her full white socks. He watched her walk back down but joana starts walking back to. Blake looks back to see joanas pink and white socks come close and one is right above him.<br>\r\n<br>\r\nDid he dodge in time? </span></div></div>",
            "created":1442085300,
            "id":2033396,
            "title":"lifes a pain when shrunk."
        },
        "1112122122":{
            "choices":[
                "Karina accidentally sits on him again...",
                "He heads over to Joana..."
            ],
            "content":"<div class=\"\"><div> <span>As Katrina slid off the chair, Blake managed to catch hold to the edge of the cushion and with effort, pulled himself up. He lay there for a bit and waited for the healing to begin. <br>\r\nThe whole process took about 3 seconds.<br>\r\nHe got up and was about to climb down, when Karina rested her hand on the couch. <br>\r\nBlake slid off the cushion and landed next to Karina's bum, dazed from the fall. <br>\r\n<br>\r\nWhat happens?</span></div></div>",
            "created":1249880400,
            "id":742481,
            "title":"Blake is fixing himself on the chair."
        },
        "112":{
            "choices":[
                "to victoria secret ",
                "in her bra "
            ],
            "content":"<div class=\"\"><div> <span>When you get there you sneak up on joana and spank her in her dark blue very tight jeans. she screams turns and gigles knowing its you. then when you two are walking around the mall you stop at arbys. joana asks if you can get her something and you do.when you gone joana spots an open vender thats not being watched. she wlks up and the sign says amazing shrink rays. joana takes one and when you come back she points it at you as a prank for spanking her and shrinks you to about 4 inches. you are scared and somewhat horney from the feeling of joana sweet lotioned vanilla scented hands grasping your body and rubbing your groin. then she says \"so honey where do you want to go\"</span></div></div>",
            "created":1236661200,
            "id":658986,
            "title":"He's meeting Joana at the mall..."
        },
        "113":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "She wanders away looking for Blake",
                "She puts the Book in her bag"
            ],
            "content":"<div class=\"\"><div> <span>Blakes foot fell on the cold ground as he gazed out towards the narrow corridor. His heart thudded in his mouth as a bead of sweat fell from his nose. The clock ticked over the seconds as he stood still, letting the blur of people shuffle past as he picked out faces.<br>\r\n<br>\r\nHe smiled as his heart skipped it's rythem and began again. A word floated over his mout as his eye's slowly became soft.<br>\r\n\"Joana...\" He muttered, watching his girlfriend float threw the croud.<br>\r\n<br>\r\nHer hair flickered in an invisable wind as her hazle eyes slowly fell over him with a clear gaze.<br>\r\n<br>\r\nBoth wore the hearts of lovers.<br>\r\n<br>\r\n\"Hey Joana\" Blake spoke, his shoulder hit the wall. Joana parted her moist lips with a smile as she let out her greeting to the world. A smile stayed on both their faces as they swiftly exited the busy corridor, into the dark wooden door of the library.<br>\r\n<br>\r\nThe silence hit them like bricks as she door sealed them in.<br>\r\n\"I hate history...\" Blake murmered, as he stepped into the armada of shelves. Joana went the otherside.<br>\r\n\"Yeah well, we still need to do it\" She spoke threw the barriour of books.<br>\r\n\"But who cares about some king that did something sometime in some place?\" As blake spoke, a book fell out of place and Joana poked her eye out,<br>\r\n\"Wow, you really need to study\" She spoke happily as the book slid back. A loud hiss slithered from the old librarion as she snaked her eye line to them,<br>\r\n\"This is a library...\" Her words slipped away from her as she gazed back at her book.<br>\r\n<br>\r\nA sigh fell over Blakes mouth as he gazed at the army of writing.<br>\r\n<br>\r\nA dark figure smerked in the backround as a flash of a blade imerged. His hood floated in the wind as the boy wandered over to blake as he stood, surrounded my books. His eye's locked onto Blakes as he blocked his exit.<br>\r\n\"Hi Blake\" The boy spoke with a smile under his discise, \"I'm Blaze\" The blade flashed out, showing it to be a needle. Before Blake could react the needle had pierced his skin.<br>\r\n<br>\r\nBlakes world flowed in with darkness.<br>\r\n<br>\r\n\"Hey Blake...\" Joana spoke, going to where blake once was. A figure slipped past her gaze as she walked in. \"I found a book that... oh...?\" Her eyes scanned the room, unsure where he was as her hand reached down for a fallen book. She smiled as she picked it up, \"Oh, handy!\" She spoke softly, spinning towards the check out desk.<br>\r\n<br>\r\nBlake creaked open his eyes as his hand slid over the shaking ground. His eye's shook with the world as he felt the ground jutter and stop.<br>\r\n\"Where am I?\" He muttered, standing up, \"Joana!?\" His eyes darted over the leathery ground as his hands found fists.<br>\r\n<br>\r\nHis eyes shattered as he gazed up at his huge girlfriend. \"What the...\" He muttered, as she flew towards him, \"Wait!\" His crys vanished under her cloth.<br>\r\n<br>\r\nJoana pressed her leather book against her chest as she stepped slowly away from the counter, <br>\r\n\"Thank you!\" She said with a smile as she hugged the book close to her. \"Blake? Come on, I found the perfect book! It cover's the whole subject!<br>\r\n<br>\r\nYet Blake couldn't even cry out as he was crushed against book and chest.</span></div></div>",
            "created":1249794000,
            "id":741705,
            "title":"Slam"
        },
        "1131":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Sighs and decides to do the work alone, opens the book and, surprise!!",
                "She goes by where he was pierced and sees little drops of blood on the floor..."
            ],
            "content":"<div class=\"\"><div> <span>Joana began to walk around looking for Blake <br>\r\n-'I know he doesn't need to study much at all but he always was willing to help me'- she thought while hugging the book. Meanwhile, Blake tried to push his girlfriend's breast flesh away to take a breath, <br>\r\n'Damn...this would be good if I wasn't this small' he thought and didn't succeed <br>\r\n'Well, at least it's my girlfriend and this is soft' Blake tried to relief himself while thinking, he couldn't even talk or sigh.<br>\r\n<br>\r\nJoana whispered softly <br>\r\n-\"Blake...Blake...what are you doing? where are you?\"- After some moments she  said <br>\r\n-\"I got the perfect book to complete the job\"- She didn't really expect that to make him come out but at least she thought she should try. After a while, she...</span></div></div>",
            "created":1249794000,
            "id":741722,
            "title":"She wanders away looking for Blake"
        },
        "11311":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "She finishes and takes Blake to her house...",
                "Someone comes in..."
            ],
            "content":"<div class=\"\"><div> <span>Joana sighed, though it was weird that her boyfriend just ran away<br>\r\n<br>\r\n'Maybe he had something else to do...he should have told me...' She sat on her chair and put the book on the table, she noticed a small thing on it, she was going to swat if thinking it was a bug, but it looked weird. She moved her hand toward it carefully, and noticed that it didn't move, she grabbed it and brought it near her face.<br>\r\n<br>\r\nIt seemed to be a little toy...shaped as a guy, she looked at it a bit closer<br>\r\n<br>\r\n-\"This toy is dressed like Blake...creepy...One minute...\"- Joana had a crazy idea, and dialed Blake's phone number while holsing the \"toy\". She heard faintly Blake's ringtone (Nightmare - The World, if you ask), and noticed a small light in the toy's shirt. She put down the call, and gasped, she whispered near to the supposed toy<br>\r\n<br>\r\n-\"Blake...is that you?\"- the little boy began to move, like waking up, and jumped back when looked at Joana, luckily, she caught him with her other hand<br>\r\n<br>\r\n-\"Don't worry. I'll take care of you, but first I need to do the homework...</span></div></div>",
            "created":1266037200,
            "id":835451,
            "title":"Sighs and decides to do the work alone, opens t..."
        },
        "12":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "In school...",
                "They were on a date as always after the school...",
                "Joana's house...",
                "Transported to a dimension where women are huge?!...",
                "Reader's Choice..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well where will the growth be? (max size 80 meters, preferably senses sharpened in order to not kill Blake accidentally so easily)</span></div></span></div>",
            "created":1224392400,
            "id":597396,
            "title":"Joana grows..."
        },
        "122":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "A Joana's breast...",
                "Joana's ass...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Joana and Blake were on a date as they always did after school. They went to a forest to spend the day together and to watch the sunset. They were enjoying this time and Joana was resting on Blake's chest, they both were sitting under the shadow of a very big tree. But suddenly, Blake had a bad feeling and looked around -\"What's going on, sweetheart?\"-   asked Joana, which Blake answered -\"I don't know, but I've got a bad feeling about this place, it's like someone's following and watching us...\"- -\"Uh?\"- Joana was disconcerted and Blake stood up -\"Let's go to somewhere else. I really don't like this place\"- -\"Umm...ok\"- Joana knew that Blake's senses were sharpened since he grew up fighting and he was accustomed to know when something was going bad. Then, they got up and something stang them -\"Ouch!!\"- Joana yelled, a dart hit her on her shoulder, Blake just remained silent as he felt the stinging also. Blake said desperately -\"I knew it!! Joana we need to get to the hospital, something or someone's attacking us!!\"- They ran but Joana wasn't able to even get up and screamed -\"Blake!! I can't walk!!\"- He returned inmediately and said -\"It's ok, don't worry Joana\"- as he lifted her up and carried her in his arms, Blake walked for about 2 minutes and then felt weak, and fell down, Joana remained on him and they both got unconscious...<br>\r\n<br>\r\nBlake woke up first (he was more resistant due to his physical condition) and could hardly move, he was under a gigantic and soft objet, which was strange 'What the heck am I under?! A rock' he thought, but after feeling its warm he undestrod that there are no warm rocks, so, he was under an unknown something. After some minutes, he took off the dart over his arm and took a look, he started to read it:<br>\r\n<br>\r\n\"EXPERIMENTAL SUBSTANCE H5000N1GH784591<br>\r\nTOP SECRET, GOVERN PROJECT: SUPER SOLDIER PROGRAM<br>\r\nEFFECTS: THIS SUBSTANCE IS STILL IN TESTINGS BUT THESE ARE THE DISCOVERED EFFECTS:<br>\r\nMALES: IT MAY GO FROM NOTHING TO MAKE THEM STRONGER, HOW MUCH? UNKNOWN YET...<br>\r\nFEMALES: UNKNOWN...NOT TESTED YET...<br>\r\n<br>\r\nThis substance is being used on volunteer sobjects to proof its effects, it has been working on strong men who excercise or practice martial arts, in other ones it causes nothing, but on everyone it causes temporary unconsciousness...\"<br>\r\n<br>\r\n-\"DAMN IT!!! Someone used me and Joana as guinea pigs!!! I'll kill him when I got out from under this thing!!!\"- Said Blake, then, he managed to get out from benneath the giant soft object just so see that it was...<br>\r\n<br>\r\n(By the way Joana is sleeping at this moment, unknowing her new size)</span></div></div>",
            "created":1224392400,
            "id":597437,
            "title":"They were on a date as always after the school..."
        },
        "1221":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Instinctively runs away but her hand is a lot faster than him...",
                "He decides to stay, trusting on her...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Blake fell by the impression when he saw that Joana was huge or rather he shrank...then he looked around, everything except her was normal sized, so, he concluded that she was the one who grew. When he got out from under his girlfriend's gigantic breast, she moaned slightly, as if she liked feeling something moving under her boob. Then she woke up slowly, she was still feeling strange as she looked quickly around and noticed that everything seemed to be tiny...she looked down and Blake was there.<br>\r\n<br>\r\nHe saw how Joana opened her eyes and when he realized that she was looking at him...</span></div></div>",
            "created":1224565200,
            "id":598292,
            "title":"A Joana's breast..."
        },
        "12211":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Blake said they needed to go to an hospital...",
                "Joana begins to like her new size and wants to play with Blake..."
            ],
            "content":"<div class=\"\"><div> <span>(Sorry, there was an error and I don't know why this appeared in this story, it's another one, here's the true chapter)<br>\r\n<br>\r\nBlake instinctively ran away thinking that Joana probably would not be aware of her new size and that Blake now would look tiny to ker (like EVERYTHING around). Blake dodged her hand the first time but the second he was caught, and he tried to release with all his might. Joana, who was still some sleepy but having noticed that everything looked tiny and Blake, who she was grabbing in her hand, decided to calm him and said -\"Blake...don't be afraid...it's still me...\"- She brought him closer to her face, still in disbelief that everything shrank or rather she grew. Joana kissed Blake and caresse him softly with her index finger.<br>\r\n<br>\r\nBlake calmed down...he got that despite the size Joana didn't become a monster as everyone think about giants. And anyways, she has never done anything bad to him or even gotten angry to him, so, why should she get evil to him right now?. Blake was still thinking about all this while Joana was still caressing him softly, and then she said -\"I don't know why am I...this big...but Blake, I still love you and nothing will make that change\"- she gave him a very tight hug and then she sat him on her palm. Blake said that a strange substance made her that and he showed her the dart -\"I know you can't read it but...\"- Joana took it delicately with her fingers and read it. Blake stared at her for a moment and when she finished reading she asked -\"What?\"- -\"Umm...How could you read that? and how could you grab it without break it?\"- Joana then thought that at her new size she may even crush Blake without proposing it. Then she said -\"I don't know...The letters still looked normal to me...maybe a little smaller but they were readable. and maybe this size gave me control of my strenght\"- Blake stayed silent for a while. then...</span></div></div>",
            "created":1224565200,
            "id":599115,
            "title":"Instinctively runs away but her hand is a lot f..."
        },
        "122111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Blake had an answer...",
                "Joana decides for him..."
            ],
            "content":"<div class=\"\"><div> <span>Blake said -\"We need to get to a hospital, we need someone to check what's going on with us\"- 'Specially with you...' Blake thought but didn't say it because he didn't want to get crushed. Joana meditated for a moment, wanting to play a little with Blake at her new size but she regained control of her thoughts and nodded. Blake started to walk and he didn't even take two steps when Joana's gargantuan hand lifted him up and took him closer to her -\"Well,but I'll take you\"- Joana said playfully and placed him on her shoulder. Then she walked and Blake almost lost his grip since it was too difficult, fortunely for him, Joana caught him and then, after thinking for some seconds. Then she said -\"It's too dangerous for you to be on my shoulder, so, you better go on another part...of me, any suggestion?\"- Blake froze for a moment and then...</span></div></div>",
            "created":1225170000,
            "id":603604,
            "title":"Blake said they needed to go to an hospital..."
        },
        "1221112":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "She put him in between her breasts...",
                "Reader's Choice..."
            ],
            "content":"<div class=\"\"><div> <span>Blake thought for some moments and wans't able to answer anything, in fact, he was a little embarrased by the question, despite being a brave fighter, he was pretty shy to Joana most time (he isn't accustomed to some things like...to touch certain parts of her body...<br>\r\n<br>\r\nJoana asked him -\"Well where do you want to go sweetie?\"· Blake answered lowering his head -\"I...I don't have an..ermm...an answer...\"-It wasn't strange to Joana Blake acted like that, well, anyone would be accustomed to have a giantess as girlfriend that fast, so, Joana decided to be patient with him and picked him up -\"Aww, sweetie, don't be shy, I'll choose for you this time but next I want you to tell me what part of me you like the most\"...-She said as she giggled and hugged Blake, then...</span></div></div>",
            "created":1225688400,
            "id":606807,
            "title":"Joana decides for him..."
        },
        "12211121":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Karina, whose mother works on hospital and may have access to useful things...",
                "Rick, an old friend of his father who is a militar doctor and may help..."
            ],
            "content":"<div class=\"\"><div> <span>Joana placed her boyfriend in between her precious breasts, she thought it'd be a safe place for Blake, and began to walk, each step making the ground tremble, after less than five minutes, Blake slapped himself and said -\"But WHAT the hell was I thinking?\"- Then, he said -\"Joana, please, stop!\"- Joana inmediately heard and worried thinking that Blake was injured or something like that, she said sweetly -\"Huh? What's going on, baby?\"- -\"Joana...how could we get to a hospital with your size...I mean...you'll be noticed by everyone, and we'll get trouble, and...You may be bigger than the entire hospital, I think...\"- -\"Oh...well...I don't know what to do...\"- Joana felt some kind of sad when Blake said those words, she wasn't angry, but, she felt that Blake didn't see her as his girlfriend at her current size, and after all what they passed, It would be world's worst thing (for her) that Blake disliked her just for her size. She wouldn't let that happen, and while she was thinking that Blake may even be afraid of her, Blake said -\"I got it! I still have my cell phone...I'll call to...\"-</span></div></div>",
            "created":1226725200,
            "id":608255,
            "title":"She put him in between her breasts..."
        },
        "122111212":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "-\"Blake...do you still find me sexy at this size?\"-",
                "-\"Well let's play a game...\"- she said sensually"
            ],
            "content":"<div class=\"\"><div> <span>\"...Rick!! He surely will help us and has access to high technology\"- (PARENTHESES: Rick is a friend of James and the only one alive Blake knows, since Steven died years before that James EVEN was a full grown adult, he works as a military medical) Joana said -\"Are you sure?\"- -\"Well...he's the only one who may help us without making you noticeable and...he must know about the weird project we were victims of...\"- Blake (still in Joana's enormous breasts) called by his phone. Joana sighed and laid on her back, and closed her eyes...she was still thinking that Blake would probably not find her sexy at her actual size, and that saddened her a lot. She always wanted to be pretty for him, since 7th grade, when they met, she wore clothes that enhanced the beauty of her body, and also she tried subtly to seduce him by hugging him very tightly (she expected Blake felt her soft breasts and make him ask her out, but mostly didn't work, in fact, the feeling made Blake nervous to her) and softly rubbing herself against Blake while he was reading or studying, she always caressed him when he was unconscious by fighting and, she caressed his hair too, and since Blake's 13th birthday (When she gave him his characteristic silver dogtag with the name \"Blake\" in gold letters) when she kissed him (on cheek, Blake would still refuse to openly romantic stuff), and, many other things like those...<br>\r\n<br>\r\nBlake talked to Joana -\"Rick's coming, he'll be here in about an hour...\"- Blake noticed Joana was kind of annoyed/sad and didn't want to make her feel bad about herself, and. after gulping hard, he gained courage and said -\"Do you want to do something while we wait?\"- In that second he was about to slap his forehead because he sounded stupid or even pervert when his idea was to comfort his girlfriend. Joana, despite all, was happier when heard this, then, she said...</span></div></div>",
            "created":1226811600,
            "id":608676,
            "title":"Rick, an old friend of his father who is a mili..."
        },
        "1221112121":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "-\"Of course, Joana. You are always hot\"- (He said as blushed)",
                "-\"Ermm...well, at your current size I'm not sure...I mean...You're too big\"-"
            ],
            "content":"<div class=\"\"><div> <span>Joana asked -\"Blake...do you still find me sexy at this size?\"-. Blake thought about what would he answer, not wanting to hurt her feelings (He never would expect Joana crushed him on purpose by being angry), Joana saw Blake thinking and said -\"Blake? Am I still pretty for you?\"- -\"Huh?\"- Blake's thought were cut off and now he had to give an answer...</span></div></div>",
            "created":1227934800,
            "id":613270,
            "title":"-\"Blake...do you still find me sexy at this..."
        },
        "12211121211":{
            "author_id":"luigip",
            "author_name":"Luigi P.",
            "choices":[
                "\"Well, It can't hurt, I mean we're waiting...\"",
                "\"I don't know, Joana, maybe we should just be patient....\""
            ],
            "content":"<div class=\"\"><div> <span>\"Of course, Joana.\" Blake said. \"You will always be hot to me.\"<br>\r\n\"Blake, that's very sweet of you.\" Joana said. \"What do you want to do while we are waiting?\"<br>\r\n\"Hmmm...\" Blake said. \"I don't know...\"<br>\r\n\"I have plenty of ideas....\" Joana said, she was feeling kinda playful. \"I mean, it's going to being awhile before Rick shows up, and I don't want to sit and not do anything.\"<br>\r\n\"I understand that...\" Blake said. \"But what about people?<br>\r\n\"Forget about it, everything will be fine...\" Joana said, feeling even MORE playful.<br>\r\n<br>\r\nBlake thought.....</span></div></div>",
            "created":1228280400,
            "id":615145,
            "title":"Joana's getting that feeling...."
        },
        "124":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "The giantesses were predators and had men as slaves or pets (most slaves)...",
                "In that world the women were huge and men normal sized but still normal attitude",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>An evening Blake and Joana were spending time together as they do always, they walked around and arrived to the seawall, where they watched the sunset together as they huggen and kissed affectionately, they both were enjoying really this time until Blake felt something strange and said to Joana -\"Joana...Don't you feel something rght now?\"- Joana just nodded thinking that Blake was talking about their excitement, but when Blake saw her look, he corrected -\"Ermm...I don't mean THAT...I mean, I have a bad feeling\"- Joana now disconcerted and Blake continued -\"No one is around but I'm still feeling that something is wrong\"- -\"Oh, it's just your magination, sweetie\"- Joana said and hugged him, then, a thunder sounded and Joana hugged Blake tightly since that seemed to be too close, as she said -\"Maybe you're right Blake...but what is it?\"- -\"I don't know, but...What the?!\"- They both stared at ths sky which turned very strange, the sun was darkened as an eclipse and the sky turned dark blue with purplish tones, and the vlouds were the same as this...and it was lightning furiously, the thunders were even strange, they had a reddish tone instead blueish. -\"This can't be good\"- Joana said and when they got up a thunder fell down right in front of them, blinking them temporary by the light, and this way they werem's able to see a portal which formed from the shock and sucked them, Blake felt this and the last thing he did was holding his girlfriend's hand with all his might.<br>\r\n<br>\r\nThey remained unconscious for a while. Then Blake woke up -\"U...ugh..\"- He got up and felt strange since the ground was warm and soft, he stood up looking around -\"Wh-Where...where am I?\"- he muttered and then he shocked when remembered that he was alone 'Damn it! I'm alone?! What the hell happened!! Where is Joana...Oh no, something must have happened to her while I was out...Oh great Blake, you're an idiot even for this\"- And Joana's voice interrupted him softly -\"You aren't sweetie, and I'm fine, in fact, I've been taking care of you\"- -\"Huh? Joana? Where are y...\"- he turned around to see where was Joana and cut off himself when she saw a gigantic version of her looking and him, and in that moment he got that the ground was so soft and warm was because he was lying on her breast the whole time...<br>\r\n<br>\r\nJoana kissed him and picked him up -\"I don't know why am I this big but I won't let anything happen to you\"- she said as she kissed him several times affectionately. Blake felt himself strange since this would be the first time he needed someone's protection, he always fought his battles and protected his friends, but now he seemed to be the weak one. Then Joana got up and put Blake in her palm and walked around, until they got to a village-like place and after watching for some minutes they both realized that...</span></div></div>",
            "created":1224478800,
            "id":597822,
            "title":"Transported to a dimension where women are huge..."
        },
        "1242":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "choices":[
                "Blake wins; they get to stay in Tintoretto Leon.",
                "Blake loses; they go to Zebar.  Joana'll have her way with him...",
                "Blake loses; they go to Devoid.  This'll be interesting..."
            ],
            "content":"<div class=\"\"><div> <span>They saw a bunch of \"large\" women walking around the town, as well as some normal-sized men.  They came to the conclusion that, in this universe, men and women were just radically different sizes.<br>\r\n<br>\r\n\"Well, as long as we're here,\" said Joana, \"we may as well find somewhere to stay.\"<br>\r\n<br>\r\nBlake agreed to that plan.  Joana picked him up, put him on her shoulder, and started browsing the town.  They saw a building that said \"Hotel of the Town of Tintoretto Leon\" and walked in.  Upon entering, however, Joana realized something.  \"I don't have any money!\"<br>\r\n<br>\r\n\"You don't, eh?\" called a voice behind them.<br>\r\n<br>\r\nShe wheeled around, almost dropping Blake in the process.  She saw a man, smiling, holding a Mahjong board.<br>\r\n<br>\r\n\"I will play the boy in Mahjong.  If he win, I give you money.  If I win, you two leave town and go to one of other towns near here.  Bit different.  Got it?\"<br>\r\n<br>\r\n\"Well, we're no more at home here than anywhere else,\" figured Blake.  \"Sure, I'm in.\"<br>\r\n<br>\r\n(By the way, Zebar is a town where the females have legal possession of the males, and Devoid is a town where the males actually have legal possession of the females.  Don't ask, it's a strange country.)</span></div></div>",
            "created":1383541200,
            "id":1689612,
            "title":"Tintoretto Leon"
        },
        "12421":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "choices":[
                "They have some fun...",
                "Blake needs to use the bathroom - but..."
            ],
            "content":"<div class=\"\"><div> <span>\"Haha!\" exclaimed Blake.  \"That's 24 to 16!  I win!\"<br>\r\n<br>\r\n\"Very well,\" replied the stranger.  \"Here is some money.\"<br>\r\n<br>\r\nHe handed them a sack of money.<br>\r\n<br>\r\n\"By the way, my name's Georgio.  Here's my number, in case you need me.\"\"<br>\r\n<br>\r\nHe handed them a slip of paper.<br>\r\n<br>\r\n\"You may need me very soon...\"<br>\r\n<br>\r\nWith that he disappeared.<br>\r\n<br>\r\nBlake picked up the money and the paper and Joana picked up Blake and put him back on her shoulder.  She then walked over to the counter and bought a room for the two of them - one night's rent for now, they would decide what else to do later.<br>\r\n<br>\r\nThey walked up to the room (the hallways were gigantic).  There was one very large bed and one normal-sized bed.  There was also a TV and two bathrooms.  A room service card was on a table.  Joana and Blake then realized their next problem - what to do next.</span></div></div>",
            "created":1383620520,
            "id":1689614,
            "title":"Hotel of the Town of Tintoretto Leon"
        },
        "124212":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "choices":[
                "...call a plumber (and have some fun in the meantime)",
                "...use her mouth"
            ],
            "content":"<div class=\"\"><div> <span>\"I need to use the bathroom,\" said Blake.<br>\r\n<br>\r\nHe went into the bathroom and opened up the toilet lid.  However, he noticed a problem - the toilet was  dry.  Absolutely no water was in the bowl.  He exited the bathroom and told Joana the problem.  Joana responded by telling Blake to...</span></div></div>",
            "created":1383620700,
            "id":1689617,
            "title":"Bathroom"
        },
        "1242122":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "choices":[
                "was digested.  The end.",
                "was somehow immune to digestion."
            ],
            "content":"<div class=\"\"><div> <span>\"That's okay,\" replied Joana.  \"Just use my mouth as a toilet.\"<br>\r\n<br>\r\n\"Are you sure?\" asked Blake, unsure of it himself.<br>\r\n<br>\r\n\"Of course I'm not!\"  exclaimed Joana.  \"This is a new universe, for crying out loud!  Let's just try it!\"<br>\r\n<br>\r\nJoana lay down on her bed, her mouth open.  Blake uneasily climbed up onto her face.  He took off his pants, stepped in her mouth, and relieved himself.  The taste disgusted Joana, and she resisted the urge to puke.  Blake then climbed out of her mouth so that Joana could swallow.  To assist herself, she sat up; however, this caused Blake to fall into her mouth just as she swallowed his stuff.  Horrified, she tried to gag him up, but to no avail.  Meanwhile Blake</span></div></div>",
            "created":1383621000,
            "id":1689621,
            "title":"Giantess Toilet"
        },
        "12421221":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "content":"<div class=\"\"><div> <span>Blake was digested by Joana's stomach acid.  His nutrients ... you know.  Joana was overcome with grief at his death.  She stayed in that hotel for five days and finally called Georgio.<br>\r\n<br>\r\n\"It is over,\" he lamented.  \"He was the only one who might have saved us.\"<br>\r\n<br>\r\n\"What do you mean?\" asked Joana.<br>\r\n<br>\r\n\"He was necessary to defeat a dragon who resides in this land.  Without that, the dragon will create a portal that will rip this world apart.  Now that he is dead, nobody can ever defeat the dragon.\"<br>\r\n<br>\r\nGeorgio was right.  In five minutes' time, no less, the world was ripped to shreds.<br>\r\n<br>\r\nAll because the plumbing was out.</span></div></div>",
            "created":1383621180,
            "id":1689624,
            "title":"Accidental snack!"
        },
        "12422":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "choices":[
                "...in her panties.",
                "...in her bra (not secure enough)."
            ],
            "content":"<div class=\"\"><div> <span>\"You lose,\" said the stranger.  \"You are not who I thought you were.\"<br>\r\n<br>\r\n\"Who did you think I was?\" asked Blake.<br>\r\n<br>\r\n\"Someone else,\" replied the stranger ominously.  \"You were destroyed by a score of seven to thirty-three.  I think you would do well to travel with your girlfriend to Zebar.\"<br>\r\n<br>\r\n\"What's Zebar?\" asked Joana.<br>\r\n<br>\r\n\"It's a town to the north.  It's a special provincial district, so certain rules are ... different there.  I think your girlfriend will enjoy it more than you will.\"<br>\r\n<br>\r\n\"Yes, but what's Zebar?\" Joana pressed.<br>\r\n<br>\r\n\"It's the only town in the region where the men are owned by the women.\"<br>\r\n<br>\r\n\"But I though they were equals!\" exclaimed Blake in disbelief.<br>\r\n<br>\r\n\"Aye, they are,\" replied the stranger.  \"But in certain regions, people demanded different laws.  I do not understand why, but in that town, the women were posited as superiors.  Anything a woman says, her man must do.  Every man who walks in there is a slave to the woman or women he is with; if he has none, he will be sold at a marked.  He can only be freed if his mistress frees him.  Any command she gives goes.\"<br>\r\n<br>\r\nJoana and Blake walked to the town and saw that it was completely different.  They could hardly see any men at all, although squirming could be seen in some women's garments.  A house designed for a single woman had a sign that said, \"To the one named Joana.\"  As soon as Joana touched the sign, a key appeared in her hand.  Confused, she walked into the house.<br>\r\n<br>\r\nIt was well-furnished in the style Joana would have furnished a house.  The paint on the wall looked freshly applied, and Joana felt like it had been designed specifically for her.  Blake, however, was uncertain as to his fate and did not like the prospects; although he trusted that Joana would do nothing to hurt him, he didn't like the look of the town.<br>\r\n<br>\r\nLooking in the kitchen, Joana realized that there was absolutely no food, so she took some money from a table in the kitchen and set out to buy some.  However, she didn't want anything to happen to Blake, so she put him...<br>\r\n<br>\r\n</span></div></div>",
            "created":1383622200,
            "id":1689636,
            "title":"Zebar"
        },
        "12423":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "choices":[
                "Have her massage you with her tongue and breasts.",
                "Smother yourself in anti-digestion cream and have her eat you."
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm,\" said the stranger.  \"You lost, but not by much.  19 to 21.  Close, but I'll need to test your integrity.  I'm going to sent you and your girlfriend - if that's what she is - to Devoid.  The laws are a little different in Devoid; all the females are slaves to the males.  It may seem strange for a giantess to be a slave, but stranger things have been known to happen.  Depending on what happens, you may see me again.  My name's Georgio, by the way.  Oh, and to get to Devoid, just head south.\"  With that he left.<br>\r\n<br>\r\nJoana put you on her head.<br>\r\n<br>\r\n\"If we're going to do this,\" you say, \"we may as well do it right.  If you're going to be my slave, I can at least pretend like you're actually my slave.\"<br>\r\n<br>\r\n\"I'm not sure,\" said Joana.  Secretly, though, she liked the idea of being your slave, if a protective one.<br>\r\n<br>\r\n\"Onward!\" you shout, pulling her hair.  Obediently, she runs off into the south to the city of Devoid.<br>\r\n<br>\r\nWhen you reach the city, you have her put you down.  You walk about, noticing that most of the facilities are designed for people your size with some buildings having areas like garages or pastures for \"parking\" women.  You see a house with a sign that says, \"For the one named Blake.\"  When you touch it, a key appears in your hand - and it fits the door.  This house must be made for you.  You enter the house, and Joana goes to the pasture in the back.<br>\r\n<br>\r\nThe house is magnificent - and it's furnished just how you like it.  It is your dream house.  It has everything you could ever want.  Plus - as you realize giddily - you have a giantess slave whom you know is into you and will therefore do whatever you ask her to do.  Upon parousing the house, you find lots of money - and something called \"anti-digestion cream.\"  You decide to put off shopping until later and do something with your slave.</span></div></div>",
            "created":1383623100,
            "id":1689651,
            "title":"Devoid"
        },
        "124232":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "choices":[
                "It works!  Wait, why did you do that again?",
                "It doesn't work."
            ],
            "content":"<div class=\"\"><div> <span>You read the label of the Anti-digestion cream.  It says, \"Apply liberally all over nude body.  Effect lasts for twelve hours.  For best results, have slave apply cream and then swallow immediately.\"<br>\r\n<br>\r\nIntrigued, you walk outside.  \"Joana, could you please smother me in this cream?\" you ask.<br>\r\n<br>\r\n\"Why?\" she asks.<br>\r\n<br>\r\n\"Do it,\" you request.<br>\r\n<br>\r\nShe grudgingly accepts, covering your entire body with her cream-smeared hand and rubbing it to make sure you're completely covered.  She the puts you down.  You don't look very different, but you're glossy.<br>\r\n<br>\r\n\"What now?\" she asks.<br>\r\n<br>\r\n\"Eat me!\" you demand.<br>\r\n<br>\r\n\"What?\" she exclaims.  \"I would never do that!\"<br>\r\n<br>\r\n\"That cream is supposed to prevent me from being digested.\"<br>\r\n<br>\r\nObliging, she puts you in her mouth and swallows.<br>\r\n<br>\r\nBracing yourself, you hit her stomach acid.</span></div></div>",
            "created":1383623520,
            "id":1689663,
            "title":"Anti-Digestion Cream"
        },
        "1242322":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, that was a failure.  The cream was a dud.  You are digested, and a depressed Joana forgets to eat and starves to death.<br>\r\n<br>\r\n<br>\r\nThat was a mistake.</span></div></span></div>",
            "created":1383623580,
            "id":1689666,
            "title":"Fail.  Epic fail."
        },
        "13":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana came...",
                "Karina asked him to help her to study in the library...",
                "Cinthya came...?",
                "Ivan (a bully) appears...(Yeah, Blake's kicking asses time!!)",
                "Lillian comes..."
            ],
            "content":"<div class=\"\"><div> <span>Blake was at school as every day, it was about noon, and had very hard classes today (specially the ones about numbers, that he always hated), he had met with Joana in recess but like most of the time, he stayed alone for a while, it's not that he didn't love Joana but he's been always lonely, and his thoughts where interrupted when...</span></div></div>",
            "created":1222491600,
            "id":592772,
            "title":"Blake shrinks (other)..."
        },
        "134":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana comes...",
                "Karina comes...",
                "Blake doesn't worry for his wound for a while and then..."
            ],
            "content":"<div class=\"\"><div> <span>Blake was going to his locker when heard a known voice -\"Hey Blake, why does such a twerp like you have a beautiful girlfriend?\"- -\"It's none of your business, Ivan...\"- Blake was a good fighter but he never started a fight...<br>\r\n<br>\r\nIvan continued: -\"Well, then, give me you money!\"- -\"Do you want me to kick your ass again?\"- Blake answered, and then, there were no words, Ivan's fist came to Blake but he esaily dodged it...(By the way this guy, Ivan, is a really BIG guy, I mean, he's the typical 1.98 m muscle-tank stupid one) Blake's answer were two punches to Ivan's face,then a kick to his stomach and another to his face, sending him against the other side lockers...<br>\r\n<br>\r\nIvan, furious, saw a chemistry class' bottle with some sort of substance, he didin't think about it and quickly broke it and hit Blake on his left arm, Blake finished the fight with a KO punch to Ivan.<br>\r\n<br>\r\nBlake was bleeding but he always had wounds in fights, he walked toward his locker and then...</span></div></div>",
            "created":1222578000,
            "id":588417,
            "title":"Ivan (a bully) appears...(Yeah, Blake's kic..."
        },
        "1341":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "How did Joana and Blake meet?",
                "Blake shrinks...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Blake came to his locker and took his books with the right hand and before he could close the locker he heard Joana's voice -\"Blake, what happened to you?! Are you okay?!\"- -\"Yeah, I'm okay...\"- Blake answers, not wanting to worry his girlfriend -\"Y..your left arm is bleeding\"- -\"Don't worry, it was just a scratch\"- -\"A SCRATCH?\"- Joana sounded this time more worried and Blake was thinking in a way to calm her, but his thoughts were interrupted -\"That was a deep wound...\"- Blake was about to say something but Joana sighed and said -\"Will you stop fighting ever?\"- Blake could feel that Joana was very sad and quickly said -\"Well...I've fought my whole life but I'll stop if you want me to...\"- Joana seemed to feel better, after all, the only thing she wanted was that Blake didn't get hurt... but Blake continued: -\"But...you remember...we never have would been friends if it wasn't by that...\"- -\"Yes...I never could forget that day...\"-</span></div></div>",
            "created":1222578000,
            "id":610624,
            "title":"Joana comes..."
        },
        "13411":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Continue...",
                "Reader's Choice..."
            ],
            "content":"<div class=\"\"><div> <span>(Well for the ones who wanted to know about their past, here is the story):<br>\r\n<br>\r\nIt was 5 years ago (Yes, they both were 12 and 13 years old at that time, 7th grade). The first school day passed, everything was new, but Blake managed to survive to that, and the final bell rang. Almost everyone ran out of the school, but Blake remained in calm, he just thought how pathethic were those children, and he was calmly leaving when he saw a bully threatening a girl, holding her by the throat and was about hit her... Blake regained his memories and thought 'I just can't let this one to do that...'<br>\r\n<br>\r\nThen, when the bully was about to punch the poor girl was interrupted -\"Stop it, you coward!!\"- Blake said -\"Shut up, this is none of your business, Blake\"- -\"Let her go now...\"- -\"I won't, and...what are you going to do about it?\"- George answered -\"This!!\"- And saying this Blake hit him in the stomach, making him release the girl. Then the fight started.<br>\r\n<br>\r\nBlake was accustomed to fight those guys, in fact, he grew up fighting them, and this one wasn't a real threat, since he had fought stronger ones and this was just a jackass. Blake dodged esaily George's hits, and hit him 3 times in the head and a stomach kick to make him fall down. George was on ground and with his face bleeding -\"It's over, George, you know that you just can't fight me, so, stop annoying people or I won't spare you next time\"- Blake said finally -\"There won't be a next time!\"- George said and deployed a knife, quickly slashing Blake's right arm (he blocked it, the slash was going to his face). Blake just blew him in the face and fell down, knocked down finally.<br>\r\n<br>\r\nBlake was still calm and just took a pink backpack that George released before the fight started, and going toward the girl, only said -\"I think, this is yours\"- He said, a bit roughly, since he hadn't much friends and that was one of the very few times he helped other person (Almost always fought to defend himself), the girl took it and said -\"Thank you\"- And gave him a hug, Blake was surprised by this, he never had been hugged ever since he's got memory. And for a moment, forgot his wound's pain. Then he released himself from the hug and said -\"I have to go...\"- He started to walk when was interrupted -\"Hey, you're injured\"- -\"Don't worry about me, this happens all the time\"- -\"I can't let you go like that, after all, you saved me, and the least thing I could do would be to heal your wound\"- -\"What the...?!\"- He didin't even finished the pharse because she grabbed him by the left arm and took it to a tree that was nearby. -\"I'm serious, this isn't necessary\"- Blake replied, not accustomed to...being healed by someone...-\"Oh just stay here\"-  the girl said, while she took out a bandage and started to heal him, and put some alcohol on the wound, she stopped thinking that this had to hurt...and after some seconds, she asked:-\"Don't you feel pain?\"- -\"I'm accustomed to that\"- Blake answered. After some minutes, she was done with the bandage and said: -\"That's all\"- Blake could feel some sadness in her voice, but he couldn't understand anything about all this. He was leaving when he turned around and talked to her: -\"By the way...I'm Blake and...-\" Blake was trying to think something to say and he only could say -\"...be careful with those guys, they have no compassion with anyone\"- the girl came closer to him and gave him another hug -\"I'm Joana...\"-<br>\r\n<br>\r\nThis is how all started... </span></div></div>",
            "created":1222664400,
            "id":589001,
            "title":"How did Joana and Blake meet?"
        },
        "134111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Continue...",
                "Reader's Choice..."
            ],
            "content":"<div class=\"\"><div> <span>(The story continues)<br>\r\n<br>\r\nThe next day, they realized that they both were in the same group (classroom). Joana tried to be friendly to Blake but it was hard at first, he never had a friendship with a girl (in fact, she's the first girl he met). He almost always went alone, wandering in the school, getting into fights, his original lifestyle he had since ever. But Blake had noble feelings, many times, the guys he fought threatened to have their revenge on Joana and that forced him to go with her wherever she went only to protect her from those guys. Joana didn't know this for a while. She even started to think that Blake was a cold guy who hadn't any feeling. And a day that he was lonely, she decided to ask im about that: -\"Blake...why you...ehm...why are you so cold toward...me?\"- Blake was surprised by this question -\"Huh?...Really, I...I just don't know about treat people, I've been always lonely and I'm not accustomed to this, and...I'm sorry, I didn't want to hurt your feelings\"- Blake said, almost neutrally since he hadn't shown much emotions. Joana decided to talk with him about that and why he was this way. After some hours she discovered that Blake grew up in low streets and  his mother (father died) was a true demon who punished him for almost anything with cable hits. Joana felt heself like crying inside, she never had thought this was the past Blake had...<br>\r\n<br>\r\nShe was affectionate with him as possible, (even though he didn'tn like hugs very much at first), and after knowing this, she became even more affectionate to him, but Blake tried to understand her, and the girls' way to be friendly. The months passed and a lot of things happened, like this:<br>\r\n<br>\r\nA day, Joana was talking with Ayrton (Blake's secondary best friend, except by her) and in the talking Ayrton told her that Blake always had been protecting her from many guys who tried to get their revenge on her. She couldn't talk for a moment, and felt bad with herself because she thought that Blake never cared about her, and Ayrton continued -\"I don't know if Blake even knows the love but at least he always has been willing to receive the hits instead of you\"- Joana felt very happy, and thought 'Blake always has been noble with me and I didn't even noticed it...' Blake came (a bit wounded as always) and Joana didn't say anything and hugged him and Blake, surprised by this asked -\"Why was this?\"- and Joana smiled and said -\"Because you have been protecting me and I thought you were an insensitive\"- Blake only blushed a little which surprised both Ayrton and Joana, but she was happy with that...</span></div></div>",
            "created":1222664400,
            "id":590949,
            "title":"Continue..."
        },
        "1341111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Continue (last part of Blake's past)...",
                "Reader's Choice..."
            ],
            "content":"<div class=\"\"><div> <span>The 7th grade elapsed and there came the 8th, Joana now as convinced Blake had feelings, despite he hadn't a way to express them, but he almost always was with Joana and not only for protecting her (that was the main cause but he started to be more friendly to her, and they were together in almost everything, like lab, lunch, except sports because he usually played soccer and Joana basketball, but when for some reasons they couldn't play soccer and got bored, Joana invited him to play basketball with her). The things were quiet until a day...<br>\r\n<br>\r\nA big guy appeared blocking way to Blake and Joana, Blake inmediately went in front of her and was in guard, ready for the worst, and the big one laughed and said -\"So...you're the one nobody beats, huh? and the one who protects this girl though she isn't even his girlfriend?\"- -\"That's not of your business, and I protect her because she's my friend and nobody must be injured by my own fights\"- Blake answered, with some anger since this one was the worst school bully...Ivan (yes the same that years after Blake would kick easily) -\"So, do you want to play, Blake?\"- -\"I don't fight for idiots' pleassure\"- -\"Well then, I'll have to obligate you!!\"- and with this he tried to punch Joana, she covered herself in fear but didn't feel anything and saw that Blake intercepted the blow receiving himself -\"Blake!\"- was the only thing she could scream and he, calmly said -\"Don't worry, I know you don't like me to fight but I won't let this guy hurt you in any way!\"- Blake said and started his life's fight. Joana remained silent but she almost cried b inside with those words, thinking 'You always say that and go fighting...but...will it ever end?'.<br>\r\n<br>\r\nBlake started, this was one of his hardest fights, he was a good fighter but was on extremely physical disadvantage (he was just a 13 years old against a mastodon) he easily connected fists and kicks but nothing seemed to hurt Ivan too much, as he laughed -\"You bug, you can't even hit me, you only tickle me!\"- Blake thought to himself  'Dammit...I won't be able to keep fighting with this guy for too long'. After several minutes Blake was pretty tired and Ivan wasn't hurt at all. Then, he said -\"Now it's my turn!\"- As he blowed a weakened Blake with the hardest punch, sending him a meter away, and he couldn't even get up since Ivan started to hit him brutally, leaving him worst than ever, but even with that, many years of fighting made Blake stronger than average boys, and he could resist for a while, being able to stand up (very, very injured) and trying to keep the fight, being thrown to ground by Ivan, hitting his face against the floor and stomped by Ivan's feet...Joana was horrorized at seeing this and couldn't resist, she started to cry...<br>\r\n<br>\r\nBlake was being blown when for a moment he could see Joana's crying...and thought 'This is all my fault...she doesn't deserve to suffer for a guy like me!' And connected some hits but Ivan wasn't hurt, then Ivan threw him against lockers, hurting him a lot but the pain of the wounds wasn't stronger than knowing that he was making Joana suffer, even when he didn't know that they both loved mutually...<br>\r\n<br>\r\nJoana stepped in to stop the fight and said angerly -\"Stop it, Ivan!\"- And his answer was -\"Shut up, cheap bicth!\"- and he smacked her against the wall, that was his last move. Blake saw almost in slow motion what happened and, he felt like something inside him crashed into thousands of small pieces, and became furious, furious as he never had been before, and with his last energy, he stood up again and said furiously: -\"IVAN!!! THAT...WAS...YOUR...LAST...MOVE!!!\"- And not knowing how he ran toward him and hit with his strongest punch  in face, making Ivan to fall down, knocked out. Blake didn't even took care about himself, he inmediately came where Joana's and said: \"I'm sorry...all this was my fault\"- the he helped her to get up and then, he fell down since he used all his strenght to defeat that mastodon...<br>\r\n<br>\r\nAnd, while Blake was unconscious in nursery, Joana said softly -\"I love you, Blake...I'd like you to know it\"- as she stayed with him while he was asleep...</span></div></div>",
            "created":1222664400,
            "id":590944,
            "title":"Continue..."
        },
        "13411111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Return back where we left off...",
                "Reader's Choice..."
            ],
            "content":"<div class=\"\"><div> <span>As the previous year, that one elapsed and more things happened (specially about Joana's and Blake's feelings). There came the 9th year, that was ordinary, but here anyone could notice Blake's changes, now he wasn't the cold guy who was always alone, he was still most of time with Joana and Ayrton but became more sociable, and he didn't longer complain about Joana's affection to him, and the most noticeable change, Blake stopped fighting (it was a lot less than 7th and 8th grade). Joana was happy with this and was about asking him out but she was uncertain because she was afraid to ruining such friendship, and the time passed...Until the last day and the secondary's closing ceremony. A few days before Blake's friends put in him the idea that Joana loved him and...that he loved her...he first negated it all but then, he started to doubt about everything, about her and himself, and wasn't in peace with himself since he hadn't nothing but a way to answer that question...The last day arrived and Blake was decided.<br>\r\n<br>\r\nIn the closing ceremony, Blake, with Joana in private, asked her shyly -\"Errmm...Joana...I've got a question for you...\"- -\"Sure, what is it?\"- Joana answered and Blake became nervous, but he talked again -\"Have...you...ahem!...ever...felt...ugh\"- Blake was cut off by a moment, but continued -\"...something...for...m-me...more than just...friendship?\"- Joana looked at him surprised and let Blake continue, thinking that this was to good to be real... -\"W...will you...gou out...with me?\"- Blake was about slapping his forehead but before he could even think about it Joana's answer was a love kiss and hug...<br>\r\n<br>\r\nAnd that was how all it started...they began high school and they were together since that day...</span></div></div>",
            "created":1222664400,
            "id":590948,
            "title":"Continue (last part of Blake's past)..."
        },
        "134111111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Shrunk to 2 cm!!",
                "Disappeared?! (Unaware)"
            ],
            "content":"<div class=\"\"><div> <span>(Now back where we left off)<br>\r\n<br>\r\nAfter remembering how did they meet, Joana hugged Blake with no apparent reason and says -\"I love you, Blake\"- Blake answered -\"I love you too\"- But there was a kind of weakness in his voice, and Blake, feeling hurt, said to Joana -\"Joana...I lied about my wound...I'm feeling strange\"- Joana asked -\"What is it?\"- And Blake, who went pale said -\"This wound is different to the other ones...I'm feeling...weakened...aghh...\"- Blake said and finally fainted. Joana was now scared and saw in horror how her boyfriend...</span></div></div>",
            "created":1222664400,
            "id":589052,
            "title":"Return back where we left off..."
        },
        "134111112":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "Blake wasn't there...",
                "Blake was there..."
            ],
            "content":"<div class=\"\"><div> <span>Blake stood up and smiled, he arched one hand behind his back and stretched.<br>\r\n\"Good as new!\" he hesitated and kissed Joana on the cheek. A gust of wind howled down the hallway, the double doors swung open and a hunched silhouette stood there, bleeding. The boy limped in and fell onto the floor. Every eye turned to look at the figure on the floor. The boys hair was dried in his blood and each breath was strained and full of pain, his lips were dry and cracked. Blake's smile faded, his arms became limp. He trudged down the hallway and fell to his knees,<br>\r\n<br>\r\n\"Ayrton...\" Blake muttered. A note was on Ayrton's back. Blake scanned over it. His eyes hardened, his lips squeezed tight. Anger flowed through his body. It was a threat. The letter had wrote,<br>\r\n'This was nothing! You can't protect every one. Meet us in the park at 6:00pm, better not be late! Or else' Blake stood up and smiled weakly,<br>\r\n\"Sorry Joana, I'm going to break our promise...\" she looked up at him,<br>\r\n\"You're... going to fight them, aren't you?\" she looked down at the ground and fell silent.<br>\r\n<br>\r\n6:00 pm crawled towards them slowly. It was a unwanted omen. A black crow cawed. 6:00 had arrived.</span></div></div>",
            "created":1222750800,
            "id":590954,
            "title":"Blake's last fight."
        },
        "1341111121":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "The mall, on a bench. ",
                "Other place "
            ],
            "content":"<div class=\"\"><div> <span>Knives were drawn, knuckles clenched and in the bushes, a gun clicked. Someone walked over the hill with a smile, etched, onto his face.<br>\r\n\"Who are you?\" The leader of the gang shouted. The boy stopped, still smiling. His eyes, covered, by white hair that was almost touching his shoulders. He licked his lips, slow and purposefully,<br>\r\n\"Name's Blaze...\" The guys smiled,<br>\r\n\"Fan club of Blake? Your name is almost the same, and it sounds like some cheesy superhero!\" They teased Blaze and his grin grew, <br>\r\n\"Blake's mine, do you think you can beat him? Yes... of course you can... Blakes not at his full strength. He has potential... but to let that potential loose you can't kill him. That will be my job... when he is ready.\" Blaze laughed at the gang, \"Show me what you got!\" The gang tensed.<br>\r\n<br>\r\nBlaze jumped forwards, his smile stayed. He spun away from the on-coming knife, \"Too slow!\" He yelled, his grin growing bigger as he grabbed the gang members arm and snapped it. The man screamed, letting go of the knife and cradled his arm. Blaze jumped to a impossible height, taking the leader with him,<br>\r\n\"Wait! We won't go after Blake! Please!\" He screamed as Blaze laughed,<br>\r\n\"But I'm having so much fun!\" He kicked the man in the face, then continued to punch him in the stomach. All the gang could do was watch in horrror as Blaze did a huge combination of acrobatic kicks and spins on their boss in mid air. Once Blaze was satisfied, he smashed the man's head into the ground, Knocking him out. Blaze jumped backwards and disappeared into the bushes. Seconds later they heard a scream, then a unconscious member of the gang emerged, \"Don't play with guns\" Blaze called through from the bush. The gang looked at each other, then started to run.<br>\r\n<br>\r\nBlake woke up in a cuboard.<br>\r\n\" Ouch... what hit me? Oh no! The fight!\"<br>\r\n<br>\r\nWhen Blake reached the park, he saw the twitching bodies of the gang members. There was blood everywhere, even Blake had to look away,<br>\r\n\"Looks like some tried to escape...\" Blaze muttered as he saw the unconscious bodies of the gang in the distance,<br>\r\n\"Better start training Blake if you hope to beat me...\" Blake looked at the speaker, white hair covered his eyes.<br>\r\n\"What creature did this? Not even a bear could of done this!\" Blake yelled. The white haired boy smiled,<br>\r\n\"I appreciate the compliment\" Blake stepped backwards, something he had never done in fear. His whole body started to shake with rage,<br>\r\n\"You.. Bastard!\" Blake ran towards him, Blaze tutted.<br>\r\n\"You have been in a way too soft environment... not that much danger at all.\" Blaze stopped running.Something forced him to stop. \"Life is cruel Blake. But even that has it's rewards.\" He drew aut a weird gun and fired it. \"Survive the week and you will be ready... Don't worry about death, just wory about the pain... You can't die like this, but you will want to.\" Blake fell to his knee's and passed out. <br>\r\n<br>\r\nWhen he woke up he found himself to be tiny and in... <br>\r\n<br>\r\n</span></div></div>",
            "created":1224824400,
            "id":599450,
            "title":"Blake wasn't there..."
        },
        "1341111122":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "Joana runs over",
                "Blake goes to Joana's house"
            ],
            "content":"<div class=\"\"><div> <span>6 boys flicked there knives, hit there crowbars and put on there knuckle dusters. They waited. One of the boys turned around,<br>\n\"He chickened out! No good sn....\" His voice trailed of. He counted his friends... 4 friends. He spun around. Nothing, \"Charlie?\" He looked back at his friends, they shrugged there shoulders. He did a recount. 3 friends. He shivered in fear. \"Fight like a man blake!\"<br>\n\"Coming from someone with a knife!\" Blake yelled. The boys looked at each other. The boss counted two friends. <br>\n\"S... spread out...\" all of his confidence was drained out of him. He turned away. A scream echoed behind him. One friend left. He looked at luke, Lukes face was filled with fear. Then.. Luke disappeared. He stepped forward and glared down, \"A trip wire...\" he muttered. A foot kicked him in the stomach, he stumbled backwards. Blake smiled,<br>\n\"good positioning\" The kid looked down painfully at the trip wire, Blake kicked it. A net fell on the boy. Blake put a foot on his head, \"Never threaten my friends again\" Blake walked off.</span></div></div>",
            "created":1222923600,
            "id":590134,
            "title":"Blake was there..."
        },
        "13411111221":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "He was still there, but now at 2 cm height...",
                "Where did he go? (Unaware)"
            ],
            "content":"<div class=\"\"><div> <span>Joana ran over and came only to see that Blake won the fght, but as always, by being injured...Some tears rolled over her cheeks as she didn't say anything and hugged strongly to Blake. He, a bit tired, said -\"It's over Joana...everything is finished...You'll be safe now\"- Joana looked at him with sweetness in her eyes and a strange spark that Blake couldn't identify, but before he could think about it, he felt hit by a sharp object -\"ARGH!\" And saw his right arm, it was hit by...a dart? Joana inmediately realized Blake was in pain and released him from her hug, as she asked -\"What happened to you, Blake? Are you okay?\"- -\"One of those damn boys...hit me with a dart...and...ugh...I'm feeling...strange...\"- Blake said and finally fainted. Joana removed quickly the dart of his arm but she was afraid that now it was too late, and she now watched terrified as Blake was brighting for a second and then...disappeared?</span></div></div>",
            "created":1223096400,
            "id":590938,
            "title":"Joana runs over"
        },
        "134111112211":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "The bell rang and Joana had to take Blake with her...in her?",
                "Someone comes..."
            ],
            "content":"<div class=\"\"><div> <span>Joana was relieved when she saw that Blake was still there, but she hadn't too much relief since he now was 2 cm tall and unconscious. Something changed in Joana's instincts, because now she felt herself more affectionate and protective to his now tiny and defenseless boyfriend. Consciously, she never had seen Blake as someone she had to protect, he always protected himself and the people who mattered to him...but now all it was different, he wouldn't even survive 5 minutes alone and shrunk in school if he wasn't that lucky that he was with his girlfriend in the right moment. She walked carefully where Blake was lying and picked him up delicately. And she stared at him with a sweet look 'Aww, he looks so cute now...' was Joana's thought and she caressed him softly with her index finger, feeling his warm and even his hair, which Joana always liked. There elapsed some minutes before Blake recovered consciousness. Then, he awoke and saw thet he was in a strange place, it was warm and soft, and it had strange lines, before he could figure out where the hell was he, he felt a soft warm air draft and he turned around and realized about 2 things: Joana was HUGE!! and he was on her hand!!...He inmediately understood that he was the small one. But would Joana notice that it was he or he looked like a bug to her? He now was very afraid, he could accept almost any way to die but he never would like that Joana (even when she wasn't his girlfriend) hurt him, she was the only person Blake would trust his own life and the only who made him feel happy...<br>\r\n<br>\r\nJoana saw in Blake's small eyes that he felt himself helpless and was scared about her, so, she decided to calm him down -\"Blake...- she started to say in a very soft voice, almost sensual -I know it's you, don't worry. You're safe now\"- Blake was very relieved, he didn't even care about his safety but at least Joana knew his condition. and he answered to his girlfriend -\"I can't believe it...\"- -\"What?\"- Joana asked inmediately and almost slapped her forehead since he just shrunk and she asks what doesn't he believe... -\"I'm really lucky to be your boyfriend\"- (It was rare for almost everyone he said something like this but he really felt the love's characteristic warmth inside him) Joana didn't say anything and hugged him very tightly, sinking him softly in her huge and precious breasts (even at normal size they were huge to Blake, she must be D cups at very least). Blake could hear her heartbeats and muttered 'Despite this shrinking...I'm in heaven'. Then</span></div></div>",
            "created":1223182800,
            "id":602033,
            "title":"He was still there, but now at 2 cm height..."
        },
        "13411111222":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "He gets to Joana's house...",
                "A strange white haired boy appears..."
            ],
            "content":"<div class=\"\"><div> <span>Blake turned around and took his backpack, he told Joana that the fight would be pretty easy an it was so, now he decided to reach her at her house to spend the res of the time with her, after all, Joana would worry if he didn't go with her after fighting, she'd think that he lost or something worse.<br>\r\n<br>\r\nBlake regained his thoughts while walking, and remembered that he was following the same path as his father, James... He seemed to know a lot of things about him even when they hadn't happened yet... He thought about his father's last words -\"Promise me that...you'll never...never give up...and live...a true life, Blake...\"- He closed his fist and looking at the sky, he thought 'I never gave up, father...but how much will this last? Why weren't you with me when I needed you?! I had to grow up by fighting and being cruelly punished by my mother...why?...You knew so many things about my life like...like you had seen it before I lived it...' He continued walking while thinking and then...</span></div></div>",
            "created":1225429200,
            "id":602061,
            "title":"Blake goes to Joana's house"
        },
        "134111112222":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana appears?",
                "They continue their battle..."
            ],
            "content":"<div class=\"\"><div> <span>Blake stopped when a strange boy with long white hair stood in front of him. he didn't pay too much attention until the boy spoke -\"Hey, you did it great by beating all those guys\"- Blake was disconcerted, he was alone when he fough them, how would this weird know it, he decided to ask but then, he thought it was better to just accept the compliment, if it even was one. He said -\"Huh...thanks...\"- and decided to continue his way but before take a step the boy talked again -\"So, you can only beat weaklings like those?\"- Blake didn't know if taking that as an insult or a challenge, but didn't want to waste his time with a weird boy...Then, he didn't answer and began to walk -\"What about me, huh? Do you think you can beat me?\"- Blake stopped and said seriously -\"I DON'T FIGHT I HAVE NO REASON TO...then, why would I fight you? Leave me alone\"- Blaze answered -\"If you keep like that you'll never unleash your full strenght\"- -\"I'm strong enough to defend myself and people I care\"- -\"I don't think so...you can't even protect your girlfriend\"- Blake closed his fist when heard that...that was one of the few things which made him really angry, and decided to give this guy a lesson he'd never forgive -\"Okay then...you wanna fight?\"- <br>\r\n<br>\r\nBlaze only smiled and Blake attacked, punching him but Blaze blocked the fists, then, he threw punches also but Blake dodged them and reattacked with a kick, which Blaze dodged and, making a somersault, threw a strange upward kick which hit Blake, throwing him to the ground. Blaze stood up and said -\"Is that all? I thought you were stronger\"- There was no answer, just a furious Blake who connected a fist on his face and began to punch him in stomach and kicked several times, Blaze took some steps backward and said -\"That's was I was talking about, hehe\"- and the awesome fight continued, the fists and kicks were flying at incredible speed and they both dodged and connected many hits to each one. They were at the same level, or at least that seemed to be.<br>\r\n<br>\r\nBlake took a step backward while breathe heavily -\"This guy is pretty strong, but he can't be stronger than Alexander...\"- he muttered, thinking about Alexander Santos, his nemesis, who was his enemy since he's got memory, he claimed for some sort of revenge for somethingt Blake doesn't know. Then Blaze, who was still like nothing happened, just a little damaged, said -\"Nice warming up, Blake, now here comes the real fight\"- 'THE WHAT?!' thought Blake, noticing Blaze was serious and he didn't deal real damage to him, despite they were at the same level...Blaze began to fight seriously, and Blake was barely able to stand up against him, his hits were now a lot faster and stronger, Blake couldn't dodge so many as he did previously, and Blaze now dodged almost every punch or kick he threw and the very few ones which hit Blaze didn't seem to cause real damage. Blake now was thinking what kind of beast was he fighting with...<br>\r\n<br>\r\nBlaze laughed as he hit many times Blake and sent him hurling against a wall... -\"Ookay...you were a lot WEAKER than I thought you'd be\"- 'What the!!?' He thought 'Dammit beast...he can't be that strong' And, seeing how Blaze approached to him, he remembered to his father, 'Father...lend me your strenght, wherever you are' thought to himself and said furiously -\"I'll never give up!!\"- -\"Heh! Let's see how long you can say that\"- Blaze said as restarted the fight, which Blake was losing again because Blaze was far stronger anyone could imagine...<br>\r\n<br>\r\nThis was a frenetic and desperate fight where Blake barely dodged a few fists and kicks while tried to hit a Blaze's weakpoint, but there wasn't any, and, at the rate they were taking, Blake couldn't take it for so long. Blaze dodged Blake's fists and said -\"Too slow\"-, Kicking him and sending against an abandoned building, breaking part of a wall. Then, he said -\"Hey Blake, don't you think Joana is a very beautiful bitch?\"- There was no answer and he added -\"Those bugs are so fragile...aww...Why can't I have fun?\"- But the rubbles trembled as Blake reemerged from the rubbles, being totally furious, showing the fierce nature he had (he had this kind of state when defeated Ivan years ago), his eyes even became fully white and said -\"NOW I'LL SHOW YOU!!\"- Yelled as he dashed quickly toward him, hitting Blaze in stomach with a lot of strenght...<br>\r\n<br>\r\nBlaze said -\"Well at least I can get some more fun\"- The fight restarted again and this time was even more amazing, Blake near of his full strenght was like a beast and the punches and kicks were a lot faster, showing the two amazing warriors they were. Blake now balanced the fight being almost at the same level of Blaze, and after several minutes of a hard fight, they both got a little away and Blaze said -\"Even at your current state you can't win. My strenght and skills overwhelm yours\"- Blake only answered with more hits, and Blaze did so. Then...</span></div></div>",
            "created":1225429200,
            "id":602182,
            "title":"A strange white haired boy appears..."
        },
        "1341111122221":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Blake was now shrunk..."
            ],
            "content":"<div class=\"\"><div> <span>Joana watched what happened from away, and saw that the strange boy was overwhelming Blake's skills, he couldn't even stand up a chance and being furious just almost matched his level, she decided to stop the fight since Blake was sent against a wall and it broke.<br>\r\n<br>\r\nBlaze and Blake did incredible jumps and even fought in the air, kicking and punching impressively. But Blake's energies soon ran low and Blaze began to hit Blake several times again, without Blake had any chance. Blaze threw him to the floor and put his foot over his head -\"You can't win Blake, you aren't ready yet...You have to be in a harder environment to grow stronger\"- -\"U-ugh...what?\"- -\"This environment is too soft for warriors like us, we get stronger after having lived in a...umm...more dangerous form of this world\"- -\"What the hell are you talking about\"- -\"I'm talking about teaching you to survive...but maybe you're not worthy...I mean, you couldn't even stand against me, so, good bye Blake\"- He started to put pressure with his foot on Blake but Joana appeared and said -\"Stop it!!\"- and gave him...a punch in stomach? Blaze lost balance and fell down, that punch was extremely strong, then, seeing who was, he said -\"So, you like to fight Blake's battles, huh?, then, you'll receive Blake's next hits\"- And Blake stood up, blockig with his hand the punch he aimed to Joana and said withhis most angry tone -\"Don't dare to even touch her!!\"- Blaze took a step backward and said -\"She was even stronger than you!! Well not...she just took me on guard off\"-<br>\r\n<br>\r\nBlake turned on guard and was about beginning to fight but Joana hugged him from behind and said, almost crying -\"No, Blake, stop it!\"- Blake was furious, but he couldn't do something would hurt Joana's feelings, even fighting a guy like this, and, after recoverig back to normal, he said -\"Enough...You're stronger than me...you happy? Let's go, Joana\"- She hugged him tightly. Then, Blaze added -\"You have a warrior's will, so, I'll give you the lesson for you to be at your max strenght\"- Joana and Blake said -\"Huh?\"- As Blaze aimed a strange gun and shot Blake, who seemed to have disappeared, and Joana asked furious -\"What did you do to him, monster?\"- -\"He has to survive for some time to get his full potential, now, I leave you\"- And went out, Joana was about follow him but then she felt something in between her arms (she hadn't released the hug) and saw...</span></div></div>",
            "created":1225429200,
            "id":602183,
            "title":"Joana appears?"
        },
        "13411111222211":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana takes him to  her house...",
                "Reader's Choice..."
            ],
            "content":"<div class=\"\"><div> <span>Joana looked and saw that she was carrying in her arms to Blake...one moment...Blake?...Joana took him with her hand and saw he was sleeping, breathing heavily 'That fight weakened him a lot...but he looks so cute sleeping and tiny' Joana thought and kissed him. Blake woke up almost inmediately -\"Uhh-ughhh...I'm not done yet, Blaze! I'll...I'll...\"- He cut off himself when he saw he was in front of a gigantic version of Joana, after a second he realized he was the one who shrank. -\"Huh...Joana...ermm...What happened...to me?\"- Joana felt that Blake was feeling different, maybe because he never was unable to protect himself or other people, and answered him -\"Well...that boy said you needed to survive, and shot you with a strange gun\"- -\"Dammit Blaze\"- Blake muttered -\"Do you have an idea of who was he?\"- Joana asked -\"Not really...I only know he's a fighting beast and now that he shrank me\"- Blake sighed and put his hands inside his pockets, thinking that this time he was beaten up in everything, and even he became unable to survive by himself -\"I remember, he said that my environment was too soft and I needed a more dangerous one to unleash my full strenght...but...how would I become stronger being ant sized?!\"- Blake said -\"You aren't that small, sweetie\"- Joana tried to comfort him.<br>\r\n<br>\r\nBlake continued -\"We need to get him...I have to force him to turn me to normal\"- Joana looked at him for a moment -\"Umm...Blake, at your current size you can't even hit him...and nobody else could stand a fight against that freak\"- Blake muttered -\"Yeah...you're right\"- Remembering that despite his friends helped some times, this was a thing they wouldn't be able to handle, and, maybe for his size change, Blake didn't want to see Ayrton or Ferdinand until he got back to normal...<br>\r\n<br>\r\nJoana hugged him softly and said -\"Don't worry, I'll always protect you, whatever size you are\"- Joana always had a maternal thing with Blake (to explain it, she loves him as boyfriend but she is a lot more protective than an average girl would be to her boyfriend). Even when they were just friends, Joana acted very maternal and protectively with Blake (healed his wounds and was affectionate to him, she was protective to him also), and, the Blake's new size increased those instincts, that's one of the reasons Blake looked much more cuter to her at that size. Joana had still the hug on Blake while he thought 'Despite all this...I won't give up...I promised...to my father I'd never do that...happened what happened...'</span></div></div>",
            "created":1225515600,
            "id":623590,
            "title":"Blake was now shrunk..."
        },
        "1341111122222":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "The amazing combat continued just for a while...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Blaze and Blake were fighting amazingly, making extraordinary martial arts moves and they both were really almost at the same level, Blake, furious, could make a hit on Blaze's stomach, and they stopped...Blaze began to talk...-\"Blake...If I'm not wrong you're the son of James...hmm\"- -\"How do you know about my father?!\"- Blake answered angerly, Blaze laughed and said <br>\r\n<br>\r\n-\"I see...\"- <br>\r\n<br>\r\n-\"What?\"- <br>\r\n<br>\r\n-\"Hehehe...you're just a low class fighter, just like your father...\"- <br>\r\n<br>\r\n-\"What are you talking about?\"- <br>\r\n<br>\r\n-\"Humans are just weak...Think I'm one? HEH! I am far superior to you, clay scum...\"- <br>\r\n<br>\r\nBlake was angry but silent <br>\r\n<br>\r\n-\"I am a member of the divine race, what you call gods... WE ARE TO RULE EVERYTHING\"- Blake was getting more angry and Blaze continued <br>\r\n<br>\r\n-\"Unfortunately I happen to need your power to unlock certain stuff. But you aren't anywhere near strong enough to be of any use for me... You have even grown weaker over time...\"- <br>\r\n<br>\r\n-\"I'm not weakened!!\"- <br>\r\n<br>\r\n-\"Yes, of course you are Blake, since you met that stupid girl...she made you this weak...you would have been almost strong as your father if she wasn't in the way...\"- Blaze was cut off because Blake hit him with his fists and yelled <br>\r\n<br>\r\n-\"STOP IT!! NEVER...INSULT... JOANA!!!\"- The fight continued with those amazing warriors doing awesome combat moves and there elapsed about 20 minutes...<br>\r\n<br>\r\nBlake was running low of energy, but his fury was what kept him fighting, and Blaze was too strong, was he really a sort of god?<br>\r\n<br>\r\n</span></div></div>",
            "created":1225947600,
            "id":605228,
            "title":"They continue their battle..."
        },
        "13411111222221":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Karina appears...",
                "Joana appears/Reader's Choice..."
            ],
            "content":"<div class=\"\"><div> <span>The true fight began, fists and kicks clashed, Blake and Blaze...fighting almost at the same level...I have to emphasize it...ALMOST. Blaze was still way too strong for Blake, even at his fury state. But the fire inside his heart was what kept him standing up, and Blaze saw this, he said -\"I see you've got a warrior's heart, maybe I was wrong\"- The fight continued for some time more. Blaze was beginning to run low of energies when he saw that despite his battle damage, Blake's will was stronger than his body, but he couldn't give up, Blake was still a low class for him and couldn't gift him the victory, and he continued, panting, dodgind Blake's fists while he connected some hits, sending Blake crashing against a ruined building. -\"Hehehehe...You're a bug with a warrior's heart, after all, you aren't worthy, you have to admit it, that girl weakened you...\"- Blake didn't answer, he was furious by two reasons, mainly because he didnt' want him to insult Joana, the person he cared the most, and, unconsciously, his warrior pride wouldn't let him give up like that. And the fight continued ven in mid-air, they made amazing jumps and connected fists and kicks, they both got pretty hurt but wuldn't stop. It seemed to be a neverending combat. But, like everything, all has to come to an end. And this fight would do so...</span></div></div>",
            "created":1226034000,
            "id":605236,
            "title":"The amazing combat continued just for a while..."
        },
        "134111112222211":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Karina vs Blaze...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Blake's body began to give up, the fury made him stand up for excessively longer than he normally would have been able to take, and he was getting tired, while dodged and blocked Blaze's hits, he found this more difficult than before, and realized that he surpassed his limits too much, but couldn't do anything else, he just could continue fighting, not finding a weakpoint in Blaze, who was beginning to get tired also, they both were incredibly hurt, more than a normal teenager would have been able to bear. <br>\r\n<br>\r\nSoon, Blake did a decissive kick on Blaze's stomach but he caught him in the brief moment Blake was guard off while connected the kick and he gave the final hit with his fist in Blake's neck and sending him against a wall. Blake slipped down and panted, breathing very heavily. Blaze got closer and said <br>\r\n<br>\r\n-\"You have been pretty though, to tell the truth, you gave a lot more battle than I expected\"- <br>\r\n<br>\r\nhe said panting also. And prepared to give Blake his last hit saying <br>\r\n<br>\r\n-\"...But...in the end...garbage is still garbage...so do the weak bug like you...the weak always die...\"- But before he continued his speech, a kick blew him out and sent him a few meters away, Blake looked toward the sun at his savior...it was Karina...<br>\r\n<br>\r\n-\"K-Karina...what are you doing here?!\"- Blake asked and Karina said <br>\r\n<br>\r\n-\"I heard that a guy was fighting you and I didn't want to miss the party\"- Blake looked at her not believing her, after some years, she almost stopped totally fighting, not like her child days. They both were silent and after some seconds Karina blushed slightly and said <br>\r\n<br>\r\n-\"Ok! I can't let anyone injury you so badly\"- <br>\r\n<br>\r\nIn difference of Joana, Karina, being a fighting girl, protected people who mattered for her just like Blake did, but somewhat he had a maternal behavior toward him (and Ayrton, some years later), not in Joana's way, I mean, not in the conventional way, in her own way, like a lioness or something like that. (In high school she was more affectionate as normal girls but she still had, her own style).<br>\r\n<br>\r\nBlaze got up and said <br>\r\n<br>\r\n-\"So, you wanna fight me, huh? I won't hold back just because you are a girl\"- Karina said <br>\r\n<br>\r\n-\"Blake, I'll take this one, rest for now\"- Blake replied <br>\r\n<br>\r\n-\"Karina, it's not what you think, he's way too strong, you'll be killed, I only was almost at his level...with my fury...\"-<br>\r\n<br>\r\nKarina remembered. Some years ago, when Blake was 9 and she 10, after some months they befriended, 5th grade bullies threatened them one day, and despite the fighting duo was almost unbeatable, they were being beaten by a bunch of 5th grade bullies, Karina and Blake were pretty injured and Blake fainted for a moment, Karina was about to, she just resisted more somewhat (Is supposed that men are stronger while women have more resistance, according with genetics). <br>\r\n<br>\r\nAnd when she fell down, and one of the bullies put her foot on her head, Blake got up, but he was strange, his hair spiked slightly (not very noticeable) and his eyes became fully white, he didn't say anything, just defeated all that bunch of bullies in question of seconds, mostly punching them or kicking in stomach and neck. Then, Blake looked at her for some seconds and fell down again, fainting, he muttered with a faint voice -\"...i won't...let you...\"- and went unconscious. <br>\r\n<br>\r\nKarina at first was scared about that kind of fury state but then she understood that Blake hardly ever reached those fury levels and that he was still somewhat himself, he didn't hurt people who mattered for him, only the ones who hurt him or her...Karina was the only who understood almost perfectly Blake's fury state until she explained to Joana when Blake went furious again in the fight with Ivan. And now...he lost a fight with that, supposed to be unbeatable in that form...would Blaze be really that strong that Blake couldn't defeat him even at furious state?</span></div></div>",
            "created":1226120400,
            "id":605247,
            "title":"Karina appears..."
        },
        "1341111122222111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Karina wakes up and sees a tiny Blake beside her...",
                "Karina wakes up and doesn't see Blake..."
            ],
            "content":"<div class=\"\"><div> <span>After regaining her memories, she answered to Blake <br>\r\n<br>\r\n-\"Don't underestimate a girl...A lesson this guy must learn is: Never make a girl angry, or worse...never make a fighting girl angry...\"- With those words, she dashed toward Blaze beginning the combat connecting fists and kicks, Blaze found difficult to dodge her attacks, both because he was already damaged and because Karina was faster, still strong, with enough skills to beat most school bullies alone. Karina connected many consecutive kicks (her speciality, and the first kind of move she used when fought Blake at first time), Blaze grabbed her leg and said <br>\r\n<br>\r\n-\"You lose\"- coldly, And threw Karina down, but she made a circular kick which made Blaze trip and fall. She then answered <br>\r\n<br>\r\n-\"I told you...Never make angry a girl\"- Blaze knew that girls may be dangerous when hopped wild, but he was way stronger to be afraid of. He got up and blocked Karina's fists and said <br>\r\n<br>\r\n-\"I was just playing\"- punching her many times on stomach and kicking her, throwing her on Blake, who was still on the floor, not having enough strenght to get up.<br>\r\n<br>\r\nKarina said after falling on Blake <br>\r\n<br>\r\n-\"Uh...Sorry...\"- She got up and Blaze hit her again many times, leaving her almost injured as Blake was. Blaze came close to them and said <br>\r\n<br>\r\n-\"How cute, and stupid, heh\"- He lifted up Karina an began to hit her, when a fist hit his face, making him release her, it was Blake, pretty tired, still furious. <br>\r\n<br>\r\nBlaze said -\"This is gonna be fun\"- <br>\r\n<br>\r\nBlake, Karina, and Blaze, stood up in guard position for a moment, before starting to fight again, and after almost beating Blaze, he said <br>\r\n<br>\r\n-\"You need to unleash your true strenght and your wildness...You'll get into a more dangerous environment, don't worry about dying, you won't, but maybe after some moments you'll wish to\"- <br>\r\n<br>\r\nSaying that, he hit Karina, leaving her unconscious, and then, he deployed a weird gun, Blake just answered <br>\r\n<br>\r\n-\"You coward!!\"- thinking that he was going to die, Blaze just shot at him and shrank him (Blake remained unconscious, so, he didn't know about his size change yet). Blaze left saying <br>\r\n<br>\r\n-\"You maybe are a worthy warrior, I hope to not be wrong, I'll fight you next time, soon...Survive for some time, when you were ready, I'll know...\"-</span></div></div>",
            "created":1226120400,
            "id":605255,
            "title":"Karina vs Blaze..."
        },
        "13411111222221111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Take him with Joana inmediately, after all, she's his girlfriend...",
                "Take care of him for today and tomorrow she'll give him to Joana..."
            ],
            "content":"<div class=\"\"><div> <span>Karina woke up, wondering about that weird guy and Blake...She opened her eyes and looked, there wasn't the guy, Karina smiled slightly <br>\r\n<br>\r\n'Blake, you did it again' thought, and then that thought slapped her mind <br>\r\n<br>\r\n'BLAKE!' and looking around, Blake wasn't in there also, and despite Blake isn't very emotive, even with Joana, he'd never leave her alone and unconscious like that. <br>\r\n<br>\r\n-\"Something must have happened\"- she muttered, and before getting up, stared at something which seemed to be like a bug, she looked for some seconds and thought it was just a little doll like Polly Pocket or something like that. She decided to forget about it when she heard a faint voice, the doll was moving!! <br>\r\n<br>\r\n-\"puff...ugghh...\"- Blake got up with difficult, not knowing the big, or better said, little problem he had. Karina stared at him and looked that the \"doll\" was kind of hurt and his clother were damaged, just like...Blake? While she wondered about it, Blake muttered to himself after looking around (Karina was behind him and hadn't looked at her), <br>\r\n<br>\r\n-\"Ok...that was weird...that dammit Blaze shot at me cowardly, but...- He looked at his hands and arms, he was still hurt but not more than he was before falling unconscious, <br>\r\n<br>\r\n-\"...And...Shouldn't I be dead?...Or...no...this can't be heaven...or hell, right?\"- Blake muttered while seeing the strange world he was now. Which he didn't know is that his words were his saviors, because Karina recognized his voice, and when she did, she picked him up quickly (maybe a bit roughly) and hugged him tightly <br>\r\n<br>\r\n-\"Blake, I'm so happy to see that you are alive!!\"- Blake was surprised by this, he was quickly lifted up and squashed against a soft and warm thing, then he heard Karina's voice and after fractions of seconds he realized the terrible truth...he was shrunk, S-H-R-U-N-K, tiny, weak, puny, defenseless, and practically a bug with clothes...Those thoughts were on his mind, he was in a situation where he would have all disadvantages...he was sad and angry because Blaze did that to him...<br>\r\n<br>\r\nSince he was being squashed, he answered to Karina <br>\r\n<br>\r\n-\"..well...I won't be so much longer at this rate...\"- Karina released him inmediately and said <br>\r\n<br>\r\n-\"Sorry...I...I just thought you disappeared or were dead...\"- and blushed slightly, she always worried about him and even protected him in some fights where Blake was weakened by fighting many thugs and they were still more. She had a protective behavior to him, but it had its own style (Joana is technically a lot more protective but she rarely fights). <br>\r\n<br>\r\nThen, she asked <br>\r\n<br>\r\n-\"And...I didn't see...why are you so small and where's that weirdo?\"- She placed him on her palm to let him to talk, he explained <br>\r\n<br>\r\n-\"First, that weirdo's name is Blaze, I know it sounds like a kind of cheesy hero or something like that but he has an overwhelming fighting level, well you know that, and...after leaving you unconscious, he shot at me with a strange gun, it looked like a futuristic thing or a toy, and then, he said I had to survive in a more dangerous environment...and then, I'm here, squashed by my friend and telling my story\"- <br>\r\n<br>\r\nThey both laughed, Karina was a little surprised Blake wasn't so sad or angry as she thought, despite being a fierce fighter, he han an impressive self control, which he only lost in a very few times (becoming extremely furious). He seemed to be calm, maybe because now he was safe and that he had hopes to find a way to get him back to normal. <br>\r\n<br>\r\nKarina got up after some minutes with Blake on her palm and thought 'What should I do with him now?'<br>\r\n</span></div></div>",
            "created":1226206800,
            "id":606026,
            "title":"Karina wakes up and sees a tiny Blake beside her.."
        },
        "134111112222211111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Karina gets to Joana's house",
                "Something happens in middle of the way..."
            ],
            "content":"<div class=\"\"><div> <span>Karina said <br>\r\n<br>\r\n-\"Well, we better get outta here\"- Then, before beginning to walk, she thought about Blake's current state, he was shrunk and wounded, and, despite she would be able to heal him, it would be better that Joana did that, since she is Blake's girlfriend, that had to be the most appropiate. Karina asked to Blake <br>\r\n<br>\r\n-\"Blake, I don't ask you if you are ok beacuse you always say you are...but we both know you're hurt and at that size...\"- Blake looked at her with a 'What do you mean?' expression, she continued, saying <br>\r\n<br>\r\n-\"Would you want me to take you with Joana?\"- Blake nodded, but then he said <br>\r\n<br>\r\n-\"No, wait! What ARE YOU DOING?...Joana can't see me like this,if she worries for me by a normal fight...she may dismay seeing me like this...\"- Karina answered <br>\r\n<br>\r\n-\"Hmm, maybe you're right, but she still loves you and will take care of you, anyways, she'd heal you whatever size you were\"- <br>\r\n<br>\r\nBlake was convinced but not fully, the part of him which didn't want to see Joana in grief was blaming him for his new condition...for some reason, he couldn't see Joana suffering, in fights, he even lost control and became furious, beating many strong guys a few times, he couldn't stand with crossed arms seeing Joana sad...maybe he felt love earlier he thought, but his lifestyle had repressed his love related emotions, he barely felt anything else than anger and sadness, but not in such degree as he showed shen someone hurt Joana. <br>\r\n<br>\r\nBut after secondary's days he could understand more about her, about love, and about himself. And he said to Karina <br>\r\n<br>\r\n-\"Yeah, you're right, after all, Joana is the most caring and affectionate person I know...\"- Then, realizing of what he said, he apologized with Karina <br>\r\n<br>\r\n-\"I don't mean you are not caring, I'm just...agh, I'm just a jerk\"- Karina laughed and said <br>\r\n<br>\r\n-\"I got what you were saying, I'm not mad to that. Joana is really caring to you.\"- She began to walk, with some difficult, since she was hurt from Blaze's fight also. Blake was a lot more hurt but he was able to stand up even at his current wounded state. His fighting life made him truly stronger than normal.</span></div></div>",
            "created":1226379600,
            "id":606814,
            "title":"With Joana..."
        },
        "1341111122222111111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Blake wakes up and Joana heals him...",
                "Blake reggenerates in front of Joana's eyes..."
            ],
            "content":"<div class=\"\"><div> <span>She began to walk toward Joana's house, and after many painful steps, being very injured, she reached it with her last energies. It took to her about half of an hour, but finally she arrived. After all, she wasn't that damaged as Blake was, at least...<br>\r\n<br>\r\nShe knocked the door, and after some seconds, Joana opened the door. <br>\r\n<br>\r\n-\"Hi Karina...\"- She saw Karina and asked with some fear  <br>\r\n<br>\r\n-\"What happened to you?\"- <br>\r\n<br>\r\n-\"Ugh...I'm okay, Joana...but...\"- Karia tried to calm her down <br>\r\n<br>\r\n-\"What's going on, and why are you so injured?\"- Joana asked <br>\r\n<br>\r\n-\"Well...I helped Blake fighting a weird guy named 'Blaze', he was extremely strong, maybe stronger than a bear, he could even beat Blake at his furious state\"- <br>\r\n<br>\r\n-\"What?!\"- Joana was now in panic <br>\r\n<br>\r\n-\"And if you're THAT damaged...WHERE'S Blake??!!\"- Yes, Joana was in super panic now, and Karina didn't find a way to tell her the 'little' problem Blake had <br>\r\n<br>\r\n-\"Well...I don't know how to tell this...\"- <br>\r\n<br>\r\n-\"Blake's dead??!!\"- Joana interrupted, being really worried about him, and Karina continued <br>\r\n<br>\r\n-\"He's safe...\"- Joana rushed out and said <br>\r\n<br>\r\n-\"What are you waiting for? Blake need us and we can't let him like that\"- <br>\r\n<br>\r\nKarina knew Joana had that kind of behavior when it was something about Blake, she was really motherly in some times...and very protective, and decided to tell her about Blake being calm <br>\r\n<br>\r\n-\"Joana, we don't need to go for him\"- <br>\r\n<br>\r\n-\"WHAT?! You crazy!!? Or...did you take him to hospital?\"- Joana calmed slightly <br>\r\n<br>\r\n-\"No, if I did that, they wouldn't let me go out and you'd be a lot more panicked than now because you wouldn't know anything\"- Joana answered <br>\r\n<br>\r\n-\"So, where's Blake\"- Karina was a little nervous about telling her because Joana may react as an angry lioness to her...she gulped and said -\"Weell...Take this little gift I brought for you and I'll explain you everything\"- Joana was getting angry, and even Karina, who was her friend and a very brave one, was afraid, Blake was right in a thing: ANGRY JOANA = YOU BETTER RUN OR DIE!!, fortunely for him this never applied to himself. She remembered why people was afraid to provoke Joana...<br>\r\n<br>\r\nIn 8th grade, almost in last months, after Ivan incident, Blake and Joana were normal, he recovered fully from that fight and was the same everyone knew (he didn't remember what Joana said to him while he was unconscious lying on the nursery bed). <br>\r\n<br>\r\nJoana was a little saddened because she wasted her chance to asking him out, and despite he noticed something, Joana said it was nothing and since he almost never understood girls, he stopped thinking about that matter. <br>\r\n<br>\r\nOne day, Ivan appeared again to claim revenge, and, rushing in, he said angerly <br>\r\n<br>\r\n-\"Blake!! Fight me like a man!! Second round!!\"- <br>\r\n<br>\r\nBlake stood in guard but before doing anything he saw Joana and felt the sadness in her eyes...he decided that this was time to change things, he stood normal and said <br>\r\n<br>\r\n-\"Why have I to fight you again? I won and you're just scum, so, leave and let us in peace\"-<br>\r\n<br>\r\n Ivan laughed and answered <br>\r\n<br>\r\n-\"You coward!! Are you afraid about round 2? Hah! I knew you were just a crybaby!!\"- <br>\r\n<br>\r\nBlake closed his fists and said <br>\r\n<br>\r\n-\"Well, since I'm one, you're less than that because I'm stronger\"- He looked at Joana again, he felt like something in her was chaining him, and Ivan said <br>\r\n<br>\r\n-\"Well here I come, you ready or not\"- <br>\r\n<br>\r\nAnd hit with a fist which Blake dodged and locked him from behind, twisting his other arm and his back, making him bend backward, which may even break his spine with more strenght and said coldly <br>\r\n<br>\r\n-\"I don't need to fight to beat you\"- Joana smiled, not because of the combat, but because Blake wasn't fighting for her...Maybe there was hope for her, Blake wasn't insensitive, and was trying to not hurt her feelings. <br>\r\n<br>\r\nBut Ivan regained strenght and grabbed Blake with his free hand and threw him forward, hitting him against a wall and then Ivan hit him in the body. Blake was about begin to fight but the thought about Joana's worries for him made him not fight at all, and, trying to dodge a hit, the fist hit him on the back of his neck and fell down, almost fainting, since the back of his neck resulted to be his weakpoint, but nobody knew it.<br>\r\n<br>\r\nIvan just laughed and said <br>\r\n<br>\r\n-\"You're weaker than I thought\"- And got closer to him, Blake just said with a fainting voice <br>\r\n<br>\r\n-\"Joana...I'm sorry\"- and got unconscious <br>\r\n<br>\r\n(NOTE: Blake wasn't weaker, in fact, he was stronger than before but he wasn't able to fight because of Joana and that he was blown down on his weakpoint)<br>\r\n<br>\r\nIvan was about to finish him off when Joana ran there and stood in front of Blake, between him and Ivan and said <br>\r\n<br>\r\n-\"Stop it! I won't let you to hurt him anymore\"- Ivan laughed by the idea of Joana protecting Blake, he thought she was a weak girl and, like last time, he tried to slap her off, but Joana wouldn't let him this time, and stopped the hit with one hand (ONE HAND!!).<br>\r\n<br>\r\n Ivan realized something was wrong and said <br>\r\n<br>\r\n-\"What the hell?! Why...\"- <br>\r\n<br>\r\nThose were his last words, Joana only punched him in stomach with such a strenght that would have made Blake become frightened to her, and she said angerly <br>\r\n<br>\r\n-\"Never, never hurt my Blake again!!!\"- <br>\r\n<br>\r\nIvan was in so much pain and bent down, he fell on his knees and then he fell down completely, he almost popped his eyes with that fist hit and said with the few air he had left <br>\r\n<br>\r\n-\"u...ugh...how...how could this be...ughhhh...\"- he blacked out. <br>\r\n<br>\r\nEveryone took a step back when Joana looked at them, now the knew that seriously nobody should get Joana mad...(and the weird fact is that Karina is the fighting one, but Joana, due to his maternal instincts, uses the true strenght of a girl). <br>\r\n<br>\r\nShe knelt down and hugged Blake, then, he woke up after some minutes (even being hit in his weakpoint, he was able to wake up quickly since this time he was practically intact. He saw Ivan thrown in the floor but he thought he lost control again, but unlike other times, Joana wasn't sad, and he felt a kind of inner power coming from her. For obvious reasons, nobody told Blake Joana blew out Ivan with one fist. And didn't even Karina (not wanting to be next) nor Joana (not wanting Blake afraid of her because she would never do that to him).<br>\r\n<br>\r\nKarina said in a scared tone <br>\r\n<br>\r\n-\"Please, you first must take this and you'll understand\"- she saw the anger from Joana's eyes and quickly took out from her purse something which seemed to be a mini doll (2 cm). Karina put it on Joana's extended palm. She looked at it (Blake was in deep sleeping because of the fight) <br>\r\n<br>\r\n-\"This doll resembles to Blake, but what's with this? How does this tell me where's my boy?\"- Karina calmed her down and said <br>\r\n<br>\r\n-\"It's hard to believe but the weird Blaze shot at him with a toy-like gun, and he shrank down to his current size..I mean...you have Blake on your hand...\"- <br>\r\n<br>\r\nJoana was surprised by this and looked more carefully at her boyfriend, she was able to see his ripped shirt and his wounds (tiny to her). Suddenly, something in her happened, she felt more protective now that Blake was shrunk, and, more loving also. She began to caress him softly on his head and chest with her fingers, very softly. Karina said, opening the door <br>\r\n<br>\r\n-\"Well...I have to go...Take good care of him, please\"- And she left, maybe she was going to a nursery, or maybe she went with Ayrton. Anyways, now Blake was safe with her and that was the only thing what mattered for her..<br>\r\n<br>\r\n[NOTE: What it was said in here doesn't mean Joana was an angry person or that she had anger problems, she hardly ever became in anger and just for Blake being in danger, just like a protective mother, unlike Blake's...]</span></div></div>",
            "created":1226466000,
            "id":607831,
            "title":"Karina gets to Joana's house"
        },
        "13411111222221111111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana takes him to her room...",
                "Joana lays on the couch and puts Blake on her..."
            ],
            "content":"<div class=\"\"><div> <span>Blake began to wake up, he just recovered enough energy to stand up normally, the last he remembred was Karina putting him into her purse and then he fell asleep since he was too tired and injured, now, he was staring at his gigantic girlfriend, who smiled to him. Blake, thinking she was about to scold him for fighting (which she never has done but Blake always thinks that she will)<br>\r\n<br>\r\nHe just scratched the back of his neck and smiled nervously, thinking up a way to explain Joana his new size and the rest of the story, but, fortunely or unfortunely for him, she knew that gesture already, and said softly -\"Blake, my love. Don't worry. I know this isn't your fault\"- She brought him closer to her face and kissed him. Then, she said -\"Anyways, I never get angry at you, hehe\"- Joana said happily, closing her eyes. She looked very cute in that moment to Blake, and he said -\"It's okay...\"- Joana knew that when Blake answered vaguely it meant he really was in trouble, or at least he felt so. She wanted to comfort him because he's the only person she cares. -\"Blake...\"- She began to speak -\"Huh?\"- Blake seemed to be thinking, maybe about how would he live at that tiny size, or even how he may die...all that looked to be more than what he could bear. But he always went forward when he had trouble, he was stronger than this, Joana's voice interrupted his thoughts. -\"I...I don't want you to be sad...I'm here to take care of you\"- She hugged Blake and said -\"I'll always be here to protect you. I won't to let anything happen to you. Believe me\"- It worked, Blake was comforted, but the 'Believe me' made him think that she was hiding something from him or just emphasized her phrase. Then, the memories about Ivan's second fight came to him, and he remembered that he got unconscious and when woke up Ivan was already defeated and Joana was hugging him, which resulted to be strange if he had lost control...Joana almost always became sad until she realized he lost control only when someone hurt her (In other circunstances it would be more rarely he did), and that she was the only one able to calm his furious mode...<br>\r\n<br>\r\nWhy? Well...Going back in time again...In 9th grade, when Blake almost stopped fighting because of Joana, and their feelings to each other were becoming more obvious, Blake fought a bully who wanted to defeat him and Blake accepted the challenge when he saw Ayrton was blown down by him. He was another overwhelming one, and the combat was almost equal because Blake was older, more skilled, and stronger than when he fought Ivan. But Joana appeared and tried to stop the fight, Blake was distracted by this and this guy blew him and hit brutally, sending him against a wall... Then, he threw Joana down to the floor when she tried to save Blake, and...He lost control. Blake became furious and began to kick that jerk's ass, defeating him easily, but, in difference to other times, he wasn't stopping, he was still punching and hitting him even after he gave up, and really was damaging him. Blake made him to spit blood when he kicked him in stomach, then he punched many times in face and wasn't done, he grabbed him on the neck and lifted him up, then hurled him several times against the wall (Blake doesn't speak in that state, so, he didn't say anything). After all that, he wasn't still done, Karina and Joana became afraid of Blake killed him and, remembering, there was no way to stop him. At least it seemed so. Blake at furious state didn't stop with nothing, that was that everyone believed since years ago. But Joana decided to do something, she walked a few steps toward him and said -\"Blake, stop it!\"- Everyone thought it was useless, but Blake stopped hurling the guy and then, seeing it was successful, Joana said -\"Please, let him go, he already learned that he must no bully anyone\"- Blake became confused, and for the first time, he released him. Joana walked toward him and said -\"Come here Blake, forget about that fool one\"- Blake now was very confused, even when his fury state almost always blocked everything else in his mind but he wasn't able to ignore Joana. And felt great pain in his head and body...he grabbed his head with both hands while bent with pain, the conflict inside him was incredible... Joana stared at him for a moment, then, the bully wanted to get his chance and hit Blake when he was vulnerable... he fell down and quickly got up, being more angry, but before he did anything else, Joana put her arms around him and kissed him...Everyone gasped since they never had done such thing and even weren't a couple yet. The most amazing thing was that Blake's fury state stopped, his hair went normal and the iris in his eyes returned, after some seconds, Joana looked at Blake and he only reached to say -\"J-Joana...I...\"- and fell down, losing consciousness. Never anyone thought that Joana would be able to calm Blake's fury such way. Blake didn't remember anything from this (He never has memories about what happens when he loses control)<br>\r\n<br>\r\nBlake thought more deeply, and remembered why she wasn't sad as usually was when he lost control that day...he decided to ask it to her -\"Joana?\"- -\"What is it, sweetie?\"- she answered -\"Do you remember the day Ivan fought me and I refused to?\"- -\"How could I forget it! I....!!\"- She cut herself off before saying something else, Blake tipped off that something was hidden to him -\"I remember losing consciousness and then, when I woke up, Ivan was defeated, but you weren't sad as you always are when I lost control of myself...\"- Joana hesitated and, realizing Blake wanted the truth, she said -\"I'll tell you but promise me you won't be afraid of me\"- -\"Why would I?\"- asked Blake, disconcerted, and Joana answered -\"I...I wasn't going to let Ivan hurt you and I defeated him with a punch\"- -\"You WHAT??!!\"- that wasn't the kind of answer he would expect from her. Karina was supposed to be the fighting one, and she wasn't that strong. Joana said -\"I didn't tell you because I didn't want you to be frightened about me\"- She hugged him and said -\"I only did that because I love you\"- Then, Blake felt better, knowing that Joana was protective even when he wasn't shrunk.<br>\r\n<br>\r\nThen, she said -\"Now, let me heal you\"- She licked him several times, which was weird to Blake -\"Ermm...that was weird Joana...Why did you...??\"- Blake began to ask when Joana answered -\"I don't have bandages that small for you and I thought this would be the best way to heal you, and, I enjoyed doing it\"- she said jokingly, and then laughed.<br>\r\n<br>\r\n</span></div></div>",
            "created":1226725200,
            "id":607871,
            "title":"Blake wakes up and Joana heals him..."
        },
        "134111112222211111111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana wants to play with Blake...",
                "Reader's Choice..."
            ],
            "content":"<div class=\"\"><div> <span>-\"Ok...\"- Blake said while thinking that now everything was weird since he was so small...and Joana's behavior wasn't the exception, well...she's been always VERY affectioante and caring, but Blake felt that her protective instincts increased due to his new size 'Oh well...Joana's always been so caring, and...anyways, she's my girlfriend...I wouldn't be really safe with anyone else' He thought, which was strange because he never needed anyone's protection (at least he thinks so, he still doesn't know about the time Joana saved him from Ivan while he was unconscious, and didn't take on count the many times she has saved him from Cinthya...)<br>\r\n<br>\r\n-\"I think you need to rest for a while, do you want me to take you to my room?\"- Joana said, interrupting Blake's thoughts but that was good, there are things that must not be thought too much. Blake nodded, despite his brave and fighting skills, he was pretty innocent in love and relationships questions (Yeah, Blake hasn't pervert thoughts, even with Joana...well not consciously, I mean, the only part may be pervert was by the inner instincts that every man has, which wouldn't be really be pervert, but, in the end...)<br>\r\n<br>\r\nJoana put him on her shoulder and walked to her room, Blake had to grab tightly to her brown wavy hair to not fall down, Joana couldn't help but giggled when saw Blake's efforts to not falling to the floor, she didn't because it was stupid, in fact, that seemed very cute to her , and smiled, then she opened the door....</span></div></div>",
            "created":1228280400,
            "id":615167,
            "title":"Joana takes him to her room..."
        },
        "134111112222211111112":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Her breast...",
                "Her belly..."
            ],
            "content":"<div class=\"\"><div> <span>Joana then said -\"What about taking a little nap?\"- Blake answered -\"It's ok. I guess\"- Joana said -\"It's just...You're wounded and resting is best you can do for now\"- -\"Yeah, You're right\"- Blake said and yawned, Joana giggled, to her, he looked now very cute, and her protective instincts were increasing, remembering all the moments she spent with Blake and now more specially the ones when she protected him, making her feel more protective and caring. She took Blake on her hand and closed the fist softly only to hold him but not hurting, she laid on the couch and said they may watch a movie or something, and put Blake on...</span></div></div>",
            "created":1226725200,
            "id":608246,
            "title":"Joana lays on the couch and puts Blake on her..."
        },
        "134112":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "Blake shrinks",
                "Blake goes to lessons"
            ],
            "content":"<div class=\"\"><div> <span>\"We became close\"<br>\r\n\"Inseparable...\"<br>\r\n\"We were lab partners..\"<br>\r\n\"We ate lunch together\" <br>\r\n\"We never were alone.\"<br>\r\n\"Inseparable...\" Blake and Joana smiled as they remember the things they did. Joana smiled and reminded Blake about asking for a date,<br>\r\n\"Yeah... i remember\" He smiled as she got to work on his arm.<br>\r\n<br>\r\nA year ago was when Joana and Blake were officially dating. <br>\r\n\"Come on Blake... you can do it!\" Blake muttered to himself. He had tried to ask Joana out for two weeks but all that came out of his mouth was gibberish. Fighting was easy, but girls arn't. He turned the corner with a straight back and a determined look on his face. He stormed down the corridor. He reached her and opened his mouth. It locked in place and he turned red, \"Have you seen the weather today? Very intense, well got to go! HAHAHAHA!\" Blaked spun around and walked off, smacking himself on the forehead while Joana looked out of the window with a confused look on her face. Blake clenched his fists and tightly closed his eyes.<br>\r\n\"Hey lovely..\" Blake gazed back at a huge group of boys, there were about 13 of them. Blake was a good fighter... but not that good. He began to walk away,<br>\r\n\"Why not ditch Blake and have fun with a real man?\" Anger flowed through Blake's body, he spun around and saw Joana pinned to the wall by a guy with barely any neck. Worst of all, he was trying to kiss her. <br>\r\n<br>\r\nJef was having the time of his life untill he got hit by a truck. He flew down the hallway and skidded on his back. When his eyes focused he saw Blake lowering his nee.<br>\r\n\"Is he stupid or what?\" Shouted Jef's friend. Blake planted his heel on the boys chest and twisted. His other foot lifted off the ground and kicked the boy in the face. He landed gracefuly on one foot. His heel never left the boys chest. He pushed the big football player down and before Blake's foot touched the ground, he swiped another person. The gang snap out of there daze and fight back. Blake dodged fist after fist, and returned them the his attackers. Untill one of them got a good hit. Blood sprayed from Blake's mouth. More fists connected, Blake fell to his nee's and got beaten and kicked into the ground. They left him soaking in his own blood. Joana rushed to his side and lifted Blake's head, tears formed in her eyes,<br>\r\n\"That's the most stupid thing you have ever done! You could have died!\" Tears roled down her cheeks, Blake smiled and asked her to come closer.<br>\r\n\"Will... will you go out with me?\" Blake asked weakly before passing out. Joana sobbed and nodded her head. <br>\r\n<br>\r\n\"There we go! All done.\" Blake snapped out of his story and examined the wound. Joana smiled, \"I remember the docters saying you would be allowed to leave the hospital in 3 weeks, but you sneaked out after the first day to pick me up for the date.\" They both laughed and the bell rang. Joana waved goodbye and walked to lesson's<br>\r\n\"That day was the best day of my life\" Blake grinned happily.</span></div></div>",
            "created":1222664400,
            "id":588998,
            "title":"Reader's Choice..."
        },
        "1341121":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "A friend comes? (Joana/Karina/Lillian)",
                "An evil girl arrives with Blake...(Cinthya/Karen/Thania, but she isn't bad)"
            ],
            "content":"<div class=\"\"><div> <span>Blake went to his locker to get his books for, ironically, science class...but he suddenly falls down to the floor (still conscious) -\"Argh!...What the hell is going on?!\"- He said as he realized he had no strenght to even get up...he thought the chemical substance may have been a kind of poison or at least, a tranquilizer (which would be better after all) But unfortunely for him, it wasn't none of those two things.<br>\r\n<br>\r\nHe fainted and remained unconscious as he shrank to 2 cm (he was alone, so, no one saw him while he fell and shrank)</span></div></div>",
            "created":1223442000,
            "id":592780,
            "title":"Blake shrinks"
        },
        "13411211":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana?...",
                "Karina/Lillian?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well who \"friendly\" one comes with Blake?<br>\r\n<br>\r\nHis beautiful and loving girlfriend, Joana?<br>\r\n<br>\r\nThe good friend Karina? or...<br>\r\n<br>\r\nThe huge ass Lillian, who may want him for herself?</span></div></span></div>",
            "created":1223442000,
            "id":592784,
            "title":"A friend comes? (Joana/Karina/Lillian)"
        },
        "134112112":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Karina...",
                "Lillian..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well you didn't want Joana to go with his loved boyfriend, so, in whose hands do you leave Blake's fate?</span></div></span></div>",
            "created":1223442000,
            "id":592785,
            "title":"Karina/Lillian?"
        },
        "1341121121":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "She see's something...",
                "She sits down to air out her feet"
            ],
            "content":"<div class=\"\"><div> <span>Blake slowly opened his eye's. He licked his dry lips and rasped,<br>\r\n\"Karina...\" He watched the blurred figure of Karina walk towards him. Her shoe's glided across the floor, her skirt waved in the wind. Blake thought of when they met...<br>\r\n<br>\r\nIt was a normal afternoon. Blake was only 9 but he had been in more battle's then a full grown adult. Karina was the worst of them all...<br>\r\n\"So you like beating up the weak hu?\" Karina said with a smile. Blake blushed and looked at his feet. \"well?\"<br>\r\n\"I... uh... they started it so i... \" She punched him in the nose, blood dripped down his cheek. \" I... don't really no what else to do...\" He continued, slightly stunned. She aimed a kick at his head and he grabbed it. She became stone cold. Her eye's flared up. She shivered in rage. Turns out, she has a thing about perverts, and blake was in the wrong place \"uh... i... uh...\" He stuttered and looked away.<br>\r\n\"You... perrrvvvveeerrrttt! \" She screamed. Her fist flew at Blake and he caught it. She jumped up and kicked him in the head. She latched onto his hand and started rapidly kicking him in the face. After 20 kicks she jumped off and threw him at the wall. She turned and started to walk off.<br>\r\n\"My turn...\" She spun around and was hit in the stomach. Blake spun behind her and arm locked her. \"I don't lose...\" He said coldly.<br>\r\n<br>\r\nMany years passed and the two enemys fought their wars. But she eventualy saw through the fighting and saw why he was fighting. He was like her, she was like him. They both helped the weak.<br>\r\n<br>\r\nTogether, nothing could beat them. They were best friends... <br>\r\n<br>\r\nBlake slowly began to realise his size and began to panic, he screamed out and tryed to move.<br>\r\n\"P.E all day? Aren't you tired?\" You glanced over at the other girl. She had brown hair, unlike Karina who was blonde.She was wearing sandles...<br>\r\n\"Exausted! My shoes are filled with sweat...\" She wined as she kicked her shoes off and her socks. \"Heven.\" Blake tryed to crawl for cover..</span></div></div>",
            "created":1223614800,
            "id":593509,
            "title":"Karina..."
        },
        "13411211212":{
            "author_id":"zero323",
            "author_name":"zerothegodslayer",
            "choices":[
                "yes. freedom!",
                "no. god help him!"
            ],
            "content":"<div class=\"\"><div> <span>Karina started lowering her but to the floor. Blake saw this and crawled by. He somehow managed to got out of the way of her mini shirt smashing Him to the ground but his luck ran out as her feet moved and smash on top of him. All hr could smell and taste was sweat and feel was pain. This might have been the worst torture of Blake's life. More weight was put on top of him as she got settled and blake felt another tremor, but thought it was her friend sitting down.<br>\r\nBlake heard voices above. \"Aw that's much better\" karina said wipping sweat from her forehead. \"Must of been a bad day\" said her friend. But you might want to hurry and get to your bus so you can get home\".yea give me a sec to get my socks and shoes back on\". Said karina. Blake heard this and tried to move but he was pinned. She lifted her foot but Blake was stuck from the sweat. He tried to move himself to get free. He did not need to be stuck in the worst and worst smelling place of his life. A teenagers show would be bad enough but it was his best friends Karina's and he has got a big problem on his hands, remembering she had gym all day.<br>\r\nDid he get free?<br>\r\n( sry for spelling mistakes I could of made. I was using a phone )</span></div></div>",
            "created":1442115960,
            "id":2033657,
            "title":"She sits down to air out her feet"
        },
        "13411212":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Cinthya?...",
                "Karen or Thania?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, who of those ones is the one who may torture or play with Blake?<br>\r\n<br>\r\nThe sexy ass and popular as evil Cinthya? The fat Cinthya's slave Karen? or Thania the only of these three good hearted one?</span></div></span></div>",
            "created":1223442000,
            "id":592781,
            "title":"An evil girl arrives with Blake...(Cinthya/Kare..."
        },
        "134112122":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Karen comes...",
                "Thania comes..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Blake is for now safe from Cinthya, or is really he?<br>\r\n<br>\r\nFinal choose: Who will be? Flabby and not very pretty and Cinthya's slave Karen or Thania the only popular girl with a good heart?</span></div></span></div>",
            "created":1223442000,
            "id":592786,
            "title":"Karen or Thania?"
        },
        "1341121221":{
            "author_id":"brancondrey",
            "author_name":"bcon",
            "choices":[
                "forget about you and you stay in there for 5 weeks",
                "she takes you and uses u as a dildo."
            ],
            "content":"<div class=\"\"><div> <span>Karen comes and sees you but is astonished by you. she said i'm am going to have fun with you.<br>\r\nshe puts you in her really old boot she wears almost every day. she lowers you and you can already <br>\r\nsmell here feet. then she puts her bare foot in. you are laying between her toes. <br>\r\nshe goes for her usual 5 mile run home because she is on track. <br>\r\n<br>\r\nwhen she gets home what does she do.   </span></div></div>",
            "created":1315803600,
            "id":1185841,
            "title":"Karen comes..."
        },
        "1341122":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana comes...",
                "Someone else comes..."
            ],
            "content":"<div class=\"\"><div> <span>Blake was going to his classes (he had all the same as Joana, so, he'd meet her soon) but he decided to go alone, as he always has done, wandering a bit around. He arrived to the classroom and there was nobody. He looked at his watch (a Geneva Wrangler given to him by Joana in their 5th month anniversary) and noticed that he came too early, he decided to take his seat and then he felt strange by the wound he just got, and remembered that Ivan hit him with a broken CHEMISTRY bottle...with an unknown substance in it. -'Dammit Ivan...am I poisoned?' thought as he felt weakened, and then he felt sleepy, he tried to resist because he could not awake never again but he wasn't able to do it for long and fell asleep. He didn't know it yet but he shrank to 2 cm and the worst thing was that he was shrunk and sleeping on a seat...</span></div></div>",
            "created":1222923600,
            "id":590272,
            "title":"Blake goes to lessons"
        },
        "13411221":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Got a closer view and...What? Blake is now tiny and sleeping?",
                "She didn't see him..."
            ],
            "content":"<div class=\"\"><div> <span>Joana came to the classroom a bit later than Bake but it was still too early, she knew he should be in the classroom reading or doing something, she arrived and there was nobody, except Blake's backpack, and she called him several times but there was no answer, she was stranged about this, Blake never would left his pack in a classroom where he wasn't...So, she...</span></div></div>",
            "created":1222923600,
            "id":590276,
            "title":"Joana comes..."
        },
        "134112211":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "She took him in her hand and hid him in somewhere of...herself?!",
                "Someone came and the only she could do was sitting on the chair to hide him..."
            ],
            "content":"<div class=\"\"><div> <span>Joana was in disbelief...There was a tiny unconscious Blake on the chair 'Am I daydreaming again?' she thought to herself. She couldn't believe it, her bofriend, the fierce fighter and noble person was now so defenseless and vulnerable. She never thought he could be this helpless, even hurt or injured, Blake seemed to be a tough one.<br>\r\n<br>\r\nShe then thought 'I must hide him and protect him now' Then...</span></div></div>",
            "created":1223010000,
            "id":661756,
            "title":"Got a closer view and...What? Blake is now tiny..."
        },
        "1341122112":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Yes, Joana had to sit on him but holds her weight from him to not killing...",
                "No, Joana hid him somewhat between her legs...(not sat on really)"
            ],
            "content":"<div class=\"\"><div> <span>Joana was about to talk to him, to prove if it was just a real, or a daydream, an inner fantasy of hers, or a doll which resembled to Blake...But before she was able to even wake him up, she heard the door opening, someone was coming! 'I can't let anyone let see Blake like that...Specially Cinthya...' Joana thought, the last with some anger since Cinthya was her enemy since she wanted Blake for herself after Joana became his girlfriend, and they always had a high rivalry, despite Blake everytime has chosen Joana and rejected Cinthya,  and, with Blake so small, it wouldn't be difficult to Cinthya to snatch him and have her revenge on him...well, that if Joana wasn't there to protect him...<br>\r\n<br>\r\nJoana had to think quickly, and, seeing that she had no time, she thought while sat down on the chair 'Blake...If you are real...I'm very sorry for crushing you like this but I couldn't let anyone else get you...' She hid Blake benneath her great ass. And pretended like nothing happened, the question here is, did she sit on him?...<br>\r\n<br>\r\n[NOTE: The one who wants to write the next chapter may choose between:<br>\r\n-Karina, the good friend who would help<br>\r\n-Lillian, friendly, but wants Blake also (nobody knows)<br>\r\n-Cinthya, Joana's nemesis<br>\r\n-Karen, the fat Cinthya's secretary-friend (I think you know what do I mean, the typical ugly and stupid partner)<br>\r\n-Thania, the good hearted one who wants Blake also but may respect his relationship...<br>\r\n<br>\r\nTeachers are irrelevant...]</span></div></div>",
            "created":1227070800,
            "id":609742,
            "title":"Someone came and the only she could do was sitt..."
        },
        "13411221121":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "The class begins...",
                "Someone comes in..."
            ],
            "content":"<div class=\"\"><div> <span>Blake just woke up when he saw a gigantic ass going down on top of him, he hadn't even time to move, or to react, he felt the tremendous weight of this ass and thought it was his dead end, but, he realized that it seemed to not be THAT heavy, and he could breathe normally despite he was unable to move, he got also that if someone sat on him like that he wouldn't be more but a red splat, and that the person who sat on him was holding the weight from him. 'Joana...' Was his first thought after realizing about this 'At lest I hope...If Cinthya caught me...I'm more than dead...' he thought while frozen strangely by an unknown fear to him, the fear to be unable to defend himself, his whole life he has depended on his fighting skills to protect himself until Karina and Joana appeared eventually in his life, and he had still fights to protect himself from bullies and some bad guys...<br>\r\n<br>\r\nHe heard muffled voices and then a door opening and closing, then he heard more clearly Joana's voice -\"Don't worry Blake...I know you think this is weird but I had no time to hide you...I won't squash you...just enjoy!\"- She said playfully, not expecting to hear an answer under her big butt, which was really hot despite the whole school drooled for Cinthya's... <br>\r\n<br>\r\nAnd despite Joana's subtle attempts to seduce Blake while they were in Secondary (High school from 7th to 9th grade), she never was able to catch him glancing at her voluptuous body. She even wore some times tight clothes but Blake had such self control that he never stared at Joana's body when she wasn't looking. Despite in a talk with his friends, he finally admitted that Joana was hot to him. (It happened long before he asked Joana out, so, it hadn't really influence in Blake's decission, he did it by himslef after realizing that he loved her in any way and he didn't even know it clearly the previous times)<br>\r\n<br>\r\nJoana was still holding her weight from her shrunk boyfriend when...</span></div></div>",
            "created":1227934800,
            "id":613282,
            "title":"Yes, Joana had to sit on him but holds her weig..."
        },
        "134112212":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana sat on his chair (with him) and hid his backpack...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Joana started to try to figure out what would be going on. What would be Blake doing? Was he stopped by someone and was fighting right now even with his wound. Would he be wandering around or did he go out for something? There were many possible things that could happen and she never would think that her boyfriend was on the chair but now he was 2 cm tall and unconscious.<br>\r\n<br>\r\nJoana worried since if a teacher saw a backpack without an owner there would be a report for not being in class. That meant that Blake would be in trouble, and she wouldn't let that happen because Blake wasn't the one who looked forward for these problems. So...</span></div></div>",
            "created":1222923600,
            "id":590281,
            "title":"She didn't see him..."
        },
        "13411222":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Karina or Lillian...friendly? At least Blake hopes so...",
                "Cinthya or Thania...Blake's fate would be sealed..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well who else may come with Blake?</span></div></span></div>",
            "created":1225170000,
            "id":601102,
            "title":"Someone else comes..."
        },
        "134112221":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Lillian...",
                "Karina..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who? Karina, Blake's longest friend? or Lillian?</span></div></span></div>",
            "created":1236056400,
            "id":655826,
            "title":"Who?"
        },
        "1341122211":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "The class continues and Lillian keeps sitting on Blake...",
                "Lillian discovers Blake..."
            ],
            "content":"<div class=\"\"><div> <span>Blake was waking up slowly and with his eyes still closed, he was barely able to move, and he was still feeling weakened, then, he heard thunderous footsteps, and while he slowly opened his eyes was seeing everything blurred, then, when he could see more clearly, he suddenly realized that he was shrunk 'Damned Ivan! That thing shrank me!! One moment...I shrank? What the?!' <br>\r\n<br>\r\nBefore he could finish his thoughts he felt quakes that shook him, the quakes were rhythmical and he realized that they were footsteps, Blake made a quick calculation and, hoping it was Joana, he found out that the quakes indicated a person heavier than Joana. 'There are many possibilities...I better get outta here' Blake thought, and finding that he was still unable to move. <br>\r\n<br>\r\nThen a big curved shadow covered the seat and he looked up in horror, it was Lillian!! and she didn't even check her seat, she turned around and showed Blake the reason of why he feared her now, her ass was huge!  He looked at the enormous buttocks that would sit where he was. She always had the biggest ass in school and even when he didn't care about it because he loved Joana, now was fearing to be crushed under her immense glutes. He neither knew the real danger, more dangerous than that huge ass is only Lillian herself, who had a big crush on Blake since 7th grade, a few days after Joana met him. And probably having him shrunk, she was going to keep him beneath her gigantic buttocks.<br>\r\n<br>\r\nBlake also remembered that sometimes she tried to seduce him or to tease him by rubbing her butt or sitting on his legs when they were at secondary, and it hurt since Lillian had a heavy backside. She liked to sit on Blake because she knew he wouldn't be able to get up, she also had some times taken Blake's hands and playfully put them on her huge ass, though he immediately took his hands away, it was weird. Now, remembering, he thought 'Damn! I thought Lillian's ass was immense, but this is ridiculous'<br>\r\n<br>\r\nThe huge ass began to descend and Blake desperately tried to move out of its way, but, after he regained a few energy, he tried to escape and realized that Lillian's gigantic glutes would take the whole chair, and even when he was about to jump off the chair, Lillian leaned her ass backward to sit down and her big butt came down on top of him and crushed him slowly. Lillian wiggled slightly her huge backside in the chair grinding Blake, unaware that the guy she liked was being flattened beneath her enormous buttock, continued to pay attention to the classes, even when her big backside made her to feel unconfortable on the chair...</span></div></div>",
            "created":1236056400,
            "id":765451,
            "title":"Enormous butt"
        },
        "13411222111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "The class finishes and Lillian continues her day with Blake stuck to her butt...",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>While Blake was still under the heavy huge ass of Lillian, he thought 'Damn it!! Why Lillian had to sit her gigantic backside here?!...At least I hope she notices me and helps me somehow, or at least that she brings me with Joana...' How naive was he, and he didn't know that it would be the last thing that Lillian would do when having him shrunk.<br>\r\n<br>\r\nThe class passed and after several minutes Lillian wiggled slightly on the seat, a little uncomfortable because of her big backside, not knowing she was squashing Blake beneath her huge glutes. Blake was unable to move and he felt the weight was unbearable, and he couldn't do anything about his current situation except to be stuck to her big buttocks for a long time, and try to not die suffocated underneath that giant ass. Blake, even when he didn't like to be shrunk, he'd have prefered Joana to sit on him instead of Lillian. Why? Besides the fact she's his girlfriend, she was lighter than Lillian, so the weight would be more bearable. the other fact, with her his salvation was practically guaranteed. And...she was sexier.<br>\r\n<br>\r\nAs Blake thought, Lillian didn't feel anything under that huge butt else than the discomfort of the chair, caused by the size of her ass.</span></div></div>",
            "created":1236488400,
            "id":764983,
            "title":"The class continues and Lillian keeps sitting o..."
        },
        "134112221111":{
            "author_id":"dotthetwo",
            "author_name":"dtothetwo",
            "choices":[
                "someone see's his feet kicking",
                "lillian feels his feet kicking"
            ],
            "content":"<div class=\"\"><div> <span>finally the schoolbell rings signalling he end of class and blake breathes a sigh of relief (metaphorically) at the thought of his torment ending. 'lillian will be getting up in a moment and heading out to her next class freeing me from this awful weight.'<br>\r\n<br>\r\nlillians weight presses down on him even harder for a split second as she pushes herself up out of the cramped schooldesk driving the wind from blake's lungs, not that he had much wind since the crushing mass of lillian's enormous ass had been forcing him to only take quick, shallow, breathes from inside of her asscrack, where he had managed to wedge his head in just for the sake of survival. it was humiliating to be able to breathe only from between her butt cheeks, but fortunately she didn't even know he was down there, struggling for his life beneath her massive ass. how humiliating!<br>\r\n<br>\r\nbut as she started to rise up out of her seat blake's head became enveloped by her buttcheeks, then her massive, deep, cheeks closed in around his chest and shoulders, and then his hips! his entire body except for his legs were wedged deep into her crack! as she stood up he kicked his legs to try to get some attention! he thought he was blacking out from the pressure as she walked down the hallway! being ground to a pulp between her cheeks like human butt lint! gross!</span></div></div>",
            "created":1413145860,
            "id":1870522,
            "title":"stuck between lillian's cheeks!"
        },
        "1343":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana/Karina comes...",
                "Cynthia/Thania comes...",
                "Lillian comes..."
            ],
            "content":"<div class=\"\"><div> <span>Blake didn't woory for his wound as usually. He just walked with his books to go to his next class as an average day. He doesn't consider fighting as a special thing, and, in fact, he almost stopped completely because Joana doesn't like him to get hurt. He stopped in the bathroom before going classes and he put some water on his wound to wash it. Then he got out of the bathroom and felt weak and fainted. He shrank to 2 cm...</span></div></div>",
            "created":1223442000,
            "id":592771,
            "title":"Blake doesn't worry for his wound for a whi..."
        },
        "13431":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana, his girlfriend, of course, he'll be safe with her...He hopes...",
                "Karina, a very good friend who SHOULD help him...Why not?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well who comes with now defenseless Blake?</span></div></span></div>",
            "created":1223442000,
            "id":592776,
            "title":"Joana/Karina comes..."
        },
        "13432":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Cynthia, she's as sexy as evil (but unfortunely for her, Joana is still sexier)",
                "Thania, the girl who may love Blake..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, you chose Joana isn't here for now, so, which girl do you choose?</span></div></span></div>",
            "created":1223442000,
            "id":592778,
            "title":"Cynthia/Thania comes..."
        },
        "14":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Joana comes...",
                "Karina comes...",
                "Lillian comes...",
                "Cinthya comes...",
                "Claire comes..."
            ],
            "content":"<div class=\"\"><div> <span>It's a Monday, 9:30 a.m. at school..<br>\r\n<br>\r\nBlake approached to his locker to get his books for the history class, he was alone as almost always, despite Joana was in every of his classes. He opened the locker and before he could do anything else he heard someone being hurled against the lockers, then some punchs and another hurling, then an unknown voice -\"You two idiots, did you think you could beat me? Hah!! Blake wouldn't even stand up a chance against me...And without him you aren't nothing\"- Blake thought for a moment the worst, but then he reasoned that Joana couldn't even fight someone like that and he spoke to two, so they must be Ayrton and Ferdinand. He closed his locker roughly and ran to the place where was happening something.<br>\r\n<br>\r\nWhen he arrived he couldn't believe it, there were Ayrton and Ferdinand barely stainding up in guard position in front of a very big and strong guy, who probably was a bully, then he noticed that some lockers were dented and stained with blood. He hit that one in his jaws just in time because he was about to gibe them the final punch... Ayrton and Ferdinand stood in disbelief for some seconds and then they saw to their savior...Blake...<br>\r\n<br>\r\nHe turned around and then asked to them -\"Are you ok?\"- -\"Well...as possible...\"- answered Ferdinand, then Blake said -\"Ok, go back, I'll take care of this one\"- -\"But what?! Are you crazy?! You won't defeat him, he's too strong\"- Ayrton exclaimed, Blake remained silent and then said with a more serious tone -\"I won't know it until I fight him\"- -\"If you are going to fight him, I'll do so\"- Ayrton said, remebering an atrocious past battle, when a bully called Ivan, who was like this guy (less heavier and stronger and they were 13 years old in that time), Blake could barely beat him and only because he became extremely furious when that damned guy dared to hurt Joana and that was his last move...Ayrton knew as well as Joana that despite Blake fought his whole life, his body has its limits (he could resist for longer a fight that Ivan would have finished in less than 5 minutes) and he wouldn't let him suicide like that, then Ferdinand added -\"I'll fight also\"- Blake was annoyed by this by two facts, his friends were hurt and, he never liked to fight with numerical advantage, it was kinda coward, and he didn't say anything as he started the fight alone...<br>\r\n<br>\r\nBlake stood in guard in front of this guy and said -\"Who are you and what the hell do you want?!\"- The big guy laughed and answered -\"My name is Albert, and you must know my little brother...Ivan\"- Blake froze for a moment '...It can't be...Ivan had a big brother...dammit' he thought and then said -\"I guess you want to avenge him, do't you?\"- -\"Nah...Ivan is just a weakling\"- Blake couldn't believe that arrogance, it had t be just a joke, nobody could call Ivan a weakling, then, he finally said -\"So, let's end this once for all\"- And they two started the combat, Blake dodged his fists and connected a good punch in his jaws, but he wasn't even stunned, Blake thought for a moment that when he fought Ivan it was like this, he didn't seem to be hurt even after several strong hits...<br>\r\n<br>\r\nThe fight continued, the fists of they both were flying at a very high speed, crashing in some times and Blake's connecting in others, even at this moment, Albert had failed every punch, Blake kicked him and made some combos but Albert stood up in perfect conditions, like nothing happened to him, and several minutes elapsed like this, Blake was dodging every punch and connecting nice hits which resulted useless, he kept fighting like this for more than 20 minutes, after this, Blake was getting tired, at this rate, he wouldn't be able to keep fighting for long, his energies were running low and Albert was still alright, maybe a bit hurt but it was almost unnoticeable. After a few minutes, he was pantsing and thought 'Damn it!! This guy is just like Ivan...' Then he dodged two punches and the third hit him, sending him about half meter away and against the lockers, Albert just laughed -\"Hehehe...so, this is the guy who nobody was able to beat?\"-  Then, before Blake got up, he kicked him in the stomach and hit him in there several times, then he grabbed him in the neck and lifted him up...-\"Hey Blake, your girlfriend...or I mean...future widow...is beautiful...maybe I'll fuck her after kicking your ass...\"- Blake became very angry and hit him with a very strong punch on the face, forcing Albert to release him, they both fell down and Albert got up quickly, taking Blake by the neck and started to punch him in the stomach, about 10 times and then Blake spitted out some blood...Albert just threw him against a locker and then he threw him against the floor, Blake was injured and weakened at this moment...<br>\r\n<br>\r\nBlake got up with difficult and barely stood up, grabbing his left arm with the other because it was damaged by hurling against the lockers, Albert approached to him and blew him away with another punch, and before he could continue, Ayrton ran and started to punch him quickly in the stomach while Ferdinand grabbed him from backward to not let him to move, Albert released after 2 minutes and sent away Ayrton and Ferdinand easily, then he plated his foot over Ayrton's head and said -\"I want you to see your friends being crushed\"- and started to stomp over Ayrton's back until he spitted out blood, then he took Ferdinand and started to hurl him against lockers about 5 times and then he threw him away, hitting his face against the hard floor. Albert was about continue his \"fun\" when Blake gave him some furious punches and kicks, despite his damaged body, his spirit was what made him strong... and a desperate battle began, it didn't last for long because Blake connected his strongest kick on Albert's nape of the neck, leaving him thrown on the floor. Blake then went with his friends and helped them to get up -\"You better go away while you can...you should go to the nursery\"- -\"But what about you?\"- They both asked, which Blake answered -\"I...ugh...I have to finish this\"- When Albert got up, Ayrton and Ferdinand had no choice but leaving Blake alone.<br>\r\n<br>\r\nHe stood again in front of Albert and suddenly they both ran toward the other, they connected several fists and kicks and then Blake gave him his best punch while he rememberd what happened to Joana....the moment he wasn't able to protect her... and finally connected the punch to his jaws, Unfortunely, it didn't work. Albert was still standind up, and before they could finish their fight, Albert saw a teacher approaching from far and said -\"This was a very good fight, but I've got more businesses and can't lose my time playing with you...for now...\"- Then he left. Blake wouldn't have let him go, but now he was too injured and the teacher would report him, so he decided to go for his books again (now missed history class) and left that corridor just in time, then he, barely being able to walk, reached his locker, he grabbed his biology books and decided to go to his next class (despite being THAT hurt and Joana would worry about him) But before this, he had a bad feeling and before he looked around, someting or soemone gave him an injection -\"ARGH!!...Dammit\"- Blake felt inmediately more weakened than normal and fell unconscious. While he was out he shrank to 2 cms. Then...</span></div></div>",
            "created":1224306000,
            "id":638625,
            "title":"A fighting beginning..."
        },
        "141":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "She sees a tiny and unconscious Blake on the floor...",
                "She doesn't see him but he wakes up and gets to her socks...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Meanwhile...Joana got out from history class wondering why Blake Ayrton and Ferdinand missed that class, and then she thought 'Oh no...another fight, I hope Blake's ok...' Karina was with her and she saw her worried face and said <br>\r\n<br>\r\n-\"Don't worry Joana, I know Blake from very long, he can handle this, I'm sure\"- Then they saw from far Ayrton and Ferdinand approachim them pitifully, they were extremely, EXTREMELY injured, Joana now worried more as Karina went with Ayrton and hugged him <br>\r\n<br>\r\n-\"Ayrton, sweetheart, what happened?\"- -\"A...Albert...attacked us...B-Blake...intervened...if he didn't...we wouldn't be here\"- Karina remembered Albert, he was a mastodon which Blake and her defeated some years ago (they were 10 at that time). <br>\r\n<br>\r\n-\"That damned Albert...\"- Karina muttered, Joana asked very worried <br>\r\n<br>\r\n-\"But...what happened to Blake?! he missed the class also and I haven't seen him\"- <br>\r\n<br>\r\n-\"What?! He should have been with you, he finished Albert off quickly, or did he?\"- Ayrton worried also, it could have happened the worst, and nobody else was able to stop Albert. <br>\r\n<br>\r\n-\"Maybe he decided to avoid you since you worry a lot about him\"- Ferdinand added, trying to comfort Joana, which didn't work, and Karina added <br>\r\n<br>\r\n-\"No, that's not Blake's style, he doesn't to keep Joana or me more worried than normal, he comes with us even knowing that his girlfriend surely is gonna scold him\"- <br>\r\n<br>\r\n-\"Hey! I never scold him...I just hug him and heal his wounds\"- Joana exclaimed (and those last words she said with a funny tone like a scolded little girl) and they laughed for a moment.<br>\r\n<br>\r\nKarina decided to take Ayrton to nursery and said <br>\r\n<br>\r\n-\"Joana' I'm sorry but I've my own responsabilites also, you better find Blake before something else happens, this seemes to have been their worst fight ever...believe me\"- <br>\r\n<br>\r\nAnd they went out. Ferdinand went alone to the nursery since he hand't no one (XD). And Joana had to look for Blake by herself, she worried a lot because Ferdinand and Ayrton were pretty bad and Blake who fought him at full strenght surely was in a worse state. The first place she went was where Ayrton told her it was the fight, and the only she could see was blood stains on the floor and lockers and the lockers dented themselves. <br>\r\n<br>\r\n'This can't be good...It's been a very fierce combat' Joana thought even more worried and some sad about Blake. The second place she went it was Blake's locker, he had to be in there since he wasn't in nursery and he hasn't gone to classes. She sees Blake's books thrown around and she picks them up, she decided to take the biology's ones to carry them to him. Then... </span></div></div>",
            "created":1224392400,
            "id":638632,
            "title":"Joana comes..."
        },
        "1411":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Back to where we were...",
                "Reader's Choice..."
            ],
            "content":"<div class=\"\"><div> <span>She noticed a small thing on the floor. It seemed to be a doll, but when she picked it up and looked closer, she realized that it resembled Blake a lot... and that is was severely damaged... Joana kept looking the wounds, she thought 'A wounded Blake's doll? Who would make this?' She put her finger on its chest and found a very little stain of blood.<br>\r\n<br>\r\n-\"This is strange... dolls don't bleed...\"- In other times she'd have just discarded the doll but since she was really worried about Blake, her instincts told her to examine the supposed doll. Joana checked if wasn't it just paint, but she look how the miniature Blake was still bleeding. She gasped, and brought him near her eyes, she noticed the weak movement of breathing. 'Either I've gone mad or defintively there's something strange here...' She thought<br>\r\n<br>\r\nJoana decided to ask Karina about this, she was practically a genius and was Blake's best friend besides Ayrton and Ferdinand. So, she placed him in her cleavage because she thought that her pocket might be too rough for him in his current state. She grabbed her stuff and met up with Karina in the classroom. They were lucky that besider her and Blake, not much people in this school liked biology so nobody bothered on arriving early. <br>\r\n<br>\r\nJoana entered and found Karina, who was doing some homework with her laptop. She greeted her. Joana greeted her back and sat in at a desk next to hers. Karina was surprised to see her alone, and was worried<br>\r\n<br>\r\n-\"Did you find Blake?... Or... was he that badly beaten...?\"- She said the last with slight fear. When they were 10, Blake alone didn't stand a chance against Albert. He and Karina together were barely able to beat him and both got terribly hurt<br>\r\n<br>\r\n-\"Sort of... But I need your help...\"- Joana answered and Karina immediately sat up, now worried <br>\r\n<br>\r\n-\"Is he somewhere unconscious and you couldn't get help?!!\"-<br>\r\n<br>\r\n-\"Nope, well... he's unconscious... but I managed to bring him with me...\"- Joana said, Karina raised an eyebrow, Joana was alone... so... why did she say Blake was with her?<br>\r\n<br>\r\n-\"Uhmm... where did you bring him?\"-<br>\r\n<br>\r\n-\"It's difficult to explain... please, don't tell me I'm crazy...\"- Joana said<br>\r\n<br>\r\n-\"What is it? Say it already!!\"-<br>\r\n<br>\r\nMeanwhile, Blake slowly woke up, he was very damaged and all of his senses weren't working as they should. He found himself in an unknown place. It was dark, with very weak illumination. He could see that the place he was in was seemingly peach colored, he had little strength to move but felt around, he thought that he might be somewhere outside school, but the walls around him felt soft... and warm... That snapped Blake out of his weakness for a moment, he thought that definitively there are no such things as warm and soft concrete, or rocks...<br>\r\n<br>\r\nHe heard a heartbeat behind him. It sounded like a heartbeat, but was far stronger. He noticed that his own body was still battered and bleeding, and all of this, him waking up, this strange, there was only one thing Blake could figure out.....Death...<br>\r\n<br>\r\n'So... this is the afterlife? How strange... no clouds, no grass, no ground... just this strange place... I guess that the heartbeat is a reminder of life's constant flow or something like that... whoever who made this place had a bizarre yet poetic of what death is like...' He thought, remembering one of his Biology classes<br>\r\n<br>\r\n-\"The first sound every person hears is the heartbeat\"- Said his teacher in a class. He also said something about motherly stuff that Blake didn't bother to listen. He had had many bad experiences with what everyone else calls a mother. Why? To make the story short: His mother never wanted him, and hated him every day of his life, until 5 years old when he and his father were forced to leave the house. He was never nursed nor had ANY experience with a mother. <br>\r\n<br>\r\nUntil 4 years later when he was 9, he was found by his grandmother, Irma (Blake's father died the day they were forced out, defending Blake from his brother who was seeking revenge on him). She was the only woman he ever called Mama. She soon noticed Blake's disgust toward mothers and most of related stuff in general... at the time, Karina herself didn't help either, as she had mistaken him for a bully, and seeked every chance to fight him, Blake described her as 'The girl who wants to punch me for no reason'. <br>\r\n<br>\r\nHis grandmother however told him that he was deeply hurt by his past, but that he should let a woman to help him in the future, to fix those wounds. Blake at 10 years of course denied needing care from someone else (Specifically, he stated that he didn't need other than his only family left, his grandma). By that time, Karina had become his friend and fought at his side. Meeting Claire filled Blake with doubts, as her behavior was strange for him... To Blake's logic, Karina's behavior was the normal one... not that she looked tomboyish but she was a girl who kicked asses. <br>\r\n<br>\r\nClaire's constantly hugging Blake annoyed him further. That's why, years later, when he was 12, he was reluctant to let Joana, a girl he just saved the first day of 7th grade from a bully, heal the wound he got from a knife the bully used. Let alone that Joana effectively grew fond of him, despite he just wanted to get away from her. Still, he protected her from many other guys who threatened her. Joana was in love with him in no time and he had no idea. For three years, Blake just thought of her as a second Claire, though for some reason he didn't fell that annoyed. He also found surprising that he felt he could tell her his past and why he is the way he is. <br>\r\n<br>\r\nOnly at 9th year he'd know the reason, and after all of his male friends and Karina shouted into his ears that Joana actually loved him, he decided to ask her out... though it was more like she asked him out instead. Anyway, Blake warned Joana that he knew nothing about relationships, she just giggled, it was the Blake she knew and she loved him.<br>\r\n<br>\r\nEven together, Blake wasn't too fond of excessive hugs or kisses, and one of these days he was surprised when Joana hugged him and he heard her heart. He felt tired and sleepy, and had no idea why. That class at Biology answered his question: The first sound a person hears before birth, is the heartbeat. It also soothes babies. Since Blake was never taken care by anyone but his father, he  was never soothed. Not that his father was bad, but when he wasn't there and Blake cried, his mother, Lilith, solved the problem beating him, until he learned not to cry.<br>\r\n<br>\r\nThis would be one of Blake's trademark signs, he would never cry, nor show emotion. His relationship with Joana was slowly changing that but he still refused instinctively to show sadness.Karina told Joana once that Blake's cold attitued was a scream for affection, even if he denied it...</span></div></div>",
            "created":1285304400,
            "id":962296,
            "title":"She sees a tiny and unconscious Blake"
        },
        "14111":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "The teacher and everyone else enter...",
                "Just another girl, who? (Reader's Choice)"
            ],
            "content":"<div class=\"\"><div> <span>'So... This is my song of death? The first and last sound I'll ever hear... I wonder how much will this state last... I feel damaged... If it's my time... then so be it...I want to rest...' Blake closed his eyes, awaiting for death and for a final rest, he reflexed about his life, and felt stupid about wasting the last three years<br>\r\n<br>\r\n'I should've asked Joana out back at 7th grade... How the time passes... Now that I go out with her I die... I feel bad for her... and me...' He thought. His body was too weak to do anything but still Blake moved slightly to get comfortable in his strange prison.<br>\r\n<br>\r\n-\"Blake... he... he is...\"- Joana gasped<br>\r\n<br>\r\n-\"What was that for?\"-<br>\r\n<br>\r\n-\"You won't believe me...\"- Joana took carefully Blake's tiny body out of her cleavage, Karina raised an eyebrow<br>\r\n<br>\r\n-\"Why do you carry a doll between your boobs?\"-<br>\r\n<br>\r\n-\"It's not a doll, look...\"-<br>\r\n<br>\r\nKarina examined the \"doll\" and said<br>\r\n<br>\r\n-\" *Sigh* I thought that your obsession with Blake would be over when you finally got him to ask you out... But voodoo? It's sick!! And... why did you have a voodoo of Blake in there?\"-<br>\r\n<br>\r\n-\"It's not a voodoo!! I found him on the floor... and he just moved...\"- Joana was saying<br>\r\n<br>\r\n-\"You felt it, right?\"- Karina said, Joana blushed<br>\r\n<br>\r\n-\"This is strange, who would make a voodoo and then throw it on the floor?\"- She took the tiny body and Joana said, worried<br>\r\n<br>\r\n-\"Don't be so rough!! He's hurt!!\"-<br>\r\n<br>\r\n-\"Joana, it's just a doll, nothing is going to happen to the real... What the?!!\"- Karina noticed that Blake's tiny body seemed to be bleeding, and that her hand had a small red stain. She gently placed Blake on the desk and sniffed the stain<br>\r\n<br>\r\n-\"Oh my God!! It's blood!!\"-<br>\r\n<br>\r\n-\"Maybe I'm crazy but could this be Blake?\"- Joana asked<br>\r\n<br>\r\n-\"I dunno... this might be an unknown doll stained with someone's blood...\"- Joana glared at her, and she said<br>\r\n<br>\r\n-\"I'll need to see if this is actually alive\"- Her question was soon answered, Blake struggled to get up but he was too weak. Joana stared at Karina<br>\r\n<br>\r\n-\"Uh...okay... You won... But he needs immediate attention\"-<br>\r\n<br>\r\n-\"We're in a biology lab, duh...\"- Joana said<br>\r\n<br>\r\n-\"Okay, Me - 0, You - 2. Let's not make a contest out of this...\"- Karina said, and searched for the laboratory stuff, and got a first aid kit. She applied iodine on Blake's body with a cotton swab, very carefully. Blake grunted in pain despite being unconscious and this confirmed that he was alive. Karina looked closer at him, she said<br>\r\n<br>\r\n-\"This is incredible... I can't believe it's Blake...\"-<br>\r\n<br>\r\n-\"Something inside me told me to pick him up...\"-<br>\r\n<br>\r\n-\"You must thank it because otherwise you might have stepped on it and never know... or maybe he'd have ended up in a trashcan...\"-<br>\r\n<br>\r\n-\"Don't even say it... I wouldn't be able to live with myself if I killed Blake...\"- Joana said, imagining many possible bad endings for Blake's now tiny life.<br>\r\n<br>\r\n-\"Don't be worried. You were lucky and saved him. Now, it's your turn to protect him...\"- Karina said, noticing Joana's stress on imaginary situations. Joana snapped out of it and nodded. Blake had risked himself for his friends and her many times. Now that he was vulnerable, she had to take care of him.<br>\r\n<br>\r\nKarina placed her ear very close to his tiny body so she could hear his heartbeats. She could, and said to Joana<br>\r\n<br>\r\n-\"He'll survive, but you better take intensive care of him...\"- Then Karina reflexed, and looking at Joana, said worriedly -\"No!! You better take just light care of him!!\"-<br>\r\n<br>\r\n-\"Huh?!\"-<br>\r\n<br>\r\n-\"Let's admit it... You are a bit overprotective... So, keep it like that... if you're too overprotective you might end up hurting him...\"- Joana was annoyed at the remark but nodded. Karina cut a thin piece of the bandages she found and with that she could bandage Blake. He was still unconscious but moved, curling up. Joana thought it was cute, and Karina said<br>\r\n<br>\r\n-\"It means he's sleeping. Let him rest, he's had a hell of a day... and it's just 9:55...\"-<br>\r\n<br>\r\n-\"When does this class begin?\"-<br>\r\n<br>\r\n-\"10:00 AM\"- Karina replied<br>\r\n<br>\r\n-\"Uh...\"- Joana contemplated Blake. She wanted to kiss him, to hug him and to ask him how he got so small. Karina again noticed her look, and said<br>\r\n<br>\r\n-\"At least while he's hurt you shouldn't hug him... Blake has said that you give him death hugs... and that was at normal size... if you do now, he might be crushed like a bug...\"- Joana's look saddened, definitively it hurt her that she could injury Blake with simple moves.<br>\r\n<br>\r\n-\"Specially with those\"- Karina added joking, if you know what she meant<br>\r\n<br>\r\n-\"Hey!!\"- Joana didn't like the joke<br>\r\n<br>\r\n-\"It's true... with just one of them you might crush him...\"-<br>\r\n<br>\r\n-\"It's not funny Karina\"-<br>\r\n<br>\r\n-\"Okay okay...\"-<br>\r\n<br>\r\n-\"So, how do you think Blake is?\"-<br>\r\n<br>\r\n-\"I told ya, he's sleeping, but obviously, he won't wake up easily. His body forces him to sleep so it can repair itself... His energies must be low too, make sure he eats something when he wakes up...\"- Karina said while looked at Blake, who seemed quiet, sleeping, like there was nothing else in the world.<br>\r\n<br>\r\nThey heard the door open and Joana quickly picked him up, putting him again in her cleavage, Karina was both O_O and blushed in embarrassment. Joana replied<br>\r\n<br>\r\n-\"He might be hurt in my pockets, and my purse is no option...\"-<br>\r\n<br>\r\n-\"O...kay... just, don't squash him with your boobs or I'll kick your ass\"- Both her and Joana laughed. Now...</span></div></div>",
            "created":1285390800,
            "id":962914,
            "title":"Back to where we were..."
        },
        "141111":{
            "choices":[
                "Continue with the school day",
                "After School"
            ],
            "content":"<div class=\"\"><div> <span>As Joana and Karina laughed, the teacher and the rest of the students entered the class.<br>\r\n<br>\r\n“Well, what’s so funny you two?”<br>\r\n“Oh, nothing” the two girls said.<br>\r\n<br>\r\nWith that, the class started and the girls sat at their seats, worrying for little Blake. After what felt like forever, the class ended and Joana and Karina headed into the women’s room. Joana took Blake out and gave him to Karina.<br>\r\n<br>\r\n“How does he look. I’m just so worried about him.”<br>\r\n“Well, his wounds seem to have stopped bleeding and he’s a little bit more active. He should wake up soon.”<br>\r\n“Oh, thank the lord. I’ve just been so worried for him. He just so small...so vulnerable.”<br>\r\n“You’ve got that right. Let’s just hope he even remembers who he is.”<br>\r\n<br>\r\nJoana could only worry even more about him. What if he didn’t remember who he was? What if he didn’t remember who <i>she</i> was?<br>\r\n<br>\r\nMinutes passed. Joana lightly nestled Blake in her hands, running her finger along his small head. She could feel him in there. Suddenly, his head moved away from her finger, just ever so slightly. She jerked her hand slightly at his movement. She brought him closer to her face, wanting to see her dear Blake. <br>\r\n<br>\r\n“Blake. Blake. Can you hear me?” Blake slowly moved around.<br>\r\n“Ugh. Joana, is that you?”<br>\r\n“Yes Blake, it’s me. Thank the lord you’re alive.”<br>\r\n“Yes...Ugh, why is this floor so squishy and warm?”<br>\r\n“Um...Blake. Open your eyes.” Joana watched as Blake opened his eyes. At the sight of his now giant girlfriend, he fell back in complete shock.<br>\r\n“What in the!? Joana, how do you get so big!?”<br>\r\n“Technically speaking, she isn’t the one who changed Blake” Karina butted in.<br>\r\n“Wait, if you guys are...then I...SHRUNK?!?” He screamed in terror.<br>\r\n“Yeah...Look, we don’t know what happened. I found you in the hall at your small size. I’m just glad I saw you and didn’t...you know.”<br>\r\n“Yeah. So, what do we do now? I can’t stay small forever.”<br>\r\n“Well, I could try to figure out what caused you to turn small and make some kind of reversal serum, but I can’t make any promises.”<br>\r\n“Wait, really? Will it hurt?”<br>\r\n“Honestly, I have no clue. Since you had passed out before shrinking, you should pass out when it happens, but it’s not a certain.”<br>\r\n“Well, as long as I get back to normal, then I don’t care. So, when do you think you’ll have it done.”<br>\r\n“Again, no idea. These things take time. Um...I don’t know how to ask you this but I need some of your blood.”<br>\r\n“My Blood!?” <br>\r\n“Yes. Whatever caused your shrinking would be in your DNA, or at least traces of it.”<br>\r\n“Ok...”<br>\r\n“Oh wait. Joana, your hand.” Joana looked down at her hand, now red from Blake’s blood.<br>\r\n“Oh, well I guess you already have it.”<br>\r\n“Indeed. Now, I’ll have to get to the lab and start working on the formula. Joana, keep him safe.”<br>\r\n“Keep me safe? I can take care of myself, you know.”<br>\r\n“Blake, at your size, you can easily get hurt. Just let me take care of you.”<br>\r\n“Fine, but only because you’re my girlfriend.”<br>\r\n“Good, now I need to go to the rest of my classes. I guess you can ride in my backpack. Sound good?”<br>\r\n“Yeah.”<br>\r\n<br>\r\nWith that, Joana hid a Blake and headed Tom class.</span></div></div>",
            "created":1507597620,
            "id":2398901,
            "title":"The teacher and everyone else enter..."
        },
        "1411112":{
            "choices":[
                "Do it",
                "Decline"
            ],
            "content":"<div class=\"\"><div> <span>For the rest of the school day, it was mostly uneventful. Being in the backpack, Blake wasn’t too worried about being found and even ate a small bag of cheez-its. Finally, it was time for Joana and Blake to head home. On their way out, they spotted Karina in the lab, working on the serum. They decided to chuck up on her progress.<br>\r\n<br>\r\n“Hey Karina. How’s Blake’s reversal serum coming?”<br>\r\n“Well it coming. The only problem is that it’s taking forever because I’m working alone. Wait a second, where’s Blake?”<br>\r\n“Right here” called Blake, peeking out of the backpack<br>\r\n“Oh, well at least you look better. So as I was saying, without more people working on the serum, it’s going to take quite a bit.”<br>\r\n“Well why don’t you see if you can get more people working on it? I’m sure some chemists are sure to want to work on something so new like this.”<br>\r\n“Well...I could do that, but I’ll have to be careful and Blake, you need to keep from being found.”<br>\r\n“No kidding.”<br>\r\n“Blake, Karina...” Joana butted in. The two of them stopped bickering. “Good. Now, I think it’s time we get going. Good luck.”<br>\r\n“Thanks.”<br>\r\n<br>\r\nWith that, Joana and Blake left, anxious about the whole situation. Joana drove back to her house, still concerned with Blake’s injuries. While he may have been acting as if nothing was wrong, Joana could tell that he was in a lot of pain. Pulling up to the house, Joana picked up her backpack and took out Blake, placing him on her shoulder.<br>\r\n<br>\r\n“Ok, here we are. Let’s head inside.” She climbed out of the car and walked up to door, unlocking it. She opened the door and walked in, placing her bag by a table. She climbed up s flight of stairs and entered her room. Blake just sat on her shoulder, the pain obviously overwhelming him. <br>\r\n“W...wow. You have a...nice house.” Blake’s voice was broken, pain shooting through his body. Joana had noticed this.<br>\r\n“Blake, are you ok?”<br>\r\n“No, not really. My body I saw still killing me.”<br>\r\n“I bet. If only...wait. Maybe...”<br>\r\n“What?”<br>\r\n“Well, I could warm you up with my...my...” He started blushing now a bright shade of red. Blake look down at where Joana was looking.<br>\r\n“Wait, you...want to put me...between your breasts?”<br>\r\n“Well...I mean, I’m only trying to help you. If you don’t want to, it’s ok.”<br>\r\n<br>\r\nBlake thought for a minute. Joanna had been caring for him this far and nothing went wrong, so what could the harm be? Finally, he decided to...</span></div></div>",
            "created":1511197920,
            "id":2417690,
            "title":"After School"
        },
        "14111121":{
            "choices":[
                "Continue to the next day"
            ],
            "content":"<div class=\"\"><div> <span>He knew Joana cared for him, doing all she could to help him. If she was ok with it, then there was no reason for him to refute. Blake looked over to Joana.<br>\r\n<br>\r\n“Ok, if your alright with it.”<br>\r\n“I am.”<br>\r\n<br>\r\nShe brought her right hand around to her left shoulder and lightly picked up Blake by the back of his shirt. Slowly and carefully, she brought him around to her face, the two coming face to face. She brought him a bit closer and lightly kissed his forehead. She then slowly lowered him down, softly placing him in between her two breasts. Laying between the two blossoms, Blake’s whole body started warming up. His joints started relaxing, his muscles following close behind. It was like being surrounded by warm balls of wax. Joana looked down at her little friend, relieved to finally see him relaxed. As Blake closed his eyes to rest, Joana layed on her bed, dozing off as well.<br>\r\n<br>\r\nIt was late in the night when Joana woke up again. As she sat up, she looked down to see her prince, sleeping peacefully in the warmth of her breasts. Gently, she brought her hand towards him and lightly nudged his head. Blake slowly opened his eyes as he took in his unfamiliar surroundings. Unable to see much, he started feeling all around him, trying to figure out where he was. Joana softly spoke to him.<br>\r\n<br>\r\n“Blake, are you ok?”<br>\r\n“Ye...yeah. Ugh, where am I.”<br>\r\n“Here let me help you.” She lowered her hand down to Blake and cupped it under him, much to his shock. As she brought him out, he was able to see everything around him. His mind started racing, trying to comprehend what was happening.<br>\r\n“What? Where? What the heck?!?”<br>\r\n“Whoa Blake, calm down. Try to remember what happened.” Closing his eyes, he though back trough the day. <i>How did I get myself into this?</i> he thought to himself. He looked back up to Joana, who was obviously concerned again.<br>\r\n“W...wow. That was some sleep. I can’t believe we actually did that.”<br>\r\n“I still can’t believe your actually this small. How is your body?”<br>\r\n“Better. I’m still a bit sore, but definitely not as bad as I was. Thanks again for...you know.”<br>\r\n“Yeah. Anyway, I have some work to do before we head to school. We might as well do it now.”<br>\r\n“Oh, yay...”</span></div></div>",
            "created":1515480540,
            "id":2438638,
            "title":"Do it"
        },
        "1412":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Blake continued his climbing still being unnoticed...",
                "Joana feels something on her leg and picks it up...",
                "Reader's Choice..."
            ],
            "content":"<div class=\"\"><div> <span>Blake woke up, seeing everything partially blurred, he didn¡t recognize the place where he was at first, then, when he regained his vision, felt the ground trembling and heard a thunderous but known voice saying -\"Blake? I knew about Albert's fight...\"- Blake tried to wave his arms and scream to her but it was useless, he was about 2 cm, he even may get crushed by his gigantic girlfriend, but didn't care, and Joana continued saying -\"Don't run away sweetie, I know you don't want to worry me or get me angry but you never do, and I never scold you anyway...please come with me...\"- Joana was becoming sad, both because Blake was hurt, and he probably was getting away from her, but what she didn't know was that her very beloved boyfriend was closer than she would imagine ever...<br>\r\n<br>\r\nJoana left being sad and thinking about what might have happened with him, and Blake, who knew that at his size and without her he would be nothing, decided to get her atention and jumped on her foot. After a few steps, Blake began to climb up while heard a slght cry from Joana, she might have thought the worst, Blake couldn't see her like that and was decided to get her attention to make her know he's still alive...<br>\r\n<br>\r\n[NOTE: I don't know how is about U.S or Europe customs, and the school system is mixed both in this story, just take the fact that AT LEAST Joana and Blake take a shower everyday (even twice a day), this is not an obsession, is just that where I'm from, people takes a shower all days, and...Thats a good explanation for Joana's feet didn't smell that bad. By the way, you can choose between reggenerating Blake in next chapter or leave him injured as he was by his battle]</span></div></div>",
            "created":1227243600,
            "id":610305,
            "title":"She doesn't see him but he wakes up and get..."
        },
        "14122":{
            "author_id":"medic123",
            "author_name":"medic12345678",
            "choices":[
                "BLAKE!!?!?!?!?!??!?!??!??!?!?!?!??!?!?!??!?!?!?!",
                "BUG!!!!!!!!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"huh is this a bug?\" joana picked blake up and stared at you.....<br>\r\n<br>\r\nso choose </span></div></span></div>",
            "created":1513391580,
            "id":2428646,
            "title":"Joana feels something on her leg and picks it u..."
        },
        "142":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Karina takes Blake with Joana...",
                "Karina decides to keep him with her, at least for a while...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Karina was told by Ayrton what happened and after taking him to nursery she decided to go with Blake, since they were very good and long friends and Joana wasn't in there for the moment. She knew that Blake normally is able to handle things like those but this time was really bad. Karina thought to herself that she's gonna kick Albert as she did some years ago (but with Blake's help). She saw the disastrous place where the combat happened, it was horrible, blood stains in the floor, walls and the lockers, which were dented. No one was here, and she knew that Blake surely won and now went for his books for next class, if he lost he would be lying in there, unconscious, as some times that he lost a few fights and Karina was the one who helped him in those times.<br>\r\n<br>\r\nShe went to Blake's locker to look for him and take him to Joana who would be very worried about him, she walked toward there and while she did she had some strane thoughts, like why never they were together, they had more things in common and were longer friends than Joana and him, she even felt jealous about her because she had a better body, suddenly she stopped 'But what the hell am  thinking about?' she thought, reflexioning about that she has already a boyfriend and Blake only has been a very good friend, she began to walk again and the thoughts assaulted her...Blake's been just a good friend, but why, why never did she ask him out, why never nobody figured them as a couple...she was thinking again until she got to the locker, she saw the books thrown around and when she picked them up and put them into their place, and the most amazing was a tiny strange kind of bug...but it seemed like Blake...she thought she was hallucinating but she grabbed him (he was unconscious) and took a closer view, she couldn't believe it, and for a strange reason, he looked very cute to her, maybe because she never thought Blake as a defenseless one -\"I can't believe it...Blake's tiny...aww and it looks so cute...\"-she said in a caring tone. Then...</span></div></div>",
            "created":1224392400,
            "id":597456,
            "title":"Karina comes..."
        },
        "1421":{
            "choices":[
                "Goes home",
                "meets up with Karina",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Karina then headed towards class and slid into a seat next to Joana. She leaned over and whispered, \"Hey psst! Joana! Hold out your hand!\" Joana, busy writing down something, absentmindedly holds out her other hand. Karina places the still unconscious Blake in her hand. Joana closes her fist and places it in her lap. She finishes writing and opens her hand. She gasps, then closes it again. She furiously writes a note to Karina. She folded it and passed it to Karina opened it and read:<br>\r\n   <br>\r\n      *Where did you find him?*<br>\r\n      She wrote back: *Near his locker, he was passed out. Take good care of him*<br>\r\n<br>\r\nJoana read this, smiled at Karina, then put Blake in her pocket. After class, she...</span></div></div>",
            "created":1240808400,
            "id":682733,
            "title":"Karina takes Blake with Joana..."
        },
        "14212":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Her bra...",
                "Reader's Choice..."
            ],
            "content":"<div class=\"\"><div> <span>Joana sent another note to Karina where she wrote \"Meet me after class, ok?\". Karina continued writing down the homework.<br>\r\n<br>\r\nAfter school, Joana and Karina went out of the school and they met, Joana was very worried and said <br>\r\n-\"Thanks for giving me Blake but... how the hell did he got that small?\"-<br>\r\n-\"I don't know, you better ask him that when he wakes up...\"- <br>\r\n-\"Yeah, you're right\"- <br>\r\n-\"You should be more concerned about his wounds, he's been dealt a lot of damage\"- <br>\r\n<br>\r\nJoana gasped and recalled hat Blake was awfully injured -\"What happened to him? Why is he so hurt?\"- -\"Albert...\"- Karina said slightly angrily <br>\r\n-\"You're kidding me, aren't you?\"- Karina remained silent and Joana said <br>\r\n-\"That monster?! He's a mastodon!! How could Blake...?!\"- Karina looked down <br>\r\n-\"He engaged him to save both my boyfriend Ayrton and Ferdinand...\"- Joana sighed and remembered how brave Blake has always been. He was willing to get some damage as long as he protected his friends (and girlfriend, time later...)<br>\r\n<br>\r\n-\"Blake seems to be cold, but he's so brave and cute...he prefers to be hurt himself instead of someone else...\"- Joana said, Karina smiled and nodded, she knew Blake for longer time but she was still amazed with his attitude -\"Blake's a good boy, even when he doesn't act every time as one\"- Karina and Joana laughed for a moment. Then, Karina said <br>\r\n-\"I better go to see Ayrton, he's been hurt almost as badly as Blake, and he's not as strong as him, you lucky, you had to get the best fighter in here, heh\"- Karina said the last phrases joking, and said goodbye, then she left. While Karina was getting away, she said in a funny way <br>\r\n-\"You better take good care of him or I'll kick your big ass!!\"- Joana laughed at that (Karina was her best friend exceptuating Blake). Then she gasped and said <br>\r\n-\"Damn!! I forgot Blake's hurt\"- She looked Blake (in her chest pocket) and saw that he, still unconscious, twisted slightly in pain, she thought 'He must not be very comfortable in there, my breast doesn't leave much space for him at all' She smiled and thought 'I should put him in a better place' So, she took him out and headed to her house while Blake was still knocked out in...</span></div></div>",
            "created":1241067600,
            "id":684416,
            "title":"meets up with Karina"
        },
        "143":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Blake wakes up...",
                "Lillian wakes Blake up...",
                "Someone comes in..."
            ],
            "content":"<div class=\"\"><div> <span>Lillian was going to her locker when she saw Ayrton and Ferdinand very injured and asked them what happened. They told her about Albert and the fight, and then she asked for Blake (she has a crush on him despite she's a Joana's friend). Ayrton answered <br>\r\n-\"I don't know exactly...he surely must be with Joana who is probably healing him...or maybe he's going to his classes without worrying about his wounds, you know how's Blake...he's still a lonely wolf despite having a caring girlfriend\"- <br>\r\n-\"Yeah...Blake isn't of the ones who runs with mommy to heal his wounds...in his case, Joana, but I'm sure he'll be in next class\"- Ferdinand said. Then they left to go to the nursery. Lillian thought 'I better go with him, he may not be with Joana at this moment' And she went to the lockers, finding Blake's and was amazed that it was open and the books were thrown around.<br>\r\n<br>\r\nShe picked them up and put them again on its place, then she looked at a little strange thing, it looked like a bug, but for some reason it resembled to Blake, she rubbed her eyes thinking that her feelings to Blake may have become pathologic, she thinks 'Seeing Blake everywhere? This is wrong' and picked it up to have a closer view. she gasped when she realized that it was a very tiny Blake...who for some unknown reason became this small, she the felt so happy, it was like a gift from heaven, now she'd at last have Blake for her, or at leats, that's what she thought.<br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1224824400,
            "id":599457,
            "title":"Lillian comes..."
        },
        "144":{
            "author_id":"shadow_blade",
            "author_name":"Blake",
            "choices":[
                "Cinthya decides to use him as seat to punish him for refusing to go out with her",
                "Cinthya decides to force him to be her boyfriend or at least slave",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Meanwhile...<br>\r\n<br>\r\nCinthya watched the amazing fight from away, where Blake would not notice her. she didn't still understand why Blake refused to go out with her since she was one of the most popular and beautiful girls in school (for almost anyone, but really, Joana, is a lot more beautiful than her and is a good and kind person). She still wanted Blake for herself, she liked him since the high school started (10th grade and forward, they're actually in 12th). He appeared as a silent and lonely one but when the bullies challenged him he finished them impressively. And his way to be, though and determinate Cinhya had never seen someone like him, and her particular tastes for exotical things made her like him even more (Blake is latin, and in fact speaks spanish perfectly but he almost never does). But then appeared that he had a girlfriend and it was a girl of the classroom, Joana, Cinthya didn't even know about their story and when she was told, she didn't care and tried to ask out Blake in any way, she even tried to kiss him by force to show Joana that he'd cheat her for such a girl like her, but it didn't work, Blake refused and said that Joana was the only girl he loved.  For her closed mind, she would never understand that, despite knowing some things about their past.<br>\r\n<br>\r\n(Returning to the moment where Cinthya was looking the combat). She saw how Blake left being brutally wounded, he had to grab the lockers to stand up and went to his lockers. He knew Joana would worry about him and his state. And the worst was that Albert wasn't finished off, he resulted very damaged but he had sill enough strenght to crush Blake and friends to dust. Cinthya (who admired the fights but never really cared about them) knew that Albert would return to finish Blake and she didn't want that (Even when he refuses to be her boyfriend, she has still hopes to make him break up with Joana). She decied to intervene, she went with Karen and Thania and then they talked to the football team (friends of them as they were popular and Cinthya was a cheerleader)<br>\r\n<br>\r\nShe asked them a favor and then she told them what happened and that she wanted them to finish Albert, one of the guys said -\"Are you crazy? Almost anyone can't stand in front of him!! and only some stupid ones like Blake would fight him\"- She slapped him and said angerly -\"Hey! Don't talk like that about him, and I know he's a though one, Blake was barely able to stand the fight\"- -\"And there are two facts: One, Albert isn't at full strenght, he has been very weakened by Blake, and two, you will fight him in a very numeric advantage, I mean, you're 6 (the ones who came to her call, the others were in classes) and he's just 1. And you're very strong also. Even 1 or two of you may defeat him at his current state\"- added Karen. -\"Well...I guess we can, anyways, we have many reasons to punch that bastard, and this would be the moment to beat him\"- added the first guy -\"Yeah! Let's kick asses\"- added another and they all were agree with going to blow Albert. But then one of them asked -\"But what thing do you have with Blake? I mean...he can take care of himself, and we have gotten conflicts with him, you know, we've fought him several times by our own reasons...and, anyways, he has a girlfriend and has refused to leave her\"- Cinthya slapped him as she did with the first one and said -\"Blake will be mine...and that's not your business after all...and about you fought him...you are the stupid ones because you know he only fights with bullies, and when you threaten his friends or that damned bitch he will appear\"-<br>\r\n<br>\r\nThen the guys went to attack Albert, they were barely able to beat him even at his state and Albert could knock out 5 of 6 guys who fought him. Then they threatened him to not appearing close to Blake or they'd return.<br>\r\n<br>\r\nWhile they did this, Cinthya tried to use what she did as a chance to get Blake, and went where he should be, his locker, then she saw it opened and the books thrown around, her first thought was that the guys didn't beat Albert but when she called them by phone she confirmed they did, so, she looked at the place with more attention to get a clue about where would be Blake, then she looked a strange little thing, it looked like a little doll but she reasoned that Blake would not have dolls, and after some seconds she gasped, the \"doll\" had the same clothes as Blake, she decided to pick it up to get a closer view. -\"I can't believe it...the destiny gave me a great gift\"- muttered to herself, realizing that Blake was unconscious, tiny, and at her mercy...</span></div></div>",
            "created":1224738000,
            "id":638630,
            "title":"Cinthya comes..."
        },
        "15":{
            "choices":[
                "Eat",
                "Clean room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A lady in a red hat, I am I am.</span></div></span></div>",
            "created":1236056400,
            "id":655772,
            "title":"Reader's Choice"
        },
        "151":{
            "choices":[
                "Eat a chicken",
                "Eat myself"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I eat a cow. Yay!!!!!!!!!!!!!!!!!</span></div></span></div>",
            "created":1236056400,
            "id":655773,
            "title":"Eat"
        }
    },
    "info":{
        "author_id":"shadow_blade",
        "author_name":"Blake",
        "brief_description":"A different GTS/Shrinking story. Check it out! Rewards for adding.",
        "created":1222488420,
        "description":"<td align=\"left\" class=\"norm\">PLEASE ADD!!<br>\r\n<br>\r\nBlake has shrunk while he was with his girlfriend, and now he must try to survive...<br>\r\n(GP reward for good chapters :). Please add. By the way, this is a bit different than some other giantesses stories, check it out!)<br>\r\n<br>\r\nMain Characters:<br>\r\n<br>\r\nBlake (Main character): Tall and strong 16 years old latino boy (long black wavy hair and black eyes). He used to fight a lot at school (but he never was suspended, and only fought bullies who threatened him, his friends or Joana, and almost doesn't fight actually since 9th grade, just some times in streets and not for fun, and...yeah, he has a kind of honor code about fighting but fortunely or unfortunely the fights remained in the past) <br>\r\n<br>\r\nBy the way, He's very smart and even gets high notes without studying for exams, just bad in Math and Physics (number things). He has a muscular body due to his fighting life and soccer playing, his skin is tanned.<br>\r\n<br>\r\nJoana (Blake's girlfriend): 17 years old beautiful girl (dark brown long wavy hair, hazel eyes,D-cups and a very big ass, clear skin). She loves Blake since 7th grade but he realized about that and decided to be her boyfriend until 11th grade. <br>\r\n<br>\r\nShe was his best friend since they met in 7th grade and was the one who was almost always with Blake and healed his fight wounds, she's the only one who knows who is really Blake.<br>\r\n<br>\r\nSecondary Characters:<br>\r\n<br>\r\nKarina (17 years old): A good friend of Joana and Blake, she's cute but isn't Blake's type. She doesn't seem to have more interest about him than friendship and she probably would help if Blake was in trouble (But Joana was the one who has done that the whole time). <br>\r\n<br>\r\nBlonde with green eyes and short hair. She's Ayrton's girlfriend. Longest female friend of Blake, they met at 4th grade and she was a fighting since those days. She has still fighting skills depite she fights less to be more feminine, and helps Blake in fights where he's losing by physical disadvantages or numerical...Her body is possibly B cups and slim hips. Green eyes<br>\r\n<br>\r\nCinthya (18 years old): Beautiful and very popular latino girl who wanted Blake for herself and almost did it until Joana appeared (Blake was keeping in secret his relationship because his mother is a true demon who hits him with a cable since he was 5 years old. But it was revealed to the classroom when she almost kissed Blake by force...<br>\r\n<br>\r\n[He refused because really loves Joana and wouldn't do such a stupid thing after he was an idiot by 4 years...] and Joana appeared to stop her). Her feelings toward Blake now may go from still wanting him for her to hating him (she hates more to Joana). She has black hair, small boobs and a nice butt (Joana's is better but almost everyone drool for Cinthya's). Dark brown eyes<br>\r\n<br>\r\nClaire: 17 years old. Blake's friend (since 3th year, second longest one since Karina). Very beautiful and the only one even Blake has thought could rival Joana. C-Cup breasts and a big butt (slightly smaller than Joana's, still better than Cinthya's). Her differences with Joana are that she has Asian-like black eyes which look very sensual, while Joana's are big, light brown and cute. <br>\r\n<br>\r\nAlso, though Joana's thighs are thicker, Claire's seem slightly thinner and longer, the other difference is that she has a bit of tummy (and Joana not, because she played volleyball and basketball, and not enough to be called fat, in fact, it makes her to look cute). She has black straight hair worn as a ponytail. She hugs and kisses Blake (in cheek) more often than Karina, causing Joana to be jealous of her. <br>\r\n<br>\r\nThough she's aware Blake has a girlfriend, most of times she doesn't pay attention to it, as she only acts friendly. Her feelings to Blake have never been clear as she acted as protective as Joana in the time they didn't know each other. Some times it seems Joana wants to just kill her (And Blake has to appear to prevent it)<br>\r\n<br>\r\nShe's very likely to help and taking care of Blake, but due to her relationship with Joana, it's not very probable she'd give him back to her (She also acts some times jealous as Joana has a better body and is Blake's girlfriend)<br>\r\n<br>\r\nAyrton: 17 years old boy. Blake's second best friend (since secondary). Short and tanned. He fights along Blake sometimes but he really isn't a fighter, just an average guy.<br>\r\n<br>\r\nFerdinand: 18 years old boy. Some sort of mixture between a goth and a nerd (He has practically the same intelligence level as Blake but he's better in Math and Physics while Blake's better than him in the rest of subjects). He's Blake's third best friend. And is stupidly in love of Cinthya (Physic: a bit shorter than you,thin,dark brown curly hair).<br>\r\n<br>\r\nKaren: (17 years old): Nerd/Geek girl. Cinthya's friend and accomplice. she hasn't practically own will and does every thing that Cinthya tells her to. (red hair, small breasts and a very big butt. She's not really pretty because she's flabby and a bit fat). Blue eyes<br>\r\n<br>\r\nThania: (16 years old): Average popular girl, Cinthya's friends but she's the least evil one. She seems to have a crush on Blake but she respected Joana since she had known Blake more time than her (light brown wavy hair and body like Karina's, but she's shorter). Hazel eyes darker than Joana's<br>\r\n<br>\r\nLillian (16 years old): A Joana's, Blake's and Ayrton's friend. She seems to have a crush on Blake and Ayrton but hides it because of Joana and Karina. She's the tallest girl with long black hair, small but round breasts and a HUGE ass (biggest of those characters). Brown eyes<br>\r\n<br>\r\nRULES:<br>\r\n-No gay/lesbian stuff<br>\r\n-Joana's not evil.Even if she turns into a giantess.(The other characters can go free about their behavior to Blake)<br>\r\n-No parents<br>\r\n-Feet are ok but take on count that Blake doesn't particularly like them.<br>\r\n<br>\r\nPlease add and enjoy!<br>\r\n<br>\r\n<br>\r\n  </td>",
        "id":1478179,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1515480540,
        "modified":1515480540,
        "pretty_title":"Shrunk with your girlfriend/GTS"
    }
}