{
    "chapters":{
        "1":{
            "author_id":"gawayne",
            "author_name":"DJ Jaxx",
            "choices":[
                "WG",
                "TF",
                "AP/AR",
                "Grow/Shrink",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens to our Psychic type Gym Leader?</span></div></span></div>",
            "created":1296882000,
            "id":1048389,
            "title":"Start."
        },
        "11":{
            "choices":[
                "Simply vore.",
                "Addiction to food.",
                "A new psychic technique.",
                "She feeds on the energy of the cosmos.",
                "Other reasons."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How or why should Sabrina gain weight?</span></div></span></div>",
            "created":1297314000,
            "id":1051649,
            "title":"WG."
        },
        "111":{
            "author_id":"therealfake",
            "author_name":"Therealfake",
            "choices":[
                "She wakes up and gains only a moderate amount of weight",
                "Sabrina has gained a massive amount of weight from her meal",
                "Sabrina cannot sleep. She still hungers..."
            ],
            "content":"<div class=\"\"><div> <span>\"BBBUUUUURRRRPP!!\"<br>\r\n<br>\r\nSabrina licked her chops as she patted her swollen belly. The last trainer she had faced lost here so as punishment, she decided to swallow her up along with her Pokemon. Well, not really punishment. Lately Sabrina had been ravenously hungry and needed food something fierce. In a fit one day, her appetite got the better of her and she swallowed up one of the trainers who came to this Gym.<br>\r\n<br>\r\nThe taste had been so delectable that she wanted more.<br>\r\n<br>\r\nSo she decided recently to use her position as Gym Leader like a ploy of sorts; whenever trainers came to challenge her and lost, she would swallow them up for a nice, quick and easy meal. Sabrina purred as she rubbed her swollen belly, which grounded her thanks to how packed full it was. She couldn't wait to see what happened when she digested her meal. One thing she noticed was that heavy meals like this, of course, were chock full of calories. She could easily pack on a large amount of weight from even her \"Small\" meals. Not that she minded of course. As long as the meals were good, what was some extra fat anyway?<br>\r\n<br>\r\nSabrina yawned as she laid back. She figured now was as good a time as any to sleep, let her meal digest and become plush, jiggly body fat for her to enjoy, licking her lips once more on reflex as she rubbed her large, bulging and packed full belly.</span></div></div>",
            "created":1358398800,
            "id":1510279,
            "title":"Simply vore."
        },
        "1111":{
            "choices":[
                "Nothing her boobs and stomach are blocking her view.",
                "A huge belly (her breasts have not grown)",
                "Huge breasts (her belly only grew a little)"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina wakes up and sees a pot belly that stickes out a foot and a half. She gets dressed into a blue top and her normal white trousers. Her top only just covered her belly. She hears her belly rumple so she decides to go out for pancakes. When she gets their it is empty exept for the waitres and cook. She sits down and orders a 10 stack of pancakes with chocalate and caramel sauce (this a lot for her). After an hour the waitres comes and said that they just started cooking her food and that it will be ready in half an hour. She waits and the waitres says the food will take another hour to prepare. Sabrina gets angry so she stands up and holdes the waiter and puts the waiters head in her mouth and swollows her. She goes straight to her belly which makes it stick out a lot. She then goes into the kitchen and swollows him whole. This is to much for her top and trousers. They rip and now she is standing in the kitchen in only her bra and underwear. She then decides to not let the food go to waste and eats all of the food in the kitchen which is a lot. Shortly after she eates the last burger her underwear and bra snap. Now she is standing in the kitchen naked. She hears a door open and quickly uses her physic powers to telaport home. She then goes into bed and sleeps. When she wakes up and stands up, when she lookes down to the floor she sees.....</span></div></div>",
            "created":1441688400,
            "id":2031694,
            "title":"She wakes up and gains only a moderate amount o..."
        },
        "112":{
            "author_id":"templir",
            "author_name":"darkrai",
            "choices":[
                "Sonia",
                "Brock",
                "A Mysterous Voice"
            ],
            "content":"<div class=\"\"><div> <span>Sigh,\"So bored. I know being a Gym Leader can be slow, but this is ridiculous,\" Sabrina muttered to herself.<br>\r\n<br>\r\nIt had been three weeks since the last trainer had come to the gym. In those three weeks she had run out of things to occupy her time. Training her pokemon was pointless if no one came to the gym.<br>\r\n<br>\r\n'Like they need it,' she thought with pride at the strength of her pokemon. Sadly the thought only lifted her spirits for a short time. Running her hand through her metallic blue hair one last time, she got up from couch and walked into her kitchen for something to eat. Walking to the her fridge, she begins to pull out a pre-made green salad. Something behind it catches her eye, reaching passed the salad, she pulls out a plate with a piece of chocolate cake on it.<br>\r\n<br>\r\n'Hmmm, I don't remember putting this in the fridge.' She thought. Suddenly the memory come to her. <br>\r\n<br>\r\n<i>\"Hey cuz,\" said a loud teen age girl as she twirled in a circle in front of Sabrina. Sabrina just glared at her cousin. <br>\r\n\"What do you want, Sonia?\" The young girl twisted her cyan colored hair. <br>\r\n\"You missed my birthday,\" Sabrina's eyes soften. <br>\r\n\"Sonia, I am so sorry. I have been so busy at the gym I forgot.\"\"I know so I brought you a piece of birthday cake.\" </i><br>\r\n<br>\r\n'Sonia.' <br>\r\n<br>\r\nGrabbing a fork from the silverware drawer, she sat down at the table. She stared at the cake for a few minutes. 'When was the last time I had sweets?' She looked down at her trim, fit body. She had worked so hard to keep herself fit. Shaking herself out of her thought, she shrugged. 'One piece of cake isn't going to kill me.'<br>\r\n<br>\r\nTaking a small bite of cake, she nearly dropped her fork. \" Oh my god!!!\" she whispered breathlessly. The sudden burst of flavor caught her off guard. She quickly devoured the cake. Leaning back in her chair and sighed in content.<br>\r\n<br>\r\nRing, Ring<br>\r\n<br>\r\nGetting up, she made her way to the phone.</span></div></div>",
            "created":1317099600,
            "id":1196226,
            "title":"Addiction to food."
        },
        "113":{
            "choices":[
                "Misty (lost weight), Leaf, May, Candice",
                "Ash, Gary, Bredan, Bugsy",
                "Yellow, Green (Female), Sapphire, Crystal"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina had learnt a new trick. She could move the fat from one person to another. She had learnt this when talking to her friend Misty and saw this fat guy walk by. She thought how misty would look like with is big pot belly. Then the guy suddenly be came thin while misty gained a lot of weight. Sense then Sabrina has been able to transfer one persons that to another person. She had an idea and invited some people over to use her power on.</span></div></div>",
            "created":1441688400,
            "id":2031697,
            "title":"A new psychic technique."
        },
        "1133":{
            "choices":[
                "They do what Sabrina wants",
                "They do it in reverse"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina invited her new friends Green (23 years old), Yellow (20 years old), Crystal (19 years old) and Sapphire (17 years old). Once they came Sabrina thought they could go to the new posh clothes shops then go to the food court (to use her powers). </span></div></div>",
            "created":1441688400,
            "id":2031746,
            "title":"Yellow, Green (Female), Sapphire, Crystal"
        },
        "11331":{
            "choices":[
                "They buy food first",
                "Sabrina powers first"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sabrina and the gang go to the clothes shops and buy new clothes. Sabrina buys earings, Green buys a skirt, Yellow buys an hat, Crystal buys a jumper and Sapphire buys a zip up shirt. Once they bought the clothes they went to the food court.</span></div></span></div>",
            "created":1441688400,
            "id":2031751,
            "title":"They do what Sabrina wants"
        },
        "113311":{
            "choices":[
                "Not eat but exercise to loss the weight",
                "Eat because just one snack couldn't be bad"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina and Crystal got a Torchik salad each, Yellow got a medium Magikarp pizza, while Green and Sapphire both got a large Milktank burger with chips. Once everyone had finished their food Sabrina thought it was time to use her powers. She found 3 fat men and 2 chubby laddies. She decided to give Green a big pot belly which stuck out 3 feet from one of the men. She gave Crystal a belly that stuck out 60 cm from one of the girls. Sapphire got a belly that stuck out 2 feet from another of the men. Yellow got a belly that stuck out 3 feet from the last man. Sabrina gave her self a 30 cm belly just so the other would no be suspicious. Also the breasts grew so now Green was in DD area, Sabrina DD area, Yellow just over C, Crystal D area, Sapphire D area. All of the girls exept Sabrina are suprised by their grow. They decide to go to Sabrina's home and 'sort the problem' out their. Once they get to Sabrina's home it is 11:30 this is because of the new weight making the car go slower. All of the girls had no clothes that fitted so they slept in the nude. Sabrina in her bed, Green on the couch, Sapphire in the guest bed, Crystal in the other guest bed and Yellow in an arm chair. In the morning they were woken by there growling bellies. They decided to </span></div></div>",
            "created":1441774800,
            "id":2032068,
            "title":"They buy food first"
        },
        "114":{
            "author_id":"gawayne",
            "author_name":"DJ Jaxx",
            "choices":[
                "To face a challenger (Instant gain)",
                "To meet her blind date (Gradual gain)",
                "To a meeting of Gym Leaders (Emotion based gain)"
            ],
            "content":"<div class=\"\"><div> <span>It was mid afternoon in Saffron City, and Sabrina was in her Gym meditating.<br>\r\n<br>\r\nThe other night she had developed a method of increasing her already psychic powers by syncing her mind with the universe. She had worked all night, sitting quietly and not moving in the very least until finally she had attained some kind of control over it.<br>\r\n<br>\r\nShe could feel the immense power coursing through her veins, filling her with might. The Psychic-type trainer was also trying to find a way to transfer this power to her Pokemon to strengthen them, but for now she had to master containing it within herself.<br>\r\n<br>\r\nOvernight she had taken in as much as she could hold and finally found a way to balance it...Or so she thought.<br>\r\n<br>\r\nFinally though, she had to get up.<br>\r\n<br>\r\n\"Well, it looks like I better get going if I don't want to be late.\"<br>\r\n<br>\r\nSabrina was headed...</span></div></div>",
            "created":1297400400,
            "id":1052308,
            "title":"She feeds on the energy of the cosmos."
        },
        "1141":{
            "author_id":"unland445",
            "author_name":"Unland445",
            "choices":[
                "...around 300 lbs!",
                "...around 600 lbs!!",
                "...around half a ton!!!"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina the Psychic Pokemon Master of Saffron City entered the main battling arena from her meditation chambers to meet the opposing trainer in her gym. At first glance, he looked like your run of the mill curious trainer from some podunk town. But with her universally synced mind, Sabrina was mentally blown away from his immense aura. This kid was not your average trainer, no one could match that level of determination even with years of mastery.<br>\r\n<br>\r\nSlightly impressed, Sabrina smirked and placed her hand on her hips to strike a pose. She began her practised opening monologue that she had repeated to other kids hundreds of times. “I knew you were coming...three years ago I had a vision of your arrival.” She lied to the kid, who raised his eyebrows in slight shock. While Sabrina can predict when and who will enter her gym, she focuses her Psychic powers on more pressing work. <br>\r\n<br>\r\n“You're after my Badge. I don't enjoy battling, but it's my duty as a Leader to confer Badge on anyone who has proven himself worthy.” Again, she lied. Sabrina does not let anybody know this, but she actually loves to battle her Pokemon. The shedding of their Psychic attacks is absorbed into her soul, making her even more powerful as a Psychic.<br>\r\n<br>\r\n“Since you wish it, I will show you my psychic powers!\" With that, Sabrina ended her speech and called out her first Pokemon. Tossing her Pokeball into the air, the metallic sphere opened to spew out liquid light. From that light came the Sun Pokemon, Espeon, already in an attack stance. The child on the other end of the battlefield and appraised the Psychic Eeveelution to determine the best course of action. After some time, the kid finally revealed his opposing Pokemon, a Beedrill.<br>\r\n<br>\r\nSabrina once again felt the energy of the cosmos flow through her blood. She could feel the impossible strength of the bond between the Beedrill and it’s trainer. The look the two of them shared was not that of bond between master and slave; it was a special kinship forged in fire that could not be broken. <br>\r\n<br>\r\nUnbeknownst to Sabrina, the resulting surge in energy from the great beyond had altered her physical figure. Instead of absorbing into her soul like her Pokemon attacks, the energy stuck to her body in the form of fat. It was hardly noticeable, a sliver of jiggle weight on her stomach and arms; but it was there. It was hungry from more of this kid’s auru to expand.<br>\r\n<br>\r\n“Espeon, use Psychic!” Sabrina ordered, starting the battle off. The Sun Pokemon’s eyes glowed neon pink, and a beam of raw energy burst from it’s forehead, aimed right at the Beedrill in front of it. <br>\r\n<br>\r\n“Beedrill, dodge it!” The kid instructed. The Beedrill effortlessly move out of the beam’s way, forcing it to crash into the wall behind him. Sabrina, once again, felt the rush of power from the Universe as she absorbed both her Pokemon’s attack and the Trainer’s aura. Her frame bloated again, this time even more pronounced as more energy was flooded into her body. She had no idea what it was doing her waistline, but Sabrina was left wanting more.<br>\r\n<br>\r\n“C-confusion!” Sabrina ordered, a bit excited from her last surge. The Espeon worlessley obeyed and casted it’s attack. The Beedrill couldn't dodge it this time. <br>\r\n<br>\r\nBut much to the Espeon’s own confusion, the Beedrill did not even flinch as it’s mind turned into mush. No crossed yes or frantic movements, absolutely nothing! <br>\r\n<br>\r\n“Beedrill, take advantage and use Poison Jab!” The Kid ordered. To both the Espeon’s and Sabrina’s shock, the Beedrill simply gritted it’s teeth and turned it’s head to the side violently, casting off the confusion like swatting a fly. With incredible speed it zoomed across the field and delivered a poison laced blow to the Psychic Eeveelution, knocking it to ti’s feet.<br>\r\n<br>\r\nThis time, Sabrina’s body not only expanded, but also blew up. Her slim, washboard stomach now carried a potbelly, her breasts and ass ballooning out somewhat, stretching against the fabric of her clothes. Her hips and thighs grew, and her facial featured became less defined. And although she still has failed to recognize her new weight, the Kid and the Beedrill certainly have.<br>\r\n<br>\r\n“What?” Sabrina asked impatiently as the two of them tilted their heads at Sabrina’s fattened body. Was she like this when the battle started? “Stop staring at me and get on with the battle! Espeo, use Psybeam!”<br>\r\n<br>\r\nAnd so the battle continued, the overpowered Beedrill and the rest of the Kid's Pokemon easily crushing Sabrina's team of three. And all the while, she became fatter and fatter, much to the shock of the opposing trainer and his Pokemon. By the end of it all, the Kid and won, and Sabrina had expanded to...</span></div></div>",
            "created":1524027000,
            "id":2481122,
            "title":"To face a challenger (Instant gain)"
        },
        "1142":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "He looked normal and skinny.",
                "He seemed to have \"filled out\", as he was a bit chubby",
                "He has grown taller \"and\" chubbier"
            ],
            "content":"<div class=\"\"><div> <span>(this is my first ever submission so please critique if needed)<br>\r\n<br>\r\nAs Sabrina walked out of the Saffron Gym, she couldn't help but remember her friend, Misty, telling her to get a social life somehow. On top of it, the other fellow Kanto female Gym Leaders agreed and got Sabrina hooked onto a \"blind date\" of sorts. What's more, she had to wear a fancy red dress the was strapless and had a slit exposing her legs.<br>\r\n<br>\r\n\"Well, it's a break from the monotony I suppose. Maybe the guy is nice...\" pondered the psychic. Sabrina didn't really care for looks, despite her winning second place in the Kanto Beauty Contest(Lorelai of the Kanto Elite 4, for the fifth time in a row...). With her psychic powers, she can sense the emotions of others.<br>\r\n<br>\r\nAfter walking for a few minutes, Sabrina has reached her destination, one of Saffron's finest Restaurants: The Yellow Wing.<br>\r\n<br>\r\nSabrina was without a doubt impressed by the selection her blind date(whom they met over e-mail) as the Yellow Wing was one of the most fanciest and most expensive restaurant in the city. Now one thing she knew that her blind date was loaded, but that made the psychic at unease.<br>\r\n<br>\r\n'Maybe he is one of the rich cocky types...well...no time to ponder, better head on in' thought the obsidian haired beauty. She walked on in and meet the front desk. The Yellow Wing had a <i> front desk</i> for crying out loud.<br>\r\n<br>\r\n\"Hi there, I was wondering if the reservation for a Sabrina Hawthorne is on your list?\" asked Sabrina to the front desk man. He looked down to check on his PC screen.<br>\r\n<br>\r\n\"Ah yes. You're other guest as arrived about 5 minutes, please come in\" soothed the man as he escorted Sabrina to the dining room, which looked like something out of a palace. Chandeliers, fancy paintings and curtains, ice sculptures, everything. It made Sabrina feel a bit small.<br>\r\n<br>\r\nShe has reached the table, and to her surprise, sitting down waiting for her in a fancy suit was none other than Ethan Goldstein, the boy who became Johto's Regional Champion and the man who attempted to climb the Kanto Elite 4 ladder at Mt. Silver. But after defeating Cathy Greenspring, Lily Yellowflower, Gary Blueoak(who ascended from Gym Leader to Elite Four) and then to even Lorelai Icemaker, he fell short to none other than the Kanto Regional champion himself: Ash Redside.<br>\r\n<br>\r\nThe boy turned towards her with a smile on his face. \"Hey Sabrina!\" He got up and...</span></div></div>",
            "created":1297486800,
            "id":1052631,
            "title":"To meet her blind date (Gradual gain)"
        },
        "11422":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "She was so full~ and felt good to feel the pain of being stuffed...",
                "For some reason, she did not feel full whatsoever. She felt nourished though"
            ],
            "content":"<div class=\"\"><div> <span>\"Ah, hello Ethan\" smiled Sabrina. She walked to him and shook his hand. Upon further inspection, he has gained some weight when they last met.<br>\r\n<br>\r\nEthan's face was still the same, but his belly was a bit wide, in addition to thicker legs and a plumper backside. Still, her psychic powers told her that Ethan is happy to see her.<br>\r\n<br>\r\n\"I see that you are the blind date Misty set me up for, is that right?\" asked the boy. He was still a bit handsome, even with the extra pudge. Sabrina nodded.<br>\r\n<br>\r\n\"Yes, she set me up as well.\" They sat down at the table and placed the napkins on their laps and looked at their menus.<br>\r\n<br>\r\n\"Wanna order first? I'm starving!\" said Sabrina. Ever since she was able to get in tune with the cosmos and become enlightened, an odd feeling radiated from her stomach, as if she was hungry. Ethan beamed.<br>\r\n<br>\r\n\"I was afraid you'd never ask! Don't worry about the bill it's on me\" winked the Johto champion. Sabrina was touched by the offer.<br>\r\n<br>\r\n\"Why thank you Ethan\" smiled the psychic. The waiter then arrived. Ethan ordered 3 tofu prime ribs meals, which included mash potatoes and biscuits for each meal. As for Sabrina...<br>\r\n<br>\r\n\"I'll order a...\" her first thought was to say 'garden salad' but something told her to order something more...<br>\r\n<br>\r\n\"I'll have what my date is having, in addition to two Magikarp filets\" finished the psychic. The waiter nodded as he wrote it down and walked off.<br>\r\n<br>\r\n\"Someone's hungry tonight\" chuckled the bigger boy. Sabrina read his emotions, he was attracted no doubt, but also there was a hint of amusement and playfulness as well. Sabrina blushed.<br>\r\n<br>\r\n\"Well...it's quite stressful being a Gym Leader and all that. And a girl needs to eat\" explained the girl. Ethan nodded.<br>\r\n<br>\r\n\"Cool, cool. So what have you been up to?\" asked Ethan as he started to munch on a breadstick, Sabrina took one too. She shrugged as she ate. Once she finished she spoke.<br>\r\n<br>\r\n\"Ah the usual, challengers here and there. Fanmail. Honing my psychic pokemon and what not. You seem to be rather well and healthy yourself\" said the psychic as she reached for another breakstick. Ethan smiled, which Sabrina found....attractive?<br>\r\n<br>\r\n\"Oh yeah. Life as a champion is great! I live in a villa, I got a few maids, a pokemon practice field. This is the life right here! Although, since I'm not walking around as much as when I was in the hunt for the Pokemon League, I have put on a few\" chuckled the champion as he patted his gut. Sabrina sensed happiness and then...disappointment perhaps? She didn't want to make him feel down...he hasn't done any perverted stuff as of yet, not to mention he is genuinely nice. Perhaps he could...?<br>\r\n<br>\r\n\"Oh don't worry, you look great. More healthy than that last time we fought! In fact, you can call me crazy, but the extra weight...looks rather good on you\" smiled the psychic. Ethan looked touched.<br>\r\n<br>\r\n\"You really think that? My friend Lyra has been egging at me to stop playing video games and exercise, but you think that um...\" he puased, blushing and shuffling in his seat. It made him look cute \"my fat looks good?\"<br>\r\n<br>\r\n\"Why yes I do. In fact, I have been meaning to ask you: how is the <i> chubby</i> life like anyway?\" asked the girl. She has been bored, communing with the cosmos being one of the only habits that she has been doing. Maybe a break from the monotony may be sufficient. She saw herself, with bigger breasts(she was jealous of Claire and Lorelai's bust size, she was a modest B-cup, while those two in the D's.), larger birth giving hips, plumper thighs, a soft round tummy. For whatever reason, Sabrina felt that...she wanted to try this out.<br>\r\n<br>\r\n\"Well...as you can tell I am a bit 'bigger'. In addition I feel a bit more healthy(as my mom says). There is uh... certain plushness and all to me\" the boy paused blushing. The tray with the food arrived courtesy of a Chansey, who bowed and walked off. The couple salivated at the glistening food...<br>\r\n<br>\r\n\"Wanna put our conversation on hold? The problem of being a chubby kid like me, eat first, ask questions later\" chuckled the younger boy. Sabrina smacked her lips, her stomach sending that same strange feeling.<br>\r\n<br>\r\n\"Of course. Shall we dig in?\" asked the psychic, sending a playful smirk.<br>\r\n<br>\r\n\"Lets!\"<br>\r\n<br>\r\nAnd the couple, much to the surprise of other patrons, finished the food which was enough to feed two families in under a half hour. Ethan's belly poked as his shirt rode up, his chair having a little creak due to the 200 pound plus boy. The 115 pound(but not for long...) Sabrina had finished too, the bulge in her belly evident of food and...</span></div></div>",
            "created":1297486800,
            "id":1052671,
            "title":"He seemed to have \"filled out\", as he w..."
        },
        "114221":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Was touched. \"Thank you so much! You're a life saver!\"",
                "Declined politely. \"No thanks, I'll be good in a hotel. I do snore a bit!\""
            ],
            "content":"<div class=\"\"><div> <span>Sabrina moaned as she rubbed and kneeded her stuffed stomach, filled to the brim with all of the food she had ordered. It hurt, but at the same time it was just so~ good~. <br>\r\n<br>\r\n'This feeling...it hurts but yet...it's so good...' thought Sabrina as she closed her eyes in pleasure.<br>\r\n<br>\r\nEthan looked on at his date with transfixed eyes, entranced as the psychic shuffled a bit in her chair as she caressed her rock hard belly. He was starting to feel a bit aroused...<br>\r\n<br>\r\n\"So uh...got room for desert?\" asked the 13 year old boy. Courtesy of his enlarged gut, he can contain more(despite the massive meal he has already consumed). Sabrina opened her eyes and let out a moan.<br>\r\n<br>\r\n\"For some reason...I am filled to the brim but yet...I feel that I should eat more! Yes Ethan, I would be happy to\" she gave another moan \"have the last course\". Ethan smiled.<br>\r\n<br>\r\n\"Alright then.\" He raised his hand for the waiter, who gave him a menu. He checked the desert options which included a Towering Powdered Funnel Cake, a 9-layered chocolate yellow cake, a 12 scoop sundae, and a special hot chocolate chip cookie cake with vanilla ice cream on top! Ethan was salivating...He handed the menu to Sabrina.<br>\r\n<br>\r\n\"Well Sabrina? Anything you like?\" Asked the champion. Sabrina began to read the menu. For whatever reason, she seemed to be transfixed on having one of each, but yet after eating that humongous dinner, how could her stomach, which is the size of her fist, could consume more? Then a vision came to the psychic as she saw the cosmos...space, planets, and galaxies all around her. Stars being born, galaxies spinning, nebulas forming. She sat down, and saw herself sitting next to the great creator of the stars, the Pillars of Creation.<br>\r\n<br>\r\n(AN: google it. It's an awesome nebula).<br>\r\n<br>\r\nShe sat between the pillars as if it was a throne and then suddenly...<br>\r\n<br>\r\nSabrina reopned her eyes, menu still in hand. Even with the pain and pleasure of being stuffed, she needed more! <br>\r\n<br>\r\n\"Hey Ethan\".<br>\r\n<br>\r\n\"Yes?\"<br>\r\n<br>\r\n\"May I talk to you after our desert? Oh, and we will share one of each\". Ethan's eyes rose up. One of each desert, all big and huge with 1500+ calories! Ethan dumbly nodded. The waiter nodded and took the menu away. Ethan looked confused.<br>\r\n<br>\r\n\"Hey Sabrina what's up? You can tell me\" said the younger bigger boy. <br>\r\n<br>\r\n\"Well Ethan...you see...I want to try something new for a change.\" said the psychic, still caressing her belly with one hand and sipping water with her other.<br>\r\n<br>\r\n\"Go on...\"<br>\r\n<br>\r\n\"The thing is...I wanted to see what it is like...you know..being fat. Being big, being plushy. I've never had such an experience before and I wish to try it out\" explained Sabrina. Ethan's eyes rose up. Here, this beautiful obsidian haired psychic wants to get huge, like he is! Besides, it wouldn't hurt having a partner in gaining right?<br>\r\n<br>\r\n\"Well that's great Sabrina. I support your decision as Johto champion!\" said Ethan with a gusto as he undid his belt. He knew he was not going to be needing it soon...Sabrina chuckled with a lady like grace due to his enthusiasm.<br>\r\n<br>\r\n\"I see then I'm glad. This date has been quite fruitful\" She had to thank Misty when she gets the chance.<br>\r\n<br>\r\n\"Same here! And this is my first date too!\" Sabrina cocked her head to the side in confusion.<br>\r\n<br>\r\n\"This is your first?\"<br>\r\n<br>\r\n\"Well yeah, I've been too busy trying to win the Pokemon League for one, so I didn't have time to get a social life. Then came the responsiblities as champion, challenging other trainers and keeping my title. Then my lounging around at my villa over the past few months. I owe Misty one, that's for sure.\" Sabrina felt a bit of pride swell up in her, knowing that she is the champion's first.<br>\r\n<br>\r\n\"Ah!  Desert is here!\" And the trays of the four meals were handed out by a Chansey onto their table. Despite being stuffed, the couple began to dig in like ravished Grumpigs.<br>\r\n<br>\r\n~skip to after the meal~<br>\r\n<br>\r\n*RIIIP* Sabrina heard her red dress give a rip around her abdomen section, but at this point she didn't care. She was in a hazy morass of pain and pleasure that she thought her brain would turn to into jelly. Her dress rose up a bit and the tear exposed her belly button. The psychic now looked 5 months pregnant, with a bit of chocolate and sugar smears on her face. She laid back in her chair and breathed in and out, her distended stomach sensitive to the touch, and that is why she continued to rub it.<br>\r\n<br>\r\n\"Ethan...\" she panted. Ethan's shirt rose up, exposing his own navel and soft round belly. He too felt a bit pained due to the stuffing session as he too kneeded the hard flesh. He had just finished paying the bill, which for him was just a small amount due to his large wealth during battling sessions.<br>\r\n<br>\r\n\"Yeah?\" he breathed.<br>\r\n<br>\r\n\"Could you perhaps help me get to my house? I don't think I have the strength...\" moaned the psychic. She couldn't even try to access her psychic powers she was so pleasured and in pain.<br>\r\n<br>\r\n\"Of-of course\" Ethan stood and walked over to the slightly taller girl and supported her by placing her shoulder over his and helped her walk out of the restaurant. Much to Sabrina's surprise, despite for also being in pain for being stuffed to the brim, Ethan had the determination and the strength to get his date back to her house, which took nearly an hour due to the slower pace. Sabrina staggered to the front door and leaned against it.<br>\r\n<br>\r\n\"Ethan...this night was amazing, thank you so much\" smiled the psychic, her powers slowly returning to her as the pain began to recede due to digestion. Ethan rubbed the back of his head and smiled.<br>\r\n<br>\r\n\"Of course, any time. Now only if-\" he checked his watch and paled. \"Oh no!\" Sabrina looked concerned.<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\n\"I missed the last train to Goldenrod, which left 10 minutes ago! Darn!\" he cursed, and Sabrina couldn't help but feel guilty. If she hadn't ordered the desert, Ethan would have been on his way home to his grand villa.<br>\r\n<br>\r\n\"Well...you wanna crash with me for the night? It's the least I can do since you payed for dinner and all\" offered Sabrina.<br>\r\n<br>\r\nEthan looked towards her and...</span></div></div>",
            "created":1297573200,
            "id":1053039,
            "title":"She was so full~ and felt good to feel the pain..."
        },
        "1142211":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Skip ahead to the aftermath of the session.",
                "Continue the session onto lunch. Ethan can catch the night train."
            ],
            "content":"<div class=\"\"><div> <span>\"Think nothing of it. I'm just repaying the favor\" replied Sabrina, happy to help. She walked inside, Ethan in tow.<br>\r\n<br>\r\n\"I can crash on he couch if that feels okay\" said Ethan.<br>\r\n<br>\r\n\"Oh don't worry, I have a guest room available. You can sleep there\" toned the psychic, hand on her belly.<br>\r\n<br>\r\n\"Cool. So you gonna shower first? Ladies first\" jestured Ethan as he took off his jack and undid some of the buttons.<br>\r\n<br>\r\n\"Fair enough. I also have some spare robes if you need one\" replied Sabrina as she walked towards the bathroom.<br>\r\n<br>\r\n\"Thanks, I'll be sure to wear one\" replied the chubby boy as he kicked back on the couch and started watching some TV.<br>\r\n<br>\r\nSabrina walked into the bathroom, stripped down, and stepped into the shower. As she cleaned herself, she couldn't help but leave only one hand to do the rubbing of her belly and the other for mandatory shower tasks(shampoo, conditioner, etc). As she finished and dried herself off, he finally decided. Sabrina the Saffron Gym Leader will be getting much bigger from here on out. Although, there is the matter of her other friends, that being the other Kanto Gym Leaders. They may get concerned or, heaven forbid, be disgusted at Sabrina's new goal. Well they didn't meet a nice boy like Ethan, so she couldn't care less. The boy had genuine affection for her, not some lust for a one night stand, but pure affection. <br>\r\n<br>\r\nSuddenly, another vision assaulted her mind. It was a continuation of the earlier vision, as she was sitting in between the Pillars of Creation, the other stars and nebulas began to move and converge, and with a great flash, another large nebula was created. This time it was another Pillars of Creation type of nebula and she saw another great light emerge from the nebula, blinding her and then...<br>\r\n<br>\r\nThe vision ended and Sabrina placed her hand to her head. 'What does this mean?' pondered the psychic. These visions have started to come ever since she started to communicate with the cosmos just yesterday. What is the point of another Pillars nebula? It puzzled the girl. Nevertheless, it was Ethan's time to shower so she stepped out of the bathroom, wearing her robe.<br>\r\n<br>\r\n\"Ethan, showers up!\" said Sabrina. She heard walking down the hall and low and behold, her chubby date was there.<br>\r\n<br>\r\n\"Thanks alot. You heading to bed?\"<br>\r\n<br>\r\n\"Yes. I tend to be an early bird.\"<br>\r\n<br>\r\n\"Ah okay. Then in that case...\" Ethan gave Sabrina a kiss on the cheek, making the psychic blush.<br>\r\n<br>\r\n\"Good night Sabrina. Thanks for the date and for the temporary accomidations\" smiled Ethan as he stepped in the shower, leaving Sabrina rooted like a statue.<br>\r\n<br>\r\nSabrina then smiled as she muttered a \"good night\" and she walked on into her bedroom, stripped to her undies, and got into bed.<br>\r\n<br>\r\n~the next morning~<br>\r\n<br>\r\nSabrina awoke peacefully, seeing how early it is. 6:17 am. Most people would try to get some more sleep but Sabrina didn't, she was an early bird after all. She walked out of her room and into the bathroom and as she washed her face after grooming herself she looked at herself in the mirror.<br>\r\n<br>\r\nAll that food from the night before went somewhere, as her flat stomach has began soften up, but additionally, her legs seem to be much thicker, her hips a centimeter wider, and her rear garnering a bit of flesh than yesterday. <br>\r\n<br>\r\n'I wonder how much I weigh...' mused Sabrina as she brought out a scale and stepped on it. The last time she was 115 pounds and now...<br>\r\n<br>\r\n125 pounds. Sabrina's eyes rose up. She gained 10 pounds in a single night! And as proof of her gain, she has slowly started to become something akin to either a pear or a \"bubble-butt\" as people would call them. She turned around and slapped her rear, seeing the additional flesh jiggle, which made the psychic happy.<br>\r\n<br>\r\n'Gainers gotta start somewhere right?' thought the girl to herself. Now her belly groaned.<br>\r\n<br>\r\n\"Relax. You'll be feed soon...\" smiled Sabrina as she stepped out and walked towards her room to get dressed...<br>\r\n<br>\r\n~10 minutes later~<br>\r\n<br>\r\nSabrina was cooking some toast and eggs, wearing nothing but short-shorts, a pick-up bra, and an apron. It would be interesting to see Ethan's reaction. But, she realized that just the meager breakfast wouldn't help her gain, so she decided to garner other food out, such as brownie and cake mixes. She got out seperate glass pans and followed the instructions and placed the batter inside the oven. Two ovens with 3 levels each, which would equate to 3 cakes(gingerbread, spice, and yellow) and 3 brownies. Maybe she may convince Ethan to feed alongside her...<br>\r\n<br>\r\n~1 Hour later~ after taking the mixes out of the oven, she letted them cool off and she heard Ethan come down stairs in his robe.<br>\r\n<br>\r\n\"Hey Ethan. Good morning\" smiled Sabrina. Ethan's eye went up and his face red as he looked upon her wardrobe, and then was her butt bigger?<br>\r\n<br>\r\n\"Uh...morning?\" he turned on the TV and lounged. Sabrina walked over and sat by him. He could feel his briefs getting a little tighter...<br>\r\n<br>\r\n\"Hey Ethan?\"<br>\r\n<br>\r\n\"Yeah?\"<br>\r\n<br>\r\n\"I wanna gain weight and once I get full, I want you to be my feeder. Don't worry I am sure you can catch the afternoon train, but can feed me? Please?\" Sabrina asked. Ethan nodded dumbly as Sabrina walked to the brownie and cake batters and started to ice them over with fattening frosting...<br>\r\n<br>\r\n'Going the extra mile for that extra pound' thought the psychic. She had to trays and sashayed over to her date on the couch and the two of them began to feed, Sabrina more than Ethan.<br>\r\n<br>\r\n</span></div></div>",
            "created":1297573200,
            "id":1053144,
            "title":"Was touched. \"Thank you so much! You're..."
        },
        "11422112":{
            "author_id":"gawayne",
            "author_name":"DJ Jaxx",
            "choices":[
                "Ethan had made it onto his train and Sabrina went to go shopping",
                "Ethan misssed his train, but went to watch one of Sabrina's gym Battles"
            ],
            "content":"<div class=\"\"><div> <span>It wasn't long before Ethan had gotten down to the feeding.<br>\r\n<br>\r\nWhile they had started on the couch where Sabrina had gulped down the toast and eggs, Ethan wanted to be gentlemanly in his approach and decided to make sure that Sabrina was as comfortable as possible while she consumed her meal. After she had finished he asked her to go upstairs and get comfortable while he made more food for her to eat.<br>\r\n<br>\r\nGingerly carrying the repast upstairs as best he could, the plump boy went into Sabrina's room to find her on the bed, laying there almost uncomfortably. She hadn't had Breakfast in bed in the longest time and was a bit anxious regarding having her meal. Still she was determined to see her new decision through to the end, besides Ethan was excited about this as well from what the Psychic could feel.<br>\r\n<br>\r\n\"How are you feeling my dear?\" Ethan cooed as he sat beside her and pulled out a forkful of the triple layer cake, Sabrina blushed at his playfulness. <br>\r\n<br>\r\n\"I'm good, just a little hungry.\" Sabrina confessed, her cap wearing boyfriend chuckled at this.<br>\r\n<br>\r\n\"Well don't worry, I'll fix that.\" <br>\r\n<br>\r\nSlowly, Ethasn brought the forkful of triple layered cake to Sabrina's mouth, the older woman opened her mouth and ate it. She was impressed with how delicious her cooking was, and was surprised by how gracefully his hand sent the food into her mouth. She had consumed it and let the flavors dance on her tongue before she ate the food, as they progressed Sabrina ate more and more quickly and Ethan fed her more and more quickly. She had finished half the cake when she found that her beloved was going as fast as his cellulite laden arms would allow him, she needed more food though and didn’t want to spoil his gesture so she psychically influenced him to feed her faster and more, taking handfuls of food instead of forkfuls.<br>\r\n<br>\r\nWithin an hour she demolished all of the food and had consumed some of the homemade hamburgers that Ethan had whipped up. Her belly was full, but Sabrina had taken on a masochistic mindset regarding the pains in her belly. She wanted more food even if it pained her, but she decided it would be best not to rush things. As she moaned in pleasure and pain she felt a meaty hand make it’s way over her belly. She enjoyed the sensations of gentle touch and a dull ache until her clock struck 1:30 PM.<br>\r\n<br>\r\n“Ethan my golden honey, you’ll be late for the train if you don’t hurry soon. It leaves at two.” Sabrina told him.<br>\r\n<br>\r\n“I know but I want to make sure you digest every last bite of that feast, my sweet Grumpig.”<br>\r\n<br>\r\nSomething in that name sounded sweet to Sabrina, she might’ve telekinetically injured anyone else who called her that but coming from her boyfriend it was as if an angel had spoken to her.<br>\r\n<br>\r\n“Call me that one more time Ethan…”<br>\r\n<br>\r\n“Sure thing, my precious Grumpig.” he replied softly.<br>\r\n<br>\r\nAn hour later….  </span></div></div>",
            "created":1297573200,
            "id":1053451,
            "title":"Continue the session onto lunch. Ethan can catc..."
        },
        "114221121":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Her friend Misty, whom she needed to thank for the blind date",
                "Goldenrod Gym's own buxom ditz Whitney Campbell!"
            ],
            "content":"<div class=\"\"><div> <span>~And hour prior~<br>\r\n<br>\r\n\"Well...thanks alot of the great time Ethan. I enjoyed it <i>immensely</i>\" purred Sabrina as Ethan walked out the door. Due to the meal from the night before, his normal shirt rode up a bit, and he could feel his pants feel a bit tighter. But all the better for the champ and psychic.<br>\r\n<br>\r\n\"So did I...hey...\"he rubbed the back of his head \"I will be having a non-title exhibition match with Sinnoh regional champion Cynthia Celestia next weekend at Ever Grande City south in Hoenn. Wanna get VIP exclusive seats?\" asked Ethan with a mischeavious glint in his eye. <br>\r\n<br>\r\n\"What type of seats?\"<br>\r\n<br>\r\n\"You recieve a cabin for one, and you can bring a friend. In addition, I'll have it that you can have <i>room service</i> any time.\" Sabrina placed a hand on her stuffed tummy as she thought of it...her Ethan battling superbly...her rooting for him...her feeding like a woman possessed on the 5-star food...<br>\r\n<br>\r\n\"I'd be more than happy to Ethan. Consider your invitation accepted\" said Sabrina with a smile. Ethan grinned.<br>\r\n<br>\r\n\"Awesome. I can't wait. Now I better get going. I have a match to prepare and what not\" he stepped up and kissed Sabrina on the cheek. Sabrina pouted.<br>\r\n<br>\r\n\"That's not how couples do it Ethan\" teased Sabrina. Ethan cocked his head until Sabrina kissed him on the lips. It wasn't a deep passionate one, as the two are just starting out, but it was a good kiss nonetheless.<br>\r\n<br>\r\n\"Well, you better catch that train\" winked the psychic as she went back inside, Ethan leaving and with a hop in his step.<br>\r\n<br>\r\nAs Sabrina sat down on the couch and turned on the TV to watch some shows. She's gotta let the food digest somehow.<br>\r\n<br>\r\n~present time~<br>\r\n<br>\r\nSabrina is now walking about in Saffron in her sweat pants and pink blouse. Right now, her current white slacks or her red and purple outfit can't fit, so she decided to attain new clothes from the mall. <br>\r\n<br>\r\nAs she walked into the woman's clothes section, she picked out several plus-size white slacks(and more much larger than her current size). In addition, she picked out more panties, bras, blouses, and a few dresses(all bigger sizes) and some slacks with buttons. With her masochistic mindset of stuffing herself and gaining, the psychic wanted to make the buttons pop when she feed herself. As she walked to the check out counter, she had a vision...<br>\r\n<br>\r\nIt was the same as before, her in the cosmos and several large Pillar of Creation nebulas all around her. She was sitting in one of them like a throne dressed in a golden bra and a satin toga and then, to the nebula that was higher than her, a figure appeared. It was Ethan! He was still chubby, with a bit of fat going into his breasts, his wide soft stomach breathing in and out, and his thighs and butt so tender and fleshy. He was wearing a golden toga, and wore a crown of flowers like a king of some sort. Then, she turned towards another nebula where a bright light as gathering and...<br>\r\n<br>\r\nThe vision and ended and Sabrina rubbed her head. Now Ethan was in her visions, and now something else near one of the nebulas was coming as well. Just what did it mean? But she lost focus and bumped into someone.<br>\r\n<br>\r\n\"Oh sorry! I wasn't paying attention\" apologize the psychic. The person, who was female turned around and it was...</span></div></div>",
            "created":1297659600,
            "id":1053625,
            "title":"Ethan had made it onto his train and Sabrina we..."
        },
        "1142211211":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Cue to the lunch, where the girls are about to dig in...in undies...",
                "Cue to after the session, they are stuffed to the point of passing out.."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Misty! How's it going?\" asked Sabrina. Misty's eyes went up a bit.<br>\r\n<br>\r\n\"Oh hey Sabrina...you're looking good...I think?\" asked the water type gym leader. Misty was wearing her jean overalls with a yellow long sleeve shirt. Misty Phelps had the misfortune of the smallest chest in comparison to her sisters. And by smallest, she means \"flattest\". Seeing her friend a bit plumped up surprised her.<br>\r\n<br>\r\nSabrina was wearing her normal pink blouse she always wears, but her stomach looked softer and had a bulge, no longer as flat as it once was. In addition, her hips and thighs seemed to have absorb whatever pounds Sabrina has been packing. But Misty couldn't help but feel jealous as she could see her friends rear, which was nice and round, much akin to her older sisters. Not to mention her breasts, they were nice and big, bumped up from their B cup sizing to a nice and plump CC cup size.<br>\r\n<br>\r\n\"No kidding! I have to thank you for the blind date you set me up with! I've met the man of dreams!\" said Sabrina. 'Literally and figuratively' she mentally added. Misty smiled somewhat.<br>\r\n<br>\r\n\"Well I'm glad! How was Ethan and what did you do with him?\" asked the swimmer. The psychic giggled.<br>\r\n<br>\r\n\"I'll tell you later on. Wanna stop by my apartment for dinner maybe? You can crash at my place. No need for a hotel\" offered Sabrina.<br>\r\n<br>\r\n\"Well sure! I'd be happy too\" said Misty. 'Maybe I can see what is causing her to let go...oh my god...her ass is GORGEOUS' thought Misty as her friend turned around and went through the check out aisle. Maybe the weight Sabrina had gained seemed to have gone well for the psychic, in which Misty couldn't help but feel even more jealous.<br>\r\n<br>\r\n'I'm stuck being as flat as a board...'thought orange haired 17 year old.<br>\r\n<br>\r\nSabrina's psychic powers reached out and sensed Misty's emotions. From what she cpould read, Misty was feeling: curious, jealous, shock, and a...slight tinge of disgust? Was Misty ashamed of her friend gaining weight? <br>\r\n<br>\r\n'I'll explain to her once we return to the apartment.' thought Sabrina. She waited for Misty to finish her and the girls walked out of the mall and back into town. It took them a half hour to reach Sabrina's place, and by the time she reached the door, the psychic's stomach growled.<br>\r\n<br>\r\n\"Oh quiet you\" said Sabrina to her stomach.<br>\r\n<br>\r\n\"Hey Sabrina...I've been meaning to ask you a question\" asked Misty. Sabrina smiled a bit.<br>\r\n<br>\r\n\"Does it have to do with my recent weight gain I take it?\" Misty's eyes widened, but she knew her friend can use psychic powers, so she nodded.<br>\r\n<br>\r\n\"Yeah I mean what's up? I mean you ranked 2nd in this years Kanto Beauty Contest? Is there something wrong?\" Misty was concerned. Was her friend going through depression? May she have an eating disorder? Sabrina chuckled.<br>\r\n<br>\r\n\"Well...you see I wanted to try something new and...I wanted to see what it's like living like Ethan\" mused Sabrina. Misty cocked her head to the side.<br>\r\n<br>\r\n\"What do you mean?\"<br>\r\n<br>\r\n\"Didn't you know? Ethan Goldstein, Johto Regional Champion, gained nearly 80 pounds since becoming champion\" Misty's eyes became saucers.<br>\r\n<br>\r\n\"Really! Oh my gosh I'm so sorry...I thought that-\"<br>\r\n<br>\r\n\"What's there to be sorry for? I like Ethan! I like him alot!\" chirped Sabrina. This caught the swimmer offguard, her friend wasn't this outspoken about someone.<br>\r\n<br>\r\n\"So...Ethan is fat and you still like him?\" asked Misty. Sabrina turned towards her.<br>\r\n<br>\r\n\"What of it? I was always stressed and freaking out over diets and what not, and-\"<br>\r\n<br>\r\n\"That's because boys won't accept us if we're as fat as Grumpigs you know!\" Now Sabrina's face darkened, and if there was thing Misty knows:<br>\r\n<br>\r\nNever piss of Sabrina.<br>\r\n<br>\r\n\"Are you that superficial Misty?\" she snarled in a calm tone, Misty gulping. \"Are you that afraid of trying something new? Or is that you're are jealous of other woman with curves?\" Misty's face contorted to anger.<br>\r\n<br>\r\n\"No I'm-\"<br>\r\n<br>\r\n\"Don't lie to me there's no point! I've seen the glares you thrown at Lorelai Winters...the disdain you have for Flannery Lavaridge of Hoenn...the so-called \"dislike\" of Karen Dark and Clair DiDrago. You're as easy to read as a book. You're jealous of other girls that have curves because men ignore you for people like them. Curves much like YOUR SISTERS!\" Misty could only stand there rooted like a statue. As much as her brain raddled a way to find a comeback she couldn't. Sabrina was right. She detested other woman because they had what she couldn't have. Breasts and a rear. <br>\r\n<br>\r\n\"Then how...\"Misty muttered, as quiet as a sleeping Whismur. \"How can I get curves. You know what happens in the long term to those who go under the knife. How?\" Was all she could ask. Sabrina's anger subsided, replaced by the calm girl she knew, who stepped forward to give her a hug.<br>\r\n<br>\r\n\"There's an old saying, <i>When in Rome, do as the Romans do</i>. So do as I and Ethan do. Eat without restraint. Eat until you are full and near the limit to the point where you might explode. I'll guarantee you will gain curves Misty. You are my friend and I want what's best for you\" soothed Sabrina. Misty returned the hug, and nodded.<br>\r\n<br>\r\n\"Now then. Let's get onto that mid-afternoon lunch shall we? I still have some leftovers and we can call in pizza. While we wait and eat, I'll tell you what me and Ethan did and talked about\" grinned Sabrina as she took Misty's hand, who smiled too.<br>\r\n<br>\r\nMaybe she did needed that lashing, for after all, for some things to get better, some bad things need to happen.<br>\r\n<br>\r\nNow then...</span></div></div>",
            "created":1297746000,
            "id":1054264,
            "title":"Her friend Misty, whom she needed to thank for ..."
        },
        "11422112112":{
            "author_id":"gawayne",
            "author_name":"DJ Jaxx",
            "choices":[
                "She can't find it and goes to Sabrina's room to sleep",
                "She finds it and something interesting within"
            ],
            "content":"<div class=\"\"><div> <span>It was around 4:35 when Misty and Sabrina had finished eating their meal, and both girls were sitting at the kitchen table, wearing only their bras and  panties. At first Misty was opposed to eating with so little clothing on but Sabrina had told her that they were going to be eating alot and that it would be best not to let their good clothing get stained.<br>\r\n<br>\r\nThe meal had been pretty enjoyable though, Misty never knew that Sabrina was such a good cook.<br>\r\n<br>\r\n\"Ah... that meal was great, wasn't it Misty?\" Sabrina asked , she could already sense that her companion was pleased, and maybe a tad drowsy like herself. 'Well, at least Misty's showing sign of progress.<br>\r\n<br>\r\n\"Yeah, aside from the belly ache....But man am I tired.!\"<br>\r\n<br>\r\nSabrina nodded and stood up. \"Me too...I'm gonna go to bed.\"<br>\r\n<br>\r\n\"Alright.\" <br>\r\n<br>\r\nAs Sabrina went upstairs Misty went to look for the guest rroom...</span></div></div>",
            "created":1297832400,
            "id":1054891,
            "title":"Cue to after the session, they are stuffed to t..."
        },
        "114221121121":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Whitney Campbell, Candice Winter and Brian \"Bugsy\" Cyprus",
                "Flannery Lavaridge, Maylene Kutcher and Ian Falkner"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina let a yawn escaped her as she found her bedroom. Out of the two girls, Misty ate the most(as she was the most determined to gain curves the most) out of her late-lunch, and Sabrina let her. After all, that's whats friends are for right? Thinking only of sleep, Sabrina plopped on the bed and got into the covers. As she fell asleep immediately, she didn't notice a just as tired and in pain(due to eating the most) Misty come onto her bed as well.<br>\r\n<br>\r\nAs Sabrina dreamed, instead of a vision of the cosmos, she found herself sitting on clouds. The psychic layed down and snuggled into the clouds, her hands passing through the white fluff onto her growing belly.<br>\r\n<br>\r\nSince her gain, her breasts have grown the least and her thighs and butt have grown the most. While her breasts are now a perky C-cup, her belly began changing from rock hard due to late-lunch to soft flesh. And she felt her rear and thighs expand a bit, while her bust remained the same. And best off all, her slim arms and cute face remained unaffected. Overall, her late-lunch(which she made to be fattening) made her gain about 5 pounds. Not as much as her dinner and stuffing session with Ethan, but every pound counts. For some reason the <br>\r\n<br>\r\nAs Misty dreamed, she found herself on the clouds as well, much akin to her friends own dream. Her rock hard and distended stomach began to shrink and Misty felt a sensation. She was getting fat. She looked down and saw her muscled and toned legs begin to lose muscle and become softer. Her stomach, also slim and toned, softened and grew just by a quarter of an inch. And to her dismay, her breasts, in which she wad flat, didn't grow at all, until she felt that sensation tingling in her behind she looked and down and beamed. Her rear got some of the weight! Infact it may have gotten the majority of the 15 pounds of food Misty consumed! She started to hop up and down and gave her rear a slap, seeing it jiggle to her satisfaction. She fell onto the clouds laughing, gathering the clouds like fluff and hugging and cuddling them...<br>\r\n<br>\r\nIn the real world, the two girls were dreaming and in their sleep, they touched each other. Misty was stroking Sabrina's left breast and it trailed down to her soft tummy while the psychic had her hand over Misty's growing rear(as the food was digested).<br>\r\n<br>\r\n~a few hours later~<br>\r\n<br>\r\nSabrina was the first to awake, rolling away from Misty(unconsiously) and onto the floor. She looked down and saw her newly added gain and how it affected her body. She headed downstairs and ate an apple as she watched some TV, mainly the boring news. Still in her bra and panties, she reached for her phone and dialed a certain friend's number.<br>\r\n<br>\r\n\"Hello? Ethan? How's it going? Oh you're busy? I'm sorry, when should I call you back?\" the psychic's face became understanding. \"Ah I see, you have an important exhibition match to worry about, so I'll leave you to your devices. Okay, see you friday down in Ever Grande. Bye\" She hung up and dialed another number. Thanks to her friend Lucian Potter, the Sinnoh Elite 4 member, she got quite a few numbers of some girls and guys in Sinnoh.<br>\r\n<br>\r\n\"Hello Aaron? Hey, are you around in Kanto? You are? Awesome! I was wondering if you could head over to my place tomorrow night, I'm calling over some friends to go to a club. Which club? Well the best one in Saffron that's what! Great to know you're coming. See ya, bye\" She hung up. <br>\r\n<br>\r\nShe decided to call over two more girl friends and 1 guy friend, but which to choose...Sabrina rubbed her belly as she thought.<br>\r\n<br>\r\n\"I'll invite them them!\" She sent a text message via her PokeCell and texted to...<br>\r\n<br>\r\n(Note the 2 girls and guy selected below will eventually join in on the gaining adventures of Sabrina, Misty and Ethan)</span></div></div>",
            "created":1297918800,
            "id":1055492,
            "title":"She can't find it and goes to Sabrina's..."
        },
        "1142211211211":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "Skip to later. Everyone comes on time, and,,,Whitney's got MooMoo Milk...",
                "Sabrina looks for Red before everyone gets there...what's he up to?"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina sent the message to all three individuals. Smiling slightly, she waited for their responses. Bugsy responded first, expressing distinct eagerness to join them. Soon after, Whitney followed, offering to bring over some MooMoo milk for the road. As for Candice, by the time she responded, Misty had awoken, rubbing the sleep out of her eyes with her slightly juicier fingers.<br>\r\n<br>\r\n\"Hey, we're going to a club later,\" Sabrina said.<br>\r\n<br>\r\n\"We are?\"<br>\r\n<br>\r\n\"So you might wanna get dressed or something for later, or get clothing prepared.\"<br>\r\n<br>\r\n\"I should?\"<br>\r\n<br>\r\n\"You're still half asleep, aren't you?\"<br>\r\n<br>\r\n\"I am?\"<br>\r\n<br>\r\nSabrina gave Misty some coffee before going off to fulfill her duties as a gym leader. Another trainer was scheduled to battle her that day, and, as it were, even her fantasies needed to take a back seat to her job. After a effortless victory against the poor bug catcher, Sabrina returned to Misty, only to find her nibbling on a brownie. \"Keeping up your training as before, I take it?\"<br>\r\n<br>\r\n\"Yeah, pretty much,\" Misty replied, smiling as she said, slowly, \"Ya know, I wonder where Red is.\"<br>\r\n<br>\r\n\"Red? The former champion?\"<br>\r\n<br>\r\n\"Well, current champion. He's undefeated. But, well, Sabrina,\" Misty said, turning toward her friend, her eyes wide and desperate, \"Do you think if maybe you could find him for me?\"<br>\r\n<br>\r\n\"Find him? Why?\" Sabrina took all of five seconds to figure it out. She didn't need psychic powers to understand why the orange haired girl was turning red. \"So that's how it is, huh?\"<br>\r\n<br>\r\n\"What? No, it's nothing like--well, maybe it is a bit, but--well, yes, it completely is.\"<br>\r\n<br>\r\n\"So you want me to find him so you can ask him out?\"<br>\r\n<br>\r\nMisty blushed again before saying, \"Well, maybe just to talk a little, ya know?\"<br>\r\n<br>\r\n\"Oh, believe me, I know.\"</span></div></div>",
            "created":1298178000,
            "id":1057425,
            "title":"Whitney Campbell, Candice Winter and Brian \"..."
        },
        "11422112112111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "We are going to the club then going to best diner in Saffron! Then we come back",
                "Lets all eat some of the food here then go out clubbing then late night dinner!"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina and Misty found clothes suitable due to their slowly growing frames(courtesy of the psychic) and have begun waiting for the trio that Sabrina texted to arrive. Misty turned towards the clock which read 8:30<br>\r\n<br>\r\n\"Where could they-\" A knock broke Sabrina's train of thought.<br>\r\n<br>\r\n\"Speak of the devil\" she walked towards the door and low and behold, the trio was there.<br>\r\n<br>\r\n\"Hey Sabrina! How's it going!\" asked the peppy pinkette in boon. The Goldenrod Gym Leader was the postergirl for MooMoo Milk, which has worked generously into packing the pounds onto her breasts and rear, giving Whitney a hourglass figure that the Bug type Gym Leader behind her, Brian Cyprus, better known as \"Bugsy\", couldn't help but drool a little. Her white shirt exposed generous amount of cleavage with her DD cup breasts and her denim shorts held a great round ass with thighs that nearly touched. If Sabrina guessed, Whitney weighed over 170 pounds, but it went to the right places for the girl. But then again, it would be irrelevant. She carried a box filled with MooMoo milk quarts.<br>\r\n<br>\r\n\"It's going great Whitney, how's things down in Goldenrod?\"<br>\r\n<br>\r\n\"Meh, the usual oggling trainer and the jealous Lass. A few loses here and there, you know the routine\" Sabrina nodded in agreement. <br>\r\n<br>\r\n\"Yes, likewise. How are you doing Bugsy?\" The extremely feminine boy perked up and nodded as he smiled, but his eyes darted from the psychic to Whitney and back. Using her psychic powers, she sensed his emotions. They were blazing with lust and affection, with shyness and a bit of fear added in. The fear bit may have been the \"fear of rejection\" or \"fear of slap\" but she understood.<br>\r\n<br>\r\n\"It's going great Sabrina. That teacher girl, Roxanne Stone, stopped by my gym today for some research notes on Bug pokemon. Say did you lose weight? You look great\" flattered the purple haired boy. His emotions were once again riddled with lust as she gazed her as Whitney went inside to greet Misty.<br>\r\n<br>\r\n\"Why thank you Bugsy. I'll be happy to explain what we are doing later on so come on inside\" jestured the psychic and the bug afficionado walked inside with a bit of step. Which Sabrina turned towards her last visitor.<br>\r\n<br>\r\n\"So Candice? Happy to be down in Kanto?\" Candice Winters, the Ice Gym leader in Snowpoint city shrugged. Candice had a slender figure, but her breasts were perky and her legs were toned. This helped her get to 4th place in Sinnoh's beauty contest(beaten out by, in order from 3 to 1: Dawn Berlitz, Fantina Robespierre, and Cynthia Celestia). Candice was peppy like Whitney, but more observant like Sabrina. Candice nodded, but she couldn't keep her eye off of Sabrina's muffin top of a belly and her slowly growing legs. Sabrina noticed.<br>\r\n<br>\r\n\"I sorta miss the cold but I don'y mind the flight. So anyways Sabrina...I've been wondering...\" her emotions were laced with concern, curiosity, a pinch of disgust. Sabrina knew what was coming and smiled.<br>\r\n<br>\r\n\"Oh this?\" she grabbed her soft flesh of her stomach and fondled it, much to Candice's surprise. \"This is purely intentional. I wanted to try out something new ever since I met my new partner, so I've been determined to become as fat as he\" The Ice leader's mouth dropped.<br>\r\n<br>\r\n\"Then that guy must be one good date material. Who is it?\" Sabrina and Candice walked inside, the psychic giving her a sly look.<br>\r\n<br>\r\n\"Johto Regional Champion Ethan Goldstein. He's nearly 200 pounds right now\" Candice's eyes went up.<br>\r\n<br>\r\n\"Oh wow. And...you're into that sort of thing? If so I respect ya completely, I was just worried for ya\" said Candice. Sabrina nodded.<br>\r\n<br>\r\n\"Yes...I suppose I am into well...'plumpers' and weight gain. Ethan introduced me to that, and so I am doing that. See Misty?\" she pointed towards Misty as the swimmer was making conversation with Bugsy, who was incredibly red in the face, and Whitney in which Misty seemed to be getting along with more better now than she had before. She noticed the gain from earlier today has been distributed to Misty's legs and her rear. She's probably going end up as one of the \"thunder-thighs and Ass the size of Unova\" type of chubby girls. Sabrina was more of a pear, and Whitney a hourglass. Now she looked towards Candice then back to Bugsy..<br>\r\n<br>\r\n'I wonder how the weight will be distributed amongst them...' thought the psychic. She thought on the Orange Bowl, the best club in town, which even had several rooms for 'special services' or in other words, sex amongst dates. And since it is patroled by the occasional Bronzor(to check to see if any partner has been drugged) the rape rates have gone down dramatically. Then she thought of the special food she bought several days before her date with Ethan, which consisted of pure chocolate, bananas, vanilla ice cream, watermelon, and red wine. While Bugsy may be underaged, Sabrina didn't care. The foods were Aphrodisiacs, caused in enhance the sex drive.<br>\r\n<br>\r\nIn other words, Sabrina wants all of her friends to stuff themselves on this and commence a massive sex fest. After all, she needs the practice for Ethan's victory night.<br>\r\n<br>\r\n\"Okay you guys, here's what we have planned for tonight!\" All of the rooms occupants turned towards her....</span></div></div>",
            "created":1298178000,
            "id":1057452,
            "title":"Skip to later. Everyone comes on time, and,,,Wh..."
        },
        "114221121121111":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "Go to the club and dinner, where Sabrina does her work...",
                "Cut to back when they return home, now ready for some love making..."
            ],
            "content":"<div class=\"\"><div> <span>\"So that's what we're gonna do?\" Bugsy asked, smiling timidly. Sabrina could sense the boy's emotions swirling around, bottled up within his heart. There was the prospect of good food and beautiful women all around him, but, at the same time, he feared the consequences. He was too restrained. Some of Sabrina's treatment should eliminate that apprehension.<br>\r\n<br>\r\n\"Yeah, I like this idea,\" Whitney laughed, her eyes wide and sparkly in her sockets, a smile spreading across her slightly pudgy face.<br>\r\n<br>\r\n\"I'm in,\" Candice said, grinning, \"It's been awhile since I've been able to really go loose and do whatever, so the club sounds cool. Still, usually I'm kinda worn out afterwards, so some nice hanging out here sounds nice.\"<br>\r\n<br>\r\nSabrina grinned as she sized up the others. She could only imagine later, being able to run her long fingers up the other girls' stomachs as she fed them to stuffing point, holding them close as Ethan drew close to her. She tingled on the inside thinking about it. Maybe it was just a fantasy for her, but nevertheless--<br>\r\n<br>\r\nThe door bell rang at that moment.<br>\r\n<br>\r\nSabrina opened the door up to reveal Ethan, whose pudgy appearance drove Whitney to stammering. \"E-e-e-e-e-e-ethan!\"<br>\r\n<br>\r\n\"Uh, yeah?\"<br>\r\n<br>\r\nWhitney, twiddling her thumbs as she stared in awe at him, stammered, \"Well, uh, has the ch-champion life treated you well?\"<br>\r\n<br>\r\n\"Uh, yeah, I guess.\"<br>\r\n<br>\r\n\"Oh, guess that makes sense. You look...content.\"<br>\r\n<br>\r\n\"Uh, okay,\" Ethan said as Candice, out of Whitney's stunned sight, ran a palm over her face, shaking her head in regret that she knew this person.</span></div></div>",
            "created":1298178000,
            "id":1057467,
            "title":"The Plan...!"
        },
        "1142211211211111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "\"You get to dance with all of us!\"*then dinner afterwards*",
                "\"Let's get dinner and then we can all dance!*"
            ],
            "content":"<div class=\"\"><div> <span>\"Haha! Got ya!\" sqeeked Ethan which caused all the rooms occupants to turn. Suddenly, the clothes and a <i> fat suit </i> was discarded, leaving a boy dressed in a ninja attire.<br>\r\n<br>\r\n\"Sabrina! I, Ryotaro Ichimonji, challenge you to a Gym Bat-\" He was given a stern kick from the enraged psychic as the ninja was punted across the sky with a *ping*. Misty checked up on Sabrina.<br>\r\n<br>\r\n\"you okay Sabrina?\" asked the swimmer. Sabrina was breathing in and out.<br>\r\n<br>\r\n\"Let's go to the club now. I got to rid myself of some stress\" she growled as she stomped her way. How <i> dare</i> some ignorant punk dress up as <i> her</i> Ethan. Besides Ethan is at his villa getting psyched for the exhibition.<br>\r\n<br>\r\nThe group walked along the streets, Bugsy walking in between Whitney and Misty, Sabrina on Misty's right and Candice on Whitney's left.<br>\r\n<br>\r\n\"So I heard the Orange Bowl got renovated\" said Candice.<br>\r\n<br>\r\n\"Oh really! What was added?\" asked her buxom pinkette friend.<br>\r\n<br>\r\n\"I heard a lounge and dining area was added with some of the best Chocolate-vanilla ice cream sundaes and red wine in town!\" Sabrina became interested. In addition to the \"special rooms\" they have the foods she had? This was getting better and better...<br>\r\n<br>\r\n\"What was on the sundaes anyway?\" asked Misty.<br>\r\n<br>\r\n\"Watermelon, bananas, and I even heard you can red chili peppers too!\"<br>\r\n<br>\r\nSabrina now grinned. All aphrodisiac foods. This going to be one hell of a night...<br>\r\n<br>\r\n~Cue to the club~<br>\r\n<br>\r\nThe group walked inside with the thundering techno music and the swarm of people dancing together. The stairs lead to the lounge and the \"special\" rooms. <br>\r\n<br>\r\n\"Okay Bugsy, today is your luck day!\" chirped Misty and Whitney, causing the feminine boy to blush. Candice and Sabrina smiled too.<br>\r\n<br>\r\n\"Wha-wha-What do you mean?\" he asked.</span></div></div>",
            "created":1298264400,
            "id":1058167,
            "title":"Go to the club and dinner, where Sabrina does h..."
        },
        "11422112112111111":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "The group stuffs themselves so much that they can't dance...but want sex",
                "The group force feeds Bugsy (and Candice) until he's stuffed..."
            ],
            "content":"<div class=\"\"><div> <span>Bugsy was in between four different women as the dancing started. Awkwardly, he shook his frame to the rhythm, but, judging by the amused giggles from the other girls, something he was doing was wrong. \"You're a cute kid,\" Whitney giggled, wrapping her fingers around Bugsy's wrists, \"But you're doing it all wrong. Just go with me, alright?\"<br>\r\n<br>\r\nWhitney shook her hips side to side, shaking Bugsy in coordination with the beat of the tunes surrounding them. Slowly, she let her hips rub up against his, her soft flesh molding around his own. Bugsy felt his body boil as the otehr girls  grew closer, caressing their hips against his thighs. He could barely contain himself as some of their stomachs rubbed up against him. He blusehd deep red. He wanted to squeeze them, to hold them close to his form and never release them. he felt his face exploding with intensity as he looked at each of their faces, their soft, angelic faces staring down at them, and--<br>\r\n<br>\r\nThe song ended.<br>\r\n<br>\r\nBugsy stared at the others as they retired to the table. He wished they had done a little more, but it was time to eat.<br>\r\n<br>\r\nMaybe there'd be more dancing later.</span></div></div>",
            "created":1298264400,
            "id":1058186,
            "title":"\"You get to dance with all of us!\"*then..."
        },
        "114221121121111111":{
            "author_id":"gawayne",
            "author_name":"DJ Jaxx",
            "choices":[
                "Misty, totally red faced and in the mood.",
                "Brock Rockly, the most infamous pervert in Kanto"
            ],
            "content":"<div class=\"\"><div> <span>Soon enough the group had finally finished their feast. To Sabrina's glee the others were full off food and thier lust was so evident that she didn't even need to use her psychic abilities to tell that they were in need of release.<br>\r\n<br>\r\nShe could see how red bugsy's face was as he looked at Candice's rear while she bent over to tie her shoe. She could visibly see him trying to adjust his pants and resist the urge to grab her ass. Meanwhile she could see Whitney eyeing him...Apparently he was pretty enticing for such a young kid. No matter where she looked, she couldn't see Misty. Even so she was ready to get moving...She'd pop up soon enough.<br>\r\n<br>\r\n\"So everyone, how about we-Ah!\" <br>\r\n<br>\r\nSuddenly, someone had one hand on her belly and another groping her right boob. She turned to face...   </span></div></div>",
            "created":1298264400,
            "id":1058257,
            "title":"Full of food and in need of loving!"
        },
        "1142211211211111111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Whitney. Everyone can go for her holes(nipples, vagina, ass)",
                "Misty. Her mind needs the final cracking to be broken."
            ],
            "content":"<div class=\"\"><div> <span>Sabrina knew. All that food that they ate were aphrodisiacs. Made for the purpose of enchancing the sex drive.<br>\r\n<br>\r\nOr in other words: making people horny.<br>\r\n<br>\r\nThe psychic gave a smirk to the swimmer as they all took inventory of each other.<br>\r\n<br>\r\nSabrina had a rock hard distended stomach which was in pain, but her masochistic tendencies flared so she loved it. Her breasts were the same but she knew once they digested all of the food they may grow soon enough. Her stomach and lower body seems to taking the gain the most, as her thighs will soon be close to rubbing each other. She drew upon her powers of foresight and saw her newly plump body, which satisfied the psychic.<br>\r\n<br>\r\n(She looks like this: <a rel=\"nofollow\" href=\"http://munemune.deviantart.com/#/d2owxwh\" target=\"_blank\">http://munemune.deviantart.com/#/d2owxwh...</a><br>\r\n<br>\r\nMisty's breasts remained flat but her stomach was, like the rest of the gang: rock hard and almost pregnant looking. Her butt and hips are in the growing stages, and they will be packed full soon enough. Her belly was number two, and the rest of her last. <br>\r\n<br>\r\nCandice after tying her shoe sat down on the chair beside Bugsy and gave a pained sigh. She had to undo some short buttons for freedom of her belly. Sabrina wondered how the gain will act for the twin tailed girl...<br>\r\n<br>\r\nWhitney was still drinking wine and becoming drunk(all of them were a bit tipsy) and her breasts rose a bit due to her stuffed tummy. She decided to undo the shorts, wear her panties and plomped down next to Bugsy, he too had a stuffed a gut but was more transfixed on the girls, including Sabrina herself.<br>\r\n<br>\r\nSabrina turned towards Misty. \"So...shall we have some fun?\"<br>\r\n<br>\r\n\"Let's bring them in on it too. Don't want them to feel lonely now do we?\" winked Misty as they both stood up and sauntered over the over three. <br>\r\n<br>\r\n\"So..shall we let the festivities commence?\" asked Sabrina as she got rid of her shirt and trousers, leaving only her bra. Misty did so as well, and Bugsy turned as red as a Slugma.<br>\r\n<br>\r\n\"I want in to!\" said Candice as she began to strip. Whitney was already naked. All 4 girls turned towards the girly boy. Thanks to the booze and the food, everyone was a bit wierd in the head and horny.<br>\r\n<br>\r\n\"Aww look at his tummy. so stuffed, he looks like a prego\" purred Sabrina as she helped Bugsy up and layed him on a bed, leaving him naked. Bugsy's round tummy was breathing fast as his mind still tried to comprehend what was going on. Then Misty came over his face, Candice by the side with her head over his distended stomach, and Sabrina and Whitney down near his aching crotch.<br>\r\n<br>\r\nThen it began:<br>\r\n<br>\r\nMisty began to face sit on him, her panties shuffling as they gave him a face full of vagina, Misty purring with pleasure. Candice began licking his belly button of all things, making Bugsy struggle, but the Sabrina and Whitney weighed down his legs and began giving him a double titty fuck with their large breasts.<br>\r\n<br>\r\n\"Don't worry*hic* Brian! We'll make you happy!*hic*\" hiccuped Whitney as she and Sabrina took turns enveloping his head into their mouths. While one sucked on his member, the other licked it like an ice cream cone. Bugsy wanted to yell but his shouts muffled by Misty's vagina.<br>\r\n<br>\r\n\"YA that's it you girly girly boy! Like my slit clean and you'll get a reward!\" yelled Misty as Bugsy began to do so. It made the swimmer shiver in pleasure.<br>\r\n<br>\r\n\"Ahn! He's sticking his tongue into my temple! Nya!\"<br>\r\n<br>\r\nIt didn't help that Bugsy was struggling for freedom due to Candice licking his navel clean. She was into kinky stuff, that was for sure. And then, Bugsy's body quaked as he exploded all over Sabrina and Whitney's face.<br>\r\n<br>\r\n\"Yea! I'm cumming! That girlboy's tongue is making me cum!\" yelled Misty as she released all over Bugsy's face, and Misty moved, giving Bugsy needed oxygen. Whitney and Sabrina were licking each other clean of the sperm ejected.<br>\r\n<br>\r\n\"Exquisite\" purred the psychic.<br>\r\n<br>\r\n\"hehe! Salty!\" chirped the pinkette.<br>\r\n<br>\r\n\"So...who shall we...<i>violate</i> next?\" wondered Candice.<br>\r\n<br>\r\nThey began thinking until they all looked at...</span></div></div>",
            "created":1298264400,
            "id":1058280,
            "title":"Misty, totally red faced and in the mood."
        },
        "11422112112111111111":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "Continue having sex",
                "Cut to the next morning...and they've all gotten fatter..."
            ],
            "content":"<div class=\"\"><div> <span>Sabrina grinned as she slunk over to Whitney, extending her plumped fingers toward her chest, pressing her fingers against her breasts. The pink haired girl recoiled instinctively, but her sex drive restrained the motion. Cooing slightly, she leaned toward Sabrina, who fondled her for a moment or two.  Her breasts were so large that even Sabrina's pudgy fingers couldn't work them alone.  If anything her hands soon grew tired from groping her.<br>\r\n<br>\r\nWhich was when Misty took another boob for her own.<br>\r\n<br>\r\nThe orange haired girl's lips curled into a small grin as she drew closer, her belly gently pressing against Whitney's fleshy hip. Her lips puckered outward as she drew closer to the gym leader's nipple, her tongue slightly extended. Sabrina too followed suit, but, just as they were about to suckle on her breasts, Whitney grew erect and stiff, a cry of pleasure escaping her lips.<br>\r\n<br>\r\nCandice was between her legs, her tongue darting inside of her gentle, twitching lips, running her fingers over the girl's thighs for stability. Her eyes were determined as she leaned in, ensuring not a single spot within her womanhood was left untouched. Before Buggy could fill the final hole, however, both Misty and Sabrina had come onto Whitney's breasts, suckling them gently.<br>\r\n<br>\r\nThe four adults were in pure ecstasy. Sabrina noticed how Bugsy's hands kept extending outward, wrapping around her arms, as if wanting something more. Before Sabrina could deal with him, her mouth was filled with bountiful milk. She swallowed the fattening liquid, noticing how Misty's cheeks had puffed out sharply from the sudden intack, only to swallow.<br>\r\n<br>\r\nWhitney sagged in their arms, moaning in ecstasy, as she grew weak, her belly gurgling softly.</span></div></div>",
            "created":1298869200,
            "id":1062257,
            "title":"Whitney is Targetted"
        },
        "114221121121111111111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "\"your next snowgirl...\"",
                "\"My turn...\""
            ],
            "content":"<div class=\"\"><div> <span>Whitney panted and yelled with pleasure as Bugsy ejaculated into her ass, and she sprayed all over Candice's face, the twin tailled girl sucking her temple like an orange. Her eyes were slowly rolling back and her tongue dangled as Misty and Sabrina drank from her heavy breasts. Suddenly Misty gulped more of the milk as she stopped suckling, making a \"pop\" sound. She lay on the bed, massaging her belly filled with Whitney's milk and she jestured the group.<br>\r\n<br>\r\n\"Break me\" she whispered, and they all caught the hint(save for Whitney who was recovering from her body-wide orgasm).<br>\r\n<br>\r\nThe first to strike was Candice, as she leapt on her and began to lick and bite the nipple of her non-existent breasts. Following her was Bugsy, now sticking his sheath into her slowly gaining ass. The boy seemed to have craved a taste for anal. Sabrina and Whitney followed last(as Sabrina was to stuff herself with Whitney's milk to painful heights. She did both breasts so that they would remain the same size). As Sabrina began to suck on the swimmer's temple below, Whitney began to rub her tits into Misty's left armpit, her milk slowly jutting out as Whitney whimpered with pleasure of her nipples being rubbed by Misty's shaved pit.<br>\r\n<br>\r\nAnd so they violated her, and Misty loved it. Candice played with her chest and navel, Bugsy rammed her from behind, Whitney wetted her armpits with milk, and Sabrina ate out of her. All of the gym leaders were succumbing to lust. Misty squirmed and struggled, her eyes begining to roll back and her tongue dangling as she muttered incoherent words. Finally, she shivered as she lead out a gutteral girlish scream.<br>\r\n<br>\r\n\"I\"M CUUMMMMMMIING!!!!\" and her body spasmed and she plopped onto Bugsy who was sitting behind her. The two/s tongue began to dance like eels afterwards.<br>\r\n<br>\r\nThe psychic then turned towards Candice and said...</span></div></div>",
            "created":1298869200,
            "id":1062279,
            "title":"Misty is gonna get broken"
        },
        "1142211211211111111111":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "Sabrina is the target of love making",
                "The others are too worn out, and Sabrina resorts to pleasuring herself"
            ],
            "content":"<div class=\"\"><div> <span>They dove onto Candice as one unit. Sabrina's gentle fingers roughly ran over the course of Candice's supple form, stroking and caressing every inch of her body, playing with the malleable meat on her bones. Sabrina felt Misty breathe over her shoulders, jumping into the fray after being so thoroughly expended previously. The two of them suckled Candice, her body shuddering in pleasure as her gasps for air came out in strained, orgasmic pleas.<br>\r\n<br>\r\nBugsy emerged from behind, staying with the area he had found the most success in so far. Whitney, however, heaved her breasts against Candice's thirsty, salivating lips.  Not the ones on her mouth, but rather the ones between her luscious thighs. After stroking her nipples against her lower regions, milk began to spray out of her nipples, spraying alongside her womanhood, parching its thirst.<br>\r\n<br>\r\nCandice shuddered as her womanly juices splattered out along with the milk, coating Whitney's breasts in sexual fluids.  Bugsy discharged into his target, and, almost at once, both Misty and Sabrina felt the familiar thick fluids of milk fill themselves.  They were, by now, stuffed with milk, falling backward as they massaged their distended middles. They had eaten more than just their fair share of food. Even milk was starting to stretch their insides out to painful limits. Still, one last girl remained, and she longed for equal treatment.</span></div></div>",
            "created":1298955600,
            "id":1062454,
            "title":"\"your next snowgirl...\""
        },
        "11422112112111111111111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Squealed with joy and pleasure! She wanted more! To be screwed and fattened!",
                "Tried to protest but she couldn't, and her mind began to turn to mush"
            ],
            "content":"<div class=\"\"><div> <span>\"No more...I am spent\" panted Bugsy, his stuffed belly heaving up and down, his cock reddened with the constant anal. Misty was incoherent, recieving the most intense of the sessions, all her vocab was pants, gasps, and moans.<br>\r\n<br>\r\n\"I think my tits got smaller due to your actions...\" moaned Whitney as she settled near the shota-esque gym leader. Candice was still mumbling after cumming from the previous. Sabrina scowled. She wanted to get loved now! She stood up and decided to give her orgy members a chocolate vat with melted butter and mized with vodka. she brought a soup laddle full each to their lips thanks to her psychic powers of causing the laddles to levitate.<br>\r\n<br>\r\n\"This should help right?\" she purred as the ocupants swallowed the fattening syrup. She continued to do so, even hearing protests from Candice. After several laddlefulls, their bellies were now rock hard again, and thanks to the chocolate and vodka, horny and drunk again.<br>\r\n<br>\r\nSabrina spread across the bed, opening her vagina towards the intoxicated group.<br>\r\n<br>\r\n\"Send me to the cosmos\" she purred, and the members staggered over to her.<br>\r\n<br>\r\nDue to her laying on the bed, Bugsy had to shuffle a bit for Sabrina to get on top of him for him to insert his rod into her anus. Misty suited for licking the psychic's vagina and Candice stood by as Whitney kissed Sabrina and played with her perky busom. Candice had a funnel in hand along with the chocolate pan and a smirk on her face.<br>\r\n<br>\r\n\"Hold her Whitney\" and she did, Sabrina yelping in pleasure as Bugsy kept slamming in her from behind, biting on her neck due to the soreness of his cock, which added to Sabrina's masochistic pleasure. Misty suckled her temple like an orange slice, and her hands wandered her lower body, caressing and molesting her fattened flesh. Then Sabrina felt a funnel in her mouth and her eyes widened as Candice began to pour the chocolate into her.<br>\r\n<br>\r\nAnd Sabrina</span></div></div>",
            "created":1298955600,
            "id":1062478,
            "title":"Sabrina is the target of love making"
        },
        "114221121121111111111112":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "She wakes up the next day, everyone fattened",
                "She wakes up the next day, no one else fattened, but her massive"
            ],
            "content":"<div class=\"\"><div> <span>Wait, this wasn't how it was supposed to go.  The sexual pleasure she enjoyed, yes, but the feeding was a different story. The chocolate flowing down her throat, filling her, as much as she enjoyed it, it was distracting her from the pleasure.  It was filling her, spreading throughout her entire body. She saw nothing else but the ceiling as bodies caressed her, heaving around her, entering and massaging her.<br>\r\n<br>\r\nAnd yet she felt her belly most of all.  Misty ran her plumpened fingers across her rock-hard bulge of a stomach as it grew thicker and thicker, the molten chocolate compressed within herself. Her eyes widened with protest, but soon her sexual arousal began to increase. All these powerful sensations consumed her, overlapping until they were the same, or at least enough to rid her mind of a thought or care.<br>\r\n<br>\r\nHowever, soon her tingly fingers twitched in her uncomfortable situation, her eyes rolling into the back of her head, as she lost consciousness, and descended into sleep....</span></div></div>",
            "created":1299042000,
            "id":1063214,
            "title":"Tried to protest but she couldn't, and her ..."
        },
        "1142211211211111111111121":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Wake up the group for breakfast and thanks for the night.",
                "She was going to shower..but she gets a vision!"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina felt her eyes flutter as she awoke. Looking at her watch it read 12:03, just after noon. She heaved herself up and gave a burp, covering her motuh in modesty. As she yawned, she took note of her surroundings and notice all of the room's occupants were naked due to the night before.<br>\r\n<br>\r\nMisty was next to her, arm's sprawled out. From the night before, all of the food as digested and the effects were interesting. Her upper legs seems to be getting most of the gain, her ass now as more of a curve into it. Her belly was now showing, the muscle of a swimmer now gone. Her arms, chest, and face remained the same though. Sabrina cannot wait to see how much of Titan Thighs girl the swimmer would become.<br>\r\n<br>\r\nWhitney's breasts were not as big as the night before due to being depleted of milk, but her belly and ass got some of the gain too. Her face remained the same. And if Sabrina knew the girl, her breasts would be full again with her drinking that MooMoo milk...<br>\r\n<br>\r\nCandice's face seemed more softer now, her breasts were a bit bigger, and she had the makings of a belly now. Her thighs seemed a little rounded out as well.<br>\r\n<br>\r\nBugsy seemed to have changed the most, know having a small flabby belly, his thighs and butt a bit expanded. He was inbetween the snowgirl and the milk postergirl.<br>\r\n<br>\r\nAnd the psychic observed herself, she grinned. Her legs where now much more packed with fat, as they almost touched each other. While her breasts remained the same, her belly got some of the fat, and now she poked it and grabbed it, giggling as she played with it. Her ass was bigger than Misty's(for now) but now had a decent amount of flesh in it. As she stood up and did a little booty dancing, she saw the flesh bounce up and down, causing the psychic to giggle.<br>\r\n<br>\r\n\"Now Ethan can't resist now...\" she purred as she observed her form.<br>\r\n<br>\r\nShe decided to</span></div></div>",
            "created":1299042000,
            "id":1063375,
            "title":"She wakes up the next day, everyone fattened"
        },
        "11422112112111111111111211":{
            "author_id":"gawayne",
            "author_name":"DJ Jaxx",
            "choices":[
                "Why don't we spend a little more time together (Everyone stays with Sabrina)",
                "I'm planning a party next week, you all can help me prep."
            ],
            "content":"<div class=\"\"><div> <span>Moments later Sabrina awoke the others, nudging her to rise with her surprisingly stronger psychic force. Her cosmic alignment seemed to have increased with her gain...How so was still unknown, but she barely cared. A moment later she saw her guests rise lazily, Bugsy having the hardest time getting up.<br>\r\n<br>\r\n\"Yaaawn...Man am I beat!\" Whitney cried out yawning. \"Last night was fun wasn't it?\"<br>\r\n<br>\r\n\"It was,\" Candice agreed, \" I can't remember the last time I 'ate' so much...Or drank so much milk!\"<br>\r\n<br>\r\n\"Me neither, we need to so this more often.\" Bugsy added while he considered buying Whitney milk to keep her breasts full and plump.<br>\r\n<br>\r\n\"I'm glad someone has alot of milk to give.\" Misty muttered glancing dismally at her less than modest bust. Suddenly she felt a reassuring hand on her shoulder. <br>\r\n<br>\r\n\"Don't worry Misty, they'll get bigger soon.\" Sabrina said cooly.<br>\r\n<br>\r\n\"In the mean time I see that your lower body's gotten nicer!\" Bugsy chimed in. Sabrina smirked while Misty gave him a murderous glare.<br>\r\n<br>\r\n\"Well everyone, we should probably get to lunch now before we head off. Everyone has each other's numbers so we can do this again sometime soon.\"  <br>\r\n<br>\r\n\"Actually...\" Misty said</span></div></div>",
            "created":1299042000,
            "id":1063720,
            "title":"Wake up the group for breakfast and thanks for ..."
        },
        "114221121121111111111112112":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Go shopping for clothes...",
                "Go to lunch at one of Kanto's largest food courts."
            ],
            "content":"<div class=\"\"><div> <span>\"Is the party after Ethan's exhibition match? I need to attend it and you are coming along after all\" pointed out Sabrina. The swimmer nodded. The other's faces...<br>\r\n<br>\r\n\"Sorry...I got temple duty for the rest of the week\" said Candice sadly.<br>\r\n<br>\r\n\"The dairy company needs me to get some comercials on TV and on the radio, so I may have free time...\" pondered Whitney.<br>\r\n<br>\r\n\"I'm going on a trip to Unova to observe some of the Bug pokemon there and do some research there. I'm gonna be gone for a month\" shrugged Bugsy. Misty pouted.<br>\r\n<br>\r\n\"Awww...that sucks\" Sabrina placed her hand on the swimmer's shoulder.<br>\r\n<br>\r\n\"It's fine relax. You got me and my psychic powers to help out? Remember?\" Misty smiled back.<br>\r\n<br>\r\n\"Thanks Sabrina,\" the psychic turned towards the group.<br>\r\n<br>\r\n\"Well...before you all head for the early evening trains, let's say we hit the clothing shops and get lunch! It's still early in the day\" suggested Sabrina.<br>\r\n<br>\r\n\"Sure!\" chimed Bugsy.<br>\r\n<br>\r\n\"Yeah..I haven't had breakfast yet...never slept in this late before too!\" added in the snowgirl.<br>\r\n<br>\r\n\"Me three!\" yelled Whitney with a boon, raising her hand in the air. Sabrina nodded.<br>\r\n<br>\r\n\"Alright, let's get dressed and cleaned up and head on the town!\"<br>\r\n<br>\r\nThe group had some diffilculty putting on their clothes due to the gain of the nights events, but they adapted, although Bugsy's safari shorts had a button popped, giving way to his belly. Candice felt a bit nervous with her new pounds so she wore her jacket to cover herself. Whitney didn't seem to mind that her breasts almost poured out of her shirt, and both Misty and Sabrina had problems trying to fit into their jeans, but opted for unbuttoned and allowed their bellies to hand over. Sabrina payed the proprieter for the room and food and the group walked onto the streets. Despite a few glances, the group fared well.<br>\r\n<br>\r\nWhat will they do first....</span></div></div>",
            "created":1299128400,
            "id":1063836,
            "title":"I'm planning a party next week, you all can..."
        },
        "1142211211211111111111121121":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "Sabrina fattens the group up more before they leave...",
                "Sabrina lets them fatten themselves up. One week later..."
            ],
            "content":"<div class=\"\"><div> <span>The group migrated to one of the local shopping districts in Saffron City. Almost immediately, Sabrina realized how much her body had changed over the course of a few days. While before she had searched for clothing in the ordinary women's isles, she found herself walking off with Misty and, to her mild surprise Whitney, to the plus sized section. Candice went off to the ordinary isle, her flared hips swaying side to side as Bugsy followed, a forced slave to the voluptuous leader.<br>\r\n<br>\r\nIt was difficult to find something that fit. Every outfit, no matter what their estimate, was either too tight around their hips or too baggy. Misty had the biggest conflict of them all, as her upper body was still relatively small for plus sizes, but her hips were well into the system. Whitney had less trouble, as, if she was to be believed, she had shopped in this section more often than Sabrina had guessed.<br>\r\n<br>\r\n\"It's not that I'm fat, but these boobs are kinda hard to fit in ordinary clothing, ya know?\" Whitney explained, blushing deep red.<br>\r\n<br>\r\nSabrina eventually found some clothing to wear, albeit the outfits were far too baggy. She resolved to fit into her baggy clothing...by any means necessary.</span></div></div>",
            "created":1299214800,
            "id":1064406,
            "title":"Go shopping for clothes..."
        },
        "11422112112111111111111211211":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "180(\"50 pound gain in 2 days! Incredible!\"",
                "200(\"I'm as big as Ethan now!*squeels*\""
            ],
            "content":"<div class=\"\"><div> <span>The group has reconvened, Bugsy holding most of the bags, his and Candice's while Candice carried little. Sabrina's group carried an equal amount.<br>\r\n<br>\r\n\"Finally I found something! Took me forever...\" groaned Misty \"thanks for the help Whitney.\" <br>\r\n<br>\r\n\"No problem!\" Sabrina giggled at her enthusiasm.<br>\r\n<br>\r\n\"Say you guys...how do you feel about yourselves right now?\" asked the psychic. The group pondered.<br>\r\n<br>\r\n\"I'm okay\" shrugged Whitney.<br>\r\n<br>\r\n\"Well I look more <i>healthier</i> if that counts\" mentioned Bugsy as he poked his belly. Candice's eyes wandered towards him shaking it but looked away blushing.<br>\r\n<br>\r\n\"I don't know...\" said Candice as she inspected herself. Maybe she would have a bit more resistance to the cold with some..insulation?<br>\r\n<br>\r\n\"I'm fine. What's up?\" asked the swimmer.<br>\r\n<br>\r\n\"Well let's head back to my place to try out our new clothes and...maybe have lunch too?\"<br>\r\n<br>\r\n\"but what about the food court...\" whined Whitney.<br>\r\n<br>\r\n\"Oh posh! My food is free you know. You should be grateful\" huffed Sabrina, and Whitney nodded.<br>\r\n<br>\r\n\"That works\" agreed Bugsy, Candice nodded.<br>\r\n<br>\r\n\"Well then. Onto my place we go!\"<br>\r\n<br>\r\n~Several hours later~<br>\r\n<br>\r\nSabrina's kitchen looked like a tornado come through. All the food was emptied and stored within the gullets of the group, back in their undies and stuffed. Bugsy rubbed his taught distened stomach. Candice and Whitney, laying with him on the couch on each side did so in tandem.<br>\r\n<br>\r\n\"Man...I think we just ate you out of a house Sabrina!\" said the pinkette. The psychic and swimmer sat together on a big chair, both rubbing their stuffed tummies. <br>\r\n<br>\r\n\"It's fine. I'll just do more shopping tomorrow...\" groaned Sabrina, loving the pain and pleasure of her stomach. Misty was in a food coma and was asleep against her.<br>\r\n<br>\r\n\"Well...I better get going. Snowpoint Temple can't run itself\" Candice stood up, hand on her belly as she walked towards where her clothes are, the purple haired boy and pinkette and pursuit.<br>\r\n<br>\r\n\"Thanks for the time Sabrina!\" said Whitney as she and her cliqie got dressed and the psychic escorted them out the door.<br>\r\n<br>\r\n\"Yes, we need to do this again. Later!\" and the group, with their clothes left for the early evening train. Sabrina sighed.<br>\r\n<br>\r\n'Time to weigh myself' though the psychic as she headed over to the bathroom. She stepped on the scale and it weighed...<br>\r\n<br>\r\n</span></div></div>",
            "created":1299214800,
            "id":1064417,
            "title":"Sabrina fattens the group up more before they l..."
        },
        "114221121121111111111112112111":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "Skip to next week, and everyone is fatter!",
                "Skip to next week, and everyone is unchanged...for now..."
            ],
            "content":"<div class=\"\"><div> <span>Sabrina rested her hands on her bulging stomach as it hung over the lips of her pants. She grinned, the dimples on her cheeks deepening in her enthusiasm. She wanted to jump for joy, if it wouldn't result in the possibility of her body knocking something over.<br>\r\n<br>\r\n50 pounds in two days. It was a disgustingly unreal number, and even now she had trouble swallowing it. So much weight gained over a short amount of time. Was this going too fast? Perhaps she needed to slow things down, or perhaps stop altogether.<br>\r\n<br>\r\nThen again, she had too much fun in her metamorphosis. Maybe she'd change the whole world, just as the cosmic visions foretold. Perhaps it was even time to spread her influence over every mortal on the planet.<br>\r\n<br>\r\nOr perhaps it was just time to prepare for the coming week...</span></div></div>",
            "created":1299301200,
            "id":1065026,
            "title":"180(\"50 pound gain in 2 days! Incredible!\""
        },
        "1142211211211111111111121121112":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "A white haired boy(Brendan) and a twintailed brunette(May)",
                "A short sickly greenhead(Wally) and a taller twintailed redhead(Flannery)"
            ],
            "content":"<div class=\"\"><div> <span>(Edit: Remember, we need the exhibition match with Ethan, so I changed it to a few days).<br>\r\n<br>\r\nSabrina and Misty touched down on the deck of the harbor. In front of them was the illustrious Ever Grande city, were the Pokemon League Triannual Exhibition will begin in two days. The duo have ate in abundance but at a much slower pace than the beginning.<br>\r\n<br>\r\nSabrina wore white slacks and her pink blouse as usual, weighing at 205 pounds. Her thighs were close touching and she had child birthing hips. Her rear had two supple fat cheeks which giggled with each step. Her breasts remained the same C cup but were perky and bountiful and her stomach bulged a little bit over her pants. She packed 10 pounds when she and Misty hung out in Saffron, then piled on another 15 on the cruise. She wanted to enjoy the gain and not attempt rush it unless she wanted to.<br>\r\n<br>\r\nMisty wore her overalls and yellow tank top and she has gained much too. When she was originally a skinny as a rail 95 pounds at the start of the week, she ballooned to 170, her change now evident. Her thighs did rub when she walked and were beginning to show a tinge of stretch marks. Her stomach was round but not as big as her psychic friend. Her ass was simply fat, and she had all the eyes of the boys when she and Sabrina danced in the club on the boat with her growing booty. <br>\r\n<br>\r\n\"Well...where are we staying at?\" asked the swimmer.<br>\r\n<br>\r\n\"The Omni. They have a 6star service so we can eat as much as we like!\" replied Sabrina, and Misty's face broke to a grin.<br>\r\n<br>\r\n\"Sweet! Wanna ask Ethan to join us?\" Sabrina shook her head.<br>\r\n<br>\r\n\"No, remember he needs to be ready for his match with Cynthia. The match between these two would show which region has the superior champion and get bragging rights. It's best that we don't interfere,\" Misty nodded.<br>\r\n<br>\r\n\"Alright. Let's check in and chow down and party! Hopefully there's a cute guy here we can...you know...\" this time Sabrina declined.<br>\r\n<br>\r\n\"Sorry. But I'm saving my time for Ethan. You can by all means find a guy here Misty. I'll leave the suite to give you a room\" Misty chuckled.<br>\r\n<br>\r\n\"Whatever you say. Let's hit it!\" And the duo made way to the Omni, as they waited in a short line at the front desk, Sabrina took note of the couple in front of her.</span></div></div>",
            "created":1299301200,
            "id":1065040,
            "title":"Skip a few days, and everyone is unchanged,for now"
        },
        "11422112112111111111111211211121":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "Coax Brendan into a battle against Ethan!",
                "Coax the two to join them for a meal..."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm bored,\" the girl sitting across from them moaned, her twin pigtails wilting at the side of her head. She rested a hand on her slender stomach as her white haired companion stared at her incredulously.<br>\r\n<br>\r\n\"But we were just at an amusement park on a dozen roller coasters. How could you possibly be bored?\"<br>\r\n<br>\r\n\"Eh, just am...\"<br>\r\n<br>\r\n\"Hey,\" Misty asked Sabrina, drawing in closer, blocking her words with her hand, \"But are those two--that's Brendan and May, right? The champion trainer and elite coordinator, right?\"<br>\r\n<br>\r\nIndeed they were. Sabrina stared at the two of them for a moment or two. While Sabrina was waiting for Ethan, those two legendary trainers, having arrived on the scene around the same time Red himself had, were notoriously hard to beat. May's Pokemon were all notoriously skilled in every category of her contests, having figured out what Pokemon to use and when. As for Brendan, he had toppled two groups of organized crime in one swoop, not to mention saved the entire world from great disaster...and then became champion. Unlike Ethan, however, neither of the two had let themselves go. They looked like they were in even better shape than they had been as kids...in regards to physical form, because, obviously they were stronger.<br>\r\n<br>\r\nThis union gave Sabrina an idea...</span></div></div>",
            "created":1299301200,
            "id":1065519,
            "title":"Rubies and Sapphires"
        },
        "114221121121111111111112112111211":{
            "author_id":"fredinno",
            "author_name":"YumonStudios/ Fredinno",
            "choices":[
                "Misty goes with may and brendan",
                "Misty eats heartily at sabrina's. The next day..."
            ],
            "content":"<div class=\"\"><div> <span>Sabrina: hello brendan. My name is Sabrina, a physic type kanto gym leader.<br>\r\nBrendan:of course I do.<br>\r\nBrendan:how....<br>\r\nSabrina:you haven't heard? I'm a physic!<br>\r\nBrendan:...right! I have challenged you before! Why did you come here, so far from your home?<br>\r\nSabrina: this is not very far though...<br>\r\n<br>\r\nSilence....<br>\r\n<br>\r\nMisty:she just wanted to ask you if you can battle ethan,Brendan.<br>\r\nBrendan: sure, but let's take that to another time. <br>\r\nMay:we're traveling to unova together.<br>\r\nBrendan:....but first, I'm going to have to challenge red on mount silver.<br>\r\nMay: I'm invited to the battle misty!<br>\r\n<br>\r\nMisty was yelping in joy. He could finally see red, the undefeated, legionary champion. Maybe SHE could convince Hinton leave his stupid mountain.<br>\r\nMisty: can I come too?<br>\r\n: Brendan was just about to refuse until he saw her needy, sad eyes with her plump lower body. It was Irresistible for him to give in to a hot girl.<br>\r\nBrendan:here is the invitation misty.<br>\r\nMisty recieves the ticket.<br>\r\nMisty: thank you soo much Brendan! Love you!<br>\r\nMisty kisses Brendan. At this, while Sabrina remained unchanged, Brendan and misty were blushing, may was annoyed.<br>\r\nMisty:when is the battle?<br>\r\nMay: *still annoyed* tommorown first thing. You want to go with us?</span></div></div>",
            "created":1338094800,
            "id":1346013,
            "title":"Coax Brendan into a battle against Ethan!"
        },
        "1142211211211111111111121121112112":{
            "author_id":"fredinno",
            "author_name":"YumonStudios/ Fredinno",
            "choices":[
                "Skip battle",
                "Don't skip battle"
            ],
            "content":"<div class=\"\"><div> <span>And so, misty and Sabrina came to he restaurant, we're they ordered everything on the menu from lunch, dinner and breakfast. Now now, they eat everything(or try to), but oboiusly, even when eating with their newly enlarged stomached to the limit, they can't make a very large dent in the food. They decide to keep all their food for later in (very large!) takeout containers. The eat into the night. The next morning: <br>\r\n<br>\r\nSabrina wakes up, dresses, and gets ready for the day, mainly just eating the leftovers and stuffing herself. Because the food was so fattening, it would definitely add to their growing bodies.<br>\r\n<br>\r\nMisty wakes up.<br>\r\nSabrina: you ready for the battle,misty?<br>\r\nMisty: yes,but I need to eat first!<br>\r\n(well yeah duh)<br>\r\n<br>\r\nSoon after, before yOu know it, misty is at the battle with red, and sabrina(after the battle was extended) goes tO watch the battle between Ethan and Cynthia.<br>\r\n<br>\r\nBattle against Ash Redside, kanto/johto, mt.silver.<br>\r\n<br>\r\nBrendan: oh god, where IS dawn and Lucas??<br>\r\n <br>\r\nIndeed, now, there was only may, leaf(red's close friend), wally(former rival),Brendan, and red at the battle.<br>\r\n<br>\r\nNow, finally, misty comes.<br>\r\nBrendan: finally, misty, you're here! I thought that you'd never come!<br>\r\nRed: you going to battle Brendan or what?!?<br>\r\n<br>\r\nRed's voice was cold, as if the cold of the mountain had sucked the happiness out of him.<br>\r\n<br>\r\nBrendan: guess this will have to do...<br>\r\n<br>\r\nEpic  Pokemon music starts playing</span></div></div>",
            "created":1338354000,
            "id":1348245,
            "title":"Misty eats heartily at sabrina's. The next ..."
        },
        "11422112112111111111111211211121121":{
            "author_id":"fredinno",
            "author_name":"YumonStudios/ Fredinno",
            "choices":[
                "Skip again?!?!",
                "Don't skip"
            ],
            "content":"<div class=\"\"><div> <span>\"nooooo!!!\" brendan exclaimed as his last Pokemon fainted.\"why?!\"<br>\r\nIndeed, it had need a very close battle, but thanks to red's lvl100 Pokemon and his unpredictable patterns and strategy, Brendan was defeated.<br>\r\nRed:... (leaves mountain)<br>\r\nMisty: wait--!!<br>\r\nLeaf(blue in japan): you! We met eyes so we're going to battle! <br>\r\nMisty but I wasnt--<br>\r\n<br>\r\nToo late. The battle had already started.<br>\r\n<br>\r\n\"Go! Goldeen!\"<br>\r\n<br>\r\nAt the battle vs Cynthia,<br>\r\n</span></div></div>",
            "created":1338354000,
            "id":1348720,
            "title":"Skip battle"
        },
        "114221121121111111111112112111212":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "A relatively small meal. Eating like normal people",
                "A large one, they were starving due to them starving themselves!"
            ],
            "content":"<div class=\"\"><div> <span>Using her psychic powers, she lowered the mental guards around the two young veterans minds to make them more accepting. She smiled and walked towards them, Misty following.<br>\r\n<br>\r\n\"Hey there! I'm Sabrina Hawthorne and this is my friend Misty Phelps. I was wondering if you may join us for dinner perhaps?\" <br>\r\n<br>\r\n\"Sure.\"<br>\r\n<br>\r\n\"I don't see why not...\" agreed the two Hoenn natives. Sabrina smiled and lead the way. Misty bounded up to her.<br>\r\n<br>\r\n\"So what's the plan girlfriend?\"<br>\r\n<br>\r\n\"You know that outing we had with Candice and gang?\" Misty got the hint immediately and smirked.<br>\r\n<br>\r\n\"Oh boy! And that Brendan kid has muscle too! I bet making him into a sumo wrestler type of fatty maybe fun...\" commented the swimmer.<br>\r\n<br>\r\nThe girls took the duo to the Omni Restaurant, readying to feed their guests. They got a seat near the window with a large circular table.<br>\r\n<br>\r\n\"So what would you like?\" asked the waiter.<br>\r\n<br>\r\n\"Me and my friend here will order 1 of everything of the entree menu. And our friends here...\"<br>\r\n<br>\r\nAnd Brendan and May ordered</span></div></div>",
            "created":1299387600,
            "id":1065574,
            "title":"Coax the two to join them for a meal... and more"
        },
        "1142211211211111111111121121112121":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "Brendan and May take the bait",
                "They decline, and Sabrina takes a bigger risk to make them eat..."
            ],
            "content":"<div class=\"\"><div> <span>\"Just some Chicken teriyaki with some onions and pepper,\" Brendan said, pleasantly.<br>\r\n<br>\r\n\"I want some ramen,\" May mumbled.<br>\r\n<br>\r\n\"Uh, we're at a fancy restaurant,\" Sabrina coaxed, hoping to influence her, \"You can have whatever you want.\"<br>\r\n<br>\r\n\"Uh, okay then,\" May said, nodding confidently, \"TWO bowls of ramen!\"<br>\r\n<br>\r\nThis was going to be tricky. As the food came, Sabrina and Misty found themselves gorging on the noodles, meats, and vegetables, while Brendan and May ate at a reasonable pace, taking time to taste each flavor spreading into their mouths. Sabrina glanced at Misty, and their inaudible, nonverbal message was sent. They needed to slow down to keep up with them.<br>\r\n<br>\r\nLogically, both Brendan and May were finished long before Sabrina or Misty made a dent in their meals. Laughing gently, Misty said, \"Uh, it looks like I ordered a bit too much food for myself. Do ya guys mind trying to help me finish?\"<br>\r\n<br>\r\n\"I dunno,\" Brendan replied, cautiously, \"I mean, it's not like I'm full, it's just that looks like an awful lot, and you did pay for it yourself.\"<br>\r\n<br>\r\n\"My treat.\"</span></div></div>",
            "created":1299387600,
            "id":1065693,
            "title":"A relatively small meal. Eating like normal people"
        },
        "11422112112111111111111211211121211":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Finished their half, stuffed and feeling accomplished.",
                "Didn't finish their half, stuffed and feeling a bit down."
            ],
            "content":"<div class=\"\"><div> <span>Brendan and May looked back at each other and nodded.<br>\r\n<br>\r\n\"It'd be rude to decline. Pile some on my plate,\" said the twintailed brunette.<br>\r\n<br>\r\n\"Me too. Thanks for the fine food. Never had this much good food in a while haven't we May?\" asked the whitehaired boy. Misty and Sabrina put half of their dishes onto their plates, giving each other a nonverbal and non physical high five.<br>\r\n<br>\r\n\"Yeah, we'e always been traveling sooo much. I think the stress of those contests were getting to me,\" sighed May as she started to eat. Brendan too. One thing Sabrina noticed was that due to them eating slow, it would pack on the pounds more than just gorging anything down. She let a smirk out, they'll gain for sure.<br>\r\n<br>\r\nAnd Brendan and May...</span></div></div>",
            "created":1299387600,
            "id":1065709,
            "title":"Brendan and May take the bait"
        },
        "114221121121111111111112112111212112":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "Trick Brendan and May",
                "Choose not to/find flaw in plan"
            ],
            "content":"<div class=\"\"><div> <span>Though having still ate an extraordinary amount of food in one sitting, May and Brendan finished their meals with only half of their plates empty, their stomachs bulging under them with food. They rested backward, their gasps for air coming out in strained hisses, as they moaned in pain.<br>\r\n<br>\r\n\"Oh, sorry we didn't...didn't finish your generous gift,\" May mumbled, clamping her mouth shut so she didn't vomit on the table.<br>\r\n<br>\r\nMisty, who had no trouble picking up on the two trainer's slack, waved off their concerns. \"It isn't a big deal, really.\"<br>\r\n<br>\r\n\"Well, after we digest, we should probably head out again...\" Brendan sighed, shifting his weight uncomfortably.<br>\r\n<br>\r\nSabrina needed more time with these two. How could she find a way to get them to stay? Well, Ethan was a trainer, and these were two legendary trainers. If she tricked Brendan into staying for an exhibition match against Ethan, held at Saffron Gym, they'd be able to keep Brendan there, along with May, until Eethan's other fight ended, freeing up his schedule for said exhibition match, which, in and of itself could take weeks, hold a big battle in their gym to raise money for the massive food bills Sabrina rallied up, and give her an opportunity to further explore her sexuality.<br>\r\n<br>\r\nOr maybe this wasn't the right thing to do...</span></div></div>",
            "created":1299387600,
            "id":1065729,
            "title":"Didn't finish their half, stuffed and feeli..."
        },
        "1142211211211111111111121121112121122":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Wally Esmerald, a sickly pale thin boy and Marley Burton the goth",
                "Bianca LaBelle the ditzy big booty blonde and Cheren Noble the cute smart guy"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh don't worry about it. Need help?\" offered Sabrina. She didn't want to take advantage of two famous trainers who were both strangers. Candice and the others were exceptions due to them being friends.<br>\r\n<br>\r\n\"Thanks..oof\" goraned May as she was helped up by Misty, and Brendan by Sabrina.<br>\r\n<br>\r\n\"How did you fit in so much food?\" asked Brendan, Sabrina shrugged.<br>\r\n<br>\r\n\"One of the benefits of being a big girl I guess\" and they helped them to their hotel room, coincidentally also in the Omni hotel.<br>\r\n<br>\r\n\"Thanks for the dinner...we need,\" May yawned. \"Some sleep.\"<br>\r\n<br>\r\n\"Of course. It was nice meeting you,\" and they left. Now Misty turned towards her companion.<br>\r\n<br>\r\n\"What gives? I thought we were gonna fatten them up?\"<br>\r\n<br>\r\n\"They're complete strangers Misty. We can't just take advantage of them like that,\" sternly said Sabrina. Misty sighed.<br>\r\n<br>\r\n\"I guess you have a point...hey look!\" she pointed and to the swimmer's delight it was a few friends of hers...</span></div></div>",
            "created":1299387600,
            "id":1065765,
            "title":"Choose not to/find flaw in plan"
        },
        "11422112112111111111111211211121211221":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "Exploits the two to fatten them....",
                "Uses the exhibition fight to fond more food binges..."
            ],
            "content":"<div class=\"\"><div> <span>Wally, upon seeing Misty, glanced over her, not making the connection that this fatty girl could possibly be the swimmer he knew for years. Inevitably, when he finally recognized her, he was rather surprised to say the least. \"Uh...Misty....uh...wow!\"<br>\r\n<br>\r\n\"You've gotten fat,\" Marley replied, bluntly.<br>\r\n<br>\r\n\"You aren't supposed to say that!\" stammered Wally.<br>\r\n<br>\r\n\"Aren't I?\"<br>\r\n<br>\r\n\"Well, it's not a big deal,\" Misty replied, jovially resting her hands on her hips, \"So, uh, what're you doing here?\"<br>\r\n<br>\r\n\"Conference,\" Marley replied, I had to--\" Marley froze for a second upon laying eyes on Sabrina. She stared at her for a moment before drawing nearer, poking her as though to confirm she actually existed in the flesh. \"You're Sabrina from Saffron?\"<br>\r\n<br>\r\n\"Yes,\" Sabrina replied, frowning,, \"And you are?\"<br>\r\n<br>\r\n\"I'm Marley. I'm from Sinnoh, and...are you real?\"<br>\r\n<br>\r\n\"Yes, I am very much real.\"<br>\r\n<br>\r\n\"I'm sorry, but it's just you're my role model! I became a trainer just to fight you!\" Marley replied, passionately withdrawing a Poke ball, \"Do you want to fight now?\"<br>\r\n<br>\r\n\"How about later? We're kinda tired, and...\" Misty's lips curled into a mildly mischievous little grin.</span></div></div>",
            "created":1299387600,
            "id":1065770,
            "title":"The Ill and the Goth"
        },
        "114221121121111111111112112111212112211":{
            "author_id":"gawayne",
            "author_name":"DJ Jaxx",
            "choices":[
                "\"Of course! Wally has a thing for big girls anyway!\"",
                "\"Maybe, but I wish to battle you first to see if it's worthwhile.\""
            ],
            "content":"<div class=\"\"><div> <span>\"..we want to eat.\" Misty finished.<br>\r\n<br>\r\n\"Haven't you eaten enough?\" Marley asked referring to Misty's flab. \"Honestly why did you let yourself go like that?\"<br>\r\n<br>\r\n\"I encouraged her to.\" Sabrina said. \"We're...Doing a liberating excperiment. To relieve our minds of stress caused by  social ideals.\"<br>\r\n<br>\r\n\"Really?\" Wally asked curiously. He didn't quite believe the statement, Sabrina sensed. He was definitely shrewd, Marley however was completely taken in.<br>\r\n<br>\r\n\"Yes,\"Sabrina continued, \"it's actually fun when you get used to it...As a matter of fact would you care to try it out as a kind of initiation?\"<br>\r\n<br>\r\n\"Initiation into what?\" Marley asked, her gloomy brightening ever so slightly.<br>\r\n<br>\r\n\"You interest me and I sense you have the potential to become a great psychic. If you prove yourself willing to join us I'll make you my official protege.\"<br>\r\n<br>\r\nMarley said...</span></div></div>",
            "created":1299387600,
            "id":1066152,
            "title":"Gaining a disciple"
        },
        "1142211211211111111111121121112121122111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Just Marley. You can feed us if you like...",
                "You both are...food's on the way."
            ],
            "content":"<div class=\"\"><div> <span>\"Marley!\" said Wally blushing. Misty and Sabrina chuckled.<br>\r\n<br>\r\n\"Well let's get to it then. Right this way,\" cooed Sabrina as she escorted them into their room. She and the swimmer sat on the bed while Marley and Wally sat on the couch.<br>\r\n<br>\r\n\"So...who's gonna be in this 'test' of yours?\" asked Wally. Sabrina smiled and said...</span></div></div>",
            "created":1299474000,
            "id":1066382,
            "title":"\"Of course! Wally has a thing for big girls..."
        },
        "11422112112111111111111211211121211221112":{
            "author_id":"dagameselite1",
            "author_name":"eva-dork",
            "choices":[
                "...too full to continue!",
                "...bloated and finished!"
            ],
            "content":"<div class=\"\"><div> <span>\"The two of us?\" Wally stammered, wide eyed, as the food came to their table.<br>\r\n<br>\r\n\"Yeah, we figured you both should go through this test, ya know?\" Sabrina said, glancing thoughtfully at Misty, a grin on their lips, \"So don't be hesitant. Eat as much as you want.\"<br>\r\n<br>\r\nWally and Marley glanced at their dishes of food, unsure how to go about this. They began to fill their pallets with delicious flavors, the two of them nearly cooing in delight as the food filled their throats with lush flavors that were the envy or any food connoisseur.<br>\r\n<br>\r\nWhat they didn't realize was that the food had been laden with supplements that were usually used on Miltanks, Grumpigs, and Tepigs to bulk them up. They would gain weight far more easily.  They were ideal guinea pigs for this new miracle drug.<br>\r\n<br>\r\nAfter an hour or two of eating, the two subjects were...</span></div></div>",
            "created":1299474000,
            "id":1066429,
            "title":"You both are...food's on the way."
        },
        "114221121121111111111112112111212112211122":{
            "author_id":"gawayne",
            "author_name":"DJ Jaxx",
            "choices":[
                "Several chocolate bannana split sundaes ( groupsex)",
                "Extra large helpings for the ladies (Marley eats Wally's share)"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my, I had no idea that eating could be so enjoyable.\" Marley said, her belly distended and her face calm. Wally looked slightly less comfortable.<br>\r\n<br>\r\n\"I guess, but I don't think I like this that much...Maybe I could feed you instead.\" Wally offered, rubbing his ailing gut. Sabrina and Misty were both in similar states, but both were happy.<br>\r\n<br>\r\nSabrina could sense that Misty was dying to ask Wally to allow her to get to know Brenden and May better. Apparently she was taken by them,though less so than Red.<br>\r\n<br>\r\n\"Well, why don't I help you pick out some food ?\" Misty said rising up and taking his arm. A moment later they were gone. Now it was just Marley and Sabrina.<br>\r\n<br>\r\n\"So Marley, you enjoyed your experience?\"<br>\r\n<br>\r\n\"Yes, actually I think that last meal was special...You had something added to it, didn't you?\"<br>\r\n<br>\r\n\"Well well, you do have a gift too, \" Sabrina observed taking in Marley's psychic energy, \"It's untrained but it's there alright...And growing. To answer you yes I had something added to it, did you like it?\"<br>\r\n<br>\r\n\"I did, I want to keep taking it, but do me a favor. Don't make Wally gain. We love eachother and agreed to respect our own decisions. He'll gain if he wishes, but I want to get bigger for him....And you.\"<br>\r\n<br>\r\nSabrina was surprised by just how honest and strong Marley's feelings were. She was brave enough to stand up to her hero for her boyfriend.<br>\r\n<br>\r\n'Very admirable...Maybe These two can join my inner circle.' Sabrina thought, \"Very well. I'll leave him out of this and guaruntee you a spot as my pupil, but in exchange you must gain extra. I'll increase your dosages.\"<br>\r\n<br>\r\nMarley cracked a mischeivious smile, \"I accept. This'll be a enjoyable experience.\"<br>\r\n<br>\r\n\"Indeed.\" Sabrina said smiling similarly and taking in Marley's appearance. She'd be an excellent, curvacious apple shaped woman.<br>\r\n<br>\r\nA moment later Misty and Wally returned with...<br>\r\n</span></div></div>",
            "created":1299474000,
            "id":1066949,
            "title":"A growing goth."
        },
        "11423":{
            "author_id":"jungle4u",
            "author_name":"GlennB",
            "choices":[
                "Sabrina's concerns ruins her chances of a good time.",
                "Sabrina relaxes as becomes more comfortable with theman, Ethan Goldstein"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>was smiling as though was glad to see her with some reservations. After all this was a chance meeting, or was it?</span></div></span></div>",
            "created":1381122000,
            "id":1675570,
            "title":"He has grown taller \"and\" chubbier"
        },
        "115":{
            "author_id":"therealfake",
            "author_name":"Therealfake",
            "choices":[
                "Sabrina likes this new fat. So much so, she wants more",
                "Sabrina decides to just kick back for the day, see what happens",
                "Sabrina goes to jack off (Futanari Option)"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina sighed as she leaned back. She was bored. Plain and simple she was bored. No one had made it to challenge her lately, the Gym saw few visitors and hadn't had a worthwhile battle in months. She even started going to the Gym less and less, becoming a bit lazier and more of a slob as she did. She only wore her usual top lately and white pants, but those were starting to get more then snug that was for sure.<br>\r\n<br>\r\nHer lazier tendencies had caused excessive eating on her part and a lack of exercise only helped facilitate her rise in weight. She had already put on about forty pounds within the past few weeks, her belly swollen into a sizable muffin top as her folds flowed a tad over her wider hips and her butt made her pants fairly close to ripping in the back as well.<br>\r\n<br>\r\nSabrina let out a dejected sigh as she looked down at her sizable bust, a large C lingering close to a small D-cup or it would in time at least. That was one benefit to her new, slovenly lifestyle, the fact her new body fat found its way to her bust and increased its size. Even if she was okay for now, eventually she needed to work. If not as a Gym Leader, she would need to lose weight fast seeing how she had gained some fame in Unova as an actress.<br>\r\n<br>\r\nHowever, Sabrina lacked any proper motivation. Remaining a couch potato for the moment, she flicked on the TV and started to shovel handfuls of popcorn in her mouth from a porcelain blue and white bowl in a bored fashion. She poked at her chubby belly while she continued to eat, opening a can of cola sitting on the table and taking a sip Sabrina looked down at herself, wondering what in the world she could do today in her continued regimen of...doing nothing.</span></div></div>",
            "created":1358312400,
            "id":1509866,
            "title":"A Story about Nothing"
        },
        "12":{
            "author_id":"gawayne",
            "author_name":"DJ Jaxx",
            "choices":[
                "Another Person",
                "Pokemon",
                "A Pokemorph",
                "Inanimate object",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does she change into though?</span></div></span></div>",
            "created":1297314000,
            "id":1051290,
            "title":"TF"
        },
        "121":{
            "author_id":"mrwoodson",
            "author_name":"mrwoodson",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>a 13 year old girl</span></div></span></div>",
            "created":1353474000,
            "id":1472468,
            "title":"Another Person"
        },
        "122":{
            "author_id":"eblmeg",
            "author_name":"Ëtalfni",
            "choices":[
                "Abra.",
                "Mew.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So she's eventually become a Pokemon? What are her options then?</span></div></span></div>",
            "created":1297573200,
            "id":1053043,
            "title":"Pokemon choice list one."
        },
        "1222":{
            "author_id":"eblmeg",
            "author_name":"Ëtalfni",
            "choices":[
                "Do her morning meditation.",
                "Take a nice shower.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span><i>\"It's cold outside...\"</i><br>\r\n<br>\r\nI look up at down the window, frigid looking raindrops liter the glass. They streak down, reflecting the blue light in the distance. It's calming. But its so cold.<br>\r\n<br>\r\n<i>\"I don't like the cold...\"</i><br>\r\n<br>\r\nI noticed something swaying just behind the glass. It isn't something that's threatening me. In fact, I think it seems almost...<br>\r\n<br>\r\n<i>\"It's so lonely...\"</i><br>\r\n<br>\r\nSad...<br>\r\n<br>\r\n<i>\"I hate being alone.\"</i><br>\r\n<br>\r\nI share a moment of silence with the melancholy figure. It hums a soft pink light that brightens a little bit of the darkness outside. But I can't see its features. If I could, I think it would be frowning. Or crying.<br>\r\n<br>\r\nAs if it were unaware of my presence the entire time, it suddenly addresses me.<br>\r\n<br>\r\n<i>\"Are you...Lonely too?\"</i><br>\r\n<br>\r\nI want to respond to it. Tell it that its wrong and that it should mind its own business. But...I seem unable or unwillingly to get the words out. This feeling I have...It's haunting.<br>\r\n<br>\r\n<i>\"Everyone seems happier when they're together...I've never been together with anyone...\"</i><br>\r\n<br>\r\nWhat am I feeling?<br>\r\n<br>\r\n<i>\"So, why don't we be together?\"</i><br>\r\n<br>\r\n~<br>\r\n<br>\r\nSabrina woke up taking a frightened gulp of air. A nameless fear still hung over her and her sheets were covered in a cold sweat.<br>\r\n<br>\r\nWith her legs in a pyramid, she hugged them slightly. She was trying to place her thoughts as to what she had just experienced. A dream? A vision? That entity that was speaking. Even though she had access to her physic powers most of her life, Sabrina never felt something that vivid before. She looked at her bedroom window. Stale drops of rain water still clung to the glass, but the sky was void of any signs of that pink light.<br>\r\n<br>\r\n\"Just a dream...\" She said to herself.<br>\r\n<br>\r\nSighing in a mixture of confidence and relief, she laid back on the mattress. The stress of training was getting to her. Since the sudden increase in trainers recently, there was a demand to be better and stronger. More so then ever before. Trainers came from all over the world expecting the Saffron City Gym to provide a challenge to them. As the Gym Leader, Sabrina was forced to meet that demand whatever the cost. It was just unfortunate that the cost was usually many sleepless nights spent training both herself and her Pokemon.<br>\r\n<br>\r\nShe was still wearing her uniform, apparently she had passed out from last night's training. Her Pokemon must have carried her to bed, several of them were snuggled up against each other in the corner of her room. They must have fallen asleep after putting her to bed.<br>\r\n<br>\r\nThough she didn't physically smile, Sabrina was somewhat warmed by this sight and quietly stepped out of her room being careful not to disturb them.<br>\r\n<br>\r\n<i>\"Are you lonely too?\"</i><br>\r\n<br>\r\nShe froze after halfway closing the door and took one last look out the window. Still, nothing was there. Satisfied, but still somewhat uneasy, she gently shut the door and continued on her way to start the new day...And begin more training.<br>\r\n<br>\r\nFirst things first though, she needed to... </span></div></div>",
            "created":1297573200,
            "id":1053059,
            "title":"Lonely."
        },
        "12221":{
            "author_id":"gawayne",
            "author_name":"DJ Jaxx",
            "choices":[
                "It reach into her mind.",
                "Something nudge her from behind"
            ],
            "content":"<div class=\"\"><div> <span>A few minutes later Sabrina was in her meditation room. It was a stark room with a polished applewood floor and large walls, each one had a different mural on it, as did the ceiling. One was of a field, lush and vibrating with life, knolls as far as the eye could perceive. The next was of a deep ocean, clear blue and unfathomable...Presenting eternal mystery. The neighboring wall had the image of a mountain high in the heaveans, a light cerulean sky with fluffy nimbus clouds nearby. The fourth wall was of an embryo, life at it's very beginnings and at it's most complex, the fascinating structure that houses the soul before one can formulate thought. Lastly was the ceiling, that showed an artfully painted picture of the universe. One could just make out the Milky Way in a myriad of stars. <br>\r\n<br>\r\nIt was infinite space, infinite potential.<br>\r\n<br>\r\nThese images helped Sabrina get into the meditating mood. She closed her eyes and sat down, she emptied her consciousness of every material thing and focused instead on the world around her and her own body. She could feel everything from her own Pokemon nearby and humans miles away. She felt them, their happiness, their worries, and their life. By no means did she invade their thoughts, but instead she gleaned them and analyzed them, which caused her to think of her own issues or successes. <br>\r\n<br>\r\nShe went about business as usual, when she felt something wrong...She felt a strong wave of lonliness...<br>\r\n<br>\r\n <i> Where is it coming from?</i> Sabrina asked herself mentally. She did her best to hone in on it, but whatever it was was quick, elusive, and powerful. If she got close to it, it would put up a mental block. The block was only just strong enough to hold her back no matter how much mental force she used. suddenly she felt...</span></div></div>",
            "created":1297832400,
            "id":1055250,
            "title":"Do her morning meditation."
        },
        "122212":{
            "author_id":"eblmeg",
            "author_name":"Ëtalfni",
            "choices":[
                "An assembly call for Gym Leaders.",
                "A love letter."
            ],
            "content":"<div class=\"\"><div> <span>She felt the presence getting closer. It had suddenly turned the tables, instead of Sabrina pursuing the abnormality it was after her!<br>\r\n<br>\r\nBeads of sweat formed at the tip of her brow. She put up a quick mental block, attempting to stave off whatever it was. She felt that the thing's intentions weren't aggressive, but it desperately wanted to be with her for some reason. Putting all her strength into the mental block, Sabrina focused primarily on maintaining it.<br>\r\n<br>\r\nThen it was gone.<br>\r\n<br>\r\nWhile she had been busy forming the block, she had completely lost track of it. It had simply vanished as if it never was there. Cautiously lowering the mental block, Sabrina briefly scanned the area for any signs of the lonely emitter. There was nothing.<br>\r\n<br>\r\nThen something nudged her in the back.<br>\r\n<br>\r\nYelping slightly, Sabrina's eyes shot wide open and she jumped five feet into the air.<br>\r\n<br>\r\n\"Mr.Mime?\" Asked a goofy voice.<br>\r\n<br>\r\nSabrina landed hard on her bottom. Breathing heavily, she saw immediately what it was that had bumped into her. It was one of her Pokemon, Mr.Mime, who had been cleaning the room. He must have accidentally tapped her with his broom while sweeping around her.<br>\r\n<br>\r\n\"You...scared me...\" She whispered, in her usual monotone voice. Her heart was still going fifty beats a second.<br>\r\n<br>\r\n\"Mime!\" Bowed the Mr.Mime as if he were apologizing.<br>\r\n<br>\r\n\"It's alright...Just be a little more careful when cleaning, okay?\"<br>\r\n<br>\r\n\"Mime!\" He replied as he stumbled out of the room, clattering into a nearby vase directly outside in the hall. There was a crash followed by a smash and more shouts of \"Mr.Mime!\". Sabrina could only guess what had happened. If she had the capacity to, she'd probably have started to giggle.<br>\r\n<br>\r\nBut instead she paused to recollect her thoughts, trying to piece together what had happened during meditation. Where ever that strange presence went, it was long gone now. It certainly hadn't come from any of her Pokemon, nor her Mr.Mime who had broken up the tension a great deal. It was foreign and yet so familiar at the same time. Sabrina recalled her dream. They couldn't have been collected, could they?<br>\r\n<br>\r\nA tap at the window snapped her back to reality.<br>\r\n<br>\r\nThere was a Pidgey in the frame with some kind of letter tied to its legs. Standing up, Sabrina opened the window and the bird Pokemon flew, nestling on her shoulders. It stared at her intently, as if it were impatient to deliver the message and be on its way.<br>\r\n<br>\r\n\"Something for me?\" Sabrina asked, carefully slipping the note of the Pidgey's legs.<br>\r\n<br>\r\nIt was...</span></div></div>",
            "created":1297918800,
            "id":1055769,
            "title":"You tease..."
        },
        "1222121":{
            "author_id":"quartoron",
            "author_name":"Orpheus Telos",
            "choices":[
                "Go",
                "Stay"
            ],
            "content":"<div class=\"\"><div> <span>It was an assembly call for Gym Leaders, apparently. They were ordered to come to the League as soon as possible.<br>\r\n<br>\r\nSabrina still hadn't finished her meditation, but this was important. Of course, a challenger could come and be disappointed by her absence... does she stay or go?</span></div></div>",
            "created":1309064400,
            "id":1134830,
            "title":"To Go or Not to Go?"
        },
        "12221212":{
            "author_id":"quartoron",
            "author_name":"Orpheus Telos",
            "choices":[
                "Continue -->"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina decided to stay and finish her meditation. She wrote a reply and sent the Pidgey off. Then she went to her bed for meditation.<br>\r\n<br>\r\n------------------------<br>\r\n<br>\r\nLater that night, Sabrina was fast asleep, when she heard a voice say, \"Are you lonely?\" Sabrina hopped out of bed and said, \"Who's there?\" \"Just me.\", the voice replied. Then, a bright pink light shot in front of Sabrina! Pain shot through her body... and then it was over. The light faded off and revealed a Mew. Both bodies were now limp on the floor, and none of Sabrina's pokemon were out. They were alone.<br>\r\n<br>\r\n-------------------------<br>\r\n<br>\r\n\"Ughhhh...\" Sabrina said. She got up... but it was... hard. Her arms were shorter then usual, as well as her legs. And something popped out in front of her... a tail? She tried to scream, but all that came out was a small little \"mew.\"<br>\r\n</span></div></div>",
            "created":1309064400,
            "id":1134833,
            "title":"Better Things to Do"
        },
        "122212121":{
            "author_id":"quartoron",
            "author_name":"Orpheus Telos",
            "choices":[
                "Regular",
                "Shiny!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sabrina could simply not believe had just happened to her... she was a Mew!<br>\r\nBut was she a regular mew or a shiny one?</span></div></span></div>",
            "created":1313730000,
            "id":1171138,
            "title":"Sabrina No More..."
        },
        "1222121212":{
            "author_id":"mouseluver",
            "author_name":"Eclipse",
            "choices":[
                "Hyper Beam",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>OK, she was a shiny mew. But what moves does she know?</span></div></span></div>",
            "created":1357189200,
            "id":1500994,
            "title":"Shiny!"
        },
        "1222122":{
            "author_id":"hawktiger5",
            "author_name":"A. Prescott",
            "choices":[
                "Send a note",
                "Just send Pidgey away. (letter has a curse)"
            ],
            "content":"<div class=\"\"><div> <span>It was a love letter from a trainer near her age. His name was Adam, he's a rising star in the pokemon world with his Lucario and his Rare Absol and other pokemon. The note read. \"Dear Sibrina, if you dont remember me, Let me give you a refresher, we were friends in Middle School but before 8th grade, my father moved to a diferent region and I left you behind. I wanted to tell you this the last summer I saw  you. I have a crush on you and I'ld like to meet you again. I'm heading to your gym and my Pidgey will take you answer to me. If you dont want to see me, Just send Pidgey back no letter, and I'll walk past your town.</span></div></div>",
            "created":1340427600,
            "id":1365457,
            "title":"A love letter."
        },
        "1223":{
            "author_id":"mouseluver",
            "author_name":"Eclipse",
            "choices":[
                "Mewtwo",
                "Rattata",
                "More yet!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>OK, so none of those were good enough?</span></div></span></div>",
            "created":1363064400,
            "id":1548622,
            "title":"More choices."
        },
        "12233":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Gardevoir",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the Obvious one?</span></div></span></div>",
            "created":1499317200,
            "id":2348317,
            "title":"More yet!"
        },
        "124":{
            "author_id":"envi",
            "author_name":"Envi",
            "choices":[
                "She change into some of her clothes?",
                "She become an object in the gym?",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So she is going to turn into some type of object but what one?</span></div></span></div>",
            "created":1332651600,
            "id":1302709,
            "title":"Inanimate object"
        },
        "1243":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "yes",
                "other",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she become a pokeball?</span></div></span></div>",
            "created":1499317200,
            "id":2348314,
            "title":"Other"
        },
        "125":{
            "author_id":"featherston",
            "author_name":"Jake Featherston",
            "choices":[
                "Yes! (choices within)",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, how about transforming into some form of monstrous, non-Pokemon creature (kaiju, dragon, blob, etc...)?  Specifics can be determined through later choices, but try to keep them brief. </span></div></span></div>",
            "created":1349154000,
            "id":1439197,
            "title":"A monster? "
        },
        "1251":{
            "author_id":"ro781727",
            "author_name":"link",
            "choices":[
                "A toad",
                "a blob",
                "A gorilla"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She turns into</span></div></span></div>",
            "created":1381035600,
            "id":1675547,
            "title":"Yes! (choices within)"
        },
        "12513":{
            "author_id":"gawayne",
            "author_name":"DJ Jaxx",
            "choices":[
                "Began to channel it (gradual physical TF and slight mental TF)",
                "Felt it come at her (immediate mental and physical TF)"
            ],
            "content":"<div class=\"\"><div> <span>As a psychic Sabrina had many skills and abilities the average human being would not, including an ability to connect to people and Pokemon on both a mental and spiritual level. Her ability also made her want to study Pokemon and commune with them, including ones outside of her favored and beloved Psychics from time to time.<br>\r\n<br>\r\nFor that reason she invited people frm the Fighting Dojo across the street to come and help her with understanding Pokemon better. She had invited one of them, the Karate Master Kiyo, had brought over some of his own Pokemon. Among them were Primate.<br>\r\n<br>\r\nFeeling curious, Sabrina linked her mind and Primeape's once they were both in a meditative state, linking to a possible ancestral spirit or creature that held a distant kinship to Primeape from an unknown age or place.<br>\r\n<br>\r\nWhen she had though, Sabrina...</span></div></div>",
            "created":1381294800,
            "id":1676418,
            "title":"A gorilla"
        },
        "1252":{
            "author_id":"n8han",
            "author_name":"n8han11",
            "choices":[
                "Yes",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Since some guy messed up the option and the creator hasn't bothered to do anything about it, would you like to transform Sabrina into another person?</span></div></span></div>",
            "created":1511586000,
            "id":2420304,
            "title":"Another person"
        },
        "13":{
            "author_id":"gawayne",
            "author_name":"DJ Jaxx",
            "choices":[
                "Younger",
                "Older",
                "Both",
                "She's always been younger",
                "She's always been older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she get younger or older?</span></div></span></div>",
            "created":1296968400,
            "id":1048985,
            "title":"AP/AR"
        },
        "14":{
            "choices":[
                "Standard growth.",
                "Standard shrinkage.",
                "Growth in some spots.",
                "Shrinkage in some spots.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Excellent choice. Now then...what will our lovely lady be going through?</span></div></span></div>",
            "created":1297918800,
            "id":1055624,
            "title":"Growth/Shrinkage it is!"
        },
        "141":{
            "author_id":"total_pokemon",
            "author_name":"Total_Pokemon",
            "choices":[
                "Fast Growth!",
                "Slow Growth!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it a fast growth, almost instantly? Or is it a slow growth where she grows over time?</span></div></span></div>",
            "created":1389416400,
            "id":1725494,
            "title":"Standard growth."
        },
        "142":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "herself",
                "others",
                "herself and others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>shrinkage for whom</span></div></span></div>",
            "created":1511586000,
            "id":2420202,
            "title":"Standard shrinkage."
        },
        "145":{
            "author_id":"snakehead222",
            "author_name":"Venom",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she someone else?</span></div></span></div>",
            "created":1298955600,
            "id":1062917,
            "title":"Something else."
        },
        "1451":{
            "author_id":"snakehead222",
            "author_name":"Venom",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she shrink you?</span></div></span></div>",
            "created":1298955600,
            "id":1062918,
            "title":"Who?"
        },
        "14511":{
            "choices":[
                "do you accept the offer on the table from Sabrina ",
                "or reject it from Sabrina and get crushed beneath her feet"
            ],
            "content":"<div class=\"\"><div> <span>well you were a normal trainer fighting Sabrina's pokemon to win a badge but with a wacky twist she gets out a shrink ray and shrinks you to 5 inches tall and you say what just happend and Sabrina says simply I just shrunk you with a shrink ray and now I'm placeing you in my left shoe were it is warm and confy in there while I'm battling another trainer my feet will keep you warm meanwhile I'm battling another trainer so have fun down there inhaling my foot odor but don't worry about the smell I take a bath every day so don't put your left hand to your nose my feet do not stink that much I bathe regurarly so they don't smell because I don't want to turn away other trainers with my foot smell and would you be my foot slave?</span></div></div>",
            "created":1318482000,
            "id":1205681,
            "title":"yes"
        },
        "145111":{
            "choices":[
                "how does your first date with Sabrina go good ",
                "or does Sabrina mistake you for a bug and squash you but you don't die "
            ],
            "content":"<div class=\"\"><div> <span>you think about the perdicerment you are in right now because you know full well you can't get out of this one this time and you say to Sabrina I know that you are 16 to 17 years old and Sabrina asks how did you know that and you say well I learned it on the internet and Sabrina says oh that old Internet and Sabrina places you in her right shoe under her left foot and man Sabrina wasn't kidding when she told you her feet didn't stink at all in a matter of fact they smelled like fresh daisy's being picked in the summer time and you curl up to her sole of her foot and say aah warmth abd you grab a hold of her sole and fall fast asleep and with Sabrina being a psychic she made you durable so you wouldn't get crushed under her weight while she was battling other trainers so you were loving life being shrunk by a psychic and being a foot slave to Sabrina how could it get any better and Sabrina walks home after battling 300 trainers a day she goes home opens her door and walks upstairs and kicks off her shoes and peels of her socks and wiggles her toes a little and sees you were taking a nap under her sole and says how cute is that and Sabrina waits until you wake up and Sabrina says well since I'm single would you like to go on a date with me don't worry at all I'll add some inches to you and instead of being 5 inches you'll be 12 inches and I'll have a little boyfriend.</span></div></div>",
            "created":1318482000,
            "id":1205880,
            "title":"do you accept the offer on the table from Sabrina "
        },
        "1451111":{
            "choices":[
                "is our million dollar idea a hit ",
                "or a million dollar flunk"
            ],
            "content":"<div class=\"\"><div> <span>well the first date with Sabrina went great because Sabrina hung a not here sign on her door and puts her hand in mine and we go get in her car and drive to a movie together and then when Sabrina and me got done with the movie we went to mcdonalds and ate a hamburger and fries and I peeled off the sticker and it said you have won a million dollars on the peel and Sabrina and me had dollar signs in our eyes knowing we could turn the gym into a million dollar stadium and we went right to work Sabrina makes some calls to her parents and I got on the phone with the mega-tron company and when we got done putting the finishing touches on the stadium it was 6:30 PM in the evening and I said man am I beat and Sabrina smiles and says let me make you a delicious dinner now because you made us Millionaires and I ate the dinner that Sabrina made and looked at her and smiled and said we did a great job we will tell the trainers tommorrow that they can battle in our new stadium and Sabrina smiled and said good night honey.</span></div></div>",
            "created":1318914000,
            "id":1208904,
            "title":"how does your first date with Sabrina go good "
        },
        "14511111":{
            "choices":[
                "how does Sabrina pay me back a trip to burmuda",
                "or a brand new car"
            ],
            "content":"<div class=\"\"><div> <span>yep we had a million dollar hit on our hands each day we had trainers come from all across the area to battle in our state of the art stadium and when the winnning trainer won the battle we gave them either a gold star badge or a silver star badge and they walked out of the gym smiling and then Sabrina scratched her chin and said to me why don't we have a tournament and whoever wins gets a 1,000,000000 dollars and my mouth dropped wide open and I said you know your throwing our money away and Sabrina smiled and said don't be silly my family is rich we have a million dollars in the bank so when we give a milllion dollars away to a lucky trainer they just need to beat the other trainers and the winning trainer will get the winnings and Sabrina welcomed the trainers including Ash Ketchum from pallet town wanting to win a million dollars and I was setting on the couch inside her room flipping the channels and saying to myself is their anything on and I found the A-Team movie to watch and I popped some popcorn and watched the movie and said this is exiting meanwhile outside in the gym trainers were battling other trainers for the million and then it was between ash ketchum and Gary Ketchum and Ash said I really want that million dollars and it was a battle of strengths and both trainers battled it out and at the end it was a tie and Sabrina gasped and spoke through the loud speaker \"GET OUT HERE NOW PLEASE\" and I knew I was needed so I paused the movie and went out next to Sabrina and she asks me how are we going to know who wins it;s a tie and I smile and say instead of giving both of them a million dollars let's give Ash Ketchum a million dollars abd Gary gets 25,0000 dollars in cash and Sabrina hugged me and said well thank you that makes total sense right about now.</span></div></div>",
            "created":1321160400,
            "id":1222446,
            "title":"is our million dollar idea a hit "
        },
        "145111111":{
            "choices":[
                "how does she reward you with a brand new car",
                "or does she give you a brand new TV"
            ],
            "content":"<div class=\"\"><div> <span>well Sabrina was still a giantess but she was treating me to a trip to burmuda and I was as happy as a clam and when we arrived at the airport and I got Sabrina's luggage and man was it heavy when I picked it up and carry it up to our giantess room and Sabrina was tapping her left foot like she was impatient and says in anger \" WHERE WERE YOU\" and I'm panting and fall down at her feet and say I'm sorry for being late and Sabrina smiles and giggles and says man I had you fooled I was just playing with you but you can rub my feet for me and I was smiling from ear to ear and I said why didn't you ask earlier and Sabrina smiled and said silly we were playing a game together and I won the game and I saw Sabrina was waiting for me to rub her feet and I did as I was supposed to I did the arch then I did te ball and then the toes and then I repeated the process on her other foot and she was smiling and patted me on the head with her left foot and I sniffed her right foot and man was it sweet it was like biting into a new chocolate bar.</span></div></div>",
            "created":1321678800,
            "id":1225789,
            "title":"how does Sabrina pay me back a trip to burmuda"
        },
        "1451112":{
            "choices":[
                "What????"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina then stand up and says \"wait-I forgot something\" and walks away. You take advantage of the opportunity to hide behind a nearby table leg. A few minutes later you hear her thundering footsteps and see her giant gorgeous bare feet land next to you. \"Where did you run off to my little slave\". She begins pacing impatiently her loud footsteps creating shock waves that rattled your tiny body. Suddenly she spot you by the corner-\"Is that you my slave-Wait no it's gross bug!\" She raises her giant foot to squash you when suddenly you see her foot pause in midair and she squints a little bit while staring at you. She then laughs and lowers her colossal foot and lays down on her stomach with her gigantic face staring straight at you. \"Sorry-little guy-didn't mean to scare you-haha!\" She then picks you up and places you on the palm of her hand and gives you a very large giantess kiss. You get drenched with her spit as the red pillows close around you, but you can't help but to enjoy her the experience. She then sets you back down on the table on walks away. Returning some minutes later-she is wearing only boxer shorts and a too small t-shirt revealing her sexy midriff and her long beautiful legs. She lays you on her bed and stretches herself out fully placing you next to her left foot. \"Okay-little slave hears the deal-if you can successfully traverse across me starting at my foot all the ways up to my face-I'll grow you back to normal size-or the closest to normal that you'll ever be-haha\" Realizing that this was the best deal you could get-you start the bear-hugging your way up her enormous foot. Once on top of it-you begin the cross country trip across her never-ending leg until you arrive at her stomach. Her smooth skin is too smooth to grab onto, but luckily your able to gain a hold on the ledge of her belly button and then use this cave as a pit stop to rest in. You then begin the journey up her shirt and finally up to her giant, beautiful face. \"Congratulations!!\" She exclaims. \"Alright you've earned this!\" You then feel dizzy and black out and wake up to see that she grown you to only 12 inches instead of 5. \"I told you that I'd make you normal-well this is your NEW normal\" she laughs. You're going to be my tiny pet boyfriend from now on-haha\"</span></div></div>",
            "created":1528103880,
            "id":2502732,
            "title":"or does Sabrina mistake you for a bug and squas..."
        },
        "14512":{
            "choices":[
                "Yes",
                "Yes but just Ash"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she shrink Ash, Brock, and Misty like in the anime?</span></div></span></div>",
            "created":1316235600,
            "id":1189190,
            "title":"no"
        },
        "145121":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "no the other gens (but ash still shrinks)",
                "all companions shrink (including ash)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>specifically those companions shrink</span></div></span></div>",
            "created":1523682000,
            "id":2479505,
            "title":"Yes"
        },
        "1451212":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "ash, misty and tracey",
                "ash, may, max and brock",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>specifically whom</span></div></span></div>",
            "created":1523682000,
            "id":2479506,
            "title":"no the other gens (but ash still shrinks)"
        },
        "14512123":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "ash, brock and dawn",
                "ash, iris and cilian",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>specifically whom</span></div></span></div>",
            "created":1523682000,
            "id":2479508,
            "title":"other"
        },
        "145121233":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "ash, clemont, bonnie and serena",
                "ash, lana, mallow, sophocles, lillie and kiawe",
                "other(placeholder)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>specifically whom</span></div></span></div>",
            "created":1523682000,
            "id":2479512,
            "title":"other"
        },
        "1451213":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>anyone else too?</span></div></span></div>",
            "created":1523854800,
            "id":2480381,
            "title":"all companions shrink (including ash)"
        },
        "14512131":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "no",
                "yes and others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about herself?</span></div></span></div>",
            "created":1524013200,
            "id":2481022,
            "title":"yes"
        },
        "145121313":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "rivals",
                "families",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Like whom?</span></div></span></div>",
            "created":1524052920,
            "id":2481203,
            "title":"yes and others"
        },
        "1451213131":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "ash",
                "his companions",
                "ash and his companions"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>rivals of whom?</span></div></span></div>",
            "created":1524055320,
            "id":2481224,
            "title":"rivals"
        },
        "14512131313":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "all",
                "some"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>all or some of ash's rivals</span></div></span></div>",
            "created":1524456960,
            "id":2483209,
            "title":"ash and his companions"
        },
        "145121313131":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "all",
                "some"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>rival of all or some companions</span></div></span></div>",
            "created":1524457080,
            "id":2483210,
            "title":"all"
        },
        "1451213131311":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "all",
                "some"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>all or some rivals of all companions</span></div></span></div>",
            "created":1524457140,
            "id":2483213,
            "title":"all"
        },
        "1451213133":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "profesors",
                "villans",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>these options sound cool</span></div></span></div>",
            "created":1524054540,
            "id":2481216,
            "title":"other"
        },
        "14512131333":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>other gym leaders too?</span></div></span></div>",
            "created":1524054720,
            "id":2481218,
            "title":"other"
        },
        "145121313332":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "both",
                "just one",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>nurse joy and officer jenny</span></div></span></div>",
            "created":1524054840,
            "id":2481220,
            "title":"other"
        },
        "1451213133322":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "nurse joy",
                "officer jenny"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1524064920,
            "id":2481252,
            "title":"just one"
        },
        "1451213133323":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "YES!!!!!!!!!!!!!!!!!",
                "to many"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>all of the above!?!</span></div></span></div>",
            "created":1524054900,
            "id":2481221,
            "title":"other"
        },
        "14512131333231":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes if possible",
                "no we have enough"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>anymore people</span></div></span></div>",
            "created":1524055080,
            "id":2481222,
            "title":"YES!!!!!!!!!!!!!!!!!"
        },
        "145121313332311":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "no",
                "yes pokemon inclueded"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>literally everyone</span></div></span></div>",
            "created":1555465440,
            "id":2645612,
            "title":"yes if possible"
        },
        "145122":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "she is a tyrant",
                "she is playful and mischievous",
                "she is kind, peaceful and harmless"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how does she treat him</span></div></span></div>",
            "created":1523682000,
            "id":2479502,
            "title":"Yes but just Ash"
        },
        "1451223":{
            "author_id":"kyle_monarch",
            "author_name":"King Author",
            "choices":[
                "yes",
                "no",
                "sometimes (she switches during the story)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>does she shrink herself to match his size and join him</span></div></span></div>",
            "created":1523682000,
            "id":2479503,
            "title":"she is kind, peaceful and harmless"
        },
        "15":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry Expansion",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Blueberry expansion for Sabrina?</span></div></span></div>",
            "created":1297573200,
            "id":1053120,
            "title":"Blueberry for sabrina"
        },
        "152":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "Yes (generic vore)",
                "Yes (unbirth)",
                "No, other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will she get the ability to vore people?</span></div></span></div>",
            "created":1304139600,
            "id":1097776,
            "title":"Got Vore?"
        },
        "1523":{
            "author_id":"gamedemonking",
            "author_name":"GameDemonKing",
            "choices":[
                "yes (turn boys into girls and make them her slaves)",
                "yes (something else with hypno powers)",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Sabrina uses her hypno powers to change people?</span></div></span></div>",
            "created":1304139600,
            "id":1097800,
            "title":"hypno power"
        },
        "15231":{
            "author_id":"tobi02",
            "author_name":"no one",
            "choices":[
                "Ash",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does she change?</span></div></span></div>",
            "created":1349154000,
            "id":1438786,
            "title":"yes (turn boys into girls and make them her sla..."
        },
        "15232":{
            "choices":[
                "Ash",
                "Misty"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sabrina thinks time for a little pay back on all the people that have made fun of her.<br>\r\n<br>\r\nShe thinks about about who should go first.<br>\r\n<br>\r\nSabrina chooses...</span></div></span></div>",
            "created":1318654800,
            "id":1207177,
            "title":"yes (something else with hypno powers)"
        },
        "152322":{
            "author_id":"jstein",
            "author_name":"JStein",
            "choices":[
                "Being her maid slave",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does she hypnotize Misty into doing?</span></div></span></div>",
            "created":1321851600,
            "id":1226766,
            "title":"Misty"
        },
        "1523222":{
            "author_id":"jstein",
            "author_name":"JStein",
            "choices":[
                "Yes",
                "No, something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about making her think she's a Pokemon?</span></div></span></div>",
            "created":1321851600,
            "id":1226769,
            "title":"Something else"
        },
        "15232222":{
            "author_id":"jstein",
            "author_name":"JStein",
            "choices":[
                "Yes!",
                "No, something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about making her strip in public?</span></div></span></div>",
            "created":1321851600,
            "id":1226770,
            "title":"No, something else"
        },
        "152322222":{
            "author_id":"sonofosiris",
            "author_name":"CommanderX",
            "choices":[
                "Sure",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about making Misty act like somebody else?</span></div></span></div>",
            "created":1349154000,
            "id":1438966,
            "title":"No, something else"
        },
        "1523222222":{
            "author_id":"myst123",
            "author_name":"reaper",
            "choices":[
                "YES!",
                "nope move on."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about misty becoming her sex slave?</span></div></span></div>",
            "created":1374123600,
            "id":1630431,
            "title":"Something else"
        },
        "15232222222":{
            "author_id":"sup67",
            "author_name":"sup67",
            "choices":[
                "Yes",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Misty becoming her foot slave?</span></div></span></div>",
            "created":1423630800,
            "id":1931761,
            "title":"foot slave"
        },
        "152322222222":{
            "author_id":"writer794",
            "author_name":"super",
            "choices":[
                "Yes!",
                "Other choice?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Make Misty force feed her?</span></div></span></div>",
            "created":1445835600,
            "id":2053089,
            "title":"Something else"
        },
        "1523222222222":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "diaper slave",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about if Misty is hypnotized into being Sabrina's diaper slave?</span></div></span></div>",
            "created":1522386000,
            "id":2472465,
            "title":"Other choice?"
        },
        "15233":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Sabrina suddenly become a fan of socks?</span></div></span></div>",
            "created":1349154000,
            "id":1439354,
            "title":"something else"
        },
        "152331":{
            "choices":[
                "She goes to get more colorful socks?",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina's day had begun like any other.  She'd woken up, bathed, clothed herself in her pink top with white slacks, socks, and light pink shoes, enjoyed a nice breakfast, accepted and defeated a few trainers.  All in all it had been a pretty busy morning and now it was time to rest her weary mind and meditate.  She sat down and began to breathe like she had done many times before.  In and out, in and out, simple deep breathes.  Within moments, Sabrina was calm and her mind clearing as she began to prepare her mental powers and practiced inside her head.  However, Sabrina did not get too far into her exercises when suddenly she felt a presence.  It seemed unfamiliar to her, but why was it her.  However in that moment of pause, she felt the presence reach out to her thoughts.  Trying to bring her mental defenses to bear, Sabrina tried to protect herself, but the being was too fast.  It quickly reached into her head, touched something like a child playing with a light switch then disappeared.  <br>\r\n<br>\r\nWaking from her meditation, Sabrina glanced around angrily with her powers coming to bear against her assailant.  Yet, as Sabrina scanned her gym, there was no one, not a soul was in the room.  Quickly she checked around the gym to see if there was anyone hidden, but there was no one not even the usual grunts that hung around as it was a Saturday and they had the day off.  However, as Sabrina tried to focus on where her attacker may be, she sound her mind flowing elsewhere.  Eventually her attention turned to her feet of all things and how they were itching inside her shoes.  <br>\r\n<br>\r\nSabrina shook her head, she had to focus on finding... what was she looking for again.  This really troubled Sabrina.  The more she tried to focus on what or where her attacker had gone, the more and more her mind came up blank on whether or not there was even an attacker.  Focusing once more she tried again.  There was someone in the gym... wasn't there.  Well of course there was someone in the gym earlier, there were trainers trying to get there Pokemon League badges.  No, no, no, there was something... something... itchy, annoying.  Someone was here and they did something.<br>\r\n<br>\r\nThroughout all of this, Sabrina had been rubbing her feet together, the material becoming harder and harder to stand.  Suddenly it struck her, yes someone was in here earlier and she knew exactly what they had done.  Sitting done on the floor, Sabrina looked at the strange pink objects that were covering her feet.  They were tight, itchy, annoying, and nearly prevented her from seeing her socks.  With two righteous hands, Sabrina grasped the shoe and tore it off her left foot.  Tossing the shoe aside as hard as she could, Sabrina turned her attention back to her socked foot and how great it felt to be free of that darn contraption.  Grasping her socked foot in both hands, Sabrina practically began to pet her foot feeling how the material dressed her foot elegantly drinking in the smell as if it were wafting from a fragrant flower.  However, Sabrina's job was only half done and soon, Sabrina's other shoe was discarded alongside its other, her feet forever free from the tyranny of such cramped devices.  Rubbing and petting her socked feet, Sabrina fell into supreme bliss, unaware exactly what had changed her.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1349240400,
            "id":1439394,
            "title":"Yes"
        },
        "1523312":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps Misty or another gym leader stops by and Sabrina alters their mind as well?</span></div></span></div>",
            "created":1499490000,
            "id":2349693,
            "title":"Something else?"
        },
        "15233121":{
            "choices":[
                "Misty",
                "Someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is the lucky gym leader?</span></div></span></div>",
            "created":1499490000,
            "id":2349695,
            "title":"Yes"
        },
        "152332":{
            "author_id":"hiddenem0tions",
            "author_name":"HiddenEm0tions",
            "choices":[
                "Yes put a diaper on her. Lets embarrass her a looot!",
                "Noo that harsh."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So being a fan of sock is out of the market. Should we go with a more embarrassing choice. If you think not the too bad. Should we but a diaper on her or should we keep on thinking of new things</span></div></span></div>",
            "created":1367470800,
            "id":1582988,
            "title":"Well then.... What now?"
        },
        "1523322":{
            "author_id":"bubbaz85",
            "author_name":"BubbaZ85",
            "choices":[
                "Sure!",
                "Next!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Haven't seen it on the list so far...</span></div></span></div>",
            "created":1381122000,
            "id":1675821,
            "title":"Muscle Growth?"
        },
        "15233222":{
            "choices":[
                "Yes, return to the mortal plane!",
                "Nah, something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about she loses her powers?</span></div></span></div>",
            "created":1397797200,
            "id":1781600,
            "title":"Ordinary Day?"
        },
        "152332222":{
            "author_id":"karouuchiha",
            "author_name":"Karou",
            "choices":[
                "Nude in public",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She gets naked</span></div></span></div>",
            "created":1400648400,
            "id":1800067,
            "title":"Nah, something else"
        },
        "1523322222":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she become Pregnant?</span></div></span></div>",
            "created":1441602000,
            "id":2031314,
            "title":"Pregnant?"
        },
        "15233222221":{
            "choices":[
                "Normal",
                "Psychic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she get pregnant the normal way or with her powers.</span></div></span></div>",
            "created":1441602000,
            "id":2031319,
            "title":"Normal way or Psychic powers?"
        },
        "152332222212":{
            "choices":[
                "9 months pregnant with one child",
                "1 week pregnant with 9 children"
            ],
            "content":"<div class=\"\"><div> <span>One day Sabrina was laying on her couch reading a book she found in the library called Secret powers of a Psychic. When she turned to the next page she found a spell that made you pregnant. Sabrina didn't believe this could happen. So she read the spell in her head. Then she got </span></div></div>",
            "created":1441602000,
            "id":2031325,
            "title":"Psychic"
        },
        "1523322222122":{
            "choices":[
                "2 weeks later",
                "8 months later"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina started to feel a tingle all over her body. She then ran over to the bathroom and got out a pregnancy test and used it. It cam back negative. So at least she was not 3 weeks pregnant. She then heard her stomach rumble. She then went and got some food.</span></div></div>",
            "created":1441688400,
            "id":2031684,
            "title":"1 week pregnant with 9 children"
        },
        "15233222221222":{
            "choices":[
                "She gets pregnant (for real)",
                "She gains weight"
            ],
            "content":"<div class=\"\"><div> <span>Sabrina's once thin 110 pound (50kg) body had turned into a big 425 pound (172kg) body. Long ago her clothes had stopped going over her belly and just a while ago all her clothes didn't fit. Those days she just sat on the couch eating and ordering food. <br>\r\n<br>\r\nLater <br>\r\n<br>\r\nIt turned out that all of her babies were actually just illusions. Sabrina after not giving birth quickly burnt off all of the fat and ran the gym again. One thing stuck with her, a small bit of fat which would cause lots of trouble in the future.</span></div></div>",
            "created":1441688400,
            "id":2031687,
            "title":"8 months later"
        },
        "15233222222":{
            "choices":[
                "Ok :3",
                "Nope >:("
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about mix first is weight gain and pregnancy</span></div></span></div>",
            "created":1503810000,
            "id":2375487,
            "title":"No"
        }
    },
    "info":{
        "author_id":"gawayne",
        "author_name":"DJ Jaxx",
        "brief_description":"I Don't own Pokemon. An interactive about Sabrina the Gym Leader, check it out if you want",
        "created":1296962760,
        "description":"<td align=\"left\" class=\"norm\">Disclaimer: I do not own Pokemon.<br>\r\n<br>\r\nHere's an interactive similar to Misty interactive. You have a lot of freed om, but here are the rules.<br>\r\n<br>\r\nDo not change the story path.<br>\r\n<br>\r\nNo being stupid and ending the story path because you don't like it<br>\r\n<br>\r\nNo bashing characters aside from the rival trainers, or the bad guys.<br>\r\n<br>\r\nAnd...well...I'll write more rules later if necessary.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":1748819,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1555465440,
        "modified":1555465440,
        "pretty_title":"Pokemon: Sabrina Interactive"
    }
}