{
    "chapters":{
        "1":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "story 1",
                "story 2",
                "story 3",
                "story 4",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>today is a special day because you had just received your brand new game, with all the equipment, unpack and read the instructions install the cube near the place where you will be lying down, the cube does not need power because it is to install a whole new system which will allow it to create its energy, once install connect the helmet to the cube, arriving at this stage says hello the cube, which will allow the lit for that first time, once on it will never stop, and voila your cube is functional, it is connected to the central unit by satellite with a system impossible to cut and impossible to scramble, you have more case you lie down and put on the helmet and follow the steps. Good game to you\"<br>\r\nyou look next to the instructions he had a black cube and a motorcycle helmet, he had no wire.<br>\r\n<br>\r\nyou lift it is you were impressed it was as light as a feather you think you just got ripped off then you install it next to your bed, you take the helmet that looks like a motorcycle helmet, you put it on the above the cube and you say \"hello, the cube\" and suddenly a logo appears on the front of the cube and the glass of the helmet lights up like a vr helmet, you take the helmet and look inside it had everywhere inside the sensor you lie down and you but the cable suddenly you fall asleep when you wake up you were in the animated shape of yourself, in a room all white then a crush came from ul hand would appear in front of you and a voice says \"Hello John Doe, before we can start, we have to define the game\" then on the screen appears what type of game did you want with three options below \"1 part scenario. 2 part semi-ia. 3 part ia total. \" below he writes you just have to say aloud see your choice</span></div></div>",
            "created":1590901200,
            "id":2843869,
            "title":"beginning"
        },
        "11":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "on an island",
                "in a bedroom",
                "in a cellar",
                "at the villain",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>tells you \"I chose semi-ia\" the answer is very good, so that I create the best part, I will need some information, tell me what you wanted \"the screen before you become blank again then you say \"I have a fantasy that I always wanted\" and you see that everything you say is written on the screen you continue \"I have superman, I always love his tight uniform, these muscles, these powers, I always imagine that he plays with me example making me touch his outfit and these muscles but also that he uses these powers on me without fear that he will marivate something as an example he uses all his super-strength on me and crushes me, of course I will be immortal, moreover I am passive I would like him to fuck me but not like when he fucks this woman because he is going slowly I would like him to be rough and violent \"then i replied \"i understood this is what i propose, humanity was destroyed there is more than you superman is another villain, superman considers you a swiss army knives because he can use you to train, he can play with you, he can make love with you but without caring about you (as if he makes love to another of his kind) and like a stooge like that he can ask you to massage it, etc. \"you say\" cool \"then I added\" now let's go to the configuration already for death I indicated immortal, I just want to say you suffer and could be crushed but you will stay alive, for the choice of orientation \"you do not let aprler and you say\" me passive and active superman very dominant brutal \"said\" ok I record, wanted to be alone or activated the multiplayer option \"you say all at once\" alone I want nobody to know what's going on \"i said\" very good, last thing, i need two secret words one to eject from the game and the other to pause for a modification \"you reflect on sentences that you are not going to say like that and you say\" for the word which éjéct will be 'stopbonus 'and for the break will be' pausorus' \"I answer\" I see that you have just invested these words very well, all seem to me ok good game to you \"then all this transforms and you found</span></div></div>",
            "created":1590901200,
            "id":2843878,
            "title":"story 1"
        },
        "12":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "you fall from the sky right on venom (venom become evil)",
                "you appear in a bedroom",
                "you appear in the gif scene, behind venom (before it fart)",
                "you fall from the sky on venom but venom is giant",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>tells you \"semi-ia\" then the screen goes blank again and said \"To continue thank you for giving some detail\" you said \"voila, he has a gif that I like, that or venom fart\" the poster on the screen the gif <a rel=\"nofollow\" href=\"https://www.furaffinity.net/view/34821703/\" target=\"_blank\">https://www.furaffinity.net/view/3482170...</a> you say to him \"yes it is him, I would like to be obliged to feel these fart you can do it in different way, exeple he can grab my head and put it in his ass, he can also tie me up and fart in the face, you can also give him the power to become giant or shrink me, you can also force me to eat these fart not that feel, little information venom little control these fart and he can fart unlimited, which makes that you make him have fun with these fart and he wants to make me suffer, I have a question what is the difference between his normal fart and are it fart if it's giant? \" I answer you \"well it is different I give you an example a drop of water if you make it grow it becomes a river, well for venom if it is giant for him these the same fart but for you the smell and multiply by the size of venom and the power also so if venom grew 10 * its size well the fart feels 10 * and the power and 10 * also which means that a fart can become a hurricane \"<br>\r\n\"thank you so I wish to be immortal, I know I will suffer the same but I could not die, and I want to be alone that he has that he is me, I know that it takes two secret words but is it possible not to give like that i would never go out except in an emergency \"the answer\" yes, if you really wanted to stay and be unable to modify and go out except emergency, can ignore the secret words, but I want to warn you that you could no longer escape from what I expect and saw that you wanted an unlimited flexible game \"cut him off and said\" yes ignore the words \"I replied\" choice accept, you will be send in your world\"</span></div></div>",
            "created":1590987600,
            "id":2844263,
            "title":"story 2 venom"
        },
        "15":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "story 5",
                "story 6",
                "story 7",
                "story 8",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>this chapter just lets add other story</span></div></span></div>",
            "created":1590901200,
            "id":2843870,
            "title":"other"
        }
    },
    "info":{
        "author_id":"demon57740",
        "author_name":"demon",
        "brief_description":"a video game that realized your fetish",
        "created":1589187060,
        "description":"<td align=\"left\" class=\"norm\">a game all just released for adult, the game allows you to realize all your fantasies whatever there is even those imaginary and impossible, because the game downloads your consciousness in the game (you are like in real life my animated version) in the game is like real (real touch etc) (like the movie the hollow) you had a secret phrase to get out of the game is to return to the real world, the game is to connect an ace server which is a smart computer (ia ) but each player is in his world.<br>\r\n<br>\r\nbefore you can join the game you have to give information to the AI ​​so that it creates the best part:<br>\r\nchoice of the game, the ai leaves you 3 choices<br>\r\n<br>\r\nscenario creation: you create all the scenarios in the smallest detail so the ai will just be used to create what you told him.<br>\r\n<br>\r\nsemi-ia creation: give you some informaion to the ia (for example the fetish, with whom, etc) but these ia which create the part and the scenario.<br>\r\n<br>\r\nia creation: you just gave the fetish, and all on you and these ia which create all the rest even with whom you are going to have fun.<br>\r\n<br>\r\nthe IA and on the internet so it has access to all the information and can do research so if you wanted to do things but you had black points (example the size of a person's penis) IA can easily find the answer)<br>\r\n<br>\r\nonce finished creating the part you had to configure:<br>\r\ndeath: you should choose if when you die in the game it ends my game or if you die in the game it makes you start again or if you die in the game you reappear at the place of your death to continue where you are dead or be immortal in the game (you could suffer but not die).<br>\r\nthe secret word: you had to indicate 2 secret words, first word which is used to eject you from the game and the second word to pause the game to make modifications.<br>\r\n<br>\r\noption choice of sex: you had to indicate if you are active or passive or active and passive, and the orientation of the other (you could also choose that the other is straight but that he will do it with you)<br>\r\n<br>\r\nthe multiplayer option: if it activates this configuration, the player will have a choice to give private or public multiplayer, the private choice means that he must send the invitation so that we can join this game and the public is open to all of course the creator of the game and the only one able to control the game and therefore he can ban players but also the only one able to modify information in the game.<br>\r\n<br>\r\nonce all this is done the player will suck in his game but the game does not have the same sense of time as the normal world, it has the same time as a dream, moreover you will not have to worry about your real body because the computer watches over your body during your absence and if it has a problem (need to eat, need to pee etc) the computer can start emergency ejection which my part in pause and resume when you return.<br>\r\n<br>\r\nhere are some rules for this story.<br>\r\n<br>\r\nas I want that in this story, you are in the place of the main player, it will be forbidden to give him a name for that have the call \"John Doe\";<br>\r\n<br>\r\nno women;<br>\r\n<br>\r\nno end because when the game is over, you can recreate a new game;<br>\r\n<br>\r\nall authorized fetishes (eg fetish feet, odor fetish, giant macro fetish, etc.);<br>\r\n<br>\r\nall authorized characters (real world characters, imaginary characters (superheroes, manga, anime, anthro, photo, etc.), 2 example of situation: you always wanted to make love with your neighbor but too shy for that that in the game you could make love with your neighbor but without your neighbor being aware. you had always wanted to make love with your favorite superhero (superhero hetero) so in the game you will love with you but since he is hetero he accepts because he wants to test or please you)<br>\r\n<br>\r\nsex is only allowed with people over 18;<br>\r\n<br>\r\nno reaction on your real body.</td>",
        "id":2221643,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1597735700/item_id/2221643.jpeg",
        "last_full_update":1597739280,
        "modified":1597739280,
        "pretty_title":"gay game fetish"
    }
}