{
    "chapters":{
        "1":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Symbiote is found by someone from the village. <br>\r\n<br>\r\nWho is it found by?</span></div></span></div>",
            "created":1393477200,
            "id":1752523,
            "title":"The Start"
        },
        "11":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "Naruto",
                "Sasuke",
                "Kakashi",
                "Rock Lee",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of the male nin finds the Symbiote.<br>\r\n<br>\r\nWhich One?</span></div></span></div>",
            "created":1393477200,
            "id":1752528,
            "title":"Male"
        },
        "111":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "Hyūga Hinata",
                "Haruno Sakura",
                "Someone or Something else"
            ],
            "content":"<div class=\"\"><div> <span>It was a quiet night in the Village of Konoha. The skies were clear and the weather was cool and crisp. It was a perfect night. Standing out on the balcony of his apartment, was Uzumaki Naruto admiring the night sky. He was currently deep in thought. He had just recently returned from a mission in where he had encountered Uchiha Sasuke. It didn't go so well, and by the end of the mission, Sasuke had escaped and Naruto felt that much further from returning his wayward best friend to the village. Suffice to say Naruto felt a little down. He was hoping that after his training trip with Jariya of the Sannin that he would be strong enough to bring Sasuke, but now that didn't even seem like enough. Shaking his head Naruto looked down at the streets to take his mind off the failed mission and observed a few couple walking together hand in hand. There were a few that were hugging, some kissing. It made Naruto really begin to feel a little lonely as he looked into his empty apartment. He sighed and went back to looking at the night sky. As he began to stare, he noticed what looked like a shooting star. From there proceeded to make a wish, speaking out loud, \"Hey star, I know this might be a lot to ask but the way I'm feeling right now I could really use it. I just wish I had the power to bring Sasuke back, I feel like I'm so close, but that I'm still not there yet. \" He then brought his attention back to the couples continuing, \"and maybe someone special too. Maybe Sakura, hell even Hinata,  she seems nice.\" He looked back up at the star and noticed that it seemed like it was getting closer. \"Wait a second, that's not a shooting star. It looks like a meteor!\" He exclaimed as he watched it fall somewhere near the outskirts of the forest that surrounded the village. Excited and with nothing else to really do Naruto decided to go check it out. He made his way through the forest to the area that meteor had landed. When he got there, after all the dust had settled, Naruto say a deep black rock. It was the deepest black he had ever seen. It reflected no light and was probably the size of an American style football. He began to near the rock to check the rock when he heard a rustling in the brush behind him, who came out was...</span></div></div>",
            "created":1412744400,
            "id":1868800,
            "title":"Naruto"
        },
        "1112":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "She came alone",
                "She came with someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Through the rustling of the bushes, emerged Naruto's teammate Haruno Sakura. She had come to investigate the meteor as well. Did Sakura come alone, or was there someone else with her?</span></div></span></div>",
            "created":1412744400,
            "id":1868801,
            "title":"Haruno Sakura"
        },
        "11121":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "The ooze bonds to Naruto",
                "The ooze bonds to Sakura",
                "The ooze divides and bonds with the both of them"
            ],
            "content":"<div class=\"\"><div> <span>Naruto heard a rustling from the bushes. He turned to see Sakura. \"Sakura!\" Exclaimed Naruto. He was surprised to see her. \"Did you see the meteor in the sky too?\" He asked. \"Yeah, I did. I wasn't sure if anyone else did and decided to come check it out. I wasn't expecting you here too,\" claimed Sakura. \"Well I saw it just up ahead, let's check it out,\" said Naruto as he lead Sakura to where he found it. They both stood over and observed it. Like before it was deep black that reflected no light, it was the size of an American style foot ball, and it looks like the rock had finally cooled. Placing his hand near the rock, Naruto felt the air around and could tell it was cool enough to touch. They both didn't realize, but they were staring at the rock. They were both so close. Curiosity getting the better of them they each placed a hand on the space rock, but what happened next surprised the both of them. It felt like a small pulse of energy was released. It felt almost like a heart beat, but it only lasted a second. They both put on their hand o. The rock again, only to feel nothing. \"What should we do with it?\" Asked Sakura. \"Let's bring it back to my apartment I the village, we can get a better look there,\" spoke Naruto. They took the rock and wrapped in in some spare cloth and carried it  back to Naruto's apartment.<br>\r\n<br>\r\nOnce they got there. They placed it on a table in Naruto's room. \"Did you feel that before, back at the crash site? It felt almost like a pulse,\" stated Naruto. \"I did. I wasn't sure if I was imaging it, or not.\" Replied Sakura. Wanting to confirm what they felt, the both of them began to put a hand on the meteor. It still felt a little warm, but still cooler then it was after it first crashed. They continued thinking that maybe it was in there hands, before they felt pulse. First once, then a second time. Then something happened. They recoiled their hands when they felt the rock split in two and a sharp psychic pain hit there heads. It felt like a splitting migraine. It was so intense. They had no idea where it was coming from, but when they looked back to the rock they saw something. A black inky substance was oozing out of the crack in the space rock. It looked like it had a semiliquid form, deep black in color, but it shined like a black rubbery latex.  The pain began to become too intense and they began to succumb to unconsciousness. In there last moments they saw the black ooze crawling towards their motionless bodies. Two white, jagged tear snapped eyes were the last thing they saw before, darkness.</span></div></div>",
            "created":1412830800,
            "id":1869244,
            "title":"She came alone"
        },
        "11122":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "Hyūga Hinata?",
                "Yamanaka Ino?",
                "Someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who came with Sakura to Investigate the meteor?</span></div></span></div>",
            "created":1412744400,
            "id":1868802,
            "title":"She came with someone else"
        },
        "1113":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "A human",
                "One of the Symbiotes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who or what confronted Naruto?</span></div></span></div>",
            "created":1595292480,
            "id":2872293,
            "title":"Someone or Something else"
        },
        "11132":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Venom",
                "Carnage",
                "Toxin",
                "Sleeper",
                "A different Symbiote"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Symbiote bonded to Naruto, then?</span></div></span></div>",
            "created":1595292600,
            "id":2872295,
            "title":"One of the Symbiotes"
        },
        "12":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "Sakura",
                "Hinata",
                "Ino",
                "Tenten",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of the Kunoichi from the village found the Symbiote.<br>\r\n<br>\r\nWhich one was it?</span></div></span></div>",
            "created":1393477200,
            "id":1752524,
            "title":"Female"
        },
        "121":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "Hinata saw the transformation and confronts Sakura the next day.",
                "Naruto saw the transformation and confronts Sakura the next day.",
                "Someone else saw the transformation."
            ],
            "content":"<div class=\"\"><div> <span>It was a dark day in Konoha. Sakura and her team had just recently gotten back from their second attempt at retrieving Sasuke, and all were a bit depressed at their lack of success. Sakura had just made her way home, and was laying on her bed recalling what had just recently happened. \"I can't believe how powerful Sasuke-kun became. It seems impossible at this point to bring him back,\" thought Sakura to herself. \"Well moping around here won't do me any good. I should keep training if I want to get anywhere close to bringing back Sasuke-kun,\" and with renewed determination she decided to to travel deep into the woods surrounding Konoha to train.<br>\r\n<br>\r\nAfter traveling a good distance Sakura made it to the clearing in the woods. She would often come to train by herself, due to its isolation she knew no could get hurt if they wandered in. \"Alright,\" said Sakura, \"time to get down to business.\" She slipped on her gloves and began to do some warm up exercises, and then started her usual routine. It was getting dark now and Sakura had just finished the last bit of her training for the day. \"Uh I'm spent, well at least I know I got a good work out.\" Sakura was lying against a tree when she heard a rustling in a bush near by. \"Come out,\" she yelled readying a kunai. She waited there waiting for her potential attacker. After waiting for what seemed like forever, she decided to sit back down passing it off as some random animal or something.<br>\r\n<br>\r\n\"Uh I think I'm getting paranoid,\" she thought. \"Wow I really worked up a sweat today. Well I know Naruto's no where around, and no one knows about this place so..\" Sakura said while beginning to remove her clothes, while heading towards the stream in the clearing. \"Ah now that’s better,\" said Sakura, while taking a dip in the stream. She began to rub her hand down her body, rubbing her sore arms and legs. She moved her hands towards her chest, brushing her hands passed her hardened nipples, caused by the cool stream. She let out a small moan and began to rub them some more, causing more moans. Her hand be began to move a little lower until it founds its way to her pussy, she began to caress it. Then two fingers entered as she slowly began to to thrust. She let out a few more moans, albeit louder this time. She kept going at this until she heard that rustling in the bushes again and instantly snapped out her trance. \"Uh why am I doing this out here, I better just get dressed and get going, its almost dark,\" and with that Sakura got out of the stream and began collecting her clothes and started walking towards the tree she was laying at before. She heard a rustling up above. She looked up to see a black goo drop from above her. \"Uh what is this stuff this stuff?!\" shrieked Sakura as it began to slither up her foot.<br>\r\n<br>\r\nIt made its way up her legs creating what felt like a second skin around what it covered. It began to create what seemed like a boot around each of her feet and it continued its way up her legs, bonding to every inch of skin it covered. \"Oh my god what’s happening, how do I get this stuff off?\" yelled a panicking Sakura. She tried to pull it off, only to feel pain, as if she was pulling at her own skin. It was then she realized this stuff, whatever it was not coming off, but what really scared her was that while this was all happening, see was actually starting to enjoy it. It felt good to her, like it was soothing everything it touched. It continued up to her hips, Sakura moaned when she felt the substance ooze over her pussy and her ass coating it in its mass. \"Uh I don't know what this stuff is, but I think I like it.\" she said as the goo made its way over her flat stomach, along with her back side. She didn't know why but the goo had something to it that just made so pleasurable. It then made its way to her breasts. She let out a loud pleasure filled moan as they were coated in its black substance. Sakura looked down at her chest and noticed two things; first she had what seemed to be a big white spider like design on her chest, and the second that her breasts had swelled from their size A, to that of a C. She was amazed by that only to be brought back to the feeling of the goo coating her arms. Moving its way down entwining around her fingers, forming what seemed like claws. She also noticed that she had white patches on the back of her hands. The transformation was almost complete. Sakura felt the goo moving up her neck and into her mouth, bonding with the inside, creating some razor sharp teeth. It continued its way over her face over her eyes creating to white tear drop shapes where eyes would've been. It then began to cover her hair mixing in with it, making it longer, almost to length it was be fore the chunnin exams, but then an odd thing happened and the black substance in her hair began to change to its original bubble gum-pink color, but it seemed to have a life of its own as it whipped around her head. After it completed the process of bonding with her hair, her transformation had been complete. She went towards the stream and looked at her reflection, what she saw surprised her.<br>\r\n<br>\r\nStanding there was a creature covered in a skin tight costume, which hugged every curve of her body. It had the large tear drop eyes and clawed hands. She then noticed that it had a mouth full of razor sharp teeth. \"Is that me?\" asked Sakura in a bit deeper voice. \"I look amazing, I never thought my body could like this.\" said Sakura happily. She then began to feel the power the suit brought. \"We feel amazing! So sexy, powerful, we can take on anyone! Wait did I just said we?\" said Sakura \"Yes we.\" responded a soft voice in the back of her head. \"Who said that?\" asked Sakura. \"I did\" responded the voice. \"Where are you?\" she asked. \"I'm on you\" responded the voice. \"This suit?\" she asked. \"Yes,\" it replied. \"What are you?\" asked Sakura. \"I'm what you humans call a symbiote, I am an organism that needs a host to survive, but in turn give the hosts amazing power,\" said the symbiote. \"We do feel powerful,\" replied Sakura. \"Then do you fully accept to bond with me?\" \"If it'll give me the power to protect my precious people and bring us back Sasuke-kun, then we fully accept.\" \"Good,\" said the symbiote, \"but what will we be called?\" \"Sasuke-kun may be with the snake, but let’s see how the snake will deal with She-Venom.\" \"She-Venom we like the sound of that,\" replied the symbiote. \"Yes we agree, but wait how am I going to go back to the village like this, they'll think I'm some kind of demon?\" Then the suit on Sakura shifted into that of her original clothing, except all black. \"Wow an unlimited wardrobe, a girl could definitely get used to this,\" and with this Haruno Sakura, now She-Venom made her way back to the village.<br>\r\n<br>\r\nUnbeknownst to Sakura someone had been passing by the clearing and happened to see Sakura's little transformation. They waited until the newly named She-Venom to leave, before muttering out, \"Sakura, what happened to you?\" before passing out from the shock.</span></div></div>",
            "created":1393477200,
            "id":1752533,
            "title":"Sakura"
        },
        "1212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Alright fine (Sakura goes with Naruto)",
                "No way (Sakura doesn’t go with Naruto)",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Naruto saw Sakura’s transformation last night decided to go see her at the training field.<br>\r\n<br>\r\n“Naruto?” Sakura said.<br>\r\n<br>\r\n“Sakura-chan, we need to talk.” Naruto said in a serious tone.<br>\r\n<br>\r\n“About what?” Sakura wondered.<br>\r\n<br>\r\n“I’m gonna put this bluntly. I saw what happened to you last night.” Naruto said.<br>\r\n<br>\r\n“Oh. You saw that.” Sakura said didn’t think anyone would saw her transformation. “Wait. You weren’t there peeping at me, weren’t you?!” Sakura said in an angry scary tone that made Naruto almost piss himself.<br>\r\n<br>\r\n“N-No! Of course not! You were clothed when I spotted you! I swear!” Naruto said trying not to feel Sakura’s wrath again.<br>\r\n<br>\r\n“Good.” Sakura said calming down.<br>\r\n<br>\r\n“Anyway, I was just wandering around the village last night until I heard your voice. I saw you looking like this gooey monster thing and I heard you talking to it like it was alive.” Naruto said.<br>\r\n<br>\r\n“It is and it’s great.” Sakura said smiling about her new abilities.<br>\r\n<br>\r\n“Look, when I saw you turning into... What did you call yourself again?” Naruto wondered.<br>\r\n<br>\r\n“She-Venom.” Sakura said.<br>\r\n<br>\r\n“Right. She-Venom, I had a bad feeling about you having it.” Naruto said.<br>\r\n<br>\r\n“What are you talking about, baka? It’s amazing. I’ve never been so strong in my life.” Sakura said proudly.<br>\r\n<br>\r\n“That’s the thing, Sakura-Chan. I’m not sure if this, what is it you called it?” Naruto wondered.<br>\r\n<br>\r\n“A symbiote.” Sakura said.<br>\r\n<br>\r\n“Right. Anyhow, I’m not sure you having this thing is a good idea.” Naruto said.<br>\r\n<br>\r\n“You don’t even know what it is.” Sakura argued.<br>\r\n<br>\r\n“More like WE don’t know what it is. I’m not sure if you can rely on this thing.” Naruto said.<br>\r\n<br>\r\n“That coming from the guy with the fox monster in his belly.” Sakura countered.<br>\r\n<br>\r\n“And that’s exactly my point. What if this thing makes you do something you don’t want to? What then?” Naruto wondered.<br>\r\n<br>\r\n“I guess you do make a good point.” Sakura said.<br>\r\n<br>\r\n“Come on. Let’s go see Tsunade-baachan and have it checked out.” Naruto said.<br>\r\n<br>\r\nWhat does Sakura say?</span></div></div>",
            "created":1595298000,
            "id":2872321,
            "title":"Naruto Confronts Sakura"
        },
        "125":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "Tsunade",
                "Shizune",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe it was some other Kunoichi?</span></div></span></div>",
            "created":1393477200,
            "id":1752525,
            "title":"More Choices"
        },
        "1253":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "Kurenai",
                "Anko",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe it was some other Kunoichi?</span></div></span></div>",
            "created":1393477200,
            "id":1752526,
            "title":"Someone else"
        },
        "12533":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "Kushina",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe it was some other Kunoichi?</span></div></span></div>",
            "created":1393477200,
            "id":1752527,
            "title":"Someone else"
        },
        "125331":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "Naruto, guided by an unknown force, finds the cocoon and it awakens her.",
                "Sakura stumbles upon the cocoon. Kushina remembers her from her link to Naruto. ",
                "Hinata stumbles upon the cocoon. Kushina remembers her from her link to Naruto."
            ],
            "content":"<div class=\"\"><div> <span>The Kyuubi had just been sealed by the Fourth Hokage, Minato Namikaze, into his young son of Naruto Uzumaki. Both Minato and his wife Kushina Uzumaki lay on the ground bleeding with hole in their stomachs left over from stopping the claw of the unleashed Kyuubi. (Basically the same as the canon story). Both laid there seemingly lifeless. Unbeknownst by anyone there, during the fight with the Kyuubi, an ancient site that kept a certain life form sealed was released. The seal cracked and a black goo, tar like substance began to leak from a fissure in the ground.<br>\r\n<br>\r\nDarkness, that's all the life form was able to remember for the longest time. Its previous life barely reminiscent, only that it had been long since that it had a host to which it needed to survive. Weeks, Months, Years, the life form laid dormant, sleeping, trying to cling to life hoping that one day that it might once again find host before its life would be snubbed out. The life form, felt a rumble, and a crash. Then without warning the buried container that held said life cracked open. The life form there felt something it hadn't in the longest time, fresh air. The container's seal that held it captive had broken and the life form took its first chance at escape. It was hard, but the black goo like life form had finally made it to surface. It had no idea where it was, or what was going on, but it had only one idea in mind. It needed a host soon, and fast, otherwise its new freedom would be for naught. The life form, barely clinging to life, slowly made its way to where it was able to sense the closest life forms. <br>\r\n<br>\r\nAs both Minato and Kushina lay there, Minato had already passed with the Shinigami already taking his soul, Kushina laid on the ground mere feet away from her son. She was barely clinging to life due to her Uzumaki blood. She watched motionless as a black ooze slowly made its way towards her and her son. She knew not of what the ooze was, or how it would change her life.<br>\r\n<br>\r\nThe life form luckily, found two potential host nearby. As it finally made its way over to where it sensed life the life form found three bodies. One had just recently died, the other clinging barely to life, and the last one that was freshly born and radiating a latent power that both excited and frightened the life form. From there it knew it had to make a choice, either the woman who was on deaths door, or the newborn that had been giving off a strange power. Knowing its choices were slim the life form took its chances and went for the newborn Naruto. It made its way up the sealing alter and began its quest to bond with the child. Because of Naruto's small size the life form made short work of bonding to child, creating what looked like a black cocoon. The life from thought it was in the clear, it slowly started to siphon off this strange energy that these creatures gave off. What it didn't expect was that same energy began to be come too powerful. It gave off a malicious red energy that began caused the life form to screech in pain. It couldn't handle the corrosive properties of the red energy and knew it couldn't stay with this host. It still sensed the woman lying on the ground and made its choice to take her as its host. It slowly left and slivered off a crying Naruto and made its way over to Kushina.<br>\r\n<br>\r\nKushina laid, helpless, as she watched that black ooze make its way over to her son. She could only lay motionless as the ooze enveloped her newborn son was engulfed in a black tar like cocoon. She could only wonder what was happening, but she soon felt the same malicious chakra that she knew too well. It seemed the Kyuubi didn't want its container being harmed and forced the life form from from her son. She heard the ooze make a pained screeching noise and begin to slither off her son. She watched the ooze begin to make its way towards her. She knew there wasn't anything she could do. She just waited to accept her fate.<br>\r\n<br>\r\nThe life form finally made it to the red haired female with the hole in its stomach. It knew it didn't have much to work with, but with the small amount energy it received from the child it knew it would be enough to survive. The life form slowly started with her feet. It began to dissolve away her ninja sandals and make contact with her skin. The ooze began to work its way up her legs and started to dissolve away her dress. As it worked way up to her waist, it left her legs in a skin tight, rubbery, latex like material. It fit to her like a second skin and left her feet with claw like talons. The ooze made it up her thighs and began to coat them making its way to her ass and pussy. The life form only wanting to be accepted by its new host, slowly probed both holes of the female, causing a moan of pleasure from Kushina. The ooze made its way up her stomach and back, coming to the hole left by the Kyuubi. It knew that it wouldn't be able to heal right away and began to replace what it could with its substance. With the hole patched up, the pain it caused Kushina slowly began to fade away and allowed for the life form to work its way over her breasts and upper back. Kushina let out another soft moan  from the pleasure the ooze gave through the bond. The creature made its way to her neck and began to work its way down her arms. It soon entwined around her fingers and left her fingers with sharp claw like fingers and white patches forming on the top her hands, as well as white spider symbol appearing on her chest and back. Now with almost all of Kushina's body cover sans her head, the ooze made its way up her face. <br>\r\n<br>\r\nKushina laid there as she felt he body being coated by the ooze. It was odd feeling. It had a warm wet, silky feel to it. She felt it makes its way to her lower regions and blushed as she let out a soft moan as the ooze began to probe both her holes. Kushina knew she should be worried, she knew she should try to fight it, but with sensations it was making her feel and coupled with her weakened state could only accept it and at least enjoy the bits of pleasure it gave her. She felt the pain in her stomach fade away as the creature began to replace the damage with its substance. She then felt it coat her breasts and let out another soft moan. She didn't know what this ooze like creature, but she was almost starting to like it. She soon felt crawling up her neck and also coat her arms and hands. She felt it creeping up to her face and just as she saw a white spider symbol appear on her chest she blacked out. <br>\r\n<br>\r\nWhen Kushina awoke, she found herself in the familiar place inside her mind. She was quite used to visiting here due to being the previous container of the Kyuubi. It was there she noticed she was naked and in front of a black like figure with white eyes and a familiar white spider symbol. \"What are you and what have you done to me?\" asked Kushina not even knowing if this thing could communicate with her. Then in her mind Kushina hears, \"I'm an alien creature called a symbiote. I need a host in order to survive I realized I had to bond with you. It was the only way to save us both.\" \"Well do you have a name?\" asked Kushina. She heard the symbiote respond, \"From the few memories I still have, the name Venom comes to mind.\" \"Well Venom,\" Started Kushina, \"While I'm still pissed off you tried to use my son as a host, I guess I have no choice. What happens now?\" \"Should you accept the full bond, I should be able to save us both. There is only one small problem,\" stated Venom. \"And that would be,\" responded Kushina. \"Well with the both of us in such a weekend state, after we completed the bond, we would need to go into a hibernated state to recover until we have enough energy to survive,\" responded Venom. \"Well it seems like I don't have much of a choice, but what of my child? I can't leave him alone,\" said Kushina. \"Well I don't know how long it will it'll take, but there are remnants of myself left with your child from my unsuccessful bond, so there will be a link between the both of you.\" \"Well, its not the ideal situation, but I guess I'm fine. Lets complete the bond!\" exclaimed Kushina. \"You got it!\" came from Venom.<br>\r\n<br>\r\nOn the outside the symbiote Venom, finishes coating Kushina's face and begins to entwine with her red hair. The symbiote begins to pour down her mouth and throat coating her mouth and filling it with razor sharp teeth and a long tong. The symbiote infused hair shifts to a bunch of moving red tendrils and a pair of white tear drop patches form for eyes. With that the bond was complete and what was left in her place was a symbiote infused Kushina. She looks at her new body with amaze. \"Wow we look amazing!\" She exclaimed! \"But I believe we need a new name, She-Venom sounds about right!\" The newly named She-Venom's suit tightened in agreement. It was then Kushina felt a shooting pain and realized both her and Venom were at their limit. She had to rest and quick or she was going to be in trouble. She ran over to Naruto and had her mask recede when gave him a quick kiss on his forehead. She then bent over and told him, \"I might not be able to be there for you now Naruto-kun, but know I'll always be watching over you. Just wait and when the time comes I'll come find you,\" stated Kushina, before her mask reformed. With her last bit of energy, the new She-Venom bolted away from the area and found an abounded cave on the outskirts of Konoha. She then used the last bit of energy she had left to place a seal on the entrance. She then used the last bit to create a cocoon out of the symbiote for them to slumber. She new it would be a while before she awoke, but at least when she would be able to see her Naruto again. It was with that that Kushina closed her eyes and slumbered waiting for the time when she would awaken and find her son.<br>\r\n<br>\r\n<b>15 Years Later (During Shippuden)</b><br>\r\n<br>\r\nThe seal to Kushina's cave was broken, and a figured walks in and discovers the cocoon. \"What is this,\" they exclaim?!</span></div></div>",
            "created":1402549200,
            "id":1811240,
            "title":"Symbiote Queen Kushina"
        },
        "125332":{
            "author_id":"hpg70",
            "author_name":"hpg70",
            "choices":[
                "Naruko",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else could it be?</span></div></span></div>",
            "created":1412744400,
            "id":1868948,
            "title":"Someone Else"
        },
        "1253322":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Tayuya",
                "Somebody else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Tayuya?</span></div></span></div>",
            "created":1511154000,
            "id":2417841,
            "title":"Someone else"
        },
        "12533221":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Before the Sasuke Retrieval Arc",
                "After Temari dropped the forest on her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When does she get a symbiote?</span></div></span></div>",
            "created":1517246220,
            "id":2446437,
            "title":"Tayuya"
        },
        "125332211":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Venom",
                "Another Symbiote"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, now is she going to find Venom, orwill she get a different symbiote?</span></div></span></div>",
            "created":1517246880,
            "id":2446446,
            "title":"Before the Sasuke Retrieval Arc"
        },
        "1253322112":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Carnage",
                "Another symbiote"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Carnage?</span></div></span></div>",
            "created":1517258160,
            "id":2446499,
            "title":"Another Symbiote"
        },
        "12533221122":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Yes",
                "no, another one"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Toxin?</span></div></span></div>",
            "created":1517258220,
            "id":2446502,
            "title":"Another symbiote"
        },
        "125332212":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Venom",
                "Another symbiote."
            ],
            "content":"<div class=\"\"><div> <span>It had been a few minutes since she had been left for dead, but Tayuya was still alive, although without some help, she wouldn’t last long. She still wasn’t conscious yet, so she wasn’t able to notice the creature that was flowing towards her. <br>\r\n<br>\r\nTayuya’s eyes shot open, “The fuck is this?!” she demanded, feeling that most of her body had been covered with something. Her question wasn’t answered out loud, but as she lifted the trunk that had been crushing her with her newfound strength, she got an answer. It was a symbiote called…</span></div></div>",
            "created":1517352540,
            "id":2447001,
            "title":"After Temari dropped the forest on her"
        },
        "1253322122":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Carnage",
                "Nope, different symbiote"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe it was Carnage?</span></div></span></div>",
            "created":1517370360,
            "id":2447198,
            "title":"Another symbiote."
        },
        "12533221222":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Toxin",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Toxin then?</span></div></span></div>",
            "created":1517370420,
            "id":2447199,
            "title":"Nope, different symbiote"
        },
        "125332212222":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Sleeper",
                "Riot",
                "Scream",
                "Lasher",
                "Other Symbiotes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Symbiote finds and bonds with Tayuya then, then?</span></div></span></div>",
            "created":1595291640,
            "id":2872289,
            "title":"Other Symbiote choices"
        },
        "12533222":{
            "author_id":"haku91",
            "author_name":"Haku112",
            "choices":[
                "Yes! Bee Girl",
                "No Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Suzumebachi?</span></div></span></div>",
            "created":1511224800,
            "id":2417872,
            "title":"Somebody else"
        },
        "125332222":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Yeah, Kurotsuchi with a symbiote",
                "Another character",
                "Another character",
                "Another character",
                "Another character"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the granddaughter of the Tsuchikage who joins with a symbiote?</span></div></span></div>",
            "created":1595840760,
            "id":2876028,
            "title":"Kurotsuchi?"
        },
        "1253322221":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Venom",
                "Carnage",
                "Toxin",
                "Sleeper",
                "Another symbiote"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So which symbiote does she bond with?</span></div></span></div>",
            "created":1595868000,
            "id":2876285,
            "title":"Yeah, Kurotsuchi with a symbiote"
        },
        "12533222215":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                " Agony",
                " Lasher",
                "Phage",
                "Riot",
                "Another symbiote"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which symbiote then?</span></div></span></div>",
            "created":1595868600,
            "id":2876290,
            "title":"Another symbiote"
        }
    },
    "info":{
        "author_id":"mizushinobi",
        "author_name":"hydroshinobi",
        "brief_description":"A Naruto/Symbiote story, in where the alien symbiotes of marvel meets the world of Naruto.",
        "created":1393547760,
        "description":"<td align=\"left\" class=\"norm\">A story in where the Venom Symbiote, and/or possibly others, of the Marvel Universe has made its way into the world of Naruto. The time period is in the Shippuden series.<br>\r\n<br>\r\n- Who will the symbiote(s) find and bond with? <br>\r\n<br>\r\n- How will they use their power?<br>\r\n<br>\r\n- How will the presence of chakra affect the symbiote(s)? <br>\r\n<br>\r\nPlease feel free to add to story everyone!</td>",
        "id":1979332,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595868600,
        "modified":1595868600,
        "pretty_title":"Naruto/Symbiote Story"
    }
}