{
    "chapters":{
        "1":{
            "author_id":"ghidorax",
            "author_name":"Shademaster",
            "choices":[
                "Ed",
                "Al (has to be in flesh body)",
                "Winry",
                "Riza",
                "Mustang"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now who are you going to plump up?</span></div></span></div>",
            "created":1189227600,
            "id":443065,
            "title":"Who?"
        },
        "11":{
            "author_id":"ghidorax",
            "author_name":"Shademaster",
            "choices":[
                "Before the transmutation of his mother",
                "After the transmutation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old is our favorite pint-sized alchemist?</span></div></span></div>",
            "created":1189227600,
            "id":443067,
            "title":"Age choice"
        },
        "112":{
            "author_id":"ghidorax",
            "author_name":"Shademaster",
            "choices":[
                "Before the state alchemist  exam",
                "After the exam"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What time period will he gain in?</span></div></span></div>",
            "created":1189227600,
            "id":443068,
            "title":"What time?"
        },
        "1122":{
            "author_id":"ghidorax",
            "author_name":"Shademaster",
            "choices":[
                "It was time for dinner",
                "He was hungry, and decided to get himself something",
                "He decides to check on the progress of his automail"
            ],
            "content":"<div class=\"\"><div> <span>Ed sighed, smiling contentedly as he sat back on the Rockbell's couch, clad in his usual, casual clothes; his sleeveless black shirt and his boxers. <br>\r\n<br>\r\nIn the course of his and Al's quest for the Philosopher's Stone, they had gotten themselves into a particularly sticky situation involving some alchemists on the run from the law. Long story short, Ed had accidentally gotten careless, and his automail arm had been all but completely destroyed (again.) Following a very tense telephone conversation with Winry, which involved her threatening bodily harm on Ed for wrecking her automail, Ed and Al had headed for Resembool for a repair job.<br>\r\n<br>\r\nThe damage, however, was more extensive than it had seemed. Barring all the messy details (and Ed's shocked outburst,) it was eventually decided that it would take around four or five weeks to fix. This meant that Ed was stuck, lounging around and impatiently waiting for Winry and Pinako to finish their work.<br>\r\n<br>\r\nHowever, as the first two weeks dragged on, Ed found himself enjoying the peace. No rushing around for clues, no immediate concerns, no insulting comments from Colonel Mustang... it was actually quite nice. Not to mention he got to enjoy Pinako's cooking...<br>\r\n<br>\r\nMulling over all of this, Ed placed his flesh arm behind his head, only to move it a few seconds later to rest it on his stomach. The relative inactivity and feelings of contentment had increased his appetite somewhat, and he'd found himself having seconds and even thirds of meals. Ed frowned, feeling his stomach through his shirt. Was he starting to put on a little weight?<br>\r\n<br>\r\nEd shrugged it off; he figured he could work it off once his limbs were fixed. For now, he was just going to take it easy.<br>\r\n<br>\r\nAs if on cue, Ed yawned. He could really go for a nap right now...<br>\r\n<br>\r\nClosing his eyes, Ed slowly laid down, falling asleep in a matter of minutes.<br>\r\n<br>\r\nA few minutes later, Ed's hand was inside his shirt, pushing it up and exposing his stomach. If Al were present (he was currently outside and helping to cut some firewood), he would silently chide Ed for sleeping in that position. Moreover, he would notice that Ed's stomach had gotten a bit fleshier, a bit softer, a bit bigger...<br>\r\n<br>\r\nHe might even get an uneasy feeling of things to come.<br>\r\n<br>\r\nWhen Ed woke up...<br>\r\n</span></div></div>",
            "created":1251608340,
            "id":752765,
            "title":"Peaceful Days"
        },
        "11222":{
            "author_id":"fatchoji",
            "author_name":"Fatchoji",
            "choices":[
                "Ed finishes it all off",
                "He gets full during his snack"
            ],
            "content":"<div class=\"\"><div> <span>...he heard the rumbling of his currently small belly.  \"I guess I slept longer than I thought, it must be time for a meal,\" he said to himself, however incorrectly.  Ed hurried off to the kitchen and looked about through the fridge for something to eat.  \"Man, it all looks so good,\" he exclaimed, grabbing a vast amount of food in his arms and carrying it to the table, laying it out.  \"I guess I could just eat until I'm not hungry... I mean, I deserve that much,\" Ed said, pridefully, before putting the cold food in the appropriate places for it to heat up, eating away at the food that was edible cold as he did so. <br>\r\n<br>\r\n \"I don't think I've ever been so hungry before...\" he trailed off, rubbing his growling stomach.  This was, of course, the first of many large meals to come for Ed, not that he knew that just yet.  As some of the food finished heating up he went at it...</span></div></div>",
            "created":1254344160,
            "id":768320,
            "title":"Ed's \"Snack\""
        },
        "112221":{
            "author_id":"fatchoji",
            "author_name":"Fatchoji",
            "choices":[
                "Al comments on Ed's growing body",
                "Ed finishes off most of the food"
            ],
            "content":"<div class=\"\"><div> <span>After close to an hour of eating, Ed finally finished off his meal and sat down heavily on the couch, sighing and patting his belly.  \"I'm so full,\" he whimpered, laying down, his belly sticking up further than usual into the air as he dosed off, without realizing that this would only help his food to become fat more quickly. <br>\r\n<br>\r\nAbout an hour later, Winry came in and woke Ed for dinner, which he was of course shocked by, thinking he'd already eaten, but not as shocked as he was that he felt hungry again.   As such, he maintained his composure and followed Winry into the kitchen for dinner, sitting down with her and Al, Ed taking a large amount to start, stuffing his face hungrily.<br>\r\n<br>\r\n</span></div></div>",
            "created":1254369840,
            "id":768481,
            "title":"Dinner time?!"
        },
        "1122212":{
            "author_id":"fatchoji",
            "author_name":"Fatchoji",
            "choices":[
                "She wasn't feeling good!",
                "You ate most of the food Brother..."
            ],
            "content":"<div class=\"\"><div> <span>Al and Winry stared at Ed, astounded by what he had just done.  Most of the food was gone, and Ed was sporting an even larger belly, not that he seemed to notice or care-- they weren't sure which one.  \"Brother... are you alright...,\" Al asked, stuttering a little.  \"Yeah, I'm fine!  Just full,\" Ed exclaimed, patting his larger belly.  Winry took what she wanted of the food and excused  her self, going to eat in her room.  \"What was her problem,\" Ed asked, Al panicking to answer.. </span></div></div>",
            "created":1254449040,
            "id":768875,
            "title":"Second dinner"
        },
        "11222122":{
            "author_id":"fatchoji",
            "author_name":"Fatchoji",
            "choices":[
                "He falls asleep while eating",
                "Al comes back and decides to help Ed get bigger"
            ],
            "content":"<div class=\"\"><div> <span>\"W...well Brother, you sort of... ate almost all of the food,\" Al said, at a loss for words.  Ed patted his belly arrogantly and said \"Well I was hungry, and there was food to be had!\"  Al just stared at Ed in confusion, curious as to why his brother was suddenly becoming such a glutton.  Ed smirked and asked Al, \"Hey, do you think there's any desert around?  I could go for a bit more...\"  At this, Al got up and excused himself politely, going outside to avoid the situation and think as Ed opened up the freezer for ice cream, rubbing at his belly.  \"Y'know,\" he started to himself, \"I guess I don't mind eating so much.  I haven't put on too much weight.\"<br>\r\n<br>\r\nEd was, of course, in denial.</span></div></div>",
            "created":1254464400,
            "id":768961,
            "title":"Denial"
        },
        "112221221":{
            "author_id":"fatchoji",
            "author_name":"Fatchoji",
            "choices":[
                "Ed wants to gain with people who will be supportive",
                "He stays to gain"
            ],
            "content":"<div class=\"\"><div> <span>When Al came back, Ed was passed out on the table with empty food all around him, his shirt fully up and around his newly formed moobs, which were shaking softly as he snored, his stuffed belly expanding and contracting as he slept and let his food digest slower, make each morsel add more to his already sizable belly.<br>\r\n<br>\r\n<br>\r\nAl slowly backed out, absolutely dumbfounded at his brother's behavior, but not wanting to interfere, less it be some sort of strange alchemist training.<br>\r\n<br>\r\nEd, however, was far off in a strange dreamland.  In his dream, he was in a world of food where everything was edible, and he was taking full advantage of it, his belly so large it was dragging on the floor with him as he walked and stuffed himself silly.<br>\r\n<br>\r\nEd awoke rubbing his belly, quite content with the idea, finally deciding to recognize his gain.  \"So maybe getting big and fat would be fun... really fun,\" he said, grinning as his stroked his belly.  \"You're gonna get a whole lot bigger, really soon, belly,\" he said, patting it and grunting as he got up and headed off to the freezer for more food...</span></div></div>",
            "created":1254794640,
            "id":770859,
            "title":"Desire"
        },
        "1122212211":{
            "author_id":"fatchoji",
            "author_name":"Fatchoji",
            "choices":[
                "Sure",
                "You're still my enemy!"
            ],
            "content":"<div class=\"\"><div> <span>That night, while everyone else was asleep, Ed was busy adding to his growing belly, which he estimated was out to a good 250 pounds by now.  <br>\r\n<br>\r\n\"I'm getting nothing done like this,\" he said, dismayed, \"I wish there was someone who could help me with all this, no one here seems to want to!\"<br>\r\n<br>\r\nAt that, he heard a familiar voice chime in.  \"Oh, I know plenty about eating, Edward,\" it said, causing Ed to spin around afraid, seeing a figure about his height but far wider, taking a moment to realize that it was the homunculus Gluttony, who he deemed his enemy.  Ed quickly snapped to action, transmuting his automail into a blade and charging at the creature, who was quick to put up his hands and shout \"No no, I'm not here to fight!\"  Ed was, of course, confused by this, and stopped his attack for a moment, still holding his weapon up, which seemed a bit smalled than it should compared to his larger body.  \"Then why are you here,\" he asked, looking around for any of the other Homunculi who might have come with him.  \"To help you get bigger.  It's about time someone else around here expressed any interest, they're all so boring and thin,\" he said, patting his belly and grabbing for an armful of food, quickly devouring it.<br>\r\n<br>\r\n\"So, what do you say, do you want me help,\" Gluttony asked...</span></div></div>",
            "created":1255302240,
            "id":773962,
            "title":"A surprise accomplice "
        },
        "112222":{
            "author_id":"fatchoji",
            "author_name":"Fatchoji",
            "choices":[
                "Al gets food for Ed during his binges",
                "Al fattens up Ed's food"
            ],
            "content":"<div class=\"\"><div> <span>Ed sat on the floor rubbing his stuffed belly.  \"That was a lot of food... I don't think I can handle more,\" he sighed, patting his belly, watching its stuffed mass jiggle softly.  Ed struggled to get up off the floor, using the wall as support and waddling over to the door, heading outside to lay in the sun.<br>\r\n<br>\r\nAfter a short waddle, he reached a sunny hill where he laid back and let his belly sit out, stroking it softly.  \"This thing's going to get a lot bigger, a lot faster,\" he said, grinning, noticing moobs growing in above his sizable  belly, sighing as he jiggled it.<br>\r\n<br>\r\nAs he sat, Al watched from a distance, confused.  What was going on with his brother, and why was he eating so much?  Al decided then and there that he must have some sort of reason, and so he decided he'd help him out as  best he could, being the good little brother he was.</span></div></div>",
            "created":1256789940,
            "id":783313,
            "title":"Stuffed Sunbathing"
        },
        "12":{
            "author_id":"ghidorax",
            "author_name":"Shademaster",
            "choices":[
                "Before the transmutation of his mother",
                "After the end of the anime series"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When is Al going to gain?</span></div></span></div>",
            "created":1189227600,
            "id":443069,
            "title":"When?"
        },
        "13":{
            "author_id":"gforce77",
            "author_name":"DragonofInsanity",
            "choices":[
                "Manga Skinny",
                "Manga Fat",
                "Anime Skinny",
                "Anime Fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want to have this set in the Manga or the Anime?.  Also, how thin should Winry start out as?</span></div></span></div>",
            "created":1229662800,
            "id":621988,
            "title":"Winry"
        },
        "134":{
            "choices":[
                "Apon futher inspection",
                "Mabey theirs something I should do before that"
            ],
            "content":"<div class=\"\"><div> <span>\"yyyaaahhhhnnn, morning\"<br>\r\n<br>\r\nWinry opend her eyes to the morning sunlight, today was just like anyother day. Clear skies with no chance of rain. Although it was summer so it was a tab bit warm but nothing that she couldn't handle. Todays agenda, run some erins, work on automail, same old same old.<br>\r\n<br>\r\n\"Well, better get started, the day isn't going to run itself\"<br>\r\n<br>\r\nWinry started to get up untill she felt something odd, she couldn't quite put her finger on it but something didn't seem, or in this case feel right. It was almost as if it was a bit more difficult to get up. It was bizzare to her, she knew that she was always in good shape but this slight strugle was making her a tab bit conserned. That's when she placed her hand on her stomach and noticed it touched sooner then she was hoping it would...<br>\r\n<br>\r\n\"WHAT THE HELL IS THIS?!\"<br>\r\n<br>\r\nShe had a fat belly. Winry staired in shock at the round mound of flesh that was now her mid-section. She poked it with her finger and was worried at how deep it sank. How could this happen? The question raced like clockwork in her head, no one gains this much weight in one night. Thats when she looked at her fingers and noticed they were a bit more pudgy then usual, it wasn't anything major but it was noticeable, she could still make a great fist but it wasn't perfect. <br>\r\n<br>\r\n\"I sure hope my gloves still fit, hell I hope the rest of my clothes fit\"<br>\r\n<br>\r\nThats when she realised her night gown was a bit tight. No doubg due to her now bulbus paunch. She then decided that the best thing to do was to go into the bathroom and take a better look at her new body<br>\r\n<br>\r\n\"This better be a dream\"</span></div></div>",
            "created":1278696120,
            "id":914525,
            "title":"Full bodied Enginner"
        },
        "1341":{
            "choices":[
                "Get Ed's help",
                "Mabey solo is better"
            ],
            "content":"<div class=\"\"><div> <span>Winry then rushed to the bathroom to give her new body a better look. Ot was too much for her to handle, how was any of this possible? She didn't even eat too much the previous and even if she did it couldn't have caused this sever a weight gain. The bathroom door proved some ristance as her new curves and bum showed that they were a bit wide for normal doors, but eventually she managed to get in and quickly walked over the full body mirror and then began to remove her night gown.<br>\r\n<br>\r\n\"I hope this isn't too bad...\"<br>\r\n<br>\r\nHowever her body told a different tale as her whole body was coverd in a semi thick layer of fat. While she wasn't obease she was deffinatly fat. With a puffy new body she began to examine the damage of the mysterious expansion. She began with her legs and feet, her feet weren't really affected that much but did contain some notable pudge, she wiggled then and was releved that, that was still possible. Her legs however contaid siginificant gain as they were begining to resmble kankles, no longer were they well toned but now they were round and bulb shaped. They even jiggled when she walked<br>\r\n<br>\r\n\"damn I'm getting kankles, that better be the worst of it\"<br>\r\n<br>\r\nOf course even she knew that was the least of her worries, their was still more body to go and things weren't looking any better. Next was her butt which suffered even more then her legs. It stuck out about 15 inches more then it should have and to top it off it jiggled even when she wasn't moving. The round flesh surprisenly didn't contain too many dimples nor were their any signs of cellulite. Winry's hips were even wider then before giving her body a slight pear shape. It seemed that most of her gain so far was focused primarily on her lower section and belly which appeard to be the biggest part of her, hanging just above her crotch, one big roll along with a developing second roll developed on her midsection giving the impression that she was about five months pregnant. Although unlike a pregnant belly her belly was full of fat which saged and jiggled, just like her butt.<br>\r\n<br>\r\n\"why couldn't my breast gotten huge? At least that would have been an improvment.<br>\r\n<br>\r\nIndeed her breast didn't grow as much as the rest of her only becoming about two cup sizes larger, however they still retained their firmness so no harm done. Thelack of gain in her breasts would also explain why her hands and arms weren't too affected, while they did contain fat they weren't as big as one would imagine. She made an almost perfect fist and even managed to flex her arms, although they did sag a bit. finally her face. Winry always had a cute face so the extra pudge that was applyed to it actually made her look even cuter, but she also noticed the development of a second chin but not quite yet.<br>\r\n  A finally rexamination of her body and Winry estimated that she now weight about 220 lbs. It wasn't a huge gainbut it was deffinatlly noticeable. She ran her fingers down her body and was surprised at how good it felt. <br>\r\n<br>\r\n\"It's not really anything major but I would really like to get to the bottomof this. No one gains this much in one night so something must be up. But what should I do? Do I get Ed to help or mabey it's best if I do this on my own.\"    </span></div></div>",
            "created":1278738660,
            "id":914975,
            "title":"Apon futher inspection"
        },
        "14":{
            "author_id":"gforce77",
            "author_name":"DragonofInsanity",
            "choices":[
                "Manga Skinny",
                "Manga Fat",
                "Anime Skinny",
                "Anime Fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want to have this set in the Manga or the Anime?. Also, how thin should Riza start out as?</span></div></span></div>",
            "created":1229662800,
            "id":621991,
            "title":"Riza"
        },
        "141":{
            "author_id":"templir",
            "author_name":"darkrai",
            "choices":[
                "Kidnapped by terrorists",
                "Winry visits",
                "More frustration at work"
            ],
            "content":"<div class=\"\"><div> <span>Colonel Riza Hawkeye stared aimlessly out in to the Ishvalin Desert as the mid day sun beat down on the new eastern command building. Live had really slowed down after the whole homunculus fiasco, and frankly she was bored as hell.<br>\r\n<br>\r\n\"Finally all finished,\" General Mustang muttered. She sighed before getting up and taking it from him. She quickly looks it over and an exhausted frown dawned upon her face.<br>\r\n<br>\r\n\"General, you forgot to sigh pages 14, 72, 69, and 36.\" She said as she handed them back to him.<br>\r\n<br>\r\n\"Can't I do them tomorrow?\" The General whined as he took them back.<br>\r\n <br>\r\n\"No, you slacker! Finish them properly so we can both go home!\" She scolded with a growl.<br>\r\n<br>\r\n\"But it's so hot.\"<br>\r\n<br>\r\n\"I don't care! Get it down!\"<br>\r\n<br>\r\n\"Can't I take a break?\"<br>\r\n<br>\r\n\"No!\" she practically screamed as she slammed both hands on his desk with a glare that could freeze hell over. The Brigadier General stared back at her calmly.<br>\r\n<br>\r\n\"Next time you decide to lean over my desk, breathe heavily with a fuious eye look in your eye while covering in sweat, do me a flavor and at least wear a low cut shirt.\" He said with a calm but shit eating smirk. Riza could feel the tale tell sigh of the vein nearly temple pulsing as she quickly stalked back to her desk. Oh, how she wanted to straggle that man, but she was a good soldier and took out her frustration on the next best thing, an innocent place of pastries someone had left on her desk. One but one, she consumed the pastries in a slow, cold fury as she waited for her commanding office to finish.<br>\r\n<br>\r\nIt wasn't look before she reached over only to find herself grasping at crumbs. She looked down at the place slightly confused. 'Do I really just eat all of those?'<br>\r\n<br>\r\n\"All done,\" Mustang said smugly.<br>\r\n<br>\r\nHawkeye quickly turned to face him.<br>\r\n<br>\r\n\"What?! You told me to finish the paperwork.\" He said calmly.<br>\r\n<br>\r\nThe frown quickly fell from her face as she realized was he was talking about. She carefully stood, willing herself not to wince for the uncomfortable tightness in her middle. She once again skimmed it over and saw everything was in order. She nodded before placing it on her desk and grabbing her coat.<br>\r\n<br>\r\n\"See you tomorrow, Hawkeye,\" Roy said as her playfully slapped her ass as he walked past her.<br>\r\n<br>\r\n\"I will charge you with sexual harassment,\" she said half halfheartedly. Roy just waved her off and Hawkeye just smiled faintly as her cheek slightly colored as she exited the building.</span></div></div>",
            "created":1398414120,
            "id":1786420,
            "title":"Working for the would be King"
        },
        "15":{
            "author_id":"gforce77",
            "author_name":"DragonofInsanity",
            "choices":[
                "Manga Skinny",
                "Manga Fat",
                "Anime Skinny",
                "Anime Fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want to have this set in the Manga or the Anime?. Also, how thin should Mustang start out as?</span></div></span></div>",
            "created":1229718780,
            "id":621992,
            "title":"Mustang"
        },
        "154":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "yes anime fat",
                "no go with lust",
                "more characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you sure you want to go with this?</span></div></span></div>",
            "created":1530282960,
            "id":2513201,
            "title":"are you sure?/ more characters"
        },
        "1542":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "skinny manga",
                "fat manga",
                "no options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which of starts do you want to go with</span></div></span></div>",
            "created":1530283020,
            "id":2513202,
            "title":"Lust"
        },
        "15421":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "Envy devious plan",
                "no something else"
            ],
            "content":"<div class=\"\"><div> <span>Lust, The homunculus and embodiment of the desire of Lust was lounging around since she was afforded the opportunity to relax when he wasn't on a task given by her creator/ Father.<br>\r\n<br>\r\nThe luscious woman with a tight dress that hugged her curvy body and large assets. <br>\r\n<br>\r\nshe enjoying her alone time, she didn't have to worry about Gluttony the simpleton homunculus who stuck close to her or the sassing mouth of the trickster Envy.<br>\r\n<br>\r\nUnfortunately she was unaware of what fate had in store for her, as she will be forced to bare a burden that will physically changer her, whether she wants to or not.</span></div></div>",
            "created":1530283440,
            "id":2513203,
            "title":"skinny manga"
        }
    },
    "info":{
        "author_id":"ghidorax",
        "author_name":"Shademaster",
        "brief_description":"Fatten up Ed or one of the other characters! 300 GP for each good addition!",
        "created":1189274220,
        "description":"<td align=\"left\" class=\"norm\">It's a feeding frenzy in Central! Pick your character, their age (not always applicable) and fatten 'em up!<br>\r\n<br>\r\n<br>\r\nNo Gay/Lesbian Stuff<br>\r\n<br>\r\nNo sex<br>\r\n<br>\r\nNo Vore<br>\r\n<br>\r\nNo killing off characters<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":1316257,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1530283440,
        "modified":1530283440,
        "pretty_title":"Fullmetal Alchemist Weight Gain"
    }
}