{
    "chapters":{
        "1":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Nathan Smith ",
                "Kelsey Cable",
                "Lynn Akins",
                "Tom Higgens",
                "Megan Johns"
            ],
            "content":"<div class=\"\"><div> <span>You were wondering around , trying to find a job, which wasn't easy in Springfield. Then you come across a skyscraper that you for some reason had never noticed in your small town. The sign on front read FREAKY DUCHESS BODY SWAP ENTERPRISES. The name rings a bell to you but you can't seem to place it. ' Mostly rumors and whispers ' you think to yourself. \"There is no way that company is real, \" you say aloud once you remember where you heard the name from. <br>\r\n<br>\r\nYou remember reading an article somewhere about a secret corporation that will sell a person another persons life and body for the right price. Even the government had once tried to investigate the owner and founder , the mysterious Freaky Duchess. Nothing was ever found on her though and the investigation was dropped when the special agent claimed there was nothing to see and promptly quit the agency she worked for. \" That was just a bad science fiction story... right?\" , you say to yourself.<br>\r\n<br>\r\nWhile checking out the front of the building you see a small sign in the corner of the window, HENCHMEN WANTED. Figuring a job is a job you head inside...<br>\r\n<br>\r\nWalking in you see a state of the art building, the likes of which belong in a Megacity such as New York or London, not in your small little town. In the middle of the lobby is a central receptionist desk with a short blonde woman typing away at a computer with her back to you. You slowly approach the desk , being distracted by the sheer size and modern style of the large room, and cough trying to attract the ladies attention. <br>\r\n<br>\r\nThe woman turns around and you are stunned to see Hayden Panettiere working as a receptionist. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i.dailymail.co.uk/i/pix/2015/04/20/20/27C9ED4000000578-0-image-m-61_1429557748878.jpg\" target=\"_blank\">http://i.dailymail.co.uk/i/pix/2015/04/2...</a><br>\r\n<br>\r\n\" Yo... You... You're Hayden Panetteire !!\" you almost ( but not quite) shout with wide eyes.<br>\r\n<br>\r\n\" Yes I am now aren't I ?\" she says back to you with a sparkle in her eye and a big smile on her face, \" and you are... ? \"<br>\r\n<br>\r\nYour choices are ...<br>\r\n<br>\r\nNathan Smith - a 20 yo college student . Caucasian , dark hair , brown eyes. Wants to be a dramatic actor.<br>\r\n<br>\r\nKelsey Cable- 49yo retired Human Resources Director at a local factory. Twice divorced. Two daughters aged 29 and 24. 5' 9\" , 118lbs , bottle blonde hair, green eyes. Often called 'Business Barbie' behind your back. Retirement fund pays all her bills, wants some play money and entertainment. Bored of day to day humdrum.<br>\r\n<br>\r\nLynn Akins- 17 yo cheerleader for the local high school. 5'4' 105lbs. , Asian-American. Typical girly girl who still doesn't know what she wants to do with her life, only that she wants out of this town.<br>\r\n<br>\r\nTom Higgins- 35 yo laid off factory worker. Ran out of money and is desperate to find work. 6'0\" . 200lbs, fit with red hair and brown eyes.<br>\r\n<br>\r\nMegan Johns- 33 yo Married mother of three. Caucasian, dark red-brown hair, blue eyes, 110lbs and 5'7\". Has 'mom body' from three children, but very much a MILF. Feels trapped in her life and desperately wants something exciting.</span></div></div>",
            "created":1508994000,
            "id":2406670,
            "title":"The application"
        },
        "12":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Brain Transplant",
                "Body Hopper",
                "Soul Exchange",
                "Zulotech",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>    Realizing that you were standing there with your mouth open, you quickly recompose yourself. \" I'm sorry about that ,\" you say, \" I am just not used to meeting a celebrity. It's not something that happens everyday to me. My name is Kelsey. Kelsey Cable.\" you introduced yourself.<br>\r\n <br>\r\n    \" Don't worry about it Ms. Cable. It happens all the time... especially working here.\" Hayden replies cryptically with a smile. \" So what brings you to FDBSE? \" <br>\r\n<br>\r\n    ' Something about this place is off ' you think to yourself as you look around the lobby, ' Its like I should know this place, yet somehow a skyscraper you don't remember was built in the small town you had spent your entire life in.' You know your not dreaming, because you can feel the counter under your hand , and the cool air from the air conditioner. At first you thought you should just run away, but your curiosity gets the better of you. Like ' why is there a movie and television star working the receptionist desk ? '<br>\r\n<br>\r\n     \" I'm really not sure .\" You answer truthfully. \" I was taking a walk through the town and I saw this beautiful skyscraper that I had never seen before and had to find out what it was. <br>\r\n<br>\r\n     \" That's alright Ms. Cable. We get our best customers through walk-ins. Could I ask why you were walking around ? You don't really seem to be in a hurry. \" Hayden asked.<br>\r\n<br>\r\n     \" Bored mostly. I retired six months ago, and my children are both out of the house now. I guess I was looking for something to do. I saw the Henchman Wanted sign out front and it made me laugh. That is a rather unique way to advertise a job opening. \" You finish with a chuckle.<br>\r\n<br>\r\n     \" Actually that is exactly what we want.  \" Hayden said, \" We have a special hierarchy here , and all department heads are referred to as Henchmen or Henchwomen . Those below them are minions, and the lowest tier are underlings. We believe it helps our workers understand their places in this company. \" <br>\r\n<br>\r\n     \" Really? \" you replied. \" I was a human resource officer at the factory down the road for twenty years, and they would have said that that was demeaning to the workers. There would have been a riot there if we had introduced a command structure like that.\" you said.<br>\r\n<br>\r\n      \" Well that company can't do the things we do, and I can guarantee that our workers are happy.\" Hayden retorted cheerfully, like she knew a secret no one else did. \" Did you say you were in human resources? As in someone who locates and acquires  talent for a company ? Because we are in serious need of a henchman to perform that job here.\" She added.<br>\r\n<br>\r\n      \" Yes, but like I said I am retired...\" you trail off as you notice a group of people wearing lab coats getting off an elevator behind Hayden. One brown haired woman said something to the group, maybe giving out assignments, causing the group to scatter and the head woman stepping onto another elevator. The group was too far away in the giant lobby of the skyscraper to hear what they were saying , but that wasn't what drew your attention. \" Is... is that?\" you tried to ask, \" Is that Pippa Middleton ?\" attempting to draw Haydens attention to the woman non- chalantly. <br>\r\n<br>\r\n       Hayden half turned and answered after looking at he woman. \" Yes. That is Dr. Middleton. She is the head of research and development as well as the top henchwoman here.\" Turning back to you she adds,\" She is also the vice president of Freaky Duchess Body Swap Enterprise and a certified genius. The Duchess says the company couldn't exist without her.\"<br>\r\n<br>\r\n       You were not only astonished at seeing Pippa Middleton, but you had so many questions come to mind when Hayden said those few sentences. \" Miss Panetteire... did you say 'BODY SWAP' ? \" you asked.<br>\r\n<br>\r\n      \" Yes I did. How do you think this company could afford to have me as a receptionist any other way?\" Hayden asks matter-of-factly. \" We run a body swap company... but you were about to tell me that you are retired and not interested in the job opening.\" she said grinning , daring you to walk away after that bombshell.<br>\r\n<br>\r\n       Quickly you amend your previous statement. \" What I meant to say was I am ready to come out of retirement for the right job.\" <br>\r\n   <br>\r\n      Hayden winked at you and simply said \" Good choice. \"<br>\r\n<br>\r\n     \" I do have a few questions though. \" you say, waiting for Haydens nod to go ahead. \" Do all henchmen or women get a new body?\" <br>\r\n<br>\r\n     \" Yes. \" she states. \" You can pick the method, and your new identity... so long as its not already taken by another henchman. Even then you can do as many mutual trades as you want.\"<br>\r\n<br>\r\n      \" Great... and the Duchess? \" you ask. \" Is Pippas sister the owner?\" <br>\r\n<br>\r\n     \" She is not Kate Middleton, although it was once her body. They call each other 'Sis' , even though neither one was born in the body they wear. Its hard to understand, but there was a rouge  A. I. that gave the Duchess the body of Kate Middleton and not her life. It also made her use the name ' Duchess' or 'the Freaky Duchess ' . You'll figure it out eventually. When you finally meet her all you will think is ' I recognize her from somewhere' but not be able to place where. It was some form of reality alteration.\" Hayden said. <br>\r\n<br>\r\n      \" Does that mean I have the job?\" you ask.<br>\r\n<br>\r\n      \"Yes. It does. \" Hayden said happily. \" I'm going to give you some literature to read tonight and tomorrow we will place you into your new life. Think about how you want to change, from the options listed , and who you want to become. Come back at 7 am tomorrow and we will perform the procedure. See you then.\"<br>\r\n<br>\r\n        You took the book from Hayden and turned to leave, attempting to hold back the excitement over getting to pick a new life for yourself. At home that night you decide to use --------- method to become the new-------.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1508994000,
            "id":2407065,
            "title":"Kelsey Cable"
        },
        "121":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Celebrity",
                "Someone you know",
                "Someone you don't know"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to use the brain transplant method to become...</span></div></span></div>",
            "created":1508994000,
            "id":2407068,
            "title":"Brain Transplant"
        },
        "1211":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Lauryn McClain ",
                "Chloe Moretz",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>   The next morning you wake up early, and prepare yourself to make a good first impression. You knew that it really didn't matter all that much knowing that in a few hours you were going to be a whole different person in a whole different body, but you still wanted to show that you were a professional. \" It's hard to believe that body swapping is real, \" you say to reflection in the mirror. \" In a few hours I will be a completely different person.\" <br>\r\n <br>\r\n    You critique your reflection , thinking about that , for a forty-nine year old mother of two you still look hot. For your age at least.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://y2.pichunter.com/3542441_2_o.jpg\" target=\"_blank\">http://y2.pichunter.com/3542441_2_o.jpg</a><br>\r\n<br>\r\n    \" Soon I will look hot for any age.\" you tell yourself as you grab your purse and walk to the front door. You take one last look around at the house and life you are about to give up. You had already called ahead , and told Hayden the body and life you had chosen for yourself.<br>\r\n<br>\r\n    \" Excellent choice\" you remember her telling you. \" That body will be prepped and ready for the procedure by the time you arrive. As soon as you get here we will proceed with the brain transplant. You will be waking up in your new body before lunch.\" she added perkily. <br>\r\n<br>\r\n    You snap out of your nostalgia, and quickly turn and leave. The next few hours come at you like a blur. The drive to FDBSE, being led by Hayden to the operating room. Meeting Dr. Middleton. It passed as a dream. The next thing you know you are waking up as...</span></div></div>",
            "created":1509080400,
            "id":2407176,
            "title":"Celebrity"
        },
        "12111":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Hayden gives you the full tour of FDBSE",
                "Hayden shows you your office",
                "You get straight to work in your new job"
            ],
            "content":"<div class=\"\"><div> <span>     The next thing you know you are waking up as twenty year old  Lauryn McClain, former Disney star and 'Free State of Jones' actress.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://images.twistmagazine.com/uploads/photos/file/168105/lauryn-mcclain-free-state-of-jones-filmmagic.jpg?crop=top&amp;fit=clip&amp;h=700&amp;w=700\" target=\"_blank\">http://images.twistmagazine.com/uploads/...</a><br>\r\n<br>\r\n     Last night when you were researching who you wanted to become you knew you wanted to be younger, and began looking at all the usual suspects. Scarlett Johansson, Chloe Moretz, Sabrina Carpenter. Then you thought about it. \" Why do I want to be one of them? \" you had said aloud. \" I have spent forty-nine years on this Earth as a beautiful blonde woman. Why not try something else?\" That's when you started looking up young women of different races than your own. You finally settled on twenty year old Lauryn. <br>\r\n<br>\r\n     Back in the present, after Dr. Middleton had made sure you had complete control of your new body, she decided to leave you alone for a little while. \" I am going to give you some time to become acquainted with your new body Lauren,\" she said, stressing your new name, \" Go see Hayden when you are ready to be shown your office. It's great to have you on board here. I look forward to working with you.\"<br>\r\n<br>\r\n      Once you were alone, you swung your legs off the bed and began to inspect your new form. You held your hands out in front of you and inspected them, marveling at the dark brown skin on them and your arms. Soon enough those same dark hands made their way to the small pert breasts hanging off your chest. As you began massaging them through the hospital gown you were wearing you felt yourself becoming aroused. You needed to be able to see what you were touching. When you hopped off the table you noticed a full length mirror across the room and a small table beside it with a pile of neatly folded clothes and a white towel on top of it. You quickly take off the gown and walk across the room to look at your reflection for the first time in your new body.<br>\r\n<br>\r\n     In the mirrors reflective surface you see a naked version of the young woman you researched last night. \" I can't believe this is real.\" you say your first words in your new voice. Your eyes are drawn to your new face, and you bein to catalogue the many differences between your new body and your old one. Aside from the much darker skin tone, which you planned to make even darker with a tan, you had chocolate brown eyes. They really weren't much darker than the green you had before, but would take a while to get used to. Your nose was flatter, and your lips were much fuller. You smile to look at your new teeth, and run your tongue around the inside of your mouth to feel the lack of the extensive dental work you once had. \" Wow!\" you say in awe. \" She must have taken good care of her teeth, I can't feel any fillings at all.\"<br>\r\n<br>\r\n    Soon your focus once again came down to your new breasts, and you love that they stand out with none of the sag you had finally accepted in your old body. Your hands once again cup them and you began to examine the dark brown areoles that adorned them. The color was very different from the light pink that you had seen for almost half a century.<br>\r\n<br>\r\n    Next your hands slid down to your tight stomach, that like the rest of your new body, had not yet been changed by motherhood. You didn't have a six pack, but you could see the well toned muscles under the skin were well underway to get there if you so chose. <br>\r\n<br>\r\n    You turned around so that you could check out your new butt in the mirror, and was very happy to see two tight beautiful large globes , forming the ever envied heart shape.<br>\r\n<br>\r\n    Then you spun around and leaned down to run your hands down your long, lean, nubile legs. You were astonished when your muscle didn't tighten up and prevent you from running your fingertips all the way down to your toes. \" Oh my! I was never this limber before in my old body.\" You say aloud and very pleased.<br>\r\n<br>\r\n    Finally you inspect your new vagina. It was shaved into a close cropped landing strip, with dark black hair that was the complete opposite of the light blonde bush you had for so long. Running your fingers along both sides, you were careful to avoid your new clitorus . The last thing you needed in your inspection was to become any more aroused than you already were. You needed to find out as much as possible about your new body, and wanted to save that part for last. That plan , like so many others throughout history, was about to be blown to smithereens and thrown out the window. When you used your fingers to part you lower lips, you finally saw something familiar, yet this too was different. Seeing the pink color of your vagina being surrounded by milk chocolate brown was so exiting to you that you had to push a finger into it. When you saw the blue painted nail as you pulled it out slowly graze the tip of your clit you felt an electric spark so intense, it brought you to your knees. Soon you maneuvered yourself so that you were laying crossways on your back with you head turned towards the mirror , as you fell into full masturbation mode. You watched the young Black woman in the mirror through half lidded eyes, as she soon added a second, and very quickly a third finger to her ministrations. Her free hand made its way to her chest and seizing a dark brown nipple as she began to let out a low moan and began thrusting her pelvis up to meet her fingers. You felt your orgasm unrelentingly approaching as you remembered that it wasn't some young Black woman, it was you. 'I am that young Black woman now! ' you thought as the build up reached a crescendo and releasing your orgasm. \" I am that young Black woman now !!! Ahhhh!!! \" you screamed repeating your earlier thought aloud, as you brought yourself to a squirting orgasm. You lay there sated as you lovingly caressed yourself , still staring at your new body in the mirror. \" I think I made a good choice , \" you say aloud with a satisfied smile on your face. <br>\r\n<br>\r\n       When you finally recovered enough energy to stand up you do so , and reach for the towel provided with the pile of clothes. \" Hmm.. I guess I am not the only pervert here.\" you say while wiping yourself down. The towel being left only proved that Dr. Middleton expected you to do exactly what you did when given some privacy. Now that you were dry once again, you began to put on the clothes provided to you. The panties and underwear were basic black cotton, and the pants tailored exactly for your body, as they were long enough to cover up the four and a half inch platform heels you now wore on your feet. The top was a beige crisscross bare midriff number meant to make your breast appear bigger while showing off your new tight , toned stomach. Underneath the clothes was a jewelry box containing a necklace and a large pair of gold hoop earrings.<br>\r\n\" That is one perk of being a Black woman .\" you said  hoping to find many more, \"  I could never pull off these earrings in my old body. They would have made me look like a slut. \" you added as you placed them through the piercing holes in your brown earlobes. Finally you looked at the finished product in the mirror and saw a young, strong , proud, confidant, Black woman staring back at you . Your dark face topped with a mop of gold highlighted ebony hair, and a beautiful sparkling white smile, was a huge difference from your old one. You were once again feeling a warmth grow inside your body, as you compared this one to the old, pale, meek, White woman you were before. The stark contrast from your old self to your new self was once again beginning to arouse you.<br>\r\n<br>\r\n      \" I had better stop and go find Hayden before I start fingering myself again. I love this body so much that I don't know how I will get anything do. \" You say to yourself , taking one last look in the mirror before turning for the door. \" Welcome to your new life Lauryn.\" you add loving your new voice. When you open the door you think to yourself ' Once I step out I will no longer be Kelsey and will become Lauryn for good.' You pause for a second and then step through, gladly casting off your old life. <br>\r\n<br>\r\n      \" That was quite the show you put on in there.\" you hear a voice to your right say as you turn to see Hayden leaning against the wall wearing a shit eating grin on her face. \" It was as good for me as it was for you, I can tell you that. Made me think of when I took this body for myself.\" she adds as she runs her own hands down her curvy body.<br>\r\n   <br>\r\n      \" You were watching? \" You asked with a single raised eyebrow , not really bothered by the though.<br>\r\n<br>\r\n      \" Not only was I watching I was participating. That was a two way mirror and I was less than four feet from you on the other side of it, copying your every move. We even came at the same time.\" She says with a twinkle in her eye and a cute nose twitch.<br>\r\n<br>\r\n       \" You do that with all your recruits? \" you inquired.<br>\r\n<br>\r\n       \" Hell yes! \" Hayden retorts. \" Everybody does what you did when they are left alone with their new body. I just wanted my piece of the action, and besides you like the fact that I did. Don't deny it.\" she adds accusingly.<br>\r\n   <br>\r\n      When you shrug your shoulders in a maybe/ maybe not manner she laughs and says \" Okay... fair enough let's get you accustomed to your new job and life Lauryn.\"<br>\r\n<br>\r\nFrom here your choices are...<br>\r\n<br>\r\n     <br>\r\n</span></div></div>",
            "created":1509080400,
            "id":2407226,
            "title":"Lauryn McClain "
        },
        "12113":{
            "author_id":"napo08",
            "author_name":"napo08",
            "choices":[
                "Emma Watson",
                "Kim Kardashian",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1560027720,
            "id":2670503,
            "title":"Other celebrities"
        },
        "122":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Celebrity",
                "Someone you know",
                "Someone you don't know"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>  You didn't like the idea of discarding your own body. You wanted to be able to go back to it so you elected to use one of the FDBSE bodyhopper amulets to become...</span></div></span></div>",
            "created":1509080400,
            "id":2407070,
            "title":"Body Hopper"
        },
        "1221":{
            "author_id":"teerawit",
            "author_name":"TRVIT",
            "choices":[
                "American",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You become celebrity!!! But American or other?</span></div></span></div>",
            "created":1509166800,
            "id":2407547,
            "title":"Celebrity"
        },
        "123":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Celebrity",
                "Someone you know",
                "Someone you don't know"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>     After reading the material Hayden provided to you , you thought the Soul Exchange method was more your style. So you elected to use it to become...</span></div></span></div>",
            "created":1509080400,
            "id":2407072,
            "title":"Soul Exchange"
        },
        "1233":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "You run out of the room",
                "You are too scared to say anything",
                "Make an excuse",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>When you got home, you were floating on air. You couldn't believe your luck. By this time tomorrow, you would be a different person. You would be younger and prettier. <br>\r\n<br>\r\nEven your first ex-husband, who married some little tart in her twenties, would be impressed. He would be even more than impressed, he would be hot for you.  Not that he would know who you were. You mused about seeking your ex-husband with your new body just to screw with his head. You could get him all hot and bothered and then publicly humiliate him. He deserved it.<br>\r\n<br>\r\nYour ex-husband reminded you of your children. They wouldn't know you either. After the swap, could you see them? It would be great to be young again, but that didn't mean you wanted to give up your family. This was on your mind when you returned to the office.<br>\r\n<br>\r\nIn the lobby, Hayden greeted you.  \"Miss Cable, I'm glad to see you.\"<br>\r\n<br>\r\n\"Ummm,  I have some questions,\" you replied.<br>\r\n<br>\r\n\" I was about to take you to orientation. Hold all your questions until then. They'll be answered there.\"<br>\r\n<br>\r\n\" Just one thing.\". You didn't want to take the job if you couldn't be a mother and grandmother.<br>\r\n<br>\r\n\" Don't worry about it. Whatever it is. They'll deal with it.\"<br>\r\n<br>\r\nYou followed Hayden through several corridors to a small conference room. When you entered, you saw a pretty middle-aged woman standing  in front. She looked a little familiar but you couldn't place her.   She was wearing a  dark women's business suit with a white blouse and red scarf.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcR_yO4yy2PTWW5MN_RMeyNsDtbMMzgguojWzteu5v-YLZywGlDc\" target=\"_blank\">https://encrypted-tbn0.gstatic.com/image...</a><br>\r\n<br>\r\nThe feeling that you had seen this woman before made you lose your train of thought.  Then it occurred to you.<br>\r\n<br>\r\n\" Aren't you...\"<br>\r\n<br>\r\n\" Yes, well sort of.\"<br>\r\n<br>\r\n\" You mean,\" you said as understanding hit you. Standing before you was the special agent who was supposed to investigate this company. You knew this is a body swap company. You put two and two together and realized what must have happened. The person front of you wasn't the real agent, she is someone who stole the agents body.  You became immediately scared.<br>\r\n<br>\r\n\" Yes, it's what you think,\" the woman said. She had had this conversation many times before. Continuing she said, \" and before you ask, the woman, or should I say man, who used to be me, is now serving five to fifteen years in prison for embezzlement and a host of other crimes.\"<br>\r\n<br>\r\nIt was worse then you thought. You didn't know what to do.<br>\r\n<br>\r\nBefore you could say anything, the woman said, \" I hear you have some questions.\"<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1574384340,
            "id":2749904,
            "title":"Someone you don't know"
        },
        "12332":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "A neighbor friend is at the door",
                "You get a phone call",
                "You hear police sirens",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\" It's just that I'm not really sure I want to go back to work.\"   You made an excuse but you were 100% sure thet you didn't want to work here. You were actually very scared. You didn't want to upset these people for fear of what could happen. You decided to bide your time until you could get out of here.<br>\r\n<br>\r\n\" I understand. But just give me a few minutes to convince you.\"<br>\r\n<br>\r\nYou didn't say anything in reply.<br>\r\n<br>\r\nWoman began her orientation. She started with a brief history of the company and then continued,  \" These are some of the famous people who have <br>\r\nused our services.\"<br>\r\n<br>\r\nThe woman went on to list several celebrities most of which you knew. As she listed them you thought about what you knew. <br>\r\n<br>\r\nOne famous openly gay singer had been recently been spending a lot of time with a famous actress. He had gone to many award shows with her. He and this actress were seen in the tabloids many times together. You hadn't thought this was strange before but now you have a new perspective.<br>\r\n<br>\r\nThere were also singers who found new careers as actors and vice versa. Even some famous actors who are now trying their hand at politics.<br>\r\n<br>\r\nThere was also a child actor who everyone said was very mature and poised for her age. You knew this actress was up for an Academy Award.<br>\r\n<br>\r\nWhen the presentation was over, you told the woman, \" I'm really not sure this is for me. I think I should go home and think about it. I'll call you in a few days.\"<br>\r\n<br>\r\nFrom behind you a young woman who couldn't have been more than 17 years old started to speak.  \" We've been checking and we really want you here. You have the expertise and experience that we have been looking for. Let us try to convince you.\"<br>\r\n<br>\r\n\" I really don't think so. I really enjoy the freedom of not having to go to work every morning.\"<br>\r\n<br>\r\n\" I assure you that are hours are quite flexible.  And the salary will be... \"<br>\r\n<br>\r\nYou backed your way towards the door. You wanted,  no needed to get out of there.<br>\r\n<br>\r\nYou kept making excuses until finally you felt you could leave.<br>\r\n<br>\r\nWhen you finally got home you were relieved. You debated for a moment about going to the authorities but you quickly dismissed it. You are just happy to be out of there.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1574441280,
            "id":2750240,
            "title":"You are too scared to say anything"
        },
        "123321":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "Stephanie wants to talk more",
                "Your best friend calls or visitsw",
                "One of you children comes over",
                "News about your ex-husband",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You changed out of your business suit into more casual clothing.   You decided to relax in front of the TV.<br>\r\n<br>\r\nSeveral hours passed before there was a knock at the door.  Through the peephole you saw your next door neighbor Stephanie Dyson.   Stephanie was carrying her two year old daughter in her arms.<br>\r\n<br>\r\n\" Hello Stephanie,\" you greeted as you let her into your house.<br>\r\n<br>\r\n\"Hi Kelsey, how have you been?\"<br>\r\n<br>\r\n\" Okay I guess.\"<br>\r\n<br>\r\nYou both took a seat on the couch.  Stephanie's baby was placed on the floor.  The baby looked up curiously at both of you.<br>\r\n<br>\r\n\" And how did your job interview go?\"<br>\r\n<br>\r\n\" My interview? How did you know about that?\"<br>\r\n<br>\r\n\" I saw you leave your house this morning. I saw you in a business suit. I put two and two together. What else could it be?\"<br>\r\n<br>\r\nYou hadn't known Stephanie as a gossip. But decided she was probably just curious. She was right you hadn't worn business attire since leaving your former job.<br>\r\n<br>\r\n\" It went well, but I don't think I want to return to work.\"<br>\r\n<br>\r\n\" Did they make you an offer?\"<br>\r\n<br>\r\n\" They said they wanted me.\"<br>\r\n<br>\r\n\" How much did they offer?\"<br>\r\n<br>\r\n\" They didn't say.\"<br>\r\n<br>\r\n\" I'm sure they will offer you a lot of money. A person of your expertise and experience is hard to find. Besides why do you want to stay home all the time just watching television. You should be out doing exciting things and making lots of money.\"<br>\r\n<br>\r\n\" I just don't think this is for me.\"<br>\r\n<br>\r\nYou continued talking for a while. Stephanie giving reason after reason as to why you should take this job. Although some of her reasons were persuasive you were adamant in your position. After about an hour, Stephanie left your house.<br>\r\n<br>\r\nIt was only after she left that you realized something was a little wrong. It wasn't just that Stephanie was so insistent that you take this job,  but also a few little things.<br>\r\n<br>\r\nStephanie didn't light up a cigarette as she would normally do. It was rare that Stephanie could go an hour without smoking. You are told her she should quit for the sake of her daughter.   She said she might but hadn't so far.<br>\r\n<br>\r\nAlso during the chat, Stephanie's baby sat quietly at your feet.  She never once fussed or toddled around the room.  At least you didn't think she did.<br>\r\n<br>\r\nA couple minutes later, Stephanie was back at your door.<br>\r\n<br>\r\nWhen you answered it, Stephanie said, \" I don't know where my head is, I forgot my purse.\"<br>\r\n<br>\r\nIt was true.   Looking at the couch, where you and Stephanie has been sitting was Stephanie's purse. You retrieved the purse and handed it to Stephanie.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1574441700,
            "id":2750245,
            "title":"A neighbor friend is at the door"
        },
        "1233214":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "You meet you real ex-husband in a new body",
                "Next to enter the stage is the body of your ex-husbands new gf/wife",
                "You try to escape",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Stephanie returned to her house and you decided to just forget it.  You tried to convince yourself it was all a joke.  After a while, you decided that Stephanie wasn't acting weird you were just a little on edge.  A nice dinner with a little wine, a warm bath and a good night sleep was all you needed. <br>\r\n<br>\r\nIn the morning, you were feeling refreshed.  You decided to put the whole thing behind you.  That was until eleven o'clock when a familiar face was at your door.  It was the same woman who conducted your orientation.  The woman who had supposedly cleared the company after an investigation, the one who was now working for the company.<br>\r\n<br>\r\n\"Miss Cable, we hadn't heard back from you.\"<br>\r\n<br>\r\n\"I'm sorry.  But I think I would prefer to stay retired.  I wish you all the best.  But I'm really not interested.\"<br>\r\n<br>\r\n\"Miss Cable, we can help you in ways you could never dream of.  Not just what we discussed at orientation.  And not the tremendous salary we are offering but there are many other perks.\"<br>\r\n<br>\r\n\"I'm really not...\"<br>\r\n<br>\r\n\"We really want you to join our team.  Let me show you.  We can do things for you you really can't imagine,\" the associate said cutting you off.<br>\r\n<br>\r\n\"No, I'm not.\"<br>\r\n<br>\r\n\"Let me just show you.\"<br>\r\n<br>\r\n\"Oh alright.\"<br>\r\n<br>\r\n\"I have to show you.  Come with me.\"<br>\r\n<br>\r\n\"I don't think so.\"<br>\r\n<br>\r\n\"We have a nice limousine here to take up.  I assure you you will want to see this.\"<br>\r\n<br>\r\nAfter some more hesitation, you broke down and accompanied her into the limo.  Inside the limo a video of playing of celebrities recommending the company.<br>\r\n<br>\r\nYou were taken to a large dance studio.  This being a weekday, it was closed at this time.  She ushered you into a theater.  In front of you was a large stage.  The curtain was down.  You took a seat and waited for what was to come next.<br>\r\n<br>\r\n\"Why are we here?\" you asked,<br>\r\n<br>\r\n\"You'll see.\"<br>\r\n<br>\r\nThe lights dimmed and a spot light was trained on the stage.  Soon the curtains opened and the spot light moved to stage right.  Music started to play.  It was a famous piece from the opera of the Marriage of Figaro.  You didn't know that was were it was from, but you did recognize the music.  In fact, it was part of the ballet scene from that opera.  You didn't understand what you were doing here.<br>\r\n<br>\r\nThen you saw him, leaping gracefully from off stage.  It was your first ex-husband.  He was dressed as you had never seen him before.  He wore a light pink leotard with a big red heart applique on front and translucent elbow length sleeves.  Over the leotard was a knee length ballerina full skirt with a slit that allowed freedom of movement.  You could see a petticoat underneath as he leaped and twirled on stage.  He wore it with white tights and white pointe shoes.<br>\r\n<br>\r\nHis beard was gone.  You had never seen him without his beard in all the years you had been married nor any of the time since.  His lips were painted red, along with reddish blush on his cheeks and neutral tones on his eyes.  The last time you saw him he was bald, but he was now obviously wearing a shoulder length wig held in place with a hair band.<br>\r\n<br>\r\nHe wasn't as practiced as a true ballerina.  He was dancing more like a talented girl.  Regardless he showed a grace and fluidity of motion that you couldn't imagine him having.  Not to mention he would never allow himself to be caught dead in women's clothing.<br>\r\n<br>\r\nThe recital lasted for about ten minutes before it was over.  It ended with a pirouette to a common ballet stance and a feminine bow as if he was listening to applause from the audience.  Then he danced himself off stage.<br>\r\n<br>\r\n\"How did you make him do that?\" you asked astonished.<br>\r\n<br>\r\n\"Well technically that really isn't you ex-husband.  Inside his body is an eleven year old girl.  She is quite talented.  Don't you think?\"<br>\r\n<br>\r\n\"But why did you do this?\"<br>\r\n<br>\r\n\"We know how you feel about him.  What a chauvinist he was.  We recorded the entire thing.  How do you think he'll feel when he's back to normal and we circulate this video to all his friends.  Of course, if you like we could arrange that he never gets his former body back again.  Whatever you prefer.\"<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1574542320,
            "id":2750709,
            "title":"News about your ex-husband"
        },
        "12332142":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "Finally see your husband",
                "Ex-husband's wife changes right in front of you",
                "Little girl begs to be changed back",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\" Would you like to meet him?\"   The recruiter meant the 11 year old who inhabited her ex-husband's body.<br>\r\n<br>\r\n\" Sure, that might be fun.\"<br>\r\n<br>\r\nYou were led backstage. On the way, you saw a woman hunched over taking small steps with a walker. She was wearing a high neck floral top with long sleeves. The blouse seemed extra big as if it was trying to hide the body underneath. She was also wearing jeans with an elastic waist and wide legs. Finally, on her feet wear white socks and slip on sneakers.  The minimal makeup she wore looked as if it was applied with a shaky hand.<br>\r\n<br>\r\nEven though her face seems fresh she had the aire of a much older woman. She also seemed familiar to you.<br>\r\n<br>\r\n\" Who is that?\" you asked.<br>\r\n<br>\r\n\" Don't you recognize her? That is your ex-husband's new wife. She may be 29 years old, but she thinks and acts like she is 92.\"<br>\r\n<br>\r\n\" She think she's 92?\"<br>\r\n<br>\r\n\" Yes she does. She also thinks like she has osteoporosis, arthritis, bad eyesight and wears dentures. None of this is true, but she acts as if it is. She could stand right up and walk as well as anyone else, but she won't try.\"<br>\r\n<br>\r\n\" Amazing.\"<br>\r\n<br>\r\n\"Have we convinced you yet?  We really want you. We'll do anything to prove it.\"<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\n</span></div></div>",
            "created":1576389120,
            "id":2759764,
            "title":"Next to enter the stage is the body of your ex-..."
        },
        "1233215":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "You try and help Stephanie",
                "You tell Stephanie you don't knwo what she is talking about",
                "You listen to her story",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Something was wrong.  Something was very wrong.  You didn't know what it was, but you had your own problems and didn't want to think about it to much.<br>\r\n<br>\r\nA while later there was an urgent knocking at your door.  You went to the door and saw two women who you had never seen before.  One was a woman in her thirties nicely dressed with brown hair and eyes she looked very distressed.  She was the woman knocking.  She was holding the hand of an older woman, she was dressed as a woman professional.  The woman who was older than you.  She had to be in her fifties or early sixties.  The other woman was contentedly sucking on a lollipop although it was obvious that she had been crying recently.  There was still tear tracks leading down the makeup under her eyes and down her cheeks.  There was an odd look in her eyes.  She had the wide eyed naive look.  It reminded you of what of the look you would see in an infant.<br>\r\n<br>\r\nThe younger woman seeing you demanded, \"Let me in.  I have to talk to you.\"<br>\r\n<br>\r\n\"Go away before I call the police.  I don't know you.\"<br>\r\n<br>\r\n\"Yes, you do!  Kelsey it's me Stephanie.  You know your next door neighbor.\"<br>\r\n<br>\r\nObviously this wasn't Stephanie.  But with what you knew you thought it might be.<br>\r\n<br>\r\n\"Stephanie???\"<br>\r\n<br>\r\n\"Yes.  I know this isn't my body.,  But it's me and I know you know what I mean.\"<br>\r\n<br>\r\nKelsey let her in.  <br>\r\n<br>\r\n\"Kelsey, you have to help me.  You have to take that job.  It you don't I'll have to stay this way,\" Stephanie yelled.<br>\r\n<br>\r\nStephanie didn't look too bad, but that wasn't the point.<br>\r\n<br>\r\nContinuing Stephanie yelled, \"If you won't do it for me.  Look at Gabby over here.  She's only two.  Look at what they did to her.\"  Gabriella was Stephanie's two year old daughter.  Now apparently she was in the body of a woman nearly sixty years old.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1574449320,
            "id":2750270,
            "title":"Strangers at the door"
        },
        "124":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Celebrity",
                "Someone you know",
                "Someone you don't know"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After reading the material Hayden provided , you were fascinated by the Zulotech that Dr. Middleton had reversed engineered from the famous Medallion of Zulo to become...</span></div></span></div>",
            "created":1509080400,
            "id":2407073,
            "title":"Zulotech"
        },
        "125":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Costume Gun",
                "Magic Remote",
                "Glamour Remote"
            ],
            "content":"<div class=\"\"><div> <span>  After reading the material Hayden provided, you were amazed at how many different ways FDBSE had to swap. Some of which were a reverse engineered costume gun, captured by the FBI and stolen by a FDBSE henchman. <br>\r\n<br>\r\nA television remote that could put you into the character of any T.V. program playing. Live recording or otherwise. You would be in the characters body, in their world.<br>\r\n<br>\r\nA different remote called the Glamour Remote that could morph your body into the actor or actress playing on any television program. You would live your life with the body of the character when as they were as the program was filmed. Used to become copies of stars from older generations.</span></div></div>",
            "created":1509080400,
            "id":2407076,
            "title":"other"
        },
        "1251":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Celebrity",
                "Someone you know",
                "Someone you don't know"
            ],
            "content":"<div class=\"\"><div> <span>You decide that using the Costume gun to turn someone into a living skin, that when worn by someone will make them into the person the skin was made from , was more your style. You would use the costume gun to turn---- into a skin and replace then that way.</span></div></div>",
            "created":1509080400,
            "id":2407078,
            "title":"Costume Gun"
        },
        "1252":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "A woman from the Series ' Chuck'",
                "other ",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After reading the material you decided that you wanted to try living life as your favorite television character for a while. You really wanted to be...</span></div></span></div>",
            "created":1509080400,
            "id":2407079,
            "title":"Magic Remote"
        },
        "12522":{
            "author_id":"ranger_marcel",
            "author_name":"ranger_marcel",
            "choices":[
                "A woman from a Star Trek Series",
                "A woman from the Series Baywatch",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After reading the material you decided that you wanted to try living life as your favorite television character for a while. You really wanted to be...</span></div></span></div>",
            "created":1509166800,
            "id":2407494,
            "title":"other "
        },
        "125221":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "TOS, TNG, DS9",
                "Voyager, Enterprise, Discovery",
                "Star Trek Continues, the Movies, or The Orville"
            ],
            "content":"<div class=\"\"><div> <span>There had been so many Star Trek series , so which one ?<br>\r\n<br>\r\nOption 1 - TOS, TNG, DS9,<br>\r\n<br>\r\nOption 2 - Voyager, Enterprise, Discovery<br>\r\n<br>\r\nOption 3 - Star Trek Continues ( found on youtube . Fan made but awesome and better than puke on currently on CBS- check it out) , the movies, or The Orville ( because c'mon its Star Trek without the name).</span></div></div>",
            "created":1509166800,
            "id":2407583,
            "title":"A woman from a Star Trek Series"
        },
        "1252211":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Star Trek The Original Series",
                "Star Trek The Next Generation",
                "Star Trek Deep Space Nine"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You knew exactly what Star Trek woman you wanted to morph your body into...she is on...</span></div></span></div>",
            "created":1509166800,
            "id":2407584,
            "title":"TOS, TNG, DS9"
        },
        "12522111":{
            "author_id":"ranger_marcel",
            "author_name":"ranger_marcel",
            "choices":[
                "Uhura",
                "Nurse Chapel or Janice Rand"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Character was it?<br>\r\n<br>\r\n<br>\r\nUhura<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/736x/a6/43/3e/a6433e2f722f9a2867819c2cec327e8f--star-trek-tv-star-wars.jpg\" target=\"_blank\">https://i.pinimg.com/736x/a6/43/3e/a6433...</a><br>\r\n<br>\r\n<br>\r\n<br>\r\nNurse Chapel<br>\r\n<a rel=\"nofollow\" href=\"https://68.media.tumblr.com/8a3e2582c7db260ae1057252e0de1508/tumblr_og89zxdhQU1vk5f3ao1_500.jpg\" target=\"_blank\">https://68.media.tumblr.com/8a3e2582c7db...</a><br>\r\n<br>\r\n<br>\r\n<br>\r\nJanice Rand<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/564x/2c/21/2f/2c212fd834e057be2b5766cb83c06242--si-fi-star-trek.jpg\" target=\"_blank\">https://i.pinimg.com/564x/2c/21/2f/2c212...</a></span></div></span></div>",
            "created":1509253200,
            "id":2408286,
            "title":"Star Trek The Original Series"
        },
        "12522112":{
            "author_id":"ranger_marcel",
            "author_name":"ranger_marcel",
            "choices":[
                "Deanna Troi",
                "Dr. Crusher oder Ro Laren"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Character was it?<br>\r\n<br>\r\n<br>\r\nDeanna Troi<br>\r\n<a rel=\"nofollow\" href=\"http://images4.fanpop.com/image/photos/24100000/Counselor-Deanna-Troi-counselor-deanna-troi-24182625-1533-2269.jpg\" target=\"_blank\">http://images4.fanpop.com/image/photos/2...</a><br>\r\n<br>\r\n<br>\r\n<br>\r\nDr. Crusher<br>\r\n<a rel=\"nofollow\" href=\"http://images2.fanpop.com/image/photos/9400000/Doctor-Beverly-Crusher-star-trek-the-next-generation-9406742-1539-2296.jpg\" target=\"_blank\">http://images2.fanpop.com/image/photos/9...</a><br>\r\n<br>\r\n<br>\r\nRo Laren<br>\r\n<a rel=\"nofollow\" href=\"https://vignette4.wikia.nocookie.net/memoryalpha/images/2/22/Ro_Laren.jpg/revision/latest?cb=20160410110127&amp;path-prefix=de\" target=\"_blank\">https://vignette4.wikia.nocookie.net/mem...</a></span></div></span></div>",
            "created":1509166800,
            "id":2407745,
            "title":"Star Trek The Next Generation"
        },
        "12522113":{
            "author_id":"ranger_marcel",
            "author_name":"ranger_marcel",
            "choices":[
                "Kira Nerys",
                "Jadzia Dax or Leeta"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Character was it?<br>\r\n<br>\r\n<br>\r\nKira Nerys<br>\r\n<a rel=\"nofollow\" href=\"http://images4.fanpop.com/image/photos/15400000/Screencaps-major-kira-nerys-15495502-709-530.jpg\" target=\"_blank\">http://images4.fanpop.com/image/photos/1...</a><br>\r\n<br>\r\n<br>\r\n<br>\r\nJadzia Dax<br>\r\n<a rel=\"nofollow\" href=\"http://images2.fanpop.com/image/photos/10900000/Jadzia-Dax-jadzia-dax-10920923-796-1115.jpg\" target=\"_blank\">http://images2.fanpop.com/image/photos/1...</a><br>\r\n<br>\r\n<br>\r\nLeeta<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/736x/eb/91/60/eb91600df3c9e88db9dc695954bad537.jpg\" target=\"_blank\">https://i.pinimg.com/736x/eb/91/60/eb916...</a><br>\r\n</span></div></span></div>",
            "created":1509166800,
            "id":2407726,
            "title":"Star Trek Deep Space Nine"
        },
        "1252212":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Star Trek Voyager",
                "Star  Trek Enterprise",
                "Star Trek Discovery"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You knew exactly what Star Trek actress you wanted to transform your body into. She is on...</span></div></span></div>",
            "created":1509166800,
            "id":2407586,
            "title":"Voyager, Enterprise, Discovery"
        },
        "12522121":{
            "author_id":"ranger_marcel",
            "author_name":"ranger_marcel",
            "choices":[
                "Seven",
                "Kes or B'elanna"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Character was it?<br>\r\n<br>\r\n<br>\r\nSeven of Nine<br>\r\n<a rel=\"nofollow\" href=\"http://trekcore.com/gallery/albums/sevenofnine/7of9_s6a.jpg\" target=\"_blank\">http://trekcore.com/gallery/albums/seven...</a><br>\r\n<br>\r\n<br>\r\n<br>\r\nKes<br>\r\n<a rel=\"nofollow\" href=\"https://i2-prod.mirror.co.uk/incoming/article6451234.ece/ALTERNATES/s615b/Jennifer-Lien-as-her-character-Kes-in-Star-Trek-Voyager-in-1995.jpg\" target=\"_blank\">https://i2-prod.mirror.co.uk/incoming/ar...</a><br>\r\n<br>\r\n<br>\r\n<br>\r\nB'elanna<br>\r\n<a rel=\"nofollow\" href=\"http://images4.fanpop.com/image/photos/17500000/B-Elanna-Torres-belanna-torres-17566967-487-730.jpg\" target=\"_blank\">http://images4.fanpop.com/image/photos/1...</a></span></div></span></div>",
            "created":1509253200,
            "id":2408290,
            "title":"Star Trek Voyager"
        },
        "12522122":{
            "author_id":"ranger_marcel",
            "author_name":"ranger_marcel",
            "choices":[
                "T'Pol",
                "Sato or Slave Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Character was it?<br>\r\n<br>\r\n<br>\r\nT'Pol<br>\r\n<a rel=\"nofollow\" href=\"http://1.bp.blogspot.com/-yoalQ70upk8/VJGrqTi82QI/AAAAAAAAxXU/Y-zDi-xwmMw/s1600/tpol06.jpg\" target=\"_blank\">http://1.bp.blogspot.com/-yoalQ70upk8/VJ...</a><br>\r\n<br>\r\n<br>\r\n<br>\r\nHoshi Sato<br>\r\n<a rel=\"nofollow\" href=\"http://ent.trekcore.com/gallery/albums/publicity/hoshi/hoshi01.jpg\" target=\"_blank\">http://ent.trekcore.com/gallery/albums/p...</a><br>\r\n<br>\r\n<br>\r\n<br>\r\nOrion Slave Girl<br>\r\n<a rel=\"nofollow\" href=\"https://vignette.wikia.nocookie.net/memorydelta/images/7/77/Orion_slave_girl_for_sale.jpg/revision/latest?cb=20130908130424\" target=\"_blank\">https://vignette.wikia.nocookie.net/memo...</a><br>\r\n</span></div></span></div>",
            "created":1509253200,
            "id":2408292,
            "title":"Star  Trek Enterprise"
        },
        "1252213":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Star Trek Continues ( Fan made youtube series)",
                "One of the many movies",
                "The Orville"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You knew exactly which Star Trek actress you wanted to transform your body into. She is on...</span></div></span></div>",
            "created":1509166800,
            "id":2407587,
            "title":"Star Trek Continues, the Movies, or The Orville"
        },
        "125223":{
            "author_id":"ranger_marcel",
            "author_name":"ranger_marcel",
            "choices":[
                "A woman from a Stargate Series",
                "other",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After reading the material you decided that you wanted to try living life as your favorite television character for a while. You really wanted to be...<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1509253200,
            "id":2408293,
            "title":"Other"
        },
        "1252231":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Stargate SG-1",
                "Stargate Atlantis",
                "Stargate Universe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After reading the materials that Hayden provided , you decided to become a character from one of the Stargate series, but which one?</span></div></span></div>",
            "created":1509512400,
            "id":2409698,
            "title":"A woman from a Stargate Series"
        },
        "12522311":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Major Samantha Carter USAF",
                "Dr. Janet Frasier USAF",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>You decided you wanted to experience some of the action and adventure of the science fiction series Stargate SG-1. You used the remote to jump into the body and life of ...<br>\r\n<br>\r\n<br>\r\nYour choices are- <br>\r\n<br>\r\nMajor Samantha Carter USAF- part of the frontline elite special forces team that protests Earth from a parasitic group of snake-like aliens that take humans hosts known as the Goauld. Holds a double doctorate in astrophysics and quantum mechanics. Known to her superiors as Earths greatest natural resource. Always the smartest person in the room.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://ia.media-imdb.com/images/M/MV5BMTc3Nzc3NzMwNV5BMl5BanBnXkFtZTcwMTY2NjQ4NA%40%40._V1._SX640_SY974_.jpg\" target=\"_blank\">http://ia.media-imdb.com/images/M/MV5BMT...</a><br>\r\n<br>\r\nDr. Janet Frasier USAF- Chief Medical Officer of Cheyanne Mountain, the military complex hidden under NORAD housing the Stargate program and the Stargate itself. The Stargate is a device that channels a great amount of power to generate a stable wormhole that connects to another Stargate on another planet, therefore allowing nearly instantaneous travel to other worlds. Tiny but fierce, she likes her big needles and sometimes has a Napoleon complex when it comes to her infirmary.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://dvdbash.com/2013/09/16/stargate-sg-1-promo-photos/stargate-sg1-s1-teryl-rothery-dvdbash-wordpress/\" target=\"_blank\">https://dvdbash.com/2013/09/16/stargate-...</a><br>\r\n<br>\r\n</span></div></div>",
            "created":1509685200,
            "id":2410549,
            "title":"Stargate SG-1"
        },
        "125223113":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Dr. Carolyn Lam",
                "Vala Mal Doran",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>There were so many wonderful ladies in the SGC that you passed on the first two obvious choices and decided to become...<br>\r\n<br>\r\nDr. Carolyn Lam- The second CMO of Stargate Command, Dr. Carolyn Lam is a civilian given the plum appointment by General Jack O'Neill himself. She is General Hank Landry's daughter, and arrived on the base soon after he took command. Their relationship has been strained for years, and she has implied that she might have turned down the job had she been told that Landry would be in charge. Carolyn maintains a relationship with her mother, Kim Lam, from whom the General is separated. As a child her father was often gone, often unable to tell her and her mother about what he was doing, because of his line of work. It's something that drove a wedge between them from a young age, and that Carolyn is only now beginning to understand now that she herself works at a top-secret government facility. After serving with him for two years, Carolyn's relationship with her father was markedly improved. <br>\r\nLam replaced Dr. Janet Fraiser more than a year after Fraiser's tragic death in the line of duty. * From the Gateworld Omnipedia,  Gateworld.net*<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://www.gateworld.net/gallery/displayimage.php?album=191&amp;pid=61118#top_display_media\" target=\"_blank\">https://www.gateworld.net/gallery/displa...</a><br>\r\n<br>\r\nVala Mal Doran- A thief and a con artist, Vala Mal Doran was an ally of SG-1 before eventually joining the team. She previously made her living trading, stealing, and selling things, and though she provided weapons to shady characters, she was always something of a morally conscious arms dealer. Vala is brash and self-confident, and disguises her true, sensitive character with humor and innuendo. Because of their history together, Vala and Daniel Jackson have a special, love-hate relationship. <br>\r\nVala was once host to the Goa'uld Qetesh, who ruled over her world. Ten years ago the Tok'ra incited a rebellion there and the Goa'uld was overthrown, according to her story. Vala, as its host, was tortured and beaten by her former subjects. But the Tok'ra took pity on her, as a helpless host, and removed the symbiote and nursed her back to health.  *from Gateworld Omnipedia*<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://claudialeeblack.free.fr/galerie/promos/sg1/10/277.jpg\" target=\"_blank\">http://claudialeeblack.free.fr/galerie/p...</a></span></div></div>",
            "created":1509685200,
            "id":2410564,
            "title":"other"
        },
        "1252231133":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Goa'uld",
                "Tokra",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Perhaps one of the alien races?<br>\r\n<br>\r\n<br>\r\nThe Goa'uld- One of the Milky Way Galaxy's most dominant species for thousands of years, the Goa'uld are serpent parasites that forcibly take human hosts, and possess a thirst for power and worship. They have enslaved countless worlds, using their inhabitants as hosts, soldiers, miners, and personal slaves.  * From The Stargate Omnipedia*<br>\r\n<br>\r\nThe Tok'ra- Though the same species as the Goa'uld, the Tok'ra are a resistance movement who live in voluntary symbiosis with their human hosts -- and thus refuse to be called \"Goa'uld\" because of their philosophical differences. <br>\r\nMore than 2,000 years ago a Goa'uld queen, Egeria, realized what true evil the species was and made a decision to turn against the ways of Ra and the System Lords. All her offspring have genetically inherited the same ideals, and the Tok'ra (literally meaning \"Against Ra\") movement was born. <br>\r\nThe Tok'ra become easily offended if their symbiotic creatures are referred to as Goa'uld, believing that they are vastly different then their Goa'uld brethren. They have been mercilessly hunted by the System Lords since their formation. <br>\r\nThe Tok'ra are always on the run, changing the location of their base of operations every few years and operating multiple bases simultaneously. They live in subterranean tunnels they grow from special crystals. Once they arrive on a planet they immediately move underground with these crystals, forging corridors and rooms. This is how they have remained greatly undetected by the System Lords for thousands of years. <br>\r\nOften Tok'ra operatives are sent on missions to infiltrate and subvert the plans of the System Lords. Many Tok'ra spies have been implanted in various Goa'uld groups across the galaxy, rarely being discovered. <br>\r\nThe Tok'ra are governed by the Tok'ra High Council. To keep from being entirely wiped out, there is more than one base of operations -- though one base is typically larger than the smaller cells, functioning essentially as a temporary Tok'ra homeworld. Since SG-1 met the group, they have moved to the desert planet Vorash, then to the forested world of Revanna. When the Goa'uld Zipacna (in the service of Anubis) discovered their location and attacked, the entire base was wiped out -- leaving only those Tok'ra in cell bases and away on missions as survivors. <br>\r\nThough the group has sustained many casualties over the years, their determination to wipe the Goa'uld scourge from the face of the galaxy is stronger than ever. Their long-term goal has been to keep the System Lords feuding with one another, so that no one Goa'uld can rise to dominant power. With the development of a symbiote toxin, however, they have begun to act more aggressively, hoping to one day exterminate the Goa'uld completely. * From the Stargate Omnipedia*</span></div></div>",
            "created":1509685200,
            "id":2410575,
            "title":"other"
        },
        "12522311331":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Amonet or Hathor",
                "Nirrti or Osiris",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You decided to become one of the hostile parasites, but which one?<br>\r\n<br>\r\nAmonet- Apophis's beloved Goa'uld queen. Amonet possesses the body of Daniel Jackson's wife, Sha're. Jackson and SG-1 searched the galaxy for Sha're for more than two and a half years before she was killed. Teal'c was forced to fire his staff weapon at her, because Amonet was about to kill Jackson. <br>\r\nAmonet and Apophis mated with their hosts and produced a human son, Shifu, who was born on Abydos and hidden away amongst the people. Apophis was convinced that Heru'ur (a rival System Lord) had stolen the child, though Amonet seems to have known the truth and kept it from him. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://78.media.tumblr.com/tumblr_mdj2w9pxAl1ro86a1o7_500.jpg\" target=\"_blank\">http://78.media.tumblr.com/tumblr_mdj2w9...</a><br>\r\n<br>\r\nHathor-  The daughter and bride of Ra, Hathor was a Goa'uld queen imprisoned in a sarcophagus in South America for thousands of years. In 1997, she was discovered by a pair of archaeologists, whom she killed before heading for the Stargate -- sensing its hidden location deep within Cheyenne Mountain. She has the ability to breathe an organism that renders men highly susceptible to her suggestion and \"drunk\" with her beauty -- but the base's women remained unaffected. <br>\r\nAfter her attempts to take over the S.G.C. and use its personnel as her new Jaffa (servants, warriors and incubators for her a new race of Goa'uld larva she created) was thwarted, Hathor escaped through the gate and continued to build a new army. She enlisted horus and serpent guards, as well as other Goa'uld, luring them from the remote outposts of various System Lords. Hathor's intention was to quietly gather her forces before the System Lords even knew she had been freed from her prison on Earth, in order to move against them. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www.thelivingmoon.com/42stargate/04images/Series/Hathor_big.jpg\" target=\"_blank\">http://www.thelivingmoon.com/42stargate/...</a><br>\r\n<br>\r\nNirrti - Treacherous and amoral, the Goa'uld Nirrti was regarded as a goddess of darkness and destruction in ancient Hindu culture. She was once a powerful System Lord, but was cast out by the other System Lords when she nearly threw their relationship with the Asgard into chaos by making a play for Cronus' territory. During a summit at the S.G.C. Nirrti used advanced phase-shift technology to become invisible, allowing her to try and kill Cronus and throw the blame on Teal'c. Instead, Nirrti was apprehended. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://78.media.tumblr.com/7d2dddfffea180c276cec6f9dbc8c4f6/tumblr_mkksr4IgER1ro86a1o6_1280.jpg\" target=\"_blank\">http://78.media.tumblr.com/7d2dddfffea18...</a><br>\r\n<br>\r\nOsiris - Banished to Earth for thousands of years, the Goa'uld Osiris was released by a young archaeologist named Sarah Gardner -- who became his new host. He went on to serve the powerful Goa'uld Anubis, a former acquaintance of Osiris', who was poised to conquer the galaxy. Osiris' host is also Daniel Jackson's friend and former girlfriend. <br>\r\nIn Egyptian mythology, Osiris was the first Pharaoh of Egypt. His mate and goddess was Isis. Osiris' brother and enemy was Setesh (Seth), who sealed him in a \"magic box\" (a Goa'uld stasis jar) and, according to the myth, cast him into the Nile River. The Osiris jar was discovered in the twentieth century by the Stewart Expedition. <br>\r\nThe ship carrying Osiris away from Egypt sank, and its contents were not salvaged for some 70 years. Finally arriving in Chicago, the Osiris Jar was opened by Gardner -- eager to make an important archaeological discovery that would distinguish her young career. Osiris took her as his new host, and fled Earth in a hidden Goa'uld ship -- promising to return one day with a vengeance. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www.zianet.com/jsager/osirus1.jpg\" target=\"_blank\">http://www.zianet.com/jsager/osirus1.jpg...</a><br>\r\n<br>\r\n * All bios copied from the Stargate Omnipedia*<br>\r\n</span></div></div>",
            "created":1509685200,
            "id":2410578,
            "title":"Goa'uld"
        },
        "1252232":{
            "author_id":"tharzog",
            "author_name":"tharzog",
            "choices":[
                "Daenerys Targaryen",
                "Cersei or someone else",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Which female Character was it?<br>\r\n<br>\r\n<br>\r\n1.Daenerys Targaryen<br>\r\n<br>\r\n2.Cersei <br>\r\n<br>\r\n3.Melisandre<br>\r\n<br>\r\n4.Sansa Stark<br>\r\n<br>\r\n5.Arya Stark<br>\r\n<br>\r\n6.Margaery Tyrell<br>\r\n<br>\r\n7.Brienne von Tarth<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1509598800,
            "id":2410126,
            "title":"A woman from Game of Thrones"
        },
        "1253":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Celebrity",
                "other",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After reading the material Hayden provided you decided to use the Glamour Remote to become ....</span></div></span></div>",
            "created":1509080400,
            "id":2407080,
            "title":"Glamour Remote"
        },
        "12531":{
            "author_id":"ranger_marcel",
            "author_name":"ranger_marcel",
            "choices":[
                "Marilyn Monroe",
                "Raquel Welch or someone else",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After reading the material Hayden provided you decided to use the Glamour Remote to become ....</span></div></span></div>",
            "created":1509166800,
            "id":2407495,
            "title":"Celebrity"
        },
        "14":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "To become a henchman",
                "To purchase a new life from the FDBSE inventory",
                "Forget nice and purchase a specific life. ",
                "Purchase Zulotech, A bodyhoppers amulet, or swap spell",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>      \"Oh! I'm sorry... my name is Tom. Tom Higgins.\" you apologize and extend your hand, \" I am just not used to meeting celebrities. I love your work.\" you add.<br>\r\n      <br>\r\n       Hayden giggles and meets your hand with her own and says \" Don't worry. It happens all the time. It's something you get used to working here. Is there something I can help you with Tom?\" <br>\r\n<br>\r\n       You couldn't believe you were actually having a conversation with Hayden Paneteirre and she seemed to be flirting with you on top of that! The smile on her face causing you to forget how to speak momentarily. \" Work...ah...I wark. \" you sputter, \" I mean I am looking for work.\" you finally spit out, feeling like an idiot. Of course your awkwardness only caused Hayden to giggle again. <br>\r\n<br>\r\n       She suddenly burst out loud laughing and said \" I'm sorry, I just had to do that. My day is pretty boring here and I use any excuse to be entertained. I'm sorry I flustered you. Let me be serious for a moment.\" She straightens her face into one of seriousness. \" Are you interested in our henchman position?\"<br>\r\n<br>\r\n      You had actually thought the sign outside was a little joke, but Hayden used the same word. \" Ah ... yeah . I guess. I really need a job right now.\" you say. <br>\r\n\" I'm willing to do almost anything. I'm getting desperate.\" you admit, past the point of pride. Sometimes having no shame is the way to get ahead.<br>\r\n<br>\r\n      \" Tom , you seem like a nice guy. I am not sure you are cut out for what we do here. Maybe I can offer you something else instead. Do you know what we do here?\" Hayden asks.<br>\r\n<br>\r\n      \" Uhm ... no. Not really. \" you answer , wondering where she was going with this.<br>\r\n<br>\r\n      \" It says it right on the sign outside. We are a bodyswap company. We sell people the bodies and lives that they want for themselves. Would you feel comfortable becoming one of the Duchess' henchmen and basically kidnapping people so one of our customers can steal their body and life? You really don't seem the type.\" she says seriously and smiles before adding, \" You seem too nice for it.<br>\r\n<br>\r\n       You wonder if she is telling you the truth or if she is just bonkers before she interrupts your thoughts. \" How else could a company afford to have Hayden Panettere as a receptionist? \" she asks.<br>\r\n<br>\r\n       After thinking about it you decide to go along , if only to see what is going on. \" What else can I do Ma'am. I need a job.\" you say.<br>\r\n<br>\r\n      \"Could I interest you in a new life?\" Hayden asks. You just shook your head and responded with \" I don't know how I could pay for it. I'm broke as it is.\" <br>\r\n<br>\r\n      \" Oh silly. You would pay for it with the job that comes with your new life. Let me show you what we have in stock and you tell me if you still want to be a henchman or you would rather start over as someone else.\" Hayden stated. \" Would that be okay?\" <br>\r\n<br>\r\n      \" I am not sure I could steal someone elses' life. \" you say .<br>\r\n<br>\r\n     \" Don't worry about that. I was going to show you the bodies we have in storage. They are the ones that our customers have discarded after purchasing a new life. They are unoccupied and just waiting for someone new to claim them.\" Hayden states.<br>\r\n<br>\r\n      \" That might not be too bad,\" you say, not seeing any evil in that. \" I mean since they didn't want it I may as well have it? \" you say.<br>\r\n<br>\r\n      \" Great. Think about it for a minute and let me know if that is what you want or if you would rather be a henchman.\" Hayden replies.<br>\r\n<br>\r\nIn the end you choose ...<br>\r\n</span></div></div>",
            "created":1509426000,
            "id":2409259,
            "title":"Tom Higgens"
        },
        "141":{
            "choices":[
                "Take a new body",
                "Meet the crew"
            ],
            "content":"<div class=\"\"><div> <span>The idea of you becoming a henchman started to warm up to you. After your boring previous job you wanted to live on the edge and do something exciting that will change each day. You look at Hayden and confidently say , \" I want to be a Henchman.\" Hayden looks back at you and responds , \" I admire your confidence , okay , I will give you a chance to be a henchman. \" . <br>\r\n<br>\r\nHayden then explains to you the job description. The more she explains the more excited you become. You agree to all the paper work and when you are finish Hayden offer to give you a new body that is more suited for the job description or you can keep your body and meet up with the rest of the crew.</span></div></div>",
            "created":1517720400,
            "id":2449051,
            "title":"I want to be a Henchman!"
        },
        "142":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Kelsey Cable, the woman who fired you from the factory",
                "other",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>         \" I think I will purchase a new life from your inventory. \" You say actually starting to feel pretty good about the idea. \" I mean since those people didn't want it anyway.\" you add.<br>\r\n <br>\r\n         \" Great! \" Hayden says with a smile. \" I knew there was something we could do for you here. \" She says as she calls someone over to watch the front desk. You are amazed to see Olivia Munn come and take over desk duties for her. <br>\r\n\" Come on Tom,\" Hayden says , \" let me show you what we have. Don't worry , there are some pretty nice ones here.\"  she adds, helping to alleviate the worries you had. ' After all ' you think, ' How great could those lives be if someone was willing to throw it away?' you ask yourself.<br>\r\n<br>\r\n       Hayden lead you down a corridor into the guts of the building into a large room with  metal and glass capsules. There were hundreds there and it looked like something out of a sci-fi movie. \" As you can see , when a person is removed from their body we place it into suspended animation. \" Hayden states, \" They are stored here until someone else purchases them. Most of them are normal people, that just wanted a change. A lot of them were actually well off and wanted to become celebrities or super rich people. These bodies are the best bargains here as they are just normal and not in high demand.  Have a look around and let me know if you see anything you like. \" <br>\r\n<br>\r\n       You wondered around the room looking into each pod , surprised to see that most of them were in fact normal people. You looked in one and see a cute Asian girl that looked like she was just sleeping. In another you see a mid twenties college guy, and another you see a mid thirties MILF. You couldn't believe the technology these people had. Maybe it was possible to swap bodies if they had perfected suspended animation.<br>\r\n<br>\r\n     \" Your telling the truth ...\" you accidently say out loud as you come across the one you wanted to be.<br>\r\n<br>\r\n      \" Of course I am silly. Have you found one you like? \" Hayden answered.<br>\r\n<br>\r\n     \" Yeah...\" you say as you place your hand on the glass portion of the pod , <br>\r\n\" Yeah I have. I'll take this one... \" you trail off.<br>\r\n<br>\r\nWho did you choose?</span></div></div>",
            "created":1509426000,
            "id":2409266,
            "title":"To purchase a new life from the FDBSE inventory"
        },
        "1421":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Go check out your new home",
                "Go to a bar",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>      \" This one.\" You say looking at the body laying in the pod. \" I'll take this one.\" <br>\r\n<br>\r\n      \" That is an excellent choice Tom. I wouldn't mind being her myself.\" Hayden says with sincerity. Her name is...\" <br>\r\n<br>\r\n      \" Kelsey Cable.\" You interrupted. \" She is the reason I'm here in the first place.\" you added.<br>\r\n<br>\r\n      \" You know her ?\" Hayden asked , genuinely intrigued.<br>\r\n<br>\r\n      \" Yeah, I do. For some time now. She is the woman who fired me from the factory. We worked together for a decade before she called me to her office and said I wasn't showing enough motivation anymore. 'Business Barbie' herself,\" you state not going into details. \" I guess it's fitting that she ruined my life a month before my retirement that I get her life in return.\" you add while looking in the face of the woman you thought about everyday since. You had convince yourself you hated her and now had a chance at revenge. Then a thought occurred to you  \"Why is she here... I mean she still has her hundred thousand plus job and a good life that came at the expense of others. Why would she give it up?\" you asked.<br>\r\n<br>\r\n        Hayden looks at the woman in the pod and responds, \"I remember her. She came in a few months ago saying she hated her employers for what they forced her to do. How they made her hurt her friends. She said she took the early retirement so as she could and quit that place, but still wasn't happy. So she came here.\" <br>\r\n<br>\r\n       \" Who did she swap bodies with ?\" you ask now feeling guilty for your misplaced hate of the woman.<br>\r\n<br>\r\n      \" I can't tell you that,\" Hayden said. \" but I can tell you that she works for FDBSE as a henchman. She said she wanted to spend her retirement helping people get better lives, and now she is.\" Hayden turns to you and asks \" Have you made your choice?\"<br>\r\n<br>\r\n      \" Yes.\" you stated confidently. \" This one. I want this body.\"<br>\r\n<br>\r\n      \" Okay great. Follow me and by lunch you will have it. \" Hayden says and leads you through the room into a side chamber. Inside you see what looks like an operating room and she asks you to lay on the table. <br>\r\n<br>\r\n      Hayden puts a breathing mask on you and says \" I am going to put you into an induced sleep now. Then I will get the Doctor to perform the procedure. When you wake you will be in your new body. Now count backwards from ten for me.\"<br>\r\n<br>\r\n      You nod your head and begin counting. \" 10..9...8...7....\" was as far as you got before the gas overwhelmed you.<br>\r\n<br>\r\n      You awaken a few hours later feeling lighter. You blink your eyes at the bright lights a few times trying to adjust to the light levels. When you think they are good you turn your head to the side and see Hayden sitting in a chair waiting for you to wake up. \" Hayd... \" you start and stop when you hear your own voice. \" Did it work Hayden?\" You ask , even as she stood up and made her way to you. You figure it did since you recognized the voice coming from your mouth. Still it sounded different coming from you.<br>\r\n<br>\r\n       \" Yes it did Tom. How do you feel?\" Hayden asked. You thought for a moment to take in the sensations your body was giving you. Aside from the slight jiggling from your chest and the tickling around your neck you felt fine. \" Actually I feel pretty good.\" you say in surprise, still getting used to hearing Kelseys voice coming from your mouth.<br>\r\n<br>\r\n       \" Good, \" Hayden said. \" The Doctor said the surgery went flawlessly and that you are free to go whenever you are ready. Do you need help getting dressed? The clothes your host left are difficult for an experienced woman to put on, much less a newb.\" <br>\r\n<br>\r\n       \" I would like that Hayden , thank you.\" You say as you swing your legs off the bed and stood up. You could see your reflection in the mirror that the company had placed on the wall for customers to inspect their new bodies with.<br>\r\nIn the reflection you see a woman that you had known for over a decade looking back at you while wearing a hospital gown. Her green eyes wide, and her blonde hair down. You moved your hand to touch your new hair , looking for a scar, the woman in the mirror doing the same, moving her hand along the edges of her hairline. Soon you slid your hands down the rest of your body, along your face, and stopping to squeeze your c-cup breasts. \"Wow, I have her face and boobs.\" you say aloud even as you fondled you new nipples.<br>\r\n<br>\r\n      \" You've got a lot more than that Honey,\" you hear Hayden say from the side,\" you have everything that was Kelsey Cables. You are her as far as the world is concerned.\" <br>\r\n<br>\r\n       You had forgotten that you had an audience, and muttered \"S...s...sorry.\" while watching Kelseys face turn red in the mirror. <br>\r\n<br>\r\n      \" Don't be sorry Tom. Everybody does it when they first wake up in their new body. I am used to it. You should have seen what I did !\" Hayden says with a chestire grin.<br>\r\n<br>\r\n        You decide you could explore later and take the gown off , looking at your new and very female form in the mirror. You were tall, around 5'9\" and thin, but not bony. \" Kelsey took real good care of her body\" you state as you turned left, then right , admiring your new flesh. <br>\r\n<br>\r\n       Hayden soon handed you a pair of French cut panties, and you put them on wordlessly. Next came the bra, which Hayden explained to put on backwards and put your arms through after hooking it and spinning around, you did so attempting to memorize every step. Soon you see a light blue lacy thing that matched the bra. \" What is this thing \" you ask not really having a clue. <br>\r\n<br>\r\n      \" It's a garter belt. Its used to hold your stockings up.\" Hayden explains and helps you put it on, followed by the stockings themselves. Hayden showed you how to attach them. She then hands you a light blue blouse and chuckles at you when you can't figure out how to button it. \" Most womens clothing are backwards to mens when it comes to buttons and zippers.\" Hayden states. \" The buttons go to the inside.\" she adds. <br>\r\n<br>\r\n       Once you figure out how to work the buttons with your light blue painted nails, Hayden hands you a skirt with a slit up to mid thigh on your left leg. She helped you put it on an situate it so the blouse sat just right . Finally came the belt with a large silver belt buckle , and a pair of four inch stiletto pumps. You remembered Kelsey loved to wear high heels to make her already tall frame for a woman taller. She enjoyed towering over most men, and at least being eye level to others.<br>\r\n<br>\r\n      \" How am I going to walk in these? \" you ask incredulously as you hold the heels out for Hayden to see. \" I've never worn high heels in my life.\" you add.<br>\r\n<br>\r\n      Hayden smiles and says \" Just try. You might surprise yourself.<br>\r\n<br>\r\n     You give her an unsure look and try it anyway when she says \" Trust me. Try it.\" with confidence. <br>\r\n<br>\r\n    You sit the shoes on the floor and are surprised to see your right foot slide into one with no assistance and then the left stocking clad foot do the same. Holding on to the bed you take one tentative step and then another.<br>\r\n<br>\r\n     \" Walk across the room Tom.\" Hayden commands , and you swallow your fear attempting to do just that. Before you know it you find that you had not only crossed the room and back, but you did so with out a hitch. \" H... how can I do that? \" you asked.<br>\r\n<br>\r\n       \" Muscle memory and mannerism implant.\" Hayden answers as you look back at her confused. \" You can't be Kelsey if you don't move like her silly. Part of the procedure to swap peoples bodies is to copy the part of the brain that controls muscle memory and mannerisms. \" she states matter of factly.<br>\r\n<br>\r\n      You choose to believe her , mostly because you don't think you would understand any more than the most basic information about it and simply say <br>\r\n\" Oh.\"<br>\r\n<br>\r\n       Hayden pulls out a small chair from the vanity in the room and tells you to sit down so she can do your makeup. When she is finished you look at your reflection and see Kelsey as she would be on any given day at work. Her hair pulled back in a messy up-do , the streaks of grey and strands of silver only adding to her distinguish. Hayden had applied a light blush and light blue lipstick and eyeshadow to your face. The pearl necklace and earrings making you look exactly like what you are now... a good looking forty nine year old woman. <br>\r\n<br>\r\n       \" I look exactly like her!\" you exclaim surprised at the woman reflected back at you. \" I am Kelsey now.\" you state in awe.<br>\r\n<br>\r\n        \" Yes you are. It's the least I could do for you after what I did to you Tom. I'm sorry.\" Hayden says.<br>\r\n<br>\r\n       \" What are you talki...\" you stop when it hits you. \" This was your body.\" You state flatly. <br>\r\n<br>\r\n       \" Yes it was. Its yours now though. I am actually enjoying my new life and will help your enjoy yours too Kelsey. Here are the rest of your things. \" Hayden says as she pulls a purse from the rooms closet. \" Your new purse containing your drivers license , your cell phone with my number programmed into it if you have any questions, your social security card, and your car keys. \"<br>\r\n<br>\r\n        \" You took the purse , not knowing what else to do and ask, \" Why would you sell me your body Kelsey?\"<br>\r\n<br>\r\n        \" Because I am ashamed of what I did to you. I wanted to make it up to you and when you walked in looking for work I knew how to. I took your life from you, so you are welcome to mine.\" the former Kelsey said with watery eyes.<br>\r\n<br>\r\n         \" Thank you.\" you say and wrap the younger, shorter blonde in a tight hug, tears threatening to escape your eyes also. \" I am sorry I hated you. I should have known you didn't want to fire me.\"<br>\r\n<br>\r\n         After the little emotional scene Hayden shows you the exit and says \" I guess this is it Kelsey. I hope you have a good life.\" as she tells you as you sit in your new Mercedes. It was odd getting in a car new to you and not having to adjust your seat. \" What are you going to do first?\" she asks.<br>\r\n<br>\r\nWhat will you do?<br>\r\n<br>\r\n       <br>\r\n</span></div></div>",
            "created":1509426000,
            "id":2409282,
            "title":"Kelsey Cable, the woman who fired you from the ..."
        },
        "14211":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "You explore the house more",
                "You begin trying on your new clothes",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>       \" I think I will go check out my new home.\" you say as you run your new slim feminine fingers along the curve of the steering wheel. <br>\r\n<br>\r\n       \" I think that is a good idea Kelsey. I've had the neighbor keep the mail checked and your key is under a fake rock by the walkway. Good luck Kelsey and enjoy your new life.\" Hayden responds.<br>\r\n<br>\r\n       You roll the window up and smile while waving at her as you drive away, not even noticing that you have kicked off your heels and are driving barefooted. You follow the GPS directions, and soon come to an upscale neighborhood of townhouses built beside the city park. \" Wow!\" you say out loud as you see your new home for the first time. \" She must have paid half a million for that..I mean I must have paid half a million...\" you say , just now realizing how much better off you were in Kelseys body than your own. You may have lost a dozen years, but it was worth it to you to be financially stable like Kelsey.<br>\r\n<br>\r\n        Once you parked in the driveway, you get out of the car after placing your heels back on your small feet and you slowly made your way down the walkway to the front door. You looked around and quickly find the fake rock Hayden mentioned and retrieve the key. Placing it into the lock and turning the key, the door softly swung open into a cool , air conditioned large room , filled with expensive looking furniture. \" Welcome to your new life Tom.\" you said aloud.<br>\r\n<br>\r\n       When you walked around the room you saw an open doorway that led into a large kitchen, flanked by a large dining room. There was an open bar dividing the two, with a wine rack filled with bottles and names you couldn't pronounce. You place your purse and keys on the counter and decided to get a better feel of the rest of the house. In every room there were things you could not hope to afford in your old life , but it appeared to be chump change to you now. \" If all I had to do to get this was become a woman I would have traded bodies with Kelsey a long time ago..\" you say as the main stairs caught your eye. \" I'll bet my new bedroom is up there. \" You say as you grip the banister and proceed to ascend the stairs.<br>\r\n<br>\r\n     Your eyes open wide once you topped the stairs because the second floor appeared just as expansive and well furnished as the first. Soon you come to an open doorway that had a tastefully decorated bedroom in it. You see a large queen sized bed and several dressers, a makeup vanity with more makeup than you've ever seen. As you begin looking around the room you see two doors. You walk to the first one and open it. Inside you see a massive master bathroom with separate bath and shower, even the toilet was situated in its own little room to the side. \" Well I guess I won't have to worry about stinking the whole place up when I take a shit! \" you say, and let out a girlish giggle at hearing Kelsey use such language.<br>\r\n<br>\r\n     You decide to check the other door in the bedroom and see that it is the closet. \" Holy Fuck! \" you exclaim as you check out your new closet. \" This thing is huge. It's bigger than my old bedroom!\" you add seeing the size of it. The closet was indeed big, being the size of a mid sized living room in most houses and being divided by four dual upper and lower bar clothing racks that appeared to be organized by season. The tops containing shirts blouses and dresses, and the bottom tier skirts and pants, all separated by color. On the back wall were shoes... any style and color shoes you could think of. It was five layers high and they were separated by heel height , and style. You made your way back towards the shoe rack and you are surprised to see yet another room with a comfortable looking chair , a full length mirror, and a small table next to it, so Kelsey could judge her outfits. \" This isn't a closet.. Its a clothing boutique! \" you say and then add, \" ... and its all mine!\" <br>\r\n<br>\r\nWhat next?<br>\r\n</span></div></div>",
            "created":1509685200,
            "id":2410590,
            "title":"Go check out your new home"
        },
        "15":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Emma Watson",
                "Jennifer Aniston",
                "Selena Gomez",
                "Katy Perry",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>    \" Uhm...Oh! I'm sorry!\" You say shaking the surprise off. \" I'm Megan Johns.\" you say while extending your hand. \" It's very nice to meet you Miss Panetteire. I'm a big fan.\" You tell the 'Nashville' star.<br>\r\n<br>\r\n     \" Thank you for saying so. To be honest though it's almost like it wasn't work for me. Like I wasn't really even there.\" she responds while returning your handshake. \" What can we do for you today here at FDBSE?\" she asks you.<br>\r\n<br>\r\n     \" I saw the help wanted sign out front and wanted to apply?\" you answer her.<br>\r\n<br>\r\n     Both of Haydens' eyebrows shot up and her mouth formed an 'o' shape before she asked \" You want to be a Henchman for us?\"<br>\r\n<br>\r\n      \" Yes I guess?\" you say a little confused. ' There was that word again.' you think, ' They couldn't actually mean henchman... could they?\" <br>\r\n<br>\r\n      \" Yes we mean an actual henchman Miss Johns. \" Hayden answers your unasked question. \" Don't worry I am not a mind reader. If you only knew how often I get that question.\" <br>\r\n<br>\r\n       \" Mrs.\" Megan corrected. \" I'm married.\" you try to say without seeming snobbish.<br>\r\n<br>\r\n         \" My mistake Mrs. Jones. I apologize.\" Hayden responds.<br>\r\n<br>\r\n       \" Don't worry about it. \" You accept her apology. \" I wouldn't be doing anything illegal would I?\" you ask even as the thought of it exited you.<br>\r\n<br>\r\n         \" That would depend on how you define illegal.\" Hayden answers with ambiguity that pointed to ' Yes. What we do is highly illegal' without actually saying it. \" Would it bother you if it was?\"<br>\r\n<br>\r\n          The thought of a life of excitement within arms length made you giddy. You tried not to let it show as you answered \" Depending on what it was ... no it wouldn't.\"  <br>\r\n<br>\r\n          \" In that case , you should know our henchmen have never been caught and it would be impossible to prosecute them if they were.\" Hayden adds.<br>\r\n<br>\r\n        You weren't sure how that can be true, but if what little you heard about FDBSE were true , then it could be possible.<br>\r\n<br>\r\n           \" Are you still interested in the job? Do you know what we do here?\" Hayden asked.<br>\r\n<br>\r\n           \" I've heard, \" you pause thinking about your answer and decide to just go with the truth, \" I have heard, and this is just rumor, that you sell people bodies of anyone they wish to be. That if someone has enough money they can become anybody else. Actress, Socialite, their personal rival, or the soccer mom down the street... and if that is true , yes I want the job.\"<br>\r\n<br>\r\n           Hayden looks you over one more time and says \" Good. Rumors are all we want anyone to hear. Your hired.\" with a smile.<br>\r\n<br>\r\n          \" Wait that's it. No interview? \" you say astounded.<br>\r\n<br>\r\n         \" That was your interview honey. I am a henchwoman too and I am authorized by the Duchess , whom you will meet later, to hire other henchmen. I will call the R and D leader and have her escort you upstairs. The only question is ... who would you be if you could ?\"<br>\r\n<br>\r\n         You thought for a moment and then say \" I want to be...\"<br>\r\n</span></div></div>",
            "created":1508994000,
            "id":2406682,
            "title":"Megan Johns"
        },
        "152":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "It worked and you wake up in Jennifer Anistons body",
                "It works, but Rolenet awakens too in your old body",
                "It doesn't work and Rolenet escapes"
            ],
            "content":"<div class=\"\"><div> <span>    You think about it for a moment and say \" If I could become anyone I wanted to ,\" you pause a heartbeat drawing it out a little to make it look like it was a hard choice, \" If I could be anyone I wanted to then I would be Jennifer Aniston.\" <br>\r\n<br>\r\n    \" You are in luck Megan.\" Hayden says with a smile, \" Normally when we hire new henchmen we tell them to come back tomorrow while we collect their new body, but we actually have Jennifer in stock. Of course this procedure may be a little more complicated than normal\" she adds.<br>\r\n<br>\r\n     Her answer both excites and puzzles you. \" Why is that ? \" you ask. <br>\r\n<br>\r\n     \" A while back we had a problem with a rogue A.I. program. The head of research was actually using Jennifer as her host at the time, but the A.I. took it from her in exchange for another body. Long story short, it caused a little mischief and trapped the Duchess in a body for life before we could contain it. Since then the research leader has taken a new body for herself and has been looking for a way to separate the A.I. from Jennifers body. She is a high value commodity y'know.\" Hayden explained. <br>\r\n<br>\r\n      Haydens story gave you cause for concern, that it's possible this was a scam, but you pressed on. \" Will it be a problem?\" you ask, considering whether or not just leaving.<br>\r\n<br>\r\n      \" Oh no. It won't be.  The R and D division has came up with a solution, we were just waiting for someone to request that body. Are you still in?\" Hayden clarified.<br>\r\n<br>\r\n      \" Yes of course I am. I am so ready to leave my old life behind. When can we start? \" you answer now that your concerns were alleviated.<br>\r\n<br>\r\n      \" Give me just a second to call an escort for you and we can have you in your new body by lunch. \" Hayden answered with a smile.<br>\r\n<br>\r\n      \" Okay. \" you say, just as Hayden picks up a phone from her desk and asks for ' Dr. Middleton' . You politely attempted not to eavesdrop, but standing three feet from the celeb made that near impossible.  When she gets who she is seeking on the line , Hayden states that she has hired a new henchman that is <br>\r\n\" willing to replace the RoleNet.\"<br>\r\n<br>\r\n        At this point you would give anything to hear the other end of the conversation, but you made do listening to Haydens end of the call. ' RoleNet?' you think to yourself. ' What is the RoleNet?' you ask in your mind. ' Is that the computer A.I. Hayden mentioned earlier?' Your thoughts are brought back to the conversation when Hayden said. \" I'm telling you Pippa, this is the one.\" while she was listening to whatever response the other person gave, your mind wondered to the new question you have.<br>\r\n<br>\r\n         ' Pippa?' you thought to yourself, ' surely that is just a nickname for the Dr. Middleton that Hayden was speaking with. They couldn't actually have Pippa Middleton working here ... could they?' Your thoughts were once again interrupted when Hayden tried to get your attention. \" Mrs. Johns? Yoohoo ! Earth to Mrs. Johns.\" <br>\r\n<br>\r\n          \"Yes, oh I'm sorry, I was... ah.. daydreaming.\" you say weakly attempting to cover up what you were really thinking about. You were thinking so hard that you had not noticed that Hayden had ended the call and had tried to gain your attention a couple of times already.<br>\r\n<br>\r\n          \" No you weren't. You were trying to piece together information from your eavesdropping. \" Hayden prodded cheekily. \" It's okay to ask you know. Your gonna find out everything as a henchman at FDBSE.\" she added.<br>\r\n<br>\r\n         You figured you were caught so you gave in. \" Sorry, I didn't mean to listen in...but.. that person you were talking to , Dr. Middleton.\" you begin while Hayden looked at you like she not only knew where you were going with the question, she looked like she expected it.<br>\r\n<br>\r\n       \" Yes.\" she stated calmly.<br>\r\n<br>\r\n        \" Uhm...\" you nervously began, knowing how ludicrous it sounded, \" that wouldn't be...\" you stopped when the elevator directly behind Hayden dinged and the doors opened to reveal the very same person whom you were about to name. Pippa Middleton.<br>\r\n<br>\r\n        As she approached you with an out stretched hand , she asked \" Are you Mrs. Johns. \" when you speechlessly nodded yes and stuck your own hand out for her to take she grasped it in a handshake. \" It is very nice to meet you Mrs. Johns. I am Dr. Phillipa Middleton , vice president and lead scientist of FDBSE. My friends just call me Pippa though.\" she said warmly. \" I understand you are going to be our new henchman and are willing to replace the Rolenet program as Jennifer Aniston.\"<br>\r\n<br>\r\n      You quickly shook the shock of having a once in a lifetime meeting with a celebrity for the second time in fifteen minutes and said \" Yes I am. Should I be concerned?\" while looking back at Hayden. Turning back to Pippa you add, <br>\r\n\" There seems to be a little feeling of anxiousness in the air when someone brings that up.\" you state. \" Almost like no one is sure what will happen.\"<br>\r\n<br>\r\n      Pippa smiles and says, \" Hayden picked a good one this time. You are very good at reading people. You'll need that in this line of work. \" She reaches up and places a hand on your arm and looks you straight in the eyes when she says, \" Don't worry Mrs. Johns. Everything will be fine. Everyone here just gets a little nervous when the RoleNet is mentioned. She created a lot of chaos here, and I wouldn't perform the procedure with you if I weren't absolutely certain it would work. No one here has more to fear than myself and the Duchess if she were to get loose again, seeing as we were the ones that trapped her.\"<br>\r\n<br>\r\n      Pippas' statement had a calming effect on you and you responded with \" Well <br>\r\nokay then ! Let's do this !\" excitedly.<br>\r\n<br>\r\n      \" Alright! That's the spirit Megan. Follow me.\" Pippa says to you before turning to Hayden. \" Hold all my calls. You know what can happen if I make a mistake because I was disturbed.\" sternly.<br>\r\n<br>\r\n       You followed Pippa into the elevator , where you rode it to the 100th floor, and had to take another one forty-nine more floors up. \" This building has a hundred and fifty floors, with the top one being the Duchess' apartment.\" she states as she steps off and leads you to a lab.<br>\r\n<br>\r\n      Inside you see various computers and cables hooked up to two pods. One is open while the other is closed. While Pippa is typing away at a computer on the open one you look in the window of the closed one. Inside you see the face of Jennifer Aniston wearing some sort of tech headband, the one you were hoping beyond hope to be wearing soon, seeming to be sleeping peacefully. Pippa spoke up while you peered in at your future form. \" That really is a wonderful body, I should know, I wore it myself for a while.\"<br>\r\n<br>\r\n      \" Why have you not reclaimed it for yourself if you don't mind my asking?\" you question her. <br>\r\n<br>\r\n      \" That's okay, its a fair question. Two reasons, first we were scared to mess with the containment of the Rolenet. It is nearly omnipotent . It can change anything... including reality. The Duchess was able to trick it into a suspended animation pod just after it trapped her forever in my sisters body.\" <br>\r\n<br>\r\n       \" What a minute...Are you saying that Kate Middleton is the Duchess of FDBSE? \" you ask incredulously. <br>\r\n<br>\r\n       \"Oh no. The Duchess has her original body though. Thanks to the RoleNet. It gave her that body and then changed reality to make the world think it was always hers. When you finally meet her you won't recognize her but you will have the feeling you should... unless she has used a bodyhopper amulet to body hop someone.\" Pippa said seeing the confused look on your face. \" Its another service we offer here, you'll see soon enough. Now I need you to climb in this pod and place the headband located within on your head.\" she added.<br>\r\n<br>\r\n       \" How is this going to work ? \" you ask even as you follow her orders.<br>\r\n<br>\r\n       \" Since we can't risk waking the Rolenet up, I am going to place your body in suspended animation just like Jennifers, then I am going to use a supercomputer to download your mind into its databanks and then transfer the RoleNet into your body to make room to upload you into Jennifers. For you it will be like you went to sleep and woke up in a new body.\" Pippa explains.<br>\r\n<br>\r\n        You put the headband on and say, \" Okay. I'm ready.\" as you accept her explanation and lay back. Pippa presses some buttons and the lid to the pod closes over you, then you feel suddenly feel drowsy , unable to hold your eyes open anymore...<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\n<br>\r\n<br>\r\n      </span></div></div>",
            "created":1509166800,
            "id":2407716,
            "title":"Jennifer Aniston"
        },
        "1522":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Follow the new Jennifer",
                "Follow the new Megan",
                "Find out what Rolenet is doing"
            ],
            "content":"<div class=\"\"><div> <span>      Some time later you slowly feel reality coming back to you. You knew you were laying down as you begin to regain consciousness , but not how long you were out or where you were now. Your body senses were telling you that you were no longer in that claustrophobic body swap chamber. Blinking your eyes open you find that you are laying on a cot with a leather mattress in a medium to dim lit room. Gathering your thoughts you try to speak for the first time. \" Did it work?\" You ask , getting immediate confirmation from the sound of your own voice. \" Am I in Jennifer Anistons body now?\" you say as you note the differences between your old voice and the new sound your mouth creates. There was a distinct unplaceable Northern accent there as well as a different tone. Growing up in Alabama, you could easily tell this was not the way that Megan Johns should sound.<br>\r\n<br>\r\n      Once you take a moment to feel the sensations your new body was giving you, including running your tongue around the inside of your new mouth, it becomes very apparent that you are no longer Megan Johns. Sitting up and swinging your feet to the floor, you take notice of the white pants and heels your legs and feet are now wearing. Along with the orange top, and the earrings you now feel dangling from your new ears you know this is not your body. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www.biphoo.com/article/wp-content/uploads/2016/10/Jennifer-Aniston-sexy-images.jpg\" target=\"_blank\">http://www.biphoo.com/article/wp-content...</a><br>\r\n<br>\r\n     You look around the room to try and figure out where exactly you are when you notice that there are small yellow emergency lights flashing yellow from time to time. \" What is going on? \" you ask , wondering why no one was in the room to explain anything to you when you awoke. There is a mirror hanging on the wall opposite the bed and the woman in the reflection that is matching your movements appears to be Jennifer Aniston, so that is one question answered. \" Did something go wrong? It looks like I have her body now, but this is weird waking up alone like this.\" You tell your reflection.<br>\r\n<br>\r\n       At that very moment the only door in the room opened , and a very familiar voice answered your question. \" That depends on which part of your procedure you are referring to Mrs. Johns.\"<br>\r\n<br>\r\n       When you got a look at the person the voice belonged to as she stepped into the room , your jaw would have hit the floor if it was physically capable of it. It was YOU! Or at least it was your body. It took you a moment to recognize that fact, because she was dressed in expensive clothes that you could only dream of being able to afford. She was wearing a dark blue Donna Karen dress, and Christian Louboutin heels. Her hair was different from how you wore yours , done up in a chignon, and her makeup was applied better than you remember the best makeover you ever had. In the 36 years you wore that body , you never looked that good.<br>\r\n<br>\r\n       Finally able to recover from seeing someone else wearing you better than you ever did, you stood up and walked towards the woman wearing your face and said \" Well it appears that you are Mrs. Johns now. Somehow I don't think that was part of the plan.\" You state as you begin to circle your old body. It felt surreal to talk to yourself in a literal fashion. \" What happened? Who are you?\" you ask.<br>\r\n<br>\r\n       \" I was Pippa, \" your former body starts, \" but when I performed the swap the AI awoke before I could put your body into permanent stasis. It wasn't happy about losing that body, or how the Duchess and I defeated it the first time, so it stole mine. She told me that if I wanted to steal her body and give it to some housewife, then it would only be fair for me to become that housewife instead. \" she explained.<br>\r\n<br>\r\n      \" Well it seems you have adapted very well. I don't think I have ever looked that nice.\" you tell her, with a slight bit of jealousy.<br>\r\n<br>\r\n       \" I have no other choice Megan. Rolenet made it so I can't swap bodies again. It seems she wants to punish me.\" Pippa said, before adding \" You should call me Megan from now on Ms. Aniston. After all that's who I am now.\"<br>\r\n<br>\r\n      You stared into you own blue eyes for a moment before thinking of something to say, but all you could think of was \" I'm sorry.\" Even then it was said half-heartedly. You had gotten what you wanted , and even though Pippa had been saddled with a life you no longer wanted, you couldn't find much empathy for her. From your understanding Pippa had created the monster known as Rolenet, so it was just a case of her own actions biting her in the butt. Still you knew you shouldn't feel that way.<br>\r\n<br>\r\n       \" Don't worry to much about it Jenn. Its not the first time Rolenet took my body and it may not be the last. \" She said before taking your hand and leading you to the cot to have a seat. <br>\r\n<br>\r\n        You found it amazing that she moved like a woman of high upbringing in your old form , even sitting with her ankles crossed like a socialite like Pippa was. Yet she spoke with a deep South accent as if she had been born and raised in Mobile high society, unlike you did in that body.<br>\r\n<br>\r\n          \" Now I have to tell you that it has been a week since your swap, and that we are only now awakening you because we believe that Rolenet won't come for you. She has too much fun messing with the Duchess and I , and probably wont be back until she thinks she can play her jokes on us for a while.\" The former Pippa , now Megan said. \" In that time I have assumed your life, with some changes to suit me of course. Your husband wasn't happy with me taking a job at FDBSE , an threatened a divorce. \" She tells you , actually surprising you. \" Don't worry, your children don't know yet. I know you no longer cared for this life, but I also know you do care about your babies. Even though we had intended to sell your body and life to someone who wanted to be a loving mother and wife, I will make sure that they never know their mother left them. I will do my best to make sure they feel your love, even if you aren't their mother anymore.\" <br>\r\n<br>\r\n          \" That's good to know Megan.\" you tell her still trying to used to addressing someone else as your former identity, \" but there is a reason I left. Yes I do love my babies, but I could no longer be their mother. There was a reason I agreed to this swap in the first place... I wanted out. I know that makes me a terrible person, to want to run away from my children , but it was true. Its your life now... good riddance to it. Who knows maybe that AI did you a favor and gave you something you didn't know you wanted. \" You tell your shocked replacement.\"<br>\r\n<br>\r\n        \" I...I .... don't what to say about that!\" said a dumfounded Pippa. She was most likely trying to figure out how a person could possibly feel that way about her life. <br>\r\n<br>\r\n       \" Don't bother Megan, \" you say taking glee that you were now Jennifer Aniston, and not some housewife and mother of three anymore. \" It's your life now. Do what you want to with it. \" you state. \" Now do I have an office here or do I just resume Jennifers life?\" you ask as you stand up and head toward the door without waiting for an answer.</span></div></div>",
            "created":1524349800,
            "id":2482617,
            "title":"It works, but Rolenet awakens too in your old body"
        },
        "15221":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Check the computers",
                "Follow the new Megan",
                "Readers Choice",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>      \" Well you have an office here.\" the new Megan responded. \" In a way you are resuming Jennifer's life. When I first took that life, I immediately retired from acting and accepted a job here. As far as the world knows 'Jennifer Aniston ' has worked here for quite some time as head of Celebrity Talent Aquisitions.\" Pippa answered.<br>\r\n<br>\r\n       \" Celebrity Talent Aquisitions... ? What does that mean Megan? \" Jennifer asked confused. \" How can I already be a department head? \" she added.<br>\r\n<br>\r\n       Megan smiled as she answered, \" To put it bluntly Jennifer, you are a world famous actress. Your basically bait to lure other celebrities here so we can steal their bodies. As the current Jennifer Aniston that job belongs to you now. I never really cared for it. My heart is in research and development. Seeing as how I'm Megan Johns now, I also have a body better suited to be behind the scenes. \"<br>\r\n<br>\r\n       Megan pointed to a door across the room and said \" There is a change of clothes in the closet. Much better suited for your new position at FDBSE. If you would like to change I can show you where your office is and let you get situated so you can get to work Jennifer.\"<br>\r\n<br>\r\n       \" I would like that very much ,\" Jennifer stated. \" No better time than now.\" <br>\r\n<br>\r\n       \" Good . I'll just give you some privacy. When your done I will be outside. \" She said as she motioned her head to the door. \" Take all the time you need.\" She added as she crossed the room .<br>\r\n<br>\r\n       \" Okay .\" Jennifer answered to the back of her old body, selfishly taking a moment to glance at the retreating figure and take in some of the differences of it and your new body. She still couldn't get over how much more elegant Pippa wears it than she did. As she stepped out and closed the door you noticed something that the new Jennifer commented out load on as soon as the door shut. \" Damn. I can't believe I let my ass get so big.\" While she subconsciously began rubbing her new derriere with both hands. After a beat she added, \" Still I was pretty hot for a thirty-five year old mother of three!\" <br>\r\n<br>\r\n        As she began to let her hands roam her stomach and eventually her breasts, grabbing both in her new hands at the same time , the thought occurred to her that she is actually fifteen years older now. \" These still feel pretty good for a fifty year old. I wonder if this body had any work done?\"<br>\r\n<br>\r\n       Jennifer crossed over to the door indicated , feeling that she would have plenty of time to explore her new body later, and found a professional looking sleeveless , cream colored dress with a strappy set of silver four inch heels. Also in the bag with the dress were a pearl necklace and earrings, a beautiful gold ring and a silver watch. All of it looked more expensive than a years pay in her old job as a substitute teacher at her kids school in her old life. Megan now Jennifer just touched the items with reverence before shaking the awe out of her head. \" It's not even a days pay anymore ! Because I am Jennifer FUCKING Aniston now!\" she said with joy as she pulled the items form the closet and carried them to the bed she had awoken in. It didn't take her very long at all to get changed her excitement was so great at the new and exiting life she believed she would be living. This Jennifer wasn't the meek housewife she was in her old life... this Jennifer was going to life her new life to the fullest.<br>\r\n<br>\r\n      A short time later Jennifer was stepping out into the corridor to find Megan waiting for her. \" All set? I thought you might take longer. \" she quizzically stated. <br>\r\n<br>\r\n     \" Oh don't worry Megan . I will in due time. I wanna jump into my new life first. \" Jennifer responded.<br>\r\n<br>\r\n     \" Well don't take too long on that. \" Megan stated. \" I know from personal experience how wonderful sexual gratification can be in that body. It is like never ending heaven as long as you can go!\" She added with a twinkle in her eyes.<br>\r\n<br>\r\n      Before Jennifer could parry verbally , Megan became serious . \" If you'll follow me , we can get you situated.\" With a simple nod Megan turned on her heel and lead Jenn down the hallway , past the elevators to a small private elevator. <br>\r\n<br>\r\n     \" This is the only elevator that goes all the way up,\" Megan said as she pulled a security card from her small purse and swiped it. \" It is only used by authorized employees, such as department heads and their assistants. It is the only one that will take you to the floor where your office is located. You are second floor from the top, and will share the floor with myself and two other department heads. The floor above is the Duchess' residence and office. \" When the doors opened she stepped in and motioned for you to do the same. \" I will make sure your credentials and security clearance is on your desk within the hour. \" For the next full minute the two ladies rode silently as the elevator rose. <br>\r\n<br>\r\n      When the doors opened Jennifer took stock of the corridor and the offices with names on them. Megan lead her down the marble floored executive level and named each office occupant.  \" That's Stacy Keibler, our body hopper. She is in and out constantly. You may see her real face maybe twice a week.\" Megan said as Jennifer peered into the window of the suite. <br>\r\n<br>\r\n      \" Um what's a body hopper? \" Jennifer asked.<br>\r\n<br>\r\n       \"A bodyhopper is a being that can turn their own body into a goo like liquid that the hopper can force into a host, or what we call a 'Mount'. Normally they are men , but Stacy is special. In her previous life she was a man. When the Duchess began this company she hired all three of us at the same time. I was her 'tech guy' but really I'm more of a mad scientist. I performed a brain transplant on him giving him Stacys body for life. It turned out that the new Stacy was able to retain her powers in her new body.\" Megan explained.<br>\r\n<br>\r\n       \" The office across from her is Mallika Sherawat. Basically she is a witch , and mistress of the dark arts. She uses spells to swap into and aquire bodies. \" Megan stated before showing you her door. \" This is me, and that one belongs to you. \" she said as she handed you a key. \" Go ahead . Check it out.\"<br>\r\n<br>\r\n        Jennifer shakily took the key from Megan and opened the door. The room was dark, but she quickly found the light switch beside the door. As she slowly entered what Jennifer saw amazed her. She had a whole corner of the FDBSE tower as her own , and the suite was bigger than the house she lived in when she was Megan. Seeing her deck she strode across the room and tried her new chair out. \" Are you saying this is all mine?\" she asked unbelieving.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://jennifer-aniston.org/gallery/displayimage.php?album=691&amp;pid=41284#top_display_media\" target=\"_blank\">http://jennifer-aniston.org/gallery/disp...</a><br>\r\n<br>\r\n         \" Yes it is Jennifer. Go ahead and get yourself acquainted while I take care of some business. \" Megan said as Jennifer stared out the window , that was much higher than she thought . Jennifer quickly spun around before Megan had a chance to leave. \" How high are we exactly?! It looks way up there. Much taller than the building looks on the outside.\"<br>\r\n<br>\r\n          \" One hundred and ninety-nine stories up Jennifer. I know it is much higher than it looks. I designed it that way, Now I really have other matters to attend to. Check your computer. The password is brainswapped1. One word. \" Megan said and quickly exited.<br>\r\n<br>\r\nNow what?</span></div></div>",
            "created":1567929300,
            "id":2714902,
            "title":"Follow the new Jennifer"
        },
        "155":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Salma Hayek",
                "Kate Upton",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Okay more choices...</span></div></span></div>",
            "created":1508994000,
            "id":2406683,
            "title":"other"
        },
        "1551":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "yes",
                "No, Jennifer Lowrance",
                "No , You want to be Katie McGrath"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yes, or more choices.</span></div></span></div>",
            "created":1508994000,
            "id":2406684,
            "title":"Salma Hayek"
        },
        "15513":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Yes",
                "No, Nina Dobrev",
                "No, You want to be Ivanka Trump"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yes or no?</span></div></span></div>",
            "created":1508994000,
            "id":2406685,
            "title":"No , You want to be Katie McGrath"
        },
        "1552":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "yes",
                "No, Brooklyn Decker",
                "No, Chanel Iman"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yes or no?</span></div></span></div>",
            "created":1508994000,
            "id":2406690,
            "title":"Kate Upton"
        },
        "1553":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "A different Celebrity",
                "Someone Local",
                "A political figure"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>   You think about who you would become if you could swap places with them and say...</span></div></span></div>",
            "created":1508994000,
            "id":2406687,
            "title":"Who then?"
        },
        "15531":{
            "author_id":"napo08",
            "author_name":"napo08",
            "choices":[
                "Shakira",
                "Sofia Vergara",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these celebrities?</span></div></span></div>",
            "created":1560027780,
            "id":2670504,
            "title":"A different Celebrity"
        },
        "15532":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Race Change Body Swap",
                "Age Regression Body Swap",
                "Age Progression Body Swap"
            ],
            "content":"<div class=\"\"><div> <span>     When faced with all the choices of who you could become you rule out becoming someone famous. You didn't want the scrutiny or the hassle. Of course you wanted to try a life that was completely different from your own but you wanted to remain in Springfield. \" I think I would like to try ...\" you begin as you made your choice.</span></div></div>",
            "created":1512190800,
            "id":2423046,
            "title":"Someone Local"
        },
        "155321":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "The Airport, you wanted a foreign body.",
                "The Ghetto... you want to become a Beautiful Black Sista.",
                "The business distict... you want to become a powerful woman"
            ],
            "content":"<div class=\"\"><div> <span>    Megan thought about her life and how boring it was. She thought this was the best life she could possibly live, having been born as a red headed, blue eyed, White woman. Becoming a housewife and mother was what was expected of her. Sure she could have attempted to be more , but only if she were to thumb her nose at her traditional values family. Her destiny until this point was to basically be a wife who taught Sunday School and raised a family. Sure she was proud of her daughter and two boys and loved Baptist minister husband, but she wanted some excitement in her life and was willing to walk away from it all to get it. Making up her mind that she was going to steal the life of someone of a different race or ethnicity, she looked at Hayden and asked, \" Is there a way for me to swap with someone outside of this building?\"<br>\r\n     <br>\r\n    Hayden smiled and reached under her desk , pulling out what appeared to be a cheap plastic squirt gun. \" Yes. Yes there is. Is there a particular someone whom you know that you would like to become? We can just send a couple of minions to bring them in if that's the case.\" she asked.<br>\r\n<br>\r\n   \" I can't tell you a specific person. I'm sorry... all I know is that I will know them when I see them.\" you responded before adding.\" I think I would like to become someone from a different country and ethnicity, or maybe just someone from around town. It's...well I don't really know. I'm like a kid in a candy store at the moment.\"<br>\r\n<br>\r\n    \" Calm down Mrs. Johns. I know exactly how you feel. I was a six and a half foot tall Black man before I discovered this place and settled down into the petite Blonde body I have now.\" Hayden said as she winked . \" I feel like the woman I should have always been now. I am sure you will find a form to match your true self too.\"<br>\r\n<br>\r\n    \" Wow!\" Megan replied. \" I hope so. I know I wasn't really cut out for the life I have now. I was meant for more.\" she said confidently. <br>\r\n<br>\r\n    \" Here, \" Hayden said as she extended her hand with the toy gun out to you, \" This will give you the life you want. It is an original invention of FDBSE just for people like you. We call it the Spirit Separator. When you find the body you want to live in just point and fire.\" Hayden explained.<br>\r\n<br>\r\n     \" Won't it be dangerous to have some random person wind up in my body with a body swap gun?\" You ask , thinking about the chaos that could ensue.<br>\r\n<br>\r\n     \" Its a variation of a body swap ray we once developed, with safeguards added of course.. We had a lot of trouble putting that genie back in the bottle.\" Hayden stated. \" This will expel the targets mind from their body and replace it with yours. You will have just enough of their memories to pass as them but their soul or spirit will not be there. It will also leave your body as an empty husk , programmed to return here with the device immediately. Once it arrives we will take it down to our inventory , where it will be placed in stasis until it is sold to someone who wants your life. Everybody wins...except the target of course.\" she added almost offhandedly.<br>\r\n<br>\r\n      You take the offered device from her hand and wonder for a moment just who would want your boring old life, but the thought is gone almost as fast as it came. It didn't really matter , you decided. All you knew was that you were being offered the chance to become the person you wanted to be and that you darn well knew you were going to take it. \" Thanks Hayden. I don't know how I ever will be able to repay you. \" you say.<br>\r\n<br>\r\n    \" Just go and pick a good life for yourself. One that will make you happy. After all that is why we are here... to give people the life they always wanted. Take your time and pick well. When you have come back and see me, and I will get you situated in your new job at FDBSE.\" Hayden responded as you turned to leave. After you make it out of FDBSE Tower, you decided to go to ...</span></div></div>",
            "created":1512190800,
            "id":2423096,
            "title":"Race Change Body Swap"
        },
        "1553211":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "European",
                "Asian",
                "African",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>For such a small town Springfield has a very large and busy airport. As you arrive there you see people of all races, colors , religions, and ethnicities coming and going. Which one do you go for?</span></div></span></div>",
            "created":1561869180,
            "id":2680502,
            "title":"The Airport, you wanted a foreign body."
        },
        "15532112":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "China",
                "Japan ",
                "Korean",
                "Ohters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You have decided to use the spirit seperater on an Asian woman. What particular region does she come from?</span></div></span></div>",
            "created":1561869360,
            "id":2680503,
            "title":"Asian"
        },
        "155321124":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "South Asian",
                "Pacific Islander",
                "Others?",
                "Others?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More areas of Asia</span></div></span></div>",
            "created":1561869420,
            "id":2680504,
            "title":"Ohters"
        },
        "1553212":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Back to FDBSE",
                "To her new home, to learn about her new life as Tanisha",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>    Later that day Megan had driven around for hours and had accidentally entered the ghetto. She knew she shouldn't be here, as she was taught at a young age that pretty White girls should stay out of this part of town unless they wanted to be raped and murdered. She knew it was a racist sentiment, but looking around at the run down buildings and the bars on all the windows she thought there may also be some truth in it. Nevertheless, she continued driving on, wanting to see what the big deal was. She had been driving for hours now and still didn't know who she would use the 'soul seperator' on. She had mentally listed and struck all her friends, mostly because their lives were too similar to hers. One by one Megan scratched everyone she knows off of her list. With that in mind, she drove deeper and deeper into the 'bad part of town' . <br>\r\n      <br>\r\n      Then something she didn't expect happened. The neighborhoods began to look nicer, and so did the houses. There were people in the yards and they were waving as she drove by. Of course she thought they only waved because they couldn't see through the tinted windows of her car, but she started to form an idea. <br>\r\n<br>\r\n\" I think I will become one of these women.\" Megan said absently. She stared with envy at the well dressed , dark skinned women. Megan herself couldn't easily tan because of her Irish ancestry, and these women were born with the color she would give anything for. That's when she saw her... the woman whose life she would steal... with perfect milk chocolate skin and a wonderful bright smile that shined.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://becomechic.com/wp-content/uploads/2015/06/Black-African-Girl-Street-Style-4.jpg\" target=\"_blank\">http://becomechic.com/wp-content/uploads...</a><br>\r\n<br>\r\n       Megan quickly parked her car on the side of the street opposite of the way the woman was walking, attempting to be inconspicuous. She waited in anticipation as the woman approached, her mind racing about what she was about to do. She was planning to make the swap as the woman passed her by, but was surprised to see her reach into her tan purse and pull out a set of keys. The woman must have known something was up with the suspicious car and she hit her key fob, causing the little old Honda Accord parked directly in front of Megan to blink its lights. <br>\r\n<br>\r\n    Megan knew her chance to have that beautiful brown skin as her own was slipping away as the woman opened the door, so she took a risk and opened her own car door and stepping out. As she aimed the toy gun at the woman she watched her open her mouth to scream, but no sound came out as Megan decided its now or never and pulled the trigger.<br>\r\n<br>\r\n     A weird blue glow surrounded the woman for a second and in that span of time Megan felt something odd going on in her own body. As suddenly as it started it was over, and Megan found herself on the street next to the old Honda, with one foot in the car. She looked around and saw herself standing next to her own car with a vacant look on her face... as if the lights were on, but no one was home. Megan couldn't stop herself from staring. It was so weird to see herself from another perspective... even though her mind asked her what she expected to happen. Soon enough her soulless former body lowered the apparent toy gun and stepped back into her car, closing the door and starting the engine. In moments her old form had pulled out into the street and sped off. <br>\r\n<br>\r\n     Meg just stood there, unsure if this was really happening. Unsure if it was a dream. Realizing that it is she climbed into the old Honda and pulled down the sun visor to find a small mirror on the back side of it. Staring back at her through dark brown eyes so different from her baby blues was the very same woman that she shot the soul separator at. Her face and skin a dark chocolate, and her hair in a permed semi-afro. Her new nose was a little larger and flatter, while her lips much fuller. \" H..Hi.\" Megan said to the reflection as she tested her new voice. She could feel her new heart beating... no...pounding ...in her chest as she heard a much more throaty lustful voice come out of her mouth. Her excitement combined with the previous owner of this bodys fear creating a euphoric high for her. \" I wonder who I am? \" Megan questioned using the stranger stolen mouth. She tried to scan her mind for memories, but exact details were slow in coming. She remembered Hayden telling her she would have enough knowledge to pass as whoever she became, but she would still be her own person. <br>\r\n<br>\r\n      Soon enough the name came to her as if it were an epiphany. \" Tanisha. Tanisha Reddick.\" she said. \" Well it is nice to be you Tanisha, I will enjoy you life.\" she said as she looked at her reflection in the mirror. Soon the new Tanisha decided to go to wherever the former owner of her new life was heading. Reaching into her purse Tanisha fished out the keys to the old Honda and started the ignition, pulling out into traffic and driving toward...</span></div></div>",
            "created":1513486800,
            "id":2429198,
            "title":"The Ghetto... you want to become a Beautiful Bl..."
        },
        "15532122":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "At the club",
                "Bcak to Hayden wondering where you are",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>   Tanisha had been heading home after making a stop to see one of her friends, Erica, to make sure they were still on tonight to go clubbing. Megan gleaned that piece of information from her memories once she had started driving the little Honda. The car was older, but clean and well kept and spoke a lot about the former owner Tanisha. Of course Meg found that she needed to concentrate on what she was doing and refrain from delving into Tanishas' memories too much while driving , having narrowly avoided a few accidents along the way. She also had to refrain from looking at her new face in the mirror or admiring the dark brown skin of her new hands  as she drove. While the actual drive was short , it felt like hours to Meg, as the anticipation of checking out her new African American form was a form of torture to her. She felt like a kid at Christmas that had been handed a present and told not to open it yet. By the time she arrived at the former Tanishas' residence she was practically vibrating in her seat. <br>\r\n    <br>\r\n    The house she found herself pulling into was actually quite large, not a mansion, but much bigger than her old house. It was well kept , and looked to be a leftover from the time before this part of the town had become the \"bad' and run down area. Possibly a doctors or a higher status persons house before the civil war. \" Wow!\" Meg said quietly as she gazed upon what Tanishas memories said was her home now, her new voice still unfamiliar to her new ears. \" I didn't know houses like this ever existed in Springfield.\" she said as another Tanisha memory popped into her head. Tanisha was an urban fashion designer that had made it big, and decided to move back to her old neighborhood to try and redevelop it. The old slaveowners plantation house was where she started. She wanted to make sure that he craftsmanship of the Black slaves who built it was not lost. After renovating it she worked with the NAACP to get it on the national registry of historical homes, and began a program to help young Black girls from the run down area built around it to accomplish their dream careers.<br>\r\n<br>\r\n    The Tanisha memories made Megan quickly get out of the car and walk up to the front door. They were a revelation to her because she had been taught and was her experience that the NAACP was nothing but a racist, lying, and politically motivated group that only wanted to beat down White people like Megan had spent her entire life as. She thought they were just a hate group, and never did anything to help anyone but themselves. Finding out that she was now a card carrying member of said group, both disturbed and exited her in ways she didn't understand. Fishing through her new purse she pulled Tanishas house keys out and unlocked the door. As she slowly stepped into her new home she heard the tell-tale beeping of an alarm system , prompting for a code before it was set off. Meg jumped in surprise at the sound but soon found herself pressing the combination code to disarm it with her delicate ebony fingers. Smiling that it was that easy to call upon her bodies memories to do so , she sat her keys and purse on a beautiful table beside the door and closed it. <br>\r\n     <br>\r\n    Warily Megan found herself wandering around her beautiful new home, in awe every time she found herself in a new room. The original Tanisha had a wonderful sense of style , as well as a deep desire to know her roots and where she came from. Each room was tastefully decorated with a blend of modern style combined with African antiques. Even the neo modern kitchen had photos of African tribal women hanging in the perfect places on the walls. \" I took those photos on a trip to Zambia. \" Meg found herself saying aloud as the entire trip flashed in her mind. There was a blown up photograph of a woman wearing a yellow dress and a dark blue head wrap whose name she recalled. \" Ife...it means woman of love.\" Megan said aloud as she recalled the womans name and how Tanisha interacted with her. From the memories she saw it was a fitting name as she recalled that Ife truly did love everyone. She was the Alpha woman of the tribe and taught all the younger women what they needed to know in life, even though she had no children of her own. Megan recalled that Ife had adopted her as her own daughter and given her the name Nkeche meaning 'Gods Present'. The original Tanisha felt honored by Ife and kept in regular contact with her, promising to one day go back to the little village to visit again.<br>\r\n<br>\r\n    As Megan wondered the house she felt conflicting emotions of both guilt and glee , while she explored Tanishas life and memories. Guilt because she was ashamed that she had stolen everything from this woman, who had travelled the world and spread love and compassion throughout her travels and was richly rewarded for it in more ways than money. Glee, because it was her life now, and those rewards were hers. <br>\r\n<br>\r\n   Megan eventually found Tanishas work room , the one where she made all the designs she created come to life. It was actually pretty simplistic, with the bare necessities needed to make her clothes. A sewing machine, a cutting table, a few mannequins. It was amazing to Megan how Tanisha was able to make such beautiful clothes in here. Seeing a rack of clothes she moved closer to inspect the work. \" This is high quality.\" Meg said with Tanishas mouth as she pulled dresses off the rack, only to replace them and pull shirts, blouses, and pants off one by one in return. Each article of clothing brought memories to Meg on how she made each piece, and confidence that she could do it herself if she chose to at any moment. <br>\r\n<br>\r\n   Finally Meg thought she had seen all of the main floor of the house, and found herself climbing the central staircase in search of her new bedroom. The first door she came to was not her bedroom though, it was a spare bedroom that Tanisha had converted into her own personal closet. \" Wow... I can get used to this. \" Megan spoke as she wondered between the racks of clothes, stopping every few steps to look at an article. \" I guess when you are a fashion designer you have plenty of beautiful clothes. Yay.\" Megan said as she spotted the custom made shelf at the back of the room with row upon row of shoes. <br>\r\n\"Shoes too! \" She giggled as her inner shoe whore stepped to the forefront. She saw from floor to ceiling every style, color, and brand of shoe she could ever want, and jumped with glee as she pulled a pair of Louis Vuitton high heeled pumps of the rack, and immediately kicked off the pair she was wearing only to replace them with her random pick. \" OMG!\" Meg squealed like a little girl, \" These feel just like they do in my dreams! And they are worth more than my old car ! \" she said as she took a few steps in them trying to turn her feet this way and that in order to look at the designer shoes. Soon enough though she decided she still needed to find her bedroom and walked out of the 'closet' still wearing the heels.<br>\r\n<br>\r\n    The next door Meg came to was the one she had been looking for. Tanishas bedroom was very large and tastefully decorated like the rest of the house. One wall was a made up of six floor to ceiling mirrors and the bed was against the opposite wall. The wall on the outside of the house had a set of curtained French doors that led to a balcony, which Tanishas memories told Meg that she spent a lot of time researching her designs there.  The bed was large and made , with a set of fresh clothes laid out on it , Tanishas memories telling Meg that was the outfit she planned on wearing out with Erica clubbing tonight. The bed had a large African Witch Doctors mask hanging above it. Another souvenir of Tanishas travels. Meg quickly moved in front of the mirror and began to finally check out this new dark skinned body of hers. Shedding her clothes she began to inspect her new form, taking off one article of clothing at a time, as if she were performing a strip tease for herself. She caressed herself as each piece came of only stepping out of her new prized heels long enough to remove her slacks. Now standing naked except for her heels she truly began to think this Ebony body is hers and hers alone. She felt herself begin to grow warm as she ran her new hands over her brown breasts and dark nipples , and was slowly beginning to get aroused when Tanishas cell began to ring. Stopping what she was doing she walked to her discarded pants and fishe the device out of her pocket. <br>\r\n<br>\r\n       \" Hello?\" she asked not having a clue who would be so rude as to interrupt her exploration. <br>\r\n<br>\r\n       \" You ready yet 'Nisha?\" the voice on the other end said, causing Meg to use Tanishas memories once again to identify the voice as Erica... Tanishas best friend. Thinking about an appropriate response, she said \" Almost Ere' , I just have to get dressed. \"<br>\r\n<br>\r\n       \" Okay girl. I will be at your house in ten minutes. Hurry up... you know Rodrick is gonna be there tonight right?\" Erica said and Meg knew that to be a man Tanisha had the hots for.<br>\r\n<br>\r\n      \" Oh believe me. I know. See you in ten girlfriend.\" Meg said and hung up. She looked in the mirror and gave her breast one more good squeeze befor going over to the bed and began dressing in the red jumpsuit number and heels the former Tanisha had laid out. If she had more time she would find something more revealing, but for now she would have to trust that Tanisha knew what she was doing with her life, she would have time to adjust it to suit herself later.<br>\r\nAfter getting dressed she gave her self a quick once over in the mirror and went back to the front door before gathering her purse, her keys, and arming the alarm to wait for Erica out front.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://stylepantry.com/wp-content/uploads/2017/05/SP6757.jpg\" target=\"_blank\">http://stylepantry.com/wp-content/upload...</a><br>\r\n<br>\r\nWhat happens next?<br>\r\n   </span></div></div>",
            "created":1515733200,
            "id":2439847,
            "title":"To her new home, to learn about her new life as..."
        },
        "155321221":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "Back at Tanishas house",
                "The next morning",
                "Back to FDBSE",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>        The trip to the club was short , and fortunately Megan was able to get away with only a little small talk with Erica. She didn't want to get too deep with personal information, for fear that Tanishas friend might think something was wrong. It worked for the most part until Erica turned the conversation to Rodrick.<br>\r\n<br>\r\n    \" Girl I don't get why you won't just hook up with Rodrick. I know that if that Chocolate Hercules looked at me like how he looks at you I would let him do anything he wants.\" Erica said as she pulled into the parking lot of the Lucky Sevens Club.<br>\r\n<br>\r\n     Meg knew it was true. Rodrick is a very desirable man, the handsome , broad shoulders , and well sculpted type of man that most women flock to. Only knowing what Tanishas memories tell her about the man was enough to make Megans new body tingle, but Tanishas memories also warn that Rodrick was a playa and really only interested in one thing. \" Erica!\" Megan said in a scolding tone, \" We both know he's a playa. Ain't no good gonna come from trying to hook up with him.\" she said as she stepped out of the car.<br>\r\n<br>\r\n     As Erica locked up the little Ford coupe, she said \" I know that Nisha. All I'm sayin is if you looking to have a little fun an he lookin to have some fun... why not have some fun together?\" <br>\r\n<br>\r\n     Meg stared at Erica giving her an accusatory smile, and finally responded. \" You so baaadddd Erica. Behave yourself.\" before giggling as she and her friend approached the bouncer at the door. <br>\r\n<br>\r\n     The bouncer, who looked more like a well dressed professional wrestler , saw the girls and said \" Nisha...Erica...where you ladies been. I haven't seen you in weeks.\" as he gave each of them a hug. <br>\r\n<br>\r\n      Erica responded for the both of them, saving Megan the trouble of trying to pluck the bouncers name from Tanishas memories. \" Ronnie, you know we are some busy ladies. How are you? How are Sharona and the baby? \"<br>\r\n<br>\r\n      \" We're all good Erica. Thanks for asking. You ladies should drop by and see Sharona sometime. She would be grateful to have a conversation with someone older than two. Sometimes I think she is gonna go crazy not having an adult around while I am working.\" Ronnie replied.<br>\r\n<br>\r\n       \" I bet , \" Erica says as Ronnie removes the red velvet rope from across the entrance. \" I know I would too!\" she finishes with a laugh.<br>\r\n<br>\r\n       Megan just smiles politly and states \" Being a stay at home mom is a full time job in itself!\" attempting to add to the conversation.<br>\r\n<br>\r\n       Erica just stares at Megan as if she had grown a second head. \" How would you know Nisha? You ain't got any kids.\"<br>\r\n<br>\r\n       Megan couldn't keep the shock off her face as she realized she had accidently given out a piece of information about her old life and not her new one. Quickly recovering she responded with, \" I got a little taste of it on my last trip to Zambia. Ife, the leader of the tribe I stayed with , had me watch the children of the village for a couple of days while the other women took care of the chores. I'll tell you that was enough to make me want to pull my hair out.\" she finished laughing.<br>\r\n<br>\r\n       \" I bet it did. I would love to hear more stories about Africa one day when you have time. Everybody talks about going back to the Motherland, but you are the only one I know who actually did Nisha. \" Ronnie said as he waved Megan and Erica through.<br>\r\n<br>\r\n       \" I'll do that Ronnie, \" Megan answered as she followed Erica through the door. Once inside Megan was experiencing culture shock as she looked around. She knew some people who frequented this club, old high school friends, and had even been invited here by a few of them. She heard plenty of stories from them about this place, but this is the first time she had ever been here. It would not have been a good idea to come here in her old body, even if she was with friends. She had been ingrained by her friends and family to stay out of this part of town. <br>\r\n<br>\r\n        As far as niceness, the club was clean, and lit properly. Some areas had good lighting , and others had dim corners for personal conversations. Everyone here was well dressed, and clean looking, and Black. It only confirmed what she had been told growing up. This is no place for a White girl.But now, Megan smiled as she realized, she is no longer a White girl... she was as Black as everyone here, and was proud of it. It was as if Megan had truly found her people.<br>\r\n<br>\r\n       Megans could feel all of the predatory looks her body recieved as she had unconsciously began to dance a slow rythem to the booming bass and hard rap that was coming from the stage, something she would never do in her old life. She didn't even like rap. But now it was almost as if it spoke to her soul. At first she thought that everyone there knew she wasn't who she said she was, that she was as White girl pretending to be Black, but smiled brightly when she realized that they were only giving appreciative looks to the finest Sistah in da' club. <br>\r\n<br>\r\n        With that thought , all of Megans inhibitions were thrown out the window as she followed Erica to the bar. Just as she placed an order for a Blue Valium, she felt a presence behind her and heard a deep masculine voice tell the bartender, \" Put all her drinks on my tab. Her money is no good here.\"<br>\r\n<br>\r\n    Megan quickly turned around to protest, but stopped when she saw the man she had already seen a couple of times in Tanishas memories. It was the elusive Rodrick, and he looked better than Tanisha thought he did.<br>\r\n<br>\r\n      \" How you doin Nisha. I was hoping you would come out tonight.\" He said before adding. \" When are you finally going to let me take you out?\"<br>\r\n<br>\r\n      \" When you going to stop tyin ta play games and be straight with me?\" Megan quickly responded, having already gone through all of Tanishas memories about the man. It was a good thing she had, because Tanisha apparently loved to play word games with the man while keeping him at arms distance. It was some kind of power struggle the two played with each other to figure out who would be the dominant one in any possble relationship.<br>\r\n<br>\r\n     \" Oh come on Tanisha. I can't be any more straight with you than I am right now. I am payin for all of your drinks tonight, and I've asked you out. You and I could be THE power couple around these parts, and I am tired of playing games with you. I want to be with you , I know you want to be with me, so why don't we go someplace and figure it out?\" He said almost , but not quite , pleadingly. <br>\r\n<br>\r\n      As the bartender handed Megan her drink she thought about what Rodrick said. It looked like the real Tanisha had already broken the man and now Megan was going to reap the rewards of her hard work. Taking as large drink of her cocktail Megan smiled and said \" You know what? ...\" pausing to make Rodrick sweat a little, \" ... Pay our tab, and let me tell Erica I'm gone. We can go back to my place and talk. <br>\r\n<br>\r\n      \" Aightt! \" He said as he perked up, and kissed her. \" See you outside Nisha.\" <br>\r\n<br>\r\n      With that Megan set out to try to find her friend, finally coming across her sitting with a few other women, one of which Meg recognized from high school. <br>\r\n<br>\r\n     \" Hey Shamikah? \" Megan said trying to get the girls attention. <br>\r\n<br>\r\n      \" Whats up Nisha?\" Shamikah asked.<br>\r\n<br>\r\n      \" You went to Portside didn't ya?\" Meg asked already knowing she did. She had fond memories of Shamikah during that time.<br>\r\n<br>\r\n      \" Yeah I did. Why?\" Shamikah asked.<br>\r\n<br>\r\n       \" Do you remember a girl named Megan Johns?\" Meg asked , curious about what Shamikah remembered about her. It had been nearly ten years since the two had seen each other.<br>\r\n<br>\r\n       \" Yeah I do. She was aight, for a racist cracka. How come? \" Shamikah asked.<br>\r\n<br>\r\n        \" Oh I was just wondering. \" Meg replied surprised that her friend thought she was a racist. \" She had sent me a job application, and it stated she went to Portside. I was just doing a little background check.\"<br>\r\n<br>\r\n        \" From what I remember she was a hard worker, but she is White, and raised by Whites. I don't believe she ever meant to be racist but she was, you know like all White people are.Generally a good person, but I don't think she knew what she was applying for if she asked you for a job. She wouldn't be caught dead in this side of town.\" Shamikah added.<br>\r\n<br>\r\n        Megan thought about it for a moment and realised Shamikah was right. Megan had spent less than ten hours as a Black woman, and that was all it took for her to see how racist she actually was... even without meaning to be.<br>\r\n\" Thanks Shamikah. I will keep that in mind.\" Megan said as she turned her attention to Erica.<br>\r\n<br>\r\n        \" Hey Erica....\" Meg said as she got her friends attention, \" I'm gone. Don't wait for me.\"<br>\r\n<br>\r\n        \" What already! We just got here!\" Erica said in shock. \" Why?\"<br>\r\n<br>\r\n        \" I decided to take a friends advice.\" Meg replied with a wink before redirecting her attention to Rodrick as he waited for her by the door. Erica followed Megans gaze, and the answer was apparent.<br>\r\n<br>\r\n         \" Good for you girl! Have fun. I'll call you tomorrow.\" Erica replied with a huge smile. <br>\r\n<br>\r\n        \" Not too early though! \" Megan laughed and Erica agreed joining in.<br>\r\n<br>\r\n       \" Yeah not too early! Haha!\"<br>\r\n<br>\r\n         Megan gave Erica a hug and then waved bye to the rest of the group before leaving and going up to Rodrick and lacing her arm around his as they left the club.<br>\r\n</span></div></div>",
            "created":1524427200,
            "id":2483024,
            "title":"At the club"
        },
        "1553212211":{
            "author_id":"freakydaughter",
            "author_name":"Chelsea Woodard",
            "choices":[
                "They seperate for the day, with Tanisha checking in with Hayden (Reserved)",
                "Readers choice",
                "Readers Choice",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>    Megan was so caught up with the feelings from her new body that the ride back to her home seemed a blur. She had allowed Tanishas' memories to guide her the whole trip and didn't come back to her own senses until she and Rodrick were back in her new home, on Tanishas bed, naked . She was flat on her back with her long dark legs draped over Rodricks back as he was coaxing an orgasm out of her with the best cunnilingus she had ever experience. He had expertly brought her close to the edge many times before backing off. Megan had her arms spread wide on the bed with her long fingers digging into the comforter. As she came close to release again , Rodrick once again backed off. This caused Megan to beg.<br>\r\n<br>\r\n   \" Please Rod... please. Let me cum. Please ...\" she whimpered in Tanishas throaty voice. This caused Rodrick to pause what he was doing. \" You have to say it . What do you want?\" he commanded.<br>\r\n<br>\r\n    \" I want you to fuck me Rodrick!\" she begged.<br>\r\n<br>\r\n   Rodrick stood up while stroking his 11 inch phallus. \" What do you want me to do? \" He teased as he grabbed her hips and centered his 'rod' even with her vagina.<br>\r\n<br>\r\n     \" I want your cock! I want you to shove your cock in me! I want you to fuck me until I cum!\" she demanded with authority , her tone of voice left no wiggle room.  Rodrick began pressing his impressive cock into her tunnel and soon felt the resistance her body had give way. \" Ahhh!!!\" Meg groaned as she felt a great shock of pleasure from just a few inches of his impressive girth. <br>\r\n<br>\r\n       ' SHIT! He's twice the size of what Jon has!\" as she felt her new love tunnel adjust to its intruder. ' To think that yesterday I was a married White woman who just wanted to run away, and now I am a beautiful , rich , single , and young Black woman who just hooked up with a guy at a club!' her mind added, the very thought making her even hornier. She wanted to be Tanisha Reddick completely, and this was one more step in the right direction in her mind.<br>\r\n<br>\r\n<br>\r\n      It took a few minutes for Rodrick to bury himself completely , but now with their dark pelvis' meeting Megan locked her legs behind his back and wrapped her arms around his neck and pulled him down for a kiss. As they made out Megan thought about how if her father knew she was sleeping with a Black man he would lose it. That she was doing it unprotected and fertile ( according to Tanishas mind) only excited her more. Her hands slid down Rodricks broad shoulders and back to his ass. There she used both her hands to squeeze his as and signal she was ready. Rodrick was too and immediately began long slow stokes with his hips. <br>\r\n<br>\r\n      The sex continued for nearly forty five minutes with Rod changing speeds and tempos and positions multiple times as the new couple made love. Finally Megan began to feel Rodricks member twitch as he said \" I gonna nut. Where you want it?\" <br>\r\n<br>\r\n      \" In me Rod. In me. I think I love you. I'm fertile. I want your baby.\" Megan said as she pulled him deeper with her hands and legs, only letting go long after both of their orgasms came and she was sure she got every last drop of his seed in her. They soon fell asleep but woke up several times to repeat the act. The next morning...</span></div></div>",
            "created":1562450520,
            "id":2683102,
            "title":"Back at Tanishas house"
        }
    },
    "info":{
        "author_id":"freakydaughter",
        "author_name":"Chelsea Woodard",
        "brief_description":"You have applied to become a henchman for the Freaky Duchess in her body swap corporation.",
        "created":1508995800,
        "description":"<td align=\"left\" class=\"norm\">You were wondering around , trying to find a job, which wasn't easy in Springfield. Then you come across a skyscraper that you for some reason had never noticed in your small town. The sign on front read FREAKY DUCHESS BODY SWAP ENTERPRISES. The name rings a bell to you but you can't seem to place it. ' Mostly rumors and whispers ' you think to yourself.  \"There is no way that company is real, \" you say aloud once you remember where you heard the name from. <br>\r\n<br>\r\nYou remember reading an article somewhere about a secret corporation that will sell a person another persons life and body for the right price. Even the government had once tried to investigate the owner and founder , the mysterious Freaky Duchess. Nothing was ever found on her though and the investigation was dropped when the special agent claimed there was nothing to see and promptly quit the agency she worked for. \" That was just a bad science fiction story... right?\" , you say to yourself.<br>\r\n<br>\r\nWhile checking out the front of the building you see a small sign in the corner of the window, HENCHMEN WANTED.  Figuring a job is a job you head inside...<br>\r\n</td>",
        "id":2138866,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1576389120,
        "modified":1576389120,
        "pretty_title":"FreakyDuchess Body Swap Enterprises"
    }
}