{
    "chapters":{
        "1":{
            "author_id":"silverjinzo",
            "author_name":"Silverfighter",
            "choices":[
                "At your old job's pantry",
                "At a high cafeteria pantry",
                "At a farm",
                "In a butcher's meat locker",
                "At your local groccer"
            ],
            "content":"<div class=\"\"><div> <span>Finally, it's closing time. Your boss told you lock the restaurant up when you leave, so you reach for your keys when you start hearing strange sounds.<br>\r\n<br>\r\nSCARF! CHOMP! GULP!!! SMACK!!!<br>\r\n<br>\r\nYou blink and head to the pantry, where you see a large fat figure stuffing its face.<br>\r\n<br>\r\n\"Hey buddy! If you want food, come back here when we're open and with money!\" you shout, reaching out. The fat figure howls and to your shock, bites you on your arm. \"OW!!!\" you shout, shaking. The fat figure howls again and runs off...or rather waddles off. The pain really stings, and you go to soak your bite wound under running water. You look to see the amount of food eaten was vast..your boss is not going to be happy.<br>\r\n**************************************************************************** **************************<br>\r\nYou were right...your boss found out and fired you. You just growl and head to your bathroom, brushing your teeth. You banduaged up where the fat guy bit you. Suddenly, your stomach begins to growl...you are hungry...very hunger. You groan and hold your stomach...the hunger soon making you pass out.<br>\r\n**************************************************************************** ************************<br>\r\nLater...<br>\r\n<br>\r\nUgh...your head hurts as you awaken. You find your clothes have been torn apart, leaving just a little to cover your descency. You look around to find yourself...</span></div></div>",
            "created":1194066000,
            "id":460322,
            "title":"The Curse Begins"
        },
        "11":{
            "author_id":"silverjinzo",
            "author_name":"Silverfighter",
            "choices":[
                "You remeber the survilance camera",
                "You decide to go home before your boss catches you",
                "You notice you look a little heavier",
                "The janitor is staring at you in shock",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Oh crud, what the hell are you doing in a pantry? You quickly reconize it to be your old job's pantry. If your old boss catches you here, you're going to have to explain a lot. Luckily, you remebered you left some clothes here by accident one time and ran to your old locker. It still has your things and you quickly slip them on.<br>\r\n<br>\r\nNow then, how did you get here? You were just brushing your teeth when you blacked out. Your house is a drive from your workplace and you don't recall coming here. <br>\r\n<br>\r\nIt was then...</span></div></div>",
            "created":1195016400,
            "id":464363,
            "title":"At your old job's pantry"
        },
        "112":{
            "author_id":"silverjinzo",
            "author_name":"Silverfighter",
            "choices":[
                "You overheard some people talking about a monster",
                "You call a cab to get home",
                "You feel like you're going to throw up"
            ],
            "content":"<div class=\"\"><div> <span>You better get going. If your old boss finds you here, he may call the police for breaking and entering. You sneak out and run down the street, before taking a breath. Now you're free to think. Could you have been sleep walking? But whoever heard of someone sleep walking to their old job?<br>\r\n<br>\r\nIt was then...</span></div></div>",
            "created":1213765200,
            "id":545727,
            "title":"Get Out Before You're Caught"
        },
        "1121":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "ignore it for now",
                "investigate",
                "grab dinner"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you walk home, you hear people talking about a monster roaming the streets last night.<br>\r\n<br>\r\nMost of the sightings were at your old job.<br>\r\n<br>\r\nYou start feeling curious and decide to</span></div></span></div>",
            "created":1306974120,
            "id":1117938,
            "title":"You overheard some people talking about a monster"
        },
        "11211":{
            "author_id":"martmeister",
            "author_name":"Martmeister",
            "choices":[
                "Call the police.",
                "Investigate."
            ],
            "content":"<div class=\"\"><div> <span>Shaking your head, you resumed your trip home. Setting yourself down on your sofa, you buried your head in your hands and tried to make heads or tails out of the past few days; who that... person was, how and why you ended up back at that store and what to do. Sighing, you searched on the local news sites...<br>\r\n<br>\r\n... and found nothing to match. Certainly, there was no news to be had of a fat, feral fiend. Shrugging, you sent off a handful of applications for something, anything, that would accept you.<br>\r\n<br>\r\nYou could just imagine how the interview would go: '<i>For what reason were you removed from your last job?' 'Oh, that was when a fat person mauled me and vandalised the shop!'</i> Still, you could say that you were placed into a scenario that you had no chance of overcoming and that you defended the shop as best you could.<br>\r\n<br>\r\nSatisfied, you sat back down and nursed your stomach. You couldn't remember the last time you ate. Yesterday, perhaps?<br>\r\n<br>\r\nSuddenly, a noise from outside alerted you; you sat bolt upright, eyes darting left to right. It sounded like a dustbin being knocked over, and it sounded like it came from the opposite side of the wall...</span></div></div>",
            "created":1480700820,
            "id":2244736,
            "title":"It Matters Not... Right?"
        },
        "1122":{
            "author_id":"zenith91",
            "author_name":"zenith",
            "choices":[
                "Raid the house for food...",
                "Search for food elsewhere...",
                "Make a move on your friend..."
            ],
            "content":"<div class=\"\"><div> <span>You walk over to the edge of the street and hail a cab to take you back to your house. You wonder how you got all the way out here last night. As you pull up to your house, you pay the cabby and get out. You walk up the neatly trimmed lawn and open the front door. You notice that the house is deserted, and quickly remember that you family went to visit your grandma for the week. <br>\r\n<br>\r\n\"Great...no one was here to see me last night...\" you think to yourself, trying to think of anyone else who might have seen you last night. You quickly realize that maybe your best friend, Kyle who lives next door might have noticed something! You race out of your house and over to Kyle's to inquire about your whereabouts the previous night. You knock on the door and wait.<br>\r\n<br>\r\n\"Hey, (IYNH)! What's up?\" Kyle says as he answers the door wearing nothing but his usual baggy shorts. Kyle was always the messier of the two of you. <br>\r\n<br>\r\n\"Hi Kyle,\" you say as you follow him inside. \"I was actually wondering if you noticed anything weird last night... Has anything strange happened lately?\"<br>\r\n<br>\r\nHe looks at you, puzzled. <br>\r\n\"Well not really... Dad said something got into the trash out on the curb last night... Probably just a stray dog or something. Why?\"<br>\r\n<br>\r\n\"Oh, nothing I just....well....\" you stammer.<br>\r\n<br>\r\n\"Well what? What're you trying to say?\" Kyle asks as he messes with some papers on the counter, dropping one on accident. \"Oops...\" As Kyle bends down to pick it up, his big baggy shorts fall down enough that you see his ass. All at once the room spins a little and you feel yourself loosing rational thought. You begin to feel your body expand as well. Your belly sags down over your thighs and your flat chest develops into two huge sacks of flesh. Your butt grows big enough to break most chairs. You only have one instinct at this moment. Before Kyle even has time to witness what his best friend has become, you lean forward and bite him hard on the right butt cheek. <br>\r\n<br>\r\n\"Oww!!! Hey, (IYNH)!!! What the?!\" He can't even finish his sentence before he too begins to change. You watch as your best friend becomes a mirror image of your own bloated body. The two of you are both massive, hungry, blobs of people now. As your stomachs rumble loudly you decide to...</span></div></div>",
            "created":1303880400,
            "id":1095781,
            "title":"Friendly Fatsos"
        },
        "11221":{
            "author_id":"zenith91",
            "author_name":"zenith",
            "choices":[
                "Your friend Nate...",
                "The pizza guy..."
            ],
            "content":"<div class=\"\"><div> <span>Your stomach rumbles loudly. Almost as loud is the snarling that emits from both you and Kyle's mouths. Your new were-fatso forms have left you and Kyle two big fat ravenous animals. It takes little time before the two of you begin to tear into any food that you can find. You throw open the pantry door and begin to tear boxes apart, trying to get the tasty prizes inside into your fat mouth. Kyle waddles over to the fridge and begins to pull everything out and down it in instants. <br>\r\n<br>\r\nAs the two of you devour the food, your were-fatso bodies begin to swell up with massive amounts of fat. While you're both gaining about a pound per thing that you consume, you're filling out in much different ways. Your fat is pooling in your huge expanding belly, it grows ever farther down your legs, swellling out wider and wider as well. On top of that your meaty moobs are beginning to fill with pound upon pound of fat. Kyle is growing similarly, only his moobs are not growing at quite the same rate as yours. Instead, his ass is beginning to sag more and more as he gets bigger and bigger. Soon you each reach for the next morsel of food only to find that there is nothing left! Just then, you here the doorbell ring. You look out and see...</span></div></div>",
            "created":1317619140,
            "id":1199855,
            "title":"Raid the house for food..."
        },
        "112212":{
            "author_id":"silverjinzo",
            "author_name":"Silverfighter",
            "choices":[
                "You see a pair of attractive girls jogging",
                "The cops show up, overhearing about the strange attacks"
            ],
            "content":"<div class=\"\"><div> <span>If you had your senses, you'd figured that Kyle must have ordered a pizza before you came and bit him.<br>\r\n<br>\r\n\"Pizza! The whole thirty minutes or less thing doesn't count if you make me wait outside!\" shouted the pizza guy, knocking on the door. Next thing he knows, you bust through the door and onto him. \"What the...?\"<br>\r\n<br>\r\nCHOMP!!!<br>\r\n<br>\r\n\"YEEOOOW!!! What the...?\" screamed the pizza guy, after you bit him. Seconds later, you, Kyle, and the now were-fatso pizza guy are greedily gobbling up the pizzas in his car.<br>\r\n<br>\r\nIt was then...</span></div></div>",
            "created":1331834580,
            "id":1295248,
            "title":"Another Victim: The Pizza Guy"
        },
        "1122121":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "she gets away",
                "you bite her."
            ],
            "content":"<div class=\"\"><div> <span>You spot a pair of attractive girls jogging right by you. You decide to follow them out of curiosity. They soon spot you, disgusted by your appearance.<br>\r\n<br>\r\n\"Hey tubby! Why don't you try jogging once in a while!\" one of them shouted as you bit one of them. She screamed loudly before becoming a were fatso herself. You and her then look at her friend as she begins running. You and her quickly give chase to her up the street until...</span></div></div>",
            "created":1420405800,
            "id":1912869,
            "title":"You see a pair of attractive girls jogging"
        },
        "11223":{
            "author_id":"zenith91",
            "author_name":"zenith",
            "choices":[
                "The grocery store...",
                "A restaurant..."
            ],
            "content":"<div class=\"\"><div> <span>Your stomach rumbles, but you realize that you're hungry for something else... You've known Kyle for your and his entire 19 years of life and you've never had these feelings. You rush forward, your huge bellies slapping together with a loud, wet smack. You tackle Kyle to the ground and begin to kiss him viciously on the lips. The entire scene is almost animalistic in nature as the two of you make out on the kitchen floor, your sweaty flab slapping together wildly. You want nothing more than to keep going at it with Kyle. Then in a flash you wake up. You're lying on top of your best friend in his kitchen. You both have incredibly tattered clothing. Just then Kyle wakes up and looks at you. Your eyes meet and then instantly you scramble off of one another. <br>\r\n<br>\r\n\"Dude, what the H***?!?\" Kyle shouts looking freaked out at you.<br>\r\n<br>\r\n\"I don't know!! What were we just doing??\" You ask, completely confused as to what the heck is going on.<br>\r\n<br>\r\n\"Let's...let's just forget this ever happened...Why don't you just go home?\" Kyle says, running upstairs.<br>\r\n<br>\r\nYou decide to head back to your own house to collect your thoughts. You're still unsure of just what the heck has been happening... You return home to find that there is no food to be found anywhere. You decide to go to...</span></div></div>",
            "created":1303966800,
            "id":1096076,
            "title":"More than Friends"
        },
        "112231":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "a friend",
                "someone else"
            ],
            "content":"<div class=\"\"><div> <span>You decided to go to the grocery store to get some more food.<br>\r\n<br>\r\nWhen you get there you see it in shambles.<br>\r\n<br>\r\nYou ask the shopkeeper what happened.<br>\r\n<br>\r\n\"Two fatso's broke in and ate all of my stock then ran.\"<br>\r\n<br>\r\nYou wonder what had happened last night.<br>\r\n<br>\r\nWhen you got home, you run into</span></div></div>",
            "created":1306682220,
            "id":1115363,
            "title":"The grocery store..."
        },
        "12":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "quarter(Your safe)",
                "New"
            ],
            "content":"<div class=\"\"><div> <span>You find yourself in a cafeteria pantry, covered in food wrappers and leftovers.<br>\r\n<br>\r\nThen the door opens and in comes a security guard and says,\"You! So your the causing the mischief at the Abraham Lincoln Private school cafeteria.\"<br>\r\n<br>\r\nYou immediately run outside and away from the security guard as he yells,\"And put some clothes on, why don'tcha.\"<br>\r\n<br>\r\nYou couldn't figure out how you ended up in their in the first place.<br>\r\n<br>\r\nWhen you got home it was almost nightfall and the moon was supposed to be..</span></div></div>",
            "created":1303880400,
            "id":1095946,
            "title":"At a high cafeteria pantry"
        },
        "13":{
            "author_id":"silverjinzo",
            "author_name":"Silverfighter",
            "choices":[
                "You escape the farmer and leave the fields",
                "The farmer catches you",
                "You get lost in the woods nearby",
                "You duck into a barn",
                "You find some clothes on a line and \"borrow\" them"
            ],
            "content":"<div class=\"\"><div> <span>Huh? How'd you end up here? You find yourself in a corn field, except its just a bunch of freshly picked stalks. <br>\r\n<br>\r\nBANG!!!<br>\r\n<br>\r\n\"Git out of my corn! You ate enuf!\" <br>\r\n<br>\r\nYikes! You don't want that farmer to find you, especially if that bang means he has a shotgun. You run out of the fields...</span></div></div>",
            "created":1195016400,
            "id":464228,
            "title":"Down At the Farm"
        },
        "131":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "Full",
                "New"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You keep running until you can no longer see the farmer.<br>\r\n<br>\r\nYou are walking home wondering what happened last night.<br>\r\n<br>\r\nWhen you make it it is night.<br>\r\n<br>\r\nAnd the moon is...</span></div></span></div>",
            "created":1304375580,
            "id":1098752,
            "title":"You escape the farmer and leave the fields"
        },
        "135":{
            "author_id":"gite",
            "author_name":"Jackie",
            "choices":[
                "You find a dirt road.",
                "You were chased down by the farmer's dog.",
                "Something else happens."
            ],
            "content":"<div class=\"\"><div> <span>Not wanting to be shot up by some crazy redneck, you fled. Another shot was fired and you narrowly avoided the bullet as you ran behind the farmer's house.<br>\r\n<br>\r\n\"Come back here, you disgustin' vermin!\" you heard him shout in anger. \"You destroyed my crops!\"<br>\r\n<br>\r\nYou hid behind an old, rusty tractor. Your heart racing, you listened to the farmer's threats and shouts fade away into the distance, which meant that he had lost you and was looking somewhere else for you.<br>\r\n<br>\r\nFor several moments you stayed crouched behind the tractor, just to be sure that it was safe. When it was, you rose to your feet and emerged from behind the tractor, looking around.<br>\r\n<br>\r\nWhere the hell were you? Judging by the rural landscape you guessed that you were somewhere in the country side, miles away from your home.<br>\r\n<br>\r\nBut how and why did you get here? You tried hard to remember what happened last night when you were struck by the sudden hunger. A few vague memories presented themselves.<br>\r\n<br>\r\nYou could remember storming out of your house, breaking into a grocery store, and devouring all the food on the shelves. \"What the hell is that thing?\" you heard someone shout as you tore down the street, chasing a truck full of Twinkies. <br>\r\n<br>\r\nYou remembered yourself crashing through the woods, drawn to the lights of a house like a moth to a flame. You stumbled on a corn field and began to eat the ripe crops before passing out when the sun came up.<br>\r\n<br>\r\nYou guessed that house and corn field must be this one. You tried to remember more, but a cold breeze around your privates distracted you.<br>\r\n<br>\r\nLooking down, you saw that you were stark naked. Blushing furiously, you looked around for something to cover yourself. You spotted a clothing line that had a few sheets and a farmer's overalls hanging over it.<br>\r\n<br>\r\nYou ran to the line, pulled down the overall, and dressed yourself in it. You were having trouble with the right strap when you heard the farmer's voice again, accompanied this time by barking.<br>\r\n<br>\r\n\"O, great,\" you thought, \"now he found himself a dog! I'm in deep trouble now.\"<br>\r\n<br>\r\nBiting your lower lip, you made a dash for it again, jumping over the fence and running into the forest.</span></div></div>",
            "created":1505475300,
            "id":2386103,
            "title":"I owe you."
        },
        "14":{
            "author_id":"silverjinzo",
            "author_name":"Silverfighter",
            "choices":[
                "The butcher finds you inside",
                "You question what happened last night",
                "You notice the door is ajarred open and sneak out",
                "You find the door is shut so you need to get out",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Brr...it's cold, very cold. But its the middle of summer!<br>\r\n<br>\r\nYou look up to see you're in some kind of freezer. From all the meat, you surmise you're in a butcher's freezer. Apparently, something was inside recently since there are huge teeth marks on sides of beef, and empty shelves. It was then you felt something wet on your face and realize its meat juice! </span></div></div>",
            "created":1198904400,
            "id":480419,
            "title":"Cold...and Stunning..."
        },
        "141":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "a gypsy",
                "someone who saw you"
            ],
            "content":"<div class=\"\"><div> <span>Then the butcher comes in with a cleaver.<br>\r\n<br>\r\n\"So you are the one who ate all of my wonderful meat. I choppa you good.\"<br>\r\n<br>\r\nThe cleaver then swings down twice but misses each time.<br>\r\n<br>\r\nYou start running and eventually get away.<br>\r\n<br>\r\nWhile you are walking home you run into...</span></div></div>",
            "created":1306644360,
            "id":1115130,
            "title":"The butcher finds you inside"
        },
        "15":{
            "author_id":"doublel",
            "author_name":"Golden Tiger",
            "choices":[
                "You sneak back home without anyone noticing you",
                "You steal some clothes off a clothesline and head back to the grocer for answers",
                "While sneaking, you run into a strange old gypsy woman",
                "You get a call to pick up grocceries since all your food is gone",
                "Three Days Later"
            ],
            "content":"<div class=\"\"><div> <span>You find yourself at the back alley of your local grocer, and look to see a pair of men talking to a police.<br>\r\n<br>\r\n\"So you say something came into here last night and just started eating everything?\" asked a police man.<br>\r\n<br>\r\n\"Yeah!\" went one of the men, \"It was really big and really fat! I couldn't really tell if it was man or animal,\"<br>\r\n<br>\r\n\"It was really strong whatever it was,\" said the other man, \"Before long, almost one third of all the food here was gone! The baked goods section, especially our new shipment of powdered sugar donuts, has been cleared out!\" <br>\r\n<br>\r\nYou blink, before noticing something odd. There's some white powdery stuff on your fingers and you look closer, reconizing it. You taste it and realize it's powdered sugar! What happened last night?</span></div></div>",
            "created":1194238800,
            "id":460954,
            "title":"What Happened Last Night?"
        },
        "151":{
            "author_id":"sugarishapple",
            "author_name":"Sugarish Apple",
            "choices":[
                "You overslept, it is night... and sadly, it's full moon",
                "You sleep until the next day",
                "Some days later..."
            ],
            "content":"<div class=\"\"><div> <span>You decide to doublecheck if the police are finally gone, and so they were.<br>\r\n<br>\r\nYou really want to go home, but first you need to find out something to cover the little bit of decency you still have. And them you find out some newspapers from a nearby stand, taking them without them noticing them the news and gossips of the local celebrities.<br>\r\n<br>\r\nTaking care that no one looked at you, you finally arrive at home, until you start noticing that all inside of it was, sadly, ruined. Light bulbs destoryed, furniture broken... even the fridge was destroyed and without food inside of it. \"Damn\". You start saying. \"It looks like a bear and some kind of tornado came into my house\".<br>\r\n<br>\r\nBut then, as soon as you put some clean clothes on, you remembered that you were here last night. So, something happened in between that moment you blacked out, and the time you were in the grocery store.<br>\r\n<br>\r\nHowever, the powdered sugar in your fingers... just raised more questions than answers.<br>\r\n<br>\r\nJust thinking about it, gives you a headache and you just want to sleep a little. But, sadly, you are way too hungry too just sleep. And it came out in your mind that you had some hidden pastries around, and probably whatever-what-it-was was in your house couldn't take them.<br>\r\n<br>\r\nAfte eating them, you finally sleep, without thinking too much into the whole situation.</span></div></div>",
            "created":1397735040,
            "id":1780923,
            "title":"Going back home"
        },
        "1513":{
            "author_id":"sugarishapple",
            "author_name":"Sugarish Apple",
            "choices":[
                "The pizza guy arrives! Joy.",
                "You decide to look for food in the city.",
                "You decide to look for food in nearby homes."
            ],
            "content":"<div class=\"\"><div> <span>Some days later, you found in the news that apparently the monster the police were talking about... it wasn't the only one. <br>\r\n<br>\r\nThe news reported the same complainings and sights of some humanoid-animal beasts attacking whole places involved with food, almost gone. Strangely leaving some healthful stuff around. You just raised your eyebrow onto this, but then you remember that guy....thing... that bite you in your arm days ago. You sudden take a look at it, but it still hurts something. It fit the description that the police and the news reported.<br>\r\n<br>\r\nAnd while you are trying to look for a new job, you can't complain too much on trying to recover all the stuff you lost. You really need the money, at least, to replace that old refridgerator that got destroyed. You sigh, and take a sit by the balcony. Thinking that maybe it was one of those things that entered your home too.<br>\r\n<br>\r\nThe evening was precious, and it made you hungry, again. Fortunately, the pizza you ordered was going to arrive in some more minutes. But then, you looked at the beautiful sky night. So beautiful... it was completely clean, showing stars and... oh, look at this! There's still a cloud covering the moon. Your gaze doesn't really want to take it out until it reveals its amazing roundness... its... full... roundness...?<br>\r\n<br>\r\nYou were hypnotized by it, but sudden, your stomach starts growling and rumbling and it is hurting you a lot, making you fall out of the chair. You scream out of pain as in some seconds, your whole body mass starts expanding itself. You clearly don't look so much of it, but you start feeling heavier, and feeling much more without control. Your belly sags down being rounder and rounder, your legs and arms gets covered by a thick layer of fat, and your not completely flat chest starts baloning itself. Your balcony do not resist your new weigh and you fall with it, breaking it in pieces. You become a massive blob of mass creature, with a rumbling and growling stomach, and you are incredibly hungry, and... oh boy, you are completely blindly hungry.</span></div></div>",
            "created":1397736600,
            "id":1780928,
            "title":"Not the only one"
        },
        "15131":{
            "author_id":"sugarishapple",
            "author_name":"Sugarish Apple",
            "choices":[
                "Goes to the picnic",
                "Goes to the bakery"
            ],
            "content":"<div class=\"\"><div> <span>You are completely dominated by the animal side that is just unbelievable hungry, so the rest of your senses like hearing or smelling are the most powerful ones when you become this humongous fat beast, besides the tasting. You just want to eat, but suddenly, you hear the motor of a car parking somewhere near your house, and you just go where it is.<br>\r\n<br>\r\nIt happens to be the pizza guy who you previously called, bringing you the 2 pizzas you ordered some time ago. But the smell of it is incredibly stinging that you waddle immediately to it. You can feel the drool that is producing in your mouth, when at the speed you have, you are obeyeing your wild instricts.<br>\r\n<br>\r\nAnd your instricts tell you to just 'eat'.<br>\r\n<br>\r\nGrowling and snarling you just can feel the flavor. And then you see this little man, carrying the food you want. The man is clearly scared about you, but he just doesn't move, and you end up tearing the food with your enormous teeth, while reaching a part of his arm, biting him. He ends up unconscious, and you just devour the whole two pizzas in just one sit, to satisfy your still growling stomach. But you are still hungry, so you instrinctly go to the pizza guy's car and with your thick but strong arms you tear the metal apart just to get the rest of the pizza and get them into your mouth.<br>\r\n<br>\r\nYou don't notice it, but as long as you are consuming the endless amount of calories they contain, your size is also increasing as well.<br>\r\n<br>\r\n\"Owww...\" You hear the pizza guy getting up. \"That... monster... thing... He just... bit me and... WHOA!\" He saw you but he couldn't do anything either, because he was also suffering from the same transformation process as you, ripping his clothes off and becoming another beastly fatso as you. But he doesn't follow you, he just do the same thing on his own way.<br>\r\n<br>\r\nAnd you are still hungry. You smell carbon and meat.... there is a picnic somewhere around. You want to go there. But there is also the smell of a closer fancy bakery...</span></div></div>",
            "created":1397816460,
            "id":1781668,
            "title":"The pizza guy arrives! Joy."
        },
        "153":{
            "choices":[
                "You bite a pedestrian ",
                "you run back to the grocer",
                "You go to McDonalds"
            ],
            "content":"<div class=\"\"><div> <span>You try to sneak away as to not attract the attention of the police man, who was now skulking outside to look for evidence. <br>\r\n<br>\r\nAs you turn back around to see where you are heading you come face to face with a rather strange looking old gypsy. She point her wrinkled finger at you and mutters something but you don't quiet hear what she has said.<br>\r\n<br>\r\n'You have been bitten, haven't you?' she knowingly asks.<br>\r\n<br>\r\n\"Why do you ask, what is going on?\" You reply.<br>\r\n<br>\r\n'You have been cursed, an old curse, a cruel curse. You are a were-fatso! Beware the full moon!\" she cackles and runs off down the street.<br>\r\n<br>\r\nYou continue your walk home dazed and confused. You don't know what to think but you realise that the old gypsy is probably crazy. For starters who has ever heard of a were-fatso.<br>\r\n<br>\r\nYou hear laughing and look up. A bus is passing and  some teenagers are mooning the motorist behind them..........</span></div></div>",
            "created":1198904400,
            "id":480470,
            "title":"The gypsy"
        },
        "1531":{
            "author_id":"silverjinzo",
            "author_name":"Silverfighter",
            "choices":[
                "Make More Were-Fatsos!",
                "Fill your belly!",
                "Fight this new Were-Fatso!"
            ],
            "content":"<div class=\"\"><div> <span>You clutch your head and feel an insatiable hunger as your body grows in size. Your butt fills out until it needs two chairs to sit on. Your belly balloons up and oozes past your knees. Your chest turns into two giant doughy mounds and your face and thighs swell with fat. <br>\r\n<br>\r\n\"RARRRRRR!!!\" you roar, before you hear a laugh.<br>\r\n<br>\r\n\"Nice roar, fatty,\" mocked the girl nearby, before you run to her and bite her. \"Ow!!! What was that...?\" she began, before she groaned and swelled up like a balloon as well. </span></div></div>",
            "created":1198990800,
            "id":481239,
            "title":"Spreading the Curse"
        },
        "15311":{
            "author_id":"zenith91",
            "author_name":"zenith",
            "choices":[
                "Food!",
                "More people!"
            ],
            "content":"<div class=\"\"><div> <span>You leave the girl and continue on your way. You eventually come to the town square which is filled with people. You look around at all the people in the town square around you pointing and laughing at your massive body. One young man even makes the poor decision of approaching you and poking at your large stomach. The slight annoyance causes you to lash out at him, biting his finger hard. He groans in pain and you watch as before your eyes his toned, 20 year old body becomes an instant ruin as he blimps up to about half your current size. The people in the square having witnessed this, the mood begins to suddenly shift from playful laughter to utter panic. You  watch and laugh a deep blubbery laugh that almost sounds like a snort. You look over at your fellow fatso and the two of you begin to waddle around the square attempting to proliferate the sickness. Your massive form impedes your movement and causes you to drip with sweat constantly as you chase your prey. You manage to tackle a man near the back of the pack. You see that he is already as fat as you are, likely the reason he was easy to catch. You lick him anyway, watching the fear in his eyes turn to deep feral hunger. You look over to see that the boy from before has turned two girls as well. The five of you come together and head for...</span></div></div>",
            "created":1303880400,
            "id":1095760,
            "title":"Sharing the Fun"
        },
        "153111":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "The next morning"
            ],
            "content":"<div class=\"\"><div> <span>As the fatties roared in the night, they soon caught the scent of food. They turn their eyes toward a passing ice cream truck. They licked their chops and ran after it. As they chased after it, the driver saw them.<br>\r\n<br>\r\n\" Somehow I knew this day would come. Time to kick it into overdrive.\"<br>\r\n<br>\r\nThe driver then stepped on the accelerator and went faster. But the fatties kept up the speed.<br>\r\n<br>\r\n\"I didn't see this coming. Time to lighten the load. You want my ice cream, you can have it!\"<br>\r\n<br>\r\nHe opened the back and all the ice cream inside fell out. The fatties gathered around it and ate away at it.<br>\r\n<br>\r\n\"Later, losers. Hahahah!\"<br>\r\n<br>\r\nBut as he laughed, he unexpectedly drove into a tree, knocking him unconscious.</span></div></div>",
            "created":1360711140,
            "id":1530938,
            "title":"Food!"
        },
        "1533":{
            "author_id":"silverjinzo",
            "author_name":"Silverfighter",
            "choices":[
                "You fight to keep your food",
                "You leave them be",
                "More people come...and get bitten"
            ],
            "content":"<div class=\"\"><div> <span>You feel your body ballooning up with fat, and your mind reverting to only hunger. You roar and stomp around, grabbing whatever food you can: hot dog from vendors, snacks from machines, ice cream from trucks. It was then you smelled grilled meat and look to see a McDonalds. You lick your lips and stomp inside. Naturally, you caused a scene being partly undressed.<br>\r\n<br>\r\n\"Excuse me...sir?\" asked a woman, touching your shoulder, before you bite her hand.<br>\r\n<br>\r\n\"OW!!!\" the woman goes.<br>\r\n<br>\r\n\"Hey! You can't...\" began a man, before...<br>\r\n<br>\r\nBITE!!!<br>\r\n<br>\r\n\"YEOWW!!!\" went the man, as you make your way through to the kitchen. You see the grills and start eating all the food you can find. Soon enough, the man and woman you bit earlier came in, both chubby and hunger in their eyes. They're quite hungry...</span></div></div>",
            "created":1204002000,
            "id":503279,
            "title":"You go to McDonalds"
        },
        "15333":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "bucher's shop",
                "ice cream factory"
            ],
            "content":"<div class=\"\"><div> <span>As soon as the man and woman become fatties, they break down the door and run into a grocery store. after they had broken in, they started eating the food. A couple of teenage girls pass by and say,\" Hey, pigs! Oink!\" they both started laughing. As soon as this happened, the man and women bit them, changing them into fatties as well. The new fat girls rushed out of the store and into a...</span></div></div>",
            "created":1303448400,
            "id":1092596,
            "title":"More people come...and get bitten"
        },
        "153331":{
            "author_id":"doublel",
            "author_name":"Golden Tiger",
            "choices":[
                "Suddenly shrink back to normal",
                "See an ice cream truck passing by"
            ],
            "content":"<div class=\"\"><div> <span>\"Uh...can I help you, young ladies?\" asked the butcher, as the fat girls rush in. They wrestle him to the ground and bite him.They then go to help themselves to the meat, the now were-fatso butcher joining them.<br>\r\n<br>\r\nMeanwhile, you have finished off what was in the McDonalds and now were truely obese. Your clothes were in tatters on your huge, blubbery body. Your belly reaches halfway to your knees and your butt would need two seats now on an airplane.<br>\r\n<br>\r\nYou then...</span></div></div>",
            "created":1303880400,
            "id":1095287,
            "title":"The Curse (and You) Are Growing"
        },
        "1533311":{
            "author_id":"zenith91",
            "author_name":"zenith",
            "choices":[
                "Full! (Uh-oh...)",
                "One-quarter (Whew.)"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, you're waking up laying on the ground in an alleyway. You look around and notice about five other people who seem just as groggy as you. You feel the cool evening air blowing all over your body and look down to notice that you are clad in barely any clothing at all. All that covers your skinny, toned body is a pair of underwear and the stretched out scraps of a shirt. You look over to the other people and notice that they too are sporting the same fashion statement, although some of them still have the remnants of pants and more of a shirt than you do. You stand up, a little shakily. You feel like you've been carrying around a ton of bricks for the last hour. <br>\r\n<br>\r\n\"Where am I? What happened?\" you say, with absolutely no recollection of what had transpired previously. You decide that you need to get out of this alley and find your way home before anyone notices that you aren't properly clothed. You begin to make a run for home, keeping to the lesser used roads of your neighborhood. You pass by the nice houses of your development as your house slowly comes into view, none too soon too as the sun is just beginning to set and the moon is rising. You look at the moon and notice that it is...</span></div></div>",
            "created":1303880400,
            "id":1095511,
            "title":"Back to normal..."
        },
        "15333111":{
            "author_id":"frown",
            "author_name":"sup",
            "choices":[
                "go after the truck",
                "search some more"
            ],
            "content":"<div class=\"\"><div> <span>You start changing again as well as the people you had already bitten.<br>\r\n<br>\r\nIt was a rampage of fatso's eating everything in sight.<br>\r\n<br>\r\nThen a truck was coming after you.<br>\r\n<br>\r\n\"Well, I better hurry before this delivery of weding ice cream cakes start melting. All 1000 of them.\"<br>\r\n<br>\r\nThen you decide to..</span></div></div>",
            "created":1306682580,
            "id":1115366,
            "title":"Full! (Uh-oh...)"
        },
        "153331112":{
            "author_id":"zenith91",
            "author_name":"zenith",
            "choices":[
                "A fully stocked grocery store...",
                "The Alpha..."
            ],
            "content":"<div class=\"\"><div> <span>You continue to prowl around town, ever searching for more food. You eat anything even slightly edible. You throw over street carts, topple food stands, and even devour whole dumpsters of trash. All the while your were-fatso body is getting bigger and bigger. You started out about 500 pounds, but by now, you're pushing the 800 pound mark. Your huge hanging belly slaps into your knees as you walk about searching for more food. Your mobility is beginning to become slightly limited as you eat more and more as you ravage the town. You're quickly becoming the fattest were-fatso in the city, rivaled only by the Alpha that bit you first, who is likely bigger and getting even bigger by the minute. <br>\r\n<br>\r\nJust then, you see a group of about five 18 year old guy in front of you. You begin to waddle more slowly, your fat padding on your feet making it easier to stalk your prey. Soon the guys are within striking distance. You lash out and lick each and everyone one. They reel back in shock and horror.<br>\r\n<br>\r\n\"What the he- SSNNNNNAAARRRLLLLL SSNNNARAALLLL!!!!\" they shout as theyr'e bodies grow before your eyes. They grow once again to half your size. You begin to realize that when a person is bitten by a fatso, they always become half of that fatso's weight. Your small bit of rational thinking realizes that since you started at 500 pounds, the Alpha who bit you must have been at least 1,000 pounds!! You observe your pack of five snarling guys, each with a huge hanging gut and some rather bulging moobs. You howl out in hunger and all 5 set off together. Eventually running into....</span></div></div>",
            "created":1317620100,
            "id":1199863,
            "title":"search some more"
        }
    },
    "info":{
        "author_id":"silverjinzo",
        "author_name":"Silverfighter",
        "brief_description":"You are cursed to become a gluttonous monster when the moon is full...",
        "created":1194148920,
        "description":"<td align=\"left\" class=\"norm\">One night, you're working at your job, about to close shop when you find a fat person stuffing their face of free food. But when you try to stop them, they bite you and waddle away! The next night, you're brushing your teeth when your stomach growls and you pass out...the next morning, you find yourself in shattered clothes, covered in gobs of food. Now every full moon (Both the natural and your own), you will transform into a were-fatso!<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\n1: A person is cursed when they're bitten or licked by a were-fatso. You change every time you see a full moon, either the one in the sky or a fully exposed butt.<br>\r\n2: All the calories you devour only affect your were-fatso form, not your normal one. You become your normal size, but when you change into a were-fatso, you become the size you were there currently.<br>\r\n3: A were-fatso is driven away by health food and tofu.<br>\r\n4: Leave the main character's gender be amquitous (IE don't state if its a guy or a girl). This makes it more fair for everyone<br>\r\n</td>",
        "id":1342682,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1505475300,
        "modified":1505475300,
        "pretty_title":"The Curse of the Were-Fatso"
    }
}