{
    "chapters":{
        "1":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "The Flower Division (Tokyo, Japan)",
                "The Paris Assault Force (Paris, France)",
                "The Star Division (New York City, New York, United States of America)"
            ],
            "content":"<div class=\"\"><div> <span>Now, like I said in the intro to this interactive story, there are 3 Divisions within the Imperial Assault Force. <br>\r\n<br>\r\nFirst, there is the Imperial Assault Force–Flower Division. Formed on New Year's Day in 1922, the Flower Division is hidden underneath a theater in the heart of Ginza, Tokyo called The Grand Imperial Theater. Here, the women of Flower Division live and work undercover as actors performing theatrical plays under the alias \"Imperial Opera Troupe\". The reasoning behind this is both spiritual and mental: song and dance are considered to be traditional methods that could suppress evil, and the stage was likened to a battlefield where self-confidence is built.<br>\r\n<br>\r\nThen, there is the Paris Assault Force, which is located in–you guessed it: Paris, France. When the Imperial Assault Force went into service and had proven to be an effective means of defending Tokyo as a whole, other countries soon followed this defense method as well, including France and the United States.Like Flower Division, the Paris Assault Force placed it's base operations at a famous Parisian night club known as \"The Theater Chattes Noires\", under the alias \"The Groupe Fleur de Paris\", and this assault force was formed in 1926.<br>\r\n<br>\r\nAnd last but not least, there is the New York Combat Revue. Formed in 1928 with Michael Sunnyside as its commander, the New York Combat Revue differs from other organizations in that their assault team is referred to as \"The Star Division\", and let's just say that Star Division has a bit of an interesting history. More specifically, two members of the original Star Division were transferred to this group. Like it's foreign counterparts, Star Division has it's base of operations hidden within a theater known as \"The Little Lip Theater\", which is located on Broadway, hence why The New York Combat Revue goes by the alias, \"The New York Fighting Troupe\".<br>\r\n<br>\r\nWell, now that we have everything set up, it's time to choose, fellow readers! Which Division will you choose? The Flower Division? The Paris Assault Force? Or The Star Division?</span></div></div>",
            "created":1464238800,
            "id":2154261,
            "title":"Which Division Will You Choose?"
        },
        "11":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Sakura Shinguji",
                "Li Kohran",
                "Kanna Kirishima",
                "Orihime Soletta",
                "More Flower Division members, please!"
            ],
            "content":"<div class=\"\"><div> <span>So, you decided to go with the famed Flower Division, hmm? That's fine. After all, the Flower Division that the Sakura Wars series focuses much of it's attention on early in the story. Now then, here's a little more history about the Flower Division:<br>\r\n<br>\r\nOn New Year's Day in 1922, the Imperial Assault Force was the successor to the Imperial Army's Counter-Demon Team. One of the members of that original team, Lieutenant General Ikki Yoneda, commanded the group until his retirement. By 1927, the Imperial Assault Force is composed of six official groups, all of which serve different purposes within the organization. The anti-demon attack squad, known as the Flower Division, is the division that the series focuses much of it's attention early on in the story.<br>\r\n<br>\r\nNow as for the members of such an assault force, Flower Division is led by Lieutenant Junior Grade Ichiro Ogami, with Maria Tachibana acting as his vice captain. Other members of the Flower Division include Sakura Shinguji, Sumire Kanzaki, Iris Chateaubriand, Li Kohran, Kanna Kirishima, Orihime Soletta, and Reni Milchstrabe.<br>\r\n<br>\r\nOther teams that play significant roles in the original storyline are the Wind Division, who are responsible for frontline support and transportation, Moon Division, who provide support within the shadows, and an unofficial group known as the Rose Division, who protect the Majinki. Now as for what sort of armor the Flower Division uses against the demons, Kanzaki Heavy Industries developed a dual-powered steam/spirit armor known as a \"Koubu\", only a young girl bearing high levels of spiritual power is shown to have been capable of moving the Koubu, which gave birth to the misconception that only women could operate the Koubu armor.</span></div></div>",
            "created":1464238800,
            "id":2154266,
            "title":"The Flower Division (Tokyo, Japan)"
        },
        "111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Nope, I'm just a normal human being.",
                "Yes, I'm someone who has powers.",
                "Actually, I have a different set of powers..."
            ],
            "content":"<div class=\"\"><div> <span>Alright, so you decide to go with Sakura Shinguji herself? Well, can't say I blame you. After all, the series IS named after her. <br>\r\n<br>\r\nNow then, onto the more important question at hand: Are you a normal, average human? Or are you someone with superpowers?</span></div></div>",
            "created":1464238800,
            "id":2154277,
            "title":"Sakura Shinguji"
        },
        "1112":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Giant Physiology",
                "Actually, let's see some more powers....",
                "More Powers, Please!"
            ],
            "content":"<div class=\"\"><div> <span>Alright, now that this section of the  interactive story, let's see what sort of powers we have at our disposal...... Oh, here's one! How about Giant Physiology?<br>\r\n<br>\r\nGIANT PHYSIOLOGY<br>\r\nThe power to use the abilities of giants. Variation of Mythic Physiology.<br>\r\n<br>\r\nAlso Called<br>\r\n*Clod Mimicry/Physiology<br>\r\n*Giant Mimicry<br>\r\n*Hulk Mimicry/Physiology<br>\r\n*Lump Mimicry/Physiology<br>\r\n<br>\r\nCapabilities<br>\r\nFor those who are unfamiliar with such an ability, Giant Physiology is where the user either is or can transform into a giant, humanoid being of prodigious size and strength common in the mythology and legends of many different cultures. The most obvious changes are increased size (ranging from relatively normal-sized but big, to huge, to closer geological scale), strength and endurance. Generally, giants lack any real supernatural abilities, but they can have the same ability to learn as, for example humans, and some have truly impressive powers.<br>\r\n<br>\r\nApplications<br>\r\n*Enhanced Condition or Supernatural Condition<br>\r\n–Contaminant Immunity<br>\r\n–Disease Immunity<br>\r\n–Enhanced Durability/Invulnerability<br>\r\n–Enhanced Endurance<br>\r\n–Enhanced Lung Capacity<br>\r\n–Enhanced Marksmanship<br>\r\n–Enhanced Strength<br>\r\n–Enhanced Smell<br>\r\n*Environmental Adaptation<br>\r\n*Weather Adaptation<br>\r\n<br>\r\nVariations<br>\r\n*Decelerated Aging– The lifespan of a giant is variable and rather undefined: some live vastly longer than humans, a few have shorter lifespans, and in most cases it isn't mentioned at all.<br>\r\n*Cyclops Physiology<br>\r\n*Hekatonkheire Physiology<br>\r\n*Ogre Physiology<br>\r\n*Titan Physiology<br>\r\n<br>\r\nAssociations<br>\r\n*Oni Physiology<br>\r\n*Sasquatch Physiology<br>\r\n*Size Manipulation<br>\r\n–Limb Extension<br>\r\n–Limb Expansion<br>\r\n*Troll Physiology<br>\r\n*Unnatural Size<br>\r\n<br>\r\nKnown Users<br>\r\n*Straga (Darksiders)<br>\r\n*Giants (Bleach)<br>\r\n*Kokujo Tengen Myo-O (Bleach)<br>\r\n*Po (Bleach); via Resurrection<br>\r\n*Makarov Dreyar (Fairy Tail)<br>\r\n*Sun Village Giants (Fairy Tail)<br>\r\n*Jotunn (Norse Mythology)<br>\r\n*Giants (Mythology)<br>\r\n*Giants (One Piece)<br>\r\n*Titans (Attack on Titan)<br>\r\n*Titan-Shifters (Attack on Titan)<br>\r\n*The Big (Cardcaptor Sakura)<br>\r\n*Goliath (Abrahamic Religions) <br>\r\n*Astaroth (Soul Calibur)<br>\r\n*Grogg (Marvel)<br>\r\n*Giant Clan (Nanatsu no Taizai)<br>\r\n*Cyclops (God of War)<br>\r\n*Brunhilda Brigand (Gold Digger)<br>\r\n*Julia Diggers (Gold Digger); half-giant<br>\r\n*Giants/Half-Giants (Harry Potter)<br>\r\n–Hagrid (Harry Potter)<br>\r\n*Phlegyas (Dante's Inferno)<br>\r\n*Kapre (Filipino Myth Monsters)<br>\r\n*Ginormica (Monsters vs Aliens)<br>\r\n*Fuji (Rurouni Kenshin)<br>\r\n*Cacus (Demigod Diaries)<br>\r\n*Giants (Elder Scrolls franchise)<br>\r\n*Annin (Dragon Ball)<br>\r\n*Oly's Father (Psychonauts)<br>\r\n*Jordi (Valkyrie Crusade)<br>\r\n<br>\r\nWell, there you have it ladies and gentlemen: Giant Physiology! Now, will you choose this power, or shall we proceed to another power instead?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1464238800,
            "id":2154286,
            "title":"Yes, I'm someone who has powers."
        },
        "11121":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Character Slot 1",
                "Character Slot 2",
                "Character Slot 3/ More Slots"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now then, since we have our abilities, there will be several character slots to choose from. So, let's begin shall we?</span></div></span></div>",
            "created":1464238800,
            "id":2154301,
            "title":"Giant Physiology"
        },
        "111211":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "The Flower Division fighting against the demons with their Koubu....",
                "Dalton first arriving in Tokyo by ship from the U.S.....",
                "Sakura treading through the marketplace for dinner ingredients....."
            ],
            "content":"<div class=\"\"><div> <span>Full Name: Dalton Coulson Lincoln<br>\r\n<br>\r\nAge: 20<br>\r\n<br>\r\nHeight: 6 Feet (15 meters when he's in his Titan Form)<br>\r\n<br>\r\nNationality: American<br>\r\n<br>\r\nRace: Caucasian<br>\r\n<br>\r\nHair Color: Dirty Blonde (A mixture between brown and blonde hair), becomes black with a red streak on the left side of the bangs on his hair when he's in his Titan Form.<br>\r\n<br>\r\nEye Color: Green (Burnt Orange when he's in his Titan Form)<br>\r\n<br>\r\nPersonality: Compassionate and devoted toward those he cares about, but can become aggressive easily if said friends are threatened.<br>\r\n<br>\r\nBio: Born in a family whose blood relation ties back to the 16th U.S President Abraham Lincoln, the expectations were set fairly high for Dalton Lincoln. Although he had inherited Abe Lincoln's trademark height, Dalton had a more lean athletic build than his ancestor due to his time in the United States Military. However, he was aware of a monstrous secret his family that was inherited from Abe's wife, Mary Todd Lincoln: The ability to transform into a giant humanoid creature known as a Titan, caused only by burning rage. <br>\r\n<br>\r\nHe first transformed into this Titan Form when he was merely 17 years of age, during a fight with a local street gang to protect his sister, Emily Attano Lincoln. Of course, he did not have control for the first time. But eventually, after years of honing his anger, he was able to control his Titan Form. In appearance, Dalton's Titan Form is noticeably similar to Eren Jaeger's Rogue Titan Form from Attack on Titan, but with some clearly different features. First, his teeth are much more pointed in appearance, giving off an intimidating look. His eyes are a burnt orange hue, and the nails on his Titan fingers are more akin to a small set of claws. When he transforms, his human body is encased inside his Titan Form, stored within the nape of the neck. However, once his body runs out of stamina, his Titan body falls limp, and forcefully disconnects Dalton from his Titan Form in attempts to keep him alive. However, he is incapable of speech when he's in his Titan Form, only growling, howling, and roaring.<br>\r\n<br>\r\n–––––––––––––––––<br>\r\n<br>\r\nTokyo. Home of the Imperial Assault Force–Flower Division, as they protect the city and everything else within it's borders from the demons and other monstrosities that dare tread inside the Imperial City itself. In this tale, we begin with.....</span></div></div>",
            "created":1464238800,
            "id":2154310,
            "title":"Dalton Lincoln"
        },
        "1112111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "They split up to go help Sakura & fight the enemy.",
                "They saw the Titan toss the beast into a group of demons.",
                "Actually, something else happened instead....."
            ],
            "content":"<div class=\"\"><div> <span>As the moon shone brightly in the night sky, the members of the Imperial Assault Force–Flower Division fought valiantly against the demons, clashing with these malicious soulless entities inside their individual Koubu. With Kanna using her Martial Arts and Sumire wielding her Koubu-sized Naginata with such perfected skill, Sakura fought against multiple demons with her katana, making her pink Koubu move swiftly to block, dodge, and counter every blow the monstrous creatures threw in her direction. <br>\r\n<br>\r\n<span class=\"clred\">\"Girls, we got more demons heading our way! Get ready!\"</span> Kanna exclaimed, giving her comrades a warning from Central Command by Ikki Yoneda and Ayame Fujieda. <span class=\"clgrey\">\"Roger!\"</span> Sakura and the others complied, preparing themselves for the next wave of monstrous creatures approaching them. But then, something gigantic came out of nowhere from the right, as a giant but scrawny clawed hand swiped at Sakura, knocking both her and her Koubu in the process, slamming the mechanized suit of armor into a nearby 3-Story department store.<br>\r\n<br>\r\n<span class=\"clgrey\">\"SAKURA!!\" </span>Her comrades yelled, greatly concerned about their friend/sister-in-arms. Although inflicted with a powerful surprise attack, Sakura's Koubu was fortunate enough to only receive several large claw mark scratches upon her Koubu's metal hull. However, it was there that she got a good look at her unknown assailant. In appearance, it was a massive demon, as it towered over her Koubu, with enough strength to swat her like a fly, despite the Koubu's steel bulk. It had this canine-looking head, bearing sharp fangs and teeth for the world to see. On it's head were these large deer-like antlers, possibly used for ramming an opponent. It's body looked physically lean and powerful, but also scrawny and frail as well, since Sakura could see what appeared to be a ribcage underneath it's deathly skin. It's arms were long and lanky, bearing these long skeletal hands and fingers, each finger bearing a jagged claw on each fingertip, as it's arms happened to be much longer than it's digitgrade lupine legs. <br>\r\n<br>\r\nIf Li were here and had to make a guess, the creature must be around 16 to 17 meters in height. From there, the beastly giant let out a shrieking howl into the nightly air as it screeched, \"KYYRRRRAAAAAAAAAAAAAAAAAAHH!!!!!!!!!!!\" The roar was loud enough to give Sakura a headache since she was so close to the gigantic monstrosity. But then, the beast moved it's hollow gaze toward Sakura and her Koubu, as if it wanted to devour her. <span class=\"cgreen\">\"Sakura, get out of there!!\"</span> Li yelled, warning Sakura to run. However, just as she was going to quickly evade the ginormous beast, she suddenly noticed as her Koubu's right leg had suffered a devastating amount of damage, struggling to get her Koubu back up onto it's metallic feet.<br>\r\n<br>\r\nBut suddenly, just as the beastly creature was just about to grab her Koubu with it's lengthy right arm and hand, something equally as large rushed the antler-wielding creature, delivering a powerful blitz attack, punching the monster with a powerful left hook, sending the beast flying back several blocks, stunning it in the process, as it's body smashed through one or two buildings before being pinned to the side of a third building. <span class=\"cppink\">\"What...was that?\"</span> Sakura asked herself, just as she then looked upwards and despite the lack of environmental lighting, she was able to make out what exactly attacked the grotesque monster. And what she beared witness towards brought her in some sense of shock and awe.<br>\r\n<br>\r\nThe creature that now stood before her was just as gigantic in scale as the beastly creature from before, looking to be around 15 meters in height. In appearance, the giant had a very humanoid physique, complete with human-looking skin, legs, feet, arms, hands, torso, and head. However, Sakura could notice several features on the humanoid giant. First, it had the muscular physicality of an Olympic athlete, strong but lean enough to perform swift movements, despite it's sheer size and scale, complete with a set of 8-pack abdominal muscles. From there, Sakura could see it sported black hair with a streak of red on one of the left hair bangs, as the giant's hair just grazed it's broad shoulders. It had these pointy and elongated ears sticking out from the sides of it's head, just as Sakura noticed the giant's eyes were a burnt orange, glowing amongst the moonlit sky. Along with a prominent hooked nose, the giant's mouth had an unusual jagged shape to it's design, as if it was unsuited for intelligible speech whatsoever, as it's mouth sported a row of sharpened teeth upon both it's upper and lower jaws, with no signs of any facial cheeks and lips in it's physical appearance. <br>\r\n<br>\r\nShortly after exhaling a deep steamy breath, the giant then bellowed out a loud and deep guttural howl, as it's scream could be heard throughout the battlefield while it roared, <span class=\"cborange\">\"GGRRAAAAAAAAAAAAAAAAAAAAAAAAAAH!!!!\"</span> From there, the giant sprinted toward the beastly creature, creating these thunderous footsteps in the process due to it's sheer size, making these small craters on the cobbled street. But as Orihime and her comrades saw the giant humanoid sprint past them, the antlered beast quickly regained it's footing, as it angrily charged toward the giant, sprinting on all four limbs like an animal, as these two titanic creatures clashed, both wanting their opponent to fall.<br>\r\n<br>\r\n<span class=\"clred\">\"Yoneda, are you seeing this?!\" </span> Kanna barked, speaking toward the Flower Division's commanding officer, Commander Ikki Yoneda,where he responded and answered, <span class=\"chunter\">\"Yes, Kanna. I can clearly see it on the Steamputer. Judging from it's appearance, it appears to be a Titan.\"</span>  From there, with the realization of what exactly they were up against....</span></div></div>",
            "created":1464325200,
            "id":2154802,
            "title":"An Unlikely Ally"
        },
        "11121111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Eventually, the Titan chose to help, attacking the demons with ferocity.",
                "Unfortunately, the beastly monstrosity started to get back up.",
                "Actually, something else happened instead...."
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cgrape\">\"We can focus on what that creature is for another time. Right now, we need to fend off the demons. Li, Iris: get to Sakura and escort her to safety.\" </span>Maria ordered, giving Li and Iris the command to go and rescue Sakura. <span class=\"cgreen\">\"Yes, Ma'am!\"</span> Li replied, as Iris spoke as well and said, <span class=\"cbyellow\">\"Understood.\"</span> From there, as Iris and Li's Koubus rushed to Sakura's aid, Maria then faced Orihime, Kanna, Sumire, and Reni, as she then barked out orders and demanded, <span class=\"cgrape\">\"The rest of you: concentrate your attacks on the demons! We can't let them tread any further into Tokyo.\"</span><br>\r\n<br>\r\n<span class=\"clgrey\">\"Yes, Ma'am!\"</span> They answered, just as they heard a swarm of demons rapidly approaching their position. From there, the 5 women prepared themselves for the enemy, weapons at the ready to spill their inhuman blood. <br>\r\n<br>\r\n––––––––––––––––<br>\r\n<br>\r\nMeanwhile, Sakura was still struggling to get her Koubu back onto it's ironclad feet, despite that one leg was structurally damaged, using her Koubu-sized katana as a makeshift crutch. Although, despite her efforts, the Koubu slumped back down. <span class=\"cppink\">\"Ngh! Aww, come on!\" </span>She growled, becoming a little frustrated at the endeavor.  However, she got a clear view of the ensuing battle between the titanic creatures, as her supposed savior grabbed the beastly monstrosity by the base of it's antlers and smashed it's head into a nearby building, causing stone, wood, and masonry to scatter like debris in the wind upon impact several times. <br>\r\n<br>\r\n<span class=\"corange\">\"GGRRAAAAAAAAAAAAAAAAAAAAAAAAAAH!!!!!\" </span>It howled, bellowing a roar of victory, just as Li and Iris skidded in front of Sakura's Koubu. <span class=\"cppink\">\"Li, Iris? What are you doing?! You need to help the others!\"</span> She questioned, just as Li and Iris each grabbed one of the Koubu's arms, pulling their friend up onto her feet with some difficulty. <span class=\"cgreen\">\"We're getting you out of here, Sakura. We're not leaving our friend to die.\" </span>Li answered, just as she and Iris supported the weight of Sakura's Koubu, so they can move her more easily. Unfortunately, this left them vulnerable to attack, as a pack of demonic steam robots armed with blades started to approach them at a rapid pace. <br>\r\n<br>\r\nSuddenly, they felt this violent gust of wind rushing from behind them, only to reveal the Titan itself, as it swung it's enormous right foot toward the robots, punting a few of them  into the air with a violent kick. From there, it quickly turned around and stomped on the remaining mechanical abominations, causing a small but devastating shockwave from where it stomped it's foot down. <br>\r\n<br>\r\n<span class=\"cppink\">\"That Titan....what is it doing? Could it be....protecting us?\" </span>Sakura thought to herself, her thoughts speculating as to the giant humanoid's motives and agenda truly were. <span class=\"cgreen\">\"How....how can something so big move so swift?\"</span> Li asked, both curiously intrigued, yet also slightly terrified, unsure if the gigantic humanoid was a friend or a foe. And speaking of the Titan, shortly after it made quick work of the robots, it slowly stood up to it's full height, where it then looked down towards where Sakura, Li, and Iris now stood before him, gazing upon both them and their Koubus with his large burnt orange eyes, almost as if it was...examining the trio. <br>\r\n<br>\r\nObviously out of some sense of fear, Sakura, Li, and Iris tried to stay as motionless as possible, hoping to avoid being it's next victims. Unfortunately for them, this only made the Titan more curious, kneeling down on one knee to get a closer look at them. However, it was there that Sakura attempted to communicate with the Titan, thinking that maybe it could be reasoned with, as she spoke with her supposed savior and said, <span class=\"cppink\">\"Look, I'm not sure if you can understand what I'm saying, but.....Please, we need your help.\"</span><br>\r\n<br>\r\n<span class=\"cgreen\">\"Sakura, what the hell are you doing?!\"</span> Li exclaimed, but Iris shushed her, allowing Sakura to continue speaking toward the titanic humanoid before her. From there, Sakura continued as she said, <span class=\"cppink\">\"Surely, there must be some sense of compassion within you. Please.....help us.\"</span> Although she was unable to see into the Titan's heart, she hoped that it understood her words.</span></div></div>",
            "created":1464411600,
            "id":2155319,
            "title":"Divide And Conquer"
        },
        "111211111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Suddenly, the Titan was ambushed by the beastly creature from before.",
                "Unfortunately, the titanic beast was still alive, as it charged toward Sakura.",
                "Actually, something else occurred instead....."
            ],
            "content":"<div class=\"\"><div> <span>Although she was completely unsure if her words had swayed the titanic humanoid, Sakura could see that something was happening a moment or two later, as the Titan slowly stood back up to it's full height, turning it's head to gaze upon the group that was Maria Tachibana, Kanna Kirishima,  Sumire Kanzaki, Orihime Soletta, and Reni Milchstrabe, using their Koubus to fend off the onslaught of demonic machines just 7 blocks away, separated by numerous buildings.<br>\r\n<br>\r\nFrom there, after returning it's gaze toward Sakura, Li, and Iris, the Titan then proceeded to make it's way toward the other members of Flower Division, stepping over the trio's Koubu to avoid trampling them, making these thunderous footsteps upon making each step forward. At first, it simply walked it's way toward the ensuing battle, but it then began to increase in pace, transitioning from a walk to a running stance.<br>\r\n<br>\r\n<span class=\"cgreen\">\"I don't believe it.... Sakura, that was amazing! How did you manage to convince it?\"</span> Li exclaimed, her reaction was a mix of awe and joy, as the Titan's massive form faded from their view on the ground. In response, Sakura looked at Li and replied, <span class=\"cppink\">\"To be honest, Li... I didn't think it would actually work, but I was hoping that it would see reason. Besides, I don't think this Titan was actually a demon whatsoever. I think...it might be something else entirely. Li, can you tell the others that it's heading their way?\"</span><br>\r\n<br>\r\n<span class=\"cgreen\">\"You got it, Sakura!\" </span>Li answered, as she then hailed Maria and the others, repeating those words from Sakura and said, <span class=\"cgreen\">\"Maria, we got Sakura and we're escorting her to safety now. However, she somehow managed to convince that Titan to help us, and it's heading toward you and the others as we speak.\"</span> <span class=\"cgrape\">\"Understood. We'll try and keep our distance from the Titan. Just get Sakura off the battlefield.\" </span>Maria responded, her remaining comrades in complete surprise as to how Sakura was able to get a gigantic creature to aid them.<br>\r\n<br>\r\nBut suddenly, they saw a large shadow above them, as they looked up and saw the Titan itself, where it leapt off a nearby building with a powerful locomotion jump, as it then attacked the robotic monstrosities with a devastating foot stomp, causing a shallow but large crater to form where it's right foot stood. From there, it looked at the mechanical abominations, a burning fire within it's burnt orange eyes, as it bellowed a hostile roar toward the possessed machines as it howled, <span class=\"corange\">\"GGRRAAAAAAAAAAAAAAAAAAAAAAAAAAH!!!!!!!!\"</span> <br>\r\n<br>\r\nDespite how miniscule they were to such a colossal entity, the Koubu-sized robots still attacked the Titan, swinging their large cleaver-like swords at the titanic humanoid. However, their efforts eventually were proven fruitless as the Titan swatted it's fists at the machines, smacking them around like metallic ragdolls, just where it then swung at 4 of the robots with a powerful backhand attack, as it violently grabbed one of the robots with it's left hand and tossed the mechanical abomination into it's comrades like a giant malformed bowling ball against a set of giant bowling pins, annihilating the mechanized marauders in one powerful strike.<br>\r\n<br>\r\n<span class=\"clred\">\"Wow, look at him go. He must've REALLY wanted to smash them to pieces.\"</span> Kanna remarked, aware of the sheer ferocity and aggression toward the demonic robots. However, as the other members of Flower Division finished off a few of the remaining stragglers, their more arrogant member, Sumire, made a cynical remark about their potential ally and said, <span class=\"clilac\">\"Hmph! If that....thing starts attacking us next, I'm blaming Sakura for this.\"</span> <span class=\"cpink\">\"Duly noted, Sumire.\" </span>Orihime complied, agreeing with Sumire involving the Titan. After all, they were unsure if it was intelligent enough to understand them, or if it was just a mindless beast willing totear apart anything that moves.</span></div></div>",
            "created":1464498000,
            "id":2155633,
            "title":"The Beauty Who Changed The Beast"
        },
        "1112111112":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "The next day, Yoneda called in the girls for a meeting.",
                "The next day, Sakura went to visit Dalton, who's out cold.",
                "Actually, Dalton regain consciousness the next day."
            ],
            "content":"<div class=\"\"><div> <span><span class=\"chunter\">\"Ladies, we're detecting nearby movement just south of your location.\" </span>Commander Yoneda said, warning the members of Flower Division. However, they all knew what exactly they were up against, just as they heard a very familiar roar from a certain gigantic beast, \"KYYRRRRAAAAAAAAAAAAAAAAAAHH!!!!!!!\" <span class=\"clred\">\"What the?! That beast....it's still alive!?!\"</span> Kanna yelled, as she and her comrades fully noticed the titanic creature that the Titan fought was far from dead, as it then stood up and noticed Sakura, Li, and Iris retreating away from the battlefield. <br>\r\n<br>\r\nOf course, the Titan recognized that inhuman shriek as well, stopping his rampage upon the demonic machines, now fully aware that his equally titanic nemesis was still amongst the living, and it realized what it was doing: it was heading toward Sakura, Li, and Iris. Out of some sort of protective instinct, the Titan then sprinted toward the beast, intent on intercepting the creature and permanently kill it outright. <br>\r\n<br>\r\n<span class=\"cgrape\">\"Sakura, Li, Iris! Get out of there! It's coming after you!\"</span> Maria exclaimed, warning her 3 comrades of what was coming after them. Of course, they already realized what exactly Maria was talking about, as they hurried their way from the combat zone, all while the beastly abomination began to gallop toward them on all fours. <span class=\"cgreen\">\"Oh crap! I thought the Titan killed that thing!\" </span>Li exclaimed, as both she and Iris quickened their pace as fast as their Koubus could allow in such a dire matter.<br>\r\n<br>\r\nFortunately for the trio, the Titan quickly intercepted the beastly creature with a violent blitz attack from the side, smashing through an entire building to get to the titanic beast. From there, the Titan let out a hostile guttural roar toward the beastly giant, as if it was threatening the creature that stood before it while it howled, <span class=\"corange\">\"GGRRAAAAAAAAAAAAAAAAAAAAAAAAAAH!!!!!!!!! GRRAAAAAAAAAAAAAAH!!!!!!\"</span> Then, Sakura and her friends noticed the Titan turned it's head a little, almost as if it was concerned for their safety. <span class=\"cppink\">\"So....you were protecting us after all.\" </span>Sakura thought to herself, reassured that her words from earlier had some meaning to the titanic humanoid. However, what made the situation all the more interesting but intense, was when the Titan raised both it's arms into a fighting stance, the digits on it's colossal hands curled tightly into a set of fists, showcasing that the Titan indeed was capable of intelligent thoughts.<br>\r\n<br>\r\nLike a wild animal, the beastly creature rushed toward the Titan, only to receive a powerful left hook to it's snout, making this loud wet crunching sound emanating from the antlered beast, stunning it momentarily. From there, Sakura, Li, and Iris noticed the Titan's left hand was damaged, it's colossal bones exposed for all to see. But then, they noticed the Titan's hand regenerating from it's wounds, indicating that it could heal itself with haste. <br>\r\n<br>\r\nHowever, just as the enormous beast was almost fully recovered, the Titan then quickly grabbed it's right arm, twisting it and snapping it like a twig, causing the beast to howl in pain, \"KYYRRAAAAAAAAHHH!!!!\" In retaliation, the titanic monstrosity quickly contorted it's body around and rammed the Titan in an attempt to hurt it. With haste, the Titan stamped it's feet into the cobbled street, firmly holding it's ground, where it then snapped off a piece of the beast's antlers, and stabbed the hostile beast in it's left eye, blinding it a little in the process. \"KYYRRAAAAAAAAHHH!!!!\" It shrieked, howling in more pain than before, just as the Titan then rammed the beastly hybrid into another nearby building, causing the building's structure to buckle and collapse under the sheer power between the two titanic forces, toppling the enormous creature onto it's bony back, with the Titan on top of it's massive frame, pinning it against the building debris. <br>\r\n<br>\r\nFrom there, the Titan delivered a series of heavy meaty punches aimed directly at the beast's head and snout, pounding flesh and crunching bones to a bloody paste until it was dead. And with one final act of violence, the Titan grabbed the beast by it's head with both hands, as it crudely tore off the beast's skull with raw inhuman might, until Sakura, Li, and Iris suddenly heard a loud fleshy ripping sound coming from the dead beast, it's black tar-like blood spilt across where it now laid. In reaction, as it held the monstrous beast's head in it's right hand, the Titan bellowed out a triumphant roar, howling into the moonlit sky as it roared, <span class=\"corange\">\"GRRAAAAAAAAAAAAAAH!!!!!!! GRRAAAAAAAAAAAAAAAAAAAAAAAAAAAHH!!!!!!!!!!!!\"</span> <br>\r\n<br>\r\nBut then, shortly after it let out a triumphant roar, Sakura, Li, and Iris suddenly were aware that something felt wrong with their titanic ally, as it stood there a little shaken. From there, Sakura quickly realized what was happening, as she yelled, <span class=\"cppink\">\"He's about to fall! MOVE!!\"</span> Heeding their friend's advice, Li and Iris quickly moved their Koubus away from the Titan, just as it fell onto it's knees, then fully collapsed onto the cobbled street with a thunderous boom, kicking up numerous amounts of dust in the process. <br>\r\n<br>\r\nHowever, once the dust finally cleared moments later, Sakura, Li, and Iris saw the Titan's body just a few yards away from them, as it laid there motionless on it's abdomen, like it fell unconscious. <span class=\"cgreen\">\"Well, at least it's not going to hurt us. So....how exactly do we get it back to the theater?\" </span>Li questioned, obviously finding herself in quite a conundrum as to how the Flower Division was going to transport the Titan. <span class=\"cbyellow\">\"Girls, look.\" </span>Iris said, the young girl pointing at the back of the Titan's neck, as they saw something moving underneath the Titan's skin.<br>\r\n<br>\r\nBut suddenly, the trio saw what exactly was inside the Titan, and they were surprised at what it was: A human, a fully clothed human being. Unfortunately, the unconscious human began to peel off of the Titan, collapsing toward the ground. And yet, despite the leg of her Koubu was damaged, Sakura made her Koubu leap toward the falling human, in hopes of catching that person. Fortunately, Sakura was successful in the endeavor, where she got a better look at the person she caught.<br>\r\n<br>\r\nIn appearance, the human was a male, had a mix of brown and blonde hair, and beared a good amount of facial hair, sporting a mustache and a small goatee in between his lower lip and chin. Judging from his looks, Sakura estimated that he must be at least 6 feet tall, and had Caucasian skin. <span class=\"cppink\">\"Judging from his looks alone, he must be an American.\"</span> Sakura thought to herself, seeing as how he appeared to be wearing an olive-drab green U.S Army uniform, complete with a small name tag on his uniform jacket. <span class=\"cppink\">\"Let's see.....Lieutenant Captain....Dalton Lincoln.\" </span>She read aloud, now informed of her savior's true identity. <br>\r\n<br>\r\n<span class=\"cbyellow\">\"Sakura, are you alright?\"</span> Iris asked, worried about her friend due to her risky save moments ago. <span class=\"cppink\">\"I'm fine, Iris. Seems our Titan friend might be American.\" </span>Sakura replied, just as both Li and Iris helped Sakura's Koubu back on it's feet. <span class=\"cgreen\">\"Yeah, well....we should at least take him back to the theater. After all, he looks like he requires a doctor.\"</span> Li said, which Sakura and Iris both agreed, as they helped Sakura while she carried Dalton's unconscious body. </span></div></div>",
            "created":1464498000,
            "id":2155695,
            "title":"Far From Dead"
        },
        "11121111122":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Meanwhile, Yoneda was speaking with the others in his office.",
                "Along the way there, Sakura decided to stir up a conversation with Dalton.",
                "Actually, something else happened along the way to Yoneda's office....."
            ],
            "content":"<div class=\"\"><div> <span>Greeted by the morning sun, the Grand Imperial Theater and it's residents were already up and about, despite last night's peculiar events, especially when it came to their newfound ally, the Titan, now revealed to be an American named Lieutenant Captain Dalton Lincoln. Of course, the almost major damage caused from the larger-than-life battle between the Titan and the gigantic beastly creature, since several of the buildings suffered extensive structural damage.<br>\r\n<br>\r\nToday, as she sported her usual clothing like her pink kimono and purple hakama, Sakura gently walked through the Theater's lavishly decorated hallways, carrying a bouquet of flowers in her arms, which were obviously a gift for her savior. Along the way, she met up with Kanna, who was also in her normal clothes, as Kanna greeted Sakura and said, <span class=\"clred\">\"Hey, Sakura! Commander Yoneda wants everyone to meet him in his office. You gonna join us?\"</span><br>\r\n<br>\r\n<span class=\"cppink\">\"Thank you, Kanna. I will join you and the others as soon as I deliver these flowers to him.\" </span>Sakura explained, obviously grateful for the Titan's assistance in their previous battle. In response, Kanna spoke to her comrade, putting a hand on her hip a little, and replied, <span class=\"clred\">\"Oh! You mean the American, huh? Well, can't say I blame you for your generosity, Sakura. He did save our skins last night. Try not to take too long in there, alright?\"</span> From there, as she walked in the opposite direction of Sakura's current venture, Kanna patted her friend on the shoulder once or twice as a sign of trust, as Sakura spoke back to the Amazon of a woman and answered, <span class=\"cppink\">\"Don't worry, Kanna. I won't take too long.\"</span><br>\r\n<br>\r\nAfter navigating through the halls of the Grand Imperial Theater, Sakura finally arrived at a room on the second floor, which was where the American known as Dalton Lincoln was residing in, as she opened the door and walked inside, fully aware of his current unconscious state, sleeping on the bed in nothing but his boxers and formal military pants, with his shoes, socks, shirt, and formal military coat were neatly laid out upon a nearby dresser.<br>\r\n<br>\r\n<span class=\"cppink\">\"My apologies for taking so long, I had to run my way over to the marketplace to buy these flowers.\" </span>She said, speaking to the unconscious American as if he was listening. From there, as she pulled out a nearby chair to sit in, she faced the side of left side of the bed and spoke once more and said, <span class=\"cppink\">\"Anyway, I just wanted to say.....Thank you. For saving us.\"</span> But then, just as she was about to leave, Sakura suddenly heard a deep moaning grunt from behind, as she turned around to see that, to her surprise, that the American was starting to wake up! <br>\r\n<br>\r\nBut as he sat up on the bed, Dalton held the side of his head with one hand, groaning as if he had a hangover, where he then spoke up and muttered, <span class=\"corange\">\"Uuugh, my head..... Damn, that oversized freak of nature was really obsessed on killing me.\"</span> However, it was there that Dalton noticed where he was after regaining his bearings. <span class=\"corange\">\"Wait a minute.... Where the hell am I?\"</span> He said, just as he then suddenly looked right at Sakura, causing him to quickly sprung off the bed to face her, positioning himself in a fighting stance. <br>\r\n<br>\r\n<span class=\"cppink\">\"Hey, it's okay! It's okay. I'm not going to hurt you.\" </span>Sakura replied, putting her hands up in a defensive stance and a sign of reassurance. However, Dalton lowered his fists and arms upon hearing her voice, recognizing it from last night, as he spoke toward the young woman and asked, <span class=\"corange\">\"That voice..... You....you were that woman inside the metal armor, weren't you?!\"</span> Surprised to hear that he still remembered her voice, Sakura looked at him with a surprised look on her face, where she then said, <span class=\"cppink\">\"Hold on, You remembered what happened last night?!\"</span><br>\r\n<br>\r\n<span class=\"corange\">\"Yeah, basically everything. Those demonic machines, that gigantic beast with the antlers, you, your friends, everything! Hell, I even remember your name. Sakura, was it?\"</span> Dalton answered, remembering the events from last night with clairvoyance. Of course, this made Sakura shocked a little that he even remembered when Li said her name. <span class=\"cppink\">\"Well....I guess I can say that I know you as well, Dalton Lincoln.\" </span>Sakura replied, making the conversation between the two skilled individuals all the more awkward, as Dalton let out a sigh, rubbing the back of his head and remarked, <span class=\"corange\">\"Okay, this....just gotten a little awkward. I mean, we know each other's names, for crying out loud.\"</span><br>\r\n<br>\r\nOf course, Sakura couldn't help but blush a little from such an awkward moment. Both that, and from the fact that the person she was speaking to towered over her. After all, Sakura had recently grew an inch, making her 5 feet 2 inches tall, compared to her previous height of 5 foot 1. However, as Dalton then shifted his focus toward getting dressed, putting on his socks and tying his shoes in place on his feet, he spoke toward Sakura and asked, <span class=\"corange\">\"So, um Sakura.....where am I exactly?\"</span> <br>\r\n<br>\r\n<span class=\"cppink\">\"Oh! Um..... you're currently in the Grand Imperial Theater, home of the Imperial Opera Troupe–Flower Division. I, uh....I guess you sort of figured that out a little when you saw our Koubus.\"</span> Sakura explained, giving the American some form of an answer. From there, as he began to put his white shirt on, tucking it underneath his olive-drab green formal military pants, Dalton looked back toward the young Japanese woman and said, <span class=\"corange\">\"Koubu? ....I take it that's what you call those bulky suits of armor you and your friends were using?\"</span><br>\r\n<br>\r\n<span class=\"cppink\">\"Well, yes. We actually use them to fight the demons and those possessed machines that you destroyed last night. Though, Commander Yoneda called you a Titan when you appeared, and I've never heard of such a creature before.... At least, until very recently.\" </span>Sakura replied, showcasing a but of her curiosity, just as Dalton rolled up his shirt sleeves halfway up his arms. However, he quickly stood up and turned to face Sakura when she mentioned her commanding officer/manager, as he spoke to her and asked, <span class=\"corange\">\"Yoneda? As in Commander Ikki Yoneda? Ah Shit....I was assigned to be under his command when I was brought here!\"</span><br>\r\n<br>\r\n<span class=\"cppink\">\"Well, if you're eager to meet with Commander Yoneda..... I can help escort you to his office. After all, I have to head over there myself, anyway.\"</span> Sakura answered, wanting to lend a hand to the person that saved her last night. Obviously due to his inexperience with the theater's overall layout, Dalton chose to accept Sakura's offer, as he walked up to the door, opened it, and replied, <span class=\"corange\">\"Okay then, Sakura. Lead the way.\"</span> Taking the lead, Sakura graciously walked out the opened door, shortly after she set the bouquet of flowers down on a nearby table. From there, Dalton soon followed closely behind her, easily catching up with her due to his size.</span></div></div>",
            "created":1464584400,
            "id":2156074,
            "title":"Wide Awake"
        },
        "111211111222":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Just in time for the meeting with the other Flower Division members.",
                "However, they were late by only a few minutes.",
                "Actually, something else happened instead...."
            ],
            "content":"<div class=\"\"><div> <span>However, along the way toward Commander Yoneda's office, there was this awkward moment of silence between the two individuals. Of course, in an attempt to make things slightly less awkward, Sakura sparked up some form of a conversation, as she looked at Dalton and asked, <span class=\"cppink\">\"So, um...... Dalton, you're from America, right?\"</span> <span class=\"corange\">\"Umm......yeah, I'm American. Why?\" </span> He replied, looking at her with his green eyes, somewhat confused as to why Sakura was asking him stuff like his nationality. <br>\r\n<br>\r\n<span class=\"cppink\">\"I'm sorry if I am offending you or anything of the sort. Its just that.....last night, you saved the lives of both me and my friends, Dalton. And.....I want to get to know you a little better, if it isn't too much trouble.\"</span> Sakura confessed, answering Dalton's question as to why she was somewhat curious about him. From there, he exhaled a deep breath, relieving the stress inside, as he the spoke to her and explained, <span class=\"corange\">\"I came from Springfield, Illinois. Sure, it's not as famous as cities like New York City, San Francisco, or Los Angeles, but still....Springfield has been the home of my family for generations.\"</span><br>\r\n<br>\r\n<span class=\"cppink\">\"So, where is Springfield located? You said that you're from America, so why would you say that you're from a place called Springfield, Illinois?\" </span>Sakura questioned, becoming slightly confused as to what Dalton was talking about. <span class=\"corange\">\"Illinois is a part of America, Sakura. Where I come from, they're called States. Think of it as like a giant puzzle, with Illinois being one of those puzzle pieces. After all, New York City got it's name from the State its a part of, New York.\"</span> He answered, simplifying his explanation towards someone like Sakura, whose never set foot on U.S soil before. <br>\r\n<br>\r\nIn response, Sakura grasped a better understanding of the United States thanks to Dalton, as she then spoke to the towering American and said, <span class=\"cppink\">\"I...I see. So, do you have any family members back in Springfield?\"</span> <span class=\"corange\">\"Somewhat. There's my grandfather, Robert Todd Lincoln. My father and mother, Thomas and Martha Lincoln. My 2 brothers and 3 sisters. And a few of my Aunts and Uncles. The rest of my family are sort of spread out across the country. My family sort of takes pride from the accomplishments of my great-grandfather, Abraham Lincoln. He was the 16th President of the United States throughout the Civil War.\" </span>Dalton explained, revealing his family's ties with President Lincoln. <br>\r\n<br>\r\nOf course, Sakura was a little surprised at such a revelation from her savior, yet she has never heard of someone like Abraham Lincoln before until now, so she looked at him as they turned right into another hallway and asked, <span class=\"cppink\">\"I take it that your great-grandfather was someone very important in his time?\"</span> <span class=\"corange\">\"So true, Sakura. Becoming President of the United States means you're becoming the leader of a country found on the ideals of freedom and equality, whether you're a man or a woman, or if you were born white or black. My great-grandfather passionately believed in such freedom and equality for every man, woman, and child. He was influential in giving people who were born into slavery a second lease on life. After all, we are born free, no matter what our gender is, or the color of our skin.\" </span>Dalton replied, going into detail about his great-grandfather's motives and agenda as the President.<br>\r\n<br>\r\nThis made Sakura believe that Dalton's great-grandfather was an honorable a compassionate person, someone with a noble heart and noble intentions. From there, Sakura spoke toward the towering American beside her and replied, <span class=\"cppink\">\"It sounds like your great-grandfather was a kind and honorable man.\"</span> <span class=\"corange\">\"He was. Too bad not everyone agreed with him. Those who lived in the southern parts of the country weren't exactly agreeable with what Lincoln was doing when it came to giving the African slaves the same rights as everyone else. This was what caused the southern states to separate from the rest of the country, creating the Confederacy. Of course, the Confederates lost the civil war in 1865. Unfortunately, shortly after the war was over, my great-grandfather was murdered by a Confederate sympathizer named John Wilkes Booth. They buried my great-grandfather in Springfield, Illinois, the same city where he and my great-grandmother, Mary Todd Lincoln, first met and married.\"</span> Dalton answered, going into detail as to the fate of his great-grandfather, which was a somber fate in and of itself.<br>\r\n<br>\r\nHearing such a sorrowful fate to a great man, Sakura's mood saddened slightly, as she spoke once more to Dalton and said, <span class=\"cppink\">\"I'm truly sorry about your great-grandfather, Dalton. I.... I wasn't aware that he was murdered.\"</span> Seeing the look on her face, Dalton stopped her for a moment, as he faced Sakura, knelt down on his right knee to look directly at her, putting one hand on her left shoulder out of reassurance, where he spoke to her in a calm and caring tone and explained, <span class=\"corange\">\"Sakura, I.....I understand that you feel depressed about my great-grandfather's death. However, you weren't the only one who mourned him. I'm proud of what he's accomplished when he was still alive, and his actions have inspired others to follow in his footsteps when it came to human rights. Our actions are capable of inspiring others to follow, to change the world for the better, Sakura. To be honest, I..... I never asked for this kind of power, but if I could use such a monstrous power to protect innocent lives.....I would not want my fate to be any other way.\"</span><br>\r\n<br>\r\nIn reaction to his soft-spoken words of wisdom, Sakura moved her head to make eye contact with Dalton's own green eyes, where she then displayed a caring and thankful smirk on her youthful face, as she spoke toward him and replied, <span class=\"cppink\">\"....Thank you, Dalton. Your words....truly mean a lot.\"</span> <span class=\"corange\">\"Anytime, Sakura.....anytime. Now then, what do you say we meet up with Commander Yoneda?\"</span> He complied, moving to the side to allow Sakura to continue leading him toward Yoneda's office. <br>\r\n<br>\r\nFinally, after around 15 minutes of walking through the lavishly decorated hallways, Sakura and Dalton made their way to a set of mahogany wooden double doors, as Sakura spoke up and said, <span class=\"cppink\">\"Well, here we are: Commander Yoneda's Office. I'll inform him that you're awake.\"</span> In response, Dalton nodded once in agreement, where Sakura then turned the doorknob on one of the doors, opening it to enter her commanding officer's workspace.</span></div></div>",
            "created":1464670800,
            "id":2156634,
            "title":"A Friendly Conversation"
        },
        "1112111112222":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Sakura, who wants to know what happens to the Titan's body.",
                "Orihime, who wants to know how skilled Dalton was in his Titan Form.",
                "Actually, it was one of the other members of the Flower Division instead."
            ],
            "content":"<div class=\"\"><div> <span><span class=\"chunter\">\"And speaking of Sakura..... Hmm, only late by a mere 3 minutes.\"</span> Yoneda remarked, taking full notice of Sakura, as she entered the office itself, where the other members of Flower Division were present as well. <span class=\"clred\">\"Yeah, what took you so long anyways, Sakura?\" </span>Kanna asked, looking at the young Japanese woman, wondering what exactly kept her preoccupied. From there, as she performed an apologetic bow, Sakura then spoke toward both her commanding officer and her fellow comrades as she replied, <span class=\"cppink\">\"My apologies, everyone. I was a little preoccupied with someone.\"</span><br>\r\n<br>\r\n<span class=\"cgrape\">\"And who exactly was it, Sakura?\"</span> Maria sternly and bluntly questioned, looking at Sakura with that stone-faced glare of hers. In response, Sakura turned around, opening the door behind her, as she spoke outside the room and said, <span class=\"cppink\">\"You can come in now, Dalton.\"</span> From there, the group noticed someone walk through the doors, revealing to be Dalton Lincoln himself. The first thing they took awareness of was Dalton's overall stature, looking to be almost as tall as Kanna Kirishima herself, who stood at a staggering height of 6 feet 6 inches, which made him the second tallest person in the room. <br>\r\n<br>\r\nThen, he stood and faced Commander Yoneda, where he then gave the Flower Division's commanding officer a military salute and answered, <span class=\"corange\">\"Lieutenant Captain Dalton Coulson Lincoln, reporting for duty, sir.\"</span> Of course, as a military officer himself, Yoneda returned the salute as well, then putting his arm back down and answered, <span class=\"chunter\">\"At ease, Lieutenant Captain.\"</span> From there, Dalton lowered his arm back to his side, just as Commander Yoneda motioned him to have a seat nearby, which Dalton obliged and sat down in a nearby seat, large enough for someone with his physicality. <br>\r\n<br>\r\nAs Yoneda sat down in his respective seat at his desk, he turned to face Dalton and asked, <span class=\"chunter\">\"I assume that your journey was rather eventful?\"</span> <span class=\"corange\">\"Aside from transforming into my Titan Form and fighting against the giant beast with the antlers? ....Yeah, it wasn't exactly what I would call eventful, Commander Yoneda.\" </span>Dalton answered, reminiscing on his journey to Tokyo, Japan a little, since he arrived her by ship. <span class=\"clilac\">\"So, you were fully aware of \"His\" powers? And you didn't even bothered telling us this?!\" </span>Sumire barked, obviously frustrated toward Commander Yoneda's decision to keep them in the dark involving Dalton's power to transform into a Titan.<br>\r\n<br>\r\n<span class=\"cgrape\">\"Calm down, Sumire. I'm sure Commander Yoneda has his reasons for keeping us in the dark like this.\" </span>Maria flatly remarked, simmering Sumire's ego enough to keep her calm, causing the heiress to let out a frustrating exhaled breath, as she sat back down on the lounge sofa alongside Orihime and Kanna. <span class=\"corange\">\"Look, I understand that you girls just found out about someone like me and have.....mixed opinions involving what I am, but I'm willing to give you some answers if needed.\"</span> Dalton answered, looking at the members of Flower Division, each looking at him, including Sakura herself.<br>\r\n<br>\r\nThe first person to ask him such questions regarding his powers was Li Kohran, the Flower Division expert on Koubu technology, as she looked at Dalton and asked, <span class=\"cgreen\">\"Alright, so.....what exactly is the trigger to your transformation? Do you have to inflict physical harm upon yourself?\"</span> Upon listening to Li's question, Dalton spoke to her and answered, <span class=\"corange\">\"No. The trigger to my transformation into a Titan is caused by rage. Basically, an intense amount of anger. Usually, I think of something that pisses me off in order to trigger my transformation into my Titan Form.\"</span><br>\r\n<br>\r\n<span class=\"clred\">\"Alright, so how long have you been like this, anyway?\" </span>Kanna asked, being the next person with a question, which prompted Dalton to answer rather quickly, as he looked at the Amazon-like redhead and explained, <span class=\"corange\">\"...3 years. I've had this power for 3 straight years. Ever since I was 17 years old, I've been trying to control this power, master it. When I first transformed, I didn't have control over my actions. But over time, I learned how to hone my rage, use it as a weapon against anyone who wants to harm those who can't even defend themselves. Sometimes, in order to kill the monsters.....you have to become one yourself.\"</span><br>\r\n<br>\r\nAlthough the other members of Flower Division each wanted their two cents into what exactly Dalton was capable of in his Titan Form, the next person to ask him for an answer was....</span></div></div>",
            "created":1464670800,
            "id":2156689,
            "title":"Better Late Than Never"
        },
        "11121111122221":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Orihime, who demanded to know what that giant antlered beast was exactly.",
                "Iris, who was curious as to know when Ichiro Ogami will return to Tokyo.",
                "Actually, Dalton or one of the other Flower Division members said something else"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cppink\">\"So, you were able to understand what I was saying last night?\" </span>Sakura asked, realizing what it meant when Dalton previously said that he had control over his Titan Form, resurfacing what she pleaded to him last night, looking at him for an answer from the towering American. Of course, Dalton turned his head to directly look at the young woman, where he spoke to her and answered, <span class=\"corange\">\"Every single word, Sakura. At first, when I laid eyes upon you and your two friends, I wasn't sure if you were human or not, since you were using those Koubus. However, when I heard you speak for the first time, something in my gut told me that you and your friends were human. At least that gut feeling of mine was right all along.\"</span><br>\r\n<br>\r\nFeeling reassured by his honesty, Sakura then spoke toward Dalton and said, <span class=\"cppink\">\"....Thank you.\"</span> <span class=\"corange\">\"For what?\" </span>Dalton asked, somewhat confused as to why Sakura was thanking him, just as the young Japanese woman then replied, <span class=\"cppink\">\"....For saving us last night. I mean, we all wanted to thank you ourselves but you were unconscious. ....Well, most of us, anyway.\"</span> Of course, Sakura was referring to the spoiled heiress herself, Sumire Kanzaki, who had her lithe arms crossed in a slightly frustrated manner. <span class=\"corange\">\"Well, I guess that would explain why you were carrying a bouquet of flowers when I woke up.\" </span>Dalton remarked, rubbing the back of his head with his left hand, meshing through his short dirty blonde hair, blushing a little in the process, finding Sakura to be somewhat attractive in his eyes.<br>\r\n<br>\r\nGetting back on topic, Sakura then spoke toward him and asked, <span class=\"cppink\">\"Okay, but....if you're separated from your \"Titan Form\", what happens to it?\"</span> <span class=\"chunter\">\"I believe I can explain such an occurrence, Sakura.\" </span>Commander Yoneda said, gaining the attention of both Sakura and the other Flower Division members, as the second-in-command, Vice Commander Ayame Fujieda, approached the group with a large file in her arms. From there, she laid the file on the surface of coffee table, opening it up to reveal it's contents, which included various black and white photographs of the lifeless Titan body from last night, as each photo showed the Titan's body decomposing until there was nothing but a giant humanoid skeleton that remained.<br>\r\n<br>\r\n<span class=\"cgrape\">\"Judging from the photos, this must be what remains of Dalton's Titan Form. Why show us this, Commander?\"</span> Maria questioned, seeking for answers as to why Commander Yoneda was allowing the Flower Division to see such evidence, as Yoneda put his elbows on his desk, fingertips on both hands touching one another, where the Flower Division's commanding officer spoke toward the group and explained, <span class=\"chunter\">\"To elaborate, girls..... The reason why I'm showing you these photos is to present what happens when the connection between Dalton and his Titan Form are severed. When this occurs, the Titan body starts to decompose until only a skeleton remains. Moon Division has secured and transported the Titan bones to a secure location for research purposes. I believe that Dalton acts as a catalyst of sorts to bringing life to such a titanic entity.\"</span><br>\r\n<br>\r\n<span class=\"cgreen\">\"Oh, I see! Without Dalton, his Titan Form is nothing but a lifeless corpse.\"</span> Li answered, explaining what Commander Yoneda was explaining, only in layman's terms, which made things all the more understandable for the members of Flower Division. After all, it would make sense as to how Dalton would be able to control himself as a Titan: his original body acted both as a catalyst, and as the Titan's brain. However, the next person to speak was.....</span></div></div>",
            "created":1464757200,
            "id":2157171,
            "title":"Remnants of a Titan"
        },
        "111211111222211":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Eventually, he chose to join the Flower Division as their newest member.",
                "However, he needed more time to think about his decision.",
                "Actually, something occurred that diverted his attention....."
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cpink\">\"That's fine and all, Yoneda. But what about, I don't know, that giant monster with the antlers?! You can't simply ignore that....THAT THING!\"</span> Orihime exclaimed, obviously reminding her comrades of the massive antlered beast that Dalton fought ferociously against whilst in his Titan Form last night. From there, Maria eventually agreed with Orihime upon such a subject, prompting the blonde markswoman to speak to her commanding officer and said, <span class=\"cgrape\">\"....Orihime's right. After all, this creature simply can't be outright dismissed as something non-threatening. We all witnessed how hostile it was toward us in the field of battle.\"</span><br>\r\n<br>\r\nHowever, after a moment to gather his thoughts, Commander Yoneda spoke his thoughts toward both Dalton and the Flower Division, and explained, <span class=\"chunter\">\"....I am fully aware of such a monstrous threat, Miss Tachibana. This is why I've decided to bring this news before the Council of Elders. Due to it's grotesque appearance, Fujieda and I have appropriately named these creatures as \"Chimera\", due to the mixture of body parts from various animals to create such a beast.\"</span> <span class=\"clred\">\"Alright, so how do we stop these Chimera, anyway? Build a Titan-sized Koubu?\" </span>Kanna questioned, making a rhetorical remark involving a gigantic Koubu, which would seem somewhat absurd to create and operate.<br>\r\n<br>\r\n<span class=\"chunter\">\"Well, I believe Lieutenant Captain Lincoln here has already given us a fitting solution. After all, he said so himself: \"Sometimes in order to kill monsters, we have to possess a monster of our own\". Isn't that correct, Dalton?\" </span>Yoneda answered, looking at Dalton when he mentioned that the American had already provided a solution against the titanic Chimera creatures. Of course, Dalton had just figured out what Commander Yoneda had in mind, as the towering American looked at the military commander and said, <span class=\"corange\">\"In other words, you want me to join your Flower Division, don't you?\"</span><br>\r\n<br>\r\n<span class=\"clilac\">\"Commander?! You can't be serious?! We already have a man in our group! And yet, he's all the way across the continent and resides in Paris!\" </span>Sumire yelled, fuming some towards her commanding officer's decision to have Dalton join the Flower Division. Of course, like anyone with such a high-strung temper, Sumire aggressively walked out of the room, slamming the door behind her in the process. <span class=\"corange\">\"Umm..... Is she always this high-strung?\"</span> You asked Sakura and the others, pointing to where Sumire walked out of the room. <span class=\"cgreen\">\"Yeah, pretty much. But you'll get used to it eventually.\" </span>Li replied, having adjusted to the heiress's fuming outbursts before. <br>\r\n<br>\r\nHowever, what sparked your curiosity was when Sumire had mentioned that they already had a male comrade aside from Commander Yoneda. So, to sate your curiosity, you looked at Sakura and asked, <span class=\"corange\">\"....Sumire mentioned you and your friends had a man in your squad. Who was she talking about?\"</span> <span class=\"cppink\">\"She was talking about our squad leader, Ichiro Ogami. Normally, he would be present as well, but he's currently in Paris to aid the Paris Assault Force.\" </span>Sakura answered, confirming your suspicions, along with validating that the Flower Division wasn't the only military force that use Koubus.<br>\r\n<br>\r\nThough as for his decision when it came to joining the Flower Division, Dalton was sort of at a crossroads. After all, he was assigned to Commander Yoneda by his superiors  back in the U.S. On one hand, it sounds like his power to transform into a Titan was needed more than ever. But on the other hand, he wasn't aware that such monstrosities like the demons, the possessed machines, or that gigantic antlered beast now known as a Chimera, physically existed in this world. Despite such revelations, he knew that eventually he would have to make a choice in such an urgent and dire matter.</span></div></div>",
            "created":1464757200,
            "id":2157210,
            "title":"A New Breed of Enemies"
        },
        "1112111112222112":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Fast forward to when Sakura & Dalton enter the park, overlooking the city.",
                "Meanwhile, across the other side of Tokyo, something sinister stirred....",
                "Actually, something else occurred instead of the two choices above...."
            ],
            "content":"<div class=\"\"><div> <span>Although he knew that the current situation on-hand was a rather dire but somewhat grim scenario, Dalton needed some time to wrap his mind around such a major decision as transferring to the Flower Division. After all, he already had become accustomed to accepting the truth involving his ability to change into a 15 meter tall Titan, but discovering such grandiose information as a team of women who use large mechanized suits of armor to combat hordes of demons was another matter entirely. <br>\r\n<br>\r\nShortly after he stood up from his chair and exhaled a deep breath or two, Dalton finally spoke his thoughts to the group and answered, <span class=\"corange\">\"Wow.....this is, um......quite a lot to take in, sir. I....I need some time to think about what you're offering me.\"</span> From there, Dalton proceeded to exit Commander Yoneda's office, carefully closing the door behind him upon treading through the doorway. Moments later, out of some debt to the one who saved her life more than once, Sakura decided to follow Dalton, exiting the office as well. <br>\r\n<br>\r\nHowever, just as the remaining members of Flower Division were about to follow suit, Yoneda calmly spoke to them and said, <span class=\"chunter\">\"No, let them go.\"</span> <span class=\"cgreen\">\"But why, Commander?\" </span>Li asked, confused as to why Yoneda would not allow them to follow Sakura and Dalton. In response, Commander Yoneda spoke toward the group and calmly explained, <span class=\"chunter\">\"....Its because he needs time to digest the information we revealed to him. After all, Dalton was already aware of his ability to change into a Titan for a mere few years now, and realizing that there is a highly-classified division of people who use advanced technology to defeat inhuman monstrosities is a lot for a man of his stature to swallow. All we can do now is to hope that Sakura would be able to persuade him to join the Flower Division.\"</span><br>\r\n<br>\r\n––––––––––––––––––––<br>\r\n<br>\r\nMeanwhile, as Dalton proceeded down the lavish hallway of the Grand Imperial Theater, he heard Sakura approaching from behind him, as she spoke to the towering American and said, <span class=\"cppink\">\"Dalton, please wait!\"</span> <span class=\"corange\">\"Look Sakura, I appreciate your company and all, but....I need some time to think this over. Alone.\"</span> He replied,  trying not to sound hostile toward the young woman. However, Sakura had no intention on backing down if it meant helping Dalton understand the group's cause and motives. <br>\r\n<br>\r\n<span class=\"cppink\">\"I'm fully aware of that, Dalton. It's just that....you remind me a bit of myself when I was asked to join the Flower Division.\"</span> Sakura answered, revealing a sliver of her backstory to the American towering before her. Of course, hearing what Sakura had said to him rung through his mind almost like an echo, which softened his mood some, allowing him to open up a little. From there, moments after Sakura spoke her mind to him, Dalton looked down at the young woman and asked, <span class=\"corange\">\"So, um....do you know anywhere we can go? I need to get some fresh air.\" </span><br>\r\n<br>\r\n<span class=\"cppink\">\".....There is a large park full of Cherry Blossom trees we can visit. I usually go there when I'm having troubled thoughts.\" </span>Sakura answered, where she then gently led him out of the Grand Imperial Theater's interior and out onto the streets of the Imperial Capital, despite the fact that Dalton was larger than Sakura overall.</span></div></div>",
            "created":1464843600,
            "id":2157741,
            "title":"Getting A Breather"
        },
        "11121111122221121":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Dalton agreed to join the Flower Division, becoming their newest member.",
                "But just as he made up his mind, the alarm sounded of an enemy attack.",
                "Meanwhile, across the city, a sinister plot began to stir...."
            ],
            "content":"<div class=\"\"><div> <span>After around 3 hours of being transported by rickshaw, Dalton and Sakura arrived at the entrance to the park that she mentioned previously, where they then walked up a long flight of stone stairs, which were constructed for traversing uphill. Of course, Dalton was adjusted to long walks like this since his days in the military, where they had to run 10 to 15 miles per day as part of their training regimen.<br>\r\n<br>\r\nHowever, once they reached the top of the stairs, Dalton bore witness to the majestic sight before him and Sakura. Of course, Sakura was well-adjusted to seeing the park due to she visits here often. But Dalton on the other hand, he had never seen Cherry Blossom trees before until now, as the park looked like something out of a fairytale, rendering him almost speechless, as he muttered in awe and said, <span class=\"corange\">\"Wow......\"</span> <br>\r\n<br>\r\nAs they casually entered the park itself, Dalton slowly rotated his body while walked, his eyes somewhat wide with amazement and awe. <span class=\"cppink\">\"*giggle* I take it that is your first time seeing a Cherry Blossom tree?\"</span> Sakura asked, finding it rather funny at how Dalton was reacting at this moment. <span class=\"corange\">\"Wait, these are Cherry Blossoms? I'm sorry if I'm acting weird, but this.....this all looks like something out of a fairytale, Sakura.\"</span> He confessed, being honest about his behavior seconds ago. <br>\r\n<br>\r\n<span class=\"cppink\">\"I can understand the feeling. After all, Cherry Blossoms representing Spring and renewal, Dalton. They're very important to my country.\" </span>Sakura explained, telling him how significant the Cherry Blossoms were to the Imperial Capital and Japan as a whole. From there, the young Japanese woman motioned Dalton to follow her some more, which ended with the two individuals sitting on a bench near the edge of the cliff, giving them a breathtaking view of the city as a whole. At this point, Dalton felt like his jaw metaphorically dropped to the floor upon seeing the the vast urban landscape stretched out before him and Sakura. <br>\r\n<br>\r\n<span class=\"cppink\">\"Breathtaking, isn't it?\"</span> Sakura said, looking at the speechless American beside her, as he then sat down alongside her, taking in the scenery around him, as he nodded yes in response. After minutes of soaking in the sights, Dalton then spoke toward  Sakura and asked, <span class=\"corange\">\"So....why did you bring me out here? You know, aside from sightseeing.\"</span> <span class=\"cppink\">\"We came here to show you what the Flower Division is devoted to protect.\"</span> Sakura answered, as she then pointed to her left toward a set of damaged and destroyed buildings, each undergoing repairs from what transpired last night. Upon seeing the wreckage from a distance, Dalton quickly realized what exactly it meant, as he then looked at Sakura and said, <span class=\"corange\">\"That....That was where we first met and where I fought against Chimera.\"</span><br>\r\n<br>\r\nFrom there, Sakura nodded in confirmation and replied, <span class=\"cppink\">\"Exactly. The Imperial Capital is home to many innocent people, Dalton. Much like how you defeated that Chimera and protected us, me and the other members of Flower Division are dedicated to protecting the people of Tokyo, even to the point where we risk our lives to protect the innocent, those who would get caught in the crossfire. I know that you're still somewhat unsure about our motives, but I promise you: We're on the same side, we just simply don't have the same kind of power that you possess. Nothing more, nothing less.\"</span><br>\r\n<br>\r\nDalton couldn't help but admit to himself that Sakura made a very persuasive speech toward him, admiring her persistence. Eventually, after a considerable amount of time pondering about his final decision on the matter.....</span></div></div>",
            "created":1465047780,
            "id":2158686,
            "title":"Among The Cherry Blossoms"
        },
        "111211111222211212":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "From there, Dalton, in his Titan Form, sprinted his way toward the battlefield.",
                "Meanwhile, Sakura and the others heard Dalton's roar, fighting the robots.",
                "Actually, Central Command began to pick up another large signature...."
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately, just as Dalton was about to make his decision involving the Flower Division, a loud siren was heard, echoing throughout parts of the city, as a woman's voice could be heard among the siren's wail, as it said, <span class=\"cindigo\">\"Emergency! An unknown giant creature is attacking the Ginza District! Flower Division, prepare to head out! Citizens, please evacuate the area immediately!\"</span><br>\r\n<br>\r\n<span class=\"cppink\">\"Let's go, Dalton! Let's head back to the theater! We need to stop this creature!\"</span> Sakura exclaimed, just as the other people in the park began to steadily evacuate. However, since he wasn't fully committed to joining the Flower Division, he wasn't sure if it was another Chimera or just an oversized demonic robot, he spoke toward Sakura and said, <span class=\"corange\">\"You go on ahead without me, Sakura. I'll catch up with you!\"</span> Sakura could still tell that he was having a little difficulty making up his mind, so she spoke to the towering American and replied, <span class=\"cppink\">\"....Alright, but don't take too long.\"</span><br>\r\n<br>\r\nAnd like that, Sakura hurried out of the park to rendezvous with her fellow comrades, leaving Dalton by himself at the park. After all, she could obviously see the struggle in him, as if it was like a reflection of herself when she was first assigned to the Flower Division. However, she shifted her focus to return to the Grand Imperial Theater to suit up in her Koubu. Fortunately, the Flower Division was given access to a fast-travel system via man-sized pods connected to a series of large underground pipeways which all converge upon the Grand Imperial Theater's underground headquarters, where Sakura used one of these pipelines near the park, entering inside and quickly traveling back to her comrades. <br>\r\n<br>\r\n––––––––––––––––––––––<br>\r\n<br>\r\nShortly after returning to the Grand Imperial Theater, Sakura got herself undressed and put on her combat uniform, where she then proceeded to her Koubu, positioning herself inside as the cockpit hatch closed inward, licking her inside prepped for combat with the enemy. Of course, Commander Yoneda informed both her and the other Flower Division members that there was a platoon of demonic robots alongside the titanic creature, now confirmed as another Chimera. However they noticed that this Chimera had a much more varied appearance compared to the previous Chimera. <br>\r\n<br>\r\nIn appearance, this new Chimera had a much more bulkier physique, more akin to a gorilla. That is, if a gorilla had brownish-gray scales and had the head of a Komodo Dragon but with the teeth of a lion. It's hands looked like a set of bear paws, complete with stubby thick paw-like fingers and curved claws, as it walked on it's knuckles like a gorilla would in Africa. Finally, the Chimera's hind legs were like a bull's hind legs, complete with a set of hoof-like feet and thick muscular digitgrade legs, covered in brownish-gray scales with white tiger stripes on the thighs. <br>\r\n<br>\r\nBut as the group was launched and heading toward the battlefield, Sakura's thoughts turned to Dalton, worried about what he was going to do, as she thought to herself and said, <span class=\"cppink\">\"Dalton.....I hope you are able to understand. Please, do what you think is right.\"</span><br>\r\n<br>\r\n–––––––––––––––––––––––<br>\r\n<br>\r\nMeanwhile back at the park, Dalton continued to struggle on his decision. Sure, he was already aware of the threat that has now showed it's ugly beastly mug once more, but......Was it really \"His\" fight to begin with? His thoughts went back and forth on the subject, currently at a stalemate, as he looked at both of his hands and thought, <span class=\"corange\">\"....What should I do? *Sigh* if only my sister was here, she would've told me off and tell me to go save lives. And yet, Sakura......she felt like my sister reincarnated.\"</span><br>\r\n<br>\r\nSuddenly, his thoughts were abruptly interrupted by a loud and deep inhuman howl, \"KKUWAAAAAAAAAAAAGHHAAAAAAAAA!!!!!!!!!!!\" From there, Dalton quickly stood up and saw what exactly made such a noise, revealing to be another giant creature like the Chimera from last night. <span class=\"corange\">\"That creature.....could it be another Chimera?\" </span>He asked himself, just as he noticed a group of fast moving objects rushing toward the massive beast from a distance.<br>\r\n<br>\r\n<span class=\"corange\">\"That must be Sakura and her friends, but.....they don't stand a chance against that monster!\" </span>He thought to himself once more, remembering the events from last night, knowing that they're able to fight against those possessed machines, but their chances of defeating such a massive creature were very slim to none, which heaved more on his moral conscience, as he began to pace around slightly.<br>\r\n<br>\r\nBut then, a dreadful thought came to him as he said, <span class=\"corange\">\"But if I don't help them, they.....they're gonna die. And it'll be all my fault, just like what happened to Emily!\" </span> The thought of his sister's tragic demise haunted him, and the same thing that could potentially happen to Sakura and her comrades weighed more on his moral compass. But then, a burning spark erupted inside him as he growled, <span class=\"corange\">\"NO!! ....I will not lose anyone else. EVER. AGAIN!\" </span> He knew that feeling all too well: it was the Titan side of him, clawing it's way up, causing his eyes to quickly change from green to a burnt orange hue. His breathing became more aggressive, his fingers tightly clenched into a set of fists! He now knew what he had to do: he had to become a Titan once more and protect Sakura from the monster!<br>\r\n<br>\r\n<span class=\"corange\">\"In order to kill a monster, I must become one myself!\"</span> Dalton hissed under his own breath, remembering those words he said to the members of Flower Division earlier, as he then sprinted toward the cliffside at full speed, where he then leapt off the cliff and began plummeting toward the ground below! His anger building up, his rage boiling over until......THOOOOM!!!!! A large pillar of flaming light erupted from where Dalton stood, his human body encasing itself in bone, muscle, and skin, forming a massive physical form! And once he landed hard upon the ground, he had completely transformed into his Titan Form once again, steam rising from his newly-created form, unleashing a powerful guttural howl to let his presence be known across the area for miles, screaming into the air and roared, <span class=\"corange\">\"GGRRAAAAAAAAAAAAAAAAAAAAAAAAAAAH!!!!!!!!!!!\"</span></span></div></div>",
            "created":1465053900,
            "id":2158729,
            "title":"The Call of Duty"
        },
        "1112111112222112121":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Meanwhile, Dalton quickly recovered, ready for another fight with the Chimera.",
                "Sakura & the others continued to fight the possessed machines.",
                "Actually, something was happening on the other side of Mount Fuji......"
            ],
            "content":"<div class=\"\"><div> <span>With a limited window of time, Dalton hurried toward where Sakura and the others were fighting the new Chimera, swiftly transitioning into a full-on sprint, clocking in at 75 miles per hour in 2 seconds flat. About 5 blocks down, Dalton quickly turned a sharp right, his Titan body responding to his thoughts on where to go, his inhuman speed staying consistent the whole way through.<br>\r\n<br>\r\nAlong the way, a large group of people evacuating the Ginza District were directly in his path, forcing him to leap over them just as they attempted to quickly move onto the sidewalks, where they felt the violent gust of wind rushing past them as Dalton quickly passed by them, knock a dozen or two civilians off their footing. However from a distance, Dalton could see that the bulky Chimera had performed a powerful sonic attack as it screamed, \"KKUWAAAAAAAAAAAAGHHAAAAAAAAAAAAA!!!!!!!!!!!\" Seeing what the titanic creature had performed as it destroyed several buildings in the process, Dalton knew he had to kill it quickly, his thoughts racing involving Sakura and her friends. <span class=\"corange\">\"Come on, Sakura! Please don't die on me!\" </span>He thought, becoming increasingly concerned for her well-being, moving faster as he rapidly turned left on another intersection, directly leading into the Ginza District.<br>\r\n<br>\r\nUpon seeing the Chimera about to swipe it's large left arm toward Sakura, Kanna, and Reni, Dalton got even angrier, sprinting at 90 miles per hour until......KKRRAAANK!!!! Dalton rammed his Titan Form directly into the Chimera's side, sending the beast back by 6 blocks, as Dalton bellowed a guttural and hostile howl toward the grotesque monstrosity as he roared, <span class=\"corange\">\"GGRRAAAAAAAAAAAAAAAAAAAAAAAAAAAH!!!!!!!!!!!!\" </span> <span class=\"cppink\">\"Dalton!\"</span> Sakura exclaimed, looking up at him in his transformed state, as Reni proceeded to help her comrade up onto her feet with her Koubu and said, <span class=\"cnavy\">\"Come on, Sakura. We should help the others.\"</span> <br>\r\n<br>\r\nSakura nodded in agreement, just as she noticed the Chimera getting back up while Dalton moved his body into a fighting stance, hands clenched into fists and ready to deliver a beatdown. In a fit of rage, the Chimera retaliated by rushing at the Titan, running toward him on all fours like an ape, hoping to deliver the same attack, but Dalton quickly strafed to his left, avoiding the Chimera's arm swipe. From there, Dalton swiftly grabbed something fleshy underneath the Chimera's upper back, tearing out a large organ while the beast struggled and howled in frustration, which it used for it's sonic screams, as he tossed it aside like garbage! <span class=\"clred\">\"Hell yeah! Come on, Dalton! KICK IT'S ASS!!\" </span>Kanna yelled, obviously having a thrilled excitement along with cheering on the Titan.<br>\r\n<br>\r\nNow enraged, the Chimera quickly turned around, and wrapped it's thick arms around Dalton in a violent bear hug! Dalton responded by delivering several strong punches in hopes of freeing himself, but to no avail, as the Chimera tossed him 20 blocks away, landing him right in the middle of Tokyo's wharves! <span class=\"cppink\">\"DALTON!!\"</span> Sakura screamed, showcasing her concern for Dalton. However, before she could even head over to check on him, Kanna and Reni prevented her from doing so. <span class=\"clred\">\"Snap out of it, Sakura!\" </span>Kanna exclaimed, trying to reason with her.<br>\r\n<br>\r\n<span class=\"cnavy\">\"You've seen what this Chimera is capable of. If you go out there and help Dalton, there's a chance you can die!\"</span> Reni flatly explained, convincing Sakura that going up against the Chimera now was considered suicide. Left with no choice on the matter, Sakura ended her struggle and returned to fighting the demonic robots, as she could hear the Chimera's thunderous footsteps heading toward where Dalton was now currently located. <span class=\"cppink\">\"Dalton.....please be alright.\" </span>She thought to herself, praying that he was alright and still able to continue fighting.</span></div></div>",
            "created":1465129980,
            "id":2159195,
            "title":"Sprinting Toward Danger"
        },
        "11121111122221121211":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "However, Yoneda warned them that another Chimera has appeared!",
                "From there, Dalton aided Sakura & the others with killing the remaining robots.",
                "Later that night, Commander Yoneda attended the latest Council of Elders meeting"
            ],
            "content":"<div class=\"\"><div> <span>Meanwhile, deep within the devastated section of the Ginza District's wharf, Dalton shrugged off the backlash from being tossed by the Chimera just moments ago. Good news for him, he managed to divert the Chimera's attention away from Sakura and her friends. But the bad news is that the Chimera was now focused on him, since he did outright attacked the colossal beast. <br>\r\n<br>\r\n\"KKUUWAAAAAAAAAAAA!!!!!!\" The Chimera screeched, bellowing a threatening and angered roar toward the Titan, but Dalton wasn't phased by such a mere threat. After all, he knows what could happen if he backed off: the Chimera would return to fighting Sakura and her comrades, and destroying them. <span class=\"corange\">\"YOU'RE NOT HURTING THEM.\" </span>He thought, his mental voice meshed with his Titan's howls and roars, intent on protecting Sakura and the rest of the Flower Division from this monstrous abomination, emitting a threatening growl at the Chimera in response.<br>\r\n<br>\r\nIn response, the Chimera began charging toward the Titan, rushing toward him on all fours like a primate while screaming, \"KKUUWAAAAAAAAAAAA!!!!!! KKUUWAAAAAAAAGHAAAAAAAAAAAAAA!!!!!!!!\" <span class=\"corange\">\"GGRRAAAAAAAAAAAAAAAAAAAAAAAAAAH!!!!!\" </span>Dalton roared, as he quickly sprung onto his Titan feet, sprinting toward the Chimera with sheer ferocity, with both titanic forces rushing toward one another in an inevitable clash! But just as these two entities clashed, Dalton leapt into the air, twisting his Titan body to have his feet hit the Chimera on the snout with a powerful Titan-sized dropkick! <br>\r\n<br>\r\nAnd with a wet thunderous bone-cracking sound as the dropkick connected with the Chimera's head, the colossal monstrosity became staggered upon impact, just as Dalton fell onto the ground! Despite his tremendous size, he quickly sprung back onto his feet, where he then grabbed the Chimera by it's reptilian head and began to pummel it with several powerful punches! The Chimera attempted to counter it's opponent, but to no avail with each titanic punch it absorbed, as Dalton ended the barrage of fist attacks with a thunderous but powerful haymaker, knocking the Chimera into the side of a nearby warehouse, smashing through the building's wall and rooftop! <br>\r\n<br>\r\nIn retaliation, the Chimera then grabbed a nearby crane, tearing the machine from it's foundations, wielding it like a giant makeshift club! \"KUWAAAAAGHAAAAAA!!!!!!\" It howled, swinging the makeshift weapon at Dalton, forcing the Titan to dodge a few of the swings until he swiftly grabbed it's arm, whacked the titanic beast with a meaty backhand to stun it, then twisted the Chimera's arm toward it's back, and delivered a powerful kick from behind the gigantic creature, launching it into a set of much larger steel cranes! <br>\r\n<br>\r\nFor a moment, Dalton looked toward where Sakura and the others were fighting the demonic machines, as Sakura sliced through several of the machines with each sword swing from her Koubu-sized katana. Shortly after slicing through her 5th demonic robot, she turned and saw that Dalton was very much intact, feeling relieved to see he was alright. <span class=\"cppink\">\"Thank god, he's....he's alright.\"</span> She said to herself, letting out a sigh of relief. <br>\r\n<br>\r\nBut then, she suddenly saw that the Chimera was starting to get back up, as it violently rushed toward Dalton from behind! Quickly, Sakura screamed as loud as she possibly could and yelled, <span class=\"cppink\">\"DALTON, LOOK OUT!!!\" </span> Fortunately, Dalton heard Sakura's warning, as he quickly realized what was happening, where he dove down and rapidly delivered a swift kick toward the Chimera's right hooved leg, cracking it's bones some in the process!<br>\r\n<br>\r\nIn turn, this caused the Chimera's leg to buckle, as it toppled into another warehouse on it's side while it roared in rage and pain, \"KKUWAAAAAAAAAAAAGHHAAAAAAAAAAAAA!!!!!!!\" From there, Dalton proceeded to stand back up, as he then grabbed the heavyweight Chimera and tossed the titanic abomination over his head with all of his might, launching the Chimera into several rows of railroad cars, smashing the train boxcars, hoppers, and tank cars into smithereens upon impact! From there, Dalton grabbed a large piece of the steel crane, bending it into a makeshift club/spear, as he then rushed the Chimera while it was recovering from being thrown by it's adversary! And with a metal-grinding SKKRRUUNNK!!, Dalton swung his massive makeshift weapon like a giant metal baseball bat with tremendous power and force, causing the Chimera's lower jaw to crack and fracture upon impact with the metal beam, sending the colossal hybrid back on the floor stunned! <br>\r\n<br>\r\nThis left the ape-like beast open and vulnerable to attack, just as the Titan deliver several more downward swings against the Chimera before he proceeded to impale the bulky Chimera, as the large steel beam was thrusted through it's reptilian head, delivering that fatal blow against the Chimera! With his enemy dead, Dalton bellowed a victorious roar, howling into the sky as he roared, <span class=\"corange\">\"GGRRAAAAAAAAAAAAAAAAAAAAAAAAAAAH!!!!!!! GGRRAAAAAAAAAAAAAAAAAAAAAAAAAAAH!!!!!!!!\" </span> Of course, while they were clashing against their mechanical enemies, Sakura and her friends heard Dalton's roars of victory loud and clear, letting them know that the Chimera was now officially dead.</span></div></div>",
            "created":1465395240,
            "id":2160829,
            "title":"A Clash Of Colossal Proportions"
        },
        "111211111222211212113":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Meanwhile back at the theater, Dalton went to see how Sakura was doing.",
                "However, on the other side of the city, something sinister occurred....",
                "Fast forward to two weeks after the battle in the Ginza District....."
            ],
            "content":"<div class=\"\"><div> <span>Some time after the titanic battle that had occurred within the Ginza District, Commander Yoneda and his second-in-command, Vice Commander Ayame Fujieda, had assembled before a group of respective gentlemen, known only as the Council of Elders. Each member has supported the Flower Division by pooling in the necessary funds to develop the Koubu units they use in battle, manufactured by Kanzaki Heavy Industries. In layman's terms, they were a council of very wealthy individuals, each member having a single similar motive: To protect their beloved Imperial Capital of Tokyo from the relentless dark forces.<br>\r\n<br>\r\nHowever, one member stood out among the rest of his fellow Council members. In appearance, he was a physically fit individual currently in his twilight years, judging from his receding ivory white hair, with white sideburns and ivory white eyebrows, along with sporting several wrinkles on parts of his face. He wore the attire of a businessman, one whose experience has made him the distinct voice of reason to his fellow Council members. His name....was Count Yoritsune Hanakõji, and he had become the benevolent but fair head of the Council of Elders.<br>\r\n<br>\r\nCurrently, he and the rest of Council fazed upon the recorded stock footage of Dalton in his Titan Form, fighting against the Chimera that appeared today, with the elderly Yoritsune paying keen attention to the briefing by Ayame Fujieda, as she spoke toward the Council Elders and explained, <span class=\"cmaroon\">\"As you can see, gentlemen: the Titan was able to confront the Chimera within the Ginza District and was able to destroy it, despite the amount of collateral damage sustained during the battle.\"</span> <span class=\"clkhaki\">\".....Hmph! That's putting it mildly, Vice Commander Fujieda, considering how much property damage the wharf has undergone during the battle.\" </span>One council member remarked, obviously somewhat discontent with the overall cost of the damage caused during the fight between the Titan and the Chimera.<br>\r\n<br>\r\n<span class=\"clkhaki\">\"I agree. These creatures have caused nearly 2 million yen in property damage alone, not just structural damage but also in demolishing several hundred thousand yen in damaged cargo goods.\" </span>Another council member replied, agreeing with his colleague on such a trivial economic matter. However, Count Hanakõji spoke up his thoughts on the discussion at hand, simmering the tension brewing in the air a little, speaking to his fellow Council members with a calm but wise tone and answered, <span class=\"clgrey\">\"Gentlemen! I understand your concerns for the damage ensued during the battle between these two colossal entities. However, this is hardly the forum for an economic crises, for these.....\"Chimera\" creatures are a more dangerous threat than the mechanical monstrosities the Flower Division has been combating. Commander Yoneda, what can you tell us about this \"Titan\" creature that has fought against this Chimera?\"</span><br>\r\n<br>\r\nUpon being asked by Count Hanakõji regarding the Titan, Commander Yoneda cleared his throat some before speaking, as he faced the Count and the rest of the Council of Elders and explained, <span class=\"chunter\">\"To be more precise, gentlemen: the footage presented to you all just now was not the Titan's first appearance. Nearly 24 hours ago, he appeared to fight against another Chimera Fujieda and I have appropriately given the codename \"Wendigo\", due to it's malnourished yet powerful physique. The Chimera you've seen on film was given the codename \"Berserker\", because of it's aggressive and violent behavior. Now as for the Titan itself, gentlemen.....this should clear things up some.\"</span><br>\r\n<br>\r\nFrom there, Commander Yoneda handed out a detailed military file and dossier on Dalton Lincoln, showing the Council of Elders the Titan's true identity. <span class=\"clgrey\">\"Lieutenant Captain Dalton Coulson Lincoln. So.....I assume this happens to be the Titan's identity, Commander Yoneda?\"</span> <span class=\"chunter\">\"That is correct, Count Hanakõji. To elaborate, Dalton can transform himself into the Titan you all have witnessed from the stock footage we've presented. Now as for it's exact measurements, we've estimated that Dalton's Titan Form to accurately be 15 meters in height from head to toe, which makes him taller than a 4 story building.\" </span>Yoneda answered, giving some clarification to the other council members regarding Dalton's ability to transform into a Titan.<br>\r\n<br>\r\n<span class=\"clkhaki\">\"This is ridiculous! How can one man transform into such a creature? It seems impossible.\"</span> Another council member said, obviously skeptical involving the information revealed to them. In response, Yoneda calmly fired back and replied, <span class=\"chunter\">\"I understand the skepticism, gentlemen. However, according to the information that Lieutenant Captain Lincoln has revealed to both me, Fujieda, and the Flower Division, he had this ability to transform into a Titan for 3 straight years, which meant that he was merely 17 years of age when he acquired such power. Now as for the trigger to this transformation, Dalton explained that it is caused by an intense amount of anger, allowing him to transform into the state that was shown on the film. And from what I've seen so far, it appears that Dalton is keen on protecting one of the Flower Division's members, Ms. Sakura Shinguji, judging from his behavior of course.\"</span><br>\r\n<br>\r\n<span class=\"clgrey\">\"You make it sound like Ms. Shinguji is the beauty, and Dalton as the beast.\"</span> Count Hanakõji said, obviously seeing the connection from what Commander Yoneda had explained previously. In response, Yoneda let out a light chuckle and replied, <span class=\"chunter\">\"Maybe.... But it's obvious that Dalton happens to be very protective of Sakura and her comrades, since he has saved them more than once against the Chimera during the past 24 hours. However, despite the collateral damage, I believe that having Dalton as a member of the Flower Division will be a wise choice, since it seems the Koubu units might not withstand the raw power of these Chimera. After all, Lieutenant Captain Lincoln said so himself: \"In order to kill monsters, we must have one of our own\". Therefore, I believe that having Dalton as a member of the Flower Division is the right decision.\"</span><br>\r\n<br>\r\nHowever, just as a few of the Council members were about to argue over Commander Yoneda's decision to allow Dalton to be a member of Flower Division, Count Hanakõji made a physical gesture to cease their rabble, as he then spoke toward Commander Yoneda and answered, <span class=\"clgrey\">\"....Very well, Commander. We'll allow Lieutenant Captain Lincoln to join the Flower Division. Keep us informed regarding such a......unique individual.\"</span> With that, Commander Yoneda and Vice Commander Fujieda took their leave, returning to the Imperial Grand Theater. Of course, this struck a nerve for one or two of the Council members once the two individuals left the room.</span></div></div>",
            "created":1465743480,
            "id":2162999,
            "title":"A Political Tribunal"
        },
        "1112111112222112121131":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "However,on the other side of Tokyo, something sinister was stirring.....",
                "Fast forward to a week, as Sakura & the others were rehearsing a play.",
                "Actually, let's skip to around two weeks later, and see what's happening...."
            ],
            "content":"<div class=\"\"><div> <span>Meanwhile back at the Grand Imperial Theater, Sakura and the other members of the Flower Division had returned from their battle against the possessed robots and the Chimera known as \"Berserker\" merely hours ago, with Dalton in tow. Of course, Dalton helped in destroying the remaining steam robots after killing Berserker, using his Titan Form to smash groups of the demonic machines to kingdom come. <br>\r\n<br>\r\nCurrently, as he was roaming through the hallway corridors of the theater, Dalton approached the door to Sakura's bedroom, knocked on the door with the back of his hand once or twice, and asked, <span class=\"corange\">\"Sakura, it's me. Mind if I come in for a minute?\"</span> <span class=\"cppink\">\"Not at all! Just give me a second.\" </span>Sakura quickly replied, since she was currently getting dressed for bed. A moment later, Dalton heard and noticed the door opening, as he then walked inside her room.<br>\r\n<br>\r\n<span class=\"corange\">\"How are you holding up, Sakura?\"</span> He asked, wanting to know if Sakura wasn't injured during the battle against the Chimera from earlier, where Sakura turned around to face him and answered, <span class=\"cppink\">\"I'm alright, Dalton. Thank you.\"</span> <span class=\"corange\">\"For what?\"</span> Dalton said, raising an eyebrow out of slight confusion, as Sakura walked over to her bed and sat down on the bed's mattress, then looked at Dalton and replied, <span class=\"cppink\">\"...For saving me and my friends twice already. Both from last night and today as well.\"</span><br>\r\n<br>\r\nFrom hearing such a thankful response, Dalton couldn't help but blush some, scratching the back of his head a little and answered, <span class=\"corange\">\"I, uhh.....Y-You're welcome, Sakura.\"</span> From there, Sakura gestured Dalton to have a seat next to her, which he accepted, as he sat down beside the young Japanese woman. However, despite the bed creaking a little due to Dalton's overall size and height, it managed to hold up pretty well.<br>\r\n<br>\r\nShortly after an awkward moment of silence between the two individuals, Dalton spoke up toward Sakura and said, <span class=\"corange\">\"So, um....I'm guessing you're wondering what my reasons were for coming to save you, huh?\"</span> <span class=\"cppink\">\"Well, that thought never crossed my mind, Dalton.\"</span> Sakura answered, replying with honesty in her tone of voice, believing that Dalton rescued Sakura and her comrades out of the goodness in his heart. Although that was true to an extent, Dalton knew that there was more to his actions from the past 24 hours than just a crisis of conscience.<br>\r\n<br>\r\nKnowing that it was better to confess now rather than later, Dalton spoke his mind and answered, <span class=\"corange\">\"The truth is, Sakura.....I had my reasons for coming to rescue you and your friends. And it's more than just one single form of motivation. You see, I.....I once had a sister back in Illinois. Her...Her name was Emily Attano Lincoln. You would both get along great if she were here.\"</span> In honesty, Sakura was a little surprised at the realization that he had a sister, so she looked at him and replied, <span class=\"cppink\">\"Really? I didn't know you actually had a sister, Dalton.\"</span> <br>\r\n<br>\r\nHowever, Sakura then noticed this slightly depressed look on Dalton's face, realizing that something bad might've happened to his sister Emily, where she then spoke toward him and asked, <span class=\"cppink\">\"Something.....bad happened to your sister....didn't it?\"</span> In response, Dalton slowly nodded in confirmation, then spoke to Sakura and confessed, <span class=\"corange\">\"Emily....was attacked by a local gang of thugs, they wanted to rape her, but......one of them accidentally stabbed her in the stomach. With a knife. She....she died of internal bleeding within a few hours. The trauma of....of her death was the catalyst for my powers: The power to transform into a Titan.\"</span><br>\r\n<br>\r\nUpon hearing the tragic fate of Dalton's sister, Sakura was reminded of her father and his passing, fully understanding how Dalton felt about losing a loved one, as she spoke to him and said, <span class=\"cppink\">\"....I understand your pain, Dalton. My father....he died of illness when I was only 16 years old.\"</span> From hearing of Sakura's own loss, Dalton felt somewhat reassured, as he looked at her and replied, <span class=\"corange\">\"....Thank you, Sakura. That means a lot.\"</span> From there, he continued speaking and said, <span class=\"corange\">\".....Ever since the death of my sister Emily, I began to develop something the Shrinks call \"Thantophobia\". The fear of losing someone I deeply care about, even love. You remind me very much of Emily, Sakura. You're kind, gentle, and polite, always having a bright and cheerful personality coupled with a strong sense of justice. She....she was studying to becoming a Judge for the Supreme Court before the events that transpired that night. If she were still alive, she would've been the same age as you, Sakura. And I'm sure the two of you would have become the best of friends.\"</span><br>\r\n<br>\r\nFinding a way to cheer up the mood some, Sakura spoke toward Dalton once more and answered, <span class=\"cppink\">\"When I was just a young girl, if I was hurt, my father once told me \"Sakura: scars only remind us of who we are, they don't dictate where we're going in life\". At first, I didn't understand what he meant, but I later understood what he was saying as I got older.\"</span> <span class=\"corange\">\"Your father sounds like an honorable and kind man.\" </span>Dalton said, understanding what Sakura was telling him, along with feeling reassured from those words of wisdom. <span class=\"cppink\">\"I....I know I've already said these words, but....Thank you. For opening up to me.\"</span> Sakura replied, just as she then performed something very unexpected: She planted a tender kiss on Dalton's right cheek, causing him to blush a deep crimson hue, smirking a bashful smirk on his face.<br>\r\n<br>\r\n<span class=\"corange\">\"I, er....I... I s-should be getting to bed. It's....It's been a long day.\" </span>Dalton bashfully answered, causing Sakura giggle a tiny bit from Dalton's blushing, nodding in agreement with the day already transitioning into a moonlit night. From there, she spoke toward Dalton and replied, <span class=\"cppink\">\"Agreed, it is getting rather late. Well, good night, Dalton.\"</span> <span class=\"corange\">\"Same to you, Sakura.\"</span> He said, as he then stood up from Sakura's bed and walked out the door, still branding a crimson blush on his face, like a boy having a crush on a girl of his dreams. However, shortly after he closed the door as he left, Sakura couldn't help but blush a little herself, beginning to develop some potential romantic feelings toward Dalton, while she laid on her bed and covered herself in the bedsheets, along with turning off the lamp light in the process. From there, only her dreams await, as she closed her eyes and dozed off, waiting for a new tomorrow.</span></div></div>",
            "created":1466007720,
            "id":2164656,
            "title":"After The Storm"
        },
        "11121111122221121211312":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "\"Actually, I was thinking it should be you, Dalton.\"",
                "\"To be honest, I was considering either Kanna or Maria for the role.\"",
                "Actually, he said someone else's name instead....."
            ],
            "content":"<div class=\"\"><div> <span>An entire week had come to pass since the battle within the Ginza District and it's adjacent wharves, and things had seemingly calmed down. However, due to the eyewitness sightings of the Titan, word of such a titanic creature spread like wildfire, whether it originated from idle gossip or from the local newspapers that included photographic evidence of the Titan fighting the equally large Chimera.<br>\r\n<br>\r\nFortunately for Dalton, they weren't able to deduce the Titan's identity nor it's connection to him.....at least, for now anyway. Of course, Dalton had already made his decision to join the Flower Division, much to Sumire's chagrin and complaints. And over the course of 7 whole days, Dalton was able to spend a bit of time with each of the Flower Division's members, whether it ranged from attending sparring matches with Kanna Kirishima, to assisting Li Kohran in repairing and doing maintenance on the Koubu units, to even exploring the city of Tokyo with Sakura as his guide. <br>\r\n<br>\r\nOverall, despite the rumors buzzing around involving the Titan, Tokyo slowly but progressively returned to normal, as the property damage ensued from the Titan's previous appearances were fully restored to their original conditions before those two battles. <br>\r\n<br>\r\n–––––––––––––––––––––––––â €“–<br>\r\n<br>\r\nCurrently, as he was wandering around the Grand Imperial Theater's interior, Dalton accidentally stumbled onto the door leading backstage, hearing several voices echoing out due to the auditorium's overall size, scale, and space. One of those voices he recognized was Sakura's, as he thought to himself and said, <span class=\"corange\">\"Hmm, wonder what they're doing in there.\"</span> Letting his curiosity get the better of him, Dalton cautiously proceeded to enter backstage, wanting to catch a glimpse of what the commotion was about, being as discreet as he possibly could. <br>\r\n<br>\r\nMoments after stepping inside backstage, Dalton took a peek and saw Sakura, Iris, and several other members of the Flower Division reading what appear to be scripts to a play in each of their hands. <span class=\"corange\">\"Oh yeah, that's right: they're rehearsing for a play. Wonder what kind of play they're going to perform?\"</span> Dalton curiously thought, theorizing on which play they intend on performing. However, he then heard a familiar voice as it said, <span class=\"chunter\">\"You're rather curious, aren't you?\"</span><br>\r\n<br>\r\nIn response, Dalton turned himself around to face whoever was speaking to him, only to reveal that it was none other than Commander Yoneda, who also happened to be the manager of the Flower Division by their stage name, the Imperial Opera Troupe. <span class=\"corange\">\"Oh! Commander Yoneda, I didn't see you there for a moment.\"</span> <span class=\"chunter\">\"It's quite alright, Dalton. And please, call me Yoneda. After all, you can't call me Commander Yoneda when we're incognito.\"</span> Yoneda replied, reminding the Lieutenant Captain not to call him by his military rank, since the Imperial Opera Troupe is an alias for the Flower Division. <br>\r\n<br>\r\n<span class=\"corange\">\"Good point. So....which play are Sakura and the others doing anyway?\" </span> Dalton asked, keeping the volume of his voice down to avoid disturbing Sakura and the others while they were rehearsing. Of course, Yoneda willingly answered Dalton's question and explained, <span class=\"chunter\">\"Sakura and the others are rehearsing a play from Western literature. More specifically, a fairy tale. I believed it's called \"Beauty &amp; The Beast\". I'm sure you remember such a tale.\"</span><br>\r\n<br>\r\nObviously, Dalton was very familiar with the tale of Beauty and the Beast. It was considered as one of his favorite childhood stories, which seemed all the more ironic given his ability to transform into a Titan. Of course, in response to what Yoneda had said to him, Dalton looked back at his commanding officer and answered, <span class=\"corange\">\"Yeah, very much so, sir. However, I sometimes find that it reminds me of the twisted irony considering my....monstrous abilities. So, which role will Sakura be playing?\"</span><br>\r\n<br>\r\nTo sate his curiosity, Yoneda spoke once more toward Dalton and replied, <span class=\"chunter\">\"Originally, Sumire wanted to play the role of Belle. However, I've decided to mix it up some and have offered the role to Sakura. After all, an actress must be versatile in the role she's been given, and I could see some of that same potential in Sakura. She's fresh sure, but with enough practice, I think she can be one of the best actresses in the Imperial Capital.\"</span> Dalton couldn't help but display a mischievous smirk on his face, chuckling a bit on imagining Sumire's reaction to such a major decision in theatrical casting, as he then spoke toward Yoneda and said, <span class=\"corange\">\"*chuckle* Yeah, I guess Sumire would definitely be pissed off from that.\"</span><br>\r\n<br>\r\n<span class=\"corange\">\"Alright, so if Sakura is playing as Belle....then who's going to play the role of the Beast?\" </span>Dalton asked, obviously curious about who the role of the Beast should go to. After all, he was thinking that either Kanna or Maria would suit the role due to their masculinity. However, it was there that Yoneda spoke toward Dalton once more and answered....<br>\r\n</span></div></div>",
            "created":1466091300,
            "id":2165156,
            "title":"Performance Rehearsal"
        },
        "111211111222211212113121":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Eventually, Dalton accepted the role of the Beast alongside Sakura's Belle.",
                "Dalton needed more time to think about his decision as a whole...",
                "Meanwhile, on the other side of Tokyo, something sinister occurred......"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"chunter\">\"Well, I have a good idea about who will be playing as the Beast. He's rather recent to the troupe, but I'm content that he'll perform with grace.\" </span>Yoneda answered, giving off a subtle hint or two about who will be the Beast toward Dalton. Of course, Dalton thought it was somebody else instead of him, as he spoke toward Yoneda and said, <span class=\"corange\">\"I hope so, seeing as how committed Sakura and the others are with this play.\"</span><br>\r\n<br>\r\nA moment or two later, Yoneda then replied, <span class=\"chunter\">\"Actually.....I was thinking of you, Dalton.\"</span> <span class=\"corange\">\"Yeah....Wait, what?!\" </span>Dalton answered, just as he quickly realized what Yoneda meant by someone new to the troupe, which of course, was him. He had this look of shock on his face in reaction to such a revelation. Shortly after letting this information settle in, Dalton spoke once more toward his commanding officer and asked, <span class=\"corange\">\"Okay, so why me? Couldn't you choose someone else like Maria or Sumire? I mean, they've got more experience in performing on stage than I do.\"</span><br>\r\n<br>\r\n<span class=\"chunter\">\"To elaborate, Dalton: The two main roles of Beauty and the Beast must have a developing relationship between the actor and the actress. After all, Belle develops a relationship with the Beast over the course of the story. And besides, I am fully aware of the budding relationship between you and Ms. Sakura Shinguji, Dalton. Thus, it would be more believable for the audience as a whole.\"</span> Yoneda thoroughly explained, fully aware of the blooming romance between Dalton and Sakura. To be honest, Dalton was aware that his relationship with Sakura would've been exposed eventually, he just didn't know how soon such a revelation would be revealed, as he looked at Yoneda and asked, <span class=\"corange\">\"....So, how long have you known about this?\"</span><br>\r\n<br>\r\n<span class=\"chunter\">\".....I've been aware of this for 4 days now, Dalton. And despite Sumire's protests, I still believe you to be fit for the role of the Beast. Now then, what do you say?\" </span>Yoneda answered, asking if Dalton would accept the role of the Beast onstage. However, it was sort of a conflicting deal. On one end, he would be spending a bit more time with Sakura, along with conveying his feelings toward the young Japanese woman in the guise of a fictional character. But on the other hand, Dalton was worried that he might possibly screw up badly onstage in front of a massive audience. Overall, it was a taxing decision to overcome.</span></div></div>",
            "created":1466605680,
            "id":2168519,
            "title":"A Newcomer To The Troupe"
        },
        "1112111112222112121131211":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Eventually, Dalton made his way to the gym, where Kanna awaits.",
                "Actually, he ran into someone else along the way there......",
                "Meanwhile, Yoneda informs Sakura & the others about Dalton's role."
            ],
            "content":"<div class=\"\"><div> <span>Although he was somewhat inexperienced when it came to performing the theatrical arts, Dalton certainly knew his way around a role he was given. However, he was given either a supporting role or a minor character role in a theatrical performance..... That is, until Yoneda offered him the role of one of the two main protagonists of Beauty and the Beast on a metaphorical silver platter. Overall, how could he refuse? Eventually, after giving a moment of thought, Dalton decided to wing it and answered, <span class=\"corange\">\"......Eh, why the hell not.\"</span><br>\r\n<br>\r\nAs he shook hands with his commanding officer in accepting the role, Dalton heard Yoneda speak toward him and replied, <span class=\"chunter\">\"I figured you wouldn't refuse, Lieutenant-Captain.\"</span> <span class=\"corange\">\"So, when do I start rehearsing anyway?\"</span> Dalton asked, wanting to know when he'll get started, as he severed the handshake. Of course, Yoneda proceeded to respond as he answered, <span class=\"chunter\">\"...I'll have to inform Sakura and the others first before you can begin rehearsal. But in the meantime, Kanna informed me to tell you she wants another sparring match.\"</span><br>\r\n<br>\r\n<span class=\"corange\">\"Figured as much. *sigh* Guess it's time for Kanna's School of Hard Knocks.\" </span>Dalton sarcastically remarked, seeing as how he still remembered the difficult sparring with Kanna Kirishima some time ago. After all, his fighting methods were more akin to that of a professional boxer, which is rendered  relatively futile against the versatility of a trained martial artist. However, knowing Kanna and some of her fighting techniques by now, she would use a mix between quick lightning-fast jabs and roundhouse kicks, alternating between these two attack patterns. <br>\r\n<br>\r\n<span class=\"corange\">\"Yeah, she's definitely going to kick my ass....again.\"</span> Dalton thought to himself, as he traversed his way through the halls of the Imperial Grand Theater, progressively making his way toward the gymnasium, where Kanna was already there and awaiting for Dalton's arrival.</span></div></div>",
            "created":1467638220,
            "id":2175232,
            "title":"Just Winging It"
        },
        "11121111122221121211312111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Dalton, who has finally triumphed over Kanna for the first time.",
                "Kanna, whose experience has won this bout once more.",
                "Actually, the fight ended in a draw...."
            ],
            "content":"<div class=\"\"><div> <span>After treading through the long hallways of the Imperial Grand Theater, Dalton eventually arrived at the entrance to the gymnasium, noticing one of the two doors was already open,which meant that Kanna was already inside. After all, he can hear the Amazonian woman's light grunts with each punch, jab, and kick she delivered into the air, as if she was fighting an invisible foe.<br>\r\n<br>\r\nWith no point in delaying the inevitable, Dalton slowly entered the gymnasium, stepping on the hardwood flooring upon entering the spacious room, where he spoke up and said, <span class=\"corange\">\"You wanted to see me, Kanna?\"</span> In response, Kanna quickly became aware of his presence, where she halted her martial exercising, as she then looked at him with a tomboyish smirk and answered, <span class=\"clred\">\"Well, you certainly took your sweet time, Dalton.\"</span><br>\r\n<br>\r\n<span class=\"corange\">\"What can I say? You didn't exactly take things easy on me, Kanna.\"</span> Dalton replied, where he followed the red-haired brawler toward a section of the gymnasium covered with lightly padded mats, which were obviously made for sparring matches like this. Once the two individuals stepped foot upon the mats, Kanna positioned her body into a fighting stance, hands curled into fists, as she spoke toward him and said, <span class=\"clred\">\"So, ready for a rematch?\"</span> Of course, Dalton responded to such a question by cracking the knuckles on his hands, then positioned himself in a boxer's fighting stance, hands and fingers clenched into fists, looking at the red-haired Amazon of a woman with a determined and serious look on his face as he replied, <span class=\"corange\">\"....Bring it.\"</span><br>\r\n<br>\r\nFrom there, the fight between Kanna and Dalton had begun with determined ferocity. Kanna began her assault by delivering several quick jabs toward Dalton, but he was able to block the attack with some effort. However, from past experience with her, Dalton was able to predict what Kanna was going to do next, as she performed a powerful and swift sweeping kick, which was designed to knock an opponent off their feet, both metaphorically and quite literally. Fortunately, Dalton quickly leapt backwards to avoid Kanna's sweeping kick, which was a very close call due to Kanna's overall size and physique. After all, the red-haired woman was nearly 7 feet in height, giving the Amazon of a woman a good amount of attack range, so Dalton had to be very cautious when attacking someone such as Kanna, who could easily overpower him if he lets his guard down for a second or two.<br>\r\n<br>\r\nShortly after dodging her attack, Dalton quickly rushed at Kanna, deliver one or two successful punches, then quickly backed away from Kanna to avoid a counterattack by her hand. However, the reason for these sparring matches was to hone Dalton's combat skills, which in turn, would make him a more versatile fighter when he transforms into his Titan Form. Overall, this would benefit him the next time a Chimera appears. <br>\r\n<br>\r\nFrom there, Kanna then performed several roundhouse kicks aimed for Dalton's upper body and head, as he evaded the first and second roundhouse kick, then blocked the third roundhouse kick with his left arm, gritting his teeth from the sheer force behind Kanna's kick, struggling with all of his might to halt the momentum in the red-haired Amazon's attack. Then, in a quick decisive move, Dalton swiftly wrapped both his arms around Kanna's leg, and with all of his strength, he swung Kanna to his left, then let's go of her leg, causing her to be tossed 7 feet away from him. <br>\r\n<br>\r\nThanks to her martial prowess, Kanna quickly recovered onto her feet, where the two individuals began to slowly circle one another, anticipating each other's moves. <span class=\"clred\">\"Nice move. Where did ya learn that?\"</span> Kanna said, a little impressed by Dalton's grapple technique. In response, Dalton spoke toward his opponent and remarked, <span class=\"corange\">\"My uncle. He was a professional wrestler back when he was my age.\"</span> Shortly after the small conversation, the battle between these two combatants reignited once more, exchanging blow after blow, neither side faltering in this endeavor. Eventually, one of these two warriors would prevail over the other, which came in the form of.....</span></div></div>",
            "created":1467752460,
            "id":2175882,
            "title":"Kanna's School of Hard Knocks"
        },
        "111211111222211212113121111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "From there, Li wanted to see Dalton for something important.",
                "Sakura came in to visit Dalton for something.....",
                "Actually, something else happened instead.."
            ],
            "content":"<div class=\"\"><div> <span>Although he already had prior experience when sparring against Kanna, Dalton knew what sort of attack the red-haired Amazon was about to perform next, a technique that always left him defeated in the end: The Hydra Heel-Kick. It was one of Kanna's more devastating attacks, which would start off as an arm grab, then a disarming flip of the opponent, and finishes off with a powerful downward heel kick to the opponent's abdomen, knocking them out of the fight.<br>\r\n<br>\r\nAnd yet, despite her Amazonian physique, Kanna was capable of performing such an attack with great dexterity and swift agility. <span class=\"corange\">\"Not this time!\" </span>Dalton thought to himself, as he quickly strafed to Kanna's left, flanking her in the process. After all, he wasn't going to fall for Kanna's Hydra Heel-Kick once more. From there, he quickly wrapped his arms underneath Kanna's armpits and interlocking his fingers behind Kanna's neck, completing one of his uncle's professional wrestling moves: The Russian Headlock.<br>\r\n<br>\r\nAnd with all of his strength, Dalton contorted his body, yanking Kanna off her feet, causing her to land hard on the floor stomach first, with Dalton on top of her, still restraining her in a Russian Headlock with no sign of loosening his grip on her. After struggling for a minute or two, Kanna simply displayed an impressed smirk on her face and said, <span class=\"clred\">\"Not bad, Dalton. Not bad at all.\"</span><br>\r\n<br>\r\nNow realizing that he had won against Kanna for the very first time, Dalton released his grip on Kanna, returning the articulated movement of her arms once more, as he stood up and backed away from Kanna while she stood back up onto her feet, obviously to congratulate Dalton on winning against her.</span></div></div>",
            "created":1468241880,
            "id":2178495,
            "title":"The First of Several Victories"
        },
        "1112111112222112121131211111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Some sort of communication device for Dalton.",
                "An enhanced sonar device for detecting Chimera.",
                "Actually, Li had brought an entirely different invention instead....."
            ],
            "content":"<div class=\"\"><div> <span><span class=\"clred\">\"And by the way, Li wanted me to tell you that she wants to see you after you're done here.\"</span> Kanna said, informing him to go pay Li a visit ASAP. Of course, he nodded in agreement as he slowly walked away and answered, <span class=\"corange\">\"Thanks. I'll keep that in mind.\"</span> From there, Dalton left the gymnasium through the double doors, as he proceeded toward the laboratories. After all, he can only expect to find there due to past experience, along with being fully aware of her inventions either being accident-prone or the possibility of blowing up in the girl's face.<br>\r\n<br>\r\n––––––––––––––––––––––<br>\r\n<br>\r\nAfter treading through the theater's interior, Dalton finally made his way inside the laboratories, where the Flower Division's Koubus were stationed until they were needed for combat with the enemy. Of course, he kept a good distance from Li due to her accident-prone reputation involving her inventions. <span class=\"corange\">\"*Sigh* Here's hoping Li's newest invention doesn't blow my face off.\"</span> He thought to himself, as he made his down the long flight of stairs, only to hear another small explosion and a large cloud of black smoke appeared in the process. <br>\r\n<br>\r\n<span class=\"corange\">\"Jesus H! What the hell is Li up to now?!\" </span>Dalton thought to himself once more, noticing the cloud of black smoke, as he rushed over there a little to see if Li was alright. Fortunately, as the black smoke was clearing up, there sat Li, covered in soot on both her youthful face and her green jumpsuit, coughing some due to another invention of hers blowing up in her face once more as she said, <span class=\"cgreen\">\"*Cough* *Cough*...Aww, not again! This is the second time this week!\"</span><br>\r\n<br>\r\n<span class=\"corange\">\"You wanted to see me, Li?\" </span>Dalton asked, interrupting Li's train of thought along with grasping her attention, where she then quickly stood up onto her feet to face him and answered, <span class=\"cgreen\">\"Oh, Dalton! I, uh....I wasn't expecting to see you quite so soon.\"</span> <span class=\"corange\">\"Yeah, well..... You weren't exactly subtle when it comes to your inventions, especially if they coincidentally blow up in your face.\" </span>Dalton remarked, sarcastically criticizing Li a little for her supposed inventions always exploding in her face for some strange reason..<br>\r\n<br>\r\nShifting the subject instead, Dalton then looked at Li and asked, <span class=\"corange\">\"Anyway, I heard from Kanna that you wanted to see me about something. So, what is it?\"</span> <span class=\"cgreen\">\"Oh, yes! Well, let me first get it out for you.\" </span>Li replied, as she walked into another room, where Dalton then heard the sounds of clanging metal, as if Li was looking for something in particular. However, after several minutes have passed, Li finally emerged with something in her hands, which she revealed to be.....</span></div></div>",
            "created":1468937640,
            "id":2182931,
            "title":"Testing A Prototype"
        },
        "11121111122221121211312111111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Then, Sakura appeared, wanting to see Dalton.",
                "But then, Commander Yoneda appeared, wanting to discuss with Li.",
                "Meanwhile, something sinister stirred outside of the city's borders."
            ],
            "content":"<div class=\"\"><div> <span><span class=\"corange\">\"Uh, Li......What the hell is that?\" </span>Dalton asked, somewhat confused over what she revealed to him. In appearance, the device looked like a rucksack with straps attached to it, useful as a makeshift backpack. However, there were a set of wires coming out of the rucksack and attached to a set of headphones with a microphone piece, used for communicating with a squad of soldiers. In response, Li spoke to Dalton and explained, <span class=\"cgreen\">\"Oh this? This is a specialized communication device I've designed just for you. More specifically, when you change into your Titan Form, Dalton.\"</span><br>\r\n<br>\r\nRealizing that the \"communication device\" Li built was reserved for him, Dalton had this concerned look on his face, scratching the back of his head some in the process and answered, <span class=\"corange\">\"*sigh* Why do I get the feeling that you haven't tested this thing yet?\"</span> Obviously seeing his remark as some form of doubtful insult, Li then fired back and replied, <span class=\"cgreen\">\"Nonsense! I've been testing this device for a good chunk of my time now.\"</span> Of course, he then turned his head to the right, becoming fully aware of the mannequins each blackened by soot from a small man-sized explosion.<br>\r\n<br>\r\n<span class=\"corange\">\"Oh great. Li's newest invention is combustible. Just exactly what I need when I turn into a Titan.\" </span>He thought to himself, with signs of sarcasm in his tone. Then again, this was something that Li had extensively worked on for a good amount of time, which forced Dalton to go along with the young mechanic's plan and said, <span class=\"corange\">\"Fine, I'll do it. This thing better not blow me to smithereens, Li.\"</span><br>\r\n<br>\r\n<span class=\"cgreen\">\"It won't! Trust me, I made sure that the batteries didn't overheat and spontaneously combust. You just make sure it's working at 110 percent.\" </span>Li answered, as she approached Dalton and strapped the communication device onto him, correcting the straps' measurements over his arms, checking if it fits him comfortably. From there, Li inserted the headphones onto his head, the speakers planting themselves against his ears. <br>\r\n<br>\r\nOut of concern, Dalton then spoke up toward Li and said, <span class=\"corange\">\"No offense, Li, but you do realize that I need my ears exposed in order to hear while in my Titan Form, right?\"</span> Upon realizing such a revelation, Li literally dropped what she was doing, turning around to face Dalton and yelped, <span class=\"cgreen\">\"What do ya mean you need to hear?\"</span> <span class=\"corange\">\"Well....it's more of a sensory connection, Li. While I'm in my Titan Form, each of the muscles and nerves in my Titan body are connected to my human body as a whole, and that includes almost all of my senses. Hearing, Sight, Smell, Touch, you know, THOSE kinds of senses.\" </span>Dalton explained, giving the young inventor a thorough explanation on how he functions while he's in his Titan Form, which began to stack up on the negative aspects of making him wear a prototype wireless communication device, which include hindering his hearing while he's changed into a Titan.</span></div></div>",
            "created":1472825580,
            "id":2205062,
            "title":"Wireless Communication"
        },
        "111211111222211212113121111111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "About what Sumire had said earlier, that there was already a man in their group.",
                "What Sakura thought about him, if she had romantic feelings for him.",
                "Actually, it was a different subject entirely..."
            ],
            "content":"<div class=\"\"><div> <span>However, just as Li snatched away the prototype communication device to tinker around with it so she could improve it's design, Dalton heard some footsteps coming downstairs, which then revealed to be none other than Sakura Shinguji herself, who was apparently looking for him. <span class=\"cppink\">\"Ha, there you are! I've been looking for you.\" </span>Sakura said, where she then approached the American, almost with a spring in her step, as if she was eagerly anticipating something.<br>\r\n<br>\r\n<span class=\"corange\">\"Well, you found me. So, what's with the giddy look on your face?\"</span> Dalton asked, causing Sakura to blush some in slight embarrassment. Of course, shortly after regaining her composure, she then spoke toward him and said, <span class=\"cppink\">\"...Well, um...today is the beginning of the Cherry Blossom Festival, and I was wondering if you could...if you could, um...\"</span> <span class=\"corange\">\"-Join you in this festival? Of course, Sakura! I don't mind.\"</span> Dalton replied, willingly accepting the girl's invitation in the process. <br>\r\n<br>\r\nIn turn, this left with Sakura feeling quite excited, which prompted her to wrap her arms around Dalton with glee, despite the obvious height differences between the two individuals. From there, Sakura began to tug on Dalton's arm to have him follow her, as she spoke toward him and said, <span class=\"cppink\">\"Come on, Dalton! I bet you'll like the food they got there.\"</span> Not wanting to look like an ass, Dalton followed closely behind Sakura as they made their way upstairs, out of the Imperial Grand Theatre, and onto the bustling streets of Tokyo.<br>\r\n<br>\r\n------<br>\r\n<br>\r\nEventually, after walking for 18 blocks, Dalton and Sakura finally arrived at their intended destination: the Cherry Blossom Festival grounds, which was filled with numerous food concession stands, festival games, and various other attractions, along with numerous amount of people attending the festival, both young and old, dressed up in fancy kimonos for the festive occasion. <br>\r\n<br>\r\n<span class=\"corange\">\"...Well, I gotta admit, the place looks lively, Sakura.\" </span>Dalton said, admitting that he was somewhat impressed by the lively scenery, since this was his first taste of Japanese culture. <span class=\"cppink\">\"*giggle* Glad you like it, Dalton. Come on, let's try out some of the games here!\" </span>Sakura replied, where she then dragged him further into the crowd, approaching some of the game stands in the process.<br>\r\n<br>\r\nHowever, over the course of approximately 3 to 4 hours, the two individuals had visited several food concession stands, a few game stands, and numerous shop stands within the festive marketplace, which overall cultivated into something akin to a date. Fortunately for them, Sakura and Dalton eventually found a bench to sit on so they could rest their feet a little. However, while they were resting, Dalton brought up a question for Sakura, as he spoke toward her and asked, <span class=\"corange\">\"Sakura, can I ask you something?\"</span> <span class=\"cppink\">\"Of course, Dalton! You can ask me anything. So, what seems to be on your mind?\" </span>Sakura said, noticing that something was on the American's mind. Of course, the subject at hand was...</span></div></div>",
            "created":1481652360,
            "id":2249447,
            "title":"A Visit To The Cherry Blossom Festival"
        },
        "1112111112222112121131211111111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Fast forward to when Dalton & a few others were traveling to Paris...",
                "Fast forward to when Dalton & the others already arrive in the city of Paris...",
                "Actually, something else happened along the way..."
            ],
            "content":"<div class=\"\"><div> <span><span class=\"corange\">\"...Well, um... it's about what Sumire had mentioned earlier, about there already being a guy in the Flower Division. Is that true?\" </span>Dalton asked, wanting that one simple question answered. Inevitably, in response to such a question, Sakura exhaled a deep sigh before she spoke toward him and answered, <span class=\"cppink\">\"Actually, Dalton...there was already a man being in the Flower Division. His name...was Ichiro Ogami, and he was essentially our Commanding Officer.\"</span> Of course, in all honesty, you weren't expecting such information from Sakura, revealing that Ogami was actually the leader of the Imperial Flower Troupe.<br>\r\n<br>\r\n<span class=\"corange\">\"...Okay, I...I was not expecting that, in all honesty, Sakura. So... what's he like?\"</span> Dalton asked, becoming curious as to what exactly Ichiro Ogami was like around Sakura and the others. Eventually, Sakura spoke once more toward the American and replied, <span class=\"cppink\">\"Ogami...he is an honest and honorable man. He deeply cares about his friends, and is willing to protect them, no matter the cost. In a way...I guess you could say that both you and him aren't so different.\"</span><br>\r\n<br>\r\n<span class=\"corange\">\"Yeah...except for the fact that I can transform into a 15 meter tall Titan. So...how come he's not here with you and the others when I arrived?\" </span>Dalton asked, wondering why Ichiro Ogami wasn't with Sakura and the other members of the Flower Division when he came into the picture. However, in response to such a reasonably valid question, Sakura then spoke toward Dalton and explained, <span class=\"cppink\">\"Well...it's kinda complicated. You see, he was sent out on a special mission to assist the Paris Assault Force in Paris, France. And from what we've read in his letters, they've been having some...difficulty, in stopping these \"Kaijin\", which means \"Beast-Men\". Commander Yoneda plans on sending several of us over to Paris to assist them in this manner. I was thinking that you should accompany us.\"</span><br>\r\n<br>\r\n<span class=\"corange\">\"Okay, so... let me get this straight, Sakura: Your C.O, Ichiro Ogami, is currently assisting this \"Paris Assault Force\" within the city of Paris, France. And for some reason, they're having trouble snuffing out these \"Beast-Men\". So now, Commander Yoneda wants you, me, and a few other members of the Flower Division to head over to Paris and lend them a hand. Correct?\"</span> Dalton said, summing up the overall information regarding to what sort of mission he and several members of the Flower Division would be participating in.<br>\r\n<br>\r\nSo, in response, Sakura nodded firmly in confirmation toward Dalton, where she then spoke toward him and replied, <span class=\"cppink\">\"Seems about right, Dalton.\"</span> After some careful consideration on the current topic at hand, Dalton eventually decided to accept accompanying Sakura and a few other members of the Flower Division to visit Paris and lend assistance to Ogami and the Paris Assault Force, where he then spoke toward Sakura and answered, <span class=\"corange\">\"...Eh, why the hell not? After all, I always wanted to visit the city of Paris, anyway.\"</span></span></div></div>",
            "created":1482331080,
            "id":2252761,
            "title":"Ichiro Ogami"
        },
        "13":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Ratchet Altair",
                "Gemini Sunrise",
                "Cheiron Archer",
                "Diana Caprice",
                "More members of Star Division, please!"
            ],
            "content":"<div class=\"\"><div> <span>So, you decided to choose Star Division, hmm? Not a problem. After all, the game that they first made their debut in, Sakura Wars 5: So Long, My Love, was translated into English for Western audiences. Now, to give more info about Star Division, allow me to elaborate:<br>\r\n<br>\r\nFormed in 1928 with Michael Sunnyside as its commander, The New York Combat Revue differs from the other organizations in that their assault team is referred to as the Star Division. Two members of the original disbanded Star Division were transferred to this group. Originally, Ratchet Altair was the captain of the squad, but her failing spiritual power led her to give the position to Lieutenant Shinjiro Taiga, while she assumed the role of vice commander. Gemini Sunrise, Cheiron Archer, Diana Caprice, Rosita Aries, and Subaru Kujo form the rest of the team. <br>\r\n<br>\r\nAs for support, there is the Rainbow Division, which is composed of Cherry Cocker and Anri Yoshino, providing Star Division with the necessary support during combat. Wong Xingzhi functions as the mechanical chief for Star Division. Their base of operations is located within the Little Lip Theater, which is located on Broadway, where the members of Star Division work undercover as actors and performers, fulfilling a similar role as Flower Division.</span></div></div>",
            "created":1464411600,
            "id":2155247,
            "title":"The Star Division (New York City, New York, U.S.A)"
        }
    },
    "info":{
        "author_id":"vocalrvbplayer",
        "author_name":"Vocal",
        "brief_description":"For the fans of Sakura Wars, lock and load!",
        "created":1464271320,
        "description":"<td align=\"left\" class=\"norm\">Here it is, ladies and gentlemen! The first Sakura Wars-focused interactive story.<br>\r\n<br>\r\nFor those who are unfamiliar with this franchise, Sakura Wars is a series of dramatic fantasy and science-fantasy tactical role-playing adventure video games, which consist of tactical wargame and dating sim elements, but also includes it's own motion picture, anime, manga, and other merchandise. It takes place in an alternate 1920s Tokyo, New York City, and Paris, and follows the adventures of an all-female secret task forces in these 3 countries, with the Imperial Assault Force–Flower Division in Tokyo, the Paris Assault Force in Paris, and the New York Combat Revue–Star Division in New York City. Each assault force uses a special type of steam and spirit-powered armor to combat against evil inhuman entities.<br>\r\n<br>\r\nNow that you know what the Sakura Wars franchise is about, here are the rules:<br>\r\n<br>\r\n1. Female Characters only! That means you cannot date any of the other male characters like Ichiro Ogami or Shinjiro Taiga.<br>\r\n<br>\r\n2. No gross stuff, but violence and some gore could be included.<br>\r\n<br>\r\n3. No killing off the Main Character (You), or the girl of your choice.<br>\r\n<br>\r\n4. If you have sex with said character, please give us a warning.<br>\r\n<br>\r\n5. If you plan on giving your character a name, don't plagiarize.<br>\r\n<br>\r\n6. Due to a few certain members of each assault force being possibly under the age of 18, I will be having said members be at LEAST the age of 18 years old. For good reasons, of course.<br>\r\n<br>\r\n7. Just to add some variety, there will be an option to allow your character to have powers, including a few powers from different anime like Attack on Titan or Dragon Ball Z.<br>\r\n<br>\r\n8. I would like it if you had the dialogue for the characters to be in different colors please. To make it a little easier to read for the viewers.<br>\r\n<br>\r\n9. Go into detail when writing and adding new chapters, please don't go into writing a single sentence and just leave it at that.<br>\r\n<br>\r\n10. Have Fun!<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":2085434,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1482331080,
        "modified":1482331080,
        "pretty_title":"Sakura Wars Girlfriend"
    }
}