{
    "chapters":{
        "1":{
            "author_id":"merry511",
            "author_name":"Judiciousoctagon",
            "choices":[
                "Faith - direct supervisor ",
                "Stephanie - HR head ",
                "Victoria - Intern ",
                "More options ",
                "Someone outside of the office "
            ],
            "content":"<div class=\"\"><div> <span>Shu arrives for a new day of work after acquiring his new powers. <br>\r\n<br>\r\nHe looks up at the incredibly tall structure that is his workplace. Even when craning his neck back, he can barely spot the top of the building. Working your way to the top will be a challenging process, but you welcome it with open arms; maybe he can have some fun along the way too <br>\r\n<br>\r\nHe thinks about who he could possess with his new power, it would be best if no one found out he had this ability. Shu decides that he will use it but also try his best so that no one finds out he possessed someone. </span></div></div>",
            "created":1586508240,
            "id":2816553,
            "title":"The beginning "
        },
        "11":{
            "author_id":"darthbane0908",
            "author_name":"Mr.Y",
            "choices":[
                "Lock the office door and play with his new body",
                "Continue Faith's work on the computer ",
                "Step outside and use his new authority to boss people around"
            ],
            "content":"<div class=\"\"><div> <span>Shu and his team are in a meeting that Faith was holding. As she was calling out the roles of everyone, she made sure to leave the most tedious part of the job to Shu<br>\r\n<br>\r\n\"Shu I need you to do two things for me, hang up all the flyers on each floor and take everyone's lunch order and remember, no mustard on my sandwich like last time. My whole day was ruined after that. You all are dismissed.\"<br>\r\n<br>\r\nAbout 5 minutes later Shu was hanging up flyers, writing down people's lunch orders and the most important thing of all, he was looking for targets to possess.<br>\r\n<br>\r\nShu looked over to where Faith's office was and then it hit him. He could posses her which meant that he would be in a very high position in the office. Without wasting anymore time he quickly ejects his spirit out.<br>\r\n<br>\r\nShu makes sure that his body continues the work and floats over to Faith's office entering it. He finds her typing on her computer and floats behind her and phrases into her body. Everything goes black for a moment as Shu opens his eyes to see breasts sticking out from his chest.<br>\r\n<br>\r\n\"It works...\" he saids to himself in his new feminine voice, he then brings his hands to his breasts and start fondling them.<br>\r\n<br>\r\n\"You know Faith, sometimes you dress a little to conservatively\" Shu saids to himself as he unbuttons the top two buttons of his blouse, displaying a tad bit of cleavage. \"That's better, now lets....\"<br>\r\n<br>\r\nWhat does Shu do next?</span></div></div>",
            "created":1586845260,
            "id":2818557,
            "title":"Faith - direct supervisor "
        },
        "113":{
            "author_id":"merry511",
            "author_name":"Judiciousoctagon",
            "choices":[
                "Masturbate as Faith",
                "Leave her body ",
                "There is a sudden knock on the office door "
            ],
            "content":"<div class=\"\"><div> <span>You decide to take this opportunity as Faith and abuse your power a little bit. Faith is your direct supervisor, but she is not that high up in the company considering how massive it is.<br>\r\n<br>\r\nDespite this, you would not miss the opportunity to mess around a little. Sitting up from Faith's desk, you unlock her door and step out into the open floor.<br>\r\n<br>\r\nThere are other people, likely interns like you were, running around the floor and some other people scattered about. You decide it is best to walk to \"your\" team room, you would not want to go yelling at the wrong person.<br>\r\n<br>\r\nThe clacking of your heels reverberates through the halls as you walk down the floor to the team room, opening the door with Faith's small hands to the room just as Shu left it.<br>\r\n<br>\r\n\"What is this?!?\" you say in Faith's booming voice as your former coworkers, now subordinates eyes dart back at you. <br>\r\n<br>\r\n\"I asked for your reports 2 hours ago!\" you say in an upset tone, clearly startling everyone in the room.<br>\r\n<br>\r\n\"But Faith, you said the reports were due at the end of the day\" Trevor stammers.<br>\r\n<br>\r\n\"No buts! Get them to me immediately, I will make sure my manager hears about this on your next review!\"<br>\r\n<br>\r\nEveryone quickly gets back to work clearly worried, except one Victoria, who continues to sit on her phone.<br>\r\n<br>\r\n\"Victoria! I am tired of you sitting on your phone all day! This is not fair to me or any of your group members! you snap.<br>\r\n<br>\r\nVictoria looks evidently surprised at your sudden outburst at her of all people, but she goes along with it.<br>\r\n<br>\r\nClosing the door with a loud thud, you walk back to your office, feeling somewhat elated that you are no longer the bottom of the pecking order.<br>\r\n<br>\r\nYou also notice a very slight warmth between your legs as you re-enter Faiths office. You grab the mirror on her desk and unzip her pencil skirt after locking the door. Noticing an evident wet spot on her panties.<br>\r\n<br>\r\n\"So that's why you are always snapping at us, you dirty bitch\" you whisper in a sultry tone as your stolen fingers run up and down her aching pussy<br>\r\n </span></div></div>",
            "created":1589942760,
            "id":2838286,
            "title":"Step outside and use his new authority to boss ..."
        },
        "13":{
            "author_id":"merry511",
            "author_name":"Judiciousoctagon",
            "choices":[
                "Possess her now ",
                "Wait to possess her later ",
                "Possess one of the other group mates ",
                "Search the floor for someone to possess",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Today, work is just as tedious as always, but at least Shu has something to look forward to with his new powers.<br>\r\n<br>\r\nShu enters the team meeting room and is immediately called over by Faith.<br>\r\nFaith gives the regular morning meeting, putting some of your coworkers in a group to work on a project, on of which is Victoria. She is wearing a soft pink button up shirt with a skirt which should be all means, violate company code. However no one says a word.<br>\r\n<br>\r\n\"and for you Shu, head upstairs to file some of these papers away\" Faith says as she point to a comically large stack of documents before she walks out of the room. Leaving all of you to your jobs.<br>\r\n<br>\r\nShu sighs in annoyance, \"work never changes huh?\" as he takes a look at Victoria's group. The other group mates are work-shopping how they can get the project done, taking notes as well, but Victoria just sits there on her phone. <br>\r\n<br>\r\nShu has always been somewhat jealous of Victoria , he had to work his ass off to get this internship, but she got it with ease. You are not even sure if she had to do an interview. The fact that she is here and is able to get away without doing any work is agitating. You would love to be in that group, but here you are, filing boring papers.<br>\r\n<br>\r\nA sinister smile begins to curl on your face. \"maybe I don't have to file these papers\" you say.<br>\r\n<br>\r\nYou concentrate for a moment as you feel your spirit leave your body, first your head and arms, soon followed by your legs. Your body buckles for a moment, catching itself on the table. As it stands back up, it lifts half the stack of papers and heads towards the elevator.<br>\r\n<br>\r\n\"That was easier than I thought\" you say to yourself as you float towards the group of coworkers. Victoria, tapping away at her phone, <br>\r\n<br>\r\nYou then...</span></div></div>",
            "created":1589933880,
            "id":2838251,
            "title":"Victoria - Intern "
        },
        "131":{
            "author_id":"merry511",
            "author_name":"Judiciousoctagon",
            "choices":[
                "Attempt to help your group with the project ",
                "Sit on her phone like Victoria would",
                "Leave the room to sneak a peak at her body "
            ],
            "content":"<div class=\"\"><div> <span>You decide to waste no time and possess her now.<br>\r\n<br>\r\nFloating in front of her, she doesn't suspect anything. You can get a good look at her face, her delicately placed eyelashes and make-up, and her perfectly set blonde hair.<br>\r\n<br>\r\nAs Victoria opens her mouth slightly for a yawn, you lunge into her body as you hear a thud when everything goes black. You open up your eyes to a throbbing pain on your head, whats more surprising though are the newfound mounds on your chest.<br>\r\n<br>\r\n\"What the hell?\" you say as you sit back up from the floor. \"Victoria!\" a group mate says as he walks towards you and helps you stand up.<br>\r\n<br>\r\n\"We always tell you not to rock on these chairs, they are flimsy and you know your father would not want you getting hurt!\" he says in a frustrated tone.<br>\r\n<br>\r\nIt takes you a moment to realize what he is saying, as you look up to your group-mate, Trevor, who was previously just a couple inches shorter than you, is now at least a head taller.<br>\r\n<br>\r\n\"Fix your clothes, you look like a mess\" Trevor says as his eyes dart to your chest<br>\r\n<br>\r\nLooking down, you see, Victoria's chest exposed, revealing the semblance of a black lace bra through her disheveled shirt and skirt.<br>\r\n<br>\r\n\"What would Victoria do?\" you think quickly....<br>\r\n<br>\r\n\"Oh, are you trying to sneak a peak?\" you say in your best Victoria impression as Trevor sighs, \"Please try and be professional while you are here\" he says as he sits back at the table, the air of the room seemingly returning to what it was before your little incident.<br>\r\n<br>\r\nFixing your top and skirt, you sit back at the table, still flush red, knowing that you are now the flirtatious Victoria.<br>\r\n<br>\r\nYou then...</span></div></div>",
            "created":1589936160,
            "id":2838259,
            "title":"Possess her now "
        },
        "1311":{
            "author_id":"rempa65",
            "author_name":"Rinko48",
            "choices":[
                "Leave Victoria's body.",
                "Stay inside Victoria's body and finish her task.",
                "Do something else."
            ],
            "content":"<div class=\"\"><div> <span>Unlike the real Victoria you decide to help out the group with the project they are assigned to. While at first you just concern yourself to just listen, you slowly begin to show more initiative. Proposing ideas which makes the rest of the group look like they are struck by lightning. When you proposed to make up a list with some of the ideas Trevor almost fell back on his chair.<br>\r\n<br>\r\n\"Are you sure you are alright Victoria? I mean...\" Trevor asks to be certain.<br>\r\n<br>\r\n\"Yes, I am silly.\" You say with your best Victoria smile. \"I just like the subject of the project.\" You wink at Trevor which makes him a little nervous. The other members of the group look at him like they know something more.<br>\r\n<br>\r\n\"Alright then. Everyone knows their tasks. Let's get to work.\" Trevor concludes the meeting at which everyone leaves the room. You however are giggling inwards. Not only did you managed to fool the rest of the group but now Victoria has to do real work for once. <br>\r\n<br>\r\nYou stand up at which you grab the table. Victoria is walking on impossible high heels and you're not used to wearing those. You could leave Victoria's body and go back into yours or someone else of the project. Or you could stay inside Victoria, actually finishing the project as her. That would make her score some points even though it's you who has done the work.<br>\r\n</span></div></div>",
            "created":1594054020,
            "id":2862697,
            "title":"Attempt to help your group with the project "
        },
        "14":{
            "author_id":"merry511",
            "author_name":"Judiciousoctagon",
            "choices":[
                "Alyssa - team lead",
                "Amelia - case manager ",
                "Elise - event planner",
                "More options",
                "Check out some nearby businesses/shops"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options </span></div></span></div>",
            "created":1586508540,
            "id":2816557,
            "title":"More options "
        },
        "141":{
            "author_id":"darthbane0908",
            "author_name":"Mr.Y",
            "choices":[
                "Play with his new body",
                "Get dress and start acting like Alyssa ",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As Shu is pushing a cart full of paper, that need to go to all the printers, around. He looks around at the potential targets to possess.<br>\r\n<br>\r\nWhen all of a sudden Alyssa, his team leader, walks right in front of him and continues walking forward. She is wearing her gym clothes while carrying her work clothes heading for the bathroom to change.<br>\r\n<br>\r\nShu takes the time to enjoy looking at her fantastic ass, watching it bounce as she walks. He then decides that to get to the top, he will start by possessing her. Shu continues following her for a good 3 minutes before she gets to the bathroom door and enters it.<br>\r\n<br>\r\nAs he passes the door he quickly ejects his spirit from his body. He watches his body leave continuing the work and then he enters the bathroom and looks for Alyssa. Shu quickly finds her in the first stall and watches as she starts taking off her shirt and then her gym shorts, leaving her in a blue bra and blue panties.<br>\r\n<br>\r\n\"Well it's now or never\" Shu saids to himself as he phases into Alyssa's body. She quickly gets dizzy and sits on the toilet, but then gets back up bringing her hands onto her breasts. \"I'm in her body!! Which means that...\" Shu saids bringing Alyssa's hands onto her ass \"this fantastic ass is all my\" Shu saids starting to grope his new ass. <br>\r\n<br>\r\nShu then...<br>\r\n<br>\r\n</span></div></div>",
            "created":1586672160,
            "id":2817507,
            "title":"Alyssa - team lead"
        },
        "1411":{
            "author_id":"adianjayz",
            "author_name":"adianjayz",
            "choices":[
                "Go for Amelia.",
                "Go for Elise.",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Standing up from the toilet, Shu marvels at his new body while mentally exploring the potential of his new power. It was only yesterday when he received the mystery package at his door. When he first saw its contents, he simply scoffed, unable to believe that such a power would exist. It was when the jewel was implanted into his forehead that he realized its potential and his newfound possibilities. Initially, he wanted to test it on his neighbors, but he was too tired from work. Plus, he decided that it would be more appropriate that one of his company's employees should be his first. He had grown increasingly apathetic at his workplace, where his dream of being at the top of a biotech company was dashed by menial tasks from his supervisors and co-workers. Despite being at the company for a year, he was never given higher responsibilities or a more prominent position. Thus, Shu saw this as an opportunity to not only \"ascend\" the corporate ladder but also to get some revenge on his supervisors/co-workers. After reading the rest of the manual, he thought, \"What is the worse that could happen? If it doesn't work, I'm just back to my boring workdays anyway.\"<br>\r\n<br>\r\nNow, standing in Alyssa's body, he is glad he tried this power. It is such an extraordinary power that Shu could only slide Alyssa's sleek fingers up and down her well toned body. Inside, Shu is pondering his possibilities: the things he could now do after confirming this ability. Of course, the feeling of being in a woman's body is the first thing that is on his mind. As he glances over his body, he could feel the perky B-cup breasts and the \"void\" between his legs. Combined with the long wavy brown hair he now possesses, these perceptions signify his new gender. Slowly massaging the breasts, Shu feels a mild jolt of pleasure. Despite the new feeling, Shu is slightly disappointed that they don't look as big as the ones that some of his co-workers own, which had him drooling from time to time. However, Alyssa has a toned waist, which Shu finds attractive. He now feels energetic and light, unlike when he was in his original body. Going down, he moves his fingers under his panties and over his slit . Fingering a hole in his slit, he begins to rub it harder and harder as it created a much stronger feeling after each rub. While the feeling of pleasure is similar to his own masturbation, this feels... refreshing. Moaning louder and louder, Shu eventually spasms and collapses onto the toilet seat to recover from his first female orgasm. Breathing heavily, he says, \"Wow, who knew that masturbating as a girl would feel this good? It's just not something guys can fathom about.\" Hearing Alyssa's cute voice coming from his mouth, he chuckles at the sound he now possesses. As Alyssa is one of his friendlier colleagues, he actually enjoyed hearing from Alyssa, rather than the cacophony from his more annoying co-workers.<br>\r\n<br>\r\nSuddenly, Shu hears the door opening, and two people walk in, given the sound of two sets of footsteps. Additionally, the sounds resemble clicking of high heels, so they most likely are from his other co-workers. Shu immediately quiets himself as he slowly descends from the high from before. He is also interested in listening to their potential conversation, as it is certainly not something he would normally hear. It is probably good to know what goes on behind-the-scenes if he wants to ascend in this company.<br>\r\n<br>\r\n\"Oh come on, I thought I said this already, but I was trying out some of our new cosmetic products!\" That whinny voice is definitely Victoria's. Shu never had a high perception of Victoria. While she didn't go out of her way to make Shu's work miserable, her relative success despite her laziness made Shu jealous on several occasions. <br>\r\n<br>\r\n\"Really? Or is that just an excuse to slack off? I understand that cosmetics are a vital part of our business, but you are in the marketing division. We are responsible for a separate product, so I do not want to hear anything about cosmetics during work hours. I wanted a detailed report of our new product two days ago, and I still haven't received it. If I still don't see any progress, I will have to report this to the higher-ups.\" This sounds like Amelia, the case manager who is generally responsible for Shu and Victoria's group. While she is nice to talk to, she is rarely available, so Shu could rarely go to her for assistance. He could only assume that her work is really that busy. <br>\r\n<br>\r\n\"And so what if you do? Let me remind you that my uncle owns this company, so he was the one who recommend me this internship. It's not like the higher-ups could do much about this. Plus, you're not that innocent yourself. I know that you embezzled some of the company's money a couple months ago. I don't know why, but that would seem like something the higher-ups would be interested to look into, hmm?\"<br>\r\n<br>\r\nAmelia only grunts at Victoria's remark. <br>\r\n<br>\r\nThe door opens again, and in comes another woman with high heels. She asks, \"What is going on here?\" The voice is likely Elise's. <br>\r\n<br>\r\n\"N--nothing,\" Amelia stammers before heading into the adjacent stall. <br>\r\n<br>\r\nElise says, \"Now I don't know what happened, but you know that your uncle has high hopes for you, Victoria. Don't waste this precious opportunity, ok?\"<br>\r\n<br>\r\n\"Of course! You can count on me,\" Victoria says cheerfully, seemingly forgetting her previous chastising. She then walked out the bathroom. <br>\r\n<br>\r\nShu has heard enough, as he gains so much information about his colleagues from that short conversation. He is partially sneering at the amount of dirt he has received, but he is also partially pissed at the light treatment that Victoria received. Shu would never imagine to slack off, as his treatment is already harsh as is. Shu could feel his blood boiling. <br>\r\n<br>\r\nBut with his new power, this wouldn't matter anymore. And this would probably be a good time to use it. He could go and possess one of the two remaining occupants as they are in a higher position than Alyssa. Plus, Alyssa's body is sore from Shu's masturbation and her morning workout, so Shu is not exactly comfortable in his current state. He also feels sorry to possessing Alyssa, as she is genuinely one of the few friends he has at work.<br>\r\n</span></div></div>",
            "created":1586882940,
            "id":2818738,
            "title":"Play with his new body"
        },
        "14112":{
            "author_id":"merry511",
            "author_name":"Judiciousoctagon",
            "choices":[
                "Find a way to weaponize the dirt you found out about ",
                "Leave the washroom",
                "Play with Elise "
            ],
            "content":"<div class=\"\"><div> <span>You decide to go for Elise. She is a much higher position than Alyssa and you have had an eye on her for a while. Now is your chance.<br>\r\n<br>\r\nPropping Alyssa's body on top of the toilet seat. You focus for a moment as your soul leaves Alyssa's body.<br>\r\n<br>\r\nExiting the stall you see Elise, wearing black stilettos and dress pants with a white blouse. She is standing at the sink washing her hands. <br>\r\n\"Victoria can be so frustrating at times...\" she sighs as she takes a wash cloth to dry her hands. You take your chance and shoot yourself into her back.<br>\r\n<br>\r\nAlmost immediately your vision comes to, and your met with a beautiful women staring at you in the mirror. \"So I can switch bodies after possessing someone\" you say in your new stolen voice. \"Maybe it is time I get familiar with Elise\", you say, \"or maybe I can do something about that Victoria\"</span></div></div>",
            "created":1589502420,
            "id":2835637,
            "title":"Go for Elise."
        },
        "142":{
            "author_id":"nichster",
            "author_name":"nichster",
            "choices":[
                "Check out her body",
                "Do some work as Amelia",
                "Possess someone else"
            ],
            "content":"<div class=\"\"><div> <span>You looked for a person to test your new power on. Who better than the company case manager:earning big bucks would be pretty awesome for Shu. Shu forced his spirit into her body. A moment of darkness. Then light. He was now standing where Amelia had been. He was now wearing her yellow jacket and yellow skirt and blue blouse. The ceiling felt a lot further than before: Shu was almost 6 foot but Amelia was only just above 5 feet. Suddenly, his old body entered the room asking if there was anything he could do. It had worked! He was her! What would he do now as Amelia?</span></div></div>",
            "created":1586859060,
            "id":2818609,
            "title":"Amelia - case manager "
        },
        "143":{
            "author_id":"merry511",
            "author_name":"Judiciousoctagon",
            "choices":[
                "Head to Elise's secluded office for some private time ",
                "Go out for Lunch",
                "Stop Shu and ask him if he would like to go for food with you (Elise)"
            ],
            "content":"<div class=\"\"><div> <span>Shu is frantically running across one of the many company floors. His supervisor, Faith ordered him to do a lunch run for everyone on the floor. Due to the company's sheer size its quite the challenge. Despite this, Shu thinks that this is the perfect opportunity to find someone to test his new powers on. As Shu runs from office to office, taking notes on peoples orders, he comes across a recently adjourned meeting. <br>\r\n<br>\r\nExiting the meeting room are various business men and women, \"I don't recognize any of them\" you say to yourself. Approaching one of the men to take their lunch order, he dismissively pushes you off, \"we don't work here, we were here for a meeting\" the man says in a condescending tone as he walks off. This was nothing out of the ordinary for Shu, \"it was better to ask than get my head bitten off by Faith for missing someone\" you think to yourself.<br>\r\n<br>\r\nMoving towards the now empty meeting room, you see Elise, the event planner sitting at the large meeting table by herself, making notes in her agenda. She is stylish as always, wearing black stilettos and high gray dress pants gripping her thin waist. She is also wearing a button up white blouse, tucked into her pants, with a black suit jacket draped over her shoulders, her long, wavy dark brown hair down. <br>\r\n<br>\r\nYou consider knocking on the door, but stop when you realize that this is the chance to test out your new power. Why not start your climb to the stop with one of the most capable members on your floor. You concentrate for a moment as your spirit leaves your body. Your body begins to slump for a moment as it catches itself and double-checks the list it had been writing. <br>\r\n<br>\r\nMoving over to Elise, you float over her body, she shudders slightly, \"Is there a breeze in here?\" she says to herself as she puts on her suit jacket. You take this opportunity to phase into her body from her back . Everything goes black for a moment as you open your eyes to see strands of long brown hair covering your face, as you take your newly dainty hand and tuck it behind your ear. <br>\r\n<br>\r\n\"It works...\" you say to yourself in a feminine tone, as you fondle your chest through your blouse. Working your hands down to your slender legs. \"It may actually be a little stuffy in here\" you say to yourself in a soft voice, unbuttoning the top two buttons of your blouse, displaying a tad bit of cleavage.<br>\r\n<br>\r\nSuddenly your fun is interrupted, as you hear a knock on the meeting room door. Looking up, you see yourself, or rather, Shu standing with a notebook in hand. Luckily, it does not seem like he caught your troublesome behavior earlier.<br>\r\n<br>\r\n\"Hi Ms. Clarke\" he says in a nervous tone, \"I am doing a lunch run for everyone on the floor, would you like anything?\"<br>\r\n<br>\r\nStill flush from earlier, you regain your composure, crossing one leg over the other you sit with your hands resting on your perfect thighs.<br>\r\n\" No thank you Shu, I appreciate the offer\" you say with a playful wink. You wave bye as Shu heads off to finish his list.<br>\r\n<br>\r\n\"It is about time to go for lunch huh?\" you say to yourself in a mischievous tone<br>\r\n<br>\r\nShu decides to....<br>\r\n</span></div></div>",
            "created":1586830920,
            "id":2818495,
            "title":"Elise - event planner"
        },
        "1433":{
            "author_id":"merry511",
            "author_name":"Judiciousoctagon",
            "choices":[
                "Return to work as Elise",
                "Leave Elise body ",
                "Victoria arrives to pick up an order from the Cafe, visibly upset "
            ],
            "content":"<div class=\"\"><div> <span>You figure you should treat yourself, or rather Shu, to a nice lunch. You know better than anyone else what shit your superiors have been putting you through. Treating Shu to a free meal with a such a gorgeous woman should help lighten his spirits as well as boost his social standing in the company.<br>\r\n<br>\r\nStanding up your chair, you walk over to the meeting room door, calling over to Shu who was just a few room down the hall. He jogs back over to you. \"Yes Ms. Clarke?\" he says enthusiastically. \"Would you mind coming back over to this room when your done taking the lunch orders? I am something to discuss. You can hand off the actual delivery of the lunches to Victoria, just tell her Elise sent you\" you say in a confident tone. Shu nods and walks off.<br>\r\n<br>\r\nAbout 15 minutes pass, you grab your notes, trying to keep them as organized as possible and placing them in file folders in a nearby cabinet within the meeting room. You hear a knock on the door, It's Shu, \"what was it that you wanted to discuss Ms. Clarke?\" he says as you pick up your handbag, placing it over your shoulder, walking towards Shu. \"Are we going somewhere?\" <br>\r\n<br>\r\n\"Yes, I was hoping you could join me for lunch\" you respond with a charming smile. Shu stammers for a moment, as he clears his throat. \"Of course Ms. Clarke, where are we going?\" he says, clearing confused at the situation. <br>\r\n<br>\r\nYou two decide to go the Cafe at the entrance of the first floor. You lead the way, as the clack of your heels reverberate through the quiet halls as you make your way to the elevator going downstairs, Shu following behind you.<br>\r\n<br>\r\nAs you walk into the Cafe, you notice eyes on you immediately, looking around you see mostly older business men staring at you \"This is the type of attention that Elise gets huh?\" you think to yourself, walking up the cashier, she instantly recognizes you, \"Oh Elise! Would you like the regular?\" she says. Trying your best to stay in character, you accept it, whatever it could be. Shu motions to pay for the items, when you stop him, \"don't worry\" you say, \"its my treat\"<br>\r\n<br>\r\nYou choose a secluded table and sit down. Luckily Elise's go-to item is a simple salad, it tastes a little bland but besides that its fine. You ordered Shu a BLT. <br>\r\n<br>\r\n\"So, Faith has you running errands again?\" you ask Shu. \"Yeah, its a bit boring but besides that I do enjoy it\" he says as he takes a bite of his sandwich. You know this is a lie.<br>\r\n<br>\r\nShu then asks, \"Ms. Clarke\" what made you ask me out for lunch today?\" You take a moment to respond, \"well it looked like you were having a bit of a tough time, so I decided to lend a hand\" it is not unlike Elise to have her moments of compassion.<br>\r\n<br>\r\nAs you continue small talk back and forth, you spot Shu staring at your now revealed cleavage on occasion. \"Please Shu control your wandering eyes, this is incredibly unprofessional\" you say assertively. He immediately apologizes, however you make no attempt to hide your cleavage.<br>\r\n<br>\r\nFinishing your lunches, you stand up from the table and give Shu a loving pat on the back. \"Let's do this again sometime\" you say suggestively as you send him on his way.<br>\r\n<br>\r\nNext, you decide to... </span></div></div>",
            "created":1587275760,
            "id":2820947,
            "title":"Stop Shu and ask him if he would like to go for..."
        },
        "144":{
            "author_id":"merry511",
            "author_name":"Judiciousoctagon",
            "choices":[
                "Julia - accountant ",
                "Morgan - content strategist ",
                "Nozomi - outreach worker "
            ],
            "content":"<div class=\"\"><div> <span>Even more possible options <br>\r\n<br>\r\nJulia -26- one of many accountants. Julia is a reserved girl who likes to stick to herself. She works within a team of accountants to manage company finances. Despite her demeanor she has excellent work ethic. She has short black hair in a bob cut, C-cups and a cute ass. <br>\r\n<br>\r\nMorgan -28- content strategist. Morgan works with the marketing team to devise effective advertisements. She is very much a team player on the surface but mocks her team members behind their backs. She has long wavy ginger hair and wears glasses, with a cute ass and B-cup breasts <br>\r\n<br>\r\nNozomi -24- outreach worker. Nozomi is an outreach worker who spends little time in the office, most of her time is spent traveling to nearby organizations to strike up partnership deals. She is also an avid yoga fan. She is an asian girl with long dyed blonde hair. She has C cup breasts and a cute ass<br>\r\n</span></div></div>",
            "created":1586934660,
            "id":2819077,
            "title":"More options"
        },
        "1443":{
            "author_id":"merry511",
            "author_name":"Judiciousoctagon",
            "choices":[
                "Head to a bathroom ",
                "Go to your company car ",
                "Nozomi phone begins to ring, its a call from Alyssa"
            ],
            "content":"<div class=\"\"><div> <span>Shu was on the 9th floor of the building, photocopying some documents for Faith. \"There are so many big-shots up here, and this isn't even halfway up the building\" you think to yourself, the feeling of dread follows knowing that you'll never really get this high up, but maybe your powers can make the difference.<br>\r\n<br>\r\nAs you stand there mindlessly photocopying papers, you hear the elevator ding, as Nozomi walks out and past you. Nozomi is very much a get it done type of person, she does not like to waste time and tries to get her meetings out of the way so she can get home. Personality wise she is a cheerful girl with amazing social skills who manages to make friends wherever she goes. She is good friends with Alyssa and does yoga with her.You see them talking on the phone between their meetings.<br>\r\n<br>\r\nDue to her position as on outreach worker she is wearing more casual clothes than the office workers. She is wearing brown pumps with beige pants and a black dress shirt.<br>\r\n<br>\r\nYou smirk as you realize you might have found your target. Nozomi hands in her report to one of the business men who gives her a jolly wave as she walks backs towards the elevator. Her cute butt teasing you through her dress pants. As she enters the empty elevator you eject your spirit from your body, entering the elevator before it begins heading down. Nozomi stands in the elevator checking her phone as you float above her.<br>\r\n<br>\r\nShe lets out a big yawn as you take this opportunity to invade her body. Her mouth begins to close but you manage to force it open. A few seconds later, Shu now sees through Nozomi's eyes, staring at a phone screen. You see your long blonde hair hang down as a mischievous smile curls on your borrowed lips. \"It worked!\" you giggle in your new cute voice, \"and that was her signature laugh\" you say.<br>\r\n<br>\r\nAs you run your slender hands down your newly acquired body, the elevator doors open and you are interrupted. Stepping out onto the bustling first floor, you can feel a slight wetness between your legs as you think of the newfound possibilities, as you curl your hair coyly.</span></div></div>",
            "created":1587277740,
            "id":2820958,
            "title":"Nozomi - outreach worker "
        }
    },
    "info":{
        "author_id":"merry511",
        "author_name":"Judiciousoctagon",
        "brief_description":"A possession story with some focus on impersonation. 4000GP FOR GOOD CHAPTERS ",
        "created":1511627640,
        "description":"<td align=\"left\" class=\"norm\">This story follows Shu, a fresh college graduate doing an internship at an incredibly well established company. The building is over 15 stories tall and lives in the heart of downtown. The company has easily over a thousand current employees. <br>\r\n<br>\r\nInitially, Shu was excited at the prospect of doing his internship at such a well established organization. But due to his position as an intern, Shu is at the absolute bottom of the pecking order. <br>\r\n<br>\r\nHe is pushed around and given the jobs no one else wants to do. Shu meets it with apathy, believing his life will always be this way; until one day Shu finds a box in his new apartment containing a jewel that sucks itself into his skin. Shu takes this power in stride, deciding he will make it to the top, in any way possible<br>\r\n<br>\r\nWhenever Shu possesses someone, his body will continue as normal. He can depossess anyone at any time and become a spirit to find someone else to possess <br>\r\n<br>\r\n<b>Some characters, however you can add more </b><br>\r\n<br>\r\n<b>*everyone at the company will wear some form of business attire just for consistency </b><br>\r\n<br>\r\nFaith -28- your direct supervisor. She is very stuck up and uptight, leaving you with very tedious work. She is the typical office lady. Conservatively dressed with her brown hair tied in a bun with a cute figure. <br>\r\n<br>\r\nStephanie -31- the head of human resources. From your conversations with her she's a kind woman with a lot on her plate. She is constantly managing complaints and never seems to get a break. She wears business casual dress and has beautiful blonde hair with a mesmerizing face <br>\r\n<br>\r\nVictoria -23- a fellow intern. You are not entirely sure how she got an internship here. She is always slacking off, worrying more about her make up and nails then the work itself. Despite her poor work you can't deny she's attractive; with long blonde hair and great C cup breasts<br>\r\n<br>\r\nAlyssa -24- your team lead. She is very blunt, taking a direct approach whenever she can to get the job done. She is one of the few people that you can call a friend. She loves to work out and has a fantastic ass. She sometimes comes to work straight from the gym and you can't help but stare. <br>\r\n<br>\r\nAmelia -26- the company case manager. A bubbly woman who enjoys her job. She is beloved by everyone and has found great success at her young age. She is quite short (5'0\") with D cup breasts and a fine ass<br>\r\n<br>\r\nElise -32- the event planner. Elise single-handedly plans all major company events without breaking a sweat. She has an incredible sense of style with a refined flair to everything she does. She has long dark brown hair with C cup breasts and a fine ass<br>\r\n<br>\r\nRules: <br>\r\nNo abrupt endings <br>\r\nNo gore <br>\r\nKeep powers to just possession </td>",
        "id":2141656,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1594240980,
        "modified":1594240980,
        "pretty_title":"Working MY way up - Please add"
    }
}