{
    "chapters":{
        "1":{
            "author_id":"mjnfm",
            "author_name":"mjnfm",
            "choices":[
                "Dominant muscle master",
                "Obese big-bellied master",
                "Former bodybuilder master",
                "Poppers muscle master",
                "More doors"
            ],
            "content":"<div class=\"\"><div> <span>Through the first door is a muscular master ready to dominate you with his fantastic, flexing muscles.<br>\r\n<br>\r\nThrough the second door is an obese master ready to make you worship his wonderfully round and fat belly.<br>\r\n<br>\r\nThrough the third door is a former bodybuilder who put on a few pounds who has a nice, firm, round belly with his muscles, ready to dominate you.<br>\r\n<br>\r\nThrough the fourth door is a very experienced muscle master ready to take you under with fresh bottles of poppers.<br>\r\n<br>\r\nThrough the fifth door are more doors for more masters to choose from.</span></div></div>",
            "created":1579348440,
            "id":2775141,
            "title":"Make your decision, choose your door"
        },
        "12":{
            "author_id":"mjnfm",
            "author_name":"mjnfm",
            "choices":[
                "You immediately surrender to him",
                "You try to run back out the door",
                "You beg to worship him",
                "You use magic to make him bigger",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>His name is Alex. He is about 6'5 and 380 lbs of pure fat. Don't be fooled by his lard though. He knew how to use it well on small guys like you.<br>\r\n<br>\r\n\"What do you want twerp? Don't you see I'm busy eating and making myself more powerful by the minute? How dare you interrupt?!\" He yells, between bites of food.<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1582786740,
            "id":2793634,
            "title":"Obese big-bellied master"
        }
    },
    "info":{
        "author_id":"mjnfm",
        "author_name":"mjnfm",
        "brief_description":"Your gay muscular or fat master dominates you in fun ways!",
        "created":1579348080,
        "description":"<td align=\"left\" class=\"norm\">Gay muscle masters and fat masters get cocky and dominate you with their power!<br>\r\n<br>\r\nOnly rules I've got are no women, this is strictly gay. No scat or pissplay. Nothing overly nasty. Other than that, go wild.</td>",
        "id":2210597,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1582786740,
        "modified":1582786740,
        "pretty_title":"Dominance from Bullying Master"
    }
}