{
    "chapters":{
        "1":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><div> <span>Hey there! Welcome to your new school! I'm pretty sure you have a lot of questions of what we do at this school, but I just need you to do somethings for me first ok?<br>\r\n<br>\r\n(Nod your head)<br>\r\n<br>\r\nGood! Now, what's your gender?</span></div></div>",
            "created":1372395600,
            "id":1619234,
            "title":"You're new here, right?"
        },
        "11":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "William Tyson (Bio)",
                "Bruce Dunbar (Bio)",
                "Leroy Right (Bio)",
                "Pheonix Masters (Bio)",
                "Daniel Jackson (Bio)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ah, I see. You might want to be careful around the girl furries when they're in heat! <br>\r\n<br>\r\n(You shivered a bit)<br>\r\n<br>\r\nAnyways, what's your name, sir?</span></div></span></div>",
            "created":1372395600,
            "id":1619238,
            "title":"Empowered Gentlemen "
        },
        "111":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Alright, Let's Go!!"
            ],
            "content":"<div class=\"\"><div> <span>William Tyson, a three time rookie-of-the-year winning sports finatic with decent grades. Injured his leg when he played football one time. Really hates math. Got in a couple of fights, but is an overall good kid. He's usually in the gym, working on his physique. Other than sports, he has a fascination with acting &amp; drama class, but he feels this is too embarrassing for people to know. (Which is why he plays sports)  Though he's considered a jock, he doesn't prey on the weak. He will actually go out of his way to protect those who cannot protect themselves, so he's usually branded as a humble person with good morals.<br>\r\nHe transferred to Furry High to play on their Soccer, Football, AND Tennis team. (How's he gonna juggle that?)<br>\r\nHis dream is to make it as the best actor ever to live on the planet.<br>\r\n<br>\r\nStatistics:<br>\r\n<br>\r\nAge: 16<br>\r\nHieght: 5'8<br>\r\nWieght: 145 lbs<br>\r\nHair color: Blonde<br>\r\nEye color: Ocean Blue<br>\r\nEthnicity: Caucasian American <br>\r\nHobbies: Working out, Improv with great theatre actors in mirror, hitting on chicks, making friends, hanging out at the mall, going to amusement parks, driving his car, relaxing at the beach<br>\r\n<br>\r\n<br>\r\nDo you want him?</span></div></div>",
            "created":1372395600,
            "id":1619247,
            "title":"William Tyson, your not so aveage jock"
        },
        "1111":{
            "author_id":"huxley17",
            "author_name":"Leon",
            "choices":[
                "Nanokami (the Wolf)",
                "Kaitlyn (the Fox)",
                "Sora (the Raccoon)"
            ],
            "content":"<div class=\"\"><div> <span>As you sit there waiting for the wolf receptionist to finish looking over your file, she looks at you and then back at your file.<br>\r\n\"this sure is taking a while\" do you think yourself \" I wish she'd stop looking at me it's kind of creepy\" several minutes pass before you realize something is wrong,<br>\r\n\"umm miss?\" You say, no response \"miss?\" You say trying to get a response from her, again nothing that's when you turn your head over to the clock, The minutehand and the hourhand have both stopped moving not only that but it seems that everybody has stopped moving even the birds flying by outside aren't going anywhere, it's almost as if time is stopped, suddenly out of the blue you hear a voice.<br>\r\n\"hello there\" The voice sentence shivers up your spine, you look to your left and see a pale boy no older than you are with white messy spiky hair, his eyes are bright red yet there is no hatred coming from his voice, he wore a black and white striped shirt with black pants and white shoes \"do not worry time has only stopped momentarily, I have something here for you Mr. Tyson,\" your eyes widen,<br>\r\n\"how the hell does he know my name?\" the boy just looks at you and smiles,<br>\r\n\"it is a contract, do not worry it only states that you will abide by the choices you make and take full responsibility for the consequences, so do you accept?\" you think to yourself for a little bit and then you nod thinking that you have no other choice, \"excellent sign your name here please\" you accept the slip of paper on the clipboard and sign your name, \"well done Mr. Tyson I look forward to seeing you again until then farewell\" the boy suddenly disappears, as you blink you look back at the school clock and noticed that it is working again, it's as if nothing has happened,<br>\r\n\"well Mr. Tyson\" you hear the female wolf receptionist say \"it appears you are spending a year in our school let's see you do very well in music and acting, your parents were ... Oh ....  i'm sorry, I never realized your parents died in a car accident when you were 5 years old, do you forgive me, I never got the chance to read over your file before you got here, hmm... ok we can just skip that part and I'll show me where you're going to be in your first, second, and third block, and you got your Final block Free\" the wolf receptionist stands up out of her chair that's when you finally see the rest off her body, her breasts are almost the size of your head if not bigger, you imagine that they are around the D - F cup ratio, she also has a huge ass, and finally to kick it all off, she has very thick and very nice thighs, \"shall I accompany you to your first class and introduce you?\" <br>\r\n\"no thanks Mrs...\"<br>\r\n\"Wolf. Maria T. Wolf, but you can call me Mrs. Wolf, I am the receptionist here at Furry High, I am here to help you out with any problems you may have, and I do hope adjust quickly to a new school, if not I'm afraid I would have to eat you\" you gulp at that remark \"HA HA HA HA just kidding, but seriously make sure you follow the rules and you'll be just fine, by the way your first class is in building D-2F over there\" Maria says pointing to a three-story building \"you better get going, you don't want to be late on the first day\" you nod and walk out the door, as you look back you see Mrs. Wolf giving you a wink, you turn your head back forward and heading to the direction of your first class, Maria sat back dawn at her desk once there she started rubbing and playing with her nipples, \"ohh... this is going to be quite an interesting school year\" she then takes one more look at your file \"WilliamTyson ...hmmm?... I wouldn't mind giving him some private lessons of my own\" Mrs. Wolf quickly finishes playing with herself and then puts the file away.<br>\r\n<br>\r\n Meanwhile as you're heading to class you run into...</span></div></div>",
            "created":1499144400,
            "id":2347289,
            "title":"Well That's An Odd Way To Start The Day "
        },
        "11111":{
            "author_id":"huxley17",
            "author_name":"Leon",
            "choices":[
                "About Frost ",
                "About Your Life "
            ],
            "content":"<div class=\"\"><div> <span>As you walk down the steps towards the three-story building you reflect on what that white spiky haired boy told you earlier, <br>\r\n\"you will abide by the choices you make and take 100% responsibility for the consequences\"<br>\r\n\"what consequences?\" You think to yourself \"what did he mean by that?\" Suddenly you hear a very loud scream,<br>\r\n\"GET OUT OF THE WAY!!!\" You tilt your head to the left and see a gray furry wolf barrelling right towards you, \"GET OUT OF THE WAY, GET OUT OF THE WAY, GET OUT OF THE WAY!!!!\" before you knew it \"CRASH!!!\" He crashes right into you \"owww dude that sucked, ack! I'm sorry I didn't mean to bump into you, you okay?\"<br>\r\n\"Yeah I'm fine\" you reply<br>\r\n\"good, by the way my names Nanokami, I haven't seen you around town beforeare you ...oh that's right we're supposed to be getting a transfer student, you must be him i'm a first year student myself, so what's your name?\"<br>\r\n\"William, could you please get off me now?\"<br>\r\n\"Oh right, sorry\" Nanokami says as he gets up \"and it's nice to meet y...\" before Nanokami can say anything else you hear a loud ring \"SHIT! we'er running late, come on we'd better head to class or we'll both get it\"<br>\r\n<br>\r\nBoth you and Nanokami make it to class before the bell has finished ringing,<br>\r\n\"dude looks like you and I are in the same class, why don't you sit beside me? there's an empty spot right there\" Nanokami say pointing to an empty set, you shrug and decide to sit down beside Nanokami, as you walk past of the students a few of them already talking about you,<br>\r\n\"that's the new student?\" says a busty fox girl \"I didn't know he was such a looker\"<br>\r\n\"I wouldn't mind getting some study time with him\" says a really muscular Panther girl \"not to mention some private time as well (giggle)\"<br>\r\n\"do you think you have a shot with him?\" one Giselle girl whispers to her friend sitting next to her<br>\r\n\"come on get real\" her friend replies getting really agitated \"you already know I have a boyfriend\" as you make your way to your seat a huge, busty Arctic furry fox steps right infront of you,<br>\r\n\"hello there handsome\" she says as she presses her huge breasts against you \"My names Frost, if you ever need a \"Study Partner\" i'd be more than happy to help (giggle)\" you couldn't help but just look at her titanic sized tits, Frost gives another giggle before saying \"like what you see?\" she then leans in close and whispers into your ear \"how would you like to feel them?\" at this point your heart is beating so loud you couldn't hear the other students about how lucky you and how jealous they are, at that point an antelope walks in and tells everyone to take their seats, \"awww to bad, looks like we will have to do this another time\" Frost says \"but until then, this will do\" Frost quickly leans forward and licks your cheek and then goes to take her seat, you quickly go grab a seat beside Nanokami he quickly shoots you a thumbs up, then the both of you listen to the teachers instructions.<br>\r\n<br>\r\nThe day goes by pretty quickly teachers talked about life and mathematical problems and equations, it wasn't all that bad to say but least, the only problem was Frost wouldn't stop hitting on you, every chance she got she would push her breasts together and look seductively at you, once she even whispered to you well pointing at her breasts,<br>\r\n\"These are all yours\" she whispers as she blows you a kiss, finally at the end of your three classes you decide to head back to the hotel,<br>\r\n\"HEY!!\" You turn around to see who called you, it was Nanokami \"where are you staying at?\"<br>\r\n\"A hotel, there's no room for me at the dorms, my transfer was kind of last minute\"<br>\r\n\"A hotel? why don't you stay at my place, I got more than enough room there you can have a guest bedroom, plus the school is just a short walk away from my house\"<br>\r\n\"are you sure your parents wouldn't mind? I don't want to impose\"<br>\r\n\"don't worry about, it my dad works late all the time, but he's very nice and I'm sure he'll let you stay \" you think about it for a while then you say,<br>\r\n\"OK sure why not\"<br>\r\n\"Great, follow me\" and the two of you set off to Nanokami's house.<br>\r\n<br>\r\nOn the way Nanokami asks...<br>\r\n</span></div></div>",
            "created":1499144400,
            "id":2347361,
            "title":"Meet Nanokami"
        },
        "111111":{
            "author_id":"huxley17",
            "author_name":"Leon",
            "choices":[
                "You have a very weird dream ",
                "You go through a peaceful night "
            ],
            "content":"<div class=\"\"><div> <span>\"dude how do you get Frost to like you right off the bat?\" Nanokami asks as you and him make a sharp left turn \"Frost is most hottest girl in school, not to mention the bustiest, the last time I tried hitting on Frost she slapped me across the face\" you couldn't help but laugh, \"ouch dude that hurts\" Nanokami says sarcastically and the both just laugh.<br>\r\n<br>\r\nThree minutes later Nanokami stops in front of a pretty modern looking house,<br>\r\n\"that is nothing like I expected it to be\" you think to yourself.<br>\r\n\"here we are\" Nanokami says \"oh and it looks like dads home\" as you enter the house you notice that there are no pictures of Nanokami, just of someone who doesn't even look like his dad, \"hey dad!\" Nanokami yells \"your home early\", you turned a corner and see a large male anthro bear, he's just sitting there wearing what looks like to be casual clothes other than a pistol attached to his belt, right beside the gun was a police badge this give you the impression that this anthro bear was a cop,<br>\r\n\"I got off work early today, so we can ...oh who's this?\" The big bear stands up and looks right at you,<br>\r\n\"Dad this is William Tyson, he's the new transfer student at school\" Nanokami replies,<br>\r\n\"Oh really, where is he staying?\"<br>\r\n\"he says that he's staying in a hotel, but I thought it would be better if he were to stay here, is that okay with you?\"<br>\r\n\"it's fine with me, did he bring any clothes with him?\"<br>\r\n\"there still at the hotel officer\" you say \"I haven't had time to unpack, i'll go get it right now\"<br>\r\n\"don't bother i'll go pick them up myself, and you don't need to be so formal with me, my name is Yuri so just call me that, Nanokami show William to the guest bedroom\"<br>\r\n\"Ok dad\" Nanokami says, as you walk up the stairs with him,<br>\r\n\"Hey Nanokami mind if I ask you something personal?\" you ask, Nanokami looks at you and nods \"that guy Yuri, he's not your real dad is he?\" Nanokami looks away for a moment, \"i'm sorry that wasn't fair of me to ask\"<br>\r\n\"No it's fine\" Nanokami takes a deep breath and starts talking \"you see my mom abandoned me when I was just a pup, so my dad was the only one left to take care of me but he didn't do a really good job at it,  he would abuse me both physically and sexually it wouldn't be until I was three years old that the state stepped in and took me away, as for my dad he was arrested and charged with aggravated assault to a minor, physical, mental, and psychological child abuse, so I was placed in foster care until Yuri my dad adopted me as his son, and that's the story of my life, so what about you what's your story? don't you have any parents?\" You look down for a minute remaining silent, \"Oh I'm sorry I didn't know they where dead\"<br>\r\n\"both my mom and dad died in a car accident when I was five years old, they say that the person who hit us was a drunk driver, ever since that I kept getting bounced around from place to place until I was old enough to inherit my parents Life insurance, they were both insured for about $2.3 million, but I don't think any amount of money could bring the back, i'd rather not talk about this anymore\"<br>\r\n\"sure, here's the guest bedroom, you have your own bathroom and shower, see you tomorrow dude\"<br>\r\n<br>\r\nThat night....</span></div></div>",
            "created":1499230800,
            "id":2347446,
            "title":"About Frost "
        },
        "1111112":{
            "author_id":"icekitsune07",
            "author_name":"Elemental Kitsune",
            "choices":[
                "\"But only to tell her that I'd want to get to know her a bit better first.\" ",
                "\"And enjoy the \"tour\" she plans to give me.\" ",
                "\"That I plan to move in with her. Sorry dude.\" "
            ],
            "content":"<div class=\"\"><div> <span>William had gone through multiple dreams during the night, most of which he knew he wasn't going to remember by the time he woke up. His last dream, however, left a bit more of an impact on his memory. It was a lucid dream, so he knew where he was and that he was actually in a dream. He was currently sitting in the Math class that he met Frost in but there was one huge difference this time.<br>\r\n<br>\r\nOnly the girls in the class were there. He was the only male in the middle of a bunch of anthro girls of multiple species and most, if not all, of them were looking at him with lustful expressions on their faces. Normally, he wouldn't know what to do in this situation but in this dream he felt much more confident than usual. He leaned back into his seat and let his arms rest onto the back of his chair, showing off his muscular upper body a bit and causing quite a few of the girls to lick their lips or even moan in want at the sight of him. <br>\r\n<br>\r\n\"I hope we don't get interrupted this time,\" He heard a voice coming from his right side and he immediately saw the voluptuous body of Frost walking up to him with a sensual sway of her hips, a seductive gaze staring at him. She looked just as gorgeous as ever as she had a rather simple outfit on but still did nothing to hide the outrageous curves her body possessed. All she wore was a white, buttoned blouse that had quite a few buttons unfastened so that she could show off a more than abundant amount of cleavage. William saw her nipples poking through the shirt and he was able to tell that she wasn't wearing a bra underneath it. On her lower body, she went with a simple black skirt made of silk, but it was so short that it only just barely covered her ass and would occasionally show that she was wearing a lace thong to cover her unmentionables. <br>\r\n<br>\r\nOnce she was right next to him, she threw one of her legs over his chair and straddled the lone human male. She then immediately pressed her body against him, pressing her absolutely massive breasts against his chest as she wrapped her arms around his next. \"Just you, me and a bunch of other hot babes that are more than willing to give you a good time, handsome.\" The bust arctic fox rose her body a bit, making them level with his face. <br>\r\n<br>\r\nIn response, William placed his hands onto her wide hips gripping them firmly. \"What more could a guy want?\" He asked as he felt himself getting hard beneath his pants, a very prominent bulge forming at the crotch of them. <br>\r\n<br>\r\n\"How about a pair of fat tits that you can do anything you want with?\" Frost smirked before she pulled his face right into the valley of her cleavage, her mountainous mounds conforming and jiggling around his face as she smothered him with her endowments. She heard him moan in both pleasure and surprise and it caused her smirk to widen as she wiggled her shoulders as she began to scrub as much of her furry mounds against his face as she could. \"I meant what I said to you in class, baby.\" She said huskily to him. \"These huge jugs are all yours. I'll let you do anything you want. Touch them, rub them, grope them... I'll even let you fuck them.\" She lowered her barely covered pussy against his and moaned when she felt how hard he was right now. \"Mmm... any time you want.\"<br>\r\n<br>\r\n\"Don't hog him all to yourself, Frost.\" Another voice as heard and William, albeit regrettably, pulled himself away from the heavenly melons that had tried to smother him. He turned his head to see a tigress that was also quite busty and curvy, though her cup size seemed to be only just slightly smaller than that of Frost's. \"Let me have some fun with him too.\" She used her biceps to push at the size of her breasts, pressing them against each other and causing the blue sports bra that she was wearing to really have to work in order to keep those huge tits from spilling out. <br>\r\n<br>\r\n\"Me too!\" Another voice called out and he turned to see a wolfess that was, yet again, quite well-endowed and curvaceous in frame. <br>\r\n<br>\r\n\"And me!\" More and more anthro girls began to surround him, the body types becoming a bit more diverse as he saw a few that weren't quite as busty but more than made up for it with asses that looked like they were built to be spanked. <br>\r\n<br>\r\nAfter a couple of minutes of hearing and seeing all of these girls wanting him, William felt Frost cup his cheek with one of her paw-hands so that she could make him look back at her. \"Well? Think you can handle all of us, stud?\" <br>\r\n<br>\r\nAnd that was where his dream ended. <br>\r\n<br>\r\nWilliam sighed in frustration, mainly because he was really enjoying that and he wanted to see what was going to happen next. But also because when he woke up, a few shafts of light beaming through the curtains of his new room, he was the hardest he'd ever been in his life. All it took was one day at his new school and he was already having sordid dreams about all of the girls he'd seen/met yesterday. <br>\r\n<br>\r\nAfter doing his morning routine and taking a shower, a fully clothed and refreshed William Tyson walked into the living room of Nanokami's home. The human saw said wolf and his father eating some breakfast at their dining table. When they saw William, they both greeted him and made him a plate of what they were having. They made light conversation until it was time for them all to head out, them to school and Nanokami's dad off to work. <br>\r\n<br>\r\nWilliam and the gray wolf both made it to class with a few minutes to spare this time but, just like yesterday, the lone human was stopped by the vivacious and seductive vixen that had pleasurably plagued his dreams last night. Crazily enough, she happened to be wearing the same outfit from his dream too, her breasts bouncing and jiggling inside of the tight white blouse with every step she took towards him.\"Hey, Frost.\" He greeted her but grunted when she merely gave him a sensual grin as she pressed her immense bust against his chest. <br>\r\n<br>\r\n\"Hey, handsome.\" She said as she slid her paws up his arms in a slow, teasing manner all the way up to his shoulders before she perched them there. \"How about we go into the corner for a few minutes so you can feel me up?\" Her brazen question made him gulp, not in nervousness but in awe at the sheer amount of how confident she was and how such a sexy girl wanted him. <br>\r\n<br>\r\nUnfortunately, the teacher chose this time to walk into the classroom. \"Alright everyone... time to start the day.\" The tall antelope woman said to them, making Frost pout. <br>\r\n<br>\r\n\"Hmm... another chance spoiled.\" Her expression soon changed to her usual seductive one. \"Meet me out at the entrance after we're done for the day. I really would like to give you... a tour of my place.\" She whispered huskily to him before she gave him a soft kiss on the cheek. \"Maybe I can even convince my father to let you stay there if you want. Until then...\" The busty vixen walked away from him to head to her seat, every step making her wide hips sway to and fro as she brushed his crotch with her luxurious tail. <br>\r\n<br>\r\nWilliam watched her the entire time before he shook his head to compose himself and sat down at his desk, a few of the other girls giggling in amusement at his reaction while a few males looked both envious and angry at him for getting Frost's attention so much. <br>\r\n<br>\r\nDuring the class, Nanokami leaned over to him and whispered. \"Hey, I heard her offer, dude.\" His voice was as low as he could make it so that the teacher didn't catch him. \"What are you going to do?\"<br>\r\n<br>\r\nWilliam furrowed his brows for a few moments before he replied. \"I'll meet with her...\" He paused before he continued, his wolf friend leaning in to hear his decision. <br>\r\n<br>\r\n</span></div></div>",
            "created":1526187600,
            "id":2492921,
            "title":"You go through a peaceful night "
        },
        "11113":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Destination: Gym class"
            ],
            "content":"<div class=\"\"><div> <span>You looked at your schedule to see what your classes would be like. “Let’s see here.......P.E. first period, that’ll be a breeze...........Math second.........aw.........English third..........Strength Training for fourth...........Drama class?” You stopped in your tracks. How did the principal even know you wanted to be in your dream class? Your heart was filled with excitement &amp; nervousness at the fun you would have in class, but your secret would be exposed. You continued walking as you read on, “Home Economics for sixth.............&amp; a free period at the end of the day for “creative intuition”.........hm, more schools should do this. What a great way to end the day.” You put your schedule away. <br>\r\n<br>\r\nWalking down the hall, you were about to bust a right turn down the hall, when you heard footsteps scurrying along the ground. “Get back here ring tailed scum!” A rough &amp; rugged voice bellowed. <br>\r\nAnother voice rebuttled sarcastically, “Oh no! Personal insults! My only weakness!” He laughed at the chaser.<br>\r\nJust then, a raccoon ran past you, almost colliding with you if you’d turned that corner.<br>\r\n<br>\r\nHe was about your height, smokey grey fur, with a very athletic build. He was sporting midnight blue joggers, a white tee, &amp; a smirk that would make even the gayest girl wet. His eyes were a shiny golden color, &amp; his tail had 3 consecutive dark rings wrapped around it, with the middle ring being the thickest. In his hands were a thick tortoise shell, one that looked like it belonged to a student in this school. The raccoon was hauling ass down the hall adjacent to you.<br>\r\nThat’s when you noticed his chaser: An all black stallion horse, complete with the whitest silver eyes you’ve ever seen in your life time! He was on 2 legs, which made him at least 7 feet tall. “What the hell?” Is all you cloud say as you witnessed this chase.<br>\r\n<br>\r\nThe stallion was keeping speed with the raccoon, “Give me back that shell, Soda!” He neighed in anger.<br>\r\n<br>\r\nThe raccoon did the quickest 180 you’ve ever seen in history, charging towards the stallion at the same sprint speed he was running away from him with, “How many times do I have to tell you,” He slid up under him, tying the stallion’s mane to a nearby locker with so much speed &amp; precision, “My name, is Sora.” The horse neighed in pain as it tried to free itself from his newfound prison. “Don’t bother, Prince. Your hooves will only make it worse. You’ll just have to wait for a teacher, AGAIN!” Sora laughed as he started walking back toward your directions. You blocked him as soon as you crossed his path.<br>\r\n<br>\r\n“Dude, that’s not cool.” You told him, crossing your arms.<br>\r\n<br>\r\nThe raccoon looked at you with confusion, then chuckled, “You must be the new meat here.” He looked you up &amp; down, “No wonder you have no fur or distinct features.” He held out his hand, placing the tortoise shell in between his other arm &amp; side, “Sora.” You stared at him, unamused by his friendly gesture.<br>\r\n<br>\r\n“I don’t like bullies. First you take something from him, then you tie him up?” You slapped his hand away.<br>\r\n<br>\r\nSora placed the tortoise shell on the ground, smiling at you, “Ah.........I love this part........listen, I’m not the villain here, buddy. That giant Buffon you see over there?” He pointed to the stallion, “He’s a giant pervert &amp; the bully you should be “bad coping”. This tortoise shell belongs to a friend of mine, who he likes to mess with on a regular basis. I’m just returning her property from pitiful thieves like him.” He showed you a carving of initials on the inside of the shell: D.W. ( ;) )<br>\r\n<br>\r\n“Ah.........I see........good to see a strong one standing up for the weak.” You extended your hand out, “I’m William Tyson. My old friends used to call me “Ty”.” He eagerly shook your hand.<br>\r\n<br>\r\n“Nice to meet you, man. Again, I’m Sora. Sora Majesty.” He said brightly.<br>\r\n<br>\r\nYou tilted your head slightly, “Like.......from the game “Kingdom Hearts”?”<br>\r\n<br>\r\nThis earned a laugh from him, “Exactly! My parents said they played it everyday during my mother’s pregnancy. She said she wanted me to have a positive mindset &amp; bring people together like the main character did.” He shook his head, “My family sure has a weird way of looking at the world.......” Sora looked behind you, noticing a familiar tortoise jogging up to you two. “&amp; as if on cue, here comes our distressed damsel.”<br>\r\n<br>\r\nYou turned around to see the most beautiful reptilian ever. She was 4 foot nothing, with a slim &amp; curvy figure. Contrary to the pet turtles you’ve had, her skin looked extremely smooth; her skin color was one of your favorites of all time: Olive green. She carried an ample C cup bust, a very visible six pack, &amp; the sexiest hips that captivated you as she swayed down the hallway towards you two. Her eyes were a nice mixture of green &amp; brown, a perfect hazel color. She had long, flowing brown hair that stopped just at her shoulders, which she waved out of her face as she came closer. Her very presence just oozed charm, &amp; you couldn’t take your eyes off of her.<br>\r\n<br>\r\nSora waved his hand in front of your face to bring you back to reality, “Earth to William? You gonna introduce yourself or what?” You shook your head, slightly embarrassed at your ogling.<br>\r\n<br>\r\n“Yeah.......uh, Hi. I’m William Tyson.” You awkwardly waved at the beautiful tortoise.<br>\r\n<br>\r\nShe chuckled, “You’re cute.” She held out her hand, “Charisma. My friends call me Charm.” You shook her hand, &amp; she pulled you closer, whispering into your ear, “But you can call me whatever you like, sweetie.” She kissed your cheek &amp; pulled back.<br>\r\n<br>\r\nSora laughed &amp; shook his head, “That’s my girl: Always forward in who she likes.” The ring tailed animal handed Charm back her tortoise shell, which she gladly placed on her back. “How many times are you gonna let him keep doing this before you report him for sexual harassment, C?” Sora asked, referring to the stallion who was still struggling to get free from the locker.<br>\r\n<br>\r\n“Eh, I like the attention. Even if it’s from a sad little guy like Jarhead.” Charisma stated nonchalantly. She then brought her eyes back to you. “So, What brings a handsome human like you to FH, Mr. Tyson?” She placed her hands on her hips, eagerly awaiting your answer.<br>\r\n<br>\r\nYou blushed, “Ah, well........in my past schools, all the sports teams were pretty terrible, so I’m hoping to get onto a good sports team here.” You answered, though you were honestly looking forward to your acting classes more than your sports classes.<br>\r\n<br>\r\nSora smiled, “Sounds like you’ll be good for the wrestling team if that’s the case. I’m the captain of it. Tell me, what’s your first class today?” <br>\r\n<br>\r\nYou showed him your schedule, “P.E.” <br>\r\n<br>\r\n“Awesome! My coach is the P.E. teacher! Plus, that’s my first period as well! I can totally get you in if you show him something good!” His tail was swaying rather intensely, “How’s that sound?” <br>\r\n<br>\r\n“It sounds like we’re gonna be good friends, Keyblade wielder.” Sora punched you in the arm playfully as you both shared a laugh.<br>\r\n<br>\r\nCharm swiped your schedule from Sora, checking out for specific classes. “Aww........I won’t be able to see you until Drama, &amp; then I’ll have to wait at the end of the day to mess with you during our free period.” She pouted, handing you back your schedule. Looking at her watch, she gasped, “The bells about to ring, guys! We have to go!” She gave Sora a huge hug, almost taking him off his feet, “Thank you sooooooo much for always sticking up for me, Sky!” <br>\r\n<br>\r\nSora winced, “No prob, C?”<br>\r\n<br>\r\nShe placed him down, slowly coming up to you, &amp; giving you the most seductive hug you’ve ever felt. She smelled like roses &amp; lavender. “&amp; Thank you for giving my ex a playmate.” She licked your ear, making you shudder in pleasure, “I’ll see you later.” She released the hug &amp; slipped to class.<br>\r\n<br>\r\nYou realized something she said that made you ponder, “Ex?” Sora placed a hand on your shoulder.<br>\r\n<br>\r\n“Yes, you heard correctly: Charisma’s my ex girlfriend. Well.......sort of.” You looked at him like you saw a ghost, “Relax, Ty. I’m not that type of person to get jealous cause of past partners. You’re good if you want to go for it.” Sora looked at his watch, “Shit......5 minutes........come on! I know a short cut!” You started following Sora as he started sprinting down the halls.<br>\r\n<br>\r\nYou heard something huge fall &amp; a neigh behind you; you looked back to see a 6 foot horse gaining on you &amp; you’re new friend, “SODA!!!!!” You &amp; Sora went through some double doors too small for the horse to fit through. “DAMN YOU, SODA!” The horse struggled to get through the doors, but with no luck.<br>\r\n<br>\r\nSora laughed as he kept sprinting further away from the horse towards the gym, “Better luck next time, Princey!”<br>\r\n<br>\r\n‘Sheesh.......’ You thought to yourself, ‘This is gonna be one hell of a school year.........’<br>\r\n</span></div></div>",
            "created":1531630800,
            "id":2520041,
            "title":"Instant Friendship (With benefits)"
        },
        "112":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Why not?"
            ],
            "content":"<div class=\"\"><div> <span>A rather intelligent boy. Has straight A's, never got in trouble. Really likes math and science. Has a slight attraction towards anthro's, but not sick enough to actually fuck one. (Yet) He also is a wiz when it comes to mechanics. He's not one to get into fights, as he hates violence, &amp; would rather find different, more peaceful ways to handle situations. You'll usually never see him without his Cannon HD camera around his neck, always taking pictures of different scenery whenever he gets the chance. When he's feeling REALLY creative, he'll even build new inventions that benefit him &amp; everyone around him! His dream is to one day become a gifted photographer &amp; video director.<br>\r\n<br>\r\nStatistics:<br>\r\n<br>\r\nAge: 14 <br>\r\nHieght: 5'2<br>\r\nWieght: 112<br>\r\nEye color: Emerald green<br>\r\nHair color: Cinnamon brown<br>\r\nEthnicity: Italian American<br>\r\nHobbies: Reading, building robots, studying, photography, video editing, exploring new places, making friends with nice people<br>\r\n<br>\r\nDo you want him?</span></div></div>",
            "created":1372482000,
            "id":1619802,
            "title":"Bruce Dunbar, The brains"
        },
        "1121":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"Mmhmm.......mmhm.\" The Staff female wolf said. She had breasts the size of overgrown watermelons, and looked like she had triple D's. She stood up and handed you your papers back.<br>\r\n<br>\r\n\"Very, very nice grades, Mr.Bruce! I have the perfect set of classes for you to go to this year!\" She told you with a wolfish grin. As she stood, you noticed she had a huge ass that could be use to mash raw meat. You blushed and turned your attention back to her. You gulped and asked her, \"So, what's gonna be my first class? I'm not sure what they do for humans around here.\"<br>\r\n<br>\r\nShe giggled and fix the color to her blue work dress that made her look like she had a coke bottle body figure. \"Your first class will be in room 217, hall 13.\" she handed you a slip and a strange orange slip. You saw one had the class you were going to go to, and one to her office. You looked at her with a confused face, \"What's the orange one for?\" Her ears twitched at that question, and she started smoothing out her dress, not giving you direct eye contact.<br>\r\n<br>\r\n\"Oh, uh.....That's, um....For whenever you need any assistance on getting around the school.....heh.\" She said, blushing heavily that you could see it through her grey fur. You were still confused as to why she would be so shy as to tell you that, but you shook it off. \"Thanks a lot miss....\" You waited for her reply. \"Oh! I'm terribly sorry! Where are my matters? Ms.Luna Helena.\" She said reacheing out to shake your hand. You obliged, and shook hands with her. Her hands felt fuzzy and warm, it was a feeling you wish lasted a few seconds longer, but you had to get to your class. You could'nt be late on the first day!<br>\r\n<br>\r\nYou broke your hand away from Ms.Luna and grabbed your bookbag, rushing out the door. \"Thanks again, Ms.Luna!\" You yelled, hoping she'd hear you after rushing down the hall. \"Your welcome!\" she replied, closing the door and ripping the buttons to the top of her dress open, releasing her huge furry breasts that were not hidden with any sort of bra.<br>\r\n<br>\r\nShe moaned as she felt her nipples getting harded at the thought of fucking the new human student. \"I can't wait till he comes back.\" She gasped. \"This is going to be a good school year.\"<br>\r\n</span></div></div>",
            "created":1372741200,
            "id":1621353,
            "title":"Welcome to Furry high!"
        },
        "11211":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Get to know her",
                "Apologize and get to class (Wuss!!!)"
            ],
            "content":"<div class=\"\"><div> <span>You walked out of the administrative office and started towards the main building. You slowed down to take in the senery. \"Wow, for a furry school, they sure know how to work around here.\" You thought out loud. You saw a fountain with a Dragon, it's wings spread out with it's face mangled in an expression that looked like he was ready to kill the nearest thing. You also saw it's mouth open with water spouting out of it. You went up close to admire the stone dragon, looking at the patterns of it's scalely skin, it's frim stomach and abs. You had a confused look, 'Since when did dragons have abs?' you thought. <br>\r\n<br>\r\nYou also noticed that this stone dragon had breasts, making it a female dragon. You looked over at the engravement of the dragons plack, and it read:<br>\r\n<b>Here stands the glorious queen Ember, the founder and dragoness of these very grounds you stand on.<br>\r\n Cower in dispare at her magnificent power.<br>\r\n 510 - Inf. As she will live on forever </b><br>\r\n<br>\r\nYou wistled, \"Powerful stuff.\" You grabbed you camera out your book bag and started taking pictures of the statue. You always did have a thing with photography. Just as you were about to take a full body picture by backing up, you backed into something. \"I know, right? My Great-great grandmother always DID have a way with having a powerful look.\" a voice giggled behind you. You turned to see a dragoness with shiny pink scales, and ocean blue eyes. You jumped a bit and fell on your back.<br>\r\n<br>\r\nWhile you laid there, you obseved the girl dragon a bit more. She had a silk silver glitter shirt that let here breasts hang freely, which looked like a size H. 'Seriously, how do these animals have over sized genitals?' you thought to yourself. You noticed she had a short skimpy navy blue skirt on that showed off her G string and muscular legs. She notice you oggling her, and smirked. <br>\r\n<br>\r\n\"Oooh, you like what you see?\" She turned around to let you get a glimpse at her ass. It was HUGE, appart from her tail swinging back and forth. You noticed that you could slightly see her phat pussy as she bended over. She turned back to look at you, till bended over. \"You like that?\" She smacked it for more affect. You blushed slightly and got off of the ground.</span></div></div>",
            "created":1373000400,
            "id":1622984,
            "title":"The statue"
        },
        "112111":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Flew through a window to the class you had",
                "Flew to back to the double doors to the main building"
            ],
            "content":"<div class=\"\"><div> <span>You got up off the grass and brushed your red ecko shirt and blue denim jeans of any dirt. You looked over towards the busty dragoness who was still bent over, shaking her fat scaley but surprisingly smooth looking ass in your direction. She even gave it another smack, causing it to jiggle. You noticed you vision was blurry. You patted all around the grassy floor, looking for your only chance of surviving high school.<br>\r\n<br>\r\n'Where the hell are my glasses?' you thought as you frantically searched for them. (Yes, this character wears glasses)<br>\r\n<br>\r\nThe dragoness noticed your frantic search and saw something right next to her talons, and figured that might be what you were looking for. She picked them up and did a slurty walk towards you, her breasts and ass jiggling with each bounce. Apparently, you didn't notice that she was right in front of you, as you were still searching for your glasses.<br>\r\n<br>\r\nShe flicked her tail on the tip of your nose, \"Hey, is this what your looking for?\" She giggled, waving your glasses in front of your face.<br>\r\n<br>\r\nYou sighed in relief, and smiled at the dragoness, \" Thanks so much. I really needed these.\" You reached out to take your glasses from the dragoness, but she pulled the back out of your reach.<br>\r\n<br>\r\n\"Ah, ah, ah! Not so fast, tricky boy!\" She giggled as she trailed off in thought.<br>\r\n<br>\r\nAfter a few moments, she finally said, \"Okay, if you want your glasses.....\" She put them in between her g string, \"You gotta get them off me!\"<br>\r\n<br>\r\nYou blushed, looking at where your glasses were on this busty dragoness who teased you for them. <br>\r\n<br>\r\nShe pulled up her skirt more, \"Well? Don't just sit there, get your stuff!\" She inched her private toward your face. You saw that she was soaking wet inside her g-string, and her pussy seemed to be pulsating.<br>\r\n<br>\r\nYou take a deep breath, and reached inside her g-string. \"Aww, why did she have to put them IN her panties?\" you murmured silently as you slide your glasses from out her juicy pussy, cause her to moan and snort. Smoke came out as she snorted.<br>\r\n<br>\r\nAs soon as you got your glasses out, you held them between your thumb and index finger. It was dripping with her pussy juice, which wss a shiny lavender color. Close to the color of her shiny pink scales.<br>\r\n<br>\r\nShe giggled more and pulled her skirt down, \"That's one of my kinks I love to do. I'm glad I got to do it with a human.\" She did a little innocent girl pose, biting one of her long nails on her fingers.<br>\r\n<br>\r\nYou wiped off your glasses, \"Yeah, thanks.\" you told her before putting them on and beholding this beautiful beast clearly. Her scales shined as the sun hit them, and made her silver glitter shirt sparkle. You also noticed her breasts looked bigger closer up..<br>\r\n<br>\r\n'Hmm, she must be a size E.' You thought to yourself. You had sort of a boobie fetish. You knew pretty much ever thing about tits.<br>\r\n<br>\r\nShe notices you eying her fun bags, \"Oh, you like big titties, huh? Naughty.\" she giggled as she bounced her titties. She pulled her shirt to reveal her juicy, grape looking breasts. The dragoness also had nipples that pointed out like the otters of a coe.<br>\r\n<br>\r\nYou shook your head and looked at your watch. \"Huh, 12 minutes before class starts.....\" you got your camera and bookbag off the ground. You turned toward the dragoness, who looked confused at your actions.<br>\r\n<br>\r\nYou smiled in her direction, \"Look, thanks for getting my glasses back, but I really have to get to class.\" You reached out to shake her hand.<br>\r\n<br>\r\nShe smirked, pulled down her shirt, and grabbed your hand. What you were expecting to be a hand shake, turned into a pull right into the dragoness' scaley athletic arms.<br>\r\n<br>\r\n\"Oh, no. Your not getting away from me that easily.\" She put you on her back soared into the air. You hung on for dear life.<br>\r\n<br>\r\nThe dragoness turned back to look ar you, \"What's your name, cutie?\" she asked between flaps.<br>\r\n<br>\r\n\"Bruce Dunbar!\" You yelled in reply.<br>\r\n<br>\r\nShe giggled, \"Bruce, such a strong name for you.\" she told you. \"My name's Serenity the dragoness, but every just calls me Sere.\"<br>\r\n<br>\r\nYou looked over towards the school, it was a beautiful view, but you really wanted to get to class.<br>\r\n<br>\r\nYou pulled her ear back to your face, \"Where are you taking me, Serenity?\" <br>\r\n<br>\r\nShe smiled, and</span></div></div>",
            "created":1373259600,
            "id":1624817,
            "title":"A stroll down the dragoness"
        },
        "1121111":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "\"The human genitals!\"",
                "\"The furries' genitals!\""
            ],
            "content":"<div class=\"\"><div> <span>Serenity flew across the school grounds for a few minutes, passing many short and tall. She stopped when you both reached a very tall building with an open window. She grabbed you from behind her and hugged you close to her scaly warm body.<br>\r\n<br>\r\n\"It's better if you don't get injured during this. Its your first day, after all.\" She pressed your head into her deep cleavage.<br>\r\n<br>\r\nYou looked up at her, confused. \"Get hurt during whaAAAAAAAAAAAA!!!!!!\" You hollered as Serenity did a sharp dive, closing her wings. She curled her body, making sure to encircle you as she landed into the classroom, landing back first. <br>\r\n<br>\r\nShe sighed, \"Thanks for flying air Sere.\" She giggled as she put her hands behind her head, relaxing from her landing. Her book bag had broken her fall. You had wrapped yourself around Serenity, holding on tight as you buried you face in her enormous marshmallows. You noticed that the impact of the crash had stopped, and you looked up to see Serenity's lunar space blue eyes staring down at you. She had a smirk on her face, \"Mmm, you like being in between my girls, huh?\" She squeezed her breasts together and trapped your head in her mountains. Blushing, you pulled your face away from her tits, and got off of her. This earned you a frown from her.<br>\r\n<br>\r\nYou sighed as you picked up your things and placed them on a desk nearest you. \"Sorry about that.\" You saw her book bag on the floor, so you picked it up and held it out in her direction. <br>\r\n<br>\r\nShe grabbed your wrist and pulled you close, \"Oh no, it was my pleasure.\" She giggled as she licked your cheek with her lizard fork tounge, guiding it up until she reached your right ear. She licked it slowly, moistening each region of skin on your ear. You shivered in pleasure. There was nothing you liked.....no LOVED, more than to get your right ear licked. It was one of your favorite kinks. Before she trapped you in ecstasy, you pulled away from her, wiping your ear off. This caused her to laugh, \"Looks like I found a kink of yours, Brucey.\" she giggled.<br>\r\n<br>\r\nYou rolled your eyes, \"You know, you could've just walked me to class, Serenity.\" You waited to see her response.<br>\r\n<br>\r\nShe grinned ear to ear and bit one of her long fingernails, \"I could've, but I already knew what class you were coming into.\" She giggled.<br>\r\n<br>\r\nYou raised an eyebrow, \"How did you even know?\" You saw she had your slip in her hand. How did she take it off of you? You had it in your pocket the whole time.<br>\r\n<br>\r\nSerenity got up and walked towards you. \"Besides.......I wanted to get to know you better.\" She had put a hand on your cheek, her eyes staring deeply into yours. You felt the urge to kiss this dragoness for some reason, so as she leaned forward, you did so as well, both of you puckering your lips and then..........<br>\r\n<br>\r\nBBBBBBBRRRRRRRRRIIIIIIIIIIIIINNNNNNNNGGGGGGGGG!!!!!!<br>\r\n<br>\r\nThe school bell had rung, causing both of you to jump out of your moment.<br>\r\n<br>\r\nSerenity sighed, \"Damn........class is gonna start soon.\" She grabbed her things and went to the back row, placing her things on the middle desk as she sat down. She looked over to you as you stood there, looking for a good place to sit. She rolled her eyes and gestured you over, \"Come here. Sit next to me.\"<br>\r\n<br>\r\nYou looked over to the door to see someone trying to unlock it, along with the commotion that going on outside that sounded like a group of students chatting. You grabbed your bookbag and camera and quickly took the seat next to Serenity in the back, putting your things on the desk. Suddenly, the door swung open, revealing a bunch a mixed anthros ranging from lions, tigers, and leopards, to mice, rats, and horses. They all filled in their seats, sitting with their friends and others sitting anywhere else. All of them were so distracted that they didn't seem to notice you. Then, a short ferret came in, wearing a short blue skirt and a white button up shirt with a blue jacket to match. She had C cup sized breast and a small but cute butt.<br>\r\n<br>\r\nShe placed the binder she was holding on the front desk and adjusted her glasses before facing the class, \"Ahem, everyone, may I have your attention, please?\" All the furries stopped their commotion to acknowledge the ferret. She continued, \"The first thing I'd like to say, is welcome all freshman to Furry High. Thank you for choosing our school. I hope you'll learn much from our sophomores and juniors while your here.\" All the sophomores and juniors chuckled, scooping the room for any newcomers to their school. One wolf had his eyes set on a nervous looking raccoon, who was trying to sink in her seat to hide. A female Leopard was staring lustfully at a bored looking squirrel, as he did not look impressed with any intimidation that the higher graders were giving him.<br>\r\n<br>\r\nThe ferret took a chalk off the chalkboard, \"Okay, class. My name is......\" She stood on her toes to write towards the middle of the board, showing off her white panties as she did so. You heard a couple whistles and sexy growls in the middle section of the desks. She spoke as she wrote, \"Miss.......La.......Dina.\" Ms.Ladina stopped as she finished writing on the board. She looked like she was about to say something else, when she looked towards the back at you and Serenity. She put a hand on her hip, \"Serenity, dear?\" <br>\r\n<br>\r\nSerenity looked up from her boredom, \"Yes, ma'am?\" <br>\r\n<br>\r\n\"I didn't see you walk in the classroom with the everyone else, did you take THAT route, again?\" Ms.Ladina gestured toward the open window.<br>\r\n<br>\r\nSerenity blushed, \"Well.......Yeah....I like coming through there a lot.\"<br>\r\n<br>\r\nMs.Ladina sighed, \"Well, as long as I know it's you. What other reason do I leave it open for, anyways?\" She then turned her eyes toward you, \"And it looks like you brought a friend.\"<br>\r\n<br>\r\nSerenity blushed even more as you jerked up when she saw you. Soon, every head was turned in your direction. There was stares of confusion, amazement, anger, and lust, you also heard people whispering different things about you, like what'd they do to you or why you came to this school. You gulped and sat back in you seat, hoping for some type of shielding from the eyes that pored into your skin, but there was no avail.<br>\r\n<br>\r\nThe teacher continued to speak, \"What is your name, sir?\"<br>\r\n<br>\r\nYou gulped again before clearing your throat, \"Bruce Dunbar, ma'am.\" You said hesitantly.<br>\r\n<br>\r\nHer eyes beamed, \"Ah, you must be a new student here! Let me see........Ah! Here's your name!\" She said, looking though her binder before looking up, \"Yep, this is definitely your first class.\" She gestured you over with her hand, \"Come, come! Please, tell us about yourself to the class.\"<br>\r\n<br>\r\nYou felt you spine tingle at the thought of walking in between these desks. You slowly rose from your seat and walked toward the class slowly. All eyes were glued to you as you walked to the front of the classroom, your heart was racing faster and faster with each step you took. As you were walking past a smooth furried vixen, you noticed she gave you a look of lust and determination on her face. She waved her tail in your direction, causing you to brush it as you passed her. You shuddered and sped your steps up. You also walked past a dragon with anger in his eyes. His crimson red eyes followed you all the way till you were about to pass his desk. He snorted, causing smoke to come out of his nose and it touched your skin. It burned worse than tea kettle steam on a stove, but not enough to give you any degree of burns. You winced and held your now red arm as you rushed to the front of the class next to Ms.Ladina. You sighed in relief, wondering how long it would last.<br>\r\n<br>\r\nThe teacher ferret clapped her hands quick ad softly as she patted your shoulder, \"Go on, don't be shy!\" She looked at you, waiting to respond. You turned to look at all the hungry/angry/lustful/suspicious faces of all the furries in the classroom.<br>\r\n<br>\r\nYou sighed, lowering your head, 'Let's get this over with......' You thought as you raised your head to look back at the classroom, mostly focusing on Serenity. She had a look of worry on her face as she stared back at you. You took a breath and described the classroom. (Yeah.....I'm not gonna type a description of him)<br>\r\n<br>\r\n*A few minutes later*<br>\r\n<br>\r\nEveryone was \"Ooooo\"ing and \"Ahhhh\"ing as you finished explaining yourself to the class. <br>\r\n<br>\r\nThe teacher did a short hop, \"Well! Everyone, welcome Bruce to our school! Give him a hand!\" All the furries solemnly clapped as you walked back to your seat, all eyes still focused on you. The teacher clapped her hands and called everyone's attention, \"Okay, class! Let's get to work!\" She walked to the board and started writing. \"Today, we're gonna learn about......</span></div></div>",
            "created":1374469200,
            "id":1632416,
            "title":"New Student"
        },
        "11211111":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Serenity gets to \"Know you better\"",
                "Before you can do anything, the red dragon from first period barges in"
            ],
            "content":"<div class=\"\"><div> <span>.....The human genitals!\" Ms. Ladina said eagerly. A mixture of groans, moans, lustful &amp; boring sighs came from the Furry Student Body. The teacher made a slight frown, \"Oh, come now, this information will be useful for us anthros, specifically!\" She exclaimed. \"Besides, it'll help us get to understand how both common &amp; uncommon humans are to animals, like our new friend, here.\" Ms. Ladina looked back at you, causing the rest of the furries to remember that you existed.<br>\r\n<br>\r\nOnce again, the stares made you feel unwelcomed &amp; self-centered in the classroom, but you were not surprised at it. Serenity looked down at you worriedly as you pushed your glasses up on your face, cheeks red with shyness.<br>\r\n<br>\r\nShe leaned in close to you, wrapping her tail around your waist, \"Don't worry,\" She whispered in your ear softly, \"I won't let them harm you.\" Serenity licked your cheek once reassuringly, her soft snorts warming your cheek nicely.<br>\r\n<br>\r\nHalf the class gave such immature \"Oooo's\" from the scene they were watching with you two.<br>\r\n<br>\r\n\"Aw, adorable!\" A snooty looking Wolfess said, \"Sere has a crush on the new human!\" This caused laughter from the whole class, except the one red dragon.<br>\r\n<br>\r\nSerenity growled, &amp; snapped back at her \"Mind your own bussiness, Kelly!\"<br>\r\n<br>\r\nMs. Ladina tapped the front desk once again with her ruler, \"Alright, settle down, people.\" She ordered calmly, \"Do not forget why we got the privilege of having a student like Bruce. Don't give him any trouble on his first day.\"<br>\r\n<br>\r\nMs. Ladina gave a timid look to Serenity, who saw it &amp; sighed, knowing what it meant. She slowly inched away from you back to her desk, unraveling her soft scaley tail from you slowly.<br>\r\n<br>\r\nThe teacher nodded, relieved, \"Now, back to the lesson.....\"<br>\r\n<br>\r\nAnd so, the next 45 minutes of class were learning on parts of both human genitals, which you've already studied before, so you wonder why she'd start with an easy subject. Come to think of it, you noticed that she focused more on the male genitalia than female......hm<br>\r\n<br>\r\nAnyways, after all that, the bell rang for the next period.<br>\r\n<br>\r\nMs. Ladina walked around &amp; picked up everyones papers, \"No homework on the first day, so just study what we learned today.\"<br>\r\n<br>\r\nEveryone packed &amp; walked out the door, including Serenity. You waited behind, not wanting to be mixed in with the furry crowd, though you pondered at why Serenity left you. You finished packing &amp; started toward the door. As you were walking out, a scalely hand grabbed your arm &amp; pulled you to the wall. <br>\r\n<br>\r\nYou look up to see Serenity's scalely face &amp; sky blue eyes you were now getting used to. \"Whoa, I thought you were gone.\"<br>\r\n<br>\r\nShe smirked, \"Nope, just had to wait for those dicks to walk out. Come.\" She pulled you along down the hall with her quickly, \"It's a good thing you waited back instead of getting mixed in with them.\"<br>\r\n<br>\r\n\"Whop! W-well, they didn't seem very fond of me....whoa!\" You exclaimed as she pulled you fast down the hall, almost causing you to trip. After making a left turn followed by a right, you both ended up at a vacant class room with the words 'ABANDONED CLASSROOM' written on the door. Serenity used her talon to pick the lock before opening the door &amp; pulling you inside, then closing it.<br>\r\n<br>\r\nYou gathered yourself &amp; wiped your clothes off like such a nervous slob. Serenity scaned the room, \"Finally, we have some alone time....\" Before turning to you.<br>\r\n<br>\r\nYou looked at the thick, busty dragoness with soft &amp; slightly lustful eyes, \"So, why'd you bring me here?\"</span></div></div>",
            "created":1397624400,
            "id":1780227,
            "title":"A Bit More Than You Would've Bargined For"
        },
        "112111112":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "“To my house.”",
                "“To my Special lookout.”"
            ],
            "content":"<div class=\"\"><div> <span>BOOM!!!<br>\r\n<br>\r\nYou &amp; Sere turned to see the door to the classroom wide open, &amp; a red scaled dragon, standing 6 feet tall was sitting there. There was fire hidden inside his silver eyes. His muscles pulsating through his black Champion work out shirt, he huffed &amp; puffed so much that the smoke coming out of his nose/mouth almost covered the entire room.<br>\r\n<br>\r\n“So this is your way of breaking up with me? Cheating with the first new student you can get your hands on?” He growled, fists clenched.<br>\r\n<br>\r\nSere placed you behind her as she turned to the red dragon, unbothered by his anger, “I told you that I was done with you as soon as I saw you locking lips with that slutty Giselle you called your ‘Science partner’ earlier today, Grim!” Sere spat at him.<br>\r\n<br>\r\n“How many times do I have to apologize before you stop bringing that up?!” Grim slowly walked towards her, calming himself, “Sere, I love you!”<br>\r\n<br>\r\nSere shot a ball of fire at Grim from her mouth, which he easily caught &amp; extinguished with his bare hands.<br>\r\n<br>\r\n“Yeah, you love me so much that you’ve been caught cheating for the 10th time!” Sere was on the verge of tears just from saying that sentence.<br>\r\n<br>\r\nGrim stopped in his tracks, chuckling at her statement, “Let’s not act as if you’re an innocent victim here, Sere........” Grim smirked, letting steam blow in her direction. “How many times have I caught you flirting with other dudes? Telling them you’ll be ‘Single soon’? How many times have I had to be the living shit out of other dragons who claimed to have a date with you after school? From 6th to 8th grade?”<br>\r\n<br>\r\nSere was appalled at this, “That was because of your INSANE jealous, Grim! You wouldn’t even let me hang out with my friends without checking to see if a guy was in the group! You literally scared every from wanting to hang out with me!” <br>\r\n<br>\r\nYou sat there watching in awe at the soap opera that was unraveling before you. Sere has a boyfriend? No wonder that dragon gave you such an envious look in first period! He thinks you’re trying to steal his girl! ‘Maybe I can appease him if I let him know I’m not trying anything on her.’ <br>\r\n<br>\r\nYou walked from behind Sere &amp; went up to Grim until you were about 2 feet away from each other. You had a feeling something bad was about to happen. Your heart was racing, your legs were wobbling, but you’re standing up to the beast.<br>\r\n<br>\r\n“*Ahem* Listen, Grim, is it?” He did nothing but stare down at your 5’7 frame, piercing into your soul. You continued, “I didn’t know she was taken. She came towards me, &amp; I thought she was just trying to be my friend. If it makes you feel any better, I’ll stay away from her so you — ACK!!” Grim grabbed you by the throat, lifting you up towards the ceiling.<br>\r\n<br>\r\n“BRUCE!!!” Sere ran toward Grim, her fangs out with murderous intent.<br>\r\n<br>\r\nGrim then showed her his magma burning claws, inches away from your heart, “Come any closer, &amp; your boy toy’s dead.” Sere backed away, tears rolling down her sky blue eyes.<br>\r\n<br>\r\nGrim looked you in the eyes, “Bruce, am I right?” You were squirming for air, failing at trying to release yourself from his death grip, “This has nothing to do with my girl liking you. There’s just something about you humans that makes my dragon blood boil...........hmmm..........maybe it’s because you kind attacked my village &amp; killed almost all of my family &amp; friends years ago?” His grip tightened, &amp; you were turning from red........to blue........to purple........you could feel your life slipping away with every millisecond that passed.<br>\r\n<br>\r\nThat was when Grim released his grip, dropping you to the ground. You coughed &amp; gasped for air, barely able to move as your brain started functioning again. <br>\r\n<br>\r\nGrim huffed more smoke out his nose, “I’ll make this short: Obviously I can’t kill you in school without teachers getting involved, but your time is coming. I suggest you enjoy this year whilst you can.” Grim looked up towards Sere, “As for you, you want it to be over between us? We’re done. If you wanna leave me for a scrawny loser like him, then be my guest.” Grim turned around &amp; started to exit the room. “Oh, &amp; Brucey?” He turned his head to look at you from the side of his eye, “Welcome to Furry High.” He left, clawing the door’s frame.<br>\r\n<br>\r\nYou slowly gathered yourself off the ground, getting your things. Serenity approached you with open arms, “Bruce! I’m so glad you’re not hurt. I would’ve lost my mind!” You pushed her away, denying her hug.<br>\r\n<br>\r\n“Are you insane? Your boyfriend just tried to kill me! You’re literally a danger to be around at this moment in time.” You put your book-bag on &amp; started heading out the door.<br>\r\n<br>\r\nSerenity blocked your exit, making you collide with those gigantic triple D titties you oh so loved. You looked up to see the sadness in her doe eyes, “I’m sorry. I should’ve told you about him beforehand..........but you were just so cute, I wanted to get to know you some more so I could finally move on from him.” You crossed your arms, looking away from her face as to not succumb to her affections. She hugged you close, pressing your face into her tits. “Please, please forgive me. You’re the first guy I’ve talked to since being at FH. I don’t wanna lose you just on the first day!”<br>\r\n<br>\r\nYou sighed, returning the hug, “I’m know you didn’t mean any harm, but I just don’t want any problems when I just got here.” Sere smiled, whipping her tear filled face. You grabbed her hand, “Come on, I’ll walk you to second period.”<br>\r\n<br>\r\nIronically, you &amp; Sere had almost every class together. The only class that Sere didn’t have with you is Gym, your last period. There WAS a familiar face in your class though: Grim. &amp; he had 3 more dragon friends who seemed to be caught up with all the drama between you, him, &amp; Sere. One was literally going to burn you alive during the 4 mile run, but he was halted by Grim.<br>\r\n<br>\r\n“I want to wait for the right moment.......” You heard him say as they flew over you towards the dragon’s obstacle course.<br>\r\n<br>\r\nAfter gym, you gathered your things, happy you survived the first day of school. Once outside of the school’s front doors, Sere swooped down, landing right beside you, “Hi, Brucey.” She licked your cheek. “Had a good first day of school?”<br>\r\n<br>\r\nYou blushed, “Could’ve gone better if your ex wasn’t harassing me in my last period.”<br>\r\n<br>\r\nSere growled, “He’s in another class with you?” She groaned, “He’s still not over me.........but it’s fine.” She grabbed you hand, “I still have to make up for earlier today, anyways, so how about I take you out somewhere in town?”<br>\r\n<br>\r\nYou were shocked at how fast things were moving with this girl. You were never a womanizer, but you’ve had plenty of options to get with girls. You were just to shy to actually go &amp; ask them out. But Sere is literally up front &amp; bold.<br>\r\n<br>\r\nYou smiled genuinely, “Sure, Serenity. Where do you wanna go?”</span></div></div>",
            "created":1531371600,
            "id":2519259,
            "title":"Grim’s Jealousy"
        },
        "113":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Sure"
            ],
            "content":"<div class=\"\"><div> <span>Never once got in trouble, really good grades. Very quiet in most of his school year. Doesn't bother anyone. Leroy is very athletic, as he's been practicing martial arts since he was 5 years old. Although you couldn't see it in his outer exterior, he harbors a lot of hatred from his past discretions of being a parentless  kid basically his entire, having to fend for himself. Being the silent anti-hero he is, ironically he's also a gifted poet with an eloquent speech pattern. (Probably why he's had so many girlfriend's in the past) <br>\r\nHis dream is to let his poetry &amp; writing that he expresses in books will touch people around the world.<br>\r\n<br>\r\nStatistics:<br>\r\n<br>\r\nAge: 15<br>\r\nHieght: 6'1<br>\r\nWieght: 124<br>\r\nHair color: Black<br>\r\nEye color: Crimson Red<br>\r\nEthnicity: Nicaraguan American <br>\r\nHobbies: Vandalism (Minor acts throughout school), Martial Arts, Arson (He likes being near flames), Meditation (To keep himself calm), Poetry, Walks along nature, Writing<br>\r\n<br>\r\nDo you want him?</span></div></div>",
            "created":1372395600,
            "id":1619249,
            "title":"Leroy Right, a mysterious boy"
        },
        "1131":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The busty furry vixen looked over your papers, switching eye contact from you to your documents of your previous school years. You sit back in you chair, rnning your hand through you slick black hair. You wore black skinny jeans, a black tee with the symbol of a smiley face with fangs, (You loved reading Vladmir Todd. It's one of your favorite book series) and black converts with red stripes. After a while, the vixen spoke,<br>\r\n<br>\r\n\"So, this is your first time at a school full of furries, right?\" The vixen asked, her tail swaying side to side behind her. You nodded to her.<br>\r\n<br>\r\nShe continued, \"Good grades.......not a bad hieght or wieght......hmm.\" The vixen eyed you up and down, her hands folded under her humongous breasts. They looked about almost a size G, and that black collar shirt with white poka dots wern't helping to conceal it very much, it almost looked transparent. \"How old are you, Leroy?\" The vixen finally asked, breaking the akward silence between you two.<br>\r\n<br>\r\nYou looked up from her fun bags, \"Oh, 15.\" You answered. The vixen looked slightly suprised, mabye they didn'y expect a 15 year old to be going to high school? It was your first year in high school, anyway. The vixen then wrote a slip down with a room number and her signature, then she handed it to you. <br>\r\n<br>\r\n\"What's this?\" You asked her. \"It's a pass to your new class. Each teacher will give you a different slip to your next class, depending on how well you do in thiers.\" You nodded your head and took the pass. \"Well, thanks Miss.....\" You waited for her reply.<br>\r\n<br>\r\n\"Shiela. Shiela Williams.\" She grinned. \"Come to me if you need any.......help with anything, alright?\" She said. You grinned back, \"Ok, Ms.Williams. Thanks for the pass.\" You grabbed you book bag and started out the door.</span></div></div>",
            "created":1373000400,
            "id":1622959,
            "title":"Welcome!"
        },
        "11311":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "The Panther",
                "The Vixen"
            ],
            "content":"<div class=\"\"><div> <span>     You walked up the the case of stairs leading to the main building of your new school. You took a minute to take in the scenery around you. You saw a big ass statue of a dragon......girl dragon, a symbol of a wolf with rabies on the main buildings mid body section , and a lonley tree, sitting yards away from the building and other plant vegetation.<br>\r\n<br>\r\n      Sighing, you dropped your bookbag and started walking toward the tree. \"Better do this now.\" You said to yourself. \"Don't want to be marked as a trouble maker if I did this any later.\" You reached in your pocket and pulled out a viel of gasoline, opened it, and poured it all over the tree. You then pulled out you trusty Zippo lighter(you don't smoke, but you thought it might come in handy) and lighted the base of the tree before backing away.<br>\r\n<br>\r\n     The tree bursted into flames, lighting up and looking like a bright, tall flame flower that had smoke coming from the top. You slowly walked toward the now pile of tree ashes as the fire died down, and stomped the burning ashes into the cool soil.. You yawned and streched out, relieved you did the burning.<br>\r\n<br>\r\n     \"I'm so glad I got that out of my system. Now to focus on this class I'm supposed to be headed to.\" You walked back to where you had placed you book bag, grabbed it, and headed up the stair case to the doors of the main building.<br>\r\n<br>\r\nYou paused, a hand on the door. \"Okay, here we go.\" With a deep breath, you opened the door to behold your new school. <br>\r\n<br>\r\nIt was bigger inside than it was on the outside, and full of furries. Wolves, Foxes, Horses, Lions, Tigers, Panthers, Raccons, Mice, Rats, and many more. All different shapes and sizes. You even saw dragons.<br>\r\n<br>\r\nLooking over to your left, you saw a Male fox talking to a female wolf. To your right, you saw a group of mice scurrying across the floor, nearly hitting you. In front of you, you saw saw a short raccon who was giving ass worship to a tall horse, who had her hands on the walls and stuck her ass out in her jeans more.<br>\r\n<br>\r\n'Well, they sure are straight forward here.' You thought.<br>\r\n<br>\r\nYou walked by a group of wolves, dragons, and foxes that had just stopped talking when you started walking by. You gave them no eye contact, as you didn't want any trouble on the first day. You were able to hear them whispering about you, saying things like, \"Who's that kid?\" and \"He looks weird.\" <br>\r\n<br>\r\nPaying them no attention, you pulled out the white slip that administrator gave you that had your room number on it. <br>\r\n<br>\r\n\"Hmm, 217 huh?\" you murmured as you looked on each door for your room number.<br>\r\n<br>\r\n<br>\r\n<br>\r\nSuddenly, a huge, bulky wolf walks in front of you, an evil look in his eye and a smirk on his face.<br>\r\n<br>\r\n\"Going somewhere?\" He chuckled as a crowd appeared in from behind him.<br>\r\n<br>\r\nRolling your eyes, you sighed. 'Here we go again....' You thought. <br>\r\n<br>\r\nYou looked wolf right in his eyes, \"As a matter of fact, I am, and I'd appreciate it if you'd move out my way.\" You replied, putting your hands into your pocket.<br>\r\n<br>\r\nHe growled, \"I'm going to enjoy eating you, you littl-\" with swift movement, you took out three pencils and stabbed the wolf in three vital places, his neck-shoulder area, his side of his stomack near the intestines, and his knee cap.<br>\r\n<br>\r\nThe wolf howled and stumbled back in pain, trying desperately to pull out the pencils with no avail. You did a quick side step toward the side of the wolf and gave him a  round house kick, hurling him face first into the lockers. While he was winded, you pulled out you zippo and an extra pencil, and heated the metal part of it. It turned a bright red color, signifying it was hot.<br>\r\n<br>\r\nYou rushed to the wolf and dove the hot metal deep in his ear, but not enough to make him deaf. <br>\r\n<br>\r\nHe howled in pain, \"Enough! Stop! I won't bother you any more! Just stop!\" The big bad wolf wimpered an d whined as you pulled out all your now bloody pencils. <br>\r\n<br>\r\nYou grabbed his head and pulled his good ear toward you lips. \"Ever try something like that on me again, and I'll make sure they won't find your body.\" You threw his head into the lockers, making him pass out, limp on the floor.<br>\r\n<br>\r\nYou grabbed your things and walked in toward the crowed that was behind the wolf. Thier faces hasld many expressions: Fear, anger, gratitude, admire, lust? and bright smiles. Most of the smiles came from the tinier anthros, while the bigger ones were not so much.<br>\r\n<br>\r\nOne wolf wispered to his friend, \"Holy shit! Did you see what he did to Rufus?\"<br>\r\n<br>\r\nThe friend wolf nodded, \"We better warn Nanokami about him, she'd want to know about this.\"<br>\r\n<br>\r\nLATER ON.....<br>\r\n<br>\r\n<br>\r\n     You had finally found your classroom and stepped inside. All faces were turned in your direction as you walked in. They all murmured to their friends, pointing your direction.<br>\r\n<br>\r\nThe teacher, a zebra gleefully greeted you. \"Hello! You must be the new transfer student!\" <br>\r\n<br>\r\nYou nodded, handing her your white slip. She takes it and puts it inside her desks drawer before sitting down at her chair. <br>\r\n<br>\r\n\"Please tell us your name, sir.\" The teacher said.<br>\r\n<br>\r\nYou looked at the anthros and smirked. \"Leroy Right.\" you answer, nodding your head. <br>\r\n<br>\r\nThe zebra clapped her hands together. \"Well Mr.Right, please pick any seat you want.<br>\r\n<br>\r\nYou looked and saw two  empty seats. One next to a toned panther, and one next to a busty vixen.<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhich seat do you want?</span></div></div>",
            "created":1373259600,
            "id":1625106,
            "title":"Don't mess with Le! >:)"
        },
        "113111":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Yurianna was waiting for you after class",
                "You were confronted by a pack of Wolves"
            ],
            "content":"<div class=\"\"><div> <span>You looked over at the two seats that you could choose. The vixen was sitting near a bunch of wolves, and you didn't want to have to lower the percentage of wolves in this school.......at least not for now. You glanced over to the panther, who was sitting way in back. She was mixed in with a bunch of furries that I'm too lazy to name. You decided that it'd be safer to be in a mixed crowd for now. You started toward the seat next to the panther, getting different stares from all the animals that you walked by. One dragon gave you a snort and nodded to you. You looked over to a raccon who's face was beaming with happiness at you. You rolled your eyes as you finally reached your seat next to the panther. With your swift eye movement, you got a full look of the panther. She had black fur with a white furry curved line going down her arm. She also had golden eyes with shady green pupils. As you scaled down her body, you saw that her large breasts were conceald by a purple tight sports bra, and jean shorts that hid a large ass and showed off her toned legs. You also saw that her tail was waving near your side, so you scooted in your seat a bit more.<br>\r\n<br>\r\nThe Zebra clapped her hands, \"Alright class! Let's get started with our assignment on our first day of school!\" She turned around and started writing on the chalk board. As you reached in your bookbag to pull out some paper and a pencil to write with, you noticed that the Panther's tail had wrapped around your desk pole closest to her, and she quietly pulled your desk closer &amp; closer until you were only inches away from her. The panther looked down at you and smirked, licking her lips. <br>\r\n<br>\r\nYou sighed again, 'It was bad enough I had to deal with that dumb wolf, now I have to kick a panther's ass, too?' You took out your stuff, putting it on the desk. You ran a hand through your hair, trying to pay no heed to the purring panther next to you.<br>\r\n<br>\r\nAfter a few mintues of writing down notes, the Panther leaned her head close to your ear, \"You trying to avoid talking to me, human?\" She chuckled.<br>\r\n<br>\r\nYou were still writing down your notes as you answered her, \"Any reason you pulled my desk so close to you?\" You didn't even look to see the expression amusement on her face.<br>\r\n<br>\r\nThe panther giggled, \"You're cute, I liked what you did to Ralph. He was an asshole.\" You didn't respond to her as you finished writing your notes. She continued, \"What's the matter? You afraid of me? Scared I might hurt you?\" She purred softly as she put her hand on the back of your chair.<br>\r\n<br>\r\nYou looked at her with a timid look, \"I don't even know you, if anything, scared is the last thing I'd feel about you.\" You pulled out your book of Vladimir Todd, your favorite book series, and started to read to avoid more conversation with the panther.<br>\r\n<br>\r\nShe pulled your book away from you and put it in the side of her jean shorts, \"Well......\" She pulled your desk closer, careful not to make too much noise to attract attention from the teacher or other students. \"Why don't we get to know each other?\" Her purring got louder as she put her hand on your back, which made you tense. You were about to preform a maneuver to get some distance from her, but you then realised that it would be too noisy, so you just jerked your back to make her get her hand off you. She didn't take it off, \"Geez, calm down. I'm not gonna do anything to you.\" She rubs your back lightly, which calms you down a bit. The panther giggled, \"See? Now......My name is Yurianna Lushanne, but everyone just calls me Yuri Lusha, or just Yuri.\"<br>\r\n<br>\r\nYou sighed, \"I think you already know my name, Yurianna.\" You slowly looked at her. She has a warm smile on her face.<br>\r\n<br>\r\n\"Of course I do, Leroy.\" She purred. \"And just call me Yuri.\" You nodded as she moved in closer, your bodies almost touching. \"Mmmmm......I have so many things I want to ask you........\"<br>\r\n<br>\r\nThe teacher lightly taps a ruler on her desk, poiting it towards the back, \"Ms.Lusha, now now.....leave the new student alone. He's a student, not your plaything.\" This caused a snicker from everyone in the classroom.<br>\r\n<br>\r\nYurianna growled under her breath, just loud enough for every furry close by to her, causing them to shut up. She took her hands off you, pushing your desk back to it's proper place. <br>\r\n<br>\r\nThe teacher nodded, \"Good, now back to the lesson.....\"<br>\r\n<br>\r\nA while after the teacher left notes for the whole class to copy, Yuri slid a note onto your desk. You looked at the note, then at the Panther, who winked at you slowly smirking. You looked back at the note &amp; opened it to read it's contents. It read:<br>\r\n<b>Don't think I'm done with you, Leroy. I want to get to know you better......so meet me after class, okay? <br>\r\n- Yuri <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/suitheart.png\" alt=\"*SuitHeart*\" title=\"SuitHeart\" border=\"0\" width=\"15\" height=\"15\"></b><br>\r\nYou noticed a kiss mark at the corner of the note, &amp; wondered, 'How'd she do that with no lip stick?'<br>\r\n<br>\r\n<br>\r\n<br>\r\nSure enough, after class........</span></div></div>",
            "created":1378443600,
            "id":1658742,
            "title":"Yurianna, the Panther"
        },
        "1131112":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Refuse, & escape",
                "The principal (Who also happens to be her father) Joins in on the fun......."
            ],
            "content":"<div class=\"\"><div> <span>Just as you started to head out of the exit, you were pulled by your neck into a chocking grapple by a fur covered arm. You struggled to free yourself from your opponent, but their muscular grip was too powerful. Suddenly you heard a low growl as you were pressed closer to the kidnapper's body, \"Better get you to this lady before I end up mauling you......\" The started heading down the hall away from the direction of the other class rooms. <br>\r\n<br>\r\nYou were being carried so fast down the halls that you couldn't even register where you were at that moment in time. You DID know that you were getting carried lower &amp; lower, almost to the schools basement. 'This school is huge.' You thought to yourself. The wolf started to slow his pace when he reached the steps, as to not misstep.<br>\r\n<br>\r\nWith a slight glance, you noticed that your kidnapper was actually another Wolf! \"Gah!! Not.....now!!!\" In one swift move, you lurched your lower body up, wrapping your legs around his neck before flipping him on to the ground. This cause both of you to tumble down a flight of stairs; You used his bulky exterior to block the stairs before landing on top of him at the bottom floor. <br>\r\n<br>\r\nYou got up from the kidnapping Wolf &amp; got a better glance at him. He had dark grey fur with a fair amount of fuzz on his chest &amp; stomach. He also seemed to be wearing only camouflage pants &amp; combat boots. You noticed that he had scraps &amp; bruises all over him from the fall, plus his right arm &amp; left leg were bent in the wrong direction.<br>\r\n<br>\r\n\"The hell is wrong with you wolves? I try to have a decent first day &amp; you think you can try &amp; turn me into a damsel in distress!!\" You walked over to the battered wolf, picking up your items that laid on top of him. As you turned, another wolf that suddenly appeared tried to left hook you, you ducked &amp; did a standing split kick that connected with his chin, sending him flying upwards.<br>\r\n<br>\r\nMore &amp; more wolves started to appear, all with looks of hunger &amp; pure rage. One even barked at you wildly. You sighed, \"I'm not going to win.....\" You assumed your fighting stance, \"But you're not going to be left alive once I'm finished!\" The wolves started running toward your direction, ready to maul you alive.<br>\r\n<br>\r\n\"THAT'S ENOUGH!!!\"<br>\r\n<br>\r\nThe wolves stopped, just short of attacking you, when a female wolf appeared at the top of the stairs. The Wolfess had a calm statue &amp; a slight grin on her wolffish mug. She slowly walked down the stairs. As she got closer, you realized that she was taller than all the other wolves, standing at 6'7. She had a very muscular toned structure with an 8 pack of abs. Her hazel eyes were almost mesmerizing. Her fur was a light beige on white. She wore a crop top white tee that barely covered her extremely large F cups, &amp; had on grey sweat pants that hugged her toned legs oh so closely. She stopped right in front of you, towering you like a skyscraper. You were still ready to kill at moments notice.<br>\r\n<br>\r\nThe female wolf looked up, \"Didn't I tell you not to hurt him?!?!\" The female wolf growled at her idiotic pack of wolves. They whimpered in response. She then bent down to your level till she was eye to eye with you, sizing you up &amp; down. <br>\r\n<br>\r\n\"You know, for a little munchkin, you're actually pretty cute.\" She brushed her hand across your face, causing you to instinctively grab it &amp; flip her over. To your surprise, she landed on her feet, low sweeping you to the ground before pinning your arms &amp; legs down. The wolves behind her started coming closer, growling, until she barked, \"BACK!!! YOU'VE ALREADY MESSED IT UP!!!\" Causing them to back towards the walls of the 'Highschool Basement'. (Or so you thought)<br>\r\n<br>\r\nYou struggled with all your might to escape from her grasp, but she was just too strong for your to break free. She suddenly licked your face, cleaning up your wounds that you received from your stair flight. \"Relax. I'm not going to hurt you.\"<br>\r\n<br>\r\nYou almost laughed, \"If you seriously think I'll believe that after what the Brady Bunch over there did to me, you must be dumber than they are.\" She chuckled at your comeback.<br>\r\n<br>\r\n\"I'm not asking you to believe me, I'm only asking that you'll listen. I know after the fiasco Dylan just did to get you down here was pretty rough, but we couldn't just ask, now could we?\" She slowly started to release you, standing up with her hand out to help you up. \"My name is Natalia, but my pack calls me Nanokami. You can just call me Nat.\" <br>\r\n<br>\r\nYou stood up on your own.<br>\r\n\"I'm just here to give you an offer. An offer that will protect you from getting mauled by my pack, &amp; one that will make sure no horny gals come for you anymore.\"<br>\r\n<br>\r\n\"What exactly do you want from me?\" You looked, observing your surroundings to look for a way to escape. <br>\r\n<br>\r\n\"First, you need to know that this offer is optional, &amp; that if you agree, I'll follow the conditions to graduation. But if you disagree, don't be surprised when they start attacking you everyday.\" This only put you more on edge to kill every single wolf in the room. <br>\r\n<br>\r\n\"Why are they even bothering me in the first place? I've done nothing to you all. You started bothering ME.\" <br>\r\n<br>\r\nNat smiled, \"Why? There's really no other reason to why we do things other than to be at the top of the school. There's alpha's for a reason.\"<br>\r\n<br>\r\nYou crossed your arms, unamused, \"All I see is a spoiled tyrant surrounded by a bunch of Beta's.\" All the wolves started to growl, coming closer &amp; closer towards you. Nat didn't stop them this time, only stayed in from as to keep them behind her. She lifted a hand for them to stop once they were encircling the both of them.<br>\r\n<br>\r\n\"I like your venom. If I didn't know any better, I'd assume you were a snake in human form.\" She stared at you intensely, \"Such lovely red eyes......\" You took a step back, still in a more calming stance ready to strike.<br>\r\n<br>\r\n\"My offer is this: Join my pack, help them with studies &amp; the \"Anthro Valor Battles\". You do that, &amp; I'll make sure you won't get messed with, ever again.......plus.......\" She leaned in &amp; caressed your cheek, \"You get to go out with the sexiest Wolfess in the school....\" Her tail wagged intensely.<br>\r\n<br>\r\nYou were actually waiting for someone with a camera to come out &amp; tell you that you've been punked. But this was FAR from fake......she was dead serious about this.......<br>\r\n<br>\r\n\"Well? What do you say, shorty?\"</span></div></div>",
            "created":1492578000,
            "id":2307628,
            "title":"Nanokami's Offer"
        },
        "11311122":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "You wake up in the nurses office",
                "You wake up in a bedroom with a familiar Panther laying beside you"
            ],
            "content":"<div class=\"\"><div> <span>The wolf gang eagerly awaited your answer, drool dripping from their mouths as their tongue hung out in pure hunger. It seemed that \"No\" wasn't an option that this Wolfess was giving you. You stood firm, looking around for any form of an exit, but all you were surrounded by was brick walls &amp; a stair case that was blocked by 3 wolves. <br>\r\n<br>\r\n\"This is insane......I come for education, &amp; I get threatened by a power hungry gang of beasts......\" You said to yourself, unfortunately out loud.<br>\r\n<br>\r\nOne wolf slashed you in your chest for your statement, \"How DARE you insult Nanokami!!! You swine!!\" It was his last words before Natalia grabbed his neck, &amp; punching him in the center of his lower back, paralyzing him from the neck down. The wolf howled in agonizing pain.<br>\r\n<br>\r\n\"How many times do I have to tell you idiots......\" With a firm grip, she flung the helpless beta wolf towards the brick wall, which almost caved in from the wolf's collision, \"NOT, TO, HURT, HIM?!?!\" This cause the rest of the wolves to back off away from you too, some going to cater to the battered wolf.<br>\r\n<br>\r\nYou clutched your stomach, covering the fresh wound that the wolf gave you. Blood dripped to the floor in a steady flow as you began to lose your strength. Natalia started coming closer to you with a worried look on her face. You weakly waved her away, \"NO!! Get away! You've done enough!\"<br>\r\n<br>\r\nNatalia gave you a stern look, only approaching closer, \"You're hurt. Let me help you.\"<br>\r\n<br>\r\nNatalia was within arms reach, about to remove your hand to take a look at your wound, right before you grabbed her arm, tripping her in a swift motion, &amp; tossing her to a corner. You knew she'd recover quickly from this &amp; started towards the stairs with all the strength you had.<br>\r\n<br>\r\nNatalia landed from the throw, a wild smirk on her face, \"I guess I'll take that as a no to the offer then, Leroy?\" She stood tall &amp; started walking in your direction. \"I can change that.......\"<br>\r\n<br>\r\nThe three wolves guarding the stairs growled as you came closer. 'Shit!' You thought, 'Gotta think....' As you closed in on the wolves, you noticed that although they were huge &amp; bulky, they were also extremely slow. (&amp; possibly dumb....) <br>\r\n<br>\r\nStill clutching your wound, you pretended that you were going to jump over them, doing a slight hop. The wolves jumped up high, expecting to chomp you with their razor sharp teeth, but only grabbed air. Before they landed, you slid underneath the wolves &amp; strode up the stairs, taking 3 at a time. The three wolves were about to give chase, when Natalia yipped to keep them at bay.<br>\r\n<br>\r\nNatalia laughed, \"You won't get far, shorty!!\" She then started to run up the wall towards the stairs. <br>\r\n<br>\r\nYou paid no head, &amp; just keep striding, almost to the door leading back to the main building. Once you reached the last 4 steps to the main door, Nat landed in front of it, causing you to careen into her arms. You struggled from her grasp, gasping in pain once you realized you were still injured. She hugged you close to her chest, bringing your face closer. <br>\r\n<br>\r\nYou caught her eyes once you stopped struggling, seeing the passion &amp; enticement within them........she started to lean her face in closer. <br>\r\n<br>\r\nBut you couldn't just let yourself be her slave, \"No.....No....!\" You struggled to escape her mesmerizing gaze. She rubbed the back of your head, bringing it closer to hers.<br>\r\n<br>\r\n\"Shh.....just give into me......\" Natalia leaned in to give you a kiss.......<br>\r\n<br>\r\nWhen a tall figure grabbed her shoulder.<br>\r\n<br>\r\n\"That's quite enough, Natalia.\"<br>\r\n<br>\r\nYou looked up to see another tall wolf, even taller than Natalia. He even had the same beige on white fur color as she did. Instead of hazel, his eyes were bright blue.<br>\r\n<br>\r\n\"Put Leroy down. Now.\" He glared at Nat with full intent to take her down if she refused.<br>\r\n<br>\r\nNatalia whimpered, \"Daddy........you're embarrassing me.....\"<br>\r\n<br>\r\nDaddy? Who was this guy? You contemplated this as you started to lose consciousness, \"Not.......another.......wolf.....\" Natalia placed you on the ground, &amp; her supposed father kneeled down to you, pressing a towel to your wound. You could barely just make out another figure standing behind him.<br>\r\n<br>\r\nHe sighed with disappointment, \"I'll have to take him to the nurse so she can........blood......system.........grounded.\"<br>\r\n<br>\r\nThe words faded away as you started to pass out.<br>\r\n<br>\r\n\"Don't worry Le........I'll make sure you're never in danger again.\"<br>\r\n<br>\r\n\"Who is that.....? Yuri......?\"</span></div></div>",
            "created":1492664400,
            "id":2307785,
            "title":"Savior's of The Day"
        },
        "113111222":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Leroy describes his past",
                "A nurse snake, Mr. Simmons, accompanied by Nanokami, enters the room"
            ],
            "content":"<div class=\"\"><div> <span>\"Such a shame..........to think that you could ever be anything other than a speck of dirt in the ground........worthless.........how you've made it this far in your short life boggles me to this day,\"<br>\r\n<br>\r\nThe voice rang heavily in your ears as you struggled against your bindings. You were strapped to a table, almost completely naked, barring your underwear. A blindfold shielded your vision, so you had to rely on your other 4 senses. The room you were in was humid, with a slight hint of ether &amp; gasoline. The table you were lying on felt as cold as ice. Ironic how such a hot room couldn't even effect the steel metal of a table with even the slightest degree of heat.<br>\r\n<br>\r\nYour face &amp; mouth were still so sore from the beatings given earlier by the vicious person who spoke with such a demonic tone.<br>\r\n<br>\r\n<b>WHAPA!!!</b><br>\r\n<br>\r\n\"DAAAAAAHHGGGGG!!!\" You writhed in agony as his leather whip struck you. Frantically struggling against your bounds, you gurggled through your swolen mouth one word: \"WHY???!!!!!!\"<br>\r\n<br>\r\nThe mysterious voice answered: \"Why? Because...........you were born, my dear son..........you took your mother away with your birth, my love.............my soul............&amp; she's inside you..........her essence. &amp; I--<br>\r\n<br>\r\n<b>WHAPHA!</b><br>\r\n<br>\r\n\"WANT!\"<br>\r\n<br>\r\n<b>WHAPA!</b><br>\r\n<br>\r\n\"HER!!!!\"<br>\r\n<br>\r\n<b>WHAPA!</b><br>\r\n<br>\r\n\"BACK!!!\"<br>\r\n<br>\r\n<b>WHAPA! WHAPA! WHAPA!</b><br>\r\n<br>\r\nYou hollered like a wild animal as the man whipped you, each hit stronger &amp; more painful than the last. \"I didn't do it.......I didn't do it..........I didn't do it!\" Your yelling finally got through, as the demonic man stopped, leaning close to your ear.<br>\r\n<br>\r\n\"Ah........see that's just the thing, Leroy.........You DID do it.........you killed her!\" he growled<br>\r\n<br>\r\nThat sent you over the edge, through your broken jaw, you yelled, \"NOOOOOOOOOOOOOO!\"<br>\r\n<br>\r\nThe demonic voice laughed, the evil echoing all across the entire room, \"THAT'S IT, BOY!!! SCREAM!! SCREAM FOR YOUR SOON TO BE ENDED LIFE!!!! LEROYYYYYYYYYYYY!!!!!\"<br>\r\n<br>\r\n\"Leroy!!! Wake up!!!\" A concerned voice yelled, but softer........&amp; familiar.<br>\r\n<br>\r\nYou rose from your hospital bed in a fright, your heart racing as you felt your body for any signs of harm. That's when you grazed your chest wounds. \"Ouch! Damn it...........\" That's when you noticed Yuri sitting next to you; a heartbeat monitor was beeping at an insanely fast rate, slowing down per minute as you realized that you were in the school's nursing room.<br>\r\n<br>\r\nYuri laid you back down on the bed, \"Relax..........You're safe now.\"<br>\r\n<br>\r\nYou almost laughed at the asinine words escaping her mouth, \"Safe? I literally almost got mauled by a pack of ferocious wolves while their leader was trying to rape me!\" You angrily tried to take out your IV. \"I knew coming to this school was a bad idea.\"<br>\r\n<br>\r\n\"Leroy, stop it!\" Yuri pressed her paw into your wounds, making you wince &amp; lay back down in your bed shaped prison. \"Sorry.........I know you're upset, but you need to rest your body before you open your injuries back up.\" Yuri was dressed in a nursing gown &amp; oragami sail boat shaped hat with the hospital plus logo on it. You noticed the logo was made of 2 red snakes. <br>\r\n<br>\r\nYou sighed, accepting your defeat. \"Alright............I didn't know you were a nurse.\"<br>\r\n<br>\r\nYuri chuckled, \"There's alot of things you don't know about me, Leroy.\" She grabbed a thernometer from her operating table, \"Say 'Ahh'. I need to check to see if you're getting a fever or not.\" You did as you were told, letting the meter raise to check your tempature level. \"Hmm..........97.9. You're pretty stable.\" She put away all her tools &amp; gadgets. \"Now..........tell me what's on your mind. How did you end up in this mess with the wolves?\" She eagerly awaited your answer.<br>\r\n<br>\r\n\"Oh, where should I even start?\" You tapped your chin, the sarcasm ringing loud &amp; clear. \"Oh right! I got wolf-handled by a bunch of simps working for a sadistic female wolf, who-- get this -- also happens to be the daughter of the principal!\"<br>\r\n<br>\r\nYuri gasped, \"Natalia did this?\"<br>\r\n<br>\r\n\"Yes, it was all a plot to get me to be her boyfriend. She sure has a cowardly way of doing things.\" You shook your head in pity.<br>\r\n<br>\r\nYuri sighed, swaying her tail in thought, \"Not this again.........\"<br>\r\n<br>\r\nYour crimson red eyes widened, \"Again? You're telling me this is a recurring series of events?\"<br>\r\n<br>\r\nYuri's ears lowered, \"In a way..........you see, Nat has been spoiled basically since she was born. Mr. Simmons, her dad &amp; the principal, lost many of his children before they were born, so when Nat came in the picture, he cherised her to the fullest. He gave her everything in his power: All the toys she wanted, the best books, put her in the best clubs &amp; sports, let her do pretty much anything that wasn't illegal, &amp; accepted each &amp; every boy she wanted to go out with.\" Yuri scoffed in disgust, thinking of all her past times with Nanokami.<br>\r\n<br>\r\nShe continued, \"Every time she wanted a guy she thought was remotely cute, she would either send her wolf pack, which was made up of all boys who wanted her so badly, to go &amp; get him.\" You scowled as she told this horrific tale, \"She would always give the boys an ultimatum: Go out with me, or I have my pack bully you for the rest of the school year. Every boy that refused was beat up, mauled, or abused to the point where they had to transfer schools. Every boy that agreed..........Well, she showed him off like a trophy, got insanely jealous if he even talked to a female teacher, &amp; got super possessive of him. There was this one squirrel she was dating, she was so into him that she wouldn't even let him go home to his parents. He would either be with her at her house or at the many hotels she'd often go to when she didn't want to be home.\"<br>\r\n<br>\r\nYou crossed your arms, making sure not to touch your wounds, \"So what happened to them once they decided to break up with her?\"<br>\r\n<br>\r\nYuri's eyes lowered, \"That's what I'm wondering.........every time I asked her, she would always tell me 'He couldn't handle me' or 'I moved on'. But we never saw those boys after she said that. They never came to school, but they weren't reported as missing by the parents, either. The parents would say they went to go live with close relatives or they transferred to a private school.\"<br>\r\n<br>\r\n'Something is very wrong here.......' You thought, worried you might end up as the next missing ex. You looked up to Yuri, her black fur glistening in the room's lights, \"You seem to know alot about her, are you guys friends?\"<br>\r\n<br>\r\n\"We used to be.\" Yuri answered, the sour tone making it seem as if she regreted that decision, \"She did something that I couldn't forgive..............now, I keep mostly to myself. I have a small circle that I protect with my life.\" She looked at you sincirely, \"And I'm hoping to add one more.\"<br>\r\n<br>\r\nYou took a deep breath, soaking in all this information. This schools was a lot more interesting than you thought it would be. \"Why do you want to protect me so badly, though?\"<br>\r\n<br>\r\nYuri blushed, though you couldn't see it through her fur, \"Well..........you seem like a cool guy, once you get past all of that \"Bad boy\" defenses you seem to have. Plus............you're super cute. I love your red eyes.\" She purred seductively.<br>\r\n<br>\r\nYou smirked at her flattery. \"I must admit, I do owe you for taking good care of the damages I recieved, so I guess a friendship wouldn't hurt. I'll need the protection now that I'm injured.\" This time, you had a genuine smile aimed in her direction.<br>\r\n<br>\r\n\"Yay! I knew you'd come around!\" She jumped up &amp; down, clapping in excitement. She immediately ceased &amp; got serious, \"One more question..........\"<br>\r\n<br>\r\n\"Yeah?\" You took a sip of water from the cup sitting beside you.<br>\r\n<br>\r\n\"When you were out, you keep saying 'I didn't do it' &amp; 'Stop, no more.'.........\" You looked at Yuri defensively; she contined. \"You also struggled alot to the point we had to strap you down just to put the bandages on you...........is there something bad happened that to you? I've seen the scars..............It looks like you've been through alot.............\" Yuri wrapped her tail around her waist, staring into the ground, waiting for your answer.<br>\r\n<br>\r\nYou looked off into the distance, \"I have................It's painful to remember, but it haunts me still to this day...........\"</span></div></div>",
            "created":1531371600,
            "id":2519163,
            "title":"Scars exposed, Bonds created."
        },
        "1131112221":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Yuri describes her past",
                "The Snake doctor arrives",
                "Natalia’s been listening the whole time (Nanokami walks in)"
            ],
            "content":"<div class=\"\"><div> <span>Yuri leaned in close as Leroy stared off into the distance, mesmerized by his masculine form.<br>\r\n<br>\r\nHe took a deep breath, closing his eyes, then looked Yuri in her eyes, “If you tell ANYONE about this, I will be your worst nightmare.” The anger within his eyes almost burned Yuri’s retinas with how hard he stared at her, waiting for her answer.<br>\r\n<br>\r\nHer ears lowered, looking towards the ground, “You still don’t trust me........? That hurts, Leroy........” She looked at him, calmly stating, “If you tell me your past, I will tell you mine. If not, I’ll just treat your wounds &amp; leave you alone for a bit. Deal?” Yuri smiled, hopeful her bargain would help the young boy open up.<br>\r\n<br>\r\nLeroy’s face softened, he nodded, “Deal.”<br>\r\n<br>\r\n“Good. Now.......” Yuri lifted her ears up, “I’m all ears.” <br>\r\n<br>\r\nLeroy chuckled, “Alright...........man..........it was in Miami, Florida.........where I was born.........”<br>\r\n<br>\r\n“My mother was a beautiful psychiatrist &amp; therapist, working with people to help identify issues within their subconscious mind so they can change themselves from within.” <br>\r\n<br>\r\nYuri’s eyes got huge, glistening as she listened to his story.<br>\r\n<br>\r\nHe continued, “She was pale skinned, with red eyes &amp; jet black hair like me. Her goal in life was to help others help themselves by helping them find their purpose in life. Ivory Wright, her name was............I miss her to this day.........” Leroy sorrowfully looked deeply into his bandaged hands.<br>\r\n<br>\r\n“.......what happened to her......?” Yuri asked hesitantly.<br>\r\n<br>\r\n“............Before I was born, she had, according to her coworkers, the most egregious patient walk into her office to talk about his problems.” Leroy’s heartbeat started to increase, the heart monitor beeping 10 times faster than before, “That patient was my dad.” A single tear rolled down his face, the anger within turning his face almost as red as his eyes.<br>\r\n<br>\r\nYuri could almost physically feel his pain. She placed her hand on his arm, softly. “Keep going. I’m here.” She assured him, her eyes just as watery.<br>\r\n<br>\r\n“My father, Logan Terror..............he was born an orphan, abandoned by his parents from birth. He was place in broken home after broken home by the time he could walk.........each family brought him back to the orphanage, saying “He’s too destructive. Too out of control.”............he couldn’t even make friends with how violent &amp; destructive he was........always breaking things, arguing with the owners &amp; workers, running away for nights on end. He just couldn’t couldn’t get his act right, no matter how hard he tried...........” Leroy paused, wiping his face with the blanket that covered him.<br>\r\n<br>\r\n“That was when he met my Nana, the sweetest lady ever to exist on this Earth: Miss Kimberly Oliver. She took him in, believing there was some trace of good inside of him. There was something all those other home couldn’t give him: Love &amp; affection. All the other foster parents used him in horrific ways: A punching bag whenever the father came home drunk, a means to verbally destroy his emotions from the mother felt hurt by his actions, I believe all those bad homes, combined with the fact that his parents never even wanted him in the first place, drove him mad.”<br>\r\n<br>\r\nYuri was fixated on Leroy as he delved deeper into the depths of his haunting past.<br>\r\n<br>\r\n“My Nana, about her mid 60’s by the time I was born, was the best mother figure you could ask for. She read me bed time stories, taught me about life, basic communication skills, right from wrong, to stand up for what I believe in, &amp; to never be afraid to protect yourself or the people you cherish the most.”<br>\r\nFor perhaps the first time ever, Leroy genuinely smile when thinking about that old, Nicaraguan lady who took in a scumbag like his father.<br>\r\n<br>\r\n“My father, though given love &amp; affection, couldn’t let go of his demons, however. He was in &amp; out of jail. He even went to a few insane asylums for months, only managing to escape by pretending to be “cured” or a “changed man”.” Leroy scoffed, almost spitting at the lies he knew were said to him.<br>\r\n<br>\r\n“He would hurt everything he touched until he came around Nana. It was then that he could do no harm to her. He would smile, ask her about her day, even cook for her. He said he could never hurt such a sweet person.”<br>\r\n<br>\r\nLeroy’s eyes lowered, “It was one unfaithful day, around the time I was almost 13 years old, my dad married that psychiatrist, building his family &amp; his life together, that both my Nana &amp; my my mother seemed to have caught an illness almost instantaneously.”<br>\r\n<br>\r\nYuri gasped, covering her mouth with her paws.<br>\r\n<br>\r\n“For Nana, it was mainly old age. It was almost her time to go. She told me to never stop being just who I am. &amp; that I’m never alone in this world. There will always be someone who cares for you in this world.................” Leroy sniffled, a single year falling from his face, “I held her hand as she pasted away.”<br>\r\n<br>\r\n“As for my mother, the stress of dealing with mental patients started to take a toll on her body. She was very mindful of her health, but her goals to try &amp; save each &amp; every patient almost destroyed her.” Leroy recalled the stories: “There were patients who told her that life was meaningless, patients who hurt themselves right in front of her, patients who seemed to have been making tremendous progress, but were found dead months later.”<br>\r\n<br>\r\nThe tears on Leroy’s face started to fall like rain, “...........she died from a heart attack.........I swear, it was if she could feel every beat, the way she clutched her chest.” He gripped his hand over his heart, almost feeling it directly, “I was almost 12 years old, holding my mother in my arms as she pasted from me so abruptly. I didn’t know what was happening, but I knew I had to do something. I still can remember her looking directly into my eyes as the life instantly left her body..........I was devastated.”<br>\r\n<br>\r\nYuri started crying softly, “Oh my god.........this is what you’ve been holding onto for so long?”<br>\r\n<br>\r\nLeroy shook his head, “It gets worse.”<br>\r\n<br>\r\nYuri looked at him, awaiting the end of this tale.<br>\r\n<br>\r\n“My father understood Nana dying. He wasn’t as sad. He just couldn’t bear to witness it firsthand. So, he visited her grave every day after the funeral. I remember waiting in the car after he picked me up from school, seeing him drop to his knees &amp; sob to the heavens.......If they even existed at that point.” Leroy was hesitant about the upcoming part, barely able to form the words coming, “But.........when he saw my mom dead on the floor with my arms wrapped around her, somewhere in his warped mind, he thought that I killed her.”<br>\r\n<br>\r\n“Everyday afterwards, he would beat me in every way imaginable: Fists, belts, shoes, whips, sticks, chains, he even came after me with a knife.” <br>\r\n<br>\r\nYuri was practically bawling softly at this point, her face buried in his hands as he confessed his problems to this new panther girl he just met.<br>\r\n<br>\r\n“All the time, asking me “why did I take her from him?” &amp; every time, I told him I didn’t do it. But he couldn’t accept that answer. He wanted me to somehow bring her back to life, or find a way to end mine.............a few months down the line, neighbors found me bruised &amp; beaten on the floor in our run down house, my dad upstairs in bed holding my mother’s dead carcass in his arms. They called child services for me &amp; took my dad in for child abuse &amp; what they “thought” was first degree murder.”<br>\r\n<br>\r\n“The services deemed it too dangerous for me to stay in my hometown, so I was homeschooled, jumping from home to home, never really having a family again..........then I ended up here thanks to a Grizzly bear, Rufus. He took me in as his own, enrolling me in this school, telling me it’d change my life for the better...........so, that’s everything.”<br>\r\n<br>\r\nLeroy laid back down, closing his eyes, focusing on the air circling around him as to not think about the painful things he went through. He felt a warm wet material sliding across his face. His eyes opened to Yuri licking him, tears rolling down her golden, dilated eyes. <br>\r\n<br>\r\n“Thank you. Now it’s my turn.”</span></div></div>",
            "created":1552366800,
            "id":2629636,
            "title":"Pain"
        },
        "11311122213":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Meet Rufus (Leroy’s family)",
                "Yuri takes Leroy to her house",
                "The next day (Anthro Valor Battles)"
            ],
            "content":"<div class=\"\"><div> <span>“Awww, such a sad tale.” A familiar voice said out of view. “Who would’ve thought that under such a seemingly impenetrable exterior, lied a soft, vulnerable boy who’s been hurt by the entire world? It almost makes me wanna cry.............almost.”<br>\r\n<br>\r\nLeroy’s blood started to boil as he recognized the voice, his heart monitor literally beating to untraceable beats per minute. <br>\r\n<br>\r\nYuri’s eyes widened, “Leroy, calm down! You’re too weak to stress your heart like this!” She held his forearm, physically pleading him.<br>\r\n<br>\r\nNatalia slowly entered the room, her crystal blue eyes filled with a trace of guilt as she looked over at Leroy in his most weakened state. She started to approach the Panther &amp; young man with no caution.<br>\r\n<br>\r\nLeroy started rising from his bed, lifting the covers, nothing but pure rage as red as his crimson eyes coursing through his veins, “I’m gonna kill you, you sadistic bitch.” He started to remove his I.V. from his wrist.<br>\r\n<br>\r\nYuri gasped, “LEROY!!! STOP!!” She pressed his bandaged chest, causing him to wince &amp; cease his resistance.<br>\r\n<br>\r\nNatalia did nothing but smirked. Filled with amusement at such a compassionate human. “You amaze me, shorty.........still fueled with the fire of a thousand suns, even when you’re completely outmatched.........” She sighed, grabbing the nearest chair, “I guess I went a bit too far with our little play date, huh?!” <br>\r\n<br>\r\n“Natalia, is this a fucking joke?!?! Look at what you did to him!!!” Yuri pointed to your many scrapes &amp; bruises. “Your pack could’ve killed him!!! Do you have ANY idea what your actions do to people?” <br>\r\n<br>\r\nNatalia yawned, stretching herself out, “All he had to do was accept my offer, &amp; none of that would’ve happened.” She relaxed in her chair, “I gotta say, shorty, you’re a lot different than all of the boys I’ve sunk my teeth into.........” Nat moaned slightly, gliding her hands down her sculpted yet curved thighs, “I wonder if you’re packing as much fire in those trousers as your heart has...........?”<br>\r\n<br>\r\nYuri stood up, the vein on her forehead as bright as day, “Leave. Now.”<br>\r\n<br>\r\nNatalia chuckled, “Or what, Yurianna? You’ll “rip my heart out?” Again?” Natalia rose from her chair, “Or maybe, you’ll tell my daddy?” She school in fear sarcastically before bursting out in laughter.<br>\r\n<br>\r\n“She doesn’t need to. You’re already in trouble, young lady.” Suddenly, another wolf, 3 inches taller than Natalia, (making him the tallest wolf in the school) entered the room.<br>\r\n<br>\r\nNatalia turned around, lowering her tail as she faced her doom, “D-daddy!! I was just looking for you! It looks like the new kid is making great recov-“<br>\r\n<br>\r\n“Didn’t I tell you to stay away from Mr. Right?” His voice rang with pure authority.<br>\r\n<br>\r\nNatalia whimpered, “But daddy.........I.......I like him..........”<br>\r\n<br>\r\n“I don’t give a damn, young lady. You will NOT give this school a bad name with anymore of your shenanigans.” He growled, “Now, out. I will deal with you later.”<br>\r\n<br>\r\nNatalia’s ears lowered in defeat, slowly walking out of the door..........but not before catching eyes with Leroy, blowing a kiss &amp; winking as she exited.<br>\r\n<br>\r\nLeroy shook his head in disgust. He turned his attention to the male wolf.<br>\r\n<br>\r\nHe was literally a tree. 7’0 feet tall. His fur color was a darker beige than Natalia’s, with a white inner pattern. He donned an all black 3 piece business suit, a solid red tie, white collar shirt, &amp; brown loafers.<br>\r\n<br>\r\nLeroy crosses his arms, “I’m assuming this is princess’ father?”<br>\r\n<br>\r\nHe nodded in agreement, “Mr. Nathaniel Nanokami. But please, call me Mr. Nate.” He held his hand out.<br>\r\n<br>\r\nLeroy only stared at him unamused, “Your daughter &amp; her betas tried to kill me.”<br>\r\n<br>\r\nHe sighed, pulling a chair up next to him, “She’s quite a handful, no? I have to say, I feel like I failed as a parent at times with how she acts...........” Mr. Nate shook his head in disappointment, “Please, accept my most sincerest apologies. You’re one of the first human students to ever come to my school. Though you had a rough end to your first day, I hope you didn’t have any intentions of switching schools or making any reports. My biggest concern is the safety of my students.”<br>\r\n<br>\r\nLeroy scoffed, “Could’ve fooled me. I’m not your daughter’s first victim, nor will I be her last. She’s a monster. Possibly a murderer. What happened to that one animal student who never came back to school after he broke up with her?”<br>\r\n<br>\r\nMr. Nate looked off into the distance, “I was able to save him before it was too late.........he was moved to another school, despite the rumors.”<br>\r\n<br>\r\nYuri sighed in relief, “Oliver.......he’s still alive.........”<br>\r\n<br>\r\nMr. Nate looked back at Leroy, “Listen........take this.” He handed Leroy whistle. Leroy looked at him confused. “It’s a whistle I made specifically for Natalia..........when she got too out of hand as a child, I used this as a form of punishment, which made her submissive &amp; calm. Though.........it’s painful to her when used too long.........”<br>\r\n<br>\r\nLeroy frowned, “As much as she deserves hearing this whistle till she dies, I’m not heartless.” He handed it back to Mr. Nate, “I won’t deliberately hurt your daughter.”<br>\r\n<br>\r\nMr. Nate smiled, “I appreciate that........but........” He handed the whistle to Yuri, who willingly accepted it, “My main concern is your safety. You’re a special student, &amp; I want to ensure your graduate from this school.”<br>\r\n<br>\r\nMr. Nate stood up, “It was nice meeting you, Mr. Right. I can tell you’re a man of action.” He started to exit the nursing room, stoping right at the exit. “Please do look into extra curricular activities. The “Anthro Valor Battles” seems like it’s right up your alley.” Mr. Nate then exited the room.<br>\r\n<br>\r\nLeroy fell back on his bed, sighing in relief. ‘What the hell did I get myself into, Rufus.............?’<br>\r\n<br>\r\nYuri continued to treat his wounds.</span></div></div>",
            "created":1566104400,
            "id":2704295,
            "title":"Such a nosey wolf "
        },
        "113112":{
            "author_id":"joey234",
            "author_name":"Jjoe234",
            "choices":[
                "Agree (get the wolves off your back)",
                "Disagree ( lone wolf it) "
            ],
            "content":"<div class=\"\"><div> <span>You looked at the two seats remaining in class. The panther was located near the back within a mixed group of furries, who seems to be giving you lustful looks. Not wanting to deal with that you decide to sit near the vixen instead. Even though the vixen was sitting next to a group of wolves. You hoped that the impression you made earlier would keep them in check, also being near the front of the class would mean that the teacher wasn't too far away. You started your way towards the vixen, getting distasteful glares from the wolves. When you finally reach your seat near the vixan ,low growls can be heard. Quickly looking at the vixen you notice her large bust reminding you of Shiela, the vixen you met earlier. She had emeral green eyes that seem to perfectly reflect her orange on white fur. Her large bust was being held in place by a black and tight fitting push up bra. While her torn tight jeans showed off her long legs. You also noticed her tail seemed to be slowly swaying once you sit down.<br>\r\n<br>\r\n\"I'm Vivian by the way.\" The vixen whispered into your ear as she leaned onto you desk. \"You must be either really brave or really stupid to stand up to Ralph like that.\" As you look up at Vivian you simply reply. \"No I was just really annoyed, just like how your annoying me.\"<br>\r\n<br>\r\n\"Ohh what a feisty little human you are.\" She grins as she moves more of her bust onto your desk. \"My mother Shiela told me a lot about you.\" <br>\r\n<br>\r\nYou where just about to take action against the fox before hearing the name of Viviane mother. 'Crap, can't do anything against her otherwis I'll get in real trouble with her mom.' \"Just tell me what you want.\" You replied with a hint of anger in your voice.<br>\r\n<br>\r\n\"All I want to do is protect you from those big bad wolves\" she answered as she slowly wrapped her tail around your leg. \"If you agree to be a nice boy with me I'll help you with your wolf problem and also other things.\" <img style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/heart.png\" alt=\"*Heart*\" class=\"emoteZ\" title=\"Heart\" border=\"0\" width=\"15\" height=\"15\"></span></div></div>",
            "created":1437454800,
            "id":2010764,
            "title":"Vivian, the Vixen"
        },
        "1131121":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Vivi's Trust Tour!!!!!"
            ],
            "content":"<div class=\"\"><div> <span>  You stared the busty Vixen deep into her emerald green eyes, searching for some type of dishonesty &amp; betrayal that she'd seem to be letting on with the whole \"protection\" thing. Why would YOU, of all people, need protection from anything? Contemplating this in your head, you noticed Vivian's eyes growing wider &amp; brighter.<br>\r\n  This type of gazing was unsettling for you, \"What's with the glossy stare?\" you asked her, furring your eyebrows.<br>\r\n  The Vixen could all but gasp, \"Your eyes.......\" she whispered, \"They're so........enticing......\"<br>\r\n  You were suddenly starting to create a theory on this foxy female, as you could see her nipple hardening through her already too tight bra. You also noticed the shuffling she has now started doing with her legs. This fox is lusting for you, &amp; this gesturing offer is probably her bait. <br>\r\n  You came back to the present situation before saying, \"So, IF, in some other worldly imaginary, parallel universe I decided to agree to this, what would be done?\"<br>\r\n  The Vixen's plush tail that was wrapped around your waist suddenly unraveled as she swayed it back &amp; forth in a quick fashion, her ears pointed upward &amp; a huge smile on her face, \" Well, like I said, I just want to protect you throughout the school year from these wolves &amp; everything else that may harm you.\" She moved herself closer to you. You could feel her warm breath on your ear, \"I'd keep you by me ask much as I can, show you around the school, have you meet my friends, make em jealous, and.....once I get you alone.....\" She grabbed one of your hands &amp; swiftly placed it on one of her ample breasts, all while making sure the tacher wasn't looking, \"Maybe we could get to know each other a little better.\" She lustfuly breathed down your neck before licking it.<br>\r\n  Against your better judgement, this Vixen was turning you on. It was like she knew your sensitive spots, but luckily for you have had experiences like this before. (Well, not with Vixens, but a first for everything, right?) \"Hmmm, interesting offer......for me to consider this, though.......I'm going to need you to get off me.\" You finally replied, trying to remain strong.<br>\r\n  The Vixen chuckled slightly, \"Mmm, looks like I found a spot huh? You're going to have to make me, Lee......\" She lapped at your neck again, moaning with each lick.<br>\r\n  In one swift motion, you glided the hand that was resting in her busom across till your fingers ended on her swollen nipples. You began twisting &amp; pulling it, moving it in a circular motion to enhance the pleasure. The Vixen was gasping with every twist &amp; twirl you gave her, till she finally gave in &amp; sat back correctly in her chair, her cheeks turning red &amp; her nipples even firmer.<br>\r\n  She turned toward you, her breasts jiggling with the motion, \"No fair!\" she quietly pouted, folding her hands under her fun bags. You did nothing but smirked as you returned to your notes &amp; teachers lectures. <br>\r\n  <br>\r\n<br>\r\nA few hours later, the bell rang &amp; all the students gathered their things before heading out of the teacher's class room, celebrating surviving first period, conversing with friends, &amp; others just waking up from their period nap. You were just finishing up your notes when a furry hand closed your binder. You looked up to see Vivi smiling genuinely, patiently waiting for your response. Her cleavage was sprouting out for the world to see.<br>\r\n  \"Well?\" She excitedly asked.<br>\r\n  Sighing, you stated, \" Since I don't really know anyone here, &amp; because I'm bored, I'll play along.....\" Vivian almost started dancing as she heard your response, \"BUT,\" she paused, staring at you blankly, \"If I am put in a situation where I have ti defend myself, &amp; you happen to be affiliated in it, I will not hesitate to bring you down.\" Your determined stare reaching her very core.<br>\r\n  Vivi blinked for a second, before realizing the problem, \"Ha! Now I get it!\" She shook her head, \"You don't trust me! Heh, I guess I should have expected that.\" She looked into your crimson red eyes before wispering, \"I'll make you see why you can trust me, then.\" Vivian grabbed your stuff &amp; pulled your hand, leading you out the door, \"Come on, Lovely!\"<br>\r\n<br>\r\n   A single sweat ran down your forehead. Lovely? What have you gotten yourself into?<br>\r\n<br>\r\n<br>\r\n.....................................................<br>\r\n<br>\r\n<br>\r\n    A single wolf was located at the end of the hallway. He was buff. Extremely buffer than Rufus Ralph, the supposed right hand of Nanokami. The wolf had black fur with dark grey fur covering his chest &amp; stomach. His eyes were pure silver coloring that shimmered in the light. He wore army fatigue pants with combat boots &amp; a tattoo the said \"Kami Clan\" on his left peck. A symbol to let others know he was part of the strongest&amp; dominant species in the school. He was disgusted, disgusted that one of the supposed best of his pack was laid to waste by a puny stick of a human. His growls low &amp; threating, \"You chose the wrong pack to mess with, human........\" he stated as he watched you &amp; Vivian walk along at the other end. He bashed his fist into a locker, caving it completely in.</span></div></div>",
            "created":1439182800,
            "id":2019287,
            "title":"The Offer: Acception"
        },
        "114":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "I’m in!! (Not like I have a choice.........)"
            ],
            "content":"<div class=\"\"><div> <span>Pheonix Masters comes from a very rich family. I mean, EXTREMELY rich family. They could buy the entire world if someone was smart enough to sell it to them. A long time ago, his Great (x4) Grand Father Victory Masters created the very first professional painting of the 1800’s. Victory spent days, nights, holidays, even his own birthdays working on the painting. He called it his “Everlasting masterpiece”. &amp; it required ALL of his attention. Once finished, he named it the “Seasonal vortex”: A painting that, when placed in different seasonal environments, showed that layer of the painting! It sold remarkably well, some people calling him a “Creative mad man” who stuck true to his name.<br>\r\n<br>\r\nNeedless to say, that creative gene was passed down to ALL the men in Pheonix’s Bloodline, who’ve all created outstanding art pieces &amp; illustrations that sold millions. Now Pheonix is at Furry High, which his father calls the “best school for art &amp; illustration” in his town, with hopes of becoming the greatest painting/drawing artist that has ever lived.<br>\r\n<br>\r\nPheonix loves to draw, write, &amp; paint. It comes to him almost effortlessly. He could literally look at a person, then draw their face near perfect. His vocabulary when writing poetry is superb. Many times has he won medals for “Best body of written work” in previous grades. <br>\r\n<br>\r\nPheonix is also extremely athletic. He participated in gymnastics &amp; Olympic related sports since middle school. Although he has an appreciation for it, his true passion lies in the arts.<br>\r\n<br>\r\nDespite being rich, he’s the furthest thing from spoiled, high maintenance &amp; ungrateful. He never once asked his parents for anything: Not even for his own birthday. Anything he ever wanted, he was taught to work hard AND smart for. His genuine heart even extends out to points of giving money to the homeless &amp; volunteering at feeding shelters. Along with being the greatest artist, he also hopes to open up a business where kids &amp; adults of all ages can learn how to paint &amp; draw for free.<br>\r\n<br>\r\nAge: 16<br>\r\nHeight: 5’11<br>\r\nEthnicity: Bahamian &amp; Indian (Giving him a dark caramel complexion)<br>\r\nHobbies: Poetry, drawing, painting, reading, acrobatics<br>\r\nDislikes: Bad art, entitled people, being unable to help less fortunate, non-creative enviornments<br>\r\n<br>\r\nWhat do ya think? </span></div></div>",
            "created":1566363600,
            "id":2705568,
            "title":"Pheonix Masters, The Visionary Extraordinaire "
        },
        "12":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Laura Allgood (Bio)",
                "Trina White (Bio)",
                "Sierra Jones (Bio)",
                "Olivia Daniels (Bio)",
                "Julia Heart (Bio)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well! Now we have another cheerleader or Designer on our hands, now don't we?<br>\r\n<br>\r\n\"I......guess?\" You answered, feeling akward.<br>\r\n<br>\r\nJust teasing! What's your name, sweetie? </span></div></span></div>",
            "created":1372395600,
            "id":1619243,
            "title":"Popular Sweethearts"
        },
        "121":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Indeed!!"
            ],
            "content":"<div class=\"\"><div> <span>Bio - Laura AllGood is a very physically talented idividual. She loves pushing her body to the fullest extent of exercise &amp; interval training. AllGood has praticipated in many Olympic styled &amp; entertainment events such as Bar pole flipping, Gymnastics, Swimming EXTREMELY long laps, Running Track, Pole Vaulting, being a Contortionist, a Trapeze Artist, &amp; she event was a Pilates/Yoga instructor. All starting at the age of 4 &amp; perfecting it at 16 years old!!! In fact, her parents thought that she was TOO talented to go to regular school, (They didn't have any teams that practiced in Gymnastics or Track teams) so they figured she'd do well at Furry High School. With all the amazing things Laura does, it's a wonder how she can do so with her DD cup breasts &amp; \"48 inch ass. According to her, \"It feels good when my tits &amp; ass jiggle from all the working out I do!\" These events/talents are what got her so well endowed in the first place, after all!! Due to all the extra-curricular activities, her grades plummeted. She put more work into practice than she did into homework, but she managed to pass middle school with average grades. Where she lacks in studies, she makes up for in being an athlete.<br>\r\nHer dream is to one day compete in the Olympics &amp; win first place in all the events she can!!<br>\r\n<br>\r\nStats:<br>\r\n<br>\r\nAge - 16<br>\r\nWeight - 126<br>\r\nHeight - 5'8<br>\r\nCup size - DD<br>\r\nButt inch - \"48<br>\r\nEthnicity - Honduran/Latino American<br>\r\nEye color - Hazel <br>\r\nHair color - Faded Brown (Almost a dirty blonde)<br>\r\n<br>\r\nHobbies - Training, Eating (She burns a TON of calories), sleeping, basking in the sunlight, Running (She has that Forest Gump mentality), Stretching, Skinny dipping at the beach<br>\r\n<br>\r\nHow about it? You down for her?</span></div></div>",
            "created":1492750800,
            "id":2308272,
            "title":"Laura Allgood, Freak-show Extrodinare "
        },
        "122":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Trina's Story"
            ],
            "content":"<div class=\"\"><div> <span>Trina White<br>\r\n<br>\r\nAge: 16<br>\r\n<br>\r\nSpecies: Human (Of course)<br>\r\n<br>\r\nPersonality: Very shy girl, doesn't talk too much...Transferred to the furry school because she was being bullied too much in her regular school. She hops the Furries will be nicer then Humans<br>\r\n<br>\r\nHair Color: White<br>\r\n<br>\r\nEye Color: Shy Blue<br>\r\n<br>\r\nFavorite Food: Creme Brulee <br>\r\n<br>\r\nFavorite Drink: Ginger Ale</span></div></div>",
            "created":1388206800,
            "id":1716371,
            "title":"Trina White (Bio)"
        },
        "123":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Aye (Yes)"
            ],
            "content":"<div class=\"\"><div> <span>Bio - Sierra is one tough gal. Seriously, she was the captain of her wrestling team in middle school, &amp; she had a steady job being an amateur car mechanic with full potential with her father. Sierra even became a black belt in Judo due to feeling that wrestling was too easy for her. Her grades fluctuate depending on if she's in the mood to do classwork/homework in certain classes. Sierra usually hangs with guys &amp; even plays sports or even video games with them, rather than going shopping or getting manicures/pedicures. Ironically, she actually dresses very beautifully, usually donning red or blue crop tops with the words \"No Label\" on them &amp; gray or black sweatpants that fit her coke bottle physique. She's usually label as a \"Cute Tomboy\" because of her character guys, &amp; a \"Wild Ape with no lady-like manners\" by jealous girls when she gets all the attention. (This is why she doesn't hang out with girls) Since going a human school for a Judo team would be \"Child's Play\" for her, she transferred herself to Furry High School for more of a challenge.<br>\r\nHer dream is to become a world famous Mixed Martial Arts Teacher of Women who struggle defending themselves.<br>\r\n<br>\r\nStatistics:<br>\r\nAge - 15<br>\r\nWeight - 154<br>\r\nHeight - 5'7<br>\r\nEthnicity - Scottish American<br>\r\nHair Color - Red<br>\r\nEye Color - Dandelion Gold Yellow<br>\r\n<br>\r\nHobbies - Fixing &amp; driving various vehicles, practicing Judo, watching cartoons, shopping online for indie designer clothing, managing her curly red hair, playing the bagpipes (Her Scottish blood runs deep), exploring new places<br>\r\n<br>\r\nHow about it? This little good enough for ye?</span></div></div>",
            "created":1492750800,
            "id":2308568,
            "title":"Sierra Leone Jones, A Rowdy Rough Tomboy"
        },
        "124":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "I'll have a crack at her!!"
            ],
            "content":"<div class=\"\"><div> <span>Bio - Olivia Walter Daniels......man, where do I even start? First off, the girl was born with a beautiful singing voice that turned heads where ever she went. He talent of breath control &amp; changing octaves/pitches at any given moment was nothing short of extraordinary. From talent shows to live venues, Olivia has done enough singing to put herself on the charts of the next greatest singer of her generation. However, Olivia felt that her education was more important than just singing her heart out. Guys we're falling for Olivia left &amp; right in middle school, so having a boyfriend was the least of her worries. She got much envy &amp; jealousy from all the girls at her old school, almost to the point where a girl literally tried to slice her throat so she wouldn't be able to sing ever again. Despite her talents, she usually tries to sing in order to help brighten someone's day or just for the sake of singing. Her modesty &amp; humbleness with her gift has earned her so much funds &amp; gifts from supporters that her parents wanted her to quit school &amp; just start her career already. She couldn't believe that her parents were more infatuated with what came out of their daughter singing rather than being supportive of her doing it because she wanted to or because she was having fun doing so. This is why she stopped doing shows &amp; venues, much to her parents dismay. For her safety &amp; protection, her parents registered her into Furry High School, a place where nobody knew who she was. Now she can get a fresh start &amp; make all new friends.<br>\r\nHer dream is to have her singing voice touch people all around the world; also her amazing cooking!<br>\r\n<br>\r\nStats: <br>\r\n<br>\r\nAge - 16<br>\r\nWeight - 148<br>\r\nHeight - 5'4<br>\r\nCup Size - C<br>\r\nAss measurements - \"54<br>\r\nEthnicity - Black Australian<br>\r\nHair Color - Umber Brown<br>\r\nEye color - Turquoise <br>\r\n<br>\r\nHobbies - Singing, star gazing, reading, cooking, baking, doing catering events, going to the beach (she loves to tan), listening to music (preferably jazz), meeting new people<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhat do you say?</span></div></div>",
            "created":1492923600,
            "id":2309624,
            "title":"Olivia Daniels, The Girl With The Golden Voice"
        },
        "125":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Back to Julia's bio"
            ],
            "content":"<div class=\"\"><div> <span>Hey, reader! It's me, the creator of this story! I know it's waaaaay too early to be doing this, but I just needed your feed back on the story. Are you enjoying this little thing I created? Does it entertain you? Let me know!<br>\r\n<br>\r\nAlso, if you hadn't guessed it yet, this story does resemble cool's humans in a furry school, but I'm not trying to copy his story!<br>\r\n<br>\r\nAlright, that's all!<br>\r\n<br>\r\n- D.W.<br>\r\n<br>\r\n</span></div></div>",
            "created":1373432400,
            "id":1626109,
            "title":"Just a quick pit stop."
        },
        "1251":{
            "author_id":"luigifan101",
            "author_name":"Divine Writer",
            "choices":[
                "Dive into the Divine Heart"
            ],
            "content":"<div class=\"\"><div> <span>Julia Divine Heart<br>\r\n<br>\r\nStats:<br>\r\n<br>\r\nAge: 16<br>\r\nHeight: 5'7<br>\r\nWeight: 135<br>\r\nEthnicity: Bahamian &amp; Dominican<br>\r\nCup Size: 16 A<br>\r\nInches (Glutes/her butt): 67 inches<br>\r\nEye color: Mahogany <br>\r\nHair color: Jet Black (Usually dark brown when in sunlight)<br>\r\n<br>\r\nLikes: Peace, fun, food, swimming, softball, yoga, cosmetology (Designing hair styles), bike riding, fitted bottom part clothing, anything that shows off her ass, basically <br>\r\n<br>\r\nDislikes: Stupid people, liars, anyone touching her ass (without permission), G-strings, going without food within an hour<br>\r\n<br>\r\nBio: Julia is such a sweet, sweet girl. She's so nice to everyone she meets, so she gains a lot of friends easily. Her being so sweet is how she earned her nickname, \"Sweetheart\". Her Ex-Boyfriend had to break up with her because he felt she was too good to be with him. She never cheats, lies, or tries to decieve anyone. What she lacks in bust she makes up for in her lower back region. Seriously, her ass is so big that she has trouble fitting into pants at times. It's all fine with her, though, since she is proud of what she has; She isn't afraid to show it off, either. Anyone getting the chance to even LOOK at it is a blessing in one.<br>\r\nHer dream is to become a model for a famous modeling company so she can be in magazines. She also hopes to own a hair salon store where she does hair for low prices.<br>\r\n<br>\r\nYou want to take a dive in?</span></div></div>",
            "created":1429506000,
            "id":1967123,
            "title":"Julia, The Sweet\"Heart\"......heh"
        }
    },
    "info":{
        "author_id":"luigifan101",
        "author_name":"Divine Writer",
        "brief_description":"You're a new student that has been transfered to a school full of Furries!!! Have Fun!!\r\n",
        "created":1372435740,
        "description":"<td align=\"left\" class=\"norm\">You're a new student that has been transferred to a school for furries! You think things are gonna get hectic, but you'll be fine.............maybe?<br>\r\n<br>\r\nAllowed: Sex, Nudity, Profanity, Violence, Fantasy, Magic powers<br>\r\nNOT Allowed: Vore, Scat, Deaths, a buch of chapters with only choices, (Extened your chapters) Rape, Endings that don't make sense, Chapters that don't make sense, &amp; other dumb shit.<br>\r\n<br>\r\nPeople I'd like to thank for inspiring me to make this story: Cool, RachelWolf, Khoud, HipJip, and Faith. Write on!<br>\r\n- D.W.<br>\r\n<br>\r\nUpdate: <br>\r\nWow! Over 500 views! Thanks all who read this!<br>\r\n<br>\r\nUpdate:<br>\r\nAs of 4/22/14, this story now has over 4,000 views. Thank you all so much for reading~ New additions will be made soon<br>\r\n<br>\r\nUpdate: 4/19/17<br>\r\nWow......over 14,000 views from you guys. You really like this story, huh? I'll do my best to push out more chapters for you to enjoy. Let's see if we can get to 20,000 views, eh? ;) Thanks so much for reading!!!<br>\r\n<br>\r\nUpdate: 7/11/18<br>\r\nWow.......over 21,000 views from you guys...........thank you so much for your dedication &amp; commitment to my story. I started this story 5 years ago, not knowing it would well recieved, let alone read by tons of people. You guys even add great chapters to it! Seriouly this time, I'm GOING to add to this story &amp; my other stories soon to come. (It'll just be a bit of a wait thanks to Writing.com's paid membership bull shit) Besides the bs from this website, I have a lot of fun writing on here &amp; love the support of the community. You guys make me wanna take writing a whole lot more seriously.  Again guys, thank you for supporting me. I plan to have over 50 chapters before this year is out. Mark my words.<br>\r\n<br>\r\n- D.W.</td>",
        "id":1940582,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1566387540,
        "pretty_title":"Furry High: Human Students"
    }
}