{
    "chapters":{
        "1":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Little Red Riding Hood",
                "The Pied Piper",
                "Peter Pan",
                "Jack and the Beanstalk",
                "Rapunzel"
            ],
            "content":"<div class=\"\"><div> <span>Detective Jack Crown looked from the list of missing Fairy Tale characters up to his partner, Jill Pail, and back down at the list again.  How could so many people go missing?  It didn't make any sense.  Someone had to be behind this whole fiasco and Jack was determined to find out who.  <br>\r\n<br>\r\n\"Where should we start?\" Jill asked him, already flipping through the missing persons reports.  \"That list is pretty long.\" <br>\r\n<br>\r\n\"I know,\" Jack agreed and sighed.  He didn't know where to start.  Any one of them was going to be a chore.  Not only did they have to look for clues, but they had to try and restore the order to the Tales that had gone awry without their heroes.  <br>\r\n<br>\r\n\"This is going to take a while.\" <br>\r\n<br>\r\nJack decided to start with...</span></div></div>",
            "created":1153285200,
            "id":332569,
            "title":"Preface"
        },
        "11":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "They head off to talk to the Woodsman",
                "They go see the Big Bad Wolf",
                "Go to the woods to look for clues"
            ],
            "content":"<div class=\"\"><div> <span>\"All right, we should probably start with Little Red,\" Jill said, gathering her files and stuffing them into a briefcase.  She stood up, ready to go. <br>\r\n<br>\r\n\"Let's not be hasty!\" Jack said, holding up his hands.  \"Why her?  I need a good reason.\" <br>\r\n<br>\r\nJill looked at him, unamused.  \"Well for starters, without Little Red to come along and inspire the Woodsman to rid the world of the Big Bad Wolf, who isn't actually that bad of a guy, let me just say...\"<br>\r\n<br>\r\n\"Is there a point here?\"<br>\r\n<br>\r\nJill scoffed.  \"I'm getting to it.\" <br>\r\n<br>\r\n\"Well get to it a little quicker.\" <br>\r\n<br>\r\n\"Okay, fine,\" Jill crossed her arms over her chest.  \"Because the Woodsman isn't coming, Granny's sitting nice and cozy in the Big Bad Wolf's stomach.  If we don't do something quick, she'll start being digested.  And that's not pretty.\" <br>\r\n<br>\r\nJack paused for only a second to think about it. <br>\r\n<br>\r\n\"Good enough for me.\" </span></div></div>",
            "created":1154235600,
            "id":335914,
            "title":"Digested Granny"
        },
        "111":{
            "choices":[
                "Sure, I could use the exercise",
                "No thanks, my soap opera is on now"
            ],
            "content":"<div class=\"\"><div> <span>So Jack and Jill headed off to find the Woodsman. After a few minutes of walking through the dense forest they came upon a very celestial looking log cabin. Jack led the way to the front door. He took a quick look and Jill, then knocked. Some rustling can be heard from inside the cabin. Finally the door pops open and staring back at the two sleuths was something they weren't expecting.<br>\r\n<br>\r\n\"May I help you?\" asked a tall, bearded man. He looked sort of like The Woodsman, but something was amiss. This man was the same height as The Woodsman, had the same thick, black beard, and even wore the same clothing. But this man did not possess the cut, chiseled physique that The Woodsman had. Simply put, this man was fat.<br>\r\n<br>\r\n\"Ummm, yeah,\" Jill said. <br>\r\n<br>\r\n\"We're looking for The Woodsman,\" Jack said. \"Ha..Have you seen him?\"<br>\r\n<br>\r\nThe bearded man laughed in response. \"Seen him? I am him! What, do you want an autograph or something? You know, once upon a time I saved this old lady from...\"<br>\r\n<br>\r\n\"No, thank you, we aren't autograph seekers,\" Jill said. \"Actually, we need your help Mr. Woodsman.\"<br>\r\n<br>\r\n\"You need some trees felled? A cabin built?\" The Woodsman asked. <br>\r\n<br>\r\n\"No,\" Jill answered. <br>\r\n<br>\r\n\"Actually, we're looking for somebody,\" Jack said. \"A Miss Hood, Little Red Riding. We'd like to ask her grandma if she's seen her, since she's her only known living relative, but...\"<br>\r\n<br>\r\n\"But she's currently in the Big Bad Wolf's belly? Sheesh, that wolf never learns. So lemme guess, you want me to save the grandma? Again?\"<br>\r\n<br>\r\n\"Yeah,\" Jack and Jill replied.<br>\r\n<br>\r\n\"The faster the better,\" Jill said.<br>\r\n<br>\r\nThe Woodsman thought for a moment, then answered...</span></div></div>",
            "created":1154322000,
            "id":336129,
            "title":"T. Woodsman"
        },
        "1111":{
            "author_id":"jamey85",
            "author_name":"Amelia Capponi",
            "choices":[
                "To the Big Bad Wolf!",
                "To the Forest!"
            ],
            "content":"<div class=\"\"><div> <span>          \"Sure, I could use the excercise,\" said the Woodsman.  Stepping around Jack he lifted his cloak off of a metal hook that clinged to the wooden wall, and picked up his woodsman's axe from a wooden umbrella stand that stood rigid by the door.  \"I don't go nowhere without it,\" he added, noticing Jill's odd look and swinging the axe handle between his hands.<br>\r\n          \"Is fine,\" said Jill, \"perfectly normal.\"  She exchanged a worried look with Jack, who failed to suppress his amused grin.<br>\r\n          The woodsman stepped past Jack and Jill, his rotund belly wobbling as he stepped, and opened the wooden log door.  Pausing, he turned back and looked at his visiters.  They stood statue-form by a round wooden table that had been piled with opened letters and envelopes.  \"Could you do something for me?\" he asked.<br>\r\n          \"Sure,\" said Jill, nodding.<br>\r\n          \"Anything,\" added Jack, pulling his cape closer around his shoulders.<br>\r\n          The woodsman grinned.  \"Call me Wally,\" he said, \"'Tis me name.  Now then, where to?\"</span></div></div>",
            "created":1154667600,
            "id":337326,
            "title":"Wally the Woodsman"
        },
        "11111":{
            "choices":[
                "Let Wally rest",
                "Go on without him, he's no help"
            ],
            "content":"<div class=\"\"><div> <span>\"Sure thing Wally!\" Jack shouted with glee. \"Now let's go find the Big Bad Wolf!\" Jill noticed Jack's mock enthusiasm and gave him a hard nudge.<br>\r\n<br>\r\n\"Alright, follow me. After all, I'm very experienced when it comes to wolf catching,\" Wally said. And with that, the three set off to find the Big Bad Wolf.<br>\r\n<br>\r\nHowever, after about a mile of walking, Wally suddenly stopped. He had been huffing and puffing ever since they left his cabin. \"Guys, *whew* lets take a rest,\" he wheezed.<br>\r\n<br>\r\n\"Come on Wally, we're not that much farther are we?\" Jill said. \"Besides, what about Red's poor grandma?\"<br>\r\n<br>\r\n\"I told you this was a mistake!\" Jack said.<br>\r\n<br>\r\n\"Look, I know we aren't far off, but I need the time to rest and plot my next move. They don't call him the Big Bad Wolf for nothing! Catching him and defeating him takes a lot of energy and careful planning. I'm fairly certain we can afford to rest for just a few moments.\"<br>\r\n<br>\r\nJack and Jill thought for a moment and stared at their rotund, out of breath guide. They decided to...</span></div></div>",
            "created":1155186000,
            "id":338560,
            "title":"The Journey"
        },
        "111111":{
            "choices":[
                "It's the Big Bad Wolf!",
                "It's Grandma!"
            ],
            "content":"<div class=\"\"><div> <span>\"Fine, you get 5 minutes, and then we'd BETTER find the Big Bad Wolf,\" Jill said, throwing up her hands in exasperation. <br>\r\n<br>\r\n\"Thanks, I won't disappoint you!\" Wally said. He took a seat on a tree stump and let out a loud sigh. \"These dogs sure are barking.\" He pointed to his feet and took off his shoes. \"Whew!\"<br>\r\n<br>\r\nJack walked up to Jill. \"Do we really have time for this? I mean seriously, Little Red Riding Hood is missing, grandma is about to be digested, and we're sitting here letting this overweight lumberjack rest. I say we leave him now, and go find BBW on our own.\"<br>\r\n<br>\r\n\"Look Jack, I feel the same way you do, but we need Wally. He defeated the wolf once and he can do it again,\" Jill said.<br>\r\n<br>\r\n\"HOOOOOWEEEE, smell these boots!\" Wally said. He had one of his boots in his hand. \"Do those Odor Eaters thingys work?\"<br>\r\n<br>\r\n\"Are you sure he can do it again?\" Jack asked.<br>\r\n<br>\r\n\"He'd better be able to,\" Jill said. The two detectives scanned the forrest, hoping to catch a sight of the Big Bad Wolf while Wally finished his break.<br>\r\n<br>\r\n\"Alright Wally, time's up,\" Jill said pointing to her watch. \"Time to find the wolf.\"<br>\r\n<br>\r\n\"That was the fastest five minutes ever,\" Wally pouted. He begrudgingly got up from his stump and walked over to Jack and Jill. \"But if we must go, it's this way!\" He pointed straight ahead and started walking. Suddenly, from the direction he pointed, something came out from behind the trees.<br>\r\n<br>\r\n\"Uh oh,\" Jack said.</span></div></div>",
            "created":1155877200,
            "id":340381,
            "title":"Wally's Break"
        },
        "1111112":{
            "choices":[
                "\"Yes\"",
                "\"No\""
            ],
            "content":"<div class=\"\"><div> <span>The three looked towards the movement in the brush and were astonished at the sight they saw: an old lady! It was grandma!<br>\r\n<br>\r\n\"Wow, is that you grandma?\" Jack asked.<br>\r\n<br>\r\n\"Who wants to know?\" the old lady asked.<br>\r\n<br>\r\n\"Only the man who saved your life once upon a time!\" Wally said jovially as he walked up to the old lady. \"Grandma it's been way too long\" He stuck his arms out and tried to engulf her in a bear hug. She responded by slugging him in the shoulder.<br>\r\n<br>\r\n\"Get away from you fat thing!\" the old lady wailed.<br>\r\n<br>\r\n\"Whoa!\" Jill said. \"Take it easy here, we're your friends!\"<br>\r\n<br>\r\n\"Yeah, we're just looking for Little Red Riding Hood's grandma,\" Jack said.<br>\r\n<br>\r\nThe old lady stared at the three for a moment, then answered, \"Who's we?\" <br>\r\n<br>\r\n\"We're your friends,\" Wally said massaging his shoulder. \"Last I checked, friends don't hit friends.\"<br>\r\n<br>\r\n\"Easy tiger,\" Jill said. \"I'm Jill and this is my partner Jack. Red's gone missing, and we're on the case. This guy here is Wally. You might recognize him from when he saved you from the Big Bad Wolf.\"<br>\r\n<br>\r\n\"Wally? Is that you? Wow you've gotten fat,\" the old lady said. \"I didn't even recognize you!\"<br>\r\n<br>\r\n\"Hey now, take it easy,\" Wally said, his feelings obviously hurt. \"I might look a little round, but it's all muscle!\"<br>\r\n<br>\r\n\"Alright, alright,\" Jack said, trying to stear the conversation back towards Red. \"You're obviously Little Red Riding Hood's grandma. Have you seen her at all today?\"</span></div></div>",
            "created":1157086800,
            "id":343651,
            "title":"Grandma"
        },
        "11111122":{
            "choices":[
                "The wolf runs",
                "the wolf talks"
            ],
            "content":"<div class=\"\"><div> <span>She bopped jack in the head \"no ya dang fool, I've been inside a dang wolf all day\" <br>\r\n<br>\r\nJill laughs at Jack who is currently cradeling his head, \"well, can you tell me where the wolf is\" Jack grumbles<br>\r\n<br>\r\nGrandma \"He let me out for a bathroom break\" she points beyond the bushes \"he's over there\", Jack and Jill thank her \" thank you, I've got some questions for him\" jill says as she makes her way through the bushes the wolf has his back turned \"are you done yet old lady\" he turns around and is startled to see jack, jill and the woodsman who clumbsily followed them.</span></div></div>",
            "created":1185339600,
            "id":429032,
            "title":"over there"
        },
        "111112":{
            "author_id":"weagle87",
            "author_name":"LA",
            "choices":[
                "Jack and Jill take the road that leads to the swamp.",
                "Jack and Jill takes the road less traveled and come upon a candy house."
            ],
            "content":"<div class=\"\"><div> <span>\"You're right, Jack,\" Jill conceded.  \"Let's just go on without Wall-ee here;  I don't think he's in any shape to defeat Big Bad anyway.\"  <br>\r\n<br>\r\nThey walked aimlessly though the woods, crunching leaves and considering their options when Jack stopped at a fork in the path.  He looked down each as far as he could and fidgeted.  \"You know, Jill, what's the big deal with the grandmother anyway.  Do we have any proof that the wolf has eaten her yet?\"<br>\r\n<br>\r\n\"Well, no...\"<br>\r\n<br>\r\n\"So we chose Little Red on a faulty premise.  We chose to look for her first since we didn't want to have to investigate a partially digested Grandmother.  Makes perfect sense aesthetically, but I think we got sidetracked by the Wally, the formally chiseled woodsman.\"<br>\r\n<br>\r\n\"You're right!\" gasped Jill.  \"The real issue is that long list of missing characters.  The stories could all come unraveled by morning if we don't locate the kidnapper.\"<br>\r\n<br>\r\n\"I was looking down these roads earlier.  I think that perhaps we might take the one less traveled and search for clues about the whereabouts of Little Red.  In fact, we might as well keep our eyes open for Snow White, too.  The Woodsman needs to save her life as well.\"<br>\r\n<br>\r\nJill sighed.  \"I wish both of them luck.  I'm not sure The Woodsman does much saving anymore.\"<br>\r\n</span></div></div>",
            "created":1224565200,
            "id":598296,
            "title":"Go on without him, he's no help"
        },
        "112":{
            "choices":[
                "Jack decides the wolf is guilty.",
                "Jill decides to go looking for clues in the woods."
            ],
            "content":"<div class=\"\"><div> <span>So Jill lead Jack through the woods until they finally got to a quaint little cottage.<br>\r\n<br>\r\nJack gulped. He'd never liked BBW. In fact, he'd always been afraid of the jerky wolf.<br>\r\n<br>\r\nJill resolutely walked up to the door, pounded on it, then without waiting for an answer, walked in.<br>\r\n<br>\r\n\"BBW! You in here?\"<br>\r\n<br>\r\n\"What?\" came a scratchy voice from another room.<br>\r\n<br>\r\nJack and Jill walked into the small room. The large bed with a blue comforter would've looked cute, hadn't it been for the ugly granny lying in it. A granny, with a very hairy face.<br>\r\n<br>\r\n\"BBW, do you have any idea where Red is?\" demanded Jill firmly.<br>\r\n<br>\r\n\"Just BB, if you please.\" answered the voice. It wasn't as scratcy now, it was actually very deep and strong. He wasn't pretending to be Granny anymore. \"I was wondering the same thing! Granny doesn't agree with my stomach.\" he said, then moaned.</span></div></div>",
            "created":1154235600,
            "id":335960,
            "title":"Meeting BB"
        },
        "1121":{
            "choices":[
                "Jack and Jill follow the wolf",
                "Jack and Jill decide to see the Wicked Witch",
                "Jack and Jill go visit the woodcutter"
            ],
            "content":"<div class=\"\"><div> <span>          Jack scanned the room.  In a corner, shoved between the side table and the wall, something red was poking out.<br>\r\n          \"You stole Little Red, didn't you?\" Jack inquired of the wolf.  The wolf groaned and mumbled.  \"Out with it Big Bad, or do you want us to bring up your addiction to the little pigs?\"<br>\r\n          \"Okay! Okay! I'll tell you, but it isn't pretty,\" the wolf grumbled, \"she made me do it.\"<br>\r\n          \"You're going to have to be more specific than just she,\" Jill interjected.<br>\r\n          \"Alright...it was the Wicked Witch of the West,\" the wolf let out with another groan.  He ran into the bathroom.</span></div></div>",
            "created":1193029200,
            "id":455867,
            "title":"The Wolf, Wolfs up the Truth"
        },
        "11211":{
            "author_id":"tanwir",
            "author_name":"Moon",
            "choices":[
                "Jack and Jill follow Peter Pan to Never Never Land and meet with Granny"
            ],
            "content":"<div class=\"\"><div> <span>Jack and Jill entered the bathroom in time to see BB's transformation. BB blurred and seemed to blend into his surroundings. Then with a soft pop, that sounded like a cork leaving a bottle, he refocused and standing before them was Peter Pan. Jack and Jill had never seen such a jaw dropping thing before and their jaws did indeed drop. It took a few minutes for them to collect their thoughts during which Peter Pan grinned at them broadly. Finally Jill broke the silence with a squeaky whisper. <br>\r\n\"What are you doing here?\" she asked.<br>\r\n\"Just completed my mission,\" said Peter Pan looking very proud of himself.<br>\r\n\"What mission?\" asked Jack.<br>\r\n\"The one for granny,\" replied Peter Pan.<br>\r\nJill let out a long sigh. Things were getting a little complicated. \"Perhaps we should start from the beginning,\" she suggested.<br>\r\n\"Okay, but can we go into the living room?\" said PP.<br>\r\n<br>\r\nIn the living room PP explained that Granny had been transported to Never, Never Land where she would never get any older and she would never die. \"It's all here,\" he said as he removed a piece of paper from a pocket in his tunic and handed it to Jill. <br>\r\nJill stared at the official looking document in her hand and frowned. \"Things are worse than we suspected,\" she said.<br>\r\n\"But it's all legal,\" said Peter Pan. \"That's Granny's signature at the bottom.<br>\r\nJack leaned over to have a look. \"Yep,\" he said. \"That's her signature all right.\"<br>\r\n\"This is not good,\" said Jill. \"You do realise you are not supposed to be in this story, don't you?\" she said looking at PP.<br>\r\n\"Hey,  a mission is a mission,\" said PP. \"Besides the money was good.\"<br>\r\n\"So what do we do now?\" asked Jill turning to Jack.<br>\r\n\"Well there is only one thing we can do,\" replied Jack.</span></div></div>",
            "created":1299042000,
            "id":1063413,
            "title":"Jack and Jill follow the wolf"
        },
        "1122":{
            "choices":[
                "Boy is hiding a secret...",
                "Jack and Jill help Johnny find the piggy"
            ],
            "content":"<div class=\"\"><div> <span>\"Aww, poor BB!\" said Jill compassionately.<br>\r\n<br>\r\nJack glared. \"Serves you right for eating poor Granny.\" he muttered, to quietly for the wolf to hear... or so he thought.<br>\r\n<br>\r\n\"I've got big ears, and that wasn't very nice Jacky.\" snapped BB. He had never liked Jack either. He personally thought Jack had been a spoiled child.<br>\r\n<br>\r\n\"Come on!\" yelled Jill. She grabbed Jacks arm and pulled him out of the house. \"We've got to hurry.\"<br>\r\n<br>\r\n<div align=\"center\">***************</div><br>\r\n<br>\r\n\"Here, piggy piggy piggy, here piggy!\" squeaked a young voice.<br>\r\n<br>\r\nJack and Jill had been wondering through the woods for about an hour now, and no clues had shown up.<br>\r\n<br>\r\n\"Who is that?\" called Jack.<br>\r\n<br>\r\n\"Who's there?\" came the now scared voice.<br>\r\n<br>\r\n\"Dectective Jack, and his helper, Jill.\" answered Jack, who earned a glare from her.<br>\r\n<br>\r\n\"I'm every bit a dective that you are.\" she hissed in his ear.<br>\r\n<br>\r\nHe grinned back, which made her roll her eyes, and the two of them went forward to find a young boy.<br>\r\n<br>\r\n\"I'm Johnny.\" he said. \"My piggy is lost! His Dad, Mr. I. M. Pork will kill me! My piggy is his nephew!\"<br>\r\n<br>\r\n\"Mr. Pork?\" asked a surprised Jill. <i>You sure out in the boonies, kid</i> she thought, <i>For not even knowing that the main pig in Piggy Construction Co. is gone missing.</i></span></div></div>",
            "created":1154235600,
            "id":335961,
            "title":"Discovery in the Woods"
        },
        "11221":{
            "author_id":"jacknife78",
            "author_name":"Jacknife78",
            "choices":[
                "The J team follow Johnny",
                "The J team go back to grandma's house"
            ],
            "content":"<div class=\"\"><div> <span>    \"Is there anything else you know that might help us find your little pig?\"  Jill asks.  Shaking his head no, Johnny looks to the ground and moves his right foot back and forth in the dirt.  Jill is about to walk away to find another clue but Jack has a different plan.<br>\r\n<br>\r\n     \"Look kid, I know your not telling us everything\"  Jack intimidates.  He soutly walks closer to the young tike, whose upper lip is quivering.  Jill puts her hand on Jack's shoulder to caution him that he is going to far but he just shrugs it off.<br>\r\n<br>\r\n    \"I'm telling you mister, I don't know anything else.  \"  Johnny cries.  Just then he looks past Jack and Jill.  Bellowing at the top of his lungs he cries \"WOLF!!!  WOLF!!  THERE IS A WOLF RIGHT BEHIND YOU\"<br>\r\n<br>\r\n   Thinking that BB decided to have them for dessert, Jack and Jill spin around.  They find that nothing is behind them.  When they turn back, Johnny is running into the forest, laughing merrily along the way.<br>\r\n<br>\r\n<br>\r\n     \"I knew he was hiding something.\"  Jack shouts  \"Quickly, before he gets away\".<br>\r\n<br>\r\n     \"Wait.\"  replys Jill  \"First Double R Hood goes missing, then one of the piglet triplets disappears, and now the brat who cries wolf is trying to throw us off the trail.  We better go question BB agian\"</span></div></div>",
            "created":1154322000,
            "id":336222,
            "title":"Johnny Cries _____"
        },
        "112212":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Johnny walks in",
                "Johnny walks in with the pig and Red!"
            ],
            "content":"<div class=\"\"><div> <span>\"He's too far now. Let's go see what BB's up too. I think he knows more then he's telling.\"<br>\r\n<br>\r\n---------At Granny's---------<br>\r\n<br>\r\nJack and Jill came barging through the door catching the BBW off gaurd. Before BB could go through the window J and J quickly nabbed him and slammed him against the wall.<br>\r\n<br>\r\n\"Alright BB! Tell us what you know about Double R going missing!\" shouted Jack driving his elbow into BB's back.<br>\r\n<br>\r\n\"Did you eat her?\"<br>\r\n<br>\r\n\"Hey man no way man. I'm outta that game. I'm strickly white collar crimes now.\"<br>\r\n<br>\r\n\"Bull.\" yelled Jill<br>\r\n<br>\r\n\"Last time we saw you you were still digesting Granny.\"<br>\r\n<br>\r\n\"Hey that was my last crime. I've turned a new leaf.\"<br>\r\n<br>\r\n\"What do ya know about the little kid Johnny?\" said Jack, as he and Jill slammed the wolf onto the table.<br>\r\n<br>\r\n\"That little prick's been tryin to nail me for years. I want nothing to do with him. Look...look I've told you everything I know. Just let me go.\"<br>\r\n<br>\r\nJust then...</span></div></div>",
            "created":1154494800,
            "id":336769,
            "title":"Interogation"
        },
        "1122122":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "starts talking",
                "takes a cyanide pill"
            ],
            "content":"<div class=\"\"><div> <span>Johnny comes walking in carrying the little pig and a tied and gagged Double R Hood. Immediatly Johnny dropped the hostages as Jack gave chase.<br>\r\n<br>\r\nJohnny didn't even make it out the door before Jack was upon him.<br>\r\n<br>\r\nJack brought Johnny slamming down on the table next to the wolf.<br>\r\n<br>\r\n\"Its the end of the line for you Johnny. We've got two Fairy tale characters. Now what'd you do with the others?\"<br>\r\n<br>\r\n\"Hey man. I don't know man. Its not just me man. You have no idea how deep you're man. No idea how high up this goes.\"<br>\r\n<br>\r\n\"O yeah. How high we talkin. Mother Goose?\"<br>\r\n<br>\r\n\"Higher.\"<br>\r\n<br>\r\n\"How high Johnny. You better start talking.\"<br>\r\n<br>\r\nJohnny.....</span></div></div>",
            "created":1154494800,
            "id":336772,
            "title":"Caught RED Handed"
        },
        "11221221":{
            "choices":[
                "the wolf runs into Johnny in the woods",
                "the wolf runs into J&J in the woods"
            ],
            "content":"<div class=\"\"><div> <span>\"Yo man I ain't know nothing. Ask wolfie over there. He's the main man's maid!\" Johnny looks at the wolf with a grin, the wolf growls.<br>\r\n\"Ok cough it up BB,\" said Jack all manly like.<br>\r\nThe wolf then starts to scratch and itch a lot. He wriggles and squirms.<br>\r\nThen he starts choking and couching loudly Jill pats his back while Jack stands in front him so he can't try and escape. J &amp; J completely forgot about little Johnny and he snuck away silently. He ran as fast as he could back into the woods taking Double R and the piglet with him.<br>\r\nAll this time the wolf is coughing up a storm J &amp; J step back a little when the wolf coughs louder. Then just like he coughs one really loud big one and out comes granny! Yup all slobbered in saliva the old lady lands on the floor.<br>\r\nJ&amp; J couldn't believe there eyes, granny gets up walks over to the wolf and says, \"You need to watch what you eat and brush your teeth and next time you come in my house I'll kill ya!\" The wolf just laughs, Jill noticed that Johnny went missing so she told Jack and they went to look for him. They knew granny would be all right because she could fight like a ninja. <br>\r\n\"So you think that's funny, ay BB?\" The wolf just keeps laughing, Granny ran up to him and jump kicked his butt through the window and yelled, \"And stay out!\"<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1185858000,
            "id":430725,
            "title":"Coughing up granny"
        },
        "11221222":{
            "author_id":"smile248",
            "author_name":"Val",
            "choices":[
                "A blood-curdling scream suddenly fills the air",
                "A rustling in the bushes"
            ],
            "content":"<div class=\"\"><div> <span>Flashing a wide grin that made the most of his pearly whites, Johnny reached into a pocket sewn crudely to the front of his vest. Jack, fearing the worst, leaped back, fumbling for the pistol hidden inside his coat.\"WAIT\" shrieked Jill, her eyes locked onto Johnny's. \"DON'T SHOOT!\". Johnny's hand re-emerged, clutching a tiny, pale green capsule. Visibly confused, Jack made to snatch the pill from the bay's hand, but Johnny was too quick for him. Throwing his hand to his mouth, Jill caught a glance of the green blur hurtling down the lad's throat, and then it was gone. Jack shook the boy hard, yelling words he could barely hear. \"WHERE ARE THE OTHERS? TELL ME, OR...\" Jack stopped, seeing Johnny's lips move. \"Queen... \" He gurgled, a strange stillness creeping over him as the poison began to take effect. \"What, Johnny? It's okay, you can tell me\" Jill said, tears in her eyes as she watched the boy she now recognized as the cat-killer Johnny Stout, once a dear friend to her before the brutal murder of the neighborhood tabby.\"Us\" Jack said insistently, asserting his dominance over quiet Jill. \"Ask... heart... duel... before the Court...\" his eyes back rolled in their sockets as his breathing slowed to a halt. Johnny was dead. \"The Court?\" Jill wondered, wiping her eyes and nose as if to erase Johnny's death. \"Well, at least we've got a lead\" Jack grunted, looking round for Mr Wolf, but the sinister beast had gone, taking Red with him. The little pig, over the shock already, lingered a few minutes to give a statement then fled, disappearing into the undergrowth. \"Aw, heck\" Jack muttered, looker at Red's hood which lay on the ground. \"Why did you let him get away?\" Jill hung her head, looking sorrowful. \"I...\" \"Don't worry\" said Jack harshly.\"We'll just have to find this Queen, AND her Court, and get some answers that way\". Together, they walked out into the sunshine, squinting at the road ahead.</span></div></div>",
            "created":1277787600,
            "id":908470,
            "title":"Takes a cyanide pill"
        },
        "112212222":{
            "author_id":"smile248",
            "author_name":"Val",
            "choices":[
                "Jill's disappearing act [part 2]: Jill escapes",
                "Jill's disappearing act [part 2]: The Queen of Hearts"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, Jack spied a cloud of dust billowing in the distance. Sprinting to the scene, Jack and Jill found themselves caught in the middle of a whirling mass of birds. Flailing about wildly, Jack fought off the flock, who were unnerved by his strange maneuvers., then turned to Jill. \"What do you think that...\" He stopped in mid-sentence; something was wrong. \"JILL? JILL, WHERE ARE YOU?\" he bellowed, looking around frantically. Finally he looked up, and there in the tree was the blue-and-yellow, ex-school scarf she'd been wearing, tangled in the tree branches. Where had Jill gone? Peering up into the tree again, he realized what looked like a grin was forming out of thin air, on top of the old scarf. Slowly, an entire face formed, and as he watched in fascination the rest of the creature appeared too. Flashing its teeth in a way entirely different to Johnny's grin, the Cheshire Cat smirked down at Jack, purring loudly. \"What happened to Jill\" he called up to it, knowing it knew where his partner had gone. \"Before the Court, to stand against the Queen Herself, no less\" it chuckled, obviously deeply satisfied at the turn of events. \"But... but...\" Jack stuttered, astounded by this revelation. \"But... she's on THIS case, not some trial for an old queen of some distant land!\" The cat considered this, kneading the knitted fabric of the scarf thoughtfully. \"The Queen of Hearts waits for no man\" it intoned, yawning so that its many vicious fangs could be seen. \"So says the White Rabbit, and not even the great Jack himself can deny it.\" \"Me?\" the detective, Jack, asked, puzzled.\"The Jack of legend, of flaming towns and swirling blades, who comes upon the turn of the tide. Jack, whom the Queen locked back in the worlds from which He came. And Jill, key to the case, is key to the chest that binds Him unto His enforced slumber. Oh, pathetic human, you have no idea who your precious Jill really is; what she could become!\" With that, the cat faded away, leaving the vague imprint of his smirk against the pine needle.</span></div></div>",
            "created":1277787600,
            "id":908480,
            "title":"Jill's disappearing act [part 1]: The Cheshire Cat"
        },
        "1122122222":{
            "author_id":"smile248",
            "author_name":"Val",
            "choices":[
                "Jill's disappearing act [part 3]: Captured!"
            ],
            "content":"<div class=\"\"><div> <span>As Jack puzzled over the mystery of Jill's disappearance, something rather more sinister was about to begin. In a world much older than Jack's; a world laid over his own, that was invisible and untouchable, darkness gathered. In a palace far from the point corresponding to Jack's location, the Court met, to discuss the fate of the Key. \"The previous events are of no consequence\" a deep, earthy voice spoke from beneath the owner's cloak. \"The girl; the Key, must be retrieved, and prevented from fulfilling her potential. I say we eliminate the threat, and destroy her\". Another voice spoke up, similar to the first. \"The Queen of Hearts, the Key to the Chest, Jack of Spades and our own Void, are all inexorable\" it said slowly, it's eyes burning blue beneath the shielding cloth.\"So says the Courts of old, and who are we to deny them?\" Beside him, seated upon a hard granite throne, a figure sat up. Her crown, wrought from the twisted hearts of men, glinted in the half-light as the Queen of Hearts raised her head. A new voice, as cold and hard as steel, rose up above the murmurings of her Court. \"The Key cannot be truly killed by any, mortal or lord. You speak the truth, Lord Cairn. Her, Jack of Spades and I are somewhat indestructible. As for the Void... we are no longer known by that name. As of last Sun-Return, the Great Jester stripped us of the title, since we have not had a Spade on the throne for nigh on a millennium, though I plan to keep it that way. Once again, we are Wonderland\". After the moment of silence that followed her words, Lord Cairn spoke again. \"The Key, Your Majesty?\" The Queen thought for a moment, her sharp features softened by the smoke-laden air surrounding them. Then she spoke, and this time with a voice tinged with boredom: \"I have decided. Once captured, we shall hold the Key in Deep Seven, thus keeping her from releasing Jack of Spades. Septus\" she nodded to a skeletal figure waiting by her side. \"Find the girl, and bring her to me. Orchus\" here, she pointed to another hooded form. \"Check on my Lord Jack; ensure he still sleeps\". With that, she was suddenly gone. <br>\r\n<br>\r\nAll at once, the usually reserved Court began to chatter. \"Deep Seven?\" They all wondered, shaking their heads. A barrel-chested warrior spoke up. \"The Lord of Spades is kept in Chamber Two down there... supposing the Queen takes the Key down, what if they react? He'd be free...\" All present shuddered, remembering their part in confining Jack of Spades. His retribution would be terrible; how could the Queen risk it? The Deep Quarantine Chambers, or DQC, were where enemies of the Ruler that were not to be executed were held. In Deep Four, the Mad Hatter languished along with nine other souls, jailed for causing Her Majesty displeasure.In Deep Seven, however, there were only two chambers. From far back in the mists of time, there had always been the Powers: the Jester, the Queen of Hearts, the Jack of Spades, the Knave of Diamonds and the Knight of Clubs. Each Power had a Key; a person solely dedicated to the restoration of them, for each Key was only born if a Power was denied. Locked in an infinite sleep, the Jack of Spades was in line for a Key. The Queen and the Jester were the ones who ruled, thus not requiring a Key; the Queen held Wonderland, the Jester held Earth, and the other Powers went by different titles and occupations. The Knave of Diamonds was known as the Mad Hatter, and had his estate in the Wild Woods bordering Wonderland, although he was currently  under temporary arrest. The Knight of Clubs traveled under the name the White Rabbit, and ruled the Under-lands. And Jack, if freed, would rule them all. Thus He was kept in Deep Seven, the safest place in all Wonderland, and also the best guarded, for the Queen could not afford for Him to escape, for her and the Jester would be banished to the Nether Realms, where all Powers were originally formed. <br>\r\n<br>\r\nDeep down in the bowels of the earth, suspended in His slumber, the Lord of Spades dreamed of the boy searching for his lost partner, and smiled in His sleep. Jack Crown, in the Other World, stumbled desolately down a dusty track, facing a new case to solve. He had to find the Court, and get Jill back. After all, he reasoned, good assistants were hard to find.<br>\r\n<br>\r\n</span></div></div>",
            "created":1277874000,
            "id":909072,
            "title":"Jill's disappearing act [part 2]: The Court"
        },
        "11221222221":{
            "author_id":"smile248",
            "author_name":"Val",
            "choices":[
                "Jill's disappearing act [part 4]: Who's afraid of the Big Bad Wolf?",
                "Jill's disappearing act [part 4]: The White Rabbit"
            ],
            "content":"<div class=\"\"><div> <span>Far away from both her partner Jack and the Court, Jill groaned softly as she opened her eyes, having just regained consciousness. Where was she? She could remember a sandstorm, screaming birds, a panicked Jack... and then darkness. She went to rub her blurry eyes, then found her arms were somehow strapped tightly to her sides. <br>\r\nBlinking, Jill felt dizzy as the room swam into view, then wished she hadn't woken up. \"Took you long enough\" an amused, somewhat ironic female voice said, coming nearer as she felt footsteps come towards her. Cool fingers carefully brushed the remaining dust from her eyes as Alice of Wonderland loomed high above her, her gray-blue eyes triumphant as she surveyed her captive. Struggling against her bonds, Jill tried to sit up, but found she couldn't quite balance, and slipped back to the wooden floor. <br>\r\n\"Would you like some help?\" Alice asked, and without waiting for a reply grasped Jill's elbows and firmly levered her upright. <br>\r\n\"That's better. Sorry about the straitjacket; it's just a precaution, you know? Can't have you attempting to break free, now that I've found you.\" <br>\r\nSwallowing her confusing, Jill found her voice. \"And why am I here?\" she asked, looking round for an escape route. <br>\r\nThere were none to be seen. Alice took her time answering, pacing up and down the underground room as she thought up a reply. <br>\r\n\"Well, you are the last Key, you know. No more can ever be born; for once the sleeping Lord is wakened He'll never sleep again\". Thoroughly confounded, Jill remained silent, and after a moment Alice continued: <br>\r\n\"I was the White Rabbit's Key, on that first venture into Wonderland. I was from Earth, like you, until they claimed me as his Key, but now I'm a retired Power since I fulfilled my duty. But, now that I've found you, I can't let you fulfill yours.\" J<br>\r\nill looked at Alice questioningly, her eyes troubled, and Alice went on: \"I'm a little sorry about this, but I can't let you free Jack of Spades. He'll absorb the White Rabbit's territory into His own, and since the White Rabbit gave me a patch to myself He will take that too. So you're trapped down here for good, since you can't really die, and anyway I'd not want to kill you, since in a way I think you're like me. Better get used to this room, kid. It's your world now\". <br>\r\nHaving explained, Alice left Jill to her own devices, and Jill realized that Alice had meant it. but on the bright side, she reasoned, she'd found Missing 'Hero' No. 21. If only Jack knew... suddenly she wondered what had happened to Jack. \"I hope he's okay!\" she muttered under her breath, then turned to the pressing question of Keys. What was a Key? What was a 'Jack of Spades'? Was it her Detective Jack? Why was Alice behaving weirdly? Jill slowly forced herself onto her feet, and started towards where Alice had gone, intending to get answers.</span></div></div>",
            "created":1277874000,
            "id":909097,
            "title":"Jill's disappearing act [part 3]: Captured!"
        },
        "112212222211":{
            "author_id":"smile248",
            "author_name":"Val",
            "choices":[
                "Jill's disappearing act [part 4]: Jack's Dream"
            ],
            "content":"<div class=\"\"><div> <span>Even further away from both Jack, the Court and Jill, a strange creature travelled through the forest, sprinting on all fours towards a towering cliff face. Slowing as it neared the rock, the beast looked around quickly before darting into a well-concealed cave. <br>\r\nTied to the creature's back was a screaming, howling red bundle. Standing up on it's hind legs, it swung its writhing burden onto the floor, and busied itself making its dinner. \"WOLF!\" the little bundle screamed, managing to free one if its limbs. \"UNTIE ME AT ONCE, YOU FIEND!\" <br>\r\nThe Wolf yawned, picked at his teeth a little, and went back to his cooking. In a small pot, he stirred a meaty broth, regretting stealing the hysterical little girl. Who happened to be a practising member of one of the largest karate clubs in Wonderland, hence the bruises he could feel as he stirred his pot. <br>\r\n\"Shut the hell up, Red!\" he snarled at the flailing bundle, waving his wooden spoon threateningly at her. <br>\r\nShe looked at the large collection of nunchucks, star blades, and daggers arraying the western wall of his cave. She wriggled round to stare at the painting of death on the wall. Then she laughed. <br>\r\nMr Wolf felt exasperated. How was he supposed to be scary when everyone laughed at him? Was it his beautiful honey-coloured eyes, his mother's pride and joy? Was it the small bald patch on the top of his head, from where he'd scalded it on the Three Little Pig's caudron of soup? Or was it the way his partner in the back of the cave snored? What ever it was, he was sick of it. What was the point of being a wolf if he wasn't frightening? <br>\r\nHaving already sufficiently frightened Red the last time she visited dear old Granny, he'd thought it would be a piece of cake, scaring her again. Thought admittedly, he thought, that was seven years ago and Red had grown up since then, being now 18, a karate champion and a mean cupcake-baker to boot. <br>\r\nTurning back to Red, who was still laughing uncontrollably, he decided to take action. She was firmly bound he reasoned, and unable to beat the living daylights out of him, so he went for revenge. Hovering over her for a moment, he choose to boot her very, very hard in the stomach. <br>\r\nThat would show the swine. However, what he hadn't done was take into account her awesome karate skills, and more importantly, her flailing arm. Waiting until Mr Wolf was just about to kick her, Red struck. <br>\r\nSuddenly, Wolf felt a blinding pain erupt from his groin. \"AHHHHHHHHHHH!\" he yelled, scrabbling back from the girl as fast as she could, tears filling his eyes. From the back of the cave came a drawn-out yawn, and his partner emerged, rubbing the sleep from his eyes. \"Wolfy, what's wrong?\" he asked, extending a paw to pull Mr Wolf upright. <br>\r\n\"Little brat punched me in the nuts!\" Wolf coughed, his legs tightly crossed. <br>\r\nRed saw Wolf's partner, and began to cackle again. \"GAY!\" she shrieked, rolling on the cave floor in mirth. \"Ha; I knew it!\"<br>\r\nGoing as red as was possible for a wolf, Mr Wolf blushed. \"Red, I'd like you to meet Alfred\" he said, pointing to the grey wolf beside him. Turning to Alfred, he pointed to the laughing girl and introduced Red to him. \"Alfred, this is Red, formerly known as Little Red Riding Hood, four times Karate Kid of the Year, recently awarded Guides Wonderland, who is a senior Ranger, and also a leading junior reporter\". <br>\r\nAlfred whistled, clearly impressed. \"You forgot one\" said Red, untying herself with her free arm. \"Cousin to Alice of Wonderland\". \"Yes, yes\" interrupted Alfred. \"But where are we to keep our guest?\" <br>\r\nNow freed of her bonds, Red stood up. \"Awww; isn't that cute! Wolfy found a friend!\" she said, looking Alfred up and down. \"Oh, come on, Wolfy. We shall simply have to let her go\" Alfred looked over at Mr Wolf. \"She'll come between us; the togetherness we have. Off you go, little girl\".<br>\r\nAgreeing somewhat with his mate, Mr Wolf led Red to the cave entrance to let her go. \"But don't you dare tell\" he growled, once out of earshot from Alfred. \"We have a nice lifestyle, peaceful, like, and I'll not have you ruining it\". He looked menacingly at Red, willing her to agree.<br>\r\n\"Sure thing, Wolfy\" Red sang airily, pleased to have met a real live all-male marrige. \"But don't harrass my Granny ever again\". Conceeding to this, he went back into his cave, shaking his shaggy head, and Red went on her way.</span></div></div>",
            "created":1277874000,
            "id":909462,
            "title":"Jill's disappearing act [part 4]: Mr Wolf"
        },
        "1122122222111":{
            "author_id":"smile248",
            "author_name":"Val",
            "choices":[
                "Who am I? Part One: I Beg to Differ"
            ],
            "content":"<div class=\"\"><div> <span>Asleep in His cell in Deep Seven, Jack of Spades dreamed. Vague visions of fire, sharply contrasted against darkness, filled His mind as His sub-conscious dwelt on His past lives. The world burnt again, the sounds of screaming villagers rising in His ears like it did so long ago. But who had begun the chaos? It was this point that He dwelt on always, trapped as He was in the long hours of sleep.<br>\r\nA blurred face, streaked with blood and dirt... the dull thump of an exploding cannon, the shrill keening of a weeping winner. But who had won the war? Why the bitter sorrow, painted across the conquerer of the worlds in blue and grey?<br>\r\nUnable to truly awake, Jack of Spades found Himself thinking. At last! he thought, then wondered, why? There was a change in the pattern, He decided. A rift; a frayed thread in the fabric of reality. All of Wonderland had descended from those who survived the war, and it was they who wove the pattern now. Not mighty sorcerers, twisting the strands of the weave until they distorted and warped, but the remaining creatures; those who had become the so-called 'fairy tale heroes'. So what was wrong with them? It seemed to Jack  that there was almost something missing, like a whole lifetime of memories had been found to have been misplaced or lost. Indeed, that WAS reality; He couldn't even remember why He was here, where ever here was. Or who He was... suddenly a strange thought entered His mind: was He a he? 'Jack' implied a certain male element, but He doubted He could go by that alone... but He just had to escape this dreamstate. Unknown to Him though, help was on its way. </span></div></div>",
            "created":1277960400,
            "id":909539,
            "title":"Jill's disappearing act [part 4]: Jack's Dream"
        },
        "11221222221111":{
            "author_id":"smile248",
            "author_name":"Val",
            "choices":[
                "Who am I? Part Two: Strike Three, and You're Out",
                "Who am I? Part Two: The Powers and Poisons of Thought"
            ],
            "content":"<div class=\"\"><div> <span>The aforementioned help, however, had found itself in quite some trouble. Finding her attempts to free herself from the straitjacket fruitless, Jill cautiously followed after Alice, thinking very rude and vengeful thoughts against her red-haired captor. The sound of running water could be heard, masking both her and Alice's footsteps, and soon she was lost in the maze of tunnels that linked the chambers in Alice's domain. \"Oh yes, Jill, VERY well done\" she muttered to herself sarcastically, trying to keep track of the twists and turns in case she needed to backtrack pronto. The air became colder, and soon she realized that the scanty light from candles set into the walls was fading as she passed the last of them. Was she reaching the surface, or going deeper in? Feeling particularly negative because of her current captivity, Jill decided on the latter. Treading lightly on the slightly soft soil, straining her ears for any sound, Jill was so intent on being silent and listening for others that she didn't realize Alice was ahead, and watching her, til she found herself reeling back after bowling Alice over. \"Oi!\" Alice snarled, trying to regain her footing. \"Sorry; got to go\" Jill said, and wished she'd said something a bit more intelligent, just as a parting shot. Then she was off, up towards the glorious light that proved her wrong, leaving Alice in her wake. Exulting in her escape, Jill stumbled across the dew-laden grass of the outer world, pleased with her small success, planning what to do next. But her new-found freedom didn't seem so certain, when after a sweet moment of brief peace, Alice came hurtling out of the tunnel.<br>\r\n<br>\r\nTurning to face her, Jill glared defiance at the other girl, annoyed at the impending imprisonment that threatened to put an end to her endeavors. \"Now, you'll come along quietly, yes? Like before\" Alice asked, her teeth bared in a feral grin as she watched Jill eye her warily. \"Oh, but this time I beg to differ\" Jill tartly replied, then stared in amazement at the change her words had inspired in Alice. What began as a silent heaving of the shoulders erupted into a full-hearted chuckle as Alice laughed. \"You are still straitjacketed, don't know where you are, have a price on your head and you're trying to escape? Oh, but that's just too ironic for words\". Jill stopped her glaring momentarily to consider this strange revelation. A price on her head? As unfortunate as it was, she decided she'd have to postpone her escape long enough to hear the explanation owing on the topic.  \"Do explain\" she said with as much venom she could muster, then settled on the damp grass to hear the reply. Her hands up in front of her in a gesture of peace, Alice came and sat down beside her. \"In short, the Queen in her infinite wisdom has placed a bounty on your head. 'Dead or Alive' I believe she stated, although you technically can't be killed unless you are back in your own world, where ever that may be.\"<br>\r\n\"Dead or alive? That's just a little bit OTT, don't you think?\" Jill sighed sadly, wondering what the world was coming to. \"Maybe, but I don't think she minds if whoever catches you tries to kill you, since she's fond of torture. Finds it quite enjoyable, or so I'm told. Point is, don't you think you'd be safer locked away in a cell somewhere in my turf, rather than being hunted and chased all over Wonderland?\" Jill pondered this for a bit, turning the fresh scenario over in her mind, trying to find an angle that suited her best.<br>\r\n\"I don't have too much of a choice in this, do I?\" She asked, knowing what the answer would be. Confirming her suspicions, Alice nodded, and stood ready to escort Jill back to her new home. 'THAT was pointless then' Jill thought glumly, wondering what to do now. The future seemed so bleak, what with the whole 'kept like Alice's pet' thing, and all. Sighing deeply, her thoughts turned to Jack.<br>\r\n</span></div></div>",
            "created":1279256400,
            "id":918903,
            "title":"Who am I? Part One: I Beg to Differ"
        },
        "113":{
            "author_id":"pumpkinhead",
            "author_name":"A.S. Hendra [Job-Searching]",
            "choices":[
                "'There's still the Nightingale,' she said. 'Duh.'",
                "'There's still the Muffet girl,' she said. 'Duh.'",
                "'There's still the Old Oak,' she said. 'Duh.'"
            ],
            "content":"<div class=\"\"><div> <span>'Okay. Shall we go to the last place she was seen?'<br>\r\n<br>\r\nJack followed her to the woods, though reluctantly. His ears were still red after hearing her previous remark. Now that he thought about it, his question really, really sounded dumb. Of course! How could he forget that the Granny was in the middle of being digested? That was <i>really </i>embarrassing. He was the Sherlock, wasn't he? He shouldn't forget such important fact like that, let alone being lectured by the Watson. If his friends heard, his reputation as the smart guy would have ruined in a blink of an eye.<br>\r\n<br>\r\nBut he tried to hide those wicked thoughts in the back of his mind. Someone's life was in trouble here, and it wasn't the time to complain about who should be smarter here. He could still prove her that he was much smarter.<br>\r\n<br>\r\nJill suddenly stopped. 'Okay. Red's mother last saw her when she went to this wood with some breads and wine for the Grandma. Perhaps, if we can find other witnesses, we can locate where that girl is.'<br>\r\n<br>\r\n'Sounds great, sounds great,' he said. 'Except one thing: <i>who </i>should we talk to? We're in the middle of the forest! There's nobody here. How big is the chance there might be any witness she ever came here?'<br>\r\n<br>\r\nWell, at least it was her turn to make a dumb question. She wouldn't act so haughtily anymore.<br>\r\n<br>\r\nBut Jill just stared at him for a moment. 'There's still ....................,' she said. 'Duh.'</span></div></div>",
            "created":1305522000,
            "id":1106946,
            "title":"Go to the woods to look for clues"
        },
        "1133":{
            "choices":[
                "look for traces in the woods",
                "check the family's background"
            ],
            "content":"<div class=\"\"><div> <span>\"Isn't the Old Oak supposed to be dead?\", Jack asked, slightly irritated. \"I thought I remembered something about a last dream and a storm at Christmas...\"<br>\r\n\"You silly!\", Jill sighed. \"Do I have to tell you the ground rules of fairy tales all over again? Did you pay any attention in Detective School or not? Nobody really dies here, as long as the fairy tales go as planned. They just rewind and start all over again!\"<br>\r\n\"Oh...right!\" Jack couldn't think of any wittier remark to make. <br>\r\n<br>\r\nWhen they reached the Old Oak, that stood on a little hill at the outskirts of the forest, it was fast asleep. <br>\r\nJack cleared his throat. \"Mr. Oak! I'm Detective Crown, this is my colleague Jill Pail. We are investigating in the case of a missing 7 year old and would like to ask you a few questions.\"<br>\r\nThe oak tree rustled its leaves. \"What? Where? Who? I was just in the middle of the best dream ever! Why did you wake me up?\", it exclaimed.<br>\r\nJill took over: \"Have you seen a little girl around here? When she was last seen, she was wearing a red riding hood.\"<br>\r\n\"I haven't seen anyone, I was sleeping. Until you woke me up!\", said the oak, staring reproachful at Jack. <br>\r\n\"Well, thanks for your help anyway!\", said Jill and drew Jack away. <br>\r\n<br>\r\n\"What now?\", she asked as soon as they were out of earshot. <br>\r\n\"The oak doesn't have an alibi!\", Jack thought loudly. <br>\r\n\"Yes, but it can't move either. Where should it have hidden the girl?\" Jill rolled her eyes. <br>\r\n\"Good point!\", Jack answered, making sure to have the last word. \"Let's ...\"</span></div></div>",
            "created":1324789200,
            "id":1246375,
            "title":"The Old Oak"
        },
        "11331":{
            "author_id":"inky14dinky",
            "author_name":"Henny Penny ",
            "content":"<div class=\"\"><div> <span>Jack and Jill searched a long time and were just about to give up when Jill spotted a picnic basket full of goodies. Since they had been busy all morning looking for Red they had not had breakfast. They sat down on the ground and began to go through the basket. They found a note that said, \"I have her now and you will never find her.\" As they sat there they both became tired and drifted off to sleep.</span></div></div>",
            "created":1407042000,
            "id":1836839,
            "title":"look for traces in the woods"
        },
        "12":{
            "author_id":"shadystoat",
            "author_name":"Shady Stoat",
            "choices":[
                "1)\tGo into the sewers and ask the rat-catchers for news",
                "See what the Bard’s Guild can tell you",
                "3)\tUse Jack as bait. Dress him as the Piper and hope he gets kidnapped"
            ],
            "content":"<div class=\"\"><div> <span>“The Pied Piper,” announced Jill.<br>\r\n<br>\r\nJack stared at her. “Why?”<br>\r\n<br>\r\n“Think about it,” she answered, hands on hips. “If someone’s kidnapped the Pied Piper, they have the power to lure away every child in the area. Or summon plagues of rats. Who knows what else those pipes can do in the wrong hands? We have to go after him first!”<br>\r\n<br>\r\n“Hmm. You may have a point,” he conceded, reluctantly. “It’s just… well… the Pied Piper has always given me the creeps. The pale skin, the colourless eyes, that horrible patchwork costume of his – I just hoped for an easier first job, that’s all.”<br>\r\n<br>\r\n“Get used to it,” she answered, snappy as ever. “Now, how shall we try to find him?<br>\r\n<br>\r\nJack thought about it. “Let’s…”<br>\r\n</span></div></div>",
            "created":1154235600,
            "id":335964,
            "title":"Piper Dreams"
        },
        "121":{
            "choices":[
                "Find another rat-catcher",
                "Ditch the sewers and find somewhere else to look"
            ],
            "content":"<div class=\"\"><div> <span>\"Come on sir, you must know something about him!\" Jill whined to the rat-catcher.<br>\r\n<br>\r\nHe glared at her. \"We rat-catchers don't pay no 'tention to the Pied Piper! He put us outta bus'ness plenny o' times! We ain't carin' less!\"<br>\r\n<br>\r\nJack leaned forward, and grabbed the filthy looking man by the throat. \"You'll tell us what you last heard about the Pied Piper, or you can say buh-bye to your sewers right now.\" he said, acid in his voice.<br>\r\n<br>\r\n\"Really man?\" asked the rat-catcher, eagerly, either not noticing, or pretending not to notice Jack's voice and the grip on his neck. \"You'll gimme me a new job? Now that rightly kind o' ya, but methinks this sewer is a good 'nuff fo' me.\"<br>\r\n<br>\r\nJack glared at the rat-catcher, noticing the stinging sarcasm.<br>\r\n<br>\r\nJack sighed, then said, \"Lets-</span></div></div>",
            "created":1154235600,
            "id":336018,
            "title":"Dumb Rat-Catcher"
        },
        "1212":{
            "author_id":"homebrewer",
            "author_name":"Homebrewer",
            "choices":[
                "Later the same week, when Hans arrives in Jack and Jill's interrogation room",
                "Jill thinks this is a red herring, and they should investigate another character"
            ],
            "content":"<div class=\"\"><div> <span>“We need to think about the elements of the Pied Piper’s previous career,” Jack said authoritatively.  “What do we know about his back-story?”<br>\r\n<br>\r\nJill considered this question for a minute.  “We know he has a love of money.  And that he can hold a grudge.  Oh, that he carries out most his work in Germany.”<br>\r\n<br>\r\n“Now we are getting somewhere,” Jack chipped in.  “Wasn’t there a little lame boy that figured?”<br>\r\n<br>\r\n“Yes.  Hans Galler.  He is now grown up, and he’s lonely.  There is no-one in his village of his age.  He might hold the key.”<br>\r\n<br>\r\n“What are we waiting for?  Bring him in for questioning,” ordered Jack.  Jill didn’t like this new found bossiness Jack was beginning to display.<br>\r\n<br>\r\n“Jack, he is in Germany.  And why would other characters go missing?”<br>\r\n<br>\r\n“You can never tell with these loner sorts.  He has probably spent a lifetime of resentment at not being included.  And what are fairy tales about if not inclusion?  Extradite him now.”</span></div></div>",
            "created":1185339600,
            "id":429006,
            "title":"Reviewing the Pied Piper story"
        },
        "122":{
            "choices":[
                "Jack and Jill decide to find the wolf that's \"chasing\" the woodsman",
                "Jack and Jill"
            ],
            "content":"<div class=\"\"><div> <span>Jack and Jill had to go through the woods to find the Bards Guild Headquarters.<br>\r\n<br>\r\nWhile going along the path, they thought they heard something...<br>\r\n<br>\r\n\"What's that?\" demanded Jack.<br>\r\n<br>\r\nThe sound came again. It was the rustling of leaves and very loud breaths, as if someone was out-of-breath.<br>\r\n<br>\r\nFinally, the woods openned up too a large man in coveralls.<br>\r\n<br>\r\n\"You gotta help me!\" he screamed like a girl. \"The BBW\" (Big Bad Wolf) \"is coming after me!\"<br>\r\n<br>\r\nJack and Jill said nothing, but stared at the woodsman in disbelief. Things were getting bad, fast.</span></div></div>",
            "created":1154235600,
            "id":336021,
            "title":"Scaredy Cat Woodsman"
        },
        "123":{
            "choices":[
                "Go to the general store in town to buy a pipe",
                "Go to the Wicked Witch of the West (of town) and see if she has a pipe"
            ],
            "content":"<div class=\"\"><div> <span>Jack scowled horribly at Jill.<br>\r\n<br>\r\n\"You know Jack, pipers tend to smile more.\"<br>\r\n<br>\r\n\"I'm not a piper.\"<br>\r\n<br>\r\n\"Now you are!\" answered Jill with a florish, coming back to admire the finished costume. Well, almost finished.<br>\r\n<br>\r\n\"We need a pipe.\" she said.<br>\r\n<br>\r\n\"You didn't think of that?!\" asked Jack with anger. He was close to the breaking point now.<br>\r\n<br>\r\n\"I'm getting to it.\" answered Jill with annoyance. \"Do you know if the Pied Piper's pipe looks special in any way to make it special?\"<br>\r\n<br>\r\n\"Huh?\"<br>\r\n<br>\r\n\"Nevermind. We're just going to have to get a pipe.\"</span></div></div>",
            "created":1154235600,
            "id":336008,
            "title":"Dressing up Jack"
        },
        "1231":{
            "choices":[
                "Jack and Jill decide to find another pipe",
                "Jill decides to go looking for Red."
            ],
            "content":"<div class=\"\"><div> <span>While walking to the store, they drew many glances with the strange costume.<br>\r\n<br>\r\n<i>Great,</i> thought Jack, <i>Now everyone's gonna make fun of me forever.</i><br>\r\n<br>\r\nThe two walked into the general store, and went to the counter.<br>\r\n<br>\r\n\"Do you have a pipe here?\" asked Jill shamelessly. Jack on the other hand, was turning a bright shade of pink.<br>\r\n<br>\r\n\"We only have one left, and it's for my son. I'm sorry.\" answered the clerk, who didn't sound very sorry at all.<br>\r\n<br>\r\n\"This is an emergency...\" then at the last moment, she added, \"sir.\" and all the time trying not to snap at the man, though failing miserably.<br>\r\n<br>\r\nThe clerk looked at Jill funny. \"How dare you tell me I <i>have</i> to sell something I don't want to! Or are you going to just steal it? I have a good mind to call the police.\"<br>\r\n<br>\r\n\"Good mind, but bad idea.\" shot Jill. \"We'll pay for it, but we need it. I'm a detective, and this...\" she looked at Jack. <i>We don't want to spill the beans</i> she thought, <i> even to this simple store clerk</i>. \"This is a friend of mine. He's a piper and his pipe broke. If he doesn't get one soon, then he'll die of starvation. It's his only means of support!\"<br>\r\n<br>\r\nShe instantly felt sorry for the lie, but she vowed silently to tell the store clerk the truth eventually.<br>\r\n<br>\r\nThe store clerk thought a moment. \"I'll make a deal with you folks. I'll give up the pipe for <i>free</i>, if you'll do a favor for me.\"<br>\r\n<br>\r\n\"What's that?\" asked Jill.<br>\r\n<br>\r\n\"If you're a dectective like you say you are, then maybe you'll find out where Red is. Little Red Riding Hood. I don't care for the girl much, but she's my best customer. Help find her, and the pipe is yours.\"</span></div></div>",
            "created":1154235600,
            "id":336015,
            "title":"Arguing with the Clerk"
        },
        "12311":{
            "choices":[
                "they went into town to get directions",
                "they followed their insticts"
            ],
            "content":"<div class=\"\"><div> <span>Jill wasn't quite sure what to do and she knew if she asked Jack he'd just go along with finding Little red instead. She stood and thought for a moment, it was a tough decission. Because bothe Little Red and Tom were on the list.<br>\r\nThen she came to the decission that she will continue to look for Tom then Little Red. She told the clerk exactly that and then she and Jack were off. They had to go somewhere else and find a pipe.<br>\r\nThe two walked around town for a bit so Jill could think while poor Jack was being laughed at. Then it hit her like a brick! All they have to do is go to Tom's house and ask his dad who's also a piper to borrow his pipe! Jill couldn't believe she didn't think of this before. She went and got Jack out from the laughing crowd and they began their way to the piper's house.<br>\r\nOn their way out of town Jack asked Jill, \"Do you even know where the kid lives?\" Jill stopped in her tracks, she gave Jack \"the look\". Because he was right, she didn't know where he lived. So the two stood and thought of what they should do.</span></div></div>",
            "created":1187586000,
            "id":437433,
            "title":"Finding A Pipe"
        },
        "1232":{
            "author_id":"sweetp7680",
            "author_name":"B. Olson",
            "choices":[
                "Stay at the table and drink the tea",
                "Refuse the tea and keep asking for help"
            ],
            "content":"<div class=\"\"><div> <span>\"Come in, come in.\"  The witch motioned to Jack and Jill, holding the door open to her wooden cottage.  \"I have been expecting you.\"<br>\r\n<br>\r\nJill looked at Jack and shrugged. \"We have come here for help in...\"<br>\r\n<br>\r\n\"In finding The Piper.\" The witch blurted in.<br>\r\n<br>\r\n\"Yes.\" Jill pulled out her small notebook from her shirt pocket and flipped it open. <br>\r\n<br>\r\n\"Have a seat. I was just finishing up some hot tea.\"  The witch pointed to the table. Jack pulled out his chair and motioned for Jill to do the same.<br>\r\n<br>\r\n\"Jill and I were wondering if you by chance...\"<br>\r\n<br>\r\n\"Had a pipe?\" The witch turned to the table with the teapot in hand and a smile on her face.<br>\r\n<br>\r\n\"Uh, yes.\" Jack paused out of bewilderment.  He watched as the witch slowly poured the hot tea into the three cups that were positioned directly in front of them.<br>\r\n<br>\r\n\"What we really want to know,\" Jill began, \"is if we could...\"<br>\r\n<br>\r\n\"Have the pipe to be able to find The Piper.\" The witch nudged the cup of steaming tea toward Jill.<br>\r\n<br>\r\n\"Okay, you really have to stop that.  Can you help us, or not?\"  Jill slapped her notebook onto the table.  The witch pulled her chair from the table and joined the two detectives.<br>\r\n<br>\r\n\"Why of course I can, darlings.  First, why don't you drink this delicious tea that I have made? Your mouths must be awfully dry from the travel.\"</span></div></div>",
            "created":1185426000,
            "id":429447,
            "title":"Tea With the Witch"
        },
        "12321":{
            "author_id":"nightreach",
            "author_name":"Nightreach",
            "choices":[
                "Shake the chains in an attempt to get free.",
                "Just sit and wait for whoever was bound to come."
            ],
            "content":"<div class=\"\"><div> <span>        Without even thinking, Jack and Jill sipped their tea with gusto. The witch leaned closered and smiled, her horrible, rotting teeth even more viewable. <br>\r\n<br>\r\n        \"Thats it... Go on, drink some more...\"<br>\r\n<br>\r\n        By the time Jack realized that something about this situation just wasn't right, he was already slipping into a stupor. The last thing he saw before going unconscious was the witch's ugly face leaning over him, her great worty nose obscuring almost all of his vision. <br>\r\n<br>\r\n        \"Thought I might get the bounty on you fairy tale types. Didn't think I'd notice you had your own story once? I see everything you fools!\" <br>\r\n<br>\r\n         And with that, she let out her resounding evil cackle, the ever so annoying type. Jack would have been glad he was unconscious.<br>\r\n<br>\r\n         *******<br>\r\n<br>\r\n       Jack awoke slowly, feeling hard manacles around his wrists and a hard, cold floor beneath his feet. Apparently he was chained to a wall. Groggily, he opened his eyes and willed himself to see. Slowly, the details of his predicament came into view. He was in a small, dirty tower with small bits of disgusting cloth and straw littering the floor. Rats scurried to and fro, oblivious to the what they were wallowing in, squeaking out information to their brethren.  <br>\r\n     <br>\r\n      Finally, his vision cleared completely and he was able to make out the blurry form chained across the room from him.<br>\r\n<br>\r\n       \"Jill! What happened? Where are we?\"<br>\r\n<br>\r\n      No answer. Apparently she was still knocked out from the witch's unholy brew. In frustration, he rattled his chains and angrily sighed. It looked like they were stuck here... <br>\r\n<br>\r\n      Then Jack noticed the effect his shaking had on the chains. They were a great deal looser. He looked up, to where they were planted in the wall and noticed the old, crumbling stone around the emplacements. It didn't look very stable and he was sure with a few good shakes, they would come right off...  </span></div></div>",
            "created":1187326800,
            "id":436464,
            "title":"Betrayal"
        },
        "123211":{
            "author_id":"brielleskye",
            "author_name":"December Breeze",
            "choices":[
                "Go back to the witch's cabin and investigate",
                "Forget the witch (she's evil anyway) and investigate another character"
            ],
            "content":"<div class=\"\"><div> <span>Jack shook the chains again, pulling and tuggging frantically until the old stone crumbled and he was free. He jumped up and rushed to Jill's aid. After unbounding her, he shook her awake. \"What's going on?\" she asked, still blinking away the unconsciousness. <br>\r\n<br>\r\nJack pulled her to her feet. \"The witch poisoned and kidnapped us!\" he announced.<br>\r\n<br>\r\n\"SHE's the one that's been abducting the other characters!\" Jill concluded.<br>\r\n<br>\r\n\"Exactly! But we've escaped! Now, let's find a way out of here so we can report the witch to the authorities.\"<br>\r\n<br>\r\nJack broke down the old, wooden door and led Jill down the long, dark halls until they found their freedom. Only once outside, they didn't know where to go. <br>\r\n<br>\r\n\"Let's just go straight through the woods until we come off on the other side,\" Jill suggested. So they walked through the woods for what seemed like hours before finally reaching the town on the other side.<br>\r\n<br>\r\nThey headed straight to the Fairytale Land Police Station to report what they've learned. After informing the police of the witch's evil deeds, the sheriff shook his head.<br>\r\n<br>\r\n\"I'm sorry kids, but it wasn't the witch who kidnapped you. Or at least, she isn't the once who kidnapped the other characters.\"<br>\r\n<br>\r\nBewildered, Jill cried, \"How do you know?\"<br>\r\n<br>\r\n\"Because,\" the sherriff replied. \"The mirror on the wall was just in here this morning to report that the witch, herself, has been abducted!\"<br>\r\n<br>\r\n\"The witch?\" Jack demanded. \"But-\"<br>\r\n <br>\r\n\"She's a fairytale character, too, afterall,\" the Sheriff pointed out.<br>\r\n<br>\r\nNow more confused than ever, Jack turned to Jill and asked, \"Now what?\"</span></div></div>",
            "created":1190437200,
            "id":446603,
            "title":"The Great Escape"
        },
        "123212":{
            "author_id":"jonnyprophet",
            "author_name":"Jonny Prophet",
            "choices":[
                "Make an attempt to kick at the Rats... ",
                "Whistle a piper's tune and hope for the best..."
            ],
            "content":"<div class=\"\"><div> <span>Jack shook his wrist some more and the stone crumbled, dropping crumbs of mason work onto the top of his faux piper's hat. With the sudden realization that when that stone did break free it would land squarely on top of his head, he quickly gave up on the notion of knocking himself unconcious and decided to trust in faith. Maybe it wouldn't be the vile witch that returned but instead a possible ally. <br>\r\n<br>\r\nThe waiting went on some time and he hooed, hummed and hollered for Jill to wake up, but to no avail. \"Will we ever get out of here?\" he asked himself from his classic dank dungoun bondage. <br>\r\n<br>\r\nThat's when it occured to him. \"Strike the Light!\" He actually said outloud. \"Rats! For one, if they can get into and out of this dungoun, maybe there is some way that they can help and two, who would have a better lead on the Pied Piper himself than them?\"<br>\r\n<br>\r\nCalling down to that rats, Jack tried to get them to take some notice of him in his shackles. His foot, although chained, was close enough to try to kick at them, but what kind of response would that return?<br>\r\n<br>\r\nMaybe his could use the piper's trick, but without a pipe, he was left with just his own whistle and Jack doubted that this would work any better than the kicking, but he had to give it a shot. <br>\r\n<br>\r\n </span></div></div>",
            "created":1188450000,
            "id":440749,
            "title":"Rats!"
        },
        "1232122":{
            "author_id":"jonnyprophet",
            "author_name":"Jonny Prophet",
            "choices":[
                "Play the Pied Piper's pipe.",
                "Talk to the rats."
            ],
            "content":"<div class=\"\"><div> <span>Jack puckered up and did his best to whistle a sweet tune that any rat would love. Unfortunitely, something went wrong. All that ended up happening was a dry, cracked, sickening tweet-twee-spittle-flub-flibb-et. Jack realized this might not work. <br>\r\n<br>\r\nOddly enough, the rats realized that it wouldn't work at exactly the same time. Well, you see, they had heard the Tweet-twee-spit... well, you get the point. <br>\r\n<br>\r\nTo Jack's surprise, the rats, which had been scurrying at random around the floor all began to huddle together in some sort of odd rodent conference. On occation, they would look up at him but whatever they was discussing was lost on  big bald monkey chained to the wall. <br>\r\n<br>\r\n\"What was that awful noise?\" It was Jill!  She had finally woken up. \"Oh, that was me whistling. I think the rats are up to something. Look.\" <br>\r\n<br>\r\nThe two of them looked down just in time to see all six rats quickly run out the same crack in the wall. \"Hmm.\" Hmmed Jill. \"Not a good sign.\" But before two minutes went by, the six rats returned carrying something. Taking it over to Jack they rolled it within arm's reach. It was a Pipe, and from the look of it, the pipe of the Pied Piper!<br>\r\n<br>\r\nJack had two choices... he could either play the pipe or else question the rats as to where they got it.</span></div></div>",
            "created":1188968400,
            "id":442352,
            "title":"Bad Whistle"
        },
        "12322":{
            "author_id":"genius0312",
            "author_name":"cerial",
            "choices":[
                "Jack thinks the witch is lying about the pipe",
                "Jack agrees"
            ],
            "content":"<div class=\"\"><div> <span>\"No thanks.\" Jill says looking at Jack before continuing\"We just need the pipe\"<br>\r\nThe witch looks at Jill then smiles \"I will lend the pipe to you Jack....on one condition.\"<br>\r\n\"And what is that? Jack says while looking at a concerned Jill.<br>\r\n\"That your little friend stay here with me while the pipe is being used\"The witch says while licking her lips<br>\r\nJill quickly protest\"Jack, No we will find another...\"<br>\r\n\"No you won't,that is the last working pipe within 1000 miles.\"The witch interrupts.\"All that I ask is that it be returned when you find the piper.\" It only seems fair that you give me something of great importance as collateral as the pipe is of great value.\"The witch says in a low tone.</span></div></div>",
            "created":1226120400,
            "id":605498,
            "title":"Refuse the tea and keep asking for help"
        },
        "123222":{
            "author_id":"genius0312",
            "author_name":"cerial",
            "choices":[
                "Jack eager to try out the pipe",
                "Jill who is concerned about the witches intentions"
            ],
            "content":"<div class=\"\"><div> <span>Jack walks over to the pipe and picks it up. He places the pipe to his lips and blows. Surprisingly no sound comes out. Jack looks back at the witch.<br>\r\n\"Oh that. Well like I said that is the only working pipe.\" The witch walks over to a shelf and grabs a bottle then hands it to Jack.\"This is what makes the Pipers tune so alluring.\" The Witch says with a smile.\"It is really quite simple. Just open the bottle and say what you would want the pipe to bring to you.\" Pour the potion down the pipe and the pipe will do the rest. It will only work for a few hours though so use it in moderation.\"<br>\r\n\"What a crock.\" Jill says aloud accidentally<br>\r\n\"I assure you young lady it does work. \"It was the reason why the piper is so successful.\"The witch responds.<br>\r\nJack looks at the pipe and the potion then puts both into his pocket.<br>\r\n\"I won't be long Jill\"Jack says while walking out.<br>\r\nContinue the story with</span></div></div>",
            "created":1226120400,
            "id":605506,
            "title":"Jack agrees"
        },
        "1232221":{
            "author_id":"genius0312",
            "author_name":"cerial",
            "choices":[
                "Something bumps into him",
                "He is attacked"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jack walks down the street and between to buildings. He pours the potion down the pipe and is about to say something when...</span></div></span></div>",
            "created":1226206800,
            "id":605756,
            "title":"Jack eager to try out the pipe"
        },
        "12322211":{
            "author_id":"genius0312",
            "author_name":"cerial",
            "choices":[
                "A wave of mice carrying Tom through the streets",
                "A wave of mice running through the streets without Tom"
            ],
            "content":"<div class=\"\"><div> <span>\"Eeeekk\"<br>\r\nJack hears a high pitched scream and looks down.<br>\r\nThere is a little mouse next to his foot wearing very thick glasses. Is hitting Jacks foot with his cane frantically.<br>\r\n\"Get off of her get off of her!\"The mouse screams<br>\r\nJack looks down and notices a tail emerging under his shoe then quickly takes a few steps back.<br>\r\n\"You idiot!\"Jack hears the female mouse say while getting back onto her paws. Lucky for you the ground was soft or......<br>\r\n\"I'm so sorry I was just so eager to try out the pipe and find the piper that I didn't look\"Jack says while noticing the two mice seem to be blind.<br>\r\n\"Hey aren't there three of of you\" jack says without thinking.<br>\r\n\"Yes.\"The female mouse says while rolling her eyes.<br>\r\n\"Our friend went with the other mice to...Hey, didn't you say you were looking for the Piper?\"The male mouse says.<br>\r\nThere is a cluster of cynical laughing between them.<br>\r\n\"Did you hear that? He is looking for the piper.\" The female mouse says while looking around for her Companion.<br>\r\n\"Yes, Do you know where He is?\" Jack asked eagerly.<br>\r\n\"Well, he is with our friend and the other mice of the country\" They should be about to deliberate by now.\"<br>\r\n\"Is there a trial of some kind? Jack thinking of the courts in the area.<br>\r\n\"Um, yea The Pipers\" the female mouse says before walking into a wall.<br>\r\n\"What is he being charged with?\"Jack says without thinking.<br>\r\nThe female mouse gets to her feet and whips around.<br>\r\n\"Why murder of course. \"Over 1 billion counts.\" the female mouse said.<br>\r\n\"That Piper lead all the mice and rats into the lake while still playing his pipe.\" And mice and rats are not very good swimmers.\"the male mouse exclaimed.<br>\r\n\"My wife is a member of the massive uprising against the Piper.\"The Male mouse says proudly.<br>\r\n\"Why aren't you two there.\" Jack asks.<br>\r\n\"Oh, because what will happen to the piper is just to graphic a sight for us.\"<br>\r\n\"It was just a shame that that little Tom had to be involved.\"The female mouse says looking at her companion.<br>\r\n\"You know where Tom Thumb is.\" Jack says hoping the answer is better then the Pipers.<br>\r\n\"Oh he is fine. But something had to be done to lure the Piper out of hiding.\" You see those Pipers like to stick together. We knew he would come looking for young Tom.\"<br>\r\n\"Tom should be back any Minute.....\" There is a loud scream from a woman a few houses down.<br>\r\n\"Here Tom comes now\" The Male mouse says.<br>\r\nJack walks back onto the road and sees</span></div></div>",
            "created":1226206800,
            "id":605774,
            "title":"Crunch!!!"
        },
        "123222111":{
            "author_id":"genius0312",
            "author_name":"cerial",
            "choices":[
                "Goes back To the witch to tell Jill",
                "Brings Tom home"
            ],
            "content":"<div class=\"\"><div> <span>Jack notices Tom being carried by the wave of Mice as they tear apart the street. He leans out and snatches tom of into his hand.The goes back to the alley with the two Mice.<br>\r\n\"What is the big idea?\"Tom says while Jack sets him down.<br>\r\nJack can't think and before he can say anything..<br>\r\n\"It was Great!\" A grey female mouse says while walking into the alley.<br>\r\n\"What happened?\" Oh it went just like it was planned.<br>\r\n\"And of The Piper?\"Jack Asks<br>\r\n\"Who?\"The grey mouse says with a grin.<br>\r\n\"Oh..., The Piper well he is in the lake.\"The grey mouse gleefully responds.<br>\r\nA wave of relief runs over Jacks face. That soon turns white when he hears.<br>\r\n\"Well... What's left of him is in the lake\" The grey mouse says before the three mice break out into laughter.<br>\r\nJack pulls out his pad and scratches off The Piper then...</span></div></div>",
            "created":1226206800,
            "id":605783,
            "title":"A wave of mice carrying Tom through the streets"
        },
        "13":{
            "author_id":"smeedyer",
            "author_name":"Smee",
            "choices":[
                "The General Store (imported and expensive)",
                "The bottom of the garden (maybe some fairies lingering around there)",
                "The town Wishing Well (it might work, and a silver Dollar is very cheap)",
                "The Wicked Witch of the West (of town)"
            ],
            "content":"<div class=\"\"><div> <span>With a loud sigh, Jack looked up at his partner.<br>\r\n<br>\r\n\"We might as well start at the top, which is...Peter Pan.\"<br>\r\n<br>\r\n\"Oh great, and how are we supposed to get to Never Never Land then? Fairy dust doesn't just grow on trees you know.\" Jill didn't even attempt to mask the sarcasm. \"We can't afford to waste all our savings on it.\"<br>\r\n<br>\r\nJack held up his hands to stave off any further admonishments.<br>\r\n<br>\r\n\"We've got to start somewhere, and I have a plan. If we rescue Peter then Tinkerbell is sure to reward us with as much fairy dust as we can carry, along with the 'eternal gratitude' of course.\"<br>\r\n<br>\r\nJill was still frowning, but didn't say anything. Jack took it as a good sign and continued.<br>\r\n<br>\r\n\"We can then sell the extra and we'll have even more savings to continue with the rest of this huge list.\" He casually flicked through the scroll to demonstrate his point.<br>\r\n<br>\r\n\"The only question that remains is, where to get the fairy dust from?\"<br>\r\n</span></div></div>",
            "created":1154235600,
            "id":335781,
            "title":"Peter Pan"
        },
        "131":{
            "choices":[
                "Jack and Jill ditch wendy and go to the Wicked Witch for FD",
                "Wendy helps Jack and Jill find FD"
            ],
            "content":"<div class=\"\"><div> <span>They walked into the general store.<br>\r\n<br>\r\nJack stared around the store looking for fairy dust, while Jill went straight to the clerk.<br>\r\n<br>\r\n\"We need some fairy dust, sir.\"<br>\r\n<br>\r\n\"We're out.\"<br>\r\n<br>\r\n\"What?\" asked Jill, shocked. \"What do you mean by that? We <i>need</i> some, it's important.\"<br>\r\n<br>\r\nThe clerk rolled his eyes. \"WE ARE OUT.\" he almost yelled. \"Do I have to spell it out to ya? Look, everyone wants to fly, and we only get so much.\"<br>\r\n<br>\r\nJust as they were about to strange the clerk for being a jerk, the door slammed open.<br>\r\n<br>\r\n\"I need fairy dust, now!\"<br>\r\n<br>\r\nThe clerk rolled his eyes. \"We don't have any, miss.\"<br>\r\n<br>\r\nJack and Jill turned around and looked at the new arrival.<br>\r\n<br>\r\n\"Wendy?\" asked Jilll in surprise.</span></div></div>",
            "created":1154322000,
            "id":336200,
            "title":"FD (or, fairy dust)"
        },
        "1312":{
            "choices":[
                "To the Wishing Well!",
                "Wendy says to go somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah, it's Wendy. And who are you?\"<br>\r\n<br>\r\n\"I'm Jack Crown.\"<br>\r\n<br>\r\n\"I'm Jill Pail.\"<br>\r\n<br>\r\n\"Glad for ya both. I gotta get to Neverland, now!\" snapped Wendy. She turned torward the clerk. \"I need some fairy dust. Give it to me now, or else.\"<br>\r\n<br>\r\nThe clerk seemed totally un-alarmed. \"We don't have any little girl.\"<br>\r\n<br>\r\nWendy glared at him. <br>\r\n<br>\r\n\"Look, we need to get to neverland as well\" said Jill. \"you might as well come with us. We're going to the wishing well.\"<br>\r\n<br>\r\n\"We are?\" asked Jack.<br>\r\n<br>\r\n\"Yup.\" said Jill</span></div></div>",
            "created":1154322000,
            "id":336219,
            "title":"Wendy"
        },
        "13122":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Follow Wendy to the Witch",
                "Ditch Wendy for the Genie"
            ],
            "content":"<div class=\"\"><div> <span>\"No! We should go to the Wicked Witch of the West (of town).\"<br>\r\n<br>\r\n\"I don't know she's kind of underhanded. I wouldn't feel safe dealing with her.\" said trying to nudge Jack out the door.<br>\r\n<br>\r\n\"Now now Jill, Wendy might be right. And she's connected to Peter so she might know his last whereabouts a nd so on.\" said Jack, refusing to budge.<br>\r\n<br>\r\n\"What do ya say?\"<br>\r\n<br>\r\nWendy interrupted them.<br>\r\n<br>\r\n\"Look I don't know about you, but I'm going to see the witch.\"</span></div></div>",
            "created":1154494800,
            "id":336889,
            "title":"Wendy's taking another route."
        },
        "132":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "They meet with the Fairy Queen.",
                "Something is going on at the Weeping Willow."
            ],
            "content":"<div class=\"\"><div> <span>\"We're gonna have to head into the garden,\" Jack said, leaning back and looking disturbed.  \"We'll need to talk to the Fairy Queen there and see if she'll give us some.\" <br>\r\n<br>\r\nJill looked unamused. \"The Fairy Queen?  Jack, she is the most tempermental creature I've ever known.  Why would she give us fairy dust?\" <br>\r\n<br>\r\nJack shrugged.  \"She likes me.\"  He stood up and gathered his files into a briefcase before heading outside.  The garden was fifty paces forward, three paces to the left, a hop to the front, a skip to the side, twirl three times and you'll be there.  Everyone knew the directions.  It was just a matter of knowing where to start.  And Jack was just so lucky to know that if you wanted to reach the fairy garden, you have to start at the old Weeping Willow. <br>\r\n<br>\r\nJill scoffed and followed after Jack as he headed down the street towards the Weeping Willow.  \"Jack, the last time you met with the Fairy Queen, she pricked your finger with a thorn and you had to wear a bandage for a week!\" Jill protested.  \"This is not a good idea.\" <br>\r\n<br>\r\n\"There's no where else to go,\" Jack said, strong in his resolve.  \"Besides, that's how she shows affection.\" <br>\r\n<br>\r\n\"Then God help any of her good friends,\" Jilly muttered.  <br>\r\n<br>\r\n\"What was that?\" Jack called back to her. <br>\r\n<br>\r\nShe rolled her eyes.  \"Nothing.\" </span></div></div>",
            "created":1155186000,
            "id":338583,
            "title":"To the Fairy Queen"
        },
        "1321":{
            "author_id":"spidergirl",
            "author_name":"spidey",
            "choices":[
                "the Fairy Queen gives them fairy dust",
                "the Fairy Queen refuses to help them.",
                "Jill does something unexpected."
            ],
            "content":"<div class=\"\"><div> <span>\"Jaaaack,\" the Fairy Queen called out pleasantly, while her subjects watched the intruders curiously, their pixie eyes wandering over the strange humans.<br>\r\n<br>\r\nRaising his head from respectful bow, Jack flashed the queen his most charming smile.<br>\r\n<br>\r\nHer royal highness sat upon a beautiful throne made of the most rare and delicate flower petals from the garden around them. A crown made from the stem of a daisy was propped gingerly on top of the queen's white hair. <br>\r\n<br>\r\n\"And who are you?\" the Fairy Queen asked rather abruptly, barely glancing in the direction of Jack's companion.<br>\r\n<br>\r\n\"Oh, she's nobody,\" Jack said quickly and continued before Jill could interrupt, \"Listen, your highness, we need some fairy dust. It's rather urgent, you see.\"<br>\r\n<br>\r\nJack explained briefly their quest to find Peter Pan, but at the mention of Neverland, the queen turned up her nose in defiance.<br>\r\n<br>\r\nIt seemed there was a rivalry between the Fairy Queen and Peter's companion, Tinkerbell.<br>\r\n<br>\r\nWill the queen help them despite her jealousy?</span></div></div>",
            "created":1193029200,
            "id":455810,
            "title":"Fairy Rivalry"
        },
        "13211":{
            "author_id":"genius0312",
            "author_name":"cerial",
            "choices":[
                "Take the dust and go",
                "Ask if Peter knows what Tinkerbell done"
            ],
            "content":"<div class=\"\"><div> <span>\"So she finally did it, huh?\" The fairy Queen said confidently. \"I told him some day that crazy little so and so would stab him in the back. \"But, he wouldn't listen!\" Peter was always blinded by her....\"<br>\r\nJill interrupted\"You think Tinkerbell had something to do with Peter's Disappearance?\"<br>\r\nThe Fairy Queen rolls her eyes and then addresses Jack\"Your friend isn't to bright is she?\" Jill is about to say something then Jack gives her a scorned look.<br>\r\nThere is a pause then the Fairy Queen continues \"You see Tinker has a big problem with other fairies doing anything with Peter.\" I have heard stories about fairies who have come up missing after getting some attention from Peter.\"<br>\r\n\"So, why would she..\"Jill cautiously says leaving a gap in speech for the Queen.<br>\r\n\"Don't you see? She want's him all to herself!\"The Fairy Queen says in a aggravated tone before settling down.<br>\r\n\"A few years ago Peter was brought to me in bad condition\" My subjects were able to nurse him back to moderate condition.\" A few days later Tinkerbell showed up and demanded that we release him.\" I tried to explain that Peter was in no condition to leave.\" But, Tinkerbell would have nothing to do with it.\" The Fairy Queen looks down at the ground.<br>\r\n\"She went berserk, and injured many fairies in the process. And she through me into a Giant Venus fly trap, before taking off with Peter. Luckily a few of my subjects were able to quickly save me before....I was.... Like the others......\"The Fairy queens face becomes red with rage.\"If you catch that little so and so you bring her to me first!\"<br>\r\nThe Fairy Queen Points to a mound of leaves then says\"Over there is enough to go to never land and back a couple of times with plenty left over. Take it, and bring me that little wench and I will reward you greatly.\"<br>\r\nYou...<br>\r\n</span></div></div>",
            "created":1226120400,
            "id":605489,
            "title":"Tink's History"
        },
        "132112":{
            "author_id":"kiddo11290",
            "author_name":"Jason Clayton",
            "choices":[
                "\"The Muffin Man! Come on, what kind of question is that?!\"",
                "\"Lounge.\""
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n\"Does Peter know how Tinkerbell reacted when she arrived?\" Jill asked cautiously. When Jack gave her a look (which she could sum up in a four-letter word), she spurted, \"I'm so sorry, but we need to know. For the investigation.\"<br>\r\n<br>\r\nHer Majesty seemed peeved, but nodded to concede. \"We did not give him the full details, but he seemed cognizant of her anger. Seems she tried to have an innocent girl shot down by pirates and even Peter's own Lost Boys.\" A thought seemed to have occurred to her and she lost a bit of her anger. \"They will probably have seen him last.\"<br>\r\n<br>\r\n\"When did <i>you</i> see him last?\" Jack asked.<br>\r\n<br>\r\n\"A few months ago. The poor boy looked frazzled. He has that job, you know, escorting the souls of murdered children on their way to the next world, and it seemed to be taking a toll on him.\"<br>\r\n<br>\r\n\"Escorting the souls of murdered children?\" Jill asked, more to herself than anyone else.<br>\r\n<br>\r\n\"It's not that he minds. He's got a good heart, that boy. He wants children to be lost on their terms, not someone elses. Does that make any sense?\"<br>\r\n<br>\r\n\"Well, considering the source, yes.\" Jack said. \"Did he say anything specific?\"<br>\r\n<br>\r\n\"No. He'd just had a few rough nights that week. Or so he said. My Court Magician thinks he was suffering from dehydration and insomnia due to the side effects of a type of Lover's Draft.\"<br>\r\n<br>\r\n\"A love potion?\" Jill asked, again more to herself.<br>\r\n<br>\r\n\"Well, why <i>else</i> would he let that little so-and-so stick around so long?\" The Queen snapped.<br>\r\n<br>\r\n\"Thank you, Your Majesty.\" Jack bowed and flashed her his best grin. \"We are greatly in debted to you.\"<br>\r\n<br>\r\nJill bowed. \"Yes, thank you very much.\"<br>\r\n<br>\r\nThey gathered the dust into a silk bag the Queen's courtesean brought them and left the garden.<br>\r\n<br>\r\n\"A love potion?\" Jill said. \"What do you think of that?\"<br>\r\n<br>\r\n\"I think she's been drugging him to get him to stay with her.\"<br>\r\n<br>\r\n\"But she can't possibly hope to have a relationship with a prepubescent boy!\"<br>\r\n<br>\r\nJack stopped on the street and gave her a hard look. \"Yeah. A fairy is slipping a human love potions and age is the problem? You are a strange individual.\"<br>\r\n<br>\r\nJill scoffed. \"Okay, for one thing, who said Pan was even human? And for another, if she's slipping him love potions, what else would she be after?\"<br>\r\n<br>\r\n\"Well, she'd be crazy to attempt a romantic relationship,\" Jack began. They continued walking back to their office. \"And she surely knows that. So she's probably tweaking the potion. Lover's Draft isn't a potion for true love, it's for infatuation. It wouldn't be that hard, especially for a someone who specializes in brewery and herbs, to tweak the potion so that it will cause an intense longing for the brewer's presence, but with no romance in it at all.\"<br>\r\n<br>\r\nJill considered this for a moment. \"What do we know about Tinkerbell?\"<br>\r\n<br>\r\nThey headed to the police station on Drury Lane. At this hour, just before dusk, the street didn't have much traffic. The usual steady flow in and out of the Muffin Man's shop was about all. They took the back door into the basement and drudged around for Tinkerbell's file.<br>\r\n<br>\r\n\"Here it is!\" Jack pulled out a bright purple folder with yellow glitter. \"Let's see. Birthname: Amalthea Tinkerbell of Dragon's Wort, full title: the Right and Honorable Lady Amalthea Tinkerbell Tarragon, Duchess Tarragon Second-Descending. Father is the Honorable Bromios Redthumb, the Duke of Tarragon, Mayor of Dragon's Wort. Mother is Her Highness Sarah Merriweather, Duchess of Chives in Puzzlewood.\"<br>\r\n<br>\r\n\"Fancy bloodlines she's got, there.\"<br>\r\n<br>\r\n\"Says here she was sent to a nunnery for fighting with the girls at her grammar school. After she left, she fell in with the court of the Fairydom of Never-Never and took to the boy who became the new Pan.\"<br>\r\n<br>\r\n\"Anything else?\"<br>\r\n<br>\r\n\"A few citations for disturbing the peace, one assault and battery with a frilly weapon...oh!\"<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\n\"It says here that the King of Never-Never indicted her on two counts attempted girlslaughter.\"<br>\r\n<br>\r\n\"Is that even an applicable legal term?\"<br>\r\n<br>\r\n\"It is in Never-Never. The report says that she attempted to have a certain Wendy Darling of Kensington shot down, first by the crew of the Jolly Roger, and again the same day by the Lost Boys!\"<br>\r\n<br>\r\n\"The Queen mentioned that.\"<br>\r\n<br>\r\nJack closed the file. \"Let's go upstairs and get some supplies for the trip.\"<br>\r\n<br>\r\nAt the top of the stairs, they met Detective Heart.<br>\r\n<br>\r\n\"Hey Knavey! What's going on?\" Jill asked.<br>\r\n<br>\r\n\"I'm coming down to get Puss' boots out of evidence.\"<br>\r\n<br>\r\n\"Have you got any leads on him?\" Jack asked.<br>\r\n<br>\r\n\"Oh, we found him already. Turns out it's hard to tell one cat from another when the only distinguishing characteristic is the boots, which we had, so when he came to report them stolen, it was pretty easy to find him.\" He spun on his heels once and proceeded down the steps. They watched him go and when he got to the floor and was out of sight, Jack muttered, \"The transfers from Wonderland are always so spaced out...\"<br>\r\n<br>\r\n\"So for food, should we go to the Muffin Man or grab whatever's in the lounge?\" Jill asked.</span></div></div>",
            "created":1277701200,
            "id":908321,
            "title":"Ask if Peter knows what Tinkerbell done"
        },
        "133":{
            "author_id":"shadystoat",
            "author_name":"Shady Stoat",
            "choices":[
                "Ask the genie for fairy-dust. The frogs will wait",
                "Try to help the frogs out. They need help now!"
            ],
            "content":"<div class=\"\"><div> <span>Jill smiled wryly. “I’ve got a silver dollar. Maybe we should start with the wishing well? It’s closer than anywhere else but the bottom of the garden – and I for one don’t want to have to shake any fairies down for their dust. They can give a nasty nip!”<br>\r\n<br>\r\n“Right. The wishing well,” agreed Jack, just relieved that Jill hadn’t been too scathing about his plan.<br>\r\n<br>\r\nThey set out toward the centre of town, lilac cobbles paving their way. If the Well-genie was in a good mood, they could have the fairy-dust in a matter of minutes. Of course, it all depended on how much djinn-juice he’d been drinking the night before. They’d just have to hope they got lucky, that was all.<br>\r\n<br>\r\nWhen they got there, however, it became obvious that something bigger than the search for fairy-dust was going on here. A crowd of onlookers were trying to out-shout each other and there was something in the centre of the circle, beside the well itself.<br>\r\n<br>\r\nJack wasted no time, pushing through the crowd… and Jill was right behind him. Thus, her nose hit him in the small of the back as he came to a sudden halt.<br>\r\n<br>\r\n“Ow!” she said, in a slightly nasal voice. Then she saw what he was looking at and her eyes widened.<br>\r\n<br>\r\nIn the centre of the circle stood two… things! Loosely speaking, Jill supposed they were human-ish, but no human she’d ever seen had green warty skin, bulbous eyes and a bright-red inflatable throat and chest. They looked like the human equivalent of toads, or…<br>\r\n<br>\r\nShe groaned. “Frogs. Don’t tell me – the Frog Prince is missing too!”<br>\r\n<br>\r\n“You bet he’s gone missing!” croaked one of the huma-frogs. “Three days and he hasn’t been back once to see how his poor old mother’s doing. Leaves me to take care of the well without so much as a ‘by your leave!’ Who’s going to scrape up the well scum – that’s what I want to know!”<br>\r\n<br>\r\n“What happened?” asked Jack, helplessly.<br>\r\n<br>\r\nThe frog-thing glared at him, then shrugged and answered.<br>\r\n<br>\r\n“Well, I was out at the edge of the well, looking to see where my son had got to… lousy good-for-nothing toad that he is… and the next thing you know, some passing Princess with gender blindness has picked me up and planted a smacker on my lips. Then, she turns into <i>that</i> – and I turn into <i>this</i> – and now I can’t get back into my well and she’s talking law-suits and treason charges. As if it was <i>my</i> fault she sexually assaulted me. Pah!”<br>\r\n<br>\r\nJill looked at the creature sympathetically. “Oh, you poor thing! Jack – we can’t just leave them like this – we’ve got to do something!”<br>\r\n<br>\r\nJack winced. Where animals were concerned, Jill was often far too sympathetic for her own good. “I thought we were supposed to be tracking down Peter Pan?” he said, helplessly.<br>\r\n<br>\r\n“AND setting the other fairy-tales back on their track,” reminded Jill, bristling slightly.<br>\r\n<br>\r\n“All right,” sighed Jack. “Here’s what I suggest.”<br>\r\n<br>\r\n</span></div></div>",
            "created":1154235600,
            "id":335852,
            "title":"The Wishing Well"
        },
        "1331":{
            "author_id":"smeedyer",
            "author_name":"Smee",
            "choices":[
                "Go on a hunt for the Frog Prince.",
                "Go to the Wicked Witch of the West (of town) to see if she can change them back"
            ],
            "content":"<div class=\"\"><div> <span>\"The frogs can wait.\" Seeing Jill's eyes widen ready to explode Jack quickly continued. \"They're not in pain or suffering greatly, and you know how the genie gets later in the day.\" He quickly mimed drinking.<br>\r\n<br>\r\n\"If we don't ask him soon, he'll be in no state to talk too.\"<br>\r\n<br>\r\nJill crossed her arms, but didn't quite tap her foot. \"Ok, but we keep an eye out for the Frog Prince. We can't leave them like this any longer than necessary.\"<br>\r\n<br>\r\nJack nodded, and began elbowing more people away from the well. He looked down into the murky depths and yelled a testing welcome.<br>\r\n<br>\r\n\"Helllloooooooo?\"<br>\r\n<br>\r\n\"He won't come up you know.\"<br>\r\n<br>\r\nJack turned around to stare, once again at the frog-thing. <br>\r\n<br>\r\n\"Oh, and why not?\"<br>\r\n<br>\r\nThe red-throat swelled up pompously. \"He decided yesterday he's fed-up of being called up willynilly for stupid wishes. So he made a password, and will only come up if someone says it.\"<br>\r\n<br>\r\nJack winced, instantly seeing where this was leading. Jill came to the rescue.<br>\r\n<br>\r\n\"And what is the password dear creature?\"<br>\r\n<br>\r\nThe frog-things' expression changed to one that Jack could only describe as smug, something very tricky with frog-lips.<br>\r\n<br>\r\n\"I'm not telling you.\"<br>\r\n<br>\r\n\"Let me guess,\" Jack said. \"We have to find the Frog Prince before you'll tell us?\" He very carefully avoided looking at Jill.<br>\r\n<br>\r\n\"Such a clever boy! If only it had been you to kiss me instead of this bulbous trollop.\"<br>\r\n</span></div></div>",
            "created":1154235600,
            "id":335858,
            "title":"Genie, Genie, where for out thou Genie?"
        },
        "13312":{
            "choices":[
                "Huma-Frogs decide Jack is crazy and leave him",
                " the Wicked Witch of the West (of town)!"
            ],
            "content":"<div class=\"\"><div> <span>Jack frowned.<br>\r\n<br>\r\n\"Come on Jill.\" he muttered, and turned on his heel.<br>\r\n<br>\r\n\"Where are you going?\" she called, chasing him.<br>\r\n<br>\r\nHe smiled. \"The Wicked Witch of The West (of Town) can be kind-hearted when... it serves her puroses. I'm sure that-\" he stopped and looked behind him.<br>\r\n<br>\r\n\"Follow us, you two, if you'd like to be changed back!\" he yelled impatiently. The two looked confused, and followed Jack reluctantly. \"Now,\" he said, \"as soon as we get to the Witch's place, I want you to be ready to give her a big hug, k?\"<br>\r\n<br>\r\nThe huma-frog glared at Jack. \"I'd rather give this <i>girl</i> here one.\"<br>\r\n<br>\r\n\"I never said you'd have to <i>give</i> the witch a hug, I merely said you'd have to get ready. Face it, you're ugly, she'll turn you back immediately to your original forms the moment you look even slightly ready to give her a hug.\"</span></div></div>",
            "created":1154235600,
            "id":335897,
            "title":"Jack's Smarts"
        },
        "133122":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "The freaks are back to normal",
                "In her haste the witch made things worse"
            ],
            "content":"<div class=\"\"><div> <span>A short while later Jack, Jill and the mutant Huma-frogs made it to the Witch's hut without further distractions, except of course the large angry mob behind them. More then a few members of the mob were carrying torches and pitchforks.<br>\r\n<br>\r\n<br>\r\n<br>\r\n------------- At the Witch's house--------------<br>\r\n<br>\r\n\"We want you to change these two back to their original forms and change them now.\" howled Jack, putting on his best tough guy facade and slamming his fists on the table for show.<br>\r\n<br>\r\nThe Witch quickly bolted out of her chair in anger.<br>\r\n<br>\r\n\"Who do you think you are giving ME orders. I should turn you into a Huma-Frog right now!\"<br>\r\n<br>\r\nJack smiled arrogantly his blond locks falling infront of his eyes.<br>\r\n<br>\r\n\"Well then, you've forced my hand. Do your thing ladies.\"<br>\r\n<br>\r\nThe two Huma-frogs advanced toward the witch their arms outstretched. The Princess Huma-frog threw in some lip smacking to get her point across.<br>\r\n<br>\r\n\"No! No! GET AWAY FROM ME! GOD NOOOOOOOO!!!!!!!\" screamed the witch as she pinned her self against the wall cowering in fear with one hand pointing a wart covered finger at her attackers.<br>\r\n<br>\r\nThe witches finger let out a sudden burst of light and the two Huma-frogs were transformed.</span></div></div>",
            "created":1154408400,
            "id":336436,
            "title":"NO! Don't come any closer! NOOOOOOOO!!!!!"
        },
        "1331221":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "A pig",
                "her homely servant"
            ],
            "content":"<div class=\"\"><div> <span>As the light dulled Jack and Jill saw that the Huma-frogs were back to normal. Jill picked the frog up off the floor as the princess brushed her long flowing blond hair. The angry mob watching outside through the windows dissapated groaning in dissapointment.<br>\r\n<br>\r\n\"Now we want some fairy dust!\" shouted Jack slamming his fist again.<br>\r\n<br>\r\nThe witched laughed at this.<br>\r\n<br>\r\n\"You have nothing to bargin with. So unless you can pay get the hell out of my house.\"<br>\r\n<br>\r\n\"Give me a minute to confer with my colleauge.\"<br>\r\n<br>\r\nJack pulled Jill off to the side and began to whisper in her ear.<br>\r\n<br>\r\n\"Lets use the princess as a collateral.\"<br>\r\n<br>\r\n\"What?\" shouted Jill.<br>\r\n<br>\r\nJack quickly shused her.<br>\r\n<br>\r\n\"Jack, we can't do that.\"<br>\r\n<br>\r\n\"Sure we can. Look, we give her the princess, get the fairy dust, save Peter, get more, give it back to the witch for the princess, then save the frog prince.\"<br>\r\n<br>\r\nJill gave up with a sigh.<br>\r\n<br>\r\n\"Fine.\"<br>\r\n<br>\r\nJack turned back to the witch.<br>\r\n<br>\r\n\"We'll give you the Princess.\"<br>\r\n<br>\r\n\"What?\" shouted the Princess.<br>\r\n<br>\r\n\"Deal.\" said the witch quickly tossing Jack the fairy dust.<br>\r\n<br>\r\nThe witch then turned to the Princess laughing and turned her into....</span></div></div>",
            "created":1154408400,
            "id":336445,
            "title":"A trade"
        },
        "13312211":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "The witch wants to cook her",
                "The witch just did it for shits and giggles"
            ],
            "content":"<div class=\"\"><div> <span>The princess opened her mouth to protest, but to her horror, found she could only oink.<br>\r\n<br>\r\nShe then noticed her skin turning pinker, and she began to gain weight. Her nose started to enlarge, and her nostrils widened. She felt her ears growing, but before she could investigate furthur, she lost her balance. Her fingers were fusing together, into hoofs.<br>\r\n<br>\r\nSoon, all anyone could see was a panicked, squealing pig in a princess gown.</span></div></div>",
            "created":1155618000,
            "id":339714,
            "title":"Pigging out"
        },
        "13312212":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Head off to Never Never Land",
                "Try to trade back."
            ],
            "content":"<div class=\"\"><div> <span>The Princess's hair grayed and frizzed. Her nose became swollen and a large wart was placed on it. She became hunched and grew fat all over. Jack cringed at the sight.<br>\r\n<br>\r\n\"Good girl, now you'll do everything I say if you want to get back to normal.\"<br>\r\n<br>\r\nThe hunchedback princess waddled off and began dusting the cupboards.<br>\r\n<br>\r\n\"Well we've got what we came for. Let's go. We can take the frog with us. Perhaps she'll spot her son.\"<br>\r\n<br>\r\n\"Jack this isn't right. Look at the Princess.\" said Jill pointing to the homely princess who was now scrubbing the floor with a toothbrush.<br>\r\n<br>\r\n\"I don't know Jill.\"</span></div></div>",
            "created":1154408400,
            "id":336461,
            "title":"The Homely Princess"
        },
        "133122121":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Continue to Never Never Land",
                "Go back and try to trade for the Princess"
            ],
            "content":"<div class=\"\"><div> <span>\"Fine Lets go.\" sighed Jill<br>\r\n<br>\r\n\"But lets hurry back.\"<br>\r\n<br>\r\n\"Okay.\" said Jack.<br>\r\n<br>\r\n\"Don't forget the frog.\"<br>\r\n<br>\r\nJill grabbed the frog and the three left the homely princess who was now being used as a footstool.<br>\r\n<br>\r\nThey walked out into the meadow and were about to take off when Jack realized someting.<br>\r\n<br>\r\n\"Ya know we could've just taken the Princess to the Genie to get the wishing powder.\"<br>\r\n<br>\r\n\"Well we've gotta go back then. I mean she was being used as a footstool.\"<br>\r\n<br>\r\n\"Meh, why waste time.\"<br>\r\n<br>\r\n\"JACK!\"</span></div></div>",
            "created":1154408400,
            "id":336485,
            "title":"Why didn't we go back to the Genie?"
        },
        "1331221212":{
            "author_id":"shadystoat",
            "author_name":"Shady Stoat",
            "choices":[
                "Does Jack confirm Jill's story?",
                "Does Jack tell the witch that Jill's talking bunk?"
            ],
            "content":"<div class=\"\"><div> <span>\"We can't just keep backing and forthing all day!\" protested Jack. \"Have you SEEN the list of missing fairy-tale characters? It's huge - and we haven't even got as far as the first on the list yet! Jill - be reasonable, let's just...\"<br>\r\n<br>\r\nHe trailed off helplessly, noting that Jill had already disappeared back into the witch's cottage. Muttering under his breath he hurried to follow her in. <br>\r\n<br>\r\n\"You again?\" snarled the witch. \"What do you want this time?\"<br>\r\n<br>\r\nJill smiled airily. \"Nothing much. I just thought you might have reconsidered, that's all.\"<br>\r\n<br>\r\n\"Reconsidered?\" The witch threw her ugly head back and cackled insanely. \"And why in fairyland would I want to reconsider? I've just got myself a very useful drudge, thanks to you two. And if you're not careful, I'll have myself two more!\"<br>\r\n<br>\r\nJill fixed her with a patronising look.<br>\r\n<br>\r\n\"You really don't know what you're dealing with here, do you?\" she said, sympathetically.<br>\r\n<br>\r\n\"Huh? What are you talking about?\"<br>\r\n<br>\r\n\"Look,\" said Jill, sitting down in the witch's armchair, \"We have fairy tale characters going missing all over the land. Right? And we have fairy tales aching to be completed - only there's nobody around to complete them. Do you know anything about causality rifts?\"<br>\r\n<br>\r\n\"Caus-whattity?\" snarled the witch.<br>\r\n<br>\r\n\"Causality,\" sighed Jill. \"It's a type of magic. I'll try to explain. You see, if Snow White goes missing, then some other girl with hair as black as ebony, skin as white as snow and lips as red as rubies is going to find herself hunted down by a wicked stepmother. It won't matter if it's not REALLY Snow White. By the time the story's done with her, she might as well be.\"<br>\r\n<br>\r\nThe witch glared at her. \"What's that got to do with anything? What's it got to do with me?\"<br>\r\n<br>\r\n\"You've only gone and started off another fairy-tale, right here in your own cottage!\" Jill shook her head, reproachfully. \"Couldn't be plainer! You've taken a princess and turned her into a servant, ruled by someone evil and rather... well... nasty. You just KNOW how that's got to turn out. And then, to add insult to injury, you want to use the power of three? Turn three of us into ugly servants and you can't help but find yourself in an oven by the time the story ends. It's all perfectly logical, when you think about it.\"<br>\r\n<br>\r\nFor the first time, the witch looked uncertain.<br>\r\n<br>\r\n\"That sort of thing doesn't really happen!\" she snapped. Then: \"Does it?\"<br>\r\n<br>\r\nJill turned to Jack who was standing gaping at her in disbelief. \"Jack - tell her,\" she ordered.<br>\r\n<br>\r\nJack hesitated, torn between rescuing the princess and putting Jill in her place once and for all. He opened his mouth...</span></div></div>",
            "created":1154408400,
            "id":336521,
            "title":"Causality Rifts"
        },
        "13312212121":{
            "author_id":"panhandle",
            "author_name":"Pan",
            "choices":[
                "...that princess is magically bound to my house! She can't leave! Ha!",
                "...I'm actually one of the heros you've been searching for..."
            ],
            "content":"<div class=\"\"><div> <span>...and found himself insisting loudly, \"Oh, it happens quite often!\" Then, struck by sudden and brilliant inspiration, Jack drew the Witch of the West close to him, leaning his head toward hers conspiratorially and lowering his voice to what was still a rather theatrical whisper. \"As a matter of fact, my good friend--well I rather think I should leave names out of it--\"<br>\r\n<br>\r\n\"Oh, but I won't tell a soul!\" the Witch of West swore earnestly, clinging to his arm and trying to look as trust-worthy as possible by pouting out her bottom lip as far as it would go and blinking her forcibly widened eyes as quickly and as often as she could.   <br>\r\n<br>\r\nJack shook his head and said with just the right amount of hesitancy in his voice, \"I'm sorry, but there really is such a thing a client confidentiality, and I can't--\"<br>\r\n<br>\r\n\"Please?\" The witch's pout, which Jack suspected had been magically enhanced, now reached past her chin, and her eyelashes were in such a flurry Jack was surprised the witch could see past them at all.<br>\r\n<br>\r\n\"Oh, all right, I'll tell you her nickname,\" Jack conceded with a dramatic sigh. \"Everyone back in high school used to call her the 'Queen of Hearts' and--by the way, have you ever tried her tarts?\"<br>\r\n<br>\r\nThe witch shook her head.<br>\r\n<br>\r\n\"Oh, they're just delicious!\" From there, Jack allowed his mouth to take over while he focused all of his energies on leading the all-too-eager Wicked Witch of West away from Jill and the erst-while princess.<br>\r\n<br>\r\n\"--and then there was this Knave of Hearts, well, you can just imagine what kind of guy HE is. Anyway, he stole the tarts--\" Barely aware of the words that were spilling out of his mouth, Jack motioned furiously behind his back for Jill to grab the princess and get out. The witch was too engrossed in the gossip to notice the slight shuffling as Jill gathered up the princess and moved toward the exit, but Jack had to work cover up the princess's indignant cry of, \"Hey! Get your own toothbrush!\"<br>\r\n<br>\r\n\"AND THEN HE BEAT THE KNAVE FULL SORE! HA! ISN'T THAT A GOOD STORY?\" Jack practically screamed the words in the witch's ear. Thankfully, the witch started cackling, which covered up the sound of boot meeting flesh. Jack risked a quick look backward and saw Jill rubbing her shin as the princess redoubled her mad efforts to clean the floor with her newly reclaimed toothbrush. Jill was on the princess in a second and started wrestling her to the door. <br>\r\n<br>\r\nJack turned back to the witch, whose eyes were tearing, and added his own too-loud laughter to her high-pitched shrieks of mirth. <br>\r\n<br>\r\n\"Oh, that was a good one!\" said the Witch of the West, wiping a tear from her eye. \"Do you want to hear another good one?\"<br>\r\n<br>\r\nJack nodded and said a shade too brightly, \"Why yes, of course!\" <br>\r\n<br>\r\n\"Well, you see...\"      <br>\r\n<br>\r\n</span></div></div>",
            "created":1224565200,
            "id":598313,
            "title":"Smarts and Tarts"
        },
        "13312212122":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "She lets the Princess go",
                "She calls Jack's bluff"
            ],
            "content":"<div class=\"\"><div> <span>\"Look Witchy. My friend here is full of bull.\"<br>\r\n<br>\r\n\"Jack!\" shouts Jill.<br>\r\n<br>\r\nJack decides to prove his manliness by throwing the best bluff he can.<br>\r\n<br>\r\n\"But the point is there is two of us and one of you. You can't hit both of us before the other shoves you in the oven behind you. Now I'm really pissed royally and I don't feel like going back and forth so why don't you just give us the princess and we'll keep the fairy dust and be on our way.\"<br>\r\n<br>\r\nThe witch looks surprised at Jack's attitude.</span></div></div>",
            "created":1154408400,
            "id":336522,
            "title":"Putting Jill in her place"
        },
        "133122121222":{
            "author_id":"katiemc",
            "author_name":"Catherine A. McIntyre",
            "choices":[
                "The princess had fallen onto the witch, knocking her out cold",
                "Jill had been turned into a cat"
            ],
            "content":"<div class=\"\"><div> <span>'So, you think you can outwit me? Now that is brave, only thing is bravery never succeeds over magic.' The witch cackled loudly, like all good witches would and started to raise her wand.<br>\r\n<br>\r\n'Jack?'<br>\r\n<br>\r\nJack felt helpless, unable to do anything, he braced himself for the mighty blow, listening to Jill's soft wimpers and the witch's crowing.<br>\r\n<br>\r\nAfter a few minutes had passed, Jack's eyes slowly and cautiously began to open. Unsure of what he might see he took a deep breath and saw...</span></div></div>",
            "created":1193115600,
            "id":456069,
            "title":"She calls Jack's bluff"
        },
        "1331221212221":{
            "author_id":"katiemc",
            "author_name":"Catherine A. McIntyre",
            "choices":[
                "They escort the Princess back to her castle",
                "They go to Neverland"
            ],
            "content":"<div class=\"\"><div> <span>“You’ve no idea how long I’ve waited to do that!” the Princess exclaimed.<br>\r\n“Golly! Well done, Princess....um, Princess...” Jack stammered as he realised that he knew not the name of the Princess.<br>\r\n“Princess Ada.”<br>\r\n“Princess Ada!” Jill suddenly gasped.<br>\r\n“Jill, don’t be so rude.”<br>\r\n“Don’t you see Jack? Princess Ada was on our list.”<br>\r\n“Our list?”<br>\r\n“Yes, the wanted persons”<br>\r\nThe Princess took this moment to explain her situation.<br>\r\n“I was out in the garden, tending the pea plants when I was set upon by this horrid woman. She claimed to be an old woman, lost in the woods. I said that I would help her by accompanying her to the other side. Once we’d passed Priest’s Clearing she wandered off the path, worried, I followed her and it was there she cast her wicked spell. She transformed me into a frog and said that the only way I was allowed to turn back was if I kissed another frog. Trust me to pick one that would lead me straight back to her.”<br>\r\n“Well, um, do you need escorting back to the palace, Princess. We could take you there now, keep you safe, make sure you get back, you know, safely.”<br>\r\n“Jack? What about heading off to Neverland as soon as possible?”<br>\r\n“Well, we could make a detour. It’s not urgent, urgent to get there.”<br>\r\n“Hmm hmm.”<br>\r\n“Honestly, you two have done enough! I’ll find my own way back, you two start your journey off to Neverland.”<br>\r\n“Jill. We have to take her back.”</span></div></div>",
            "created":1274158800,
            "id":885065,
            "title":"The Princess and the Pea"
        },
        "13312212122211":{
            "author_id":"katiemc",
            "author_name":"Catherine A. McIntyre",
            "choices":[
                "She chases the Gingerbread Man",
                "She tries to find Jack"
            ],
            "content":"<div class=\"\"><div> <span>“Jill? We have to escort her back to the palace. It’s our duty. Here, Princess,” Jack offered his arm to the Princess and they began towards the forest.<br>\r\n“Thank you, Jack. I really appreciate you walking me back. I’d hate to walk back on my own.” The princess expresses her gratitude while Jill rolls her eyes and follows behind.<br>\r\n<br>\r\nEntering the forest, Jill found herself less and less involved in the conversation between Jack and Princess Ada so stopped trying to keep up with their pace and allowed a distance between them. Using this time alone, she pulled out her list of missing persons, reminding herself of the troubles of Fantasy Land. Upon looking up from her list, she realised she had lost her colleague and his new friend and was in a part of the woods she hadn’t ventured before.<br>\r\n<br>\r\nIt was then she heard the pitter-patter of feet coming quickly yet quietly towards her.<br>\r\n“Jack?” She called to no answer, “Jack?” She started to panic until the owner of the footsteps burst through the bushes to her right. She sighed relief as she discovered it was only a gingerbread man who emerged, at a speed faster than any gingerbread man she had ever seen.<br>\r\n<br>\r\n“Gingerbread Man, where do you go at such a speed?” Jill asked.<br>\r\n<br>\r\n“Run, run as fast as you can, you can’t catch me, I’m the Gingerbread man!” he called back.</span></div></div>",
            "created":1298869200,
            "id":1062173,
            "title":"The Gingerbread Man"
        },
        "1332":{
            "author_id":"sweetp7680",
            "author_name":"B. Olson",
            "choices":[
                "take caffine pills to sleeping beauty's house ",
                "bail alice from ''wonderland rehab'' "
            ],
            "content":"<div class=\"\"><div> <span>By this time Jack and Jill were singing their own theme song in order to stay awake. Just as they harmonised ''Jack fell down and broke his crown' , Jill nudged Jack to see if it was just her tipsiness or if they really did hear '' BUD-WY-ZER'' in the distance. They ran closer to the sound, a faint ''ribbit'' and murrmurr was throwing them to foreshadowing who they were hearing. <br>\r\n<br>\r\n''Sup J and J!\" said the wort-infested toad<br>\r\n\" how did you know?\" jill's tipsiness seemed to disappear or she just became incredibly paranoid<br>\r\n'' Big timmy T knows all my lovely lady friend'<br>\r\n<br>\r\nAfter much deliberation Jack decided they better come to do what they had read about all these years, jill would need to kiss timmy t. She had no mints and hadnt asked to barrow any seeing at timmy was becoming very anxious. <br>\r\n<br>\r\n''SMOOOCH'' <br>\r\n<br>\r\njill kept her eyes closed until she no longer smelt sulfer and warts. <br>\r\nhe was amazing, if only she was the age of 22 as well, then they could be married and live next to Snow White. but laws were laws and the last thing she wanted to was to be in jail with the wicked step sisters.<br>\r\n<br>\r\nprince timmy t provided them with the right information to continue on their journey since they had freed him from a life in the swamps. <br>\r\n<br>\r\nthey rested for the night before they headed of to...</span></div></div>",
            "created":1186290000,
            "id":432324,
            "title":"J and J meet Mr. T"
        },
        "13322":{
            "author_id":"smile248",
            "author_name":"Val",
            "choices":[
                "Back at HQ: New info on Peter Pan"
            ],
            "content":"<div class=\"\"><div> <span>Acting on a random instinct, Jack and Jill ran up to the local jail, and asked for the Hatter. \"We've come to bail him out\" Jill said sweetly, batting her eyelids at the troll-warden in the hopes of success. \"\"Atter? Gone\" the troll croaked, reaching for a glass of water. \"'Is mistress, ol' Queenie, bailed 'im out last month, an' dragged 'im off t' God knows where\" he said, reaching for a cigarette from the packet lying on the desk. \"She gave 'im a right ol' tellin'-off, did she what\". Disappointed, Jack and Jill left, leaving the warden staring after them suspiciously.They strode back down the hill, heading back to head-quarters.</span></div></div>",
            "created":1277787600,
            "id":908483,
            "title":"Bail the Mad Hatter out from prison"
        },
        "134":{
            "author_id":"zedikiah",
            "author_name":"Zedikiah",
            "choices":[
                " Ask Merlin  to show you the way to the Nursing Home",
                "Black Mail Merlin into making  you some fairy dust."
            ],
            "content":"<div class=\"\"><div> <span>Jack and Jill went up the hill to fetch a pail of fairy dust.<br>\r\n<br>\r\n\"I think the witch lives here,\" said Jack, pointing to an ugly falling down cottage. Wicca was spelled in large black letters on a billboard next to the house, but it looked deserted with no signs of life.......or more importantly witches. <br>\r\n<br>\r\n\"Ok Jack lets find that fairy dust so we can rescue Peter\"<br>\r\n <br>\r\nThe two child gum shoes stepped inside hoping to find a clue or something of that nature, and too there astonishment, Jack and Jill did not find the Witch, but an elderly wizard sitting in a rocking chair.<br>\r\n<br>\r\n\"Who are you?\" asked the children, almost simaltaneously. <br>\r\n<br>\r\n\"I am Merlin,\" he stated simply, pushing his glasses up his nose. \"I am taking over for Molly, because unfortunately the old girl is now in a nursing home.....I've told her many a time, that flying around in tornados on that broom of hers was a bad idea.........She's getting too old for that.....but who are you?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1154581200,
            "id":337118,
            "title":"Masculinish Witches"
        },
        "1341":{
            "choices":[
                "Jill and Jack follow Merlin's advice...",
                "Jill and Jack call Arthur to tell him where Merlin is"
            ],
            "content":"<div class=\"\"><div> <span>          \"Jill and Jack, detectives extrodinare.  Now, Merlin was it, could you be so kind to show us the way to the nursing home?\" Jill said at once, cutting off any chance for Jack to respond first.  Merlin slowly stood from his chair.  His bones creaked.<br>\r\n          \"Now, where did I put that wand?\" Merlin commented to himself while fumbling through his robes.  He continued to search through is blue robes for several minutes.<br>\r\n          \"Did you check where you always put it?\" Jill inquired, \"Usually people put things away, when they're done with it.\"<br>\r\n          \"Sure, sure.  You young children just want everyone to do everything, don't you?\"  Merlin reached into the air, and with a shout said, \"What do you know?  I did put it away!  Well, that's totally beside the point, because I didn't need it anyway.....now, what did you young ones want, and who are you?\"<br>\r\n          \"Tell us where the nursing home is, please,\" said Jill.<br>\r\n          Merlin jumped up and down like a five year old boy.  \"Oh! Just follow the red brick road,\" he said enthused.</span></div></div>",
            "created":1193029200,
            "id":455874,
            "title":"The Red Brick Road?"
        },
        "13411":{
            "author_id":"surfing_emo",
            "author_name":"clueless",
            "choices":[
                "They carry on with their investigation and allong the red brick road to Oz.",
                "They rebel and refuse to go to find Peter, instead they demand the public help. "
            ],
            "content":"<div class=\"\"><div> <span>\"So the nursing home is in Oz?\" Asked Jill. <br>\r\n\"Yes, you better hurry though, doors close soon.\" Jack looked at his Rolex and raised an eyebrow. <br>\r\n\"What? At 12 noon?\" <br>\r\n\"Yes, old people need to sleep lots you know. The road starts over the hill there.\"Merlin pointed out of the window to the hill with the red tree. Jill shrugged and the two detectives set out on their quest.<br>\r\n\"I hope we find the Witch soon, the public are really putting on the pressure, you do know they plan to push us down a hill if we don't get his situation under control right?\" Moaned Jill as the duo trudged up the hill to thr bright red tree. <br>\r\n\"Yeah I heard that. If they care that much why don't they get off their butts and help!?\" Jill sighed in despair. <br>\r\n\"I don't know. Layness maybe?\" Jack shrugged. <br>\r\n\"Whatever it is we should hurry up and find Peter, maybe when we find him we'll find the others.\" <br>\r\n\"Yeah, maybe.\" </span></div></div>",
            "created":1277787600,
            "id":908644,
            "title":"Jill and Jack follow Merlin's advice..."
        },
        "134111":{
            "author_id":"faith201",
            "author_name":"Shy 2.o",
            "content":"<div class=\"\"><div> <span>When Jack &amp; Jill . Arrive in Oz , they were surprise to see that The nursing home . was shape as a shoe ! So they went inside , and ask the lady at the Desk . If they could see The Wicked Witch ? Yeah go ahead ! but hurry up , it's almost closing time . so Jack &amp; Jill ! went in the back .  and notice many familiar faces , wait a minute ? Jill said . isn't that The Big Bad Wolf ? lol or should i say the big bad Doof . because the way he looks , ha ! . shush Jack said ! Jack &amp; Jill , couldn't believe how the Big Bad Wolf . has let his self go , his stomach was big and he look like a bump . then they notice Captain Hook , who hook was now . replace with his fake hand ? They couldn't believe there eyes . it was like almost , Villain from every well know Fairly Tales . was here in this nursing home ! Jack was relief , when he saw The Wicked Witch . she was knitting a scarf with Cinderella evil Step Sisters . oh thank goodness , we found you . <br>\r\nJack said !  well hello children . Who might you be ? seriously ? you don't remember us ? um no sorry !  \" ugh \" , it doesn't matter Jill said . what matter is , we need your help . Oh dear , what is it ? We need fairly dust . <br>\r\nDo you have any ?  <br>\r\n<br>\r\nWhy ? oh boy ! Because some of the, biggest fairly tales characters have gone missing .  And we need to find them ! but we need some Fairly Dust . so can you please help us ? I Don't know , they don't call me Wicked . for nothing ! my Dears .   you keep messing with us , I'll pour this water on you .  Ok ! Ok ! Ok ! just please get that away from me . she call in one of Flying Monkeys , and told him to retrieve a jar of Fairly Dust . Before Jack &amp; Jill , knew it . <br>\r\nThe Monkey came back ! and gave The Fairly Dust to Jack &amp; Jill . Thank you ! They both said . </span></div></div>",
            "created":1420952400,
            "id":1916568,
            "title":"They carry on with their investigation and allo..."
        },
        "1342":{
            "choices":[
                "He doesn't take the bluff",
                "He gives them just enough fairy dust to get to Neverland"
            ],
            "content":"<div class=\"\"><div> <span>Jill thought for a moment.  Merlin could be useful too.  He wasn't the Wicked Witch, but wasn't a wizard just as good?<br>\r\n<br>\r\n\"Good sir,\" she said to him, \"we need fairy dust.  Will you give us some?  Or can we buy some from you?\"<br>\r\n<br>\r\nMerlin raised an eyebrow.  \"Why should I?\"<br>\r\n<br>\r\n\"Well, it would be rather...unfortunate if the Wicked Witch found out that you <i>aren't</i> wicked.  Or that you created the Saxons that destroyed Britian.  And what about you helping out Snow White?  Or that you're gay!<br>\r\n<br>\r\nMerlin stared at her for a long time...</span></div></div>",
            "created":1226120400,
            "id":605376,
            "title":"Black Mail Merlin into making  you some fairy d..."
        },
        "14":{
            "author_id":"thebrunette",
            "author_name":"LittleWitch",
            "choices":[
                "The giants house in the clouds...",
                "The market..."
            ],
            "content":"<div class=\"\"><div> <span>Jack Crown and Jill Pail set off down the country lanes in search of the home of Jack, the boy of Beanstalk fame. They questioned the cow, who ended up being set to pasture in a neighbouring town. The cow, in predictable fairytale fashion gave our intrepid detectives directions to the house. Although as you came close you would have known the very house without looking for it. The infamous beanstalk covered all the fields as it lay rotting after being cut down. At the front door of a quaint country cottage with ivy circling the door they knocked and waited. Eventually a decidedly upset mother came to the door. \"You've come about my son!\" she cried and let them into the house. Keeping herself busy making tea and crumpets for Jack and Jill she explained how her beloved son had vanished shortly after slaying the giant above the clouds. \"He just didn't come home after going to market a second time. Without our cow we were without milk.\" she explained in a tearful voice. Jack made notes while Jill made sympathetic noises to try and keep Jack's mother calm. It was peculiar how he had simply vanished into thin air. They thanked Jack's mother for her time and left. There next destination...</span></div></div>",
            "created":1154840400,
            "id":337580,
            "title":"The search for Jack's house..."
        },
        "141":{
            "author_id":"grcubby",
            "author_name":"Cubby ~ No Place Like Home!",
            "choices":[
                "Jolly Green Giant",
                "The Giant Cow",
                "No Giants Left"
            ],
            "content":"<div class=\"\"><div> <span>There next destination was the office where they could talk privately without interruptions from fairy tale creatures who liked to talk.<br>\r\n<br>\r\n\"I don't have a good feeling about this,\" said Detective Crown to his partner, Pail. \"This is Jack's second disappearance, only this time, there don't seem to be any beanstalks leading up to the clouds. Unless...\"<br>\r\n<br>\r\n\"Unless what?\" Jill demanded. \"I hate it when you do this to me. Know I suppose you are going to say, 'Forget it, Pail. It was just a passing thought.'\"<br>\r\n<br>\r\n\"Forget it, Pail. It was... Hey! How'd you know I was going to say that?\" Jack Crown was incredulous. \"What are you, anyway... a psycho?\" He grinned, then laughed too loudly over his own words.<br>\r\n<br>\r\n\"Psychic, pscho-yourself. It's called being psychic. And no, you weren't funny in the least. You always tell me to <i>forget it</i> whenever there's a pause after the word <i>Unless.</i> Jill kicked off her spike heals. \"My feet are killing me.\" She began rubbing them.<br>\r\n<br>\r\n\"Hey, what's that stuck to the bottom of your shoe?\" Jack asked, leaning forward for a better view. \"That's a dang bean! Do you think...\"<br>\r\n<br>\r\nJill slipped her shoes back on after peeling the bean off the soul of her shoe. \"Let's experiment. I'll carry this up the hill while you pull up water from the well with the bucket. Let's see if this thing will grow.\"<br>\r\n<br>\r\n\"Hold on a minute!\" the detective barked. \"Last time I went up that hill, I came tumbling down and broke my crown. I don't every want to do that again!\"<br>\r\n<br>\r\n\"Grow up, Jack. We're professionals now, not kids. If you're going anywhere, it will be up a beanstalk and if you don't hold on tight, you'll be tumbling down a beanstalk and breaking more than your crown. Now let's go!\"<br>\r\n<br>\r\nTwenty minutes later, Jack was huffing and puffing on top of the hill. \"Man, I'm outta shape,\" he said, wiping sweat from his forehead. The protective motorcycle helmet he wore was heavy and hot.<br>\r\n<br>\r\nJill, however, ignored him and dug a hole in the ground about ten feet from the well. \"We're ready for the water,\" she announced impatiently.<br>\r\n<br>\r\nJack managed to carry the bucket over to Jill without falling down the hill. He poured water over the planted spot until Jill told him to stop. It was almost immediate when the bean sprouted and then shot upward through the air!<br>\r\n<br>\r\n\"Come on!\" Jill called out, already six feet up the thick, green trunk of the beanstalk. \"Hurry, slowpoke!\"<br>\r\n<br>\r\nHe would have a talk with her when this was all done and over with. Her disrespect towards him was wearing thin. He was a detective now, not an ungraceful fairy tale character.<br>\r\n<br>\r\nAt last, they reached the top. And there, as imagined, was the giant's house in the clouds.<br>\r\n<br>\r\n[472 words]</span></div></div>",
            "created":1435208400,
            "id":1998685,
            "title":"The giants house in the clouds..."
        },
        "1413":{
            "author_id":"grcubby",
            "author_name":"Cubby ~ No Place Like Home!",
            "choices":[
                "Bean Family Reunion",
                "Mission Accomplished",
                "More Problems"
            ],
            "content":"<div class=\"\"><div> <span>The castle was huge, which of course made sense since it was built for giants. <i>But where are they</i>, Jill wondered. She definitely wasn't in any hurry to meet up with any mean giants. Hopefully,  Crown and her could find Jack Bean and bring him home quickly.<br>\r\n<br>\r\n\"You can take that helmet off now,\" Jill said. \"Just remember to put it back on once we head back down... just in case.\"<br>\r\n<br>\r\n\"You don't need to remind me,\" said Jack. \"I'm gonna leave it right here, next to the beanstalk.\"<br>\r\n<br>\r\n\"Good idea,\" said Jill. \"Now... Where should we begin? The castle?\"<br>\r\n<br>\r\n\"Sure. I wouldn't recommend calling out Bean's name though. We'll want to avoid giants at all cost.\"<br>\r\n<br>\r\n\"I agree, \"said Jill. \"Hey, what's that up ahead?\"<br>\r\n<br>\r\n\"Looks like Jack Bean to me,\" said Detective Crown. \"He's... ugh... whistling. And... skipping? Huh. He looks pretty happy. I find that weird.\"<br>\r\n<br>\r\n\"Let's go talk to him,\" Jill suggested.<br>\r\n<br>\r\nJack Bean jumped when he spotted the two detectives. \"Sorry,\" he apologized. \"I haven't seen any normal sized people since I got here. It's strange.\"<br>\r\n<br>\r\n\"Where are the giants?\" asked Jill, glancing around.<br>\r\n<br>\r\n\"Gone,\" said Bean. \"When I came back the second time around, there was a note nailed to the door. It said: <i>Vacant. Available for Free. Tenants have permanently vacated.</i>\"<br>\r\n<br>\r\n\"Good to know,\" said Crown. <br>\r\n<br>\r\n\"I'm having the time of my life,\" said Bean. \"I never want to go back down the beanstalk.\"<br>\r\n<br>\r\n\"Your mother is worried about, Jack,\" said Pain. \"You should go for a visit.\"<br>\r\n<br>\r\n\"Or bring her back up here,\" said Crown. \"She is family, you realize.\"<br>\r\n<br>\r\n\"I know, I know...\" Bean kicked a few loose stone around with his big toe.\" It's just...\" He examined the dirt under his nails. \"I have my garden to keep and baby geese to feed and... I should dust. You wouldn't believe how dusty it gets up here in the clouds. Unbelievable.\"<br>\r\n<br>\r\nJill was appalled. \"You are going to live the good life up here and leave your poor mother behind? Doesn't she deserve better than that?\"<br>\r\n<br>\r\n\"Oh, geesh, don't you think I haven't hashed that out in my brain? She's better off without me. I never could do anything right. Besides, she could never make it up that beanstalk. And I don't wanna go back to living a poor life again.\"<br>\r\n<br>\r\n\"Okay,\" said Detective Crown. \"If we can find a way to get her up here, and you stayed here the entire time, would that suit you fine?\"<br>\r\n<br>\r\nBean grinned, his eyes twinkled. \"I'd be forever grateful, sir. Hey, don't I know you from somewhere? You look familiar.\" <br>\r\n<br>\r\n[437 words]<br>\r\n</span></div></div>",
            "created":1435467600,
            "id":2000214,
            "title":"No Giants Left"
        },
        "142":{
            "choices":[
                "the three freinds talk to the seven dwarfs",
                "the three friends head into the woods to look for new clues"
            ],
            "content":"<div class=\"\"><div> <span>As Jack and Jill approached the market place, they could see it was bustling with activity.There was so much happening,were would they start?They knew someone here had to have seen or heard something,but who?They spotted the seven dwarfs trying to shop for goods,but they seemed confused and out of place without <br>\r\nSnow White.<br>\r\nJack new he needed to break this case soon to bring order back to the tales lives.With his new found determination Jack grabed Jills hand and headed to the first stand he saw,ready to extract the answers he needed by any means necessary. <br>\r\n<br>\r\nJill could see the desperation on Jacks face and new she had to intervene.\"Jack,get <br>\r\na hold of yourself.We wont get any were if you walk in there with that attitude.We have to be subtle.Remember all the fairy tale characters are counting on us.\"<br>\r\nJack lowered his head and gave a sigh of understand.With that the pair cautiously approached a long cart selling a variety of dairy products.There was so many different cheeses to choose from.They also had goats milk along with cow.It dawned on Jill that it had been some time since they had eaten,but Jack had more imported things on his mind.<br>\r\n<br>\r\nJack could see the vendor trying to sell a wedge of Brie to an elderly man.Jack recovered an old half fading picture of the famous climber of the beanstalk that the mother had given him and slowly approached the vender.He was a man of some substance,he had arms that some might say, resembled tree truncks and a face full of hair.But in spite of his stature,his big brown eyes showed kindness.Jack handed him the picture and asked if he recognized the boy.The big bearly man cried out,<br>\r\n\"why yes,that is my good friend Jack.You have his name,it is a good name!He was her but a few days ago buying milk to take home to his mother.\"<br>\r\n\"I am sorry to be the one to tell you this,\"Jack began to reply,\"but your friend never made it back home that day.Many of our fairy tale friends have gone missing,so Jill and I are on a quest to find them.\" The large man looked at Jack and Jack could see <br>\r\nfire in his eyes as the man proclaimed,\"I will go with you and help in the search,lets go,we havn't time to waste!\"<br>\r\n<br>\r\nSoon,Jack,Jill and their new found alie set out in search of clues to unlock the mystery of their missing freinds.<br>\r\n <br>\r\n</span></div></div>",
            "created":1186981200,
            "id":435476,
            "title":"The Market Place"
        },
        "1421":{
            "author_id":"jmindela",
            "author_name":"Duke Dancer",
            "choices":[
                "We're hungry!  Go get the pies and ask around some more.",
                "Jack is our first priority!  Go to the Dwarfs' Woods"
            ],
            "content":"<div class=\"\"><div> <span>The three walked through market, looking around for anyone who could tell them where Jake had gone when he'd left the market.  Seven loud voices to their right made them stop and look to see who was causing the ruckus.  Jack, Jill and their new friend waded through the crowd to see if maybe the dwarfs had any information for them.  The seven were arguing in front of a stand selling apples of all varieties.<br>\r\n<br>\r\n\"<i>Those</i> aren't any good, Doc, we should get some red ones!\"  Grumpy mumbled.<br>\r\n<br>\r\n\"But it was a red apple that poisoned Snow White!\"  Doc replied and grabbed several green apples.  <br>\r\n<br>\r\n\"Well, excuse me, um, but the poison apple was one-of-a-kind, I think.\"  Bashful tried to insert his opinion in the conversation.  All seven of them looked rather forlorn and disheveled, even Happy.  Sleepy wasn't the only one who looked exhausted, either.  The shop keeper was eying them all uncertainly, obviously wondering whether he should sell them any apples at all.  <br>\r\n<br>\r\n\"Gentlemen, is there a disagreement?\" Jill asked politely, but loudly.  Dopey gave her a lopsided grin.  <br>\r\n<br>\r\n\"Well, yes, m'lady.\"  Doc gave her a small bow.  \"We're not used to buying food, Snow White always did it for us!  And apples are so hard for us to buy, after, well, you know, but we love apple pie!\"<br>\r\n<br>\r\nJill considered the dilemma for a moment.  \"You could just buy the apple pies fresh.\"  She turned to their new friend.  \"Is there a baker in the market who sells apple pies?\"<br>\r\n<br>\r\n\"Of course!\"  he replied.  \"There's one just down--\"<br>\r\n<br>\r\n\"AAAAACHOOOOOO!\"  Sneezy sniffed, \"I'm so sorry, the flowers really bother my allergies.\"  He indicated the stall next to them.  <br>\r\n<br>\r\n\"--the other end of this road.\"  He finished. <br>\r\n<br>\r\n\"Oh yes,\"  Jack put in, \"those pies are delicious, you really ought to try them.  But before you hurry off, have you seen Jack the Beanstalk climber recently?\"  He showed them the picture.<br>\r\n<br>\r\nDoc looked at the picture for a moment.  \"I think we saw him in our neck of the Woods the other day, didn't we, boys?\"<br>\r\n<br>\r\nGrumpy snorted.  \"That wasn't him, the kid we saw was younger.\"<br>\r\n<br>\r\n\"No, no, that's definitely him,\"  Sleepy yawned.<br>\r\n<br>\r\n\"How would you know, you were sleeping!\"  Grumpy retorted.<br>\r\n<br>\r\nThe three detectives decided it was best to leave the dwarfs to their own devices and head off in search of Jack.  The other Jack rubbed his stomach, \"You know, talking about those apple pies made me hungry.  Maybe we could go get some and see if anyone else has seen Jack.\"</span></div></div>",
            "created":1188190800,
            "id":439903,
            "title":"The Argueing Dwarfs"
        },
        "14212":{
            "author_id":"jonnyprophet",
            "author_name":"Jonny Prophet",
            "choices":[
                "Quickly grab the Giant for questioning....",
                "Run in fear, not wanting to smell like the blood of Englishmen..."
            ],
            "content":"<div class=\"\"><div> <span>The trip to the Dwarf's Woods took our three detectives quite a bit of the day, the whole time Jack was pestering Jill about his growling stomach. <br>\r\n\"I'm starved!\" <br>\r\n\"Oh, be quiet.\" <br>\r\n\"NO, Like really, really starved. Like my stomach has revolted against my lungs and heart and is trying to digest them as we speak. Even a full pail of water might help. Oooh, do you....\"<br>\r\n\"Don't start with that whole pail of water thing....\" <br>\r\nBut before she could finish, all six of their ears were suddenly caught by the most beautiful song that any of them had ever heard, at least Jack or Jill. <br>\r\n\"What is that wonderful music?\" asked Jill, jaw agape. \"I don't know... but let's find it.\" <br>\r\n\"That sound's like my harp.\" Said the third, as of yet, unnamed fellow.<br>\r\n<br>\r\nJack froze realizing the implication that had just been made. \"Umm, did you say YOUR harp?\" Jill was beginning to catch on as well. The third, rather tall, thick set and hairy fellow quickly closed his mouth hoping he hadn't given too much away. <br>\r\n<br>\r\nBut you know how it goes... he had. What were Jack and Jill to do?</span></div></div>",
            "created":1188536400,
            "id":441063,
            "title":"The Magic Harp"
        },
        "15":{
            "choices":[
                "Some lovin'",
                "Help in finding Red",
                "Big secret...."
            ],
            "content":"<div class=\"\"><div> <span>\"How about we start off with Rapunzel?\" asked Jack.<br>\r\n<br>\r\nJill grinned. \"You still have the hots for her, Jack? You know that the prince gets her.\"<br>\r\n<br>\r\nJack rolled his eyes.<br>\r\n<br>\r\n\"Well,\" said Jill, \"We might as well go to the castle and see what's up.\"<br>\r\n<br>\r\nThe two soon arrived at the castle, to find a weeping prince.<br>\r\n<br>\r\n\"What's wrong?\" asked Jill kindly.<br>\r\n<br>\r\nBetween sobs, the distressed man answered, \"My beautiful woman, is gone! No one knows where she is, and I can't find her!\"<br>\r\n<br>\r\nBefore Jill could answer, they heard a noise.<br>\r\n<br>\r\nThe three turned toward the woods nearby.<br>\r\n<br>\r\n\"I may have a clue.\" said a voice. I large man wearing blue denim coveralls and a white shirt underneath, stood against a tree.<br>\r\n<br>\r\n\"Sir Woodsman McDonald!\" cried Jill.<br>\r\n<br>\r\n\"Yeah. I happened to have seen the one who carried off Rapunzel, I was near, and I saw.\" he said in a quiet, voice, that pronounced to Jill, Jack, and the prince that the woodsman wanted something in return.</span></div></div>",
            "created":1154235600,
            "id":335965,
            "title":"Prince and the Woodsman"
        },
        "151":{
            "author_id":"jacknife78",
            "author_name":"Jacknife78",
            "choices":[
                "He tells you all that he knows",
                "He wants something else too"
            ],
            "content":"<div class=\"\"><div> <span>     Jack can clearly see that the woodsman is holding out for something.  \"We would be most grateful for any information you have.\"  he says to the woodsman.  \"Is there anything we could do for you in return?\"<br>\r\n<br>\r\n     \"Well, now that you mention it,\"  says the woodsamn slyly.  \"It gets very lonely living by myself in the forest.  Some female companionship would make my life more bearable.  I remember the time I was down on my luck and had to do some nasty deeds for a queen to survive.  When she ordered me to execute a beauty as white as snow I knew I had found true love.  Too bad she had a thing for the verticially challenged.\"<br>\r\n<br>\r\n     When he notices Jill trying to unsuccessfully hide behind Jack he protests.  \"God No, I don't want you.  I want you to find me a suitible bride.  My wife to be could never have milk-maid hands from carrying a pail around all day.\"  The revoltion of that idea could clearly be seen on his face.<br>\r\n<br>\r\n     Getting indignant at the thought that she wasn't good enough for him, Jill goes to give him a piece of her mind but finds Jack's hand embedded in her mouth.<br>\r\n<br>\r\n     \"We'll do our best to find you the right woman\" Jack assures the woodsman \"Now about that information.\"</span></div></div>",
            "created":1154840400,
            "id":337611,
            "title":"Jill Is Rejected"
        },
        "1511":{
            "choices":[
                "they call all the old ladies they knew",
                "hey just forget the only eye witness and move on"
            ],
            "content":"<div class=\"\"><div> <span>The woodsman started off by saying, \"Ok here's what I saw, it was dark and foggy the night and I don't quite remeber a thing!\" Jill by this time very frustrated said in an angry tone, \"Look man are you going to tell us anything or not!?\" \"No I'm not after you spoke to me like that young lady.\" Jack tried to convice the woodsman that Jill was sorry but he said he wanted to hear Jill say it herself. So Jill mummble, \"Sorry\" the woodsman said, \"You have to say it loud and clear and like you mean it.\" Jill refused to do that!<br>\r\nThen after a couple minutes Jack got her to say veyr politly, \"I am sorry,\" for that Jack knew he owed Jill big time. Then th woodsman began again, \"Well I'd like to remember what happened on that o so dark and foggy night but I think the only thing that will help jog my memory is a lady around my age.\" Jill burt like and air ballon! \"WHAT!!! You mean I said sorry for noting!!?\" Jill just completly lost her temper. Jack was getting very annoyed himself. He thought of what to do while Jill cooled down.</span></div></div>",
            "created":1187931600,
            "id":438743,
            "title":"Sorry For Nothing"
        },
        "15112":{
            "author_id":"brielleskye",
            "author_name":"December Breeze",
            "choices":[
                "The wicked witch",
                "The dworves"
            ],
            "content":"<div class=\"\"><div> <span>Deciding the woodsman's word wasn't very reliable, they decided to move on. \"Now what?\" Jill asked.<br>\r\n<br>\r\nJack turned to the prince. \"Did anyone else ever come to visit Repunzal?\"<br>\r\n<br>\r\nThe prince stopped to think a moment, then shook his head. \"Not that i know of. She never let down her hair for anyone but me.\"<br>\r\n<br>\r\nJack nodded. \"Well, it looks like we don't have anything else here to go off of. Sorry Prince, we'll have to move on and hopefully there be a clue to Repunzal's wear-abouts at the next crime scene.\"<br>\r\n<br>\r\nFeeling hopeless, the prince nodded sadly and mounted his horse when something caught Jill's eyes. The horse was playing with something. She stepped closer to get a better look when she realized what it was. \"An apple!\" she cried.<br>\r\n<br>\r\nJill walked over and picked up the apple, examining it. \"Someone's taken a bite out of it,\" she declared, holding it out so Jack, too, could get a good look at it.<br>\r\n<br>\r\n\"Jill, it looks like you've found us a clue. I only know one person this apple could belong to. The wicked witch!\"<br>\r\n<br>\r\n\"I've seen one of the seven dworves with it too, though,\" the prince pointed out.<br>\r\n<br>\r\n\"Okay. So we'll pay the witch and the dworves a visit,\" Jack announced. \"But who first?\"</span></div></div>",
            "created":1190350800,
            "id":446412,
            "title":"First Clue"
        },
        "1512":{
            "choices":[
                "Go Good Cop, Bad Cop on the Woodsman.",
                "Ask him nicely what he saw."
            ],
            "content":"<div class=\"\"><div> <span>\"There is somthing else, I could use...to jog my memory\", the Woodsman added.<br>\r\n<br>\r\n\"And what would that be?\", Jack asked in an annoyed voice that mad Jill cringe.<br>\r\n<br>\r\nOne look at Jack's face and the Woodsman had decided that what he wanted wasn't that important. \"Uh..nevermind that, I could use a good meal...\", the Woodsman looked behind Jack where Jill was still standing.<br>\r\n<br>\r\n\"I'm not cooking for you!\", screeched Jill as she pointed her finger at the Woodsman.<br>\r\n<br>\r\nThe Woodsman moved his gaze to Jack.<br>\r\n<br>\r\n2hrs. later the Woodsman was filled with fresh stew that Jack had whipped up,\"Just to please a witness,\" although Jill had seen joy on the face of the cooking Jack.<br>\r\n<br>\r\n\"Now. Down to bussiness.\"</span></div></div>",
            "created":1185944400,
            "id":430941,
            "title":"Somthing Else"
        },
        "15121":{
            "author_id":"ang777",
            "author_name":"angel",
            "choices":[
                "the path of least resistance",
                "or the rocky road to turmoil "
            ],
            "content":"<div class=\"\"><div> <span>as soon as those words were spoken jack jumped up grabbing the wood mans axe  jill cried \"jack have you lost your mind no one  touches a wood mans axe but he who owns it <br>\r\n\"it is our only option jill\" said a nervous jack. the woodsman watched with terrified eyes as his precious axe was sullied by one who was unworthy of it but it was to late for once the axe had been tainted it was no longer use able and he was to be banned from ever owning another. jill believing politness was the only key to the answer smiled sweetly at the woodsman and said\"please give us your answer\" \"alas i have no choice  \" he replied\" go to the land of never land, there you will be given a map by the lost boys, use it well\" \"Thank you jill replied  meanwhile a stunned jack had dropped the axe knowing his actions had just cost the woodsman his livelihood he stammered an apology knowing it was worth nothing and stumbled out the door  Just befor  jill followed she gave the woodsman a quick hug without looking at his eyes. \"well time to go to never land  but wait is there anyway we can help the woodsman first\" said jack jill said \" there is fountain that will cleanse the axe but it is lost to all eyes\" and besides that is another quest So they started out to neverland when they reached the cross path  a lyrebird stood there and said you \"cannot pass until you have answered my question \"if  you had to choose which would it be</span></div></div>",
            "created":1190523600,
            "id":447054,
            "title":"the woodsmans axe"
        },
        "152":{
            "choices":[
                "Go talk to the Chapter Ninja",
                "Go in the direction the woodsman said the Ninja went"
            ],
            "content":"<div class=\"\"><div> <span>\"What do you want?\" asked Jack.<br>\r\n<br>\r\n\"Listen, I've been expecting Little Red Riding hood to come around for a long time. She hasn't. If I tell you something about the person who carried of Rapunzel, then you'll find Red for me.\"<br>\r\n<br>\r\nJack and Jill heaved a sigh of relief. They were going to find Red anyway, so this was kind of free.<br>\r\n<br>\r\n\"Ok, it's a deal,\" answered Jack, \"but tell us what we need to know.\"<br>\r\n<br>\r\n<br>\r\n\"Rapunzel was looking at the window there-\" the woodsman stopped to point, then continued, \"and I was watchin' her from behind some trees. Suddenly, this guy in all black comes running up, and climbed up the wall like a spider! He then grabbed the girl by the hair, and lowered her out the window. Then he came down, and carred her off.\"<br>\r\n<br>\r\n\"And you didn't do anything?\" asked Jack.<br>\r\n<br>\r\n\"It was quicker than lightening! For all I knew, he was the prince while he was riding up, and when he got Rapunzel down, he was off in a flash.\"<br>\r\n<br>\r\nJack scolwed. \"What did his face look like?\"<br>\r\n<br>\r\n\"He was dressed in all black, and he had a black mask covering his face. I think he was a ninja.\"<br>\r\n<br>\r\nJack and Jill gasped, then turned around to talk so the other two couldn't hear.<br>\r\n<br>\r\n\"Do you think it was the chapter ninja?\" asked Jack.<br>\r\n<br>\r\n\"It couldn't be!\" whispered Jill. \"He's such a nice guy... that is, if you do things right when you're in that group!\"<br>\r\n<br>\r\n\"Well,\" said Jack, \"We should probably</span></div></div>",
            "created":1154322000,
            "id":336088,
            "title":"News of Rapunzel's Capture"
        },
        "1521":{
            "choices":[
                "Wenston has no idea what Jill is talking about",
                "Wenston tells all!"
            ],
            "content":"<div class=\"\"><div> <span>\"Well,\" said Jack, \"We should probably go talk to the Chapter Ninja.\"<br>\r\n<br>\r\nJill nodded in agreement, and they turned toward the prince and the woodsman.<br>\r\n<br>\r\n\"Good day to you both, and we'll soon find Red, <i>and</i> Rapunzel.\" said Jack, and he and Jill went off toward the Chapter Ninja's place.<br>\r\n<br>\r\nThey soon reached the building. It was well made, and there were paths going out of the back, twisting and turning in all different directions.<br>\r\n<br>\r\nThe front sign said, \"Pathfinders\".<br>\r\n<br>\r\nJack banged on the door. It opened wide, to show a grinning man.<br>\r\n<br>\r\n\"Are you Wenston, leader of the Pathfinders?\" asked Jack.<br>\r\n<br>\r\n\"Yes.\"<br>\r\n<br>\r\n\"We need to talk to your Chapter Ninja.\"<br>\r\n<br>\r\n\"Uh...\" said Wenston, the grin dropped from his face, and he seemed very nervous, \"He- he's not here right now.\"<br>\r\n<br>\r\nJack frowned. \"The Chapter Ninja is always here. Are you hiding something?\"<br>\r\n<br>\r\nWenston looked even more uncomfortable. \"Of course not.\" he said though, trying to sound calm.<br>\r\n<br>\r\nJill walked forward. \"He may not be here, but we must see this wonderful place!\" she said eagerly.<br>\r\n<br>\r\nWenston sighed, then said, all right, come in.<br>\r\n<br>\r\nJack and Jill walked in.<br>\r\n<br>\r\n\"Where is everybody?\" asked Jack, looking around.<br>\r\n<br>\r\n\"Finding paths.\" answered Wenston.<br>\r\n<br>\r\n\"Hey, what's this?\" asked Jill.<br>\r\n<br>\r\nWenston and Jack ran toward her. She was holding a black suit. She grinned. \"I knew it! Wenston, you ARE the Chapter Ninja!</span></div></div>",
            "created":1154322000,
            "id":336092,
            "title":"Chapter Ninja and the Pathfinders"
        },
        "15211":{
            "author_id":"lorasummers",
            "author_name":"Lora",
            "choices":[
                "decides to confront Wenston about his obvious lie",
                "pulls out her wicked ninja style fighting to push Wenston against a wall"
            ],
            "content":"<div class=\"\"><div> <span>\"Jill, please I'm almost forty years old!\" Wenston looked at Jill with a disgruntled look and took the ninja suit from her hands. \"The truth is, our Chapter Ninja went out looking for the perpetrator of these terrible deads. I didn't want to tell you that, cus a lot of eyewitnesses have claimed to see a man in black carrying off the heroes. Our chapter ninja wanted to clear his name. I'm sorry Jill, but I have no idea where this suit came from.\"<br>\r\n<br>\r\nJill exchanged a look of disbelief with her partner Jack, surely he was lying. Everyone knew the Chapter Ninja was a selfish person. Jill smiled really big at Wenston and,</span></div></div>",
            "created":1157086800,
            "id":343665,
            "title":"Selfish Ninjas"
        },
        "15212":{
            "author_id":"wenston",
            "author_name":"Wenston",
            "choices":[
                "Run outside to follow the Ninja.",
                "Go back and talk to the Woodsman."
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, the man they thought was Wenston let out a manical laugh.  Jack and Jill exchanged an odd look with each other.  \"What are you laughing at?\" Jill demanded.  \"You're under arrest, that's no laughing matter!\" <br>\r\n<br>\r\nThe man grinned and pointed a finger at her.  \"You got one thing right,\" he said.  \"I am the Chapter Ninja.  But I am not Wenston!\" <br>\r\n<br>\r\n\"You lied to us?\" Jack asked.  \"Why?\" <br>\r\n<br>\r\nThe Chapter Ninja ran forward, stealing the black outfit right out of Jill's hands.  She gasped, realizing just how right the Woodsman was about how quick that blasted Ninja could be.  Jack and Jill turned around and to their surprise, the Ninja was already dressed up in his outfit.  <br>\r\n<br>\r\n\"Why did I lie?\" the Chapter Ninja said, pulling his katana out and pointing it at them.  \"Because I work for someone who would loathe you knowing their true identity.\" <br>\r\n<br>\r\n\"Who do you work for?\" Jack demanded, angered that they'd been tricked. <br>\r\n<br>\r\nBut Jill had caught on right away.  \"You work for Wenston,\" she said, eyeing the Chapter Ninja suspiciously.  <br>\r\n<br>\r\n\"Smart girl,\" the Chapter Ninja observed.  <br>\r\n<br>\r\n\"Why is Wenston kidnapping the Fairy Tale heroes?\" Jack asked. <br>\r\n<br>\r\n\"Who says she is?\" <br>\r\n<br>\r\n\"She?!\" Jill and Jack said at the same time. <br>\r\n<br>\r\n\"I've said too much!\" the Ninja yelled and threw down a smoke screen.  Jack and Jill coughed.  When the smoke cleared, the Chapter Ninja was nowhere to be seen. </span></div></div>",
            "created":1154322000,
            "id":336235,
            "title":"The Evil Wenston"
        },
        "152121":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Go in search of the mysterious Pathfinders",
                "Curse Wenston som more and then do something"
            ],
            "content":"<div class=\"\"><div> <span>The pair ran outside but it was too late. The chapter Ninja was no where to be seen.<br>\r\n<br>\r\n\"Damn, that Ninja sure is fast.\" said Jill as she lifted up a toadstool looking for him.<br>\r\n<br>\r\n\"He was our only lead. Now how will we find that evil Wenston and the fairytale characters.\" said Jack in Frustration.\"<br>\r\n<br>\r\n\"At least we know its Wenston. Perhaps we can find him by finding another one of the Pathfinders.\"<br>\r\n<br>\r\nJack fell to his knees tearing his shirt and pulling at his hair.<br>\r\n<br>\r\n<br>\r\n\"DAMN YOU WENSTON!!!!!!!\"</span></div></div>",
            "created":1154408400,
            "id":336438,
            "title":"Damn uo Wenston! Damn you!"
        },
        "1521211":{
            "choices":[
                "Kayla",
                "A Wizard's Secret"
            ],
            "content":"<div class=\"\"><div> <span>\"We must look for some Pathfinders.\" said Jill resolutely.<br>\r\n<br>\r\nShe and Jack went to the back of the building where there were signs.<br>\r\n<br>\r\nJack began to read a few of them.<br>\r\n<br>\r\n\"Kayla, by Mystic, or Dog Freek.<br>\r\n<br>\r\nA Wizards Secret, by Jamey Dallas.\"<br>\r\n<br>\r\nWhich one should we go down? Asked Jack, who seemed at his wits end.</span></div></div>",
            "created":1154408400,
            "id":336630,
            "title":"Finding Pathfinders"
        },
        "15212111":{
            "choices":[
                "Dog Freek runs away",
                "Mystic talks to Jack and Jill"
            ],
            "content":"<div class=\"\"><div> <span>\"Well,\" said Jill, \"This seems pretty short. We might as well find the person who started this path.<br>\r\n<br>\r\nThat's weird. She has two names! What do you think of that, Jack?\"<br>\r\n<br>\r\nThe two started down the path.<br>\r\n<br>\r\n\"I have no idea. Do you think she has a dual personality?\"<br>\r\n<br>\r\n\"Maybe... Maybe we should've gone down the Wizards secret.\"<br>\r\n<br>\r\nSuddenly, the trail stopped, and turned into several trails. \"Just the trick a Pathfinder would pull.\" muttered Jack.<br>\r\n<br>\r\nAfter a few minutes of arguing, they decided to go down one of the more traveled paths. Then they heard something.<br>\r\n<br>\r\nQuietly, the came up on someone, who seemed to be writing on a sign. She was clearly a Pathfinder.<br>\r\n<br>\r\n\"Mystic or Dog Freek!\" called Jill, \"We need to speak with you about your leader!\"</span></div></div>",
            "created":1154494800,
            "id":336632,
            "title":"Searching for the double-named one"
        },
        "152121111":{
            "author_id":"rainangel",
            "author_name":"Professor Q",
            "choices":[
                "Quaddy's World- \"The Sword's Edge\"",
                "Wenston's World- \"My Dark Angel\""
            ],
            "content":"<div class=\"\"><div> <span>Dog Freek looked at Jack, then Jill, and ran, tearing through the forest and disappearing into the mists that suddenly sprang up from the previously sunny clearings.  \"God!\"  Jack spat out a curse and started after her.  Only Jill's hand on his shoulder kept him from entering the oh-so-spooky woods.<br>\r\n<br>\r\n\"Don't go after her!  Look!  These mists just suddenly rose out of nowhere!  Do you really think we'll be able to find her?  These Pathfinders clearly have some special powers.\"<br>\r\n<br>\r\nJack scoffed.  \"More like they're covering up the horrendous kidnapping of our beloved Fairy Tale heroes and protecting their own!\"<br>\r\n<br>\r\n\"Like the blue wall of silence, or some such nonsense...\"  Jack looked over at Jill, his eyebrow quirked, and Jill gave a slight shrug.  \"What?  You've never watched Law and Order?  Any time a cop did something, his fellow cops would always protect him.  It's the blue shield...wall...some such nonsense.\"<br>\r\n<br>\r\n\"Law and Order, hmm?  Isn't that the one with the sound effect?\"<br>\r\n<br>\r\nJill nodded, and the two started down the path, looking for the next branch in the road.  \"Bom bom!\"<br>\r\n<br>\r\n\"No, it's definitely more of a boink boink...\"  <br>\r\n<br>\r\n\"Nuh uh!\"  Jill looked at Jack in disgust.  \"You are a complete and total idiot, Jack.  I just want you to know that.\"<br>\r\n<br>\r\nJack shrugged.  \"Whatever!  Oh, look, a crossroads.\"<br>\r\n<br>\r\n\"Oh no!  It looks like we have to go into the lands of the higher ratings.  I don't know, Jack...should we risk it?\"<br>\r\n<br>\r\n\"I think we have to.  This Quaddy chick, I think she and Wenston have known each other quite a while.  It behooves us to explore her world.\"<br>\r\n<br>\r\nJill shook her head.  \"No.  Look.  The other one is Wenston's own higher-rated story!  He might be down that path!\"<br>\r\n<br>\r\n\"Too obvious...\"<br>\r\n<br>\r\n\"I don't think so...\"</span></div></div>",
            "created":1155099600,
            "id":338146,
            "title":"Of Sound Effects and Higher Ratings"
        },
        "1521211111":{
            "author_id":"rainangel",
            "author_name":"Professor Q",
            "choices":[
                "Ask about Wenston",
                "Ask about the missing Fairy Tales"
            ],
            "content":"<div class=\"\"><div> <span>Jill sighed.  \"Fine.  Let's go to 'The Sword's Edge'.  It might be safer in the end.  Crazy vampires or people trying to save their land from foreign invaders?  Faeries or Werewolves?\"<br>\r\n<br>\r\n\"I'm all for Faeries,\" Jack replied.<br>\r\n<br>\r\nHeading down the path, the trees became more verident, resplendent in their summer foliage, and the temperature became decidedly more refreshing.  For a land supposedly war-torn, this place wasn't bad at all.<br>\r\n<br>\r\n\"Hello.\"  A voice from within the trees disturbed them, and a young woman stepped over the roots and onto the path.  \"Can I help you?\"<br>\r\n<br>\r\nJill replied.  \"Yes.  Is this Brynvyr?\"<br>\r\n<br>\r\nThe woman nodded.  \"Indeed.  And why have you come to my little corner of the Paths?\"<br>\r\n<br>\r\n\"You're Quaddy?\"  Jack was shocked.  \"Why are you dressed like you live here, then?\"<br>\r\n<br>\r\nQuaddy laughed.  \"It's easiest when I want to blend in and make sure people are taking care of my baby.  It's the only Path I've got.\"<br>\r\n<br>\r\n\"Really?  We figured someone so close to Wenston would have several...\"<br>\r\n<br>\r\nLooking around, Quaddy gave another chuckle.  \"I'm into a Path of a different kind- a circular one.  I joined this out of respect for Wenston.\"<br>\r\n<br>\r\n\"Speaking of Wenston.  We're looking for him.  Have you heard or seen him any time in the last few days, or have any idea where he might be?  Some of Fairy World's heroes have gone missing and we believe he might have something to do with it.\"<br>\r\n<br>\r\nAt this, Quaddy gave a booming laugh and reached up to wipe a tear from her eye.  \"One.  Yes, I have seen Wenston in the last couple of days.  Two.  I knew about the disappearing heroes and Wenston has nothing to do with it.  Three.  Wenston isn't a he.  Wenny is a she.\"<br>\r\n<br>\r\nJack and Jill's jaw dropped open.  \"What?\"<br>\r\n<br>\r\n\"Yeah.  Wenston is a girl.\"</span></div></div>",
            "created":1155099600,
            "id":338150,
            "title":"A Shocking Revelation"
        },
        "152121112":{
            "choices":[
                "Wenston's Port!",
                "Wenston's Path!"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah?\" asked the girl.<br>\r\n<br>\r\n\"Where is this 'Wenston'?\"<br>\r\n<br>\r\n\"Well,\" she answered, thinking, \"I'm not sure. She tends to add to the paths a lot. It could be any path. You might find her in her home though.\"<br>\r\n<br>\r\nJack and Jill were embarrased they had both thought \"her\" a \"him\". Now they knew otherwise <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/wink.png\" alt=\"*Wink*\" title=\"Wink\" border=\"0\" width=\"15\" height=\"15\">.<br>\r\n<br>\r\n\"Where is her home?\" asked Jill.<br>\r\n<br>\r\n\"You can find it if you go straight north from the main group building. You will recognise it easily: the house is painted yellow and there's a sign up that says 'What's that funky smell?'\"<br>\r\n<br>\r\n\"Thanks\" said Jill politely, and she and Jack turned around to speak to each other.<br>\r\n<br>\r\n\"Let's go to another path!\" said Jack.<br>\r\n<br>\r\n\"I think we should go to Wenston's home.\" snapped Jill.</span></div></div>",
            "created":1156309200,
            "id":341363,
            "title":"Path or Port?"
        },
        "1521211121":{
            "choices":[
                "Back to the Pathfinders' main building and some paths",
                "Ask some people around town what they know about the ninja"
            ],
            "content":"<div class=\"\"><div> <span>Jack and Jill argued for several minutes, watched closely by Dog Freek, but finally Jill won, and they headed off to Wenston's home.<br>\r\n<br>\r\nThey DID find it easily. Like Dog Freek had said, it was painted bright yellow, and there was a very funny, very obvious sign up that demanded to know what that smell was.<br>\r\n<br>\r\nJill knocked on the door. It opened as she knocked. The two went in, and soon found a Guestbook.<br>\r\n<br>\r\nJill immediately began signing it.<br>\r\n<br>\r\n\"What are you doing???\" asked Jack.<br>\r\n<br>\r\n\"I'm signing the guestbook, whadoya think I'm doing??\"<br>\r\n<br>\r\n\"Why?\"<br>\r\n<br>\r\n\"Because I might get a merit badge!!\"<br>\r\n<br>\r\nJack rolled his eyes, and looked around while Jill finished signing.<br>\r\n<br>\r\nA few people were walking around, some were reading the many stories and poems, some seemed to be writing notes to the Pathfinders' leader, and some looked kind of lost.<br>\r\n<br>\r\n\"Wenston isn't here. We might as well go somewhere else.\" Jack said.</span></div></div>",
            "created":1156309200,
            "id":341366,
            "title":"Wenston's Port!"
        },
        "15212111211":{
            "choices":[
                "Go to the city for people who know Wenston",
                "Go to the other path"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jack and Jill, after seeing that Wenston wasn't at the port, ran back to their spot.<br>\r\n<br>\r\n\"Where will we go now?\"</span></div></span></div>",
            "created":1435467600,
            "id":2000232,
            "title":"Where to go next?"
        },
        "1522":{
            "author_id":"mystdancer50",
            "author_name":"DragonWrites~The Fire Faerie~",
            "choices":[
                "\"Oh, ho! It's the seven dwarfs, Jill!\"",
                "\"Seven? Why, it's the seven dwarfs,Jack!\""
            ],
            "content":"<div class=\"\"><div> <span>\"You know,\" said Jill with a little giggle as they entered the dark wood. \"Rapunzel was a good choice to start with. She should be rather easy to find.\"<br>\r\n<br>\r\n\"Why would you say that?\" Jack demanded as the world around them grew darker and darker.<br>\r\n<br>\r\n\"Well, her hair, obviously.\" Jill replied. \"Surely that long trail of hair would be too cumbersome to carry all at once. It's probably trailing miles behind them like a line of golden paint.\"<br>\r\n<br>\r\n\"Uh, Jill,\"<br>\r\n<br>\r\n\"And I'm sure you remember her horrid singing voice. Why, if the kidnapper hasn't covered her mouth, she could just hit that high note she's so fond of.\" Jill giggled again.<br>\r\n<br>\r\n\"Jill...\"<br>\r\n<br>\r\n\"And maybe, just maybe, her singing and long hair would make the kidnapper tire of her and she'll be left in this dark forest to weep and wait for you to rescue her, Jack. How would that be?\" Jill quipped, a small smile on her lips.<br>\r\n<br>\r\n\"Jill, now is not the time, I assure you.\" Jack said as he halted. \"We're being watched.\"<br>\r\n<br>\r\n\"Are we?\" Jill glanced around. She hadn't realized how far in they had gone or how dark it was getting but now she saw that she could only see a few feet in front of her.<br>\r\n<br>\r\n\"You are!\" came the hissing response to her left.<br>\r\n<br>\r\n\"Don't sneak up on me like that!\" Jill shouted, though she honestly didn't know who she was shouting at.<br>\r\n<br>\r\n\"Why not?\" came another voice in front of her and Jack.<br>\r\n<br>\r\n\"Because...I'm a lady,\" she said as she crossed her arms. Jack glanced at her over his shoulder and shook his head.<br>\r\n<br>\r\n\"A lady? You hear that, boys? We got a lady in our midst!\" came a voice behind her and laughter, harsh and rough, rose up all around them.<br>\r\n<br>\r\n\"How many of you are there?\" Jack demanded. He was surprised when they answered but no longer fearful.<br>\r\n<br>\r\n\"Seven.\"</span></div></div>",
            "created":1190264400,
            "id":446123,
            "title":"To the woods"
        },
        "15221":{
            "author_id":"mystdancer50",
            "author_name":"DragonWrites~The Fire Faerie~",
            "choices":[
                "Leave the forest",
                "Take your chances with the dwarfs"
            ],
            "content":"<div class=\"\"><div> <span>\"What of it?\" another voice demanded. \"Who are you, anyway?\"<br>\r\n<br>\r\n\"Why, I'm Jack Crown!\" Jack said with a flourish. \"And this is Jill Pail.\"<br>\r\n<br>\r\n\"Jack and Jill, huh? Any tumbles down hills lately?\" laughed another voice to their right.<br>\r\n<br>\r\n\"That was a one time thing...\"Jack insisted.<br>\r\n<br>\r\n\"A tumble down a hill with a lady no less!\" said the original speaker to their left. \"What are you doing in our forest?\"<br>\r\n<br>\r\n\"Looking for a man dressed in all black dragging a blond-haired beauty in his wake,\" Jack said as he turned a full circle, speaking to all sides.<br>\r\n<br>\r\n\"We're looking for a man dressed in red that stole Snow White from the cottage.\" the  dwarf to the left spoke again.<br>\r\n<br>\r\n\"What's your name?\" Jill asked as she faced the general area of the speaker.<br>\r\n<br>\r\n\"Grumpy, of course,\" he huffed. \"What's it to you?\"<br>\r\n<br>\r\n\"Just simplifying things a bit,\" Jill answered.<br>\r\n<br>\r\n\"Now, Snow White was a lady...a princess. You're just a girl in our forest without permission.\"<br>\r\n<br>\r\n\"Look, this is getting us nowhere. Did a man pass through here with a blond-haired angel or not?\" Jack demanded and Jill looked at him with a raised eyebrow.<br>\r\n<br>\r\n\"You do realize that the prince gets the girl in the end, right?\" Grumpy asked and Jack clenched his fists. \"We didn't see no man in black with a blond-haired girl in tow. Now leave or forest.\"<br>\r\n<br>\r\n\"Or?\"<br>\r\n<br>\r\n\"Or we dwarfs stop playing nice.\"</span></div></div>",
            "created":1190264400,
            "id":446126,
            "title":"The Dwarfs"
        }
    },
    "info":{
        "author_id":"wenston",
        "author_name":"Wenston",
        "brief_description":"The most prominent names in Fairy Tales have gone missing.  Chaos ensues.",
        "created":1153335600,
        "description":"<td align=\"left\" class=\"norm\"><div align=\"center\"> ** Image ID #1133809 Unavailable ** <br>\r\n<br>\r\n<br>\r\n<b>Fairy Tales' Most Wanted</b></div><br>\r\n<br>\r\n<br>\r\nThe most prominent names in Fairy Tales have suddenly gone missing.  In their absence, the Tales have errupted into chaos.  Who's taking the beloved characters?  How will we get them back?<br>\r\n<br>\r\nFollow Detectives Jack Crown and Jill Pail as they travel through the most famous Fairy Tales looking for clues to who the culprit could be while at the same time trying to restore order to the upturned Tales.  It may be scary, it may be funny, it may be mysterious, but the Jack and Jill will do anything to ensure the Fairy Tales have their Happily Ever Afters. <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><b><u>The Missing Heroes</u></b><br>\r\n<i>The following is a list of all known missing Fairy Tale characters.<br>\r\nIf you should happen to locate one, please contact the Bureau of<br>\r\nHero Rights immediately.</i></div><br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Peter Pan, of Neverland<br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Jack, the Giant Killer. <br>\r\n          <i>last known whereabouts:</i> Climbing his Beanstalk<br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Thumbelina and husband, Tom Thumb<br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Snow White, fairest in all the land<br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> The Pied Piper, exterminator extraordinaire<br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Rapunzel<br>\r\n          <i>last known whereabouts:</i> locked in her tower<br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Hansel and Grethel<br>\r\n          <i>ran out of bread crumbs to follow</i><br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> The Shoemaker<br>\r\n          <i>reported missing by his elves</i> <br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Goldilocks<br>\r\n          <i>Three bears claim their innocence</i><br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Little Red Riding Hood<br>\r\n          <i>never made it to Grandma's house</i><br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Puss in Boots<br>\r\n          <i>the boots are in evidence</i><br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Rumpelstiltskin<br>\r\n          <i>no one uttered his name</i><br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Billy Goats Gruff<br>\r\n          <i>last known whereabouts:</i> the Greener Grass on the other side<br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Ugly Duckling, of Swan Lake<br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Cinderella<br>\r\n          <i>left behind her glass slipper</i><br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Frog Prince<br>\r\n          <i>never been kissed</i><br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> The Emperor<br>\r\n          <i>still wearing his new clothes</i><br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> The Princess<br>\r\n          <i>last known whereabouts:</i> making pea soup<br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Sleeping Beauty<br>\r\n          <i>taken from her bed</i><br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Three Little Pigs, architects and construction specialists<br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Alice, of Wonderland<br>\r\n<br>\r\n<img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bullet.png\" alt=\"*Bullet*\" title=\"Bullet\" border=\"0\" width=\"15\" height=\"15\"> Pinocchio<br>\r\n          <i>never got to be a real boy</i><br>\r\n<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" width=\"90%\" style=\"position:relative;\" class=\"norm\"><tr><td align=\"center\" valign=\"middle\" width=\"56\" style=\"position:relative;\"><div style=\"position:relative;\"><a rel=\"awardlightbox\" title=\"... About this awardicon ...\n\n Given by haremprincess \n\n Given to wenston \n\n Date Awarded: August 1, 2006\" href=\"https://www.Writing.Com/main/awardicons.php?action=show_case&amp;award_id=110686\"><img src=\"https://images.Writing.Com/imgs/writing.com/writers/awardicons13/plaque_oval-200.png\" align=\"center\" border=\"0\" valign=\"middle\" width=\"50\" height=\"62.5\"></a></div><script><!-- \n\n\t$(\"body\").on(\"click\", \"a[rel='awardlightbox']\", function (event) { if (event.clicked) { return; } event.clicked= true; event.preventDefault();\n\tvar options = { onClosed: function () { $('.awardLightBox').attr('skipGo', '0'); }, \n\thref:$(this).attr(\"href\"), maxWidth :'515px', maxHeight :'400px', innerWidth :'85%', innerHeight :'85%', initialWidth :'400px', initialHeight :'200px', iframe:true, fixed :true, speed :100, fadeOut :50, opacity :.6 }\n\tif (parent) { if (parent.parent && parent.parent.$.colorbox) { parent.parent.$.colorbox(options); } else { parent.$.colorbox(options); } } else { $.colorbox(options); } });\n\t\n\n//--></script></td><td align=\"center\" valign=\"middle\" width=\"63\" style=\"position:relative;\"><a style=\"padding:0px 0px 0px 0px;\" target=\"_top\" href=\"https://www.Writing.Com/main/handler/item_id/1137521-Pathfinders\"><img src=\"https://images.Writing.Com/imgs/writing.com/writers/icon-4200.gif\" border=\"0\" width=\"30\" height=\"25\" valign=\"middle\" align=\"center\"></a></td><td align=\"left\" class=\"norm\" style=\"padding-left:15px;color:#000000;\"><a href=\"https://www.Writing.Com/main/handler/item_id/1137521-Pathfinders\" target=\"_top\" class=\"blue2roll\" style=\"font-weight:bold;font-size:1.3em\">Pathfinders</a> <a title=\"\" href=\"https://www.Writing.Com/main/handler/item_id/1137521-Pathfinders\" target=\"_blank\"><img style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a> (<a class=\"blue2roll\" href=\"javascript:LaunchPop('https://www.Writing.Com/main/tools.php?action=pop_rhelp&amp;crating=10',%20'crhelp10',%20'500',%20'350');\">E</a>)<br>-On hiatus-<br><b>#<span class=\"selectAll\">1137521</span></b> by <span class=\"noselect\" style=\"cursor:pointer;\" oncontextmenu=\"uport_ajax_rt_opts (event, this, 'wenston', '', '', '', '10', '', 'OFF', '100023441'); hide_uport (); this.shown=1; return false;\" onclick=\"uport_ajax_opts (event, this, 'wenston', '', '', '', '10', '', 'OFF'); hide_uport (); this.shown=1;\"><a title=\"Username: wenston\r\nMember Since: February 10th, 2001\r\nClick for links!\" style=\"line-height: 1em;font-size:1em;font-weight:bold;cursor:pointer;\">Wenston</a></span> <span class=\"noPrint\">(<a title=\"View wenston's Community Recognition\" class=\"blue2roll\" rel=\"nofollow\" href=\"javascript:LaunchPop('https://www.Writing.Com/main/authors/action/overall/user_id/wenston',%20'CommunityR_100023441',%20'400',%20'650')\">221</a>)</span> <a class=\"imgLink imgPortLink\" onmousedown=\"if(event.which == 3) { event.preventDefault(); var mywin = window.open('https://www.Writing.Com/main/portfolio/view/wenston','_blank'); mywin.focus (); event.stopPropagation(); return false; }\" href=\"https://www.Writing.Com/main/portfolio/view/wenston\" target=\"_top\" onmouseover=\"uport_ajax2 (event, this, 'wenston', '&lt;span style=\\'color:#990000;font-weight:bold\\'&gt;Offline or Private&lt;/span&gt;&lt;br&gt; Last On:  1/30/20', '1/30/20', 'February 10, 2001', '', '', '10', 'Registered Author');\" onmouseout=\"hide_uport ();\"><span style=\"padding:0px 2px 0px 0px;vertical-align:middle;\"><img src=\"https://images.Writing.Com/imgs/writing.com/writers/costumicons/ps-icon-regular-10.gif\" width=\"30\" height=\"15\" border=\"0\"></span></a><a rel=\"nofollow\" onmousedown=\"if(event.which == 3) { event.preventDefault(); LaunchPop('https://www.Writing.Com/main/em/action/new/toid/100023441',   'mess100023441_1590671301', '710', '540');  event.stopPropagation(); return false; }\" href=\"https://www.Writing.Com/main/em/action/new/toid/100023441/in/1\" target=\"_top\" title=\"Email User: wenston [Offline / Private]\" class=\"imgLink imgPortLink noPrint\"><span style=\"vertical-align:middle;padding:0px 0px 0px 0px;\"><img src=\"https://images.Writing.Com/imgs/writing.com/writers/mail-off.gif\" width=\"22\" height=\"15\" border=\"0\"></span></a><span class=\"noPrint\"><span id=\"new_ffwenston\"><a class=\"imgLink\" style=\"cursor:pointer;\" onclick=\"doAjaxO('ffwenston', '', 'post', 'https://www.Writing.Com/main/my_favorites.php', 'action=fanfav&amp;fav=1&amp;user_id=100023441&amp;nopad=1&amp;new=1&amp;ajax=new_ffwenston');\" rel=\"nofollow\" title=\"Click to add wenston to 'My Favorites'. \r\nClick again to become a 'Fan'. \"><span id=\"ffwenston\" style=\"padding:0px 3px 0px 3px;vertical-align:middle;\"><img border=\"0\" src=\"https://images.Writing.Com/imgs/writing.com/writers/favplus.gif\" style=\"padding-right:1px;\" width=\"15\" height=\"15\"></span></a></span></span></td></tr></table><br>\r\n<br>\r\n <a rel=\"badgelightbox\" href=\"https://www.Writing.Com/main/badges.php?action=show_badge&amp;id=115913\"><img border=\"0\" alt=\"Merit Badge in Interactives\n[Click For More Info]\n\nFor the creation of the group  Pathfinders \" src=\"https://images.Writing.Com/imgs/writing.com/writers/badges/type-Interactives-2180.gif\" width=\"100\" height=\"100\" valign=\"absmiddle\"></a> <script><!-- \n\n$(\"body\").on(\"click\", \"a[rel='badgelightbox']\", function (event) { if (event.clicked) { return; } event.clicked= true; event.preventDefault(); var options = {href:$(this).attr(\"href\"), maxWidth :'500px', maxHeight :'600px', innerWidth :'85%', innerHeight :'85%', initialWidth :'400px', initialHeight :'200px', iframe:true, fixed :true, speed :100, fadeOut :50, opacity :.6 }\nif (parent) { if (parent.parent && parent.parent.$.colorbox) { parent.parent.$.colorbox(options); } else { parent.$.colorbox(options); } } else { $.colorbox(options); } });\n\n\n//--></script></div></td>",
        "id":1133792,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1435513980,
        "modified":1435513980,
        "pretty_title":"Fairy Tales' Most Wanted"
    }
}