{
    "chapters":{
        "1":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "season 1",
                "Season 2",
                "Season 3",
                "Season 4"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>starting off, what season do you want to go to?</span></div></span></div>",
            "created":1262667600,
            "id":816171,
            "title":"starting point"
        },
        "11":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "Sora",
                "Mimi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>there's two choices in this one, so choose a character</span></div></span></div>",
            "created":1262667600,
            "id":816191,
            "title":"season 1"
        },
        "111":{
            "author_id":"jhoelpika",
            "author_name":"Jhoel",
            "choices":[
                "Lll",
                "Iskakak"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Isksksksns</span></div></span></div>",
            "created":1599862620,
            "id":2901340,
            "title":"Soraisksnskils"
        },
        "12":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "Kari (a season 1 character) (season 2)",
                "Yolei",
                "Sora (season 2)",
                "Mimi (season 2)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Season 2 has the two characters from season 1, but older. so click and choose</span></div></span></div>",
            "created":1262667600,
            "id":816197,
            "title":"Season 2"
        },
        "122":{
            "choices":[
                "find her in the digi-world",
                "find her in the real world"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do you come across the glasses-wearing lady.</span></div></span></div>",
            "created":1297314000,
            "id":1051641,
            "title":"Yolei"
        },
        "124":{
            "author_id":"theman",
            "author_name":"The Man",
            "choices":[
                "Begin the tickle again",
                "Talk to her",
                "Joe shows up from nowhere"
            ],
            "content":"<div class=\"\"><div> <span>Mimi was a girl from season one who moved to America later on. She occasionally returns to help out. She now wears white shorts and her hair has been dyed pink. Best of all, she wears a blue t-shirt that stops short, revealing her belly button.<br>\r\n<br>\r\nYou begin tickling her in the forest where nobody else is around. You grab her belly and begin tickling it quickly and heavily. She laughs her head off as you smile brightly. Her hair waives in the air and you show no signs of stopping the tickling.<br>\r\n<br>\r\n\"OHOHOH NO PLEASE NOO!\" The beautiful pinkette shouts as you keep tickling. Her shirt rides up a little more and you can see that her midriff is very well-toned and smooth. You continue the tickling for a while longer before you decide to give her a break since it looks like she'll die!<br>\r\n<br>\r\n\"Thanks, cutie.\" She tells you. You blush at the comment. \"Awww, you're blushing!\" She laughs as she closes up to you and lies down on her back, looking up at you. \"So....\"<br>\r\n<br>\r\nYou lie down, with your head on her belly. She allows is and giggles a little. She takes her hand and strokes your head with it. SHe doesn't seem to mind that your hair is on her belly. As she breathes, her belly gets bigger and smaller which causes your head to go up and down. Her belly is pretty cold but you don't care, you're lucky to be keeping your head on it.</span></div></div>",
            "created":1280725200,
            "id":928644,
            "title":"Mimi (season 2)"
        },
        "1242":{
            "author_id":"gamerdude",
            "author_name":"Forte",
            "choices":[
                "Tickle her belly like before",
                "Give her a Belly message"
            ],
            "content":"<div class=\"\"><div> <span>To think such a beautiful girl would let some guy come around and tickle her for no reason, goes to say she must know your not a bad person and the fact that she letting you lay your head on her cute stomach she just might like you,<br>\r\n<br>\r\nYou lift you head of her belly and start to think of something fun to do for both of you, and you think of the perfect solution! Mimi sit back on her butt use her two hand to support her from laying down.<br>\r\n<br>\r\n\"Hey, I got a little wager \" Mimi look intriuged \"OK what?\" she says \"Your one of the beautiful girls I like\" Her face turns red \"I like hearing your laugh\" you said as you poke your finger in her belly button making her stiffled giggle \"So I like to continue this a little more......but I'il make worth you'r while\"<br>\r\n<br>\r\nShe seems really confused. \"You know those chocolate covered rice balls? I'll buy you as many as you want if you let me play with you belly \" <br>\r\n\"Really I love those!......but wait how do I know you will buy them?\"<br>\r\nYou show her you wallet filled with yen from the summer jobs you do \"There's your proof if you let me do ANYTHING to your belly..\" <br>\r\n<br>\r\n\"Anything..\"?  Mimi seems a little nervous......careful how you say things..<br>\r\n'What I mean is if it make you feel good not me..\"<br>\r\n\"OH\" you see relief express on Mimi's face \"Well I hope this fetish of yours will be worth your month salary\" she teased<br>\r\nOh, it so worth it you say in your head.<br>\r\n<br>\r\nMimi lays on her back like before,she put's her hand behind her head and arch her belly to you as in egging you on to do things to that sexy well toned smooth belly of hers</span></div></div>",
            "created":1299646800,
            "id":1067551,
            "title":"it a Win-Win"
        },
        "12422":{
            "author_id":"murdergore",
            "author_name":"C.Jackson",
            "choices":[
                "Blow a loud raspberry on her stomach"
            ],
            "content":"<div class=\"\"><div> <span>She lies primed in position expecting full torture. You have other ideas of course. You gently place your knuckles above her bellybutton, antipication follows, you gently begin to massage her stomach. She moans a little expecting a little tickling, but as it went on it was divine heaven his hands curing the stresses of the digital world. This feeeellllllllllssssss so good. She wondered, Palmon needs some of this. Soon she was sound asleep, slumped down and began snoring. However you had other plans.</span></div></div>",
            "created":1586634180,
            "id":2817276,
            "title":"Give her a Belly message"
        },
        "13":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "Rika",
                "Jeri"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>there's two choices in this, like season 1. so go ahead and choose a character</span></div></span></div>",
            "created":1262667600,
            "id":816188,
            "title":"Season 3"
        },
        "131":{
            "author_id":"ssj3adean",
            "author_name":"ssj3Adean",
            "choices":[
                "You tickle Rika",
                "Rika tickles you",
                "You talke to Rika"
            ],
            "content":"<div class=\"\"><div> <span>You were sitting by a lake in the park. It was late and all you were doing was chucking stones into the water. \"Man. Just boring old life as usual.\" You said to yourself. \"Ever since that giant blob, whatever they called it, was destroyed, there hasn't been much excitement.\" Suddenly, you feel something furry lightly tickle your side. You yelp and jump up being super ticklish. When you look back around to see what's going on, you see a squrel rummaging through your back pocket while its tail involuntarily flickers around. It pulls out the last little remains of a candy bar you were eating. \"Hey get outta there!\" You yell at it as it pulls out that last bit and starts running. \"Hey you bushy tailed rat that's my last peice of candy! Come back!\" You yell out to it. Just when you decide to go after it, you see the squrel dart up a tree and escape your sight. \"Darn it.\" You say sitting back down. Just then you hear light, girlish giggles come from behind you. You turn and see a girl looking around your age leaning against a tree with purple eyes, red hair that seems to be tied back, a blue and white tee shirt with a dark blue heart in the center, red sneakers, and bage shorts. \"So you don't like squrels?\" She asked walking over to you to you. \"Only when there stealing my food.\" You say back to her. She comes and sits next to you and says \"Oh really. And what was with that yelp before?\" \"Oh um nothing. It just tickled me is all.\" You answered her. \"So your ticklish then?\" She said with a sly smile. Uh oh. I think you all know where this is gonna lead to. \"Uh um well I...yeah. I am.\" I say stammering and blushing with a hint of embarrassment. Then you feel something prod your side (her finger) and you yelp a bit loader than before. You turn to Rika and you see her snickering. \"Ask me, I'd say ticklish is putting it lightly.\" </span></div></div>",
            "created":1393216320,
            "id":1750540,
            "title":"Rika:The Digimon Queen"
        },
        "1313":{
            "author_id":"ssj3adean",
            "author_name":"ssj3Adean",
            "choices":[
                "Tickle her back",
                "Say something to distract her",
                "Try pushing her off"
            ],
            "content":"<div class=\"\"><div> <span>\"You could say that.\" You say to her rubbing your side she poked. \"What about you though?\" You ask her with a mischievous grin of your own. Rika didn't seem scared though. \"Nope.\" She said. \"I'm not ticklish at all.\" \"Crud!\" You thought to your self with your own master plan ruined. \"Why? You weren't planing on getting me where you?\" Rika asked. \"Maybe I was. Then what?\" You reply. You'd probably regret those words. Rika suddenly grabs your sides and starts scribbling her nails all over and you burst into a fit of laughter. \"HAHAHAHARIKAHAHAHAHAHACUT IT OUTHAHAHAHAHAHA!\" You laughed. \"Sorry. No can do.\" She replied sarcastically. You fall down flat onto your back as she continues tickling you. Then you...</span></div></div>",
            "created":1393274340,
            "id":1750753,
            "title":"You talk to Rika"
        },
        "13131":{
            "author_id":"ssj3adean",
            "author_name":"ssj3Adean",
            "choices":[
                "Belly",
                "Feet"
            ],
            "content":"<div class=\"\"><div> <span>You find an opening for you to get at her belly and so you send your arm forward strait at it and start scribbling your own nail all over her belly. But no reaction. \"Hey didn't I tell you I wasn't ticklish?\" She asked continuing to tickle your sides. \"HAHAHAHAHA I THOUGHT YOU WERE HAHAHAHAHAHAHA BLUHUHUHUHUFING AHAHAHA!\" You said laughing yourself to tears. \"Does it look like I am?\" She asked with an evil grin. \"NOHOHOHOHOHOHO!\" You yell out. \"Hmm. Lets see where you're most ticklish.\" Rika said as she moved to your...</span></div></div>",
            "created":1393368480,
            "id":1751240,
            "title":"Tickle her back"
        },
        "131311":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Ties you up",
                "Stops tickling you"
            ],
            "content":"<div class=\"\"><div> <span>Rika's fingers moved to your belly. <br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HEY STOP DON'T GO THERE HAHAHAHAHAHAHAHAHA\" You plead, your laughter growing louder.<br>\r\n<br>\r\n\"Why not?\" Rika asked.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA BECAUSE THAHAHAT'S WHERE I'M MOST TICKLISH HAHAHAHAHAHAHAHAHAHAHAHAHAHA\" You reply beore you realize that it probably wasn't the smartest move telling her that.<br>\r\n<br>\r\n\"Oh really\" Rika says, another evil grin on her face. \"Then you're really not going to like what's in store.\"<br>\r\n<br>\r\n\"I'M SERIOUS, CUT IT OUT HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" You said, squirming frantically.<br>\r\n<br>\r\n\"What are you going to do to stop me?\" Rika asked sarcastically, climbing on top of you and pinning you down to keep you from squirming. \"Try and tickle me again\"<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAH<br>\r\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA&amp; #34; You laugh.<br>\r\n<br>\r\n\"Coochie Coochie Coo\" Rika said, sliding her hands under your shirt and tickling your bare belly.<br>\r\n<br>\r\n\"NOHOHOHOHO HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA STAHAHAHAHAHAP <br>\r\nNO MORE HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHA\" You plead laughing.<br>\r\n<br>\r\nThen Rika...</span></div></div>",
            "created":1395086820,
            "id":1761988,
            "title":"Belly"
        },
        "1313112":{
            "author_id":"ssj3adean",
            "author_name":"ssj3Adean",
            "choices":[
                "Tickle her",
                "Talk to her"
            ],
            "content":"<div class=\"\"><div> <span>\"Had enough?\" Rika asked as she continued scribbling her nails all over your belly. \"YES YES HAHAHAHAHAHAHAHAHAHAHAHA PLEASE STOHOHOHOP!\" You yell out to her laughing and in tears. Lucky for you, Rika was in a merciful mood and stopped as she climbed off of you. You sit up still panting from the ticklish torture. But then you see a window of opportunity to get Rika back. She as turned away and now you can strike if you want to. You...</span></div></div>",
            "created":1396292280,
            "id":1771275,
            "title":"Mercy"
        },
        "13131121":{
            "author_id":"ssj3adean",
            "author_name":"ssj3Adean",
            "choices":[
                "Continue",
                "Stop"
            ],
            "content":"<div class=\"\"><div> <span>You launch your hands at her sides and start scribbling your nails rapidly and unlike before, you gained a reaction. Rika began squirming and laughing as you tickled her. <br>\r\n\"Hahahahahaha hey quit it hahahahahahahaha\" Rika laughed as she fell over onto her side and you continue. \"So you are ticklish after all. I just wasn't tickling the right spot.\" You said with a smug little grin on your face as you continued tickling. \"Nohohoho stop hahahahahahahaha!\" Rika pleaded as she laughed. You...</span></div></div>",
            "created":1396449960,
            "id":1772383,
            "title":"Tickle her"
        },
        "131311211":{
            "author_id":"cutetickling",
            "author_name":"Ultimateassassin",
            "choices":[
                "Run like crazy",
                "Stay and see what happens"
            ],
            "content":"<div class=\"\"><div> <span>You continue tickling Rika's sides senseless. \"Hmmm you're quite ticklish here aren't ya?\" you ask continuing your non-stop tickle torture on Rika. \"YES NOW STOP STOHOHOHOHOHOHOP!\" She yells out in tears. <br>\r\n<br>\r\nHowever you have no intention of stoping. \"Sorry but no. I have better plans.\" You stated going faster and faster, scribbling your nails on her ribs. \"HAHAHAHAHAHAHAHAHA NO PLEASE STOHOHOHOHOP YOU JERK HAHAHAHAHAHAHA!\" \"I wonder if you're ticklish on your feet.\" You say out load, eager to tickle Rika down there. <br>\r\n<br>\r\nThis made Rika's eyes widen. Her feet were the most ticklish spot and she refused to let you go anywhere near them. \"NOHOHOHOHOHOHO WAY THAHAHATS IT! RENAMOOOOOON!\" She yells through her laughter. You were confused, but not letting up the tickling. However, that changed when you hear an older female voice a few feet away. <br>\r\n<br>\r\n\"Rika, is everything alright?\" The voice asked and then you stopped. You look up to see a tall fox-looking creature with golden yellow fur, a white mane around her neck, and purple sleeves with the yang-yang symbols on each wrist. Seeing the creature caused you to instantly stop. \"Did she really just call that?!\" You think to yourself in surprise. <br>\r\n<br>\r\n\"Rika! Are you alright?!\" The fox asked noticing the situation Rika was in. \"I'm fine Renamon. Just need your help for a second.\" Rika replied. Then she turned to you and said, \"You. Stay here.\" with an evil look on her face. <br>\r\n<br>\r\nRika stands up and walks over to the to golden furred, fox who's name you managed to understand to be Renamon. She then cupped her left hand over her mouth a proceeded to whisper something into Renamon's ear. You could not make out what she was saying, but seeing Renamon's face change from surprised to giggling and to evil said enough to you. Then you...</span></div></div>",
            "created":1403324400,
            "id":1815230,
            "title":"Rika's Back-up"
        },
        "1313112112":{
            "author_id":"jblumken",
            "author_name":"Jblum",
            "choices":[
                "She continues to tickle your feet",
                "She stops to give you a breather"
            ],
            "content":"<div class=\"\"><div> <span>Renamon then looks at you and said, ''Well now….It seems you're in a lot of trouble young boy.''<br>\r\n<br>\r\nRenamon then glomps you and then goes to tickle your feet. You try to free yourself but Renamon is too strong and powerful.<br>\r\n<br>\r\n''AHAHAHAHAHA NOHOHOHOHOHOHOHO PLEHEHEHEHEHSE RENAMON I'M SOHAHAHAHAHAHAHAHORY!!'' Renamon ignored your pleading and continues to tickle your feet for 30 torturous minutes until…...</span></div></div>",
            "created":1450668300,
            "id":2077277,
            "title":"Stay and see what happens"
        },
        "14":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "Let the tickling begin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zoe's the only girl in season 4</span></div></span></div>",
            "created":1262667600,
            "id":816173,
            "title":"one way"
        },
        "141":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "Zoe tickles you",
                "you tickle Zoe",
                "Zoe starts a tickle fight"
            ],
            "content":"<div class=\"\"><div> <span>as you look out to the sea, you think of the different digimon out there. you smile as the thought of adventure slides into your head. but that soon subsides when you feel something slippery slide under your foot. you squeak for a moment and burst into giggles, jerking your foot away from the sand revealing a small starfish which you pick up.<br>\r\n\"It's amazing how something so small can do so much damage\" you say, smiling at the creature before setting it down into the ocean as the water and sand slides between your toes. as you stand in the surf, smiling as the sand tickles the soles of your feet, someone slides a finger across your side. you snap into giggles as you jump out of the water and away from the finger. looking around, you find yourself looking at a blonde haired girl mostly in purple clothing.<br>\r\n\"I didn't know you were that ticklish\" she said playfully. you seem confused at this remark. \"I saw the thing that happened with the starfish\" she said, clearing things up for you.<br>\r\n\"oh\" you say, going pink with embarassment, \"you saw that\"<br>\r\n\"it's ok\" she says, \"I'm not gonna tell anyone\"<br>\r\n\"thanks\" you say, relieved.<br>\r\n\"I can relate to it\" she says, rather embarassed, \"I'm Ticklish as well\"<br>\r\n\"So I could get Even with you\" you say, grinning.<br>\r\n\"I'm not saying to though\" she says, smiling at you.<br>\r\nyou sit on the sand and look out to sea again. soon enough, the girl joins you.<br>\r\n\"By the way\" she says, \"I'm Zoe. It's nice to meet you\"<br>\r\n\"you too\" you say, still looking out to the sea.</span></div></div>",
            "created":1262926800,
            "id":817636,
            "title":"a day at the beach"
        },
        "1411":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "feet",
                "underarms",
                "sides"
            ],
            "content":"<div class=\"\"><div> <span>As you continue to look out to the sea. Zoe has an idea of how to tickle you some more. thinking it over she taps you on the shoulder.<br>\r\n\"What's up? you ask.<br>\r\n\"can I see where you're most ticklish?\" she asks. you think for a second, wondering if it was a bad idea. \"It's ok\" she says. \"you can tickle me afterwards if you want.<br>\r\n\"Ok then\" you say, \"what's the worst that could happen?\"<br>\r\n\"Thanks\" she says, smiling. \"can I do something first?\"<br>\r\n\"O...k\" you say nervously. Zoe grins before pulling out a couple lengths of rope. \"Er, what's that for?\" you ask.<br>\r\n\"to make sure you don't Move around that much\" Zoe says. using the rope she ties together your ankles and your wrists behind your head.<br>\r\n\"I'm guessing this is in case I kick or punch something\" you say.<br>\r\n\"Slightly\" she says. once the knots in the ropes where tight enough. zoe tied a scarf around your eyes.<br>\r\n\"what's this for?\" you ask.<br>\r\n\"So you don't know where I'm going to tickle before I do\" Zoe says playfully, just before you feel her nails scratching aross your...</span></div></div>",
            "created":1264482000,
            "id":826127,
            "title":"soft spot search"
        },
        "14112":{
            "choices":[
                "Zoe continue teasing you while tickling you",
                "Zoe go get a tool to tickle you"
            ],
            "content":"<div class=\"\"><div> <span>Zoe wiggle her finger at you underarm.<br>\r\n<br>\r\nShe told you, \"Do you know that I was once being tickled before? It was by ranamon. I have learn a few tricks from her and I shall apply it to you!\"<br>\r\n<br>\r\nWith a mischievous grin, she tickles your underarms with her sweaty fingers.<br>\r\n<br>\r\nYou were going crazy! You beg her to stop but she just continues tickling.<br>\r\n<br>\r\nAs she tickles, she teasing sings:<br>\r\nTickle tickle tickling,<br>\r\nGoodie goodie Kutchi Kutchi,<br>\r\n<br>\r\nLet me make you laugh,<br>\r\nLaugh so hard to you explode like a puff,<br>\r\nwhy don't I tickle you with cream puff?<br>\r\n<br>\r\nThe song was making you more ticklish and your laugh went one pitch higher</span></div></div>",
            "created":1271480400,
            "id":869340,
            "title":"Zoe's evil tickling"
        },
        "14113":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "Ribs",
                "tummy"
            ],
            "content":"<div class=\"\"><div> <span>You knew better than anyone else that your upper body is hyper ticklish, which is why you were hoping that Zoe didn't start with your upper body just as you felt her hands slide under your shirt and start lightly scratching your sides.<br>\r\n\"oh no\" you wimper in your thoughts right before you erupt. \"NAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you try to say something but it's soon drowned out with laughter. as you continue to lose control of your laughter, Zoe is thinking about what to do next.<br>\r\n\"His upper body obviously pretty ticklish, so i should stick with it for the minute. Question is where should I go next, his ribs or his tummy?\" while she's thinking this, a different thought is going through your mind.<br>\r\n\"Go for the ribs next\" you think, a slight sense of fear in it \"that would be alright. just please stay away from my stomach\" there was a reason for you thought. next to the rest of you torso, your tummy is at least twice as ticklish, and as for your navel, it's twice as ticklish as your tummy. as you brace yourself with the scarf still around your eyes, Zoe pulls your shirt up and aims for your...</span></div></div>",
            "created":1266296400,
            "id":837231,
            "title":"at the sides"
        },
        "141132":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Zoe stops",
                "Zoe moves on to your navel"
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately for you, Zoe decided to go straight for your ticklish tummy and you go absolutely ballistic. <br>\r\n<br>\r\n\"NOOOOO HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH<br>\r\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAH<br>\r\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you burst into hysterical laughter. <br>\r\n<br>\r\nZoe noticed how ticklish your tummy was and tickled harder. <br>\r\n<br>\r\n\"I assume this is where you're most ticklish\" Zoe said. <br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHA<br>\r\nYESSSSSSSSSSS SO STAHAHAHAHAHAHAHAHAHAHAP HAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH<br>\r\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHA<br>\r\nHAHAHAHAHAHAHAHA\" You reply, begging her to show mercy and stop. <br>\r\n<br>\r\nUltimately…</span></div></div>",
            "created":1386441180,
            "id":1704546,
            "title":"tummy"
        },
        "1411322":{
            "author_id":"treck1",
            "author_name":"treck",
            "choices":[
                "someone comes to you",
                "nothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But first ...</span></div></span></div>",
            "created":1411766580,
            "id":1862415,
            "title":"Zoe moves on to your navel"
        },
        "1412":{
            "author_id":"theman",
            "author_name":"The Man",
            "choices":[
                "You begin tickling her belly again",
                "You talk to her",
                "She tickles you"
            ],
            "content":"<div class=\"\"><div> <span>Zoe wears a stripped top coloured blue and white. It does not cover her whole stomach and stops short, revealing her navel. Without hesitation, you lunge forward and grab her belly. You tickle it quickly which causes Zoe to burst out in laughter, its a good thing that nobody else is nearby.<br>\r\n<br>\r\n\"OHOHOHOH PLEEEASEE STOPPPPP!\" She laughs loudly.<br>\r\n<br>\r\n\"No way, baby.\" You say cool voiced. You continue to rub and tickle her soft and well-toned belly. You couldn't stop looking at it cause it was so unlike anything you'd ever seen before.<br>\r\n<br>\r\n\"Alright, I'm stopping for now.\" You said as you stopped tickling her belly.<br>\r\n<br>\r\n\"thank you!\" The beautiful blonde said, clutching her belly.<br>\r\n<br>\r\n\"Your belly is really...\"<br>\r\n<br>\r\n\"I know.\" She smiled. \"I usually have it uncovered.\"<br>\r\n<br>\r\n\"How come?\"<br>\r\n<br>\r\n\"I dunno.\" She says as she looks down on it. \"Its my belly, what's not to like?\"</span></div></div>",
            "created":1280638800,
            "id":928159,
            "title":"you tickle Zoe"
        },
        "14123":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "Zoe tickles your belly with a feather",
                "Zoe blows a raspberry on your belly button"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I guess I was just wondering\" you say as you lay back on the sand again.<br>\r\nZoe meanwhile came up with an idea. \"so, where else are you ticklish?\" She asked quite slyly.<br>\r\nYou chuckle a bit. \"Right\" you say, \"like I'm gonna tell you that\" A few seconds later, you feel something (Zoe's fingers) lightly scratching against you stomach, causing you to giggle lightly. \"Hey\" you giggle, \"quit it\" you protest as as you brush away her hand.<br>\r\n\"Oh\" Zoe said slyly, \"So your belly's ticklish?\"<br>\r\n\"No\" you lie. Zoe meanwhile thought otherwise, and started lightly tickling your belly again. you start to laugh gently. \"Oh come on\" you say, \"Stop\"<br>\r\nZoe smiled as you laugh. \"Umm... No thanks\" she said as she started to tickle you harder, causing your laughter to increase.<br>\r\n\"COME OHOHOHOHON ZOE\" you laugh \"STAHAHAHAHAHAHAHAP\"<br>\r\n\"I wonder what would happen if I did this?\" Zoe wondered aloud as she slid her hand under your shirt and started to tickle your belly without anything in her way. Your laughter increased in volume as her nails scribble across your bare skin.<br>\r\n\"GAHAHAHAHAHAHAHAHA QUIHIHIHIHIHIT IT\" you squeal.<br>\r\nZoe smiled again. \"No\" she said, before accidently slipping a finger into your belly button. as soon as you feel it, you throw back your head in laughter. unfortunantly for you, Zoe notices this, a grin creeping across her face. \"well, I see that your belly button's as ticklish as your belly\" she said. \"well then, Maybe I should see what happens if I try something else\"</span></div></div>",
            "created":1287810000,
            "id":980041,
            "title":"A little payback"
        },
        "141232":{
            "author_id":"blueauraex",
            "author_name":"BlueAuraES",
            "choices":[
                "Started licking your belly button.",
                "Started tickling you somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>\"Hmmm...\" Zoe thought. \"Ah-hah! I know just the thing! Hehehe! EVERY ticklish belly button is weak to it.\" She said with a playful smile. \"Oh no...Zoe no! Anything but that! Hehehe! Please!\" You beg as you cover your self in giggles, anticipating her lips on your belly button. \"Ah-ah-ah! None of that!\" She'd say teasingly as she quickly tickled your sides. \"AHHHahahahahhaha!!\" You'd yelp and squirm in laughter, involuntarily revealing your belly button to Zoe once again. \"Now I have you!\" She'd say goofily as she planted her lips onto your navel quickly, and began to blow into it. \"AHHHHHAHAHAHAHAHAHAHAHA!! ZOEHEHEHEHE! NOHOHOHO!\" You'd scream in laughter, trying to escape but failing badly. \"OHOHOHOH GOOHOHDD! STAHAHAHAAP IHIHIHT!\" You'd beg in screeching laughter. Zoe would simply smile as she kept blowing the air into your quivering, deep little flesh cave, sometimes blowing in song-like tunes. She eventually starts blowing into your belly button the main Digimon tune from Season 1 &amp; 2. \"HAHAHAHAHAHA!\" You laugh harder as the tunes strangely make you more ticklish inside your navel. Zoe eventually stops, and lets you breath, keeping her mouth on your belly button. \"Hehehehehehehe....\" You lay there, still in a giggling fit. \"What should I do next?....This belly button sure does look....Yummy. Mmmm....\" She'd say as she licked her lips. She then....</span></div></div>",
            "created":1294290000,
            "id":1030141,
            "title":"Zoe blows a raspberry on your belly button"
        },
        "1412321":{
            "author_id":"blueauraex",
            "author_name":"BlueAuraES",
            "choices":[
                "Continued licking your belly button.",
                "Started tickling you somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>\"Zoe....Please...That's enough....No more ok?....Seriously....\" You'd say in a somewhat serious tone, your breath about to give out on you as you try to breathe. \"Ok ok...\" Zoe would say as she you free, letting you catch your breath. 10 minutes later. \"So...All good?\" Zoe said in a caring tone, rubbing your cheek softly. \"Yes...Man...While that was draining, that was...Fun!\" You'd say with a big smile on your face. \"Oh yeah? Hmhmhm! Well, want some more at all?\" Zoe would say with a grin. \"Yes! Yes please!....Except this time....Ummm....Tie me down....\" You'd say with a blush. \"Tie you down?....Hmmmm....\" Zoe would go into thought, remembering when Ranamon tied her up, tickling her mercilessly. \"I think we can arrange that...Hehehe. We'll need to head into that hut over there though.\" She'd say pointing towards a small hut close to them, the two walk into it soon after. Zoe closed the door behind them, and immediately started looking for some bondage tools. \"I know they're here somewhere....Villagers always kept bondage tools in their huts....Ah-hah! Here's one!\" She'd say as she found some bonding ropes for wrists and ankles. \"Oh...Hehehe, so there is...\" You'd say with a somewhat fearful gulp, walking up to the X-Frame near the bed. \"I'll tie you up to this. After all, it wouldn't be tickle torture unless it was on an X-Frame. Did you know some native tribes would actually tickle torture their victims til they went insane? It's true!\" She'd say in a smart tone. \"Ummmm....Went insane?....\" That part caught your ear quickly, making your spine start to feel weak. \"Uh-huh!....Hmmm....I wonder if I could drive YOU mentally insane?....\" She'd laugh in a surprisingly sadistic tone. \"Z-Zoe?....You wouldn't....Would you?...\" You said fearful for your life. \"Naw, of course I wouldn't! That's horrible! How could you think of me that way?\" She'd say playfully. \"My mind is literally in your hands...\" You'd say, backing away from her slightly. \"Oh stop it and get on the X-Frame! I'd never do that to you!\" She'd say, urging you along to the X-Frame. Reluctantly, you get onto the X-Frame, allowing her to tie you to it. You feel like this will be your las laugh, but you go on anyways for the sake of your incredible tickle fetish. \"Now that I have you all nice and set up here....\" She'd say playfully as she started licking your belly button ticklingly, placing her mouth into your belly button once again. \"Mmmmmm...So tasty....\" She'd say in a sadistic like voice. \"HAHAHAHAHAHAHAH! ZOEHEHEHE!! ACKHAHAHHAHAHA!\" You'd simply laugh as she licked and tickled, unable to do anything about it. She then....</span></div></div>",
            "created":1294290000,
            "id":1030148,
            "title":"Started licking your belly button."
        },
        "1413":{
            "author_id":"edd682",
            "author_name":"Arcangel",
            "choices":[
                "Zoe tickles your belly",
                "Zoe tickles your feet",
                "You attack Zoe's belly"
            ],
            "content":"<div class=\"\"><div> <span>\"There's nothing to do today\" you mumble as you lay on your back to look at the sky.<br>\r\n\"If you came down here\" Zoe said with a smirk, \"Then there has to be something to do\"<br>\r\nyou groan as you sit up again. \"I'm so bored\" you moan. As you say that though, an idea sparks in Zoe's mind.<br>\r\n\"I bet we can do something fun\" she said with a grin. \"All you have to do is get the other person to give up to win\"<br>\r\n\"Ok\" you say, \"but I think it's fair to say i'm going to win\"<br>\r\nZoe chuckled, \"We'll see about that\" she says before sliding a finger across your ribs. you jump back with a squeak.<br>\r\n\"Hey\" you say before realizing that you've got yourself in deep water, \"Oh no, you're not thinking of a...\"<br>\r\nnext thing you knew, Zoe let out the two words that you didn't exactly want to hear. \"Tickle Fight!\" next thing you knew, Zoe had you pinned underneath her. \"Still thinking that your going to win?\" she asked.<br>\r\nYou gulp, hard. but you weren't about to give up so quickly. \"yes\" you say with a a bit of a nervous smile, \"Easily\"<br>\r\n\"Well then,\" Zoe said with a smirk, \"Lets start\" and with that she started scratching her nails across your ribs.<br>\r\nyou buck underneath the girl before bursting into giggles. \"nohohohohohohohofairhahahahahahaIwahahahahasn'treadyhehehehehehehe\" <br>\r\n\"You can always give up now\" Zoe said, eying the spot on your shirt which covered your belly and your bare feet, \"Or I can always pursuade you in a different way\"<br>\r\nyou're still giggling before you notice that Zoe's uncovered belly is unprotected. \"Neveheheheheher\" you say.<br>\r\n\"Ok\" Zoe said, \"Suit yourself\"</span></div></div>",
            "created":1280811600,
            "id":929619,
            "title":"Zoe starts a tickle fight"
        },
        "14131":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "feet",
                "armpits"
            ],
            "content":"<div class=\"\"><div> <span>Zoe then moves down to your extra sensitive belly. \"hahahahahahahahahahahanonottherehahahahahahahahahahahahahahahahahahahahahah ahahahaha\" you giggle still thrashing. she then pulls up your shirt exposing your belly.she then begins to slide her nails all over your belly causing you too laugh louder. \"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHASTOPSTOPHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you scream as you buck up and down. \"Tickle, Tickle, Tickle! Cootchie Cootchie Coo\" Zoe taunts. \"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHANOMORENO MOREHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you beg through your hysteric laughter. \"Give Up\" asks Zoe. \"HAHAHAHAHAHAHAHANOHAHAHAHAHA\" you reply. \"Fine\" said Zoe \"Iill just have to tickle your...</span></div></div>",
            "created":1303534800,
            "id":1093124,
            "title":"Zoe tickles your belly"
        },
        "14133":{
            "author_id":"theman",
            "author_name":"The Man",
            "choices":[
                "She starts tickling you",
                "You keep talking to her"
            ],
            "content":"<div class=\"\"><div> <span>Well how can you not? It's there!<br>\r\n<br>\r\n\"You're gonna get it now!\" You yell as you thrust your arms forward and wrap them around Zoe's belly. She wears a t-shirt with blue and white stripes and it stops short, revealing her belly button.<br>\r\n<br>\r\n\"Huh?\" Zoe says as she a takes a few seconds to notice what you are doing. SHe looks down at you and starts giggling uncontrollably, she laughs at her own stupidity at suggesting a tickle fight when she had her belly uncovered. \"nooooooohohoho!\" She screams as she is forced to the ground.<br>\r\n<br>\r\n\"Don't mess with me.\" You laugh as you continue to tickle her. Eventually you leave her belly and go for her back. She doesn't even try to stop you since she's having trouble speaking due to the constant laughter. You're in clear victory in this tickle fight and you show no signs of stopping since you're both having so much fun.<br>\r\n<br>\r\n\"Aaaaahahahahahahahahaha!\" The cute girl starts to laugh as you move back to her uncovered belly button from her back. She's now laying on the ground, completely helpless so you take advantage of the situation and keep tickling her belly. \"How do you like THAT?\"<br>\r\n<br>\r\n\"nonono nomore!\" Zoe pleades. Normally you wouldn't have stopped but it seemed like she really needed the break, so you stop tickling her belly and let her sit up.<br>\r\n<br>\r\n\"Thanks for stopping, cutie.\" She says.<br>\r\n<br>\r\n\"Uhh...\" You start to say.<br>\r\n<br>\r\n\"Are you alright?\" Zoe asks.<br>\r\n<br>\r\n\"I'm fine.\" You reply.<br>\r\n<br>\r\n\"Well if you're fine.....\"</span></div></div>",
            "created":1280984400,
            "id":930595,
            "title":"You attack Zoe's belly"
        },
        "141331":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "tummy (your most ticklish spot)",
                " your feet"
            ],
            "content":"<div class=\"\"><div> <span>Zoe then suddenly pounced on you, straddled you and began tickling your ribs. \"hahahahahahahahahahahahahaheywhat'sthebigideahahahahahahahahahahahhahah ahaha\" you ask as Zoe continues tickling your upper body. \"We never did finish our tickle fight, remember?\" said Zoe as she pokes and squeezes you ticklish ribs. \"hahahahahahahahahahahahahaheystahahahahahaphahahahaha\" you laugh. \"Ok I'll stop\" said Zoe before she finishes saying \"tickling your ribs\". and with that she began tickling your</span></div></div>",
            "created":1301720400,
            "id":1080769,
            "title":"She starts tickling you"
        },
        "1413311":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Zoe then began scribbling her fingers all over your defenseless tummy causing you to shriek and laugh.\"HAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHASTOPNOHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHA\" you laugh. Zoe than moved her hands under your shirt and rakes her nails over your now exposed tummy. \"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH ANOSTAHAHAHAHAPHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you laugh while squirming trying to avoid her tickling hands. \"HAHAHAHAHAZOEHAHAHAPLEASESTOHAHHAHAHAHA\" you beg. \"Give Up?\" asks Zoe.</span></div></div>",
            "created":1301893200,
            "id":1082206,
            "title":"tummy (your most ticklish spot)"
        },
        "1413312":{
            "author_id":"treck1",
            "author_name":"treck",
            "choices":[
                "you hit her belly",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zoe tried to tickle your feet but suddenly...</span></div></span></div>",
            "created":1407972840,
            "id":1841098,
            "title":" your feet"
        },
        "14133121":{
            "author_id":"treck1",
            "author_name":"treck",
            "choices":[
                "finger",
                "feather"
            ],
            "content":"<div class=\"\"><div> <span>She was laughing because she is just to ticklish.<br>\r\nYou fast pinned her down and tied her up.<br>\r\nZoe gulped.<br>\r\nYou took a feather and she knew what was happening.<br>\r\nAs soon as you hit her belly with it.<br>\r\n\"HHAAAHEEE\", she laughed and tried to move her belly away</span></div></div>",
            "created":1407973020,
            "id":1841099,
            "title":"you hit her belly"
        },
        "141332":{
            "author_id":"treck1",
            "author_name":"treck",
            "choices":[
                "More",
                "Special event"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She takes out two feathers and give you one<br>\r\n \"then lets fight\", she says.<br>\r\nYou two tickle the belly of each other very much.</span></div></span></div>",
            "created":1407110700,
            "id":1836994,
            "title":"You keep talking to her"
        }
    },
    "info":{
        "author_id":"edd682",
        "author_name":"Arcangel",
        "brief_description":"tickle or be tickled by the girls from Digimon",
        "created":1262720280,
        "description":"<td align=\"left\" class=\"norm\">you're a male human in the Digital world. You're brave, smart, quick - witted, and (to your bad luck) insanely ticklish. of course this is a bit of bad luck one day. you meet one of the digimon heroines who soon finds out that you are ticklish, and you soon find out you are in for a bumpy ride.<br>\r\n<br>\r\nBasically, you choose to either tickle or be tickled by the heroines from digimon.<br>\r\n<br>\r\nAnd the usual stuff.<br>\r\nno nudity.<br>\r\nno sex stuff<br>\r\nno killing<br>\r\n<br>\r\nso enjoy and don't be afraid to add a chapter</td>",
        "id":1633166,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1599862620,
        "modified":1599862620,
        "pretty_title":"Digimon girl tickling"
    }
}