{
    "chapters":{
        "1":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "Young - School Dance",
                "Young - Servant",
                "Young - Beach",
                "Young/Teen - Stuck in hospital",
                "More ideas!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This is the start of your adventure: choose wisely.</span></div></span></div>",
            "created":1570683600,
            "id":2731038,
            "title":"Where shall we begin?"
        },
        "11":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "Forgive her - it's only natural she's late.",
                "Punish her - this is the last straw!"
            ],
            "content":"<div class=\"\"><div> <span>Hana was running late as usual. It wasn't hard to see why - the poor girl had to lug around both her heavy backpack AND a belly that had at least 10 big babies inside her, all struggling for space. The huge girl eventually waddled into class, her uniform fitting tightly against her, hair matted to her forehead and her bare feet as sore and as red as the front of her belly from walking so far. <br>\r\n<br>\r\n\"Sorry I'm late!\" she panted, shuffling herself to her seat.</span></div></div>",
            "created":1570683600,
            "id":2731039,
            "title":"Young - School Dance"
        },
        "111":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "Growth spurt!",
                "Her water breaks!"
            ],
            "content":"<div class=\"\"><div> <span>\"Not to worry, Hana. Take your seat and we'll get on.\" the teacher nodded. He was certainly annoyed that one of his students was late, but he couldn't fault her for being heavy laden with the school's babies.<br>\r\n<br>\r\nThe young mother got to her seat as quickly as she could, dumping her sack on the ground and sat down side-on to her desk to accompany her belly. Then class started.<br>\r\n<br>\r\nIt was hard enough that it was a boring math class, but Hana's belly kept groaning loudly, accompanied by visibly large kicks and rolling against her taut skin. Everyone but the teacher was distracted, the boys and girls all wanting to feel Hana's overpacked gut.</span></div></div>",
            "created":1571756940,
            "id":2736771,
            "title":"Forgive her - it's only natural she's l..."
        },
        "12":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "Come on in~!",
                "Get to work!"
            ],
            "content":"<div class=\"\"><div> <span>Today would be the day that little Hana Kohaku's life would change forever. Since being raised in 'The Orphanage' - a place where girls under 12 would be born and raised to breed. Upon getting an order from a Mr Jonathan Brisco, Hana would be sent to his manor to work for him. But, upon his request, she was to be pre-filled with at least 6 babies before arriving.<br>\r\n<br>\r\nSure enough, a fair 9 months later and all necessary paperwork was filled in, the heavily pregnant and mostly naked loli was delivered to his door in a large aired crate, having arrived in a shiny black harness, hands cuffed behind her and ankles shackled loosely. In her box also came a variety of equipment, ranging from syringes to a dog leash to a chastity belt!</span></div></div>",
            "created":1570683600,
            "id":2731049,
            "title":"Young - Servant"
        },
        "13":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "To the beach!",
                "To the ice cream truck!",
                "To the shops!"
            ],
            "content":"<div class=\"\"><div> <span>It was finally the annual Kohaku beach day out. The whole family had driven up to the beach just on the outskirts of the town; the usual spot. The mother, Delilah, got out of the car and got the newest member of the family, Makoto, out of the car while the eldest sister Hana helped herself out to get the stroller out.<br>\r\n<br>\r\nThe girls, minus Makoto, were truly sights to behold. Delilah was short, with eyes as blue as the sky and brown hair that touched her bottom, with the 8 year old Hana following right behind. But what stuck out the most were their stomachs. While the mother carried quints almost to full term, Hana was very close to due with 8, showing off through their bikinis.<br>\r\n<br>\r\nMeanwhile, the husband &amp; father, Akira, took out the hamper, parasol and all the other beach-based paraphernalia out of the trunk before locking the recently purchased minivan up.</span></div></div>",
            "created":1570683600,
            "id":2731046,
            "title":"Young - Beach"
        },
        "14":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "10-12",
                "18-19"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before we start, how old would you rather have her?</span></div></span></div>",
            "created":1570683600,
            "id":2731042,
            "title":"Young/Teen - Stuck in hospital"
        },
        "141":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "Birth them babies!",
                "Keep 'em in!",
                "Shove some more in there!"
            ],
            "content":"<div class=\"\"><div> <span>As one of the youngest mothers in history, Hana had been omitted to the hospital a couple weeks ago for being close to the delivery of her triplets. Already a biological mother of 5, this was her biggest pregnancy yet!<br>\r\n<br>\r\nThe young girl was naked on her bed, strapped up with monitors on her swollen belly while her parents sat either side of her. They were already used to having Hana pregnant, so they already knew that she'd be pretty much ok with this. However, the doctors and nurses attending to the little girl were getting both annoyed and intrigued at the fact she could make it through such feats in the first place.<br>\r\n<br>\r\n\"Ok, Hana. You know what to do.\" the midwife sighed as she snapped her latex gloves on, placing a hand atop Hana's dome of flesh.</span></div></div>",
            "created":1570995720,
            "id":2732321,
            "title":"10-12"
        },
        "142":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "Induce labor",
                "Keep her pregnant - check on those babies",
                "Keep her pregnant - prolong the pregnancy",
                "Keep her pregnant - stuff some more babies in there!"
            ],
            "content":"<div class=\"\"><div> <span>Hana had been omitted to the hospital a couple weeks ago for being close to the delivery of her triplets. But it seemed her due date came and went, now at 42 weeks pregnant with no end in sight - not even a Braxton Hicks.<br>\r\n<br>\r\nThe amethyst-eyed girl laid in bed, finishing off her breakfast and the last of her morning water before her first checkup of the day.</span></div></div>",
            "created":1570683600,
            "id":2731057,
            "title":"18-19"
        },
        "1424":{
            "author_id":"gravidliv",
            "author_name":"GravidLiv",
            "choices":[
                "Very Overdue Hana, birth",
                "Very Overdue Hana, prolonged"
            ],
            "content":"<div class=\"\"><div> <span>Laying on her back, Hana rubbed and enjoyed her round and stretch marked belly, towering above her, blocking her vision. Triplets for her first pregnancy felt very promising to Hana, her goal being to give birth to as many babies as possible in her lifetime. However, she didn't want to wait long to feel babies kicking within her again. She also feared a string of overdue pregnancies reducing her baby factory potential. She had discussed it with her doctor, and he agreed to start her early on her next pregnancy. Today was the day of the insemination, after three days of hormone treatments to trigger ovulation.<br>\r\n\"Ready Hana?\" he asked, holding up a large syringe filled with white liquid. <br>\r\nShe nodded excitedly, and moaned loudly as he eased the tip into her already wet and swollen pregnant pussy. Smiling as he watched her belly moving and stretching with the big healthy babies within, he slowly released the cum into her.<br>\r\n\"All done,\" he said as he wiped away the semen dripping out of her. <br>\r\n\"How about some more? Just to be sure?\" she asked. <br>\r\nThe doctor nodded and gave her popped belly button a little wiggle before retrieving a few more syringes. She couldn't help but climax just from the thought of the cum cocktail he was pumping into her. The thought getting cum in her fertile and waiting womb, causing it to grow and swell, drove her crazy with desire.<br>\r\nAfter inseminating her, the doctor decided to give her an ultrasound. He squirted a generous amount of gel on her bouncing and trembling baby belly, then gently pressed the wand in. <br>\r\n\"Doesn't seem like they're close to dropping. Looks like you're going to be pregnant with these three for quite some time.\" </span></div></div>",
            "created":1583222940,
            "id":2795928,
            "title":"Keep her pregnant - stuff some more babies in t..."
        },
        "14242":{
            "author_id":"gravidliv",
            "author_name":"GravidLiv",
            "choices":[
                "Hana gives birth: 52 weeks",
                "Hana gives birth: 60 weeks"
            ],
            "content":"<div class=\"\"><div> <span>Moans were the sound Hana made most of the time as her womb was stretched to the limit. It had been eight weeks since her insemination, and her triplets still hadn't come. Now she was simultaneously pregnant with eight week old quadruplets who were growing fast. Her belly was stretched halfway to her knees and was nearly as wide. She had to be in an upright position with her legs in stirrups as she couldn't breathe on her back. She needed to go into labor with the triplets, and sex was the safest way to achieve it. She was hooked up to a fuck machine that pounded her dangerously swollen and fattened pregnant pussy for hours at a time. Her tits had long given up storing her milk, squirting and streaming it constantly. Her nipples were hooked up to industrial milkers 24/7 to collect it. She feared her upcoming quadruplet pregnancy, her belly was so insanely tight and stretched with just three. But the doctor assured her that subsequent pregnancies would be easier as her muscles relaxed with each one. He told her if this had been her second pregnancy she would have been much larger as her abdomen would have allowed easier growth. Eventually it would stop fighting the womb and relax completely, allowing for larger but smoother and easier pregnancies. That combined with the hourly oilings and lotion rub downs, he promised her womb and skin would grow and stretch quite happily. </span></div></div>",
            "created":1583223900,
            "id":2795932,
            "title":"Very Overdue Hana, prolonged"
        },
        "142422":{
            "author_id":"gravidliv",
            "author_name":"GravidLiv",
            "choices":[
                "12 weeks later, Hana wants more babies now",
                "Due again"
            ],
            "content":"<div class=\"\"><div> <span>In the 18 weeks since insemination, Hana's triplets and younger quadruplets had grown considerably. Belly resting near the edge of the bed and legs in stirrups, Hana screamed and heaved as her first baby crowned. Each triplet weighing in at least 12 pounds each, she was in for a long night. <br>\r\n\"Push Hana!\" the doctor yelled as he pressed down on her belly. <br>\r\nSlowly the head inched further out, stretching her lips thinner and thinner. He rubbed the sides to help them stretch, working very well to ease the head out. Finally it emerged completely, giving her some relief from the burning. As the shoulders passed, it nearly shot out, fluids gushing. There was no time to rest however, as the next head was already crowning. She nursed while pushing, much to the admiration of her doctor. She stifled her cries, holding her suckling baby dearly as she bore down. The second baby emerged more easily, but was still a brutal struggle. Heaving and pushing, her belly button jutting hard as the pressure forced it out even more, the head emerged. Again it shot out fast from the gaping hole after the shoulders, bringing a torrent with it. It was placed at her other breast, the third anfmd final baby already crowning. The third was birthed even more easily, shooting out even faster with more fluids. It was placed on her sweating and sore, still pregnant belly, crying for milk as it waited for its greedy siblings to finish. Hana cried happily holding her triplets, feeling the kicks of her quadruplets still safely within her womb. </span></div></div>",
            "created":1583224920,
            "id":2795936,
            "title":"Hana gives birth: 60 weeks"
        },
        "15":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "Young - Sports Day",
                "Young - 9 Years",
                "Young - Young Stripper",
                "Teen - High School",
                "More ideas!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's some more!</span></div></span></div>",
            "created":1570683600,
            "id":2731062,
            "title":"More ideas!"
        },
        "151":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "Forgive her - It's only natural she's late",
                "Punish her - Give her some \"exercise\""
            ],
            "content":"<div class=\"\"><div> <span>Hana was still in the locker room getting changed into her kit. It wasn't necessarily the case that she was a slow changer, but she had to deal with a grossly overstuffed belly that housed at least 10 healthy, if overdue, babies. Her PE clothes were the only things that could fit her - a pink sports bra that held her plumping breasts up and a pair of black yoga pants.<br>\r\n<br>\r\nThen, as quickly as she could, she ran into the gym, her massive womb bouncing along the way. \"Sorry I'm late, Mr Marshall! I couldn't get my pants on in time!\" she panted, looking up at the teacher.</span></div></div>",
            "created":1571875440,
            "id":2737529,
            "title":"Young - Sports Day"
        },
        "152":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "Wake up - birthday!",
                "Contractions start!"
            ],
            "content":"<div class=\"\"><div> <span>Hana was a medical mystery - even from birth, she had a big belly. It was when she was a few months old that a doctor found out via ultrasound that the recently born girl was pregnant - with triplets! He demanded that she was to not give birth until she was at least 9 years old, to lessen the chances of her splitting open.<br>\r\n<br>\r\nEventually, 9 gruelling, drug-filled, homeschooled years later, Hana was due to give birth. She laid in bed as usual, on her side so she wouldn't get crushed under her own weight. Her siblings lightly shifted inside her, lifting the sheets up a tad.</span></div></div>",
            "created":1571875800,
            "id":2737532,
            "title":"Young - 9 Years"
        },
        "153":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "The manager finds you - get in the back",
                "The manager finds you - in his office"
            ],
            "content":"<div class=\"\"><div> <span>Upon knowing their daughter was pregnant, Hana's parents kicked her out, leaving her with nothing but herself and her babies. 'It was stupid of me to have that one night stand!' she thought to herself as she walked down the street to her local bar. Of course, she couldn't drink, so she just had an apple/mango J20 instead. As she looked around the barfront from her stool, she noticed a flyer on the corkboard to her left, advertising \"male entertainment\" for the club across the road. She certainly needed a job, so of course she applied right away!<br>\r\n<br>\r\nThe establishment looked fantastic! A pair of bars, a stage at the far front of the building...this seemed like a great opportunity!</span></div></div>",
            "created":1571877000,
            "id":2737537,
            "title":"Teen - Young Stripper"
        },
        "1532":{
            "author_id":"zaloog81",
            "author_name":"Zaloog",
            "choices":[
                "16 (Tell the Trith)",
                "18 (Tell a Lie)",
                "Old Enough (Avoid the question)"
            ],
            "content":"<div class=\"\"><div> <span>  As Hana stood near the entrance to the club, admiring the decorum. She caught the eye large imposing black man standing well over 6ft tall. The large man approached the young girl, his eyes looking over her tight little body. Not paying attention Hana nearly ran face 1st into the man's broad chest.<br>\r\n<br>\r\n \"Oh excuse me sorry about that,\" Hana squeaked. Her head slowly tilting back to see who she nearly ran into. Standing at only 4ft 10in the young teen was barely taller then this giant of a man's belly button.<br>\r\n<br>\r\n \"Not a problem. But what can I help you with? You don't look like our normal clientele.\" The large man asked while folding his arms behind his back.<br>\r\n<br>\r\n Hana explained she was looking to apply for the \"male entertainment\" job. The big man looked Hana up and down once more. Then instructed her to follow him to the back. It was still early in the day, so not a lot was happening. But the pair did pass by a few of the clubs girls.<br>\r\n<br>\r\n The large man lead Hana into a office, way in the back of the building. Hana looked around the office, immediately noticing the large desk almost at the center of the room. A big throne looking gold chair sat behind the desk. A simple folding chair sat in front of the desk. The big man moved behind the desk and sat in the throne.<br>\r\n \"Have a seat miss. The name is Lester Cummings and I own this fine establishment.\" Lester introduced himself, while gesturing to the chair. Hana flashed Lester a smile, and bowed slightly. Before taking the offered seat. \"So I have a few questions to start us off. Just how old are you exactly?\" The large man asked his stern hazel colored eyes staring directly at Hana.<br>\r\n</span></div></div>",
            "created":1585901640,
            "id":2812603,
            "title":"The manager finds you - in his office"
        },
        "154":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "First growth spurt - on the bus",
                "First growth spurt - in class",
                "A day later...",
                "A week later...",
                "A month later..."
            ],
            "content":"<div class=\"\"><div> <span>Hana was already considered the school THOT (That Hoe Over There) for a year, being with one boy for a few weeks, then moving onto another like the changing of the seasons.<br>\r\n<br>\r\nBut before she could ditch her current boyfriend - Thomas Wright - they managed to get laid before the start of the new academic year.<br>\r\n<br>\r\nUpon waking, Hana noticed Tom was no longer there. And after getting out of bed, she walked past her mirror...only to return to notice she had miraculously ballooned out overnight! She looked about ready to pop with her first child! Either Thomas was <i>VERY</i> potent, or he had a <i>LOT</i> of pent up seed; either way, Hana needed to get to school and hide her gut as long as humanly possible!<br>\r\n<br>\r\nThrowing on a green sweater, jeans, socks and sneakers, she rushed out to get the bus for school.</span></div></div>",
            "created":1571868900,
            "id":2737466,
            "title":"Teen - High School"
        },
        "155":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "Teen - Smol mama, big babs",
                "Teen - Model",
                "Teen - Birthing alone",
                "Teen - Overdue",
                "More?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How's about deez?</span></div></span></div>",
            "created":1571872680,
            "id":2737500,
            "title":"More ideas!"
        },
        "1551":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "1 BIG baby!",
                "Large twins!",
                "Triplets!",
                "More!"
            ],
            "content":"<div class=\"\"><div> <span>Hana always had a thing for men MUCH bigger than her. But she'd pay the price when she'd get knocked up by her boyfriend Tyler, a 6'10\" quarterback for their college football team. The player had shaggy black hair, brown eyes and olive skin that complimented his ripped figure.<br>\r\n<br>\r\nWithin the first 3 months, Hana already looked due with 1 baby - though neither person knew what she was having, since Ty insisted for it to be a surprise! But it certainly wouldn't be one...could it?</span></div></div>",
            "created":1571876460,
            "id":2737534,
            "title":"Teen - Smol mama, big babies"
        },
        "1553":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "Home",
                "Outside - Back yard",
                "Outside - In public",
                "Hospital"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where shall she be giving birth?</span></div></span></div>",
            "created":1571875140,
            "id":2737527,
            "title":"Teen - Birthing alone"
        },
        "1554":{
            "author_id":"majormakotofan",
            "author_name":"MAF",
            "choices":[
                "1",
                "2",
                "3",
                "4",
                "More!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Firstly, how many kids will be in Hana here?</span></div></span></div>",
            "created":1571875080,
            "id":2737526,
            "title":"Teen - Overdue"
        },
        "15545":{
            "author_id":"jamesamber9514",
            "author_name":"Jamesamber9514",
            "choices":[
                "She Continues to grow much Bigger!",
                "Or She Stops For Now and Grows Much Bigger Later!"
            ],
            "content":"<div class=\"\"><div> <span>Hana is Pregnant with a Big Litter of 100 Big Babies from Agreeing to a Special Contract with a Huge Human Population Company that is Trying to Restore the Population of the world and Hana is the Only One who Can Handle Being So Massively Pregnant with No Problems or Anything Bad The Head Doctor says to Hana She's going to Get Much Bigger Today Because She's Too Small Right now and she Needs to be Bigger to Help out the Whole World She is Taken to a Special Room and Hocked up to a Special Medical device that Increases the number of Babies In Her Womb By Injecting them into Her Womb and Rapidly developing Them to the Same Age as their Siblings Already in Her Womb She says How much Bigger Do you Think I Should be Doctor The Doctor says About 400 more Babies Should be Okay For now Hana Sweetie But you Can Go Bigger than that If you So Desire The Medical device Keeps Pumping more and Babies into Hana's Womb She Doesn't Seem to care If She Grows Bigger than What the Doctors say she Needs to be At She says Doctor can We Go Much Bigger than 500 Babies Like Maybe 2000 or more Babies Growing Inside My Womb because I Really want to Help Save the whole Human race As Fast as possible She says With a Big Heartfelt smile on Her Face The Doctor says Little Hana Sweetie you Can Go Much Bigger than that But Don't You Think you should Take It easy and Slowly Grow your Womb Bigger with Each Massive Litter of Babies After All You're Only 12 Years Old Sweetie But It's Your Decision If you want to Grow That Much That Fast!</span></div></div>",
            "created":1579144380,
            "id":2774296,
            "title":"More!"
        }
    },
    "info":{
        "author_id":"majormakotofan",
        "author_name":"MAF",
        "brief_description":"Choose how little Hana's motherhood plays out!",
        "created":1570742100,
        "description":"<td align=\"left\" class=\"norm\">Her name is Hana Kohaku. She's a 10 year old (older if desired) Japanese-American girl living with her parents and baby sister Makoto. One of her biggest dreams is to become a mother someday - and these are the paths she'll take. <br>\r\n<br>\r\nFeel free to add to this!<br>\r\n<br>\r\n-Sex is allowed, but use discretion if it is for the younger Hana.<br>\r\n-Hyper pregnancy is allowed (though no room-sized pregnancies please)!<br>\r\n-Birth is DEFINITELY allowed!<br>\r\n-Hana's sexual orientation can be interchangeable!<br>\r\n-Alien is permitted, though only if they are humanoid.<br>\r\n-No TF, furs, eggs etc.<br>\r\n-No scat or watersports.<br>\r\n<br>\r\nOther than that, go wild!</td>",
        "id":2202763,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1585901640,
        "modified":1585901640,
        "pretty_title":"CYOA: Hana The Young Mother-To-Be"
    }
}