{
    "chapters":{
        "1":{
            "author_id":"zeroithzenith",
            "author_name":"Zeroth Zenith",
            "choices":[
                "Ask The Young Girl What Is She Doing Out In This Weather",
                "Reader's Choice #1",
                "Reader's Choice #2",
                "Reader's Choice #3",
                "Reader's Choice #4"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"font-family:comic sans ms, cursive\"><font class=\"size35\" style=\"\"><span style=\"line-height:2.0;\"><div align=\"left\"><br>\r\n          Today was a gloomy day for certain with the dark thunderclouds looming in the skies above, rain pouring down a torrent that would absolutely soak the unprepared, and the ever-constant threat of lightning crashing down onto an unfortunate soul. It wouldn't be so bad if if weren't for the fact that you—dressed in tattered and now soaked clothing—were being forcefully escorted to the castle by a pair of unfriendly-looking soldiers. Trying to strike up any small talk was meet with threats of violence so much of the long trip to your destination was silent. When you had finally arrived at the castle gates you were met by door guards, and after a few words exchanged between the men the guards slowly pulled the grand doors open for you and the two soldiers.<br>\r\n          The entire way in you had caught more than a few steely glares from the many knights and domestic servants who you assume just happened to be there; unwarranted as it was, you did nothing to upset the others and held your head with some semblance of dignity. That was met with a near-immediate reaction when one of the soldiers clapped you upside your head, warning against looking so proud for a wretch. It wasn't too much longer until you found yourself standing before the throne itself, and even more than that was that the Queen and Princess themselves were sitting in their seats. The King himself was strangely absent, leaving his throne to the right of the Princess empty, but you didn't get much time to ruminate on it before the soldiers harshly shoved you forward onto your face. You'd have cursed them for their being inhospitably but restrained yourself in the presence of the young Princess and her Queen. Slowly you tried to stand before the two royals before one of the soldiers barked at you to remain kneeling before their highnesses, and so on your knees you remained, waiting for one of the two to speak first and avoid any further abuse.<br>\r\n          \"You are certain that he is the one,\" the Queen had asked of the soldiers.<br>\r\n          \"Just so Your Highness,\" one of them replied. \"We had found this wretch collapsed in a tavern alleyway, stewing in a puddle of his own gruel.\"<br>\r\n          \"Fortunately the rain washed away most of it by the time we found him,\" the other soldier quipped. \"Our apologies for bringing him to you in such an unsightly display.\" The Queen nodded and turned her attention back to you.<br>\r\n          \"I assume that you have no inkling as to why you have been brought here before us,\" the matriarch asked you. You responded in kind, having no clue as to what was even going on. \"Very well then, I shall state it plain: my daughter here wishes for you to attend Saint Adelaide's K Through Eight Royal Academy.\" Your eyes couldn't have possibly been wider, though you're sure you couldn't be any more surprised than the soldiers who had brought you to the Queen and Princess. To confirm if this wasn't some sort of jest, you asked the Queen if she truly meant that; though her eyes narrowed she did so in a way that looked like she saw your doubt coming. \"I mean every word of it. Of course, I must stress that your position at the academy is to serve as the groundskeeper; the academy is in dire need of one, and according to what my daughter has spoke of you that makes you more than qualified for the position.\" You spared a confused glance at the young Princess who was simply beaming at you with her radiant smile.<br>\r\n          \"Oh how true that is,\" the girl exclaimed. \"The way you tended to that graveyard I happened upon was nothing short of immaculate if I must say so myself. I can only imagine how well you will tend to the academy grounds!\" The way the Princess's eyes lit up and stood out even among the lights in the throne room was awe inspiring to say nothing of her smile. The glowing praise she heaped on you did soothe your nerves somewhat but you were still unsure about all of this—you were effectively a nobody, and surely there had to be someone more qualified than you at tending to the garden. You voiced these concerns to the Queen, careful not to put down the Princess's praise of you and disrespect her, earning an almost exasperated sigh.<br>\r\n          \"Personally, I must agree with you,\" the Queen coolly said. \"If I may be so blunt, had it not been for my daughter here insisting that you be appointed as groundskeeper you would not even be here standing before us. So, considering that, you ought be very grateful that you were selected by my daughter to serve the royal academy.\" It was supposed to be a high honor sure but a part of you felt like the Queen and Princess were leaving some important details out, like what even was the academy to begin with. Regardless, the Queen made it clear that you were to accept this position with grace, and with a respectful bow you thanked the royals for extending their generosity to a wretch like you. \"That is a most good thing to hear. Know that both my daughter and I have high expectations of you.\" Once you were certain that the Queen was finished speaking, you asked her forgiveness for speaking out of turn before you raised your question: you had no idea how to get to the academy—you were a vagabond who had nothing to your name and thus you had no idea how to get to the academy. You hoped that someone would be kind enough to give you directions, and just when it looked like the Queen would open her mouth the Princess had already spoken up.<br>\r\n          \"It is not far from here,\" the princess answered. \"When you leave the castle but not before you leave the castle town gates, the royal academy will be just a few blocks down to the east, and there you will encounter the Saint Adelaide's K Through Eight Royal Academy. Classes do not begin until the next week, so it would be a boon to you if you familiarized yourself with the academy's layout. If you have any trouble with the staff members regarding your unique situation, I am certain that the guardsmen will happily plead your case as a direct request from me and my mother.\" The Princess seemed so pure in her desire to have you as the academy's groundskeeper and so determined to make it happen—perhaps <i>too</i> <i>much </i>so for the Queen's liking as evidenced by her resigned grimace.<br>\r\n          \"If my daughter wills it, so shall it be,\" the Queen sighed. \"I trust that you will perform to the best of your ability so as to not disappoint us both or give us reason to regret this act of charity.\" You responded that you were ever grateful for the second chance at life and that you would forever be indebted to the Queen and the Princess for this kindness you were done. You didn't mean for it to sound so pitiful but your circumstances prior were that pitiful and kissing up to them seemed to be for the best in the meantime. \"Now that we have established your new purpose, our business with you has concluded for the day. If you make haste, you should be able to make it to the academy before it closes its gates for the day and explain your circumstances to the staff. If they do not believe you then you are to return to us and we will assist you. Are there any more concerns you wish to voice before you are dismissed?\" You wanted to raise the question of where you would be staying to accommodate your new position but kept quiet, telling the Queen that you had no further concerns. \"Then I bid you a fare rest of the evening. Gentlemen, please escort our academy's new groundskeeper outside of the castle with no issue. I trust that he should require no further assistance to reach the academy from there.\" The two soldiers obediently took you by your arms and were leading you outside of the throne room until the Princess called out to you one last time.<br>\r\n          \"I look forward to seeing how well you tend to the academy. Fare thee well until then.\" Despite yourself, you smiled and nodded at the Princess's words; it would be nice to spend more time with someone as kind as her. With that all out of the way, the soldiers led you through the many halls you passed through before, and even with the earlier warning against looking proud for yourself you kept your head up high, thanking whatever powers that be for giving you another shot. Soon you found yourself shoved roughly outside of the castle doors and back into the frigid rain, but you were in a good mood so you didn't feel the need to curse at the soldiers; for now, all that mattered was that you found this academy and that hopefully they were still open. Remembering the Princess's directions, you made your way out through the castle gates and headed eastward. A few blocks down the Princess said, and soon you'd find yourself before the gates of St. Adelaide's K–8 Royal Academy.<br>\r\n          Before you started worrying about if you took a wrong turn somewhere, you could see the building coming up in sight, but much to your general misfortune the front gates had been locked closed. You didn't think that there'd be anyone who would have any sort of reason to be here during this weather, and you weren't really ready to jeopardize your standing with the Queen or Princess by trying to sneak inside the academy some other way. You needed a safe place to stay for the night, that much was certain, so your best bet was to find somewhere nearby to rest up until tomorrow. In the middle of your thoughts and with the rain continuing to pour down on you (but you were already thoroughly soaked as it was), you almost didn't notice that something was tugging on your rags before a voice called out to you.<br>\r\n          \"Excuse me, mister?\" At the sound of the voice you turned in the direction you'd heard it, and before you was a lone girl who looked no older than ten years of age, wearing thick winter clothes under a wide umbrella. You didn't know why, but looking into the girl's shining eyes captivated you in a way you didn't understand—right there you knew that the girl had something special about her…<br>\r\n</div></span></font></span></span></div></div>",
            "created":1586572920,
            "id":2816952,
            "title":"In The Beginning…"
        },
        "11":{
            "author_id":"zeroithzenith",
            "author_name":"Zeroth Zenith",
            "choices":[
                "Accept The Girl's Offer To Stay With Her For The Night (Reserved by Author)",
                "Reader's Choice #1",
                "Reader's Choice #2",
                "Reader's Choice #3",
                "Reader's Choice #4"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"font-family:comic sans ms, cursive\"><font class=\"size35\" style=\"\"><span style=\"line-height:2.0;\"><div align=\"left\"><br>\r\n          There she stood—a young, fair-skinned maiden who looked no older than twelve years of age with golden locks meticulously styled to tuck themselves neatly underneath her fur hat, and she was staring deep into your eyes with her own baby-blue hues. You had seen many a bright-eyed child, but the way this young girl's eyes bore into yours held you captive for a reason you couldn't explain. It almost made you forget that you were in the middle of a storming downpour—almost. You felt a sneeze coming on and quickly turned your head away from the girl so you wouldn't spray anything in her face and upset her. By God, that one actually hurt, and you feared what would happen if you stayed out for too much longer.<br>\r\n          \"You shouldn't stay out in this cold rain like that Mister,\" the girl said to you, right as you were about to ask her what she herself was doing out in this weather. Of course, you didn't feel like telling this girl that you were just some scruffy ol' beggar else you would probably be bombarded with questions you didn't want to answer. \"Are you lost Mister?\" You simply told the girl that you were just looking for St. Adelaide's K-8 Royal Academy, but from the looks of it no one was there to let you in. \"The school is closed Mister.\" You resisted the urge to respond with a snide remark at the girl pointing out the obvious, politely telling her that you could see that for yourself. Your concern at the moment was finding someplace nearby to get some eat and sleep and wait until tomorrow so you could get inside the school, and you would have bid the girl farewell and do just that had she not take to circling around you—inspecting every little detail about your appearance. After a long moment of silence, the girl finally spoke up again.<br>\r\n          \"Are you homeless Mister?\" You had nearly rolled your eyes at the girl's observation, answering that, yes, you were indeed homeless. You tried at your second attempt to leave the girl before she began pestering you with more questions, but it seemed that the powers that be conspired against you; when you made to leave the girl by her lonesome, she darted ahead of you blocking your path to wherever it was you were headed, and again her intense stare left you awestruck at how transfixing her eyes could be. \"Mommy said that we should always help the helpless, and that means homeless people too.\" Why this girl would not leave your poor self alone you didn't know, but it was clear that you had caught her attention. Looking for a way to get her to let you be, you asked after her mother wondering why she would allow her little girl to roam the rainy streets by her lonesome—let alone why she was even talking to a complete stranger.<br>\r\n          \"Mommy wouldn't mind,\" came the girl's reply. \"Mommy would always bring in a poor homeless person and feed them and give them warm clothes until they were better again.\" You found that hard to believe, but then again the girl's own warm attire implied she was from a well-off noble house; perhaps her family could afford to bring in down-on-their-luck wretches and do whatever they wished with them. \"You should come with me Mister; you'll be able to sleep in a warm bed, eat yummy food, and wear nice clothes so you can be ready for school tomorrow.\" Something about this whole exchange felt off to you; it was certainly starting to feel like this girl was trying to get you to come home with her, almost like a child who wanted to take in any stray cat or dog they came across, and damn it if it wasn't working to some extent. Specifically, every time you looked into the girl's eyes as she spoke you felt strange—you knew the girl wasn't a normal girl but there was something mysterious about the way her eyes lit up even in the dreary atmosphere of the storm. It was very much like the Princess's own eyes but more intense. Then, she did something you never knew you couldn't resist—she smiled.<br>\r\n          \"I promise you that Mommy would like it very much if you came home with me,\" she said, taking hold of your larger hands with her own smaller ones. \"Pretty please?\" If this girl could smile as if nothing could ever go wrong and hold your calloused hands in her soft fingers all while she looked at you with pure sincerity, how could you turn down her offer?<br>\r\n</div></span></font></span></span></div></div>",
            "created":1588846140,
            "id":2831647,
            "title":"Ask The Girl What She Is Doing Out In This Weather"
        },
        "111":{
            "author_id":"zeroithzenith",
            "author_name":"Zeroth Zenith",
            "choices":[
                "Decide To Take On The Role Of The Girl's New Guardian (Reserved by Author)",
                "Reader's Choice #1",
                "Reader's Choice #2"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"font-family:comic sans ms, cursive\"><font class=\"size35\" style=\"\"><span style=\"line-height:2.0;\"><div align=\"left\"><br>\r\n          In the end, your initial resistance had crumbled away, having fallen for this girl's offer if only because she seemed so sincere about it. And besides, it had certainly been a long time since you had eaten and slept in a nice place, and with some nice new clothes you'd certainly be better off at explaining your new position as the academy's groundskeeper. And so, you decided to take the girl up on her offer of letting you stay with her and her mother for the night, thanking the girl for her hospitality and asking her to lead the way. Smiling wider now, the girl reached for something behind her back, and it turned out to be another umbrella—an adult-sized one at that.<br>\r\n          \"This umbrella is for you Mister,\" she said, graciously handing the umbrella to you. \"Mommy said I should always have an extra umbrella in case I need it or if someone else does.\" It sure sounded like this girl's mother was a kind woman—maybe even <i>too</i> kind, but right now it was that supposed kindness that you were benefiting from so you made it a point to thank the woman once you finally saw her. Just when you voiced that, however, the girl had stopped smiling; it wasn't as though she started frowning, but when you spoke of thanking her mother not only did her smile drop almost instantly but for a split second you could have sworn that the light in the girl's eyes dimmed ever so slightly. It didn't last though, and the girl went back to smiling again, although her smile wasn't as wide anymore and her eyes still didn't look as bright as before.<br>\r\n          \"Come on Mister, you'll get sick if we stay out in this rain.\" Right she was, and after opening your umbrella you were instantly relieved to not have to feel the rain constantly battering your ragged self; you almost felt just a little warmer from that alone, though the air was still frigid so it was in your best interest to leave the area and make it to the girl's home to stay for the night. Walking side by side as the girl made her way back home helped give off the illusion that you and the her were already somewhat acquainted to most any passerby, and it helped that the two of you had found a rather normal chat to have. You learned that the girl absolutely loved sweet stuff (but then again what little kid didn't?) and that her mother would always bake her pastries which were her favorite sweets. It sounded like something you'd love to try and hoped that, if fate would allow it, that you'd try one or two someday. Again, the girl seemed to smile a little less and had opted to stare off into the sky, though she did return her attention to you and simply said that you'd get the chance one day.<br>\r\n          You were starting to notice a trend at this point in that whenever you mentioned having any kind of interaction with the girl's mother, her mood seemed to dampen just a little, but at least the girl made it seem like meeting her mother was still a possibility. Eventually, the girl asked about you and what kind of life you had before you became a beggar, and you had almost stopped in your tracks, not wanting to go into detail with your past. Before you could come up with an adequate response though, the girl had seemingly realized that she was prodding at something you didn't want to talk about and quickly apologized, but what really caught you off guard was what she said afterward.<br>\r\n          \"Everyone has problems they don't want to talk about yet,\" she said. \"Sometimes it hurts too bad to do anything about it by yourself and other people need to help you out… Sometimes we can't help people… Some problems just can't be helped, and we can only pray that these poor people will be happier next time.\" Her words were surprisingly understanding—almost in a bleak way for a twelve-year-old-looking kid, and with this the girl looked outright sad as she let her ayes fall to the ground. \"You can't save everybody, and sometimes you make things worse, but we still have to try and save as many people as we can. So…if you think you can't be saved, we'll be here to talk you out of that.\" The girl grabbed you by your hand and smiled at you, this time even brighter than what you had seen from her before, and again her eyes were drawing you into a fuzzy feeling. You soon turned your eyes away from hers to keep from being sucked in too much, but for the second time the day you found yourself smiling with how your luck seemed to be looking up.<br>\r\n          The rest of the trip was uneventful but that didn't matter too much; you were still in the phase of gratefulness that someone was going to give you another chance. When you finally made it to the girl's house, however, any good vibes you had were squashed immediately—the girl had led you to a house that looked like it had seen better days. Growth crawled all over it every which way you could look to the point anyone would easily mistake it for being abandoned, and what would have been beautiful stone was marred with gouges and cracks all along the surface. Despite this, the girl had made no comment on its exterior and seemingly sensed your confusion.<br>\r\n          \"I'm sorry that the house doesn't look so pretty on the outside, but its really nice on the inside.\" You had to take the girl at face value and hope that she was right, though either way you didn't want to seem picky and decline the girl now that you've been to her home. She gestured for you to enter first, and you walked up to the rather deceptively well-kept door before gently pushing it open. You found yourself in a state of shock once again, but this time it was because of how well-maintained the interior was. The outside of the building did the house no justice, and in your shock you kept alternating looks between the house and the girl.<br>\r\n          \"Mommy always said that the inside is more important than the outside,\" the girl said. While that was true to an extent, the outside still needed to be strong enough to protect the inside, and you voiced this to the girl. \"I'm sorry… I don't have anyone to help me with the outside. It's just too tough for me to get to by myself…\" You said that that shouldn't be an issue of the girl's mother could call for someone to help tend to the house, but before you could continue any further you could see the crestfallen expression on the girl's face as she simply stared down at the ground. You would have asked why her mother hasn't called for anyone before you noticed that her mother wasn't there to greet the two of you as you came in, and the girl never called for her mother to introduce you. A mother of what you assumed was their only child would certainly be on the constant lookout for their child, and you wondered if her mother was out or something of that sort. The girl, strangely enough, hadn't answered you yet as if she was still thinking of a response. The implications she had laid out for you, though, were answers enough in their own rights—her good mood always decreased whenever you mentioned things like meeting her mother, and now that you were here in her home she was not attempting to put on a smiling face like she did before while mentioning having to things by herself. You also didn't realize it before, but she also always mentioned her mother doing things in the past tense—never in the present tense. Hoping that this all wasn't heading in the direction you thought it was, you asked the girl if her mother was still around, avoiding being too direct about death. After some deliberation, the girl closed her eyes and sighed, deciding to look you straight in your eyes.<br>\r\n          \"Mother is dead,\" she simply said to you. \"Father attacked us one day and ran away, and because we could not get Mother help in time she died from bleeding out. I buried her out in the backyard like she wanted so she could feed the flowers.\" You had dreaded that there would be some morbid reason behind why the girl was by herself (nevermind how graphic the details were), but surely she had to have relatives who would take her in; then again, if she did then she wouldn't be here all by her lonesome, and the thought that she had no family, friends, or anyone really to take care of her was a scary one. \"You're the first person who came to our house since Mother died; no one else wanted anything to do with us because of Father. So…I thought I could ask you if you could maybe stay here with me…? I don't have anyone to help me take care of the house and you don't have a house…\"<br>\r\n          This must have been why the girl had approached you and wished so badly for you to accompany her back here—the girl was clearly lonely from having lived by herself, and truth be told you didn't have anywhere else to go, but a part of you was wondering if just the two of you could provide for yourselves.<br>\r\n          \"Mother taught me how to cook and clean around the house in case anything happened to her, so I can cook food for us and keep house.\" It was like this girl was reading your mind, but given how mature she already seemed to be it must have been that she was simply wise beyond her years. Of course, this girl wouldn't be doing all of the work if you could help it; it was the least you could do after she offered you a place to stay, even if it wasn't exactly the most equipped living space. Together, the two of you who had no one else in this world who could or would support you, could get another shot at life and make something out of this small home for yourselves.<br>\r\n</div></span></font></span></span></div></div>",
            "created":1588863960,
            "id":2831729,
            "title":"Accept The Girl's Offer To Stay The Night With Her"
        }
    },
    "info":{
        "author_id":"zeroithzenith",
        "author_name":"Zeroth Zenith",
        "brief_description":"A groundskeeper works at an all-girl's school—but the girls are not what they seem…",
        "created":1586486160,
        "description":"<td align=\"left\" class=\"norm\"><span style=\"font-family:comic sans ms, cursive\"><font class=\"size35\" style=\"\"><span style=\"line-height:2.0;\"><div align=\"justify\"><div align=\"left\"><br>\r\nYou are a simple peasant recently summoned to work for the prestigious St. Adelaide's K–8 Royal Academy—an all-female institution, at the Queen's begrudging behest to appease her young princess who happens to attend there. Despite the general mistrust of the institution's staffing and the lowly position you were offered, you took this second chance at life without a second thought. There you acquaintance yourself with all kinds of girls going about their daily lives, and if you kept up the good work as a model groundskeeper then you would surely enjoy your time there. However, strange events begin to happen in your fair kingdom, and they all seem to revolve around a handful of the girls and woman at the academy. Soon you'll learn that there is far more to both the students and staff members than meets the eye…<br>\r\n<br>\r\nBelow are the general set of rules and, fair warning, they may be strict:<br>\r\n          If you start a route, be sure to leave at least one empty slot for another person to start their own routes—mark your routes that you do not wish to be disturbed as \"reserved\", especially if you can add up to three or more extra routes, and respect others' \"reserved\" routes by not hijacking them. However, if you have a \"reserved\" route and it has not been worked on for at least a month or two (or I suspect that you have been inactive for that long a period), I will free it up to the best of my ability for others to use it.<br>\r\n          If you are going to end a route, please do so on a route you \"reserved\" for yourself and not on others were there is no such \"reservation\". I myself will write a \"main\" route of sorts, and as such they will be \"reserved\" to some degree.<br>\r\n          While I will not disallow any sort of sexual fetish, <span class=\"clred\">I will <b>not</b> tolerate out-and-out rape made out to be \"enjoyable\" for the victim in any fashion (disregarding any physical stimulus that naturally comes with the territory); if I see such writing <b>it will be trashed immediately</b></span>. Rape fantasy thus should be written <i>very carefully</i> to make sure that it is <i>entirely consensual</i> on <b>both</b> parties' ends.<br>\r\n          While not a \"rule\" per se, please take care to write with proper grammar, though I understand that sometimes it can be difficult especially if you do not speak English or some other language you're writing in as your first language.<br>\r\n          Another thing is that while this isn't an outright rule it should still be considered; I enjoy stories with heart put into them; even if it is just about the groundskeeper \"conquering\" all the girls in the kingdom I would like to encourage all of you to put some care into it to make it enjoyable to read. Short entries will be allowed on a case-by-case basis; chapters should be at least five sentences long if you are writing short sentences, and chapters with very low amounts of sentences should be written out extensively.<br>\r\n          Since this is an interactive story from the reader's perspective it would be expected that most entries and choices are written from the reader/writer's point of view and what actions they will take next; the groundskeeper will be male by default but changing his sex and/or gender is still perfectly acceptable for those who do not identify with a cisgendered male protagonist.<br>\r\n<br>\r\nAdditionally, I will add gift points for entries that I find satisfactory for as long as I have gift points. The rules may change and be adjusted to entries added here and there but that should be about it for now—I bid you all a well writing experience.<br>\r\n</div></div></span></font></span></td>",
        "id":2218601,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1588863960,
        "modified":1588863960,
        "pretty_title":"Bewitching Angels (Rewrite)"
    }
}