{
    "chapters":{
        "1":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Continue",
                "Continue",
                "Continue",
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Mark felt cold. It was as if he was laying outside on the most frigid day of winter. He tried to move, but found his limbs locked in place His head could move, but only very slightly. A dull buzzing filled the air, and Mark's eyes were soon blinded by a flash of white light.<br>\r\n<br>\r\n\"Eht!\"<br>\r\n<br>\r\nHis entire body was tired, it was all he could manage from his lips. He tried to move his arm, only to be reminded of its constraints. He struggled, but only managed to make his arm cuffs clang. He felt himself losing consciousness again, his eyes felt heavy, and his muscled weakened. Just as his eyes started to close, two dark figures broke through the light.<br>\r\n<br>\r\n\"He.. help...\"<br>\r\n<br>\r\nWith that desperate plea, Mark's body failed.<br>\r\n<br>\r\n<br>\r\nNoise. Sounds. Voices. He was waking up again, in another place.<br>\r\n<br>\r\n\"Last one's up, looks like everyone can share the misery now.\"<br>\r\n<br>\r\nHe leaned his head toward the voice. It felt like the world around him was moving, and not his head. Mark had to lay still for a few moments. He just closed his eyes and left his body motionless. When his feebleness faded slightly, he let his eyelids rise. They did this on their own, and no longer felt heavy, which was a good sign. Gradually, the blurs and shadows filling Mark's vision solidified into people and things. He caught a glimpse of a man, perhaps 20, looking down at him before the man looked away and walked off. Tilting his head slightly in an attempt to follow, he caught sight of a few more people. They seemed to be wandering aimlessly, or just standing in place. The room that held them all was fairly barren; a very dimly lit white room with a tiled floor and ceiling. There were no windows, and the only features to be seen were small, flat beds resting on metallic columns and mirrors placed along the walls.<br>\r\n<br>\r\nMark lowered his feet to the ground cautiously. When he felt that he was standing on something solid, he slid himself off the bed. As soon as he was on his feet, he became disorientated again, and began to stumble. He nearly fell over, saved only by the bed he had just gotten off which he grabbed at the last minute. For a while, he felt that he couldn't move, that if he let go, he would just fall through the floor. His entire body felt terrible. Mark had never felt so sickly, weak, and nauseous. He began to climb back onto the bed, but he was grabbed on the shoulder and stopped.<br>\r\n<br>\r\n\"Don't lay down, you will get better faster if you keep trying to stay up.\"<br>\r\n<br>\r\nMark managed to swing his head around, and saw the smiling face a young woman looking back.<br>\r\n<br>\r\n\"Everyone felt this way when they first woke up, the more you move around the faster you will feel better.\"<br>\r\n<br>\r\nThe woman took her hand away and ran it through he fine blond hair. Mark reacted by subconsciously deciding to turn around and walk to her.<br>\r\n<br>\r\nHe pushed himself off the bed, and in spite of how gently he did this his arms still felt as if they were straining. After two steps off balance, he tossed himself around so that he was now leaning against the bed with his back. He lifted one arm halfway, reaching for the woman and stumbled toward her. His head instantly began to spin, but this time he fought it. To him, it felt like walking while submerged in sand. It took all of his energy just to take a step, but as the woman said, with each step, his body felt lighter and stronger. Before he knew it, he had reached the woman, and was leaning on her. He looked up, while breathing rather heavily and saw her smile once again.<br>\r\n<br>\r\n\"Good, you feel better now don't you?\"<br>\r\n<br>\r\nMark opened his mouth to speak, but could not finish. He simply nodded his head. Then...<br>\r\n<br>\r\n\"Good to see that each of you has experienced success, cheers!\"<br>\r\n<br>\r\nThe room became engulfed in light as the multitude of lamps embedded in the ceiling came on at once. The confused crowd all shielded their eyes as they tried to adjust to the brightness. As he was still fighting the pain in his eyes from the light, Mark slew his gaze toward the voice he had just heard. He could make out a single figure standing on a small balcony over the room. It was an older man with grey hair arranged in bowl cut, he wore thin framed glasses and a long white coat over dark trousers. As he leaned on the railing of his balcony, he gave off a twisted smile, something that would go on to be his trademark amongst the people looking on below.<br>\r\n<br>\r\n\"Now that you are all conscious, I can explain what is going on. Each and everyone of you is rather lucky. No longer are you bound by the frailty of normal humanity. My genius has given you enhanced bodies and...\"<br>\r\n<br>\r\nThere were some who could not agree.<br>\r\n<br>\r\n\"Enhanced? You did this to me? Reverse it right now! I had the company in my hands, the entire company!\"<br>\r\n<br>\r\nMark watched on as the enraged teenage boy kept shouting. The boy stopped looking at the man briefly and focused on his own reflection in the mirror that he was next to.<br>\r\n<br>\r\n\"How can I take my position now that I've been reduced to this? I look like a child!\" <br>\r\n<br>\r\nThe scientist released the rail on the balcony and leaned back with a sigh, smiling all the while.<br>\r\n<br>\r\n\"You won't even let me tell you what I've provided and you are concerned over money, and status? I assure you that such trivial things are best forgotten. You are all now test subjects, but it is not the end of your lives, this is only temporary, and...\"<br>\r\n<br>\r\nThe angry boy started up again, but Mark was still mulling over what he and the scientist had said; \"enhanced bodies\", \"I look like a child\". What had been done to their bodies?<br>\r\n<br>\r\nMark broke away from the woman that he had been leaning on, but she grabbed him.<br>\r\n<br>\r\n\"You heard, and now you want to understand what happened. I don't know who you were before now, but you are no longer that person. I found out when I looked at myself, just like everyone else. Only look if you are ready.\"<br>\r\n<br>\r\nMark paused after that, weighing his options. In the end, he decided that he had to know and turned his back on the woman so that he could see his reflection. Although he felt much better, he was still weak, and found that keeping his head down kept his head from spinning. He stumbled on towards the wall until he practically ran into it. When he saw the reflection of his hand against the smooth glass, he took a breath and looked up.<br>\r\n<br>\r\nAt first, he wasn't alarmed. He saw his own face, but after looking at it closely, his first impression seemed more and more to have been an illusion. The reflection could not have been Mark's face because Mark wasn't a girl. In the mirror, he saw an older female that he had never seen before.<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\nMoving beyond the face, he found long brown hair that he confirmed was his with his own hands. Scanning the reflection, he saw that his entire body had changed, he now had a thoroughly feminine figure. Thin waist, smaller arms and legs, wide hips, breasts, long hair. He had been completely changed.<br>\r\n<br>\r\n\"I hope that this isn't too much of a change for you. I was lucky, I only seemed to have been made older, but some of the others were very shocked when they saw how they changed.\"<br>\r\n<br>\r\nShe stared into his eyes through the mirror.<br>\r\n<br>\r\n\"I guess that means that you were a boy before?\"<br>\r\n<br>\r\nMark turned toward the woman who was behind him once again, and nodded slowly, too shocked to speak.<br>\r\n<br>\r\n                                                                                           ***<br>\r\n<br>\r\n\"I will get out of this, and when I do, I will ruin you! Ruin!\"<br>\r\n<br>\r\nThe argument between the scientist and the boy was still on going.<br>\r\n<br>\r\n\"Fine, fine. If you can't be convinced to do this for the good of science, I'll tell you about the grand prize.\"<br>\r\n<br>\r\nHe folded his arms behind his back, and started to pace around the ledge on which he stood.<br>\r\n<br>\r\n\"In return for aiding our research, you will be allowed to present us with a request - for anything. But that only goes to the subject who gives us the most data.\"<br>\r\n<br>\r\nThe room was engulfed in silence as everyone now gave the scientist full attention.<br>\r\n<br>\r\n\"Very good, you understand now.\"<br>\r\n<br>\r\nHe stepped forward and rested one hand on the railing again.<br>\r\n<br>\r\n\"Now, I will explain this project. You have all been given enhanced bodies, selected only on the basis of which ever body accepted your \"soul\" the easiest. Each transplant appears successful, and we have sufficient data on normal human functions. We are now at the phase where your enhanced abilities will be tested. All of you will be released into the city above this lab where you will attempt to perform two tasks.\"<br>\r\n<br>\r\nHe took his hand and raised it out in front of him, while pointing up with one finger.<br>\r\n<br>\r\n\"One, survive. We will provide your bodies with required maintenance, which includes the use of special sleep units that you need to stay healthy and specific nutrients you need to live. All other shelter and food is up to you to get.\"<br>\r\n<br>\r\nHe extended a second finger.<br>\r\n<br>\r\n\"Two, fight. The best way to test your capabilities is by having you do battle with each other and normal humans. This is where the prize comes in. Obey the rules, and beat everyone else, and it is yours. What are these rules you ask? No killing of anyone with enhanced bodies, we can't afford to incur such damages. No fleeing, but even if you tried this, you would shortly become weak and die without sleep units and our nutrients, oh and your bodies also contain tracking devices and shock implants. No attacking any of the lab staff, which would be unwise anyway, superhuman or not, you're still human and we know exactly how to stop you, this is science not magic, you aren't bullet proof. I suppose that this is clear.\"<br>\r\n<br>\r\n\"Good. Now we will take you to the body maintenance facility, and show you how to use the sleep units and give you some henodextonin, that is, the nutrients you need to stay alive.\"<br>\r\n<br>\r\nThe wall at the back of the room opened, and a horde of men in large white suits and masks came in. Everyone was herded away.</span></div></div>",
            "created":1274418000,
            "id":887043,
            "title":"Reborn"
        },
        "11":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Wake up",
                "Switch to another character (feel free to make one up)",
                "Something goes wrong",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Mark was taken to a small room that vaguely resembled a doctor's office. He was sitting on a body length bench as he had been told to do, and looking at the various books and binders lining the shelf on the adjacent wall. One of the suited men entered.<br>\r\n<br>\r\n\"Lay down.\"<br>\r\n<br>\r\nMark didn't care for his coldness and pretended not to hear. The man reached into a pocket, and then Mark felt a most extraordinary pain for a brief second.<br>\r\n<br>\r\n\"Lay down.\"<br>\r\n<br>\r\nMark hesitantly complied this time. Suddenly, something grabbed his arms, legs, and chest. Restraints had shot out from the bed, and Mark couldn't move at all.<br>\r\n<br>\r\n\"I will admidinster the henodextonin.\"<br>\r\n<br>\r\nThe man brought down something like a gas mask from a pod on the ceiling, as it ominously lowered, Mark began to thrash his head around and resist.<br>\r\n<br>\r\n\"Don't move.\"<br>\r\n<br>\r\nMark ignored him and fought to avoid the mask, though his now uncomfortably long hair was getting in a mess, making it difficult to see, he even got some of it in his mouth, which made him feel like he was chocking. The suited man was not at all amused.<br>\r\n<br>\r\n\"Stay still!\"<br>\r\n<br>\r\nHe landed a solid punch on Mark's face, but to his surprise, it didn't hurt much, if at all. It did get him to stop squirming for a second however, and the man grabbed his face and put the mask on after clearing away Mark's hair. Immediately, some kind of powder came through the mask, and Mark was forced to swallow it. Out of the corner of his eye, Mark could see the man fiddling with a knob on the wall, more and more powder came through the mask until Mark was almost chocking on it. It went on for nearly a minute, then the whole process was abruptly stopped.<br>\r\n<br>\r\n\"Adminstration successful.\"<br>\r\n<br>\r\nThe man left the room after that without taking off the restraints on Mark. He was left to struggle in them for half an hour before a suited man came in.<br>\r\n<br>\r\n\"I've come to take you to sleep units, don't worry, I won't treat you roughly.\"<br>\r\n<br>\r\nThis one spoke in a different voice, meaning that he probably was a different person, but Mark understandably didn't trust him at all. The man undid the restraints, and led Mark into the hall, which seem quite dark, and nearly infinite. As they walked, Marked tried his best to examine the facility, thinking that he could find an escape of some kind, but all there was to see was row after row of endless hallways crossing each other every 25 feet. The lab had to be absolutely immense.<br>\r\n<br>\r\n\"This way.\"<br>\r\n<br>\r\nMark followed the man as he entered one of the crossing hallways, and opened the door to a staircase. He led Mark down to a room full of cylinders, some of which were occupied. In particular, Mark recognized the kind girl from before, sleeping in the cylinder labeled #171.<br>\r\n<br>\r\n\"This is yours.\"<br>\r\n<br>\r\nThe man pointed to a cylinder in the corner, in red, a large \"194\" hung over it.<br>\r\n<br>\r\n\"Please get in.\"<br>\r\n<br>\r\nMark was somewhat apprehensive. Hoping for some sign of compassion, he turned to the suited man, but not sense of emotion penetrated the dark black visor of his gas mask. He only spoke with the same regretful voice.<br>\r\n<br>\r\n\"Please get in.\"<br>\r\n<br>\r\nHis hand slowly drifted towards a pocket, the same one the first man had used.<br>\r\n<br>\r\nAt that, Mark knew he had no choice, he entered the sleep unit.<br>\r\n<br>\r\n\"Rest well.\"<br>\r\n<br>\r\nA barricade of thin circular tubes surrounded him as he leaned on the unit's back wall. He became tired very quickly, and soon drifted out of consciousness.</span></div></div>",
            "created":1275886800,
            "id":895858,
            "title":"The lab"
        },
        "111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "The first battle",
                "Interuption",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Mark's senses were all blank, there was nothing, not even a dream. It was like he was trapped in some artificial hibernation, half aware, half unaware. There was no certainty. But then, he started to feel something, it came through his arms first, then his legs, and eventually, the entire front of his body. Mark was resting on something hard, like concrete. He regained consciousness and opened his eyes, taking in something that had been ascent for quite some time, sun light.<br>\r\n<br>\r\nHis first reaction was to see if what he remembered had really even happened. He placed his hands on his chest only to feel soft abundant flesh. Standing up, he confirmed it once more when he looked down and saw his breasts protruding under his tube top and open jacket. Wearing such clothes felt very unusual, and Mark tried to make himself at least slightly more comfortable by buttoning up. When he had finished that, he found another problem that he could not resolve as easily, a loose blue mini skirt resting on his hips. He grabbed it, wanting to do something, but it didn't take long for him to realize that there wasn't anything to do about it. He let go and tried to pay it no mind.<br>\r\n<br>\r\nHe concentrated on his surroundings next. He seemed to be in an empty alley way, squeezed between some tall buildings. There was some light coming from the far end of the alley, where it turned around a corner, probably leading to a street. Mark was conflicted over whether to move or not. He didn't want to be seen like this, even though no one would recognize him anyway. He looked around for another option and spotted a fire escape hanging off one of the buildings. There were no windows, only large steel doors, and the stairs didn't look like they were commonly used. He decided to head over and climb them, but he soon found an obstacle in the way.<br>\r\n<br>\r\nHalfway up the stairs stood a large man in a leather jacket.<br>\r\n<br>\r\n\"Hello there miss.\"<br>\r\n<br>\r\nFrom his tone and expression, Mark realized that he must have been another one of the \"enhanced\" people.<br>\r\n<br>\r\n\"Shut up, I'm not a girl.\"<br>\r\n<br>\r\nThe man cocked his head and laughed.<br>\r\n<br>\r\n\"You sure look like one, kinda cute really, don't s'pose you can try an act like one? Just for me?\"<br>\r\n<br>\r\nThis was making Mark's blood boil, the very idea was disgusting, he was one step away from running up the stairs and kicking the man in the face. But what happened next caught Mark off guard. The man jumped a full ten feet into the air and then came crashing into the ground. He was about thirty feet up originally, making for a total drop of about 4 stories. Mark stepped back with his mouth open.<br>\r\n<br>\r\n\"Oh, the lil' lady hasn't gotten to stretch her legs yet? You seemed pretty shocked at that jump. Wasn't nothing really. But I think this means, since you won't play around with me, I'll just fight you and have my first easy win.\"<br>\r\n<br>\r\nMark was very scared now.<br>\r\n<br>\r\n\"Wait, why fight? Aren't you mad that you were kidnapped and changed?\"<br>\r\n<br>\r\nThe man bellowed with loud laughter.<br>\r\n<br>\r\n\"Mad? I feel great, I could live like this forever. Keep talkin if you want, I'm just gonna fight.\"</span></div></div>",
            "created":1275886800,
            "id":895861,
            "title":"City Streets"
        },
        "1111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "The man's true intentions",
                "Randy won't give up so easily",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>The man leaned in and then rushed straight for Mark who instinctively put up his arms in defense, though he wasn't very confident in his new body.<br>\r\n<br>\r\n\"They're so thin, he's going to punch right through them!\"<br>\r\n<br>\r\nAt the last minute, he tried to jump to the side, but his decision had come too slow, the man's heavy fist grazed Mark's shoulder and sent him spinning into the wall on his left. He impacted with quite a thud, and almost didn't catch himself as he rebounded off the wall and fell to the ground.<br>\r\n<br>\r\n\"Gee, you already out of this fight?\"<br>\r\n<br>\r\nMark tried to turn his head to see his adversary, but the next strike came so fast that any kind of reaction was impossible. A fierce kick to the abdomen sent him up into the air and was followed by a two handed bash to the head. Mark was down again.<br>\r\n<br>\r\nThe man found this hysterical.<br>\r\n<br>\r\n\"I haven't seen something this pathetic, ever. I dunno what constitutes a win in this contest, but I know you need to be alive for me to claim that prize, lucky you. I think I'll just knock you cold!\"<br>\r\n<br>\r\nThe man walked over and grabbed Mark's head, lifting him off his feet.<br>\r\n<br>\r\n\"Oh, and just so know, my name's Randy, nice to meet ya!\"<br>\r\n<br>\r\nHe began punching Mark in his stomach with his free hand, repeatedly. Mark was squeezing his arm in a vain attempt to break free, but with every hit, his grip weakened, until he arms just went limp.<br>\r\n<br>\r\n\"Guess it's g'night for this lady.\"<br>\r\n<br>\r\nRandy drew back his arm for the knockout punch, and unleashed it, his fist flying towards Mark's face. But then it missed.<br>\r\n<br>\r\n\"What in blazes?\"<br>\r\n<br>\r\nSuddenly, Randy yelled in pain and released Mark, who fell flat to the ground.<br>\r\n<br>\r\n\"Leave.\"<br>\r\n<br>\r\nRandy turned his scowling face, and saw a man behind him. He had an open, non aggressive stance; arms to his sides and legs straight, but he had a powerful aura of sorts that came through his serious expression and tone of voice.<br>\r\n<br>\r\n\"What's it to ya? You come in all high and mighty in your expensive suit and start to give around orders? Not to me you don't.\"<br>\r\n<br>\r\nRandy rushed him, feigning a punch before diving at his legs with a low kick. However the man reacted instantly, as if he could read Randy's mind, and jumped over his attack while taking the opportunity to land his own kick to Randy's face. He then immediately ran after his careening body and caught it mid flight. Picking up momentum, he ran Randy straight into a wall. Randy just got up, roaring, now he was enraged.<br>\r\n<br>\r\n\"Now I'm just gonna deliver some kind of beat down!\"<br>\r\n<br>\r\nBut no one was there, neither the man, nor Mark.<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\nRandy clenched his fists and turned around to punch the wall.<br>\r\n<br>\r\n\"Get out here now!\"</span></div></div>",
            "created":1275973200,
            "id":896401,
            "title":"The first battle"
        },
        "11111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Continue",
                "Someone else arrives"
            ],
            "content":"<div class=\"\"><div> <span>Mark had been in a daze since the fight. When he came to, he immediately noticed that he was somewhere else. There was an uninterrupted view of the blue sky, and mesh fence all around the area where he was resting. It looked like the roof of a tall building. Mark still had plenty of adrenaline in him and sat up quickly, gasping. There was no sign of Randy, or anyone else. But someone had to have moved Mark from the alley. A gust of wind came from behind him, and then he heard a strange noise. He quickly turned and found a hastily constructed wooden overhang that was providing shade for him.<br>\r\n<br>\r\n\"Did someone try to help me?\"<br>\r\n<br>\r\nMark shifted his legs to stand, but found that he was weak. He got on one knee and rested for a minute before fulling raising himself off the floor. He dragged himself to the edge of the roof, and looked through the fence to the ground below. The place was fairly high up, and the sight of the distant earth below combined with his injuries made him feel disorientated. He went to sit back down, but started hear a noise. It sounded like footsteps on a ladder. Mark crouched down and took cover behind a large air vent.<br>\r\n<br>\r\nPeering out from his cover, he saw a man in a somewhat unusual outfit climb onto the roof. He wore what looked like an expensive shirt and vest, it looked a little warm considering the weather.<br>\r\n<br>\r\nMark dived back behind the vent after taking a quick glance. He had no idea who this was, and the last person he saw did everything but kill him.<br>\r\n<br>\r\n\"I'm probably being hasty, but I will tell you now I'm not here to fight. I have no interest in this pointless affair.\"<br>\r\n<br>\r\nMark pressed his back up against the vent hoping that the man hadn't seen him.<br>\r\n<br>\r\n\"Yes, I am addressing you, the one behind the air circulation fan.\"<br>\r\n<br>\r\nMark knew he was caught and came out. He tried to look unafraid, but he was deeply worried. The man started to walk over, and Mark felt a chill in his legs, though he didn't move.<br>\r\n<br>\r\n\"Before it even gets started, I will tell you now. I am not a man, do not upset me by calling me one. I am Alexandria and I approached you because I've determined that you aren't interest in this senseless nonsense either.\"<br>\r\n<br>\r\nAlexandria took Mark's lack of reaction as a result of surprise.<br>\r\n<br>\r\n\"Yes, there was selection method employed with these body exchanges besides chance. I take it that since you didn't know, you were lucky enough to keep your original gender.\"<br>\r\n<br>\r\nIt had only happened twice but Mark was tired of being called a girl. He wanted to shout no, but he developed a pain in his side as he went to speak. Mark bent over clutching his side, Alexandria came over to help.<br>\r\n<br>\r\n\"Just lay down. Unfortunately I don't have anything to help you but the people behind this fiasco seem to care about these bodies. They will probably heal you when they call us back to the lab for maintenance.\"<br>\r\n<br>\r\nShe got up folded her arms.<br>\r\n<br>\r\n\"In any case, there is only one course of action to take in this situation. I won't stand to be a part of this bothersome ordeal. We need to find everyone who is like minded and form an alliance. Hopefully, we'll be able to find a way out of this. If that proves impossible, we will probably have to attempt to make one of ourselves the 'winner' so that we can make use of the promised prize.\"<br>\r\n<br>\r\nShe walked over to the edge of the roof and lightly kicked the fence.<br>\r\n<br>\r\n\"But I have my doubts about these people.\"<br>\r\n<br>\r\nShe turned back to Mark.<br>\r\n<br>\r\n\"Speaking of fighting, it didn't seem like you were very capable. This will not help our chances. I suspect that you haven't discovered any abilities yet.\"<br>\r\n<br>\r\nMark raised his head and squeaked out his one word reply,<br>\r\n<br>\r\n\"Abilities?\"<br>\r\n<br>\r\n\"When the man from the laboratory mentioned enhanced bodies, he was not solely referring to our increased strength and endurance compared to normal humans. At least some of us have other traits.\"<br>\r\n<br>\r\nAlexandria stepped forward and knelt down, extending her open hand.<br>\r\n<br>\r\n\"Place your fingers just above mine, so that they are almost touching, but not quite.\"<br>\r\n<br>\r\nMark complied.<br>\r\n<br>\r\n\"Now try to touch my fingers with yours in anyway you can.\"<br>\r\n<br>\r\nMark, not knowing what to expect simply moved a finger down. Alexandria moved one of hers, avoiding contact. Mark looked up confused.<br>\r\n<br>\r\n\"Keep trying.\"<br>\r\n<br>\r\nMark tried again, this time but this time he tried to distract her with one finger and move in with the other. She avoided him again. Mark began to try all sorts of tricks such as stopping only to immediately move again or twitching to get a false movement. Nothing worked, but what was surprising was that no matter what happened, Alexandria maintained the same exact distance between her fingers and Marks, as if she knew exactly when he was going to move.<br>\r\n<br>\r\n\"How are you so fast? Are you reading my mind?\"<br>\r\n<br>\r\n\"You noticed. It is not mind reading, I can accelerate my thought processes, at least that was the conclusion I have reached. It was how I saved you from that man. I raised my senses to their highest and managed to sneak in, then I deflected his punch and knocked his elbow in so that he would drop you.\"<br>\r\n<br>\r\n\"How did you find us?\"<br>\r\n<br>\r\n\"I also have one other trait, an extra sense. I can't really explain it, but that man was giving off some kind of signal. So were you, and there were even more farther in the background. I think that the man has some ability like photosynthesis, his signal was strong at first when he was high up, but when he went down into the alley, it got weaker. Fortunately, he did not notice.\"<br>\r\n<br>\r\n\"How do you know so much?\"<br>\r\n<br>\r\nMark was getting a little suspicious.<br>\r\n<br>\r\n\"Perhaps I've said too much and don't sound trustworthy. What I know, I know by experience and deduction. Ever since I woke up in this form, I've been bombarded with my extra sense. I did not discover my ability to alter my mental state until later, but I was lucky in that I had a rare moment of panic, which caused me to activate the ability when I tried to calm myself. Everything else I guessed on my own. That is my explanation, take it or leave it.\"<br>\r\n<br>\r\nThe two looked at each other for a moment. Mark was unsettled by Alexandria's apparent familiarity with everything, but he didn't like the idea of being on his own, especially with people like Randy running about. For now, he would trust her.<br>\r\n<br>\r\n\"How do I find out what my abilities are?\"<br>\r\n<br>\r\n\"I don't know, but first, you must learn to fight.\"<br>\r\n<br>\r\nMark got up to protest, but the pain at his side returned and hindered him to a degree.<br>\r\n<br>\r\n\"I know how to fight, I was just caught off guard.\"<br>\r\n<br>\r\nAlexandria gave him a strange look, then turned around.<br>\r\n<br>\r\n\"If you say so. Get some more rest, I don't want to stay here for long. We need to find others.\"</span></div></div>",
            "created":1275973200,
            "id":896421,
            "title":"The man's true intentions"
        },
        "111111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Mark keeps going",
                "Mark feels that Alexandria made a mistake"
            ],
            "content":"<div class=\"\"><div> <span>Mark fell asleep within a few minutes. The sky had become slightly golden, and the cool breeze was relaxing. He let himself forget his ordeal and fell into slumber, however brief.<br>\r\n<br>\r\n\"Wake up, wake up, someone is approaching.\"<br>\r\n<br>\r\nMark responded sluggishly at first, thinking that he was in his bed, but when he saw the nearly twilight sky, he remembered where he really was. He sprang to his feet quickly, only to be betrayed by the wind that had provided comfort just moments ago as it blew around his bare legs under his skirt. To Mark, it felt very unnatural, and the fact that the air was much colder than before didn't help things. He turned to Alexandria who was scanning the streets below from the edge of roof.<br>\r\n<br>\r\n\"Who is it?\"<br>\r\n<br>\r\n\"I don't know, it's another strong signal, I can't see the person yet.\"<br>\r\n<br>\r\nShe stepped back from the fence and jolted to the other side of the building.<br>\r\n<br>\r\n\"It's not the same one as before, he went off that way.\"<br>\r\n<br>\r\nShe ran back to the previous side.<br>\r\n<br>\r\n\"I don't think we've been discovered yet. The signal isn't taking a consistent path, its just weaving through the streets.\"<br>\r\n<br>\r\n\"What should we..\"<br>\r\n<br>\r\nShe grabbed Mark's arm<br>\r\n<br>\r\n\"We need to investigate this. We'll go down to street level and follow the signal. As long as we don't draw attention to ourselves, we should be able to appear like normal pedestrians. In case anything happens, just let me talk so we don't end up contradicting each other. Just act like I'm your father and you are my daughter.\"<br>\r\n<br>\r\n\"Uh, r-right.\"<br>\r\n<br>\r\nShe lead him to the ladder, and they both climbed down the side of the building until they reached the fire escape and entered the alley where Mark first woke up.<br>\r\n<br>\r\n\"Wait. That way!\"<br>\r\n<br>\r\nAlexandria tugged Mark to the end of the alley, then let go of his arm.<br>\r\n<br>\r\n\"Remember, blend in. Stay behind me.\"<br>\r\n<br>\r\nMark assured he would do so with a nod. The two of them strolled out onto the sidewalk. For a city, it was empty. On a few people were passing by. There were no cars, driving or parked. Alexandria walked toward the end of the block, passing the tall brown building that they had come down from. As only she could sense the signal, Mark was suspicious of everyone he saw. An older woman suddenly crossed the road from the middle of block, looking as if she might come up to Mark and Alexandria. Mark couldn't help but nervously shift his look between Alexandria and the woman, and only became calm when she walked behind them and headed away.<br>\r\n<br>\r\nAlexandria tapped Mark's shoulder at the corner, his attention had drifted to someone else. The two of them crossed the street and walked past a few more buildings before coming across a small fountain surrounded by some benches and a few trees. Walking on the stone path through the park was a boy who looked around 15. He seemed lost; his gate was very slow, and he kept turning his head, glancing everywhere.<br>\r\n<br>\r\n\"That's him.\"<br>\r\n<br>\r\nMark turned around and leaned on the black fence partially enclosing the fountain area.<br>\r\n<br>\r\n\"Now what? Are we just going to go ask him if he's sane or another fist happy idiot?\"<br>\r\n<br>\r\nAlexandria pushed Mark toward a bush and hid with him.<br>\r\n<br>\r\n\"Only one of us should confront him until we know what he is like. If he becomes hostile, the onlooker will attack him, then we escape. Since you don't know how to use your abilities yet, you are going to have to talk to him. I don't have any ideas on what you should say.\"<br>\r\n<br>\r\nMark though about it for a moment, then ran off after the boy. Alexandria didn't appreciate his hastiness.<br>\r\n<br>\r\n\"Wait! What are you going to do?\" She whispered.<br>\r\n<br>\r\nMark just waved his hand at her, signaling not to worry and dashed off. From a distance, Alexandria tailed him, already using her mental ability to enhance her awareness. The boy walked straight past the fountain and turned down the adjacent street. It looked like a more secluded area, so Mark made his move.<br>\r\n<br>\r\n\"Um, excuse me.\"<br>\r\n<br>\r\nThe boy just kept going as if he hadn't heard. Mark came up from behind and grabbed his shoulder.<br>\r\n<br>\r\n\"Hello, sorry to pester you but, I just lost my, uh, contact. Can you help me find it?\"<br>\r\n<br>\r\nThe boy turned around, his face visibly concealing anger. Mark jumped back a little startled.<br>\r\n<br>\r\n\"Uh, um, I'm really sorry, but, ah, I need to find it! Please?\"<br>\r\n<br>\r\nThe boy only stared at the girl who had approached him, who was now twiddling her thumbs. Then he made a fleeting expression with his eyes.<br>\r\n<br>\r\n\"Where is your other lens?\"<br>\r\n<br>\r\n\"I, I'm wearing it.\"<br>\r\n<br>\r\nThe boy walked past Mark and took a few steps toward the fountain park he had just exited.<br>\r\n<br>\r\n\"You lost it here?\"<br>\r\n<br>\r\n\"Around here, I just noticed it was missing.\"<br>\r\n<br>\r\nMark laughed nervously, but the boy made no response. As Mark began to feel more and more awkward, he noticed that the boy had begun to sweat lightly.<br>\r\n<br>\r\n\"Are you OK?\"<br>\r\n<br>\r\nHe turned around.<br>\r\n<br>\r\n\"Hmmm? It's nothing, you have a tissue or something?\"<br>\r\n<br>\r\nMark dug his hands into his skirt's pockets and turned them inside out.<br>\r\n<br>\r\n\"Sorry, nothing.\"</span></div></div>",
            "created":1276059600,
            "id":896940,
            "title":"Hunt"
        },
        "1111111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Fate",
                "Rescue"
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry, nothing.\"<br>\r\n<br>\r\nThe next thing he knew, he was looking up at the sky as he fell over backwards.<br>\r\n<br>\r\n\"You're another one aren't you! I'm not letting you get me! I don't have time for this, I need to get my body back. Everything is screwed up now, just screwed.\"<br>\r\n<br>\r\nMark landed on the ground and skidded back nearly a foot.<br>\r\n<br>\r\n\"Wait, no! We're not going to attack you!\"<br>\r\n<br>\r\nThe boy looked up.<br>\r\n<br>\r\n\"We?\"<br>\r\n<br>\r\n\"You weren't supposed to tell him!\"<br>\r\n<br>\r\nAlexandria leapt at the boy and with a powerful swing from her leg, knocked him out of the way. She then immediately jumped on him and subdued him.<br>\r\n<br>\r\n\"Calm down, we aren't hostile. I'm certainly not interested in this whole bothersome thing, just as you are. We only want to talk. So we can get of it.\"<br>\r\n<br>\r\nThe boy let up on struggling for a second. But quickly went back to being aggressive.<br>\r\n<br>\r\n\"No, no, there is no way out unless we give them what they want! Didn't you hear them? They track us and they put those things in us to shock us! And the hezodin or whatever drug they have us on. I'm not taking any chances! Things were so bad before, and the longer I'm here, the worse they'll get.\"<br>\r\n<br>\r\nMark tried to calm him.<br>\r\n<br>\r\n\"No, no we have a plan just hear us out. If we stay together...\"<br>\r\n<br>\r\n\"NO!\"<br>\r\n<br>\r\nThe boy partially broke out of Alexandria's hold and lifted her body, despite it being much bigger than his, on his back and slammed her into the black fence, pinning her. Alexandria started pounding his back to break free, but she suddenly began to shout in pain.<br>\r\n<br>\r\n\"Alexandria, what's wrong?\"<br>\r\n<br>\r\nShe didn't answer and only began to trash about more violently, striving to escape. At that point, Mark charged the boy and grabbed him, hoping to be able to throw him to the ground, but as soon as he gripped his bare arm, his hand felt like it was on fire.<br>\r\n<br>\r\n\"Ah!\"<br>\r\n<br>\r\nHe jumped back.<br>\r\n<br>\r\n\"What was that?\"<br>\r\n<br>\r\nThe boy still had Alexandria pinned, she seemed to be getting weaker. Mark became desperate. He took off a shoe and tried to smack the boy with it. It was for naught; the boy knocked the shoe from his hand and grabbed his arm. Mark yelled as he felt his arm become consumed by terrible pain.<br>\r\n<br>\r\n\"Ahhhhhhhhh! Get off!\"<br>\r\n<br>\r\nHe tried to punch the boy, but it didn't seem to have much effect. Like his hand, his face too was extremely hot. Mark began to feel dizzy and lost his footing. He stumbled over the discarded shoe, and fell down to ground, his back against the fence. With his last bit of energy, he latched on to the fence and demanded that his body get up, he sent everything he had to his arm muscles, begging them to pull him up. They did not.<br>\r\n<br>\r\nAs Mark's vision was being drained of color, and started fading to black, he kept giving the signal to his now petrified arm.<br>\r\n<br>\r\nHe was afraid. He was hurt. He thought that he might even be dying. He couldn't see Alexandria any longer, but the sounds of her struggling against the fence had long ceased.<br>\r\n<br>\r\nA single tear fell from Mark's eye and ran down his face. To die as someone other than himself was something that had never crossed his mind. He wasn't ready, he couldn't bare parting with everyone no matter how inevitable. He began to regret even insignificant things; the last memory of his younger sister was a fight with her - over what didn't matter, Mark was sorry for it. How could he abandon his own sister like this? Having caused her trouble? Would this be what she always remembered him by?<br>\r\n<br>\r\n\"Verona...\"</span></div></div>",
            "created":1276059600,
            "id":896944,
            "title":"Mark keeps going"
        },
        "11111111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "The fruit of madness",
                "Alexandria wakes up"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm sorry\"<br>\r\n<br>\r\nMark was gone. The boy who had defeated both him and Alexandria was still wrapped in fear and paranoia, he simply would not stop, not realizing that he had already won. His breathing became heavy and erratic. What he was doing wasn't only dangerous to others, but to himself, at least at this level of intensity. He began to grow tired, and finally stopped his attack when he fell on his knees.<br>\r\n<br>\r\nHe looked worse than before, his entire body was twitching, his eyes weren't even synchronized. His breathing made it almost seem like his lungs would burst. His body began to violent swing from side to side. He gabbed on to the fence and surveyed the damage he inflicted on his attackers.<br>\r\n<br>\r\nThe man was just barely breathing, but other than that was motionless. His skin was turning red all over.<br>\r\n<br>\r\nThe girl was sitting with her back on the fence, her left arm still clenching it tightly. Her head was tilted forward, drooping a little to the right. Her eyes were still open, as was her mouth to a degree. Apparently, she didn't have the same resistance as the man.<br>\r\n<br>\r\nBut then the boy recalled the rules set out by the scientist.<br>\r\n<br>\r\n\"No killing of anyone with enhanced bodies...\"<br>\r\n<br>\r\nHis eyes widened as he stared at the motionless girl.<br>\r\n<br>\r\n\"No, NO! You would get me like this? You sick little...\"<br>\r\n<br>\r\nHe grabbed her a began to violently shake her body.<br>\r\n<br>\r\n\"No, no, no ,no ,no No, No, No, NO, NO, NO!\"<br>\r\n<br>\r\n\"GET UP! STAND UP! UP!\"<br>\r\n<br>\r\nHe opened his mouth and brought his face to hers, as if to let loose a great roar, but only held it open and did nothing. Then, he began to smack the lifeless body, and bang its head against the fence.<br>\r\n<br>\r\nNothing.<br>\r\n<br>\r\n\"GGGGGGAAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHH!!!!!!!!!!!!\"<br>\r\n<br>\r\nHe took his hands and grabbed the body's throat. Off in the distance, a pounding noise, resembling a jackhammer could be heard.<br>\r\n<br>\r\n\"You little, you little, I'll kill you! Move or I'll kill you!\"<br>\r\n<br>\r\nHe then put both arms to his sides and slammed his fists into his own head.<br>\r\n<br>\r\n\"I'll tear your arms out! I WON'T LET YOU RUIN ME!\"<br>\r\n<br>\r\nHe grabbed each of the girl's arms, and began to pull.</span></div></div>",
            "created":1276059600,
            "id":896954,
            "title":"Fate"
        },
        "111111111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "In the hands of the devil",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Die, die, die.\"<br>\r\n<br>\r\nThe boy, now driven solely by insanity, continued his viscous desecration.<br>\r\n<br>\r\n\"I hate you! HATE!\"<br>\r\n<br>\r\nHe began to wail, emitting a most dreadful howl. The sheer barbaric nature of his madness continued to flow from deep inside him, where his true persona, robbed of life and body, stored a most grim agony.<br>\r\n<br>\r\n\"I can't take anymore punishment!\"<br>\r\n<br>\r\nWith the state that he was in, his senses were nearly cut from reality. He stood, still trying to destroy the source of his anger and sadness, but probably was not even aware of what he was doing any longer. Each of his eyes danced in their sockets, moving without reason. His entire body made sporadic movements, and his ears failed to pick up something that by then should have become quite noticeable.<br>\r\n<br>\r\nOver the sound of the distant jackhammer, rose a dull buzzing noise. A sound that anyone who had been in the presence of great amounts of electricity would probably recognize.<br>\r\n<br>\r\n\"Why?\"<br>\r\n<br>\r\nThe boy shook his entire body as he screamed. The sound only became louder, and then, the hairs on the boy's body began to stand up. Not long after, his clothes began to balloon on his body, being repulsed by the charge they now carried. To this, he was completely oblivious. But now it was too late.<br>\r\n<br>\r\nThe girl's long flowing hair, suddenly gained vitality, and rose on its own so that it stood over her head and waved in the air. Her feet had been limp, but now took on a majestic grace as they lifted off the ground. Her body was fixed six inches off the ground, the vision was entirely angelic.<br>\r\n<br>\r\nThe boy's madness was finally broken through, and he noticed the movement of the former motionless body.<br>\r\n<br>\r\n\"What? No, no, you won't escape, there will be no rest for you!\"<br>\r\n<br>\r\nIn total futility, he tried to drag the body back to the ground. Behind the girl, the fence began to spark. The boy gripped her arms tighter.<br>\r\n<br>\r\nAt that moment, the relative quiet of the area was thoroughly broken and the city was rocked by the terrible sound of an absolutely horrendous explosion.<br>\r\n<br>\r\n\"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAARRRRRRRRRRRRRRRRRRRRRRRRRRRRRHHHH HHHHHHHHHHHHHHHHHHHH!\"<br>\r\n<br>\r\nThe boy released a scream that was perhaps the most perfect expression of pain that could ever be heard. Every vein in his body was being overloaded by a relentless stream of electricity. The girl's corpse, now radiating a pure light rose even higher as it discharged its remaining energy. Within seconds, the boy was devoid of consciousness. Yet even then, he continued to move as if possessed; though the word might have very well been fitting to describe his state His body was driven by the girl's immense energy, which completely overrode anything that came from his own body. The boy was locked into his current position, until the girl was finally spent, and both fell to the ground. However, the strike of lightning had not only freed the girl from the grasp of her adversary. It had also gone through her, and rekindled her very heart.<br>\r\n<br>\r\nSome seconds later, Mark awoke, gasping for air. He panted heavily trying to gather anything from his sense. The pounding in his chest was most intense that he had ever felt, it was like his heart was encased in gel, and was bursting right through it. His entire body still felt the burning pain that had sent him into shock, but it was no longer overbearing. For a minute, he did not move his head, as he felt as if he was spinning at great speed, and could not comprehend what his eyes were showing him. When he finally calmed down, he realized that he was staring at nothing but the ground. He looked around, and saw those who had fallen during the fight, the boy and Alexandria.<br>\r\n<br>\r\n\"Alex!\"<br>\r\n<br>\r\nHe crawled over to her, feeling much to weak to stand up.<br>\r\n<br>\r\n\"Alex? Can you hear me?\"<br>\r\n<br>\r\nBefore he got to her, he fell to the side, and released a sigh of pain. He crossed his arms and grabbed his left upper arm.<br>\r\n<br>\r\n\"I can't feel anything.\"<br>\r\n<br>\r\nHe turned back to Alexandria, but did not get up.<br>\r\n<br>\r\n\"Alexandria?\"<br>\r\n<br>\r\nIt was then that he noticed the footsteps behind him. With his remaining good arm, he grabbed the fence, but a strong bolt of static electricity whipped his hand away. He then felt someone grabbing him.<br>\r\n<br>\r\n\"Get off!\"<br>\r\n<br>\r\nHe began to kick, but something was driven into his neck, and he once again fell asleep.</span></div></div>",
            "created":1276195620,
            "id":897394,
            "title":"The fruit of madness"
        },
        "1111111111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "He is released.",
                "He is detained."
            ],
            "content":"<div class=\"\"><div> <span>Before opening his eyes, Mark knew where he was. He could feel the cold support beams that help up the 'bed' within the sleep unit. He decided to remain still, and wait, keeping his eyes closed.<br>\r\n<br>\r\nA pair of beeps went off, and Mark's vision was suddenly shaded with a tint of green. Some gears turned, and he could hear the arms of the sleep unit recede in front of him. He moved his arms to bring them out of pod, but found them still restrained. He open his eyes, only the upper bars had receded, leaving his head exposed, but his body trapped. A green light was overhead, under it, the word 'wake' was illuminated in orange. Shortly after, one of the suited men entered the room and approached Mark's sleep unit. He said nothing, and merely reached in and grabbed Mark's head. With his gloved hands, he opened Mark's eye wide and then took something out.<br>\r\n<br>\r\nMark reacted to the light by turning away, but he could still see it since the man was holding his eyelid open, so he had to turn his eyes. The man remained still for a few seconds, then did the same with Mark's other eye. Afterward, he grabbed Mark around the jaw and shifted his face. Mark glared at him, but unsurprisingly it had no effect. The man then stepped back, and put his hand in his pocket in a very deliberate manner so that Mark would see. The sleep unit opened and Mark stepped out, immediately noticing that he was nearly fully healed.<br>\r\n<br>\r\n\"A good show we're looking forward to more!\"<br>\r\n<br>\r\nMark recognized that voice, he looked to the left, and sure enough the scientist who appeared to lead this madness was casting his filthy smile.<br>\r\n<br>\r\n\"Keep it up, you could win it!\"<br>\r\n<br>\r\nAfter a giving out a quick laugh, he walked off and exited the room. Shock collar or not, Mark was temped to chase him down. He even took a step in that direction, but the suited man reminded him what was in his best interest with a tap on the floor. He then directed Mark to the door. As he passed, he heard another familiar voice.<br>\r\n<br>\r\n\"It's you!\"<br>\r\n<br>\r\nOn his right was the first person Mark met after becoming a girl, the woman from the large room where all the captives were introduced to their tormentor. She smiled, but there was a scar across her forehead.<br>\r\n<br>\r\n\"What happened?\"<br>\r\n<br>\r\n\"I don't want to fight. I'm scared of this whole thing. I tried to run away from someone, but..\"<br>\r\n<br>\r\nThe suited man shoved Mark forward, Mark turned to confront him, but he was now holding something that looked like a baton, probably a weapon. Reluctantly, Marked waved to the woman and left.<br>\r\n<br>\r\n\"I'll look for you when they let me out!\"<br>\r\n<br>\r\nMark made a subtle nod. It was his promise to himself to find her.</span></div></div>",
            "created":1276201080,
            "id":897441,
            "title":"In the hands of the devil"
        },
        "11111111111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Return to the city",
                "The man leads Mark somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>The suited man left him and went back into the room with the woman. Mark listened, worried that he might do something to her, but heard nothing. Meanwhile, a second suited man appeared in the hallway.<br>\r\n<br>\r\n\"You are ready to return to the surface. We have already injected you with henodextonin while you slept. However, be aware that injections do not contain much of the substance, and your body cannot store injected henodextonin. You will need to return to us within the next couple of days.\"<br>\r\n<br>\r\nMark held back the anger he felt towards the man knowing that nothing he could do at this point would help him. However, this one was different, it was as if he actually had an ounce of compassion. Mark could feel it, or at least, he thought he could. It was not enough to quell his suspicion however.<br>\r\n<br>\r\n\"I am going to blindfold you so that we may take you up to the city.\"<br>\r\n<br>\r\nThe man took out a black mask devoid of any openings and held it up in front of Mark's face. Neither moved.<br>\r\n<br>\r\n\"I must do this, I was ordered to.\"<br>\r\n<br>\r\nHe lowered the mask, putting it at his side. His hands went down to his pocket. Mark knew well what this meant and his heart began to race. Should he give in? Or could he beat the man before he pressed it? The man's hand went lower and lower as Mark thought about what to do, but then Mark was presently surprised. The man wasn't going for the pocket at all, he simply lowered his hands to his sides.<br>\r\n<br>\r\n\"If you don't comply, I will have to place you back to sleep. Please, cooperate.\"<br>\r\n<br>\r\nMark stepped forward.<br>\r\n<br>\r\n\"You aren't like the other ones.\"<br>\r\n<br>\r\nThe man tilted his head slightly.<br>\r\n<br>\r\n\"Do not judge us. Not everyone here is here by will. Some of us...\"<br>\r\n<br>\r\nThe man stopped for a second, as he scrunched the mask in his fist, opening and closing his hand.<br>\r\n<br>\r\n\"We know what your are going through. At the hands of that man.\"<br>\r\n<br>\r\nAlthough he couldn't be sure that this empathy was genuine, Mark was moved. He reached out his arm, asking for the mask. The man, after hesitating, passed it to him. After Mark slipped it on his head, they began walking. As they set off, the man whispered something to himself.<br>\r\n<br>\r\n\"Maybe it won't be much longer.\"</span></div></div>",
            "created":1276279560,
            "id":897890,
            "title":"The other side"
        },
        "111111111111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Continue",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Through the completely darkness of the mask, Mark heard the voice of the man for the last time.<br>\r\n<br>\r\n\"Now, I must block your hearing. Bear with me.\"<br>\r\n<br>\r\nMark felt the man's hand go under the mask, he was holding something. It felt unfamiliar, Mark couldn't identify it. The man brushed Mark's hair away from his ear and covered it with the item. It moved on its own as the man withdrew his hand. The device expanded and stretched over Mark's ear, covering it completely. His other ear was soon in the same condition.<br>\r\n<br>\r\nThe man said something after this, but it was reduced to nonsensical babble for Mark. A few seconds later, Mark heard a faint ringing. It grew in each of his ears, until it was all he could hear. Now completely blind and def, he felt something tug his arm, and he followed.<br>\r\n<br>\r\nThe very next moment for Mark defied explanation. He found himself standing by a light post in a dark place. He placed his hands on his face, there was nothing there.<br>\r\n<br>\r\n\"Flag.\"<br>\r\n<br>\r\nHe could hear perfectly fine. Mark stepped back and heard the echo of the ground being scraped by his feet. Behind him, he faintly make out a wall in the distance darkness. It looked perfectly solid, with no door of passage.<br>\r\n<br>\r\n\"Even if it was the lab, who would let me in?\"<br>\r\n<br>\r\nMark glanced down at his outfit. He jacket was open again, revealing a good portion of his body. He buttoned it and then put one hand on his skirt. He reached into its pockets, and like before, found nothing.<br>\r\n<br>\r\n\"I don't have time to deal with this anyway.\"<br>\r\n<br>\r\nHe walked towards the light at the far end of the tunnel and made his way out. His hair blew in the wind as he exited. This wasn't the same section of the city. He seemed to be on a shoreline. Below him, there was a beach dotted with a handful of people. Waves continually landed on the shore with gentle splashes and the wind picked up and died down again with a most playful nature. Across the water, Mark could more land. It wasn't an ocean, but perhaps a bay or large lake. None of this mattered however. What he needed to do was find Alexandria, and the scarred woman too if possible. Mark looked over his shoulder and saw a concrete wall, on top of which was a small artificial hill. The wall was about 8 feet high. Randy would be able to jump it.<br>\r\n<br>\r\nMark took a few steps back. He stared up at the wall, and waited for the wind to calm, and as soon as it did, he jumped. He was surprised at the amount of force he put behind his legs and almost flipped over in the air. The wall shot downward below him, as he landed on top of it, all in a single jump. He stood still for a while before turning to look back at where he had just come from. The without a word, he left, running off in the direction of the city which towered in the distance.<br>\r\n<br>\r\nHis pace began to slow down however, all the way to a slow walk. The odds of running into a specific person were slim to say the least. Even if he was right in his assumption that everyone would head for the city, which is where they were encourage to pursue their battles, it was still a city. Mark needed a better way to locate Alexandria than just running around streets and roof tops. He stopped and thought it over for a few minutes.<br>\r\n<br>\r\n\"I wonder if I can signal to her.\"<br>\r\n<br>\r\nIt was probably the best way to ensure finding her without drawing unwanted attention. However, Mark still wasn't sure about his ability to control his abilities. Although he had been unconscious during the fight with the boy Alexandria had found, he remembered something happening just before he woke up. Mark knew that he did something, and he suspected that that might have been the thing that brought down the mad boy. He took his right hand and messaged his left upper arm.<br>\r\n<br>\r\n\"It was numb after that. I kept trying to pull myself up with that arm.\"<br>\r\n<br>\r\nHe closed his eyes and placed his hands at his sides, taking a rigid pose. He thought about moving his arms, like he did during the fight. He kept concentrating on his arms for a few minutes, but nothing happened. Without moving from his stance, he thought some more and decided to try something else. Instead of thinking about moving his arm, he just concentrated on it, trying to place the majority of his awareness in his arm alone. This time, he felt something, like a build up and energy in his arm. His muscles began to tingle; even though they were still, they felt very active. Mark took this feeling and moved around within his body. First, from one side to the other, than from his arms down to his legs. He passed it around every part of himself. Then he tried to let it out.<br>\r\n<br>\r\nHe brought the feeling to his finger tips and pushed on it, urging it to go farther, but it couldn't. He continued to push and push until he felt something in his other hand. It was the opposite feeling, a void that screamed to be filled. Mark could feel it pulling the energy he had built up in towards itself. He didn't give up pushing. He could almost feel it seeping out of him, and then a loud buzz came out of the air. Mark opened his eyes, and saw sparks rushing from one hand to the other. He looked at it in amazement, and felt the energy within him drain away. This was his ability, and this was how he would find his friends.</span></div></div>",
            "created":1276283040,
            "id":897914,
            "title":"Embracing"
        },
        "1111111111111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "The two set off",
                "They are discovered"
            ],
            "content":"<div class=\"\"><div> <span>Mark kept channeling his energy as he ran toward the city. It was no longer only for signaling purposes, but also served as practice for controlling his ability. This went on for sometime, as he had started on the very edge of the city's boundary. After passing through housing areas, and industrial block, and some park land, he began to notice a slight increase road width and building density. Eventually he came to an elevated highway, which lead him into an area with taller buildings that cut off his view of the city, but he knew he was only getting closer. The highway turned away and merged with a larger road to form a huge crisscrossing overpass. When Mark emerged from underneath it, he knew that he had reached the city. The sky was covered in the tops of buildings, and there was a multitude of miniature suns born from the reflections bouncing off an uncountable number of windows.<br>\r\n<br>\r\nAttempting to make as much use as time as possible, Mark sought an easily accessible roof top to broadcast his signal from. Many of the buildings in this area looked like giant office complexes. They were significantly taller than those he and Alexandria had resided on. Moreover, the streets were more crowded, but still somewhat empty for a city. After running a few blocks with no results, he decided to just move into the next section of the city. Before exciting the busy business area however, he came across a path that lead down to small artificial river. A sign marking out the path of the river seemed to indicate that in ran all the way through the city. By using this, he could perhaps avoid people, including hostile enhanced body subjects.<br>\r\n<br>\r\nMark just kept running, occasionally glancing upward to scout the types of buildings on the surface above. Sure enough, the skyscrapers were soon left behind, and Mark leapt back to street level. The neighborhood wasn't quite as clean or modern as the main city area, a not a person was visible in the streets. It was perfect. Mark cut through a few streets before finding a small path between a few run down buildings. He followed it into a small lot. Once there, he ran up a building and sat himself on the roof. He remained still and concentrated on emitting his signal.<br>\r\n<br>\r\nAs it turns out, he didn't have to wait long.<br>\r\n<br>\r\n\"Good, it is you.\"<br>\r\n<br>\r\nMark got up and turned to see Alexandria standing behind him. She was grinning, which caused to Mark to realize that she hadn't been very expressive before.<br>\r\n<br>\r\n\"How did you find me so quickly? It's only been a half hour.\"<br>\r\n<br>\r\nShe stood for a second, then began to walk over.<br>\r\n<br>\r\n\"You passed by me a long while ago. I noticed your fluctuating signal while I was trying to survey the city from a tall building, and thought it might have been you, so I followed it. But then you starting running off. I couldn't close the distance, so I had to wait until you decided to stop.\"<br>\r\n<br>\r\nMark chuckled and apologized, however things soon took on a more serious tone. Alexandria sat down next to Mark.<br>\r\n<br>\r\n\"While your signal was effective, being separated like this won't aid us. We also cannot rule out that there is someone else like me who may be less friendly. We will have to avoid disasters like last time.\"<br>\r\n<br>\r\nShe stood up.<br>\r\n<br>\r\n\"However, we only have two people on our side. This isn't enough.\"<br>\r\n<br>\r\nMark thought for a minute.<br>\r\n<br>\r\n\"Well, there may be one other person. I met her when I first woke up like this. I just saw her in the lab, they are probably going to release her soon. I just don't know how we can find her.\"<br>\r\n<br>\r\nHe looked up at Alexandria.<br>\r\n<br>\r\n\"I should be able to sense her, but I don't seem to be able to identify signals. I'm also not certain who it is you are talking about.\"<br>\r\n<br>\r\nMark stood up, and moved his arms around, as if stretching.<br>\r\n<br>\r\n\"Then I guess it's back to the old way of doing things.\"<br>\r\n<br>\r\nAlexandria interjected.<br>\r\n<br>\r\n\"We can't afford to be careless. We will have to do a systematic search; every signal that I can detect near by will be investigated. When we approach, you will tell me if we've found the correct person.\"</span></div></div>",
            "created":1276442520,
            "id":898784,
            "title":"Reunion"
        },
        "11111111111111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Investigate",
                "Interupted"
            ],
            "content":"<div class=\"\"><div> <span>Mark and Alexandria went out to the edge of the city and circled the perimeter until they reached the far side. From there they went down the length of the city, trying to remain roughly in the center of it. Whenever Alexandria found anything, they broke off their path and investigated. Several of the first targets they came across were less than interesting, including another run-in with Randy. The two also witnessed a fight between some girl and the teenage boy who had made such a fuss in the lab's holding area. They decided it was best to stay uninvolved and continued searching.<br>\r\n<br>\r\n\"How many of us are there?\"<br>\r\n<br>\r\nAlex and Mark found themselves using an unusual elevated walkway that connected the buildings in the area they were in, but it was sometimes more convenient to go off the path and jump from building to building if they were packed close together.<br>\r\n<br>\r\n\"Right now, I can sense eight. Going by the number we just encountered, and the number of people who were present during that man's introductory speech, twenty would be a low estimate.\"<br>\r\n<br>\r\nMark ran and built up speed for his next jump. He still by no means liked being trapped in this body of his, but he found some of its abilities rather mesmerizing. His powerful leaps let him feel as if he was flying. Feeling the air on his legs and through his hair only enhanced the feeling.<br>\r\n<br>\r\n\"This is so wrong that it's... I don't even know. I mean why not ask people? I'm sure I that I would have considered being part of his project if he told me it would make me superhuman and he gave me a choice.\"<br>\r\n<br>\r\nAlex landed right behind him.<br>\r\n<br>\r\n\"You have hindsight. I'm sure your skepticism would be much higher if you had not gone through it yourself. I still can't figure out how he did this. I don't even have the faintest theory.\"<br>\r\n<br>\r\n\"And you're pretty smart too. This guy must be a genius, too bad he's evil.\"<br>\r\n<br>\r\nMark thought over his words for a minute as he leapt to another building.<br>\r\n<br>\r\n\"Actually, you're really smart. What were you before this? A scientist? A professor? Some agent working for the government?\"<br>\r\n<br>\r\nAlexandria moved her lips, but quickly and reflexively squashed her expression, keeping her collective demeanor unbroken.<br>\r\n<br>\r\n\"Hardly. I was a student at The Academy for Excellence and Guidance. It is a high school for girls. I was departing the lab after staying late to complete some research I started on my own initiative. That's when everything went blank for me. I woke up in this body, and I'm sure you can figure out the rest.\"<br>\r\n<br>\r\n\"Wow, high school. Just like me! You're even smarter than I thought, you're no older than I am.\"<br>\r\n<br>\r\nAlexandria frowned slightly.<br>\r\n<br>\r\n\"I currently look a decade older than you at least.\"<br>\r\n<br>\r\nMark felt a little bad for reminding her of this fact, but it was the reality of the situation.<br>\r\n<br>\r\n\"Do you think we can trust them? I mean they said there would be a prize, but...\"<br>\r\n<br>\r\nAlexandria grabbed him.<br>\r\n<br>\r\n\"Wait, there are two people near by.\"</span></div></div>",
            "created":1276468440,
            "id":898959,
            "title":"Delayed Introduction"
        },
        "111111111111111":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Go after the signal",
                "The signal suddenly vanishes"
            ],
            "content":"<div class=\"\"><div> <span>\"Should we split up?\"<br>\r\n<br>\r\nAlexandria looked at Mark and gave a firm head shake.<br>\r\n<br>\r\n\"We can't face another set back, stay together, and stay out of sight.\"<br>\r\n<br>\r\nThe pair began to descend from the rooftops into the street. As they became lower, they made less extreme movements, trying to appear as normal as possible.<br>\r\n<br>\r\n\"This place is more populated than I would like it to be.\"<br>\r\n<br>\r\nThe streets below were being traversed by a fair amount of people going on their daily business. For once, the city seemed alive. After reaching the surface, Alexandria skirted around the side of tall steel building, into a little outdoor lobby. Mark followed. She stopped, then sat on a bench and thought for a second. The two perfectly blended in with the rest of the bystanders, some of whom were jaunting through the area; others sitting down to admire the scenery.<br>\r\n<br>\r\n\"Let's try to minimize our exposure. Can you readily identify the person that you are looking for?\"<br>\r\n<br>\r\nMark nodded.<br>\r\n<br>\r\n\"What are we going to do?\" He asked.<br>\r\n<br>\r\n\"The first signal is taking a consistent path. We can go ahead of it, then backtrack and pass by quickly, hopefully avoiding any attention in doing so.\"<br>\r\n<br>\r\nMark ran his fingers through his hair.<br>\r\n<br>\r\n\"So, we're just going to run past her?\"<br>\r\n<br>\r\n\"If that is how you want to put it.\"<br>\r\n<br>\r\nMark stood up, followed by Alexandria, who then led the way. They made their way around the building and darted down the block at a brisk pace.<br>\r\n<br>\r\n\"Around this corner.\"<br>\r\n<br>\r\nAlexandria led Mark down the sidewalk, before halting before a gap between adjacent buildings.<br>\r\n<br>\r\n\"The signal is coming from in there. Whoever it is might be hidden in a group of people, so look carefully. We will just walk by without drawing attention.\"<br>\r\n<br>\r\nMark nodded. \"Right, let's go.\"<br>\r\n<br>\r\nAs they slid into the pathway, they saw a jumbled crowd approaching them.<br>\r\n<br>\r\n\"The signal is coming towards us.\"<br>\r\n<br>\r\nMark scanned the crowd, searching for the face of someone he now regarded as a lost friend. Mark himself probably wasn't aware of how attached he had become to this woman; the one who showed him kindness and lent him her aid. Alexandria kept focusing, trying to align her sight with her other sense. However, as the signal became closer, she noticed that she could not trace it to a single individual in the crowd. To her, it seemed as if the entire group was giving something off.<br>\r\n<br>\r\n\"I can't see any finer. It's up to you.\"<br>\r\n<br>\r\nMark continued to scan, he had been relying on his own senses from the beginning. He looked over every face, his eyes jumping around without rest.<br>\r\n<br>\r\n\"I know she's here, I can feel it.\"<br>\r\n<br>\r\nAs Mark said that to himself, he noticed someone passing him, a woman in a somewhat dated black dress walking beside him in the opposite direction. Her head hung low, and was draped by her golden pony tailed hair. Mark stopped, and fixed his eyes on her, continually checking that this wasn't a false vision. He reached out his arm and gripped her sleeve.<br>\r\n<br>\r\nShe turned, at first startled, but when her eyes met Mark's, she instantly recognized him. Alexandria was naturally on top of things, and before they expressed their gladness at seeing each other, whisked them off to a more secluded place.<br>\r\n<br>\r\nAlexandria led them back towards the open lobby of the steel building, where they occupied a quiet corner. The woman jumped at Mark and wrapped her arms around him.<br>\r\n<br>\r\n\"I can't believe it how did you find me?\"<br>\r\n<br>\r\n\"Well, I promised.\"<br>\r\n<br>\r\nMark turned toward Alexandria, who was presumably still tracking the other signal, her attention was elsewhere.<br>\r\n<br>\r\n\"Alexandria helped too, her ability is really what lead us to you.\"<br>\r\n<br>\r\nThe woman looked at Alexandria in confusion.<br>\r\n<br>\r\n\"Her?\"<br>\r\n<br>\r\nMark bobbed his head slowly.<br>\r\n<br>\r\n\"Yeah, she went through the same thing I did.\"<br>\r\n<br>\r\nThe woman smiled a bit and looked up and Alexandria.<br>\r\n<br>\r\n\"I'm sure we can fix everything!\"<br>\r\n<br>\r\nAlexandria only nodded and kept looking off into the distance, past the surrounding people and buildings.<br>\r\n<br>\r\n\"She's still following someone else. We've been going around trying to get people on our side so that we can try to figure out the best way to get through this whole thing.\"<br>\r\n<br>\r\nThe woman's face brightened.<br>\r\n<br>\r\n\"That's a good idea. What do you think you're going to do?\"<br>\r\n<br>\r\nMark leaned back, with his hand on his head.<br>\r\n<br>\r\n\"Well, I'm not the brains of the operation, it's up to Alex.\"<br>\r\n<br>\r\nHe laughed, along with the woman, but then noticed that her scar was gone.<br>\r\n<br>\r\n\"Your face, it healed?\"<br>\r\n<br>\r\nThe woman made a confused look, then dragged her hand along her forehead.<br>\r\n<br>\r\n\"It is? I didn't notice, but I'm glad.\"<br>\r\n<br>\r\n\"How did you get it anyway?\"<br>\r\n<br>\r\nThe woman folded her hands and looked down.<br>\r\n<br>\r\n\"I'm not someone who likes fighting. And I'm not good at it. Someone found me before, and I did the only thing I could, I ran.\"<br>\r\n<br>\r\nMark placed a hand on her shoulder as the breeze picked up.<br>\r\n<br>\r\n\"It was the same with me, only I couldn't even run. Alexandria saved me from some man who was out of his mind. I was beat up pretty badly.\"<br>\r\n<br>\r\nThen he grabbed her other arm and pulled her face to his.<br>\r\n<br>\r\n\"But things can change, I just learned how to use this body a little while ago. They may have been forced on us, but they are still pretty incredible. You could learn to use yours too.\"<br>\r\n<br>\r\nThe woman's eyes opened up as she began to think over the possibilities.<br>\r\n<br>\r\n\"That sounds incredible, but I'm still not a fighter.\"<br>\r\n<br>\r\nShe began to kick at the ground.<br>\r\n<br>\r\n\"While I look like this now, I'm really only eleven...\"<br>\r\n<br>\r\nMark was taken back.<br>\r\n<br>\r\n\"Eleven?\"<br>\r\n<br>\r\nAlexandria looked down at the girl for a moment.<br>\r\n<br>\r\n\"These people have no limits.\"<br>\r\n<br>\r\nThe woman looked away and shyly presented her true identity.<br>\r\n<br>\r\n\"I'm Elise Johnson.\"<br>\r\n<br>\r\n\"You can call me Mark.\"<br>\r\n<br>\r\nAlexandria turned around again.<br>\r\n<br>\r\n\"You aren't a girl?\"<br>\r\n<br>\r\n\"No, I tried to tell you before, when we were first on the roof, but I was still hurt. I guess it just slipped since then.\"<br>\r\n<br>\r\n\"At least I have something to call you now, Mark.\"<br>\r\n<br>\r\n\"Me too!\" replied Elise.<br>\r\n<br>\r\nAlexandria pulled both of them up.<br>\r\n<br>\r\n\"I think we're all fairly well acquainted now. The other signal is moving away. Let's see if we can find one more ally.</span></div></div>",
            "created":1276544820,
            "id":899516,
            "title":"Investigate"
        },
        "1111111111112":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Or so he thought. After repeating the technique a few more times for practice, he found himself in the presence of another.<br>\r\n<br>\r\n\"What's with this? You trying to get my attention?\"<br>\r\n<br>\r\nMark spun to find the owner of the unfamiliar voice sitting in a tree. A girl with short black hair. She seemed somewhat like a vagrant, she wore nothing but a short sleeved shirt, jeans, and shoes that bordered on being boots. However her initial reaction made Mark think that she might not be hostile.<br>\r\n<br>\r\nShe jumped down from the tree and approached Mark.<br>\r\n<br>\r\n\"Either this is some coincidence, or you knew that I could pick up other people's, powers, or whatever. I want to know how.\"<br>\r\n<br>\r\nShe kept coming closer, Mark wasn't sure of what to do. If she did want to fight, this wasn't the place. There were houses around.</span></div></div>",
            "created":1276445280,
            "id":898800,
            "title":"Wrong kind of attention"
        },
        "11111112":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Mark gets up",
                "Alexandria gets up"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, let him go!\"<br>\r\n<br>\r\nSeemingly out of no where, the girl who Mark first met in the lab appeared. She was angry and looked ready to fight. The wild boy started to look back and forth rapidly, splitting his gaze between Mark and the woman. He then made a sudden leap at the woman, letting Alexandria and Mark free.<br>\r\n<br>\r\n\"AAAAAAAAAAHHHHHHHHHHHHH!\"<br>\r\n<br>\r\nMark fell to ground, hitting his head. It hurt, but he could hardly move to tend to his injuries. Feeling was returning to his body though, and his eye sight started to recover. He could hear the boy yell and scream, but could not pick up anything that sounded like fighting, only running. Through sheer force of will, Mark dragged one arm up, and used it to get his body off the ground. Looking up, he saw the boy chasing after the woman. She wasn't fighting him, instead running up and down the street and getting the boy to charge at her, dodging at the last minute to get him to run into walls in his insanity.<br>\r\n<br>\r\nMark sat resting for a moment. He knew he had to help, but he couldn't move too soon, he was still weak.</span></div></div>",
            "created":1276472280,
            "id":899013,
            "title":"Rescue"
        },
        "1111112":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Alexandria follows him",
                "Mark convinces her to stop"
            ],
            "content":"<div class=\"\"><div> <span>After standing around for about a minute, Mark decided that this person wasn't related to the body exchange experiments, he was just weird.<br>\r\n<br>\r\n\"Um, well, if you find the contact and still see me around, just let me know, uh, thanks!\"<br>\r\n<br>\r\nMark just walked past the boy briskly and never looked back. Upon seeing this, Alexandria backed up and sat in one of the benches in the park. Mark sat down next to her.<br>\r\n<br>\r\n\"What happened?\"<br>\r\n<br>\r\n\"He's just some strange guy. I honestly think he's on something to be honest.\"<br>\r\n<br>\r\nAlexandria grabbed Mark and turned him toward her.<br>\r\n<br>\r\n\"No, I can sense something from him, and now that we are so close, it's stronger than ever. He's not normal. No one else we passed gave off even a tenth of the energy.\"<br>\r\n<br>\r\nMark just brushed her off.<br>\r\n<br>\r\n\"Well, I did what I could. You seem to be the smart guy...\"<br>\r\n<br>\r\n\"Don't call me a guy.\"<br>\r\n<br>\r\nAlexandria frowned deeply. Mark took some devilish pleasure in denting her ego slightly, but it also reminded him that he didn't get to tell her who he really was.<br>\r\n<br>\r\n\"Fine, as long as you don't call me a girl.\"<br>\r\n<br>\r\nAlexandria just gave him an uninterested look.<br>\r\n<br>\r\n\"Why not tell me before?\"<br>\r\n<br>\r\n\"I tried to, but my injuries prevented it. My name is Mark by the way.<br>\r\n<br>\r\n\"Noted. But I'm not done with that boy.\"</span></div></div>",
            "created":1276111260,
            "id":896991,
            "title":"Mark feels that Alexandria made a mistake"
        },
        "11112":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "He climbs the fire escape",
                "He goes out into the street"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I said now!\"<br>\r\n<br>\r\nRandy looked around, then bolted off, fueled by rage.</span></div></span></div>",
            "created":1276108620,
            "id":896973,
            "title":"Randy won't give up so easily"
        },
        "111121":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "\"He, she, or whatever is fine, no need to worry. I got my eyes on you!\"",
                "\"Got a thing for that one? What if I break her?\""
            ],
            "content":"<div class=\"\"><div> <span>\"You ain't getting nowhere!\"<br>\r\n<br>\r\nRandy rushed for the fire escape, but did not simply climb it. Even more impressive then his jump from it, he hurled himself perfectly vertically and then latched on to the stairway with a single arm. He let out a grunt and propelled himself up the side of the building. He continued this until he neared the top. Randy eventually landed on a wide ledge beneath a modest tower on the top of the building. The immediate area was empty, but a ladder stood fixed to the far end of the wall.<br>\r\n<br>\r\n\"Ahhh hhhaaa!\"<br>\r\n<br>\r\nAs Randy peered over the top of the ladder, he saw his targets, the man and the unconscious girl.<br>\r\n<br>\r\n\"Well, well, I just migh' get two of ya.\"<br>\r\n<br>\r\nHe strode across the ground exuding pride and arrogance. He could tell that he was in a good position. The girl was out cold, the man was out of breath.<br>\r\n<br>\r\n\"Whasa'matter big boy, burnt out already?\"<br>\r\n<br>\r\nRandy had no idea why, but ever since he reached the top of the building, he felt himself becoming stronger, his body was beyond rejuvenated.<br>\r\n<br>\r\n\"I'm just itching to finish what we started, don't look like it will take long!\"<br>\r\n<br>\r\nHe began a wild charge, barreling straight for the man as he knelt still. When Randy was within 1 foot, he let fly a viscous uppercut. However, the other man, despite looking worn out, managed to dodge it like it a feather drifting in the breeze.<br>\r\n<br>\r\n\"You've got some set of legs boy!\"<br>\r\n<br>\r\nRandy threw himself around and proceeded to attack in the same manner. The man kept dodging, but each time, it became closer and closer. Eventually, the man retreated, but was forced into a corner. He fell to a knee and grabbed his head, apparently trying to quell a major headache. He slipped a look at the girl, still knocked out. Randy just laughed and continued his taunts.</span></div></div>",
            "created":1276109940,
            "id":896980,
            "title":"Raging Bull"
        },
        "112":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Continue",
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>If adding, choose a previously mentioned character (intentionally vague), character from much later in the story on some other line, or make a new one.</span></div></span></div>",
            "created":1276110480,
            "id":896982,
            "title":"Switch to another character (feel free to make ..."
        },
        "13":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "\"We can't be sure\"",
                "\"I give you my word\"",
                "\"Just don't think about\"",
                "\"Even if you have to give something up, this is the right thing to do\"",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Mark was taken to a small examination room. He had been locked to a chair, and was waiting for someone, anyone, to explain what was going on. After an eternity, one of the suited men came into the room.<br>\r\n<br>\r\nMark nervously watched as he collected a large number of needles and vials and placed them on a table. Then he approached him. Mark shook in his restraints, imagining many terrifying ways that he could suffer at the hands of this person, but then,<br>\r\n<br>\r\n\"Shhh, I can't take this anymore. I was so excited to join this project, but when I found out..\"<br>\r\n<br>\r\nThe voice sounded more like a woman's than a man's.<br>\r\n<br>\r\n\"I just, no. All of it, it's not right, it has to stop.\"<br>\r\n<br>\r\nThe figure's hands rose to the mask and pressed two black buttons on the sides. The dark visor over her face lifted, revealing her anguished face. She looked much more upset than Mark. Hoping that she would help him, Mark spoke.<br>\r\n<br>\r\n\"What's going on?\"<br>\r\n<br>\r\n\"That man, Dr. Gatrop, he is insane. This is wonderful technology, wonderful research, but he twisted all of it! Kidnapping? Forced experimentation? Why? He doesn't want to go through things the right way, he just wants his results and his sick fun!\"<br>\r\n<br>\r\nThe woman put her hand to her face, trying to cover up her tearing eyes. After a minute she continued.<br>\r\n<br>\r\n\"I'm not a part of this anymore. I've washed my hands, done!\"<br>\r\n<br>\r\nShe walked over to a cabinet and grabbed a large bag, then scooped all of the needles and vials and threw them in.<br>\r\n<br>\r\n\"I am going to disable your 'security devices' so that you can take this man and his insanity down.\"<br>\r\n<br>\r\nShe tossed the bag onto a chair across the room, then brought a couple of books down from a shelf on the wall.<br>\r\n<br>\r\n\"I'm not authorized to do anything with them, so it will take me some time to get it done without being caught, but once you are free, you can fix everything.\"<br>\r\n<br>\r\nThe woman turned around and finally showed a hint of happiness. Mark was uncertain about becoming some kind of hero, but the default option was none too attractive itself.<br>\r\n<br>\r\n\"Yes, please, I don't want to do this.\" Mark stopped for a second, realizing something. \"Do you know where my body is?\"<br>\r\n<br>\r\nThe woman walked up to him.<br>\r\n<br>\r\n\"That I'm not sure about, and I don't just mean location. My job was to help develop and evaluate the artificial bodies. I don't know how people were transferred from their old bodies to the artificial ones, and I don't know what happened to the old bodies. But if we get out of Gatrop's grip, we can find out.\"<br>\r\n<br>\r\nMark was now much less confident. If he rebelled, his body could end up destroyed, leaving him stranded as this girl he had been forced to become. He looked at the woman with worried eyes.<br>\r\n<br>\r\n\"How can I be sure my body will be alright?\"</span></div></div>",
            "created":1276108320,
            "id":896969,
            "title":"Continue"
        },
        "15":{
            "author_id":"clagger",
            "author_name":"Clagger",
            "choices":[
                "Armed soldiers break into the lab",
                "Someone tries to fight back",
                "Mark decides that he needs to escape before they give him henodextonin",
                "The woman refuses to leave Mark",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does something happen?</span></div></span></div>",
            "created":1276523340,
            "id":899330,
            "title":"Options"
        }
    },
    "info":{
        "author_id":"clagger",
        "author_name":"Clagger",
        "brief_description":"Ordinary people are forged into the world's greatest fighters, with one purpose.",
        "created":1258688940,
        "description":"<td align=\"left\" class=\"norm\">Some organization is kidnapping people and effectively erasing their old existences so that they may be transformed into perfect fighters, with bodies far more evolved than that of normal humans.<br>\r\n<br>\r\n1-1-1-1-1-1-... etc is reserved, please don't add to that line<br>\r\n<br>\r\nYou can do pretty much anything else, if you don't like a chapter I wrote, feel free to copy it and write it your way if you can fit it in to the story and have it make sense.<br>\r\n<br>\r\nAlways use all chapter options, if you can't think of anything, just make \"other\" a choice.<br>\r\n<br>\r\nMind the rating.</td>",
        "id":1619902,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1276544820,
        "modified":1276544820,
        "pretty_title":"Transcend Fighter"
    }
}