{
    "chapters":{
        "1":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Switch bodies with Mikey",
                "Become one of his objects",
                "Shrink down"
            ],
            "content":"<div class=\"\"><div> <span>Characters:<br>\r\n<br>\r\n<span class=\"cgreen\">You</span>: You are a 18 year old who is living your last summer at home, you try to care for your little brother Mikey, but you aren't good at understanding him.<br>\r\n<span class=\"cblue\">Mikey</span>: A growing 3 year old who wears pull-ups, he often plays with dolls and goes to a local day-care. Your brother.<br>\r\n<span class=\"cbyellow\">Mom</span>: You and Mikeys mother who cares for Mikey and all of his basic toddlers needs. Drops him off at the day-care every week day.<br>\r\n<span class=\"clred\">Maria</span>: A girl who is Mikeys friend at the day-care. She is 4 years old and still wears pull-ups, she is often teased because of this. Loves dolls. <br>\r\n<br>\r\n<br>\r\n<br>\r\n2 years ago you had a terrible ordeal with your younger brother-- <span class=\"cpblue\">Mikey</span>. You had been put into a position with him that was bizarre and was torturous. You had come back to your normal body within a few days, but still have not fully recovered mentally from the ordeal. Mikey seems to have no idea what he put you through and no one would ever believe your story, so you just stopped trying to convince them. <br>\r\n<br>\r\nMikey is now 3 years old. A growing toddler, he can now walk effectively and speak fractured English, but he still uses pull-ups to deal with his potty problems. And still goes to the same day-care he went to 2 years earlier. You, for the most part, have gotten over what happened before and are living your normal life. To you, it's all in the past...<br>\r\n<br>\r\n<div align=\"center\"><span class=\"clred\">You are wrong.</span></div></span></div></div>",
            "created":1320901200,
            "id":1221059,
            "title":"Beginning "
        },
        "11":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "\"Looks like my little man needs a change!\"",
                "\"Honey? Why are you up? You need more nap time!\""
            ],
            "content":"<div class=\"\"><div> <span>You arrive home after a tiring day of school, you walk by your little brothers room and into yours. You drop your backpack, letting it hit the ground. Your mother calls up from the floor below \"Honey? Is that you? How was school?\". \"Yeah it's me, alright I guess..\" you yell back trying not to wake your brother in the next room. You are exhausted and prepare to go to bed, you lie down and pull the covers over your head enjoying the cozy feeling and, slowly, drifting into sleep....<br>\r\n<br>\r\nA few hours later you begin to wake up, you hear the distant footsteps of your mother below. You open your eyes to the ceiling and, to your surprise, see that it is a light blue color instead of your normal white. You sit up in bed and look across the room, it is your little brothers.... You realize: Its happening again! You stand up, your body barely getting 3 feet off the ground, everything is much bigger. You look down at your body, your short with tiny hands and arms. You legs are weak and it is harder to stay balanced. You see that you are wearing blue overalls and, as it now comes back to you, a messed, soggy, itchy blue pull-up clinging to your hips. You knew that he wet the bed and are saddened to have to go through it. Just then your mother walks in...</span></div></div>",
            "created":1320901200,
            "id":1221093,
            "title":"Switch bodies with Mikey"
        },
        "111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Feeds you",
                "Brings you to day-care"
            ],
            "content":"<div class=\"\"><div> <span>You turn around to see your mother walking into your room, she now towers over you and is able to pick you up without a problem. She sniffs you and brings you to the changing table. \"Mommy! NO!\" you protested<br>\r\n<br>\r\n\"Oh yes! We need to get you all cleaned up!\" she unbuttons the overalls to reveal a blue pull-up, the smell is unbearable and the itch is irritant. She unstraps it and opens it up, you try to hide your genitals but she scrubs viciously and your whole crotch is in pain. She gets a new one and attaches it to you. You resist the whole time but it is worthless, she has total control. She then gets the overalls and puts them back on you and...</span></div></div>",
            "created":1320987600,
            "id":1221162,
            "title":"\"Looks like my little man needs a change!\""
        },
        "1111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Keep thinking of escape",
                "Just ignore the want to escape for now.."
            ],
            "content":"<div class=\"\"><div> <span>She easily takes you and puts you into his highchair, it is tight but many crumbs and dirt. She belts you in and gives you a small bowl of goldfish and a bottle, you refuse to eat or drink, and after a little while she finally ends up forcibly feeding you. While this happens you ponder how to get away. But you were trapped in a toddler's body with tons of safety devices assuring that escape was impossible. You look grimly at your body, your new overalls and pull-up waiting to be soiled. At the moment your mother picks you up and brings you to the living room to watch TV in her lap, she lets you sit in her lap as she watches TV. You struggle but escape is impossible, even if you got out of her lap there are gates everywhere..</span></div></div>",
            "created":1320987600,
            "id":1221477,
            "title":"Feeds you"
        },
        "11112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "It was a dream",
                "You have soiled your pull-up"
            ],
            "content":"<div class=\"\"><div> <span>You just sit back and watch TV. She then takes you and sets you back in your room. You walk around aimlessly trying to find something to do or somewhere to go. After a few minutes she returns and leads you to your bed, she tucks you in and to your surprise you fall asleep quickly...<br>\r\n<br>\r\nYou awaken to a bright light from your window, you hope its all a dream, you open your eyes to see...</span></div></div>",
            "created":1321333200,
            "id":1223710,
            "title":"Just ignore the want to escape for now.."
        },
        "111121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "content":"<div class=\"\"><div> <span>You sit up and look around, you are in your room. Not Mikeys but YOUR room. Wearing normal clothes and no pull-up. You get up and walk into your brothers room, he is playing. Pull-up attached to him and not you. You play with him and help change his pull-up, glad to be on the other end. From then on you had a new respect for Mikey.<br>\r\n<br>\r\n<div align=\"center\">:) Ending</div></span></div></div>",
            "created":1321333200,
            "id":1223712,
            "title":"It was a dream"
        },
        "111122":{
            "author_id":"gopherit",
            "author_name":"Gofoeme",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it huge</span></div></span></div>",
            "created":1425963600,
            "id":1946674,
            "title":"You have soiled your pull-up"
        },
        "1111221":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "To dump it into the training potty",
                "Clean up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You suirm, as you can feel a rather large mass waitingnin your Pull-Up. Carefully getting up, you decide....</span></div></span></div>",
            "created":1425963600,
            "id":1946694,
            "title":"Yes"
        },
        "11112211":{
            "author_id":"gopherit",
            "author_name":"Gofoeme",
            "choices":[
                " Changes you",
                "Makes you sit in the pull up the rest of the day"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you take it to the training potty your Mom catches you and she is furious at you and she </span></div></span></div>",
            "created":1425963600,
            "id":1946823,
            "title":"To dump it into the training potty"
        },
        "111122111":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "Pee",
                "Poop"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She cleans you up, and tells you she wants you to try and use the potty again. She sets you on the potty, in the corner. A few minutes later, you have to...</span></div></span></div>",
            "created":1426050000,
            "id":1947022,
            "title":" Changes you"
        },
        "111122112":{
            "author_id":"gopherit",
            "author_name":"Gofoeme",
            "choices":[
                "Pee",
                "Poop"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She says, your supposed to go in the potty not in the pull up and the potty your going to sin in that dirty pull up for the rest of the day and she put me back in the pull up when I needed to go</span></div></span></div>",
            "created":1426654800,
            "id":1949974,
            "title":"Makes you sit in the pull up the rest of the day"
        },
        "1111221122":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "Mess yourself",
                "Uses the potty"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While you mulled over your situation, your bowels gurgled. You groaned, you didn't want to make your mom mad, but you didn't want to want to use the training pants. Yo...</span></div></span></div>",
            "created":1427259600,
            "id":1953693,
            "title":"Poop"
        },
        "11112211221":{
            "choices":[
                "changes you ",
                "makes you stay in your dirty pull up for an hour then changes you"
            ],
            "content":"<div class=\"\"><div> <span>You decided to go and use the potty. You tried to hold it as you went to the potty but you couldn't as your stomach grumbled as you let out a wet fart. You instantly get into the squat position .\"I really don't want to do this.\" You think to yourself as you grunted. You let out another fart before pooping. Suddenly your mom comes in \"Mikey.\" She asks sternly. You open your eyes to see your mom and she did not look happy. \"I am so dead.\" You thought. \"Mikey didn't I say for you to not soil your pull up?\" She asked. You nod \"yes mommy. But I tried going to the potty.\" You said hoping that she wouldn't be too mad.  \"I'm really sorry mommy\" you say. Your mom then ....</span></div></div>",
            "created":1443070800,
            "id":2039278,
            "title":"Mess yourself"
        },
        "11112211222":{
            "choices":[
                "yes (you made it)",
                "No (mom is furious and your punished)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to use the potty. Making mom mad was not a good idea. But as you make your way to the potty your stomach gurgles. Do you make it? </span></div></span></div>",
            "created":1442984400,
            "id":2038814,
            "title":"Uses the potty"
        },
        "1111222":{
            "author_id":"chrisern",
            "author_name":"ShadowBlade",
            "choices":[
                "...really getting the hang of going potty.",
                "...is having too many accidents-he needs to use the potty, or back to diapers."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You-err, MIKEY, only wet his Pull-Up a little. You get up out of bed to go get mommy-MOM! To change you. As she does so, she mentions that you-MIKEY! Is...</span></div></span></div>",
            "created":1536282240,
            "id":2544032,
            "title":"No"
        },
        "1112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Try to find a spot with no kids to think things over",
                "See if you can escape"
            ],
            "content":"<div class=\"\"><div> <span>She carries you to the car as you try to explain what has happened, \"But Mommy! I'm not Mikey! Mommy!\" You pleaded but your voice and tone made it impossible to take seriously, \"Honey, Now I know you don't want to go, but I have no where else to leave you!\" She puts you in the car seat and wraps the seat belt around your clean pull-up and overalls. Then she drives you over. <br>\r\n<br>\r\nWhen you arrive she unbelts you and takes you in. You walk into the day-care and look around, in one area there are older children, between ages 3 and 9 playing quietly and easily. Then in another there are younger children, ages 0 to 3. That room is chaos with children running around, uncontrollable, and unlike the other room, it seems like all of these children are not potty trained and wore diapers or pull-ups. Your mother walks up to the front desk and drops you off. You see her whisper \"He still wears Pull-ups, so you should put him where he can be changed!\" as if you couldn't understand what she is saying. Then she kisses you and walks away. The woman at the desk leads you into the room with younger children, then she leaves you in the chaos...</span></div></div>",
            "created":1320987600,
            "id":1221591,
            "title":"Brings you to day-care"
        },
        "11121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Its nap time!",
                "A young girl walks up to you"
            ],
            "content":"<div class=\"\"><div> <span>You look around and see a small chair that is open in a corner, you make your way over and as you do you observe the other children, most are just babies, but some are toddlers like Mikey, and a couple are older, 4 or 5, who you assume didn't get out of diapers fast enough. You see a girl being scrubbed clean at the changing table, you cringe at how embarassing that might be. You make it to the chair and see down on you pull-up. You figure that if you can make it through the day-care, you'll be fine, but just as you think that...</span></div></div>",
            "created":1321160400,
            "id":1222620,
            "title":"Try to find a spot with no kids to think things..."
        },
        "111211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "You are in need of a change",
                "You are on your way home"
            ],
            "content":"<div class=\"\"><div> <span>Before you can think anymore, a pair of cold hands wrap around <span style=\"text-decoration:line-through\">Mikey's</span> your body. They lift you into the air, then you turn to see the smiling face of one of the day-care workers, \"Well aren't you the cutest thing? But it's nap time for you!\" she takes you into a room with many small beds. There are many children already fast asleep, you don't want to sleep, \"I'm not tired at all!!\" you say, but the woman acts as if you had said nothing. She sets you down on a small bed and tucks you in, you lie there, unable to do anything. Next to you a girl seems to be used to this and is already fast asleep, you close your eyes...<br>\r\n<br>\r\nWhen you awaken..</span></div></div>",
            "created":1326949200,
            "id":1261957,
            "title":"Its nap time!"
        },
        "1112111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Hide it!",
                "Just get changed here"
            ],
            "content":"<div class=\"\"><div> <span>You open your eyes and look around, there are still many kids sleeping. As you look around you see a strange bulge in the bed, almost as if-- Then it hits you, You had wet your pull-up in your sleep, and now you must be changed again! You really didn't want to be changed in public, how embarrassing! But wearing the pull-up is worse! What do you do..</span></div></div>",
            "created":1326949200,
            "id":1261959,
            "title":"You are in need of a change"
        },
        "11121111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Mom comes back",
                "A long day.."
            ],
            "content":"<div class=\"\"><div> <span>You sit up and take the covers off, you open the front of your pants, there in it is a swelled up pull-up. You realize that you must hide it quickly, you quickly walk out of the room and into a crowd of kids. There, you sit down (forcing the disgusting pull-up against you) and try to think of how to hide it for now....</span></div></div>",
            "created":1326949200,
            "id":1261960,
            "title":"Hide it!"
        },
        "111211112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Changes you immediatly",
                "Lets you play"
            ],
            "content":"<div class=\"\"><div> <span>Over the next few hours you remain quiet and hiding with a few close calls, Finnaly your mother returns and picks you up, \"Hows my baby? Whew! you need a change!\" she takes you and buckles you into the car. You hate the cold pull-up that is stuck against you. Soon you arrive home, your mother..</span></div></div>",
            "created":1327035600,
            "id":1262412,
            "title":"A long day.."
        },
        "11121112":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "told to go back to sleep (may use your pullup)",
                "go and play (will use your pullup)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Embraseed as you are, you would rather get changed in public then suffer a rash. Walking over to the teacher, you ask her for a chabge. Grabbign some supplies, she pulls your pullups down, ipes and poweder you. Thanking her, you are....</span></div></span></div>",
            "created":1337144400,
            "id":1338419,
            "title":"Just get changed here"
        },
        "111211122":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Get changed(may be diapered)",
                "Stay in it(will be diapered)"
            ],
            "content":"<div class=\"\"><div> <span>You were told to go play with some toys near the other kids. The toys were actually looking kinda entertaining as if they were begging to be played with. You guessed it would be okay if you played with them... for just a little while. In fact you were having so much fun with the toys you didn't even notice your need to poop until it was already coming out. You figured it was to late and started to push just to get it over with. After a minute or so of softly grunting the poop came into the pull up pressing against your but. You actually didn't mind the feeling that much... in fact it felt pretty nice. It was all warm and squishy. After enjoying your poopy diaper for a minute you decide</span></div></div>",
            "created":1427605200,
            "id":1956039,
            "title":"go and play (will use your pullup)"
        },
        "1112111221":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "On the swings",
                "On the slide"
            ],
            "content":"<div class=\"\"><div> <span>The muck inside starts to feel uncomfortable after some time. You walk over to a caretaker, and tug on her pant leg. She sniffs the air and picks you up. She tells you that should try and use the potty next time, before taping you up in a new Pull-Up. She sets you on the ground, you then go and play....</span></div></div>",
            "created":1430888400,
            "id":1974434,
            "title":"Get changed(may be diapered)"
        },
        "111212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Play",
                "Figure this out alone"
            ],
            "content":"<div class=\"\"><div> <span>A young girl walks up to you, she seems too old to be in this area of the day-care, but you can see a bit of her pull-up sticking out of her skirt. You are disgusted by it, then you remember that you have to wear one too. <br>\r\n<br>\r\n\"Hi Mikey!\" She is talking to you!<br>\r\n<br>\r\n \"Umm...Hi?\" You question. <br>\r\n<br>\r\n\"You wanna play blocks?\"<br>\r\n<br>\r\nThis could be a good time to blend in, or you could continue figuring out this alone...<br>\r\n<br>\r\n</span></div></div>",
            "created":1321246800,
            "id":1223286,
            "title":"A young girl walks up to you"
        },
        "1112121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She uses her pull-up",
                "You use yours"
            ],
            "content":"<div class=\"\"><div> <span>You decide that blending in could be a good thing, so you agree and follow the girl to a small part of the room. You both sit down and she hands you a doll, you don't really know how to have fun with it, but she seems really into it. You play along as best you can, but every couple seconds the cricking noise of your or her pull-up would distract you and remind you that you are trapped as you toddler brother. Soon enough...</span></div></div>",
            "created":1321333200,
            "id":1223643,
            "title":"Play"
        },
        "11121211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "..Ok\"",
                "..no\""
            ],
            "content":"<div class=\"\"><div> <span>You see that she is very into what she is doing, even so that when she starts messing her pull-up she doesn't even notice<br>\r\n<br>\r\n\"Uhh, your pull-up..\"<br>\r\n<br>\r\n\"Oh!\" She sounds suprised \"I made an oopsie!\" Then her suprise turns to embarassment. \"Mommys gonna be mad if I messed my pull-up, help me change myself!\" <br>\r\n<br>\r\nYou step back \"Well...um..</span></div></div>",
            "created":1324702800,
            "id":1245859,
            "title":"She uses her pull-up"
        },
        "111212111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She has to go..",
                "Naptime!"
            ],
            "content":"<div class=\"\"><div> <span>..yeah, ok\" You say, why did you say that? Shes just a dumb toddler, now your gonna have to help her change..<br>\r\n<br>\r\n\"Over here!\" She leads you to a corner of the room, she gets a clean pull-up and some wipes, \"Help me change like mommy does\"<br>\r\n<br>\r\nWhy are you doing this? Well, mine as well try..<br>\r\n<br>\r\nYou take her skirt off, then you see the pull-up, wet and soggy, its smell is overpowering. You tear off the straps with a *RIP* and the pull-up falls open, you begin wiping her down, her pull-up and skin are both layerd in filth, soon enough you finish and attach a new pull-up onto her. You smile with your work. \"Done!\" you proclaim as you pat the front of her new pull-up.<br>\r\n<br>\r\nJust then..</span></div></div>",
            "created":1324702800,
            "id":1245862,
            "title":"..Ok\""
        },
        "111212112":{
            "choices":[
                "Continue playing",
                "She has to go"
            ],
            "content":"<div class=\"\"><div> <span>Sorry, you say. \"But...\" Maria says. \"Wait, i think i have an idea to get you out of that pull-up and your mommy not knowing. You move to the unisex bathroom, with her backpack. After you both are in, you tell her to remove the pull-up, which she complies. After you you throw away the messy, somewhat leaking pull-up, you tell her to finish up in the toilet. After she finishes pooping, then flushing. she asks what next. You then pull a pair of My Little Pony panties on her.</span></div></div>",
            "created":1331442000,
            "id":1292594,
            "title":"..no\""
        },
        "1112121122":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "pee",
                "poop"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While you two are laying, her underwear rubbing against the floor, she has to...</span></div></span></div>",
            "created":1440824400,
            "id":2027361,
            "title":"She has to go"
        },
        "11121212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Went to sleep.",
                "Went to eat."
            ],
            "content":"<div class=\"\"><div> <span>As you and her play you feel an urge to use your pull-up. You try to hold it as best as you can, and you look around for a bathroom, it is much too far away. Your bladder gives way and waves of mess and pee flow into your pull-up, it sags. You feel itching and burning there, but you really don't want to be changed. \"Let me help you get changed\" The little girl says. You unhappily agree. She gets the materials and lays you down. You are nervious, why are you letting HER change your pull-up? Well..too late now. A loud rip sounds as she tears open your pull-up, she giggles a little and then gets to work wiping and scrubbing. Soon enough she finishes and you sit up, you are suprised, she did it. The new pull-up fit perfectly around your legs. You are embartassed to have a little girl down there, but at least you didn't have a woman or man. now you both...</span></div></div>",
            "created":1324702800,
            "id":1245863,
            "title":"You use yours"
        },
        "11122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Get an older kid to open the door for you.",
                "Try to exuse a way outside"
            ],
            "content":"<div class=\"\"><div> <span>You run over to the door and reach for the handle, but it is much too high, then you go to a window, you try to open it, but you are too weak, you climb down and sit, hopeless. You see may babies and toddlers like Mikey playing and having fun, while you sit, bored and hopeless. Then you realize: You have one thing they don't, Intelligence. These children are mostly unintelligent, many just learning how to walk and talk. You plan to...</span></div></div>",
            "created":1321333200,
            "id":1223708,
            "title":"See if you can escape"
        },
        "111221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "A 4 year old girl",
                "A 4 year old boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Get an older kid to open the door for you. It was perfect: They could do it, and you could not! You look around for a kid tall enough..</span></div></span></div>",
            "created":1325739600,
            "id":1253193,
            "title":"Get an older kid to open the door for you."
        },
        "1112211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She agrees",
                "She agrees, but for a price"
            ],
            "content":"<div class=\"\"><div> <span>You see a tall girl, shes about a year old than Mikey, but she is so tall that you only come up to her chest. You stand up and walk over to her, she looks down at you \"hi Mikey.\" <br>\r\n<br>\r\nYou respond quickly.. \"Umm...Hi, could you open that door?\"</span></div></div>",
            "created":1325739600,
            "id":1253196,
            "title":"A 4 year old girl"
        },
        "11122112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Home!",
                "To a quiet spot where nobody can find or get you."
            ],
            "content":"<div class=\"\"><div> <span>\"Okaayy, But I have to come with you, wherever you're going!\" You didn't even know where you were going, but you agreed.<br>\r\n<br>\r\n\"Uh, okay..\" she walks over and simply opens the door, you both run quietly outside onto the street, but where should you go?</span></div></div>",
            "created":1326603600,
            "id":1259262,
            "title":"She agrees, but for a price"
        },
        "111221121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Try sleeping in your bed again?",
                "Search around for answers."
            ],
            "content":"<div class=\"\"><div> <span>As quickly as you can, you and the girl from day-care (who you learn is Maria) make your way home, avoiding people as you go, soon you arrive home, but you have to make it inside, luckily, you know that there's a spare key under the mat, you and Maria get inside. Now, how are you going to get back to normal?</span></div></div>",
            "created":1326603600,
            "id":1259265,
            "title":"Home!"
        },
        "1112211211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "It works!",
                "It fails.."
            ],
            "content":"<div class=\"\"><div> <span>You walk into your room, Maria in close pursuit, \"What are you doing?\" <br>\r\n<br>\r\n\"Going to sleep, turn off the light\" You respond unhappily, <br>\r\n<br>\r\n\"But I'm scared of the dark!!\" she seems terrified. <br>\r\n<br>\r\n\"Fine, come with me then!\" you are annoyed at how long it takes her to agree, Within a few minutes you both fall asleep...<br>\r\n<br>\r\n</span></div></div>",
            "created":1326603600,
            "id":1259273,
            "title":"Try sleeping in your bed again?"
        },
        "11122112111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Change her, then go.",
                "Just go!"
            ],
            "content":"<div class=\"\"><div> <span>You wake up, you are yourself!! You are glad to be back in your own body, in control! <br>\r\n<br>\r\n<br>\r\n<br>\r\n<b>OH CRAP!</b> Maria, she is still asleep next to you. How are you going to get her back to day-care? Even worse, she has ruined her pull-up; you can smell it. You must hurry..<br>\r\n</span></div></div>",
            "created":1326603600,
            "id":1259275,
            "title":"It works!"
        },
        "112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Change yourself",
                "Try to sleep"
            ],
            "content":"<div class=\"\"><div> <span>She easily picks you up and brings you back to your bed. You protest, but it's impossible to resist, she lays you down and tucks you in, \"Sleep well!\"<br>\r\n<br>\r\nThe lights turn off. You are unable to fall asleep because of the awful smell and itching of your pull-up, you stay there looking at the ceiling for a long time, then you realize that you could probably try to change yourself! </span></div></div>",
            "created":1320987600,
            "id":1221165,
            "title":"\"Honey? Why are you up? You need more nap t..."
        },
        "1121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "You wake up an hour later"
            ],
            "content":"<div class=\"\"><div> <span>You get up and turn on the lights, quietly, you go over to the changing table, you had changed Mikey a few times before. You grab a new pull-up and get to work. It is awful as you take the soggy one off, it surprises you how full it is, \"Mikey has a large bladder\" you think as you throw it away. Soon you get a new one on, it feels much better and cozy. You pat the front of it and get back in bed happily. You could figure out what is going on, but for now you are just too tired...</span></div></div>",
            "created":1320987600,
            "id":1221572,
            "title":"Change yourself"
        },
        "11211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Your mother walks in.",
                "You feel the urge to go"
            ],
            "content":"<div class=\"\"><div> <span>You open your eyes and sit up, around you is Mikey's room filled with toys and his bed. You stand up, you get a good glimpse of your situation. You are completely in Mikey's body. You now have his life, but your brain. You worry about how you will live, and the fear of the pull-up that is on you. Just then..</span></div></div>",
            "created":1325739600,
            "id":1253189,
            "title":"You wake up an hour later"
        },
        "112112":{
            "choices":[
                "potty",
                "pull ups"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you feel a great urge to go you no that mikey usually just uses his pull up instead of the potty but should you.</span></div></span></div>",
            "created":1376283600,
            "id":1644911,
            "title":"You feel the urge to go"
        },
        "1121121":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "Pee",
                "Poop"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You hold your stomach, and frantically search under Miky's bed, applying pressure on your rear with your other hand. You finally pull out Mikey's light blue training potty. Pulling your Pull-up dwn, you sit on the potty and...</span></div></span></div>",
            "created":1399611600,
            "id":1793862,
            "title":"potty"
        },
        "1121122":{
            "choices":[
                "poop",
                "pee"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decided that it's easier if you just use your pull up so no one will think anything is wrong. So you let it go and what your pull up?</span></div></span></div>",
            "created":1376283600,
            "id":1644913,
            "title":"pull ups"
        },
        "11211221":{
            "choices":[
                "you comply letting her diaper you",
                "you throw a tantrum"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>after grunting softly you managed to poop your pull up you decide to to tell your mom, so you find her in the kitchen and told her you had an accident.She sighs saying sweetie I think putting you in diapers for a while will be best.</span></div></span></div>",
            "created":1376283600,
            "id":1644916,
            "title":"poop"
        },
        "112112211":{
            "author_id":"chrisdegraaf",
            "author_name":"chris",
            "choices":[
                "Your brother walks in",
                "You fall asleep"
            ],
            "content":"<div class=\"\"><div> <span>Your mother lays you down on the changing table and begins to take off the soiled pull up and quickly cleans you up. She reaches for a a white diaper and puts it on you. \"There we go dear.\" She says she let's you on the floor. She goes into the kitchen when suddenly.</span></div></div>",
            "created":1397451600,
            "id":1779566,
            "title":"you comply letting her diaper you"
        },
        "1121122111":{
            "author_id":"wizardofage",
            "author_name":"mageofage",
            "choices":[
                "body swap rings.",
                "genie"
            ],
            "content":"<div class=\"\"><div> <span>you look up at your old body as your now bigger brother grins at you. you try to run away but you fall flat on your diapered rear \"warrr did the little baby hurt him self\"your now big brother picks you up by your legs and sits you down on his lap and jams a baby bottle in your mouth your body's instincts take over as you suckle on the rubber nipple your brother chuckles and says \" is that good baby brother I hope so because your going to be drinking these for a long time because i swapped are body so that I'm chatting up girls and playing gta while your pooping your self and drooling out the side of your mouth and it's all thanks to my....   </span></div></div>",
            "created":1403586000,
            "id":1816947,
            "title":"Your brother walks in"
        },
        "11211221112":{
            "author_id":"noskillz",
            "author_name":"Noskillz",
            "choices":[
                "Go in the diaper",
                "Try and get to the potty"
            ],
            "content":"<div class=\"\"><div> <span>Mikey puts you back into the crib and smiles down at you as he tell you about how he released a genie from a lamp and was granted a wish, which he used to swap bodies. \"please change me back Mikey\" you say pleadingly. Milkey looks down at you once more with a frown on his face. \"that's not my name anymore. your Mikey. I am not the baby here, you are. Learn to live with it\" he says before leaving the room, feeling satisfied. As your sitting there wondering what to do, you feel the effects of the bottle Mikey gave you. You feel the urge to pee. </span></div></div>",
            "created":1509598800,
            "id":2409960,
            "title":"genie"
        },
        "112112211121":{
            "author_id":"noskillz",
            "author_name":"Noskillz",
            "choices":[
                "Your mother walks in ",
                "MIkey Returns"
            ],
            "content":"<div class=\"\"><div> <span>You relax your body and feel the telltale wamth in the front of your diaper. You feel embarrassed to have peed yourself but you know that nobody expects anything different from you at your current age. You climb out of the crib and go to the changing area. You rip the tabs on the side of the wet diaper open and it drops to the floor. You grab another diaper from the pile on the changing table and begin to put it on, when </span></div></div>",
            "created":1509602400,
            "id":2409963,
            "title":"Go in the diaper"
        },
        "1121122111211":{
            "author_id":"noskillz",
            "author_name":"Noskillz",
            "choices":[
                "MIkey return to your room",
                "Mom Plays with you"
            ],
            "content":"<div class=\"\"><div> <span>Your walks in unexpectedly and spots you taping up your own diaper, also noting the wet diaper on the floor. \"Aren't you a clever boy, Mikey. How did you learn to change your own diaper? This is very strange for a toddler change his own when he can't even use a potty.\"  You stop taping up the diaper in fright and it falls to the floor. your mother pick you and places you on the change mat and finishes taping  up the diaper. \"First your brother starts acting weird and then you then you start acting weird and quiet, also changing your own diapers when their wet. It's like you two swapped brains or something\" mom says as lifts of the change table and onto the floor in amongst what are now my toys. </span></div></div>",
            "created":1509603120,
            "id":2409966,
            "title":"Your mother walks in "
        },
        "1122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "The next morning"
            ],
            "content":"<div class=\"\"><div> <span>You lay there, trying to fall asleep, but the smell and itching are unbearable, you rub the outside of it to try and itch but that only makes your hands wet and crusty. You are helpless as the poop packed pull-up hangs onto you irritating you more every second. Eventually you do manage to drift to sleep in your brothers body while wearing the pull-up.<br>\r\n<br>\r\n</span></div></div>",
            "created":1320987600,
            "id":1221575,
            "title":"Try to sleep"
        },
        "11221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Your mother returns",
                "You feel the need to go"
            ],
            "content":"<div class=\"\"><div> <span>You awaken to a thumping sound, it's your mother walking in. You sit up and look in the mirror, Mikey stares back at you, with his soiled pull-up latched to you, itching and burning you to pain. You mother picks you up and peeks in the front of your pull-up, \"Looks like you have a dirty pull-up! Lets clean that!\" she smiles as you try to itch the pull-up. She takes you to the table and lays you down, then she begins taking the pull-up off and cleaning you, you are relieved to have to itching and burning away, but as soon as she took the old one off, she puts a new one on. She then sets you down and pats the front of the pull-up, \"There you go!\" and she walks away. You walk around mindlessly awaiting for something to happen. Then...</span></div></div>",
            "created":1321246800,
            "id":1223186,
            "title":"The next morning"
        },
        "112212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Takes you to the car",
                "Takes you for food"
            ],
            "content":"<div class=\"\"><div> <span>You feel the need to go. You look around for a way to the bathroom, but the only door is gated up. You feel the rush of waiste going through you, your toddler muscles are already tiring. You look down just in time to see your pull-up as it fills with your mess. You did it again! Soon enough the slippery, itching, burning feelings of the soiled pull-up return and you begin to cry. You cry helplessly, your mother returns and picks you up, \"Honey? Whats wrong?\" She sniffs \"Whew! Again?\" She then changes you, ripping off the old one and getting a fresh one. \"Is this how it's gonna be??\" You think sadly to yourself. Your mother then...</span></div></div>",
            "created":1321333200,
            "id":1223701,
            "title":"You feel the need to go"
        },
        "12":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Unused Pull-up!",
                "A Pacifier ",
                "A Bottle",
                "Toddler Overalls"
            ],
            "content":"<div class=\"\"><div> <span>You arrive home after a tiring day of school, you walk by your little brothers room and into yours. You drop your backpack, letting it hit the ground. Your mother calls up from the floor below \"Honey? Is that you? How was school?\". \"Yeah it's me, alright I guess..\" you yell back trying not to wake your brother in the next room. You are exhausted and prepare to go to bed, you lie down and pull the covers over your head enjoying the cozy feeling and, slowly, drifting into sleep....<br>\r\n<br>\r\nA few hours later you begin to wake up, you hear the distant footsteps of your mother below. You open your eyes to the ceiling and, to your surprise, see that it is a light blue color instead of your normal white. You look at the mirror to your left, you are shocked to see that your a...</span></div></div>",
            "created":1320901200,
            "id":1221107,
            "title":"Become one of his objects"
        },
        "121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "You!",
                "Another one.."
            ],
            "content":"<div class=\"\"><div> <span>You look into it, but all you see is an unused Pull-up staring back at you. You realize that it IS you, you have become one of his Pull-ups! You see yourself, a blue padded thing.. <br>\r\n<br>\r\nJust then you hear Mikey beginning to wake up, you watch him through the mirror as he stands up and groans, you mother arrives and begins to care for him, \"Whew! I can smell your stinky from here! My little man needs a change\" she takes him over to the changing table and gets to work, she takes his old one off and throws it away. \"Hmm, I need a new one, now where did I put that...\" NOT ME NOT ME you think as she looks around, she grabs</span></div></div>",
            "created":1320987600,
            "id":1221462,
            "title":"Unused Pull-up!"
        },
        "1211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "He feels the need to go",
                "Day-care time"
            ],
            "content":"<div class=\"\"><div> <span>Her warm hand grasps you and you feel the rush of wind as she takes you to Mikey who is now laying down on the table, occupied with a small toy. He seems unaware of what your mom is doing below his waist. She lifts his legs and slides you under him, you feel the wet warmth of his bottom now. Then she wraps you over his crotch and straps you on, you fit perfectly onto him, you are shocked that this is happening, you can see inside and out, everywhere. You feel the warmth but grotesque crotch of the young toddler. When shes done she sets him down in his room surrounded by toys, he quickly runs about playing. You stretch and move with him, conforming to him to prevent leaking. Once again you can see yourself in the mirror, but now you are smooth and can see the cartoon characters across yourself. He then sits down, crinkling you under his weight, but it isn't painful, you are too soft. You stare out as he mindlessly plays around. Right as he finishes...</span></div></div>",
            "created":1320987600,
            "id":1221602,
            "title":"You!"
        },
        "12111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Changing time!",
                "Nap time!"
            ],
            "content":"<div class=\"\"><div> <span>As he finishes playing he stops, for a few seconds he does nothing, you don't  know what he is doing from inside his overalls, then you see him squat down, with part of you dangling over the ground, you are up against him even harder now. Then you hear the grunting, he is using you! The lumps impact rocks you around as he soils you. Then a warm wave of pee streams in covering your front side in a layer of warm filth. After it's over he goes back to playing, sitting, running, and jumping, smashing you against him and the mess he has made. After a while of torture...</span></div></div>",
            "created":1320987600,
            "id":1221724,
            "title":"He feels the need to go"
        },
        "121111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "content":"<div class=\"\"><div> <span>You feel another rush of wind as he is picked up once more, now your mother looks at you, \"WOW! You really messed that pull-up! Gross..\" she brings him over and rips you off of him, then she cleans him, and throws you and the wipes away..<br>\r\n<br>\r\n<div align=\"center\">:( Ending</div></span></div></div>",
            "created":1326776400,
            "id":1260543,
            "title":"Changing time!"
        },
        "12112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Naptime!",
                "Lunch time!"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly you feel a rush of wind as he is picked up and turned around to see your mother holding him, \"Are you ready for day-care?\" Mikey squeals with exitment. She brings him to the car and straps him into the seat, in doing so crushing you against his body. After a rather bumpy car ride he is taken out and brought into a large day-care center. Soon enough you are looking out at the diaperd and pull-up coverd bottoms and crotches of young girls and boys, Mikey runs around happily, as he does he throws you against the soiled diapers and pull-ups of the other children. As he plays you are pushed and pulled to your limits. He sits down, you crackleing under his weight. Then one of the care takers announces...</span></div></div>",
            "created":1321160400,
            "id":1222621,
            "title":"Day-care time"
        },
        "121121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "He soiled you...",
                "He made it through!!"
            ],
            "content":"<div class=\"\"><div> <span>Mikey jumps up and runs to the other side of the room with all of the other children, you are unable to see anything with all of the other children in your way, soon you are let into a room with many mats laid across the floor, all of the children lay down on them. You feel yourself stretching as Mikey lays down. \"Nighty night!\" The caretakers announce as they turn out the lights. You can feel yourself being perfectly curled around his thighs as he sleeps, protecting the outside world from his messes and wets. you knew the worst times were at night when he had no control over his bladder and almost all the time he wet the bed. You await the inevitable as the boy snores along with the rest of the children. You look at another pull-up as the little girl soils it. It becomes saggy and moist, then the girl adjusts herself completely unaware that she just destroyed her pull-up. You soon drift off in worry. When you awaken...</span></div></div>",
            "created":1321160400,
            "id":1222798,
            "title":"Naptime!"
        },
        "1211211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "content":"<div class=\"\"><div> <span>You awaken, feeling tired and groggy, you feel like you are covered in water and weighed down with weight. Then you realize: He has messed and wet you! You sag on him, becoming much more heavy than before. The smell is unbearable as you sit there attached to a sleeping toddler. Then a bell rings and the children stand up one by one, you see that most of their diapers and pull-ups are soiled and sagging as well. They begin to line up at the changing table, waiting to get rid of the awful thing attached to them. Mikey gets in the line, ready to get rid of you, he constantly scratches and pokes at you. Finally, he comes to the changing table and the woman picks him up and readys herself. then she gets to work detaching you and getting a new one on him. You are thrown away, never to be heard from again....<br>\r\n<br>\r\n<div align=\"center\">:( Ending</div></span></div></div>",
            "created":1321160400,
            "id":1222802,
            "title":"He soiled you..."
        },
        "1211212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "He gets changed",
                "Your doomed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You awaken and see that Mikey is already walking about after his nap. You are happy to see that his training is paying off-- you are dry. But he could use you any minute now, you can only hope that he is changed soon, or your doomed.</span></div></span></div>",
            "created":1327294800,
            "id":1264275,
            "title":"He made it through!!"
        },
        "121122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Mikey uses you!",
                "A young girl walks up to Mikey"
            ],
            "content":"<div class=\"\"><div> <span>Mikey runs over to a table where other children are sitting down, he is given a bowl of applesauce to eat, but instead of eating it, he spills it all over himself, and you. A woman comes and wipes you both off, but Mikey seems fine with what he has just done, you, on the other hand, are angry and helpless. As he finishes eating he stands up and stretches. This causes you to stretch out aswell it feels good, but your also hear his stomach grumbling, in only a matter of minutes he could unleash a mess unto you. But right now he seems ok. All of a sudden....</span></div></div>",
            "created":1321333200,
            "id":1223730,
            "title":"Lunch time!"
        },
        "1211221":{
            "author_id":"ww2expert",
            "author_name":"Wolverine",
            "choices":[
                "*he eats it all in mere minutes* (mega mess iminent)",
                "*he eats while still relieving himself*. (imenent really mega mess)"
            ],
            "content":"<div class=\"\"><div> <span>*you feel the back of you bulging back and down as Mikey unloaded heavily into you*<br>\r\n<br>\r\n*After an hour he finished and you are bulging massively in all directions and soon you hear what sounded like a garden hose as he relieved himself too, the front of you turned dark yellow and very warm, meanwhile he waddles heavily to get a lot of food to eat*</span></div></div>",
            "created":1574187960,
            "id":2748801,
            "title":"Mikey uses you!"
        },
        "1211222":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She messes her pull-up",
                "They play about"
            ],
            "content":"<div class=\"\"><div> <span>You see a pair of legs moving through the crowd, then, in an instant, you are face to pace with another pull-up. Above you a girl (about 4 years old) is talking to Mikey as children do. Meanwhile you are face to face with a pull-up that is completely lifeless. Soon..</span></div></div>",
            "created":1326949200,
            "id":1261953,
            "title":"A young girl walks up to Mikey"
        },
        "12112221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Mikey goes..",
                "The girl comes back.."
            ],
            "content":"<div class=\"\"><div> <span>The pull-up you are rubbing against suddenly droops as you hear the sound of pee flowing into it. It sags on her, above, you see that she doesn't even notice it. Then a care taker comes and changes her. You watch as her soaked, poopy pull-up is thrown away violently. You know that you're next..</span></div></div>",
            "created":1328072400,
            "id":1269393,
            "title":"She messes her pull-up"
        },
        "1212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "In a box labeled \"Day-Care Donations\"",
                "Next to Mikeys changing table"
            ],
            "content":"<div class=\"\"><div> <span>You are glad to hear that she has found a different one, you could of been on him! You begin to ponder how you have become a pull-up. As you do, Mikey plays behind you, you see your mother walk in and start cleaning his room, picking up mangled toys and old bottles, soon enough she finds you and picks you up, she looks at you, \"Oh! I though we were out of these, lets just put you away!\" she puts you...</span></div></div>",
            "created":1321246800,
            "id":1223199,
            "title":"Another one.."
        },
        "12121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Age 3 year old",
                "Age 4-5 year old"
            ],
            "content":"<div class=\"\"><div> <span>\"We don't need you, Mikeys all potty-trained!\" she puts you down in the box, you are shocked that you are going to the day-care. You lay there wondering again how you somehow became one of his pull-ups. Perhaps this is punishment, or maybe it was-- but before you could think any more, the box begins to shake violently, then as soon as it began it subsides. Then you hear a car motor and some slight vibrations, then you feel the violent shaking, this lasts for about a minute, then the box opens and you look up at a woman, her nail polished fingers reach down and pick you up, then you feel the breeze as she walks, looking around, you see many children playing around, most are wearing pull-ups or diapers. You fee the woman set you down next to the changing table, then she goes back to work. You wait for a couple minutes, then you see a child come up needing a change, its a...</span></div></div>",
            "created":1321246800,
            "id":1223202,
            "title":"In a box labeled \"Day-Care Donations\""
        },
        "121211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "The horror begins!",
                "Naptime!"
            ],
            "content":"<div class=\"\"><div> <span>You see a 3 year old girl, she is grunting, and you see her pull-up sag and sag until is has dropped several inches, she seems satisfied with what she has done and even pats the front of her pull-up to show that she knows what she has done. The care taker picks her up and brings her to the table, she lays her down and gets her old pull-up off, then she grabs you and attaches you to the girl. Then the woman lets the girl go. The girl seems to know that you are in there. She looks at you and smiles, \"Haha! You have to hold my poopies!\" she says to you as she adjusts you around her to fit perfectly around her. Then she goes about playing stretching an pulling on you as she does, just when you think you can't take anymore...</span></div></div>",
            "created":1321246800,
            "id":1223317,
            "title":"Age 3 year old"
        },
        "121212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are surprised to see a 4 year old ______ needing a change.</span></div></span></div>",
            "created":1321246800,
            "id":1223208,
            "title":"Age 4-5 year old"
        },
        "1212122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She has to go home!",
                "She sits down to play."
            ],
            "content":"<div class=\"\"><div> <span>\"The girl seems too old for this room\" you think to yourself, but as you do you see a woman walk up to her and peek in the front of per skirt, \"Sweetie! Looks like yo need a change\" she picks the girl up and brings her to the table next to you, she then takes you and pulls down the girls skirt, you see a pink pull-up, with some characters on it. Then you are hit by the odor, it is awful and you cringe from it. The woman untapes the girls pull-up and begins cleaning. The girl seems embarrassed to be changed in front of all her friends, most of which were out of pull-ups by now. The woman takes her old pull-up dripping with mess and pee, and throws it away, then she takes you and slides you onto the girl. You fit perfectly, snug, protecting her from leaks. The woman then gets the skirt and pulls it over you, covering your view except for where her feet are below you. The girl walks for a bit, but then...</span></div></div>",
            "created":1321246800,
            "id":1223298,
            "title":"Girl"
        },
        "12121221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Her",
                "Her mother"
            ],
            "content":"<div class=\"\"><div> <span>You hear her mother call \"Honey! Time to go home!!\" she walks for a moment, then you hear a car door, and suddenly the girl sits. You are crumpled between her and the car seat. To make it worse, the seat belt attaches right across your front, forcing you against her further. After a bumpy ride home, she gets out and enters a house. She walks in and she immediately takes off her skirt. \"That feels better\" she says to herself. You can now see, you are in a pink room with princesses, dolls, toys, a bed, and a changing table. The girl walks in and starts playing around, you get very bored. \"Their minds are so boring!\" you yell angrily. At that moment the girl stops and looks around, then resumes playing. \"Did she hear me?\" you ponder. This might be your only way to get help. You try to contact...</span></div></div>",
            "created":1326862800,
            "id":1261281,
            "title":"She has to go home!"
        },
        "121212211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She understands",
                "She doesn't understand"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You yell as loud as you can, and once again the little girl looks around, then she looks at you, \"Huh? Is there someone in there?\" <br>\r\n<br>\r\n\"YES YES!\" you cry</span></div></span></div>",
            "created":1326862800,
            "id":1261424,
            "title":"Her"
        },
        "1212122111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "\"Mm kay!\"",
                "\"Nuh huh!\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Woaah! How did you get in there silly?\" She asks staring at you<br>\r\n<br>\r\n\"Show me to mommy!!\" Your voice is muffled through the thick fabrick..</span></div></span></div>",
            "created":1329195600,
            "id":1277192,
            "title":"She understands"
        },
        "1212122112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "\"I'll do it myself\"",
                "\"MOMMY!\""
            ],
            "content":"<div class=\"\"><div> <span>She giggles \"Thats silly, there's nobody in my pull-up, if there was they'd be angry right now, cause I gotta go\" she immediatly squats down, keeping you just above the floor, then she unleashes mess all over you insides, you are disgusted and horrified. When its done, you are drooping several inches and she has difficulty keeping you on her. \"Guess I need a change..\"</span></div></div>",
            "created":1326862800,
            "id":1261428,
            "title":"She doesn't understand"
        },
        "12121221121":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "Goes to take a bath",
                "Dinner"
            ],
            "content":"<div class=\"\"><div> <span>You shudder, as the girl clumsily rips you off. You then feel yourself shift, and find, to your shock, you've become the Pull-Up she will put on. She hastily wipes herself,,though her bottom is still quite messy,mas you pulls you on. She then....</span></div></div>",
            "created":1415336400,
            "id":1882712,
            "title":"\"I'll do it myself\""
        },
        "12121222":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "\"Naptime!\"",
                "She feels a movement"
            ],
            "content":"<div class=\"\"><div> <span>You see her sit down, her legs covering your view. You hear her make sounds as she plays with dolls. She continually adjusts her position, so you are begin moved about. It's almost as if she is making you fit her better that before, obviously she is used to needing pull-ups to do, and she knows how to use them well. As she plays you wonder what will happen after she uses you, will you be thrown away? As you ponder the girl continues to play about unaware of the living soul trapped in her pull-up. She stands up, you can see her feet again. She walks about playing more. As she does....</span></div></div>",
            "created":1321333200,
            "id":1223697,
            "title":"She sits down to play."
        },
        "121212221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Messed",
                "Clean"
            ],
            "content":"<div class=\"\"><div> <span>You feel her legs moving and then you hear a woman announce \"Naptime!\" The girl runs over and finds a spot, she lays down. Her skirt flies up as she lays down, you can finnaly see out, there are many children lieing down, they seem used to the process. You stare to hear she snore as they turn off the lights. You then seem to drift away too. You wake up in the room....</span></div></div>",
            "created":1321419600,
            "id":1224080,
            "title":"\"Naptime!\""
        },
        "121212222":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She makes it",
                "Too late!"
            ],
            "content":"<div class=\"\"><div> <span>She stops, and she seems unhappy, then you see a bright light as she lifts up her skirt and stares at you as if she was disappointed of you. Then her stomach gurgles and she gunts loundly, getting a few looks from other kids. You can hear her bowls moving, then she realizes what is happening and makes a dash for the bathroom...</span></div></div>",
            "created":1321678800,
            "id":1225656,
            "title":"She feels a movement"
        },
        "1212122221":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "Continue playing",
                "an hour after feeding time..."
            ],
            "content":"<div class=\"\"><div> <span>You saw as the little girl, holding her bottom to stop the large amount of poop, quickly dashes into the girls bathroom ,opens a stall, pulls you down, and sits on the toilet. Not a moment too soon, as with a fart, a large amount of poop, solid and liquid, rushes out of her bottom, acommpanied wit the UGHHH of her grunting, plus al ittle pee. After wiping herslef, she looks down, she discovers a skid mrk, which doesn't bother her, so pulling you up, she walks out of the bathroom and...</span></div></div>",
            "created":1336453200,
            "id":1332067,
            "title":"She makes it"
        },
        "1212122222":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "Is changed by a daycare worker",
                "ges some more"
            ],
            "content":"<div class=\"\"><div> <span>You hear the girl suddenly gasp, and, before you can react, she starts pooping and peeing in you, grnting at the solid, after what seems like 2 minutes, she sits down, having barely made any progress. The girl suddenly starts bawling, upset that she didn't make it. After a while, she...</span></div></div>",
            "created":1336453200,
            "id":1332069,
            "title":"Too late!"
        },
        "123":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Drinks",
                "Drops you"
            ],
            "content":"<div class=\"\"><div> <span>You look over and see a bottle laying on the ground, then you realize, it's you! You are a bottle! Mikeys bottle! Suddenly he begins to wake up, he stands up and as soon as he does your mother walks in and changes his dirty pull-up. Then she grabs you and gives you to him, he then holds you for a few minutes while she cradles him, after 5 minutes of being in the helpless grasp of your toddler brother, Mikey...</span></div></div>",
            "created":1320987600,
            "id":1221466,
            "title":"A Bottle"
        },
        "1231":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Day-care",
                "Dinner!"
            ],
            "content":"<div class=\"\"><div> <span>He brings you up to his mouth, then his lips latch onto you, giving you pain. You feel your body under pressure as he sucks the milk out of you. The pain is immense as the toddler drinks. You feel like he is sucking your organs and blood out, then he stops, you are relived and tired. His pudgy fingers grasp you still, holding you close, you see your mother taking him somewhere...</span></div></div>",
            "created":1321074000,
            "id":1221981,
            "title":"Drinks"
        },
        "124":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "He soils the pull-up",
                "He has to go to day-care"
            ],
            "content":"<div class=\"\"><div> <span>You see clean overalls stretched across the floor, you already know whats happening, this happened before. You watch as Mikey slowly gets up, your mother quickly walks in and changes him, then she grabs you and straps you onto him, he immediately starts running around, rubbing you up against his legs and pull-up. Soon...</span></div></div>",
            "created":1320987600,
            "id":1221469,
            "title":"Toddler Overalls"
        },
        "1241":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "It's changing time!",
                "Bedtime!"
            ],
            "content":"<div class=\"\"><div> <span>While he plays he is constantly moving, but then he stops, he doesn't seem to be doing anything for a moment , then you hear him grunt and the pull-up that you are hiding moves and gets warm, then as fast as it started, it is over and he starts to play around again. As he runs about you are rubbed helplessly against his pull-up, getting the inside of you wet and messy. Then he sits down, pushing the pull-up against you more. Within a few minutes...</span></div></div>",
            "created":1320987600,
            "id":1221628,
            "title":"He soils the pull-up"
        },
        "12411":{
            "author_id":"xenarus",
            "author_name":"Xenarus",
            "choices":[
                "\"We'll put them back on you'll just end up doing the same to the next pair!",
                "We must get you another pair! (transfer to another kid/other?)"
            ],
            "content":"<div class=\"\"><div> <span>Mikey's mom comes in and she immediately sees the gigantic bulge where his diaper should be.<br>\r\n<br>\r\n\"Mikey come on lets get you changed\"<br>\r\n<br>\r\nShe unsnaps you and takes care of the diaper first.<br>\r\n<br>\r\n\"All clean!\" she pronounces, \"Ohhh, but you got some poop on your  overalls!\"</span></div></div>",
            "created":1403845200,
            "id":1818459,
            "title":"It's changing time!"
        },
        "1242":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "A young girl walks up to him",
                "He soils the diaper"
            ],
            "content":"<div class=\"\"><div> <span>You see him getting into the car, and then your mother strapping him in, once again you are pressed up against his body as he mindlessly plays around. After a short drive you all arrive at the day-care he goes to. He gets out and walks in with your mom. You look around at all of the other children playing around, Mikey seems to be happy because he moves is legs quickly, then your mother signs him in and leaves. He goes about running around and playing. As he does...</span></div></div>",
            "created":1321333200,
            "id":1223734,
            "title":"He has to go to day-care"
        },
        "12421":{
            "choices":[
                "A nap",
                "A change"
            ],
            "content":"<div class=\"\"><div> <span>You see a little girl walk up to Mikey. She is wearing a pink dress and pink dress shoes. You notice she is about Mikey's age. You also notice something bulging from under her dress. It was a pink pull-up! And coming from the smell she need a change...bad! \"Hi Mikey!\" the girl said. \"Hi Maria!\" Mikey replied back. \"Wanna play?\" Maria asked. \"Okay!\" Mikey said back. They start playing which was torture for you. You were rubbed up against Maria and her soiled pull-up being forced to smell her waste. After about an of non-stop playing. It was time for.... </span></div></div>",
            "created":1354424400,
            "id":1480620,
            "title":"A young girl walks up to him"
        },
        "124211":{
            "author_id":"xenarus",
            "author_name":"Xenarus",
            "choices":[
                "Someone Messes",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay kids, nap time!\" The daycare teacher says.<br>\r\n<br>\r\n\"Oh no! I forgot my mat!\" Mikey says.<br>\r\n<br>\r\n\"It's okay, you can sleep on mine!\" Maria says, leading him over to her mat.<br>\r\n<br>\r\nMaria and Mikey lay down on the mat (as toddlers anyway, nothing freaky) and quickly doze off.<br>\r\n<br>\r\nEvery time Maria or Mikey shifts you get a waft of Maria's diaper which if you weren't a pair of overalls you would change IMMEDIATELY just to get rid of the smell.<br>\r\n<br>\r\nAs nap time goes on..</span></div></div>",
            "created":1399179600,
            "id":1791561,
            "title":"A nap"
        },
        "1242111":{
            "author_id":"xenarus",
            "author_name":"Xenarus",
            "choices":[
                "Mikey",
                "Maria"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, who is the culprit??</span></div></span></div>",
            "created":1399179600,
            "id":1791563,
            "title":"Someone Messes"
        },
        "12421112":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "Sure",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You gag,staring at Maria's diaper, which was exposed due to her kicking off the blanket during her sleep. The back has expanded considerably, has gotten a slightly brown tint, and a horrid smell permeates the room. Soon,you see Maria poke Mikey, who wakes up. She asks Mikey to change her. He says....</span></div></div>",
            "created":1415336400,
            "id":1882710,
            "title":"Maria"
        },
        "124212":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "Have your Pull-Up changed (Maria's POV)",
                "Are Maria's new Pull-Up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Soon, a daycare worker picks Maria up, and lays her on the changing table. Mikey (and by extension you) sit on a nearby plastic chair. Mikey waits patiently (for a toddler) for Maria to be finished, while you see everything. Next,you..... </span></div></span></div>",
            "created":1361163600,
            "id":1534337,
            "title":"A change"
        },
        "1242121":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "On the swings",
                "On the slides"
            ],
            "content":"<div class=\"\"><div> <span>You hum, squirming playfully, occasionally peeking at Mikey. You let the nice caretaker lift your legs, and wipe your messy bum down. You enjoyed using your diapers, but after a while, it would start to feel itchy or cold. The caretaker says something, as she slides the new Pull-Up on you. You thank her, and go play with Mikey...</span></div></div>",
            "created":1446613200,
            "id":2056733,
            "title":"Have your Pull-Up changed (Maria's POV)"
        },
        "13":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "He reaches down to pick you up",
                "He just stares"
            ],
            "content":"<div class=\"\"><div> <span>You arrive home from school, just another boring day..<br>\r\n<br>\r\nYou walk by your mother who is cooking dinner and into your little brothers room, he is awake and playing with a doll. You sit down with him, \"Hi Mikey\" he is too busy tossing the toy around to pay attention to you. You decide that trying to play with him is worthless so you get up and start to walk away, you feel dizzy and feel like your gonna throw up, in a few seconds you are passed out on the floor...<br>\r\n<br>\r\nWhen you wake up you find yourself staring up at your little brothers face...</span></div></div>",
            "created":1320901200,
            "id":1221098,
            "title":"Shrink down"
        },
        "131":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Punishes you..",
                "Puts you away"
            ],
            "content":"<div class=\"\"><div> <span>You see his hand reaching for you, and you begin to run, but his chubby fingers snatch you up into the air and up to his face. You stare into the massive face of a 3 year old, he has dried spit on on it and he seems fascinated by you. He stands up and brings you to his other toys, where he plays with you, his hand movements giving you great pain as he violently assaults you and the other dolls. Then he lets go, you look at him, he stares at you waiting for you to do something, but when you don't do anything he begins to get angry \"DOLLY! TAWK!\" You are too stunned to say anything, he snatches you up and...</span></div></div>",
            "created":1320987600,
            "id":1221166,
            "title":"He reaches down to pick you up"
        },
        "1311":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Yell something!",
                "Too late!"
            ],
            "content":"<div class=\"\"><div> <span>He snatches you up into his grasp. You, still too stunned to speak, can only watch as his face turns redder and redder. He stands up and angrily yells at you \"SPEAK! DOWLY! SPEAK!\" then he does the unthinkable, he starts to take off his overalls, with the *pop* of two buttons his overalls fell to the floor and his blue pull-up shows. You now see what he is gonna do, you struggle and try to get out but it is no use, he begins to move his hand at it...</span></div></div>",
            "created":1320987600,
            "id":1221611,
            "title":"Punishes you.."
        },
        "13111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Stay",
                "Escape"
            ],
            "content":"<div class=\"\"><div> <span>\"Uhh....HI MIKEY!\" Your throat burns. He just hears you and stops. \"Oooh, yaay! Playtime!\" he manhandles you and plays for about an hour, afterward you are sore and tired. He takes you and puts you in his bed to keep you safe, \"stay!\" he barks.</span></div></div>",
            "created":1324702800,
            "id":1246005,
            "title":"Yell something!"
        },
        "13112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "You get out!",
                "You are buried"
            ],
            "content":"<div class=\"\"><div> <span>\"Dumb dowy!\" He opens the front and drops you in, you slide down it and land between his genitals and the soft padding of the pull-up. He begins walking around smashing you against him and the pull-up, you can't get a foothold as the world spins, you see a small opening between his legs, you could make it to the back, you take the risk and slide under. Now you are pressed up between his butt and the seat of his pull-up, you see a small light coming from above, maybe you could climb up, you try to get a foothold and as you do you hear the toddlers stomach rumble, you know that you only have a few seconds..</span></div></div>",
            "created":1321074000,
            "id":1221980,
            "title":"Too late!"
        },
        "131121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "He is coming back!",
                "You are at Day-care now!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You manage to jump out of the back of the pull-up, you fall to the ground. You watch as he toddles away his pull-up becomes more and more soggy as he does. \"Whew! THAT was close!\" you think to yourself. But as you do you realize that...</span></div></span></div>",
            "created":1321160400,
            "id":1222790,
            "title":"You get out!"
        },
        "1311212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "4 year old",
                "3 year old"
            ],
            "content":"<div class=\"\"><div> <span>You realize that you are on the floor of Mikey's day-care center, children of all ages run around you playing and having fun. You run around, dodging feet and legs. You do this for several minutes with moderate success and a few close calls. From the end of the room and see two legs walking at you, within a couple seconds they arrive directly in front of you, you look the legs of a young...</span></div></div>",
            "created":1321333200,
            "id":1223715,
            "title":"You are at Day-care now!"
        },
        "13112121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Finds a place to keep you to take you home",
                "Shows you to her friends"
            ],
            "content":"<div class=\"\"><div> <span>You look up at the 4 year old girl, she has innocent eyes and long hair. She has a T-shirt and a skirt on. You are glad to see an intelligent child, but then you see the pink pull-up under her skirt, she isn't potty trained! She reaches for you and grabs you, then she smiles and skips along with you in her hand. She sits down and lets you out, \"Oooo new dolly!\" you hear her say as she prepares to play. \"I'm not a dol--\" But she cuts you off before you can finish \"WOW! Your not a dolly! Your a little person!\" She pokes your stomach, it is painful, and she yells \"Haha! This is soo cool!\" She then stands up and...</span></div></div>",
            "created":1321333200,
            "id":1223726,
            "title":"4 year old"
        },
        "131121211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "in her Pull-up",
                "In her backpack"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She hears her mother coming into the day-care to pick her up, in responce to this she looks quickly for a place to hide you until she arrives home, after a few seconds she finds the perfect place, she puts you...</span></div></span></div>",
            "created":1323752400,
            "id":1239339,
            "title":"Finds a place to keep you to take you home"
        },
        "1311212111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Arrives home",
                "Uses her pull-up"
            ],
            "content":"<div class=\"\"><div> <span>You are horrified as the little girl begins to lower you to her pull-up, she lifts her skirt and you see the massive white pull-up curved all around the young girl, she brings you closer and closer as you stuggle to get free. The pull-up is closer now, its size meanacing as her legs are slid through it, you know that once inside there is no escape, it seems perfectly sealed around her still baby legs. She now dangles you over the top of it, right in front of her belly-button, she opens the top of it, an onrush of warm air emerges and you stare down in horror at her crotch. She lets go. You fall for a second and land at the bottom of her pull-up, she closes it pressing you against the diaper and her wet body. Her legs move back and forth and you fall to the bottom of the pull-up, right in the space between her legs. On the outside she is calmly walking out of the day-care. She sits in her carseat, pressing you against her further. Soon she...</span></div></div>",
            "created":1323752400,
            "id":1239344,
            "title":"In her Pull-up"
        },
        "13112121111":{
            "author_id":"xenarus",
            "author_name":"Xenarus",
            "choices":[
                "Yeah!",
                "Nope!"
            ],
            "content":"<div class=\"\"><div> <span>Soon she arrives at home and takes you out of the diaper.<br>\r\n<br>\r\n\"Alright, now I can study you more closely!\" She says.<br>\r\n<br>\r\nWhile she is in the midst of researching you, her mother peaks into the room.<br>\r\n<br>\r\n\"I'm running down to Aunt Karols for a little bit, are you okay taking care of yourself?\" She asks.<br>\r\n<br>\r\n\"Sure!\" She said.<br>\r\n<br>\r\n\"Alright then...\" Her mother said, and closed the door.<br>\r\n<br>\r\n\"Alright buddy, looks like your taking care of me until she gets back!\"<br>\r\n<br>\r\n\"But how long is she gone for?\"<br>\r\n<br>\r\n\"A couple days..\" She responds<br>\r\n<br>\r\nDo you agree?</span></div></div>",
            "created":1376542800,
            "id":1646750,
            "title":"Arrives home"
        },
        "13112121112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She remembers you",
                "She still forgets"
            ],
            "content":"<div class=\"\"><div> <span>She starts to move around in her car seat, as if she is uncomfortable. Then in an instant, her pee began flowing into her pull-up, there is no room and at times you are fully submerged. On the outside she has completely forgotton about you in her 4 year old mind. She feels her pull-up getting wetter while on the inside you are almost drowning. When she arrives home..</span></div></div>",
            "created":1324702800,
            "id":1245858,
            "title":"Uses her pull-up"
        },
        "131121211122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She sees you",
                "She can't see you"
            ],
            "content":"<div class=\"\"><div> <span>You roll around getting covered in her pee, soon you hear a muffled voice coming through the wet walls \"Bed time honey!\" <br>\r\n<br>\r\n\"Ok mommy!\" the girl walks a few steps. Then lays down, you are once again thrown throughout the pull-up. soaked. Then you hear a ripping noise, then a bright light shines upon you. You see a woman busily changing the girl. You wave your arms to get her attention...</span></div></div>",
            "created":1325739600,
            "id":1253071,
            "title":"She still forgets"
        },
        "1311212111221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "The woman has other ideas",
                "The woman decides to help"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The woman drops her jaw, she reaches in and picks you up out of her daughters soiled pull-up. You are relieved, you are saved! Just then..</span></div></span></div>",
            "created":1325739600,
            "id":1253187,
            "title":"She sees you"
        },
        "13112121112211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Play with you myself!",
                "Put you back with Maria"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The woman smiles \"Maria, look at what you found\". She changes the girl and then takes her attention back to you. \"Ahh, I know, I'm gonna..\"</span></div></span></div>",
            "created":1325826000,
            "id":1253484,
            "title":"The woman has other ideas"
        },
        "131121211122112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Bedtime!",
                "Playtime!"
            ],
            "content":"<div class=\"\"><div> <span>\"She REALLY likes you, you must go back with her!\" The woman says with a smile, you are terrified, what is wrong with this family?? The woman opens the back of the girls pull-up, and drops you in, you hurtle through the air and land wedged between her and the pull-up. You aren't able to move and slip deeper and deeper as the girl toddles forward. Soon..</span></div></div>",
            "created":1326862800,
            "id":1261156,
            "title":"Put you back with Maria"
        },
        "1311212111222":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "content":"<div class=\"\"><div> <span>\"HEY, DOWN HERE! HEYY!\" You yell as loud as you can, but the little girl is talking aswell and the mother is listening to her instead, you have a moment of shock as the mother pulls the pull-up out from the girl, you hang on to it as she carries it across the room. The woman pushes both sides of the pull-up together, you scream \"NOOO!\". You are sandwiched in the pull-up, your last moments are spent being crushed between 2 pee covered walls. <br>\r\n<br>\r\n<div align=\"center\">:( Ending</div></span></div></div>",
            "created":1325739600,
            "id":1253075,
            "title":"She can't see you"
        },
        "131121212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Baby kids, (1-2)",
                "Other toddlers (3-4)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She runs over to a group of kids and opens her hands, you look up at...</span></div></span></div>",
            "created":1326776400,
            "id":1260545,
            "title":"Shows you to her friends"
        },
        "1311212121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Their diaper",
                "Their mouth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look out at the many babies that had gathered, the 4 year old girl shows you to them and they look at you in awe. One of them grabs you, you are surrounded by soft, sticky hands as they bring you to...</span></div></span></div>",
            "created":1326862800,
            "id":1261270,
            "title":"Baby kids, (1-2)"
        },
        "1311212122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Play with him!",
                "Eat him!"
            ],
            "content":"<div class=\"\"><div> <span>You sit in the soft hands on the girl, you look up and as your eyes adjust, you see about 6 children staring down at you. 2 of them girls, 4 of them boys. They seem intrigued by the sight of you, one of the boys picks you up, his hands sticky and wet. You helplessly stare up at the group of kids as they talk about what to do with you.. <br>\r\n<br>\r\n\"We should play with him!\" A young girl suggests<br>\r\n<br>\r\n\"He looks yummy\" one of the boys remarks <br>\r\n<br>\r\n\"Hmm, we should...\"</span></div></div>",
            "created":1326862800,
            "id":1261207,
            "title":"Other toddlers (3-4)"
        },
        "13112121221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "A foot comes down on top of you.",
                "One boy calls it off."
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm, we should play with him!\" The boy smiles devilishly<br>\r\n<br>\r\n\"Okay!\"<br>\r\n<br>\r\n\"Mmm, hmm!\"<br>\r\n<br>\r\nThe boy sets you down of the ground then lifts his foot, you look up at the sneaker with dirt and old gum stuck to it, you realize that this \"Game\" Won't be fun..<br>\r\n<br>\r\nWithin a second his foot slams down next to you, toppling you over and sending the children into laughter. You start running but every time you see an opening, one or another child's foot comes down in your way. Occasionally you look up but all you can see are sneakers and sandals coming down around you, just as you trip..</span></div></div>",
            "created":1326862800,
            "id":1261209,
            "title":"Play with him!"
        },
        "131121212211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "content":"<div class=\"\"><div> <span>You trip and fall face first onto the carpet floor, just as you begin to get your bearings a massive sneaker slams down with a *crunch* completely obliterating your legs. You are in momentous pain as the boy giggles. \"Alright, Maria, Finish him!\" the boy says happily. You look up at the girl, shes only 4 years old, wearing a dress and under it the bulge of her pull-up is obvious, she's innocently looking at you, you can tell she doesn't want to do it, but the boy continues to pressure her, she lifts her sandal over you, you see mud, gum, and another goo on the bottom of it. She brings it down, you didn't feel a thing as the 4 year old girl's weight transferred onto you. Smashed into a blood stain on the carpet. By a toddler girl who's not even out of pull-ups..<br>\r\n<br>\r\n<div align=\"center\">:( Ending</div></span></div></div>",
            "created":1326862800,
            "id":1261215,
            "title":"A foot comes down on top of you."
        },
        "131121212212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Diaper duty",
                "One of them wants to take you home!"
            ],
            "content":"<div class=\"\"><div> <span>You trip landing face first into the carpet, and just as you prepare to be killed you hear one of the boys call \"Wait, don't kill him! Then we can't play more\".  It was bitter-sweet, you got to stay alive, but what could be next?!?<br>\r\n</span></div></div>",
            "created":1326862800,
            "id":1261225,
            "title":"One boy calls it off."
        },
        "1311212122121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><div> <span>You see them whispering, the giggling, then one of the girls leaves. <br>\r\n<br>\r\n<br>\r\nSeveral minutes later she returns...wearing nothing except her pull-up. You are surprised that the workers don't even give her a second look, apparently kids wore just pull-ups and diapers all the time. She giggles, \"Okay, I'm ready!\" the boy grabs you and lifts you up, <br>\r\n<br>\r\n\"Alright, here we go Maria!\" he says with a smile, \"Wait, front or back?\"</span></div></div>",
            "created":1326862800,
            "id":1261237,
            "title":"Diaper duty"
        },
        "13112121221211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She needs a change",
                "It gets more violent"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm, Front!\" The girl says happily, the boy pinches the front of the pull-up and opens it, then he hovers you over it, the girl and the other kids giggle as you dangle over hell. Then he drops you, you fall into the pull-up and land between her skin and the pull-up's soft walls. Then the boy lets go, and the pull-up's elastic band snaps shut. Darkness falls as you hear muffled voices. Then you feel the pull-up being pressed on, forcing you against the girl. Meanwhile on the outside the children are having fun poking at the pull-up and giggle about how the little guy is being hurt. \"He tickles!\" the girl yells happily. On the inside you go through terrible pain and are crushed many times against the girl. Soon..</span></div></div>",
            "created":1326862800,
            "id":1261244,
            "title":"Front"
        },
        "131121212212111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "The kids come back for you.",
                "They leave you."
            ],
            "content":"<div class=\"\"><div> <span>Without warning a stream of pee comes into the pull-up. You are sprayed and sprayed for what feels like several minutes. When it stops you sit drenched in a smelly, wet, drooping pull-up. On the outside the girl blushes as her pull-up sags, the boys start laughing louder. She immediately runs over and asks for a change. You feel gravity leave as she is lifted, then her body is straightened and you are once again pressed against her. You hear a sharp *rip* and the pull-up falls open, you lie on the girls crotch, soaked in pee. The woman changing the girl doesn't notice you as she wipes the girl. You are swept up by one of the wipes and you can't get out. The wipe (and you with it) are thrown away...</span></div></div>",
            "created":1326862800,
            "id":1261259,
            "title":"She needs a change"
        },
        "1311212122121111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Back to the main group",
                "To her mom's car"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The trash smells awful and burns all of your sences, soon enough a small hand reaches in and picks you up, you look at the same little girl who just tortured you, she has a new pull-up and is ready to have more fun. She takes you...</span></div></span></div>",
            "created":1326862800,
            "id":1261434,
            "title":"The kids come back for you."
        },
        "13112121221211112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "A 1 year old boy, An 8 year old girl, and a busy mom",
                "A Violent 6 year old boy, A 13 year old girl, and 2 busy parents"
            ],
            "content":"<div class=\"\"><div> <span>You see her running over to a car which is parked outside, she gets in and sits down. \"Hi mommy!\" She says happily with you still trapped in her grasp. \"Hi babe!\" The mom replies as she pulls out, after a bumpy car ride you arrive at the girls house, she walks into her family...</span></div></div>",
            "created":1328677200,
            "id":1272987,
            "title":"To her mom's car"
        },
        "131121212212111121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "And sets you down on the floor",
                "To her room"
            ],
            "content":"<div class=\"\"><div> <span>The girl walks in and you quickly look around to asses the situation:<br>\r\n<br>\r\n-- On the floor is a baby boy, maybe 1 year old. He is viciously muching on a doll about your size, \"Oh, god!\" you think as the boy eyes you<br>\r\n<br>\r\n-- Nearby a girl who looks about half your age is playing with dolls herself, she doesn't notice you or her 4 year old sister holding onto you. <br>\r\n<br>\r\nThe 4 year old girl takes you...</span></div></div>",
            "created":1328677200,
            "id":1273096,
            "title":"A 1 year old boy, An 8 year old girl, and a bus..."
        },
        "1311212122121111211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "In his diaper!",
                "In his mouth!"
            ],
            "content":"<div class=\"\"><div> <span>\"Stay here! The girl commands and she runs away. You turn around just in time to be knocked back by a chubby hand in your face. You look up at the one year old boy, he is disgusting. With drool and snot on his face and a diaper the only thing he is wearing, you are terrified at what will be next. He picks you up and forces you...</span></div></div>",
            "created":1329195600,
            "id":1277197,
            "title":"And sets you down on the floor"
        },
        "13112121221211112111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Its too late",
                "Planning"
            ],
            "content":"<div class=\"\"><div> <span>The boy drops you in the front of his diaper. You are happy to see that it is clean, for now anyway.. Compared to the girls it is much better, there is more room and he cannot stand  making the movements less. But you see that the elastic is much more difficult to open, and the boy has probably forgotton about the 'toy' she just shoved in his diaper. You need to make an escape plan fast!</span></div></div>",
            "created":1329195600,
            "id":1277212,
            "title":"In his diaper!"
        },
        "13112121221211112112":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "He spits you out",
                "The girl from before pulls you out of his mouth",
                "He sucks you all the way into his mouth. "
            ],
            "content":"<div class=\"\"><div> <span>“No! Let me go. Please let me go!” You yell as the boy goes to put you in his mouth. His mouth opens and more drool runs down his face. The saliva strands glisten as you get closer to the mouth.you can also smell and see the left over baby food in his mouth. His breath hits you hard with the smell of sour milk. You struggle in his hand to get free, but his grip is strong. His tongue comes out and gives you lick. The drool is thick and covers you face and upper half. He grins as he shoves your upper half into his mouth leaving your legs to dangle outside of it. His lip shut closed around your waste. You kick you legs to get free when he starts to suck on you like a pacifier. His tongue also plays with you as his sucks on you. It seems like for ever that he moves around playing and running, while you being used as a pacifier substitute. You could also feel the snot running down your legs as his nose runs and mixes with the drool. You don’t know how much more you can take when...</span></div></div>",
            "created":1516169340,
            "id":2441860,
            "title":"In his mouth!"
        },
        "131121212212111121121":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "You fall into his diaper",
                "You fall onto the floor",
                "He grabs you again"
            ],
            "content":"<div class=\"\"><div> <span>His tongue plays with you a few more times, before it starts to push you out of his mouth. You can feel yourself being pushed out back though his lips, each push freeing more of your body. One big push and you fall out of his mouth, only it land with a wet plop on his bare chest. You take a moment to breathe in the fresh air, before you notice that the mixture of saliva and snot is making you slowly slide down his chest. Looking up you see the boy is watching and he giggles  as you move down to his belly. You scramble for something to hold onto, but only make yourself slide faster. Looking down you see your headed for an opening in his diaper. You try and roll out of the way when...</span></div></div>",
            "created":1528036500,
            "id":2502415,
            "title":"He spits you out"
        },
        "1311212122121111212":{
            "author_id":"comics",
            "author_name":"Duke FoxFire",
            "choices":[
                "She forces you into doing something ",
                "You make a break for it when she's not looking "
            ],
            "content":"<div class=\"\"><div> <span>You then find yourself in the 4 year old girls room and see that you're surrounded by nothing but pink and white colors, dolls and animals plastic or stuffed, and doll houses. She dcudes to put you on the floor. \"Ok now, you get to stay here and do what I say. Don't make me mad or you get stuffed in ny pull up, or you can go into my brothers room and he eats you, got it\" she says. You moan at the situation and would never be her obedient drone but given the other choices you just nod and accept her terms. \"Good. My name is Maria but you don't get to call me that. You're my toy and can call me that when I say it's ok\" says Maria smiling at her feeling of power. Then...</span></div></div>",
            "created":1472187600,
            "id":2201972,
            "title":"To her room"
        },
        "131121212212111122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "The 6 year old boy",
                "The 13 year old girl"
            ],
            "content":"<div class=\"\"><div> <span>You are carried by the girl into an average house, you see a boy a little older than the girl playing with his toys and a 13 year old girl sorting through magazines. The girl takes you and sets you on the counter, you know that now is the time to escape! You jump down onto a chair and are just about to jump to the floor when you are hit in the back by a crushing force, <i>someone is sitting on me!</i> you think helplessly, you turn to see...</span></div></div>",
            "created":1328677200,
            "id":1272995,
            "title":"A Violent 6 year old boy, A 13 year old girl, a..."
        },
        "1311212122121111222":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "A diaper??",
                "Panties"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You feel the girl ontop of you, unlucky for you she is wearing a skirt, her weight is demanding. Under that she is wearing..</span></div></span></div>",
            "created":1328677200,
            "id":1272998,
            "title":"The 13 year old girl"
        },
        "13112121221211112221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She uses her diaper",
                "She adjusts again!"
            ],
            "content":"<div class=\"\"><div> <span>WHAT THE <i>HELL!</i> You yell, <i>what is wrong with this family!</i> You thought 4 was a bit old for diapers, but 13? How? This family is obviously screwed up. You get a menacing jolt as the girl adjusts her diaper under her skirt. Above she is occupied reading a magazine, unaware that you are trapped under her giant pre-teen body.</span></div></div>",
            "created":1328677200,
            "id":1273095,
            "title":"A diaper??"
        },
        "131121212212111122211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "You stick to it!",
                "You stay on the seat"
            ],
            "content":"<div class=\"\"><div> <span>The girl lets out a sigh and you feel the diaper vibrating as it fills with mess and pee. \"Oh, gross...\" you say as the girl uses it. The smell engulfs you and you find it almost impossible to breath. You remain there for what feels like a long time, under the girls soiled diaper. Soon enough, she stands up...</span></div></div>",
            "created":1328763600,
            "id":1273667,
            "title":"She uses her diaper"
        },
        "1311212122121111222111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "You do it!",
                "You can't.."
            ],
            "content":"<div class=\"\"><div> <span>You are lifted into the air, \"<i>Oh my god</i>\" you think as the pee sticks you to it. You fly through the air as the girl walks to her room, once there she locks the door and takes off her skirt. You can't see her, but you can hear her getting wipes and then the diaper free falls, you hit the ground front first as the diaper hits the ground. She takes her legs out and throws the diaper and you away. Then she gets a new one and walks back out. You start to unstick yourself. </span></div></div>",
            "created":1329195600,
            "id":1277201,
            "title":"You stick to it!"
        },
        "13112121221211112221111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "4 year old girl",
                "13 year old girl"
            ],
            "content":"<div class=\"\"><div> <span>You manage you way off the diaper, even still, the smell is awful and it must be 20 times your size! You scurry up the walls of the pail and into the girls room, it looks a lot like a normal teenagers room, exept for a small stack of diapers on one of her shelves. Suddenly someone walks in...</span></div></div>",
            "created":1329195600,
            "id":1277245,
            "title":"You do it!"
        },
        "131121212212111122211112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Mean!",
                "Nice"
            ],
            "content":"<div class=\"\"><div> <span>The door swings open and you look up at the 13 year old, she walks in casually, you see that she has a pink t-shirt, skirt, and from  your perspective you can clearly see a diaper on her. She looks at you, \"What the..\" her voice squeaks. She picks you up..</span></div></div>",
            "created":1329195600,
            "id":1277247,
            "title":"13 year old girl"
        },
        "1311212122121111222111121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "To school",
                "To work"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You lie helpless in the girls massive hands, \"Wow, hello little helpless boy-- <b>bug</b>!\" she smiles evilly. \"Oh no..\" You say to yourself, she smiles and takes you..</span></div></span></div>",
            "created":1329195600,
            "id":1277331,
            "title":"Mean!"
        },
        "13112121221211112221111212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Day-care",
                "Mall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does she work??</span></div></span></div>",
            "created":1329195600,
            "id":1277332,
            "title":"To work"
        },
        "131121212212111122211112122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "A toy store",
                "The food court"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She hides you in her grip for a long time.. the warm grip finnaly opens, you look around. There is a two-floored mall towering all around you as the girl is walking through it. \"You're about to see where <b>I</b> work!\" she points to..</span></div></span></div>",
            "created":1329195600,
            "id":1277337,
            "title":"Mall"
        },
        "1311212122121111222111121221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "A 6 year old bratty girl",
                "A 3 year old boy"
            ],
            "content":"<div class=\"\"><div> <span>\"And I'm gonna give you the brattiest kid! HAH! Thats what you get stupid little doll!\" she laughs. You can't move from her hand as she walks right in and opens the store. She sets you down in the display counter and waits..<br>\r\n<br>\r\n<br>\r\nA kid comes that is awful, they are..</span></div></div>",
            "created":1329195600,
            "id":1277339,
            "title":"A toy store"
        },
        "1311212122121111222111122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Luckily she remembers you and sees you",
                "She forgets all about you."
            ],
            "content":"<div class=\"\"><div> <span>She opens her hand and looks at you completely stunned. \"Uhm...Hi?\" <br>\r\n<br>\r\n\"Hi..\" you reply awkwardly<br>\r\n<br>\r\n\"How did you get so tiny?\" She seems facinated<br>\r\n<br>\r\n\"I have no idea, I just passed out, and then--\"<br>\r\n<br>\r\n\"Tell me everything!\" She sets you down on the bed and then sits down next to you. Her massive body makes you feel even smaller, her diaper alone towers over you, but you manage to tell her everything about how her little sister threw her away in her pull-up and then how she took you here. And you even managed to tell of how you were stuck to her diaper, she blushes at that.<br>\r\n<br>\r\n\"Can you help me?\" You ask hopefull<br>\r\n<br>\r\n\"Uhh, I can try..\" she says doubtful<br>\r\n<br>\r\nBy now the sun is going down. \"I think it's time to sleep..\"<br>\r\n<br>\r\n\"Yeah, where will I sleep?\" you wonder aloud.<br>\r\n<br>\r\n\"There's only one real thing that could serve as your bed,\" she points to a folded, unused diaper on the shelf, \"Okay..\" It was better than a used one! You quickly fall asleep...<br>\r\n<br>\r\n<br>\r\nYou awaken and see her getting up aswell, \"Hey!\" you shout down, she can't seem to hear you..</span></div></div>",
            "created":1329195600,
            "id":1277344,
            "title":"Nice"
        },
        "13112121221211112221111222":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Escape!",
                "Get her attention"
            ],
            "content":"<div class=\"\"><div> <span>She turns at you and you know she will see you, but in her groggyness she completely misses you and picks up the diaper you're in. \"NO! STOP!\" you scream but she can't hear you, she pulls down her old diaper (Now completely soiled) and starts to slide the one you're in on. \"NOOOO!\" You bed, but once again she is too tired. The diaper is sealed onto her. she puts on a skirt and walks out. The movement of her legs causes you to bounce around. <i>Why can't she feel me??</i> you wonder. You could try ot escape, or just get her attention.</span></div></div>",
            "created":1329195600,
            "id":1277345,
            "title":"She forgets all about you."
        },
        "1311212122121112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "content":"<div class=\"\"><div> <span>You fall into the garbage with the wipe, you quickly realize that you need to get someones attention, you climb the mound of wipes and as you make it to the top you see the woman standing over the can. She is holding the pull-up that you were trapped in seconds earlier. You scream and yell, but to no avail as the woman can't hear you. She drops the massive, soggy pull-up right on you, smashing you between wipes and it, you can't move as the pull-up is far too heavy. You continually scream but no one hears you. over the next hour, one by one pull-ups and diapers alike are tossed onto you. Not only are your bones breaking, but the liquids from above are gathering at the bottom of the can, only about 1 centimeter high, but in time you drown in it. Later you are thrown out and buried in trash.<br>\r\n<br>\r\n<div align=\"center\">:( Ending</div></span></div></div>",
            "created":1326862800,
            "id":1261263,
            "title":"They leave you."
        },
        "13112121221212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Right on the elastic band",
                "Deep inside"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Umm, BACK!\" you are horrified as she turns around, the back of her pull-up stretches as she does, the boy opens it up, then he holds you over it and drops you, you fall and fall and land...</span></div></span></div>",
            "created":1326949200,
            "id":1261948,
            "title":"Back"
        },
        "131121212212121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She has to go",
                "It's naptime"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You stop right between her and the elastic band, the boy lets go and the band snaps shut, you are pinned to her with bone-crushing strength. Completely unable to do anything as the girl walks around. Soon...</span></div></span></div>",
            "created":1326949200,
            "id":1261950,
            "title":"Right on the elastic band"
        },
        "131121212212122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "The girl sits down",
                "She has to go.."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You land deep inside against her butt, she starts to walk around, getting a feeling for you. You hear the kids laughing on the outside as you are tortured, suddenly..</span></div></span></div>",
            "created":1327208400,
            "id":1263590,
            "title":"Deep inside"
        },
        "1311212122121221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "You do.",
                "She stands up"
            ],
            "content":"<div class=\"\"><div> <span>You are horrified as the girls butt is rubbed against your face, then her legs weaken and begin to bend, almost in slow motion her pull-up is slowly stretching pressing you against her butt harder and harder, then she falls back onto you smashing you into the ground. You lie in pain under her bottom while she giggles at the feeling of you in her pull-up. She adjusts her position, you feel like your going to die..</span></div></div>",
            "created":1328418000,
            "id":1271524,
            "title":"The girl sits down"
        },
        "13112121221212211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "content":"<div class=\"\"><div> <span>She continues to giggle while on the inside the pressure from the massive girl is buildling, her soft bommmom eclipsing your face, You feel a sharp pain as one of your arms crackles, outside the children cannot hear you over the girls giggles and their laughter. The girl starts to lift up and down crushing you until most of your bones are broken, you close your eyes  one last time as your body is crush into a pulp. A stain. About an hour later (after the girl has submerged your remains in mess) she is changed, and your body is thrown away with a 4 year olds dirty pull-up</span></div></div>",
            "created":1328677200,
            "id":1273105,
            "title":"You do."
        },
        "1311212122121222":{
            "author_id":"diokno44",
            "author_name":"Filipino4-ever",
            "choices":[
                "Begins grunting (poop)",
                "Begins sighing (pee)"
            ],
            "content":"<div class=\"\"><div> <span>You try and get comfortable. The phrase \"In between a rock and hard place\" comes to mind, in this case, \"In between a toddler's butt and a Pull-Up\" as you sit down in a corner of the pull-up,you hear the girl, who you can recognize as Emily Hale, your next door neighbor's daughter, talk to the group of kids. All of a sudden, she squats down and....</span></div></div>",
            "created":1360990800,
            "id":1533712,
            "title":"She has to go.."
        },
        "13112122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look up at the 3 year old _____ standing over you.</span></div></span></div>",
            "created":1324702800,
            "id":1245854,
            "title":"3 year old"
        },
        "131121221":{
            "choices":[
                "He eats you!",
                "He still thinks you are a toy"
            ],
            "content":"<div class=\"\"><div> <span>The boy is about Mikey's age. He is wearing a blue shirt (which does little to cover his large belly) and a white pull-up. He slowly bends down and picks you up is his giant, clammy hand. You are directly in front of his face, and his warm breath is being directed right at you.<br>\r\n<br>\r\nSuddenly, his stomach makes a loud, growling sound, and his expression changes...</span></div></div>",
            "created":1370062800,
            "id":1601350,
            "title":"Boy"
        },
        "1311212211":{
            "choices":[
                "*GULP!* The boy swallows!",
                "He spits you out"
            ],
            "content":"<div class=\"\"><div> <span>The boy pats his loud tummy, and looks at you with an mischievous expression that can only mean one thing:<br>\r\n<br>\r\nYou're on the menu today.<br>\r\n<br>\r\nWithout warning, he tosses you into his mouth and closes it, trapping you inside the cavern of darkness. The boy swishes you around for a while, enjoying the taste of his newfound snack. You do your very best to avoid the boy's giant teeth, so as to not be brutally crushed. You can hear the deadly growls of his hungry stomach below, and are extremely scared of being the next entrant to hell.</span></div></div>",
            "created":1370062800,
            "id":1601353,
            "title":"He eats you!"
        },
        "13112122111":{
            "content":"<div class=\"\"><div> <span>*GULP!*<br>\r\n<br>\r\nThe boy pushes you to the back of his throat and swallows with a big gulp. You are pushed down the esophagus, the growls of the little boy's tummy growing ever so much louder as you near your final resting place.<br>\r\n<br>\r\nYou land with a plop inside the 3-year-old's gigantic, dark belly. The cavern is still slightly full of food and milk from the boy's breakfast, which you now slosh around in. \"What a disgusting place\", you think. You find it hard to breathe due to the digestion process of the boy's previous meal, which created quite a bit of gas that pervaded his large tummy.<br>\r\n<br>\r\nThe big stomach rumbles and shakes the contents inside. Outside the hellhole of his belly, the little boy sits on the floor of the daycare room and rubs his tummy contentedly. Suddenly, he feels pressure building up inside it, and knows what's coming next.<br>\r\n<br>\r\n*UUUUUUURRRRRRPPP* The boy burps extremely loudly and then laughs at the noise. He finds his belches amusing!<br>\r\n<br>\r\nYou, on the other hand, are trying to avoid the incoming stomach acid that has begun to flow in to digest you. You thought that you would be burped out once you felt the gaseous air rising, but it didn't work. You can hear the boy gulping down something else now. The stomach begins to fill up with milk. He's thirsty!<br>\r\n<br>\r\nOutside, the boy finishes his milk and burps again. *BUUUUUUUUUUUURRRRP* The daycare workers simply giggle at the boy with the loud burps, and he giggles as well, because of the belch and the attention he seems to be getting because of them.<br>\r\n<br>\r\nBack inside his big, full tummy, you have nowhere to run now, wading in the white milk. What's worse, you feel the boy is now patting his content belly, meaning you are shaken around and fall into the sea of liquid and acid. At this point there is no use trying to fight.<br>\r\n<br>\r\nYou are quickly digested, and the boy goes back to playing after his snack.</span></div></div>",
            "created":1370062800,
            "id":1601355,
            "title":"Belly of a 3-year-old boy"
        },
        "13112122112":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "In his hand. ",
                "In a group of kids playing ",
                "Somewhere else "
            ],
            "content":"<div class=\"\"><div> <span>The boys tongue presses to the roof of his mouth, and moves back and forth, as he plays with you. The tongue moves and you drop into a pool is saliva. Before you can move the tongue comes down on top of you, pushing you down, before it goes under you and flips you into the air. Once again your press into the roof of the mouth as he starts to suck on you. <br>\r\n<br>\r\n“Yum, you taste good like candy.” The boy says as he now presses you into his cheeks. “I never tasted anything this good.”<br>\r\n<br>\r\nThis went on for what felt like forever. And after awhile the boys playing slowed down. You dread what that means. If he has lost interest like your brother has with candy the next step is to swallow it. <br>\r\n<br>\r\n“Like my mom said all good things come to an end” The boy said as he lifts you up on the end of his tongue, and you prepare to be thrown down his throat. But next you know your flying though the air covered in his spit as you shot out of his mouth. Your relieved you didn’t become food, but you don’t know what’s going to happen next.  Wiping some spit out of your eyes you look to see your headed for....</span></div></div>",
            "created":1523215500,
            "id":2476726,
            "title":"He spits you out"
        },
        "131121221123":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "The bathroom ",
                "A play pen",
                "A shoe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Everything is flying by too fast too see. But as you start to fall downwards you can see you going to land in...</span></div></span></div>",
            "created":1523215740,
            "id":2476729,
            "title":"Somewhere else "
        },
        "1311212211232":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "The kid reaches into the pouch",
                "The plush and you are tossed out of the pen"
            ],
            "content":"<div class=\"\"><div> <span>You’re headed for a playpen in the corner of the daycare. “Ahhhh!” You you scream and try to grab onto the padded edge of the opening, but you miss and bounce off, into a pile of stuffed toys. “Oof!” You land on the chest of a kangaroo doll and  just lay there on your back trying to catch your breath and process what’s happening so far. <br>\r\n<br>\r\nAfter a while you decide to find a way out of your current spot, when a worker placed a child that’s about one year old in the pen. The pen shook as the child had a fit and started stomping around. “Woah! Oh no!” You lose your footing and tumble down the plush into the plushies pouch where the baby should be. <br>\r\n<br>\r\nShaking your head, to stop the spinning, you notice the kid has gone quite. “Maybe the worker took the kid out. Good now it should be safe to try and run for it, before I’m seen.” You say to yourself. You attempted to climb out when you fall back to the bottom as the plush is picked up, and with out warning, you are being squeezed and compressed as the kid seems to be hugging the plush. You squirm to free yourself but it doesn’t seem to help. <br>\r\n<br>\r\nFinally the plush is released and...</span></div></div>",
            "created":1559548620,
            "id":2668533,
            "title":"A playpen"
        },
        "1311212212":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "Hide and seek",
                "Monster stomp",
                "Another game"
            ],
            "content":"<div class=\"\"><div> <span>“I hungry. I play with toy later. Cool toy. I keep safe place.” The boy says  his hand dangled you in the air as he opens his diaper waistband. “No! No no no!” You say as he realizes you to fall in. You land at tge bottom of the diaper and are tossed around as he runs around. He soon stops, giving you the chance to stand, and you become pinned against him as he sits down and the diaper tightens. <br>\r\n<br>\r\nYou try to squirm free but it only tickles the boy. You stop moving and a he pokes the front of the diaper. He keeps this up until you move again. This continued until he gets up and removed you from the diaper. “That fun. Now time play game. We play...</span></div></div>",
            "created":1562583780,
            "id":2683763,
            "title":"He still thinks you are a toy"
        },
        "13112122123":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "Play on the playground ",
                "He takes you to his friends group ",
                "Other games"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other games to play are:</span></div></span></div>",
            "created":1578730140,
            "id":2772188,
            "title":"Another game"
        },
        "131121222":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "A person!?",
                "Ooh Toy!"
            ],
            "content":"<div class=\"\"><div> <span>She is very young, about Mikeys age. Her legs are a bit chubby and she is wearing a pink t-shirt (Covered in her drool) and, of course, a pink pull-up is wrapped tightly around her body. She bends down at you and snatches you up into her tiny hands, you look into her face, her soggy, wet breath makes you feel like your gonna throw up. She stares at you for a few moments. The she says..</span></div></div>",
            "created":1324702800,
            "id":1245856,
            "title":"Girl"
        },
        "1311212221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "At the lunch table",
                "At the doll house"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Woah, a pewson?\" Mmm, she stops to think for a few seconds, you are deathly afraid of the 3 year old, she has no idea at all of who you are! Then she starts walking, she ends up...</span></div></span></div>",
            "created":1325653200,
            "id":1252174,
            "title":"A person!?"
        },
        "13112122211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Dodge them",
                "Are crushed"
            ],
            "content":"<div class=\"\"><div> <span>She sits down and holds you out over a bowl of mushed peas, you fall and land in the mush, she smiles and picks up a plastic spoon \"Nummy!\" the spoon digs in under you and picks you up, you try to get off but the mush doesn't allow it. The spoon (you on it) enters her soggy mouth, her lips grasp it and you slide off into her mouth, within seconds her baby teeth are moving it around, you..</span></div></div>",
            "created":1325653200,
            "id":1252179,
            "title":"At the lunch table"
        },
        "131121222112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "content":"<div class=\"\"><div> <span>You are thrown about in her 3 year old mouth. You try your best to avoid it, but soon enough you land between her tiny, growing teeth. Within a second she bites down, you are crushed, even outside the girl hears the sharp crack of your bones disintegrating. Then, with a gulp, you were in her stomach, out of sight, and quickly out of the little girls toddler mind. 3 days later you last remains are packed into a pull-up and changed.<br>\r\n<br>\r\n<div align=\"center\">:( Ending </div></span></div></div>",
            "created":1325653200,
            "id":1252181,
            "title":"Are crushed"
        },
        "131122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Changing time!",
                "Try to get out!"
            ],
            "content":"<div class=\"\"><div> <span>Before you can move any more Mikey squats down, you tumble to the bottom of the pull-up. You hear him grunt and a liquid/solid mess buries you, this goes on for about a minute, when he is done he sighs and goes back to playing. You are under a thick black lake, you are pancaked between his butt and the pull-up, the mess becoming denser as he plays around...</span></div></div>",
            "created":1321246800,
            "id":1223272,
            "title":"You are buried"
        },
        "1311221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Are able to open the pull-up",
                "Are not strong enough"
            ],
            "content":"<div class=\"\"><div> <span>You can barely breath, your lungs burning from the mess. Then all of Mikeys weight is placed on you, you are in a lot of pain, then, he lifts up and the pull-up (you still in it) is pulled from under him, you look up in your filth to see your mother busy changing him. Before you can get her attention she throws a dirty wip over you. Then she closes the pull-up into a ball and tosses it away, you...</span></div></div>",
            "created":1324702800,
            "id":1245988,
            "title":"Changing time!"
        },
        "13112211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "He sees you..",
                "You make it!"
            ],
            "content":"<div class=\"\"><div> <span>You pry open the wall of the pull-up, outside is a massive wall of plasic which you recognize as Mikey's diaper pail. The smell is awful and you walk around on the wet smooshy pull-up trying to find a way out. Finnaly you see that there are little notches on the side, you climb up and escape the pail, you jump and land on the soft carpet of his room. He is across the room playing with his toys next to the door. You creep over to it, you are almost there, the door, and Mikey's body and fresh pull-up are inches away. You get closer and closer and..</span></div></div>",
            "created":1324702800,
            "id":1245991,
            "title":"Are able to open the pull-up"
        },
        "131122111":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Chews on you.",
                "Plays with you...violently"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are just 2 steps away from freedom when Mikeys fingers wrap around you and slingshot you backward, he dangles you in front of him like a toy, you see his other toys, broken and chewed on. Then he..</span></div></span></div>",
            "created":1327294800,
            "id":1264279,
            "title":"He sees you.."
        },
        "1311221112":{
            "author_id":"nsomestuph",
            "author_name":"Dunk",
            "choices":[
                "Sit on you",
                "Step on you"
            ],
            "content":"<div class=\"\"><div> <span>Mikey examines you while you try to break free of his strong grip. He giggles and starts squeezing you. You yelp at his tightening grip around your body. This makes him laugh so he decides to drop you on the ground. The fall sends pain through your body but nothing is broken. Mikey decides to....</span></div></div>",
            "created":1419915600,
            "id":1909776,
            "title":"Plays with you...violently"
        },
        "13112211121":{
            "author_id":"alotofstuff",
            "author_name":"Shrinking Fandom Writer",
            "choices":[
                "Between his cheeks",
                "Under his left butt cheek"
            ],
            "content":"<div class=\"\"><div> <span>You see him starting to grin. you know this is gonna lead to no good. He puts you down on the ground right under his pull-up. he unstraps it and removes his pull-up revealing his mammoth ass cheeks he starts to lower himself down on you you try desperately to move but you are too stunned to move. He is almost one you. </span></div></div>",
            "created":1450587600,
            "id":2076918,
            "title":"Sit on you"
        },
        "131122112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "One of Mikeys toys?",
                "A BUG??"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You slip through, happy to be out of the pull-up terror that was your <span style=\"text-decoration:line-through\">little</span> giant brother. Your mother is walking down the hall at you, you wave and try to get her attention, she sees you, \"...\"</span></div></span></div>",
            "created":1325826000,
            "id":1253486,
            "title":"You make it!"
        },
        "1311221121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Gives you back to Mikey",
                "Puts you in a toy box"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Now what is this doing here?\" she seems to say to herself, then you realize, she doesn't know who you are. \"Wait! WAIT!\" You yell but she can't hear, she takes you and..</span></div></span></div>",
            "created":1326085200,
            "id":1255664,
            "title":"One of Mikeys toys?"
        },
        "13112211211":{
            "author_id":"nsomestuph",
            "author_name":"Dunk",
            "choices":[
                "Stuffs you in his Pull-up",
                "Play with you"
            ],
            "content":"<div class=\"\"><div> <span>She walks back into Mikey's room. He is looking around his room for something. You struggle in your mother tight grip, but you couldn't even overpower Mikey so you have no chance of getting out of hers. \"Is this what you're looking for?\" Your mom says. Mikey looks at you and gives a big smile. You know he wants you! Your mom hands you to him and walks out. Mikey has a strong grip on you making sure you don't get away from him this time. Does he....?</span></div></div>",
            "created":1401512400,
            "id":1804933,
            "title":"Gives you back to Mikey"
        },
        "13112211212":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "At the top of the pile of a almost full box. ",
                "At the bottom of an almost empty box",
                "A box for donation toys to give away"
            ],
            "content":"<div class=\"\"><div> <span>You keep yelling yo get you moms attention, but doesn’t seem to hear you. You Go pail as she enters Mikey’s room. You hope she’s not giving you to him. You sigh in relief as she walks past him. You turn your head and see she going over to the toy boxes in the corner of his room. You don’t want be put in a toy box, cause Mikey could find you easily. Your mom holds you over on of the boxes and let’s go. You scream as you fall towards the toy box. You brace yourself as you land in the box on a pile of toys inside of it. Looking around you see that you landed....</span></div></div>",
            "created":1516170420,
            "id":2441865,
            "title":"Puts you in a toy box"
        },
        "1311221122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Traps you.",
                "Kills you."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"A BUG??\" She recoils suprised<br>\r\n<br>\r\n\"What? NO!\" You yell, but she can't hear you. She stares at you disgusted, then...<br>\r\n</span></div></span></div>",
            "created":1327294800,
            "id":1264281,
            "title":"A BUG??"
        },
        "13112211221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Sink!",
                "Mikey!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She cups you in her hands and as much as you try to get out of her sweaty grip, you cannot, you are trapped, she dumps you in a container and seals it shut while she thinks of how to deal with you, then she smiles and says.. \"...\"</span></div></span></div>",
            "created":1327294800,
            "id":1264283,
            "title":"Traps you."
        },
        "131122112211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "She stops it (thinks you are dead)",
                "She turns the water on"
            ],
            "content":"<div class=\"\"><div> <span>\"SINK!\" She says happily, she takes the container and brings you to the sink, then she overturns it, sending you flying into the sink. You hold onto the end of the drain trying not to fall, then you hear the click of a switch and the disposal blades below you start turning whiping up a wind storm. You try not to fall into certain death when...</span></div></div>",
            "created":1327294800,
            "id":1264286,
            "title":"Sink!"
        },
        "1311221122112":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "content":"<div class=\"\"><div> <span>You are sprayed in the face with tons of water, you instantly lose grip and fall, less than a second later you are mere blood stains on the sink, the grinder gurgles, then it is shut off. Your mother looks down the drain, happy to rid her home of such a pest.<br>\r\n<br>\r\n<div align=\"center\">:( Ending</div></span></div></div>",
            "created":1327294800,
            "id":1264287,
            "title":"She turns the water on"
        },
        "131122112212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "RUN!",
                "Too late.."
            ],
            "content":"<div class=\"\"><div> <span>\"Mikey!\" She says happily, you were terrified, Mikey had killed bugs before, but you had no idea that your mom was helping him. You are motionless as your mother leads Mikey in, he has nothing on but his new pull-up (Which already looks soiled). Your mom dumps you out sending you tumbling onto the hard floor. You look at at them as the prepare to kill you.</span></div></div>",
            "created":1327294800,
            "id":1264290,
            "title":"Mikey!"
        },
        "1311221122122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "content":"<div class=\"\"><div> <span>Mikey stands over you and then squats down, his soiled pull-up hovering over you, he falls back and the pull-up crushes you, you aren't dead, but you have lost feeling in most of your body. The he stands up again, he falls back on you again, you hear a shark crack of your arms and legs, you are now helpless and in pain as your mother looks at you, \"One more sweety, make it good, I want to see blood on that pull-up!\" she pats the back of his pull-up for one last go. He leans back and falls, you are crushed into a bloody stain as his weight is ontop of you. When he stands up again your mother inspects him, \"Good job\" She comments looking at the blood on his soiled pull-up, \"Very nice, now who's ready for day-care?\" They walk away, taking part of you with them, stuck to the bottom of your toddler brothers pull-up.<br>\r\n<br>\r\n<div align=\"center\">:( Ending</div></span></div></div>",
            "created":1327294800,
            "id":1264293,
            "title":"Too late.."
        },
        "13112212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You try as hard as you can to open the pull-up but you can't. You sit in the dark, wet, messed pull-up for a long time, then you surcomb to the fumes.<br>\r\n<br>\r\n<div align=\"center\">:( Ending</div></span></div></span></div>",
            "created":1324702800,
            "id":1245990,
            "title":"Are not strong enough"
        },
        "1311222":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "He is now at day-care",
                "He is about to take a nap"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now you are surrounded in a mess of Mikeys, being smashed into it more every second. You stand up climb the soggy back wall of the toddlers pull-up. You make it to the top and poke your head out. </span></div></span></div>",
            "created":1327294800,
            "id":1264277,
            "title":"Try to get out!"
        },
        "13112222":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "He feels you",
                "He goes to bed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see you mother lifting him up and laying him down in his bed, you lose your footing and fall out, she puts him ontop of you, his soggy pull-up crushing you under it..</span></div></span></div>",
            "created":1329109200,
            "id":1276657,
            "title":"He is about to take a nap"
        },
        "1312":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "You escape",
                "Mikey returns"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He opens a box that is full of other dolls and throws you in, you are trapped as he locks it and goes back to playing. You walk around a little in the darkness, wondering what happened and why you are small. After a little while...</span></div></span></div>",
            "created":1321160400,
            "id":1222793,
            "title":"Puts you away"
        },
        "132":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "RUN!",
                "Ask"
            ],
            "content":"<div class=\"\"><div> <span>You just stands over you, you sit up and look around, you are much smaller than normal, just then a massive drop of Mikeys spit hits the ground next to you, you jump back shocked. The smell of toddler food comes down as he breathes. You stand up and think about you situation, you could make a break for it, or you could ask him to help you.</span></div></div>",
            "created":1320987600,
            "id":1221447,
            "title":"He just stares"
        },
        "1321":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Doll house",
                "Door"
            ],
            "content":"<div class=\"\"><div> <span>You make a break for it, and behind you a deafening roar as the toddler stands up and begins to follow you, as you run he gains on you yelling \"COME BAWK!\". You realize that you only have a couple options, you could try to hide in the doll house, or go for the door. The door seems far away, he might catch you if you go for it, the doll house is closer but he would know where you are...</span></div></div>",
            "created":1320987600,
            "id":1221617,
            "title":"RUN!"
        },
        "13211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Peek out.",
                "Stay inside"
            ],
            "content":"<div class=\"\"><div> <span>Only a couple steps away the doll house seems much safer, you run in and shut the door. You hear Mikey on the outside as he stops in front of the building, you wait in fear for what he is going to do, you know that he is violent with his toys and breaks them often. He also tends to cover them in his spit and waste. You can hear him breathing and smell his pull-up, but you cannot see what he is doing, you could peek out, risking being seen by him, or you could stay inside safely... </span></div></div>",
            "created":1321246800,
            "id":1223194,
            "title":"Doll house"
        },
        "132112":{
            "author_id":"nsomestuph",
            "author_name":"Dunk",
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You'd rather play it safe and rest in the doll house. You sit down and catch your breath. You hear a noise come from outside and the house starts to shake. You look up and see the roof is coming off! You hide under the bed. Mikey looks down trying to find his new toy. He knows you are in here. He puts his hand and tries to find you. You see his hand go by you as he tries to find you. <br>\r\n<br>\r\nDo he find you?</span></div></div>",
            "created":1401598800,
            "id":1805374,
            "title":"Stay inside"
        },
        "13212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "He grabs you!",
                "You make it!"
            ],
            "content":"<div class=\"\"><div> <span>You run as fast as you can to the door, Mikey stomping behind you, you continue, getting closer and closer to the door and Mikey quickly gaining on you. You are just a few meters from the door now, you can smell Mikeys soiled pull-up as he happily tries to catch his new toy. You continue, only inches now, you are so close, you make the mistake of looking behind you, Mikey is right behind you, his arm already reaching for you. The smell is overwhelming, unbearable, and the shaking like an earthquake as he stomps at you. You are only a couple steps...</span></div></div>",
            "created":1321246800,
            "id":1223190,
            "title":"Door"
        },
        "132121":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Mom comes back",
                "You slip from his hand"
            ],
            "content":"<div class=\"\"><div> <span>You are almost there now,  just feet away, then, you are pulled back suddenly and brought up to the face of your younger brother, he looks at you intently. He stands up and you see how tall he is compared to you. Like a living, breathing, skyscraper. Behind him is his room, a vast world of danger for you. Suddenly he takes a step forward, sending a jolt through you, this repeats as he walks across his room. He plops down onto the ground, his soggy pull-up making a mushing sound as he lands on it. He is about to begin playing when..</span></div></div>",
            "created":1326603600,
            "id":1259259,
            "title":"He grabs you!"
        },
        "1321211":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "Drops you in his mouth",
                "Tosses you in the pull-up as your mom closes it",
                "Throws you at your mom"
            ],
            "content":"<div class=\"\"><div> <span>You are so happy to see your mom walk in the door. Maybe you can get her attention to help you. She lift up Mikey and lays him down to change him. You struggle in his hand and yell for her attention but it doesn’t work. Mikey giggles at your movements and when your mom turns around he looks at you with a grin. He moves you to dangle from his fingers and he...</span></div></div>",
            "created":1562581980,
            "id":2683760,
            "title":"Mom comes back"
        },
        "13212113":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "doesn't really look at you and just swats you off the table",
                "decides to confiscate you from Mikey as punishment",
                "see's your movement of pain and is curious to what you are"
            ],
            "content":"<div class=\"\"><div> <span>...takes you into a fist. And you feel yourself in an instant being thrown in the air at a high speed. And you don't even get a second to look where your going as you slap against your mom' face and begin your decent. You were lucky at the angle that he threw you at because you were able to have a short fall to the table. But the high speed impact of hitting your mothers face still left you in an immense amount of pain. Getting in a sort of cradle position you struggle through your pain as your mother above you reacts in a different way.<br>\r\n<br>\r\nYour mother gets a little frustrated with just being hit with some *\"object\"*, she turns her attention from the diaper to Mikey and starts her scolding \"Are you throwing things at mommy? That's a very bad baby...\" and then turning her attention to the object (you). She...</span></div></div>",
            "created":1578682500,
            "id":2771980,
            "title":"Thrown at your Mom"
        },
        "1321212":{
            "author_id":"nsomestuph",
            "author_name":"Dunk",
            "choices":[
                "Front ",
                "Back"
            ],
            "content":"<div class=\"\"><div> <span>Mikey loses grip on you and drops you. You close your house accepting your fate. You land and aren't dead. You are surprised by this. You open your eyes to see that you land on soggy used pull-up. The smell is terrible and you slid off as it is very wet from all it's using. You stand and the pull-up itself is three times your size. Mikey looks down at you.<br>\r\n<br>\r\nHe looks at his pull-up and gets a mischievous idea. You grabs you and dangles you over his pull-up. \"Toy go in pull-up!\" He yells. You struggle and yell but it's no use. Mikey giggles as he drops you in to your doom.<br>\r\n<br>\r\nWhich end did he drop you in? </span></div></div>",
            "created":1401598800,
            "id":1805382,
            "title":"You slip from his hand"
        },
        "1322":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Play time!",
                "Time for bed!"
            ],
            "content":"<div class=\"\"><div> <span>\"Umm, Hey Mikey, can you give me to mom?\" <br>\r\n<br>\r\n\"Brodur?\" He responds curiously<br>\r\n<br>\r\n\"Yeah! It's me, but could you give me to mom?\"<br>\r\n<br>\r\n\"Whhhyyy?\" He groans<br>\r\n<br>\r\n\"Cause she wants me, it's very important\"<br>\r\n<br>\r\n\"NO!\" He yells, leaving a loud ringing in your ear<br>\r\n<br>\r\n\"Mikey, please, I just need you to--\" But before you could finish you were in his grasp as he walks over to his toys. \"You MY toy now!\" he then tears off the clothes you have on, it is painful and embarrassing, the he gets doll clothes and puts them on you, they are lose, but better than nothing, so yo do it. After that...</span></div></div>",
            "created":1320987600,
            "id":1221623,
            "title":"Ask"
        },
        "13222":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "An hour later",
                "The next morning"
            ],
            "content":"<div class=\"\"><div> <span>Just as he is about to begin playing with you your mom walks in, \"Mikey, it's time for bed\"<br>\r\n<br>\r\n\"But mommy!\"<br>\r\n<br>\r\n\"No exeptions sweetie, now get to bed!\" She picks him up while he is still holding you and brings him to bed, then she gets up and walks out.<br>\r\n<br>\r\n\"Brodur, you sleep wit me!\" He holds you close as he drifts off. You are helpless to escape while the toddler is asleep.<br>\r\n<br>\r\n</span></div></div>",
            "created":1321160400,
            "id":1222616,
            "title":"Time for bed!"
        },
        "132221":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "Hungry. Yummy candy.” And he tosses you in his mouth",
                "I hide brodur.” He drops you in his pull-up ",
                "I sleepy” He lays down holds you tightly to his chest "
            ],
            "content":"<div class=\"\"><div> <span>You had also fallen asleep but woke up when you felt yourself moving. Mikey’ hand has you in a tight fist. You can’t get free. His hand must have shifted in his sleep and that was the movement you felt. <br>\r\n<br>\r\nMikey started to grumble and talk in his sleep as you tried to sleep again. “No! Mine! You can’t have. My Brodur!” He said. You think it’s cute he’s dreaming of you. He moves and is still asleep as he sits up. You remember sleep walking as a kid and think Mikey must do it too. The hand holding you suddenly moves as Mikey sleep talks again. You panic as you don’t know what he’s about to do. “Mikey! Mikey wake up buddy!” You yell as his hand moves and he says”....</span></div></div>",
            "created":1562583000,
            "id":2683762,
            "title":"An hour later"
        },
        "132222":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "You are 1in bigger",
                "He has rolled over"
            ],
            "content":"<div class=\"\"><div> <span>He holds you onto his chest, your head just below his neck, and your feet just above the bulge in his footie pajamas where his pull-up lies. He will not let go of you as he snores, as he sleeps you start falling asleep..<br>\r\n<br>\r\nWhen you awaken..</span></div></div>",
            "created":1326690000,
            "id":1259828,
            "title":"The next morning"
        },
        "1322221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "The next day..",
                "A week later.."
            ],
            "content":"<div class=\"\"><div> <span>You wake up still pinned to him by his massive arms, but you instantly notice that you are slightly bigger! You shrunk while sleeping, maybe you'll grow while sleeping too! Just as you think that Mikey groans and sits up, you tumble out of his grip and onto the bedding next to him. The thick smell hits you instantly as he starts to cry. Your mother walks in quickly and picks him up in her arms, \"It's okay Mikey, lets get you changed\". While your mom takes off Mikeys pajamas and changes him, you figure out how your going to make it through enough time to return to normal size. Maybe you could hide for a while, or you could stay with Mikey for saftey.. Just then the now fully changed Mikey plops down back in his crib, you remain quiet for a little while until your mother takes him away, you spend the rest of the day thinking of how to survive until your bigger...</span></div></div>",
            "created":1328504400,
            "id":1271961,
            "title":"You are 1in bigger"
        },
        "13222212":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "\"Toy?\"",
                "\"Person?\""
            ],
            "content":"<div class=\"\"><div> <span>One week later you awake under Mikeys bed, you are now just about a foot tall, bigger, but still a fraction of your normal height. Mikey still stands over you at 3 feet. You have been avoiding him for days, then stealing his food during the night. You slip out and into his lit up room. His chewed toys all around, some still towering over you, you see your mom walk in and immediately care for Mikey, you decided against getting her help, and wonder why she hasn't noticed your disappearance. While she attends to him you stretch on the floor preparing for a long day of hiding and trying to get foods; you feel like a rat. Your mom changes him and sets him down on the other side of the room, you knew Mikey to be particularly violent because of how he treted you before, so you keep your distance. You go back under his bed and lie down. Suddenly a hand reaches in and pulls you out, you come face-to-face with Mikey, <i>Crap! He saw me!</i> you gasp in terror. Mikey opens his mouth and belches out..</span></div></div>",
            "created":1328504400,
            "id":1272055,
            "title":"A week later.."
        },
        "1322222":{
            "author_id":"nsomestuph",
            "author_name":"Dunk",
            "choices":[
                "Mikey Wakes up!",
                "Your mom comes to change him"
            ],
            "content":"<div class=\"\"><div> <span>You wake up to being smothered by your brother giant body! Lucky for you that his bed and onesie is very soft so you don't feel much pain. It's hard to breathe and their is a terrible smell coming from below you. Mikey messed his pull-up. You can't move your hands so you have to deal with the smell.<br>\r\n<br>\r\nAn hour later. What happens? </span></div></div>",
            "created":1401598800,
            "id":1805367,
            "title":"He has rolled over"
        }
    },
    "info":{
        "author_id":"s_p_r",
        "author_name":"S_P_R",
        "brief_description":"The sequel to Horrors of a baby brother, Mikey is back with the terror from before!",
        "created":1320970500,
        "description":"<td align=\"left\" class=\"norm\">Rules:<br>\r\n<br>\r\n-Keep the paragraphs longgggg!<br>\r\n<br>\r\n-I will edit around to fix spelling errors and major plot mistakes<br>\r\n<br>\r\n-Feel free to add as many characters as you want!<br>\r\n<br>\r\n-ADD TO THE STORY! IT TAKES 2 SECONDS! <br>\r\n<br>\r\n- :)</td>",
        "id":1825196,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1578730140,
        "modified":1578730140,
        "pretty_title":"Horrors of a Baby Brother 2"
    }
}