{
    "chapters":{
        "1":{
            "author_id":"silverjinzo",
            "author_name":"Silverfighter",
            "choices":[
                "Hilary sees an intresting article in the newspaper",
                "Hilary gets a phone call",
                "There's a knock on the door",
                "You decide"
            ],
            "content":"<div class=\"\"><div> <span>Hilary awakened from her nap, and scratched her massive belly. \"I wonder what's in the fridge?\" said the 400-lb Asian girl, as she waddled over to the kitchen. She fixes herself a snack, and while she eats, she thinks about her greatest desire: to be even fatter than she was now. Just then...</span></div></div>",
            "created":1054962000,
            "id":160888,
            "title":"Hilary's Huge Story Begins"
        },
        "11":{
            "author_name":"jellobuns",
            "choices":[
                "She goes out and hunts for one",
                "She eats the food on the table",
                "She tries to disguise herself as an anorexic",
                "SOMETHING ELSE!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm? What's this, I wonder?\" she said, glancing at the article about a new medicine for anorexics. It turned any food that was consumed into fat in a matter of hours. Good for them... Great for her. She cackled semi-sweetly, almost like the morsels that filled her plump belly.<br>\r\n<br>\r\nShe plopped down on the couch and looked at the vast array of food that filled the table ahead of her. \"Wait... wouldn't it take an anorexic to GET the stuff? Where am I gonna find an anorexic at this hour?!\" <br>\r\n<br>\r\nHer long inactive brain (I'm allowed to make fun of myself, darn it!) stirred to life...</span></div></div>",
            "created":1054962000,
            "id":160889,
            "title":"The plot thickens, and so will she soon"
        },
        "111":{
            "author_id":"henrynewton",
            "author_name":"Henrynewton",
            "choices":[
                "You decide (1)",
                "You decide (2)"
            ],
            "content":"<div class=\"\"><div> <span>She was disappointed, but not entirely surprised, to find that there were no shops in her immediate area that sold anorexic people. Therefore, she had no choice but to go out and find one herself! Her fattening depended on it! And if that wasn't worth fighting for, what was? So, she slapped her belly definitively, got to her feet, and strode off...TO ACTION!<br>\r\n<br>\r\n(cue melodrama)<br>\r\n<br>\r\nNow, then...where to search?</span></div></div>",
            "created":1073970000,
            "id":184898,
            "title":"TO ACTION!"
        },
        "1111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Waddle up to them and ask?",
                "Wait for a barfer?",
                "Meet them online first?"
            ],
            "content":"<div class=\"\"><div> <span>Of course there were no shops that 'sold' anorexic people - that must have been a delusion of her sugar-deprived brain.  So, first, some food!  Hillary grabbed handfuls of the morsels on the table in front of her, then dropped her enormous butt back into her chair.  It creaked beneath her - further proof of her awesome size - as she gobbled down the food.  Buns, fruit, cheese, noodles, chicken, beef, vegetables - it didn't matter what it was, Hillary consumed it all!  Fortunately, her mother loved to cook, so there was always an array of tempting food in the house.<br>\r\n<br>\r\nAs Hillary's gourmandising steadily filled her capacious tummy, her thoughts tumbled.  Of course, the place to look for an anorexic was at school!  There were lots of skinny waifs at her school, some of them must be anorexic!  Could she just go up to them and ask?<br>\r\n<br>\r\nOr wait in the washroom after lunch for one of them to come in and barf?<br>\r\n<br>\r\nOr should she scout for them them on the web, first?  Maybe on Myspace, or the chatrooms at the school?  </span></div></div>",
            "created":1236834000,
            "id":659705,
            "title":"First food, then to school?"
        },
        "113":{
            "author_name":"jellobuns",
            "choices":[
                "The belt snaps",
                "Hilary actually looks convincing enough, (or lost enough magically to get it)"
            ],
            "content":"<div class=\"\"><div> <span>Hilary's brain churned the wrong way, as it normally did. Dressing up a 408 pound girl as an anorexic was probably the silliest thing anyone could dream of, save for dressing up a 508 pounder, like the dark-skinned blimp hoped to be.<br>\r\nShe sucked in the massive blob of flesh called her tummy and squeezed into her smallest clothes, from way back when she was a mere 300. It was a jet black catsuit that fit VERY snugly, and actually managed to control her constant jiggling.<br>\r\nShe looked at herself in the mirror, hearing the material creak and groan attempting to contain her mass. <br>\r\nShe grabbed a belt, and sucked in again, then tied it around her waist as tight as possible.<br>\r\nA minute ticked by...</span></div></div>",
            "created":1061442000,
            "id":170692,
            "title":"Like a Darn Vice Around My Middle"
        },
        "1131":{
            "author_id":"doublel",
            "author_name":"Golden Tiger",
            "choices":[
                "She tries something else",
                "She continues her plan"
            ],
            "content":"<div class=\"\"><div> <span>SNAP!!!!<br>\r\n<br>\r\n\"Oh great...\" sighed Hilary, seeing the metal belt part snap off, before it bounced off a lamp and hit Hilary on the head.<br>\r\n<br>\r\nWHAM!!!<br>\r\n<br>\r\nTwo hours later, when Hilary regained conciousness...<br>\r\n<br>\r\n</span></div></div>",
            "created":1061442000,
            "id":170694,
            "title":"Bouncing Belt Part"
        },
        "11311":{
            "author_name":"jellobuns",
            "choices":[
                "\"Yeah, nothing could make you look thinner\"",
                "\"Yeah, why would you wanna look thinner?\""
            ],
            "content":"<div class=\"\"><div> <span>As soon as Hilary finished counting the stars floating around her head, she realized that she wasn't alone in her apartment. A handsome face hovered above, looking worriedly at her.<br>\r\n\"Ow... how long was I out?\"<br>\r\n\"About two hours... what happened?\"<br>\r\n\"I was trying to look thinner... and walloped myself with a belt.\" She grinned sheepishly. \"Sorta stupid huh?\"<br>\r\n</span></div></div>",
            "created":1061528400,
            "id":170805,
            "title":"The new person"
        },
        "113111":{
            "author_name":"jellobuns",
            "choices":[
                "Guy starts drooling and agrees",
                "Guy shoves her away and bolts."
            ],
            "content":"<div class=\"\"><div> <span>\"Gee thanks\" Hilary said, lifting her 410 lbs up off the creaking could. She dusted her blubbery body off and looked herself over in the mirror. \"So much for looking anorexic...\"<br>\r\n\"You wanted to look anorexic? Why?\"<br>\r\nHilary groaned and related her story. She finally turned around and saw... a very trim looking guy.<br>\r\n\"Well well well...\" She smiled. She waddled over, pressing her fleshy body against him, stroking his cheek. She hoped her almond eyes shimmered behind her large rimless glasses, trying to get him as hot as possible with her bulk. \"Wanna give me a hand?\"</span></div></div>",
            "created":1074834000,
            "id":185955,
            "title":"Slim chance"
        },
        "1131111":{
            "author_id":"henrynewton",
            "author_name":"Henrynewton",
            "choices":[
                "A crate of the drug.",
                "Nothing but an excuse."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The guy agreed, and an hour later, came back with--</span></div></span></div>",
            "created":1077253200,
            "id":189285,
            "title":"A Friend Indeed"
        },
        "113112":{
            "author_id":"doublel",
            "author_name":"Golden Tiger",
            "choices":[
                "You decide his name"
            ],
            "content":"<div class=\"\"><div> <span>\"I wanted to get this stuff to make me fatter, but its only for anorexics,\" said Hilary to the boy in her room. \"Uh...I think that button hit me harder than I thought...uh, what's your name again?\"<br>\r\n<br>\r\nThe boy then said...</span></div></div>",
            "created":1061528400,
            "id":170806,
            "title":"Hilary's Amensia"
        },
        "1131121":{
            "author_name":"FoxFire",
            "choices":[
                "Their car breaks down at an all you can eat buffet",
                "They go on to the drugstore"
            ],
            "content":"<div class=\"\"><div> <span>    \"My name is Nolan, whats your name?\" he replied. <br>\r\n    Hillary stared up as if she was dumbfounded by his sudden question, but answered <br>\r\n\"Hi-, Hillary!\" Nolan extended his hand to help her up. <br>\r\n    He replied,\"So, you wanna go get those pills now?\"he replied with a smile,\"ill drive you.\"<br>\r\n    \"That I can do, but we also need to get some dinner, i'm starved!\"<br>\r\n    Nolan smiled and replied,\"Lets get a move on\", he said as he grabbed hillary's hand, smiled, and the walked out of the house and into the parking lot.<br>\r\n </span></div></div>",
            "created":1064898000,
            "id":174732,
            "title":null
        },
        "11311212":{
            "choices":[
                "you decide 1",
                "you decide 2"
            ],
            "content":"<div class=\"\"><div> <span>As they park outside the dug store, Nolan went in and bought the drug. Hilary sat in his car, thinking about becoming fatter and fatter.<br>\r\n<br>\r\n\"hey, Hey! you still with me?\" Nolan said, snapping Hilary out of her trance<br>\r\n\"oh, yes, sorry. Did you get them?\" she asked<br>\r\n\"yeah, here you go\" and he handed her a larg bag, full of boxes of the drug<br>\r\n\"wow, all these for me?\" she asked in shock<br>\r\n\"ofcourse\" Nolan said as he pulled away from the store.<br>\r\n<br>\r\n\"where are we going\" Hilary asked<br>\r\n\"oh, you'll see\" Nolan said<br>\r\n<br>\r\n10 minutes later they arrived at a large airplane hanger, they drove inside and both got out of the car, Nolan went back and shut the door<br>\r\n<br>\r\n\"why are we at a hanger\" Hilary asked<br>\r\n<br>\r\n\"well, its a great place for you to try those drugs of yours, don't you agree?\" Nolan said<br>\r\n<br>\r\n\"I suppose so, yeah\" she said as she looked around the hanger.<br>\r\n<br>\r\n\"Well, now or never\" Hilary said as she took a box of the pills out from the bag and emptied the box into her mouth.<br>\r\n<br>\r\nShe swallowed the pills and the effect was almost instant. She got a sharp rush of pain in her stomach and then it happened. She exploded with fat all over her body, billowing with fat, larger and larger, her clothes burting open, leaving her only in her straining bra and painties, which could not be seen anymore. The growth stopped and she too a look at herself. Her breasts were about the size of 2 large beachballs each, her belly was massive, sticking out about 5 feet and 4 feet wide. Her thighs were like tree stumps and her ass was the biggest part of her. It was wider than her now massive belly and sagged down to her knees.<br>\r\n<br>\r\nShe wobbled and then fell back onto her giant buttocks, causing her whole body to jiggle and shake. She giggled at this and squished her massive breasts and belly.<br>\r\n<br>\r\nNolan looked at her and assest that she must weiggh about 700lbs now<br>\r\n<br>\r\n\"Wow! that ws fun\" Hilary yelled to Nolan \"What next?\"</span></div></div>",
            "created":1080968400,
            "id":193778,
            "title":"Explosive Growth"
        },
        "113112122":{
            "author_name":"samurai-x",
            "choices":[
                "Break out some more of those pills",
                "Fool around a little"
            ],
            "content":"<div class=\"\"><div> <span>Hilary sat there, her massive bulk jiggling with each breath. She looked down at the bag of pills which had been moved away from her during her last growth spurt. She tried to get up but try as she may, she didnt have the strength. She looked at the bag and then to Nolan.<br>\r\n<br>\r\n\"Hey, would you mind handing me the bag please\" she asked.<br>\r\n\"Sure thing\" he replied, picking up the bag and setting it down on top of Hilarys massive breasts. Her face lit up as she used all her stength to get her hands into the bag. \"Wow, that was hard, i dont think i can do that again, I must be really heavy\" she thought to herself. She took out 6 boxes and emptied them out onto her breasts, making a large heap of pills.<br>\r\n<br>\r\n\"Bottom's up!\" she said as she scooped up the whole pile and threw them down her throat.<br>\r\n<br>\r\nShe gasped in pain as she felt like a giant knife had stabbed her in the stomach, painful enough that tears had welled up in her eyes, but she was happy, because she knew what that pain ment.<br>\r\n<br>\r\nNothing happened for a moment, but then she could feel her body rippling and shaking, her fat shaking wildly and then it started.<br>\r\n<br>\r\nHer entire body violently exploded with fat, in seconds she was double the size she was before. Her breasts swelled and swelled, becoming rounder and rounder, her bra snapped and now hung infront of her breasts, making her still some what decent. Her belly surged out in all directions, pushing her mammoth breasts up into her face and spreading her giant thighs apart. Her butt grew amazingly fast, raising her off the floor several feet and spilling out to the sides rapidly, along with her thighs which grew thicker and thicker with fat as each second went by. The growth only lasted 20 seconds but boy did she grow.<br>\r\n<br>\r\nNolan looked up at the godess that stood before him. She was about 20' high, creamy, soft fat everywhere. Her face now sported 6 chins and a 7th coming along, her cheeks were also very puffy, making her already narrow eyes narrower. Her neck had dissapeared completely now, just a head on fat shoulders. Her arms were like giant pillows with a fat had on the end. Her breasts were immence, each about the size of a large car, but still amazingly round and squishable. Her belly was huge, must have been about 20 feet high from all the fat, numerous rolls lay on top of eachother at the sides of it, creaping round the front. Her belly button looked like you could fit a small child all the way into it. Her thighs were bigger than tree trunks now, they were so huge and draped with fat. Her butt was the biggest thing on her, it had raised her up a good deal, each cheek was the size of a large van, so large and fat, Nolan had broken into a slight sweat while looking at her, tugging on his collar a little.<br>\r\n<br>\r\n\"oh wow\" Hilary exclaimed \"im soooo big!\"<br>\r\n\"..indeed you are\" Nolan said as he started to climb up her mountainous gut. He finaly scaled it and sat down next to her face on top of one of her giant breasts.<br>\r\n<br>\r\n\"this feels great\" Hilary said, squishing the fat she could reach with her fat hands.<br>\r\n<br>\r\n\"well, how about we....\"</span></div></div>",
            "created":1082091600,
            "id":195506,
            "title":"\"Pill popping\", but in a good way."
        },
        "1131121221":{
            "author_id":"jedislayer",
            "author_name":"jedislayer",
            "choices":[
                "She filled the hangar.",
                "She outgrew the hangat and kept going."
            ],
            "content":"<div class=\"\"><div> <span>\"How about we break out some more of those pills?  Would you like that, Hil?\"<br>\r\n<br>\r\n\"Oh, yes, please!  Give me more of those pills.  I must get bigger.  I have to be fatter.\"<br>\r\n<br>\r\n\"Sure, there's just one little problem.  The bag with the rest of the pills ended up in your cleavage, girl.\"<br>\r\n<br>\r\n\"OH, I don't think that's such a problem.  I'm sure you wouldn't mind going in and getting them for me, would you?\"<br>\r\n<br>\r\n\"You read my mind, Hilary.\"  With that, the very excited boy dove into Hilary's cleavage looking for the bag.  After about a minute, a very happy looking face emerged from within the two giant boobs, and he brandished the bag full of pill boxes in front of Hilary's eager face.<br>\r\n<br>\r\n\"How many boxes do you want?  We have about 30 boxes left in the bag, here.\"<br>\r\n<br>\r\n\"Let's start with just 10 boxes.  That's more than last time, but it still leaves some for later.\"<br>\r\n<br>\r\nWith that, Nolan emptied 10 boxes of pills into Hilary's mouth, since she couldn't do it herself.  Immediately she winced in pain, and her whole body began to shudder.<br>\r\n<br>\r\nHilary's entire body once again exploded with new fat, but this time she was growing much more quickly and at a much greater rate.  Within seconds she had tripled her size, each of her breasts the size of a bus, her titanic belly seeming to ooze out from her at an unthinkable pace, and her ass raising her higher and higher up, all the time with Nolan hanging onto one of her massive boobs for his life, but enjoying the ride immensely.  Hilary continued fattening up until.....<br>\r\n</span></div></div>",
            "created":1165381200,
            "id":363919,
            "title":"Even more pills"
        },
        "11311212212":{
            "author_id":"curiousgorge55",
            "author_name":"Clayton",
            "choices":[
                "More pills",
                "A shrinkage medicine"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hilary continued fattening up until she outgrew the hanger and kept going. She was now 60 ft. high. Nolan kept hanging on.</span></div></span></div>",
            "created":1376974800,
            "id":1649076,
            "title":"She outgrew the hangar and kept going."
        },
        "113112122121":{
            "author_id":"curiousgorge55",
            "author_name":"Clayton",
            "choices":[
                "Down the final 5 boxes",
                "Shrink Hilary"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nolan suggested, \"Hey, how about more pills?\" Hilary decided she wanted it. She downed 15 boxes, She had a lot of pain. She exploded more with new fat, making her quadruple the size as she was before. She was larger than a building.</span></div></span></div>",
            "created":1376974800,
            "id":1649117,
            "title":"More pills"
        },
        "1132":{
            "author_id":"link2hyrule",
            "author_name":"The Ultimate Hylian",
            "choices":[
                "Crack open a bottle and let the binging begin"
            ],
            "content":"<div class=\"\"><div> <span>After doing herself up Hilary decided she looked enough like an anorexic to make it through one night.  She heads down to the nearby drug store and picks some up.  The pharmacist behind the counter was a bit of a ditz, so she was easily fooled into giving Hilary some of the drug.  Hilary put on such an act, though, that the lady gave her 5 bottles of pills, saying that they were more potent than the ads let on.  Excited, Hilary ran home to try them out.  First she eats as much food as she could fit into her belly, which was quite a lot, considering.  Before she took the pills she  glanced at the instructions on the bottle.  'Use as directed.  Only take one a day to ensure drug has plenty of time to take permanent effect.  Effect of drug wears off after twenty-four hours, then all weight gained due to drug melts away.  Any added weight due to the metabolism of the user will remain and is nobodys' fault.  Do not take if you are pregnant, bad heart, yada yada yada...'  Hilary was very excited, and since she had five bottles, she would be able to do this five times and really pack on the pounds.</span></div></div>",
            "created":1137387600,
            "id":296103,
            "title":"Better safe than sorry"
        },
        "11321":{
            "author_name":"Ze Rat",
            "choices":[
                "Gigantic!",
                "Skinny?"
            ],
            "content":"<div class=\"\"><div> <span>She pours all the pils down her throat and dives into the feast she had laid out before herself. \" This is gonna be sweet\" She smiled and dove in. \"Mmmmmmm this is sooo good, but when does the medicne kick in?\" Short after she whiped out every last crumb in the house she drifted into a deep sleep...<br>\r\n<br>\r\nSeveral hors later she awoke with a shock. Her body had changed all right she was now.....</span></div></div>",
            "created":1144040400,
            "id":310339,
            "title":"and so it begins"
        },
        "113212":{
            "author_name":"Ze Rat",
            "choices":[
                "A Chinese place",
                "A mysterious friend"
            ],
            "content":"<div class=\"\"><div> <span>What the hell? I'm skinny!  But how, al lthat food, all that weight? where did it go? I better start eating agian quick, i dont know if i liek this. She took once step forward from the chair and BAM! a surge rushed thru her body and the next thing she knew she was almost filling the room! \"Oh man these pills rock! I better get some more food over here quick, im starving.\" She pulls her cell phone from her clevage and uses the voice command to call.... </span></div></div>",
            "created":1144040400,
            "id":310340,
            "title":"Omg she's thin?"
        },
        "1132122":{
            "author_name":"Ze Rat",
            "choices":[
                "\"I'm starving! more food please!\"",
                "\"Maybe I over did it this time?\""
            ],
            "content":"<div class=\"\"><div> <span>She calls one of her many fans who comes over with a staff of caterors who turn her kitchen into a 24/7 buffet line. she downs the last 4 bottles and begins a month long feast ogf non stop eating all day and night. as the month comes to a close she drifts off into a deep sleep. only to awaken to an 80 pound waif body. Her friend advisess her to run outside before they take effect and the fat piles back on. Just as she gets in to the backyard she instantly inflates. Covering yard after yard her rolls mowing down houses and trees in their path as she finally stops at what would appear to be 1 million pounds of pure blubbery goodness. She opens her mouth and says.....</span></div></div>",
            "created":1158728400,
            "id":347771,
            "title":"Mount Jellobuns"
        },
        "11321221":{
            "author_name":"Ze Rat",
            "choices":[
                "A man shows up...",
                "Sakaki walks down the street."
            ],
            "content":"<div class=\"\"><div> <span>\"I wanna try this one more time...\" She orders him ot bring her more of the syrum and she downs it all, gallon after gallon. for a full week she gourges on nothing but the syrum. Instead of a grand feast. This time Hilalry decides to eat nothing but pure fat and lard mized with bulk powders and other gainer x products, making a coctail that could add 200 pounds on its own from one sip. For months she is pumped full of this mixture until finally drifts off to sleep. almost 3 months later she awakens.\"Huh? what up? I can see my feet, I can stand! She quickly ran back to the remains of her apartment building and found some cloths and her old scale. \"75 pounds?!?! My god you can see my rib cage!!\" Her body was no more than skin and bones. \"Ok i'm a little freaked out now, when am I going to errupt into a sea of blubber?\" a few minutes passed and nothing happened, she didnt even feel hungry. Back in the remains of her kitchen she picked through food stuff but none of them looked apatizing \"I don't get it. I haven't errupted, and I'm not hungry at all. Whats wrong with me?\" She plopped down hard on a somewhat solid chair \"Oww... my tail bone. Jeeze I'm not used to not having any padding down there, thats gonna be weird.\" Several days passed now and she still had no urge to eat, or gained a single pound. She began to cry alittle. \"What have I done to myself....\"<br>\r\nJust then...</span></div></div>",
            "created":1161147600,
            "id":353684,
            "title":"A snag in her plans."
        },
        "113212212":{
            "author_name":"Ze Rat",
            "choices":[
                "Sakaki and Hillary are both skinny.",
                "Something weird happens!"
            ],
            "content":"<div class=\"\"><div> <span>Everyones favorite Ninja strolls down the street past her friend Hillary's and notices a roar of tears. \"Hmm I wonder whats wrong?\" She walks in and upstairs and finds a waif Hillary crying on the bathroom floor \"Hilly what's wrong your...skinny?!?!\" stil lsobbing hillary spoke \"I took these pills ~sniff~ and the first time ~sniff~ they made me really fat. ~sniff~ but this time, they made me like this waaaaaahh.....\" she continued crying. Saka picked her up \"Come now Hilly we can fix this, hmm let me try these pills...\" She takes one and instantly becomes hungry. She gourges for the rest of the day and doses off. The next morning...</span></div></div>",
            "created":1181883600,
            "id":416587,
            "title":"Ninja to the Rescue!"
        },
        "1132122122":{
            "author_name":"Ze Rat",
            "choices":[
                "NASA coming to make a Planet Jellobuns",
                "The National Gaurd to ship Hillary out to sea."
            ],
            "content":"<div class=\"\"><div> <span>Sakaki wake up the next morning rather groggy in Hillary's kitchen. \"uhh what happened.. holy shit!!\" Saka was now over 950 pounds and stuck in the kitchen. \"Hilly help were are you?\" Now looking like a walking skeleton Hillary slowly walked into the kitchen and passed out on the floor now looking as if she  weighed only 50 pounds the strangest thing began happening. All the food in the room was being pulled towards her and with in seconds her body errupted in a massive wave of fat! With in the next half hour she weighed 500 megatons and growing! Larger and larger she grew not stopping for a full week. When the last of her flub stopped expanding she weighed in at an easy 1500 Ultratons! She awoke \"Wat the fu.....Saka where are you?\" She was still her small 1000ish pound self now floating on one of Hillary's breasts. \"I'm hear but I hear something, like helicopters!\" It was...</span></div></div>",
            "created":1181883600,
            "id":416589,
            "title":"Things get big!"
        },
        "11321221221":{
            "author_name":"Ze Rat",
            "content":"<div class=\"\"><div> <span>It was NASA with a plan to send Hillary into space as a big fatty planet and to fatten Sakaki up enough  to be her moon. With joy the two agreed and soon Launched into space becoming the first living planet. Without gravity to weigh her down Hillary soon grew larger than Juipiter and Saka only slightly smaller. \"Hehehe Saka I think the sun just started orbitiing us.\" Saka giggled \"Who cares just order more Gain X and Lard I no where near fat enough yet.\" Hillary looked puzzled \"THat doesn't sound like you, you've never been this keen on growing before whats up?\" Over time Saka had become addicted to the gainer and the feeling of being so large. \"Nothings wrong I just NEED more gainer!!!\" As commanded Hillary ordered more gainer for the both of them. Over the next few years the girls kept growing, now each bigger than our solar system the people of earth had moved onto the titanic duo. So time went on our heros growing ever more filling the universe. Thus all of existance knew of their girth.</span></div></div>",
            "created":1181883600,
            "id":416596,
            "title":"To infinity and beyond!"
        },
        "11321221222":{
            "author_id":"featherston",
            "author_name":"Jake Featherston",
            "choices":[
                "Sakaki helps her find food",
                "The Army returns with a shipment of snacks",
                "That growl wasnt hunger, it's another growth spurt starting!"
            ],
            "content":"<div class=\"\"><div> <span>(A/N: I hope the actual JB sees this and the eventual storyline i hope to make from it and thinks it a proper tribute, heh)<br>\r\n<br>\r\nSure enough, the source of the noise was a massive fleet of Chinook heavy lift helicopters, all equipped with huge winches and flying directly toward the mountainous mass of flab thugs that was Hilary. <br>\r\n<br>\r\n\"Uhh...Saka, what's going on here?\" asked the massive lass, as she and her \"smaller\" friend exchanged concerned glances. <br>\r\n<br>\r\n\"Looks like the Army... Hopefully they don't think you're some kind of giant monster, girl!\" She laughed as she said it, but was still a bit worried for her titanic girlfriend and leaned into her tremendous breast as if to take shelter in the deep flab.<br>\r\n<br>\r\n\"Hilary Lang?\" asked a male voice over a loudspeaker, followed by a deafening screech of mic feedback that made both girls wince. <br>\r\n<br>\r\n\"Um... Yes, that's me,\" she replied, her booming, slightly deep voice easily matching the soldier's without even trying-- a testament to her immense girth. <br>\r\n<br>\r\n\"This is General Morel of the US Army! Do not be alarmed, we're not here to hurt you... Quite the opposite, we're actually here to help!\" Hilary and Sakaki both raised an eyebrow... What kind of help could the general mean? He continued before either could reply. \"You see, you've, um... Grown too large for the country, and the President has ordered us to move you out to sea where you'll have more room. You'll be like your own island, or even a continent...\"<br>\r\n<br>\r\nIt took a few moments for the sentiment to sink in, but when it did, both Hilary and Sakaki's fat faces lit up with a look of absolutely glee. <br>\r\n<br>\r\n\"Did you hear that, babe? You're big enough to be your own freaking continent! You've finally made it, Hil, and there's only more room to grow from here!\" Squealing happily, she hugged as much of her gaining partner's squishy breast flesh as she could, while Hilary herself was on the verge of tears of joy. As they celebrated, the slightly bewildered soldiers continued their duty and attached their winches to Hilary, slowly hoisting her monumental form into the air as beginning their flight to the sea. Eventually, they reached their destination, unhooking their living cargo and letting her fall ass-first onto the cold ocean waves, creating huge tsunamis that looked tiny before her.<br>\r\n<br>\r\n\"Thanks guys!\" Hilary exclaimed, wanting to wave but finding herself unable to lift her arm, as it was entirely encased within layers and layers of flab, her fat fingers just barely poking out from the sleeve of blubber that surrounded them. \"Ahh, this is urrrrrp perfect! All the space I need to really let myself go...\" As she finished that sentence, though, an obvious dilemma presented herself-- her country sized gut let out a powerful growl, enough to shake and giggle her mountains of rolls. \"Oh, man...I'm hungry! But what am I supposed to eat out here?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1482210000,
            "id":2252469,
            "title":"The continent of Jellobuns "
        },
        "114":{
            "author_id":"doublel",
            "author_name":"Golden Tiger",
            "choices":[
                "Hilary bloats up to 500 lbs!",
                "Hilary bloats to 600 lbs+"
            ],
            "content":"<div class=\"\"><div> <span>Gulping down her food, Hilary then grins, \"Hey! I'll just get the medicine, saying its for a friend of mine!\" With that, she waddled out of the house and to the nearest drug store.<br>\r\n<br>\r\nLater, she was as happy as can be as she held the medicine in her fat hands.<br>\r\n<br>\r\n\"Oh boy! My answer to true obesity!\" smiled Hilary, before going to the fridge to stuff herself silly. When she felt like one more bite would make her explode, she wolfed down the medicine. Hilary then groaned, \"Oh...suddenly I feel kinda funny...\"</span></div></div>",
            "created":1054962000,
            "id":160892,
            "title":"Hilary's Plan"
        },
        "1141":{
            "author_id":"henrynewton",
            "author_name":"Henrynewton",
            "choices":[
                "Goes to the drug store to buy as much as she can.",
                "You decide"
            ],
            "content":"<div class=\"\"><div> <span>The feeling of growth tickled across her body, as she felt herself swell with fat all over the place. She rubbed her enlarging body disbelievingly with her plump hands. When her growth slowly cruised to a stop, she was 500 pounds. She smiled, as she poked her belly. In went satisfyingly far in. She then looked at the wonder drug that did this to her. She then decided to...</span></div></div>",
            "created":1074056400,
            "id":184961,
            "title":"It Starts"
        },
        "11411":{
            "author_id":"jedislayer",
            "author_name":"jedislayer",
            "choices":[
                "Take one pill to experiment",
                "Screw it!  Take the whole bottle!"
            ],
            "content":"<div class=\"\"><div> <span>Hillary ran out of her house(or rather she waddled, more slowly than last time given she was 100 pounds heavier) and back to the drugstore.  She whipped out her mother's credit card at the counter, spending roughly $800 on 20 bottles full of this new wonder drug.  Each bottle had 100 pills in it.  She was so ecstatic about the possibilities that lay ahead of her, she wasn't even aware of the counter guy staring at her butt crack on the way out the door.<br>\r\n<br>\r\n<br>\r\nWhen she got back home, Hillary layed out all 20 bottles of medicine right in front of her, picked one up and read the label.  After looking at the label, Hillary realized that the bottle she had bought before had been a weakened version.  This was the full power stuff.<br>\r\n<br>\r\n\"For every 100 pounds of weight, each pill will add 10 pounds.  Warning, this amount will increase if subject is over 300 pounds.  If more than one pill is taken at once, each pill will process itself through the body separately.\"<br>\r\n<br>\r\nHillary took a moment to think.  She was 500 pounds now, so just 1 pill would make her gain at least 50 pounds, and the label said it would be more since she was over 300 pounds.  She was a little uneasy about swallowing a whole bottle with that kind of potency.  What should she do?</span></div></div>",
            "created":1156741200,
            "id":342777,
            "title":"Weighty Decisions"
        },
        "114111":{
            "author_id":"jedislayer",
            "author_name":"jedislayer",
            "choices":[
                "Take one more pill, see what happens.....",
                "Down the whole bottle!!"
            ],
            "content":"<div class=\"\"><div> <span>\"Eh, better just start with one and see what happens,\" she thought to herself.  <br>\r\n<br>\r\nSo she stripped to her underwear so as not to ruin her already incredibly tight clothes.  She then popped the cap off the bottle, grabbed a pill, and ate it.  What happened next was astounding.<br>\r\n<br>\r\nAlmost instantly, Hillary could feel a tingling sensation coursing through her entire body.  It felt really good, too.  As the tingling grew stronger, she started to swell with new fat.  Her impressive belly grew wider and larger, lowering itself slightly more towards the floor and pushing her growing boobs upwards, partially blocking her lower field of vision.<br>\r\n<br>\r\nHer ass began growing at a slightly greater pace then the rest of her, making her already overly tight panties feel more like an  undersized thong with each passing second.  Her thighs followed suit, quickly becoming as thick as whole people, and then some.<br>\r\n<br>\r\nHer breasts did receive a good portion of the new weight, but not nearly as much as her monumental ass had gotten.  Her breasts grew until they were about the size of basketballs, blocking a good portion of her lower vision.<br>\r\n<br>\r\nAfter about a minute and a half, it stopped.  Hillary took a moment to feel her new body.  She was absolutely elated that she had reached such a size! But she wondered how much she weighed after just one pill, so she waddled over to her industrial sized scale in the next room, and it read.....600 pounds.  A gain of 100 pounds from just one pill!  This was great, Hillary still had about 2000 pills left to take!  But how to go about doing it?</span></div></div>",
            "created":1156741200,
            "id":342805,
            "title":"Heavy Duty Fun"
        },
        "1141111":{
            "author_id":"curiousgorge55",
            "author_name":"Clayton",
            "choices":[
                "One more pill...",
                "The whole thing!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She downed one more pill.<br>\r\nShe swelled a lot more... she swelled and swelled. She looked at the mirror to see her new body. 750 pounds.</span></div></span></div>",
            "created":1376974800,
            "id":1649058,
            "title":"Hilary can get bigger..."
        },
        "11411111":{
            "author_id":"curiousgorge55",
            "author_name":"Clayton",
            "choices":[
                "Hilary gained 1000 pounds",
                "She grew 60 inches bigger"
            ],
            "content":"<div class=\"\"><div> <span>She takes one more pill and swelled. Hilary weighed 890 pounds. With that, she took another a minute later and swelled again. 1360 pounds. Eventually Hilary had to go outside. She downed another pill and swelled up to 2308 pounds. Eventually she could not stand anymore. She took 12 pills. 4000 pounds. She swelled and swelled, 4978 pounds to 7000 pounds until eventually...</span></div></div>",
            "created":1376974800,
            "id":1649062,
            "title":"One more pill..."
        },
        "1142":{
            "choices":[
                "rushed down to the store to buy more boxes",
                "you decide"
            ],
            "content":"<div class=\"\"><div> <span>Her stomach rumbled and she clutched it in her pudgy hands. The it started, the fat rapidly appearded on her, her breasts swelling along with her belly, thighs, butt and hips. Her arms swelling up and a new chin started to appear.<br>\r\n<br>\r\nWhen the growth stopped, she took a look at herself. Her belly now stuck out a good few feet and her breasts lay on top of it, large round soft breats that almost blocked her view, her ass was almost twice as wide as it was before, along with her massive thighs and hips.<br>\r\n<br>\r\nShe gave herself a poke, almost taking in her whole finger as she sank it in to her giant soft belly. She giggled at this and took a look at the medicine box and...</span></div></div>",
            "created":1080968400,
            "id":193774,
            "title":"Wonder Pills"
        },
        "12":{
            "author_name":"alensmith",
            "choices":[
                "he come's over",
                "another phone call"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>just then she get a phone call from her boyfriend. a nice young black man how she realey loves. he tell's her that he found a add in the paper a new whight gain drink .</span></div></span></div>",
            "created":1061442000,
            "id":170684,
            "title":"love call's"
        },
        "121":{
            "author_name":"NinjaGirlSakaki",
            "choices":[
                "Time to binge!",
                "Time to go boy-hunting!"
            ],
            "content":"<div class=\"\"><div> <span>Well, long story short, he was shocked by the immense lady that opend the door. Having had not seen him in a good long while, and having been rather thin at last they met, Hilary though that stuffing herself to her current size was what he wanted. What he meant was just a little extra curve, not the sort of huge that she was.<br>\r\n<br>\r\nIt didn't go over very well and she found herself rapidly dumped. While it was shocking for about the first ten minutes, she thought about the entire situation and realized that it was no big loss. She got to her mirror and looked her hot bod over. She already accounted for one and a half more people anyway!<br>\r\n<br>\r\nSo now it was time for her next move...</span></div></div>",
            "created":1143954000,
            "id":310231,
            "title":"That Jerk!"
        },
        "1211":{
            "author_name":"Ze Rat",
            "choices":[
                "Main courses!",
                "Sweets and Desserts!"
            ],
            "content":"<div class=\"\"><div> <span>In disgust she sits down and flips thru the channels when an ad caths her eye. \"GRAND OPENING CELIBRATION!\" the announcer blared. \"Today only a free meal at the new Country Buffet!\" Shock Hillary quickly got up and rushed down town. \"Oh man free buffet this is awesome, jsut what I need to get that loser out of my mind.\" She sits down and orders the free buffet, with a big grin she dove into the buffet. \"Where to start?\"</span></div></div>",
            "created":1144040400,
            "id":310338,
            "title":"The new resteraunt"
        },
        "12111":{
            "author_id":"jellobuns",
            "author_name":"Jellobuns",
            "choices":[
                "Julie shows her how its done",
                "Julie slips something into her drink"
            ],
            "content":"<div class=\"\"><div> <span>People were of course shocked to see such a large girl wobble in but she was by far the largest woman there. Much to her amazement there was another, much larger woman standing next to her at the main courses. She was impressed that a woman so large could still stand, thick with hanging rolls of fat as she was. The woman looked over in amusement. \"You've got a good start, little girl.\"<br>\r\nHilary gulped nervously as she watched her sway across the buffet, scooping up three heavy plates. She tried to do the same as the woman shook with each step towards her place. Hilary couldn't help but admire such massive beauty, her face round and lovely, and her body much the same. She took a few seats and beckoned the obese teenager over. \"I'm Julie,\" smiled the massive woman. \"You look like you came ready to eat.\"<br>\r\nHilary blushed, as she sat in her loosest pants, ready to let her belly bulge as she ate. Her shirt was a bit tighter, because she always loved seeing her belly push out of the fabric as she stuffed herself. \"I'm Hilary, and... yeah, I did. Is it that obvious?\"<br>\r\nJulie reached over and patted the round dome of Hilary's belly. \"I have an eye for these things. Show me what you got, kid.\" The girl nodded happily and got eating<br>\r\n<br>\r\nThree plates later, Hilary sat back, breathing deeply as she felt her pants starting to get tight around her packed middle. \"Whew... good start, eh?\" she smiled as she took a long drink of her soda. \"What do you think about that, Ms. Julie?\"<br>\r\nThe much heavier woman laughed and...</span></div></div>",
            "created":1240808400,
            "id":682160,
            "title":"Main courses!"
        },
        "1212":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "heft herself down to the playing fields...",
                "spread her search on the web..."
            ],
            "content":"<div class=\"\"><div> <span>Hillary found herself rapidly dumped. While it was shocking for about the first ten minutes, she thought about the entire situation and realized that it was no big loss. <br>\r\n<br>\r\nShe went over to her mirror and looked over her hot bod. She already accounted for one and a half more people anyway!<br>\r\n<br>\r\nSo now it was time for her next move...time to go boy-hunting!  She grabbed herself a snack while she considered where to find a boy who would love her - all of her!  She'd noticed that some black guys seemed to like bigger girls - that was why she'd gone out with her ex-jerk in the first place!  And there were lots of black guys on the school teams - the biggest were on the football team! Maybe she should go spot a practice or two?<br>\r\n<br>\r\nOn the other hand, on-line was a great way to find people these days - and she could find out more about a guy before they met that way.  <br>\r\n<br>\r\nHillary decided to...<br>\r\n<br>\r\n</span></div></div>",
            "created":1156827600,
            "id":342992,
            "title":"Where to go boy-hunting?"
        },
        "12121":{
            "author_name":"NinjaGirlSakaki",
            "choices":[
                "Finds a girl to help her out",
                "Finds a machine to help her out"
            ],
            "content":"<div class=\"\"><div> <span>The more she considered going down to the football field to pick up a new guy, the less she felt that it was a good idea. Honestly, most jocks were only after one thing, and since she hadn't given it up before, she wasn't gonna do it this time. <br>\r\n<br>\r\nSo maybe she should concentrate more on her own body instead of getting another one to warm up to. She hopped over to her computer chair, hearing it creak quite badly from her squishy bulk resting in it. Her flabby body starts to mush up around her and she notices a bit more trouble reaching the keyboard than she used to. \"Awesome,\" she says, pleased with the results. \"It's paying off again!\" <br>\r\n<br>\r\nSo she started to search for someone or something that'd help her with her expansive goals. The internet is a vast and interesting place, so she wasn't terribly surprised when she...</span></div></div>",
            "created":1159246800,
            "id":348855,
            "title":"Hunting for Mass"
        },
        "12122":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "dark-skinned guys...",
                "fat boys..."
            ],
            "content":"<div class=\"\"><div> <span>On the other hand, on-line is a great way to find people these days - and she could find out more about a guy before they met that way.  Her choice was obvious - jocks were often only into one thing with female fans, anyway, and Hilary wanted more than that!  <br>\r\n<br>\r\nHilary hefted her bulky self back to her computer, making sure to snag a bag of snacks along the way.  She dropped into her unusually large and comfy computer chair, hearing it 'whiffle' slightly in protest as it settled under her avoirdupois.  The more Hilary thought about it, the more she realised that she needed to focus on a narrower band of guys - artsy or techie types, maybe nerds, maybe geeks, certainly guys who were a little lonely and needed a friend - after all, if their tastes ran to fat girls, they were going to be outside the mainstream of teenagedom.  She's look for a shy boy, perhaps - maybe a guy who liked to cook?  One thing, too, was what the guy looked like - it was a preference thing, but Hilary found herself attracted to...<br>\r\n<br>\r\n</span></div></div>",
            "created":1170219600,
            "id":378110,
            "title":"Looking for love in all the web places"
        },
        "121222":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "fat, but not huge...",
                "a little fat is good, a lot of fat is better, bigger than her - BONUS!"
            ],
            "content":"<div class=\"\"><div> <span>One thing, too, was what the guy looked like - it was a preference thing, but Hilary found herself attracted to fat boys...generous tummies, big appetites, lots of smoothly rounded padding.  Most teenage boys looked angular to her, like some piece of modern sculpture, and she like curves.  Of course, some would say that this was because she was one rounded piece herself!  Hillary starting looking for a fat guy her own age - ...  <br>\r\n <br>\r\n</span></div></div>",
            "created":1198040400,
            "id":477281,
            "title":"Hillary's preference"
        },
        "122":{
            "author_id":"theking101",
            "author_name":"Chase",
            "choices":[
                "Someone trying to sell appetite stimulants ",
                "Her fattest friend",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Another call, but by who</span></div></span></div>",
            "created":1520404500,
            "id":2461604,
            "title":"another phone call"
        },
        "13":{
            "choices":[
                "Legs",
                "Butt",
                "Breasts",
                "Belly",
                "Whole body"
            ],
            "content":"<div class=\"\"><div> <span>Hilary was broken from her train of thought when she heard a knock on the door. Putting her snack down, Hilary waddled to the door and opened it. Nobody was there, but there was a package. It was three and a half feet tall, and about a foot wide. Oddly enough, it was addressed to Hilary.<br>\r\n<br>\r\n-----<br>\r\n<br>\r\nAfter hauling the package inside, Hilary removed the contents. They were an airtank(measuring about three feet in height), two suction cups each with a small plastic tube inside, two long hoses and one short hose, and some yellow canister the size of a fire extinguisher that was filled with a liquid of some kind. The canister had a envelope attached to it, which Hilary opened. Inside were a card, some type of order form, and instructions.<br>\r\n<br>\r\n\"Thank you for trying our new product!\" The card said. \"Inside this canister is formula that turns itself into fat. Right now, administering it through the bloodstream via air is the only way it works, but we're sure you'll stay with us to try the newer versions that are down the road!\"<br>\r\n<br>\r\nHilary was more than skeptical. Still, she read the instructions.<br>\r\n<br>\r\nStep 1: Connect tank and canister with short hose.<br>\r\nStep 2: Attach long hose to canister. Place the end of the hose on desired body part. Use the adapter to use both hoses. Consult or guide(on other side)to see where to attach the hose(s).<br>\r\nStep 3: Set both tank and canister on same setting(ie: tank setting 1, can, setting 1, etc.) make sure to set the canister first.<br>\r\nStep 4: Open the airflow, inflate, and get fat!<br>\r\n<br>\r\n<i>Adapter?</i> Hilary thought. <i>What adapter?</i> Looking through the box again, Hilary found a Y-shaped piece of metal, obviously the adapter. Hilary wondered how she missed that the first time she looked inside the box. She bent over and picked up the piece.<br>\r\n<br>\r\n-----<br>\r\n<br>\r\nWhile Hilary didn't believe a word from the card, she was interested with the prospect. After some thought, Hilary decided that since nobody would see her, she could at least try the stuff out. She set everything up, except what to \"infat\" first.</span></div></div>",
            "created":1061787600,
            "id":171018,
            "title":"pnuematic fat"
        },
        "131":{
            "choices":[
                "Belly",
                "Breasts"
            ],
            "content":"<div class=\"\"><div> <span>she read the instructions and took the hose in hand.<br>\r\n\"They call me Jellobuns now, wait til im done with this baby\" she said to herself and with that she stuck the hose into her thighs and turned the machine on.<br>\r\n<br>\r\nThe machine whirred into gear and started pumping. The fat on her legs started to multiply and her thighs swelled outwards at a slow but steady pace. Her knees became even more pudgy than before and her thighs billowed out like balloons, the fat piling up on them ver nicely. She then noticed that due to the ammount of fat now added to her, she was getting a little taller, as the bulk of her massive soft thighs increased. She hit the machine off and took a look at herself in the mirror. The rest of her body was the same as it was except for her thighs and legs, which were majorly oversized compared. Her hips seemed to flare out dramaticly as it lead to her massive thighs.<br>\r\n<br>\r\n\"hmmm, its great and all, but i look a little odd. How about something else\"<br>\r\n<br>\r\nShe unplugged the hose and then placed it on her...</span></div></div>",
            "created":1080968400,
            "id":193780,
            "title":"Mega Jellobuns"
        },
        "1311":{
            "author_name":"Assassin",
            "choices":[
                "Continued with her thighs on a higher level",
                "Stopped to do something else"
            ],
            "content":"<div class=\"\"><div> <span>Hilary unplugged the hose from her thighs and was about to insert it into her belly when she paused. She looked down and examined her new legs. They were so soft and fatty and beautiful. She gave her right thigh a light slap and watched it jiggle, this in turn made her giggle lightly.<br>\r\n<br>\r\nThen she stuck the hose back in and turned the machine on, this time up to level 7. The machine began pumping the liquid into her thighs.<br>\r\n<br>\r\nHer already oversized thighs began growing again, growing wider and wider, slowly making her taller as well. The fat forming around her thighs was starting to sag down over her knees, but she was loving every moment of it, carressing her growing legs, giving them a poke now and thn, each time being able to sink her finger in further than before. After a minute she guessed she had grown to about 6' and a half foot tall from the new fat on her thighs, which were now of gigantic proportions. Each thigh was about as wide as her belly, if not more, they shook lightly as the machine continued to pump the liquid in, giant creamy fat thighs.<br>\r\n<br>\r\nShe stopped the machine for a second and took a good look at herself.<br>\r\n<br>\r\n\"wow, check these babies out\" she said looking at them lovingly.<br>\r\n<br>\r\nShe moved her massive right leg round and took a little step, finding it harder to move.<br>\r\n<br>\r\n\"hmmmm, what should i do now...?\"</span></div></div>",
            "created":1081141200,
            "id":194071,
            "title":"Wait a sec..."
        },
        "13112":{
            "author_id":"jellobuns",
            "author_name":"Jellobuns",
            "choices":[
                "Got Wedged in Her Doorway",
                "Decided to Blow Up Even Fatter!"
            ],
            "content":"<div class=\"\"><div> <span>She took stock of her situation as she tried lifting her gigantic legs so she could change out of her now full-to-bursting jeans. With her first step, they split off of her, revealing her gigantic tan thighs. She almost cared that her legs were destroying her jeans but the sensation of her now titanic legs and rear bouncing and quaking as she walked towards her closet. She looked at herself, noting that her belly now seemed small. In fact the rest of her was far far too small for her liking. She figured she had the legs of an 800 lb woman, but they were completely smooth, like massive balloons. <br>\r\n<br>\r\nShe took a breath as she put her hands on her gigantic hips, noticing that she could barely reach either side with her hands. She unbuttoned what was left of her low-riding jeans and tossed the scraps aside and wriggled into her knee-length skirt, amazed at how far out  her butt stuck out. The skirt used to dust the ground but now it was vice-tight and squeezed her legs together. It gave her an attractive waddle as she tried to figure out what to do with herself, putting a nice pair of heels on with some extreme difficulty. It was difficult recentering her balance as her butt stuck out at least 5 feet behind her, jiggling like a balloon of lard. She looked at her new body in the mirror and tapped her double chin. \"Well well... what to do...?\" <br>\r\n<br>\r\nShe concluded that she could go on out and stuff her face, and show off to her other fat girlfriends.<br>\r\n<br>\r\nOr she could balloon up more...</span></div></div>",
            "created":1241240400,
            "id":685122,
            "title":"Testing Her Infattened Body"
        },
        "132":{
            "author_name":"jellobuns",
            "choices":[
                "Play with the settings",
                "Blow up something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, what the heck? Let's give my big old rear a little air.\"<br>\r\nShe consulted the guide, found out that she only had to stick herself in the rear with both hoses and they'd attach. She looked at the settings after hooking them up and went with 1, the lowest setting. <br>\r\n\"Well, if it works then I'm fatter and if not, then... well, I've cleaned the seat of my pants.\"<br>\r\nShe turned it on and felt her glutes tighten. Her silk panties gave out within minutes and she felt the seams of her pants contract. Her narrow eyes widened and she felt her balance start to mess up. She turned it off, and almost fell over. She looked behind. She added another 6 inches on either side! She rapidly evened out her legs, now looking more bottom heavy than ever. She waddled over to the scale, her gait yet slower thanks to her fattened legs and rear. She looked at the mirror arrangement so she could check her size. She had gained 50 lbs. <br>\r\nHilary was astonished. 50 lbs from that little thing? And with so little? She could be... <br>\r\nShe got a devilish grin on her face.<br>\r\n<br>\r\nWhat next?</span></div></div>",
            "created":1074834000,
            "id":185959,
            "title":"Why not?"
        },
        "1321":{
            "author_id":"henrynewton",
            "author_name":"Henrynewton",
            "choices":[
                "-the choice is yours-"
            ],
            "content":"<div class=\"\"><div> <span>She happily noticed that the setting went up, in fact, all the way to eleven...apparently, it had been made by a fan of the film \"Spinal Tap\"...and so, the only question was, what to set it to? After some careful consideration, she came to a decision, and turned it up to--</span></div></div>",
            "created":1075093200,
            "id":186205,
            "title":"ELEVEN"
        },
        "13211":{
            "choices":[
                "She hits the machine up to Level 11",
                "she reaches for the hose to infat another part of her"
            ],
            "content":"<div class=\"\"><div> <span>she grinned as she turned the dial on the machine from 1 to 7. the machine made a louder whirring noise and soon it started pumping again, this time it was much more powerful.<br>\r\n<br>\r\nThe force of the fluid pumping down the hose into her butt shook her, making her body shake lightly. Her buttocks swelled with a great force almost imidiately. They swelled faster and faster, she felt her buttocks as they grew, squishing them between her fingers as they continued their growth<br>\r\n\"aaaaah\" she moaned, blushing some, she was enjoying this very much. Her ass was now the widest part of her. Her butt cheeks were each almost as wide as she was to begin with, they sagged down to the back of her knees and stuck out a good 4 feet now. She fell back and sat on her pillow-like ass, feeling it swell more underneath her.<br>\r\n<br>\r\nLooking over at the machine she reached over, just managing to grab it and pulled it nearer to her. She switched the machine of and took a good look at what she had become. Her ass was immense now,  her ass must have been a good 6 foot wide now and 4 foot out. Her feet could only just touch the ground as her ass had raised her up just over a foot or so. She smiled as she gave her butt another squish, then....<br>\r\n<br>\r\n</span></div></div>",
            "created":1080968400,
            "id":193770,
            "title":"Now thats what i call a butt"
        },
        "1322":{
            "author_id":"henrynewton",
            "author_name":"Henrynewton",
            "choices":[
                "Belly",
                "Breasts"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She attached it to her...</span></div></span></div>",
            "created":1079845200,
            "id":192520,
            "title":"Choice"
        },
        "133":{
            "choices":[
                "turned it off and unplugged the hose",
                "turned it to a higher setting"
            ],
            "content":"<div class=\"\"><div> <span>Hilary attached the adapter onto the end of the hose and each end of the adapter onto her breasts. She hit the switch and the machine whirred into action.<br>\r\n<br>\r\nHer already fat, plump breasts started to swell, bigger and bigger, her already tight top straining to contain the large orbs of expanding flesh.<br>\r\n<br>\r\n\"whoa! they are getting pretty big now\" she said as her breasts now swelled up past her nose, impossibly round and impossibly large.<br>\r\n<br>\r\nshe reached down to the machine and....</span></div></div>",
            "created":1080968400,
            "id":193768,
            "title":"Bust!"
        },
        "1332":{
            "choices":[
                "Keeps the machine going",
                "Stops the machine to do something else"
            ],
            "content":"<div class=\"\"><div> <span>she reached down and turned the setting from 1 up to 5, the machine whirred louder and began pumping more of the fluid. \"Alright, lets see what this thing can do\" she said to herself.<br>\r\n<br>\r\nThe fluid rushed into Hilary's breasts and started to fill them. The swelled and grew, larger and heavier. The grew up past her eyes and blocked her view in front of her. They started to get quite big now, already resting on top of her large belly, her breasts started to spill off the sides, though still in their round form caused by her fit-to-burst top. The neck of her top had torn down, revealing a mass of cleavage in her giant fat breasts. They started to get so big they were growing down, over her belly and making it harder for her to stand up.<br>\r\n<br>\r\n\"whoa, nearly fell down there\" she said recovering from wobbling.<br>\r\n<br>\r\nShe then...<br>\r\n<br>\r\n</span></div></div>",
            "created":1080968400,
            "id":193782,
            "title":"Massive Bust"
        },
        "13321":{
            "choices":[
                "Turns the machine to a higher level O_O",
                "Does something else"
            ],
            "content":"<div class=\"\"><div> <span>despite finding it increasingly difficult to stand up straight due to her oversized boobs, she left the machine to carry out its purpose.<br>\r\n<br>\r\nHer breasts were becoming very large, giant balls of fat sloping down her large belly, still retaining their round form. She could see the fat on them ripple as each pump of the fluid from the machine entered, making them a little bigger each time.<br>\r\n<br>\r\nHilary couldn't keep them up anymore and she fell forward, landing with a thudd on top of her mammoth breasts. \"This is better\" she said as she rested on top of them as they grew.<br>\r\nThey were getting rediculously huge now, each was the size of an earth ball, a little bigger than her belly was now, which had almost been englufed by them. She lay on top of them, squishing the fat and hugging it, relishing the feeling of growing huge, bigger than anyone.<br>\r\n<br>\r\nShe snapped out of her trance as she felt her feet touch the floor, her breasts had gotten much bigger, now almost as tall and as wide as she was and still growing, bringing her closer and closer to being upright again. \"oh wow!\" she said, amazed by how big they'd become and she hugged and squashed her massive breasts, bringing up her large fatty thigh and slapping it into her breast, digging her heel into her breast.<br>\r\n<br>\r\nwhat happens next?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1081054800,
            "id":193913,
            "title":"The biggest breasts ever!"
        },
        "134":{
            "choices":[
                "she turns the machine up a level",
                "she unplugs the hose and goes for another part"
            ],
            "content":"<div class=\"\"><div> <span>Hilary giggled slightly as she grabbed a fold on her belly.<br>\r\n\"looks like its time for my this baby to grow\" she said as she inserted the hose into her belly and hit the machine on.<br>\r\n<br>\r\nThe machine began pumping her belly with the fluid and the results started showing.<br>\r\nHer stomach began to swell, more and more fat pumping into it, another set of rolls were starting to form. She giggled happily as she grabbed her swelling gut with her pudgy hands, kneeding it as it swelled<br>\r\n\"Aaah this is great\" she said<br>\r\n<br>\r\nHer belly was now bigger, her new set of rolls were done and a new set were on their way, it stuck out a good couple of feet from her and it hung down further than before, and it was still going.<br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1080968400,
            "id":193769,
            "title":"Bigger is Better"
        },
        "1341":{
            "choices":[
                "Turns the machine to full power!",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>she reached down to the machine with her pudgy hands and turned the machine up to level 6.<br>\r\n<br>\r\n\"woohoo\" she cried \"here we go\" as the machine started pumping more of the fluid.<br>\r\n<br>\r\nHer belly started growing rapidly, increasing in size, more and more fat forming. She grabbed her belly and kneeded it, pushing her hands into her expanding belly, each time she was able to sink her hands further into her fat, soft belly.<br>\r\n<br>\r\nHer belly now reached the ground and stuck out about 5 feet, it had also caused her hips and thighs to plumpen as her belly grew wider. Her breasts were being pushed up into her face as her belly grew.<br>\r\n<br>\r\n\"oh wow, this is so good\" she moaned, blushing a little. Her belly still expanding was now out 6 feet infront of her and still swelling.<br>\r\n<br>\r\n\"what to do now?\" she thought to herself</span></div></div>",
            "created":1080968400,
            "id":193785,
            "title":"Belly-Love"
        },
        "13411":{
            "choices":[
                "She continues to grow even more",
                "She takes out the hose to do something else"
            ],
            "content":"<div class=\"\"><div> <span>Hilary smiled and turned the machine to level 11, the highest level. The machine whirred loudly and suddenly blasted the fluid down the hose and into her belly.<br>\r\n<br>\r\nHer belly instantly started to grow, and quite quickly. Roll after roll appeared as her belly grew, now already touching the ground it was creaping across the floor infront of her as well as spreading out sideways. Her breasts were being pushed further up into her face as her belly grew upwards.<br>\r\n<br>\r\nUsing all her strength, Hilary rolled forward onto her belly, resting on top of it as it continued to grow. It was now as large as she was now and growing rapidly. Fat spilling out everywhere, more and more rolls appearing, her belly slowly raising her up as it grew. She squished and massaged her gigantic gut as it swelled, blushing in the pleasure it brought her.<br>\r\n<br>\r\n</span></div></div>",
            "created":1081054800,
            "id":193941,
            "title":"An even bigger belly"
        },
        "135":{
            "choices":[
                "Turned the machine up some levels",
                "took the hose from her mouth"
            ],
            "content":"<div class=\"\"><div> <span>Hilary could not decide on which part to infat first, she was too overwhelmed by the thought of being huge. She looked at the hose and thought \"hmm... i wonder if...\" as she placed the hose in her mouth.<br>\r\n\"Here goes\" she said to herself as she switched the machine on and the fluid began pumping up the hose and into her mouth.<br>\r\n<br>\r\nWhen the fluid touched her tounge she was amazed by the taste, it was so sweet and heavenly, she guzzled it down as fast as she could. While she was drinking she had a look around her body for signs of change, and sure enough there was. It seems all of her body was swelling at a slow pace. Her belly was slowing creaping outwards, her breasts swelling slightly as they lay on top of her gut, her butt and hips were expanding and her thighs were plumping up nicely. She raised her arms in joy, noticing her already fat arms were bigger already.<br>\r\n<br>\r\nShe stood there while her entire body swelled, enjoying it all as it happened, squishing her self all over.<br>\r\n<br>\r\nShe looked again and noticed she was quite a bit bigger than before. Her breasts were more plump and round, she gave them a squeez, loving the feeling of her breasts flow in between her chubby fingers. Her belly was quite big and seemed to take alot of the gain, it stuck out further and hung a little lower than before. She examined her ass and hips, carressing them and feeling the soft fat. he reached down to the machine and...</span></div></div>",
            "created":1080968400,
            "id":193773,
            "title":"What the heck, lets do them all!"
        },
        "1351":{
            "choices":[
                "Ignore the option and just gain the fat.",
                "Try to get that height, too."
            ],
            "content":"<div class=\"\"><div> <span>She decided to turn up the machines level, and she noticed an interesting option. This option would allow her to gain some height as well. <br>\r\n<br>\r\nThis, however, was optional and she could keep on the road that she has taken. But it might be interesting to become taller too, making her even more of a behemoth...</span></div></div>",
            "created":1080968400,
            "id":193818,
            "title":"The option for added height."
        },
        "13511":{
            "choices":[
                "Turned the machine up to full power",
                "Take out the hose to do something else"
            ],
            "content":"<div class=\"\"><div> <span>She ignored the hight option, focusing on getting fat was all that she wanted. She turned the machine up to level 4 and guzzled the fluid as more of it was pumped out.<br>\r\n<br>\r\nThe taste from the fluid was so good, she was almost crazed by it, drinking and gulping it down as fast as she could, and as she drank, that fat poured on. Her belly grew more and more, new rolls of soft fat were forming, adding more girth to her giant belly. Her butt was massive, sagging down to her thighs and sticking out a good 5 feet, the fat surged outwards, bringing her hips nearer to the size of her giant buttocks. Her breasts were large balls of fat, pulsating with each pump from the machine, growing bigger by the second. Hilary fell back and landed softly on her massive rear. Her giant fatty thighs swelled and rippled as she sat there, taking in all the machine offered, her face now much fatter had four chins and a new one forming, her cheeks were also alot puffier.<br>\r\n<br>\r\nShe leaned over, with great difficulty and grabbed the machine with her fat hands, she then...</span></div></div>",
            "created":1081054800,
            "id":193928,
            "title":"To be the Fattest"
        },
        "135111":{
            "author_name":"Ze Rat",
            "choices":[
                "Another mysterious delivery arrives.",
                "She gets a myterious letter."
            ],
            "content":"<div class=\"\"><div> <span>She struggles to to reach the machine's dial, when she finally reaches it her pudgy fingers fiddle with it unknowingly she breaks the dial sending it into a frezy. It pumps her with more and more of her new favorite snack. Faster and faster the machine litterally inflates her with fat. Her Belly now cascades across her thighs and touches te far wall.Her ass pushes pack to the other wall and raises her up into the air. \"Oh my this is amamzing!!!\" Suddenly she hears a creeking sound as the floor bends under her. \"Oh no the floor is going to give way! I better turn it off.\" No matter how hard she tries she can't reach the dial. \"Aww damn i can't reach it my arms are to heavy to lift!\" Shorty the floor gives way and she falls with an earth shattering thud into the basement. Because of her massive butt her head is still above the floor line and rising fast. She keeps growing until she bursts through the ceiling of the living room and pours out into the next room. her rolls pushing outward break down all the walls and soon the house is completly gone except for a section she has wedged her breasts in to keep her decency, but that didnt last long. As the tank gave its last drop the last of the house shattered letting her now garage sized breasts cascade down her massive belly which poured into the street. <br>\r\nAs the last drop fell down her throat the hose fell from her mouth. Her head which was now permenenlty facing upwards from the massive amount of fat around her neck. She giggled \" My neck must weight 400 lbs. alone! Now what do I do?\" <br>\r\n<br>\r\nThen.....</span></div></div>",
            "created":1143867600,
            "id":309902,
            "title":"Hillary and the  House!"
        },
        "1351111":{
            "author_id":"curiousgorge55",
            "author_name":"Clayton",
            "choices":[
                "She stopped at 45 ft.",
                "She stopped at 99 feet."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hilary had another delivery coming. it was 50 ft. tall. Hilary now has a lot of growth additive and guzzled it down. She felt signs knowing she was getting a lot more huger!</span></div></span></div>",
            "created":1376974800,
            "id":1649055,
            "title":"Another mysterious delivery arrives."
        },
        "1351112":{
            "author_name":"Ze Rat",
            "content":"<div class=\"\"><div> <span>Just as the last few tons laid onto hillary's body a small white emvelope floated down from the sky. As it came near her face it poofed into a small cloud of smoke and a voice said \"Hillary, you have been invited to join a the Secret Order of Gluttons. A team of Helicopters will be coming for you shortly.\" Just as the voice quieted a team of black hawks appeared from the clouds and rasied her into the air. After a few hours Hillary noticed what appeared to be several Islands grouped to gother in a ring, upon closer inspection, they wher einfact other women who like her had grown massivly fat.<br>\r\nThe young red head in the middle of the ring greeted her withe hardy hello and explained that she had been choosen for a seat on the counsel because of her achievments in weight gain. And there it was, Hillary had achieved immortaltiy in Legend as one of the great members of the Order of Gluttons. Living the rest of her liffe happily adrift with the rest of the order somewhere in the pacific ocean.</span></div></div>",
            "created":1161147600,
            "id":353686,
            "title":"A Happy ending"
        },
        "13512":{
            "author_id":"link2hyrule",
            "author_name":"The Ultimate Hylian",
            "choices":[
                "Keeps going until she fills her apartment",
                "Moves to a better locale so as not to impede her growth."
            ],
            "content":"<div class=\"\"><div> <span>Hilary decides, what the heck, if she's going to be big, she may as well go all the way.  She flips the switch for height and waits.  After a whiile she notices everythings sinking except her.  She looks down as best she could and realizes she's just getting taller.  She also notices that the machine fixed it so that she would remain at the same fat size as she got taller.  She grew to about nine or ten feet and decided that was enough for now and flipped back to just fat.  Again she started growing outwards as she got fatter and fatter.</span></div></div>",
            "created":1137387600,
            "id":296107,
            "title":"Land of the Giants"
        },
        "135121":{
            "author_id":"dra-ma",
            "author_name":"Mountain Dragoon",
            "choices":[
                "Grow more!",
                "Nah... I am big enough for the moment"
            ],
            "content":"<div class=\"\"><div> <span>Hilary enjoys the unbelieveable growth of her massiv body. Even more fat spread out of her body and all parts of her body grow bigger and bigger. She looks down to the canister with the yellow liquid and noticed that its even nearly full. \"This stuff is really effective!\" she thought as see look at the even smaller getting room. <br>\r\n<br>\r\nOnly a few moments later Hilary sits in her living room and start to reach the ceiling with her head. \"Wow... I grow even bigger! My appartment is now much to small for me\" she thought and continue swallow down the liquid witch spread out of the hose. With every second who passed her huge body become more enourmous. Her legs and arms are big as tree trunks and nearly long as the comlete living room. Even more fat appears on her belly and he grow bigger and becomes wider. Even more of Hilarys vision to the ground started to get blocked of her swelling breasts. They start to swell to the size of Basketballs as the streched her clothes to the maximum nad rip them apart. Then they started to grow even faster to the gigantic size of beachballs, her elastic bra hasn't a chance to hold her giant and heavy chest and snapped away. Instandly her huge and naed breasts fall down and landed on the top of her fatty belly.<br>\r\n<br>\r\n\"Now I am bigger than ever other human who ever live! This is wonderful!\" she tought as her couch started to disappear under her expanding butt. But then she pulled out the hose out of her mouth to snap for air. She take a few deep breaths and look at her new body. She stopped at the right moment, becourse she already fill ou her complete Apartment and only a little more space is left.<br>\r\n<br>\r\nHilary looks happily to her complete and start to squeeze her belly to feel her supply fat. \"Its so soft and wobbly\" she say and then sie grap for her breast and start to lift them up and down. \"And my breast are so soft too and such kind of heavy\" she say and smile. Then she caress with her hands from her breasts down to her hips. But then her view hits the Canister and the Airtank from her little helper. <br>\r\n\"hmm maybe I should grow a little bit more to have become more beautifuller?\" she thought and her smile changed to a evil smile.</span></div></div>",
            "created":1158901200,
            "id":348186,
            "title":"Hilary getting huge!"
        },
        "1351211":{
            "author_id":"curiousgorge55",
            "author_name":"Clayton",
            "choices":[
                "Grow more!",
                "Nah..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hilary's evil smile was really convincing. She turned up the machine to an 11, the highest setting. Hilary started growing more and more. She should stop or the walls may give way.</span></div></span></div>",
            "created":1376974800,
            "id":1648925,
            "title":"Grow more!"
        },
        "13512111":{
            "author_id":"curiousgorge55",
            "author_name":"Clayton",
            "choices":[
                "Keep growing!",
                "Nah..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She again flipped the switch to height. Taller and taller she climbed, until she was 25 feet. She flipped back to weight.</span></div></span></div>",
            "created":1376974800,
            "id":1648928,
            "title":"Hilary grows taller!"
        },
        "135121111":{
            "author_id":"curiousgorge55",
            "author_name":"Clayton",
            "choices":[
                "She pulls the hose from her mouth.",
                "She turns into something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bigger and bigger Hilary got... she was not stopping! She flipped to height again. She grew 1 ft taller. What's going to happen?</span></div></span></div>",
            "created":1376974800,
            "id":1648929,
            "title":"Keep growing!"
        },
        "14":{
            "choices":[
                "Nod politely.",
                "Say something unpolite."
            ],
            "content":"<div class=\"\"><div> <span>Just then her older brother Joseph enters the kitchen.<br>\r\n<br>\r\n\"What's up, Hil,\" he announced groggily, wiping the yellow crust off his eyes.<br>\r\n<br>\r\n\"Hi,\" answered Hilary, taking a bite out of the Hot Pocket. \"Nothing much as usual, though I plan to gain a few more pounds today.\"<br>\r\n<br>\r\nJoseph rolled his eyes. \"Still trying to break that dumb record of being the heaviest person on earth?\"<br>\r\n<br>\r\nHilary's dream was to weigh over 800 pounds, which would become the highest weight record in the Book of World Records.<br>\r\n<br>\r\nShe had been trying ever since she was a little girl. <br>\r\n<br>\r\nTalk about committed. </span></div></div>",
            "created":1080968400,
            "id":193781,
            "title":"Joseph"
        },
        "141":{
            "choices":[
                "go to a party with her friends",
                "go to a restaurant"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then Hilary nods politely and Joseph leaves.What will Hilary do next</span></div></span></div>",
            "created":1097298000,
            "id":219782,
            "title":"Polite"
        },
        "1411":{
            "author_id":"link2hyrule",
            "author_name":"The Ultimate Hylian",
            "choices":[
                "Take the orange and go on an eating binge",
                "Take the green and buy a helium tank"
            ],
            "content":"<div class=\"\"><div> <span>Hilary then got a call from her friend Melinda who was trying to put a party together.  Hilary agreed to come and as she was getting ready for the party she got an idea.  It was a very good and very obvious idea, she wondered why she never thought of it before.  Her friend Melinda was a very brainy girl.  So brainy, in fact, that she made Einstien, Hawking, Newton, and all those other famous scientists of various fields look like those guys who keep walking and bumping into the same spot of wall.  But she wasn't one of those bookworm, make everyone else feel inferior types.  No, she was cool, she new what was in, how to act in a crowd, and never made everyone feel dumb.  At least not directly, there were those who felt stupid around her just because they knew she was so smart.  But those people were rare and always had a change of heart once they got to know her.  Anyway, Hilary thought that if she could enlist Melinda's help, then there would be no end to the list of ways she could enlarge herself.<br>\r\nOnce she arrived at the party she immediately sought out her friend.  Soon she came upon her.  Or at least her holographic representative.  Melinda had done some weight alterations of her own, which horribly backfired.  Her body became so messed up that she became unable to move.  However, with her last bit of mobility she did manage to create a virtual body for herself which she then linked her mind to so that she would be able to move about.<br>\r\nAfter hearing Hilary's case, she agreed to help her out.  She had been working on ways to correct her many weight potions, and she believed that she had succeeded with two.<br>\r\n\"Let's go down to my lab and I'll show you what I've got.\"  Melinda offered.<br>\r\n\"That would be great!\"  Hilary replied excitedly.<br>\r\nOnce they arrived Melinda went to her vauld to retrieve her samples.  While she was gone Hilary sat on a nearby beanbag, which was very soft and comfortable, and looked around.  She had been in Melinda's lab many times, and was always suprised by the myriad of stuff that was-<br>\r\n\"Hey,\" she heard Melinda shout, \"would you mind removing your posterior from my gut, please?\"<br>\r\nHilary became puzzled, but then turned her head to look behind her and immediately jumped off of what used to be Melinda.  Her body was nearly spherical, with five indentations, one for each limb and her head.  Those, plus it's color and texture were the only ways anybody could tell that it was a human body.<br>\r\n\"Sorry, I keep forgetting.  Your virtual self is just so real, in all ways, that I forget that it's just a patch of light.\"<br>\r\n\"That's okay.  Actually I sometimes sit on it myself, just as a reminder of what I've dome to myself.  Anyway here are the weight potions I have succeeded with.  The orange one on the right adjusts your metabolism so that all food you eat goes straight to fat.  The green one on the left transforms you into a balloon of sorts, so that you can inflate yourself with fat.  Now sometimes the body's normal process of transforming food into fat leave residue like cholesterol and heart trouble, so I added to the orange one a formula that will enable your body to deal with these and other problems that might arise.  The green one doesn't have that, since fat on it's own is nothing.  So, which way do you want to go?\"</span></div></div>",
            "created":1136955600,
            "id":295098,
            "title":"Who says computers aren't useful"
        },
        "14112":{
            "author_id":"link2hyrule",
            "author_name":"The Ultimate Hylian",
            "choices":[
                "She got so heavy she wasn't able to stand anymore",
                "She got heavier and heavier, but the helium was making her float"
            ],
            "content":"<div class=\"\"><div> <span>Hilary decided on the green one, since it sounded like it would allow her the faster process.  She took the bottle and downed the contents, burping slightly.<br>\r\n\"Feel any different?\"  Melinda asked.<br>\r\n\"Not really.  Wait, yeah, I do.\"  Hilary pushed her hands into her body, and although she couldn't place it, it did seem like her fat gave way differently than normal.  \"My weight hasn't changed, has it?\"<br>\r\n\"Just a second.\"  Melinda replied.  She picked up Hilary like she was nothing (Melinda had programmed her hologram for limitless strength) and held her for a minute.  \"Nope, you still weigh the same.\"<br>\r\n\"Phew!  Didn't want to lose any of those precious pounds, heh.  Thanks, Melinda.\"  She hugged Melinda, both the hologram and the body, and headed out to give her new body a try.  She went to the nearest party store and bought several helium tanks and brought them home.  Once there, before she started she went online and ordered an industrial strength scale, just so she would be able to weight herself after she got too big.  She then took one of the hoses and stuck it in her mouth.  After a while she started to see herself expand.</span></div></div>",
            "created":1140238800,
            "id":302364,
            "title":"Balloons are so fun"
        },
        "141121":{
            "author_name":"NinjaGirlSakaki",
            "choices":[
                "Melinda gets there to help",
                "She's got plenty of time to play around..."
            ],
            "content":"<div class=\"\"><div> <span>The numbers on the scale started to call out higher and higher as Hilary started to bloat up like a human balloon. Her body was starting to become rounder as she thickened up, blubbery hips starting to expand first. She smiled happily through the hose. <br>\r\n<br>\r\nThen the phone rang. Hilary groaned and unplugged, sticking her thumb in the hose. She manuvered her heavier body over to the phone, enjoying the new fat bouncing about. \"Hello?\" <br>\r\n<br>\r\n\"Hilary? Melinda. Tell me you're just using air.\" <br>\r\n<br>\r\n\"No, I'm using helium, it's cheaper.\"<br>\r\n<br>\r\n\"Oh no... Don't move. Don't expand. Just stay put, I'll.. . holo over.\" <br>\r\n<br>\r\n\"Uh, ok. Bye.\"<br>\r\n<br>\r\nShe hung up, wondering just what the problem could be. She tried to turn around, but found that something was wrong with her arm. She looked over. It was massive. She yelped in shock, pulling the airhose out with her not-titanic arm. She gave it a squish, wondering just what would happen. All fat. Looked like her left arm was too big to move now. If that was what happened with her hand, what would happen if she stuck it in her legs, or breasts or belly? </span></div></div>",
            "created":1143003600,
            "id":307890,
            "title":"In-fat-tion"
        },
        "1411212":{
            "author_name":"Ze Rat",
            "choices":[
                "Belly",
                "Boobs"
            ],
            "content":"<div class=\"\"><div> <span>\"While Melinda's on her way I can play some more, she's all the way across town, it will take atleast an hour\" She grinned an evil grin and stuck the hose in her other arm to even things out. \" there now theare equal, time to go for the lower regions!\" She stick the hose into her thighs and lets it go. \"Oh yeah, JelloBuns no more, now I'm Mega Buns!\" Her thighs and butt expanded rapidly pushing out and knocking down a table.\" Oh my!\" She pulls the hose out quickly and trys to walk. \"Oh man it's getting kinda hard to move around. Maybe I should do another body part, but which one?\"</span></div></div>",
            "created":1143867600,
            "id":309903,
            "title":"Thunder Thighs"
        },
        "14112121":{
            "author_id":"curiousgorge55",
            "author_name":"Clayton",
            "choices":[
                "Stick the hose in her mouth",
                "Keep getting heavy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She stuck it in her belly and watched it expand. Just then Merlinda was 50 minutes away from town. Merlinda needed a rest. Hilary was trying to reach her goal.</span></div></span></div>",
            "created":1376974800,
            "id":1649035,
            "title":"Heavy Hilary"
        },
        "142":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Mr. Amateur Sumo star!\"",
                "Mr. Quiz Show Team Captain!\""
            ],
            "content":"<div class=\"\"><div> <span>Joseph rolled his eyes. \"Still trying to break that dumb record of being the heaviest person on earth?\"<br>\r\n<br>\r\n(Hilary's dream was to weigh over 800 pounds, which would make her the biggest living woman, and get her into the Book of World Records.  She had been trying ever since she was a little girl.)<br>\r\n<br>\r\nThough Hilary was generally pretty polite and unaggressive, she and Joseph were very close, and she had always felt freer around him - except on the question of her weight, where he had always been a downer.  So this once Hilary snapped back at Joseph, \"That's pretty rich coming from you,  <br>\r\n</span></div></div>",
            "created":1170219600,
            "id":378096,
            "title":"HIlary takes a swipe at Joseph"
        },
        "1421":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "about 400 pounds too...",
                "heavier than Hilary!"
            ],
            "content":"<div class=\"\"><div> <span>Though Hilary was generally pretty polite and unaggressive, she and Joseph were very close, and she had always felt freer around him - except on the question of her weight, where he had always been a downer. So this once Hilary snapped back at Joseph, \"That's pretty rich coming from you, Mr. Amateur Sumo star!\" <br>\r\n<br>\r\n\"Hey, guys are allowed to be fat!\" Joseph retorts, standing up straighter and shaking his sumo gut.  He rubs one hand over it as it to reassure himself that it's still there, then speaks again.  \"Besides, weight in my sport is a good thing.\"<br>\r\n<br>\r\n\"Yeah, well, POTS shouldn't call kettles black!\" Hilary retorted.  \"It's not as if you're not trying to get bigger too!\"<br>\r\n<br>\r\n\"Yeah, well, if I want to be Yokozuna someday, I gotta eat!\" replies Joseph, now on the defensive himself.<br>\r\n<br>\r\nHilary smiled.  \"So now you're defensive.  You know, we should really band together - do things together.  After all, we both love to eat.\"  Hilary proposed this after every one of her tiffs with Joseph over weight, and while their 'common front' never lasted very long, they both usually got at least one good gorge in from each time they agreed.<br>\r\n<br>\r\n\"Sounds good!\" replies Joseph.  \"Let's bump bellies on it!\"  This too was part of the ritual - when it started, Hilary had been bigger than Joseph, even though he was older, but now he was taller and...<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1177650000,
            "id":402804,
            "title":"bump and make up"
        },
        "14211":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Golden Griddle....",
                "Golden Key Buffet..."
            ],
            "content":"<div class=\"\"><div> <span>\"Sounds good!\" replies Joseph. \"Let's bump bellies on it!\" This too was part of the ritual - when it started, Hilary had been bigger than Joseph, even though he was older, but now he was the taller of the two of them and about 400 pounds too.<br>\r\n<br>\r\nNeither of them knew their weight exactly, as their parents didn't have a scale with enough capacity to weigh them, and so they'd gotten out of the habit of weighing themselves regularly. They'd each been weighed and measured when the school year began (being as they were in a Midwest American school, where such things are done), but now it was early November, and both of the had grown since then...as their clothes showed. <br>\r\n<br>\r\n\"Are you hungry?\" Hillary asked, licking her snack off her lips.  <br>\r\n<br>\r\nJoseph's mighty tummy rumbled his reply.  \"Little sister, I am ALWAYS hungry!\" he replied.  \"Let's go eat now!\"  Joseph rolled his fat ass towards the door as Hillary climbed down from her stool and waddled along behind him.  She had to admit that he looked good from the backside, and moved along well - faster than she did.  They both slid into his car - the springs compressing beneath them - and headed off to their favourite buffet place, the...<br>\r\n<br>\r\n<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1190869200,
            "id":447977,
            "title":"Hillary and Joseph head out for food!"
        },
        "142111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "half the sumo team there....",
                "the place nearly empty?"
            ],
            "content":"<div class=\"\"><div> <span>They both slid into his car - the springs compressing beneath them - and headed off to their favourite buffet place, the Golden Griddle....no oriental buffets for them, they got enough of that at home, if they were going out to eat, it was going to be American!<br>\r\n<br>\r\nAnd, the Griddle's all day breakfast was a favourite - 'nothing like a pig filling up on pork' remarked Joseph on one previous trip, as he surveyed a plate filled with nothing but pork sausage and bacon.  Hillary couldn't help but agree, though she was drowning her sausage and french toast in syrup - she had more of a sweet tooth than Joseph.  Both of them, though, could agree on the Griddle - not the least of the reasons why being that, at the end, they both loved a big soup bowl filled with ice cream covered in syrup.<br>\r\n<br>\r\n They arrived at the Golden Griddle to find...<br>\r\n</span></div></div>",
            "created":1240894800,
            "id":683023,
            "title":"To the Golden Griddle"
        },
        "1421111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "my parents bought one that goes to half a ton!\"",
                "coach wants us all to go by the lumberyard after breakfast..."
            ],
            "content":"<div class=\"\"><div> <span>Hillary and Joseph arrived at the Golden Griddle to find half of Joseph's sumo team already there.<br>\r\n<br>\r\n\"You made it!\" called out one of the other team members, a blond guy almost as big as Joseph.  <br>\r\n<br>\r\n\"What's going on, Nate?\" Joseph asked.<br>\r\n<br>\r\n\"Didn't you get Perry's text?  We're having our team 'blow-out' breakfast here - everybody's supposed to come, 'fore we head to practice.\"<br>\r\n<br>\r\nJoseph whipped out his cell, and sure enough, there was an unread text.<br>\r\n<br>\r\n\"C'mon, Joe, dig in!\" urged Nate.<br>\r\n<br>\r\nJoseph and Hillary wasted no time filling plates and emptying them, again and again, along with the sumo team.  More sumos trickled in steadily, and soon the Golden Griddle was a sea of fat boys - with the occasional girlfriend, brother or sister - chowing down.  <br>\r\n<br>\r\nDeeply into his gourmandising, Joseph was just starting to slow down a little when Nate asked him, \"So, Joe, what weight are you up to?\"<br>\r\n<br>\r\n\"Dunno,\" grunted Joseph, \"no scales can hold me this year!\"<br>\r\n<br>\r\n\"Yeah, I didn't used to know either, but ....</span></div></div>",
            "created":1330059600,
            "id":1283352,
            "title":"half the sumo team there...."
        },
        "14211111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "probably not THAT big....",
                "but Hillary interrupted, \"I'm gonna get that big!!\""
            ],
            "content":"<div class=\"\"><div> <span>As Joseph's food intake slowed slightly from 'inhale' to 'gorge', Nate asked him, \"So, Joe, what weight are you up to?\"<br>\r\n<br>\r\n\"Dunno,\" grunted Joseph through a mouthful of French toast, \"no scales can hold me this year!\"<br>\r\n<br>\r\n\"Yeah, I didn't used to know either, but my parents bought one that goes to half a ton!\"<br>\r\n<br>\r\n\"What?!?\" reacted Joseph in surprise, nearly spitting out a mouthful.  \"Half a ton?  That's like a .. a freight scale!\"<br>\r\n<br>\r\n\"Yup!  Though it looks a lot better.  You and me, Joe, we got the 'freight' to test it out, too!  Why don't you come over later and find out which one of us is bigger?\"<br>\r\n<br>\r\n\"Yeah, sure,\" said Joseph, and Hillary added, \"Me too!\"<br>\r\n<br>\r\n\"Sure,\" said Nate, his voice as expansive as his waistline, \"everybody come, nobody'll overload this one!\"<br>\r\n<br>\r\n\"Well, not for now,\" said Joseph, smiling.<br>\r\n<br>\r\n\"What? Joe, you planning to get a lot bigger?\" asked Perry, who while big, was not in Nate and Joseph's weight class yet.<br>\r\n<br>\r\n\"Well,\" Joe began,...</span></div></div>",
            "created":1343797200,
            "id":1395367,
            "title":"my parents bought one that goes to half a ton!&..."
        },
        "142111111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "add at least another hundred...",
                "be the biggest Yokozuna ever!"
            ],
            "content":"<div class=\"\"><div> <span>\"What? Joe, you planning to get a lot bigger?\" asked Perry, who while big, was not in Nate and Joseph's weight class yet.<br>\r\n<br>\r\n\"Well,\" Joe began, \"probably not THAT big....but bigger, yeah, to be a great sumo I need to be huge!\"<br>\r\n<br>\r\nNate chuckled and said, \"Joe, a lot of folks figure you're already huge!\"<br>\r\n<br>\r\n\"Yeah, well, they ain't seen nothing yet!\" Joe replied.  He thumped his generous gut with one hand and added, \"I'm aiming to...</span></div></div>",
            "created":1354424400,
            "id":1480792,
            "title":"Joe has a goal weight"
        },
        "1421111112":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "be like Akebono...",
                "be bigger than Konishiki!"
            ],
            "content":"<div class=\"\"><div> <span>Nate chuckled and said, \"Joe, a lot of folks figure you're already huge!\"<br>\r\n<br>\r\n\"Yeah, well, they ain't seen nothing yet!\" Joe replied. He thumped his generous gut with one hand and added, \"I'm aiming to be the biggest Yokozuna ever!\"<br>\r\n<br>\r\n\"How big will you get?\" asked Perry, clearly not up on big Sumos.<br>\r\n<br>\r\n\"Akebono was 514 pounds when he was Yokozuna,\" Nate stated authoritatively.<br>\r\n<br>\r\n\"But what about Konishiki?\" asked one of the other boys.  \"He made it to 630 pounds!\"<br>\r\n<br>\r\n\"Yeah, but he was only Ozeki,\" replied Nate.<br>\r\n<br>\r\nJoe smiled.  \"I want to be Konishiki's weight, but Akebono's success,\" he said.  \"But if I have to choose between them, I want to ...</span></div></div>",
            "created":1359867600,
            "id":1523926,
            "title":"Joe's dream - and Hillary's?"
        },
        "14211111122":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "half hour of gorging?",
                "hour of gorging?"
            ],
            "content":"<div class=\"\"><div> <span>Joe smiled. \"I want to be Konishiki's weight, but Akebono's success,\" he said. \"But if I have to choose between them, I want to be bigger than Konishiki!  'cause fat ... is where it's AT!\" he added with a grin, as other boys chimed in on the last part. \"Now, let me go add work on my goal.\"<br>\r\n<br>\r\nSome time later, when Joseph was starting to feel full, Nate led them all to his house to the use the scale.  How much more time did it take for Joseph's capacious gut to start signalling it's satisfied? Another  ..</span></div></div>",
            "created":1370322000,
            "id":1603797,
            "title":"be bigger than Konishiki!"
        },
        "142111111222":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "the bathroom...",
                "the family room...",
                "the dining room?!?!"
            ],
            "content":"<div class=\"\"><div> <span>Some time later, when Joseph was starting to feel full, Nate led them all to his house to the use the scale. How much more time did it take for Joseph's capacious gut to start signalling it's satisfied? <br>\r\n<br>\r\nAnother hour of gorging!<br>\r\n<br>\r\nEven Hilary had stopped trying to keep up with Joe - and when he finally admitted to 'feeling full', he could hardly get up from the table (the rest of the team had been bringing him food).  With help, he waddled out to the car, tossing the keys to Hilary so she could drive.<br>\r\n<br>\r\nAt Nate's, the whole enormous crew trooped in to find that the new scales had 'pride of place' in...</span></div></div>",
            "created":1402376400,
            "id":1809789,
            "title":"Another hour, another gain..."
        },
        "142111112":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"She's been talking about this for ages.\"",
                "\"Naw, it's not possible.\"",
                "\"Why, Perry, do you like 'em fat?\""
            ],
            "content":"<div class=\"\"><div> <span>\"What? Joe, you planning to get a lot bigger?\" asked Perry, who while big, was not in Nate and Joseph's weight class yet, and whose jaw had dropped when Nate mentioned the half-ton scale.<br>\r\n<br>\r\n\"Well,\" Joe began, but Hillary interrupted him.<br>\r\n\"I'm gonna get that big!!\" she blurted out.<br>\r\n<br>\r\n\"Really, little sister?\" Joe said in a disparaging tone.<br>\r\n<br>\r\n\"Really!  Just you wait and see!\" and with that Hillary headed back to the buffet tables, deliberately emphasizing her waddle.<br>\r\n<br>\r\nJoe rolled his eyes, but Perry asked, \"Is she for real?\"<br>\r\n<br>\r\nJoe answered, </span></div></div>",
            "created":1437627600,
            "id":2011605,
            "title":"Hillary's dream?"
        },
        "1421111122":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Hillary?",
                "Nate?",
                "Perry????"
            ],
            "content":"<div class=\"\"><div> <span>Joe rolled his eyes, but Perry asked, \"Is she for real?\"<br>\r\n<br>\r\nJoe answered, \"Naw, it's not possible.\"<br>\r\n<br>\r\n\"Now why do you say that?\" Nate asked.<br>\r\n<br>\r\n\"1000 pounds?  Nobody weighs a thousand pounds!  Not in real life.\"<br>\r\n<br>\r\n\"Yeah, people have weighed a thousand pounds - they're in the Guinness Book of Records!\" retorted...<br>\r\n<br>\r\nWho retorted?  Who's up on their knowledge of the extremely large?</span></div></div>",
            "created":1453093200,
            "id":2091118,
            "title":"Joe doesn't believe in Hillary's dream..."
        },
        "14211111222":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "1400 pound Jon Brower Minnoch",
                "1200 pund Carol Yager"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah, people have weighed a thousand pounds - they're in the Guinness Book of Records!\" retorted Nate.<br>\r\n<br>\r\n\"No way!\" Joseph shot back.<br>\r\n<br>\r\n\"Yes way,\" Nate replied.  \"Here!\" he said, passing his Samsung to Joseph. <br>\r\n<br>\r\nOn the screen was a picture of:</span></div></div>",
            "created":1487912400,
            "id":2281714,
            "title":"Nate?"
        },
        "14211111223":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "hip-checked her back...",
                "found Perry advancing towards him..."
            ],
            "content":"<div class=\"\"><div> <span>\"1000 pounds? Nobody weighs a thousand pounds! Not in real life.\"<br>\r\n<br>\r\n\"Yeah, people have weighed a thousand pounds - they're in the Guinness Book of Records!\" retorted Perry.  \"There've been 20 people over the half-ton mark!  And two of 'em were women!\"<br>\r\n<br>\r\n\"Perry, I love you,\" Hillary exclaimed, then waddled over and gave Perry a big hug and pulling him over for a big kiss.  As she backed away, Perry blushed, but Hillary noticed signs of attraction appearing in his pants.  She approached him again.<br>\r\n<br>\r\n\"You are into this, aren't you?\" she whispered in his ear, as she hugged him again.<br>\r\n<br>\r\n\"Perry, she's my SISTER!\" Joe exclaimed in shocked disbelief.<br>\r\n<br>\r\n\"Yeah, and Perry is so cool, he might just be my new boyfriend!\" Hillary added, smooching him again.  \"Say, big boy, why's don't you and I grow together for a while?\" she added in a coquettish voice, batting her eyelids at Perry.<br>\r\n<br>\r\nPerry, overwhelmed, intrigued, and heavily turned on, spluttered.<br>\r\n<br>\r\n\"Well, you treat her right, or ELSE!\" Joe muttered darkly.<br>\r\n<br>\r\n\"Or what, you'll sit on him?\" Hillary turned on Joseph.  \"I think I know how to handle myself!\" she added, going over to Joseph and hip-checking him.<br>\r\n<br>\r\nJoe...</span></div></div>",
            "created":1493269200,
            "id":2311768,
            "title":"Perry, intrigued by size"
        },
        "1421111123":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "rolled his eyes and replied, \"Of course not!\"",
                "hesitated.  \"Your sister is pretty attractive,\" he suggested.",
                "said, \"What, Joe, you DON'T like fat girls?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Really! Just you wait and see!\" and with that Hillary headed back to the buffet tables, deliberately emphasizing her waddle.<br>\r\n<br>\r\nJoe rolled his eyes, but Perry asked, \"Is she for real?\"<br>\r\n<br>\r\nJoe answered, \"Why, Perry, do you like 'em fat?\"<br>\r\n<br>\r\nPerry....</span></div></div>",
            "created":1454907600,
            "id":2101443,
            "title":"Does Perry have eyes for Hillary?"
        },
        "14211111232":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"Joe, she's safe with me.\"",
                "\"Hey, are you serious about getting to 1000 pounds?\""
            ],
            "content":"<div class=\"\"><div> <span>Perry hesitated. \"Your sister is pretty attractive,\" he suggested.  He paused for a moment, then asked, \"Joe, you don't like fat girls?\"<br>\r\n<br>\r\n\"Hey, I like all kinds of girls,\" Joe replied with a grin, \"but they have to like this!\" He clouted his well-filled gut.<br>\r\n<br>\r\n\"Well, I like your sister,\" Perry said, adding, \"She has spunk and style, and she's not afraid to eat!\"<br>\r\n<br>\r\n\"Why thank you!\" Hilary said, charmed.<br>\r\n<br>\r\n\"I hate girls who pick at their food and don't eat,\" Perry added. \"I like a girl who has a real appetite!\"<br>\r\n<br>\r\n\"That's me!\" Hilary said, smiling. \"I love food!\"<br>\r\n<br>\r\n\"Well, that's certainly true,\" Joe admitted. \"But Perry, fair warning - she is my sister.\"<br>\r\n<br>\r\n\"What's that supposed to mean?\" Hilary demanded.<br>\r\n<br>\r\n\"It means if Perry ever makes you cry I'll hurt him,\" Joe answered, with surprising honesty.  \"I'll pound him. I'll sit on him 'til he can't breathe.\" <br>\r\n<br>\r\n\"Aw, Perry wouldn't hurt darling me,\" Hillary said breathily, sidling up beside Perry while still carrying a plateful of food. \"Would you, big boy?\"<br>\r\n<br>\r\n\"No, never,\" Perry affirmed. He continued, </span></div></div>",
            "created":1586981700,
            "id":2819327,
            "title":"hesitated.  \"Your sister is pretty attracti..."
        },
        "142111112322":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"Absolutely!\" Hillary replied.",
                "\"See which one of us is bigger!\" Joe growled."
            ],
            "content":"<div class=\"\"><div> <span>\"Aw, Perry wouldn't hurt darling me,\" Hillary said breathily, sidling up beside Perry while still carrying a plateful of food. \"Would you, big boy?\"<br>\r\n<br>\r\n\"No, never,\" Perry affirmed. He continued, \"Hey, are you serious about getting to 1000 pounds?\"<br>\r\n<br>\r\n\"Absolutely!\" Hillary replied. \"Don't you think this beautiful bod could look even more beautiful?\" she cooed, rubbing a chubby hand over one enormous breast. \"I think I could add so much MORE beauty!\"  She picked up a fork laden with a chunk of waffle. \"Here's to MORE beauty!\" she went on, then chewed.<br>\r\n<br>\r\n\"Just sit right there and I'll bring you all the food you want!\" exclaimed Perry.  <br>\r\n<br>\r\n\"You do that, and I'll be your girl for now and forever,\" Hillary proclaimed. She took another bite, and another, as Perry rapidly filled more plates for her.<br>\r\n<br>\r\nAn hour later, as even Hillary was slowing down, Nate said, \"OK, time for that weigh-in!\"</span></div></div>",
            "created":1595005740,
            "id":2870501,
            "title":"Hillary's dream - Perry is in love!"
        },
        "14211111233":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"Look, can I bring you more food?\"",
                "\"Joe, she's safe with me.\"",
                "\"Hillary, do you really want to grow like you said?\""
            ],
            "content":"<div class=\"\"><div> <span>Joe answered, \"Why, Perry, do you like 'em fat?\"<br>\r\n<br>\r\nPerry riposted, \"What, Joe, you DON'T like fat girls?\"<br>\r\n<br>\r\n\"I like all kinds of girls,\" Joe replied with a grin, \"as long as they like me!\"  He clouted his well-filled gut.  \"Me and my belly!\"<br>\r\n<br>\r\n\"Me, I like your sister,\" Perry said, plainly.  \"She has spunk and style.\"<br>\r\n<br>\r\n\"Why thank you!\" Hillary said, charmed.<br>\r\n<br>\r\n\"Plus, she's not afraid to eat,\" Perry went on.  \"I hate girls who pick at their food and don't eat.\"<br>\r\n<br>\r\n\"Well, she certainly can eat,\" Joe admitted.  \"But just taken warning - she is my sister.\"  <br>\r\n<br>\r\n\"What's that supposed to mean?\"  Hillary demanded.<br>\r\n<br>\r\n\"If he hurts you I'll pound him,\" Joe answered, with surprising honesty.<br>\r\n<br>\r\n\"Aw, Perry wouldn't hurt me,\" Hillary said, sidling up beside Perry while still carrying a plateful of food.  \"Would you?\"<br>\r\n<br>\r\n\"Nope, not at all,\" Perry replied.  He continued, </span></div></div>",
            "created":1454907600,
            "id":2101462,
            "title":"Joe warns Perry?"
        },
        "142111112331":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Nate's mother is home!",
                " he leads them into the house...",
                "the scale is out in the garage with the gym equipment!"
            ],
            "content":"<div class=\"\"><div> <span>\"Nope, not at all,\" Perry replied. He continued, \"Look, can I bring you more food?\"<br>\r\n<br>\r\n\"Sure!\" replied Hillary.  \"Grab some omelette for me.\"<br>\r\n<br>\r\n\"Which one?\" Perry calls from the hot table.<br>\r\n<br>\r\n\"All of them!\" Hillary replies.<br>\r\n<br>\r\nPerry rapidly brings two plates covered in four omelettes to Hillary, who is in midst of shovelling in sausages and cinnamon buns.  Perry sits for a moment, then notices that Hillary's drink is empty.<br>\r\n<br>\r\n\"A refill?\" he asks.<br>\r\n<br>\r\n\"Of course!\" she replies.<br>\r\n<br>\r\nPerry spends the next hour like this, making sure that Hillary has food and drink at her fingertips, as Joe and the rest of the team plough through their heroic breakfasts as well.  Joe is suspicious that Hillary has eaten more than he has.<br>\r\n<br>\r\nThe group collectively slows to a halt, with Perry coaxing one more chocolate croissant into Hillary's maw.  <br>\r\n<br>\r\n\"Time to go test out Nate's new scale,\" Joe says, grunting with satisfaction as he climbs to his feet.  All of his teammates have bellies bulging with their breakfast gorge, but Joe's seems particularly rounded.  He turns, though, when he hears another grunt, and sees Perry helping Hillary get to her feet.<br>\r\n<br>\r\n\"Overdid it, did you?\" he asks sarcastically.  <br>\r\n<br>\r\n\"I never 'over do it',\" Hillary retorts, \"I'm just really full.\"<br>\r\n<br>\r\nOutside, Joe expects Hillary to join him, but Perry offers to drive her to Nate's and she accepts.  His truck is probably a better fit than the car, Joe thinks, before dropping his almost painfully full gut into the driver's seat.  <br>\r\n<br>\r\nAt Nate's...</span></div></div>",
            "created":1455080400,
            "id":2102426,
            "title":"Perry and Hillary:  a beginning"
        },
        "1421111123313":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"You go first, it's your scale,\" Joe says.",
                "\"I will, team captain's privilege,\" Joe declares, stepping forward.",
                "\"I will!\" exclaims Hillary, rolling forward onto her feet."
            ],
            "content":"<div class=\"\"><div> <span>The team arrive at Nate's, and mostly park along the street... but Nate gets to park in his own driveway, notes Joe as he hauls his heavy belly up the sidewalk.  He sees that Nate helping Hillary out of the truck, and it seems like Nate is straining, just a little?<br>\r\n<br>\r\n\"Couldn't get out of the truck by yourself?\" Joe remarks sarcastically to Hillary.<br>\r\n<br>\r\n\"Nate offered to help, being a gentleman, and Ah accepted!\" replies Hillary in a mock southern accent.<br>\r\n<br>\r\nJoe and the team are heading towards the front door when the garage opens.  \"It's in the garage!\" Nate calls out, and as the garage opens Nate's family gym (and Nate's dad's prize antique car) are revealed.  Nate guides Hillary in and seats her on a bench, that walks over to a panel on the wall.<br>\r\n<br>\r\n\"Where's the scale?\" Joe asks.  <br>\r\n<br>\r\n\"This steel square on the floor,\" Nate replies.  \"Built in.\"  He presses a button and the wall mount display panel flashes up zeroes.<br>\r\n<br>\r\n\"Who's first?\"  Nate asks.<br>\r\n</span></div></div>",
            "created":1456117200,
            "id":2107930,
            "title":"Who goes first?"
        },
        "14211111233133":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"4-1-8!\"",
                "\"4-4-9!!\""
            ],
            "content":"<div class=\"\"><div> <span>Nate presses a button and the wall mounted display panel flashes up zeroes.<br>\r\n<br>\r\n\"Who's first?\" Nate asks.  <br>\r\n<br>\r\n\"I will!\" exclaims Hillary, rolling forward onto her feet.  Exaggerating her waddle - well, not by much, her full stomach forces her legs to swing around her stuff gut - she heads to the big steel square in the floor and steps on, then turns and smiles sweetly at Nate and Joe.<br>\r\n<br>\r\n\"Well?\" she asks.  \"How big am I?\"<br>\r\n<br>\r\nNate looks at the glowing display and reads...</span></div></div>",
            "created":1595003460,
            "id":2870482,
            "title":"Hillary goes first, and weighs..."
        },
        "142112":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "the owners' brother was the school's sumo coach...",
                "the owners' son had been state high school sumo champion..."
            ],
            "content":"<div class=\"\"><div> <span>Hillary and Joseph slid into his car - the springs compressing beneath them - and headed off to their favourite buffet place, the Golden Key Buffet.<br>\r\n<br>\r\nOnce through the door the two substantial youngsters were greeted like old friends - which indeed they were!  The owners of the Golden Key admired the the progress of their fat young customers - especially Joseph, who was bringing honour to their town and their restaurant through his exploits in the high school sumo ring. The team regularly dropped into the Golden Key after matches, where they were warmly welcomed and fed - well fed! There was a close connection between the team and the Buffet, as...<br>\r\n <br>\r\n</span></div></div>",
            "created":1210568400,
            "id":530974,
            "title":"Off to the Golden Key Buffet"
        },
        "1421122":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Maitre d' in the Buffet....",
                "away in Japan..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There was a close connection between the team and the Buffet, as the owners' son had been state high school sumo champion!  Now 25, he's currently....<br>\r\n<br>\r\n <br>\r\n</span></div></span></div>",
            "created":1225083600,
            "id":600510,
            "title":"the owners' son"
        },
        "14211221":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Yoshi was still quite a bit smaller than Joseph...",
                "Yoshi had definitely grown, and made Joseph look small!"
            ],
            "content":"<div class=\"\"><div> <span>There was a close connection between the team and the Golden Key Buffet, as the owners' son had been state high school sumo champion! Now 25, he's currently Maitre d' in the Buffet.  <br>\r\n<br>\r\nWelcoming them warmly, and showing them to their usual table, Yoshi was at his warm and friendly best.  Following behind him and Joseph, Hillary could compare the two hefty males, noting that...<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1229576400,
            "id":621552,
            "title":"Maitre d' in the Buffet...."
        },
        "142112212":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "to Los Angeles to wrestle in a tournament...",
                "to Tokyo to join the Sumo League!"
            ],
            "content":"<div class=\"\"><div> <span>Welcoming them warmly, and showing them to their usual table, Yoshi was at his warm and friendly best. Following behind him and Joseph, Hillary could compare the two hefty males, noting that Yoshi had definitely grown, and made Joseph look small! <br>\r\n<br>\r\nJoseph must have noticed too, for he said to Yoshi, \"Have you joined the professional circuit?  You seem bigger than before. Or did Japan come through for you!\"<br>\r\n<br>\r\nYoshi smiled broadly, a smile that lit his face like a thousand watt light bulb. \"Joseph, the most wonderful news!  In two weeks I will be heading...<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1238734800,
            "id":670434,
            "title":"Yoshi made Joseph look small!"
        },
        "1421122121":{
            "author_id":"jellobuns",
            "author_name":"Jellobuns",
            "choices":[
                "Yoshi gives her and only her a little growth additive",
                "Hilly goes off to a doctors appointment afterwards"
            ],
            "content":"<div class=\"\"><div> <span>He was headed out to LA for wrestling, which Joseph thought was a good idea. Hillary, on the other hand, while impressed, preferred to focus her efforts on out-fatting the two of them once more. She wondered why she was so surrounded by fat males when fat girls were far more attractive. And as she ate, she noticed her attractiveness was already bulging out over her waistband rather impressively. She already imagined herself ballooning out of her clothing, always tight and constricting until finally bursting off, too small to contain her vast poundage. Though Yoshi did give her a goal to hit, she was much more intent on eating herself so titanic than no one else would be able to compare against her. Sure, maybe she wouldn't be a world champion sumo but she would certainly be a world class blob. And so she continued to stuff her face, mentally catching up to the other guys while they yammered on about this and that. <br>\r\n<br>\r\nShe was three plates in by the time that the guys got to business, and already looking at plate four ravenously. </span></div></div>",
            "created":1240894800,
            "id":682942,
            "title":"Out of the state, out of the story"
        },
        "14211221211":{
            "author_id":"curiousgorge55",
            "author_name":"Clayton",
            "choices":[
                "Go home & test one spoonful",
                "Down the contents!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yoshi gave her a little growth additive. He gave it only to Hilary.<br>\r\n<br>\r\n\"Do not use it here!\" Yoshi said. He gave Joseph the check.</span></div></span></div>",
            "created":1376974800,
            "id":1649048,
            "title":"Yoshi gives her and only her a little growth ad..."
        },
        "142112212112":{
            "author_id":"curiousgorge55",
            "author_name":"Clayton",
            "choices":[
                "Transformation!",
                "Too Tall!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hilary went home. Joseph, went up to his room. She downed the contents of the growth additive. But something was wrong.</span></div></span></div>",
            "created":1376974800,
            "id":1649050,
            "title":"Down the contents!"
        },
        "14212":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Golden Griddle....   ",
                "Lucky Horse Buffet..."
            ],
            "content":"<div class=\"\"><div> <span>\"Sounds good!\" replies Joseph. \"Let's bump bellies on it!\" This too was part of the ritual - when it started, Hilary had been bigger than Joseph, even though he was older, but now he was taller AND heavier than Hilary!  <br>\r\n <br>\r\nNeither of them knew their current weight exactly, as their parents hadn't have a scale with enough capacity to weigh them for several years, so they were not in the habit of weighing themselves. At the beginning of the school year, they'd each been weighed and measured  - well, Hillary had been weighed and measured, Joseph had only been measured, as his bulk exceeded the capacity of the scale at school - all the nurse had written down was \"over 400 pounds\" for him. (This was not a unique distinction for Joseph, as another member of the school sumo team, and one of the linemen on the football team, had been in the same boat. Those two, though, acknowlegded Joseph as the 'leader of the fat'.)   Hillary had hoped for this note too, but was still very happy with her new high of 393 pounds.  <br>\r\n<br>\r\nBut now it was early November, and both Hillary and Joseph had grown since the first day of school...as their clothes showed.  Neither of them could squeeze into those jeans anymore - well, Joseph could if he tried, but it would cut his gorging capacity.  And gorging ,,, well, it could bring even brother and sister together. <br>\r\n<br>\r\n\"Are you hungry?\" Hillary asked, as the two of them bumped their massive midriffs. <br>\r\n<br>\r\nJoseph's mighty stomach gurgled emptily as he replied. \"Little sister, I am ALWAYS hungry!\" he replied. \"Let's go eat - now!\" Joseph rolled his broad ass towards the door as Hillary climbed down from her stool and waddled along behind him. He did look good from the backside, massive lovehandles overhanging a huge butt, and he moved along well - faster than she did. If he wasn't her brother, and SO annoying...<br>\r\n<br>\r\nThey both slid into his car - the frame settling beneath their weight - and headed off to their favourite buffet place, the...<br>\r\n</span></div></div>",
            "created":1191474000,
            "id":450377,
            "title":"Hillary suggests food to her BIG brother!"
        },
        "142121":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Joseph's sumo team there..",
                "two of Hilary's friends already there"
            ],
            "content":"<div class=\"\"><div> <span>Hilary and Joseph both got into his car - its frame sinking beneath their avoirdupois - and headed off to their favourite buffet place, the Golden Griddle....no oriental buffets for them, they got enough of that at home, if they were going out to eat, it was going to be all-American!<br>\r\n<br>\r\nAnd, the Griddle's all day breakfast was a favourite - 'nothing like stuffing a hog with pork' remarked Joseph on one previous trip, as he surveyed a plate filled with nothing but pork sausage and bacon. Hillary couldn't help but agree, though she was drowning her sausage and french toast in syrup - she had more of a sweet tooth than Joseph. Both of them, though, could agree on the Griddle - not the least of the reasons why being that, at the end, they both loved a big soup bowl filled with ice cream covered in syrup.<br>\r\n<br>\r\nThey arrived at the Golden Griddle to find...</span></div></div>",
            "created":1354251600,
            "id":1478964,
            "title":"Surprise at the Golden Griddle....   "
        },
        "1421211":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "come to my house, my parents bought one that goes to half a ton!\"",
                "my dad runs a metal yard - we could use their scale.\""
            ],
            "content":"<div class=\"\"><div> <span>Hillary and Joseph arrived at the Golden Griddle to find Joseph's sumo team already there.<br>\r\n<br>\r\n\"You made it!\" called out one of the other team members, a Greek looking guy almost as big as Joseph.<br>\r\n<br>\r\n\"What's going on, Dyson?\" Joseph asked.<br>\r\n<br>\r\n\"Didn't you get Rhett's text? We're having our team breakfast here - everybody's supposed to come, 'fore we head to practice.\"<br>\r\n<br>\r\nJoseph whipped out his cell, and sure enough, there was an unread text.<br>\r\n<br>\r\n\"C'mon, Joe, dig in!\" urged Dyson.<br>\r\n<br>\r\nJoseph and Hillary wasted no time filling plates and emptying them, again and again, along with the sumo team. The Golden Griddle was a sea of fat boys this morning - with many girlfriends, and some brothers and sisters - chowing down.<br>\r\n<br>\r\nDeeply into his gourmandising, Joseph was just starting to slow down a little when Anders, a blond guy, asked him, \"So, Joe, what weight are you up to?\"<br>\r\n<br>\r\n\"Dunno,\" grunted Joseph, \"haven't seen a scales that can cope with my weight yet this year!\"<br>\r\n<br>\r\n\"Hey then, <br>\r\n</span></div></div>",
            "created":1454907600,
            "id":2101365,
            "title":"It's sumo chow down time!"
        },
        "14212111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"though maybe not THAT big...\"",
                "then Hillary interrupted him, \"I'd love to get that big!!\""
            ],
            "content":"<div class=\"\"><div> <span>Deeply into his gourmandising, Joseph was just starting to slow down a little when Anders, a blond guy, asked him, \"So, Joe, what weight are you up to?\"<br>\r\n<br>\r\n\"Dunno,\" grunted Joseph, \"haven't seen a scales that can cope with my weight yet this year!\"<br>\r\n<br>\r\n\"Hey then, come to my house, our new scale's good for 1500 pounds!\"<br>\r\n<br>\r\n\"What?!?\" reacted Joseph in surprise, nearly spitting out a mouthful. \"1500 pounds?  that's three-quarters of a ton? That's like a .. a freight scale!\"<br>\r\n<br>\r\n\"Yup! They sell it for weighing barrels - and face it, Joe, you and me got our own personal 'barrels' to test it out!\" Anders replies, thumping his hefty gut with one big, padded fist. \"Why don't you come over after breakfast? We'll find out which one of us is bigger!\"<br>\r\n<br>\r\n\"Bigger? I'm bigger than you are, Anders! But yeah, sure, after we finish here, should know how big I've gotten,\" replied Joseph, and Hillary added, \"Me too!\"<br>\r\n<br>\r\n\"Sure,\" said Anders, his rich baritone voice sounding as generous as his waistline, \"everybody can come, none of us'll overload this one!\"<br>\r\n<br>\r\n\"Well, not for now,\" riposted Joseph, caressing his own keg-sized gut.<br>\r\n<br>\r\n\"What? Joe, you planning to get a lot bigger?\" asked Jared, who while plenty fat, was not in Anders and Joseph's weight class - yet.<br>\r\n<br>\r\n\"Bigger is definitely in my future,\" Joe began,...<br>\r\n</span></div></div>",
            "created":1517634000,
            "id":2448883,
            "title":"come to my house, my parents bought one that go..."
        },
        "142121111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "add at least another 100, maybe 150... ",
                "be the biggest Yokozuna ever!"
            ],
            "content":"<div class=\"\"><div> <span>\"What? Joe, you planning to get a lot bigger?\" asked Jared, who while plenty fat, was not in Anders and Joseph's weight class - yet.<br>\r\n<br>\r\n\"Bigger is definitely in my future,\" Joe began, \"though maybe not THAT big... but bigger, yeah, to be a great sumo I need to be huge!\"<br>\r\n<br>\r\nNate chuckled and said, \"Joe, a lot of folks figure you're already huge!\"<br>\r\n<br>\r\n\"Yeah, well, they ain't seen nothing yet!\" Joe replied. He thumped his magnificent paunch with one hand and added, \"I'm aiming to...</span></div></div>",
            "created":1520539020,
            "id":2462140,
            "title":"\"though maybe not THAT big...\""
        },
        "1421211111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "418",
                "454!"
            ],
            "content":"<div class=\"\"><div> <span>Joe thumped his magnificent sumo paunch with one hand and added, \"I'm aiming to add at least another 100, maybe 150 pounds - a sumo champion's weight!  But now it's time for more food!\"<br>\r\n<br>\r\nJoe headed back to the steam tables, followed by Anders and Hillary.  As self-appointed team fat guy, he always tried to ou-teat the rest of the team, though Anders gave him a run for his money.  He tried to ignore that Hillary was always close to keeping up with him.<br>\r\n<br>\r\nAs he neared a food coma, Nate tapped him on the shoulder.  \"Getting close to practice time, Joe, if you want to go do that weigh-in first, we gotta roll.\"<br>\r\n<br>\r\nAs if revitalised by the news, Joe sat upright.  \"Yeah, let's go!\" he barked.  \"Anders, we gotta go hit that scale!\"<br>\r\n<br>\r\n\"Right on, big guy!\" Anders replied, then popped a padded fist off Joe's paunch as it paraded by.  <br>\r\n<br>\r\nThey were all soon at Anders' house, where the scale was conveniently located in the dining room. \"My idea, makes it easier to access,\" Anders told the rest as he snapped it on.  \"Here, I'll go first, make sure it's working.\"<br>\r\n<br>\r\nAnders stepped up, and the wall-mounted display blinked, then settled at '423'.  \"Yahoo,\" said Anders, \"well into the four hundreds!\"  <br>\r\n<br>\r\n\"I think I'll go last,\" Joe said, so the others paraded up to the big steel square.  282, 329, 351, 298, the weights rolled on.  Hilary stood last in line before Joe, and for the her the display cruised past four hundred again.<br>\r\n<br>\r\n'407' it read as Hilary stood still.<br>\r\n<br>\r\n\"Yahoo, 400 at last!\" she said, stepping down.  Joe stepped up, the display blinked, and then stabilised at </span></div></div>",
            "created":1535471340,
            "id":2540017,
            "title":"The weigh-in"
        },
        "14212111111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "following a special diet...",
                "adding this to my food everyday..."
            ],
            "content":"<div class=\"\"><div> <span> Joe stepped up, the display blinked, and then stabilised at ... 418.<br>\r\n<br>\r\n\"418?\" Joe said in puzzlement.<br>\r\n<br>\r\n\"418?\" Anders asked. \"418? Joe, I'm fatter than you are!\" he crowed.<br>\r\n<br>\r\n\"No way, no way, let's go back to the Griddle now, this has got to be wrong....\" Joe started to babble.<br>\r\n<br>\r\n\"Joe, snap out of it,\" Hillary said in her best take-charge voice, channeling their mother. \"You have practice to get to. If you need some more food later, you can get it then.  Don't let the team down!\"<br>\r\n<br>\r\n\"I'm already letting the team down, I'm too small,\" Joe wailed.  \"I'm smaller than Anders.\"<br>\r\n<br>\r\n\"Well,\" said Anders, \"that might be because I've been...<br>\r\n</span></div></div>",
            "created":1537922160,
            "id":2553989,
            "title":"418???"
        },
        "142121111111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "decaf mocha java extra creamy?",
                "litres of melted ice cream?",
                "a drug his uncle discovered?"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm already letting the team down, I'm too small,\" Joe wailed. \"I'm smaller than Anders.\"<br>\r\n<br>\r\n\"Well,\" said Anders, \"that might be because I've been following a special diet... everyday I've been adding ____ to my daily feed, and it's working!\"<br>\r\n<br>\r\nWhat is Anders' new diet addition?</span></div></div>",
            "created":1562621040,
            "id":2683993,
            "title":"Anders shares his new gaining diet"
        },
        "1421211111111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "somebody suggested hitting the beach for volleyball....",
                "everybody drifted away to sleep off their feasting!"
            ],
            "content":"<div class=\"\"><div> <span>\"Well,\" said Anders, \"that might be because I've been following a special diet... everyday I've been adding a couple of extra large decaf mocha java extra creamy coffee milkshakes from Equator's Coffee to my daily feed -  and it's working!\" he concluded by bouncing a hand off his generous gut.<br>\r\n<br>\r\n\"Mocha java extra creamy?\" Hillary asked, as Joe just stared.  \" A coffee milkshake is your secret diet ingredient?\"<br>\r\n<br>\r\n\"Not just any milkshake!\" Anders replied cheerfully.  \"The richest, creamiest, smoothest, most calorific coffee milkshake ever invented!  The extra-large size has over 1600 calories per cup - and I down two of those babies daily now!  'Cause they're liquid, they don't cut into my eating at all, but two of them a day is another four, five pounds a week added to my big sumo bod!\"<br>\r\n<br>\r\n\"Milkshakes?\" muttered Joe, still feeling down about being lighter than Anders.<br>\r\n<br>\r\n\"Here, Joe, I'll order one for both of us, tell me what you think,\" Anders suggested.  \"Anybody else want to try one?  They're DeLiCious!\"<br>\r\n<br>\r\nAnders texted in the order and the whole crew of sumos and friends trooped outside to head to Equator's, Hillary dragging Joe along.  She hoped there'd be baked goodies at the coffee shop too - a nice slice or three of lemon pie would go well now, and would help cheer Joe up.<br>\r\n<br>\r\nSoon, the near dozen hefty friends were filling the coffee shop, hogging the tables and generally crowding the way, as their dozen super-calorific drinks appeared.  Despite being less than an hour off breakfast, nearly everybody ordered a pastry too - some of them going for pie, others for the huge homemade cinnamon rolls that were an Equator trademark.  Then,</span></div></div>",
            "created":1566942900,
            "id":2708737,
            "title":"decaf mocha java extra creamy?"
        },
        "14212111111111":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "I'm heading home for a nap...",
                "Anders and I are going out drinking..."
            ],
            "content":"<div class=\"\"><div> <span> Then, somebody suggested hitting the beach for volleyball.<br>\r\n<br>\r\n\"Kev, are you mad?\" Joe replied. \"I need at least an hour to digest before I do anything!\"<br>\r\n<br>\r\n\"Well, not right now,\" Kev replied, \"but in a couple of hours, say?  We all bring coolers, do a little v-ball, have some snacks, catch a few rays?\"<br>\r\n<br>\r\n\"Yeah, that's a better plan,\" Joe says.  \"In the meantime,</span></div></div>",
            "created":1569870480,
            "id":2725944,
            "title":"Volleyball?"
        },
        "142121111111112":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Hillary loves the coffee circuit!",
                "Beach volleyball for fat guys!"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah, that's a better plan,\" Joe says. \"In the meantime, Anders and I are going out drinking...\"<br>\r\n<br>\r\n\"Drinking?\" one of the others asks.<br>\r\n<br>\r\n\"Yeah, if Anders has figured out that these are most calorific drinks in the city, then he must have tried others, and if I'm going to catch up to him, I need to add all of them to my diet!\"<br>\r\n<br>\r\n\"I'm with you!\" says Hillary.<br>\r\n<br>\r\n\"Me too,\" says Dyson, who had weighed in just shy of the 400 mark - the third heaviest on the team.  He nodded his head vigorously, his curly black hair falling over his strong Greek face.  \"Gotta get up over 400 mark somehow - Anders and I used to be the same weight!\"<br>\r\n<br>\r\nThe four 'drinkers' headed out, with an agreed meeting place for beach volleyball three hours later.  </span></div></div>",
            "created":1571867340,
            "id":2737459,
            "title":"Anders and Joe hit the calorific liquids"
        },
        "1421211111111122":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "Later, after the game, tanning continues",
                "A week of \"decaf mocha\" has done Joe and Hillary a world of good!"
            ],
            "content":"<div class=\"\"><div> <span>\"I swear I can hear sloshing!\" joked Joe as he climbed out of the car at the beach.<br>\r\n<br>\r\n\"I KNOW I can hear sloshing,\" Hillary affirmed, \"my own and yours!\"  <br>\r\n<br>\r\n\"Well, we down a few litres of that stuff,\" Dyson remarked, \"maybe enough to get me over the 400 mark. Urg, can't remember being so full on liquids in a long time.\"<br>\r\n<br>\r\n\"Yeah, well, it disappears fast, trust me,\" Anders noted. \"Just walking out to the beach and setting up will probably be enough to get rid of that feeling.\"<br>\r\n<br>\r\n\"By then we'll all need washrooms,\" Joe said. \"Good thing it was all decaf - imagine the high if we'd had all the caffeine!\" <br>\r\n<br>\r\n\"You'd have run off all the calories in nerves,\" Anders replied as he waved to Kev.  The others on the Sumo squad, plus friends, were all arriving, and the sun was shining, the air warm but breezy, and the beach not too busy.<br>\r\n<br>\r\nThe lads and gals were soon assembled by a volleyball net, and while the sumos were drawing up teams, their friends and followers were setting up umbrellas and towels, and food and drink. Anders headed up one team, while Joe led the other, and after a quick handshake followed by a belly barge, the games began!<br>\r\n<br>\r\nThe grunts and whoops of the sumo volleyball squads - each team weighing nearly a ton - drew a crowd of onlookers as well.  The games were not particularly fast, and were punctuated by amusing incidents as the chunky porkers slammed into one another, or the ground, on a frequent basis. More than one spectator had their phone out, and the YouTube uploads wouldn't be long in comg.  <br>\r\n<br>\r\nThe weighty fun continued until Joe and Anders, both panting for breath, stumbled off the court and plowed into each other.  <br>\r\n<br>\r\n\"Half time!\" they gasped together, falling into a heap. The other sumos stumbled off the court too, and soon a reviving round of food and drink was being distributed.</span></div></div>",
            "created":1586980680,
            "id":2819320,
            "title":"Beach volleyball for fat guys!"
        },
        "14212111111111222":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "426 - the same as Anders!!!",
                "428 - up a whole 10 pounds in a week!"
            ],
            "content":"<div class=\"\"><div> <span>The next Saturday, Joe actually read Rhett's text, and he and Hillary arrived at the Golden Griddle as the other sumo brothers and friends were arriving too.<br>\r\n<br>\r\n\"Joe, you're here!\" Anders exclaimed happily as he lifted his substantial frame out of his car, then walked over to Joe.  The two huge sumos high-fived, then belly-barged, then turned towards the broad  doors of the buffet.  Their entrance was as unsubtle as two heavy teenage boys can be - the huge doors flung open, then their prodigious bulk making the entrance floor shake gently. Right behind was Hillary, whose own prodigious bulk contributed to the impressive arrival.<br>\r\n<br>\r\n\"We've arrived!\" Joe announced to the 20-something maitre d', who was no lightweight guy himself.<br>\r\n<br>\r\n\"Right this way guys,\" he said, \"and gals, we're ready for you!\"<br>\r\n<br>\r\nThis Saturday sumo team feast looked just like the previous Saturday, to the other diners at the Golden Griddle - the same crew of teenage sumos, some merely heavyweights, others of truly prodigious size, accompanied by friends and supporters whose ranks included not a few more sizeable teens.  Substantial and phenomenal appetites were engaged, and impressive, even breathtaking amounts of food vanished into gargantuan high school sumo guts.  <br>\r\n<br>\r\nJust like the previous week, Joe was deeply into his gourmandising, putting away even more food than his usual astonishg capacity.  Eventually, though, he started to slow, and at that point, Anders asked him, \"So, Joe, how did the mocha java diet go?  Did it help?  Want to see what weight you're up to today?\"<br>\r\n<br>\r\n\"Oh yeah, been sucking that stuff back every day!\" Joe replied happily. \"It's great!  Even seems to help my eating capacity! I'm sure I'm bigger now, I can just feel it!\" <br>\r\n<br>\r\n\"So you want to swing by my place and see what the scales say?\"<br>\r\n<br>\r\n\"For sure!  But first, I have more food to eat!\"  <br>\r\n<br>\r\nJoe headed back to the steam tables, followed by Anders, Hillary, Dyson, Kev, Rhett, and the rest. Joe's confidence as the sumo team's heftiest athlete had been damaged by last week's weigh-in, where he'd been lighter than Anders.  The week since had seen Joe stuffing himself like never before, and pouring decaf mocha java and other calorific liquids into his gargantuan gut as if it were bottomless.  Now at the weekly buffet feast, Joe was determined to gain back his status as the team's heaviest fat guy, and prove once again he was 'on top', by out-eating the rest of the team.<br>\r\n<br>\r\nHillary, for her part, had spent the week trying, but not succeeding, in matching her brother's extraordinary consumption. <br>\r\n<br>\r\nAs Joe's intake slowed a second time, Nate tapped him on the shoulder. \"Getting close to practice time, Joe.  If you want to roll by Ander's for weigh-in first, we gotta go.\"<br>\r\n<br>\r\nPerked up by this reminder, Joe put down his fork and sat upright, his beastly belly pressed deeply into the table. \"Yeah, let's go!\" he enthused. \"Anders, I'm going to beat you on the scale!\"<br>\r\n<br>\r\n\"We'll see,\" Anders replied,  shoving his own chair back and bouncing his fabulous fat front as he stood.  \"This big thing isn't getting any smaller!\" he noted, bouncing a fat fist off his impressive gut. Joe was headed towards him and the exit, so Anders stood in the midst of the aisle, and the two prodigious paunches met in a sumo-sized belly barge for a moment. <br>\r\n<br>\r\nShortly, at Anders' house, the tremendous teens gathered in the dining room.  Anders went first. \"I'll go first, make sure it's working,\" he said as he stepped onto the steel platform.<br>\r\n<br>\r\nThe wall-mounted display blinked and settled at '426'. \"Yahoo,\" said Anders, \"another three pounds since last week!\"<br>\r\n<br>\r\n\"Like last time, I'll go last,\" Joe said, stepping aside.  The rest of the team stepped up steadily.  285, 330, 353, 301, the weights blinked up. Hillary got in line just before Joe.  <br>\r\n<br>\r\n\"407 last week,\" Hillary remarked just as she stepped up.  \"And I've been follow Ander's new diet pretty carefully since then.\"  The display blanked, then read '412.'  <br>\r\n<br>\r\n\"Up five pounds!\" Hillary exulted.  \"Anders, your diet tip is just flabulous!\"<br>\r\n<br>\r\n\"Thank you, Hillary,\" Anders replied, \"but I really want to know what effect it's had on Joe's bulk.\"<br>\r\n<br>\r\nJoe stepped up. He'd been working like never before to improve his weight this week - drinking mocha java decafs multiple times a day, stuffing himself with more breakfast, more lunch, more dinner, more snacks, filling bowls with peanuts and cookies to munch while doing homework, and making himself eat more and more.  But had it been enough?  He was sure he'd eaten enough to catch up to Ander's weight of last week, 423, but now Anders was also up to 426!  He'd decide to go last, like last week, so that if he hadn't beaten Anders he could just slide out and head home.  <br>\r\n<br>\r\nSo, with trepidation Joe approached the scale.  He knew he was bigger, heftier than ever before - he could feel it - but was it enough?<br>\r\n<br>\r\nThe scale display blinked as his terrific mass bore down on the steel square.  Then it blinked back up...</span></div></div>",
            "created":1600810800,
            "id":2908306,
            "title":"What good \"decaf mocha\" can do!"
        },
        "1421211112":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "success in the ring like Akebono!\"",
                "weight.  Konishiki's weight!\""
            ],
            "content":"<div class=\"\"><div> <span>Nate chuckled and said, \"Joe, a lot of folks figure you're already huge!\"<br>\r\n<br>\r\n\"Yeah, well, they ain't seen nothing yet!\" Joe replied, thumping his magnificent paunch with one hand and adding, \"They think this is huge? Pshaw.  I'm talking another hundred pounds at least! I'm aiming to be the biggest Yokozuna ever!\"<br>\r\n<br>\r\n\"How big will that be?\" asked one of the younger guys.  \"Who was the biggest anyway?\"<br>\r\n<br>\r\n\"Akebono was 514 pounds when he was Yokozuna,\" Nate stated authoritatively.<br>\r\n<br>\r\n\"But what about Konishiki?\" asked one of the other boys. \"He made it to 630 pounds!\"<br>\r\n<br>\r\n\"Yeah, but he was only Ozeki,\" replied Nate.<br>\r\n<br>\r\n\"And then there was that huge guy here in America, he did sumo and MMA, Yarbruff?\" asked another.<br>\r\n<br>\r\n\"Yarbrough,\" Nate replied.  \"Guinness pegged him at 704, but supposedly he got up to 800 pounds at one point.\"<br>\r\n<br>\r\n\"EIGHT HUNDRED POUNDS!\" exclaimed Hilary. \"My kind of man!\" she continued.<br>\r\n<br>\r\nJoe smiled. \"Yarbrough was 6'8\" though, and I'd need to grow a bit... plus he never wrestled in Japan. If I could choose anything, I'd want to be Konishiki's weight, but Akebono's success,\" he continued. \"Right now, though, my goal is ...</span></div></div>",
            "created":1579898160,
            "id":2777910,
            "title":"be the biggest Yokozuna ever!"
        },
        "142122":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "...the fat Buddha...",
                "...the Takahashi's son, a sumo wrestler..."
            ],
            "content":"<div class=\"\"><div> <span>Joseph did look good from the backside, Hillary thought to herself, with his massive lovehandles overhanging his huge butt, and he moved along well - well, faster than she did. If he wasn't her brother, and SO annoying...<br>\r\n<br>\r\nThey both slid into his car - the frame settling beneath their weight - and headed off to their favourite buffet place, the Lucky Horse Buffet.  The owners of the Lucky Horse were friends of their parents, whose own children were a bit older than Joseph and Hillary, and who were accustomed to Joseph and Hillary dropping by with their massive appetites.  The Takahashi's were Japanese, not Chinese, but here in the mid-west the two Oriental communities had made common cause. Joseph particularly like the Lucky Horse because of all the images of .... that were used as decoration.</span></div></div>",
            "created":1266555600,
            "id":839170,
            "title":"Lucky Horse Buffet"
        },
        "1421221":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "a guy walked over to them....",
                "a man walked over to them..."
            ],
            "content":"<div class=\"\"><div> <span> Joseph particularly like the Lucky Horse because of all the images of the fat Buddha that were used as decoration - he once said that he aspired to have the body of a god - Buddha.<br>\r\n<br>\r\nAt the Lucky Horse Mrs. Takahashi greeted Joseph and Hilary with enthusiasm, and seated them at a table beside the serving tables.  The two fat siblings raced to grab plates and dig in, as Mrs. T brought their Pepsis.  Joseph and Hilary matched one another nearly bite for bite through the first four platefuls, but as they got up for plateful number five....</span></div></div>",
            "created":1292130000,
            "id":1013250,
            "title":"Liking the decor AND the food"
        },
        "14212211":{
            "author_id":"jellobuns",
            "author_name":"Jellobuns",
            "choices":[
                "She goes down to the address soon after finishing.",
                "She eats more and more till she looks bloated and huge"
            ],
            "content":"<div class=\"\"><div> <span>\"I see you two are quite fond of eating,\" The man said, putting a hand on Hilary's bulky shoulder. \"But it appears that this young woman is trailing behind.\" She blushed a little and looked up at him. She was quite jealous that she couldn't get fatter faster, so she listened intently to his proposition. It didn't stop her from eating of course. Her ears listened intently as he spoke of an idea that sounded quite good to the growing girl. <br>\r\n<br>\r\nHe was a connoisseur of large figured women and was putting together a dancing school. He needed beautiful and obese women, she wanted to get bigger. It seemed almost too good to be true. So it was decided that, after she got done eating, she would come to his dance theater and learn how to be a belly-dancer and with time she'd be aided in getting even more titanic. The idea of people lauding over her and her titanic body as she danced made her cheeks go red as she thought about it and made her want to eat even more. <br>\r\n<br>\r\nThe man left and gave her his card with the address printed on it. But Hilary had a big belly to fill after all...</span></div></div>",
            "created":1297659600,
            "id":1053762,
            "title":"An Offer She Can't Refuse"
        },
        "14212212":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "about 300 pounds....",
                "considerably more than Joseph!"
            ],
            "content":"<div class=\"\"><div> <span> Joseph and Hilary matched one another nearly bite for bite through the first four platefuls, but as they got up for plateful number five a man walked over to them.<br>\r\n<br>\r\n\"You two really love your food, I see!\" remarked the man in a deep, melodious voice.  Hilary looked over the newcomer - he was prettyy cute for somebody in his 20s, he must weigh.....</span></div></div>",
            "created":1294549200,
            "id":1032515,
            "title":"What does he want?"
        },
        "142122122":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "star in TV ads...",
                "model a new line of designer clothes..."
            ],
            "content":"<div class=\"\"><div> <span>\"You two really love your food, I see!\" remarked the man in a deep, melodious voice. Hilary looked over the newcomer - he was pretty cute for somebody in his 20s, he must weigh considerably more than Joseph!<br>\r\n<br>\r\n\"We're looking for some fashionable students to help us out,\" the fat guy continued, his moving mouth making his dimple wink at Hilary.  She scoped out his hefty love handles and generous gut, stretching out his dress shirt below his abundant fleshy pecs, all of which bounced gently as he walked towards them   \"I'm Conor, and we're looking for generously-built students to....</span></div></div>",
            "created":1299474000,
            "id":1066978,
            "title":"An offer"
        },
        "1421221222":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"The Vast Waistband and More to Love\"",
                "\"Avenue and Uomo Modo\""
            ],
            "content":"<div class=\"\"><div> <span>\"We're looking for some fashionable students to help us out,\" the fat guy continued, his moving mouth making his dimple wink at Hilary. She scoped out his hefty love handles and generous gut, stretching out his dress shirt below his abundant fleshy pecs, all of which bounced gently as he walked towards them \"I'm Conor, and we're looking for generously-built students to model a new line of designer clothes for our store chains.\"<br>\r\n<br>\r\n\"Oh,\" says Hillary, \"which chains?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1330318800,
            "id":1285573,
            "title":"Joseph and Hillary as models"
        },
        "14212212222":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"You got me!  It's for Target plus sizes..",
                "\"No, really, they're adding plus sizes this year..."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm Conor, and we're looking for generously-built students to model a new line of designer clothes for our store chains.\"<br>\r\n<br>\r\n\"Oh,\" says Hillary, \"which chains?\"<br>\r\n<br>\r\n\"Avenue and Uomo Modo.\"<br>\r\n<br>\r\n\"Funny man,\" Hillary replied sarcastically.  \"Those two don't carry clothing in our sizes!  Now, who is this really for?\"</span></div></div>",
            "created":1339563600,
            "id":1358879,
            "title":"Avenue and Uomo Modo"
        },
        "142122122222":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "we need more models...",
                "I'm asking you two, you're close to my size and hers...",
                "I'm going to be famous, and you can too!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Oh,\" says Hillary, \"which chains?\"<br>\r\n<br>\r\n\"Avenue and Uomo Modo.\"<br>\r\n<br>\r\n\"Funny man,\" Hillary replied sarcastically. \"Those two don't carry clothing in our sizes! Now, who is this really for?\"<br>\r\n<br>\r\n\"No, really, they're adding plus sizes this year.  Why do you think they hired me to find more models for them?\" Conor explained.<br>\r\n<br>\r\n\"If you're serious, then show us some ad samples,\" Hillary replied.<br>\r\n<br>\r\n\"Sure!\" replied Conor.  He snapped open a briefcase on the table beside them and pulled out a sheaf of photos from a file.  \"Here's our test shoot last week,\" he continued.<br>\r\n<br>\r\nHillary scrutinised the photos carefully, while Joseph, less concerned, continued to plow through a large dish of chicken in red curry.  Hillary noted the closeups of logos in several photos, and the more distant shots, as well as the conventional glamour shots of a very hefty male and a very large female....<br>\r\n<br>\r\n\"Hey, the guy in all these photos is you!\"  Hillary exclaimed.  \"And the girl is the same everytime too!\"<br>\r\n<br>\r\n\"That's right,\" replied Conor, \"that's why...</span></div></div>",
            "created":1454907600,
            "id":2101456,
            "title":"Conor is serious"
        },
        "1421221222223":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"What about more girls?\"",
                "\"Some of those sumo boys are ugly!\"",
                "\"Do we get to keep the clothes?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, the guy in all these photos is you!\" Hillary exclaimed. \"And the girl is the same everytime too!\"<br>\r\n<br>\r\n\"That's right,\" replied Conor, \"that's why I'm going to be famous, and you can be too! Just think, Americans are getting fatter - when cool fat folks like us show that other big Americans really can wear cool brands like Avenue and Uomo Modo, then they'll hire us again.  Better, their competitors will upsize and hire us too!  We'll be in first!\"<br>\r\n<br>\r\n\"But why Joe and I?\"<br>\r\n<br>\r\n\"Well, Joe, because he's got the classic fat young American jock look going on - fat, but not as fat as I am, and sporty - while my female co-star is older than you are, and differently shaped than you - and we want women of all shapes and ages in our ads.\"<br>\r\n<br>\r\n\"So, when would this start?  Where would we have to go?\"<br>\r\n<br>\r\n\"Well, we're bringing the modelling here, as the MidWest is the heart of bigger America.  The Mall of America has agreed to host and support our photo shoots, so some will be in the Mall, the rest around Minneapolis.  We'd pay for your travel and hotel, and then a per diem - and a cut of sales of the fashions afterwards, whenever your image is used.\"<br>\r\n<br>\r\n\"Hey Joe, put down your fork and let's sign up!\"<br>\r\n<br>\r\n\"Don't you think we should ask Mum and Dad?\" Joe said, finally seeming to pay attention.<br>\r\n<br>\r\n\"They'll be good with anything that makes money for us!\" Hillary riposted.  \"It'll help pay our tuition bills later.\"<br>\r\n<br>\r\n\"It'll help pay our food bills now!\" Joe riposted in turn.  \"But, sure, as long as it doesn't interfere with sumo practice!\"<br>\r\n<br>\r\n\"Sumo?\" Conor asked.  \"Are there other guys on your team?  We'd sign up more of them!\"<br>\r\n<br>\r\n\"Sure!\" replied Joe.  \"Some of them would love to be stars - we're  all planning on getting bigger, anyway.\"<br>\r\n<br>\r\n\"Bigger is good, especially when it's sporty,\" Conor replied.<br>\r\n<br>\r\nHillary jumped in.</span></div></div>",
            "created":1474866000,
            "id":2215207,
            "title":"Fame?"
        },
        "14212212222233":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "food...",
                "clothes..."
            ],
            "content":"<div class=\"\"><div> <span>\"Bigger is good, especially when it's sporty,\" Conor replied.<br>\r\n<br>\r\nHillary jumped in. \"Do we get to keep the clothes?\"<br>\r\n<br>\r\n\"Of course!  And if you keep talking about them, you'll get more!\"<br>\r\n<br>\r\n\"Well, then, when do we start?  Oh, and is there food at the photo shoots?\"<br>\r\n<br>\r\n\"Well, not always at, we want to keep the clothes clean for the shooting - except when you're actually eating for the photos.  For instance, you might be standing eating an ice cream.\"<br>\r\n<br>\r\n\"Joe, let's do this!\"<br>\r\n<br>\r\nConor produced paperwork for them to sign, and some suggested timelines.  Joe and Hillary took these, plus some extras for Joe's sumo teammates, and they agreed to meet again at Joe and Hillary's house the following Tuesday.<br>\r\n<br>\r\nThat Tuesday, as well as Joe and Hillary and their parents, some of the sumo team came along, and even one of their girlfriends, an acquaintance of Hillary's called Samantha.  Conor came with schedules, tickets, and </span></div></div>",
            "created":1482123600,
            "id":2252080,
            "title":"Hillary: \"Do we get to keep the clothes?\""
        },
        "142122122222331":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "another big lad...",
                "a woman who smiled warmly at Joseph..."
            ],
            "content":"<div class=\"\"><div> <span>That Tuesday, Conor arrived at Joe and Hillary's parents' home with a cargo van.  He came to the door holding releases, schedules, and tickets.<br>\r\n<br>\r\nAfter a quick round of introductions, Conor asked, \"Can some of you husky guys help haul in the trunks and coolers in the back of the van?\"<br>\r\n<br>\r\n\"Coolers?\" Hillary questioned.<br>\r\n<br>\r\n\"Oh yeah, I want to keep you all happy, figured food was the best way to do that. Hard to hold a relaxed pose if you're peckish.\"<br>\r\n<br>\r\n\"That's true,\" admitted Hillary.<br>\r\n<br>\r\n\"Once the boys have the coolers in, unpack the first couple onto a table, while I scout out your house and yard for good test shooting locations.\"<br>\r\n<br>\r\n\"I thought,\" asked Hillary, \"that you said some of the shooting would be at the Mall of America?\"<br>\r\n<br>\r\n\"Oh yeah, but not this first round - first let's see how you do in your own environment, where you'll be more relaxed.\"<br>\r\n<br>\r\nThe coolers turned out to have a grand mix of snack foods, oriental take-out, and finger foods. Hillary appointed herself microwave-reheat operator, which gave her first dibs on everything warm, but the quantities were generous - and by the time the hungry bunch of teens had emptied the first cooler, Conor was back and opening the first trunk.  The doorbell range, and a photographer strode in, who was<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1562688000,
            "id":2684387,
            "title":"Conor understands food as a come on."
        },
        "1422":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "we got get something to eat...",
                "we got catch a show....",
                "you leave me alone, and I'll leave you alone..."
            ],
            "content":"<div class=\"\"><div> <span>\"That's pretty rich coming from you, Mr. Quiz Show Team Captain!\"  Hillary snapped.  \"As if quiz shows are anything to boast about.\"  <br>\r\n<br>\r\n\"Hey, Hill, cool your jets,\" Joseph replied, stung.  \"How's about ....<br>\r\n <br>\r\n</span></div></div>",
            "created":1210568400,
            "id":530970,
            "title":"Mr. Quiz Show Team Captain!"
        },
        "14221":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "was pushing 300 pounds himself...",
                "had the kind of metabolism that burnt off every calorie..."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, Hill, cool your jets,\" Joseph replied, stung. \"How's about we go get something to eat...\"<br>\r\n<br>\r\nOf course, Joseph had suggested this because he knew his sister well - anytime she could eat, all other worries would be discarded.  After all, that's how she'd gotten to 400 pounds at sweet 16, and Joseph knew it.  Not that he didn't like to eat, though - he wasn't much of an athlete, and the quiz show team, making great marks and food were the three pillars of his life.  He liked to eat, and...<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1238734800,
            "id":670476,
            "title":"Joseph suggest food"
        },
        "142211":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "\"The Golden Key,\" Hillary suggested.",
                "\"The golden arches?\" Hillary asked."
            ],
            "content":"<div class=\"\"><div> <span>Of course, Joseph had suggested going out for food because he knew his sister well - anytime she could eat, all other worries would be discarded - that's how she'd gotten to 400 pounds at sweet 16. <br>\r\n<br>\r\nNot that Joseph didn't like to eat, though - he wasn't much of an athlete, and the quiz show team, making great marks and food were the three pillars of his life. He liked to eat, and it showed - he was pushing 300 pounds himself, or so he thought...well, back in September he'd been pushing 300 pounds, a term of sitting and studying had pushed him over the 300 mark now.<br>\r\n<br>\r\n\"Great idea!\" Hillary replied. \"You driving?\"<br>\r\n<br>\r\n\"Sure!\" said Joseph, whose car had been a reward from his parents for pulling off straight As last year.  Of course, getting to drive everywhere instead of biking or busing had done only positive things for his weight too.  He grabbed a jacket, while his sister grabbed hers - pale pink, of course, and size 4XL - and the two of them headed out the door, the combination of their bulk making the stairs shake a little.<br>\r\n<br>\r\n\"So, where to, 'little' sister?\" Joseph asked.  He grinned as Hillary landed one pudgy hand into his padded midriff.<br>\r\n<br>\r\n<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1240808400,
            "id":682368,
            "title":"Joseph's no lightweight himself"
        },
        "142212":{
            "author_id":"jellobuns",
            "author_name":"Jellobuns",
            "choices":[
                "They go to a buffet and stuff Hilary near to bursting",
                "Joseph shanghais her into something outrageous"
            ],
            "content":"<div class=\"\"><div> <span>Joseph never got the chance to be fat so it was up to his Hyper-Heavy Sister Hilary to do so. And despite his love of eating, he had managed to instill an even greater love of it in his not-so-little sister. Watching her fat balloon butt jiggle around was one of his favorite past times. Yes, his little sister had grown up and out to be quite attractive and he was jealous of whoever got their hands on her big fat self. <br>\r\n<br>\r\nAt the mere mention of food, Hilary's eyes lit up behind her glasses and she swallowed what she was eating. Joseph knew that the more he pushed and prodded her to get fatter by making fun of her, the bigger she would swell up to spite him. The girl had quite a mouth on her though. She dusted herself off, causing a stampede of jigglage through her blubberous form as she stood up and got put together to head outside. <br>\r\n<br>\r\nOnce inside the confines of her good sized room, she stripped down, admiring her obesity in the mirror. She was impressed with herself, for accumulating such bulk while still maintaing a mostly smooth form, Her belly was a pair of large rolls, and her love handles poofed over her panties. Her arms were impressively thick, and she flexed, amused at their drooping softness. Of course she had comparatively large breasts but they failed to match up to the size of her gigantic rear end. The giant mounds of flesh behind her were bigger than watermelons and quaked and quivered with her slightest movements. She tossed on a pair of reliably stretched out jeans and pulled on a t-shirt that accented her doughy torso, shrugged on a long coat and put her flat cap on. With a quick flip of her ponytail she wobbled out towards the door, slipping on her sandals and waiting.</span></div></div>",
            "created":1240722000,
            "id":682134,
            "title":"A Look at a Fat Sister"
        }
    },
    "info":{
        "author_id":"silverjinzo",
        "author_name":"Silverfighter",
        "brief_description":"Hilary is big and wants to be bigger!",
        "created":1055038440,
        "description":"<td align=\"left\" class=\"norm\">Hilary is your typical Asian girl...except the part she's around 400 lbs and wishes to be even larger. She lives in the midwest, and wants more bulk. Hilary doesn't realize her wish may come sooner than she thinks...</td>",
        "id":702179,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600810800,
        "modified":1600810800,
        "pretty_title":"The Asian Whale of the Midwest"
    }
}