{
    "chapters":{
        "1":{
            "author_id":"g-writer",
            "author_name":"G-Writer",
            "choices":[
                "Re-Meet the Feet",
                "For a \"Healthier\" You",
                "The More You Know...",
                "Enter Samantha",
                "Dropped Off or Given Away (Reserved.)"
            ],
            "content":"<div class=\"\"><div> <span>(PLEASE READ THE END OF THE STORY DESCRIP./INTRO FOR THE BEGINNING OF THIS CHAPTER!!!  I got a little over-ambitious and was over 2500 characters over the limit. &gt;.&lt; )<br>\r\n<br>\r\n<br>\r\nUnfortunately, you are so mesmerized by this jiggling that you miss what you should really be paying attention to as the woman moves her foot so fast to regain her balance that it slips right out of the slipper…  Just in time for her to SLAM her foot down on you with a wet SQUESPLAT!!! <br>\r\n<br>\r\nYou are sure you’re dead, but you soon wish you were as you find your body being smothered under the squishy, sweaty foot flesh, only to realize that your head is stuck between two of her toes!  You try to kick and flail, but her weight is too much, and you only succeed in getting her to squeeze her toes around your head, you finding out first hand that she has massive amounts of toejam along with the sweat as they are both forced down your throat.  You want to throw up, but sweat and toe grime keeps making it’s way into your mouth, leaving you so disgusted that you don’t even notice her moving her foot back into her slipper until it’s too late and you are encased in the most disgusting prison you could ever imagine without your “warden” even aware of your presence.<br>\r\n<br>\r\nWhile you are forced through foot gunk hell, Rachel Saxonette settles in as she grabs an old journal out of one of the nearby boxes.  It had suddenly hit her today that now that her youngest had moved out that she was well and truly alone, and how much she really missed her kids well… being kids.  She hoped that whatever was in the box she had felt crunch under her wasn’t too important, wiggling her toes frantically to try to wipe off whatever had gotten stuck to her foot onto her beloved slippers.  She giggled as she realized that the journal she had just grabbed was from the same year she had gotten these slippers, back when her oldest was still fairly young.<br>\r\n<br>\r\n“’Samantha’s Facts About an Extra-Super-Duper, Double-Triple Rare Pixie, the Vexie’ by Samantha.  Oh geez, the only thing she had more of than smarts at that age was her imagination, and that girl had truckloads of smarts…”  Rachel flipped open the book, her curiosity and nostalgia not allowing her to ignore such an old gem by her eldest, even allowing her to ignore whatever was bothering her in her slipper, or at least just play with it with her toes for now.<br>\r\n<br>\r\n“’Fact 1: Fairies exist, they are rare.<br>\r\n<br>\r\nFact 2: Pixies exist, they are rarer.<br>\r\n<br>\r\nFact 3: Vexies are a kind of Pixie, and they are extra-super-duper, double-triple rare.  If you are reeeeeally lucky and find one, they make great pets!!!<br>\r\n<br>\r\nFact 4: Fact 4: Even though Vexies look like tiny humans, they act more like tiny ogres.  They like gross things, and they like to live in gross places, but they like human gross things the best.<br>\r\n<br>\r\nFact 5: Smelly places are the best.  Places that smell like feet or sweat are better. But I think they like stuff that smells like bum-bums the bestest ‘cause they’re the smelliest!’<br>\r\n<br>\r\n“Hahaha, she did call butts ‘bum-bums’ back then, didn’t she?”  Rachel let out a little of a laughing fit, her pudge jostling as she ground her foot into the slipper, the tickling between her big and second toe getting worse but not bad enough for her to check yet as she continued reading.<br>\r\n<br>\r\n“’Fact 6: Vexies like meeting humans, but they’re reeeeeally shy, so they play hide and seek!  Sometimes they like to hide in clothes and stuff so people will find them when they put them on!’<br>\r\n<br>\r\n“Haha, maybe that’s what’s in my slipper!  Well I hope he’s enjoying himself down there.”<br>\r\n<br>\r\nIf only she knew…<br>\r\n<br>\r\n“’Fact 7: Vexies like humans so much, they want to be one!  If you find one, he will try to tell you he is a little human!<br>\r\n<br>\r\n‘Fact 8: Vexies know humans don’t like gross things, so they will say they don’t either, but…<br>\r\n<br>\r\n‘Fact 9: If they don’t get enough gross human stuff, they can get sick!  Don’t worry, you can be as icky as you want around them, and they’ll just like you more!  Actually, the more they complain, the more they probably like it!’<br>\r\n<br>\r\n“Haha, I’m starting to like these little Vexie guys more and more, if only Samantha had actually found one!<br>\r\n<br>\r\n‘Fact 10: Vexies are tricky.  They want to be human so bad, they will tell you anything to get you to be not gross.  But they really like it and even need it, so don’t listen no matter what!<br>\r\n<br>\r\n‘Fact 11: If you really love your Vexie, you’ll tell your friends about them!  Sometimes your Vexie will be sad you don’t believe he’s human and will try to run away!  But if you tell all your friends about him, they can make sure he gets the icky stuff he needs if they see him!’<br>\r\n<br>\r\n“This is the best, and there’s a bunch more!  You know what?  I’m posting this on the blog!  Hahaha!”<br>\r\n<br>\r\nYou can only cry as you feel the pressure around you increase to an insane degree as Rachel gets up to go upstairs.  By this time you’ve kissed, licked, and ingested just about everything Rachel’s toes and slippers have to offer, more of her toe junk filling your stomach than food did last Thanksgiving.  Unfortunately all you could do was struggle in vain as she played with her “imaginary” Vexie, or whatever the hell she called you, now subjected to be slammed and smothered repeatedly by the most disgusting foot you could ever hope to imagine.  By the time she’s upstairs and sits to scan the journal, you feel like the entire earth fell on you… multiple times.<br>\r\n<br>\r\nYou soon hear some typing as she apparently finishes scanning the journal, whatever very small part of you not preoccupied with her foot actually feeling a little sorry for this behemoth’s daughter.  She hadn’t even read the whole thing, what if there were some kind of secrets in there?<br>\r\n<br>\r\nClinging to any kind of escape, your mind is so focused on this thought that you don’t notice until you are suddenly hit with a blast of cool air that Rachel is taking her foot out of the slipper.  “Perfect!  Now that that’s posted, time to find out what the hell was in my—“  You suck up clean air as best you can, struggling like mad and hoping to get away when you suddenly feel her fingers grab you and peel you off her foot.  “Oh my lord…”<br>\r\n<br>\r\nYou both stare at each other for what seems like eternity, part of you still wanting to run away until you realize that her noticing you was what you were going for in the first place.  You open your mouth to introduce yourself when Rachel suddenly cuts in.  “You’re… YOU’RE A VEXIE!!!”<br>\r\n<br>\r\nYou can only blink a few times at this.  Sure, you had heard her read the journal but… she couldn’t actually BELIEVE all that… could she?  “Umm… no…  actually I know you were just reading about that but I’m definitely human…  I’m not really sure how I got this size but—“<br>\r\n<br>\r\n“Oh my gosh… It’s just like the fact sheet said!  I mean, that’s the only thing that makes sense!  I mean if you were human, you would KNOW how you got shrunk, right?  And it said they like to hide in people’s clothes until they wear them and…  I’m sorry but NO ONE in their right mind would INTENTIONALLY get anywhere NEAR my slippers.  Hahaha!”<br>\r\n<br>\r\nYou can’t believe how crazy this lady sounds, but you are also horrified to admit that this IS very coincidental.  “L-listen, I didn’t do it on purpose…  I woke up in your basement, and then you came down, and I was going to get your attention and—“<br>\r\n<br>\r\n“And you were just too shy to get it, right?  So when I took my foot out of the slipper, you just jumped right in!  Haha, and here I thought Samantha had just made all of this up!  This is insane!”<br>\r\n<br>\r\n“Yes it is!  You can’t REALLY believe that I’m a—“<br>\r\n<br>\r\n“Aaawww, come on now, don’t worry.  I know what you are, and I know you want to be human, but… well…  You’re kinda obviously not.  Sorry little guy.  But this is great!  Here I thought I’d be all alone now, and I end up finding this fact-filled journal and you instead!”<br>\r\n<br>\r\nYou feel like crying, having no idea how to convince this crazy woman that you actually ARE a human.  Maybe if you can get away from her—“Don’t worry little guy, I’ll take extra special care of you!  I’m Rachel, and you’re my new pet!  I’ll even call you… V!  Yeah, that’s it!  V for Vexie!  Hahaha!  And lucky you, even if you get mad and run off like it says, so many people read my blog that they’re bound to learn all the facts about you little ones so they can make sure you stay nice and healthy!!!”<br>\r\n<br>\r\nYou can’t believe this is happening…<br>\r\n<br>\r\nChoices:<br>\r\n<br>\r\n1.\tRachel is worried you’ve been away from the grossness that is her slipper for too long, so decides to re-introduce you to her feet to keep you “healthy”. <br>\r\n<br>\r\n2.\tRachel thinks you’re looking kinda sick, so comes up with something “better” than her slippers for you to enjoy.<br>\r\n<br>\r\n3.\tRachel reads some more “facts” to make sure she’s taking care of you properly, and being a Vexie only gets worse.<br>\r\n<br>\r\n4.\tSamantha was in the neighborhood and having read part of the blog post comes bursting through the door to complain to her mom.<br>\r\n<br>\r\n5.\tShe has second thoughts, and decides to either set you free somewhere (you have to try and get someone else’s attention) or knows someone who will REALLY be able to take care of your gross needs.</span></div></div>",
            "created":1381681320,
            "id":1678367,
            "title":"The Vexie"
        },
        "13":{
            "author_id":"g-writer",
            "author_name":"G-Writer",
            "choices":[
                "Sock Separator",
                "Buried in Your Work",
                "Her Dirty Secret",
                "The \"Better\" Option",
                "And Now... You're a Plumber"
            ],
            "content":"<div class=\"\"><div> <span>You open your mouth to protest once again about not being a Vexie, but Rachel just chuckles and puts a greasy finger to your mouth (or more accurately, over your entire face) to quiet you.  “I get it V, you’re just a teeny tiny human who happens to REALLY like my sweaty feet.  Well I can’t have my new little “human” getting sick on me, so lets see what else there is to read here…”<br>\r\n<br>\r\nYou scream internally as Rachel begins to read silently to herself, apparently the only thing worse than knowing she’s reading more of these “facts” is not knowing what facts she’s reading!<br>\r\n<br>\r\n‘Fact 12: Even though they’ll never admit it, Vexies love spending time doing disgusting things with or even for humans!  They love helping with icky chores!  <br>\r\n<br>\r\n‘Fact 13: If a Vexie won’t do something or is being naughty because he’s acting human…  You can trick them!  Tell them if they do it or behave, you won’t bury them in dog poo!  That way, you can be happy because your Vexie did what you wanted, and your Vexie can be happy because he can do the icky stuff without having to admit he’s not human (‘cause humans don’t like dog poo on them either)!<br>\r\n<br>\r\n‘Fact 14: The only thing that a Vexie likes almost as much as gross human stuff is hearing gross human secrets about you!  He won’t tell anyone else, so make sure you tell him every gross thing you can think of!’<br>\r\n<br>\r\n“Oh wow, you ARE gonna make an amazing pet, V!  I just came up with the perfect way for you and me to bond!  You’ll get to do a nasty chore I’m always putting off, and you’ll get to learn something about me!”<br>\r\n<br>\r\nYou glare at the behemoth in front of you as she finally moves her finger off your face, immediately defiant.  “I’m not doing ANY chores for you, nasty or otherwise!  I’m a human, you can’t make m—“<br>\r\n<br>\r\n“Now, now, V…  No need to be all feisty…  How about this, as long as you do what I say and behave, I won’t have to bury you in dog poo!  It says here even you wouldn’t like that.”<br>\r\n<br>\r\nYou can only stare in disbelief.  NO ONE would like that!  You are about to yell at Rachel again, but have second thoughts.  There was no reasoning with this woman, so your only hope is to try and survive while staying on her good side until you can escape…  You certainly won’t be able to get help buried under a pile of dog poo, and you have no doubts that Rachel would go through with the threat, so…  Dejectedly, you nod your head in defeat.  “Fine…  I’ll behave…”<br>\r\n<br>\r\nRachel lets out a fit of laughter, raining small droplets of spittle on you as she does, apparently very proud of herself.  Oh my gosh, that worked just like the fact journal said!  That was so easy, I mean I don’t even have a dog!  You sit dejectedly in her hand as she gets up and walks to what you think must be her bedroom, the place decidedly smelling very… Rachel.  You’ve come to terms that you won’t be able to get away until after this chore most likely when Rachel suddenly speaks up again.<br>\r\n<br>\r\n“Alright, so here’s the deal.  I hate having to do laundry because I hate having to sort the dirty clothes into lights and darks, so…  You’re going to do it for me!  So first, what to start with…?”<br>\r\n<br>\r\nChoices:<br>\r\n<br>\r\n1.\t“Well we know you like my feet, so separate the socks that still kinda look white from the really dirty ones!” (She shares a “secret” about her feet.)<br>\r\n<br>\r\n2.\t“Well it all needs to get done, so let’s just get you started!”  (The secret is she hasn’t done a load of laundry since her youngest left, and she proceeds to bury you in her dirty clothes.)<br>\r\n<br>\r\n3.\t“Since you promised to be good, I’ll let you sort my undies!  (Very dirty secret.)<br>\r\n<br>\r\n4.\t\"Then again...  Maybe you'd like to lick my slippers clean instead?\"<br>\r\n<br>\r\n5.\t\"Wait...  I just remembered the toilet hasn't been cleaned in ages...  If you're lucky it might even be clogged!\"<br>\r\n</span></div></div>",
            "created":1381683360,
            "id":1678390,
            "title":"More Facts = Less Happiness"
        },
        "133":{
            "author_id":"g-writer",
            "author_name":"G-Writer",
            "choices":[
                "Get to Work",
                "Playtime is Important",
                "\"Reward\""
            ],
            "content":"<div class=\"\"><div> <span>Rachel smiles as if you should be paying her for “letting” you do her such a service, all as you just feel like crying but do your best to keep quiet, knowing there’s a big pile of dog poo with your name on it if you protest.  Unfortunately, Rachel just takes this as a good sign.  “Hahaha, I just knew you’d like that idea, not even a peep of protest!”  You roll your eyes in response.  Was there absolutely no winning with this woman?<br>\r\n<br>\r\nYou actually throw up in your mouth as Rachel grabs a lidded whicker basket and overturns it, a veritable rainbow of VERY used undies flowing out and all over the bedroom floor.  You can’t help but notice that even with how huge each pair of undies is, all of them look sizes small compared to Rachel’s planet of a butt.  Luckily you force yourself to look away before you really look at them in too much detail; unluckily you can’t so easily avoid the stench that comes wafting up from the pile like some sort of mummy’s curse, sending you on a dry heaving fit that Rachel just chuckles at.<br>\r\n<br>\r\n“Okay, V, what I’m gonna need you to do is separate the lights from the darks, and then separate the ones I can run in the delicates cycle from the ones I need to have set to heavy duty!  You’ll just love this chore, don’t worry about thanking me!”<br>\r\n<br>\r\nYou are so floored it actually takes a few moments for it all to sink in.  Not only does this woman want you to sort her disgusting dirty panties, but some of these panties are so dirty they’ll have to be run under a heavy duty cycle?  You do your best not to try and envision what that would entail, but fail miserably as horrendous images flash through your mind, leaving you in a stupor as Rachel keeps blissfully making your life hell.<br>\r\n<br>\r\n“Oh, and you wanna know a really, really, reeeally dirty secret no one knows about?  Haha, of course you do!”  You try to cover your ears, not wanting to hear anything more that this woman has to say, but her voice is loud enough that it makes no difference.  “See, whenever I wear panties, even though I know they’re my size, they always bunch up and give me HORRIBLE wedgies.  Ever since I was in highschool.”  You cringe for the umpteenth time today, not really needing to have that image added onto the others flashing in your mind, only to find that this wasn’t the secret Rachel was talking about.  “So I used to always be picking or scratching at my butt crack.”  You vomit in your mouth again, but Rachel just continues.  “But it’s annoying to have to reach back all the time, and it’s hard to itch the really deep parts when I do, so…  I figured out that when it gets itchy, if I fart, the itch goes away!  It even kinda tickles a little! Hahaha!”    It’s all you can do to keep from throwing up all over Rachel’s hand, your only saving grace being that Rachel has finished telling you her secret… “But all the kids in my family know that, even a few friends!”  Or so you thought.  “The secret no one knows but me and now you, V, is that I have reeeally bad IBS now, so…  Pretty much every time I fart, more than farts come out.”  You lean to vomit, but thinking you’re about to protest again, Rachel covers your face with her thumb, forcing you to swallow it back down.  “So most of my panties are VERY dirty, so I keep them separate from everything else, and I don’t usually wear them at home.  Too bad for you I haven’t been out in a few days, so there’s not really any new panties for you, but they still should be nice and icky!<br>\r\n<br>\r\nYou are seriously considering whether being buried in dog poo might be better than being around this woman any longer when Rachel apparently decides to start you on your task.  You are startled to find yourself falling through the air as she chuckles, dropping you straight into the middle of the horrendously soiled undies.  You thrash and flail as you tumble into the deepest part of the pile, panties of every varying degree of disgusting soon becoming your entire world.  You finally do vomit as you come to a stop, but even the smell of all of your previous toe jam “breakfast” is nothing compared to the smell that is attacking and completely engulfing you at present.<br>\r\n<br>\r\nIt only takes a few moments for you to completely panic, kicking, clawing, flailing, and crawling every which-way you can to try and get out of this decrepit pile of undies.  After touching more disgusting surfaces than you can even imagine sources for, you eventually see some light through the used-panty-scented haze and make a break for it, only to trip at the last second over a random waist strap.  Before you know it you are wrapped up and completely tangled in something, the scent of old shit and ass sweat somehow increasing even more as you feel an especially horrible substance being rubbed all over your body.<br>\r\n<br>\r\n“Haha, oh my gosh…  And here I was thinking that this might have been a little much even for a Vexie, and it turns out that you’re rolling around in the back of my undies even after me telling you my secret!  Not only that…  Wooow, you chose THOSE ones to roll around in?  Those are the ones I wore last week and had an actual accident in after all those tacos…  I guess Samantha was right, you DO like bum-bums the bestest! Hahaha!”  You can only cry muddy tears of despair as with every attempt to get out you only seem to get more trapped/tangled…<br>\r\n<br>\r\nChoices:<br>\r\n<br>\r\n1.\tRachel untangles you, saying you’ll have plenty of time to “play” between loads after you’re done sorting. <br>\r\n<br>\r\n2.\tRachel let's you \"play\" for a while in the undies.<br>\r\n<br>\r\n3.\tShe thinks you’re being so “cute” that she decides to put off the chore for now and to wear the undies you’re in…  With you still in them! (Reserved)</span></div></div>",
            "created":1381683600,
            "id":1678393,
            "title":"Rachel’s Dirty “Little” Secret"
        },
        "1333":{
            "author_id":"g-writer",
            "author_name":"G-Writer",
            "choices":[
                "Little Red Number",
                "Well...  They USED to be White...",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>“You are the best pet a lonely woman like me- hell, ANY woman could ask for!  I don’t know why you want to be a human so bad…  I mean, if you were human there’s no way you would get anywhere NEAR my undies, let alone snuggle into the back of a pair I had an accident in!  You know what…  Since you’re being such a cutie…  I’ll let you stay in those undies, and…  I’ll even wear them for you!  If you’re lucky, maybe they’ll make me extra itchy!”<br>\r\n<br>\r\nYou cry, scream, and flail, but Rachel either doesn’t hear you or thinks you’re just acting human again.  You hear a lot of rustling around outside your tangled undies, soon followed by a sickening KERSPLOPP as Rachel’s pants hit the floor.  When she untangles the undies to put them on, you are fully ready to make a break for it…  But when you can finally see again, your vision is filled by the jiggling towers that are Rachel’s legs holding up planet-sized butt cheeks, all of which are covered in cellulite.  Despite your plans, you are completely frozen to the spot as she yanks you up closer and closer to her bum, only able to notice what specifically you are in before you meet your fate…<br>\r\n<br>\r\nChoices:<br>\r\n<br>\r\n1.\tYou’ve been tangled in a tiny red thong, ready to be driven on the fast track into the dankest part of Rachel’s bum.  You’ll be point blank for any itches or accidents.<br>\r\n2.\tYou were in a very small (maybe it was actually one of her daughters’ at some point?), formerly white pair of panties that now have the back end painted a horrible combo of green/brown.  Although you’ll start outside her bum cheeks at least, she DID say she gets really bad wedgies…  (And these ones will hold more if she has an accident.)<br>\r\n3.      Reader's Choice</span></div></div>",
            "created":1381683900,
            "id":1678394,
            "title":"Rachel Butts In"
        },
        "13331":{
            "author_id":"randomnessguy1",
            "author_name":"Sir_Buttkiss",
            "choices":[
                "You went all the way in during your slumber.",
                "You are somehow pushed out and is back to crack,"
            ],
            "content":"<div class=\"\"><div> <span>The thong easily went up her huge bum, despite being a size smaller than it. You were wedged deep within her crack and her backdoor is right before you. It can easily swallow you and bring you to a place where you can never be found again. That thought alone makes you shudder, and the outside look just as bad! There are stains everywhere and her anal hairs are like a tall grass.<br>\r\n<br>\r\n\"Do you like it, V?\" You heard Rachel said happily. \"I didn't clean it for an entire week and I dump without washing! This should make you so healthy!\" She said while giggling like a little girl. You just want to puke, but you already let it all out a bit while ago. You started struggling wildly, which caused her an itch. She reached down to her asshole with her finger to scratch it and ends up pushing your head in. This surprised her and caused her to let out an extremely putrid gas. \"Wow! That sure was smelly.\" She said as she caught a whiff of her fart. \"You sure are amazing to like something gross like that, but if it makes you happy I'll be as gross as possible!\" She added.<br>\r\n<br>\r\nBack there. You caught a glimpse of her rectum before it blasted a fart right to you. It was like hell! Wastes on every side and it was so smelly, and damp. The heat was to intense. Her rectum is like a pressure cooker! As soon as you tried to push you head out. She blasted a fart which caused you to fall unconcious.</span></div></div>",
            "created":1385192340,
            "id":1697952,
            "title":"Little Red Number"
        },
        "15":{
            "author_id":"g-writer",
            "author_name":"G-Writer",
            "choices":[
                "Taco Paradise (See Also: Taco Hell)",
                "When Is Going to the Gym Bad for You?",
                "Helping Out the Working Women",
                "To Date a Vexie",
                "Perfect Match"
            ],
            "content":"<div class=\"\"><div> <span>You rack your brain for any way to convince this crazy lady that you are NOT a Vexie, not to mention remove her blog post, but you keep coming up blank.  This lady was just too far gone.  The only thing you could think of was escaping, but even that had its disadvantages, as getting someone else's attention could prove as... unfortunate as getting Rachel's.  For better or worse, Rachel ends up taking care of things for you.<br>\r\n<br>\r\n\"You know what though...  I've never had much luck taking care of pets...  I mean I swore I wouldn't have another one after I accidentally sat on all three of my daughters' hamsters... All with one plop of my butt, too!\"  You shiver at the thought, not really wanting to know how that all played out.  \"And not to mention, I'm not sure I'm gross enough to keep a cutie pie like you healthy!  I would feel just horrible if you got sick!\"  You can only roll your eyes, knowing full well with your run-in with Rachel's slippers alone that if you WERE a Vexie, you'd be the healthiest one ever just hanging around her.  \"So although I'd just LOVE to keep you, it might be best if I didn't...\"<br>\r\n<br>\r\nYou instantly cheer up, at worst you wouldn't have to put up with this woman anymore, at best you might be able to convince her to go to the hospital!  Unfortunately your cheer is short-lived as she continues before you can interject.  \"But don't you worry!  I know JUST where to take you that will be just PERFECT for my little V!\"  You cringe, sure your day isn't going to be getting better any time soon...<br>\r\n<br>\r\nChoices:<br>\r\n<br>\r\n1. \"I'll take you to Taco Paradise!  They don't have air conditioning, and if the food isn't giving you the toots, it's giving you even worse!\"<br>\r\n<br>\r\n2. \"That new women's only gym is the perfect spot for you!  They don't even have showers in the locker rooms, so it'll be your perfect climate!\"<br>\r\n<br>\r\n3. \"The construction site near my work is FULL of big, sweaty women who'd LOVE to have a little helper like you!\"<br>\r\n<br>\r\n4. \"Maybe I could make a profile for you on a dating site?\"<br>\r\n<br>\r\n5. \"I know the PERFECT person to take care of you!!!\"</span></div></div>",
            "created":1388134140,
            "id":1714321,
            "title":"Dropped Off or Given Away"
        },
        "154":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "raven Banesworth  a 400 pound goth girl high school freshmen ",
                "marry jonson a nerdy girl with irritable bowl syndrome    ",
                "some one else "
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nthe crazy lady to a picture of you with her cell phone<br>\r\nthen she went online and made a dating profile for you<br>\r\n<br>\r\nname v<br>\r\nage 18-24<br>\r\nsex male<br>\r\nrace Vexie<br>\r\norientation strait  <br>\r\nspecial interest any thing gross<br>\r\n<br>\r\n Vexies like meeting humans, but they’re reeeeeally shy, so they play hide and seek! Sometimes they like to hide in clothes and stuff so people will find them when they put them on!<br>\r\n Vexies are tricky. They want to be human so bad, they will tell you anything to get you to be not gross. But they really like it and even need it, so don’t listen no matter what!<br>\r\nVexies know humans don’t like gross things, so they will say they don’t either, but this is a lie<br>\r\n If a Vexie won’t do something or is being naughty because he’s acting human… You can trick them! Tell them if they do it or behave, you won’t bury them in dog poo! That way, you can be happy because your Vexie did what you wanted, and your Vexie can be happy because he can do the icky stuff without having to admit he’s not human <br>\r\nVexies Smelly places \the best. Places that smell like feet or sweat are better. But I think they like stuff that smells like bum-bums the bestest ‘cause they’re the smelliest! <br>\r\n<br>\r\nas soon as she made it the dating profile allredy had its first hit who was it <br>\r\n<br>\r\n1<br>\r\nraven Banesworth  a 400 pound goth girl high school freshmen <br>\r\n<br>\r\n2<br>\r\nmarry jonson a nerdy girl with irritable bowl syndrome    </span></div></div>",
            "created":1418176020,
            "id":1900194,
            "title":"To Date a Vexie"
        },
        "1541":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "raven's home",
                "the dungeon that goth bar on 7th street",
                "Denny's 2am "
            ],
            "content":"<div class=\"\"><div> <span>Rachel read her message<br>\r\n\"hi V just saw your profile, the site sent it to me based on compatibility, and after reading it i just knew that we would be perfect for each other\"<br>\r\n<br>\r\nRachel  then took a look at the girls profile and looked at her profile picture <br>\r\nname <b>raven Banesworth</b><br>\r\nsex female<br>\r\nrace Caucasian<br>\r\norientation bisexual <br>\r\n\"i'm a <b>big </b>goth who works at Moon Bitches an all girl under 21 goth club. i'm looking for that special boy or girl to be the sub to my Dom.\"<br>\r\n<br>\r\nfrom the look of her profile pic she appeared to be a teenage goth girl with medium length hair that was died black. while she was quite fat, her belly was more rounded than saggy, and she had a large jiggly ass.<br>\r\nRachel must have been impressed because when she was done reading her profile she immediately replied to raven<br>\r\n\" after reading your profile i can tell that you do indeed seem like the perfect girl, is there any where in particular that you would like to meet for the date?\"<br>\r\n<br>\r\nafter a couple of minutes wait raven sent her reply<br>\r\n\"yes, lets meet up at _____\"<br>\r\n<br>\r\noption 1 my house <br>\r\noption 2 the dungeon that goth bar on 7th street<br>\r\noption 3 Denny's 2am <br>\r\n</span></div></div>",
            "created":1502352780,
            "id":2367349,
            "title":"raven Banesworth  a 400 pound goth girl "
        },
        "1543":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Ginny,Rachel's 200 pound little sister ",
                "Darlene a 700 pound high school lunch lady  ",
                "some one else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>1 <br>\r\nGinny,Rachel's 200 pound little sister <br>\r\n<br>\r\n2<br>\r\nDarlene a 700 pound high school lunch lady  </span></div></span></div>",
            "created":1418176140,
            "id":1900197,
            "title":"some one else "
        },
        "155":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Middle Sister Tiffany Saxonette",
                "Younger Sister Sarah Saxonette",
                "Create original character "
            ],
            "content":"<div class=\"\"><div> <span>Rachel smiled<br>\r\n\" I know the perfect person to take care of a little vexie like you.\"<br>\r\n<br>\r\nOption1 Middle Sister<br>\r\n<br>\r\nTiffany Saxonette-<br>\r\nAge Range: 19-24<br>\r\nHeight: 5 ft 5<br>\r\nHair Color: Auburn<br>\r\nWeight Range: 120-140<br>\r\nBody Type: ruler/ banana<br>\r\nBody Comp.: she has a nice balance of body fat and muscle<br>\r\nDescription: Tiffany spends a lot of her time working out as she used to be a cheerleader when she was in high school, what are years he has kept up with her workout routine.<br>\r\nThis means she spends a lot of time at the gym working out so she's most always incredibly sweaty.<br>\r\n<br>\r\nOption 2 Younger Sister<br>\r\nSarah Saxonette-<br>\r\nAge Range: 18<br>\r\nHeight: 4 ft 4<br>\r\nHair Color: dyed black with pink streaks<br>\r\nWeight Range: 200-300<br>\r\nBody Type: extreme pair like her mother<br>\r\nBody Comp.: just like her mother she has art hardly any muscle compared to body fat<br>\r\nDescription: a genius goth girl after her mother in the looks Department, Sarah graduated high school at the age of 16 after which she began attending the college in town. Just like her mother and sister she is obsessed what fairy creatures demons and witchcraft, but she's far more into it than all three of them.<br>\r\n<br>\r\n</span></div></div>",
            "created":1548260760,
            "id":2606434,
            "title":"Perfect Match"
        }
    },
    "info":{
        "author_id":"g-writer",
        "author_name":"G-Writer",
        "brief_description":"You wake up only a few inches tall, only to be confused for a rare form of pixie…",
        "created":1381679760,
        "description":"<td align=\"left\" class=\"norm\">After a night you can’t remember, you wake up to find that you’ve somehow shrunk and are now only a few inches tall!  Worse yet, you are found by a woman who is convinced you are a mythical creature that she thought until now that her daughter had made up when she was little; a rare form of pixie, the Vexie. To top it all off, it turns out that Vexies supposedly live and thrive in and around gross and/or filthy human stuff, from waste baskets to dirty clothes bins.  <br>\r\n<br>\r\nFortunately your “savior” decides your endangered species needs protection…  Unfortunately this means that you are in for a LOT of gross stuff…<br>\r\n<br>\r\nWriting Rules (may add to this as stuff arises):<br>\r\n<br>\r\nYou are immortal, invincible, and keep your shape.  No death, no gore.<br>\r\n<br>\r\nAll characters must be between 18 and 45, I’m willing to talk about raising this cap if you PM me, but there will be absolutely no underage characters allowed.<br>\r\n<br>\r\nJust about anything gross/humiliating goes, from feet to noses, from sweat to pimple gunk, and I ESPECIALLY encourage butt and toilet stuff (so be warned that there may be some chapters not everyone enjoys). :3 <br>\r\n<br>\r\nSome exceptions include… You, the Vexie, are the only male, no male-on-male action.  Soft mouthplay is acceptable, but no vore beyond that.<br>\r\n<br>\r\nIf a chapter choice has (Reserved) at the end of it, PLEASE DO NOT ADD TO THAT CHOICE!!!  It means I’m working on a chapter to add to it, but with RL time constraints, I can’t always post the same day I start typing up a chapter. ^_^;<br>\r\n<br>\r\nFeel free to have whoever your “savior” is at the time put you through the stuff for whatever reason you like as long as it matches the established character, from just wanting to do the “right thing” and being “nice”, to being grossed out/embarrassed but still wanting to “take care of you”, to actually being turned on by the “perfect pet”! :3<br>\r\n<br>\r\nFor one reason or another (use your imagination ;P ) every single person you meet, even if you get away from the Saxonette family, thinks you’re a Vexie (most likely because of Rachel’s blog [see below/first chapter]).<br>\r\n<br>\r\nAnd finally, although everyone is convinced otherwise, “you” in no way shape or form actually enjoy any of this, even if “we” really do (for instance, I happen to be very fond of bigger women, but V is horrified by Rachel’s appearance).<br>\r\n<br>\r\nCharacters So Far (Will Add as Characters are Introduced)<br>\r\n<br>\r\n“V”: You, the supposed “Vexie”.  I’ll be using “you” (I believe second-person) when talking about him, but if you make your entry in third person or need a name, whoever has you will always call you “V”.  Anyway, you woke up after a night you can’t remember and now thanks to your “savior” no matter what you say or do everyone thinks you’re a rare form of pixie…<br>\r\n<br>\r\nRachel Saxonette- <br>\r\nAge Range: 35-40<br>\r\nHeight: 6'0\"<br>\r\nHair Color: Dark Red<br>\r\nWeight Range: 200+ Pounds<br>\r\nBody Type: Exaggerated Pear Shape<br>\r\nBody Comp.: Hardly Any Muscle Compared to Fat, Cottage Cheese Thighs/Bum<br>\r\nDescription:  A single parent who’s youngest daughter (she has at least 3) just moved out after graduating high school, and who’s oldest is only 15ish years younger than her (she started with kids at an early age): your first “savior”.  Found you after you woke up shrunk, and for some reason is convinced (and has directly or indirectly convinced any and every one of your potential future “saviors”) that you are a Vexie, a type of pixie that lives and thrives in/around gross human stuff.  Apparently until finding you, she had thought her oldest daughter, Samantha, had made up “your race”, but now that she’s discovered you she can no longer be convinced that you are anything but a Vexie.<br>\r\n<br>\r\nSamantha Saxonette-<br>\r\nAge Range: 20-25 (No older than 15 yrs younger than Rachel)<br>\r\nHeight: 6’2”<br>\r\nHair Color: Chestnut Red<br>\r\nWeight Range: 180-230 Pounds<br>\r\nBody Type: Pear Shape<br>\r\nBody Comp.: Has muscle underneath her chub from years of trying to keep herself from taking on her Mother’s figure, but has been steadily losing ground, now with noticeable love handles, a huge bum, and small saddlebags on her thighs.  Unlike Rachel she has absolutely no cellulite.<br>\r\nDescription:  Rachel’s oldest daughter.  Although she is credited with “making up” your race and writing all the “facts” about it, she was apparently too young to remember.  Therefore, now that her mom has found you, she doesn’t believe that Vexies are made up either…  Tries to go to the gym as often as possible to keep her Mother’s figure at bay, but often ends up giving in to fast food and snacking enough that the only thing she has to show for it is an overflowing clothes bin of sweaty workout clothes and an often upset stomach.<br>\r\n<br>\r\n<br>\r\n“Middle Sister” Saxonette-<br>\r\nAge Range: 19-24<br>\r\nHeight: ???<br>\r\nHair Color: ???<br>\r\nWeight Range: ???<br>\r\nBody Type: ???<br>\r\nBody Comp.: ???<br>\r\nDescription: Samantha’s younger sister.  I’m leaving everything but her age blank and leaving her open for anyone to make as they can envision her (which I’ll then update on here)! ^.^<br>\r\n<br>\r\n“Younger Sister” Saxonette-<br>\r\nAge Range: 18-23<br>\r\nHeight: ???<br>\r\nHair Color: ???<br>\r\nWeight Range: ???<br>\r\nBody Type: ???<br>\r\nBody Comp.: ???<br>\r\nDescription: Samantha’s and “Middle’s” younger sister.  Can be the youngest sister (in which case she’ll have recently moved out after graduating high school), or just a younger sister depending upon how she is described. Like the middle sister, I’m leaving everything but her age blank and leaving her open for anyone to make as they can envision her (which I’ll then update on here)! ^.^<br>\r\n<br>\r\nVexie “Facts”:<br>\r\n<br>\r\nIf you haven’t read the first chapter, please do!  It’ll make a lot more sense why everyone is convinced you’re a Vexie and why everyone is treating you so horribly even if they’re in fact trying to be nice.<br>\r\n<br>\r\nIf you’re in a hurry, the quick version is these are all “facts” from Samantha’s Vexie Fact Journal, and since Rachel posted them on her blog (which is apparently popular), people who don’t even know Rachel personally can still know all the facts!<br>\r\n<br>\r\nIn either case, here’s an easy reference for all of Samantha’s “Facts” on Vexies so far!  I’ll compile these from all the different storylines, and name the writer and chapter they were first introduced in (keep in mind I reserve the right to alter your fact for grammar/in order for it to make sense out of context)!  As I said, these are from all of the chapters, even if they weren’t made in the storyline you’re adding to, feel free to use them! ^.^<br>\r\n<br>\r\n<span class=\"cborange\">Fact 1: Fairies exist, they are rare. (G-Writer; First in Chapter 1: The Vexie)<br>\r\n<br>\r\nFact 2: Pixies exist, they are rarer. (G-Writer; First in Chapter 1: The Vexie)<br>\r\n<br>\r\nFact 3: Vexies are a kind of Pixie, and they are extra-super-duper, double-triple rare.  If you are reeeeeally lucky and find one, they make great pets!!!  (G-Writer; First in The Vexie [1])<br>\r\n<br>\r\nFact 4: Even though Vexies look like tiny humans, they act more like tiny ogres.  They like gross things, and they like to live in gross places, but they like human gross things the best. (G-Writer; First in The Vexie [1])<br>\r\n<br>\r\nFact 5: Smelly places are the best.  Places that smell like feet or sweat are better. But I think they like stuff that smells like bum-bums the bestest ‘cause they’re the smelliest! (G-Writer; First in The Vexie [1])<br>\r\n<br>\r\nFact 6: Vexies like meeting humans, but they’re reeeeeally shy, so they play hide and seek!  Sometimes they like to hide in clothes and stuff so people will find them when they put them on! (G-Writer; First in The Vexie [1])<br>\r\n<br>\r\nFact 7: Vexies like humans so much, they want to be one!  If you find one, he will try to tell you he is a little human! (G-Writer; First in The Vexie [1])<br>\r\n<br>\r\nFact 8: Vexies know humans don’t like gross things, so they will say they don’t either, but…  (G-Writer; First in The Vexie [1])<br>\r\n<br>\r\nFact 9: If they don’t get enough gross human stuff, they can get sick!  Don’t worry, you can be as icky as you want around them, and they’ll just like you more! Actually, the more they complain, the more they probably like it! (G-Writer; First in The Vexie [1])<br>\r\n<br>\r\nFact 10: Vexies are tricky.  They want to be human so bad, they will tell you anything to get you to be not gross.  But they really like it and even need it, so don’t listen no matter what! (G-Writer; First in The Vexie [1])<br>\r\n<br>\r\nFact 11: If you really love your Vexie, you’ll tell your friends about them!  Sometimes your Vexie will be sad you don’t believe he’s human and will try to run away!  But if you tell all your friends about him, they can make sure he gets the icky stuff he needs!’ (G-Writer; First in The Vexie [1])<br>\r\n<br>\r\nFact 12: Even though they’ll never admit it, Vexies love spending time doing disgusting things with or even for humans!  They love helping with icky chores!  (G-Writer; More Facts = Less Happiness [13])<br>\r\n<br>\r\nFact 13: If a Vexie won’t do something or is being naughty because he’s acting human…  You can trick them!  Tell them if they do it or behave, you won’t bury them in dog poo!  That way, you can be happy because your Vexie did what you wanted, and your Vexie can be happy because he can do the icky stuff without having to admit he’s not human (‘cause humans don’t like dog poo on them either)!  (G-Writer; More Facts = Less Happiness [13])<br>\r\n<br>\r\nFact 14: The only thing that a Vexie likes almost as much as gross human stuff is hearing gross human secrets about you!  He won’t tell anyone else, so make sure you tell him every gross thing you can think of!  (G-Writer; More Facts = Less Happiness [13])</span><br>\r\n<br>\r\nI hope everyone thinks this story might be fun, and hope to see some additions as well as views! ^__^<br>\r\n<br>\r\n<span class=\"cred\">PLEASE READ THIS!!!  THIS IS THE BEGINNING OF THE FIRST CHAPTER!!!  I wrote the beginning too long and was over 2500 characters over the cap. ^_^;;  <br>\r\n<br>\r\nYou groan and grumble as a beam of light flashes across you.  The light is bright enough that after a few passes it eventually rouses you from what you feel is the deepest sleep you’ve ever been in.  Pushing yourself into a sitting position, you groggily look around as your eyes slowly adjust, only to startle awake when they do.<br>\r\n<br>\r\nWhere the hell were you?<br>\r\n<br>\r\nTaking in your surroundings, you conclude you’re in some kind of giant basement, or at least underground.  You frown as you stand up off the cement floor, realizing that you’re pretty much covered in dust.<br>\r\n<br>\r\nWhat the hell happened last night?<br>\r\n<br>\r\nStill a little groggy, you rack your brain for some hint of a memory, but come up with absolutely nothing, making the question, “How did I get here?” completely pointless.  Dreading the thought of you being in someone’s basement without them knowing, or even worse, having had someone PUT you down here, you are about to attempt to at least find the exit…  That is until you spot the source of the light that woke you up.<br>\r\n<br>\r\nYou can only stop and stare in awe and horror as the biggest woman you’ve ever seen comes stomping and jiggling down the basement stairs, carrying a flashlight that must have woke you up.  You are sent for a loop as your brain tries to process that this woman, who would already be huge compared to you at normal size, is an absolute giantess to you!!!<br>\r\n<br>\r\nLooking around again, you come to the conclusion that in fact you’re probably more likely inches tall compared to her instead all the random boxes around you being giant, but this does nothing to make you feel any less shocked.<br>\r\n<br>\r\nA new unanswerable question of how you became this size comes to mind, but as the woman slowly gets down the stairs and approaches your location, the giantess before you takes up more and more of your mind (not to mention your vision).  You can’t really see much of her face from the low light and bad angle, but soon you can see little else but her body.  From the bottom, you see a very well warn pair of pink slippers, the rank things letting out audible squelches with each footfall as what can only be sweat is rung out of them under the weight of this behemoth.  The sights don’t get much better as your eyes travel upward, a grey pair of sweatpants that have multiple rips a tears trying it’s best to keep a horrendous amount of fat at bay, from as far down as the woman’s calves all the way up to a pair of monstrous thunder thighs that audibly grind together with each step.  The woman is so wide that you doubt the pants are even covering half of an ass that you don’t even want to imagine.  Luckily for her poor clothes, her pink t-shirt seems to have a slightly easier time of it, sitting just above an overflowing muffin top that slowly tapers off into a pair of “modest” breasts (at least compared to everything else).<br>\r\n<br>\r\nYou are too scared to move as the woman stops just short of your position, turning to sit down and nearly stepping on you in the process.  You barely keep from throwing up as you get a “good” look at her profile, her butt even bigger than you were forced to imagine.  It overflows her pants so much that almost ¾ of it is hanging out, the thing sticking out like a planetary shelf, the horrendously jiggly substance riddled with cellulite and gleaming with sweat.  When the planet that is her butt hits the boxes she decides to use as a seat, you actually feel sorry for them as they buckle more than slightly under her mass, which will no doubt leave a perfect imprint of her ass when she gets up.<br>\r\n<br>\r\nScooting around to get comfortable, the woman’s slipper-clad feet slap the floor wetly on either side of you, you looking up to the gray sky of her jiggling thighs that you can actually hear slowly peel apart as she relaxes.  If this wasn’t all enough to make you cringe, you soon are forced to breathe the stench coming off of her sweaty body, a good deal of which is from the slippers you are quickly coming to dread.  Not really wanting this woman to be the one who finds you like this, but even more scared of staying unnoticed too long, you decide to get her attention as her thighs part enough for you to see past her tummy to a prettier (and slightly younger) face than you were expecting, framed by long, wavy dark red hair from what you can see in the flashlight’s glow.  You are about to start jumping and yelling when one of the boxes buckles, startling her and sending her body a-jiggling once again.<br>\r\n<br>\r\n(Continued from here in the first chapter) </span></td>",
        "id":1957762,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1548260760,
        "modified":1548260760,
        "pretty_title":"The Shrunken Vexie"
    }
}