{
    "chapters":{
        "1":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "In your room.....",
                "The big hallway that has all the bedrooms and the bathrooms.....",
                "Just outside the kitchen entry way.....",
                "In the dinning room......",
                "Outside by the pool....."
            ],
            "content":"<div class=\"\"><div> <span>          “Jason, how could this happen to you,” you thought to yourself. You had no idea how you could have shrunk. You come to the realization that you are now three inches tall. You knew you had to get help from somebody in or around the mansion where you live with your family. Your parents are away on vacation for three months. The family that is here at the mansion are your two younger sisters, Tina and Kate. Also the all female working staff is always somewhere on the grounds because they live here with the family. Erica and Nikki are the two maids, Rita is the chef that prepares and cooks all the main meals, and Sarah is the girl that does all the gardening. They don’t live in the mansion, but they each have their own small houses that are at the far back of the grounds. They like working for your family because of the money and free housing.<br>\r\n          So, at the moment there should be six girls and women on the grounds or in the mansion that could help you. You do feel a little vulnerable because you are three inches now and also naked. When you encounter one of them, it could be hard to get their attention because they will be like giantesses to you. The interesting part of this is that you actually have fantasized about being this small and being around lovely girls and women and in some of your fantasies, even being eaten by one. You could be wrong, but you seriously doubt that one of your sisters or one of the staff would actually eat you. Though you do wonder about your youngest sister Tina, because you know she likes to eat and you have walked in on her once, swallowing your pet goldfish alive.<br>\r\n          This situation scares you, but you have to get up the courage and make the best of it. You wonder how you shrunk and hope it isn’t like in one of your fantasies, where a girl or woman used a power and shrunk you. You look around at where you have shrunk and plan on what to do next.<br>\r\n<br>\r\nWhere did you shrink?<br>\r\n</span></div></div>",
            "created":1214802000,
            "id":550085,
            "title":"Shrunk At The Mansion."
        },
        "11":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Maid, Erica, come to collect dirty cloths to wash….",
                "Serving maid, Nikki, come to tell you lunch is ready…..",
                "Sister, Kate, wanting to see if you wanted to go to the mall…..",
                "Sister, Tina, obviously up to no good…..",
                "Chef, Rita, come to ask what you wanted for lunch….."
            ],
            "content":"<div class=\"\"><div> <span>          You had been relaxing in your room when you shrunk. You are on your bed and next to you is a pile of cloths which you had been wearing. You knew the only hope to find out what happened to you is to get help from somebody in the house. First though, you realized that you had to find a way to get off your bed. Jumping off would surely injure you. Look around in awe of how big everything is to you now. A lot of things could happen that would injure or kill you. You could get stepped on or sat on, then you imagined the maid Erica and actually like the thought of being sat on by her lovely ass. Also thinking about your three inch size, the image of what your youngest sister Tina did to your pet gold fish came to mind. Then you imaged yourself in it’s place. You figured that there is a chance that if Tina found you that she actually might want to see what it is like eat you. Then you thought of Erica again, you must be really in love with her because you actually liked the idea of being eaten by her. You stopped your day dreaming when you heard the door knob on your door turn and the door creak as it began to open.<br>\r\n<br>\r\nWho came in your room?<br>\r\n</span></div></div>",
            "created":1214802000,
            "id":550098,
            "title":"Someone Is Coming In."
        },
        "111":{
            "author_id":"machan",
            "author_name":"Machan",
            "choices":[
                "Hold on to her panties.",
                "Are stuck to her panties.",
                "Remain on the bed."
            ],
            "content":"<div class=\"\"><div> <span>           \"Master, are you in there? I'm coming in!\" It was Erica's voice, followed of course by Erica herself, who entered the room quietly. You smiled, since this was a very good thing. Erica was a nice girl, she would help you for sure... provided she saw you, that is. Erica walked to your bed and started picking up the clothes you'd been wearing, while saying to herself \"I don't mind Master isn't here, but he could at least tell me he was leaving.\" You ran to where she was, screaming \"Help me Erica! I've shrunk!\", but she was so lost in her monologue and your voice is currently so weak, it was futile.<br>\r\n<br>\r\n           After picking up your clothes, Erica turned around. Since it's summer, Erica is using the \"short skirt\" version of her maid uniform, so turning makes her skirt flutter and her pink panties visible. You can't help but stare at her lovely butt and think it looks big and beautiful... really big... it seems to get bigger by seconds.... wait a-  PLOMF! Erica's ass ends on you, crushing you in a pleasantly enjoyable way. Her buttcheeks feel warm and soft even under her pink panties. \"Aaah, I just tripped! Thank goodness I landed on the bed, otherwise I would've gotten hurt.\" What she doesn't knows is that YOU have gotten hurt (A little. The mattress absorbed most of the impact).<br>\r\n<br>\r\nErica gets up, and you...<br>\r\n<br>\r\n</span></div></div>",
            "created":1268347020,
            "id":849547,
            "title":"Erica got a lot bigger since last time!"
        },
        "113":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "No, looks like you are a gonner.....",
                "No, but she feels you as she sits, and immediately gets up,  saving you.....",
                "Yes, just barely. Now to get her attention....."
            ],
            "content":"<div class=\"\"><div> <span>          Kate walked into your room. You wondered what she was doing. \"Hey Jason are you in here? I wanted to see if you wanted to go to the mall with me,\" She said. Your room is big and in two parts; to the right, there is a wall with an entry way. That part is the entertainment section of your room. You watched her walk over to that part to see if you were there. She then walked back over to the door. You are hoping that she will come near your bed so that she might see you. You smile as you see her backing up towards your bed, but she is doing it with out looking back and your smile disappears as you see that she is going to sit down on your bed. This would be a good thing, except that her ass is coming down right where you are standing. You realize you have to move or you are going to be squashed by her lovely ass.<br>\r\n<br>\r\nAre you able to move fast enough?</span></div></div>",
            "created":1214802000,
            "id":550136,
            "title":"Kate's Ass Is Coming Down."
        },
        "1131":{
            "author_id":"mr.x",
            "author_name":"Mr. E",
            "choices":[
                "You grab on and make it",
                "She gets up and someone else come sin the room",
                "The last thing you see is your sisters Ass"
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately for you your not fast enough and you look up to see the collossal rear end of your sister about to fall ontop of you shes wearing pink cotton sweatpants with white letters written on the back and they are too big for her so you can see her asscrack. <br>\r\n<br>\r\nWith the force of a meteor hitting Earth, Kates butt slams down on top of you and your crushed under the soft pink cotton but under the immense wieght of your big sisters ass cheek. you can hardly breathe and you feel your body getting slowly squished but luckily t that moment Kate wiggles her butt and your head sticks out behind her and your able to breathe with ease now.<br>\r\n<br>\r\nBy now youve moved underneath the center of her ass and her sweatpants are riding so low you can almost touch the rim of her panties and pull yourself up to her buttcrack if only your arms were just a little bit longer.  your sister always wore baggy clothes so much that whenever she bent over you could see practically half of her ass and becasue of her love of wearing loose clothes you have a chance of escaping being crushed underneath her booty.</span></div></div>",
            "created":1217624880,
            "id":564057,
            "title":"Butt Crushed By Kate"
        },
        "11313":{
            "author_id":"mr.x",
            "author_name":"Mr. E",
            "content":"<div class=\"\"><div> <span>You Continue to try and grab on to the waistband of her pink sweatpants and panties but its no use and your arms just arent long enough.  while your body is constantly under the pressure of your big sisters lovely plump rear, you cant help but think of the time you said she had a big butt and think this might be some sort of cosmic punishment for syaing that.<br>\r\n<br>\r\nKate leans back a little bit trapping your hands and arms underneath her buttocks and her buttcrack is being pressed right into your face.  \"What a hiumiliating way to die\" you think.<br>\r\n<br>\r\nAt the last second before your crushed to oblivion Kate gets up and it looks like you are saved from a horrible end but then she says \"Well i guess ill wait a few more minutes for my brother to get here\" and with those final words you see the ass come down once more you knew there would be no escape this time with no way to move your body.  her ass comes down and slow motion and the last thing you see is the two plump buttcheeks of your sisters ass as she sits down once more and crushes your body to a pulp.<br>\r\n<br>\r\nKate gets up not noticing the tiny red stain on the back of her pants and continues her day like any other and wonders where her brother might have gotten to.  if only she would look behind her back she wouldve found him.</span></div></div>",
            "created":1217625600,
            "id":564066,
            "title":"The Last Thing you see is your Sisters Ass"
        },
        "114":{
            "author_id":"superdave",
            "author_name":"superdave",
            "choices":[
                "Duck for cover...",
                "Face the music...",
                "Jump down off the bed and run...."
            ],
            "content":"<div class=\"\"><div> <span>          Ducking behind your mound of clothes, you peer over to see who is coming in. Whoever it is is probably responsible to shrinking you. Tina quietly opens the door, watches behind her, then closes the door, quietly. She glances around your room, and heads right for the fish tank. \"You little turd\", you think to yourself. With net in hand, she chases the fish around, before snaring one of the fancy ones, with the boggle eyes. \"You got to be kidding, that's huge,\" realizing you said this out loud, you duck down, then want to slap yourself, as if she could actually hear you. Peering again over the top, your just in time to see Tina lower her wriggling victim into her open mouth. She closes her lips on it's tail, and gently pulls it back out. \"Ooh your a tasty one, I think I'll just suck on you for a while before I swallow you\", she moans.<br>\r\n          Again the fish is lowered into her mouth, but this time, her lips close on it's head, and she slurps it in. Then reaches in with her fingers, and grabs the tail, only to pull him out again. Her shoulders slump, as she peers at the fish, \"But I really shouldn't, my brother will kill me.\" \"Oh yeah,\" glancing down at your manhood, \"You should, and if I knew that you were this good, I would have paid you to watch!\" Momentarily you feel sorry for your fish, as Tina decides that she is hungry. She drops him into her mouth, and gulps. Her throat bulges momentarily, as her hapless victim slides down her throat. \"Ahhh,\" followed by a satisfying little burp, \"I wish that I could eat you all, right now, and I would if I could...\" So saying she turned slowly from the tank, then stopped dead in her tracks, starring at the pile of clothes on your bed.<br>\r\n\"Uh-oh...\" </span></div></div>",
            "created":1214888400,
            "id":552087,
            "title":"Tina Loves To Swallow."
        },
        "1142":{
            "author_id":"superdave",
            "author_name":"superdave",
            "choices":[
                "She hides you in her hands behind her.....",
                "She hides you in her hands in front.....",
                "She pops you into her mouth....."
            ],
            "content":"<div class=\"\"><div> <span>          You realize your standing there with your wood in your hand, your mouth agape like your soon to be digested goldfish, and your sister is charging the bed! Quickly you look for escape, but not fast enough. THUMP! The bed bounces from her weight, bouncing you into the air, and her arms encircle you, like an arena. \"Well look at you, little brother, so little.. brother,\" giggling fiendishly, she smiles at you. \"What happened to you? I guess you saw what I did to your goldfish.\" You just nod, as you stare into her huge eye's, and partly opened lips. You think fast, \"Yah that was cool...do it again, only I want to watch closely.\" She frowns, \"Really? You know I can still feel it wriggling around in there.\" \"Please, I didn't know you were so good, in fact, I'd love to watch you do it to all the fish.\" She smiles at you, opens her mouth wide. Her breath stinks of fish tank, but her tongue looks like a velvet carpet, and the arch of her uvula, an invitation to the most erotic experience you'll ever know.<br>\r\n          Then it's over as she snaps her mouth shut, inches from your face. \"Only if you tell me who did this to you and how,\" she said and gently picks you up, rolls off the bed, and walks to the tank. In the full length mirror, beside the tank, you see Tina in her little girl skirt and blouse, and you in her right hand, from the chest up. Snaring another fish, which is bigger then you, she grips it with her left, and holds it in the air.<br>\r\nLifting you so that you are level with her mouth, she opens, and lets you look down her throat. You know that if you did enter, she would swallow you, and your life would be over shortly. But it's so inviting, with her tongue pushing forward, saliva, running back into her throat, a perfect fit, so easy to just lean forward... \"So how did it happen, or would you rather take the fishes place,\" Tina asked, sounding as if she just wanted you to jump right down her throat. She's looking directly at your manhood, standing rock hard. \"Yah I would except, you could only do it once, not again and again. As for how it happened, I don't know. I had a cookie, with milk, and woke up like this,\" you explained.<br>\r\n          \"Hmm, I think I'll just have to figure who did it. Enough talk, watch,\" she ordered. Again she opened her mouth, with you level with her lips, and slowly lower the fish into her mouth.  As if it knew it's fate the fish tried to escape her hungry maw, but was lowered in. Her tongue guided the fish into the back of her throat. Closing her lips slightly, the fish's head disappeared into her throat. With a noisy gulp, the rest of the fish slid in, it's tail whip to one side, as it disappeared. With another open mouth gulp, you could see her tongue close the passage to her throat, and it was over. Click, you both start, as the bedroom door is opening!<br>\r\n<br>\r\nWhat does Tina do with you?</span></div></div>",
            "created":1214888400,
            "id":552078,
            "title":"Face The Music"
        },
        "11422":{
            "author_id":"superdave",
            "author_name":"superdave",
            "choices":[
                "All the way....",
                "A new idea...."
            ],
            "content":"<div class=\"\"><div> <span>          With spine separating speed, Tina cups you in both hands, and rests her hands on the front of her skirt. \"Hello Tina, what are you up to now? Gulping more goldfish, or just getting ready to?\" It was Erica. She must be here to clean your room.<br>\r\n\"You know, your boyfriend will love what you can do for him, just keep practicing.\"<br>\r\nThe sound of clothes being thrown to the floor reaches you ears. Tina's hands begin to move, and a flurry of movement later, your held fast by the strap of her panties, against her thick pubic hair. She's moving, bending, and talking to Erica. Probably helping her turn down the bed. The soft skin of belly rests on your shoulders, and head, as she bends forward. You think to yourself, either in or out, this strap is going to cut me in half. The next time she straightens, you flip the band of her panties over your head. Her musk is strong, The fish swallowing really must have turned her on. She must know your down there, but she either doesn't mind, or doesn't want to give you up.<br>\r\nFacing her body, you allow yourself to slip down under her.<br>\r\n          The crotch of her panties are soaked, as you slip between those tender lips.<br>\r\nYou know your knees are rubbing her clit, as you work for a comfortable position. She suddenly stands up straight, clamping you between her legs. Words are mumbled, and she is running from the room. Your feet are pushing at the entrance of her vagina. Your legs are soaked, and you can feel her muscles trying to get a grip on you. She glares at you with an impish look in her eyes, \"Where do you think your going little brother, If I take you that size, I'll never see you again.\" She is watching you through the open band on her panties. You smile innocently, as you push down further under her. With both hands, you grab her engorged clit, and thrust your legs as far as you can within her. \"Ooohh,\" her panties snap shut, and her hand cups her sex, holding you in. Her labia holds you like a glove, as you wiggle your legs within her. She moves her hands forward and back trying to work you into her through her panties. Her muscles in her vagina grip and pull, grip and pull, as your hips are swallowed. She rips off her panties, and grabs your shoulders.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1214888400,
            "id":552082,
            "title":"Up Close And Personal With Tina."
        },
        "114221":{
            "choices":[
                "you to far deep inside her",
                "she manages to grip you"
            ],
            "content":"<div class=\"\"><div> <span>She pushes your soaked body into her. Her vagina grips you fiercely. If she let go know, you would be completely devoured. Her muscles pull and grip, trying to wrest you from her fingers. Her honey fills your mouth, and nose, making it hard to breathe. She pulls you out, and rams you in again. Clutching you firmly within her. Out again, this time you grab a breath. You can see her fingers manipulating her clit, as her vagina closes over your head again. Her heart beats like thunder, within her. her vagina grips you tightly and wrests you from her fingers as she loosens her grip and pulls you in deeper. globs of love honey spill over you as Tina lets out a loud scream and you pulled in ever deeper.<br>\r\n<br>\r\nyou feel every thing shift again as you realise that some how your breathing and you sisters heartbeat starts to slow you then sense that her fingers are fishing in around inside her vagina to try and get you out.</span></div></div>",
            "created":1273273620,
            "id":879623,
            "title":"All the way...."
        },
        "114222":{
            "author_id":"superdave",
            "author_name":"superdave",
            "choices":[
                "Oops down you go.",
                "Spits you out."
            ],
            "content":"<div class=\"\"><div> <span>          She pushes your soaked body into her. Her vagina grips you fiercely. If she let go know, you would be completely devoured. Her muscles pull and grip, trying to wrest you from her fingers. Her honey fills your mouth, and nose, making it hard to breathe. She pulls you out, and rams you in again. Clutching you firmly within her. Out again, this time you grab a breath. You can see her fingers manipulating her clit, as her vagina closes over your head again. Her heart beats like thunder, within her. Her vagina squeezes you suddenly, she is not pulling you out. Globs of honey spill over you, as her heart pounds a staccato beat. Your free. She holds you up to her face, \"That was good. I want more.\"<br>\r\n          You realize your in the bathroom. She grabs for something on the sink, there is a clattering sound. \"I'm going to keep you in here for awhile,\" she says as she shows you a Q-tip box, \"but first. I'm going to clean you up.\" Without a second glance, she drops you into her mouth. You try to grab her lips, as you pass by them, but your arms are easily sucked in. It's completely dark in here, Her tongue is swishing you around, covering you with saliva, washing the honey from your skin. You hope she doesn't accidentally swallow you.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1214888400,
            "id":552086,
            "title":"Tongue Cleaning."
        },
        "11423":{
            "author_id":"calii",
            "author_name":"Calii",
            "choices":[
                "\"Yes! Swallow them all!\"",
                "\"No, I've seen enough.\""
            ],
            "content":"<div class=\"\"><div> <span>          The door slowly creeks open to the horror of both you and Tina; though the two of you realize the door was just opening on it's own and sigh with relief. Tina bites her lower lip as she looks down at her tiny \"little\" brother. After a moment's pause, she set you down on your bed and quickly moved to lock the door. Turning back to face you with a mischievous grin on her teen face while leaned against your only method of escape. She slowly makes her way back towards your bed, stripping herself of her clothing as she does so until she's simply clad in her cotton panties and bra.  She grabs an empty water bottle from a dresser then slips towards your aquarium. Her head turning to grin cutely at you, sticking the bottle under the aquarium water to fill it up.  Once finished she walks back towards your position on the bed, each step causing her exposed cleavage to jiggle.<br>\r\n<br>\r\n          Her massive and beautiful form crawls slowly onto your bed, towering over you as her body becomes your sky. You can't help but stare in awe at your little teen sister that seems like nothing less than a Goddess to you. Her body turns to lay back on your bed, that landscape of a body crashing into the soft mattress sending tremors throughout the 'ground'. You end up between her thighs so that the only things you can see are her thighs, and the smooth giant mountain of her cunny under her panties. You just admire the massive scenery, and the sexy idea that this giant wall is your little sister's snatch! Thinking it could press down and snuff you out of existence as she sat up.<br>\r\n<br>\r\n          Her massive hand suddenly appears and delicately scoops you up, quickly depositing you onto her bare tummy. \"Mmm, I hope you don't mind me getting a bit more comfortable. This is my \"lucky goldfish swallowing\" outfit.\" She sticks her tongue out playfully; leaving the hint of arousal, at doing such things in her underwear, a little vague. Her fingers press in on your form roughly pinning you into her smooth tummy. \"H-Hey watch it!\" You yell up to her, but she doesn't seem to be listening. The side of your head is pinned against her skin, forced to listen to her innards. You almost think you can feel or hear the movement of squirming fish inside. Though before you can put too much thought into this, she brings the bottle of aquarium water to her lips and begins to chug it down! <br>\r\n<br>\r\n*GLUG GLUG GLUG GLUG*<br>\r\n<br>\r\n          You can hear it empty into her belly, each gulp of the water undulating her belly under you like a water bed. The loud splashing somewhat audible beneath her skin, which also feels like it cools down just slightly. You listen in awe and watch her chug down the, to you, gallons of fish water. Each undulation of her belly rubs your erection against her skin. When she finally finishes she tosses the water bottle aside and lets out a loud happy sigh. Opening her giant maw wide for your appreciation, her dark cavern graced by a few strands of thick saliva from the roof of her mouth to her tongue. \"Little Bro.. Do you want to see me do that to the rest of your fish?\" Her thighs grind together, obviously getting off on the idea. She licks over her lips, \"I lust love swallowing they thick little bodies, feeling them squirm down my throat.\"<br>\r\n<br>\r\nWhat do you say?</span></div></div>",
            "created":1291859340,
            "id":1010986,
            "title":"Tempting fate with Tina's hobby."
        },
        "114231":{
            "author_id":"calii",
            "author_name":"Calii",
            "choices":[
                "Look outside her mouth.."
            ],
            "content":"<div class=\"\"><div> <span>With a blushing face and a dumb grin you shout out, \"Y-Yeah! Swallow all of them!\" <br>\r\n<br>\r\n          Tina grins as her eyes widen in excitement, a small blush growing on her cheeks. She sets you aside for just a moment. Quickly taking the water bottle and using a pair of scissors from a drawer, she cuts the plastic bottle neck off. She scoops the now more drinking glass like bottle into your aquarium catching a pair of fish and enough water to fill it for now. Her rear wiggling happily in your direction during this. Finally, she returns to her seat on the bed and places you on one of her ample bra cups. <br>\r\n<br>\r\n          You blush a little bit, but she doesn't seem to pay too much mind to having you near her breasts. Her fingers reach into the bottle and pluck out one of the fish, gently tossing it into her cleavage. Giggling as it begins to wiggle and flop between her tits.  You stare with fascination and a bit of jealousy of the beached fish. \"Don't worry maybe you can take his place later...~\" She says after catching you staring. You just blush and grin dumbly up at her face. Your erection slowly starting to soften, that is, until she takes the bottle to her licks and chugs it down in one go!<br>\r\n<br>\r\n          Your seating on top of her boob lurches once as you see the fish disappear down her mouth, soon nothing more than a lump traveling swiftly down her throat, and finally nothing. She opens her mouth wide  towards you and lets out a giggling, \"Aaaah!~\" Her breath smells even more of the fish and your aquarium. Though looking down her throat as it flexes, fresh from the cool water, your erection instantly returns to full strength. <br>\r\n<br>\r\n          The giantess licks over her lips, stretching her jail bait form out on your bed as she seems to receive a sudden burst of energy. \"Oh god, it's so good. Having it wriggling in me. Filling me.\" She reaches with both hands plucking both you and the last goldfish up. She brings both of you to her grinning lips. \"I'm going to give you a special treat little bro, I'm doing to do this one with my mouth open. Just lean over my lip and.. try not to fall in..\" That last bit both scares and excites you. Standing on the edge of her palm you lean against her chin, filling your erection pressed onto her lower lip as she lowers the last goldfish inside. The slimey fish came to a rest on her thick floor of a tongue, squirming in an attempt for freedom over the spongey flesh. Her breath breathing with arousal as she savored this one. Swirling her tongue over every inch of it. Squishing it between her tongue and the roof of her mouth forcibly before relaxing and swishing it between each cheek. Her thick molars pressing down on it, but never biting. She just lightly gnaws at it with a bit of a giggle.  Though her fun and games finally end and the fish slowly glides to the back of her throat, where her flesh widens and slowly begins to massage and press every inch of the goldfish back into the darkness of her throat.  You squeezed her lower lip with both hands during the spectacle, half scared of actually falling in and being swallowed along with the animal. And with an audible gulp, without even closing her mouth, the fish disappears from the world forever. <br>\r\n<br>\r\n          She moans out over your tiny body with a flushed face. That smell of fish stronger than ever now. Tina then picks you up between two fingers and drags her slimey tongue over your naked body. Your cock among everything else is blanketed by the cool pink flesh! You moan out softly despite how disgusting it feels and grind on her tongue. Her organ retracts from you to lick her lips. \"D-Did you enjoy that little bro?\"<br>\r\n<br>\r\n          You stare quietly in ab it of surprise for a few moments after, \"Y-Yeah! That was pretty awesome how you swallowed them whole.\" She grins at you, her face still beautifully flushed and excited. \"Mmm I meant it earlier, would you rather join them? I know you do..\" She sticks her tongue out again leaving it in front of your little body. Once again it's as if she's rolled out the red carpet for you, to the beautiful act of being her food. Your erection still throbbing against her lower lip, and now somewhat close to her tongue. \"Th-Thanks Tina, it is really hot idea, but I don't want to end up digest.\"<br>\r\n<br>\r\n          She moans softly starting to grind her thighs together again, \"You got me all worked up now though, letting me eat all those fish.. I want more. I want you to make me full, Bro.\" Woah, this is starting to get dangerous. \"T-Tina calm, down,\" you say. Starting to back away from her lips but her hand quickly closes in around you and gently holds you.  \"Bro I'm gonna drop your little naked body in the aquarium and pretend you're one of your fishes. I want you to experience it like they did..\" She stood up from the bed quickly.<br>\r\n<br>\r\n          \"T-Tina no! Sto-\" Before you could even finish the sentence you were dropped deep into the empty aquarium. You looked out of the window from under water to see Tina pressing her ample breasts against the glass. Then suddenly you remembered! You turned your head just in time to see a green net dashing towards you! You quickly swam forward and barely dodged it. You could hear your sister giggling outside of the water as she chased you, though it was somewhat distorted. <br>\r\n<br>\r\n          The net turned and quickly flashed back towards you with lightning speed, and this time you wouldn't have escaped if it wasn't for the glass to help boost you away. \"Little sexy fishy!~ Stop running so I can gobble you down. My tummy's your new home. Ha!\" You paddled for dear life, not even worrying about your breath yet as everything happened so quickly. But then it happened, the green mesh surrounded your form and yanked you out of the water. You could see your sister Tina moaning softly, getting off without even touching herself, from doing this to you. One hand plucked your naked form from the net by your feet. Lifting you high above her half naked form. \"T-Tina for christ's sake!\" You waved around upside down trying to get your legs free, even if it meant taking that horrible fall. Tina seemed to ignore your pleas, holding you in front of her massive face. \"Ooh, oh my. You're a juicy one alright.. I bet you give me an extra creamy filling huh?\" She winks at you teasingly as if this was natural foreplay. \"Mmm, I-I shouldn't..\" She says in a mock worried tone. \"My big brother would kill me if I ate one of his little fishies.. But you look so tasty. And you know I'd cream myself just feeling you SQUIRM inside me. Turning into some fat for my butt or titties..\"<br>\r\n<br>\r\n          You were on the verge of tears as she focused on your traitorous erection. Her lips breaking out into a giggling grin. Her mouth opened wide and stretching her thick slimey tongue out for a final time. This time you would be using that squishy red carpet to your final resting place.<br>\r\n<br>\r\n          Your naked body slipped onto her tongue attempting to hug it to steady yourself, but failing miserably. Her slimey flesh began to bat you around her mouth, as she let a resonating moan around your form. Her pink organ especially liking to squish on your little prick jabbing between her taste buds. Tina's  mouth closed for a time, puckering her lips up as she sucked hard on your entire body, pinning you repeatedly against her inner cheeks and the roof of her mouth. Taking times to blanket you under the bottom of her tongue while she chugs down more of the Aquarium water. Your naked form is quickly over saturated in her thick goopy saliva. Her muscles milking you repeatedly and roughly, until your body is battered to the point of letting her do as she pleases. She straddles your body around her tongue and continues to suck on you. Her thick taste buds dragging rapidly over your erection and little butt. Smearing her saliva into your face, and really every other nook and cranny. The amounts of copious saliva seem unreal as they pool around you. You see her mouth open wide, as Tina is standing in front of a mirror. She's fondling her tits, groin, and ass like mad while grinding the air. Thick strands of saliva drooling out of her lips and down her chin as she hangs her tongue out to show you one last look at yourself and the world..</span></div></div>",
            "created":1291863840,
            "id":1011037,
            "title":"\"Yes! Swallow them all!\""
        },
        "1142311":{
            "author_id":"calii",
            "author_name":"Calii",
            "content":"<div class=\"\"><div> <span><br>\r\n          In the mirror you just see your sister's face, almost unrecognizable as it's lost in her own lust and pleasure. The brightest shade of red and the widest most sexual grin you've ever seen on a woman. Your tiny body is resting fully on her tongue, obviously worn out in your reflection. While she simply leans back and presses a few fingers to her lips and chin in her ecstasy. Her hot breath pours out around you into the cool room, leaving short visual breath of air from the contrasting temperatures. <br>\r\n<br>\r\n          \"O-Oh my god, little Bro. You just made me cream harder than ever in my life..\" Tina mewls out around you. You perk your head up almost, hoping maybe she's satisfied and will let you go. Tina giggles and moans, \"Oh but I know,  the one I'll have when I swallow you will be even better. Teehee!\" Your heart instantly drops and you stare in horror. \"Ooh, but don't get me wrong bro.. I am sorry, I love you, but this is it. This is my dream you're going to be one of your goldfish I swallow. I'll have a mind blowing orgasm, and every fish I ever swallow from now on will be you to me. While you're in my tummy, I think I'll go find that maid you're in love with and get into a half-naked tickle match with her. Letting that work out speed up your digestion, and you'll get to be close to your silly crush in the end. But you'll always be mine, a piece of fat on my ass.\"<br>\r\n<br>\r\n          She grins at your naked form one last time, \"You're a virgin right? My tongue is going to be your last chance!  I'd think it'd be embarrassing to lose your virginity to your little sister's tongue, but I love you! So think of it as a last request... Or I could just swallow you down now..\"<br>\r\n<br>\r\n          You sniffle loudly and squeeze onto her tongue starting to hump vigorously, knowing she probably won't swallow until you climax. Praying to god you don't finish too quickly! If you don't look like you're trying she may swallow you anyway though. Her eyes are fixated on you through the mirror, watching with a moaning giggle as you sex her tongue. She undulates it beneath you and plays with herself. \"Oh god, fuck me little bro!~ It's so good, do it harder!\" Your erection slips and slides messily about as you pant heavily for air, accidentally swallowing globs of her saliva mixed with the aquarium water. \"Oh yes, yes, yes! Do me-\" She cuts off as you tremble and flood your seed all over her tongue after only a few moments of starting. <br>\r\n<br>\r\n          No, of all the times to be a premature ejaculator! Your sister laughs around you and slurps on your body, swallowing the seed down into her tummy. \"Wow! You're such a QUICK shot little bro, but it's okay. I still love you. Mmm, but I love your taste more. You didn't let me down on that creamy filling~\" You shake your head vigorously starting to hump her tongue again trying to pretend it's not over yet. \"Sorry bro, but you lost your virginity already, even if you're an adorable little quicky shot. Time to meet your fate.. as the perfect little gold fish snack.\" She begins to lift her tongue up, sliding your naked form to the back of her throat as you yell out in protest. Her mouth closing, sucking on your tired and humiliated form one last time before it happens. GULP! Her muscles contract around every inch of your body and squeeze you into her throat steadily pushing and tugging, milking your little self down into her tummy. Your now soft dick pressed between the walls and your body. Though your legs finally slip through a hole, dropping you into a tight compact room. The walls already churning hard and rough about your body. They compress you into a fetal position as each wall roughly grinds into you. You find your limbs spread out as the walls manage to perfectly blanket every space of your body. The acid coated walls grinding into your male package as well as every other spot as you cry out. <br>\r\n<br>\r\n          You feel your new home start to bounce about, with gurgling noises and moans around you're entire being. Then you hear Tina's muffled voice, \"Hey Erica, tickle fight!\"<br>\r\n<br>\r\n          Outside of Tina's stomach, she suddenly approached the busty maid offering the ever so random tickle match, still only in her underwear. Erica took it s a chance to take a break from work so accepted with a giggle. The two girls playfully wrestling on the floor with they busty bodies grinding against one another, each being madly tickled by the other. Each giggle making both their busty forms jiggle about. <br>\r\n<br>\r\n          You can only listen in horror as your sister, your predator digest you while wrestling with the busty maid you had such a crush on. True to her word you were going to fade from existence while she rough housed half naked with your romantic interest. Then suddenly, you felt a large force pressing on the walls of the stomach. Curiously you waited to see what it was, then you heard it! Erica's muffled voice asking, \"What is it?\" Her head was pressed against Tina's tummy listening in on you. Screaming out loudly with everything you could think of, \"Please! Erica save me! It's Jason she ate me!.. I love you! Oh god..\" You wait with your last shred of hope, before Tina speaks. \"My food!\" You then hear Erica giggle loudly and say, \"Well digest it silly! I don't want to hear stuff turn into booty fat.\" You close your eyes and whimper, starting to jump the acidic muscles surrounding you<br>\r\n<br>\r\n          Outside, Tina just pins Erica's head there with a little giggling gasp. Her belly is starting to writhe frantically, but she can tell this isn't struggling for it's life! Jason's madly humping for a second orgasm INSIDE of her body. Her arms squeeze Erica in place as her panty-clad ass grinds on the maid. Dry humping onto her breasts lightly as she nears that mind blowing orgasm she dreamed of. Wishing she could eat her brother again, but knowing doing it once is what makes so damn good. Erica just stares confused as she hears strange noises from Tina's tummy. Tina whimpers out, \"D-Do you hear that?\" Erica shakes her head lightly, \"N-Not really?\" And soon Tina's mind empties, experiencing that mind breaking orgasm, creaming herself on the chest of Erica's apron. She opens her mouth wide with her teary eyes, nearly drooling on herself the pleasure is so intense. She barely remains silent, though lucky for her, her face is out of sight from Erica. She feels the squirming in her tummy stop, but it feels a little more full. <br>\r\n<br>\r\n          She then collapses to the side of the floor panting softly and rubbing her tummy, \"That was perfect..\" The maid just stares at her in confusion, not having noticed the wet spot on her chest, and probably won't before it dries. She shakes her head and says, \"You silly weirdo. Go put some clothes on before Jason or someone sees you.\" She grins and gets back up to continue working.<br>\r\n<br>\r\nThe next day.<br>\r\n<br>\r\n<br>\r\n          Tina woke up with a yawn. She quickly dressed in a tank top and a pair of tight jeans, though soon found she had trouble pulling them up all the way! Her ass was stretching them much more and jiggling much nicer. She bit her lower lip and started to fondle her ass in front of the mirror, \"oh god. Little bro you made me so sexy.. Mm let's go find one of the boys to pound lots of creamy semen into you.\" She grinned and gave her ass a hard spank!</span></div></div>",
            "created":1291865880,
            "id":1011062,
            "title":"Look outside her mouth.."
        },
        "115":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Erica.....",
                "Rita.....",
                "Sarah....."
            ],
            "content":"<div class=\"\"><div> <span>          Your thoughts were quickly interrupted as Rita entered your room wanting to ask what you wanted for lunch. Puzzled as she was, Rita looked around and when she did look on your bed Rita's face turned a deathly pale when she saw you at your size. \"Jason, what happened?\" she asked. \"I don't know.\" you responded. \"Well then,\" Rita continued, \"come with me and let's get you something to eat.\" Rita grabbed you and gently placed you in her center apron pocket and brought you to the kitchen.<br>\r\n          When Rita arrived in the kitchen she placed you on the counter and proceeded to prepare lunch for you. As Rita was finishing your BLT on white she remembered that she had to run to the grocery store and told you that she would be back soon. At your size you really couldn't get at most of the filling from the outside. Despite the obvious danger you knew if you were going to eat you would have to go inside the sandwich. As you enjoy your sandwich from the inside you hear someone enter the kitchen. This was not good news for you and you reasoned that it could only be three people who would enter the kitchen at this time. It could either be Erica cleaning the kitchen, Rita deciding to take you with her, or Sarah who came in from gardening to get a glass of water.<br>\r\n<br>\r\nWho came in the kitchen while you were eating lunch?<br>\r\n</span></div></div>",
            "created":1214974800,
            "id":552089,
            "title":"Your Lunch Interrupeted."
        },
        "1152":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Keep you to herself",
                "Give you to Melissa",
                "Contact the family"
            ],
            "content":"<div class=\"\"><div> <span>    It was Rita. \"On second thought.\" she said. \"I think you'd be safer if you came with me.\" she continued. Rita picked you up and placed you in her purse as she continued to the grocery store. The car ride was uneventful and you had dozed off to sleep. Everything was great in the store until Rita slipped on a recently mopped floor and you went flying through the air and landed on the deli counter. Rita had forgotten that you were with her and did not bother to look for you and continued to shop for groceries. <br>\r\n\t<br>\r\n   Now, fully awake, you were stranded on the deli counter. And you started yelling for help the employee working the deli spotted you and silently grabbed you. All was dark for what seemed like an eternity until the employee placed you on a table during the lunch break. You could see that the employee was a very attractive female with mid-length red hair, an excellent figure, brown eyes, and looked about 22 in age. \"Hello, my name is Melissa. What's your name?\" she asked in a peaceful voice. You told her your name and your problem. \"I'll help you,” she said. As you thanked her she picked you up and took you to the manager of the grocery store. The manager was a 28 year old female with a good figure, long brown hair, green eyes, and a kind appearance by the name of Samantha. Melissa explained your problem to Samantha. Samantha asked Melissa for possession of you and asked her for some time to think. After a few minutes Samantha talked out loud almost to herself, \"Let's see. I could keep him for myself and keep this a relative secret, I could give him to Melissa and leave it as it is, or I could contact the family and see if they even want him back.\" Now that you know your three options you didn't know what was going to happen. Just then Samantha made her mind up.<br>\r\n<br>\r\nWhat did Samantha decide to do with you?<br>\r\n</span></div></div>",
            "created":1216616400,
            "id":558534,
            "title":"A Manager Managing Your Fate"
        },
        "11522":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "She did. Melissa takes you off the sandwich and puts you in a safe place",
                "She doesn't see you. You are stuck in the sub sandwich of your girlfriend"
            ],
            "content":"<div class=\"\"><div> <span>  \"I think Melissa would be the best choice.\" Samantha says as she calls Melissa in. \"Yes?\" Melissa asks. \"Melissa, I am giving you custody of this person. Do as you like. That is all.\" Samantha said as Melissa exited the office full of excitement. It was around lunch time and Melissa was working the sub sandwich station extension of the deli. The store uniforms did not have pockets so employees couldn't steal anything that way so as a customer came up to the station Melissa placed you on the preparation counter over to the side but she had dropped you to far up causing you to roll into the chopped lettuce bin with out anyone noticing. You look up to see that the customer is actually your vegetarian girlfriend, Lauren. Lauren is a 22 year old semi-tall blond with green eyes, and a great figure. Just then Melissa's hand reaches into the lettuce and grabs you along with the lettuce. You struggle but you can not get free. As Melissa lays the lettuce on the sub sandwich for Lauren, with peppers, shredded lettuce, tomato, cheese, cucumber slices, mustard, onion and Italian dressing all in a foot long loaf of white bread, she took a double take, as if she saw something that did not belong. Now was your chance for freedom. Was it you Melissa saw on the sandwich or something else? <br>\r\n<br>\r\nAre you saved or might as well be dead? Did Melissa see you? </span></div></div>",
            "created":1217537940,
            "id":563624,
            "title":"Being Made Lunch At The Deli"
        },
        "12":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "You slip under the door to Kate’s room…..",
                "You slip under the door to Tina’s room…..",
                "You head back to get help from Erica…..",
                "You slip under the bathroom door…..",
                "A hand grabs you before you can go anywhere….."
            ],
            "content":"<div class=\"\"><div> <span>          You had shrunk while walking down the main hallway to your room. You had to get help to try and get back to normal. You didn’t know exactly where to go and who to get help from. There are several places you could go. You could go to your eighteen year old sister Kate’s room. She is a responsible girl and you believe she will help you, though she does mess around and try to scare you a lot from time to time and you, being three inches tall, are perfect for messing around with and scaring. You could go to your sixteen year old sister Tina’s room, but she has a weird way of thinking and loves to have power. She might look at this as a chance to control you, or even a chance to see what eating a person is like. At your size she could definitely gulp you whole like she did your pet goldfish.<br>\r\n          You could head back down the hall to the large living and gaming room. The cleaning maid, Erica had been in there cleaning, so you could get help from her. You did have the hots for her anyway. You thought being held by her at this size could be great. Lastly you thought you heard some sounds from the bathroom; there could be someone in there that you could get help from.<br>\r\n<br>\r\nWhat happens next?<br>\r\n</span></div></div>",
            "created":1214802000,
            "id":550099,
            "title":"Hallway Decision."
        },
        "124":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Yes, oh, Kate is undressing to take a shower…..",
                "Yes, oops, Tina is taking a bubble bath…..",
                "No, but the door opens and Erica comes in to clean….."
            ],
            "content":"<div class=\"\"><div> <span>          Since you are closest to it, you decide to go into the bathroom. You slip under the door. The crack is a little smaller than you thought so it took a bit of squeezing to get under and through. You get up and walk a few steps forward, and look around.<br>\r\n<br>\r\nIs there someone in there?<br>\r\n</span></div></div>",
            "created":1214802000,
            "id":550100,
            "title":"Is Someone In The Bathroom?"
        },
        "1241":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Rubs you all over her body…..",
                "Rumbling sounds come from her belly, she missed breakfast…..",
                "Has you watch her shower. She wants to do something special with you after...."
            ],
            "content":"<div class=\"\"><div> <span>          Looking up you noticed that it was Kate that you heard in the bathroom. She is taking off her clothes in preparation to take a shower, you guessed. She is down to her bra and panties. You watch as she undoes the bra and it falls, revealing her large and magnificent breasts. While she slips off her panties, you can’t help but notice how hot your sister is. You move next to the tub, hoping to be seen. You look on as she steps in the tub and turns on the water and then the shower. You can’t help but stare and think it is going to be hot watching her lather up and clean her lovely body. It is at that moment you noticed that she crouched and leaned over close to you. She is looking right at you.<br>\r\n          She smiled, grabbed you, stood back up, and brought you up to her face. “Oh my, why if it isn’t my big brother Jason,” Kate said and giggled, “I think in this case I should say little brother now.” She asked how you shrunk but of course you couldn’t answer that. “Well now little bro, why did you come in hear,” She asked, “Did you come in because you have the hots for you sister; I caught you staring. I can’t say I blame you, having a sister as beautiful and sexy as I.” You try to tell her that you really just wanted to find someone to help get you back to normal, but what she said next made you cringe and think that she might not be very helpful. Kate replied, “Why would you pass on the chance to have a very interesting experience? Your so small and cute looking now, that I want to see what the benefits are of having a shrunken brother.”<br>\r\n<br>\r\nWhat happens next?<br>\r\n</span></div></div>",
            "created":1214802000,
            "id":550103,
            "title":"Kate Spots You Watching."
        },
        "12412":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Continue as Kate in third person prospective….."
            ],
            "content":"<div class=\"\"><div> <span>          You hear groans coming from Kate’s belly. You notice that Kate heard it too and she is now looking at you with a frightening smile. She licks her lips, “Well little bro, I missed breakfast. I must tell you that besides looking cute, you look like you would make a tasty snack.” Even though you are scared, you can’t help be pleasured as she gives you a lick along your whole body. “Kate, please,” You beg, “Pleas be joking, I am not food to be eaten. I’m your brother not a snack.” You know it is going to be the end for you when you hear Kate, “Mmm, sorry bro, my taste buds disagree. You taste good and that means you are good for eating. It looks like today that a sister is higher on the food chain than her brother.”<br>\r\n          Before you can react, Kate quickly opens her mouth wide and it descends upon you, engulfing you. Her mouth and lips close around you. You hear a loud giggle that almost deafens you. She giggled because the sight of your legs still outside her mouth wiggling, amused her. She sucked on you for a bit then used her finger to poke in you moving legs so that you are all the way inside. You were pleasured by the feel of her massaging sucking, which made you add a little of your own special flavoring onto her tongue. This made her suck you even more, you guess she likes your special flavor. Then with a quick gulp, you are sent down to meet your end in the belly of your lovely sister Kate.<br>\r\n          You get up off her stomach floor. You hear the water from the shower splashing against her belly, then also her hand patting and rubbing it. You heard Kate let out a little burp, “Oooh, you really hit the spot bro. Nice a salty then a little bit of creamy goodness at the end. I can’t wait to see how our lovely little sister Tina tastes, or maybe I’ll gobble up that maid Erica, that you like so much.” You shouted at her, asking what she meant. “Oh, I guess I neglected to mention,” Kate said laughing, “I’m the one that shrunk you Jason. I met this strange old woman in a shop, and she said that she could grant me the power to shrink people if I gave her a hundred dollars for it. I decided to take a chance and I gave her the money. And look; now I have my shrunken brother in my belly. I think it was a good deal. Now you just sit tight Jason. I’ll continue my shower and my belly will get to digesting you shortly. Be happy, you get to nourish your hot sexy sister. Maybe you will be fat on my ass; I always thought my ass need a little plumping up.”<br>\r\n          Kate was right, it wasn’t more than a minute later that acid started pouring in and burning you. You thrashed about in pain and pounded on her stomach walls. She just smiled, feeling turned on by your movement in her belly; her hand traveled down between her legs and she played with herself until you stopped moving. You passed out; soon you were just broken down nourishment moving about her body. It wouldn’t be long before other people shared in your fate.<br>\r\n<br>\r\nWhat happened next?<br>\r\n</span></div></div>",
            "created":1214802000,
            "id":550105,
            "title":"Kate’s Snack In The Shower."
        },
        "13":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Chef Rita, she is busy gathering ingredients to make lunch for every one.....",
                "Nikki the serving maid, she is cleaning the kitchen.....",
                "Tina, she's looking to make lunch for herself, Chef Rita has the day off.....",
                "Kate, she's getting the ingredients to make a big ice cream sundae.....",
                "Chef Rita, she is looking right at you smiling like she has something planned..."
            ],
            "content":"<div class=\"\"><div> <span>          You had been walking by the kitchen when you shrunk. You have to get help and you knew that there is always someone in the kitchen. So, you walk into the kitchen. You notice that there is someone in the kitchen.<br>\r\n<br>\r\nWho is in the kitchen?</span></div></div>",
            "created":1214802000,
            "id":550140,
            "title":"Into The Kitchen."
        },
        "131":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Kate's Salad.....",
                "Tina's Soup.....",
                "Sarah's Sandwich....."
            ],
            "content":"<div class=\"\"><div> <span>          As you enter the kitchen you realize that Rita was preparing lunch. You run over to her as fast as you can and start climbing the drawers to reach the counter top. When you finally reached the counter you could see that Rita was preparing three different lunches and you could probably guess which lunch went to which person. The salad with bacon, tomato, shredded cheese, cucumber, and carrots with ranch dressing was Kate's no doubt, while the bowl of soup definitely was Tina's, and the BLT with cheese on white was more than likely Sarah's who most of the time ate lunch with you because it is closer than her house. You cry out to try and get Rita's attention and to your relief she does notice you but your hope fades as she says she can't help you but you would be a nice little extra in someone's lunch. \"Should you decide or should I,\" Rita asks you. You don't respond to which Rita replies, \"Suit yourself. Let's see who would like a little Jason in their lunch?\" <br>\r\n<br>\r\nWhose lunch does Rita place Jason in? <br>\r\n</span></div></div>",
            "created":1214974800,
            "id":552090,
            "title":"Rita Makes You Lunch, Literally."
        },
        "134":{
            "author_id":"dr.birkin",
            "author_name":"Dr.Birkin",
            "choices":[
                "Kate came back....",
                "Tina came in....",
                "One of the house workers came in....."
            ],
            "content":"<div class=\"\"><div> <span>          You weren't too fond of Kate trying to scare you all of the time, but she was the only one who was in a position to help you. Regrettably, you slowly marched up to her pant leg and tugged on it. She ignored it for a while, until she was half way finished with her food, but you kept tugging and the brunette giant looked down. Immediately noticing you, her look of shock soon became a mischievous smile. With a gentle and powerful grip, she raised you up to her face pinched between her slim fingers.<br>\r\n          The two of you have a small, but tense, conversation. You explain your lack of knowledge as to what happened, and she professes her innocence. Not that you accused her of anything. With a sly smile she suggests you play a bit before trying to get back to normal, and before you can even say no she's shoved you into her half finished sundae. With her index finger she shoved your body into the ice cream, making sure your head stuck out. After that came the sprinkles and chocolate. You were covered, but still able to breathe. Once finished with her masterpiece, she told you to wait a minute and left the room. Unable to move, you did just that until...</span></div></div>",
            "created":1214888400,
            "id":550505,
            "title":"Kate's \"fun\""
        },
        "1342":{
            "author_id":"dr.birkin",
            "author_name":"Dr.Birkin",
            "choices":[
                "Yes...",
                "No...",
                "No, and she bit down again..."
            ],
            "content":"<div class=\"\"><div> <span>          As soon as the door opened you expected Kate, but the sound of the yawn that emerged from her mouth assured you it was Tina. This frightened you, as Kate was going to play with you a bit, but Tina tended to eat a lot. And other people's left out food. You were right in her line of sight, and the look on her face spelled doom. The ice cream was too strong, you were unable to get out as she approached. With spoon in hand, Tina started to dig in at a lightning pace.<br>\r\n          You couldn't see her, but the sounds assured you that your demise was imminent. The sounds grew louder, and soon you were hoisted into the air and plunged into her mouth. Her moving mouth disallowed you to stand, and you were tossed around in it on an unstable path. Soon you were thrown under her teeth, and she bit down softly. You weren't seriously hurt, but did she feel you?</span></div></div>",
            "created":1214888400,
            "id":550501,
            "title":"Tina's lunch?"
        },
        "13422":{
            "author_id":"dr.birkin",
            "author_name":"Dr.Birkin",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><div> <span>          With a half a bowl of ice cream left Tina was too distracted to notice you getting bitten. Kicking her tooth resulted in nothing, and you were soon sent around her mouth once more in a frenzied path. You wished for this to end quickly, and your wish was soon granted. Instead of stopping like you wanted, you were thrust down the back of her mouth and into her throat. From there was a one way trip to her stomach, and you immediate death. With a splash you land in a mix of ice cream and stomach acid, and look for a way out. The way in is too high up to reach, leaving only the valve to the stomach as a viable option to go to. You start to push on the valve leaving the stomach with all your might.<br>\r\n<br>\r\nDid you make it through?</span></div></div>",
            "created":1214888400,
            "id":552092,
            "title":"She's Too Caught Up."
        },
        "134222":{
            "author_id":"dr.birkin",
            "author_name":"Dr.Birkin",
            "content":"<div class=\"\"><div> <span>          Your pushes resulted in nothing. It was a false hope to begin with, as the valve was designed to keep food in to digest thoroughly. Doomed, you lay down on the ice cream and cry, as more continues to come from Tina's throat. A slight tingle starts at your legs, but before it can grow to a burn the ice cream surrounds your head. Soon, you pass out from a lack of air and unable to breathe, die. It was around this time that Tina finished the sundae with a satisfied burp. As your extremities were dissolving, Tina sat down on the bed inside her room.<br>\r\n          Kate finally entered the kitchen once Tina was laying down in her bed. She looked the same from the front, but a quick glance at her back would reveal the outline of a sex toy she'd gotten to play with you. Surprised at the lack of bowl on the counter she speedily searched the kitchen. Finding the empty bowl in the sink, Kate knew just who to find. Rushing to Tina's bedroom, Kate confronted her once inside. The conversation became heated, and evolved into an argument. Tina had done this in the past and was wondering why Kate was so angry. Kate realized that revealing your fate to Tina wouldn't produce anything good. Tina would cry, your parents would be angry, and the police might even arrest her for manslaughter. It was with heavy regret that she lied about the source of her anger, \"Well, I just don't want you to get fatter.\"<br>\r\n          Angered by this statement, Tina kicked Kate out of the room. Tired, she fell asleep and let her body do its work. In the morning, she got up and examined herself in the mirror. It seemed that her already round ass was a bit rounder than before. Seeing that Kate was right, she resolved to lose weight. Over a few months this resulted in her body becoming similar to Kate's. She couldn't, however, get rid of that little amount of fat she'd gained on her ass.</span></div></div>",
            "created":1214888400,
            "id":552094,
            "title":"Older Brother Sundae."
        },
        "135":{
            "choices":[
                "She gulps you before you could blink....",
                "She makes a you sandwich....",
                "She decides it would be more proper for one of your sisters to get to eat you..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before you could do anything you were on her hand directly in front of her face, \"Well Jason, you look much cuter in this size and I think also a lot............TASTIER!!\"<br>\r\n<br>\r\nDoes she eat you? If yes, how?</span></div></span></div>",
            "created":1216184400,
            "id":556652,
            "title":"Tasty Prey"
        },
        "15":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Get help from Sarah the lovely redhead gardener.....",
                "Go slip under the door to the dinning room…..",
                "Get the attention of sunbathing sister Kate…..",
                "Stay where you are and hope someone sees you…..",
                "What? You are grabbed without warning….."
            ],
            "content":"<div class=\"\"><div> <span>          You had been lying out by the pool, watching Sarah who was planting some flowers. You had been admiring her lovely round ass, out of the corner of your eye, as she was kneeling down to do the planting. Now that you are shrunk and need to get help from somebody, since she is quite close by, you figured she would be the best choice to get help from. Though you wonder if it is wise, because you know how horny she gets when you are close to her, you think there might be a chance that she would just keep you for herself as a sex toy, not that you would mind being used sexually by her, but at your size it could be fatal. You could go slip under the door nearby, which leads to the dinning room. It is nearing lunch time and Nikki the serving maid would most likely be setting the table for lunch.<br>\r\n           But then you see your sister Kate come out the door wearing a two piece bathing suit, she walks over a few pool chairs down from you and lays out on a towel to do a little tanning. You could go and get help from her, though you wonder if she would take advantage of you and do one of her, try and scare the heck out of Jason, routines. Last week she freaked you out by coming into your room and striping in front of you and saying that she was going to have her way with you. You have to admit that your sister is hot, but it is wrong because she is your sister. You think on what to do. Get the attention of Sarah the gardener. Go slip under the door to the dinning room and get help from whoever is in there, or go get the attention of Kate. <br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1214802000,
            "id":550087,
            "title":"Shrunk Poolside."
        },
        "151":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "You run around to the front of her and jump up and down….",
                "You think it would be fun to climb up Sarah’s ass….",
                "She gets up and you quickly jump onto her shoe…."
            ],
            "content":"<div class=\"\"><div> <span>          You decide to get help from the sexy gardener girl Sarah. You run over to her. At the moment, she has went from kneeling to sitting down. There are a few ways you could go about getting her attention. You could just run around to her front and hope she sees you. Also you look at her fabulous jeans clad ass and the blue blouse that is riding up a bit so that part of her back is visible; you think about grabbing onto her ass and trying to climb up it, getting onto the blouse and climbing up to her shoulder to speak into her ear. You think about which way you will go about this.<br>\r\n<br>\r\nWhat happened next?<br>\r\n</span></div></div>",
            "created":1214802000,
            "id":550089,
            "title":"Next To Giantess Sarah."
        },
        "1511":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "She shows you to your sisters and the rest of the staff…..",
                "She is still thinking….",
                "Takes you back to the house that she lives in on the grounds......"
            ],
            "content":"<div class=\"\"><div> <span>          You run around to Sarah’s front and jump up and down. Luckily she was looking down right at the spot where you are. She is startled for a moment, but then she smiles and grabs you. You get a shiver of pleasure all over your body as you feel her smooth warm hand around you. “Oh my Jason,” Sarah said and giggled, “How did you get so small?” Of course you told her that you didn’t know. She smiled, “You look so cute at this size, especially between those legs I see you are happy to be in my hand.\" You turn a little red and try to cover yourself. You ask her if she will get you some help at trying to back to normal. You see she is in deep thought on what to do with you.<br>\r\n<br>\r\nWhat does she do with you?<br>\r\n</span></div></div>",
            "created":1214802000,
            "id":550090,
            "title":"In Sarah’s Hands."
        },
        "15112":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "She keeps you for herself….",
                "You hear a rumbling sound coming from her belly….."
            ],
            "content":"<div class=\"\"><div> <span>          You look at Sarah as she thinks on what to do with you. She is taking a while and that makes you nervous and you wonder if she will help you. She could decide to keep you for herself. You distract yourself from the fear by staring at her enormous chest. You wouldn’t mind spending some time in between her large globular breasts. You watch as they move up and down as she breaths. She then looks at you and you know she has decided what she wants to do.<br>\r\n<br>\r\nWhat happens next?<br>\r\n</span></div></div>",
            "created":1214802000,
            "id":550092,
            "title":"Sarah Thinks More."
        },
        "151121":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "\"Sure, Lovely.....\"",
                "\"No thanks, I have plans.....\""
            ],
            "content":"<div class=\"\"><div> <span>          \"You know what Jason,\" Sarah finally replies as she thinks about this issue for long enough. \"Umm, what,\" You ask, getting scared as Sarah smiles at you in somewhat chilling way. \"You are too good of a chance to pass up,\" She bursts out as she holds you tight in her palms. \"Agghh, no, you can't do this Sarah, please rethink this,\" You plead with a hoarse voice as your lung lack oxygen. \"Heh, you know what's one thing money can't buy,\" Sarah asks you, \"It's Power. Complete and Total Power.\" Before you can ask what she's talking about, she adds, \"I'm talking about this Infinite Power that I have over you right at this moment. Even if you gave me everything that belonged to you, I couldn't possibly go and buy this amount of power!\"<br>\r\n          Realizing your fate, you only shrug and hope that Sarah may get bored of this power game and let you go one day... \"Let's see... What should I have you start calling me from now,\" Sarah mumbles to herself. You feel like you are an insignificant being that which now solely exists to pleasure Sarah and you wonder if you should jump off this hand in hope that your agony ends here now... You soon hear a door to the mansion open and can see that it was Rita, coming out. \"Hey, Sarah, Tina decided that we should have a picnic out there, so just hold on there for a moment, I will prepare lunch very soon,\" Rita shouts in a friendly tone. \"Ummm...\" Sarah replies, caught off guard...<br>\r\n<br>\r\nWhat is Sarah's answer?</span></div></div>",
            "created":1214974800,
            "id":552095,
            "title":"You Are One Thing Money Can't Buy."
        },
        "151122":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "content":"<div class=\"\"><div> <span>          You hear a rumbling groan from inside Sarah’s belly. You look up at her and see that she is looking back. You are unnerved at the fact that she is now licking her lips while looking you over. “Hey Jason,” Sarah said smiling, “It’s lunch time and I think you look like you would make a tasty snack.”  “What, no,” You shouted. “You wouldn’t deny a girl her lunch would you,” She giggled, stuck out her tongue, and gave you a big full body lick, “Mmm, yummy.” You couldn’t help be turned on from receiving a tongue bath, which Sarah noticed, “Ah I see you like being tasted, well you will love being sucked on and swallowed whole.” You look on in fear as she dangles you by your feet and opens her mouth wide and begins to lower you in.<br>\r\n          Her mouth closes around you and then she sucks you inside and it all goes dark. For several minutes she sucks and savors you, covering you in saliva as her mouth is watering from how good you taste. Then with out warning, she whips her tongue back and half of you enters her throat. She gulps and her throat muscles grab a hold and squeeze you down, down, down into the darkness, plopping you down into her stomach. You couldn’t believe it, the sexy redhead who on several occasions made out with you, has just swallowed you for the purpose of digesting you. You are scared but turned on too, because this is a fantasy coming true, but you don’t want to die.<br>\r\n          You bang on the sides of her stomach and plead with her to throw you up. “Oh, I hear and feel you in there Jason,” Sarah said and moaned as she stuck her hand down her pants and pleasured herself, “No, I like the thought of digesting you. I saw all the times that you gawked at my hot ass, especially today. I think it is a real treat for you, because tonight I will go home and parts of you will come right out of it. Even better, you will become extra padding for my sexy round ass. You give up and lay down on her stomach floor. Sarah went on gardening while you awaited your fate inside her sexy belly.<br>\r\n</span></div></div>",
            "created":1214802000,
            "id":550106,
            "title":"Sarah's Scrumptious Snack."
        },
        "1512":{
            "author_id":"jeffrey420",
            "author_name":"me",
            "choices":[
                "You fall...",
                "\"Help me,\" you shout....",
                "*Yawn* \"I think I'm going to go take a nap now,\" Sarah said...."
            ],
            "content":"<div class=\"\"><div> <span>          You start to climb up Sarah's ass. You grab on to the fabric and slowly step by step climb up. Then you reach the back of her shirt, this is an easy climb since she is bent over. You keep climbing up and you soon grab the back of the bra strap through her shirt. this gives you ideas, but you realize that this isn't some sorta sick fantasy and you need to get her help, so you reach her shoulder and try to talk into her ear.<br>\r\n<br>\r\nWhat happened?</span></div></div>",
            "created":1216011600,
            "id":556078,
            "title":"Climbing Sarah"
        },
        "15121":{
            "author_id":"jeffrey420",
            "author_name":"me",
            "choices":[
                "She goes and takes a bath",
                "she goes inside to take a nap"
            ],
            "content":"<div class=\"\"><div> <span>          You fell forward, she hunched over and the only thing you can think is in a second you're about to be dead.<br>\r\nYou close your eyes, then you feel weird as you open your eyes. It's dark, as you feel around and you figured it out. You're in her cleavage, but how?<br>\r\nSarah had spontaneously yawned, placing her breasts in the exact position to help for a few seconds, and shes wearing a tank top.<br>\r\n<br>\r\nYou figure you best you stay there, at least for now.</span></div></div>",
            "created":1216011600,
            "id":556080,
            "title":"Sarah's Cleavage"
        },
        "151212":{
            "author_id":"orphanstragedy",
            "author_name":"Trextyler45",
            "choices":[
                "Run and get help elsewhere",
                "Explore the sexy Goddess at the risk of your own safety"
            ],
            "content":"<div class=\"\"><div> <span>All of a sudden she gets up. You begin to feel the gentle sway of the mountains moving around you as she walks. Finally, after a while, your world begins to shift. She lays down and finally after a few minutes everything settles and you can feel her breast gently rising and falling with each sleeping breath. Figuring she must be asleep, you climb out with a bit of difficulty and emerge on her boob. She looks massive from this close. You thought she was big before, but she is a whole lot larger now that you get to feel yourself scaled against her massive face looming over you in a peaceful slumber. All of a sudden, as you are lost within your musings about how big she is, or rater your diminutive size, she suddenly shifts onto her back and the motion jostles you off of her and onto the bed. You feel a bit shocked at the sudden change but manage to regain your bearings fairly quickly. you look up at the mountain of boob that now dominates your field of view. you are on her right side and just in between her arm and her side. \"Phew, that was close. another inch or so and I could have been crushed or pinned under her arm.\" You look around to decide what you should do. Obviously she wont be of much help as she is right now, so you could try to leave and venture to somewhere else to get help. Then another idea dawns on you. You have always wanted to do some stuff with Sarah. Now is your chance. She is peacefully asleep and would be none the wiser if you did anything with her as she slept, with you being so small. You hadn't realized before but you have a raging hard-on looking at her sexy giant form snoozing over you. You shake your head, attempting to defog a bit of your thoughts. This was crazy. She is massive. One twitch could kill you at this size, and she would never even know it. You need to think this over more carefully. you decide to lay your options out on the table. You could:</span></div></div>",
            "created":1388431380,
            "id":1717639,
            "title":"she goes inside to take a nap"
        },
        "1512122":{
            "author_id":"orphanstragedy",
            "author_name":"Trextyler45",
            "choices":[
                "Fly North",
                "Spelunking"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You could start up with her face, where all of the wonderful Make-Out sessions have happened, you could explore the mountains and valley you rode here in and have a better look,  or you could head south and go spelunking in a cave or two.</span></div></span></div>",
            "created":1388431680,
            "id":1717644,
            "title":"Explore the sexy Goddess at the risk of your ow..."
        },
        "15121222":{
            "author_id":"orphanstragedy",
            "author_name":"Trextyler45",
            "choices":[
                "Pussy",
                "Ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would you rather check out the nice ass that was presenting itself to you earlier in the day or perhaps go and see the sweet honey-pot you have been dying to see for ages. \"I wonder if the carpet matches the drapes,' you muse to yourself.</span></div></span></div>",
            "created":1388431860,
            "id":1717648,
            "title":"Spelunking"
        },
        "151212221":{
            "author_id":"orphanstragedy",
            "author_name":"Trextyler45",
            "choices":[
                "you is dead",
                "you awake from your lucious pussysky filled slumber"
            ],
            "content":"<div class=\"\"><div> <span>You climb up onto her and walk down the length of her body, figuring that the alternative may include being squashed if she were to shift in her sleep. you finally arrive at her panties. You realize that due to the lack of jeans, she must have removed them before laying down. Her panties are bright red with black lace intricately woven around her waistband and her crotch. You shiver to yourself at how wondrously sexy this woman is sometimes. You begin to worry that the elastic of the panties might be difficult to get under but upon another look you realize that her hip bones stick out just enough to leave a slight gap on either side of her mound. You just manage to slip under it. You cant see anything in here, the panties don't seem to be letting hardly any light in. You decide to close your eyes and experience the other senses while down here. She smells of tulips and the indescribable scent of a woman. you reach a hand down and feel only skin. she has silky smooth skin and you don't really feel any hair around where you are standing but you don't feel good with moving around until you can see. Best not to fall into the hot girl's pussy. 'Although there would be worse ways to die.' you muse to yourself. You open your eyes to find that your eyes have finally begun to adjust to the lack of light. You stumble back a bit at what you had first presumed to be fire. As you regain your bearings you realize that it is just her pubes. They seem to be just as bright red as her hair. She shaves them in a landing strip shape. your eyes drift down, following it to the most perfect pussy you had ever seen. It was such a bright pink in color. You think this may have just been because of the contrast to the pale skin and bright orange pubes but regardless, it was beautiful. It has the hood right at the top sticking out just a bit and the slit was just that. A slit. It barely stuck out from the rest of the skin around it at all and it was trim and symmetrical and slightly glistening with her juices. It was perfect. you wondered if she was having a naughty dream or perhaps your presence was having this effect on her. In your awe, you stumbled forward towards it, eager to lay a hand on the prize that you had worked so hard to get to. You finally place a hand down onto her nether lips. you run a hand across her tender, slick flesh. You shiver in anticipation. She was so soft and sheik. It felt like running a hand along silk. And she was so much more wet than you could first determine by looking at her. You begin to rub faster and faster, eager to try to get her clit to come out and play as well. It didn't take much for you to achieve your goal. As you watched, her nub emerges from her hood and right into your waiting hands. you rub a bit and then you slip, almost falling into the giant girl's honeypot and decide to reposition yourself. you shift yourself and move your legs so that you have a leg on either side of her pussy and are now putting all you have into her clit, determined to make this girl cream her panties in her sleep. You begin to feel heavy breathing coming from the north of you and that only spurs you on. Just then your whole landscape shifts a bit and in your shock you stop moving, wondering if you have woken the object of your efforts. It is very quiet, not a sound is made at all. Then, out of nowhere, a massive hand comes crashing through the elastic of the panties and begins to rub her pussy, with you trapped in between it and it's objective. She begins to rub herself, agonizingly slowly at first, all the while you are drug along with her, your face rubbing against the very thing with which you were so preoccupied moments ago, without anything you could do to stop it. You couldn't move at all. Much as you may try to squirm and escape, the hand is just too strong. It looked like you were simply along for the ride, and ride she did. She began to increase her speed a little, and as her speed increased, so did her juices. You didn't think it was possible, but she was flowing out right onto you and her hand like the river Nile. Back and forth she went. You didn't think she would ever stop, but then she did. It happened suddenly. She just stopped. She didn't cum. She didn't do anything. She just started to snore lightly. She had been asleep for the whole event it would seem. You began to look around and feel around to assess your situation. You didn't want to move too much, lest that whole thing take place again. You began to notice. You were still being pushed onto her pussy but just by the weight of the hand over you. your legs were dipped into her hole and you were up to about your thighs. you were completely soaked in her primal scent and liquids. You didn't think you would ever get the smell out of your hair, not that you minded much. Your main concern at the moment, however, was escaping your current predicament before it got any worse. You begin to shift ever so slightly to try to get out without alerting you unaware snoozing captor. You manage to get up to about your knees after a bit. You didn't know how you were managing any movement under that massive hand of hers. The area around you begins to moisten a bit more and you begin to worry. You don't want to be the one caught between that hand and its orgasmic goal. Not again. So you begin to hurry. You make it to about your feet before it happens. Her hand twitches, shocking you into motionlessness. you remain as still as possible, hoping that was just a simple twitch and nothing more, but then the worst happens. Her hand pulls out of her panties, pulling you back away from the direction you were climbing and drags you back into her pussy up to your chest. Thinking that this wont be nearly as bad to get out since the hand isn't weighing you down anymore, you begin to move, forgetting about why you were really being slow and cautious in the first place. you squirm back and forth, thrashing about trying to pull yourself back out and then you hear a faint moan in the background. This scares you shitless and causes you to try to move faster to get out. This was a mistake. You hear another moan, louder this time. you cease all movements. You had made it to your waist. you figured that you could let her calm down a bit before continuing. Then, the deafening silence is broken by her hand rushing back into her panties again. You scream and squirm to try to escape but this time a finger extends and plunges into her love cave, bringing you deep into the depths with it. you squirm around inside, trying desperately to free yourself, but to no avail. Your thrashing causes her to rub and finger harder, jabbing you harder and deeper into her womanhood. You don't want to die. You can feel her walls closing on you in ecstasy over and over again. If they didn't crush your body, you might just drown in the very juices you were soaked in. Finally, she spasms around you and you can feel your bones creak and your joints pop. then a massive amount of juice flows out and drags you with it. you and up stuck to her panties by the viscous substance, too weak to fight it. You lose consciousness thinking that this would be the end of your life. Death by girl parts. Not bad you think to yourself, as you fade into the darkness.</span></div></div>",
            "created":1388438640,
            "id":1717696,
            "title":"Pussy"
        },
        "1512122211":{
            "author_id":"orphanstragedy",
            "author_name":"Trextyler45",
            "content":"<div class=\"\"><div> <span>Sarah wakes up from her slumber feeling refreshed, if slightly sticky. She smells her hands and feels her panties. She giggles to herself. \"Wish I could have enjoyed that consciously,\" she says grinning. \"It feels like it was a doozey. Amazing I didn't wake up for this one. Though I am glad I didn't. Had a dream about having a dildo that thrashed in my pussy like it was trying to escape. No wonder I creamed my panties so hard.\" She proceeds to peel them off her sex and toss them into the hamper to go shower, unaware of the fact she just came all over her make-out buddy to the point of death. His body would be washed away with all of the female cum in the washer. washed down the drain and into the sewers. His body was never found. Although Sarah may have been saddened by his passing she was happy in the pleasure she had that one night and never experienced another orgasm like the one she went through in her sleep that night caused by a tiny boy thrashing for life in her pussy.</span></div></div>",
            "created":1388439360,
            "id":1717705,
            "title":"you is dead"
        },
        "1512122212":{
            "author_id":"orphanstragedy",
            "author_name":"Trextyler45",
            "choices":[
                "you died",
                "you wake up plastered to the tip of the vibrator with cum in the sock drawer"
            ],
            "content":"<div class=\"\"><div> <span>You awake to find yourself glued to her panties by her cum. You find that you cannot move a muscle and that the front of you is pressed right into her slit. your face is right at her clit. You figure that the only way you can get unstuck from here without ending up in a washing machine is with some help. You decide to try to wake Sarah up. As you cant move anything, this could be a problem. You decide to try to lick her clit. It may be miniscule but you decide to try it anyways. After all, anything could help, right? You begin to lick, figuring that this being the most sensitive part of her body, she might feel something. You were right, but since you were so small and she so big, you didn't do much but tickle her. She reached a sleepy hand down and scratched her panties. It was near excruciating, like rug burn all over your body, but her scratching and freeing you a bit managed to give you enough leverage to pull yourself free. You finally managed to get free of her panties. As much as that whole event terrified you, you couldn't help but feel very turned on and aroused by the whole thing. At your miniscule size you had quite literally been completely inside a very hot girl. Not to mention tat the act managed to bring her to an orgasm. You helped and initiated a massive girl to have an orgasm around you and flood you out of her pussy in her juices and lust. You felt lightheaded from how hard you were. You didn't know what to do next. You were almost tempted to go back into her panties for another go but the rational side of you that says how you just almost died from that persuaded you otherwise. Standing on her stomach and hearing it grumble you looked around. you found a clock alerting you that it was 5:59 am. It would be any second that she woke up to go tend the gardens. You had to move fast. You figure you don't want to be seen covered in her cum, as that could lead to some awkward explaining and possibly turn her on to the point that she wants you as her new sex toy since you managed to make her cum without much assistance. Before you can make a choice on what you want to do, her alarm goes off. she jumps a little, making you bounce into the air. she rolls over and groans. You land on her back as she sits up on her hands and knees and you roll into her crack. She sits up on her knees and pulls up her panties, which must have come down a bit when her hand went into them last night. She pulls up her panties and you with them into a wedgie. You get pulled into the epicenter of the booty that you were staring at by the pool just yesterday. She says to herself \"Wow, my panties need changing, guess that dream I had last night did a number on me. Its not often you dream about living dildos that climb into your pussy and thrash around,\" she said smiling lecherously. She walks into the other room, stripping as she walks, dropping her clothes into the hamper to be washed later, and gets into the shower with you stuck between her cheeks. At first the prison just gets really hot without a trace of moisture anywhere, but then she bends over to let the water wash over her ass and pussy. She sighs in relief but you just get blinded by the sudden light and water in your eyes. you finally manage to look around and realize you are stuck in her asshole by your feet. Her sphincter has too good of a grip on you for you to get your feet out either. She then grabbed a washcloth and began to rub herself down with it. she started at her feet and made her way up to you. she went over her asshole and with the force she took you with her. she then proceeded to rub you over her pussy and then on up the rest of her, paying special attention to her boobs. You end up being rubbed all over and end up in between her boobs. She gets out of the shower and grabs a towel. You get rubbed all over by that too and funnily enough end back up in her cleavage. she goes to put on her bra and you try to move so as not to get trapped in it and end up falling into the cup of it and getting pushed up against her nipple before it gets clipped on leaving you stranded there. You figure you will make the best of your time here while she works. so you begin to rub her nipple and feel the flesh of her boobs. Silky smooth just like her pussy. Bright pink nipples too against the pale creamy skin of the goddess upon whose boob you now sit. You continue your efforts on her nipple, hoping to make her nipples hard while she works. Meanwhile Sarah was feeling it. She didn't manage to trace it back to you specifically, but she suddenly felt very aware of the clothing that was brushing against all of her naughty bits. Her clit ached with the gentle caress of the new silk panties she put on in the hopes that something would happen to let her show them off to Jason. The silky bra brushing against her nipples with every swaying step. Every piece of her clothing was gently brushing against her skin and it was giving her goose bumps. She could only imagine how hard her nipples were getting. She could feel her lower lips salivating into her panties. The gardens could wait. She needed this. She walked back inside and got into her sock drawer to pull out a cylindrical pink vibrator. She speedily stripped into only her bra and panties. she laid down and slowly removed those too. First the panties. She needed to feel how wet she was. she stuck the vibrator down there and dipped it in once, moaning loudly. It came back dripping. She removed her bra and rubbed the dripping vibrator on her nipples. Then, arching her back, she exclaimed \"Fuck it!\" and plunged her surrogate cock deep into her pussy as it would go and turned it up to the highest level. She screamed out in lust and pleasure, humping the air for all it was worth and slamming the vibrator so far into herself she almost let go of it inside her sopping cunt. Jason, meanwhile, could feel his rubbings having some effect. he could hear the heavy breathing. And then, her nipples suddenly got so hard they could probably cut glass. Then you could hear some shuffling outside and she stripped and then you felt the worlds axis change to be flat again as if she was going to go back to sleep. A loud moan from right above you told you otherwise though. All of a sudden there was a light shining in your face. She had removed her bra. Just as you jumped up in hope for freedom from the bra, you are slammed back down by a giant wet pink thing and rubbed around the nipple. then as the pink thing lifts and you go with it, you have a brief view of your surroundings. You could see Sarah moaning in ecstasy below you and her entirely naked form. she arched her back with a moan and said \"Fuck it,\" just as the thing carrying you shot south towards her pussy. That's when it dawned on you. The moaning, the naked, the pink. You were on a dildo. Fear started to grip you. You were at the end of a dildo. And she was heading towards her pussy with you. You were about to scream but without any hesitation, you are plunged as deep as can go into Sarah's hot, throbbing, juicy cunt with a pleasure and lust filled scream. Then as if it could get any worse, you hear a click and the whole world begins to shake like the worst earthquake the world has ever known. the walls grab and pull and massage your whole body with the vibrator and begins to salivate the juices you were so familiar with just last night. You begin to fear for your life again. This is the second time you ended up in her pussy. But last time there wasn't anything to block her juices flowing you out. now there is a giant pseudo-cock in your way. You could die here in her throes of passion. you struggle for all your worth in the hopes that she lets you out and lets you live. She finally starts to cum. She spasms so much and floods her pussy with the nectar of her love cave and due to lack of oxygen you pass out, seeing the bright pink of her pussy fill your vision as it begins to fade into black.</span></div></div>",
            "created":1388458140,
            "id":1717907,
            "title":"you awake from your lucious pussysky filled slu..."
        },
        "152":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "The serving maid Nikki, setting the table for lunch…..",
                "Cleaning maid Erica, dusting off the china cabinet…..",
                "Your sister Tina, sitting at the table, waiting to be served lunch….."
            ],
            "content":"<div class=\"\"><div> <span>          You decide to go to the outside door that leads to the dinning room. You believe that it would be better to try and seek out someone other than your sister Kate or gardener girl Sarah. You slip under it with out a problem. You wonder where you will go next. You then notice that you are not alone in the room.<br>\r\n<br>\r\nWho is in the room with you?<br>\r\n</span></div></div>",
            "created":1214802000,
            "id":550096,
            "title":"Under The Dinning Room Door."
        },
        "153":{
            "author_id":"jeffrey420",
            "author_name":"me",
            "choices":[
                "Erica ",
                "Nikki ",
                "Sarah"
            ],
            "content":"<div class=\"\"><div> <span>          You walked over to were your sister Kate was laying on the ground, you climb up the fabric of her bikini bottom, and walk on the fleshy surface of her tummy. You get to the breasts and climb over the left cup of the bikini. soon you reach her face. you step on it a few times and she wakes up. <br>\r\nBut unfortunately, she sits up to, making you land on her legs after sliding down her magnificent body. \"Huh,\" she said, confused looking at you. \"Kate,\" you yell. She picked you up, and gets a bit startled, she starts to ignore you while she runs inside to find someone to help you. She talks to...</span></div></div>",
            "created":1233300540,
            "id":640772,
            "title":"Sunbathing Sister Kate"
        }
    },
    "info":{
        "author_id":"writerlord",
        "author_name":"OBusywriter",
        "brief_description":"One day you shrink while at the mansion you and your family live in.",
        "created":1214852220,
        "description":"<td align=\"left\" class=\"norm\">Quick Rules:<br>\r\n1.)\tNo guys in this interactive, no gay stuff. Interaction between girls is just fine. Also no animals, insects, cartoon characters, etc, etc. Just sexy normal human girls and women.<br>\r\n2.)\tIf you add new female characters, age limit is 16 to 32.<br>\r\n3.)\tDeath of Jason is encouraged. Ways allowed, eaten, swallowed, cooked and then eaten, sat on, crushed by breasts, and while being used sexually by a girl or woman.<br>\r\n4.)\tJason starts out at 3 inches, but one of the girls or women can have the power to make him a different size, the limit is 3in to 20in, or back to normal size.<br>\r\n5.)\tMinimum chapter size, 4 good sentences. Use spell check and use good grammar. Story is to be written in the second person prospective unless otherwise stated. (i.e.)- You climbed up her pants. <br>\r\n6.)\tMake original chapter titles, don’t use what is put in the title blank, it is just what the choice you chose was. Use the typing format I use, look how I make paragraphs, use the indent tag at the beginning of a paragraph.<br>\r\n<br>\r\n          You are 21 year old Jason. You live in your family’s mansion, you are quite rich, but that doesn’t keep bad things from happening. Some how you have shrunk to 3 inches and now you have to get help. The mansion is now bigger then ever at your size. It is summer and the only people that are at the mansion at this time are your two younger sisters and the all female staff that keep the mansion in running order. Your parents are away on vacation for the whole summer, they won’t be back for 3 months.<br>\r\n<br>\r\nCharacters:<br>\r\n<br>\r\n<b>Tina</b>: Your sixteen year old sister. She is 5ft 4ins with a plump body type, C-cup breasts, and nice round ass. She has medium length blond hair. She loves to eat and try new foods.<br>\r\n<b>Kate</b>: Your eighteen year old sister. She is 5ft 6in with a semi-plump body type, D-cup breasts, and tight round ass. She has medium length brunette hair. She has always liked to mess around with you. She loves to try and scare you.<br>\r\n<b>Erica</b>: The maid that cleans the house. She is twenty-three years old. She is 5ft 6ins with a semi-plump body type, D-cup breasts, and plump round ass with nice plump thighs with smooth sexy legs. She has long brunette hair. You have flirted with her on several occasions, and you really like her, especially when she is working in the traditional black fabric maid uniform/dress with the white lace frills.<br>\r\n<b>Nikki</b>: The maid that sets up the dinning table and serves the meals. She is twenty-four years old. She is 5ft 7ins with a lean athletic body type, with C-cup breasts, and a tight round ass and also has sexy smooth legs. She has long blond hair. She also wears a traditional maid uniform/dress, except hers is a dark blue color. You have a feeling she likes you, like you like Erica. She has flirted with you on several occasions.<br>\r\n<b>Rita</b>: The chef lady who prepares and cooks the meals, she makes everything the family eats except the snacks that the family makes for themselves. She is thirty years old. She is 5ft 7ins with a semi-plump body type, D-cup breasts, and plump round ass. She has medium length red hair. She is a bit older than you but you wouldn’t mind heating things up if she offered to do it with you on a counter top.<br>\r\n<b>Sarah</b>: The gardener girl. She is twenty-five years old. She is 5ft 6ins with a semi-plump body type, D-cup breasts, and a plump round ass. She has long red hair that is pulled back into a ponytail. You know she has a thing for you; she doesn’t just flirt with you, a couple of times while you were outside she grabbed and made out with you. You indulged her every time she did it because you felt that was as far as she wanted to take your relationship, though you wished that someday she would rip off yours clothes and hers and just do it with you on the lawn.<br>\r\n</td>",
        "id":1445292,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1388458140,
        "modified":1388458140,
        "pretty_title":"Shrunk At The Family Mansion"
    }
}