{
    "chapters":{
        "1":{
            "author_id":"fatteningfurry",
            "author_name":"julio",
            "choices":[
                "el estudiante",
                "el profesor",
                "o el ayudante",
                "o el guardia",
                "otros"
            ],
            "content":"<div class=\"\"><div> <span>Primero que todo hay que escoger el personaje <br>\r\n<br>\r\nJulio: un joven estudiante de 19 años, mide 1.65 metros y pesa 202 libras, es algo gordito como se daran cuenta, de piel clara, cabello oscuro y ojos cafe. El vive en un complejo de apartamentos cerca de la universidad que estudia. <br>\r\n<br>\r\nRicky: un profesor de 24 años, mide 1.90 y pesa 160 libras,es delgado pero tiene algo de pancita,  piel morena, cabello oscuros y ojos cafe. El trabaja en la universidad y tambien crea sus propios experimentos.<br>\r\n<br>\r\nSamuel:  ayudante de 19 años, mide 1.78 metros y pesa  140 libras,es extremadamente delgado, es de piel oscura, cabello negro y unos ojos verdes. El es ayudante en el laboratorio de la universidad y ayuda al profesor ricky en algunos experimentos.<br>\r\n<br>\r\nMatt: guardia de 28 años, mide 1.85 y pesa 180 libras, es musculoso, es de piel clara, cabello rubio y ojos cafe. Es el guardia de seguridad en la universidad.<br>\r\n<br>\r\nSi deseas otro personaje te dejo la opcion 5 para que puedelas crearlo </span></div></div>",
            "created":1350725040,
            "id":1450193,
            "title":"todo empieza en la universidad"
        },
        "11":{
            "author_id":"fatteningfurry",
            "author_name":"julio",
            "choices":[
                "pildoras aumentadoras de apetito",
                "anillo de deseos",
                "pistola de rayos grasas",
                "aumentador de calorias",
                "más ideas"
            ],
            "content":"<div class=\"\"><div> <span>\"Un dia normal como todos los demas, dando quimica. Desearia que algo cambiara esta rutina\" y es interrumpido mis pensamientos cuando oigo sonar el timbre para la proxima clase.<br>\r\n<br>\r\nMientras camino por los pasillos y pienso que me falta algo pero no se que es eso. Cuando me tropiezo con uno de los jugadores de rugby. Es lo que menos queria ya que termina iendome mal pero gracias a dios pasaba mi profesor ricky que hizo que el no me hiciera nada.<br>\r\nSigo mi camino y pienso en lo que me gusta que es estar mas gordo, desde pequeño e querido pero no e ganado mucho peso. Siempre en la noche me imagino engordando y eso me excita y eyaculo. Pero ahora seguir con las clases.<br>\r\n<br>\r\nTranscurre el dia como siempre tan monotomo hasta cuando dimos clase con ricky, me encanta su clase de experimentacion ya que siempre hay algo nuevo. El trajo su ultimo invento un duplicador de materia, vimos como duplicaba cosas hasta duplico uno de mis compañeros pero como siempre precavido puso un boton de reversa haciendo que los duplicados desaparecieran.<br>\r\n<br>\r\nY nos dejo una tarea de que nosotros hagamos un invento, no importa que fuera solo que fuera uno de los temas: magia y ciencia<br>\r\n<br>\r\nEmocionado llegue  a mi apartamento y empeze hacer mi invento<br>\r\n<br>\r\npense y pense hasta que se me ocurrio hacer algo para mi algo que me engorde y me salieron  varias ideas como....</span></div></div>",
            "created":1350726540,
            "id":1450196,
            "title":"dia que empieza"
        },
        "112":{
            "author_id":"lass",
            "author_name":"E",
            "choices":[
                "\"Deseo engordar 1 kilo al día\"",
                "\"Deseo que mi mejor amigo, Jorge, engorde 1 kilo al día\"",
                "\"Deseo que todos los chavos de mi escuela engorden 1 kilo al día"
            ],
            "content":"<div class=\"\"><div> <span>Me decidí a hacer un anillo de deseos al fin y al cabo con él podría hacer todo posible.<br>\r\n<br>\r\nA pesar de que suena difícil hacer un anillo de deseos en realidad no lo es, solo se necesita un anillo común y corriente, tener un neurotransmisor para no tener que decir los deseos en voz alta y un poco de elixir mágico que por suerte tenía en casa, después de alrededor de tres horas de trabajo por fin logré hacerlo.<br>\r\n<br>\r\nEra el momento de probarlo, como tenía hambre lo primero que hice fue desear  una pizza la cual apareció frente a mis ojos en una nube de humo color morado, la pizza sabía bastante bien, probablemente por que mi subconsciente lo deseó así.<br>\r\n<br>\r\nCuando terminé deseé tener un poco más de hambre para comer otra, lo cual se cumplió al instante, no me sentía tan lleno y una segunda pizza apareció frente a mis ojos, al terminarla mi pantalón me quedaba muy apretado por lo cual me lo desabroché y comencé a sobar mi panza, lo que me provocó una erección, era algo normal siempre me pasaba cuando pensaba en lo sexy que me vería si fuera muy gordo.<br>\r\n<br>\r\nDecidí desear una réplica del anillo, ya que más vale estar prevenido, guarde esa copia en un lugar seguro y me puse a pensar en el poder que tenía ahora y qué tanto lo podría aprovechar, en ese momento me vino una idea a la cabeza...</span></div></div>",
            "created":1377681240,
            "id":1652911,
            "title":"Anillo de deseos"
        },
        "14":{
            "author_id":"fatteningfurry",
            "author_name":"julio",
            "choices":[
                "pistola duplicadora",
                "anillo de deseos",
                "pastillas metabolizadoras",
                "rayo transformador",
                "mas"
            ],
            "content":"<div class=\"\"><div> <span>estoy en camino a la universidad a hacer mi trabajo de guardia como todas las noches. aunque no me guste ser guardia es el unico puesto que habia disponible, y uno de los requisietos era el fisico, no me gusta ser musculoso es todo lo contrario quisiera ser gordo.<br>\r\n<br>\r\ndejo estacionado mi auto y marco mi entrada de trabajo. siempre a estas horas esta vacia la universidad,no hay nadie a excepcion de mi, y me gusta porque puedo hacer lo que quiera.<br>\r\n<br>\r\nesta noche voy al salon de experimentos y veo muchas cosas, pero no se que son, pero sera divertido probarlas<br>\r\n<br>\r\nasi que cojo lo primero que veo que fue....</span></div></div>",
            "created":1351018020,
            "id":1452309,
            "title":"noche diferente"
        },
        "141":{
            "author_id":"ogostys",
            "author_name":"Huggo Hunter",
            "choices":[
                "Matt empieza a engordarse...",
                "Más clones...",
                "Otra cosa..."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">Después de un rato comienzo a pensar que los laboratorios no son tan geniales como yo pensaba, quizás sea porque no entiendo mucho de lo que está en ellos, además no me he querido acercar a todas sus máquinas o tubos ya que de seguro me metería en un problema mayor si algo se rompiera, decidido a seguir mi ronda nocturna por el resto de la universidad escucho un ruido al fondo del salón vecino, ¿será que alguien entró?, de inmediato tomo mi macana y me aseguro de tener en orden mis otras herramientas, tomo la lampara e intento abrir la puerta de la manera más silenciosa posible... ¡Cerrada!, por suerte me fueron otorgadas un par de llaves maestras, mismas que pueden abrir prácticamente cualquier puerta en la universidad, ahora si abro la puerta, pero no encuentro nada más que mesas vacías y aparatos acumulados por doquier, finalmente enciendo la luz de la habitación gritando fuerte \"alto, ¿quién está ahí?\" pero no hay respuesta, con la luz extra puedo darme cuenta de que usan el salón solo como un bodega y eso me hace pensar que alguien pudiera querer entrar para robar algún objeto de valor, pero parece que nadie a entrado a este lugar desde hace años; todo esta sucio y empolvado y no hay ni rastro de que alguien halla movido nada en lo más mínimo últimamente, pensando en que todo fue solo mi imaginación me decido a cerrar y regresar, pero entonces justo antes de apagar la luz y salir mis pies encuentran camino con una rata que sale rápidamente por la puerta, lo que me hace caer, al menos ahora se de que se trataba el ruido. Me alegro de haberme topado con una rata y no con un intruso humano, a pesar de mi tamaño y mi fuerza no me es grato tener que someter a alguien, por más que lo he hecho ya muchas veces simplemente no me termina de gustar. Desde mi nueva perspectiva me doy cuenta que una de las mesas termina en una \"media puerta\" que no se puede ver estando de pie en la habitación, y como mi curiosidad no me deja solo jamás, muevo la mesa para poder tener acceso a la pequeña puerta; tiene poco menos de un metro de altura por lo que la mesa la escondía perfectamente. Al pasar la puerta, que de hecho no posee cerradura de ningún tipo, me encuentro en una pequeña habitación que parece ser un baño que al igual que el resto se encuentra empolvado y en el olvido, lo único anormal que me encuentro es una pistola de juguete igual de mohosa que todo lo demás, en realidad pensaba encontrarme con más... pero bueno, es solo una escuela. Tomo la pistola, acomodo todo de nuevo, apago las luces y me marcho.<br>\r\n<br>\r\nDe vuelta en la caseta de vigilancia me doy cuenta que ya falta solo hora y media para terminar mi turno y ya que no quiero repetir lo mismo que la última vez me dedico a limpiar y pulir la pequeña pistola para entretenerme, ya limpia se ve en buen estado y la verdad es que contrario a la mayoría de las que he visto desde niño está es bonita, me recuerda a alguna clase de aparato futurista de la televisión, lo único que le falta son unas buenas baterías, seguramente hace ruidos con luces o alguna de esas payasadas, pienso que podría regalársela a mi sobrino la próxima vez que lo vea, parece un artículo de colección. Sin darme cuenta pasa el tiempo y mi supervisor llega, como siempre, muy temprano, y luego de revisar que todo está en orden marca el mismo mi ficha de salida diciéndome antes de salir \"Matt me da pena decir esto pero la universidad va a hacer recorte de personal y no quiero ser injusto al tomar una decisión, por eso a partir de este momento todos se encuentran a prueba, solo quiero que sigas haciendo bien tu trabajo, porque yo se cuanto necesitas el trabajo\" yo simplemente le sonrío antes de salir y darle las gracias.<br>\r\n<br>\r\nPor fin en casa he comprado unas baterías para la pistola, y al abrir el compartimento me encuentro con un pequeño manual de instrucciones que tiró a la basura de inmediato, ¿Quién necesita instrucciones para un juguete de estos?, de cualquier modo ya estoy muerto de sueño así que lo dejo para más tarde la dejo solo con las baterías puestas y ya sentado en la cama doy un disparo solo por jugar: la pistola hace un ruido fuerte seguido de una luz cegadora que impacta en el techo de mi habitación, me quedo boquiabierto y dejo caer la pistola al suelo, no puedo creer que un juguete sea capaz de hacer algo así, sin embargo, puede que no sea un juguete, considerando donde la encontré puede ser que se trate de alguno de los experimentos de la universidad. Tras recuperarme de choque recuerdo la pequeña hoja con instrucciones así que voy a buscarla a mi cesto de basura, tomo la pistola y me encuentro con esto en la nota: <i>\"Replicador exclusivo para uso en seres vivientes, las copias no serán del todo idénticas úsese con precaución; dispare directamente al objetivo y posteriormente vuelva a disparar con el apuntador en posición vertical hacia el suelo. Peligro, en etapa experimental\"</i> \"¡Esto no puede ser posible!\" me da curiosidad y miedo de probarla al mismo tiempo, pero me armo de valor y con los ojos cerrados disparo al helecho que está al lado de la puerta: otra ves el ruido y la ráfaga de luz salen, y al parecer no le producen ningún daño a la planta, luego subo a un banquillo y disparo al suelo para encontrarme con que esta vez en lugar de la luz se produce una especie de masa pastosa que parece moverse, el olor es nauseabundo, casi como el de un cadáver, pero conforme la masa se mueve va tomando otra forma y textura, incluso su olor cambia poco a poco hasta que se convierte en lo que parece ser una copia exacta del helecho al que le había disparado. Aún cuando todo el proceso de replica ocurrió en solo un minuto yo sentía como si hubiera pasado eternidades subido en ese banco, examine la planta y parecía normal, hasta tenía las mismas hojas secas y la misma forma de las raíces, la tierra y la maceta era lo único que le faltaba, en cuanto me pasó la sorpresa salí a tirar la planta, pero me encontré con mi vecina quien insistió en quedarse con ella, supuse que no pasaría nada así que se la di después de todo era más fácil que darle explicaciones.<br>\r\n<br>\r\nLos días pasaron y el trabajo seguía igual, esa semana mi supervisor haría una junta para comunicarnos a quién tendría que despedir y a pesar de que había estado perfectamente bien estaba algo nervioso al respecto, podría ser cualquiera, incluso yo. Iba pensando en eso mientras entraba al patio de la vecindad cuando escuche la voz de mi vecina que me daba los buenos días, como todas las mañanas estaba barriendo el frente de su casa, amablemente le respondí el saludo y antes de entrar se me ocurrió preguntarle por el helecho que le había regalado, para mi sorpresa me hizo notar que era el que se encontraba justo en la entrada de su casa el cual se encontraba impecable, de hecho en mejores condiciones que el mio, que había dejado descuidado últimamente. Entrando a la casa y tras ver el helecho me pregunte si podría sacarle más provecho a ese aparato, clonar plantas no sonaba nada bien pero me imagine que otro yo sería algo curioso y hasta útil, pero estaba ya muy cansado para seguir pensando en eso. Llego el día de la junta y sucedió lo peor que me podría haber imaginado, me despidieron; mi supervisor dijo que no había podido decidir ya que todos teníamos un buen rendimiento así que opto por despedir a quién tenía menos antigüedad, es decir a mí, estaba deprimido, no sabía que hacer, al menos tenía la carta de recomendación de la universidad para buscar un nuevo empleo, pero no estaba seguro de que eso pudiera ser suficiente.<br>\r\n<br>\r\nEn casa no sabia ni en que pensar, así que salí por un periódico para buscar en los clasificados y me encontré con dos trabajos excelentes ambos eran como jefe de seguridad en un almacén, lo que incluía demás del sueldo las comidas en el lugar, al día siguiente me presente, y como esperaba la carta de la universidad como referencia les dejo encantados, tanto que me preguntaron si podría cumplir, al menos de forma temporal ambos puestos, mi sueldo terminaría siendo de 4mil quincenales, nunca había ganado tanto en mi vida. Acepte de inmediato pero sin medir las consecuencias; siempre estaba fatigado y cansado, siempre de mal humor y cada día odiaba más el trabajo, por primera vez tenía dinero, pero no el tiempo ni la energía para gastarlos... fue entonces cuando recordé la pistola y en uno de esos malos días sin pensarlo me dispare, no una, sino dos veces creando dos clones mios. Al principio pensé que serían idénticos a mi pero pronto me di cuenta que no era el caso, si bien lo eran físicamente sus mentes parecerán estar ligadas a la mía de alguna forma, era como si fueran una extensión de mi mismo más que otros individuos sacados de mi; parecían hacer lo que yo quería que hicieran en el momento que yo quisiera y sin siquiera decírselos, uno de ellos me dijo: \"No te preocupes Matt, yo me voy a trabajar y si tu descansas será como si yo descansara\" y salió rumbo a mi trabajo al parecer, iba a ir detrás de él pero mi vecina estaba afuera y se habría desmayado o algo así de vernos al mismo tiempo, por su parte el otro se quedó frente a mi y me miró diciendo \"¡Qué músculos!, ¿ya no vas a necesitarlos o si?\", Estaba paralizado, no podía creer sus palabras, por unos segundos había pensado en que si ellos trabajaban por mi yo podría por fin dejar de hacer tanto ejercicio y descansar un poco más, pero sus palabras... sus palabras me habían parecido como una respuesta a ese pensamiento y ese hecho me aterrorizaba pues era de lo más extraño que jamás me pudiera haber imaginado, no pude evitar el pensar en que no solo el ejercicio dejaría de ser necesario, sino que también podría por fin engordar, y en ese momento él me dijo \"Puedo engordarte todo lo que quieras, todo lo que tu deseas, lo quiero yo también para ti, y se que quieres ser gordo, siempre lo hemos querido...\" me sentí idiota por pensar que se trataba solo de un juguete, saben lo que quiero... pero... ¿De verdad puedo confiar en ellos?</font></span></div></div>",
            "created":1372501560,
            "id":1619722,
            "title":"Solo un juguete"
        },
        "1411":{
            "author_id":"lass",
            "author_name":"E",
            "choices":[
                "Pasan 2 semanas",
                "Un amigo de Matt viene de visita",
                "Otro"
            ],
            "content":"<div class=\"\"><div> <span>\"Puedes confiar en nosotros, al fin y al cabo sólo somos una extensión de ti, así como nosotros podemos saber todo lo que piensas,sientes y deseas tú puedes saber qué es lo que pensamos nosotros, resumiendo no tenemos manera de engañarte\" dijo el clon con una cara muy seria y con un tono de voz sereno, <br>\r\n<br>\r\n\"¿Entonces qué dices?\" añadió el clon mientras se acercaba a mí. \"¿No quieres que se vayan estos horrendos músculos y venga una enorme panza en su lugar?\" habló de nuevo el clon mientras me daba unas pequeñas palmadas en el abdomen, yo no sabía que pensar, no sabía que consecuencias podría tener que estos clones formaran parte de mi vida, ¿Qué podrían pensar mis amigos y familia?, me dí la vuelta y cerré mis ojos pensando todo detenidamente, era la oportunidad de mi vida.<br>\r\n<br>\r\nFinalmente después de unos 15 minutos, aclaré mi mente y acepté la oferta del clon, estaba decidido a engordarme, ya estaba harto de pesar tan sólo 81 kilos, el clon sólo sonrió e inmediatamente tomó el teléfono y pidió una pizza grande a mi nombre, la cual tardaría alrededor de unos 30 minutos en llegar.<br>\r\n<br>\r\nMientras tanto fuí armando junto con él un plan para engordar, que al menos las primeras semanas, seguiríamos para no hartarme de comida y además ocupar algo de tiempo en mis pasatiempos, al fin y al cabo tenía todo el tiempo del mundo, así que me podría dedicar a ver películas, jugar videojuegos y leer los libros que compré pero nunca leí.<br>\r\n<br>\r\nEl plan a grandes rasgos consistía en una dieta aparentemente normal con tres comidas al día, sin embargo éstas comidas serían altamente ricas en calorías y carbohidratos variando desde pan, hamburguesas, hot dogs y pizza, en general comidas que una persona normal consideraría comida chatarra, ya estando listo el plan de alimentación, me asomé por la ventana a ver si la vecina aún seguía en el patio, pero ya se había ido por lo que aproveché para darle al clon mi tarjeta de débito y lo envié al supermercado de la ciudad, al fin y al cabo toda esa comida no iba a venir de la nada, además le di la instrucción de que comprara cualquier otra cosa que él creyera que me iba a gustar, el clon asintió saliendo por la puerta principal, mientras yo me quede a esperar la pizza que había pedido.<br>\r\n<br>\r\nMe senté en el sillón de la sala a ver un poco de televisión, no había nada interesante pero era algo bueno para pasar el rato, al poco tiempo sonó el timbre y el aroma a queso fundido llegó hasta mí, me levanté apresurado y abrí la puerta, ví un muchacho de unos 20 años, era delgado y de cabello castaño, bastante atractivo para ser un repartidor, sonreí cuando me entregó la pizza y yo le dí el efectivo, se despidió amablemente de mí y me dijo que disfrutara de mi pizza, con un tono muy alegre le respondí que seguramente lo haría.<br>\r\n<br>\r\nLa pizza era bastante grande, y al pasar las tres rebanadas ya comenzaba a sentirme lleno, sin embargo no quería decepcionarme a mi mismo, o en este caso a mis clones, por lo que tome una gran bocanada de aire, desabroché mi pantalón y seguí comiendo  hasta terminarla por completo, toda esa comida me puso muy somnoliento por lo que me recosté en el sillón a tomar una siesta, pensando en lo que sería del futuro con todos estos acontecimientos recientes.<br>\r\n<br>\r\nDesperté ya en la noche aún un poco lleno por la pizza, y me sorprendí de ver en la cocina montones de paquetes de comida, papas fritas, pan dulce, pastelillos, galletas, en fin montones de comida chatarra, tomé un paquete de galletas y comencé a comerlo mientras subía las escaleras, me asomé al cuarto de huéspedes y vi a ambos de mis clones durmiendo, como si supieran que es lo que deberían de hacer, sonreí y seguí hasta mi cuarto me recosté en la cama y volví a caer dormido con una mano en mi aún marcado abdomen...<br>\r\n</span></div></div>",
            "created":1377680640,
            "id":1652907,
            "title":"Matt empieza a engordarse..."
        },
        "142":{
            "author_id":"fatteningfurry",
            "author_name":"julio",
            "choices":[
                "ganar peso",
                "aumento de apetito ",
                "ser mas alto"
            ],
            "content":"<div class=\"\"><div> <span>agarre rapidamente una caja no muy grande y sali del salon. caminando por los pasillos abri la caja y vi dentro un anillo con un libro de instrucciones, quede consternado de que seria este anillo asi que me sente en una banca y me puse el anillo.<br>\r\n<br>\r\nantes de que pudiera agarrar el libro senti algo de hambre y fui a la cafeteria a ver si habia algo de comer y deje el libro en el banco, solo habia en la nevera un poco de arroz y carne, pero por desgracia con el entrenamiento que hice y las dietas no era de tener mucho apetito, me sente y empeze a comer hasta que me termine todo.<br>\r\n<br>\r\nalgo desilucionado porque a este paso nunca podria hacer mi sueño de ser gordo, \"desearia tener mucho más apetito\" y entonces senti que tenia más hambre. impresionado quede y fui a ver si habia mas comida, pero como suponia no habia mas, pero tenia que comer algo porque tenia hambre.<br>\r\n<br>\r\nme quede pensando que hacer y tambien como tengo ahora mas apetito, cuando me acuerdo del anillo y comenze analisar de que exactamente cuando dije desearia se cumplio asi que quise probar.<br>\r\n<br>\r\n\"deseo tener tanta comida para satisfacer mi hambre\", entonces aparece delante de mi en la mesa mucha mas comida y sin pensarlo empeze a comer hasta que quede satisfecho<br>\r\n<br>\r\nesto es genial, que otra cosa podre desear?</span></div></div>",
            "created":1351043580,
            "id":1452569,
            "title":"probando objeto"
        },
        "1422":{
            "author_id":"fatteningfurry",
            "author_name":"julio",
            "choices":[
                "nada",
                "un miembro de la universidad",
                "un ladron"
            ],
            "content":"<div class=\"\"><div> <span>Se sintio genial poder comer mas y ahora con este anillo puedo estar mas hambriento.<br>\r\n<br>\r\n\"deseo estar siempre con hambre y en todo mi turno haya comida donde vaya para saciar mi hambre \", y senti denuevo hambre y sabia que no se iba a quitar y habra mucha comida por donde vaya.<br>\r\n<br>\r\nToda la noche fui caminando en la universidad comiendo lo que apareciera. Mas y mas. Ya eran las 2 am y estaba en el gimnasio desde las 9 pm he estado comiendo y se siente increible.<br>\r\n<br>\r\nMiro hacia mi abdomen y veo una pancita, estoy emocionado porfin una pancita aunque no es mucho. Pero aun tengo 2 horas antes de que se termine mi turno.<br>\r\n<br>\r\nMe levanto y voy a seguir comiendo. Cuando oigo algo</span></div></div>",
            "created":1351082220,
            "id":1452848,
            "title":"mas hambriento"
        },
        "14221":{
            "author_id":"fatteningfurry",
            "author_name":"julio",
            "choices":[
                "ya es de dia",
                "aun de noche"
            ],
            "content":"<div class=\"\"><div> <span>Voy a donde escuche el sonido pensado de que alguien entro pero no fue nadie. Estoy algo aburrido, la universidad vacia y yo con un anillo que puedo desear lo que yo quiera, me tengo que divertir con esto.<br>\r\n<br>\r\nQue hago, hay tanto que desear y no se que decidir. <br>\r\n<br>\r\n\"ya se, deseo que en esta universidad todos los estudiantes engorden, de diferentes formas y diferentes ganancias, ummmm que mas....deseo ser ahora el director de esta universidad. Por ahora es todo, sera divertido todo esto\", miro ep anillo que me esta cambiando la vida.<br>\r\n<br>\r\nSigo mi recorrido nocturno comiendo todo lo que aparece hasta que sea de dia y entonces ser el director. Ya me lo imagino viendo todos esos muchachos engordando estando mas sexya y sensuales y yo tambien.</span></div></div>",
            "created":1351489080,
            "id":1455882,
            "title":"deseo multi"
        },
        "142212":{
            "author_id":"fatteningfurry",
            "author_name":"julio",
            "choices":[
                "de dia",
                "aun de noche"
            ],
            "content":"<div class=\"\"><div> <span>sigo mi recorrido pero me empiezo aburrir. solo caminar y comer no es divertido.  entonces veo un cacillero vacio y abierto y se me ocurre algo. me meto y cierro.<br>\r\n<br>\r\n\"deseo estar tan gordo que se abra el cacillero\" entonces empiezo a sentir la ropa mas apretaday oigo que se rompe. estoy mas y mas gordo. ya empiezo a sentir el cacillero mas apretado y un momento se abre el cacillero. salgo y veo cuanto gane. solo ando en boxers. dios quesexy estoy.<br>\r\n<br>\r\naun falta 2 horas para que abran la universidad </span></div></div>",
            "created":1353891180,
            "id":1475339,
            "title":"cacillero explosion"
        },
        "14222":{
            "author_id":"fatteningfurry",
            "author_name":"julio",
            "choices":[
                "el profesor ricky",
                "el ayudante samuel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>voy y camino hacia el rudio que me lleva al laboratorio y veo que es un miembro de la universidad, especificamente uno del laboratorio<br>\r\n<br>\r\nes....</span></div></span></div>",
            "created":1398873480,
            "id":1789315,
            "title":"un miembro de la universidad"
        },
        "14223":{
            "author_id":"fatteningfurry",
            "author_name":"julio",
            "choices":[
                "engordarlo",
                "hacerlo gigante"
            ],
            "content":"<div class=\"\"><div> <span>Voy a donde oi la voz y veo a un hombre alto de como 1. 95 metros, mucho mas musculosos que yo, la piel, cabello y ojos morenos, un hombre guapo pero es un ladron y debo detenerlo, aunque mejor me puedo divertir con el.<br>\r\n<br>\r\n\" deseo que el dia de hoy nadie mas venga y que nadie pueda entrar ni salir\", es para.poder divertirme mas con el y sin interrupciones de otras personas.<br>\r\n<br>\r\nPrimero que deseo para divertirme con el</span></div></div>",
            "created":1351085520,
            "id":1452875,
            "title":"divertirse con el desconocido"
        },
        "142231":{
            "author_id":"fatteningfurry",
            "author_name":"julio",
            "choices":[
                "rompio su ropa",
                "lamer.otra parte"
            ],
            "content":"<div class=\"\"><div> <span>Lo veo caminar revisando varios casilleros y demas, no encontraba nada de valor.seguia revisando  hasta que entro a un salon y se sienta, alli decidi empezar mi diversion.<br>\r\n<br>\r\n\"deseo que el sienta una gran necesidad de lamer a un guardia y que con cada lamida el suba 5 libras de peso\", miro denuev y veo que cambia de expresion. Entonces decido entrar.<br>\r\n<br>\r\n\"hey que haces aqui a estas horas\", le digo pareciendo que no se que hace.<br>\r\n<br>\r\nY el me dijo \"me quede dormido y encontre todo cerrado\", se que es mentira pero me quiero divertir con el.<br>\r\n<br>\r\n\"esta bien dejame buscarte las llave para que puedas salir, sigueme\" me doy media vuelta y entonces el me agarra y me susurra al oido \"eres demasiado sexy \", me empieza a quitar la camisa y acariciar con sus dos enormes manos, se siente increible y me estoy excitando, y el tambien porque siento su pene duro y eso no era parte de mi deseo entonces el es gay.<br>\r\n<br>\r\n\"que tal si subo la temperatura\" me dice y entonces empieza a lamerme la pequeña panza que tengo ahora, el seguia lamiendo cada vez mas y veia como engordaba.<br>\r\n<br>\r\nSiguio lamiendo hasta....</span></div></div>",
            "created":1351429740,
            "id":1455262,
            "title":"momento caliente"
        }
    },
    "info":{
        "author_id":"fatteningfurry",
        "author_name":"julio",
        "brief_description":"Donde disfrutas de ser más gordos",
        "created":1350723660,
        "description":"<td align=\"left\" class=\"norm\">Una historia donde puedes vivir tus fantasias gay de engordar y de todas formas desde lo tradicional de comer mucho hasta tragarte otro hombre<br>\r\nSolo hay una regla diviertanse y sean creativos</td>",
        "id":1899025,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1398873480,
        "modified":1398873480,
        "pretty_title":"una vida de gordos"
    }
}