{
    "chapters":{
        "1":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Growth/Shrinking",
                "Muscle",
                "Transformation",
                "Fattening/inflation",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>we'll start with categories for the main story type. keep in mind these are subject to change as the story progresses. so dont be shy about adding a bit of other things in there, these are just guidelines to begin. and if you have a different type, or want to start a whole new thread, don't hesitate! just remember, its all in shameless good fun. no need for any dark, twisted harsh drama or anything. just good clean bodily modification goodness<br>\r\n<br>\r\nyour characters can be any kind of anthropomorphic animal or a human. maybe even catgirls/boys or similar alternate-species hybrids. </span></div></div>",
            "created":1346907600,
            "id":1422075,
            "title":"Choose your story!"
        },
        "11":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Male",
                "Female",
                "Herm"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to the Growth/Shrinking section! where all sorts of size changing goodness will ensue! will you become a behemothian godzilla monster? or shrink a school full of people down to the size of a matchbox? you decide!<br>\r\n<br>\r\nChoose your gender! are you...</span></div></div>",
            "created":1346907600,
            "id":1422076,
            "title":"Growth/Shrinking: Choose your gender!"
        },
        "111":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Tyler, a 5 foot shrimpy purple dragon",
                "Fang, a 7'10\" Behemoth of a black musclebound wolf",
                "Create your own!"
            ],
            "content":"<div class=\"\"><div> <span>These are some pre-made characters of mine, either from various other stories or interactives, or just popped out of my head. feel free to make use of them, or make your own! (please make sure when you make your own to leave an option in that chapter for someone else to do the same!)<br>\r\n<br>\r\nTyler: a shrimpy, nerdy purple dragon. overshadowed by his much larger 7'4\" blue dragon brother David. gets picked on a lot, and though he acts timid around the big guys, hes Itching for some payback<br>\r\n<br>\r\nFang: Cocky, giant black furred wolf jock, star of the football team and general walking almost 8 foot tall wall of fur and muscle. loves to lord his size over others at any opportunity.</span></div></div>",
            "created":1346907600,
            "id":1422085,
            "title":"The Guys!"
        },
        "1111":{
            "choices":[
                "Tyler visits the \"Metaphysical\" building. (magic)",
                "Tyler visits the \"Quantum\" building. (super-science)",
                "Tyler goes to apply, but finds something unusual on the way."
            ],
            "content":"<div class=\"\"><div> <span>Going to college was supposed to fix everything.<br>\r\n<br>\r\nNearly everything.<br>\r\n<br>\r\nMost things.<br>\r\n<br>\r\nTyler scooped up his papers as they blew around in the student union courtyard after his brother, David, had knocked them out of his hands. It was nothing more than the plus-size dragon had done to him dozens of times before. This time, however, it grated on Tyler more because this was supposed to be his sanctuary. David wasn't supposed to be a student. He probably couldn't even pass the entrance exams. But his freakishly huge physique, combined with the eagle eye of a recruiting coach, had gotten him in the back door and into the football program.<br>\r\n<br>\r\nFootball with a side of wrestling.<br>\r\n<br>\r\nAnd maybe, if his usual athletic excellence held out, some hockey.<br>\r\n<br>\r\nDavid's way of telling his little brother the good news was to come on to campus, call him \"poindexter\", and knock his notebook out of his hands. Laughing, he'd gone off with several of his other jock friends towards the cafeteria.<br>\r\n<br>\r\nTyler was small; very small.<br>\r\n<br>\r\nA rich purple in color, the five-foot-nothing dragon was fairly slender with a slight paunch and scrawny limbs. His wingspan wasn't much to look at and he'd felt insignificant in the shadow of his older brother for years. He knew David didn't hate him but his brutish ideas of \"fun\" and \"funny\" made Tyler's life miserable. They lived together in an apartment a few miles away and Tyler spent most of his time at the small, corner comics-and-games shop he'd bought with monies culled from a trust fund and his high school salary earned while working at an Italian restaurant.<br>\r\n<br>\r\nBut being in retail, even if he was his own boss, wasn't his idea of a good plan for the future. So, last spring, he'd decided he'd pursue an advanced degree at the university. Now, chasing his papers amongst the falling, autumn leaves, he wondered if it had been such a good idea. He'd been in class for several weeks and was starting to doubt his choices.<br>\r\n<br>\r\nThe last of his papers wafted up against the base of a campus directory. On it were pinned announcements of parties at the frat houses, political rally messages, job offers, and class notices. Picking up his now damp treatise on \"The History of Sumptuary Legislation in the Roman Empire\" his eyes caught a glimpse of something different.<br>\r\n<br>\r\nOn the board was a small, tan paper advertising a mid-semester course, open to all students, for two credits. The headline said, \"Experimentation in Bio-Mass Labs:  Changing Mass and Dimensions\". Beneath it were several classroom locations. While \"changing mass and dimensions\" piqued Tyler's curiosity the words \"survey class:  free for first 10 applicants\" were even better. The class, it seemed, was based in one of two buildings; buildings he didn't have classes in right now; that would mean he could get out of his normal pattern and maybe avoid David for a while longer.<br>\r\n<br>\r\nBut what were the \"Metaphysical and Ancient Studies Classroom Building\" and the \"Advanced Quantum Chemistry Lab Building\" the course was held in? He'd never heard of such things outside of comic books or Sci-Fi novels.<br>\r\n<br>\r\nCurious, he decided to check one out and apply.</span></div></div>",
            "created":1346907600,
            "id":1422169,
            "title":"Course Corrections"
        },
        "11111":{
            "choices":[
                "Tyler waits around and applies for class admission.",
                "Tyler leaves the admission window."
            ],
            "content":"<div class=\"\"><div> <span>Tyler stood beneath the eaves of the oldest, most intimidating building he'd ever seen. It looked as if it had been built in the mid-1800's, judging from its gothic architecture and spindly, peaked towers clad in coppery-green shingles. Moss grew over most of the roof and tall trees arched above its six stories. Tall, narrow windows peered out like a hollow eyes upon the campus. Between them, ornate cornices and elaborate lintels were carved with strange, unknown symbols. Granite gargoyles perched on each corner glared down at passers-by. Over the main door, framed between a pair of pentagrams, was a bronze plaque declaring it the \"Metaphysical and Ancient Studies Classroom Building\".<br>\r\n<br>\r\nThe small, purple dragon swallowed heavily. It was something straight out of Bram Stoker's \"Dracula\". The fact that he could see some students hurrying in and out of the building without a care made him feel a bit more at ease. If all those other students had no problem with a creepy building on the edge of campus, it shouldn't be a problem for him. He’d written down the name of the class, \"Experimentation in Bio-Mass Labs”. Glancing down at the note in his hand and then back up to the arched entryway, he steeled himself.<br>\r\n<br>\r\nHe folded his wings tight against his back and walked up the granite stairs to enter.<br>\r\n<br>\r\nThe main hall was enormous. Rising high overhead, it pierced four, twenty-foot-high stories of the building. Stairs in the main entry hall rose from ground-level to each of the four exposed floors, above, meaning that five and six were probably only accessible from other stairways, elsewhere. If the outside was creepy, the inside was downright disturbing.<br>\r\n<br>\r\nIn the center of the entry hall stood a giant skeleton of a Neolithic bear. Wired together, and only partially evolved like a contemporary, modern ursus sapiens, the creature stood at least twenty feet tall. It was easily four, nearly five, times Tyler's height. On each of the ancient bones were inscribed tiny, pencil-tip-thin etchings. Each was a different rune or symbol that the dragon had only seen in bad horror movies or comic books that dealt with the occult.<br>\r\n<br>\r\nThis was a classroom building on a modern campus or a throwback to the Dark Ages?<br>\r\n<br>\r\nThe \"Metaphysics\" building wouldn't have been out of place near Hogwarts.<br>\r\n<br>\r\nWell, an adult, scary version of Hogwarts.<br>\r\n<br>\r\nIt didn't take him very long to find the admissions office. It was on the first floor, beyond the entry hall, and around a corner next to a broken drinking fountain. He stepped up to the window and rang the tiny bell next to the sign \"Ring For Assistance\".<br>\r\n<br>\r\nA deep, rumbling voice from inside, intoned, \"Be right there...\"<br>\r\n<br>\r\nThe words sent a chill down Tyler's spine and his wings half-unfurled.</span></div></div>",
            "created":1346907600,
            "id":1422190,
            "title":"Getting Metaphysical"
        },
        "111111":{
            "choices":[
                "Tyler decides to take some of the rune stones.",
                "Just then, Professor Taryl arrives."
            ],
            "content":"<div class=\"\"><div> <span>The troll that lumbered into view was less an actual, mythological \"troll\" than it was the ugliest, biggest dragon Tyler had ever seen. Easily fifteen feet tall, the bulky, green person behind the admissions window had to bend down to peer out at the tiny purple dragon in the hallway. His enormous eyes squinted.<br>\r\n<br>\r\n\"Uh, hi,\" Tyler said. \"I'm here to apply for-\"<br>\r\n<br>\r\n\"The class on scale and mass,\" the giant dragon finished for him. \"Small guys like you always want in.\" His deep, rumbling voice echoed through the tiny office on the other side of the window and made Tyler's bones vibrate. His name tag said \"Hi, my name is 'Drake'\" and Tyler had to suppress a smile at the stereotypical draconic name.<br>\r\n<br>\r\nDrake turned to one side and started rummaging around in a pile of papers. Apparently, no one in the Metaphysics building had heard of computers. Finally, he turned back and slid a form under the window.<br>\r\n<br>\r\n\"Here. Take this to Professor-\"<br>\r\n<br>\r\n\"Dumbledor?\" Tyler interrupted with a grin.<br>\r\n<br>\r\nDrake just stared back, dully. Then, with a sigh, said, \"No. Professor Taryl. Sub-basement lecture hall SB-101.\"<br>\r\n<br>\r\nFeeling sheepish at the failure of his lame joke, Tyler took the form and thanked the small giant.<br>\r\n<br>\r\nFinding the winding, broad stairwell, he began to see how someone as big as Drake could get around. The stairs were sized for titans! He passed a rabbit going up the stairs past him whose knees were at Tyler's eye-level. The rabbit's golden eyes smirked down at the tiny dragon and he gulped, hurrying on his way to the sub-basement. Coming out into the dimly lit corridor far below ground, he noticed in the shadows a tiny doorway leading from the stairwell into the hall. It was barely mouse-sized. Looking back, he noticed what he'd not seen before:  a parallel stairway along the edge of the wall, very tiny:  as if built for pixies or something.<br>\r\n<br>\r\nA shiver ran down his spine for the second time that day. The ideas that started floating through his head were daunting.<br>\r\n<br>\r\nHe quickly found the double doors that led into the sub-basement auditorium \"SB-101\". Poking his head inside, he looked down the recessed rows of seats to the stage, below. On it was an empty lectern in front of a massive black board with curious sigils and symbols scrawled on its surface. In big, block letters, the words \"DO NOT ERASE\" were written nearby in chalk.<br>\r\n<br>\r\n\"Uh, Doctor Taryl?  Professor?\"<br>\r\n<br>\r\nThere was no answer.<br>\r\n<br>\r\nHe went down the stairs. In the center of the stage, towards the front edge, was a counter about twelve feet long and four feet high. On the back side were dozens of drawers while, on the top, ancient deposits of wax, as if from centuries of candles, colored the grey marble. Curious, he poked around.<br>\r\n<br>\r\nIn one drawer, he drew up short.<br>\r\n<br>\r\nThe lock was old and clearly broken but it had come open anyway. Inside were several small bins holding smooth, agate-like rocks. Each had a symbol carved into its surface and gave off an eerie luminescence. He felt a warmth flow over him at the sight.<br>\r\n<br>\r\nCurious and a bit excited, he reached forward to examine the stones.<br>\r\n</span></div></div>",
            "created":1346907600,
            "id":1422215,
            "title":"Admission"
        },
        "1111111":{
            "author_id":"dramon",
            "author_name":"MonMon",
            "choices":[
                "Professor Taryl ",
                "Someone else."
            ],
            "content":"<div class=\"\"><div> <span>The purple drake eyed the stones carefully. Each stone shone in a different color washing over Tyler. Biting his lower lip, his hand slowly reached out, slowly plucking a few stones from the drawer. Several of them shone in bright colors, a majority of them purple. It was a bit corny that a purple dragon loved the color purple, but he didn’t care at the moment. Putting one of the stones near his eye, he observed the grooves , a smile working its way on the drake’s face before he noticed a problem.<br>\r\n<br>\r\n“<i>Crap, if someone finds me here…</i>” he thought quickly. Turning his head around in a panic, he found no one. He’d been waiting for Professor Taryl to arrive, but what if the professor got here to see him nosing around? It’d spell trouble for him, and he wouldn’t expect them to go easy on him because he was new. With only several stones in hand, he grabbed a cloth near the drawer, putting the stones inside and in his pocket. Their shine made them a dead giveaway. <br>\r\n<br>\r\nWhy was he taking these in the first place? Tyler was by no means a thief, but for some reason, he couldn’t help but take a few. They seemed to click with him. He didn’t know how to explain it, but he felt like he had to have one, even several of them. Besides, if the lock was old and busted, it wasn’t as if anyone really cared about them or they’d put a brand new lock on in the first place. Shrugging, the purple drake quickly closed the drawer and put the lock back where it had been prior to his arrival and quickly darted up the stairs back to the classroom. <br>\r\n<br>\r\nHis mind was a mess at the moment. He had to play it cool and stay calm. He patted the pocket where the rune stones were held, taking a sigh. As he kept thinking about the stones in his pocket, an odd feeling began to wash over the purple drake. He couldn’t tell what this feeling was, but it felt…good. Smiling a bit, Tyler let the feeling wash over him. The dragon rumbled deeply as one of the stones began to glow in his pocket. As the seconds ticked by, the purple dragon's body had been changing slightly. <br>\r\n<br>\r\nYou could see the dragon visibly growing, inch by inch. His clothing strained as the dragon wearing them added more and more height to his lanky frame. Tyler smiled, deep rumbles from his chest echoing through the empty room before he heard the sounds of a click. Blinking, the purple aura left the drake. Soon enough, the door opened to reveal...</span></div></div>",
            "created":1346907600,
            "id":1422332,
            "title":"Tyler decides to take some of the rune stones."
        },
        "11111112":{
            "choices":[
                "David starts to grow.",
                "David starts to shrink."
            ],
            "content":"<div class=\"\"><div> <span>He had nearly decided to leave the top floor of the sunken auditorium, back into the sub-basement hallway, when the door opened. He didn't have time to hide and still felt the tingling sensation that had thrilled him and inundated his now-enlarged body. His clothing felt so tight, now, that he wasn't sure what to do. Paralyzed with indecision, he thrust his hands into his pockets and stood where he was.<br>\r\n<br>\r\nThe towering door swung inwards to reveal David.<br>\r\n<br>\r\nHe blinked.<br>\r\n<br>\r\nIt was his big brother.<br>\r\n<br>\r\nBut as he looked up at the blue dragon's smirking expression, however, he realized that the larger dragon didn’t seem quite as “big” as usual. Despite the situation, it made Tyler feel slightly proud … even if he didn’t understand it.<br>\r\n<br>\r\n\"<i>There </i>you are,\" the dragon rumbled. He looked around the room and scowled. \"I been tryin’ to find you for an hour. Wanted to borrow some cash for lunch. What're you doing here? Trying to avoid your big bro?\"<br>\r\n<br>\r\nTyler felt flush and suddenly angry. \"You ... you were <i>following </i>me? Damnit, why don't you just leave me alone?\"<br>\r\n<br>\r\nDavid sauntered forward and gave a brisk rub with his knuckles against the top of Tyler's head. \"Leave you alone? Yeah:  that doesn't sound like me.\" He blinked a couple times, looking down at Tyler as if suddenly seeing him for the first time. \"You get new clothes, runt? Those hardly fit at all.\"<br>\r\n<br>\r\n\"Same as I was wearing two hours ago, when you tossed my notes everywhere,\" he growled.<br>\r\n<br>\r\n\"What?  They shrunk in the non-existent wash?\"<br>\r\n<br>\r\nTyler began to feel nervous and self-conscious. The more David looked at him, the more it was clear that the purple dragon was no longer five-foot-nothing. He'd been standing down a few steps from the top of the auditorium so his older brother probably hadn't noticed right away. But there was no hiding it:  Tyler was about five-foot-eight or five-foot-ten.<br>\r\n<br>\r\nThe smaller dragon tried to push past David. \"Leave me alone. I'm applying for a class.\"<br>\r\n<br>\r\n\"Yeah? That class have some kind of super work-out? You look ... bigger.\"<br>\r\n<br>\r\nTyler pushed against David and felt his older brother stumble back a few steps. It surprised both of them. Normally it would have been like a kitten batting at a solid-lead ball of yarn; David shouldn't have budged. But Tyler had more power behind his push.<br>\r\n<br>\r\n\"Okay, what the fuck is going on?\" David demanded. \"You ... you <i>are </i>bigger! What did you do?\"<br>\r\n<br>\r\n\"<i>Just leave me be!</i>\" Tyler shouted and pushed against David again.<br>\r\n<br>\r\nThis time, however, his older brother was ready for him and caught his hand, firmly. Then, moving swiftly, he spun Tyler around and reached down to grab him around the waist. Normally, this meant that David was about to flip Tyler upside-down and hold him by his ankles, but his new mass was making it a bit hard for the bigger dragon. Instead, David only half-succeeded before stumbling and dropping Tyler on the top level above the stairs.<br>\r\n<br>\r\nTyler yelped in pain and annoyance. Moments later, though, he felt a surge of fear as he heard several clattering sounds. He looked up, seeing the colored stones fall out of his pocket and scatter across the floor. Their varicolored glows flickered across the walls and drew his brother’s immediate attention.<br>\r\n<br>\r\n\"What are these?\" he asked.<br>\r\n<br>\r\n“Nothing!” Before Tyler could stop him, however, his older brother reached down and picked up three of the run-inscribed rocks:  two purple and one, yellow. \"Give 'em back!\"<br>\r\n<br>\r\nThere were still four on the floor but Tyler was afraid of what the three David already held in his hand would do.</span></div></div>",
            "created":1346907600,
            "id":1422396,
            "title":"David's Return"
        },
        "111111121":{
            "author_id":"dramon",
            "author_name":"MonMon",
            "choices":[
                "See what these stones can do.",
                "Keep quiet and put the stones back."
            ],
            "content":"<div class=\"\"><div> <span>“Hand ‘em over!” Tyler pleaded. David merely snorted, eyeing the three colored rocks in his hand. They shone brightly, illuminating his entire hand. The purple drake continued his please, but none of them reached the elder sibling’s ears. It wasn’t as if he was ignoring him, but rather he didn’t acknowledge it. For some reason, all of his attention had been focused on the three stones.  He couldn’t tell what he was feeling, but he felt like he [i]had[/i] to use the stones. He didn’t know how or why, just had he had to. It was an unexplainable feeling. <br>\r\n<br>\r\nSoon enough, the dragon’s body began shining with the same aura that had enveloped Tyler once before. <br>\r\n<br>\r\n“David!” Tyler snarled, but his voice reached deaf ears. <br>\r\n<br>\r\nAs before, David began growing right before Tyler’s eyes. Beforehand, David had towered over his younger brother in terms of height and muscle. Soon after the stones had affected his younger sibling, Tyler loomed over him, if only by a few feet. That little revelation set something off within the blue dragon. David was a bit slow, but he wasn’t stupid. These stones had to have had done something to him in the first place, David was going to take advantage of that, regardless of whatever consequences came of it.<br>\r\nThe slight fire of jealousy burning in David, his already form fitting clothes began to strain slightly against his muscled frame. Tyler gulped, watching the purple aura begin to surround his brother. His gaze soon fell upon the other stones on the ground near him. In a mad dash, Tyler ran, grabbing the rest off of the floor, scampering away from his brother after suffering a small trip.<br>\r\n<br>\r\nAt that point, David continued growing, his shirt and pants already straining and beginning to show signs of breaking as they couldn’t possibly contained the bulk of the still growing dragon.  Soon enough, David matched Tyler’s current height and soon enough, his chest obscured most of his view (not like it did most of the time already, considering how big he was in the first place). Tyler merely stared, clutching the remaining stones in surprise and anger.<br>\r\n<br>\r\nWhy the hell did he have to mess everything up!?<br>\r\n<br>\r\nThe purple aura soon left David’s body, a smirk rising on his face.<br>\r\n<br>\r\n“Well, well, well, what do we have here?”<br>\r\n<br>\r\n“Did you really have to do that!?” Tyler snarled, still slightly mad at the fact that his brother had basically ruined what little plan he had left. He was going to keep the stones and see what they did, but that much was obvious. And considering how David was and how he is now…they had a problem. Looking at the remaining stones in his hand, Tyler sighed, looking up at David. <br>\r\n<br>\r\n“David, we should…”<br>\r\n</span></div></div>",
            "created":1346907600,
            "id":1422470,
            "title":"David starts to grow."
        },
        "1111111211":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "\"Maybe you're right... lets try to fix this\"",
                "\"If i get a bit bigger, i can just make my own door...!\""
            ],
            "content":"<div class=\"\"><div> <span>“See what these other stones do, we have to fix this!” Tyler exclaimed worryingly. he stared up at the towering beast his brother had become, gulping audiably as he sized the blue drake up and down. after his own growth spurt, he had broken the 8 foot mark, leaving him about a foot or so taller than his brother’s old 7’4 height. That alone had left most of Tyler’s own clothes in tatters. small scraps of his shirt clinging to his torso, while his jeans had shredded at the seams, split down the back, and were little more than a pair of indecent ‘hulk shorts’ around his thighs and swollen groin. But after David’s turn with the stones, he was practically stark naked, tiny shreds of cloth clinging to the front of his own hefty endowment as it swung and jostled with slight shifts of the blue dragon’s weight. Tyler was huge at 8’5”... and he barely came up to David’s chest now. The blue dragon’s head was nearly grazing the 12 foot ceiling!<br>\r\n<br>\r\n“I could still pass as unusually large, but you’re just a freak now David! noone would believe that you’re normal when you’re big!” He exclaimed. frankly he was more pissed that David had upstaged him... again, but was also worried what the newly grown David would do in retaliation for Tyler trying to outgrow him.<br>\r\n<br>\r\n“Oh i see how it is” David’s voice rumbled out, several octaves deeper and notches louder with his increased size. “You get to keep your new height, but i don’t... you just want to be taller than me!” he accused, crouching down infront of his smaller brother, whos earfins wilted and he took a step back out of reflex<br>\r\n<br>\r\n“Thats not it at all!” Tyler boldface lied, tail nervously curling around his leg like it always did when he was nervous or afraid “You can’t even get out of the room, you’re too big for the door! If you can’t even get out of this room, how are you going to do anything else in life!?” He practically ranted. Inside, Tyler was screaming a much different tune, yelling and ranting about how he should be the one having those problems, not David. he should be the one having to crouch down to not hit his head, not his thick headed older brother.<br>\r\n<br>\r\n“Well... you know Tyler...” David rumbled...</span></div></div>",
            "created":1346994000,
            "id":1422749,
            "title":"Convincing a giant"
        },
        "11111112112":{
            "author_id":"dramon",
            "author_name":"MonMon",
            "choices":[
                "Grow and convince David the hard way.",
                "See if one of the stones can shrink him. "
            ],
            "content":"<div class=\"\"><div> <span>Hearing Tyler speak and rant were one of the few things David wanted to do at the moment. With his newfound height the younger drake attempted to convince him to find some way to return back to normal, providing many reasons as to why. In normal circumstances, the larger, bulkier drake would listen to his words, seeing as how he had a good head on his shoulders. At the moment, all he heard were reasons that would simply benefit Tyler. Why should he get to keep his newfound height and the elder sibling couldn’t? <br>\r\n<br>\r\nIt seemed damn well unfair. <br>\r\n<br>\r\nAs the purple drake finished ranting and raving about the consequences, David crossed his arms, a low rumble erupting from his throat. “Well, you know, Tyler…” he began, his muzzle forming something akin to a scowl, then a smirk.<br>\r\n<br>\r\n“Most of these problems…I don’t care about. So what if I’m bigger? Honestly, it’s a good feeling. And besides, I can easily get out of this room…” his rumbles beginning to get a bit louder.<br>\r\n<br>\r\nTyler stared up at his booming brother, wondering what was going through his thick head. He wanted to stand his ground, but his legs were clearly betraying him as he kept stepping back towards the entrance. A clear look at the entrance and David’s current height meant that he wouldn’t be able to fit unless he just broke through it without caring.<br>\r\n<br>\r\n“Crap…” The purple drake muttered. <br>\r\n<br>\r\nWithout warning, David clutched the stones in his hand once more, the purple aura surrounding his body as he continued growing. Before, the blue dragon’s head almost reached the ceiling, his tail almost able to cover the entire expanse of the room. As he kept growing, his head soon reached the roof, making him crouch his head down as Tyler simply had to crane his neck to look up at his still swelling brother. <br>\r\n<br>\r\nA fearful look struck Tyler’s face as David soon began to walk, his footsteps making large thuds that shook across the room with ease. Tyler bolted out of the door, David not far behind. A resounding crash shook through the area as David had just destroyed the entrance and the surrounding walls. The material crashing from the broken wall and door merely bounced off David’s thick muscled hide, Tyler looking on in a mix of anger and jealousy. <br>\r\n<br>\r\nLooking around, there seemed to be no one in the area…for now. Someone must have heard that gigantic crash and would be looking to come here and see the both of them. At this point, he could either…<br>\r\n</span></div></div>",
            "created":1346994000,
            "id":1422801,
            "title":"\"If i get a bit bigger, i can just make my ..."
        },
        "111111122":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "They had both returned to normal!",
                "Tyler had lied/was wrong about it wearing off, and the effect gets worse!"
            ],
            "content":"<div class=\"\"><div> <span>Damn it David give them back!” Tyler snarled out angrily as he reached out to grab the stones, which David quickly raised his arm back behind him so they were out of Tyler's reach. The purple dragon barred his fangs, pushing back against the forearm David was using to hold him back, arms reaching to either side of his blue skinned brother to try to grab at the stones. As he gave a sudden, harder push David gave a yelp and found himself stumbling backwards, losing his footing on the bottom step and falling flat on his ass, stones still held firmly in his grip. Quickly David barred his own fangs, snarling loudly as he shot up to his feet to yell at Tyler, but found himself stopping halfway through his first word as a still irritated looking, and adamant Tyler stepped his way down the lecture hall's stairs and upon reaching the bottom step where David was... found himself eye to eye with the blue dragon.<br>\r\n<br>\r\nIt took a second for it to dawn on the both of them the gravity of what was happening... worse for David, as while it was sinking in that not only had his brother grown almost a full foot in height, leaving Tyler now roughly 6 foot tall, but David, the formerly over 7 foot beast of a dragon was now having to hold his pants up, as he stared UP at his 6 foot brother's chin... he had, and still was, shrinking!<br>\r\n<br>\r\n“Wh... what the...?!” David yelped out in surprise and worry, as he found the classroom slowly increasing in size all around him. Chairs, desks, and especially his brother Tyler slowly stretching higher and higher into the air as he dwindled down under 5'9... 5'7... 5'5... <br>\r\n<br>\r\nDavid wasn't stupid, but he wasn't the sharpest crayon in the box, and was not very good with surprises. Tyler, on the other hand, quickly had put two and two together, and was unable to help the grin spread wide across his muzzle, showing off his ivory fangs. Most people would still be freaking out, and in disbelief about what was happening. Tyler, himself didn't understand how it was happening, but the simple satisfaction in the situation was easily overpowering his confusion and worry. He had fantasized about this. (Well, not EXACTLY this) Since he and David both hit puberty and he was left in the dust. Being the bigger brother for once. Being able to shove David around, to look down at him without needing a ladder, to be the one in charge, whether David liked it or not. <br>\r\n<br>\r\n“T-tyler, what... how... what is going on?!” David cried out, knocking Tyler from his momentary lapse into fantasy, and pulling him back into his fantasy made real. David was struggling to hold his pants up, already the legs pooled around his ankles and his his feet from view, and you could fit another half of David in the waistband. He couldn't even be 5 foot tall now... he was shorter than Tyler used to be. Despite how much he'd love to see David get even smaller, he still cared for him, just enough to not want to see him freaking any more than this (at least... not in public where he couldn't properly enjoy it), and quickly reached down, grasping David's wrist to lift it up and pry one of the stones from his grip. <br>\r\n<br>\r\nThankfully his guess was right, and after one of the stones had been removed, David seemed to stop shrinking. Tyler was a bright kid, he had noticed when he picked up the single stone, nothing had happened... but when he and David had a handful, they caused odd reactions, like making him bigger, or making David smaller, so he figured it had something to do with the specific combinations. So taking one away from David would stop the combination. <br>\r\n<br>\r\n“Look... just calm down” Tyler murmured to the diminished athlete, still struggling to keep that wide, self satisfied grin off his face “we need to get out of here before we get in deep shit for messing with this stuff. Lets get home, and we'll figure this out, ok?” He told David as sincerely as he could. He wasn't eager to turn David back, but either way they couldn't stay here without risking getting in trouble. It didnt take much convincing to get David to agree, he was still rather freaked out and all he wanted was to try and get it fixed, so after rolling up his pants leg, and tightening his belt, the two made a quick dash out of the building and, to a flurry of odd looks across campus as they ran, rushed their way back home. <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nAn hour later David was impatiently pacing back and forth behind Tyler as the newly enlarged purple dragon sat at his desk, surfing the internet. He had long since discarded his pants and shirt, as his new growth spurt had left them uncomfortably tight. It only added to Davids irritation at the situation to see his brother not only larger than him but, thanks to whatevere those stones had done to Tyler, but was now more physically fit. Tyler had noticed it as well, and it had taken 10 minutes for David to drag him away from admiring himself in the mirror. His growth seemed to have eaten away a bit of the small paunch Tyler had, leaving his stomach smoother and flatter, as well as giving him a bit more muscle. Just enough that his pectorals now had faint definition, and there was an actual swell on his arms when he flexed them. Worse still for David was all of this, mixed with Tyler wearing his undersized underwear made his one redeeming physical feature all the more blatant.<br>\r\n<br>\r\nHis endowment. <br>\r\n<br>\r\nDavid got the height, the muscle, and most of the other good genetics, but if there was one place Tyler could keep up it was downstairs. Despite David being overall bigger than Tyler down there, it was only his over 2 foot size advantage that allowed that, if they had been normal sized Tyler would probably be almost half again as big as David was when they were both hard, and with him now bigger, and in tighter underwear, the bulge in the basket of his boxer briefs was down right obscene. <br>\r\n<br>\r\n“Can you stop ogling yourself in the monitors reflection and fix this already! I'm smaller than you are! “The 4'8 dragon growled up to his larger brother, blue tail lashing about angrily behind him. This only annoyed Tyler more, and it was a miracle he hadn't already yelled at David now. The only thing that kept him from snapping at his brother most of the time was the height difference, and with that gone he was a ticking time bomb. <br>\r\n<br>\r\n“its bad enough that you have to try to get all big and stuff to out do me, but to shrink me too?! Jesus Tyler what were you thinking? I mean, of all the retarded schemes ive heard of-...” He would continue ranting. Meanwhile Tyler's nerves were wearing thinner and thinner, fingers gripping painfully tight at the computer mouse. Just when he thought he was going to snap, suddenly his grip released.<br>\r\n<br>\r\n“aha! Got it!”! He exclaimed, skimming over the page then turning to David, holding up two of the stones with the third one that had caused David's shrinking left on the desk top. “Ok... so these stones... if this occult site is right, are some kind of energy modifier... they do something about converting mass into energy, and vise versa. But the effect is only temporary. It should wear off by morning” he explained, sitting up and setting the stones back. “So if we just go to bed, in the morning we'll wake up and be back to normal” he added, seeming almost depressed at the thought. Clearly he enjoyed his new size.<br>\r\n<br>\r\nDavid simply growled and crossed his arms over his chest, glaring up at Tyler “Good! The view down here sucks.” He growled out, turning his back to Tyler and, with an angry snap of his tail, walked off back to his room. He didn't want to spend a moment longer than he had to at this size so (With a bit of a boost from his bedside stand) he crawled his way up into bed, and struggled to get comfortable enough to go to sleep... Tyler soon followed, in his own bedroom... though his sleep came after about an hour more of posing in the mirror, taking a few pictures... and a rather intense wank session he was amazed didn't wake David up... he was taller, he was (if slightly) buffer... and even slightly more hung It seemed. He didn't want to give that up.<br>\r\n<br>\r\nBut soon, even his excitement was beginning to be overpowered by tiredness, and he found himself curling up in bed... ready to meet the morning, and what it would bring... for the next morning, they would both awake to find...</span></div></div>",
            "created":1346907600,
            "id":1422565,
            "title":"David starts to shrink."
        },
        "1111111222":{
            "choices":[
                "Tyler blows off David and goes out the back door to get some clothes.",
                "Tyler goes down to see if he can make even more changes."
            ],
            "content":"<div class=\"\"><div> <span>The morning dawned and two things happened at once.<br>\r\n<br>\r\nFirst, as Tyler yawned and stretched, his knuckles grazed the curtains by the window.<br>\r\n<br>\r\nMoments later, he heard a high-pitched shriek from the next room:  from David's room.<br>\r\n<br>\r\nLeaping up, the purple dragon smacked his head against the ceiling and felt one of his ridges puncture the plaster. His mammoth endowment flopped heavily against his thigh as he stumbled. He caught himself against his dresser and stared at the span of his clawed hand across its wooden surface.<br>\r\n<br>\r\nBefore he could gague his new size properly, another shriek came from outside his room.<br>\r\n<br>\r\n\"TYLER!\"<br>\r\n<br>\r\nHe bolted for the door and nearly pulled it off its hinges as he darted out into the hall.<br>\r\n<br>\r\nWith a squeak, a tiny blue form cringed away, putting its slender arms up over its head. \"Don't step on me!\" he shrieked.<br>\r\n<br>\r\nTyler stopped in the nick of time.<br>\r\n<br>\r\nHe stared down in shock:  it was David.<br>\r\n<br>\r\nDavid had shrunk even smaller.<br>\r\n<br>\r\nThe formerly gigantic, big-and-buff blue dragon was now barely two feet tall. And Tyler, himself...<br>\r\n<br>\r\nTyler couldn't stand up, easily. The ceilings were ten feet high and his head was only a few inches shy of them.<br>\r\n<br>\r\nHe stared, amazed.<br>\r\n<br>\r\n\"S...stop staring at me!\" David's voice with higher in pitch and fainter. His little lungs and shorter vocal cords made him sound like a cartoon mouse. \"You were wrong! Your stupid Web site was wrong!\" The tiny blue dragon kicked at Tyler's ankle.<br>\r\n<br>\r\nTyler didn't feel anything.<br>\r\n<br>\r\n\"Look,\" he said, \"we can always do more research. Let's go back downstairs and see what we can figure out.\"<br>\r\n<br>\r\n\"I'm a freak!\" David squeaked. \"I'm a midget!\"<br>\r\n<br>\r\n\"Well, most little people are about three to four feet tall; you're much smaller than...\"<br>\r\n<br>\r\n<i>\"THAT'S NOT HELPING!\"</i><br>\r\n<br>\r\nTyler hid his smile behind one hand. \"Look,\" he said, \"Go downstairs; I'll be right there. Let me just, uh, wrap a blanket around my waist, okay?\"<br>\r\n<br>\r\nHis bigger brother's eyes suddenly went from his own, diminished sex to the collossal cock and balls dangling from between Tyler's legs. He blushed and gritted his teeth.<br>\r\n<br>\r\n\"Fine,\" he squeaked in as menacing a voice as he could. \"Just hurry up, okay?\"<br>\r\n<br>\r\nWith that, he went stomping off towards the stairs. Tyler watched for a moment as he carefully made his way down, each descent half his height. Then, once the little dragon was out of sight, he quietly stole back into his room.<br>\r\n<br>\r\nCarefully, he took the gemstones out from where he'd hidden them in the vent between his room and David's. A grin spread across his face.<br>\r\n<br>\r\nIt had worked!<br>\r\n<br>\r\nHe now know how the stones operated, at least somewhat, and his plan had worked! True, he'd almost expected David to be even smaller than he was but, still...<br>\r\n<br>\r\nDavid was still shrinking and he was not only growing but getting more masculine and muscular, too!<br>\r\n<br>\r\nHe pocketed the eight stones they'd taken from the auditorium and he contemplated what to do, next.</span></div></div>",
            "created":1346994000,
            "id":1423047,
            "title":"Little Lies"
        },
        "11111112221":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Tyler's on his way to give Fang his 'Just Desserts'",
                "Tyler could use some more size, and knows just the football team to get it from"
            ],
            "content":"<div class=\"\"><div> <span>He was massive. the thought kept rolling through Tyler’s head, and it was all he could do to keep himself from popping wood at the thought. It didn’t help that he could easily imagine his newly enlarged endowment was probably nearly as big as his shrunken brother were he to get hard... Oh no, that definatly didn’t help.<br>\r\n<br>\r\nAs quietly as a 10 foot giant could, he snuck his way down the hallway and slipped into the kitchen. Thankfully, David was now so small he couldn’t see over the back of the couch without having to stand up on it, so he didn’t see the lumbering giant his brother had become as he slipped around the corner and into the kitchen. From there, he was home free. a bit of a struggle, having to get down on all fours and turn sideways to get through the sliding glass door, and then he was free! standing so tall he could almost see over the gutters of the house, and his enlarged, newly muscled and heavily endowed form exposed to the cool morning air.<br>\r\n<br>\r\nTheir dryer had been broken for a week so they had to go old school and start hanging up clothes in the back yard, which thankfully left him with some options... unfortunately every last one of them was too small. he struggled not to laugh at the thought of trying to fit into one of his old shirts when he picked up what was little bigger than a large dish towel in size to him, that had once been his favorite Green Lantern T shirt. even David’s clothes looked like those of children to him, and for a few moments he found his teeth barred in annoyance. He was massive now, and wanted to go out and enjoy his new size. but doing so stark naked was going to cause more problems than enjoyment... not that he wouldn’t enjoy walking around and showing off the new him. Then an idea came to him.<br>\r\n<br>\r\nThe stones.<br>\r\n<br>\r\nHe already figured out that the one combination would steal size from one person to another, so maybe...<br>\r\n<br>\r\nQuickly he laid out two pairs of David’s clothes next to each other. he lowered his paw down and dropped the same combination of stones he had used last night to steal all of david’s size, down between them, pointing from one set to the other. For a moment nothing happened ,and Tyler silently cursed himself for his stupid idea.<br>\r\n<br>\r\nThen it happened<br>\r\n<br>\r\nThe two sets of clothes slowly started to become engulfed in that same, barely visible glow as before, and one set of clothes began to stretch out larger and wider across the grass while the other dwindled. Obviously the stones had some sense of the user’s intent, otherwise it would’ve shrunk EVERYTHING in david’s room last night and Tyler’s room would’ve outgrown the rest of the house. When he was satisfied with the change he plucked up the stones, leaving one of david’s clothes sets even smaller than Tyler’s and another so massive even fang would look like a child in them...<br>\r\n<br>\r\nFang.<br>\r\n<br>\r\nHe hadn’t even thought about the massive bully of a wolf yet. and as he started slipping on his (Despite being newly enlarged) Snug clothes, an idea started to form in his head... He was bigger. way bigger than Fang, than anyone else on the football team. The jerks that had always made fun of him for studying, given him crap at his little game shop, always lorded their size over him. Now they were as small to him as he had been to them... no, even smaller!<br>\r\n<br>\r\n“Oh yes. I like this idea” He rumbled aloud, licking hungrily over his lips as he turned and with laughable ease stepped over the back fence, and started making a B line to his new destination. David could wait. he had other plans to take care of...</span></div></div>",
            "created":1347339600,
            "id":1425150,
            "title":"Dress for suscess"
        },
        "111111122211":{
            "choices":[
                "Steal Fang's size.",
                "Experiment on Fang."
            ],
            "content":"<div class=\"\"><div> <span>Fang lived on the edge of campus, appropriately enough on the wrong side of the tracks.<br>\r\n<br>\r\nThe shaggy wolf was a genetic nightmare, blessed with height and muscle no one but an elephant could match. His black fur also made him stick out but far less than his abrasive personality. Simply put, he was a bully who never grew out of a high school mentality.<br>\r\n<br>\r\nWhen he'd gotten accepted at the University on an athletic scholarship, he'd first rubbed it in the face of Tyler's brother and, once David had been accepted as well, pressured the dragon to help him keep his GPA high enough to retain the scholarship. Most of that pressure came in the form of him passing on his homework assignments to the blue dragon which, naturally enough, got passed down to Tyler as well.<br>\r\n<br>\r\nTyler was sick of doing Fang's homework. He also was now two full feet taller than the oversized wolf. All the years of his bullying and teasing felt like they pressed down on him. He used to wonder just how much of it also encouraged his older brother to taunt him since David seemed to always want to ingratiate himself with the other jocks.<br>\r\n<br>\r\nWith the stones he had, the three he'd mostly figured out and the remaining five he needed to understand, he figured there was no time like the present to do some experimenting.<br>\r\n<br>\r\nFitting into a taxi or bus would've been a problem and he no longer fit his bike, so Tyler walked.<br>\r\n<br>\r\nIt took him much less time than it usually did, his stride being twice what it used to be and his powerful muscles making his pace much faster.<br>\r\n<br>\r\nSqueezed into his brothers enlarged (albeit still very tight) clothes, he got quite a few stares. He was a dragon on a mission, though, and didn't acknowledge them. Fifteen minutes later, he arrived in the right neighborhood.<br>\r\n<br>\r\nThe old railway station stood nearby, undergoing rennovations to become a gas station. No trains stopped here, anymore. On the far side were the tenements used by the students with either rich parents and influential faculty. Fang was in the latter category. With such a heavy emphasis on football excellence, several University board members pulled strings on Fang's behalf.<br>\r\n<br>\r\nHe knew where Fang lived, he'd been there once when David was dropping off the shaggy, black wolf's homework, so that wasn't a problem. The problem was first getting Fang to touch the small charms and, then, getting line of sight on the brute.<br>\r\n<br>\r\nThe first part seemed to almost hand itself to him.<br>\r\n<br>\r\nComing from almost the same direction Tyler had, Fang waddled into view. The over-muscled wolf carried his workout bag over one shoulder and took up half the sidewalk. He was on the far side of the street and not really paying attention to his surroundings. He would have missed Tyler completely if the giant, purple dragon hadn't called out and jogged across the street.<br>\r\n<br>\r\n\"Yo! Fang!\"<br>\r\n<br>\r\nFang stopped and turned. His brows raised as he watched the titan jog over to him amidst the honk of car horns.<br>\r\n<br>\r\n\"Who th' fuck are you?\" he growled. He'd clearly been working out and, despite Tyler's features being the same, at their current size he looked like a completely different dragon. \"What'chu want?\"<br>\r\n<br>\r\nTyler hadn't thought about it too much but knew he didn't have to. Fang was an idiot. Sure, he was clever in a brutish, cunning sort of way, but in social matters he was as smart as a brick.<br>\r\n<br>\r\n\"Hey; lucky I ran into you,\" he said. \"I'm with the Anthro Football League; we've been scouting college players and I wanted to introduce myself.\"<br>\r\n<br>\r\nFang's expression changed to one of cocky self-assurance. \"Well, took you guys long enough. You here to offer me a deal?\"<br>\r\n<br>\r\nTyler bit back a withering response and played to Fang's vanity. \"We had to weed out the inferior 'maybes' before we went after the definites,\" he said. \"And you, Fang, are a 'definite'. We'd like to see how you do this season and, then, make you an offer.\"<br>\r\n<br>\r\nHe put out his hand, the gemstones concealed in his palm.<br>\r\n<br>\r\nFang grinned. \"Of course you do,\" he said, taking the handshake. He blinked, looking down.<br>\r\n<br>\r\nTyler pulled back his hand, the gems visible. \"This is just a view of the sorts of bling you'll be getting if you do well and sign with us,\" he lied. He kept the gems but they'd already touched the big wolf. \"You still planning to live on campus all year?\"<br>\r\n<br>\r\n\"Uh, yeah,\" Fang said, sounding a bit dubious from the weirdness of the stones. His cocky nature, though, quickly reasserted itself. \"But what's this about me proving myself? I thought I was a 'definite'. You got another wolf bigger an' better 'n me?\"<br>\r\n<br>\r\nTyler laughed. \"There's no one like you, Fang; we just want to be sure you stay that way.\" He waved idly and turned to re-cross the street. \"We'll be in touch. You just focus in keeping your winning ways.\"<br>\r\n<br>\r\nWhether Fang waved to him or not, Tyler didn't care. While Fang hadn't looked up to him or treated him with respect, he'd actually talked to him like a relative equal. He wasn't sure if it was his size that had done the trick or the perception that he had something to offer the big, bad wolf. Either way, the first part of his plan was done. Next, he had to get some initial line-of-sight on the shaggy bully.<br>\r\n<br>\r\nHe crossed the street and went up to the rooftop dining area of the campus burger joint, \"Andy's\". From there, he could see Fang's windows and, sure enough, soon saw the big monster putting down his bag in his living room.<br>\r\n<br>\r\nOrdering two burgers, two baskets of fries, and a double chocolate malt, Tyler spread out the stones before him. He was tempted to just steal Fang's size and add it to his own. On the other hand, he could also experiment to see what the others did in all their varied combinations.</span></div></div>",
            "created":1347339600,
            "id":1425178,
            "title":"Sizing Up Fang"
        },
        "1111111222111":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Takes Half Fang's size, leaving him under 4 foot, with Tyler almost 14 foot tall",
                "Takes All of Fangs size, Leaving him a couple inches, and Tyler over 17 foot"
            ],
            "content":"<div class=\"\"><div> <span>He could experiment on Fang. See what other effects the stones could have. But the more that Tyler thought about it, the more he started to dislike the idea. What if he made FANG bigger, or stronger, or screwed himself up somehow? Why mess with success? Plus, by the time he was done stealing Fang's size, its not like anyone else would be able to stop him anyway. <br>\r\n<br>\r\nThe food had already half vanished down his gullet during his deliberation. He was a quite a big boy now, and big boys needed big meals. Before he'd have been surprised if he finished  a single burger before, now he'd eaten both of them, was guzzling down his malt and the fries and was still hungry. And soon, he was gonna need even more to eat. <br>\r\n<br>\r\nIt was all he could do to keep himself from laughing aloud (Or popping wood) At the thought of what he was about to do, as he set the three stones from last night down on the table, sitting himself on the opposite side of them from Fang's house. His toes curled against the floor, his tail wrapping tightly around the legs of the two chairs he was sitting in, squeezing in anticipation and nearly bending the metal chair legs out of place. There was no going back from this one. A 10 foot dragon was massive, and unusual but not absurdly unbelievable... any more than that and it would be obvious something was wrong. Though in his opinion, something would be very, very right<br>\r\n<br>\r\nThe stones started to glitter briefly, as that faint glow began to cover them. Across the street, Tyler could just barely make out the same coloration outlining fang through the window as he was laying across the couch... and he could see the glow starting to cover him as well. <br>\r\n<br>\r\nTyler had to bite and chew on his lower lip to stifle a groan as he felt his body beginning to tingle, and then start expanding outwards. He hadn't expected it, but the stones were seemingly effecting Fang's clothing as well, as not only was Fang's clothing shrinking with him, but Tyler's were growing with him. An inch turned to two... then three... Tyler's body slowly starting to swell and expand larger and larger in all directions. It was lucky it was still early, and the restaurant was still mostly empty otherwise he'd probably have been discovered far sooner, but for the moment the only person that seemed to notice something was going on other than Tyler, was Fang. He couldn't help but chuckle as he saw the wolf's surprised face, watching him stand up in confusion as he tried to make sense of the room expanding around him, while Tyler himself saw the world shrinking below him. <br>\r\n<br>\r\nEven despite the fact that Tyler's clothes were stealing size from Fang's, they were still growing tighter and tighter on him. As the stones took Fang's height, they were taking his mass as well. David had been a bit beefy, but was more in the swollen athlete levels... Fang was downright Ripped, and there was so much more to take. Tyler could feel his biceps plumping and straining the sleeves of his borrowed T shirt, feel his abs hardening beneath his shirt, his pectorals thickening and stretching out the front of his shirt, and his thighs threatening to split his jean-shorts open at the seams. <br>\r\n<br>\r\nHis whole body was growing, not just in height, but in muscle mass. He was even thicker than David had been at his normal size, and soon he'd be even beefier than Fang had been...! Already he was over 11 foot tall, and passing cars were starting to double take at the sight of him. 11'1”... 11'2”... He didn't know when to stop... he didn't WANT to stop. The power was quickly going to Tyler's head. As it would to anyone in the same position. Tyler had never had any Physical strength before. Sure he'd been smarter than most anyone he met, but that didn't often help when they could hang you from a hangar in the closet. But now, not only did he have strength, raw physical strength, but he had more than anyone else had ever had before... and had a way to take as much as he wanted. The only question for Tyler now was... <br>\r\n<br>\r\nHow much would he take from Fang.</span></div></div>",
            "created":1347512400,
            "id":1426516,
            "title":"Steal Fang's size."
        },
        "11111112221112":{
            "choices":[
                "Tyler leaves Fang where he is and goes home.",
                "Tyler breaks Fang’s window and takes him home with him."
            ],
            "content":"<div class=\"\"><div> <span>Tyler kept focusing his will upon the small, semi-translucent runestones. The three he’d learned how to use to steal size pulsed with the beating of his heart and with each surge in light and vibration he felt himself expand a tiny bit more. Across the street, in his apartment, Fang felt a similar sensation only, in his case, each pulse was met with a corresponding reduction in his size and stature.<br>\r\n<br>\r\nThe purple dragon’s smooth hide rippled with his body’s changes while Fang’s black fur bristled with his.<br>\r\n<br>\r\nTyler half-closed his eyes at the sensation. The bigger he got, the more he seemed to feel it. Maybe it was that the more extreme the change, the better it felt. Either way, the expansion of his muscles and swelling of his groin pushed against his borrowed clothing and made him shiver in pleasure.<br>\r\n<br>\r\nTwelve feet tall, passed.<br>\r\n<br>\r\nFang, half a block away, looked like he was feeling a strange, surreal pleasure of his own. He had fallen to his knees and started to un-do his pants. Tyler, when he glanced over away from his own expanding pleasures, saw the wolf stroking himself, despite what must have been a terrifying situation.<br>\r\n<br>\r\nTyler felt the swelling of his own sex getting progressively tighter and gritted his long, sharp teeth. He scoffed at tiny Fang’s lack of self-control. He resisted the mounting urge to rub himself. Still, if he didn’t stop soon he might burst out of his clothing.<br>\r\n<br>\r\nBut his clothing seemed to be changing with him, so maybe that wouldn’t be the case.<br>\r\n<br>\r\nHe didn’t know.<br>\r\n<br>\r\nHe didn’t care.<br>\r\n<br>\r\nHe just put his palm down over the steadily smaller stones and willed them for more.<br>\r\n<br>\r\nThe two chairs he’d pushed together for his impromptu meal creaked beneath him. He looked down, once more, and saw that he was having trouble seeing past his own, muscle-bound, barrel chest. His build was already bigger than what Fang’s used to be and he started to look wider than he was, tall. Thirteen feet tall was but a memory as he approached fourteen … then fifteen.<br>\r\n<br>\r\nThe clatter of a falling tray caught his attention and he whipped his head around to see a busboy, a slender and oh-so-tiny fox, staring up at him from beneath the awning that led onto the rooftop dining area. Tyler felt his mouth fall metaphorically open. Looking across the street between the fits and spurts of his growth to see Fang shrink smaller and smaller wasn’t the same as suddenly seeing a normal person look so tiny.<br>\r\n<br>\r\nThe fox gaped at him as he grew yet, to Tyler, it looked as if the fox -as if the whole world- were shrinking around him.<br>\r\n<br>\r\n“S...sir! Should … should I call the hospital?” the fox stammered.<br>\r\n<br>\r\nTyler laughed:  a booming, deep laugh full of mirth and menace.<br>\r\n<br>\r\n“Do I look like a need a hospital?” he asked with a grin.<br>\r\n<br>\r\nThe fox blushed, slowly shaking his head.<br>\r\n<br>\r\nSixteen feet came and went; Tyler stood up, scooping the stones into his pants pockets. The fox stood, transfixed. Booming with his broad, taloned feet, Tyler walked over. The tiny creature barely surpassed his knees. The busboy, white apron around his waist, came up to mid-thigh and he had to be five-to-six-feet tall.<br>\r\n<br>\r\nThe pulses began to fade.<br>\r\n<br>\r\n“Don’t worry about it,” Tyler rumbled. He patted the little fox on the top of his head. He was a cute, little thing and that observation startled the dragon. He’d never really looked at any other man as “cute”, before. Were the stones making him gay? Was getting so big and powerful something that naturally lent itself to seeing other guys that way? Or were his changes just revealing something that was there all along … that he’d never had the courage to admit to himself, before?<br>\r\n<br>\r\nRegardless, he knew he had tons of courage, now.<br>\r\n<br>\r\nHe felt his powerful body slowly stop growing somewhere in the neighborhood of seventeen feet tall. He flexed his wings, slightly, and reveled in how big they’d gotten with respect to the rest of him. His muscles and sex weren’t the only things to have grown and, now, he trumped any of the porn stars he’d seen in cheap videos. He was an adonis of dragonkind.<br>\r\n<br>\r\n“Uh, your bill, sir?” The busboy held out the paper receipt to the titan.<br>\r\n<br>\r\nTyler smirked and pulled out his wallet, paying with the tiny bills -and then some- to the fox.<br>\r\n<br>\r\n“Here’s my address,” he said, tapping his tiny driver’s licence in his wallet. “Come by some time; we’ll have a big ol’ time.”<br>\r\n<br>\r\nHe was flush with power and size as he left.<br>\r\n<br>\r\nHe had to leap over the edge of the building rather than going down the stairs, within. He no longer fit. But the drop wasn’t far; no more than getting off a particularly tall bunk-bed. The squeals of tires and stares of passers-by made him feel good.<br>\r\n<br>\r\nBut what about Fang?<br>\r\n<br>\r\nHe suddenly remembered seeing the tiny wolf, barely a foot tall, jerk off furiously in the neighboring apartment. He laughed to himself at the thought.<br>\r\n<br>\r\nHe strode across the street, in three or four strides this time, and looked in Fang’s second-floor window.<br>\r\n<br>\r\nHe almost didn’t see the wolf at first.<br>\r\n<br>\r\nTo Tyler, the shaggy, black wolf was barely noticeable. Insect-sized to Tyler, Fang was only a couple inches tall and panting, lying on his back, in the middle of his living room floor. His physique had dwindled down to boy-toy proportions and he looked like a slim and slender mouse. Fang wouldn’t even be a third the length of Tyler’s index-finger.<br>\r\n<br>\r\nHe pondered what to do.<br>\r\n<br>\r\nHe should really get back to his shrunken brother (maybe toy with the stones some more) but a part of him didn’t want to leave Fang by himself. A part of him wanted to show off the tiny, shrunken bully to everyone who’d known him.<br>\r\n<br>\r\nChoices, choices...</span></div></div>",
            "created":1347598800,
            "id":1427153,
            "title":"A Growing Meal"
        },
        "11113":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Tyler takes the ray home to test it further",
                "On his way home, Tyler runs into someone..."
            ],
            "content":"<div class=\"\"><div> <span>as he approached the massive, rather ominous looking pair of buildings near the edge of campus, he saw something that caught his eye. On the side of one of the buildings was the trash chute, and a fresh load of trash had just been dumped out. Nothing that would normally catch your attention, unless something stood out. sitting, as if on display, on the top of the piles of soda bottles and wadded up paper was something that reflected the light with a polished hue. Carried by some unknown curiosity (Stereotypers would call it a dragon’s attraction to shiny things) he walked his way around to the side of the building, rather than the entrance, to investigate.<br>\r\n<br>\r\nFor a brief moment Tyler was scared at what he saw. at first glance he thought it was a gun, though quickly was relieved when he saw it looked more like a toy than anything else. It looked like someone had taken a toy gun and stripped some of the coverings off of it, so some wires and circuit boards inside were exposed, but the parts that did have covering were of some kind of hard, polished plastic.<br>\r\n<br>\r\nAgain, sheerly out of curiosity he reached out to pick the weird looking gun up, carefully turning it over and inspecting it. the wiring inside looked surprisingly intricate, and the circuits looked to be made for something much more complex than just making space gun noises. as he turned the gun back and forth to look it over, his finger slipped and hit the trigger, which immediately caused Tyler to yelp in surprise and drop the gun, as a bright green beam of light shot out of the end of it.<br>\r\n<br>\r\nHis eyes went wide as he watched the beam of light smash against the dumpster the gun had been sitting in, seeming to slowly ‘flow’ over it as if some kind of green, etheral coating. when the dumpster was completely encased in that eerie green glow it seemed to pulse slightly then, for lack of better word, ‘suck’ inwards, from all directions. and as it did, the dumpster sucked inwards as well... as it, of all things, shrunk! each small pulse of that green light causing the aura, and the dumpster with it to shrink smaller and smaller. by the time the green glow seemed to fade away, the car sized dumpster had been reduced to the size of a beer cooler.<br>\r\n<br>\r\nTyler simply stared wide eyed for several minutes, looking down at the shrunken dumpster. everything inside it had shrunk as well. the wads of paper that had been as big as his fist were now more like the size of marbles, bags of trash he would have needed both hands to pick up he could probably hold in a single hand.<br>\r\n<br>\r\nSlowly he bent down to pick the gun up, being far more careful this time, as he rasied it up to look it over again. carefully he turned it to aim down at the dumpster again, wincing a bit as he pulled the trigger and, again, a flash of green shot from the barrel and once more engulfed the dumpster. within seconds it began pulsing, just like last time, and starting to ‘suck’ inwards, as if its mass were being pulled inside of itself to make it smaller. this time when the effect faded  away, the formerly car sized dumpster was now barely the size of a lunch box.<br>\r\n<br>\r\nTyler continued staring for several seconds, mulling over what he was seeing and whether he was being crazy or not... before his lips ever so slowly started to twitch, then curl into a wide, almost cheshire cat worthy grin...<br>\r\n<br>\r\nhe turned on his heels, and rather than going to the building for that class, he made a B line straight back home... class could wait. if he truly was still sane, he had far more important things to worry about... like his new Shrink ray. </span></div></div>",
            "created":1346994000,
            "id":1422788,
            "title":"Why would you throw that out?!"
        },
        "111131":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Was unstable, and each shot changed the size by a random amount",
                "Was persistant, at random things shrunk would shrink even more"
            ],
            "content":"<div class=\"\"><div> <span>Tyler still couldn’t believe what it was he had stowed in his backpack. it was a shrinking ray. a real, live shrinking ray! like something you’d see in comic books or in Sci fi TV shows! He didn’t think he’d ever ran that fast in his life as he dashed back to his house, all but slamming the door closed behind him and locking it. he wasted no time in tearing his backpack open to pull the device from its container, raising it up to the pale fluorescent lighting of his living room.<br>\r\n<br>\r\nThis time he was far less restrained and careful thant he first test. with an almost wicked grin he turned the gun on a wooden rocking chair in the corner, David’s favorite chair (Solely for the fact it barely fit him, and his weight made it creak loudly, which David knew bugged Tyler) and fired. the green beam engulfed the rocking chair, and soon it started to compact in on itself. smaller and smaller the furniture dwindled until Tyler could pick it up with a single arm instead of both.<br>\r\n<br>\r\nHe couldn’t help but giggle.<br>\r\n<br>\r\nHe was almost certain it had to be some kind of dream, after all, nothing this cool could happen in real life, right? But, dream or no, Tyler was going to enjoy it.<br>\r\n<br>\r\n“Where’s your creaking now?!” He said aloud to the chair, grin growing as he aimed the gun and fired again, causing the already child sized piece of furniture to begin dwindling even smaller, shrinking down until it was sized for a toddler. then again, Tyler fired, shrinking it further... not stopping till the chair wasn’t even quite the size of a piece of doll furniture, the entire chair would fit in the palm of Tyler’s small hands, which seemed to only make him even more excited. slowly tyler started to lift his foot up, the end of his sandal hanging down from beneath his purple sole. “creak creak, stupid chair” he growled out almost sadistically, before slamming his foot down atop the chair. instantly the furniture cracked and crumbled beneath Tyler’s foot, snapping like so many matchsticks into a small pile of broken wood and debris, ground into the carpet as Tyler slowly twisted his foot back and forth atop it. God he hated that chair. David kept it around just to bug him... well not anymore. now it was just a pile of broken twigs.<br>\r\n<br>\r\nOther ideas began to fill Tyler’s head, all but the obvious. He found a pair of David’s favorite tennis shoes, and shrunk them down until they were too small for even Tyler’s feet. Then, the couch that David bought because it was big enough to fit him, but was a bit too big for tyler to comfortably climb onto, he shrunk that down till it was the perfect size for him.<br>\r\n<br>\r\nIt wasn’t until the evening, near the time David would be getting back from practice, that the most obvious had started to dawn on Tyler. He had spent the last 30 minutes debating the ethics of it. on one hand, it was a thought so awesome, and so guiltily arousing, that he wanted to do it without hesitation. on the other hand he had no idea if he could reverse the effects of the device... the moral dilemma furthering when he starts asking himself... if he shrunk David... would he ever actually WANT to turn him back...?<br>\r\n<br>\r\nThe one thing that had never crossed Tyler’s mind was the device itself. why had someone thrown it out? it was understandable, don’t look a gift horse in the mouth, he was far too enthralled by what the device could do to question its origin. But someone wouldn’t just throw something out like this, there had to be a reason...<br>\r\n<br>\r\nwhat Tyler didn’t know, when he heard the door unlock, as David started to come inside, was that the ray...</span></div></div>",
            "created":1346994000,
            "id":1422795,
            "title":"It's my size or ill shrink it if i want too"
        },
        "1111312":{
            "choices":[
                "But David's shrinking doesn't stop right away.",
                "David orients himself and demands to know what's going on."
            ],
            "content":"<div class=\"\"><div> <span>What Tyler didn't know, what he could only have known had he watched how some of the items he'd shrunk at first were occasionally getting smaller in fits and bursts, was that the damaged shrinking ray had lingering effects. The energy stored itself in the mass of the target and, depending on how much there ways, would randomly surge and flux, triggering further changes.<br>\r\n<br>\r\nMaybe it wouldn't have mattered. Maybe his desire to get even with his big brother was too advanced. Either way, as soon as David came through the door -all 7'3\" of him- Tyler fired the ray gun.<br>\r\n<br>\r\nDucking through the kitchen door, he zapped David square in the chest and kept the trigger pressed. The green glow expanded around his collossal brother and, like the chair and other test subjects before, then enwrapped him and started pulling inwards.<br>\r\n<br>\r\n\"What th'...?\"<br>\r\n<br>\r\nDavid's dialogue was cut short as a strange sensation went through him.<br>\r\n<br>\r\nIt felt like he was falling but his feet stayed planted on the floor. Still, the floor seemed to be shifting slightly ... as if the carpet of the living room was snaking out from under his feet in every direction. He got dizzy. Looking around, the room seemed to be spinning:  the ceiling getting farther away and the walls drawing back from him. Everything was awash in a green glow.<br>\r\n<br>\r\nTyler's smile grew wider and wider as he poured more and more energy into his once-bigger brother. Seven feet came and went, soon to be followed by six. Tyler kept the energy pouring on as he shrank his brother to his own height and, then, further.<br>\r\n<br>\r\nSoon, the once titanic blue dragon was waist-high to Tyler's purple hide and the once-littler dragon stopped the beam.<br>\r\n<br>\r\n\"Now who's the little brother?\" he boomed with gleeful laughter.</span></div></div>",
            "created":1346994000,
            "id":1423080,
            "title":"Staccato Shrinkage"
        },
        "11113122":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "\"I've always wanted a big stuffed animal to cuddle with when i sleep...\"",
                "\"Im in the mood for a bit of...'Fun' if you know what i mean...\""
            ],
            "content":"<div class=\"\"><div> <span>“What the hell did you do to me?!” David snarled... which almost immediately caused Tyler to burst out laughing. David's voice was about 3 octaves higher pitched now than it was before, considering he wasn't even 1/3 his original size. “THIS ISN'T FUNNY” He would yell even louder, which only elicited more giggles from Tyler. It wasn't until David snarled and punched Tyler's thigh that his laughing finally stopped. The now larger purple drake lowered a handpaw down atop David's head, holding it there for a brief moment...<br>\r\n<br>\r\nThen shoved.<br>\r\n<br>\r\nDavid went stumbling backwards, ending up flopped down on his ass, as Tyler stepped forward to loom over him again. “Now now, BIG brother... you need to watch your tone.” Tyler murmured rather ominously, though his grin was still as wide as ever. “you should be careful who you raise your voice too... specially when they're bigger than you.”<br>\r\n<br>\r\nthe smaller blue dragon let out a quiet gulp as he stared up at his brother. He wasn't used to look up at Tyler. Hell, about the only person he ever consistent looked up too was Fang... but Tyler was much, much bigger to him now than Fang usually was. Hell, Tyler was bigger to him now, than he usually was to Tyler!<br>\r\n<br>\r\n“L-look... just...just tell me whats going on...” David muttered nervously, trying to scoot himself back a bit.<br>\r\n<br>\r\n“I Shrunk you. I'd think that was obvious” He murmured, still grinning as he casually twirled the shrink ray on his finger “i got sick of always having to look up at you, so I shrink you. I got sick of that annoying chair of yours, so I shrunk it and crushed it... got sick of that couch of yours being too big, so I shrunk it...its my turn to be the big brother now, so you better get used too it” he exclaimed ominously, using his tailtip to prod David's torso and push him down onto his back. Tyler turned to look back at the entertainment center of the living room, an idea coming to mind as he grabbed the couch and scooted it up to the entertainment center. With that in place, he crawled up onto the back of it, carefully balancing himself, and raised the shrink ray up so it sat on the very top of the entertainment center, near the ceiling. The same place David used to put stuff he didn't want Tyler to get.<br>\r\n<br>\r\n“There... now I don't have to worry about you trying to take it from me. Lil shrimp like you won't be able to get up there very easily” Tyler teased, chuckling softly. He walked back over to the still stunned blue dragon, pushing his paws up under David's armpits and, with a yelp from David, hefted him up off the ground. “Oh wow, you're so light now! You been slacking off at the gym?” He teased, laughing aloud at David as he turned to take him back to his bedroom...<br>\r\n<br>\r\n“Wh... where are you taking me?” David asked nervously, where Tyler replied with a devious grin. </span></div></div>",
            "created":1347080400,
            "id":1423706,
            "title":"David orients himself and demands to know what&..."
        },
        "1112":{
            "choices":[
                "\"...are you getting bigger?\"",
                "\"...I don't feel so good all of a sudden.\"",
                "\"...maybe we should call your nerd friend, Tyler.\""
            ],
            "content":"<div class=\"\"><div> <span>Fang and his custom-made, reinforced motorcycle drew plenty of stares as he wheeled into the parking lot. The wolf engaged the kickstand, turned off the motor, and lifted the tailor-made helmet away from his head. He grinned as he looked back at the small crowd that had gathered around his bike. To the casual observer, he looked every bit the king surveying his kingdom.<br>\r\n<br>\r\nIn many ways, he was. Even though he was only a sophomore at Anthro University, he was already the star quarterback of the football team and a campus legend. No one could outdrink Fang, outsize him or outwit him. He had broken several records in his first season, and he had trained very hard over the summer to shatter the rest of them. The giant wolf rolled his shoulders and felt his old leather jacket strain against 50 pounds of new muscle; he had given up a bit of his mobility to make himself even larger than ever, and it showed. His neck disappeared right into immense shoulders, and his chest was so broad and thick he had to bend over to see his oversized paws. His arms were stuffed into his jacket, and he could feel the rounded swells of his biceps and forearms threatening to break their containment already. His jeans were so tight you could see just how well he was endowed, the basket straining his zipper and one thigh noticeably thicker than the other. He growled as he felt himself pushing against his clothing. He stepped off the bike and rose to his nearly eight-foot height, drawing gasps from the people nearest to him. Oh yes, he thought. It was going to be a good year.<br>\r\n<br>\r\nThe wolf waddled to the frat house he shared with a few of his buddies from the football team, casually ignoring the way everyone got out of his way to make room. He towered over everyone, even men twice his age, and he knew he weighed twice as much as all but the fattest of people. Unlike those 300-lb. slackers, he was over 650 pounds of pure muscle, his natural affinity for packing on mass carefully exploited to this point. His tail wagged as he brushed by a little otter who was too slow, saw the guy fall flat on his back while he barely felt it. That's what power was; the chance to shape the world around you with others completely helpless to stop you.<br>\r\n<br>\r\nHe reveled in the knowledge of what he could do, but yet...some part of him always wanted more. He wanted to push himself to the extremes of power, past the limits of what anyone else had achieved. No one knew it, but Fang was actually disappointed that he seemed to stop growing at 7'10\". It would have been nice to break eight feet, hell, maybe ten. He thought of what he would like at that height, towering even more over the student body, unable to even have a hope of fitting in with normal people. He growled to himself as he neared the frat house. That would be the best thing he could imagine.<br>\r\n<br>\r\nHe stopped in front of the Sigma Alpha Delta house at last, expecting to hear the blast of music from the street already. Instead, the house was quiet. The windows were shuttered, there was yellow tape everywhere, and four guys were standing out by the front door with a confused look on their faces. <br>\r\n<br>\r\n\"Yo, bitches!\" Fang boomed at them. He strode up to the house and bounded up the stairs three at a time, ignoring the way the house shook with every step. \"What the hell is going on here?\"<br>\r\n<br>\r\n\"Dunno, Fang.\" Carl, the clydesdale who served as his left tackle, shook his mane. \"Door's all boarded up and there's some kind of official decree saying we can't go in there.\"<br>\r\n<br>\r\nThe wolf growled and looked past the group. He was nearly a foot taller than the next largest man there, and it wasn't hard to see the note. Sure enough, it had the official seal of the dean's office. \"What the fuck, man?\"<br>\r\n<br>\r\n\"It's weird, ain't it?\" Rich Burson, the ursine defensive lineman for the team, scratched his head. \"You'd think we would have heard about it by now.\"<br>\r\n<br>\r\nElton Mason, the lion upperclassman who had been starting quarterback before Fang burst onto the scene, growled. \"I heard some eggheads had their summer camp here and they messed up the place.\"<br>\r\n<br>\r\n\"I heard that, too.\" Marcus Fletcher, the kangaroo kicker, rounded out the little group. Even though he was well over six feet himself, he was the smallest of the jocks there. Relatively narrow in the shoulders, but he had legs that just wouldn't quit. Not a bad guy, as long as he knew his place. \"One of their experiments got away from them, and they're still trying to clean things up.\"<br>\r\n<br>\r\n\"What the fuck?\" Fang repeated, this time louder. \"Who signed off on this? Shouldn't we have alternate housing?\"<br>\r\n<br>\r\nElton shrugged. \"The notice doesn't say anything about that. I think we're supposed to find our own places to stay.\"<br>\r\n<br>\r\nFang growled. \"Fuck that. This is our house, and if the school can't be bothered to find us another place to stay, we stay here.\"<br>\r\n<br>\r\nThe giant wolf reached past the guys and jiggled the handle. It was locked. He growled, bent his shoulder underneath the frame, and gave it a quick, solid push.<br>\r\n<br>\r\nThe door frame snapped easily. He was surprised how little resistance it had put up. Had he gotten that much stronger over the summer? He wagged once at the surprised, impressed sounds that his teammates made. He was going to go straight to his room and rub one out, or else he'd be way too keyed up for the rest of the day.<br>\r\n<br>\r\nHe looked back at the horse, lion, bear and kangaroo, ducking under the door frame to see them. \"Gentlemen, what're you waiting for? Let's get unpacked and start partying!\"<br>\r\n<br>\r\nThe football players shuffled in, each one briefly filling the door frame before they did. Fang grinned at each one, slapping their back or shoulder and drinking in the awed, envious looks they shot his way. Even Elton, his chief rival, mumbled something to the effect of \"Damn, wolf, you're looking like a beast.\"<br>\r\n<br>\r\nIt was Elton, though, who first noticed that something was off. \"Hold on, guys. Do you smell that?\"<br>\r\n<br>\r\nFang lifted his nose and sniffed. The air had a stale scent to it, though it was relatively clean. Still, lurking just under the smell of old wood and the hundreds of folks who had lived here before, there was something else. Something faintly....metallic.<br>\r\n<br>\r\nMarcus leaned back on his tail and held his hand to his head. \"Whoa. Just got dizzy all of a sudden.\"<br>\r\n<br>\r\nFang felt a bit light, too. Like his whole body was tingling and the room was getting...weird. He looked around at Rich, Carl. They looked a little uncomfortable, too. Elton shut the door and turned to the giant wolf, his eyes wide. \"Dude...\"</span></div></div>",
            "created":1346994000,
            "id":1422631,
            "title":"Fang, a 7'10\" Behemoth of a black muscl..."
        },
        "11121":{
            "choices":[
                "Fang calls Tyler, the tiny, purple dragon, to come help.",
                "Fang does nothing, watching as the others shrink and he grows."
            ],
            "content":"<div class=\"\"><div> <span>\"Dude:  are you getting bigger?\"<br>\r\n<br>\r\nThe lion's words made Fang falter. His heart was still pumping from the adrenaline-boosted action of breaking-and-entering. The words were words that made him flush with excitement.<br>\r\n<br>\r\n\"What'd you say?\" He snarled.<br>\r\n<br>\r\nBut he already saw the truth of it: Elton, the massive lion and his biggest rival, was looking up at him more than usual. A thousand questions ran through Fang's brain but none of them made it to his lips before a slow, groaning, ripping sound began to shiver in the air. His clothing, already painfully tight, was growing tighter. He felt as if his skin were shrinking but, straining to tilt his head down against his mammoth chest, he saw it was actually his muscles and hide that were growing.<br>\r\n<br>\r\nMore than that, his height was increasing.<br>\r\n<br>\r\nThe metallic tang in the air made his noise itch and he stifled a sneeze.<br>\r\n<br>\r\n\"Guys? I'm not feeling so hot.\"<br>\r\n<br>\r\nCarl had moved over to a sofa and sat down. All eyes moved from Fang to him and with good reason. As they watched, Carl the Clydesdale seemed to get ... smaller.<br>\r\n<br>\r\n\"Oh Jesus,\" Elton muttered. \"What's happening to him?\"<br>\r\n<br>\r\n\"What's happening to him?\" echoed Rich. \"What's happening to you?\"<br>\r\n<br>\r\nThe looked back at the lion with the bear's exclamation. The enormous, buff lion -like Carl- was shrinking.<br>\r\n<br>\r\n\"What's going on?\" Fang demanded.<br>\r\n<br>\r\nHis body continued to grow and he felt his shoes starting to pop at the seams. Meanwhile, his four fraternity brothers were all getting smaller. Even the lanky, large kangaroo, Marcus, was dwindling -very slowly- to a tinier size.<br>\r\n<br>\r\n\"Dude:  call that egghead dragon, Tyler.  Call him!\"</span></div></div>",
            "created":1346994000,
            "id":1423057,
            "title":"Mismatched"
        },
        "111212":{
            "choices":[
                "\"Sorry, Elton. Dunno what came over me. Let's get help.\"",
                "\"You're not going anywhere. Do what I say, or else!\""
            ],
            "content":"<div class=\"\"><div> <span>Fang looked on in disbelief at the four other players wobbling in front of him. They looked like they were dizzy, feet and hooves shuffling constantly as they tried to adjust their stances. It was never enough, though. Every time they thought they had settled they shrunk a little more, and they would have to shuffle again. Carl flopped down on a couch to keep himself from falling, and Marcus was leaning back on that heavy tail of his. Rich had settled himself back against a wall, and Fang watched the bear steadily dropping, inches melting away from him just quickly enough to be visible. And Elton, that cocky fucker of a lion, was trying to walk to the door. Each step carried him a little less distance, and his thinning legs were shaky and weak. All four of them looked to be shrinking down towards six feet tall. Compared to what they had been, they looked like children, weaklings.<br>\r\n<br>\r\nThe wolf felt himself growing larger, on the other hand. His monstrous body was pushing more and more against his leather jacket, his tight t-shirt, his reinforced jeans. His ears were starting to brush against the ceiling more and more, and his pelt strained against his burgeoning muscle even when he wasn't moving. The constant rising, the tingling over his limbs from the intense restriction of his clothes, the feeling of power melting through his body and making him more than before was almost too much. He felt dizzy. No, he felt drunk. It was the best feeling he could ever remember having.<br>\r\n<br>\r\nThe giant tilted his head back, watching the ceiling come ever nearer, and started laughing.<br>\r\n<br>\r\nThe four shrinking jocks jumped at the sound. Elton propped himself up against the frame that lead to the house's common room and stared at Fang. \"Fuck you man, this isn't funny! We're...we're being poisoned or something!\"<br>\r\n<br>\r\nFang rumbled as he looked at the shrinking lion. He felt his motorcycle jacket go taut across the width of his shoulders, and he breathed a small sigh of relief as his jeans and t-shirt began to tear. Thick black fur pushed out of the holes immediately, forcing them wider. It was only a matter of time before he outgrew all of his clothing. The thought made his sheath twitch. \"I don't think you're being poisoned, little kitty. I think the egghead's experiment is still going on...\"<br>\r\n<br>\r\n\"That's why we have to get one of them over here to stop this!\" Elton sounded slightly hysterical, though that might have been because his voice was unusually high. \"David's brother, that little geek, he should be able to figure out...\"<br>\r\n<br>\r\nFang moaned as he felt his zipper pop over his sheath and sac. The tremendous basket flopped free, the pointed red tip of his member already visible. He felt incredibly heavy, almost burdened with muscle, but his power was such that it was no trouble at all to move. Or at least it would be once his clothes were done. The leather jacket creaked as his growing shoulders and back forced it to stretch wider than it was ever meant to, and his arms felt -- and looked like -- overstuffed sausages.<br>\r\n<br>\r\n\"Fang,\" Elton begged, \"please man, you've got to help us.\" Fang's head bumped the ceiling and kept rising, forcing him to bend over until his shoulders were pressing under it instead. He growled, then roared as the leather jacket ripped explosively across his shoulders, then popped away when he flexed his biceps. He almost couldn't hear the bleating of the lion through the beating of his own heart. This was an incredible rush.<br>\r\n<br>\r\nOut of the corner of his eye he saw movement and moved to intercept it. His foot came down heavily on the wood floor, snapping it easily underneath his weight. He gasped in surprise, and his cock slipped out a few more inches. So much weight. So much power. He had to duck his head to keep from cracking the ceiling, and his shoulders were brushing either wall of the now-narrow hallway. He had to have been eleven feet, maybe twelve. And he was still growing while everyone else got smaller. <br>\r\n<br>\r\n\"Where do you think you're going, Elton? I didn't say you could leave.\" His voice was supernaturally deep. He felt it rumble the house around him as his shoulders were pinched by the walls. <br>\r\n<br>\r\nThe lion's eyes widened and he took a step back. He was shrinking slowly, as were the others, and at his size he looked like any other member of campus. Maybe a little more athletic than usual. \"What the fuck, Fang? Are you just going to keep us here while we shrink away to nothing?\"<br>\r\n<br>\r\nFang grinned, his tongue lolling as the last of his clothes fell away. He was naked now, his pelt stretched around muscle that would make a superheavyweight bodybuilder jealous. He actually had to lean forward to see Elton dwindling in his view. \"Sounds good to me.\"<br>\r\n<br>\r\n\"Damnit, this isn't funny!\" Elton roared, and it would have been impressive if he hadn't been shrinking down to five feet. The warm, tingling feeling in Fang's body was beginning to dwindle. The wolf noted it with disappointment, though he wasn't sure he would be able to fit in the hallway for too much longer. His shoulders were digging gouges in the walls on either side, and every movement he made cracked drywall and plaster. Elton was afraid of him, he could tell. Why wouldn't he be? He was incredibly powerful before, but now he was on an entirely different order of magnitude. \"Something seriously fucked up is going on here. What if...what if your heart gave out? No one's ever been your size for a reason!\"<br>\r\n<br>\r\nFang had to admit the pipsqueak had a point. As the sensation of growth faded away to a low-level buzz along his pelt, he checked himself for dizziness, light-headedness, shortness of breath. He felt fine, better than fine. He was full of energy, of power; he felt like he could rip this house apart with his bare paws. He closed his eyes and took a deep breath, rumbling at the feel of his chest pushing his arms deeper into the walls. Then he opened them again, looking down at the five-foot-nothing cat. \"My heart's just fine, shrimp. How's yours?\"<br>\r\n<br>\r\n\"Ugh.\" Carl began to stir from where he swooned on the couch. The horse, like the lion, was around five feet tall, give or take a few inches. His build made him look dwarfish more than anything, but it didn't look too unusual. He looked around the room, at Marcus and Rich, who found themselves at similar sized. \"What the hell happened?\" <br>\r\n<br>\r\nThe horse's eyes grew wide and white when he spotted Fang crammed in the hallway in front of the front door. \"What the fuck?\"<br>\r\n<br>\r\nBoth Rich and Marcus had similar reactions, flattening themselves against the wall of the common room as they stared at the behemoth their quarterback had become. Fang couldn't help but smile, his shaft surging out, warm and damp against the tree-trunk of a thigh. It too had grown, until his proportions would likely put Carl to shame. \"Like what you see, boys?\"<br>\r\n<br>\r\nElton turned to the other guys. \"We have to find a way out of here. Fang has apparently lost his damned mind, so we're going to have to get around him and get help on our own.\" <br>\r\n<br>\r\nThe wolf snarled at that. Who did this kitten think he was, subverting his authority like that? He should simply swat him down, take him out of the equation entirely. But that would probably get him in more trouble than it was worth, not to mention he'd lose the other players in the process. He may have been able to force anyone to do anything he wanted now, but there were still better ways of going about things.<br>\r\n<br>\r\nHe could let them out now that the effects seem to have run their course. Or, perhaps, he could try experimenting with things on his own, see if they could find something in the house that might tell them what's going on. While the horse, kangaroo and bear all thought through their options, he did too.<br>\r\n<br>\r\nFinally, Fang said...</span></div></div>",
            "created":1347253200,
            "id":1424615,
            "title":"Rise of the Goliath"
        },
        "11122":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Tyler gathers up his victums for some 'Fun\"",
                "The other 3 take off, trying to run, or hide from Tyler!"
            ],
            "content":"<div class=\"\"><div> <span>\"...I don't feel so good all of a sudden.\" The lion murmured, rubbing at his head a bit, body seeming to wobble back and forth unsteadily. He wasn’t the only one, everyone of them found themselves struggling to stay standing, as the room seemed to shake and shift beneath them. They were all getting dizzy, and it was fang who fell over first<br>\r\n<br>\r\nA dull THUD rumbled through the house as the massive monster of a wolf slammed down onto his ass, ears wilted as he shook his head to try to shake off the dizzying sensation.<br>\r\n<br>\r\n“Maybe this wasn’t such a good idea” Marcus murmured out, leaning against the wall for support as he looked around at the others. Rich was about to respond, himself holding an arm against the wall opposite Marcus, when he was cut off by a faint flumping sound, of cloth hitting the floor.<br>\r\n<br>\r\nHis pants had fallen down.<br>\r\n<br>\r\n“Wearin yer older brother’s pants again, Rich?” Fang teased despite the situation, almost reflexive for any of them to give the other one shit about something.  Rich seemed more confused than anything as he reached down to pull his pants back up, only to have them fall right back down. when did his pants get so big? Marcus was starting to notice something odd as well, as his own pants were starting to sag, though his thicker thighs helped keep them up longer than Rich’s, and fang was rolling his shoulders a bit and noticing that the cloth of his shirt wasn’t straining around them anymore. All of them were slowly starting to come to the same, impossible, conclusion...<br>\r\n<br>\r\nthey were shrinking!<br>\r\n<br>\r\nThat dizzying sensation wasn’t just some disease or chemical in the air, it was vertigo, as their bodies were trying to readjust to enlarging surroundings (Though the chemicals didn’t HELP any). Fang growled in annoyance as he shoved himself back up to his feet, only to have his pants pool around his ankles and his shirt hang off one of his shoulders. were everyone else still their normal size hed barely be bigger than Marcus had been, as the massive 7’10” behemoth of a wolf was now barely more than 6 foot tall. and it was getting worse. all of them could notice the room expanding around them more and more with each passing second. clothes hanging off them or falling to the floor, feeling the floor or walls around them expanding beneath their touch<br>\r\n<br>\r\n“W... what the hell is going on?!” Rich called out in confusion, trying to walk over to The others but ending up falling face first on the floor, tripping over his own pants. Despite the fact that the weird smell was gone from the air, they were all still shrinking with increasing speed. Fang was down to 5 foot, while everyone else was dwindling under 4... and it was then that they heard his voice<br>\r\n<br>\r\n“Well Well Well... what do we have here...” Fang immediately recognized the voice, lips pulling back in an irritated snarl as he looked towards the front door. Somehow it had been put back in its frame (Though in reality, it had never broken in the first place, Having been set up to only look like it was boarded up.) The four dwindling jocks turned to look over at the small purple dragon standing infront of the doorway, as Tyler grinned back at all of them.<br>\r\n<br>\r\n“Tyler, what the fuck are you doing here?!” Fang snarled out, as even then he was shrinking near the 4 foot mark. Tyler had to struggle not to laugh at the higher pitched sound of Fang’s usually deep and thunderous voice.<br>\r\n<br>\r\n“Well. Its called Revenge. Karma. Vengeance. whatever you want to call it. Lets just say i had a little... accident the other day in the chem lab and figured out a rather interesting concoction. A liquid that shrinks anyone that drinks it... also figured out it could be used as a gas. so i boarded up your little house here while you were all gone, and filled the place with it. and now that you’ve sucked it all up...” Tyler paused, licking hungrily over his lips “Its gonna be your turns to see what its like being the shrimp.”<br>\r\n<br>\r\nRich and marcus were simply too shocked at their situation, and the arrival and explination of Tyler to react immediately, simply standing there dwindling smaller and smaller (nearly 2 foot tall now) and watching the normally shrimpy purple dragon tower above them. Fangs teeth barred again and he was about to respond to Tyler, when Elton cut him off and roared out at Tyler<br>\r\n<br>\r\n“What the fuck are you doing too us, are you crazy?!” He snarled, standing up out of his pants, his shirt dragging behind him like a massively oversized dress. quickly he started stomping his way towards Tyler, seemingly unintimidated (Or simply too angry to care) About how tyler was now nearly 3 times his height and still ‘growing’. by the time he reached Tyler, he had slipped through the neckhole of his shirt, leaving him stark naked infront of the towering purple dragon, barely a foot tall.  “You son of a bitch you fix this right now or so help me god I’m going to beat you within an inch of your life!” He roared up at Tyler.<br>\r\n<br>\r\nThe purple dragon simply stared down at him for a few moments, everyone else too shocked by both the situation, and Elton’s reaction, before Tyler simply smirked, and kicked Elton. his foot flew forward and smashed his toes into the lion’s front, sending the barely calf high lion tumbling backwards onto his back, a loud gasp of surprise and pain escaping him as the impact knocked the air from his lungs.<br>\r\n<br>\r\n“I think you don’t quite understand whats going on here ‘RUNT’” Tyler growled out, snorting as he took a step closer. the normally weak and small dragons footstep sounding with a reverberating THUMP, superior to even that of Fang’s normal footsteps (at least from their perspectives) “you’re now shrimpier than i ever was. and you know how you told me you got to do what you wanted cause you were bigger than me?...well... I’m /way/ bigger than you, so now I’m going to do whatever i want...”<br>\r\n<br>\r\nThankfully for all 4 of them their shrinking seemed to have finally stopped... though it was a small comfort considering their ending size. Marcus had been the smallest of them, and now he was barely more than 5 inches tall, mostly buried under his own now massive shirt. Rich and Elton were a bit better off... relatively speaking, both of them around 6 inches even., and Fang, the most massive of them, was still barely the size of a doll at a little over 7 inches in height. Tyler was one of the shortest people they all knew, and now, each of them was barely taller than his ankle...!<br>\r\n<br>\r\nTyler’s foot raised up as Elton was about to respond to the looming dragon, and his words were cut off as Tyler’s paw shoved down atop him, burying the lion entirely beneath his foot, middle toe pushing down on Elton’s face and keeping him from talking. leaving the only thing for him to do was squirm futilely under the larger dragons foot, and struggle to breath any oxygen past the smell of Tylers faintly musky feet.<br>\r\n<br>\r\n“Now then my new little toys, what shall we do first, eh?...”</span></div></div>",
            "created":1347339600,
            "id":1425179,
            "title":"Side effects may include; Revenge"
        },
        "111222":{
            "choices":[
                "The four tiny football players try to get into the basement.",
                "The four tiny football players try to hide in the kitchen."
            ],
            "content":"<div class=\"\"><div> <span>From where Fang, Carl, Rich, and Marcus stood, it was as if an apartment complex had grown legs and stomped their teammate and frat-brother. Tyler, despite being five-foot-nothing and built with a slightly pudgy belly and no musculature to speak off, loomed over them with a proud, haughty grin. His purple hide, folded wings, and slender horns all looked so much more menacing at this scale. They could only just see Elton squirming beneath his colossal, taloned feet.<br>\r\n<br>\r\n“He’s gonna crush us!” Carl squeaked, and took off running deeper into the house.<br>\r\n<br>\r\nRich turned and lumbered after him while Marcus hopped as fast as his kangaroo legs could carry him and, quickly overtook the shrunken Clydesdale. Fang hesitated, his tiny brain taking the longest to decide to flee from the only person he’d ever met bigger than himself.<br>\r\n<br>\r\nThe shrunken football players scattered away from Tyler and made the dragon laugh.<br>\r\n<br>\r\n“Yeah:  run, guys! Run! It’s all part of the game!”<br>\r\n<br>\r\nHe slipped his middle toe to one side, revealing Elton’s face and letting him gasp for air. The tiny lion’s mane spread out to the sides of his head as Tyler looked down at him. The six-inch-tall lion was only visible between two of his toes.<br>\r\n<br>\r\n“Now,” he mused, “how do we start?” He curled his toes a bit, squeezing Elton’s body and making the lion squeak with fear and impotent fury. “What’s that, tiny? You say you want to play with your friends?” Tyler’s grin spread wider as he squeezed once more, making Elton squeak.<br>\r\n<br>\r\n“Cha...change … me … back!” the tiny lion squeaked.<br>\r\n<br>\r\nTyler raised an eyebrow. “After all the harassment Fang and the rest of your team have been giving me? I don’t think so.” The colossus leaned down and deftly plucked the shrunken lion from between his toes. Acreage of purple dragon slid past as Elton felt his stomach drop while being lifted up to Tyler’s face. “You’re lucky I don’t just stomp you to paste and be done with you,” he snarled.<br>\r\n<br>\r\nThen, he blinked. He felt something rubbing against his palm. Opening it up to look at the splayed lion, he saw Elton had a miniature hard-on. He laughed.<br>\r\n<br>\r\nElton blushed beneath his fur.<br>\r\n<br>\r\n“Well, looks like someone needs to be dominated,” the dragon roared.<br>\r\n<br>\r\nNew ideas started coming into his mind and he licked his muzzle, slowly. He glanced in the direction the other four had run and chuckled to himself.</span></div></div>",
            "created":1347771600,
            "id":1428908,
            "title":"The Games Begin"
        },
        "1112221":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The four tiny furs look around frantically for a way downstairs. They see a way, and run towards it. It's a dumbwaiter shaft. Going down it would be risky, but they didn't see an alternative. They jump, grab on to the rope, and descend.</span></div></span></div>",
            "created":1370840400,
            "id":1608539,
            "title":"The four tiny football players try to get into ..."
        },
        "1113":{
            "choices":[
                "John",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are an 5'4 boy named John. You are shaggy blonde hair and blue eyes. You are not very athletic because you focus more on academics. You are the smartest in your class. You still do volleyball and basketball from time to time. </span></div></span></div>",
            "created":1349586000,
            "id":1441947,
            "title":"Human"
        },
        "11131":{
            "choices":[
                "...want to help me with something?",
                "...are free to go."
            ],
            "content":"<div class=\"\"><div> <span>\"x=4.6\" you answer. You are able to answer in less than 15 seconds while other people are still combining like terms.<br>\r\n<br>\r\n\"That is correct\" the teacher says. \"John, may I see you after class.\" Then you start hearing \"Ooohs!'' from behind you.  Sometimes you forget that you are in college and not in kindergarten. After class is over, you stay behind and wait for all the students to leave to talk to Miss Saphyre. Miss Saphyre is a 9'0 blue dragon. ( or sapphire if you want to be specific ) She has blue eyes also. She has Double D's as well and a nice figure.\"Ok, where are they?\" She starts turning your arms and looks at your legs. You are very confused. \"Take of your shirt.\"<br>\r\n<br>\r\n\"Wha...?\"<br>\r\n<br>\r\n\"You heard me, take it off.\" Without questioning her again you do what she says so she doesn't get angry. \"Where are they?\"<br>\r\n<br>\r\n\"Where are what?\"<br>\r\n<br>\r\n\"The cheat sheet!\"<br>\r\n<br>\r\n\"?\"<br>\r\n<br>\r\n\"How did you get those answers so fast!\"<br>\r\n<br>\r\n\"I have an immense intellectual capacity in my cerebral cortex.\"<br>\r\n<br>\r\n\"I am a college professor and I don't understand that.\"<br>\r\n<br>\r\n\"My brain is bigger than most people.\"<br>\r\n<br>\r\n\"Ok, you...</span></div></div>",
            "created":1349586000,
            "id":1441957,
            "title":"John"
        },
        "111311":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"What do you need help with?\"<br>\r\n<br>\r\n\"Well there is a stinging pain in my stomach. I think it was something I ate. So I need you to see what it is by...\"<br>\r\n<br>\r\n\"You're going to eat me!\"<br>\r\n<br>\r\n\"I promise I will not digest you! Are you going to do it?\"</span></div></div>",
            "created":1349586000,
            "id":1441965,
            "title":"...want to help me with something?"
        },
        "1113111":{
            "choices":[
                "Something shiny.",
                "A strange hole."
            ],
            "content":"<div class=\"\"><div> <span>\"Fine, I'll do it,\"<br>\r\n<br>\r\n\"Thank you! Ok, I will slowly lower you in so my teeth don't hurt you.\" She picks you up, turns you upside down, and slowly lowers her into her mouth. Eventually you are completely in her mouth and it's pitch black.\"Are joo reathy for me to swawwow?\" You are ready as you will ever be. Truthfully, you are a little exited. You feel muscles pushing you further down her throat. You land in her stomach. You are surprised to see a bunch of junk on one side and a few bones on the other side. You saw something weird.</span></div></div>",
            "created":1349586000,
            "id":1441969,
            "title":"Yes"
        },
        "11131111":{
            "choices":[
                "You can come to my house and have dinner.",
                "You can have no homework for the next week"
            ],
            "content":"<div class=\"\"><div> <span>You saw a little sparkle in the pile of bones. It's...it's a sword! It looks like it is stabbed into the stomach. You try to pull it out. \"OWWWW!\" Miss Saphyre starts screaming! This must be the \" Stinging pain\"! You pull as hard as you can. Miss S. screams at the top of her lungs. Strangely, her stomach stars becoming...  wet? You finally are able to get it out. Miss S.'s stomach starts shaking, You start slipping down to her intestines! <br>\r\n<br>\r\n\"Miss S. Can you let me out now! I am gonna fall into your intstines!\"<br>\r\n<br>\r\n\"Ok!\" She flips upside down and starts coughing. You start going back up her esophagus. Then you can see the light. You fly out of here mouth. \"I am so glad that you are Ok! For helping me out...</span></div></div>",
            "created":1349586000,
            "id":1441982,
            "title":"Something shiny."
        },
        "111311111":{
            "choices":[
                "Mouth",
                "Back"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok. I can't pass up on a deal like that. So when's can we go?\"<br>\r\n<br>\r\n\"We can go right now.\"<br>\r\n<br>\r\n\"Now?  But isn't it still 2nd period?\"<br>\r\n<br>\r\n\"Time flies when your going down an esophagus!\"<br>\r\n<br>\r\n\"How are we gonna get there?\"<br>\r\n<br>\r\n\"We fly! You can either crawl in my mouth or hope on my back.\"<br>\r\n<br>\r\n<i>I could possibly fall of on her back, yet in her mouth, she could have an early dinner!</i></span></div></div>",
            "created":1349586000,
            "id":1441986,
            "title":"You can come to my house and have dinner."
        },
        "11131112":{
            "choices":[
                "You pick up a bone and poke it.",
                "You keep looking."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was a strange hole. Odd enough, it was seeled up. </span></div></span></div>",
            "created":1349586000,
            "id":1441975,
            "title":"A strange hole."
        },
        "111311121":{
            "choices":[
                "Spits you out in front of the class before it's too late.",
                "Wait until class is over."
            ],
            "content":"<div class=\"\"><div> <span>You pick up a bone from the pile in the corner. You poke the hole and then it OPENS! It starts sucking up everything around. It sucks up the bones and the junk and then you! You are know in a food storage hole. Eventually hours pasts and then the stinging pain is gone and then she forgets about you. Eventually the next day comes and people are wonder where you are. Then Miss S. remembers about you. What does she do?</span></div></div>",
            "created":1349586000,
            "id":1441990,
            "title":"You pick up a bone and poke it."
        },
        "1113111211":{
            "choices":[
                "Protect",
                "Don't interfere"
            ],
            "content":"<div class=\"\"><div> <span>She starts coughing. \"Miss S, are you ok?\" a student says. Then spits you out in front of everyone. Everyone was shocked. <br>\r\n<br>\r\n\"Ok everyone, settle down. I can explain.\"<br>\r\n<br>\r\n\"Yeah, sure\"<br>\r\n<br>\r\n\"You ate a student!\"<br>\r\n<br>\r\nYou could either protect her or not interfere.</span></div></div>",
            "created":1349586000,
            "id":1441991,
            "title":"Spits you out in front of the class before it..."
        },
        "11132":{
            "author_id":"carlosanchez",
            "author_name":"Hazari",
            "choices":[
                "I am interested",
                "Soud boring for me."
            ],
            "content":"<div class=\"\"><div> <span>Elvin Wynyard is a gentle golden griffin, he is not very tall, with 5'1 ft, what make think that he can easely pass unnoticed, sadly for him  that never was a option. Even after  years of desperatery trying of be normal was evident that he never will  to fit in this world. <br>\r\n<br>\r\nThe truth was that Elvin  was not his real name and defenitely  not a normal griffin too, he was Eldwine the rightful heir of the magical empire of Tribzond and since the mysterius death of his father, his evil step-mother and his brutal step-brotther, Auberon, a titanic black griffin were trying to kill him for the crown. <br>\r\nFor survive he has to escape to this strange world, sadly living in this world how exiled was not easy, how his magical training was never finnished, he always have accidents with his magic, size accidents overhim and the others.<br>\r\n<br>\r\nFinallythis year  he will have his biggest challenge,the university.<br>\r\n<br>\r\nWill Elvin have a year of studies withouth any incidentor the aparition of his step-brother?</span></div></div>",
            "created":1422680400,
            "id":1926363,
            "title":"Secret life"
        },
        "111321":{
            "author_id":"carlosanchez",
            "author_name":"Hazari",
            "choices":[
                "Accept their invitation",
                "Insist in go to your room"
            ],
            "content":"<div class=\"\"><div> <span>There are times of rest and times for work and sadly for most of us, the last constitute the biggest part of our lives. That truth of life was more certain for a particular gryphon, which soon will have to affront his biggest challenge.<br>\r\n<br>\r\nThe bus in which Elvin was, since the previous night was almost empty, the young gryphon trying to ignore his precautions and happily he was capable of appreciate the glorious morning outside, where the light of the sun rise over the precious hills of Connecticut, the calm forests and the fresh fields give a spectacular show for the passenger s of the small bus.  Soon the highway start to climb a small hill and you start to notice that the forest suddenly stop for give space to farms and numerous houses, a signal next to the road was written: Broadhall 6 miles<br>\r\nImmediately after that the bus was going down, after of go down to the valley you can see in the distance the river Huntington and the small city that it to run through. In question of minutes the bus cross the principal street of the old district  of Broadhall, a rough town build in a painteresque colonial style,  after that part the bridge it0s pass away to the modern district full of apartment buildings and houses of a modern style. <br>\r\n<br>\r\nThe vision of that old town replaced with that modern edifices make  you start to felt homesick again, subsequently  for don’t felt sad you take the pamphlet of  your new university, in great letters he can read Broadhall State University “The place where tomorrow starts today”. Again you reads for last time the history and trajectory of this prestigious college what you will belong, but that only increase your doubts. After all you are not a normal student, your magic powers who you sadly don’t have great control, has making your life in this world very difficult.<br>\r\n Luckily you have a Agnes, a gentle old ferret lady, she was a magician who has living here for the last 50 years. She was a loyal subject of your father and for her was an honor help you to adapt to the customs of this world, event after the frequents accidents that you have with your powers , she with the help of other magicians was capable of transfer you  always a new school with a new identity.<br>\r\n<br>\r\nSubmerged in your thoughts you almost don’t notices that the bus stop in front of the principal door, immediately you take your valises and after say good-bye to the conductor you finally descend of the bus. The campus it’s really a big place and take you awhile walk the relatively short distance between the door and the Bardsley Mansion where the office of admittance and student economic support were locates.<br>\r\nIn front of the elegant building two persons, one a human and the other an anthro owl were awaiting for you.<br>\r\n<br>\r\nSalutes Mr. Wynyard-exclaim gently the human, a tall man in his forty-  I am the director of admittance Roderick Bonham and my partner here  is your  Academic Director in the Galsworthy School of Business, the professor  Howard Chase, let me say Its grateful see a young man with your academics talents unite to us.<br>\r\n<br>\r\nYou felt uncomfortable with that salute, how always, Agnes give you a new identity with a high profile but how you don’t want make this situation more awkward you say- Thanks Mr. Bonham, but I don’t deserve this welcome after all it’s the middle of the academic year…<br>\r\n<br>\r\nDon’t worry Mr. Wynyard we have clear about your familiar problems, let go inside and inform you what we can do about that.<br>\r\n<br>\r\nFor a long hour you make the transacting of admission  and hear to the two mans talking to you about the pages and how you going to receive special tutors for help you take the pass to your classes , finally he want choose you the campus in  a tour but after long hours in a bus you felt extremely tired .<br>\r\n-Please gentlemen, you can excuse me, I have a long travel since Appledale in West Virginia and I want sleep for a while.<br>\r\n<br>\r\n-Well, the students of first year live in the housing setting of Lion Halls located in the western side of the campus, but the tour don’t will not take so much time, young man, considerate that we not have time for do this again soon.<br>\r\n<br>\r\nFinally you decide…<br>\r\n</span></div></div>",
            "created":1423026000,
            "id":1927976,
            "title":"A new adventure begins"
        },
        "1113212":{
            "author_id":"carlosanchez",
            "author_name":"Hazari",
            "choices":[
                "Ember Birdwhistle, your tutor",
                "Wendell Sykes, your roommate"
            ],
            "content":"<div class=\"\"><div> <span>The ambient in the office soon turn awkward meanwhile you were thinking what answers to the two men in front of you. They was looking to you expecting and quick answer but your fatigue make you difficult the labor of thought<br>\r\nI<br>\r\nt’s something wrong Mr. Wynyard – exclaim worry the professor Chase.<br>\r\n<br>\r\nYou look to the owl and with determination you says – Thanks for ask, I no sleep in all the travel, sadly I one of that peoples what can’t sleep in vehicles.<br>\r\nMr Bonham take again the word. – Sorry boy, we need end this soon, you going to accept our offer.<br>\r\n<br>\r\n-Please gentlemen, I find very generous your offer of a tour but I generously reject that, please don’t take me wrong I really want go but I too tired for put real attention. – You responses thinking what you was abusing of this two men.<br>\r\n<br>\r\nGoodly for you, the two men understand clearly your position and without any insistence they give you premise for go to your room. Immediately Bonham open one of the drawers of his desk  from where hr take some papers and a key explaining that  these were  your temporal papers and what in three day we will give you your permanent identification, more your horary, university rules and the keys of your room in the Lion Halls.<br>\r\n<br>\r\nBonham noticing your anxious he also say in a gently tone – Don’t be so nervous, Mr. Wynyard, a young man with your attitudes, will have a great future in this school. The way to the Lions halls it’s easy, walk straight for the road in front of this mansion, turn left in the Troadhall Engineering School walk one 300 ft and turn to the right in the Lois Jacobs Center. <br>\r\n<br>\r\nYou give the tanks to Mr. Bonham with genuine gratitude but before you can end the professor Chase interrupts you for say.<br>\r\n-Wait boy, let me say to you, that your tutor will coming to meet you this day in the afternoon,  her name is Ember Birdwhistle, one of my best students, and like you she is a mythical creature , a phoenix for be specific.<br>\r\n<br>\r\nThanks for the date, I going to have that in mind – you say a few anxious for leave the room, but how you don’t want more interruptions you ask. -  I something more that I have to know?<br>\r\n<br>\r\nThe Mr. Bonham immediately sees his papers and after a few moments he answers. - Well apparently you will have a human roommate, Wendell Sykes, a student of Engineering of first year.<br>\r\n<br>\r\nSoon you are again in the exterior and taking a deep respiration you takes your valises and start the travel to your apartment. Fortunately this day was not warm and the particular modern architecture of the university buildings, make the travel something nice and interesting.<br>\r\nFinally you reach your new building a tower of four floors with its façade of bricks and glass makes it look very comfortable. Soon tanks to your papers don’t have any problem for enter to t Lion Halls and take your room for a deserved rest. The room was consisting of a great room with two beds and a private bath and television, things what you don’t doubt to use immediately.<br>\r\n Finally when you was laying down in your bed watching television you fell that the sleep it’s finally taking you for complete and without any doubt you accept it with happiness, in less of a minute your eyes are closed and the pleasures of Morpheus make you travel to the country of the dreams. <br>\r\nHow always your dreams consist in you visiting your old kingdom, watching the fields of Mildoria, the fertile valley of Throsea where the river Thablis flow proudly giving precious water to the uncountable vineyards of blue grapes, the majestic memories of the cities of Adartis and Mnessos and other innumerable things, always in this oneiric travels you was flying using your wings. The marvelous sensation of swim between the cold clouds of the sky always make you felt happy and in this particular dream you were flying more high than habitual and you love it, and before you can think in other thing, you are in a even higher altitude. Without any dude you see the ground all the cities, forests and rivers now look like how diminutive specks and lines, so tiny and fragile and you adore every second of felt abode all that stuff and feeling untouchable. Abruptly the dream turn in nightmare when a estrange sensation of paralysis take control of your wings and before you can react you were failing lke a rock to the ground. <br>\r\nFortunately you awakes in the ground of you apartment after a hard hit, you first reaction it’s that nightmare make you fallen of the bed, immediately you extent one of your arm for find a clog but you not find the bad or the bureau next to it. Suddenly that make you stand up for see the habitation with mayor detail, soon you discover the two beds and other furniture have disappears, your confusion decrease very quickly when you discover below you the crusher rest of your bed, now of the size  of a small matches  box.<br>\r\n<br>\r\n-For Zhoosul! This happen again! - You exclaim extremely shamed for what happen.<br>\r\n<br>\r\nThe problem it’s big, and you need relax for fix this disaster, but the constants thought in Agnes and how she will be so disappointed of you for fail in the first day. This and other thought impede to you in focus in the right spells <br>\r\n<br>\r\n-Clarigatio Celeris… - You exclaim desperately fast for various minutes but your magic don’t work a cause of your stress- Damm it what could be worse!<br>\r\n<br>\r\nHow a cruel joke a sound come from the door of the room. – Wynyard.  Are you Ok?  <br>\r\n<br>\r\nThe person what ask that is…<br>\r\n</span></div></div>",
            "created":1424667600,
            "id":1938799,
            "title":"Tiny Things can be Great Problems"
        },
        "112":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Jessica, the 5'8\" feisty pink haired arctic fox",
                "Allison, The shy 8'2\" buxom Green Rex",
                "Create your own!"
            ],
            "content":"<div class=\"\"><div> <span>These are some pre-made characters of mine, either from various other stories or interactives, or just popped out of my head. feel free to make use of them, or make your own! (please make sure when you make your own to leave an option in that chapter for someone else to do the same!)<br>\r\n<br>\r\nJessica is a wild card. shes small, shes modestly endowed, and shes feisty. She won't shy away from big guys or girls, and wont hesitate to try to put them in their place, and though she'd never admit it out loud, she has a 'thing' for people that tower over her, despite her always trying to take charge<br>\r\n<br>\r\nAllison is almost the exact opposite of Jessica. shes massive, shes absolutely blessed when it comes to her endowment and curves, despite being a tad on the plump side. shes incredibly shy, despite being bigger than even the biggest of the football players</span></div></div>",
            "created":1346907600,
            "id":1422087,
            "title":"The Girls!"
        },
        "1123":{
            "author_id":"sweetace2211",
            "author_name":"AceSweet2211",
            "choices":[
                "Grow",
                "Shrink"
            ],
            "content":"<div class=\"\"><div> <span>Lindsay is probably the nicest person/anthro you would ever meet. Even while being insulted and teased about her hight and overall developement, she still keeps a smile on her face and is even nice to the people who make fun of her sometimes, she will not retaliate unless backed into a corner by multiple people. She is mostly satisfied with her hight she always withed she could be taller and bustier. will she get her wish or exactly the opposite, you decide.</span></div></div>",
            "created":1454821200,
            "id":2100633,
            "title":"Lindsay 4' 7\" Husky"
        },
        "11231":{
            "author_id":"sweetace2211",
            "author_name":"AceSweet2211",
            "choices":[
                "Lindsay instantly wishes to grow",
                "Lindsay wishes fro the ability to grow/shrink anything"
            ],
            "content":"<div class=\"\"><div> <span>While walking out of the school, Lindsay noticed lights coming from the science lab, she went to check it out but as soon as she walked in she was greeted by a small blue glowing orb to the chest. She managed to keep a hold of it until it stopped moving. When she looked down at what she had in her hands she watched it look back at her. Lindsay freaked out a bit but quickly calmed down. She hid the orb in her pocket and quickly went back to her dorm. When she arrived in her dorm she put the orb down on her bed and watched it for a while and nothing happend.<br>\r\n<br>\r\n\"Thank you.\" seemingly coming from nowhere.<br>\r\n<br>\r\n\"W-who was that!\" replied Lindsay.<br>\r\n<br>\r\n\"Twas I\" said the orb on her bed as it was uncurling into a beetle looking thing.<br>\r\n<br>\r\n\"You can talk?\" said Lindsay<br>\r\n<br>\r\n\"Oh of course and for your kindness I will be your personal companion, and just for your information I can control the fabric of this reality\" </span></div></div>",
            "created":1454821200,
            "id":2100643,
            "title":"Wish, Granted"
        },
        "11232":{
            "author_id":"sweetace2211",
            "author_name":"AceSweet2211",
            "choices":[
                "Lindsay shrinks to under an inch",
                "Lindsay Shrinks to half her size (2' 3\")"
            ],
            "content":"<div class=\"\"><div> <span>On her way to her next class, Lindsay noticed noises coming from the chemistry lab, she walked in wondering what was going on and was met with a green glowing smoke, she began choking on the gas and collapsed onto the floor but did not pass out, she began to get a shrinking felling all over her body, she didn't know it yet but she was shrinking at about 1 inch a second she was in the gas. </span></div></div>",
            "created":1454825940,
            "id":2100648,
            "title":"Denied"
        },
        "113":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Roxanne, the petite 5'4\" coy silver dragoness",
                "Jennifer, the sultry 6'6\" Hyena grrl",
                "Create your own!"
            ],
            "content":"<div class=\"\"><div> <span>These are some pre-made characters of mine, either from various other stories or interactives, or just popped out of my head. feel free to make use of them, or make your own! (please make sure when you make your own to leave an option in that chapter for someone else to do the same!)<br>\r\n<br>\r\nRoxanne's a bit on the short side, and hir body is similarly modest as well, barely filling out hir clothes at all. shis rather coy at times, but most of the time shi's just clingy, shi loves having someone to cling too or snuggle up with. <br>\r\n<br>\r\nJennifer is a tease, plain and simple. shi loves to flirt, to rub and push up on you, and loves to be wanted. despite hir being taller than most average furs, hir body is average as far as endowments, and shi finds hirself easily made jealous of others with a bigger chest, groin, or even those just taller than hir.  shi always wants to be the biggest and it infuriates hir when shis not. </span></div></div>",
            "created":1346907600,
            "id":1422090,
            "title":"The Grrls ;)"
        },
        "1132":{
            "author_id":"choleric",
            "author_name":"choleric",
            "choices":[
                "\"uh, a little something something to make me bigger.\" Continuous growth for two!",
                "\"a prototype. erm... it lets you steal the size of others...\" Size Vampirism!",
                "Something utterly unexpected."
            ],
            "content":"<div class=\"\"><div> <span>“Yeah, well, I have a bigger dick than you anyway, loser!” For a hermaphrodite, life and love could be tough, sometimes, particularly for the oftentimes intimidating figure of Jennifer. Six foot and six inches of slightly curvy, averagely built hyena, with short brown hair perfectly styled to look just the right kind of messy and tight clothes to accentuate both body and bulges. The hyena wasn’t quite as blessed as some of the more notable – or notorious – herms in the public gaze – neither stacked like a warehouse nor packing like a Chechnyan warlord. Hell, she’d take just one of those, at least then she wouldn’t be stuck in the nightmare no-man’s-land that she currently found herself in – as evidenced by the scampering footsteps of the fleeing bunny making good speed in the opposite direction. Finding love, of course, wasn’t the only reason the hyena found herself studying at AU – she had herself a scholarship for running track, and a keen interest in all things historical for when she inevitably broke both her legs, or got shot in the gut, or something utterly depressing and so very typical of her life like that. Jennifer sighed, ran a hand through that perfectly scuffed hair, and slowly wandered back in the direction of the diner on campus. Grrl needed her comfort food.<br>\r\n<br>\r\nComing the other direction, however, was a little purple dragon in a big hurry. Five foot zero of scurrying sneakers pounding the paved ground, his clothes flapping in the breeze, his books clutched tightly in his arms, Tyler scuttled along to the other side of campus, spitting curses under his breath. How was he supposed to know that Metaphysical and Ancient studies was in that run-down, crumbling ruin they called a haven of education? Maybe if they had proper signposting up  like they did for the nice, modern, quantum sciences building, they’d-<br>\r\n<br>\r\n“ERK!” <br>\r\n“Oooft.” Turning a corner at full tilt, the little dragon ran directly into Jessica, bouncing straight off her toned tummy and landing on his ass with an ominous crack. A worried frown flit across Jessica’s face for a moment – she hoped he hadn’t cracked his phone, or something like that. Or his spine. Or... she didn’t get a chance to consider it further, as a bright flash and crackle erupted around the pair, a warm glow of arcane energy wrapping around them, sparks of magic leaping around with the strong scent of ozone burning through the air.<br>\r\n“Uh... are you okay, kid?” Jennifer bit her lip awkwardly, extending a hand as she stooped over to pick up the squirmy little fellow.<br>\r\n“I’m not a kid, I’m older than you! Probably! T-that is, uh... um.” Taking a good look at his assailant, Tyler saw the attractive, somewhat savage hyena looming right over him – though he was used to the last part, being rather shorter than average. “I’m sorry?” he squeaked, his voice catching in his throat as he extended his hand weakly.<br>\r\n“Uh... don’t worry about it. It’s cool. I heard something go crack... you okay?”<br>\r\n“Ah, um...” Reaching into his back pocket, Tyler pulled out a strange, arcane device, all silver rings and shattered crystal – Jennifer assumed correctly that perhaps the crystal was not intended to be shattered. “Oh no, my arcane focus... that must have been what... oh god.”<br>\r\n“Arcane focus? Is that some weird dragon shit that us squishy, furry things aren’t privy to?” She smiled eagerly as she practically purred it, taking Tyler by the hand and practically scooping him up, his adorable little mug flashing fear and surprise as she pulled him in against her stomach. He flushed warm, a little embarrassed and awkward – a gorgeous girl (well, not quite – even he noticed the prominent bulge in those tight skinny jeans) getting so hands-on with him? Maybe the magic had killed him instantly and sent him to a better place than the depressing would-be wonderland that was AU. Oh right, the magic!<br>\r\n<br>\r\n“Oh. Not quite. B-basically, they’re like conduits for magic. If you’re not good at it, like... well, everybody when they start out... you buy one of these and abracadabra, you can do basic-level magic. We... might have a problem, though, since I just sat on it and... released a little magic.” Tyler stammered and stuttered a little, the poor little thing simultaneously nervous about the magic mishap, utterly awkward and flustered under the attentions of the sultry shemale, and vaguely aware of the possibility deep in the back of his mind that he might not get the classes he wanted if he was any later than he currently was.<br>\r\n“Magic, huh. I learned a little about the history of Voodoo when in high school... but you’re probably the expert around here. What’s going to happen to us?” Jennifer ran a hand down the little guy’s back, feeling a little bad for him – Tyler looked out of his mind with worry, and so she drew him close, rubbed his back a little, tried to make him feel nice and comfortable...<br>\r\n“Um. Well. Right now? The spell I put through it last is stuck on autopilot, I can feel it. I bet you can, too – it’s like a pleasant tingle spreading throughout your entire body. We... ah, might have some problems, though. The last spell I used, was...”<br>\r\n</span></div></div>",
            "created":1347944400,
            "id":1430196,
            "title":"Early birds get worms, tardy dragons get..."
        },
        "12":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Male",
                "Female",
                "Herm"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose your gender! are you...</span></div></span></div>",
            "created":1346907600,
            "id":1422078,
            "title":"Muscle: Choose your gender!"
        },
        "121":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Marcus, the lean 6'6\" white furred kangaroo",
                "Rich, a Lanky 5'6\" raccoon",
                "Create your own!"
            ],
            "content":"<div class=\"\"><div> <span>These are some pre-made characters of mine, either from various other stories or interactives, or just popped out of my head. feel free to make use of them, or make your own! (please make sure when you make your own to leave an option in that chapter for someone else to do the same!)<br>\r\n<br>\r\nMarcus is a tall, but pretty lean Kangaroo. body mostly thinner like a runners, saved for his (Thanks to both leg workouts and kangaroo genetics) Rather beefy legs. hes the main kicker for the football team, but always ends up overshadowed by people like Fang. he keeps telling himself one of these days he'll be the one in the spotlight, and itll be Fang and the other players hiding in his shadow. <br>\r\n<br>\r\nRich is  a rather short, and thin coon that usually ends up being overlooked by most everyone. not so small that hes considered a public 'shrimp', and not big enough to catch everyone's eyes. He can be a bit greedy, and finds himself taking things that he wants without asking, usually asking himself \"Why shouldn't it be mine?\" </span></div></div>",
            "created":1346907600,
            "id":1422094,
            "title":"The Guys!"
        },
        "1211":{
            "author_id":"craft1",
            "author_name":"Base34",
            "choices":[
                "His locker holds a device made to switch mass between two parties.",
                "Experimental supplements that would help him bulk up",
                "Something else entirely (Reader's Choice)"
            ],
            "content":"<div class=\"\"><div> <span>The day was pretty fine, as fine as a warm after noon with a breeze could get, anyway, not that Marcus had any time to settle down and enjoy it. The tall kangaroo was currently sitting down on the bench in the locker room, having just put his clothes back on after taking a shower and thinking mostly to himself. The others on his team were mostly chatting about things, talking about their hopes for the upcoming big game, and how they were laying their man hopes and fears right upon Fang, as usual. Despite the good job he did kicking the ball for the team, he always wanted to be a bit more than just the kicker. The kangaroo wanted to be the one that his teammates placed their hopes upon, the praise being heaped upon him, the face of the team as it were. He wouldn't feel so bad if the muscle-bound giant of a wolf didn't quip at him often, telling him he'll always be nipping at wolfs heels. <br>\r\n<br>\r\nHe was done with it, done with simply being the kick that would be forgotten, done with being the guy in the back, done with it all. The white furred marsupial would have himself be all that and more, if only he had some way of getting it all, and then keeping it while everyone else looked up to him, figuratively and quite literally for a change. He was lost in thought when a shadow moved right over him, and a hint of musky fur hit him, catching his attention and causing him to look up, spotting their 'star' player, Fang right before him, his trademark fang sticking out of his muzzle with a dark grin on.<br>\r\n<br>\r\n\"Oh, it's you roo-boy, whatcha' thinking about? Oh wait I got it, thinking about how good I'll look when I get MVP later? Or maybe how you'll come up with a good enough speech talking about how you learned everything you know from me?\"<br>\r\n<br>\r\n\"Not now, Fang...I'm actually thinking about something important for a change, so if you could leave me alone I'd gladly fight with you later.\" Marcus retorted.<br>\r\n<br>\r\nFang snorted and waved one huge clawed at him before walking off, to shower get himself cleaned. Marcus frowned a little more and surmised to finally do something about this unbearable situation for once and all, and then he'd be the star. The kangaroo pulled on his socks and slipped his paws into his custom made sandals before standing up and looking around the locker room, by this point most of the other players had already left, which was just the opening he needed to walk over to his own locker and open it up with out anyone else seeing what he had in there. He put in his combination and then opened the door up, grinning at his little plan take shape.</span></div></div>",
            "created":1347598800,
            "id":1427582,
            "title":"Marcus' plan takes shape."
        },
        "123":{
            "author_id":"wolflord62",
            "author_name":"GTSLapras",
            "choices":[
                "Hina the Wolf Chimera ",
                "Deltora the swimmer shark",
                "Make your own"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to the muscle section involving anthros with all the bits. I am creating characters out of thin air here, so if you don't like the characters I made feel free to include one of your own<br>\r\n<br>\r\nThe first character is a wolf anthro. Her name is Hina and she's on the smaller side of her herd. She's only a mere 4'6 and flat chested and flat assed. She isn't packing that much either. While being 17 and in high school, she is extremely self-conscious about everything. She spends most of her time alone in her room, enjoying nerd things and jacking off. Her parents held a dark secret from her, she is actually a chimera, being <i>mostly</i> wolf while being only slightly gorilla. It's the gorilla in her that causes her to build muscle quickly.<br>\r\n<br>\r\nThe second character is a great white shark. Her name is Deltora. She is scrawny but curvaceous. She is 6'0 with humongous f-cup breasts and a heart shaped ass. She is on the swim team and gets fiercely competitive. She has a dark secret, that being her cock and balls. She guards that secret with her life. They aren't big, so they aren't noticeable while she swims.<br>\r\n<br>\r\nPick your poison and write on!</span></div></div>",
            "created":1561100400,
            "id":2676551,
            "title":"Pick your herm"
        },
        "1231":{
            "author_id":"wolflord62",
            "author_name":"GTSLapras",
            "choices":[
                "Hit the gym! Pump and grow!",
                "No power outage will stop her from learning!",
                "Something else I guess"
            ],
            "content":"<div class=\"\"><div> <span>Author's note: When I wrote this character I forgot that they were supposed to be in college so Hina is now 19 and a Sophmore in college. Same body measurements.<br>\r\n<br>\r\n<i>Beep! Beep! Beep!</i> <b>WHAM!</b><br>\r\nHina slammed her fist on the snooze button of her alarm clock. \"Rise and shine for another shitty day of school,\" Hina said to no one in particular. Hina stepped out of bed and grabbed her phone of the nightstand. She got a message from her best friend about 2 hours ago. <br>\r\n<br>\r\n\"Hey there Hina! I know you won't see this till later because your classes don't start until noon, but there was a power failure and half the campus is wiped out. All classes were canceled as a result. Have a good off-day! XOXO\"<br>\r\n<br>\r\nClasses were canceled? Hot damn! Hina could do whatever she wanted. And seeing how she just woke up... there was something that could be taken care of.<br>\r\n<br>\r\nHina lied back down with her phone and started opening up her favorite porn sites. She loved muscles and fantasized about having her own bugling mass on her body. Huge boobs, huge muscles, a long throbbing cock... steamy! Hina was already at full mast. She was only 1\" long with grape size balls, but those facts made them easy to conceal. She did not need people thinking she was a boy any more than they did, in spite of the fact she has a pussy right underneath her balls.<br>\r\n<br>\r\nIt didn't take long before Hina was about to cum. Muscular images filled her head as she tossed her phone to the side and began to finger herself while stroking her dick. Within the moment she reached sweet release.<br>\r\n<br>\r\nShe's been masturbating a lot more lately, ever since she graduated high school and began attending the hormone infested cesspool that is a university. The lust in the air is almost palpable as it crawls into every facet of Hina's day. If she looked hard enough she could find students in heat during classes. It was nice to see students committed to higher education but not <i>the other bits.</i><br>\r\n<br>\r\nHina rose from her bed and walked to the bathroom to perform her business and take a quick shower. She dried herself off and got dressed in a simple white tank top and black jeans.<br>\r\n<br>\r\nShe had two or three options for how to spend her day off.<br>\r\n<br>\r\nA) Hit the and do some weight lifting. The gorilla genes in her body activate causing her to build muscle extremely quickly.<br>\r\n<br>\r\nB) Go to the chemistry lab to check on her science project. An accident will happen there causing her to get big in a matter of seconds</span></div></div>",
            "created":1561686540,
            "id":2679599,
            "title":"Hina the Wolf Chimera "
        },
        "13":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Male",
                "Female",
                "Herm"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to the transformation section! which can range to anything from humans turning into anthros, anthros turning into other anthros, males turning into females, people growing a second pair of arms. or any other form of unnatural bodily transformation you can conceive! <br>\r\n<br>\r\nChoose your gender! are you...</span></div></div>",
            "created":1346907600,
            "id":1422080,
            "title":"Transformation: Choose your gender!"
        },
        "131":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Tyler",
                "Fang",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who  shall we follow, then?</span></div></span></div>",
            "created":1456521360,
            "id":2109918,
            "title":"Male"
        },
        "1313":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Jacob",
                "Matt",
                "Mike"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else? </span></div></span></div>",
            "created":1522285320,
            "id":2471492,
            "title":"Someone else"
        },
        "14":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Male",
                "Female",
                "Herm"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to the Fattening/Inflation section, where all sorts of plumping and swelling will occur. whether its being fed cake till your ass splits your pants open and you need 2 chairs to sit down, or finding yourself a bit more... rubbery than before, and having some intimate fun with an air pump!<br>\r\n<br>\r\nChoose your gender! are you...</span></div></div>",
            "created":1346907600,
            "id":1422081,
            "title":"Fattening/inflation: Choose your gender!"
        },
        "141":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Darius, thin guy with a bit of tone",
                "Create your own!"
            ],
            "content":"<div class=\"\"><div> <span>These are some pre-made characters of mine, either from various other stories or interactives, or just popped out of my head. feel free to make use of them, or make your own! (please make sure when you make your own to leave an option in that chapter for someone else to do the same!)<br>\r\n<br>\r\n</span></div></div>",
            "created":1346907600,
            "id":1422137,
            "title":"The Guys!"
        },
        "1411":{
            "author_id":"dragonien",
            "author_name":"Dragonien",
            "choices":[
                "Darius is a Kangaroo",
                "Darius is a Dragon",
                "Darius is some other species"
            ],
            "content":"<div class=\"\"><div> <span>(originally posted by Sylvan, re-posted by me, to allow other threads to be added)<br>\r\n<br>\r\nDarius got off the bus, rucksack over one shoulder. He looked up and down the tree-lined street at the mass of students, new and old, bustled about. \"Campus Town\", the strip of restaurants, copy centers, drug stores, bars, and clothes shops, ran between the dorms and the main university buildings. It was where students and faculty alike came to socialize. It was also where the Greyhound Bus had dropped him off.<br>\r\n<br>\r\nThe butterflies he'd suppressed after the explosive send-off from his father and older brother now came back in full-force. He was acutely aware of how light his bag was. Everything he owned, everything he'd been allowed to take after Dad's explosive \"college is for nerds\" diatribe, felt woefully inadequate.<br>\r\n<br>\r\nHe checked the letter he'd gotten and oriented himself in the sea of foxes, horses, wolves, badgers, cougars, rabbits, mice, and other assorted students. Grantham Hall was about four blocks west.<br>\r\n<br>\r\nHis stomach rumbled but even though the nearby \"Campus Subs\" looked enticing, he knew he'd better save his money. At least the dorm covered three meals a day. He would see if he could get a bite, there, after checking in. Even with a rail-thin physique, he had decent muscle tone and wanted to keep it up. He hefted his bag and began walking.<br>\r\n<br>\r\nGrantham Hall was one of the older structures and seemed attached to one of the few class buildings not in the main strip. A faded, brass sign announced the neighboring facility to be \"Azimuth Hall - School of Metaphysical/Biological Studies\". He raised one brow at that, thinking it must be a relic from when the school was founded over a hundred years ago. It was attached to his dorm by a second-floor skyway, under which was a small, tree- and shrub-lined plaza set with chairs and tables.<br>\r\n<br>\r\nA fantastic smell was wafting out a propped-open door in that courtyard.<br>\r\n<br>\r\nHis stomach rumbled again.<br>\r\n<br>\r\nRealizing that the old \"Metaphysics\" building might, now, be a dining hall or something, he nodded to himself. It would make more sense than modern students studying magic and the occult. Deciding that he would check it out as soon as he was settled in, he walked in to Grantham Hall.</span></div></div>",
            "created":1346907600,
            "id":1422139,
            "title":"Darius, thin guy with a bit of tone"
        },
        "1412":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "Sure?",
                "Nah.(more OCs)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if it was you who went to the university?</span></div></span></div>",
            "created":1466655960,
            "id":2168938,
            "title":"It's you!"
        },
        "14121":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Alright, now are you male or female?</span></div></span></div>",
            "created":1466779920,
            "id":2170120,
            "title":"It's you! (Part2)"
        },
        "141211":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "Fox",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Finally, what species are you?</span></div></span></div>",
            "created":1466780160,
            "id":2170122,
            "title":"It's you! (Part3)"
        },
        "1412112":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "Yes. Cat",
                "No. More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about if you were a cat.</span></div></span></div>",
            "created":1467437400,
            "id":2173969,
            "title":"More species."
        },
        "14121121":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "The science lab",
                "The principle's office."
            ],
            "content":"<div class=\"\"><div> <span>You are a tan male cat with deep brown eyes. You are 5'11 and 150lbs, giving you a very average look. You make good grades and you have a great deal of friends, even among the teachers.<br>\r\n<br>\r\nYou begin the day like any other day by getting dressed and gathering all your supplies for class. Your dressed in a yellow t-shirt and brown khaki shorts. When you leave your dorm, you decide to hang around for a little bit since none of your classes start for couple more hours.<br>\r\n<br>\r\nYou pass by a couple people and exchange the usual greeting, nothing out of the usual. You can't help but to crack a small smile at how great coming here for school is ,but there is one downside to Anthro university. You then begin to hear loud, plodding footsteps...which means only one thing.<br>\r\n<br>\r\n\"Oh no...\"<br>\r\n<br>\r\n\"Hey, tiny.\" A husky voice spoke out from behind you.<br>\r\n<br>\r\nYou hesitantly turn around to meet a person you knew all too well<br>\r\n<br>\r\n\"He...hey Kendra\"<br>\r\n<br>\r\nKendra is the very large, very fat bully of the school. She is a tiger that's stands at 10 feet tall and weighs an astounding 2000lbs with long brown hair and pale green eyes. a majority of her weight is fat, but she also has has a good deal of muscle under her immense layer of fat. Due to the combination of muscle and fat, Kendra has very curvy body with breasts that are as big as yoga balls, and an ass that could engulf an entire couch underneath it, she also has a belly but it's not quite as large as her other assets. Kendra usually wears a very small black tank top and ill fitting red shorts.<br>\r\n<br>\r\n\"So how ya doin today, tiny?\"<br>\r\n<br>\r\n\"Why do you keep calling me tiny? Everyone's tiny compared to you.\"<br>\r\n<br>\r\n\"I know, it's just funnier to call you tiny though. By the way, You still didn't answer my question.<br>\r\n<br>\r\n\"I'm just waiting for my classes to start.\"<br>\r\n<br>\r\n\"Good, then you won't mind if I borrow you for a second.\" Kendra said as she picked you up by your shirt<br>\r\n<br>\r\nYou know fighting her would make this worse so you just go along with whatever she needs you to do. You keep quiet as Kendra waddles through the halls and squeezes through door ways to get to her destination.<br>\r\n<br>\r\nAfter about 15 minutes, Kendra brings you to...</span></div></div>",
            "created":1467569760,
            "id":2174769,
            "title":"A brand new day."
        },
        "141211211":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "She gets through just fine.",
                "She gets stuck and needs help."
            ],
            "content":"<div class=\"\"><div> <span>As you and Kendra continue towards the destination, you can't help but to admire Kendra's curves. You won't lie that you find Kendra very attractive, she just scares you with how strong and viscous she can be sometimes. Your sure other people must feel the same, there just terrified of her.<br>\r\n<br>\r\nAfter about 15 minutes or so, Kendra brings you to the science lab.<br>\r\n<br>\r\n\"Hey uh Kendra why are we at the science lab?\"<br>\r\n<br>\r\n\"Your good at sciencey stuff, ain't ya?\"<br>\r\n<br>\r\n\"Ye...yeah I'm pretty good, why?\"<br>\r\n<br>\r\n\"Well, tiny, I'm not very good at this science crap so I need you to do it for me.\"<br>\r\n<br>\r\n\"But why me, I'm not even the smartest in the class.\"<br>\r\n<br>\r\n\"Because I need some one I can trust, and I trust you to not tell anyone about this.\"<br>\r\n<br>\r\nEven though Kendra torments you daily, hearing her say she trusts you gives you a warm feeling.<br>\r\n<br>\r\n\"So do we have a deal, tiny?\" Kendra said as she holds out her hand.<br>\r\n<br>\r\nThis is the first time you've seen Kendra ask for help, it's odd to say the least. If you say no you'll probably get hurt pretty badly, and saying yes doesn't seem too bad.<br>\r\n<br>\r\n\"Deal.\" You say as you shake Kendra's hand.<br>\r\n<br>\r\n\"Ha great! I'll show you what you need to do then.\" Kendra rather joyfully.<br>\r\n<br>\r\nKendra then starts to enter the science lab and...</span></div></div>",
            "created":1468890780,
            "id":2182703,
            "title":"A proposal."
        },
        "14122":{
            "author_id":"hoodlum98",
            "author_name":"Mr_Magic",
            "choices":[
                "Alex, the sassy hippo/human femboy ",
                "Charlotte, the oblivious cat heartthrob",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1602426300,
            "id":2919050,
            "title":"How about..."
        },
        "143":{
            "author_id":"eyeofpasta",
            "author_name":"Eyeoflucario",
            "choices":[
                "You do you.",
                "Let the list roll."
            ],
            "content":"<div class=\"\"><div> <span>Is this the part where we list animal species like a millionaire's exotic pet options? No. For this, you will pick yourself/herm fursona of yourself to fit this. You will need to be vague however. You most likely have a tail, nails, ears/ear holes, and the herm package of tits, dick and puss. You will describe yourself as 'you' as you right as well, but you can add any character that fits if you like.<br>\r\n<br>\r\nOr you can list your favorite animals to make it easier on yourself.</span></div></div>",
            "created":1576926780,
            "id":2762438,
            "title":"Hermaphrodite"
        },
        "1431":{
            "author_id":"eyeofpasta",
            "author_name":"Eyeoflucario",
            "choices":[
                "Tom, the tubby, frat deer",
                "Bella, the athletic bunny girl",
                "Jo, the curvaceous, tomboy herm tiger."
            ],
            "content":"<div class=\"\"><div> <span>You were in college once before, but really only once. Thank whatever god there was that you could transfer credits to this new one. This was more of a first since the last place had the dorms burnt to the ground. This was a cleaner place as well. Nothing seemed out of place as you get off the bus and walk around the outside.<br>\r\n<br>\r\nThe building itself was larger than most buildings you have seen with the Classic orange is how brown brick walls lining everything. There were maps and directories everywhere showing this place having a food court and shops like a mall. This was really a third of the building with the rest being college classrooms and dorms. Might as well head in and find your room.<br>\r\n<br>\r\nYou got to the front doors as a fairly portly giraffe secretary and a purely immobile hippo woman bound to a large scooter signed people in for their dorm numbers. A few students even had a gut on them. Others were flat in the stomach like a 50/50 split of fit and fat. You shrug off that detail, signed your name, species and gender before heading in. Thanks to germs like you, gender specific dorms were out. You will see this soon enough as you head to your dorm and see someone already unpacking.</span></div></div>",
            "created":1576927920,
            "id":2762439,
            "title":"It's really you!"
        },
        "14313":{
            "author_id":"eyeofpasta",
            "author_name":"Eyeoflucario",
            "choices":[
                "Enthusiastically (excited)",
                "Cautiously (jealous)"
            ],
            "content":"<div class=\"\"><div> <span>Jo was about half a head taller than you with assets bigger than yours as well. From behind, you can tell there was some slight softness to her frame. She turned to show you a somewhat toned back eye shadow on a pure white furry face along with black lipstick. The skulls on her slightly tight shirt and the grey and black color gave away a less feminine nature. The bulge in her jeans did that as well. A green streak of color was swiped to the side to join the natural grey shoulder length hair. <br>\r\n<br>\r\n\"So, you are the new roomie. Call me Jo.\" She stepped forward with her chest lightly bouncing which might meant no bra. She held a hand out for you to grab and shake it. She seems nice. More on the rocker side than the gothic sort of dark, judging by the Green Day and Sex Pistols posters she put up behind her. It was hard to fully figure out if you liked how big she was or if you wanted to be the biggest. You match her hand...</span></div></div>",
            "created":1576928700,
            "id":2762440,
            "title":"Oh, Jo."
        },
        "15":{
            "choices":[
                "Other:  Sexual (hyper-growth/shrinking)",
                "Other:  Size (multiple options:  growth, shrinking, weight, sexual, etc...)",
                "Other:  Shape (multiple options:  transform, stretching, multi-limb, etc...)",
                "Anything Goes",
                "Create another setting/story"
            ],
            "content":"<div class=\"\"><div> <span>Campus was a study in contrasts:  old and new, urban and rural, old and young. The buildings had been constructed on the outskirts of town a hundred years ago when land was cheap in the wake of the Big Drought and the city had been slow to expand to catch it. Some buildings, though, were newer:  tall and glass-clad, shining in the sun. Others were old and decrepit, looking as if a stiff breeze across the plains or through the neighboring Malodov Wood, would knock them over. The staff tended towards the elderly, with a decent number of younger exceptions, along with the student body.<br>\r\n<br>\r\nFoxes, wolves, coyotes, and hyenas mingled with horses, zebras, donkeys, and unicorns. The occasional draconic exchange student flew in for a landing on the broad, sculpted lawns while mixed-race residents such as chimera or gryphons wandered the tree-lined paths.<br>\r\n<br>\r\nAn hour's drive from downtown, a small village had grown up between the dorms featuring all the needs students might have:  a grocery, a pharmacy, restaurants, bars, and three book stores filled the area.<br>\r\n<br>\r\nFew watched the shadows, however.<br>\r\n<br>\r\nThe shadows moved.<br>\r\n<br>\r\nThey weren't sinister nor, when noticed, did they seem ominous. Rather, they were like reflections of some unseen, magical force that permeated the area. They were cool under the noonday sun and concealing after dark. They were neither friend nor foe but followed everyone. But within them lay a power and that power was both arcane and active.<br>\r\n<br>\r\nFreshman orientation was just beginning and, in the eyes of everyone on campus, a new year had begun.</span></div></div>",
            "created":1346907600,
            "id":1422110,
            "title":"Campus Of Shadows"
        }
    },
    "info":{
        "author_id":"dragonien",
        "author_name":"Dragonien",
        "brief_description":"Welcome to Anthro U, where a discovery is about to change the lives, and size, of everyone",
        "created":1346866200,
        "description":"<td align=\"left\" class=\"norm\">Based around a College where some of the students find themselves in possession of size changing abilities or objects. <br>\r\n<br>\r\nAll fetishes are allowed except for Extreme Ageplay like cubs/diapers, or generally nasty stuff like scat, watersports, farting and stuff Characters can grow or shrink to any size and nothing is quite as fun as size play turnaround ;)<br>\r\n<br>\r\nTurnabout is one thing i find that is really underdone in the macro community, especially multiple bouts of it. Nerd outgrows bully and gets revenge, then the bully gets even bigger, only to have the nerd grow yet again<br>\r\n<br>\r\nComments and reviews are great. Additions are even better. spread it to everyone you know, lets make this huge!... pun only slightly intended :&gt;</td>",
        "id":1889670,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1576928700,
        "modified":1602426300,
        "pretty_title":"Anthro University"
    }
}