{
    "chapters":{
        "1":{
            "author_id":"noisrrah",
            "author_name":"noisrrah",
            "choices":[
                "Mitchell",
                "Philip",
                "Ritter",
                "Jeremy",
                "Someone Else"
            ],
            "content":"<div class=\"\"><div> <span>On the way to school one day, you decide to drink a shrinking potion. You feel a bit lightheaded and faint. When you come to, you realize you have shrunk and you're naked! The world around you is huge! Luckily you are very close to school, so you run inside. You find yourself in one of the hallways. Looking around, you can see many boys you wouldn't mind exploiting, but you had your mind set on a certain room- the locker room. You sprint discreetly past the giants until you make it to the locker room. Apparently, PE hasn't even started yet, as you can see boys changing out of their school clothes. This was perfect because you can \"test drive\" a teen before deciding to stowaway in their socks. As you run under one of the benches you can see the feet of some of the hottest (in your opinion) boys in school, all in your grade. You can see Mitchell, a medium-sized, non-athletic redhead boy with long-ish hair; Philip, a short, half-black boy with very short hair; Ritter, a moderately-built, but somewhat short half asian kid with short blond hair; Jeremy, a tall athletic longish-brown-haired jock (not really that muscular or large in appearance); and a few others.<br>\r\n<br>\r\nWho do you choose to play on during the PE period?</span></div></div>",
            "created":1305349200,
            "id":1105945,
            "title":"Shrunken!"
        },
        "13":{
            "author_id":"grosky",
            "author_name":"Grosky",
            "choices":[
                "Yes! He looks down and sees a bug at his feet!",
                "No. He continues to get get dressed"
            ],
            "content":"<div class=\"\"><div> <span>You watched eagerly as Ritter slipped of left shoe to reveal his enormous barefoot. It was a hot summer's day and you've seen Ritter walk to school so you know that his feet must be drenched with sweat and covered in stink. You eyed the titanic foot as it descended to meet with cold concrete floor. The sides of his soles slightly expanded as he put all his weight on that foot so that he could release his other mammoth foot from the hot and sweaty shoe prison. This was your chance! Without thinking you darted at full speed toward his rooted foot. Half way there however you stopped and looked up as you felt Ritter's hard stare. You had been spotted by the giant! Does he acknowledge you?</span></div></div>",
            "created":1458709200,
            "id":2121650,
            "title":"Ritter"
        },
        "15":{
            "author_id":"noisrrah",
            "author_name":"noisrrah",
            "choices":[
                "Richard",
                "Bailey",
                "Marcus",
                "Logan"
            ],
            "content":"<div class=\"\"><div> <span>There is also Richard, a slightly larger non-athletic kid with plump toes; Bailey, a normal sized, slender boy with short brown hair; Marcus, a tallish masculine boy with short blond hair; and Logan, your best friend (who is also gay) who is tall, toned and has short light brown hair.</span></div></div>",
            "created":1305349200,
            "id":1105946,
            "title":"Someone Else"
        },
        "154":{
            "author_id":"noisrrah",
            "author_name":"noisrrah",
            "choices":[
                "He ignores the ant, he better finish changing, he's already late!",
                "He investigates.",
                "He does something else."
            ],
            "content":"<div class=\"\"><div> <span>You can see Logan's heels from where you are standing. He is obviously sitting on the bench above you. You run towards the front of his feet which are firmly planted on the floor. You were now standing in between them. you stared at the arch of his right foot. God his feet were perfect!<br>\r\n<br>\r\n\"What id he doing?\" You thought. \"Why is he just sitting there?\" You look up past his legs, gym shorts, and chest and see him eyeing Marcus, who is changing next to him. \"Cute,\" you thought. \"Well at least he can't notice me!\" You look back down at his right foot. As you went in front you drooled at the sight of his toes. They smelled extremely strong. You couldn't take it any longer! Suddenly you noticed Logan stared wiggling his toes. You remembered Logan wiggles his toes when he gets aroused. Boom boom boom! Your crush's warm, meaty digits smashed against the cold concrete floor. This was your chance to get under his toes! As Logan's middle toe lifted up, you dashed under it, crashing into the ball of his foot. Suddenly, possibly in response, the wiggling stopped as the giant toes lowered. \"Damn ants.\" you heard a voice mutter from above.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nAs Logan began to change, he couldn't help but notice Marcus was wearing a much tighter underwear as usual. He began to stare at Marcus's hot bulge. Suddenly, he felt a light thud against the ball of his foot, distracting him from Marcus.<br>\r\n<br>\r\n\"Damn ants.\" Logan muttered. Ants had a habit of crawling between his toes, perhaps they thought there was food?<br>\r\n<br>\r\nWhat does Logan do?</span></div></div>",
            "created":1305349200,
            "id":1105979,
            "title":"Logan"
        },
        "1541":{
            "author_id":"noisrrah",
            "author_name":"noisrrah",
            "choices":[
                "Jogging",
                "Sit-Ups then Free Play (he'll just sit around)",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>You surveyed your surroundings, you seemed to be under his middle and second-smallest toes. His foot-flesh was soft and sticky as usual. There was a bit of toejam smeared all over the toe area, but not too much since Logan almost never wears socks. The stench was strong, but you knew all too well that this was not even close to what Logan was capable of. You couldn't wait to find out what's in store. <br>\r\n<br>\r\nSuddenly you feel his toes squeeze you. \"That should be enough to kill it.\" Logan sneered.<br>\r\n<br>\r\n\"Sorry Logan, but your resistance is futile! You're soft toes are all mine now!\" You yelled, of course, Logan couldn't hear it. You then felt his foot lift up as you became suspended in air. You guessed right. You didn't fall, you just stuck, wedged between the boy's sticky toes. You watched as you were lowered into his worn grey skater shoes. You smiled as his toes nestled in the indentations they once left and the end of the shoe. You can't believe it. You always wanted to be in Logan's shoe. He doesn't even know you have a foot fetish, you never told him, because you were afraid he would think you are weird. You used to \"play\" a lot of different things with him, but never with his feet. The only time would be while he was sleeping. It was then when you would sniff his toes for hours. And now you are in his shoe, in between his toes! Suddenly you felt Logan starting to walk. It was a good thing his toes were soft, because you had a massive boner poking into his toeflesh, which rather than hurting your dick, simply rubbed up and down on it with each step. You began to cum all over his toes.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nLogan squeezes his toes. That should be enough to kill the ant. He quickly forgets of it as he puts on his shirt and sneakers. He then goes outside.<br>\r\n<br>\r\nWhat is the assignment for today?</span></div></div>",
            "created":1305349200,
            "id":1106011,
            "title":"He ignores the ant, he better finish changing, ..."
        },
        "15412":{
            "author_id":"noisrrah",
            "author_name":"noisrrah",
            "choices":[
                "You are able to climb back up.",
                "You stay at his arch."
            ],
            "content":"<div class=\"\"><div> <span>You climaxed all over logan and then relaxed in the heavenly mixture of Logan's footsweat and your semen. You hugged his toe and kissed it, while saying \"I love you Logan.\" Shortly after, you can feel his feet getting hotter. He must be doing exercises. As the heat increases, Logan's beautiful long tan-white toes turn a pulsing red and sweat begins to pour out of his feet. After that everything seems to turn around as his foot was no longer planted on the ground, but pointed upwards. To make it worse, the burst of sweat made the once sticky toes quite slippery, and consequently you slipped and fell down from Logan's toes down to his arch. You looked up and saw his massive toes perched at the top of his foot. How will you ever get back up there? I might get crushed down here!<br>\r\n<br>\r\n***<br>\r\n<br>\r\nAs logan started his sit-ups, he felt a warm sensation beneath his toes on his right foot. He ignored it as he himself became very warm as he performed the sit-ups. When the exercise was over, he laid down chest up on the grass with his feet pointed upwards.<br>\r\n<br>\r\nDo you get back to Logan's sweaty toes?</span></div></div>",
            "created":1305349200,
            "id":1106030,
            "title":"Sit-Ups then Free Time"
        }
    },
    "info":{
        "author_id":"noisrrah",
        "author_name":"noisrrah",
        "brief_description":"You decide to have some fun with the giant boys at your school.",
        "created":1301461860,
        "description":"<td align=\"left\" class=\"norm\">You are a 14 year old kid with a gay foot fetish named Alex. One day, you figure out how to shrink to half an inch tall. A bit horny, you decide to take advantage of your size and the boys at your (all boys) school.<br>\r\n<br>\r\nA Few Things To Keep in Mind:<br>\r\n-You cannot grow any larger<br>\r\n-Only Male/Male Interactions<br>\r\n-All Giants Are Unaware OR Think You Are a Bug<br>\r\n-You Are Indestructible (But Can Get Lightly Hurt)<br>\r\n-All Interactions Except Poop/Scat/Farts Is Allowed</td>",
        "id":1763646,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1458749220,
        "modified":1458749220,
        "pretty_title":"Shrinking With Unaware Boys"
    }
}