{
    "chapters":{
        "1":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Alliance",
                "Horde",
                "Pandaren"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alliance, Horde or Pandaren?</span></div></span></div>",
            "created":1348549200,
            "id":1434598,
            "title":"Faction?"
        },
        "11":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Human",
                "Dwarf",
                "Night elf ",
                "Gnome",
                "Draenei / Worgen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What race?</span></div></span></div>",
            "created":1348549200,
            "id":1434600,
            "title":"Alliance"
        },
        "111":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Growing female",
                "Shrink to female",
                "Growing male/Shrink to male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose what is more suitable to your liking below</span></div></span></div>",
            "created":1348549200,
            "id":1434606,
            "title":"Human"
        },
        "112":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Female grows",
                "Shrink to female",
                "Male grows/Shrink to male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The short little dwarves aren't going to be the short ones for long...</span></div></span></div>",
            "created":1348549200,
            "id":1434608,
            "title":"Dwarf"
        },
        "113":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Female grows",
                "Shrink to female",
                "Male grows/Shrink to male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Night elves? Pick what you want below</span></div></span></div>",
            "created":1348549200,
            "id":1434609,
            "title":"Night elf "
        },
        "1132":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Alliance (Nice Night Elf)",
                "Horde (Mean Night Elf)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you on the Alliance or Horde shrinking down to a night elf?</span></div></span></div>",
            "created":1356846900,
            "id":1497803,
            "title":"Shrink to female"
        },
        "114":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Shrink to female",
                "Female grows",
                "Growing male/shrinking to male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>That little gnome won't be the smallest for long...</span></div></span></div>",
            "created":1348549200,
            "id":1434603,
            "title":"Gnome"
        },
        "115":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Draenei female grows/Shrink to female",
                "Worgen female grows/Shrink to female",
                "Draenei male grows/Worgen male grows"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one? Pick below</span></div></span></div>",
            "created":1348549200,
            "id":1434613,
            "title":"Draenei / Worgen"
        },
        "1153":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Draenei male grows",
                "Worgen male grows"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one? Pick below...</span></div></span></div>",
            "created":1356066000,
            "id":1492434,
            "title":"Draenei male grows/Worgen male grows"
        },
        "11532":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Accident",
                "On Purpose"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does the worgan male grow?</span></div></span></div>",
            "created":1356325200,
            "id":1493885,
            "title":"Worgen male grows"
        },
        "115322":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Growing spell",
                "Volitile Energy (Makes anything happen)"
            ],
            "content":"<div class=\"\"><div> <span>Our story begins when a male worgen by the name of Jake grows tired of the the Alliance's battle strategies. Jake is a grey furred worgen currently on a base camp in the Northern Barrens. His commanders plans to over throw the Horde's base seems so stupid he wants to kill his commander for being so stupid. At the time where we begin, Jake is laying in his tent a base reading a spells book hoping to find something...<br>\r\n<br>\r\n\"Hmm interesting stuff...\" mumbles Jake, tired but determined to find something. Jake has been at it for an hour and decided to call it a night, \"Alright... I'm going to look at one more page or two before I close this thing...\" Jake thinks to himself. He flips the page and a spell catches his eye.</span></div></div>",
            "created":1356325200,
            "id":1493891,
            "title":"On Purpose"
        },
        "1153221":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Jake wakes up and gets to work",
                "Jake wants to sleep and dream some more"
            ],
            "content":"<div class=\"\"><div> <span>\"I like this this...\" Jake mumbles tired but inspired but the spell of growth. The page displays a human picture multiple times beside eachother but bigger each time. \"This isn't too hard to make either, I think I'll do it...\". Jake the. Turns over and goes to sleep eager to begin the growth spell in the morning.<br>\r\nAs Jake sleeps, he dreams of his camp only down to his feet and crushing his own allies and the Horde. Jake for some reason was getting turned on when he dreamed of small people on his penis, under his balls, between his toes, in his belly button, in his belly,mouth, but what got Jake very horny was seeing then beg for mercy and he stuck them up his butt and into his hole and laughed.</span></div></div>",
            "created":1356325200,
            "id":1493895,
            "title":"Growing spell"
        },
        "11532211":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Starts playing with people on his package",
                "Starts shoving people up his butthole that are in sight"
            ],
            "content":"<div class=\"\"><div> <span>Jake never liked his commander and allies at the camp anyways. He woke up and eagerly smiled and mumbled \"Fuck them I'm going to destroy everything here!\". He collected the required items to allow the spell to grow the user. Jake casts the spell and tingles all over. The grey worgen Jake roared and caused every Alliance soldier in the camp to look over confused. Jakes clothes rip off and he grows and grows and grows. He looks pissed and gets a boner that immediately rippes through his shirts and rip then off exposing his big 2 feet boner that keep growing with him. People are running and don't know what to do. Jake is naked and now 70 feet tall and kicking over tents, unleashing the giant beast within.</span></div></div>",
            "created":1356325200,
            "id":1493900,
            "title":"Jake wakes up and gets to work"
        },
        "12":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Orc",
                "Goblin",
                "Blood elf",
                "Troll",
                "Tauren / Undead"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What race?</span></div></span></div>",
            "created":1348549200,
            "id":1434601,
            "title":"Horde"
        },
        "122":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Shrink down to a female",
                "Female grows",
                "Male grows/shrinks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens?</span></div></span></div>",
            "created":1356152400,
            "id":1493214,
            "title":"Goblin"
        },
        "1221":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Your a Goblin",
                "Your a Gnome"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a goblin or gnome?</span></div></span></div>",
            "created":1356804000,
            "id":1497395,
            "title":"Shrink down to a female"
        },
        "12211":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "You pass out and awake shrunk (VERY small)",
                "You shrink right there (small but not too tiny for big fun)"
            ],
            "content":"<div class=\"\"><div> <span>Her name is Carly Copperbolt. A Brunette goblin with a passion for tInkering with eletronics. She is your girlfriend. You are a male goblin that goes by the name of Stan Silverwrech. You and Carly have been dating for a year now and when you 2 spend \"alone time\" you 2 make out a lot in her basement lab and Carly loves It when you kiss her buttcheeks, lick her belly button or kiss her a lot. Now this is where your story begins, Carly wanted to show her latest invention alone in her basement lab...<br>\r\n<br>\r\n\"Come on Stan! God you slow!\", giggled Carly sprinting to her basement lab gripping onto you hard. \"This better be good, I'm missing a day of pay for this sweetie\". \"It'll be worth it I promise...\". When you 2 arrive she grabs a strange looking red laser pistol and unexpected fires a blue beam at you!</span></div></div>",
            "created":1356804540,
            "id":1497402,
            "title":"Your a Goblin"
        },
        "122111":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Laying in Her belly button (1cm tall)",
                "Laying between her huge plushy lips (1mm tall)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where do you awake? (Upcoming chapters, your VERY small)</span></div></span></div>",
            "created":1356804960,
            "id":1497412,
            "title":"Where do you wake up?"
        },
        "1221111":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Wants you back in her belly button",
                "She plays with you with her massive toes"
            ],
            "content":"<div class=\"\"><div> <span>After you were fired upon, everything was spinning. It became too much and you dazed got knocked out. When you awoke, you were very toasty laying in what looks like a very warm green flesh pit and you can see the way out is over green walls. You hear grumbling noising like a stomach and you find it weird. \"Where the hell am I?\" you speak aloud unsure if anyone can hear you. \"Take a guess!\" echoed Carly's voice. You don't know, all you see is a warm flesh green pit that is too high to climb out of. \"Carly where are you!?\" The lot jiggles like an earthquake, \"Everywhere...\", \"This ain't funny!\" \"I hit you with a shrink ray so our \"fun\" can be extra speacial this time!\". \"I honestly can't find you, where...?\" \"Stan... It's gonna shock you but this \"pit\" your in is my belly button!\". \"WHAAAT!?\" you run and jump up to the ledge and barley climb out and gasp to see your standing on your Godly sized girlfriend. \"Carly babe, your so... Big...\". \"Oh Stan, I'm not gonna hurt ya, your only 1cm tall anyways, we're gonna have fun with your size...\". Carly smiles and then...</span></div></div>",
            "created":1356848220,
            "id":1497823,
            "title":"Laying in Her belly button (1cm tall)"
        },
        "122112":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Half her height",
                "Size of her foot (Around 30cm)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How small do you shrink?</span></div></span></div>",
            "created":1356804720,
            "id":1497405,
            "title":"How small do you get?"
        },
        "1221121":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Your in the mood for some butt fun",
                "She wants you to make out with her and kiss her belly button some more"
            ],
            "content":"<div class=\"\"><div> <span>Stunned, confused and temporarily blind you try to focus. \"What the hell did you do Carly?\". About a minute later you hear your girlfriend's voice coming from above you and yu can finally see again. First thing you see is a very big green belly button in your face and you look to see if Carly in her bra and panties. \"Woah babe... I...\", Carly giggles and you see her belly in your face jiggle as she laughs \"told you you'd like it! Now we can have more fun and I bet it's heaven for you now that I'm twice your size!\". You reach your arms around her and grab her ass, her buttcheeks are massive. \"I shrunk ya with my latest invention but don't worry I can controll the size change and grow you when we're done...\". You squeeze her ass and look up to see Carly smiling down at you, completely towering over you. You lick her belly button likes she likes and she laughs, obviously loving it. Then as she gazes you turned on, you pull your face around her and kiss her big right buttcheek which is twice the size of your face. Carly grabs your small body and pulls you in for a big kiss. Her lips are huge compared to your face. They are very soft, and cover your mouth, nose and your cheeks with a kiss.\" Carly sets you down looking horny. \"Babe this is heaven...\" you mumble. \"Well my little guy, where do you want to start?\".<br>\r\n</span></div></div>",
            "created":1356826920,
            "id":1497640,
            "title":"Half her height"
        },
        "12211211":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "\"What if I want to go in your butthole then Carly?\"",
                "\"I should make out with her for a bit and make her more horny...\""
            ],
            "content":"<div class=\"\"><div> <span>You look up to her with a huge boner. Not many guys get a chance to \"play\" with their girlfriend giant sized. \"I think I know honey...\". Carly doesn't question you but replied but a \"Ooooh...\", when you keep a grip to her weist and move around her so your beind her and now are face to face with her green bubble butt that jiggles every step Carly takes. You smooch her buttcheeks and Carly moans in pleasure. She places her hands on your head and pushes you harder againest her buttcheeks. \"This will make it easier babe\" Carly moans and winks down to you. She pulls down her panties and your speechless as you continue smooching her bare big ass. Carly the. Laughs down at you. \"What's so funny? Can't I enjoy smooching my sweet baby's arse?\". Carly smiles, \"kiss my ass Stan, literally get in there!\". \"Even better!\" you reply. You spread Carly's buttcheeks and reveal her big green butthole. It smelt bad but very arousing. You planted your face in and licked, smooched and made out with her butthole. Carly suddenly put her weight in you and you fell backwards onto the red carpet floor with nothing but her butthole in your face. \"Like this?\" Carly says as her butthooe opens and farts in your face. It smells bad. \"That smells Carly!\" you yell. Carly sitting on your face giggles, \"At least your not actually in my butthole Stan its worse there so suck it up!\". Carly's words made you even more horny, you continued to stare into her butthole and think...</span></div></div>",
            "created":1356828120,
            "id":1497647,
            "title":"Your in the mood for some butt fun"
        },
        "122112111":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "\"Nope, shove me up there I'll be fine\"",
                "\"Alright, just to be safe...\""
            ],
            "content":"<div class=\"\"><div> <span>When Carly said \"At least your not IN my butthole\", it gave you an extremly dangerous thought. What if you actually were? Would it be that bad? She is your girlfriend and wouldn't harm you, it's warm and the smell is something you can put up with. You feel brave enough to do it. \"Hey Carly?\" You call out still being face sat by your giant girlfriend, \"Yeah?\", you asked in a smart ass tone, \"What if I want to go in your butthole?\". Carly sounds excited, \"You like my butt that much Stan? I don't know... Are you sure? How about you start as my buttplug and see how that goes?\".</span></div></div>",
            "created":1356834960,
            "id":1497708,
            "title":"He wants to go up the butt"
        },
        "1221121111":{
            "author_id":"bearuncle",
            "author_name":"JSJ",
            "choices":[
                "Is Carly  still in the mood and wants you to go deeper?",
                "What's Stan's POV is here the pressure master?"
            ],
            "content":"<div class=\"\"><div> <span>\"Carly\", you say as you start to lick here butthole that takes up your entire view. Carly just can't take it and lets out a little moan. \"Okay my little hot rocket have it your way, lets load you up my launch tube.\" You shout \"Oh hoah! Yeah baby that's what I like to herrgmm?!\" Carly puts here magnificent rump to work pushing it down on you. She grabs as much of here cheek flesh as she can and you start to see her love canal open. Your eyes widen as your face is thrusted up in there. You can here your girlfriends lustful moans as you start your entry. <br>\r\nYour mind wonders with thought you can hardly believe what is happening. The sight of here green flesh all around the sounds of her slurping you up. The touch of here wet squeezing flesh the sudden rumbling...wait. Pffftt foul gust of wind passes by you! Carly giggles as she just farted on you. As your body is getting slurped up here behind. \"So it still as good the second time Stan?\" Your Muffled Voice still able to be herd \"yes I think so.\" Carly after taking a breath and getting back shoving, now grasps you and pulls you in deeper. Up to your chest now you start to do everything you can to pleasure this wonderful ass.<br>\r\nCarly can't take it and starts to finger her self. You suddenly feel your everything around you change as Carly moves and gets on her hands and  knees. Your body now half in her asshole the other dangling out. Your hard dick is rubbing up against here. You can here her voice again saying something but not sure what. \"Carly what are you saying?\" Carly reply's \"mmme\" Everything around squeezes more and you feel here ass tighten and your member get slowly swallowed  \"Woah what?\" \"Mmmree\" You start to lick and thrust your dick into Carly's asshole. Carly suddenly shouts \"MORE!\" As her ass opens wide and swallows more of you in and closes up tight! Carly screams \"More! More oh holy god more!\" Carly's asshole opens and swallows more of you in up to your feet! You climax as this happens. \"Oh Stan my little rocket get all the way up there.With one fine squeeze you feet shoot up in there all this sudden activity cause Carly to fart again! Carly on the edge of climax doesn't even care farting couple more times and Oh my dirty little Stan I'm just about to oooohhh yea cumming on to the red carpet and laying down she giggles a little after that sudden one more little fart squicks out \"Wow Stan you know how to let the pressure out of my valve.\"</span></div></div>",
            "created":1421578800,
            "id":1919512,
            "title":"\"Nope, shove me up there I'll be fine\""
        },
        "124":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "You wake up in a forest",
                "You wake up in Sen jin village in a tent",
                "You wake up along the beach"
            ],
            "content":"<div class=\"\"><div> <span>You are an adventurous human that goes by the name of Jack, you are a warrior adventuring into Durotor south.<br>\r\nAs you ride your mount of a white ram you recently purchased after becoming exaulted with Ironforge, you suddenly set off a trap In the sand that throws you off your ram and injured. Your knee is bleeding and kills. You look around to see a blurry blue figure approach and when it gets close enough it clubs you hard and you pass out.</span></div></div>",
            "created":1356152400,
            "id":1493223,
            "title":"Troll"
        },
        "1242":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Sasha starts growing",
                "You shrink"
            ],
            "content":"<div class=\"\"><div> <span>Your sight returns as you regain consciousness. \"What do we hav eer?\", speaks a female troll. She has braided blue hair that brushed behind her, yellow eyes, short tusks. She wore Brown what looks like a bikini made of skins. You noticed she's sweating from the sweating from the heat and once you get a glimpse of her sweating big blue booty that is jiggles as she walks you can't help but feel turned in a little. She had a face too pretty to be considered just another smelly monsterious troll. \"Why iz a hooman eer in Durotor?\". You remain silent and notice you are tied against a metal pole in the tent with your arms and legs... Your not going anywhere. \"Hooman dis your lucky day, Ya see I don leik usin violence, and I need a test subject foe ma voodoo. Your gonna be a good boy and help me...\" As she talks on her heavy accent she strokes her hand on your face and you disapprovingly give her a dirty look. \"We gonna have a good time Hooman and since I found ya I get ta keep ya! Ma names Sasha Volminsha and ya gonna do wonders for me...\" Suddenly Sasha casts a spell on your and you and the green energy that hits you reflects back to her. She screams in pain although you didn't know how you reflected the spell. \"Sometin funny is gonna happen mon I feel it, and you gonna get it!\".<br>\r\n</span></div></div>",
            "created":1356152400,
            "id":1493240,
            "title":"You wake up in Sen jin village in a tent"
        },
        "12421":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "15 to 60 feet tall",
                "1000 feet tall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How big does she grow?</span></div></span></div>",
            "created":1356152400,
            "id":1493243,
            "title":" She starts growing"
        },
        "124211":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "15 feet tall",
                "60 feet tall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How big does she grow exactly?</span></div></span></div>",
            "created":1356411600,
            "id":1494467,
            "title":"15 to 60 feet tall"
        },
        "1242111":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "She smothers Jack with her huge sweating booty",
                "She rips a HUGE fart in his face"
            ],
            "content":"<div class=\"\"><div> <span>Sasha looks pissed, sweating and glowing with green energy. She's shaking in which is making Jack terrified of what she'll do. Sasha falls to the ground onto her ass. \"Wait... Dis is powerful voodoo mon, jus dunno how to controll it\". Sasha gets up sweating and the glow fades into her and her eyes glow with shocking amounts of green energy. \"Danks for knocking me onto ma butt mon, I have someting in mind sat will get us even\". Sasha spreads her arms and all Jack can do is watch as he cannot move. \"Watch as da voodoo blesses me mon!\" Jack started struggling to get free as he knows this is not good... Or is it? Sasha releases the energy and her size starts rapidly Increases slowing. Her top and bottoms rip off. As terrified as Jack was, he was hard static at a hot sweating naked troll growing, he loved how much her bubble butt jiggled as it ripped from the small bottoms. Sasha stood beautiful at 15 tall and she walked into Jack tied up so all he can do is be face planted into her sweating belly button. \"Now to get even for knocking me on to my butt mon...\"</span></div></div>",
            "created":1356411600,
            "id":1494471,
            "title":"15 feet tall"
        },
        "12421111":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Jack doesn't know how to repeat what he did so she can't grow",
                "Sasha grows"
            ],
            "content":"<div class=\"\"><div> <span>\"I didn't even do anything! I don't know how I did any of that voodoo stuff...\". \"Excuses mon excuses, you tried to hex me mon and I durned it found and now ya see I'm pretty damn big eh mon?\" Sasha turns around, revealing a big blue sweatIng booty that jiggles in Jack's face. \"Ya know mon, I like being big, if ya figure out how ya did this in da first place, I might let ya go if you can make me very big... Now since ya knocked me on ma booty, your gonna have to spend time with it!\". Sasha bends over in Jack's face. Jack gets a hard boner as Sasha giggles and spreads her cheeks and site on his head with Jack's face forced between her cheeks to be face to face with her butthole. Her butthole was open wide, Jack could smell her asshole sweat and it smelt bad of fart. As bad as it was, Jack was enjoying it, the smell gave his boner another push, he felt the sweat inside her warm blue cheeks reach his face as her sweat now ran down his face. All jack could see was blue flesh sweating walls, her butthole was open so wide Jack could see pretty deep into her rectum and even hear sounds of wind coming further up her rectum. Suddenly Jack could hear Sasha's voice out from the walls of her massive butt cheeks, \"You enjoying yourself hooman? That little rod coming from your shirts says so\" then she giggles. \"I can do this for a while mon better keep standing!\" your weight was out on Jack and her butt came closer to his face, he was only millimeters from her butthole. \"I'm lovin bein big mon, you should make me bigger!\".</span></div></div>",
            "created":1356411600,
            "id":1494501,
            "title":"She smothers Jack with her huge sweating booty"
        },
        "124211112":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Continue butt fun",
                "Sasha keeps growing!"
            ],
            "content":"<div class=\"\"><div> <span>\"I don't know how I supposedly made you grow Sa...sha?\". \"Ya mom you got ma name right\", \"I don't even think I want you bigger even if I could! I'm a prisoner and Alliance, while your on a the Horde!\". Sasha giggles and Jack's blue walls jiggle and feel soft on his face, \"Don't you like ma booty mon? Don't you want it bigger?\". Jack is disappointed as she gets off him and he longer sees her beautiful, smelly butthole that he got a boner from. \"I like it I admit but I'm tied up and a prisoner so no\". So Jacks surprise Sasha rips off the ropes easily and Jack is able to move again. \"There mon, you no prisoner, now why not have go back to where you loved?\" Sasha smiled, turns around, slaps her booty till it jiggles like crazy and sweat rolls down. She uses her hands to spread her cheeks revealing her big smelly butthole Jack loved. Jack freely walked to Sasha and threw himself into her butt. He squeezed her cheeks and put his nose into her butthole to savor that smell of arousing gas. Sasha giggles and appeared just as horny as Jack. \"Thanks mon, I feel it... The voodoo spirit of your giving into her mine!\". \"What are you talking about?\", questioned Jack but had an answer when Sasha moaned in pleasure and grew slowly to 25 feet tall, she ripped through the ceiling of her tent and Jack feel from her butt cheeks laying on a tent floor staring up confused and shocked. Slowing he gasped as she ripped off the tent roof with her hands and picked up Jack with 1 hand. She smiles at him, Jack knows he isn't going to be hurt at all.</span></div></div>",
            "created":1356490800,
            "id":1494576,
            "title":"Sasha grows"
        },
        "1242111121":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Jack asks Sasha if she wants to be bigger",
                "Jack anals Sasha"
            ],
            "content":"<div class=\"\"><div> <span>Jack felt shocked and unsure how to react or feel that he somehow caused Sasha to grow into a giantess. The tent was down to Sasha's knees and she stood naked, sweating, holding Jack at 25 feet tall. As Sasha spoke she voice echoed and seemed more deep than what it was, \"Oh hooman, good thing were the only ones eer. I didn't think you would do what I want but since you listened and obeyed me I will reward and spare you\". Jack signed a relief cause this giant troll layer is so damn big she could crush him with no effort! Sasha laid on her stomach and stretched across the small Sen Jin village. \"Hooman what is your name?\" \"Un... Jack Sasha...\", \"Alright Jack, since you ware so kind ta be nice to me, you are no longer a prisoner but a guest, you can resume where you left off\". Jack was unsure what she meant until she giggled, smiled and placed him in her butt cheeks. Jack was in heaven, he laid between 2 sweaty big blue butt cheeks and the smell was very strong. Jack put his face to her butthole to see it open big enough to almost sqeeze his head into. Jack licked the base of her rectum and he could hear Sasha moan in pleasure. Her butt was now so big, his whole body fit between her cheeks, Jack is now actually so hormy for Sasha he wants her bigger...</span></div></div>",
            "created":1356502140,
            "id":1494675,
            "title":"Continue butt fun"
        },
        "12421111211":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Sasha grows 50 feet tall",
                "She gets her wish, Sasha grows 500 feet tall"
            ],
            "content":"<div class=\"\"><div> <span>Jack can't put his head into her butthole but his face can fit and he did it. He savored the moment as when he did it, he could hear nothing but loud winds coming deep inside her rectum. Inside her rectum it smelt horrible but arrousing, the walls were wet and Jack could not see any crap anywhere. At first he was embarrassed by this troll and he came to love what happened. He loved her big blue ass so much he now never wants to come out of her butt cheeks. Sasha just continued moaning, aware of Jack trying to get into her butthole. Jack was suddenly pulled out of Sasha butt cheeks and she pulled him to her face as she laid on her stomach. \"Lil Jack, you seem ta really enjoyin it back dere\", Jack knew it was true, he had no idea he could love a butt so much, he was so horny for it, he actually wants Sasha bigger. \"I love it...\" replied Jack lost in thought fantasizing Sasha growing again. Sasha replied with a smile, \" This might be pushing it mon, but I know you were in my butthole, if ya make me bigga, you won't have to even squeeze\". Jack was turned on so bad he asked her, \"How big do you want to be anyways? And why do you like being big and let me have my fun in your butt?\". Sasha stroke Jacks black hair with her huge finger, \"Oh Jack, I like being big cause it makes me feel good mon, I like feelin powerful and nothing out of ma reach..., i like ya back dere, feels good and I love the feelings of ya and it makes me feel good that you love it too...\", \"How big did you want to be?\". Sasha gave a devilish smile, \"huge mon, huge, I want ta be REALLY big mon, HUGE!\". Jack was nervous and unsure, he doesn't want her to be towering giant, just a little bigger to get in her butthole. \"Let's go outside this place Sasha, I'll see what I can do...\". \"Really? Ya gonna make me more happy?\", Jack smiled a little, \"Ya\". Sasha got up and held Jack and walked them out if the village, she put down Jack and said \"Do your thing mon\".</span></div></div>",
            "created":1356547200,
            "id":1494949,
            "title":"Jack asks Sasha if she wants to be bigger"
        },
        "124211112112":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Sasha squats over Jack and Senjin village to release a hurricane like fart",
                "Sasha grows to from a massive 500 feet tall to a devastating 10,000 feet tall"
            ],
            "content":"<div class=\"\"><div> <span>Jack is unsure what to do to make her grow, \"Alright, here goes nothing! Cast that spell again...\", Sasha brought out green energy and fires a spell at Jack. He felt so energetic and couldn't controll the rush, he aimed the rushing energy at Sasha and released it. It hit Sasha and Sasha looked not well. She got up with dirt on her sweating naked body. \"It's good mon, you put more than I thought into that 1, I can controll it, but it will be a big one!\". Sasha glowed with green energy and her eyes glowed green. \"Mon ya really made me happy, I'm gonna be HUGE!!!\". Jack gasped as she screamed in a battle cry and her size increased fast. She grew and grew and grew and grew and grew until Jack in fear ran at her massive 100 feet tall size. She was so big he began to run as her toes were approaching him at the size and while he ran, he looked up to see Sasha was towering the sky, she was 250 feet tall and hr toe was the size of a football field. Jack thought it was done but looked up to see she stopped and her size doubled from that. Her foot was 50x the size if a football field. Jack thought she forgot about him until she knelt to see him. \"Jack no one is around to see, the trolls have gone to Pandaria and Northrend to assist the Horde, how can I repay you for making me this huge? Actually...\" Jack's boner came back as her voice echoed big and everywhere as she giggled and spread her godly sized buttcheeks. Her butthole was the size of 10 football fields. Jack was speechless and kept staring. \"You can live in ma butthole, you earned it, I'm gonna shove this whole village up dere so can should be fine... But first...\"</span></div></div>",
            "created":1356548100,
            "id":1494983,
            "title":"She gets her wish, Sasha grows 500 feet tall"
        },
        "12422":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "5 inches tall (penis size)",
                "1 mm"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How small do you shrink?</span></div></span></div>",
            "created":1356152400,
            "id":1493244,
            "title":"You shrink"
        },
        "124221":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "She wants to play with you on her buttcheeks",
                "She wants to play with you inside her buttcheeks"
            ],
            "content":"<div class=\"\"><div> <span>Sasha looks pissed, she approaches you slowly but something is different. She giggles and puts her hands on your shoulders in a way like she's trying to push you down or for a kiss. \"Spirits not amused mon, but don't worry, we gonna have a good time...\". \"What kind of good time?\" you ask. Suddenly it happens, your size is decreasings and as you shrink slowly Sasha just stated at you smiling with ideas. Suddenly you stop shrinkIng once you are exactly half her height. Your corner and your face in her sweating belly but you got hard when Sasha said \"Lick it mon...\". You licked her belly button and enjoyed it. Sasha giggles and tells you to sit. \"Let's get starts lil hooman\", Then Sasha smiles and removes her top and turns around to you revealing her big sweating bubble butt. She giggles, slaps it and you watch in joy as it jiggles, then she removes her bottom, now she is completely naked. Once you enjoying the sight, you realized you shrank down to her knees sitting down and now you around 2 feet tall. Sasha walks back over to you<br>\r\n(POV) Your jaw dropped as she towers above you sweating and naked. \"Hooman do as I say and ya won't get hert.\" You thn shrunk fast to around 5 inches tall. Sasha was giant compared to you and even her foot right in front of you was bigger.</span></div></div>",
            "created":1356238800,
            "id":1493363,
            "title":"5 inches tall (penis size)"
        },
        "124222":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Start rubbin mon!",
                "You Ain't Small Enough Hooman!"
            ],
            "content":"<div class=\"\"><div> <span>The ropes on you cut off but you felt too weak to stand and dropped to the floor right before Sasha. You glowed with green energy and looked up to Sasha too weak to talk but then it happened. Sasha giggles your shocked to be seeing her and the room grow and grow and you shrink very tiny. Once you stopped you were no more than a mm tall. You were so small an ant was bigger than you! You looked to Sasha to see her foot inches from you was like the size of a mountain. \"Oh hooman, I can't believe how lil you are\". Sasha sat down but it was an earthquake to you. She removed her cloths and smiled looking at you. You were so tiny compared to her her pussy was a the size as the great divide the west if where you were. \"You are gonna be lil toy and I don care if ya like it or not\". Sasha then laid on her stomach and picked you up on and placed you on a buttcheek. It jingled as you stood, sweating and the size of Stormwind city, you were loving it. \"Mon you get a chance to do as I sai or I make ya, now go to da middle\". You walked still silent cause you were in shock but it was also heaven, especially when you made it her crack and Sasha spread her cheeks. You were looking down at a sweating big blue butthole that was opened up the size of a circle arena you once fought in with your friend, around a radius of 10m, so her butthole opened up to you is around 20m, in which you can easily go in but at your size it would be death.</span></div></div>",
            "created":1356238800,
            "id":1493366,
            "title":"1 mm"
        },
        "13":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "Shrinking down to a female",
                "Growing female",
                "Shrinking to a male",
                "Growing male",
                "Both grow/shrink?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The new Pandaren race? Pick what you want</span></div></span></div>",
            "created":1348549200,
            "id":1434602,
            "title":"Pandaren"
        },
        "131":{
            "author_id":"awesomeghost",
            "author_name":"awesomeghost",
            "choices":[
                "(2 and a half feet) Half her height, you wake in a bed with her there",
                "(6 inches) you wake up in the palm of her hand",
                "(>1 inch) size of an ant or smaller, you wake up in her belly button"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Cruspher, a dark spear troll. You have spiked wind swept blue hair, tusked and a veteran in battle for the Horde. Now your story begins at the Shrine of Two Moons. It has been about 2 months since the mists have departed. While you helped the various factions of Pandaria you met a cheerful Pandaren named Chastie. Chastie and you met after you rescued her from the yun gol invasion in the north and talked. You 2 had a lot in common and traveled the rest of Pandaria together as good friends, but unsure where your relationship would go as you 2 are different raced.<br>\r\nYou are wandering the outside of the Shrine of Two Moons where your good friend Chastie excited charges at you with a keg. \"What's up?\" You ask her, \"I finally perfected my brew just to match you!\". \"How thoughtful! But we should enjoy it together ya know cause you made it...\". Chastie's big cute brown eyes eyes you in a way that told you from experience she was up to something. \"Sure but let's drink it outside in the fields it's a beautiful sunset\", \"Sounds like a plan!\". You stand up and the 2 of you walk into the vale. Chastie pulls out a beer mug and fills it. \"Enjoy it!\", \"What about you?\", \"I want to witness you loving it first!\". Chastie bad a huge cute grin on her face that you couldn't let down. \"Okaaaay...\". You look to the fizzing blue beer and gulp it down. Suddenly Chastie giggles and backs away from you. Your vision is flashing colors and you struggle to keep your eyes awake. \"What was in the brew?...\", before you black out your only sight is Chastie looking a lot taller walking towards you. Where do you wake up?</span></div></div>",
            "created":1366260360,
            "id":1574048,
            "title":"Shrinking down to a female"
        }
    },
    "info":{
        "author_id":"awesomeghost",
        "author_name":"awesomeghost",
        "brief_description":"Those who play wow and like the racial's butts a little too much, this is for you!",
        "created":1348551660,
        "description":"<td align=\"left\" class=\"norm\">This story is only for those who likes giantess or shrinking tales and booty. This story takes place in Azeroth as you shrink or witness a racial grow into giantess. Rules are basic with the title, anal vore is the main focus but everything else is accepted. Please stay focused around the butt, butt crushes are lovely along with smothering. Do not hold back with your writing, if you want to add please do! Don't worry about your mistakes for grammar cause I will correct it if I notice errors.</td>",
        "id":1893506,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1421578800,
        "modified":1421578800,
        "pretty_title":"World of Warcraft Anal Vore"
    }
}