{
    "chapters":{
        "1":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "After the fall",
                "The following morning in class",
                "A few hours later",
                "It lives",
                "They found her"
            ],
            "content":"<div class=\"\"><div> <span>Kaede Einfield shivers as it began to rain stealthily, she pulls her poncho across her back as she crosses the graveyard. Sure, skipping class was worth it, but was it worth taking a short-cut through a burial ground..? After all, months earlier, there were suspicious recounts of murder piling up recently, and not only that, a Fendrick she knew earlier had been accused of delibrately setting things up, but as it stands everyone still wasn't sure as to HOW it occurred. It just did. They never found the missing bodies, but wild tales had cropped up about alien adbuctions and even stranger incidents such as the Bermuda Triangle. But Kaede wasn't the sort to believe them. Chuckling, she brushed against a plated monolith. A cold wind picks up sharply. <br>\r\n<br>\r\nAs the pale girl shudders, her long wisps of magneta hair sprawl across her face... There was movement, a subtle creeping movement as something spwaned from the depths of the earth crawls through the ground. It suddenly latches onto the frightened girl as the teenager found herself clawing at her airways, as something not quite human PUSHED its way into her. It happened so quickly, it took only a blink of two eyes as it burrowed deeper into the body.<br>\r\n\"He-l-elp,\" she gasps, just before a scream welled up and as all went dark...<br>\r\n<br>\r\n<i>I am Sector Duskbrood.</i> seethed the bubbling mass, <i>Victim Infiltration complete. Spawning phase now at 12% and counting...</i> It took time to adapt to a gravity-bound body like this...</span></div></div>",
            "created":1236661200,
            "id":658749,
            "title":"Skipping class"
        },
        "11":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Puts the parasite in the Chris Endor's windscreen",
                "Kisses Chris Endor with full intention of the parasite",
                "Federick's parasite swallows Chris whole ",
                "Xaliant comes to the rescue... at a cost",
                "Nothing happens"
            ],
            "content":"<div class=\"\"><div> <span>Chris Endor happened to be the ambulance driver who received a call from a frantic passer by. Scowling he flicked his mobile phone open and answered the phone.<br>\r\n\"'yallo? Uh. Huh. Oh great, another god-frikin' tragedy, can't Death hold the damn list for a guy like me to take a breather??\" he managed to yell at the poor person, but then the dial tone acted up and in frustration Chris stared daggers at the shiny black velcro that held the phone to the windscreen which was shattered due to stress. Chris was not happy when a police officer held him accountable for speeding and he grimaced as he stuck his pale head out the window,<br>\r\n\"Chris Endor?\" spoke Officer Federick, his shadowy longish hair obscuring the rest of his handsome face, \"You are hereby arrested for speed-\" The response was a slap in the face:<br>\r\n\"Do ya think I care about some god-friking demerit ticket?\" Chris pointed out, \"Just doin' my job here! nothing to see here! Moving along!\" The smirk was wiped off Chris's face soon enough as Officer Federick leant down.<br>\r\n\"Well, we'll see about that.\" Federick grinned nastily as he reached down and then Chris noticed that there was a yellow glint in the officer's shimmering eyes...</span></div></div>",
            "created":1280466000,
            "id":927443,
            "title":"Chris Endor and the parasite that ends all"
        },
        "12":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Ask her politely",
                "Interrupt the conversation",
                "Random gibberish",
                "Good morning, how you're feeling?"
            ],
            "content":"<div class=\"\"><div> <span>\"Morning Shuka,\" Mr. Julian greets as Shuka sits down, Shuka brushes his gray hair aside as he trips over the wastepaper basket carelessly in the corner of the room. Shuka gives an eager embarassed grin, as he apologizes for his clumsiness. As he sat down, he noticed that Kaede wasn't sitting in her usual seat. Instead she seemed to be occupied with chatting up the playboys.<br>\r\n\"... Yeah, and I was like, WHATEVER, clocks do not work that way!\" emphasizes Kaede as she emphasized the conversation topic. She seemed loud today, but the boys punch her playfully. Shuka seemed vaguely suspicious of this, it was enough to perk his interest... But he noticed Kaede's eyes had a glint of yellow to them.  </span></div></div>",
            "created":1237179600,
            "id":661609,
            "title":"What's up with HER?"
        },
        "121":{
            "choices":[
                "None of your bussiness!",
                "It's a skin condition..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Uh excuse me,\" You say. \"What's up with your eyes?\"</span></div></span></div>",
            "created":1263445200,
            "id":820260,
            "title":"Ask her politely"
        },
        "1211":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Mr Julian walks into the room again",
                "Erm, no? Shuka doesn't know... At ALL. Freaky!",
                "Kaede tries to hypnotise Shuka"
            ],
            "content":"<div class=\"\"><div> <span>Kaede immediately slams Shuka down with a comment that sounded like an offhanded snort, but her eyes lower suspiciously.<br>\r\n<br>\r\n\"Why would you want to know?\" her voice sounds like the grating of grated cheese, only more metallic and buzzing-like, \"Those matters are none of your business.\" She waves at the other boys, who were under the commands, \"You three are dismissed,\" Then she focuses on Shuka, \"So you really want to know, hotshot?\" Her smile lilts nastily, \"Of course, there's more than one way to skin a cat.\" Wait, what? Literally or metaphorically? Man, Shuka haves the worst days in history to ask her, either that or... she had a bad hair day. Yeah, that could be it?! Could it?</span></div></div>",
            "created":1263790800,
            "id":821966,
            "title":"Sinster? Or warped impression?"
        },
        "1212":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Shuka investigates further",
                "Kaede walks out of the room",
                "Spy on her"
            ],
            "content":"<div class=\"\"><div> <span>Kaede glares at Shuka momentarily as though she didn't want any interference, but she had a haughty expression as she neglected the males. \"It's a skin condition, isn't it oblivious?\" she stated, but the way she said it made Shuka suspicious. It was probably something other than the truth... \"I get really itchy eczema\" she claims weakly, but he spots a wet spot on her skin that was peeling off.</span></div></div>",
            "created":1263704400,
            "id":821415,
            "title":"Eczema? Or something worse"
        },
        "12121":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Shuka sneaks in the back-door (without FIB knowing)",
                "You don't trust Blanc"
            ],
            "content":"<div class=\"\"><div> <span>Shuka decided to sneak out of the room while Mr. Julian resumed his quizzing on the other students. \"Now, can anyone tell me the capital of Zanzibar?\" Mr Julian resumes his lesson, \"My guess is that it is on the Ivory Coast of the peninsula.\" He soon came across an antique hallway, hidden in the grounds of the school (for some obscurely bizarre reason). <br>\r\n<br>\r\nJust as he was about to cross the boundaries of the ghastly looking entrance, he was stopped by two guards, flanked with seeming normal looking equipment.<br>\r\n<br>\r\n\"I'm sorry, young lad, this is a containment area,\" said one of the metallic guards, \"We're quarantining it for safety protocols which were detained by the Government. We are the FIB, Federal Industrial Boundaries, who are protecting this latest shipment of accumulated barium...\" Barium?? \"You best be off if I were you, the name's Blanc Pont and this is my partner Methuselah Gristmill-\"<br>\r\n<br>\r\n\"This area contains high level of radio-activity\" Methuse-whatever confirmed for Shuka, \"Enough for exposure to view your bones WITHOUT X-Ray... Best run off little fella.\" Meth shot a sneaky glance at Blanc, as though they had a secret...</span></div></div>",
            "created":1263704400,
            "id":821949,
            "title":"Contamination contained by the FIB"
        },
        "121211":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Radiation starts leaking into the air",
                "Shuka looks at the shipment with awe"
            ],
            "content":"<div class=\"\"><div> <span>Shuka shot a suspicious glance back at the two of them, then he put his hands in his pocket.<br>\r\n\"Righty-o, if you don't want an innocent boy to see what's contained in there, why bother?\" Shuka stated uncaringly, before heading off in the other direction, whistling merrily. Once he was a safe distance away, he hid in a nearby playground and watch the agents shrug. Playing on the swings as he watched the agents.<br>\r\n<br>\r\n\"A bit touched in the head that one,\" commented Meth, \"You sure he hadn't had a bit of a smoke that young'un?\" Pont Blanc just laughed uproariously at that comment, \"Luckily, the newest shipment just arrived from the South Pacific, we can take a break now, lunch is about to start.\" Blanc said as their alarm watches whistled. Shuka had a mortified expression at the fact that they said that he was 'touched in the head' and was about to hit the tree-branch.<br>\r\n<br>\r\nThe two agents started arguing what they wanted to eat, Blanc wanted to eat out at a Thai restaurant and Meth agreed heartily as they stretched their old bones and commented that they had lunch for half an hour. Shuka scrambled back to the enterance once the agents were out of sight... There was a steel door which was padlocked, so Shuka smashed the door with his lock-pick. There was an unearthly greenish glow from within the door as he entered the conpartment<br>\r\n</span></div></div>",
            "created":1321419600,
            "id":1224140,
            "title":"Tell a FIB..."
        },
        "121212":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "He sees the parasite inside Kaede",
                "The goggles backfires"
            ],
            "content":"<div class=\"\"><div> <span>Shuka was skeptical about Blanc's announcement, at this Blanc runs off muttering about a few tests being made and tells Meth to stay and guard the doorway, Shuka was just about to move in, when Meth stumbles on the gateway, locking it with no passageway. <br>\r\n<br>\r\n\"Blanc insists that you go away, this is a highly secured area\" Methuselah glares at you, his red hair and fizzy beard sticking out as he orders Shuka to get back to school or wherever he came from in the first place. It was then that he accidentally drops the X-Ray goggles and he stumbles trying to pick it up! Hell yeah! Now THIS is more like it! Shuka grins, fixating it to his face.<br>\r\n\"Stop! That view is highly corrosive!\" Meth says, before a beam shoots out from Shuka's snazzy X-Ray goggles and incinerates the agent. Blanc came back just in time for Meth to turn into a fossilized skeleton. Blanc gives chase to Shuka, but he was wheezing...<br>\r\n<br>\r\nShuka manages to walk back to the Mr. Julian's classroom without a hitch, Mr Julian is disturbed at his appearance, but the X-Ray goggles can literally pierce through everything, like cross-section. He directs it towards Kaede. Reynardo is sitting behind her and waves at him.</span></div></div>",
            "created":1263790800,
            "id":822486,
            "title":"The amazing fossilising X-Ray goggles??"
        },
        "1212121":{
            "author_id":"masterwriter1",
            "author_name":"Danube",
            "choices":[
                "\"There's something inside you...\"",
                "\"Nothing,\" (he sits down and pretends nothing has happened)"
            ],
            "content":"<div class=\"\"><div> <span>Looking at Kaede's body, he sees her skeleton, just like he could see the skeletons of everyone else in the room. However, underneath Kaede's skin, there was also what appeared to be a series of black threads running through all of her tissues. They all led to a sort of shapeless black mass in her chest, 'insides' or either her stomach. As Shuka stares in horror, the black shape moves, seemingly to be aware that it was 'being' observed by an intruder. Shuka whips off the X-Ray goggles and looks back at Kaede in despair, who then stares back, with an eyebrow raised. \"Something wrong, Shuka?\" Kaede Einsfield ask with a snarl, \"Only you seem to be staring at my chest a lot, which means you're either an embarrassing stalker or you're just... Embarrassing.\" <br>\r\n<br>\r\nWhat does Shuka say towards her?<br>\r\n</span></div></div>",
            "created":1301893200,
            "id":1081944,
            "title":"He sees the parasite inside Kaede"
        },
        "12121211":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Kaede and Shuka were alone in an empty class",
                "Shuka ran back to his friend Felicity's house "
            ],
            "content":"<div class=\"\"><div> <span>\"I decline to say what,\" Shuka softly mutters, but he moved across the table and whipped out a blunt pen from his pencil-case.<br>\r\n\"Hm?\" Kaede says as Shuka quickly stabs her hand with the pointed end of the writing instrument and she winces and takes her hand as quickly as possible, but not before the male sleuth found a drop of black-tar gelatinously bubbling and festering where crimson blood should be. <br>\r\n\"... You're going to pay later for that behaviour simpleton,\" Kaede hisses silently to Shuka, her eyes flaring a dull yellow, \"After class, puny humanoid that is.\" He hoped Kaede didn't hear his heart pounding faster at that commentary, but her ears perked up as Mr. Julian questioned how she smiled sweetly, at the teacher. Mr. Julian was sweet-talked by Kaede that Shuka was causing trouble and should be moved to the detention later.<br>\r\n\"That is perfectly acceptable, I commend your thinking, Kaede. Shuka, to the back of the class, along with the other delinquents of your age.\"<br>\r\n\"But Mr. Julian-\" Shuka was scared of her and backed away to sit next to some giggling schoolgirls the rest of the class time while Mr. Julian lectured the rest on the geography of Spain and random video game concepts. Shuka quickly dozed off, but later the alarm bell for end of class rang and...</span></div></div>",
            "created":1305867600,
            "id":1109337,
            "title":"Only one surefire way..."
        },
        "121212111":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Shuka wields a chair against the threat",
                "Shuka escapes through a nearby window..."
            ],
            "content":"<div class=\"\"><div> <span>Kaede and Shuka were waiting until the rest of the class departed. Then Shuka started a short conversation to test Kaede.<br>\r\n\"So did you like the topic of today's lecture?\" Shuka cheerfully implied, \"About that Apollo satellite incident and the space-voyaging fare?\"<br>\r\n\"Yes. It was most informative,\" Kaede grimly stated,  in a tone that sounded bereft, \"Life beyond the stars can be so... fascinating.\"<br>\r\n\"I can't believe Mr Julian made us read <i>Childhood's End</i> by Arthur Clarke... I find it all a bit laughable.\" Shuka packed his pencil-case, \"As well as terraforming other planets and the spawning of the life-cycle of salmon.\"<br>\r\n<br>\r\n\"Yeah, that was dull. Other life-forms are so dull and not as versatile as the current dominant species.\" Kaede stated in a detached tone, \"Hey big boy, let's knocking it up a notch,\" Kaede purred, as Shuka gulped nervously... <i>I knew it!</i> Shuka yelped as Kaede unbuttoned his shirt and his heart was hammering like crazy... He guessed that the parasite must have a weakness...<br>\r\n\"Hey, think fast!\" He exclaimed.</span></div></div>",
            "created":1336366800,
            "id":1331361,
            "title":"\"Is there life beyond our Planet?\""
        },
        "1212121111":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Kaede kisses Shuka (Disagree)",
                "Shuka wants to check out the theory (Agree)"
            ],
            "content":"<div class=\"\"><div> <span>Kaede Einsfield effortlessly dodges the chair as Shuka shakingly applies the chair against his former classmate. \"Why are you life-forms acting this way? I only offer you membranes of peace on behalf of the Sector of the Duskbrood clan from Xeetlron XIV.\" Shuka thought up a fast pun to match the occasion. <br>\r\n\"You mean you were trying to dash me to pieces!\" Shuka exclaimed, \"Or is this your idea of love,\"<br>\r\n<br>\r\nKaede looked confused. \"I am but a drone messenger 764 from the Sector of Queen's Duskbrood legacy. We have no concept of your confusing phrases though I will gladly accept your response as being warfare against the drones.\" Shuka put down the chair briefly, confused as to the alien's motives.<br>\r\n\"What have you done with Einfield?! And do you come in hostility or peace\" Shuka said, striding to Kaede, \"I thought you were supposed to say 'Take me to your leaders' or something like those war vetrans.\" Shuka had watched too many movies<br>\r\n<br>\r\n\"The one you call Kaede? Ah, you mean the meaty Puppet.\" Messenger 764 of Sector Duskbrood stated, \"She 'still under the influence' as you humans state. We had sent 763 of our drones to Earth over the last 2 thousand years and your kind had acted in hostility against our brutal tactics, I digress from the others from Area 71...\"<br>\r\n\"What do you bring instead from the Queen of Sector, alien drone?!\"<br>\r\n\"... I bring the concept of copulation.\" Shuka lowered his guard, \"We bring stability. Explore your feelings, you know they are to be true.\"<br>\r\n<br>\r\n\"What do you need, parasite? Population control? Food? Love? Whatever?\"<br>\r\n\"We have no concept of this food or thirst, nor population. Our technology is minimal. But we do need to... Reproduce and cross-examine/study our new priorities.\"<br>\r\n\"Make love with everything? But food... You need photosynthesis?\"<br>\r\n\"Percisely not.\"</span></div></div>",
            "created":1336626000,
            "id":1333690,
            "title":"Hostile invasion of Privacy"
        },
        "1212121112":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Shuka decides to go home",
                "He goes to hide in the supermarket"
            ],
            "content":"<div class=\"\"><div> <span>Shuka looks around as he places his attention onto a broken window, suddenly it all clicked and there was the sound of shattering glass as Kaede was distracted by the human's movements. The sound of a wailing siren was heard as the last Shuka saw of Kaede was her being surrounded by the legion of police officers as he dashed through the broken glass.</span></div></div>",
            "created":1535691600,
            "id":2541118,
            "title":"Shuka escapes through a nearby window..."
        },
        "121212112":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "They jump (let her mother know)",
                "Someone was spying on them (lie)"
            ],
            "content":"<div class=\"\"><div> <span>Shuka didn't heistate and ran all the way down the alley and lanes, not pausing one bit to stop at the traffic overcrowding even as he apologised to several confused onlookers. At number 37 Estford street, he managed to go through a district, stopping only when he reached a golden knocker and a letter-box which was made of wooden material (of oak) At this, an irritable woman appeared in the doorway, yawning.<br>\r\n\"So you want Felicity, issit?\" asked Felicity's mother, otherwise known as Deborah Atkinson, Shuka nodded rapidly. \"Come on in here, Felicity will be with you in a moment.\" As Shuka waited impatiently, the grandfather clock struck 13 (1 pm?! Was it getting late already.)<br>\r\n\"Hullo, huns!\" yelled Felicity, taking a moment to hug Shuka and glomp him in the most intimate fashion ever, \"What's wrong? My mobile's on the blink.\" Shuka waited silently...<br>\r\n<br>\r\nThe Conversation goes as followed:<br>\r\n<b>Shuka:</b> It's Kaede. She's been taken by-<br>\r\n<b>Felicity:</b> What about that kook are you talking about. Don't bother with her and aliens. You read too many-<br>\r\n<b>Shuka:</b> No wait, I have <i>proof </i> that Kaede's been taken or abducted. See this hanky?<br>\r\n<b>Felicity:</b> It looks like gunk was smeared all over it, tar more like?<br>\r\n<b>Shuka:</b> That is the entire point: That was her blood! Blood should be red, not black Them aliens had captured Kaede and made her their slaves and altered her-<br>\r\n<b>Felicity:</b> What is the entire point of this? Altered her brainwaves? This sounds serious, are you sure you've taken your anxiety-<br>\r\n<b>Shuka:</b> Medications?! I don't need any right now, though I do need my puffer soon. I theorise the Queen of the Saucers had infested her body, and then laid eggs in her who-knows-where, leaving her carcass to breed, fertilize and spawn alien eggs everywhere like gooey egg-sacs of nourishment. Listen: Kaede is dangerous, there's no telling what-<br>\r\n<b>Felicity:</b> Would happen? Shall we alert the authorities? Or let my mother know? This sounds like trouble<br>\r\n<b>Shuka:</b> We mustn't get your mother involved in this, adults are almost useless in-<br>\r\n<b>Deborah:</b> Whad' I miss? </span></div></div>",
            "created":1309842000,
            "id":1141207,
            "title":"Shuka: I fear that she's been taken... by aliens"
        },
        "1212121122":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Imogen felt light headed (transfer of consciousness)",
                "Back with Shuka (Kaede just talks to Imogen)"
            ],
            "content":"<div class=\"\"><div> <span>Imogen Faraday was watching them through the window as she was clutching a tree-branch, her eyes narrowing as Kaede awaited at the bottom, she couldn't hear all the conversation, but enough of the details to learn much of Shuka's plan. Nodding to themselves, Shuka and Felicity insisted and said that things were fine and they were just sharing the latest cookies recipe. Imogen glanced towards how high she was situated in the tree and she whimpered at the height as Kaede glared at their transcript.<br>\r\n\"Looks like they're crafty,\" commented Imogen, her eyes narrowing as Kaede stood silently like a sentry, her yellow eyes glowing in the dusk.<br>\r\n\"Are you okay,\" yelled Imogen as she scaled down the tree, branches prickling, \"Looks like those two are moving again.\"<br>\r\n\"Yes, I'm fine,\" Kaede chuckled to herself, not minding the stress Imogen was feeling as the braids flew down. \"But I have one small request\"<br>\r\n<br>\r\nImogen looked uncertain at Kaede, not sure if she was hearing right, \"Why?\" and handed her both a mobile phone and a sketch tablet cautiously, \"Do you have a plan, O Worm of Conquerers?\" Imogen now said in a rather clipped voice, wary of 'Kaede's' intentions, even if she wasn't sure she was acting of her 'free will' anymore. She was just a tool to be used as far as the parasite was concerned. The eyes glowed in a sinister manner, as Imogen stood astounded at this new rapid development in progress.<br>\r\n\"Infiltrate and conquer, and those... two-legs won't even know what hit them, when the entire mess hits their fan.\" Kaede smirked nastily, placing her hand. Imogen didn't like where this whole conversation was going...</span></div></div>",
            "created":1312434000,
            "id":1161152,
            "title":"Imogen learns of their 'cunning' plan"
        },
        "12121211221":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Queen Duskbrood tells Imogen to investigate",
                "Shuka and Felicity run away"
            ],
            "content":"<div class=\"\"><div> <span>\"Sector Duskbrood\" addressed Imogen heistantly, \"Spawn Queen Duskbrood. I shall await your orders,\" Kaede snapped to attention at that name, grinning slyly like she had something on her mind already, \"Ah, so you want to participate in my plans,\" Kaede stated neutrally as she nuzzled Imogen affectionately, \"Pathogenesis takes time on its own pace. Maybe I can <i>quicken</i> the procedure.\" Imogen backed away as she realised Duskbrood had plans to spread... \"Ah, you find me hypnotic,\" Kaede teased.</span></div></div>",
            "created":1330318800,
            "id":1285228,
            "title":"Silver water"
        },
        "12121212":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "After class he sees his other friend",
                "Decide to tell no one so far"
            ],
            "content":"<div class=\"\"><div> <span>Shuka is visibly shaken by the inky outlines of the alien-goop he just saw and it reminded him ever so slightly of his comic book, his favourite issue, however, this wasn't really happening was it? Nah, this was real life, not some kind of... Was it? Shuka continued to debate to himself, as he continued to stare at Kaede's chest for over ten minutes, but then Kaede got a bit shifty and Shuka finally responded by blushing red and muttering, \"I saw nothing, I'm ever so sorry for peeking at your under-under-garnments.\" That gave Kaede the initiative to attempt to whack Shuka on the head, but Shuka sat down quickly and pretended that he saw nothing out of the ordinary. Unfortunately, that red blush gave it away, sort of... Well, Kaede had a busty figure... <br>\r\n\"Per-vet.\" Kaede says with a ticked off accent, before sitting away from him, \"No wonder males now-adays don't seem to find me attractive.\" Shuka only assumed it was the parasite talking and was planning to get rid of him indirectly. The teacher glared at him and confiscated his comic collection consisting of random superheros.<br>\r\n<br>\r\nWhat does Shuka do now</span></div></div>",
            "created":1303534800,
            "id":1092913,
            "title":"Nothing(he sits down and pretends nothing has h..."
        },
        "13":{
            "choices":[
                "Kaede is offered a ride home",
                "She is told to go home and Kaede continues her walk"
            ],
            "content":"<div class=\"\"><div> <span>Opening her eyes, Kaede saw the bleak overcast grey sky above her. She arched her knees up and felt a wet sensation from the soggy grass she lied upon. Kaede quickly sprang upright and scanned her surroundings. It had stopped raining and her poncho, soaked was wrinkled and embedded in the dirt behind her. Above the poncho stood a very old tombstone inscribed with a name she did not recognize.<br>\r\nOn somewhat wobbly knees, Kaede stood up and brushed herself off. As she reached down to pick her poncho up from off the ground she noticed that she had been lying lengthwise directly upon the burial mound of a grave site.<br>\r\n<br>\r\nA loud siren vibrated off Kaede's eardrums and she jumped slightly. Radio sqwaking and blairing lights overwhelmed Kaede's senses as she had held her hand up over her eyes trying to focus on the source. Her pupils dialated and she felt her heart start to race. It was all starting to happen like before.<br>\r\n<br>\r\n\"Hey\" shouted a voice.<br>\r\n<br>\r\nKaede was too frightened and disorented to respond.<br>\r\n<br>\r\n\"Hey!\" it shouted again in a more commanding tone. <br>\r\n<br>\r\nThe officer exited his parked car, removed his flashlight from his belt and approached Kaede. \"Hey you!\"<br>\r\n<br>\r\n\"What?\" Kaede's senses returned to her. She recognized the police car's rotating beacons and the engaging user of the vehicle.<br>\r\n<br>\r\n\"Are you alright ma'am?\" he said as he stopped before her.<br>\r\n<br>\r\n\"I... uh.\" Kaede was unsure what to say. Her 'nightmare' still echoed in her mind like a distant locomotive.<br>\r\n<br>\r\n\"Are you alright?\" he asked with stress in his voice.<br>\r\n<br>\r\n\"What time is it?\" She somewhat was able to answer.<br>\r\n<br>\r\nHe paused before looking at his watch.<br>\r\n\"It's 5:35.\"<br>\r\n<br>\r\n\"I'm fine... I... I guess I passed out while I was walking through here.\"<br>\r\n<br>\r\nThe cop stared sternly at her.<br>\r\n<br>\r\n\"I er... like... walking through cemetaries.\"<br>\r\n<br>\r\nHe scanned her over with his flashlight.<br>\r\n\"Well you look the type.\" he smirked \"You live around here?\"<br>\r\n<br>\r\nKaede nodded.</span></div></div>",
            "created":1265518800,
            "id":831988,
            "title":"Rude Awakening"
        },
        "131":{
            "author_id":"masterwriter1",
            "author_name":"Danube",
            "choices":[
                "He is attracted to her.",
                "He doesn't want to do anything to her- Duty comes first!"
            ],
            "content":"<div class=\"\"><div> <span>\"Do you want a ride home\" the police officer says. Kaede nods. <br>\r\n\"Alright then, hop in\" the policeman says, and Kaede obliges.The policeman starts up the car and drives of. \"So where is your house?\" he asks. Kaede gives him her address, and the police officer types it in to his sat-navigator. <br>\r\n<br>\r\n\"My name's Dale, by the way,\" said the policeman, trying to make casual conversation. Kaede nods, and was about to reply, when she suddenly felt a weird sensation inside her. It was as if something was moving in her stomach. She gasps out loud at the feeling, which was both painful and pleasurable at the same time. <br>\r\nDale looks at her rather curiously, \"You okay there?\" he asks, concerned. <br>\r\n\"Stop the car!\" Kaede felt herself screaming. Worried, Officer Dale starts to pull over into a street-lane... <br>\r\n\"Seriously ma'am, you don't look too well right about now. Should I take you to a doctor?\" Kaede is about to reply, but suddenly she feels a rush of heat to her chest, and when she now looked at Officer Dale, she suddenly found him 'incredibly' attractive to look at...! <br>\r\n\"A doctor isn't what I need.\" she replies as if she was in a trance.<br>\r\n<br>\r\n\"Then what do you need now, lady?\" Officer Dale said, or tried to say to her- but he suddenly couldn't speak as Kaede lunged across and stared kissing him hungrily... \"I need you.\" she said, when Kaede finally came up for more air.<br>\r\n<br>\r\nHow does Dale respond?<br>\r\n<br>\r\n</span></div></div>",
            "created":1301893200,
            "id":1081949,
            "title":"Kaede is offered a ride home"
        },
        "1311":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Dale likes Kaede, but was concerned for her",
                "Real Kaede regains consciousness",
                "Shuka arrives at the shopping centre the next morning"
            ],
            "content":"<div class=\"\"><div> <span>The police officer didn't know what came over her at that particular moment, but he was amused at the least at Kaede's very strange reaction, then as he gazed at her, he noticed Kaede had stroppy leggings that reached to her ankles and her hair was of a most heavenly coloured fringe, but he was worried about her reaction to his questions and continued his questioning, protesting even as Kaede continued their antics...<br>\r\n<br>\r\nMeanwhile, the newborn black parasite hiding inside Kaede liked these strange sensations then decided that maybe it should stick with Kaede for awhile because it wanted to experience the best of the human world and all of these senses were new to the uncomprehending 'being' that just awakened to the passions of youth. Dale had no idea of these proceedings however...</span></div></div>",
            "created":1303534800,
            "id":1093393,
            "title":"Dale was mildly amused"
        },
        "13111":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Kaede has a 'talk' with her dad",
                "Officer Dale 'stays' overnight to interview Jeremy..."
            ],
            "content":"<div class=\"\"><div> <span>Dale drove Kaede home and her father answered the door. Mr. Jeremy Einsfield was talking on a mobile when Officer Dale greeted him.<br>\r\n\"Kaede, what were you doing at this unholy time of the night?! You worried me sick with the pacing and the waiting. If my wife hasn't called back...\"<br>\r\n\"Greetings Mr. Einfield. I presume this is your child. We've found her sort of stumbling around a graveyard at 5 pm.\" Dale greeted the burly man, \"It's past curfew, and if you don't mind I'd like to keep an eye out for her. She was found in a state of delirium for the past hour, so I'll hand over this,\" Dale gave Mr. Einfield a tracking bracelet. \"This is like an international GPS system that lets the Police know where your daughter is at all times. Think of it like quarantine.\"<br>\r\n\"Sorry Dale Klinton, no deal.\" Einfield huffed, \"I know your kind are pretty shady with those underworld going ons,\" Dale blocked the door.<br>\r\n<br>\r\n\"I'm sorry, but if you care about your daughter's state, you need to keep this on her ankle at all times, regulation of the Federal Law.\" Dale insisted in the other room, while Kaede was out of sight and recovering. Jeremy was smoking a cigerette and had a fiveoclock shadow. <br>\r\n\"With things going on with my wife, I'm not sure if I can keep track of my gal for I had to sleep on the couch earlier,\" Jeremy revealed, \"Family feuds and all.\"<br>\r\n\"We'll keep in contact, Jeremy. In all regards to her safety\" Detective Hotchpotch stated, \"Our police station is near Liverpool... Dale, keep a tab on Kaede.\"<br>\r\nKaede stiffy nodded and walked up to her room with an unsteady gait after Dale placed the bracelet upon her ankle.<br>\r\n\"Ah, tough times\" Jeremy grumbled, \"Darn wife signed up for divorce papers already,\"</span></div></div>",
            "created":1336366800,
            "id":1331355,
            "title":"The Bracelet"
        },
        "1312":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Agree with Officer Dale and decide to go home",
                "Continue the ruckus with Dale and prolong getting home",
                "Continue kissing Dale"
            ],
            "content":"<div class=\"\"><div> <span>Officer Dale was rather weirded out already as he watched Kaede lunge across for his kisses, but he had an assumption at the back of his mind that maybe Kaede was inhibited or maybe just plain drunk, but as an officer he had questioned whether Kaede was in her right mind to kiss him and even as he thought that out loud, his disruptive passenger started smothering him with even more hot and heavy kisses, so Dale stopped the car immediately. Heaving heavily, he used his arms to widen the gap between the two passengers and said something to the effect of:<br>\r\n\"Listen lady, I know you're probably had an all-nighter or something, or maybe you just need a check with your local doctor, but shouldn't you be focused on going home,\" Officer Dale stated, panting heavily after the unexpected even as he felt himself go hot under the collar, he had a black tarry lipstick which he smeared off with disgust, \"My main priority is to get you young lasses home on time,\" But Kaede was looking at him with vague interest,withdrawn and in her corner, as she removed her poncho, combing the tangles of her copper-hair as she glared with him with wild yellow eyes.<br>\r\n\"Well,\" Kaede regained her composure as she breathed heavily, \"...\"<br>\r\nWhat does a rather confused Kaede do next?</span></div></div>",
            "created":1303534800,
            "id":1093388,
            "title":"Duty or compassion?"
        },
        "13122":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Kaede gets out of the car",
                "Dale hears a shrill noise in the shops nearby"
            ],
            "content":"<div class=\"\"><div> <span>Kaede pauses as Officer Dale reaches for his mobile phone, but then Kaede pounces at the officer, swiftly distracting him as the suprised officer could only gape.<br>\r\n\"Um, missus, I think you made me miss my call.\" Dale announces as he swerves into a parallel parking position as they stopped at a shopping centre.<br>\r\n\"You are begining to be quite a handful,\" Dale decides as a long dial tone was heard, \"Stay here, I got a call from the mall officers which is quite urgent,\"</span></div></div>",
            "created":1491195600,
            "id":2299017,
            "title":"Continue the mayhem with Dale"
        },
        "131222":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "The alien possesses another human",
                "The robber is engulfed by the alien"
            ],
            "content":"<div class=\"\"><div> <span>A bank robber made his way towards the main entrance of the shops, several bank notes fluttering down as he is pursued by several mall cops, the shopping centre being open at night as the robber runs fast. Dale could see the robber was heading away from the bank as the alarm is triggered and several people were shouting. Kaede narrows her eyes at the chaos.</span></div></div>",
            "created":1493614800,
            "id":2313402,
            "title":"Robbery at the shops"
        },
        "132":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "The aliens abuct the police",
                "Kaede reaches home safely"
            ],
            "content":"<div class=\"\"><div> <span>Kaede was about to answer, but the police interrupted her<br>\r\n\"If you're wasting time here,\" the police officer said, \"in some deserted cemetary, why should I bother telling you ruffians to go home, it's way past your bedtime and we all need to sleep around here,\" Another officer motioned to Kaede and she winced, \"She lives at Winchester Avenue at number 74, it shouldn't be too far from this haunted cemetary,\"<br>\r\n<br>\r\n\"Well then, go home-\" the officer yelled \"lady, you know the way home right\" Kaede nods and she just walks dazedly off in the direction of home, she didn't know some 'aliens' were watching her and she was in their view</span></div></div>",
            "created":1320296400,
            "id":1217246,
            "title":"A short walk off a long pier"
        },
        "14":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Kerri sees the creature and starts screaming",
                "Hussen wards off the dark creature with his fire",
                "Felicity is sunbathing and didn't notice it",
                "They all decided to get out"
            ],
            "content":"<div class=\"\"><div> <span>The next day, some excited campers decided to set up camp in the forest right near where the graveyard was a couple of hundred metres away. Felicity, Kerri and Hussen were sweating in the heat and decided to sunbathe, as Felicity started un-packing her back-pack and Hussen, her best friend decided that cracking jokes was a good time to take their minds off their international world tour as their guide was lost several days earlier, with no explanation. As tourists and a mixture of boy and girl scouts, they thought it would be unreal just to check the place out as Hussen prepared the kebab and Felicity soaked up the sun-light. Seth was scouting as well, he was a physically built fellow who liked to investigate paranormal stuff and spent time at the gym.<br>\r\n\"Did you hear that?\" Hussen demanded, picking his ears out of interest at the slightest noise,<br>\r\n\"Don't be silly, hussen, it'd just be the breeze,\" Kerri confirmed, laughing at his approach as she soaked her red-hair.<br>\r\n<br>\r\nMeanwhile, something dark and tarry was watching from the bushes.</span></div></div>",
            "created":1303794000,
            "id":1094629,
            "title":"Some typical trekkers are lost in the woods..."
        },
        "142":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "The camp",
                "Later at the lake",
                "Hussen tells them about the alien, in disbelief"
            ],
            "content":"<div class=\"\"><div> <span>Hussen was wary and was lighting a camp-fire when he spotted the creature/alien and it blurbed, reasonably scared for his life, he reaches for the aerosol and let loose with a quick spray of the air-tight can. <i>PSSST!</i> The creature was disturbed and slithered away from the campfire, but Hussen was faster and doused the alien with the coals of the heated fire. The alien screeched and slimed away</span></div></div>",
            "created":1309669200,
            "id":1139360,
            "title":"Fire storm"
        },
        "143":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Hussen decided to call the authorities",
                "Seth was later worried about Felicity and their survival",
                "Later the creature 'talks' to Felicity"
            ],
            "content":"<div class=\"\"><div> <span>Felicity decided that the woods provided a good shade due to the undergrowth of the crisscrossing roots of the shadowy trees, which provided some dappled sunlight to shine through as she sighed in relief as she used her shades to provide protection from the sun, she was so busy relaxing with her lazy soles wiggling in the grass, that she didn't notice the slightest movement which took place as soon as the dark tarry substance started oozing underneath the towel she laid down, as she used her laptop to prop up her shoulder-blades. Suddenly she was aware that she was unable to breathe, suffocating under the tarry mass as it was trying every which-way to sink into her pores. It was terrifying and she tried to fight back.<br>\r\n\"Mmph, argh-\" she tried to alert her friends to the danger, but the tar-creature was determined and rammed a large portion of it's gelatinous liquid material into her mouth. It was everywhere, oozing into her every orifices, but then the strain of the fright lessened and Felicity felt light-headed and wonky as the deluge covering her disappeared and the rest of the tarry creature sank and the rest of the creature slunk away into the grass, leaving little trace...<br>\r\n<br>\r\nHussen and Seth ran towards the sound of her voice, and puzzled they found no trace of the trouble assaulting Felicity. They sighed in relief that it wasn't a serial mass-murderer on the loose, but they did notice Felicity was acting a bit disorientated.\"Hey Fel, what were you yelling about earlier?\" Seth asked, \"You were just fine before we came to this peaceful grove,\"<br>\r\n\"Nothing,\" Felicity added, \"I guess it was just a dream,\" she smiled with an uncharacteristically serene smile, a yellow glimmer starting to show in her irises.</span></div></div>",
            "created":1303794000,
            "id":1095215,
            "title":"Felicity is taken next..."
        },
        "144":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Roll call",
                "The teacher goes to the forest",
                "They go to the forest and something strange happens"
            ],
            "content":"<div class=\"\"><div> <span>The teacher was doing a roll call the following morning and began the roll call as the students milled about, \"Today we're going to visit Hilldenbodge Knot,\" said Mrs Susannah as the first student Elijah put up his hand. \"Yes, Elijah?\" she sighed wearily, \"Isn't that the place where an alien spaceship landed weeks ago?\" says the 12 year old.<br>\r\n\"Yeah, I heard that it was all flashing lights!\" adds Hannah Blighter as she saw a news report on the incident of the campers, \"We probably shouldn't go today.\"<br>\r\n<br>\r\nJust then Seth stumbled into the classroom in a daze.</span></div></div>",
            "created":1365397200,
            "id":1567845,
            "title":"The class excursion of Doom"
        },
        "15":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Chisraul sees the living liquid",
                "It slips by unnoticed"
            ],
            "content":"<div class=\"\"><div> <span>\"... Oh dear,\" noted the forensic pathologist as he murmured at this case in the police station, \"I'm afraid my hands are tied with this case, officers.\" The officers stood by dutifully as the pathologist pulled down the sheets over the girl's frozen face of terror. Dr. Chisarul shut the lights to the autopsy room as a strict maintainence, but if he cared to look, he would have noticed something oozing out of the sweaty pores, gelatinous and muscousy.<br>\r\nThe puddle of weird substance slithered towards the doorway, leaving a trail of sweat and pooling tar-like liquid. It was alive and it was hungry.</span></div></div>",
            "created":1237179600,
            "id":661612,
            "title":"What on Earth is that?!"
        },
        "152":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Several hours later the entire city was in chaos",
                "Tabor notices the sludge",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Dr. Chisarul was rather dense, but if he had turned at that precise moment, he would have noticed the pathogen slither by. But since he was distracted by the autopsy, it seemed neglient to notice such a trivial thing. The bespectacled man removed his long-sighted glasses to see better, but the mucus had already slipped away.<br>\r\n<br>\r\nThe mucus reached a drain-pipe near the storm-water gutter, the cars clattering past, and it slithered through the vents, dunking itself in the water and immersing itself thoroughly in the swirling water.<br>\r\n<br>\r\nMeanwhile, another person happened to turn on the taps and take a swig of water. He was a guy with the unusual name of Taboreux Colas, a journalist. And he was massively thirsty, the muscular teenager took a glass of water... He didn't notice the tar-like sludge at the bottom of his glass, but his friend, Nexus, noticed</span></div></div>",
            "created":1267938000,
            "id":847531,
            "title":"The alien down the drain"
        },
        "1522":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Tabor's article is published - with unforseen consequences",
                "There is widespread panic in the city",
                "It's too late"
            ],
            "content":"<div class=\"\"><div> <span>Nexus scattered the glass from Tabor's hand, \"Don't drink that! It could be contaminated water, the power plant desalination plant must have been out of order\" Tabor looked in confusion, but became shocked at the living sludge as it laid on the floor.<br>\r\nAt this Tabor's fist became clenched, \"you mean, I almost drank THAT!\" He made a face, \"What if this substance gets into the city's main water supply?? It would become unstoppable! I would hate to think what it does to the animals and wildlife!\" Tabor was in his get go, ready to write the next article on the unthinkable, \"Please alert the presses!\" he ordered Nexus, \"the medical authorities must know of this abomination!\"</span></div></div>",
            "created":1267938000,
            "id":847614,
            "title":"Alert the presses"
        },
        "15221":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Quarantine the area!",
                "Other options are availible"
            ],
            "content":"<div class=\"\"><div> <span>\"This is Lapel Xailent reporting for the Channel Omega-7 news.\" Lapel spoke carefully, in throng with two other girls on either side of her, as she spoke to the camera, \"A few days ago, Taboreux Colas came with a newspaper article about this tar-like substance which he believes is polluting the water supply, the government asks everyone not to panic, because they got everything under control for now. However, they are reconsidering putting the vincinty of Nartha-Polis city under quarantine, because of several viral outbreaks.\" she sweatdropped profusely, ruffling her shortened violet locks, which was dyed to suit her style. <br>\r\n<br>\r\n\"Here we have two seperate ambassors from the region of nearby city Helix City, Klytie Seres - and Apollo Demotri.\" She turned to the two, \"What do you request of the situation, Jalantre? Is there any other options availible?!\"<br>\r\n<br>\r\nKlytie Seres had long hair which was unusually both purple and black, she was very tall for her age and had a white tint upon her long fringe, she held a stern expression and like Lapel, had pale indoors skin. Her slitted eyes glowed golden. Apollo was older, but he had blonde hair and two black sideburns which hung down, he dressed very casually. <br>\r\n<br>\r\nKlytie opened her mouth to speak, but Apollo silenced her</span></div></div>",
            "created":1267938000,
            "id":847630,
            "title":"The two ambassadors of Helix city"
        },
        "1523":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Tabor reconsiders seeing Baltimore",
                "Elyndor shows up",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Tabor's friend tried to knock the glass away, but he was too late as Tabor started chugging away, not caring to see the sediment at the bottom of the glass. When he finished Tabor tiredly wiped his mouth in exhaustion, he had to work on a major report today... He noticed Nexus's hand shaking and he dropped the glass...<br>\r\n\"Is there anything WRONG?\" pointed out Tabor, \"Jeez, you look like you seen a ghost.\" Tabor grimaced in response, but Nexus replied to him that he drank something. Tabor's eyes blanked out...<br>\r\n\"Holy!! You mean that... thing's inside me? WHAT IN HECK IS IT??\" Tabor got out his holographic device, calling his other friend in the district... \"MD Baltimore of Cypress Point Rd?? It's your good pal, Tabor. Listen, can I get a medical examination ASAP? No? Next week? Ah well...\"</span></div></div>",
            "created":1268542800,
            "id":850805,
            "title":"\"IT'S INSIDE ME?? dammit.\""
        }
    },
    "info":{
        "author_id":"sabrinadiamond",
        "author_name":"safire_diaz",
        "brief_description":"Infused, invades bodies as a parasite. Can Shuka stop carnages?",
        "created":1236690600,
        "description":"<td align=\"left\" class=\"norm\">1. No extreme sex scenes, but try to be as creative as possible<br>\r\n2. No blood or descriptions of extreme violence.<br>\r\n3. Soft-vore (and gore) is allowed, as well as absorption-vore :D<br>\r\n4. Have fun! The characters are classified into three groups, Aliens, humans and Infectees.<br>\r\n<br>\r\nMain characters: Shuka Nalpmus, Reynardo Dalton (friend), Mr Julian (teacher), Agents Point Blanc, Methesulah (currently deceased) and Barcaund (male)<br>\r\nPotential Infectees: currently Kaede Einfield (local school student), Felicity and Tabor (both reporters)<br>\r\nMinor characters: Officer Dale (male), Lapel Xaliant (lady reporter), Felicity Lithar, Hussen Enthard (male) and Chris Endor. Others may include Kerri Conner, Dignity Coleen and Seth Wade. 6,000 gp for the first 60 chapters added<br>\r\n<br>\r\nThere are two story-lines. The first plot involves an infested Kaede and Shuka's investigation into the incidents, depending on how Kaede is treated by the others the parasite can be good, neutral or evil depending on their reaction. The second is a survival-horror where tourist-campers Hussen, Felicity and Seth are hunted down by the same parasite and they all fight for survival. It's up to you where you take this to the limits. The aliens can merge with any body-part and cause sentience to the allocated organ.<br>\r\n<br>\r\nUPDATE: It's over 5009 views? That is fantastic <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/starstruck.png\" alt=\"*StarStruck*\" title=\"StarStruck\" border=\"0\" width=\"15\" height=\"15\"> Yay. I will be editing this soon. Celebrating EIGHT years xD 2017 bonus, don't miss out. Now has 32 chapters.<br>\r\n<br>\r\n<b>Wall of Praises</b><br>\r\n<span class=\"noselect\" style=\"cursor:pointer;\" oncontextmenu=\"uport_ajax_rt_opts (event, this, 'masterwriter1', '', '', '', '10', '', 'ON', '100871729'); hide_uport (); this.shown=1; return false;\" onclick=\"uport_ajax_opts (event, this, 'masterwriter1', '', '', '', '10', '', 'ON'); hide_uport (); this.shown=1;\"><a title=\"Username: masterwriter1\r\nMember Since: April 3rd, 2011\r\nClick for links!\" style=\"line-height: 1em;font-size:1em;cursor:pointer;\">Danube</a></span> <span class=\"noPrint\">(<a title=\"View masterwriter1's Community Recognition\" class=\"blue2roll\" rel=\"nofollow\" href=\"javascript:LaunchPop('https://www.Writing.Com/main/authors/action/overall/user_id/masterwriter1',%20'CommunityR_100871729',%20'400',%20'650')\">41</a>)</span> <a class=\"imgLink imgPortLink\" onmousedown=\"if(event.which == 3) { event.preventDefault(); var mywin = window.open('https://www.Writing.Com/main/portfolio/view/masterwriter1','_blank'); mywin.focus (); event.stopPropagation(); return false; }\" href=\"https://www.Writing.Com/main/portfolio/view/masterwriter1\" target=\"_top\" onmouseover=\"uport_ajax2 (event, this, 'masterwriter1', '&lt;span style=\\'color:#990000;font-weight:bold\\'&gt;Offline or Private&lt;/span&gt;&lt;br&gt; Last On:  1/7/20', '1/7/20', 'April 3, 2011', '', '', '10', 'Registered Author');\" onmouseout=\"hide_uport ();\"><span style=\"padding:0px 2px 0px 0px;vertical-align:middle;\"><img src=\"https://images.Writing.Com/imgs/writing.com/writers/costumicons/ps-icon-regular-10.gif\" width=\"30\" height=\"15\" border=\"0\"></span></a><a rel=\"nofollow\" onmousedown=\"if(event.which == 3) { event.preventDefault(); LaunchPop('https://www.Writing.Com/main/em/action/new/toid/100871729',   'mess100871729_1578580187', '710', '540');  event.stopPropagation(); return false; }\" href=\"https://www.Writing.Com/main/em/action/new/toid/100871729/in/1\" target=\"_top\" title=\"Email User: masterwriter1 [Offline / Private]\" class=\"imgLink imgPortLink noPrint\"><span style=\"vertical-align:middle;padding:0px 0px 0px 0px;\"><img src=\"https://images.Writing.Com/imgs/writing.com/writers/mail-off.gif\" width=\"22\" height=\"15\" border=\"0\"></span></a><span class=\"noPrint\"><span id=\"new_ffmasterwriter1\"><a class=\"imgLink\" style=\"cursor:pointer;\" onclick=\"doAjaxO('ffmasterwriter1', '', 'post', 'https://www.Writing.Com/main/my_favorites.php', 'action=fanfav&amp;fav=1&amp;user_id=100871729&amp;nopad=1&amp;new=1&amp;ajax=new_ffmasterwriter1');\" rel=\"nofollow\" title=\"Click to add masterwriter1 to 'My Favorites'. \r\nClick again to become a 'Fan'. \"><span id=\"ffmasterwriter1\" style=\"padding:0px 3px 0px 3px;vertical-align:middle;\"><img border=\"0\" src=\"https://images.Writing.Com/imgs/writing.com/writers/favplus.gif\" style=\"padding-right:1px;\" width=\"15\" height=\"15\"></span></a></span></span>,</td>",
        "id":1537303,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1535721120,
        "pretty_title":"Biological Nightmare: Origins"
    }
}