{
    "chapters":{
        "1":{
            "author_id":"msdragon",
            "author_name":"Ms. Dragon",
            "choices":[
                "Actually, Jane Kelly buys it",
                "Agent Torque",
                "Agent Terminal",
                "Agent Godmother",
                "Other Agents and people"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In the scavenger's market, a new item pops into existence- the swap remote. One of the agents picks it up, and decides to buy it, drawn by a strange call. But who?</span></div></span></div>",
            "created":1592949180,
            "id":2855707,
            "title":"It begins"
        },
        "12":{
            "author_id":"msdragon",
            "author_name":"Ms. Dragon",
            "choices":[
                "Swap something with Director Kelly",
                "Swap something with Agent Whisper",
                "Swap something between Zephyer or Terminal",
                "Drops the remote, triggering an unaware swap",
                "The swap misses any valid targets"
            ],
            "content":"<div class=\"\"><div> <span>Torque picks up the remote and heads back to base, pondering what it could do and just why she bought it. Arriving at base, she spots a few interesting scenes happening- Director Kelly was in a heated phone argument with Bradford, about the importance of her position and peace with the aliens. Meanwhile, Whisper was eyeing her from across the room, hoping to avoid her ire, while Zephyr was training with Terminal.<br>\r\nHer thoughts moved to each group- of the stress her close friend was bearing for her, of her former parole agent, Whisper, and the skills possessed by the sparring pair.<br>\r\nToying with the remove, she unknowingly activates it, triggering a subconscious swap.</span></div></div>",
            "created":1592950500,
            "id":2855717,
            "title":"Agent Torque"
        },
        "121":{
            "author_id":"msdragon",
            "author_name":"Ms. Dragon",
            "choices":[
                "Swap rank to become Director Torque",
                "Swap species to become a human",
                "Another swap"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There were a few things on her mind as the swap activated- of Kelly's rank, her species, or perhaps something more esoteric?</span></div></span></div>",
            "created":1592950680,
            "id":2855720,
            "title":"Swap something with Director Kelly"
        },
        "1211":{
            "author_id":"msdragon",
            "author_name":"Ms. Dragon",
            "choices":[
                "Too weird. Swap Back.",
                "Swap more!",
                "Explore this new reality"
            ],
            "content":"<div class=\"\"><div> <span>With a dizzying shift, the remote heated up, she found herself sitting where Kelly was, and Kelly, now wearing combat armor, approaching her.<br>\r\n<br>\r\n\"Director Torque- how've you been lately?\" Kelly asked her close friend.<br>\r\n<br>\r\nTorque- confused and disoriented, could only reply \"Good.\" as she struggled to figure out what just happened.<br>\r\nThen, it all came to her- she was director. She knew it wasn't real, but the memories she had just gained- they seemed so... solid!<br>\r\n<br>\r\n\"How about you,\" Torque continued, regaining her wits, and looking down at the remote.<br>\r\n<br>\r\nKelly then when on to describe her recent life experiences, but Torque was more preoccupied with the remote. This this was <i>weird.</i></span></div></div>",
            "created":1592955060,
            "id":2855744,
            "title":"Swap rank to become Director Torque"
        },
        "124":{
            "author_id":"msdragon",
            "author_name":"Ms. Dragon",
            "choices":[
                "Swap professions with an escort outside",
                "Swap relationships with Agent Whisper",
                "Another swap"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Dropping the remote, Torque fumbles to catch it, only causing it to land upside-down and triggering a swap.</span></div></span></div>",
            "created":1593024960,
            "id":2856194,
            "title":"Drops the remote, triggering an unaware swap"
        },
        "1241":{
            "author_id":"msdragon",
            "author_name":"Ms. Dragon",
            "choices":[
                "No- she's still close friends with Director Kelly",
                "Yes- she's now friends with other civilians",
                "Actually, her roommate is now Director Kelly, and they're still close friends"
            ],
            "content":"<div class=\"\"><div> <span>Bending over, Torque picked up the gift from her previous... client. It was warm to the touch. She glanced around, taking in a human in battle armor looking out the window. Must be part of that new 'Chimera Squad'.<br>\r\nPocketing the device, she started to wander back home- she was done with her 'errands' (and her actual errands) for the day.<br>\r\n<br>\r\nReturning home, she greeted her roommate and decided to call her friends to see what was up with them.<br>\r\n<br>\r\nBut did the swap give her new friends?</span></div></div>",
            "created":1593025620,
            "id":2856201,
            "title":"Swap professions with an escort outside"
        },
        "1242":{
            "author_id":"msdragon",
            "author_name":"Ms. Dragon",
            "choices":[
                "Whisper is now Ex-Advent while Torque is not",
                "Whisper had commited crimes but been recruited- Torque is still Ex-Advent",
                "Reality just doesn't make sense and noone notices"
            ],
            "content":"<div class=\"\"><div> <span>Picking up the remote, she chided herself for her carelessness, and examined the damage. Luckily, it seemed to be intact- but it was strangely hot.<br>\r\nShe glanced around the room. Zephyr and Terminal were still training. Whisper and his close friend Kelly were chatting it up.<br>\r\nTorque thought of recent years, where she was Whisper's parole officer, after the war. She was in charge of making sure the human didn't do anything wrong.<br>\r\n<br>\r\nLittle did Torque know, this was a product of the swap. For some reason, she was his parole officer... how did reality change to accommodate this swap?</span></div></div>",
            "created":1593025260,
            "id":2856197,
            "title":"Swap relationships with Agent Whisper"
        },
        "12421":{
            "author_id":"msdragon",
            "author_name":"Ms. Dragon",
            "choices":[
                "Swap specialties with Zephyr",
                "Swap specialties with Terminal",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Torque thought to how she had been a civilian police officer. She was an experimental viper who was sent out to build relations. Meanwhile, Whisper was a human defect, not gene-modded but still formerly loyal to Advent.<br>\r\nTorque looked down at the remote and decided to test it out, keeping a good grip on it. On a whim, she pointed it at Zephyr and Terminal, and spun the dials.<br>\r\nWhat was swapped?</span></div></div>",
            "created":1596797100,
            "id":2881753,
            "title":"Whisper is now Ex-Advent while Torque is not"
        },
        "124211":{
            "author_id":"msdragon",
            "author_name":"Ms. Dragon",
            "choices":[
                "Rule the world",
                "Mess with people's lives",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Instantly, Torque felt herself buff up. Taken aback by the change, she flexed her new muscles a bit and looked at Zephyr, who was now nimble and lean, and sparring completely differently.<br>\r\n<br>\r\nWhat was this remote? Torque thought to herself. What technology! Who created it? For what purpose?<br>\r\n<br>\r\nTorque grinned. She was going to have some fun with this.<br>\r\n<br>\r\nBut how? Should she rule the world? Mess with people? Or something else?</span></div></div>",
            "created":1596797580,
            "id":2881758,
            "title":"Swap specialties with Zephyr"
        }
    },
    "info":{
        "author_id":"msdragon",
        "author_name":"Ms. Dragon",
        "brief_description":"The swap remote makes it's way into the XCOM universe.",
        "created":1592949000,
        "description":"<td align=\"left\" class=\"norm\">Rules of the Remote:<br>\r\n1. The remote can swap anything, be it physical, mental, or even something intangible or vague.<br>\r\n2. Only those touching the remote realize the swap has happened- everyone else is oblivious.<br>\r\n3. The wand will adjust clothing, but not alter it, even if not the direct target of the swap. This keeps the clothing from falling off.<br>\r\n<br>\r\nRules for Chapters:<br>\r\n1. Non-character choosing chapters must be at least a paragraph long.<br>\r\n2. Use proper spelling and grammar.</td>",
        "id":2225117,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1596797580,
        "modified":1596797580,
        "pretty_title":"The Swap Remote in Chimera Squad"
    }
}