{
    "chapters":{
        "1":{
            "author_id":"kool_kid6",
            "author_name":"Kool Kid",
            "choices":[
                "A white blouse with a black and red striped skirt with black sandals",
                "A black and red 2 piece bathing suit and flip flops (swim class)",
                "A red collared sleeveless shirt and black denim shorts with black tennis shoes",
                "Black jeans, red tube top and black denim jacket w/ black boots",
                "Black and red striped romper with no shoes"
            ],
            "content":"<div class=\"\"><div> <span>Ally stepped out of the plane and took a breath of the fresh air. She wore her favorite blue jeans with a pink tank top, since it was a fairly hot day. She was excited to go to this new boarding school, even though she knew nothing about it. She saw girls of many different ethnicity and backgrounds all flooding into the different dorms. When she turned around, she saw the beautiful jungle that the school was surrounded by. There were plants and flowers that she had never seen before, not even online. It was strictly prohibited for students to go into the jungle without supervision, but being the slightly rebellious girl she was, she considered checking it out anyway.<br>\r\nIt was a Sunday, so school hadn't quite started yet. But the girls had gotten there early to give them time to unpack and explore the campus. Ally's dorm was on the very edge of campus (allowing easy access to the jungle) and on the third floor. As she stepped in the dorm room, she was aghast at how huge it was. It had to be four times the size of her bedroom. Providing room for each of her roommates living space, plus a small living area. <br>\r\nShe walked in to find one of her roommates. She was an African-American girl about three inches taller than her, with skin that had a shade that stood in the middle of light skin and dark skin. Her hair was in a puffy ponytail behind her head and she wore short jean shorts with a yellow tank top. \"Hi! I'm Aleyah, I guess me and you will be roommates this year\"<br>\r\nJust by her tone, Ally could tell she was a very social, but friendly girl.\"Hi, I'm Ally, nice to meet you.\" The two smiled and shook hands. <br>\r\nAnother girl then popped up from behind a bed. She was a short brunette girl with freckles all over her cheeks, she was two inches shorter than Ally was, wearing jeans and a tight blue t-shirt. \"Hi.\" she said timidly \"I'm Olivia, nice to meet you all as well\" Ally and Aleyah smiled and waved and then the girls went about their business unpacking. <br>\r\nAbout an hour later, their uniforms arrived, Ally opened the bag to find...</span></div></div>",
            "created":1560209940,
            "id":2671576,
            "title":"Day 1"
        },
        "11":{
            "author_id":"kool_kid6",
            "author_name":"Kool Kid",
            "choices":[
                "Jessie catches Ally in her dorm room alone",
                "Ally and her roommates visit the spa",
                "Jessie finds Ally alone in the pool",
                "She gets detention with Jessie"
            ],
            "content":"<div class=\"\"><div> <span>The blouse had an extreme lack of buttons on all of their shirts. The top two buttons were missing and the last few were only meant to be tied together, forcing the shirt to be a very revealing crop top. Olivia attempted to pull her skirt up extra high to mke up for it, but the skirt was a little to lacking in length as well as her perky butt was exposed from under. She whined as she saw in the mirror.<br>\r\n<br>\r\nAleyah came from behind to poke the girl in the behind causing her to jump and giggle. \"Sorry bout that Olivia\" Aleyah laughed, \"I couldn't help myself\"<br>\r\n<br>\r\nOlivia smiled sheepishly, \"Oh, it's alright\" she pulled her skirt back down to where it was meant to be, the skirt was still short and her midriff was exposed, but she was forced to cope.<br>\r\n<br>\r\nAs the other two girls finished getting ready Ally left the room to head to the advisory meeting early. As she walked down the hall, someone grabbed her and pulled her into the room. Ally opened her mouth to scream and someone covered it and pinned her against the wall. Ally could now see who it was. A brunette girl with green eyes and the same outfit on. Her eyes had somewhat of a sadistic look on them which made Ally extremely uneasy.<br>\r\n<br>\r\n\"Hi I'm Jessie.\" her eyes seemed calm now \"Sorry to scare you like that, I just wanted to say your extremely attractive and in all honesty, I'm a bit turned on by you\" ...seemed.<br>\r\n<br>\r\n\"Ummm...I'm gonna go\" Ally attempted to walk to the door when the brunette grabbed her by the shoulders and threw her to the bed.<br>\r\n<br>\r\n\"See I know this school more than any of the freshmen, and I know that tickling is highly encouraged\"she said as she straddled the girl's waist. <br>\r\n<br>\r\nAlly was terrified, the girl was strong for her stature. Jessie then leaned in to whisper in her ear. \"The second I have the chance, I'm gonna tickle you all over your cute little body\"<br>\r\n<br>\r\nAlly was frozen in fear. The next thing she knew, she was standing in the hall with the door shut behind her and Jessie gone.<br>\r\n<br>\r\nSoon Olivia and Aleyah came out and walked with her to the meeting, oblivious of her predicament. Later that day...</span></div></div>",
            "created":1585172100,
            "id":2807094,
            "title":"A white blouse with a black and red striped ski..."
        },
        "12":{
            "author_id":"kool_kid6",
            "author_name":"Kool Kid",
            "choices":[
                "\"Only if you guys come with me\"",
                "\"Fine, I'll go\"",
                "\"Can't we just go to class\"",
                "She's interrupted as the group had instead approached them threateningly"
            ],
            "content":"<div class=\"\"><div> <span>On their way to swim class, the girls spot a group of upper classmen girls who for some reason were walking around completely naked. The girls were confused but somewhat stunned at the sight.<br>\r\n<br>\r\n\"Ummmm...\" Ally said breaking their silence<br>\r\n<br>\r\n\"Where are their clothes\" Aleyah asked finally<br>\r\n<br>\r\nThey kept walking, but Ally couldn't take it anymore \"Olivia, go over and ask them why they're naked\"<br>\r\n<br>\r\n\"What?! No!\" Olivia said taken aback, \"If anything you should ask them\"<br>\r\n<br>\r\n\"No, you're the most innocent of the three of us, you'll probably get the best response\"<br>\r\n<br>\r\nOlivia thought to herself and said...</span></div></div>",
            "created":1562916600,
            "id":2685615,
            "title":"A black and red 2 piece bathing suit and flip f..."
        },
        "122":{
            "author_id":"carbonz",
            "author_name":"carbonz_",
            "choices":[
                "Help Celina and tickle the Team Captain (Justine)",
                "Help Justine and tickle the mean girl (Celina)",
                "Walk back to your own group"
            ],
            "content":"<div class=\"\"><div> <span>Olivia walks up to the group of upperclassman. Upon closer look, she realized how muscular they were.<br>\r\n<br>\r\n\"Hi everyone. Can I ask why you girls are naked?\" Olivia asked with a sweet tone of voice and curious eyes.<br>\r\n<br>\r\nThe upperclassman stop talking and look at her. One of them spoke up.<br>\r\n<br>\r\n\"Is there a reason not to be?\" She said in a defensive voice.<br>\r\n<br>\r\n\"Celina, calm down.\" Another student said. She then turns to Olivia. <br>\r\n<br>\r\n\"She's right though. We're student athletes and we tend to have great looking bodies. It would be a waste NOT to show them off.\"<br>\r\n<br>\r\n\"How are you going to shut me down when you said exactly the same thing I did.\"<br>\r\n<br>\r\n\"You're being mean to a freshmen. What's wrong with you?\"<br>\r\n<br>\r\n\"What's wrong with me?! You're the team captain, Justine. But you're always soft to others. Like your tummy!\" Yelled Celina as she starts tickling Justine's sides. <br>\r\n<br>\r\nJustine screamed and jumped, grabbing Celina's fingers. She then knocked them away and began retaliating, tickling Celina's sides. The group of upperclassman began cheering as Olivia watched in bewilderment as the situation. <br>\r\n<br>\r\nShe decides to</span></div></div>",
            "created":1564694640,
            "id":2695589,
            "title":"\"Fine, I'll go\""
        },
        "1223":{
            "author_id":"kool_kid6",
            "author_name":"Kool Kid",
            "choices":[
                "Justine's teammates tackle and pin the girls from behind",
                "The girls head to their class",
                "Justine tells them to skip with her and her friends"
            ],
            "content":"<div class=\"\"><div> <span>Olivia creeped away slowly back to her friends.<br>\r\n<br>\r\n\"So what happened?!!\" Aleyah asked<br>\r\n<br>\r\n\"I- I don't really know\"<br>\r\n<br>\r\n\"What?!\" They both asked in frustration<br>\r\n<br>\r\n\"I asked them, then they started arguing and then they just starteEEK AAAAAAHHHHH!\" Olivia jumped. She was interrupted as Justine had snuck behind her to tickle her sides.<br>\r\n<br>\r\n\"Why did you do that???\"<br>\r\n<br>\r\nJustine giggled \"I never got to answer your question.\" she said playfully. \"See, the rule is, once you leave your dorm, you're not allowed to put on any clothes, so if they come off in some sort of tickle incident, you'll be defenseless for the rest of the day.\"<br>\r\n<br>\r\n\"What the hell?? Is that even legal???\" Aleyah asked.<br>\r\n<br>\r\n\"This is an all girls private school in the middle of nowhere, I don't think anyone will care. Besides, it was in the paperwork.\"<br>\r\n<br>\r\nThe girls stood there amazed, realizing what they got their selves into.</span></div></div>",
            "created":1564872180,
            "id":2696710,
            "title":"Walk back to your own group"
        },
        "13":{
            "author_id":"kool_kid6",
            "author_name":"Kool Kid",
            "choices":[
                "Floor T of the student center",
                "Tickle Spa",
                "Stacy's dorm room",
                "Unauthorized visit to the tickle jungle"
            ],
            "content":"<div class=\"\"><div> <span>Ally puts on the unusual uniform and heads out. She is scheduled to do a tour of the campus with her roommates by one of the upper classmen.<br>\r\n<br>\r\n\"Hi\" a pale skinned brunette said enthusiastically \"I'm Stacy, I'll be your tour guide today\"<br>\r\n<br>\r\nThe girls smiled, \"Hi\" they all said matching her energy.<br>\r\n<br>\r\n\"You'll probably see me many times throughout the year, I'm a senior this year and being that this is the national school of tickling, I will be ensuring you all have plenty of laughs\" she said giggling deviously. The girls' grins suddenly became sheepish at this statement.<br>\r\n<br>\r\nStacy showed the girls all the basic locations on campus such as the nurse, the library, the student affairs office, and so on. They all began to get bored and tired. Stacy noticed this and smiled. She then told the girls their next stop and they immediately woke up.</span></div></div>",
            "created":1562916060,
            "id":2685612,
            "title":"A red collared sleeveless shirt and black denim..."
        },
        "133":{
            "author_id":"kool_kid6",
            "author_name":"Kool Kid",
            "choices":[
                "She suggests a game",
                "She takes Ally to her bedroom where all her tickle tools are",
                "Take off the girls shirts"
            ],
            "content":"<div class=\"\"><div> <span>\"How would you guys like to see one of the dorm rooms you have the option to get in the next few years.  Stacy said to their delight, \"It's a four person suite with a living room and kitchen.\" The girls had grown bored of the tour and were excited to have some fun.<br>\r\n<br>\r\nThe 4 of them then walked to Stacy's building. They were greeted by an adviser at the front desk. \"Are they with you Stacy?\"<br>\r\n<br>\r\n\"Yes Ma'am\" she replied, \"Gotta initiate the freshies\" <br>\r\n<br>\r\nThe lady laughed at this and then looked at the 3 girls. This made them wince but they figured it was only a joke. They made their way up to her floor. When they arrived at her room, only two of her roommates were in. <br>\r\n<br>\r\n\"Ally, Aleyah, Olivia...this is Jenna and Abby, 2 of my roommates\" The girls smiled and shook hands. \"Do you guys wanna help with some initiation stuff?\" They nodded in excitement. Now the three were getting nervous.<br>\r\n<br>\r\n\"Umm...what kind of initiation?\" Aleyah finally decided to ask. <br>\r\n<br>\r\nStacy smiled, \"Well what you don't know about this school is what the TK stands for. It's kind of what we're all about. And we were all instructed to introduce you guys to that fact in some kind way. So I figured I'd bring you guys up here because the three of us happen to be some of the best at this particular thing.\"<br>\r\n<br>\r\n\"And that thing is...?\" Ally said. She heard Abby lock the door behind them.<br>\r\n<br>\r\n\"Tickling\" Stacy said with an evil grin.<br>\r\n<br>\r\nAleyah was quick to move but it was to no avail being that the door was blocked by Abby. Jenna tackled her to the living room floor. Olivia was quickly subdued by Abby as she picked her up from behind and carried her across the room. Stacy then picked Ally up and threw her onto the pull out bed from the living room couch. She turned to see Olivia had been tied to the ceiling with arms way above her head. Her tiny body was barely able to touch the ground. Aleyah was tied in an \"I\" shape with her arms tied to the couch and her feet stretched out to be tied to the kitchen table. Stacy then grabbed each of her arms and tied it to a corner of the bed with a rope that seemed to be attached to the bed post. The mere convenience made it clear that they did this often. <br>\r\n<br>\r\n\"WHAT THE HECK IS THIS, IT'S NOT FUNNY!\" Ally screamed.<br>\r\n<br>\r\n\"Shhh...relax we're not gonna hurt you.\" she said calmly. \"Look, this was going to happen one way or another, we're actually being generous. And I promise you at the end of this, you're gonna have a lot of fun.\" Ally glared at her. Stacy responded with a giggle and immediately started tickling the girl's belly. <br>\r\n<br>\r\nAleyah looked over to see what was going on, but was soon attacked by Jenna in the same manor in her outstretched exposed armpits thanks to her sleeveless shirt.<br>\r\n<br>\r\nPoor Olivia however, was subject to the fiercest of the three ticklers, Abby dug her fingers into Olivia's ribs.<br>\r\n<br>\r\n\"Hmmm...before we get into this, I have an idea\"</span></div></div>",
            "created":1585169520,
            "id":2807059,
            "title":"Stacy's dorm room"
        },
        "134":{
            "author_id":"kool_kid6",
            "author_name":"Kool Kid",
            "choices":[
                "A lake filled with a slimy liquid substance",
                "A pretty tree where they decided to take pictures",
                "A home to an animal that they had never seen before"
            ],
            "content":"<div class=\"\"><div> <span>\"Why don't we go for a walk off of school grounds\" Stacy suggested<br>\r\n<br>\r\n\"Wait, isn't that not allowed\" Olivia said.<br>\r\n<br>\r\n\"Yes but it's rare that they check unless you need help getting out.\" Stacy said<br>\r\n<br>\r\nOlivia was unsure about going, but didn't want to already be seen as boring by her roommates, so she reluctantly agreed.<br>\r\n<br>\r\nThe four then quietly sneaked off grounds from behind one of the dorm buildings and into the jungle. As they walked, Ally felt something brush against her thigh making her jump, but she kept walking. There were all types of interesting plants that they'd never seen before. Soon they came to a clearing where they found...</span></div></div>",
            "created":1585170300,
            "id":2807071,
            "title":"Unauthorized visit to the tickle jungle"
        }
    },
    "info":{
        "author_id":"kool_kid6",
        "author_name":"Kool Kid",
        "brief_description":"A girl and her friends go through life in a boarding school that revolves around tickling.",
        "created":1560208800,
        "description":"<td align=\"left\" class=\"norm\">***Take 2, with not as long of a first chapter***<br>\r\n<br>\r\nEvery year, 250 girls are randomly selected to go to flower garden high school. A boarding school with all female students and staff, that's secluded from the rest of society in the center of a mysterious jungle. The only way to get to it is by plane, for the forest and its rivers is inhabited by strange creatures that have a habit to tickle its prey. Therefore, no one travels through this mysterious jungle. <br>\r\n<br>\r\nEven so, in the center of this seemingly never ending jungle lies a very different boarding school, that uses tickling in more than a lot of their teaching methods. From punishments, to playfulness, to even tickling classes.<br>\r\n<br>\r\nThis year, a girl named Ally has been selected to go to Flower garden high school. A 5'3 latina girl with hair down to her shoulder level. She is informed to bring all of her clothes, for she won't be in uniform on weekend days. She gets packed and ready to go by August 31st. However, neither she or any of the other 249 girls know anything about this school.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nNow for the boring part...rules<br>\r\n<br>\r\n-This story is almost strictly F/F, I say almost because I want to allow you guys to write freely. I will allow M/F and maybe a little bit of F/M but those two are are highly discouraged. Absolutely NO M/M. But overall, its an all girls school with an all girls staff so i don't even know where you'd fit it in.<br>\r\n<br>\r\n-Tickling interactions with plants and/or animals is also allowed.<br>\r\n<br>\r\n-Nudity is allowed<br>\r\n<br>\r\n-No killing off characters<br>\r\n<br>\r\n-Just tickling or lick tickling<br>\r\n<br>\r\n-Not too much sexual stuff...it should ultimately result in tickling<br>\r\n<br>\r\n-Lots of tickling though, so yea have fun</td>",
        "id":2193070,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1585172100,
        "modified":1585172100,
        "pretty_title":"TK boarding school"
    }
}