{
    "chapters":{
        "1":{
            "author_id":"maggs30",
            "author_name":"Morphinteractive",
            "choices":[
                "\"keep you around as my personal office slut.\"",
                "\"make you dumber and your body change when you break a rule.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Anne, I'd like to talk to you in my office\" phil, her boss said over the intercom. Everyone else looked over their cubicles at her. She felt embarrassed. As she slowly walked to phil's office, people continued to stare. They might have been looking out of pity, as she was new and couldn't get uses to the strict rules, but they were probably looking out of lust. Anne was wearing high heels that could have been mistaken for a stripper's, an olive green skirt that came down mid thigh, and a low cut green sweater that pushed up her boobs to show some nice cleavage. Once she got into his office, he told her to sit down. Even Phil couldn't help but stare as she crossed her legs. \"Now, I know you're new to this office and you've had some trouble following the rules multiple times.\" Assuming she was going to get fired, she began to cry. \"Dont cry, I'm not going to fire you.\" She sniffled, thinking there was a catch. Phil made her a cup of coffee, puttin what she thought was two packets of sugar in. She took a drink, wondering why she didn't taste the sugar. \"I'm going to...\"</span></div></div>",
            "created":1268623860,
            "id":851200,
            "title":"Start"
        },
        "12":{
            "author_id":"maggs30",
            "author_name":"Morphinteractive",
            "choices":[
                "She becomes so dumb that she keeps breaking multiple rules",
                "She wants to grow bigger, and breaks into Phil's office and takes more nano bots",
                "She never returns to work, thinking she wont grow, but she continuously does  "
            ],
            "content":"<div class=\"\"><div> <span>\"That 'sugar' I just put in your coffee was really nano bots programmed to morph your body whenever you break a rule.\" Anne laughed, thinking he was nuts. \"Since your not taking me seriously, I'll tell the bots that you broke a rule.\" He pressed a button under the edge of his desk and Anne stood up, beginning to feel tingly, but nothing happened. \"Wow, you had me goin for...\" and before shecould finish her sentence, her body almost instantly grew. Her breasts were now DDDs overflowing her blouse. Her hips, legs, and butt grew bigger, straining her skirt. She was now at least 6'2, turning the mid thigh skirt into a mini skirt. Her lips grew fuller, now bigger than Angelina Jolie's. Anne just stood there in shock. \"Now if you can go a whole day without breaking a rule, you'll return to normal when you wake up the next morning. But if you break multiple rules, you'll get even bigger than you are now.\" Luckily, it was the end of the day, so she wouldn't have to stay like this at work. She quickly walked out of Phil's office. She attempted to avoid being seen, but that was impossible. She couldn't run, as she was afraid her skirt would rip off from being so tight. Her add and hips were so stuffed in the skirt that she had to walk one foot in front of the other. She made it to the exit and got home.</span></div></div>",
            "created":1268625240,
            "id":851209,
            "title":"\"make you dumber and your body change when ..."
        },
        "122":{
            "choices":[
                "Make her fatter, only",
                "make her taller and fatter",
                "make her taller, only"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She broke into his office and found the nano-bot controls and sets them to...</span></div></span></div>",
            "created":1289867820,
            "id":994400,
            "title":"She wants to grow bigger, and breaks into Phil&..."
        },
        "1221":{
            "choices":[
                "Phil finds out the controls were tampered with!",
                "Annie starts breaking rules left and right!",
                "Nothing happens, Annie is well behaved"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Annie set the boys so that they would only fatten her.<br>\r\n<br>\r\n\"I can just work it off anyway, it's not like I break THAT many rules around here.\" She scoffed to herself as she left the office.<br>\r\n<br>\r\nThe next day:</span></div></span></div>",
            "created":1458018060,
            "id":2117720,
            "title":"Fattening Nanobots"
        },
        "12212":{
            "choices":[
                "The Next Day",
                "The Next Week"
            ],
            "content":"<div class=\"\"><div> <span>Annie came into work the next day and greeted Phil.<br>\r\n<br>\r\n\"Hey, Phil! How are you this morning?\" She said cheerily<br>\r\n<br>\r\n\"Oh, you know, the usual. You're late, by the way, so that'll be some punishment.\" Phil said as he pressed a button under his desk. Immediately, Annie's clothes became tighter, a twenty pound gain! Her breasts starting straining her blouse and her skirt rode up some.<br>\r\n<br>\r\n\"Maybe this won't be so easy to work off...\" Annie thought as she went to her desk to start working. Throughout the day, it was little things, not anything that would get her in major trouble, but were technically breaking the rules. Improper formatting, Being out too long for lunch, not meeting the daily productivity quotas, the infractions kept piling on and on; as well as the weight.<br>\r\n<br>\r\nBy the end of the day, Annie had gained about 120 pounds, she was practically spilling out of her clothes! Her breasts had become huge H cups, her belly had broken the fastening on her skirt and was quite shapely, her hips and butt were so large her knee length skirt was just enough to cover them.</span></div></div>",
            "created":1461891120,
            "id":2140566,
            "title":"Annie the Rule Breaker"
        }
    },
    "info":{
        "author_id":"maggs30",
        "author_name":"Morphinteractive",
        "brief_description":"An gets in trouble at work, with strange consequences.",
        "created":1268622780,
        "description":"<td align=\"left\" class=\"norm\">Anne is 5'8, brown haired, brown eyed, with d cups.<br>\r\n<br>\r\nAnne works at an office, and continuously gets in trouble for not following orders. After being fed up with this, her boss, Phil, decides to make her grow whenever she breaks a rule or gets in trouble.<br>\r\n<br>\r\nSex is allowed<br>\r\n<br>\r\nKeep her under 10 ft tall<br>\r\n<br>\r\nkeep her somewhat proportionate<br>\r\n<br>\r\nno vore<br>\r\n</td>",
        "id":1655270,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1461891120,
        "modified":1461891120,
        "pretty_title":"Anne's business B.E. Story"
    }
}