{
    "chapters":{
        "1":{
            "author_id":"aeroneonookami",
            "author_name":"Aero Neon Ookami",
            "choices":[
                "I was surrounded",
                "I noticed something...weird.",
                "The dark clouds...they....",
                "there was no-one, creepy",
                "a werid aura could be felt..."
            ],
            "content":"<div class=\"\"><div> <span><u><b>Kaido P.o.V.</b></u><br>\r\n<br>\r\n       \"Big....bro...please don't go. Please don't leave me.\" Were the cries of baby sis who sat on the dark, cavernous, rocky yet somewhat smooth edge deeper in the cave, wounded, bleeding, legs and arms covered in bloody bandages. She was scared of the dark and without me during a time like this, a soon-to-be fight, but I had to go and I didn't leave her alone, I left her with our step-mom and her clan of foxes. That bastard, Riku, took his anger out on my sister when I least expected it to find me, she thought he was only kidding around. I left her alone, I left her no guardian, it's all my fault.<br>\r\n<br>\r\n       \"Sis forgive your big brother, as I take my katana, Tsuangai (A/N: Moon Blade, don't know how to really spell it) all to accept \"his\" challenge. I will make him pay for doing this to you.\" I grabbed the hilt of Tsuangi, pull it out letting it feel the rain's cool, wet touch. The rain, I couldn't tell if it should feel good or if it and the darkness meant to wash me away. I took the only road leading to the big city in an attempt to find the leader of Legend of Blood, Riku. As I walked, thoughts of my sister and how she looked when she didn't come home and I ended up looking for her, kept making me angrier and speed my walk to a super fast motion, my ninja side forcing me to get there sooner or later. As soon as I got there in the middle of the plaza...</span></div></div>",
            "created":1331241240,
            "id":1291112,
            "title":"The First Battle of Fate"
        },
        "12":{
            "author_id":"aeroneonookami",
            "author_name":"Aero Neon Ookami",
            "choices":[
                "Black Fox (you)",
                "Ryuu",
                "Neither"
            ],
            "content":"<div class=\"\"><div> <span><u><b>Kaido</b></u><br>\r\n<br>\r\n     On the ground in front of me was a amulet that when I touched it, everything went crazy and blurry. It was as if the the thing itself was poisoned. \"Master Riku, was right. Heh. Who knew that would work, too bad I don't get to kill ya myself, Black Fox.\" A person said before jumping down from the what seemed to be 45-story building, but after a closer look at the person I noticed his dark green scales, a tail much like a lizard, a muzzle much like one too, and four wings much like a dragon. \"Well, you don't look much like a fox. Dang, ah well, time to collect my pri-\" I took the time during his walk toward me, since he wasn't much bigger than me, luckily, to prepare to strike. When he got close enough, I slashed at him only to give him a cut on the lip. He stumbled backwards for a second before getting back his composure.<br>\r\n<br>\r\n     \"Why do you work for Riku, dragon?\" I told him finally standing up. It was due to my step-mom and her unbreakable will to get me to make sure any kind of poison wouldn't KILL me but it still bothered my body.<br>\r\n<br>\r\n     \"I wanted to kill the all-famous Black Fox. Enough said.\" He told me with a smirk on his face. I couldn't tell what he was planning but thankfully his fire wont be able to work in the rain. \"Let's make a deal, Fox. Should you win, I will tell you a clue to find Riku...\"<br>\r\n<br>\r\n     \"And should I win, you work for me and only me.\" I told him and he just nodded. I took my chance to rush him, getting right next to him in a few seconds with flash step (A/N: Something he learned with ease. It gets the person to go about somewhere from 40~75 mph, it's \"normal\" walking speed most of the time.) swinging my katana at him, for him to kick me hard in the chest and me to cut him deep in the underbelly. I was sent flying threw the air, rain hitting me like bricks until my back met a wall, cracking the wall in the process. It felt as if it should hurt a normal person, enough to cough blood, but I was different my step-mom's husband forced me to get my body stronger.<br>\r\n<br>\r\n     \"Hmm...? Your still...alive? No human should live that, even if they do, no one should come out of it still fine. Interesting...lets make this the almost-fatal attack, the one who doesn't end up in the position, 'lives' and wins.\" He told me before quickly running at me. I got out of the ruble and did the same but faster. It was decided then and there that the winner was...</span></div></div>",
            "created":1331243580,
            "id":1291138,
            "title":"Kaido VS Ryuu"
        },
        "121":{
            "author_id":"aeroneonookami",
            "author_name":"Aero Neon Ookami",
            "choices":[
                "got there no problem",
                "got stopped halfway into Center Street (fight)",
                "got stopped somewhere between the end and halfway of Center Street (????)"
            ],
            "content":"<div class=\"\"><div> <span><u><b>Kaido</b></u><br>\r\n<br>\r\n     I had my katana barely poking the dragon's neck. \"I win.\" A laugh came from my target and I brought my sword back into it's scheth (A/N: CAN't SpeLL).<br>\r\n<br>\r\n     \"Master Riku, was correct in thinking you'd win. Well former master.\" The dragon said as he looked at me intensely. \"Master Black Fox, let's go I have somewhere to show yo-\" Was all I heard before falling out unconsious. Sure step-dad made my body stronger but he forgot to tell me if I relax it'd do this, plus he only got to do this for a few months.<br>\r\n<br>\r\n     I was just barely waking when I heard conversation going on around me. I tried to move, but got restrained each time. It was then I heard a certain voice I <i>wished</i> never for it to be Riku's. \"You shouldn't be forcing yourself to move, not just yet, Kaido Suzuki or best known as...Black Fox, leader of SeeD.\" This time however wasn't filled with hatred, regret, or anything bad...it felt as if it meant nothing bad. I opened my eyes to find a white-haired, blue eyed, normal-looking Riku and a redish green eyed dragon. \"'Morning Sleepy.\"<br>\r\n<br>\r\n     \"Why...why did you attack my sister!? She had nothing to do with us!\" I told him anger building and building as I looked into the eyes of my rival and enemy. He didn't speak for awhile in fact, it was as if he was in total shock.<br>\r\n<br>\r\n     \"Yuna...-chan? Was...attacked...?\" He said weakly as he stared into the ground before falling to his knees. Loads of his guys going to his side. His worry for my sis, both pissed me off and confused me at the same time.<br>\r\n<br>\r\n     \"YES BY YOUR HANDS!! I found wounded and bleeding in the alleyway near Center Street.\"<br>\r\n<br>\r\n     \"IT WASN'T ME!!!! I...I....uh...went on a date with her actually. Found out you and her were family while we talked and ate. She headed to Center Street on her own, lost her after she...um...kissed me. I know this because Ryuu here knew Yuna already but not much you and saw her down it. Now before you say or act irrational, I love your sister. I might hate you a bit and Ryuu hates most humans and took this chance to fight you, but I would not harm even a bit of precious, silky, wonderful and long hair on her pretty and lovely face. I would even do anything to get to her and be with her.\" He said at the end being nonchalantly, but the hatred in my heart wouldn't subsided until I, now, had his head. I wanted to kill him more because of what he said, my super over-protectively crazy brotherly side taking over my real side, my calm accepting side. That was until I thought about it, that night that this all happened...if it wasn't him I saw...then...oh sh--...<br>\r\n<br>\r\n     \"YUNA'S IN DANGER!!\" I said finally breaking my restraints that I have been trying to escape from. Everyone and Riku helped get ready fast and we ran out of the building we were in. I noticed that Center Street was the only thing between us and my family. We had to rush there no matter what stood in the way. Riku's followers were trustworthy and felt as if they owe him their lives except Ryuu. We...</span></div></div>",
            "created":1331246400,
            "id":1291182,
            "title":"Winner's rewards"
        },
        "1213":{
            "author_id":"aeroneonookami",
            "author_name":"Aero Neon Ookami",
            "choices":[
                "The battlers: Kyuubi and Ryuu",
                "The group getting 'home'",
                "The defenders at 'home'"
            ],
            "content":"<div class=\"\"><div> <span><u><b>Kaido</b></u><br>\r\n<br>\r\n     \"Honey~\" My step-mom called from the side of us as we made it near the end of Center Street. I stopped and walked over to her at first seeing her normal red long hair much like my sis's purple hair dew, red-eyes, a kimono she normally wears, and foxy smile (A/N: Yes this part is purely a bit fanfiction-y and it's a Naruto-ish part but NOT exactly like Naruto and well...just see for ya self) but as I got close enough I saw Kyuubi! She had her nine-tails behind her, marks that were over a lot of her body, red-orange fur, red-slitted eyes, and her foxy smile. \"Hello, my kit. I figured they'd try for an attack once ya left. Yuna's feeling better right?\" From her tails came out my sister, her happy smiley warm self, that could warm even the most cold-hearted person's heart.<br>\r\n<br>\r\n     \"Yuna-chan!\" Came from behind me as I walked towards her calmly, her face brightening my day, only to be pushed aside for Riku to hug my sister and the too get into a deep kiss, that made his teammates go 'awwww'. That was until they felt my KI (A/N: Killer Instinct) rising like a someone adding fuel every few seconds.<br>\r\n<br>\r\n     \"KAIDO!\" My step-mom, who is named Umi, growled at me, making me calm down. To me, she is our birth mom, and she was prepared to make us her blood-related kits, step-dad, who I believe is a wolf, and whom we call Wolf, agreed we did it soon. That was until when the string of fates of what was to come happened, killing many, and in order to save everyone I had to form SeeD and fight.<br>\r\n<br>\r\n     \"Ahhh what a touching moment for you two, especially you...leader.\" A dark voice that I knew had to be the owners of the one who was a member, Blane. I looked behind me as a shadow appeared before my presence.<br>\r\n<br>\r\n     \"...Rios....\"<br>\r\n<br>\r\n     \"Kaido...I see. Riku never intended to kill you two. What a shame.\" The shadow formed a fox similar to mom, but their was obvious differences, mainly his black fur.<br>\r\n<br>\r\n     \"Rios....or should I call you, Blane the Shadow Fox. Where's Nero...?\" I said remembering them always together, so if one was here so was the other. Then Nero, acting as one of Riku's men came out dagger aiming towards Riku. I quickly took out Tsunagi and tried to defend him, but Ryuu acted first and grabbed Nero by the arm, throwing him into the wall behind Blane.<br>\r\n<br>\r\n     \"No one attacks them without going past my dead body.\" The dragon said getting into a defensive stance in front of us. Mom did the same.<br>\r\n<br>\r\n     \"Hehehehe. You just made me mad. No one attacks my kits or soon-to-be mates and gets away with it....alive.\" Her foxy smile both showed anger and happyness.<br>\r\n\"Kaido, honey? Please get back home, we'll deal with these guys.\"<br>\r\n<br>\r\n     \"Ok mom.\" I told her as I lead everyone to 'home'.<br>\r\n<br>\r\nWHO WILL YOU FOLLOW??</span></div></div>",
            "created":1331252040,
            "id":1291214,
            "title":"Nero & Blane VS Ryuu & Kyuu part 0, meet... (WIP)"
        }
    },
    "info":{
        "author_id":"aeroneonookami",
        "author_name":"Aero Neon Ookami",
        "brief_description":"It's a battle story where MC must fight to survive. Random at times.",
        "created":1331239320,
        "description":"<td align=\"left\" class=\"norm\"><b>Kaido \"Black Fox\" Suzuki</b><br>\r\n♦Last remaining member and Leader of the gang widely known and feared that got the name, SeeD, since a lot of members knew grass and earth-type elements. His element is Fire, but its not always red fire. Got his nickname from his skills as a ninja and his sister loves to refer to him as Fox. His attitude is unkown. He is 20 years old. 6'1''.<br>\r\n<br>\r\n<b>Yuna \"White Fox\" Suzuki</b><br>\r\n♦Not a part of any gang, since her brother is too protective of her to let her. Her known magic, is unknown. She got her nickname for being such a fox lover and being around her brother. She has a heart of gold, she's kind, loving, compassionate, selfless, and very friendly. She's only 17. 5'5''.<br>\r\n<br>\r\n<b>Riku</b><br>\r\nNot much is known about him except he is the leader of the rival gang, Legend of Blood.<br>\r\n<br>\r\n<u><i><b>AUTHOR'S NOTE</b></i></u><br>\r\nI know the names suck for gangs but it doesn't matter. The story takes place 3 years since the first short battle against the gangs. I might call them gang or group I mean the same thing.</td>",
        "id":1853555,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1331252040,
        "modified":1331252040,
        "pretty_title":"Battle for Fate: The fate of Black Fox"
    }
}