{
    "chapters":{
        "1":{
            "author_id":"dragonsoul",
            "author_name":"dragonx",
            "choices":[
                "North road",
                "East road",
                "West road",
                "Northwest road",
                "Northeast road"
            ],
            "content":"<div class=\"\"><div> <span>It was a beautiful spring morning, the sun shined brightly over the small village of Treemout. You stir from your slumber, looking out your window. Your name is Mayfair, and you are a beautiful elf maiden. As you change out of your night clothes, you think about visiting your boyfriend, who, sadly, lives quite far away.<br>\r\n<br>\r\nAfter slipping into your daily clothes (you have multiples of the same outfit), you walk into you den, just thinking about what to do. You haven't seen Vince in a while, and it is tempting to see him again. Problem is... the roads that lead to the village of Monuna, at the base of Demon's Peak, is quite dangerous, especially for an unprotected elf maiden like yourself. Sure you may possess magic, but it's all healing types. You sigh in frustration.<br>\r\n<br>\r\n\"Man... this stinks. If only my boyfriend lived here, that would make things much easier. *Groan*\" You look out the window to see a Spikey, a fiery wolf monster, prowl the perimiter of the village. The village is protected by a barrier, but you know for a fact that once you step outside of it, it's anybody's game.<br>\r\n<br>\r\nOver the winter, while you were collecting winter herbs for your healing tonics, you were ambushed by a pack of Spikeys, and was devoured alive by the Alpha Male. As you weeped inside the stomach of the creature, thinking it was the end, something odd happened. Oh, sure, you digested, but you awoke in your bed, although lacking any clothing. You thought you had died, but there may be something different about you than the other elves. You seem to die after being digested, but you always wake up in your bed, unharmed.<br>\r\n<br>\r\nYou think for a moment... maybe this odd ability could aid you in trying to see Vince. If you are revived after being digested... then you are, possibly, immortal! Or at least damn lucky. Either way, you might stand a chance at surviving this trip. You snap your fingers, and smirk, \"Heh, no problem, if I can't die like that, then I can make it to Monuna without dying!\" But then a dark thought passed through your head... What if it doesn't work that way? What if those few times were just a wierd act of God? You gulp and shudder to think of actually dying in a monster's stomach. But you gulp down your fears and decide to do it.<br>\r\n<br>\r\nAfter visiting the local store to get some supplies (the trip will take at least half a month, give or take), you swing your pack over your shoulder, take one last look at the village (in case you do die), and head out. After about an hour of hiking, you come to a major fork in the road. Which way do you go?</span></div></div>",
            "created":1150261200,
            "id":324447,
            "title":"Make it, or Die Trying"
        },
        "11":{
            "author_id":"dragonsoul",
            "author_name":"dragonx",
            "choices":[
                "a squirrel",
                "a Spikey",
                "a naga",
                "a Saber Tiger"
            ],
            "content":"<div class=\"\"><div> <span>You decide to take the North road, it is the shortest distance from Treemout to Monuna, but also one of the more dangerous roads. But you think about your unusual ability, and swell with confidence. Bravely, you march on, but you get unnerved when you hear a low snarl. Turning sharply, you look around, nothing within your eyesight. \"Relax Mayfair, you're being stupid. Sure, I may look like a tasty snack... and I probably am... but that isn't gonna stop me from seeing my boyfriend! Just keep moving, and you'll be fine.\" Taking one last quick glance behind you, you move onward, but a pair of blood red eyes gleam at you, then they dissapear.<br>\r\n<br>\r\nBy nightfall, you make it to a small stream, and decide to camp for the night. As you unpack your stuff, you look around nervously. You know you are vunerable outside of the elf magic barrier, and you know that anything could pounce while you sleep, and you hope nothing does. After unrolling your sleeping bag, your large ears quiver as they hear the soft rustle of leaves, and a snap of a twig. You snap around, beads of sweat on your forehead... something is near!<br>\r\n<br>\r\nFealing around you, you grab the small sword you bought earlier, and brace yourself to defend yourself. You hear the leaves rustle again, then the soft hooting of an owl, your eyes darted from on spot to another. Suddenly, out of the bushes comes...</span></div></div>",
            "created":1150261200,
            "id":324449,
            "title":"Headin' Up North!"
        },
        "111":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "go left ",
                "go right "
            ],
            "content":"<div class=\"\"><div> <span>it was just a squirrel you fell over laughing as you looked at the harmless creature. \" damn i'm jumpy he would be laughing right now.\" your boyfriend was a warrior in the village defending you and others from creatures far to powerful for a normal man. he was also one who liked to joke about how much of a warrior you were not. ' you can't use a blade mayfair your more mage if anything.' he always said when you tried to practice sword play.  the squirrel was looking at you as it  moved closer. it went over to your booted feet and started biting your toes. \" ow hey your to small to eat me now stop it.\" you say kicking it.  the squirrel flew half way arcross the campsite as you laid down.  you once again heard the squirrel comeing back and you woke up. it looked at you with sad eyes. ' oh are you alone little one do you want company?' you said patting your sleeping bag. the animal ran up to you as you hugged it. <br>\r\n<br>\r\nthe next morning you and the squirrel woke up. \" ok little one if you wish to come then come just don't delay me any further.'  the animal jumpped into your back pack as you walked further into the deepest part of the area. you started to sing a tune as you walked and notice the path was getting smaller. then you came to a big cave. \" is this the cave that leads to my boyfriend?\" you say looking around then out of nowhere a giant bat came out of the cave. it looked at you hunger. ' m,y dear sweet elf what might you be here in the bat cave?\" it said with a vampire like accent.  you looked at the huge black bat. it was like most bats in your village but much bigger and it could talk what a great combination. you never liked bats that much he your boyfriend that is always drove them off during the night. but the barrier did that now but it was not the same. \" i'm mayfair i come from the small village down south and i wish to go through here to get to Monuna a village over demon peak.' you say but the bat does not move. ' miss this cave leads to no village demon peak is not this way your compliantly  off course. \" you looked at the bat. you knew your boyfriend came this way you just knew. you had a good sence of direction you did not need a map to find anything. the little animal came out of your pack. ' oh a tasty squrril and a lost elf my this will make a great breakfest i am sure.'  you started to walk back as the bat started to fly towrds you. \" don't move i have a sword i can kill you just like my lover vince can.\" you say and the bat stopped. hearing vince's name had effected him. \" did you say vince as in the warrior vince oh dear oh dear.\" you looked at the bat. \" yes and i want to see him he is at a village at the base of demon peak but from what i am told it is more over the peak.' the bat looked at you. \" vince is a demon to us he kills us all the time he is a monster.' you laughed. that sounded like vince he was a very great swordsmen and would not sop a fight until his victim is dead. the bat looked around. ' ok the man you are looking for is somewhere on the other side of this cave but demon peak is very far after this cave.' the bat said as he flew off.  the bat dropped a map and you looked at it. ' ok so after bat cave i have to go through like 3 more things till i get to demon's peak then i have to go over the peak and then ugh a desert just great and the village is in the middle of it.' you sighed. \" vince better be thankful about this beacuse if he is not we are through and i mean it this time.' <br>\r\n<br>\r\nyou and your animal friend entered the cave. the map did not tell you where you should go in the cave only what was after it. you hit a fork. </span></div></div>",
            "created":1273554000,
            "id":881642,
            "title":"a squirrel"
        },
        "1111":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "wak up in your house ",
                "you finally die "
            ],
            "content":"<div class=\"\"><div> <span>\" lets go left\" you say to your little friend and walk. as you walk you noticed the tunnel getting darker. you had hoped there were no more bats in here. \" i need to sit down\" you say as you enter a huge chamber with a rock in the center. you sit down and take off your boots. the squirrel started to nibble on your toes. \" would you stop that i swear.\" you say but in your head you enjoyed it. \" well who is this tasty young elf in my cave.\" said a voice that made you jump. you look behind you and there was a giant plant talking to you. you got up and fell over the plant laughed. \" mmm a tasty young elf has entered my section of the cave oh this will be yummy.\"  you started to grab for your sword but the palnt grabbed it. ' sorry sugar cakes but i'm not like those other predators i know how you warriors act.\"  the plant wrapped his vines around you. ' please i'm so close to getting to my boyfriend.' the plant laughed. ' no one ever got out of this cave with out going into my belly your boyfriend most likely is dead little one.\" <br>\r\n<br>\r\n\" but the bat said this cave lead to daemon peak.\" you said and the plant laughed. ' oh it does but you went the wrong way your in my home now.\"  the plant opened it's mouth and shoved you head first. you were crying as the plant swallowed you whole.  as you entered the plant's belly you head the squirrel run away. \" some friend he was.\" you said as the acid went over you.\" </span></div></div>",
            "created":1314367620,
            "id":1175493,
            "title":"elf eating plant "
        },
        "11111":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "take lilly's idea and go to the snake forest ",
                "leave her behind and go to the bat cave. "
            ],
            "content":"<div class=\"\"><div> <span>you wake up in your bed and sigh. \" i'm never gonna see him again\" you say as you get up dress walk over to the store and buy another set of supplies along with a new sword. as you exit the village you hear someone. \" mayfair why do you even try?\"  it was lilly one of your friends. she was wearing her normal dress and was barefoot as she never liked shoes. \" i told you this before lilly i must see vince.' lilly looked at you. ' just get another man we elves have long lives if you die you are wasting what the gods gave us.\"  you turn around to lilly. ' listen here I know you like flirting with whatever man you meet but i'm not like that i love vince.\"  as you walk out the gate lily calls. ' hey can i come with you it is boring here.\" you look at her. ' as long as you understand you may die i may be able to come back after getting eaten but you can't.\" lilly giggled and told you to wait a few minutes. she came back with a bow and arrow. as the two of you walked down the path lilly started talking. ' an adventure with just us girls.\" you sigh. lilly thought this was just a joke you knew it was curel but you hoped something would eat her sooner rather then later. the only reason she called lilly a friend was beacuse she felt sorry for her. lilly was the town's slut she had slept with every man in the village at this point except vince who was off limits. <br>\r\n<br>\r\nyou both walked up to a lake. ' i need to sit down mayfair.\" said lilly and she took off her shoes they were not boots like one should wear on a journey no they were normal sandels. \" can we rest here today i'm pooped.\" lilly asked and you sighed. \" we only just started i need to get back to that bat cave.' lilly looked shocked. ' bats I hate bats lets go somewhere else.\" you looked at lilly. ' no the cave is the only way to demon peak as long as I don't meet that plant again we should be good.\"  lilly got up. ' i have a map and if we go through the marble plains we will get to demon peaks.' you look at the map but it showed that the plains lilly wanted to go to was a longer path and had to go through snake forest and a swamp. \" I don't want to get eaten by a snake lilly.\" lilly stomp her foot. ' and i don't want to get my blood sucked by a bat.\"  this was going nowhere. </span></div></div>",
            "created":1314368340,
            "id":1175501,
            "title":"wak up in your house "
        },
        "111111":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "nah never liked her  anyways ",
                "I better save hr "
            ],
            "content":"<div class=\"\"><div> <span>\" ok lilly we will go to your snake forest but just be forewarned if a snake comes after us your more likely the meal.\" you say with a evil grin. \" mayfair it's not just snakes there but nagas.\" why lilly mentioned this you never know but you got up and started walking to the forest. as you got to the snake forest you noticed two nagas. \" get down lilly.' you say. the two nagas  were both male and were very handsome.  \" lilly we need to be slient or they will hear us.' lilly was not paying attention she had that look in her eye the one she had when she wanted to have sex with something. ' but mayfair they are so good looking.' she said and started getting up. \" oh look it's an elf lunch is served.\" said one of the nagas.  both nagas went and grabbed both you and lilly. '  just eat lilly I need to get to my boyfriend.\" the nagas laughed. ' we are both hungry our leader did not let us eat before we went on patrol we are gonna have elf stew.\" before you knew it both you and lilly were sitting in a pot full of vegetables. the nagas were debating which one of you they wanted. ' that one with the sword looks tasty.\" said one but the other one wanted you. \" um excuse me my name is lilly would you fine gentlemen want to have some fun before you eat us.' the nagas looked at lilly. \" you mean have sex with both of you?\" you sighed.' no she means both of you have sex with her.\" lilly smacked you on the head. \" i'm not a 3 some kidna girl mayfair you have to do it to.\" the nagas laughed.\" ok before lunch sex would hit the spot right now come here girl.\" one of the nagas took lilly and you were left with the other. \" um sorry to say but i'm not into elves.' he said. this naga had brown hair and blue eyes he looked sweet if not for the fact he was about to eat you.  \" yeah i already have someone I would like to meet him but you have me in a cooking pot.' you say and the naga laughed. ' oh you mean him he is a jerk to be fair i'm not that hungry so if you want I could let you go.\" you laughed. ' so you only act tough around that other naga?' the browned haired naga nodded.\" yeah i'm not a very good naga i hate eating people i only act like this so they don't kill me or kick me out of the tribe.\" he grabs you out of the pot and pats you on the back. ' sure you don't want to save your friend?\" </span></div></div>",
            "created":1314369180,
            "id":1175505,
            "title":"take lilly's idea and go to the snake forest "
        },
        "1111112":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "lilly did not reform ",
                "lilly reformed "
            ],
            "content":"<div class=\"\"><div> <span>you knew you were going to regret it but you were not that heartless. you walked over to where the other naga and Lilly were having sex. \" oh your such a great naga.\" you heard lilly say. you question how a naga would have sex with an elf when he had no sexual parts to speak of. \" mmm your such a sweet girl i want to swallow you whole instead of haveing stew.\" the naga said and he opened his mouth  and was about to swallow lilly when you grab your sword and stabbed him in the back.  lilly fell over and you looked as the naga was now covered in blood. ' i'm not as defenseless as I seem.' you say and lilly got up. ' me and him were about to have the best sex i ever had and you rueind it.' lilly said getting her dress back on. ' if by best sex you mean being swallowed whole then yes I did stop it.\" you said and lilly was still mad. ' you get eaten all the time and the one time i want to you stop it.\" you sigh. ' I can reform after getting eaten you can't.\" but lilly was still mad. ' oh you think so ok i'll place this little bet find me something that can swallow both of us if i can't reform you win.\" you were dumbstruck lilly wanted to bet her life on this. ' um lilly this is stupid lets just go.' but lilly would not go. ' your just a chicken.' you looked at her. \" your being stupid being eaten is nothing like sex it is painful and i hate haveing to wake up in my bed every night.\" lilly looked at you. \"  your just a chicken you get eaten all the time but when it's someone else you step in but you let yourself get eatn.' you sigh \" fine  but i'll ask the other naga if there is anything that can swallow both of us.' lilly looked at you. ' just have him eat us.\" you laughed. ' he does not like eating people.\" lilly loooked dumbstruck but you both walked over to the other naga. <br>\r\n<br>\r\nyou both walked over to the brown haired naga. ' hello eleves what do you want.\" you told him you wanted something to eat both of you and he looked suprised. ' um well there is a dragon just north of here he may work.' lilly looked happy. ' eaten by a dragon this is gonna be fun and mayfair has never been eaten by a dragon before.\"  you sighed told the naga good bye and walked to where the dragon was. <br>\r\n<br>\r\nhe was in a huge one roomed cave and was sleeping. \" ok mayfair wake him up so he can eat us.\" you sighed. ' you do know your gonna die.\" lilly laughed. ' how do you know this gift is not just for female elves.' she did have a point it could be beacuse you were a female elf that you could reform but that sounded silly. you kick the  dragons nose and he wok up. ' who dares awaken the red dragon of the north/\" he says and looks at you. ' mmmm tasty female elves i have not eatn some of you in a long time not sence dragons were banished from the areas around your village.\"  you did remember hearing about dragons and elves liveing together but that came to an end in the dragon elf war 100 years ago.  \" we want you to swallow us both.\" you say. the dragon said nothing but he picked both of you up and opened his mouth.  he tossed both you and lilly onto his tounge and lilly laughed. ' oh this is gonna be fun.' you sighed. you had to deal with this alot sence you found out you could reform so this was just tedious.  the dragon swallowed and both you and lilly entered  his thorat. ' man dragons sure eat faster then anything else that has eaten me must be beacuse of thier size.\" you say as both you and lilly neetre the dragon's stomach. \" ok the bet is on if I don't reform well i die bt if I do it means only female elves can refrom.\" lilly said and you sighed at how stupid this was as the acid covered both of you. <br>\r\n<br>\r\nyou woke up in your bed. ' beacuse that stupid bet i'm nowhere near close to getting to vince.\" you said annoyed. you got dressed and  walk over to lilly's house in rage. you open the door and.</span></div></div>",
            "created":1314370680,
            "id":1175514,
            "title":"a silly bet "
        },
        "11111121":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "a mermaid ",
                "a huge fish "
            ],
            "content":"<div class=\"\"><div> <span>there was no one in lilly's house. ' yep  she died i knew i was the only one who could be eaten and reform.\"  you got your supplies and walked down the path leading back to where you died. as you approached a small spring the sun was high in the sky. you took off your boots and placed your feet in the cool water. ' man this has been some journey.' you said haveing restarted this trip twice now sighing. and then it hit you. you did not have a map with you and everything in this forest was starting to blur. even if you wanted to get to either the sake forest or the bat cave you did not remember where it was. plus this spring was not here before. ' this forest must have some magic that makes things look diffrent.\" you say sighing. rumors had it the elven woods had cruses placed on them to keep trespassers out but it did effect some evles who rarely exit the woods. then you felt something bit your foot. \" great just what i needed another animal wanting to eat me.\" you pull your leg out but it's hard to. \" pull mayfair pull.' you say and after a huge tuge you see the thing that had your foot.  </span></div></div>",
            "created":1314405060,
            "id":1175799,
            "title":"lilly did not reform "
        },
        "112":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "A bigger predator takes the Spikey",
                "A nymph snags the Spikey",
                "The Spikey engulfs you in its spines..."
            ],
            "content":"<div class=\"\"><div> <span>You spot a Spiked puff behind the hedge, it looks octagonal and rolls around sluggishly. You cower and hide behind the bushes as the living creature of predominant sludge oozes its pores with sticky sweet nectar. It purrs in your presence as you manage to poke it with a twig hanging overhead. Just when you take a step back</span></div></div>",
            "created":1282904340,
            "id":945056,
            "title":"Rolling 'round"
        },
        "113":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "run",
                "talk"
            ],
            "content":"<div class=\"\"><div> <span>  A naga!  A perverted combination of woman and snake.  Human to just below her hips, but her legs are a snake's body. You are disgusted by such an abomination [and also rather attracted].  You have heard such have been the end of many an elf.  But you have also heard they sometimes can be bargained with.  Or even just talked with.  A very dangerous idea of course.  The naga will likely terminate the conversation by terminating you.  Still, you might survive a conversation.<br>\r\n<br>\r\n   You are more likely to survive by turning and running.  The Naga is slow, and you can outdistance her easily enough.  But that is survival for now. You would lose all your supplies.  Just left with the sword and the clothes you are wearing.  You would hardly dare return for them.  The Naga would probably be waiting.  Well, you could still make it, but the odds would be a lot worse.  <br>\r\n<br>\r\n   You are in deep do-do either way.   </span></div></div>",
            "created":1150261200,
            "id":324390,
            "title":"visiting naga"
        },
        "1132":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "she is getting ready to attack",
                "she talks, for now"
            ],
            "content":"<div class=\"\"><div> <span>   You bravely[?] call out \"Hold it right there.  I'll attack if you get much closer.\"<br>\r\n<br>\r\n   The naga looks at you with contempt.  \"Do you really think you can beat me?\"<br>\r\n<br>\r\n   Not much chance really.  She is 12? 20? feet long and even if some of that is reasonably harmless, there is a lot more muscle than you have.  But best to put a brave face on it...<br>\r\n   \"I can hurt you bad enough to make you regret it.  So why don't you slither off and we can both be happy?\"<br>\r\n<br>\r\n   \"Hmmm...\"  Well, at least she has stopped approaching.  But she hasn't fully abandoned the idea of you as a bed-time snack.</span></div></div>",
            "created":1150347600,
            "id":324600,
            "title":"confrontation"
        },
        "11321":{
            "author_id":"dragonsoul",
            "author_name":"dragonx",
            "choices":[
                "die",
                "are revived"
            ],
            "content":"<div class=\"\"><div> <span>The naga just eyed you sexy elf body, and thought that you couldn't do anything to stop her. So she lowered her body, into a crouching position, and sprung.<br>\r\n<br>\r\nShe slammed into you, sending you flying backwards, dropping your sword. You hit the ground painfully, but the worst was yet to come. Before you knew it, her serpent tail had coiled around your thin frame, holding you tightly.<br>\r\n<br>\r\n\"Ugh... no... please...\" you moan, but the naga shakes her head, \"Nope, you're my little bed-time snack, farewell. But before I devour you, I prever my food... umm... without any outer shell, hehehe.\" She loosened the coils around you, but still held you tightly. Then, she started to remove your clothing, in an almost seductive manner. Soon, you are naked, and still in the crushing binds of the naga. \"No... please, I beg you!\"<br>\r\n<br>\r\nThe naga ignores your plea, moves her lips close to yours, and gently kisses you goodbye. Opening her lips, you head is slowly inserted, and she gulps. Her jaws widen as your shoulders enter her mouth, your head snuggly in her throat. As she gulps again, she gets to your elven breasts, which are larger than a normal elf maiden's. She teases you a little, licking your now hardened nipples, causing you to squirm. Then, she gives a powerful swallow, sending you more than half way to your doom. She grasps onto your legs to keep you from sliding down further, and starts to lick your vagina, causing you to moan. All too soon, you climax and she continues to swallow you down. Once she gets to your feet, she licks them, then gives the final gulp, and down you go.<br>\r\n<br>\r\nShe licks her lips and fingers, just loving your flavor. You flail as hard as you can inside her snake body, but to no avail. \"Hush little one, it'll be all over soon. *Belch* Ooh, excuse me.\" The naga slithers away, with your struggling body inside her. You start to pray, begging that you will survive this whole ordeal.<br>\r\n<br>\r\nYou...</span></div></div>",
            "created":1150520400,
            "id":324933,
            "title":"Into a Naga's Belly"
        },
        "113211":{
            "author_id":"dragonsoul",
            "author_name":"dragonx",
            "content":"<div class=\"\"><div> <span>You continue to flail and struggle, but the naga won't cough you back up. And then, you start to feel pain all over your body. Her acids start to burn your flesh, this shouldn't be happening, not to you! Last time you were swallowed, you never felt such pain, and a grim thought hits you... you're nothing more than meat now, and forever... You scream and kick and flail, but nothing seems to work, until it is all too late. You black out, and that is the end of you. The naga burps again, giggling happily, then slithers off.<br>\r\n<br>\r\nMeanwhile, your boyfriend is waiting for you, but little did he know that you were no longer part of this world.</span></div></div>",
            "created":1150952400,
            "id":325931,
            "title":"Digested, Once and for All"
        },
        "113212":{
            "choices":[
                "You awake and meet the naga again.....",
                "You awake and meet a ny,ph this time...."
            ],
            "content":"<div class=\"\"><div> <span>......and you suddenly re-appear in your bed, naked, and aroused like never before.<br>\r\n<br>\r\nYour nipples are standing up erect, and pulsating, and your wet vagina lips are swollen, and your female juices are flooding out of your still, clasping, ejecting pussy.<br>\r\n<br>\r\n\"OOOOooohhhhhhh........uuuhhhhh...I am coming!!\" you scream as the enormous orgasm started by the naga eating you, and abusing you as she feed overwhelms you.<br>\r\n<br>\r\nFor numerous minutes, too many to count, you buck and hump your hands onto your creaming pussy mound, all the while your body arches to and fro like you are being jolted from some inner force.<br>\r\n<br>\r\nAfter a time, you finally relax and groan out loud as you settle back down on your bed, now coated with your juices and sweat.<br>\r\n<br>\r\nWhen you can get your breath, you finally come to your senses that you are very special...and being revived like this...and having orgasms...in this manner is just plain old weird.....<br>\r\n<br>\r\n<br>\r\nAs you mind gets a grip back onto reality, you think 'What do the gods have planned for me...in the future...if I have one??' You then fall asleep, where you lay, naked, and aroused,...dreaming of that naga giving you another orgasm. Tho, this time, she is not eating you, she is eating your pussy....licking and loving you...and sending you to many more erotic adventures....within your mind.</span></div></div>",
            "created":1159333200,
            "id":348945,
            "title":"You revive....again!"
        },
        "11322":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "Oh all right",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>   \"Well, I'm not going to eat you...\"  You are pretty sure that statement ends with \"yet\".  Still, it isn't immediate attack.<br>\r\n<br>\r\n   \"I'm called Sly\" the Naga announces.  \"What is your name, and what is a helpless little elf doing out in these dangerous woods?\"<br>\r\n<br>\r\n   \"I'm Mayfair\" you reply.  \"I'm going to see my boyfriend, Vince, in Monuna.\"<br>\r\n<br>\r\n   \"Monuna?  But that is so far away! How did you get involved with such a distant lover?<br>\r\n<br>\r\n   \"Before the Great Ones reshuffled the lands, our villages were much closer and I met him quite often.  Indeed, I was about ready to move in with him when all was changed.  Suddenly he was a monster infested wilderness away from me.  And it may be a year before there is another Change, which may leave him no closer.\"<br>\r\n<br>\r\n   \"And now you risk your life in a desperate attempt to reach your lover.  Such a lovely story.  It almost makes me want to guard you on your journey.  But you just aren't going to make it, so I might as well be the one who gets a meal.\"<br>\r\n<br>\r\n    \"Well, I do have an advantage that may make it possible to get there.\"<br>\r\n<br>\r\n   \"What is that?\"<br>\r\n<br>\r\n   \"When I am eaten, I wake up in my bed at home.  So I can keep trying until I get lucky.\"<br>\r\n<br>\r\n    \"Really, you can reform?\"<br>\r\n<br>\r\n    \"I've been eaten 3 times so far.\"<br>\r\n<br>\r\n    The naga considers for a moment.  \"You know, this is quite good.  I don't have to choose.  I can eat you today.  Then when you come back here, I can guard you on your way.\"<br>\r\n<br>\r\n    \"I don't want to be eaten.\"<br>\r\n<br>\r\n    \"Oh, don't be such a baby.  You aren't going to make it without help, so accept the help you can get.\"<br>\r\n<br>\r\n    \"But...\"  </span></div></div>",
            "created":1150520400,
            "id":324875,
            "title":"a deal?"
        },
        "113221":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "trust the naga, a little",
                "try a different road"
            ],
            "content":"<div class=\"\"><div> <span>   \"But I don't know I will reform.  I might not.\" you argue.<br>\r\n<br>\r\n   \"All life is risk.\"  A sentiment you might find more convincing if you weren't risking your life.<br>\r\n<br>\r\n   \"Look, I thank you for the offer, and I am sure it is very nice of you, but I would just as soon walk alone.\"<br>\r\n<br>\r\n   \"Oh, but I didn't say you could refuse...\"<br>\r\n<br>\r\n   Oh oh, party time.  As you get ready for battle, you feel a blow to the back of your knees and suddenly you are falling on your back.  !@#$, you were watching her top so much you forgot she has a tail, which snuck up behind you and now has made you pay for not paying attention to it.<br>\r\n<br>\r\n   As you land, the sword goes flying from your hand.  You flip over to get up and recover it, but the naga now grabs you by the feet.  You try to kick free, but the kicks seem powerless, and now a coil of snake lands on you.  A moment later you are helpless in her coils.  <br>\r\n<br>\r\n   You protest as she starts removing your pants, but to no avail.  \"Clothing is just so bland.  You'll taste much better without it.<br>\r\n   \"Now don't you worry, I'll guard your stuff and it will all be here when you get back.\"<br>\r\n<br>\r\n   \"Then you will just eat me again.\"<br>\r\n<br>\r\n   \"Only if you take a long time to get here.  You are a big meal and I'll be too full to eat you tomorrow.  You can sleep besides me in perfect safety.\"<br>\r\n<br>\r\n  She pauses to lick a foot with her tongue.  \"Excellent flavor.  You are going to make me very happy.  So now let's see if I am going to make you happy too.\"<br>\r\n<br>\r\n   With that, you feel her push your feet into her mouth.  Stuck face down with snake coils blocking your view, you are pretty much limited to what you feel, tho the naga makes some grunts that sound like a muffled \"Delicious\".<br>\r\n   <br>\r\n   But when she pauses at your hips, your terror turns to indignation.  \"No!  I'm not that kind of girl!\"  A claim the naga ignores, and continues to use her tongue to prove you are.  As she plays with mound and lips, you feel your excitement building, and when her tongue slips into your crack, you climax rather forcefully.<br>\r\n<br>\r\n   Satisfied with this, the naga positions your hands onto your pussy and resumes eating.  You recall the saying \"When rape is inevitable, relax and enjoy it\".  A stupid idea in your view.  Rape isn't inevitable until you relax.  Still, even bad advice is right sometimes, and this seems to be one of the times.  So you start playing with yourself.  You quickly come again, a tiny one compared to the gusher the naga caused, but still pleasant.<br>\r\n   The naga pauses again to play with your breasts and you again explode.  Then she swallows the rest of you, as you frantically work to come yet again.  You are fully settled in her belly before you do.<br>\r\n<br>\r\n   \"My, that was a wonderful meal.  I do want to thank you for that.  Now you hurry back.  I'll be waiting.\"<br>\r\n<br>\r\n   You don't answer.  The whole experience has taken a lot out of you, and there is little air in her stomach.  Even staying conscious is difficult, and then impossible.<br>\r\n<br>\r\n   You are relieved when you waken to find you are no longer in her innards.  This is home as before.  Still, that was a day shot, and you are little closer to your man.  Well, you will just have to try again.<br>\r\n<br>\r\n    You encounter some odd looks as you once again buy supplies you had just bought and once again exit the town, without having returned to anybody's knowledge.  However, nobody wants to be too intrusive and so you are back on the road and at the intersection again.<br>\r\n<br>\r\n    But now which way to go?  Can you trust that naga not to just eat you again?  If she will keep her promise to help you, the problems of your journey go way down.  In comparison, the journey will be downright boring.  But nagas are known liars, frequent and determined liars.  There is such a large chance she is just going to eat you again.  But of course, something else will likely eat you on the other paths.  Is the devil you know better than the devil you don't?    <br>\r\n   </span></div></div>",
            "created":1150520400,
            "id":324975,
            "title":"naga food"
        },
        "1132211":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "resist",
                "accept"
            ],
            "content":"<div class=\"\"><div> <span>   There is a chance the Naga is telling the truth.  You aren't optimistic, but she could help you a lot.  You might as well take a chance and see if she will help instead of eating you.<br>\r\n<br>\r\n   So back to your former campsite.  And as she promised, there is Sly waiting for you.  There is still a bulge in her belly, which gives you some bad vibes.  Still, it would seem she was right.  She can't have all that meat in her and still want to eat you.  <br>\r\n<br>\r\n   Sly is not in a good mood.  \"About time you got here.  Guard duty is so boring.\"<br>\r\n<br>\r\n   You aren't all that happy either.  \"You got a good meal out of it, and I had to spend the whole day walking.  Sounds to me you have no kick coming.\"<br>\r\n<br>\r\n   Fortunately neither of you really want a fight, and so you move on to other subjects.  <br>\r\n<br>\r\n   \"Say, you have any treats in your pack?\"<br>\r\n<br>\r\n   \"You can't hungry, not with that load in there.\"<br>\r\n<br>\r\n   \"And I suppose you can resist a candy right after a big meal?\"<br>\r\n<br>\r\n   \"Well..., what do Naga's consider a treat?\"  You are hoping you are wrong about the answer.\"<br>\r\n<br>\r\n   \"Same thing as elf girls, I expect.\"  That is what you feared, and you hand over the honey.  She is not as grateful as you think she should be, but she does break off a small piece for you.  Might even be your share by weight.<br>\r\n<br>\r\n   You chatter as you eat your dinner and get ready for bed.  Especially about your boyfriend.  She has never had a lover she felt worth running down.  Of course the snakes just ignored her once they were done, and the elves and humans got this idea she was going to eat them, a completely false idea ... well, some of the time.  But what is the use of a man who is too scared to get close enough to touch you?<br>\r\n<br>\r\n    That is when you realize she has gotten close enough to touch you.  And intends to do some serious touching.  She is not going to eat you ... No wait , that may be just what she intends to do.  That may not be as bad, but you don't approve of either.<br>\r\n<br>\r\n   \"Now wait a minute.  I don't swing that way.\"<br>\r\n<br>\r\n   \"Oh you do, you just don't do it often, and this looks like a fine time for an exception.\"<br>\r\n<br>\r\n   \"But I have a lover.  What will he think?\"<br>\r\n<br>\r\n   \"He's a boy, right?  You just tell him every lurid detail and he is going to get hard as a rock.  He'll be looking into a way we can be a three-some.\"<br>\r\n<br>\r\n   \"But...\"<br>\r\n<br>\r\n   \"Hush child.  Time for some fun.\"</span></div></div>",
            "created":1150606800,
            "id":325174,
            "title":"under attack"
        },
        "11322112":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "run",
                "fight"
            ],
            "content":"<div class=\"\"><div> <span>    \"But..\"  But she is kissing you and your additional protests go unheard.  A second later her arms are pressing you against her.  You are surprised to notice her human parts are really not much bigger than your own.  She is still a big girl, but if she hid her snake parts, the viewer would not think her unnatural.<br>\r\n  Well, not too unnatural.  Those boobs rubbing into yours are distinctly impressive.  Distinctly sensual as well.  You are finding it hard to concentrate on much else.  And finding it even harder to remember you should.<br>\r\n   Indeed, why not have a little fun with her?  You need to give Sly some reason not to eat you. And you have to admit this is a rather... no, make that quite, pleasant way to do so.  So you start to rub back.<br>\r\n<br>\r\n   Sly's immediate reaction is for her hands to dive to your muff, a tad fast for you and you try to protect yourself, a bit half-heartedly at first, and then not at all when she starts hitting the right spots.  Soon you are gasping from passion.  Then you are waking every critter within a mile.  <br>\r\n   Sly is not pleased with this.  \"I should have realized you were a screamer.  I hope that didn't wake the wrong sorts.  There are things I fear around here too.  <br>\r\n   \"Well, I am not missing out on my fun.  You get down there and do me while I stand guard.\"<br>\r\n<br>\r\n   \"But I've never done that before.\"<br>\r\n<br>\r\n   \"Fine time to start then.\"<br>\r\n<br>\r\n   You end on your knees, looking at a rather large looking cunt.  A moment's hesitation ends with her grabbing your ears and shoving your nose into it.  A bit tentatively, you set to work.<br>\r\n   Happily she is already rather excited, and greets your gentle probes with pleasure.  As you become more confident with your touching, her excitement rapidly increases, and she quickly climaxes, something that causes you to pull away, but she insists you return and swallow her discharge, an order you are reluctant to obey, but carry out.  It doesn't taste that bad actually.<br>\r\n<br>\r\n    She caresses your head as you finish up and says \"Guess we got away with it.  But I suppose we had best call that a night.  There will be other chances to have fun.\"  You aren't sure how much you want that fun, but you have to admit Sly is something nice to cuddle up against to sleep.<br>\r\n<br>\r\n   It takes little time to pack in the morning and set out on your way.  But you have not gone far before you hear a noise in the woods of something coming in your direction fast.  Sly yells \"Guess we were heard last night after all.\" as she gets into what you suppose is a combat pose.<br>\r\n<br>\r\n   You ...</span></div></div>",
            "created":1150779600,
            "id":325414,
            "title":"nice night"
        },
        "113221122":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "cure",
                "hide"
            ],
            "content":"<div class=\"\"><div> <span>   For a moment you debate whether to flee or fight.  After all, you can outrun the naga and whatever is approaching can fight her while you escape.  But it might consider the naga too tough and simply come after you, when you would be all alone.  Or maybe ...<br>\r\n<br>\r\n   But when considering fight or flight, you don't have time to consider.  You decide right away, or it is decided for you.  And now you see your \"decision\" burst into the clear, and you wish you had run right away.<br>\r\n<br>\r\n   It's a Saber Tiger!  A huge cat, with fangs big even for his terrible size.  It uses those teeth as slashing swords to cut terrible wounds in prey as large as it is.  It can kill elephants with those fangs.<br>\r\n   Which means it normally would be no tremendous danger to you.  You just aren't enough meat to bother with hunting down.  So if you had a good lead, you would get away.  But now it is too close.  If you ran, it would behave like any cat and run you down.  But if you stand, it will have to be close to the naga, which will be attacked, and where a casual swipe by a claw would turn you into meat.  You seem to be able to survive being eaten, but being cut into chunks?  You don't want to find out.  Even a yes answer is a bad one.<br>\r\n<br>\r\n   The naga has good reason to fear it.  Her normal tactic to win is slow strangulation.  But in that time, the tiger can slash time after time and almost cut her in half before she can choke it unconscious.  The best she can hope there is a double loss.  Most likely she will faint from blood loss long before the tiger gives out.  <br>\r\n   But the naga does not seem panicked.  Rather she seems very worried, but hopeful she will get out of this alive.  As you cower behind her, you realize her plans.  She holds up a large coil of herself.  If she can drop it on the tiger's head as it approaches, she can prevent it from attacking her before she can strangle it.  She has to strike just right, but she probably is pretty good at finding the right time to strike.<br>\r\n   The cat seems to think so too.  It circles, waiting for an opening, and possibly for Sly to get too tired to hold that loop in position.  Sly and you circle in the opposite direction, hoping it will simply decide to look for easier prey.<br>\r\n<br>\r\n    No such luck.  The tiger suddenly darts forward, too fast for you to react.  Fortunately Sly is faster and throws her look at the approaching cat.  <br>\r\n    When you finish blinking, it at 1st looks good for your side.  Sly has taken some nasty wounds, true, but she seems to have the Tiger in a death grip.  Those powerful coils will soon crush the life out of the cat.<br>\r\n    But the tiger is not weak.  With a sudden burst of energy, it jumps backward, jerking the naga roughly forward.  You can only guess the exact way, but Sly's coil loosens enough for the Tiger to pull its head free and retreat out of the naga's range.<br>\r\n<br>\r\n    Now the fight is all but over.  The naga's wounds are too large.  She has to tend to them or die, and she can't tend to them while menaced by the tiger.  It is simply a matter of the cat waiting a little.  The naga is doomed.<br>\r\n   Or she is doomed if you don't do anything.  You are a healer, and you can cure the naga's wounds, bad as they are.  That's no problem.  The problem is that you will have to get in front of the naga to do so, and if that cat attacks at that moment, you will be ground round.  You are not counting on recovering from that!<br>\r\n  Definitely safer to continue cowering until the cat claims its prize and then it shouldn't pay any attention when a small morsel slips away.  <br>\r\n   But you are a healer!  All your sympathies are with the wounded, no matter how justly wounded.  You're not sure you can live with yourself if you don't cure the naga.  <br>\r\n  But will you live at all if you try?<br>\r\n  Well, this time you had best decide fast and agonize later.  The naga is losing strength with every second.  </span></div></div>",
            "created":1150866000,
            "id":325598,
            "title":"battle"
        },
        "1132211221":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "Sly is grateful",
                "Sly is grateful, but..."
            ],
            "content":"<div class=\"\"><div> <span>   There are times when being the healer really sucks.  You are going to have to leave your safe spot and get right out where that cat can turn you into lunch in the blink of an eye.  And there is no help for it.  You just would not be able to live with yourself if you let someone die when you could prevent it.  <br>\r\n<br>\r\n    Quickly you get in front and apply your hands to the wounds.  Thankfully you are not fully in front.  There is still a coil of naga between you and the tiger.  But if the tiger attacks, you are probably still right on the bulls-eye, and one of its fangs would go right thru you, and likely well into the naga as well.  You ending as 2 or more pieces seems entirely possible.  So your only hope is that it doesn't attack.<br>\r\n<br>\r\n   Which it doesn't, at first anyway.  Possibly it deems you something strange, and strange means to be cautious.  What you don't know can kill you.  And a human helping a naga has to be very strange, and thus very dangerous.  You definitely hope that is what the cat is thinking.  But as your healing magic takes effect, hope is all you can do.  You must stand here, without any way to defend yourself if it does attack.  Otherwise the healing will fail.<br>\r\n<br>\r\n   After what only seems like forever, the wounds are closed.  The healing is successful!  A bit tired, but thrilled, you dart behind the naga again, and return to keeping it between you and the tiger.  <br>\r\n   A standoff continues for a few minutes, but the cat eventually realizes the naga is not getting weaker like it should have. It can't understand this, nor your role in causing it, but it can see it faces a healthy naga, while it is just a little tired and hurt, that little bit maybe being just enough to allow the naga to win the battle if it attacks.  Predators do not survive by attacking foes that might kill them.  After another minute, the cat moves off and out of sight, to find something easier to kill.<br>\r\n<br>\r\n   \"I thought I was a goner there.  What did you do?\"  the naga asks.<br>\r\n<br>\r\n   \"I'm a healer.  Curing people is what I do.\"<br>\r\n<br>\r\n   \"You made those killing wounds just vanish?  But that's impossible.\"<br>\r\n<br>\r\n   \"just difficult.  I have never had a patient or wounds as big as you, but some of the elves I have cured have been a lot closer to death.\"<br>\r\n<br>\r\n   \"Whoa, having you around is going to be useful.\"<br>\r\n<br>\r\n   \"Well, thanks.  I'll find it nice to have you around too.\"<br>\r\n<br>\r\n   The rest of the day passes peacefully, and you make camp that night, and you don't notice the way Sly is looking at you, at least not until she acts...</span></div></div>",
            "created":1151038800,
            "id":326147,
            "title":"victory"
        },
        "11322112212":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "naga",
                "a different path"
            ],
            "content":"<div class=\"\"><div> <span>  Sly is acting a little oddly, but what do you really know about naga behavior?  Probably she just wants sex tonight, and hesitates to simply demand it since you saved her life today.  <br>\r\n<br>\r\n   She really ought to hesitate, at the least.  Maybe last night was not all that horrible, even fun, but you expect to be asked at the very least, and you want your man to be the one doing obscene things with you.<br>\r\n   <br>\r\n   So when you have doffed your clothing and are about to get in your bedroll, you think you know what Sly is up to, and turn to tell her \"Look, we are not having sex tonight.\"<br>\r\n<br>\r\n   \"That's right, at least technically.\"<br>\r\n<br>\r\n   \"Huh?\"  You hadn't expected her to agree with you, so you stand there a bit stupid, trying to figure out what she means, for a moment, a moment that ends with a massive naga coil hitting you and twisting around you.<br>\r\n   The next thing you know, you are hopelessly in the naga's coils.  \"I got to thinking.  If I am to guide you all the way, I'm going to get pretty hungry, and if I eat you then, you will just have to start the whole journey over again.  Much better I eat you now, and stock in a layer of fat.\"<br>\r\n<br>\r\n   \"But you could catch something along the way.\" you protest.<br>\r\n<br>\r\n   \"Maybe, but that seems chancy.  This way is certain.  And you do taste so good.\"<br>\r\n<br>\r\n   \"But you aren't even done digesting me from before.  There's not room for me.\"<br>\r\n<br>\r\n   \"Oh I can expand my stomach quite a bit.  You would fit in fine.  But I have another way to store food, which you may find ... ah, interesting...\"<br>\r\n<br>\r\n    Her human part moves to your pretty feet, placing her pussy right in line with them.  Then she thrusts you forward, impaling herself on your toes.  Now she starts using you as a huge phallus, thrusting you in and pulling you out, part of the way.  She is slowly and erratically pushing you deeper and deeper.  <br>\r\n<br>\r\n    \"But I'm too big to fit in there.\" you try to object.<br>\r\n<br>\r\n   With no effect.  \"Honey, you will fit in fine, and very pleasantly.\"  This last at least is true for her.  She is quickly aroused by her use of you, and quickly climaxes, which barely slows her down.  Instead, she starts to use mouth and hands to excite you.  And while your body inside her cunt excites her more, you are also getting arounsed by the contact.  That is not as successful as her own coming.  But even if she comes 4 times to your once, you are finding it hard to resist.  Eventually you don't.  It's not the rocket of last night, but still very pleasant, and enough to ruin your attempts to resist.  You both manage another climax by the time the only part of you outside her is your head.  <br>\r\n<br>\r\n   \"Now meet me back at the old campside and I should have enough food to get me thru the trip.\"  Then your head is thrust into her slit.  There is no way to resist after than and you soon drift off to sleep, hoping you will awake elsewhere.<br>\r\n<br>\r\n   You do, back in your home bed again.  So again, all you have lost is time.  But again you have to replace supplies, and to meet the curious stares of those who find your goings, and lack of comings, increasingly curious.  Your friend, Gentlefoot the ranger, even asks a few questions.  You fend them off, but you do hope you don't get eaten again.<br>\r\n<br>\r\n    Soon enough you are back on the road, and again at the crossroads.  And again wondering if the protection of that fickle naga is worth having.  </span></div></div>",
            "created":1151211600,
            "id":326527,
            "title":"not exactly eating, but..."
        },
        "113221122121":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "witch",
                "road"
            ],
            "content":"<div class=\"\"><div> <span>   The naga is clearly a bad choice, but so are all the others.  You don't want to be cat food after all.  Just maybe you can believe the naga this time.  You decide to chance it.<br>\r\n<br>\r\n   As expected, Sly is waiting for you.  And for a wonder, she does not have sex or eating on her mind.  Just as well, as you are definitely not in the mood for either.  <br>\r\n<br>\r\n   Instead she has an idea.  <br>\r\n<br>\r\n   \"This trip you want to take is going to be rough,  We already know that.  But I think I know a way for you to get some help.  I'm not sure how much or what, but the old witch knows a lot of things and she should know something that can help you.  <br>\r\n  \"I have to admit she is dangerous.  I know of several creatures and people who have entered her hut and not come out.  But others have come out, and some of them have been very pleased with the results.  She was able to solve some pretty impossible problems for them.  <br>\r\n   \"I have no idea what will happen, but it could be very beneficial to you to visit the witch.\"</span></div></div>",
            "created":1151384400,
            "id":327025,
            "title":"quiet night"
        },
        "1132211221211":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "talk",
                "fend her off"
            ],
            "content":"<div class=\"\"><div> <span>  Just maybe this witch can whisk you right into your boyfriend's arms.  Or maybe ...  Well, she seems worth a detour.  So you follow the naga as she leads you thru the woods.<br>\r\n<br>\r\n    The witch turns out to live a surprisingly short distance from the village.  A distinctly dangerous distance of course, but in distance, it is pretty close.  Possibly some of the villagers even know it is here.<br>\r\n<br>\r\n   You thank Sly for guiding you and turn to approach the hut, a distinctly unimpressive hovel.  That is when the naga strikes from behind.  Suddenly the light is gone and something warm and wet is over your head.  You quickly guess the Naga wants another meal...<br>\r\n<br>\r\n    First, she wants to strip you, and your breasts are soon exposed to the breeze.  Also exposed to her mouth, and she starts sliding you inside as she continues to strip you of all clothing.  The contact of her mouth to your skin proves highly sensual.  You can feel your nipples harden as she swallows them.  And when she gets down to your box, you climax as her tongue licks your bottom.  You come yet again as she reaches your toes.  <br>\r\n<br>\r\n   As you settle into her belly, you revile her for this attack, pointing out she had said she already had enough food.  \"Well, I wanted to make sure. And it's been a couple of days since I ate you the 1st time, so there is more room in my belly now.  Besides, I don't know what will happen with the witch.  I had best get a meal while I can.\"<br>\r\n<br>\r\n    \"But this will be the last time.  \"I'm full now and won't need to eat again before you get to your boyfriend.  So you just hurry back here, and we'll see what the witch has to say.  And if you need my help, it will be here.\"<br>\r\n<br>\r\n    There is little you can do about the situation and soon you drift off again, hoping this time too, you will awaken in your bed.  Which you do.  So it is back to getting supplies and having yet more villages looking at you oddly.  Gentlefoot is particularly persistent with her questions.  Perhaps it is time to answer them.</span></div></div>",
            "created":1151557200,
            "id":327331,
            "title":"detour"
        },
        "11322112212111":{
            "choices":[
                "You do not get too far before....",
                "Other...."
            ],
            "content":"<div class=\"\"><div> <span>Gentlefoot can be very hard on someone....especially you! She wants answers this time, and forces her way into your bedroom.<br>\r\n\"Look, Mayfair! It is just not right you popping into your house, and going out to just re-pop back into here....it is plain old weird!\" she shouted, as she gave you the evil-eye. \"And I am not leaving until you tell me the truth...YOU HEAR!\" she screams the last part, and you quite sure the whole town heard her.<br>\r\nShe is still very cross with you, and you sigh as you make up your mind to tell her the whole sordid story.<br>\r\nAs you begin the words, she at first looks at you with amazement, then shock as you describe what has been going on since the beginning. You also leave no details out, and finally after an hour of telling your tale, up to this day, you end with,\" and this naga keeps eating me, or now I had a witch trick me... or she will....The things I try to do to get back and see my boy friend,...Jack.\" You sigh out loud as she gives you a shoulder to cry on, but no tears can come.<br>\r\n\"What I do not understand is how come you alone were picked to be reborn in this perverted way, Mayfair. That is just too weird, freaky even for me, your friend.\" Gentlefoot stated as her face was still serious. <br>\r\n\"Yeah, tell me about that. But, as I told you, I seem to also get off, and I now get extremely aroused and have many orgasms as this is all going on. And I am beginning to think I was never meant to be loved by a guy....but I seriously think I love women!\" Mayfair sighs again, as she feels Gentlefoot's arms around her,....feeling just like Sly's. <br>\r\n\"Uh,....Gentlefoot...I still gotta try...so please let me go....and I hope to make it this time!\" you stammer out, as you quickly stand and run to the door. You need to get away from Gentlefoot and your bed, before you do something rash!<br>\r\n\"No WAY!....This time I am going with you...YOU HEAR!\" she shouts at your retreating form....and after quickly locking your home's door, she races to catch up with you.....<br>\r\n<br>\r\nSo here you go on your continuous journey...with Gentlefoot now in tow. What next can happen?</span></div></div>",
            "created":1171774800,
            "id":383055,
            "title":"You tell Gentlefoot the truth!"
        },
        "11322112212112":{
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You manage to fend off Gentlefoot as you make your way back to the naga. The naga and you head toward the witch.</span></div></span></div>",
            "created":1151730000,
            "id":327920,
            "title":"back to the naga"
        },
        "113221122121121":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "talk",
                "resist"
            ],
            "content":"<div class=\"\"><div> <span>   You meet Sly not far from the witch's hut.  This time, you are careful not to get close to her.  Not that you really think she is going to eat you again, but ...  Sly takes this with good humor, acknowledging that she can't really say she is trustworthy when her belly is still bulging.  However, she wish you good luck as you approach the hut.  <br>\r\n<br>\r\n   A quick knock on the door.  \"Someone there?\" an ancient voice asks.<br>\r\n<br>\r\n   \"Yes, I am Mayfair, and I need your help to reach my boyfriend.\"<br>\r\n<br>\r\n   \"Well, come in, come in.\"<br>\r\n<br>\r\n   You take the advice and find yourself in a fairly typical peasant's hovel, except for the massive cauldron boiling on the fire, and the fact the room looks somehow bigger than the hut it is in.  You wonder briefly if it actually is.  She is a witch after all, and ...<br>\r\n<br>\r\n   But your musing is interrupted by a crash at the door.  Turning, you see the witch has slammed the door, and barred it with a beam she should not have been able to move, much less slide into place.<br>\r\n<br>\r\n   \"Silly fool.  Now why don't I just boil you for dinner?\" the gleeful witch asks in a nasty tone.</span></div></div>",
            "created":1151902800,
            "id":328238,
            "title":"witch's lair"
        },
        "1132211221211211":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "sex",
                "talent"
            ],
            "content":"<div class=\"\"><div> <span>    \"Now wait.  I came here with peaceful intent to ask a favor of you...\"<br>\r\n<br>\r\n   \"The more fool you.\" the witch says as she grabs you.  You are shocked to find this little old lady is far stronger than you are.  \"Now, you are in my clutches, and you'll grant what favors I want.  Now 1st let's get those clothes off you...\"<br>\r\n<br>\r\n   Quickly, you find struggling is useless.  With one hand she effortlessly holds both of your's.  Her other proceeds to strip you.  <br>\r\n<br>\r\n   As your blouse opens, you beg \"Please, I just want to get to see my boyfriend.\"<br>\r\n   \"Well, he's not going to see these beauties,\" is the witch's response as she caresses your rack, an action you find disturbingly stimulating.  \"They're all mine now. And they are going to taste great.\"  <br>\r\n<br>\r\n   \"But I can help you.  I'm a healer.\"<br>\r\n   \"Bah.  Anything I can't beat, I can hide from.  I have no need for a healer.\"  By the time she finishes talking, your pants are around your ankles, and she is fingering your snatch, a move you also find erotic.  \"Been playing with your lad, eh.  Too bad.  I like to have a little fun with virgins.\"  <br>\r\n<br>\r\n    \"so got any other reason I shouldn't just cook you?</span></div></div>",
            "created":1151989200,
            "id":328452,
            "title":"prisoner"
        },
        "11322112212112112":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "rape",
                "sex"
            ],
            "content":"<div class=\"\"><div> <span>   \"I do have this special talent.  When I am eaten by a monster, I reappear in my bed, unharmed.  That is why I am risking this trip to find my boyfriend.\"<br>\r\n<br>\r\n    \"So how is that supposed to help me?\" the witch not unreasonably asks.<br>\r\n<br>\r\n   You have to confess \"I'm not sure, but you are so smart and clever, you surely can find a use ...\"<br>\r\n<br>\r\n   \"Hmm...\"  Your encouragement seems to have at least made her stop and think.  Not that she is letting loose of you, but at least she is not dragging you closer to that pot.  She thinks for some time, to the point where you are getting impatient, but showing your annoyance is likely suicidal, so you hold it in as best you can.  <br>\r\n<br>\r\n   Finally she says \"...yes, I could help you, rather profitably to myself too.  And to pay for my help, you can start by having sex with me.\"<br>\r\n<br>\r\n   \"But...\"<br>\r\n<br>\r\n   \"No but, girl.  You Are going to have sex.  You merely get to decide if it is voluntary or not.\" <br>\r\n<br>\r\n    </span></div></div>",
            "created":1152075600,
            "id":328655,
            "title":"saved from the pot"
        },
        "113221122121121122":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "boil you down to a soup",
                "will let my familiar eat you"
            ],
            "content":"<div class=\"\"><div> <span>   You sigh.  You are going to get raped one way or another.  The question is how much you want to suffer.  And while you would like to fight, you do need the witch's help.  So there really isn't much choice.  \"What must I do?\"  <br>\r\n   Fortunately, the witch doesn't care if she has an eager partner.  Your reluctant agreement is enough.  She sits down and raises her dress, revealing that her legs and vitals are surprisingly well preserved.  Not too much of a surprise.  The saying is that women dry up from the top down and and even a quite ancient woman can have a set of legs that rival a teenager.  Not a major factor, but this is not as bad as it could be.  \"Now get your face between my legs, girl.\"<br>\r\n<br>\r\n   You get down on hands and knees, and she grabs the back of your head and shoves your face into her snatch.  \"Lick it\".  You hesitantly do so, and are shocked when she quickly gushes out a good deal of liquid.  She issues an order to swallow which you deem it best to obey.  The stuff proves to taste better than you had feared.  Good is perhaps an exaggeration, but you will be lying if you tell someone this really disgusts you.  <br>\r\n   The witch climaxes again, but is not willing to let you quit, and so you continue to kiss her snatch, until you feel something cold on your's.  Turning, you see something that might be a large cat or a small dog [but which you fear is neither] licking your honeypot.<br>\r\n   As you start to stop it, the witch grabs you and forces your head back between her legs.  \"My little boy wants some fun?  Go ahead. There is enough of her to share.\"  You beg for mercy, but instead your nose is forced into her cunt and you are forced back to work.  <br>\r\n   The creature has a large tongue and applies it to your box in a very stimulating way.  You feel your excitement build despite your resistance, and then you climax, just as the witch does.  <br>\r\n<br>\r\n   This earns you a moment of respite.  But only a moment.  Then you feel the creature climbing atop you, with obvious intent.  Again you beg to be spared, but only get ordered to get the witch off again.  Your efforts to dislodge the rapist are equally futile and he is quickly in position.<br>\r\n   Then he is in you.  The witch muffles your cries by shoving your face into her muff.  For a moment you resist, but then you feel the creature shoot off in you, and then start pumping again.  \"He will not stop until I get off.  So get to work, you little slut.\"  Reluctantly, you do.<br>\r\n<br>\r\n  Thankfully her excitement builds rapidly, but less thankfully your own does too.  You try to resist, but without success.  All three of you explode in massive climaxes that leave you exhausted.<br>\r\n<br>\r\n   Well, you at least.  \"My, that was fun.\" the witch says.  \"Now I... </span></div></div>",
            "created":1153026000,
            "id":331775,
            "title":"violation"
        },
        "1132211221211211221":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "Gentelfoot",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>  \"..just toss you into the pot.\"<br>\r\n<br>\r\n  \"Hey, Stop!  You promised...\"  you protest.<br>\r\n<br>\r\n   \"I promised nothing.  Sex was just part of your payment for my troubles.  Now the next part is your being cooked down to a soup I can use to make a magic potion.\"<br>\r\n<br>\r\n   \"But..\"  But she is not listening and the surprisingly strong little old lady picks you up and shoves you into the cauldron head first.  Desperately you claw around and eventually manage to get your head out of the boiling liquid, but no further.  With one hand on your head, the witch easily blocks further progress.<br>\r\n   \"Now, I'll want to sell the potion to the elves, so when you reform in the village, you will need to bring a friend along when you come back here.  The friend can act as my agent.<br>\r\n   \"But right now, you have to be converted into a soup.\"  She caps this by shoving your head back into the broth, and then putting a lid on the pot.  Your frantic blows to dislodge it prove that it has been secured.  You keep on futilely struggling, but you are horrified to see the witch's cookery is working.  Your firm limbs are becoming soft and rubbery.  Your blows that at least made the pot ring now land like soft bread, and then like dough.  Soon you are just part of the boiling liquid.  <br>\r\n   At this point the witch takes off the lid and stirs the soup, a process that leaves you quite dizzy and well mixed with the broth.  She allows the water to boil off.  Some time during that, you drift off.<br>\r\n<br>\r\n   You wake once again in your bed.  And once again, you have to buy new supplies, to the amazement of your neighbors.  Gentlefoot in particular is demanding answers, and you recall that the witch wants you to bring a friend.  If you recall correctly, the friend might do very well by the adventure.  But it clearly will be dangerous for her.  Is it wise to bring her along?  Or maybe use <br>\r\nSly or somebody else...?</span></div></div>",
            "created":1153198800,
            "id":332143,
            "title":"witch cooking"
        },
        "11322112212112112211":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "Gentlefoot takes a chance",
                "Gentlefoot plays it safe"
            ],
            "content":"<div class=\"\"><div> <span> \"Very well.  It's a rather long tale, so I can tell it as we travel.\"  <br>\r\n<br>\r\n   Gentlefoot is surprised, but is agreeable to leaving the village with you.  Of course, it is her job to be in the dangerous woods.  She likely knows the dangers you have faced, and knows how to avoid them too.<br>\r\n<br>\r\n   Once you are well on your way, you start explaining.  \"I have this strange ability, or defense, or something.  Every time I am eaten by the monsters in this wood, I wake up healthy in my bed.\"<br>\r\n<br>\r\n   \"That is marvelous good fortune.  Do you have any idea how you gained such an ability?\"<br>\r\n<br>\r\n   \"All I really know is that I awake in my bed.  It was a complete surprise the first time, and I have not gained any idea how I did it since.  Nor can I be sure it will continue to work.\"<br>\r\n<br>\r\n   \"It is still an ability everyone would envy you for.\"<br>\r\n    <br>\r\n   \"Now I had hoped to use that ability to get to my boyfriend, but as you have seen, I don't get very far before I end up in some creature's belly.  All too often that has been a naga named Sly.  She has promised to help me, and she may actually mean it, tho mostly she has helped herself to me as food.<br>\r\n   \"But we decided to go see the witch, who did promise to help, but only after cooking me into a soup.  Now she said to get her help, I will need to bring a friend this time.  So I am hoping you can help me out here.\"<br>\r\n<br>\r\n    \"You are not thinking to let the witch eat me, are you?  I very much doubt I will reform.\"<br>\r\n<br>\r\n    \"I don't think the witch has treachery in mind.  The witch spoke of needing an agent to do some selling.  So she can hardly eat you and expect you to do any selling for her.  <br>\r\n    \"Still, I am not sure what she is up to, and I guess you will be taking a risk.  So you had best be careful.<br>\r\n   \"But I do need somebody to help me and you are both my best friend and the one who is best able to dodge any threat she may have in mind.  So, can you help?\"</span></div></div>",
            "created":1160974800,
            "id":353083,
            "title":"briefing"
        },
        "113221122121121122111":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "soup",
                "solid food"
            ],
            "content":"<div class=\"\"><div> <span>   Glentlefoot thinks it over for long enough to make you uncomfortable.  <br>\r\n    \"I will see what I can do.\" is her final decision.<br>\r\n<br>\r\n    \"Let us hope that is enough.\" is your response.  Given the treatment you have received so far, you fear the future holds worse for you than for her.  For all you are suffering, you really hope your lad appreciates your struggles.<br>\r\n<br>\r\n   It does not take long to reach the witch's place and you approach reluctantly.  But Gentlefoot comes to a dead stop.<br>\r\n<br>\r\n   \"Hail to the house.  We enter in peace.  We pledge no harm nor intent to harm to those within so long as the same is pledged us.  We shall not...\"  The list of this promised to do or not do is a long one, but eventually Gentlefoot ends with \"By your magic, so do we pledge.\"<br>\r\n<br>\r\n   For a moment, there is silence.  Then you hear the witch say \"By my magic, you enter in peace.\"<br>\r\n<br>\r\n    You look a question at Gentlefoot.  \"I am not sure, but it seems that a long pledge of peace like that in some way binds her.  Maybe she would lose her magic if she tried anything.  Maybe her magic would fight her.  Or maybe there is a streak of nice buried deep, very deep, in her.  Anyway, those who make such pledges tend to come out of the hut again.  Not as many of those who don't do.<br>\r\n   \"And yes, I knew of the witch.  I have scouted her hut many a time.  If you had not been so eager to keep your secret, I could have warned you.\"<br>\r\n<br>\r\n    Which would have saved you a lot of trouble.  Still, you are not sure you were really wrong.  The village might well have reacted by blocking your attempt to get to your man.  And the wilds might not have been quite as dangerous as they were.  So maybe you were right, or at least forgivably wrong.<br>\r\n   Gentlefoot doesn't think so.  She clearly thinks you made a fool of yourself by not coming to her right away.<br>\r\n<br>\r\n    Inside the hut is as before.  About the only difference is that the witch is busy stirring the cauldron instead of getting ready to bar the door.  Hopefully that means you can leave if you need to, but you wish you knew whether her smile is because she is being friendly or because she has two victims now.<br>\r\n<br>\r\n   \"Very good.  I have the potions about ready.  Now drink this.\"  The potions she offers is not as suspicious as it could be, but it still worries you.<br>\r\n<br>\r\n   \"What does it do?\"<br>\r\n<br>\r\n   \"It contains your magic of reforming.  For a normal elf, it would mean he or she would reform in the village after being devoured.  In your case, it will strengthen your ability, and allow you to choose where you reform at any place you have been before.\"<br>\r\n<br>\r\n   \"That would mean I would not have to start over each time.  Eventually I will make it, no matter how many times I am eaten.\"<br>\r\n<br>\r\n   \"Probably.  There is a chance you will fail to reform each time.  A low chance, but a chance.  If you are eaten often enough, you will stay eaten eventually.  I can't say what the odds are, but I think you should make it.<br>\r\n    \"Now we need to test this, by having you reform again.  So do you want to be boiled down into soup again?  Or let my little boy here swallow and digest you?  </span></div></div>",
            "created":1161838800,
            "id":355102,
            "title":"visiting the witch"
        },
        "1132211221211211221111":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "familiar",
                "cooking"
            ],
            "content":"<div class=\"\"><div> <span>   \"Well..., being cooked wasn't too bad...\"  And that familiar of the Witch's kinda scares you.<br>\r\n<br>\r\n   The familiar looks disappointed, but the witch says \"That is probably the better choice.  I should have enough potions to create them for as long as desired, but a 2nd kettleful will change that from probably to certain.  So strip, and into the cauldron with you. Just think about where you want to be when you wake.\"<br>\r\n<br>\r\n   As you do as told, the witch turns to Gentlefoot \"Now for normal elves, this potion means they will survive being eaten and will reform at their homes.  You do not need to fear most of the creatures of the woods.  Being eaten will be just an annoyance.  You will be able to just let the monster eat you and then get back to work.\"<br>\r\n<br>\r\n  Gentlefoot is skeptical.  \"Assuming this works, a quite serious if, that means we would be reduced to the level of grass, casually eaten by whoever wants to.  That is not role for elves.  We should be ruling the woods.\"<br>\r\n<br>\r\n   \"You don't seem to be doing much ruling, do you?\" counters the witch.  \"Most of you cower in your village, and of those who do venture out, many do not return.  Unless something changes, your village and all in it will die.\"<br>\r\n<br>\r\n   \"We will find a way.  We have already made progress.  When first we arrived here, we were not even safe in our village.\" <br>\r\n<br>\r\n   \"But even that safety is not very safe.  There are monsters around here that could defeat your guard. So far, none have tried, but one could at any time.<br>\r\n   \"You are risking your life and the lives of all you hold dear.  Better to be the live grass.\"<br>\r\n<br>\r\n   Gentlefoot pauses and finally says \"I must think about this...\"<br>\r\n<br>\r\n   In the meantime, you have been getting into the pot, which is hot, but not as bad as last time.  Indeed, there is something almost pleasant about it, even erotic...  You resist, but eventually your hands steals to your mound and begins to caress.  It is not long before your excitement starts to build, and then to explode.  You sink back in completion...<br>\r\n<br>\r\n    You wake to find yourself right outside the witch's hut.  It seems her potion works.  So you pick yourself up and re-enter the hut.<br>\r\n<br>\r\n   Gentlefoot and the witch are glad to see you, and apparently they have come to an agreement as to the next step.  After congratulating you on your success, the Witch turns to Gentlefoot.  \"Now we must test this on a normal elf, which is you.  So you have the same choice she did.  Do you wish to try my pet?  or the pot?    </span></div></div>",
            "created":1162098000,
            "id":355622,
            "title":"success"
        },
        "11322112212112112211111":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "submit",
                "struggle"
            ],
            "content":"<div class=\"\"><div> <span>   \"I suppose I will allow your familiar to devour me.\" reluctantly answers Gentlefoot.  It is hardly an enthused choice, but as little as she, or you for that matter, like the idea, Gentlefoot agrees the witch is offering what may be the salvation of the entire village.  The forest is just too dangerous and something must be done.  Even if they can keep the deaths down to a survivable number, it is too high, and they may not be able to do that. So if the witch can save them, her potion must be tested, and if that means she must risk her life, that is what she must do.<br>\r\n<br>\r\n   So off come her clothes, revealing an excellent figure.  You do prefer boys, but now that you think of it, if Gentlefoot is available the next time your lad suggests a three-some, maybe you won't be that down on the idea.<br>\r\n   The familiar is way more enthused than you are, happily opening a huge mouth and wagging both tail and a surprisingly large tongue.  Gentlefoot seems willing to be gentle food and lies face down on the floor to await her fate.<br>\r\n   Which is not at all long in coming.  The familiar rushes to her feet and gulps them down.  He then starts slurping up her legs as he seems to reach some state of bliss.  But as he reaches the juncture of her thighs, he slows down and Gentlefoot's cry of protest tells you that huge tongue is being used in a way that she had not expected. But it is too late to stop, even if she could stop it now.  So she can only verbally protest and beg for mercy.  <br>\r\n   Mercy that is not granted.  He continues to play with her box, and his effort are soon rewarded.  However reluctantly, Gentlefoot is getting excited, and then cries out with a convulsive release.<br>\r\n   The familiar resumes dining and you watch his stomach expand as more and more of Gentlefoot vanishes.  As he reaches her voluptuous breasts, he pauses again and his tongue comes out to lick both of them rather tenderly.  And again Gentlefoot is unable to withstand his efforts.  She comes to a gasping completion.<br>\r\n   Satisfied, the beast finishes its meal.  You watch as Gentlefoot's scared face vanishes inside.  Then all that is left are some clenched fists, which are swallowed quickly too.<br>\r\n<br>\r\n    \"Now we need some exercise to work off all that food.\" the witch announces.  \"So he can sex you.\"<br>\r\n<br>\r\n    \"Wait!\" you protest.  \"That was not part of the deal.\"  <br>\r\n<br>\r\n    \"It also was not forbidden by the deal, Honey, so you screw him.\"<br>\r\n<br>\r\n   \"But your pledge...\"<br>\r\n<br>\r\n   \"You re-entered without a new pledge.  So I am free to do as I will.  You are free to volunteer, or to be raped.  So what is your choice?</span></div></div>",
            "created":1163134800,
            "id":358285,
            "title":"Gentlefood"
        },
        "113221122121121122111111":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "leave",
                "wait"
            ],
            "content":"<div class=\"\"><div> <span>  You are going to be raped no matter what, so you might as well avoid being beat up in the process.  Reluctantly you start to strip, a process that meets with the approval of your assailant.  His huge tongue hangs out as he pants.  Staring at it, and remembering the uses it can be put to, you can't quite suppress the thought that this violation may not be entirely disagreeable.<br>\r\n<br>\r\n   The familiar seems to have similar thoughts, and growls at you to hurry about removing your pants.  With little choice, you do as told and are soon standing before him completely nude.  You try to cover what you can, but that is quite inadequate.  <br>\r\n  The monster now approaches and starts to sniff your fragrant softness, a boldness that please him more than you.  A second later, you are wishing he was still sniffing, as that enormous tongue gets put into action and strokes over your loins.  But even as you are wanting him to stop, you feel your body betray you and start wishing for him not to.  Your excitement builds, and goes over the top with humiliating speed.  <br>\r\n<br>\r\n   Now he thinks it is time to return the favor, as he pulls you down until you find yourself facing his maleness.  It is way too big to fit in your mouth, but your opinion is not being consulted.  If it can't all go, as much as can fit will.  You unwisely open your mouth to protest, and that tool is shoved into the opening.  Then he proceeds to buck, pushing as deep as he can as rapidly as he can.  Fortunately he comes quickly, tho also massively enough to keep you gagging for some time.<br>\r\n<br>\r\n    But while you have been choking, he has been getting into position, and as soon as you can draw a clear breath, he lands on your back, shoving you onto hands and knees. A moment to get himself into position, and then a massive thrust and he is in your secret center.  <br>\r\n   Once again your screams of pain all too soon become screams of pleasure.  You are riding a towering wave, and it crashes in a frenzy of simultaneous explosions.<br>\r\n   After a moment of mutual relaxed completion, he limply pulls out and the assault is finished, a fact you are not going to admit you are sorry about.  Fortunately nobody asks.<br>\r\n<br>\r\n   The witch announces \"It's working.  your companion will be reforming in the village in the morning.  Then she will return here to get the potions.  Once the elves see how useful they are, I shall move into the village and rule as queen.  All will have to submit to my rule.\"<br>\r\n<br>\r\n   \"Rule by an evil witch... That's not a good thing I've brought on my village.\"<br>\r\n<br>\r\n   \"The alternate is slowly or rapidly being killed and eaten until there is no more village.  And that is an alternative they still have, but won't take.  So no, no matter how vilely I rule, and it may not be that bad, they have cause to bless you.\"<br>\r\n<br>\r\n    \"But you are no longer needed here.  You can resume your journey now, or wait to give your friend a last goodbye.\"<br>\r\n</span></div></div>",
            "created":1163480400,
            "id":358996,
            "title":"congress"
        },
        "1132211221211211221111112":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "hop in",
                "leave now"
            ],
            "content":"<div class=\"\"><div> <span>   \"I'll wait and make sure everything went right...\"<br>\r\n<br>\r\n   \"Excellent.  I can use a little fun.  Into my bed you go.\"<br>\r\n<br>\r\n   \"Hey wait.  I didn't say I would...\"<br>\r\n<br>\r\n   \"You said you would wait, and that means in my home, and under my rules.  You are my toy until your girlfriend returns.\"<br>\r\n<br>\r\n   You try to resist, but the witch is amazingly more powerful than you would think a little old lady could possibly be.  You can barely delay being tossed onto her bed, much less prevent it.  Nor can you do anything to stop her from tying legs and arms to corners of the bed.  In a moment, it is clear you are at her mercy, which she doesn't have much of.<br>\r\n<br>\r\n    Stripping her clothing off, she reveals a body that has not suffered nearly as much from time as you would have expected.  Not that you have much time to admire it.  She jumps right onto the bed, and you.  Sitting atop you looking at your toes, she bends forward until all you have in your vision is her portals of womanhood.  Then that is on your face.  \"Love me\" is her command, and one she carries out on you as you surrender and do as she wants.<br>\r\n    Her torso moves, stimulating your aching breasts and her needy mounds.  With you licking and lapping those warm centers, it is not surprising that you both quickly climax.  But this is not enough for her and you repeat the process, slower, but with the same wonderful result for each of you.<br>\r\n<br>\r\n   So the day, and night, and morning pass in depraved fashion.  On those rare times she must rest, her familiar assaults you. But now comes the hail from Gentlefoot.  She is alive and well.  Some what reluctantly the witch frees you and Gentlefoot is allowed to enter, to report full success, and that the village will welcome her as ruler once her potions test out with other elves.  <br>\r\n<br>\r\n    \"They will, but to speed up the process, I will need more base stock.  For that, I need to boil you down.  Strip, and climb into the pot.\"<br>\r\n<br>\r\n    Once assured she will once again reform in the village, Gentlefood does as told, but turns to you.  \"How about joining me?  We need to protect the entire village, and you will create  many potions.\"<br>\r\n<br>\r\n    The witch agrees.  \"Yes, she can help out that way.  But I can't command her.\"  Turning to you, \"So girl, do you want to help out your village once again?\"<br>\r\n<br>\r\n    The pot is hot you know, and this will delay your reaching your boyfriend another day, but your village does need the help...</span></div></div>",
            "created":1182834000,
            "id":420265,
            "title":"the witch rules"
        },
        "11322112212112112211111121":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "sex",
                "food"
            ],
            "content":"<div class=\"\"><div> <span> You do owe your village a lot, and it would seem you can repay it at small cost to you.  Well, small cost compared to what would happen to most people.  Even to you, being cooked down to a soup is a daunting prospect.  But you can survive it and your home can use the help.  With a sigh, you approach the pot.<br>\r\n<br>\r\n    It's a bit embarrassing getting in when both you and Gentlefoot are nude, but not nearly so much as afterwards.  The pot may be big, but not when 2 healthy young lasses are in it.  You are forced close to Gentlefood, and then when the lid is placed on, the two of you are quite tangled together, in ways you would normally consider quite shocking.  But there is no room to get in a more decent position.<br>\r\n<br>\r\n   Nor is there desire after a minute either.  Somehow your thoughts turn erotic as the water heats up.  Is it something in the spices the witch has put in here?  Or is that you are in intimate contact with a beautiful girl you have always had feelings for?  Or...?  Oh bother, all that really matters is that you are feeling these feelings.  Now will Gentlefoot object if you sorta, kinda, accidentally touched her a bit intimately?<br>\r\n    The question is answered by her touching you first.  A split second first, but still first.  You don't spring back.  [Not that you can in this small pot, but...]  And Gentlefoot moves forward.  You touch her again, in an \"accidental\" way, and then in a way you can't excuse as an accident.  Then you are locked in an embrace, and passionately kissing.  Your hands start to explore each other's bodies, gently, and then eagerly, passionately.  Your bodies press together and move in brazen ways.  <br>\r\n    You really can't say, but quite a bit of time may have passed when you start feeling different.  Then you realize you are climaxing, massively.  You collapse into Gentelfoot's arms a moment before she is struck by the same joy.  <br>\r\n   <br>\r\n   But as you slightly recover, you realize something is different.  Your limbs have become soft, almost fluid.  As the witch said, you are being boiled down to soup and you have but a few minutes of consciousness left.  What better way to spend it than in making Gentlefoot?  And you are quite successful at it.  Gentlefoot screams in joy twice before you drift off.<br>\r\n<br>\r\n    When you wake, you are where you had expected, outside the witch's hut.  Her magic has worked.  You can now reform where ever you have been before.  This will make your trip to your boyfriend a whole lot easier.  You wave in thanks to her hut and then resume your journey, hoping she will be kind to your village.<br>\r\n<br>\r\n    You have not gone far before you meet Sly the naga, who demands a full report on your time with the witch.  She is quite pleased to learn you can reform as you go now.  \"Wonderful, I can guard you and eat you and we won't lose much time.\"<br>\r\n<br>\r\n    You are not as pleased.  Being naga food is not how you want to reach your man, but the only way you know to suppress her appetite is to appeal to a different appetite, which you are not eager for either.  Still...</span></div></div>",
            "created":1183179600,
            "id":421449,
            "title":"Goodbye to Gentlefoot"
        },
        "113221122121121122111111212":{
            "author_id":"lemonicedtea",
            "author_name":"Parry",
            "choices":[
                "Awake near Sly and continue your journey (naga food? Eh, you get used to it)",
                "Awake back at your village and try another path (naga food? pass!)"
            ],
            "content":"<div class=\"\"><div> <span>You turn on your heel, facing toward the path you and Sly were taking to Monuna. \"Can  we maybe travel for just a bit before you ..uh..you know,\" you say as you point off into the distance. You figure if you're going to be eaten you may as well be a little closer to your goal when it happens. \"Look, I really don't want to be eaten right now\". Maybe if you just take a few steps in that direction....<br>\r\n<br>\r\nSly grabs your upper arm and simply shakes her head and grins happily, almost enjoying your naivety. \"You have been with that witch for quite a while.\"<br>\r\n\"I..we..had to make sure the potion worked,\" you offer in your defense. \"And I had to wait for my friend from the village.\"<br>\r\n<br>\r\nSly pulls you closer and coils the end of her long muscular tail individually around your ankles and legs; she isn't exerting a lot of pressure or hurting you, but still enough to make it quite clear you're staying exactly where you are. \"Oh, but it sounds like you were doing more than just that,\" she says as you feel her slightly shift her coils to gently rub against your inner thigh. <br>\r\n<br>\r\nYou squirm a little and manage to give yourself at least a small fraction more room, \"She..she wanted to do other things first, I really didn't have a choice,\" you offer in protest.<br>\r\n<br>\r\nSly tightens up her coils on you just a bit and continues to snake them around your body, now up past your waist. \"But you had <i>fun</i>, didn't you?\"<br>\r\n<br>\r\nGetting cooked alive, with the added insult of having the cook and her familiar have their perverted way with you, isn't exactly what you would call fun. But as you feel Sly press her coils now against your body and rub gingerly against your crotch you can't help but recall your similar pleasant experiences with the witch and think that maybe it was not all <i>that</i> bad. Even still fully clothed it feels nice to have Sly rub up against you. \"Hmm?\" she says, still waiting for an answer while she rubs her tail more forcedly against your shorts. You try to wriggle around and put some distance between you and her probing tail, but to no avail. \"Yes..I did, \" you answer honestly.<br>\r\n<br>\r\nSly leans her head in closer to you and traces the outline of your pointy elven ear with her forked tongue, \"You enjoyed spending the last few days there then?\" she hisses. You let out a barely audible moan as you feel the rough fabric of your shorts firmly pressed against your clit. You protest less and less. Your attempts to push away her rippling coils become weaker and weaker till you just give up and feel your knees start to buckle just a bit. Sly gently nibbles on your ear, perhaps to get a taste of things to come, before asking you again. You nod in agreement. <br>\r\n<br>\r\nSuddenly you feel the coils around you tighten painfully as you let out a sudden gasp of pain. Your muscles tighten, your back and knees go rigid, at least as much as you can in your confined state. Your arms and hands go taunt, desperately but fruitlessly trying to free yourself. The coils slither fast and forcefully up to your chest. \"AHHH!!\" is all you can express as she tightens her grip around your ribcage and forcibly expels all the air from your lungs. She rises up to her fullest height, dangling your tightly coiled body in mid air. You try to kick violently but mange to only just barely wiggle your feet. Your attempts to scream vocalize nothing but very faint unintelligible moans. As you gasp for air, she places her hands on her snake like hips and angrily says, \"Meanwhile <i>I</i> had to wait out here all this time without a single thing to eat!\"<br>\r\n<br>\r\nJust as suddenly as she lifted you off the ground, she completely relaxes her tail, letting you fall quickly to the ground with a dull thud. You quickly get to your knees and clutch your chest with both hands as you pant rapidly for oxygen. Before you can fully catch your breath, Sly starts to wrap her tail around you again, but making sure to give you generous amounts of room to breath and be comfortable, almost as if she were only trying to help you to your feet. <br>\r\n<br>\r\nYou realize she is set on eating you now, regardless of how you may feel about it, and you may as well go peacefully. \"Okay, okay, just please let me go.\" Sly relaxes the coils around your body, allowing you to step out into the open. You raise your arms above your head and take in a deep breath, which stings slightly, to try and make yourself as skinny and easy to swallow as possible to mitigate some of the discomfort that naturally accompanies being swallowed by the 20 foot naga. Closing your eyes hard, you begrudgingly say to Sly, \"I'm ready.\" Your pulse quickens and your stomach tightens as you anxiously await the inevitable; you just hope it will be quick. A brief moment passes before you feel Sly tug at your shirt, \"Ahem.\"<br>\r\n<br>\r\nStill bracing for the worst, you narrowly open one eye to see Sly with her arms crossed across her chest, but smiling pleasantly. \"You're forgetting something,\" she says with a slight giggle as she gently tugs at your shirt again. You lower your arms and start to undress. For a natural predator, you can't help but think Sly is a little picky about her food. As if sensing your indignation at having to not just be eaten, but having to strip down beforehand Sly suggest you think of it as simply being food preparation. <br>\r\n<br>\r\nYou lay down your clothes neatly for your return and retake your previous stance. Sly slithers over greedily behind you and positions her mouth over your hands. She holds your elbows in place as she guides your hands into her mouth. You feel your fingers slide harmlessly over her teeth and onto the soft pallet of her tongue. The palms of your hands feel the bumps and cervices on her tongue as she lowers her lips onto your wrists and toward your forearms. As Sly repositions herself slightly to accommodate your wayward hands down her throat, the rest of your arms slide in effortlessly. You close your yes even tighter as Sly opens her jaws wider to take in your head. Suddenly you feel her lips move over your forehead, down your face over your shut eyes and nose, till they encompass your own lips, and eventually sliding over your chin and down to your neck. The cool breeze of the forest on your face has been replaced by the moist, hot, and humid innards of Sly's mouth pressing against your face. <br>\r\n<br>\r\nSly pauses a moment to open her jaws even further for the not so easy task of cramming your shoulders, and ultimately the rest of your fair skinned body, into her waiting digestive track. With a little straining and shifting, she works one of your shoulders into her mouth and then the other. Accommodating your large breasts require Sly to open her mouth a little wider as well. You can't help but squirm a little as your nipples rub against her teeth on the way on, but Sly holds you firmly in place. Once your breasts are safely in place in her mouth, her jaws relax a bit. <br>\r\n<br>\r\nAt this junction your hands, arms, and most of your head are well into the naga's throat. Your body, from fingertip to your breasts, is covered in saliva. But Sly pauses a moment to let her saliva glands secrete a little more to make sure you slide down easily. Not so much for your comfort, but more for hers you imagine. <br>\r\n<br>\r\nSly lowers her mouth further down your body, above your navel and dramatically shifts position. She grabs you by the waist and turns your body upward while she lays on her back such that she is no longer lowering her mouth over you body, but that you are being lowered into her mouth. Admittedly, this does make things easier for both of you. Once your upper extremities are swallowed it is very difficult for you to remain standing on your own two legs while being eaten. However, you imagine you must look very silly with your head deep into a naga while your hips and legs hang outside sticking up in the air. You can feel a breeze on your feet. For Sly it is much easier as well as gravity does part of the work from here on in, and she merely has to sit back and relax while fitting the rest of your body in. <br>\r\n<br>\r\nNot passing up the opportunity to play with her food a bit, Sly runs her fingers over your pussy lips while her jaws start to expand to let your hips into her mouth. You squirm a bit and Sly lets out a muffled noise, which you imagine a giggle sounds like with a full mouth. She spreads your pussy lips with her left hand just enough to insert a finger. Deep within the naga you moan loudly and the sound reverberates from the naga's thoracic cavity. She stuffs your hips into her waiting mouth and holds on to your legs to prevent you from sliding down any further. She sucks on your hips for a while, lathering up your pussy with saliva, till she lets go of your legs. You can feel the contraction of Sly's esophagus, forcing you down deeper. Your heels slide in next, and after she straightens her body, your toes slide in with a loud slurp as Sly smacks her lips with satisfaction. <br>\r\n<br>\r\nAll lubricated up, your body effortlessly plummets into Sly's waiting stomach. You crash head first with such force that Sly's abdomen shakes. \"Hehe, be careful in there, I don't want you to give me indigestion, \" she says. Your body tosses and turns as Sly rolls over on to her back and looks fondly at the giant bulge in her stomach. She rubs her belly with a gleam of satisfaction, \"I'm sorry I hurt you earlier dear, but you see I really was quite famished.\" You can only let out a muffled response. \"What was that, honey?\" she says with a giggle.<br>\r\n<br>\r\nFirmly settled in her stomach, you curl up into a ball and hug your knees. Either from the lack of oxygen, or from the already starting digestion via hydrochloric acid - or whatever it is that nagas have - you loose consciousness and start to pass out. <br>\r\n<br>\r\nOnce (if) you awake alive, do you want to....<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1214715600,
            "id":549734,
            "title":"food"
        },
        "1132211221211211221111112121":{
            "author_id":"lemonicedtea",
            "author_name":"Parry",
            "choices":[
                "ask Sly to accompany you while you search for food.",
                "search for food yourself."
            ],
            "content":"<div class=\"\"><div> <span>You awaken, thankfully, safe and sound not far from where you and Sly just were. As you walk back eager to resume your journey, the cool breeze on your naked body, you suddenly realize there is a serious downside to being able to awaken at any place you have previously been. Every time you have awakened in the past, you're completely back in your fully natural state. That is to say, without any clothing or gear of any kind. And this time is no exception, but this was never a  problem before. Back when you awoke in your own bed back at your village, you would just put on a new set of clothes. Even at the witch's hut, you took your clothes off before being eaten or cooked alive. It was a simple enough task to retrieve them later. You breath a sigh of relief knowing that you can again easily retrieve your clothes that you left near Sly. <br>\r\n<br>\r\nBut what if you are not so lucky next time? After all, most monsters don't really care what their prey is wearing; they just gobble them up as is. Sly just happens to be particularly picky about her food, or maybe, you think, she just likes seeing you naked. If something were to eat you fully clothed, and you awoke near by, you'd have to find some other ways to get clothed. After all, it's not like you could go politely ask whatever ate you to return your garments that were fully settled in the beast's stomach. Still, you think, that may not likely happen. After all, Sly was here to protect you from just that - being eaten by other monsters. \"Other\" being the operative word here, since Sly clearly still enjoys having the monopoly on eating you. <br>\r\n<br>\r\nYou stop dead in your tracks as a much more serous problem dawns on you. Your naga companion may be well fed, but you certainly are not. Your only source of food and supplies before, was the village. You had always restocked your supplies after you awoke safely at home before setting out again. If you're going to wake up in the forest from this point on, you lose that luxury. How are you going to get food and water now? <br>\r\n<br>\r\nYou knew this trip was going to be arduous when you decided to undertake it, but you come to the realization that things have not been going all that well, and you're barely making that much progress. Your very first day out you met the manipulative naga, Sly, who is content to help you only as far as you can keep her appetite, both sexual and nutritious, satisfied. The witch you met shortly thereafter may have given you the ability to reform wherever you have been previously, but as you realize now, it comes with some potentially troublesome drawbacks. Not to mention that your prolonged stay with the witch resulted in a very angry and hungry naga that blamed you personally for your tardiness, resulting in a less then pleasant one-way trip into her ravenous stomach. All of this would be more tolerable, you guess, if you had actually been making suitable progress towards Monuna, but as it stands you have barely made any progress at all. <br>\r\n<br>\r\nYou return to the clearing were you and Sly were. You try and cover your nudity as best you can with your hands, partially out of embarrassment, but mostly cause you don't want Sly to get any ideas. Thankfully though, she doesn't appear to want to start anything. Still lying on her back, with an immensely satisfied look on her face while she  hugs the large bulge in her serpentine stomach that used to be you, she looks over and says \"Welcome back\" with a smile. <br>\r\n<br>\r\nYou take your clothing and quickly get dressed behind a large tree to obscure Sly's view, while you explain to her your recent concerns about your newfound ability to awake where you please. <br>\r\n<br>\r\n\"I thought you elves were great at foraging for food in the forest?\" she asks.<br>\r\n\"We are, \" you say as you finish dressing, \"but I'm not really familiar with this area,\" you answer. <br>\r\nSly rubs her belly with a slight moan, \"I don't know how you can stand those berries, fruits, twigs, grass, or whatever the hell it is you people eat.\" She looks over in your direction and traces her lips with her tongue, \"Elves are so much more yummy!\"<br>\r\nYou take two frantic steps back, as Sly quickly offers, \"Oh, don't worry, I'm stuffed.\"<br>\r\n<br>\r\nYour stomach lets out a jealous growl. You need to get something to eat. <br>\r\n<br>\r\nDo you want to...</span></div></div>",
            "created":1214802000,
            "id":550007,
            "title":"A slight problem..."
        },
        "11322112212112112211111121212":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "An interesting night",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>    \"Well, I am going to have to gather some food.\" you announce, \"Want to come with me?\"<br>\r\n    \"Not really,\" Sly rather lazily responds, \"I can if you really want, but don't forget that the more I move, the faster I get hungry.\"<br>\r\n    \"I guess you can stay here.\" you answer after you step back in alarm. It's odd in a way.  You very much want to avoid being eaten despite it not harming you, and despite enjoying it, sometimes immensely.  It sounds rather crazy when you think about it, but if you are offered the choice of riding in comfort in Sly's belly or walking, you are not going to hesitate to exhaust yourself and bruise your feet.  <br>\r\n   So Sly can rest and not eat you quite so often, and you start hunting for your rations.  And you are lucky right away.  You are hardly out of sight of Sly [Well, technically out of yelling range, but...] when you stumble onto a virtual garden.  Indeed for a moment, you wonder if it is the witch's garden, but while you are not really far from her home as a healthy young elf measures distance, you are quite far as an old lady does, particularly one who could put her garden a lot closer to home.  So you move in and start gathering all sorts of great plants.  This is too good to be true...<br>\r\n    The tentacle wrapping itself around you confirms that.  As you desperately try to get free, you spot the huge plant in the center of the \"garden\", a plant with a large bulb that you realizes is a digestion chamber that will soon be full of elf, and berate yourself.  You knew about this danger and have been warned of this sort of thing.  You were even warned that there had to be a reason all these delicious plants have not been eaten, and that reason was likely very dangerous.  But did you stop and look?  No... You just rushed in like a fool, and now you are being dragged off to be converted into plant food.  <br>\r\n      Well, what to do about it?  To your surprise, you start undressing.  A second later, you realize the wisdom of this.  Your chance of escape is low, but you can at least avoid damage to your irreplaceable clothing.  Being digested in the nude may be a lousy result, but it is still better than being digested and having your clothing ruined as well.<br>\r\n     By the time you are close to the digestion chamber, you are quite nude, and your clothing is safe, at least compared to you, tho not without some damage.   You wonder if you blew your chance to escape, but you doubt it, and you were very unlikely to get away without disaster to your outfit.  Time to be food again.<br>\r\n     At least the plant doesn't have thorns in its 'throat'... Ouch!  Correction, it has no thorns as long as you don't try to move away from digestion.  Which means you have to stay still and not move your hands down to play with yourself.  And your sliding into the the plant is too  stimulating to make doing nothing a desirable choice.  \"Lips\" slide over sensitive body parts until you really want to do something...something not too painful...  Finally you find some wiggling that gives you a little relief without too much pain.  Then you sink into blackness...<br>\r\n     You wake again well away from the plant, which may be a mindless plant, but you somehow see it as grinning at you and smiling over its delicious meal.  You glare at it, to no effect of course, and and then get down to recovering your clothing.<br>\r\n     Happily, the plant is too full to want a second course, and you have no problem getting both clothing and as much food as you can carry.  One might say you came out ahead in the encounter.  You don't agree.  You still see the plant as just like that lout who goosed you when you couldn't do anything about it.  Like with him, about all you can do is give the finger as you march indignantly out of sight.  <br>\r\n    You return to Sly just about dark, who merely mutters, \"Got plenty, eh?  Well, we can start moving in the morning then.  Right now... You just cuddle up against me...\"</span></div></div>",
            "created":1273381200,
            "id":880837,
            "title":"search for food yourself."
        },
        "113221122121121122111111212121":{
            "author_id":"davidargall",
            "author_name":"David Argall",
            "choices":[
                "getting friendly",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>   You sigh.  It is most unlikely that Sly wants to just cuddle.  Much more likely that she wants to drive you, and be driven, to heights of passion that will leave both of you exhausted, and likely hungry in her case.  But what choice do you have?  You have already decided you need her help if you are to reach your goal, and if she is getting more out of this than you expected, she is still vital to your reaching Monuna.  \"Vince had better be grateful for all of this...\" you mutter as you strip and put yourself in Sly's curls.<br>\r\n   \"You mammals.\" Sly laughs.  \"He is going to do a lot of perverted things to you, and then you are going to suffer months of being sick, awkward, and uncomfortable.  That will be followed by hours of unendurable agony, and that is the easy part.  You will be a slave for decades for your ungrateful little masters.  If you were at all sane, you would be running away from him, not working hard to get to him...  In fact, why don't you forget him?  The two of us could have a great time together.\"<br>\r\n    \"You could anyway.\" you retort.  \"Eventually I am not going to come back from being eaten.  The odds are pretty good if I am just going to get eaten a few times, but if we shack up, I'm dead.  <br>\r\n    \"And sane or not, we mammals do consider that program a good deal, and I'll take it over the alternatives.<br>\r\n    \"Besides, can you really call your own behavior all that sane?  I've heard some stories about Nagas acting crazy where their lovers are concerned.\"<br>\r\n   \"Well... It doesn't really happen that often.\" Sly tries to qualify the point, \"but yes, Nagas have done foolish things and been too trusting of false lovers at times.  I suppose it could happen that I will up in the belly of some snake I misunderstood the intentions of, or my hide end up a trophy on the wall of some lying man, but every girl makes mistakes like that...<br>\r\n    \"But that doesn't need to concern us now.\" Sly changes the subject, \"We need to make sure our relationship is a close one...\"  <br>\r\n    Sly's arms reaching around you makes clear her definition of \"close\", but you choose to 'misunderstand'.  \"I don't see how it can get much closer than being swallowed, and you said you were full.\"<br>\r\n    Sly laughs.  \"I'm comfortable full.  If I really need to, I can eat a lot more.  One time, when I hadn't eaten in far too long, and when it looked like hunting was going to be bad for a long time ahead too, I was lucky enough to trap 6 women in a cave.  I swallowed three of them and stuffed the other three in my womb to eat later.  I had a serious bellyache, but I got thru a time when a lot of other nagas starved.\"<br>\r\n   \"Do you have to talk about eating people?\" you grumble.<br>\r\n   \"People eat rabbits and chickens, and I eat people.\"  Sly responds, \"There's no big difference... or at least none that I want to talk about when you are in my arms...\"<br>\r\n   Looks like you are not going to divert her with talk.  Still it is not hopeless.  Maybe you can still keep her talking until she is too sleepy for other things.  But the odds are looking bad, so maybe it is time to switch tactics and seduce her.  Hardly your preference, but if you set the schedule for the fun and games, you can at least limit the damage.  Not as good as not being damaged of course, but it's at least easier to achieve.  <br>\r\n     </span></div></div>",
            "created":1273648380,
            "id":881890,
            "title":"An interesting night -pillow talk"
        },
        "1132211221211211222":{
            "choices":[
                "after a little rest......",
                "you then eat out the witch's pussy some more....."
            ],
            "content":"<div class=\"\"><div> <span>\"Now...my boy wants to eat your pussy that he just fucked so well!\" the witch cackled...then her form started to shift, and her voice changed.<br>\r\n<br>\r\n\"Oooohhh....nnnoooooo!\" you moaned, as you  are thrown onto your back,...the animal that was pumping your creaming pussy from behind, now pinning you beneath him.<br>\r\n<br>\r\nHis long doggy dick pink and hard, is rubbing itself along your sliming pussy hole....and in a rapid shove, you feel the entire, hot, hard, pulsating cock plunge deep into your vagina.<br>\r\n<br>\r\n\"OOOOOHHHHHHHHHHHHHHH.....UHHHHHHHHHH!\" you grunt out louder as the beast pressed the savage thrusts, and also mashed its lips onto your bobbing, heaving tittys. Within a few moments the two of you, now passionate lovers have set up a fast and furious pace of fucking....while the now glorious looking, well endowed witch, in a more younger, erotic form sits on your face, forcing you to suck, to kiss, to lick her frothing pussy.<br>\r\n<br>\r\nAll the while, you are getting the loving of your life....and the two new lovers in your adventures... groan and howl out their cummings, their joys, and their pleasures....along with your's!<br>\r\n<br>\r\n\"OOOOOOHHHHHHHHHHH.....COMING!!!!!!\" you scream into her gushing pussy, your tongue deep inside her frothing cunt.<br>\r\n<br>\r\n\"AAAARRRRRRRRUUUUUUUUUUUUUUUUUUU!\" Howls out the doggy boy, his hard cock spewing his baby-making come deep into your womb....<br>\r\n<br>\r\n\"OOOOHHH...GOOODDD....OOOHHHH....GOOOOODDDDDD!!!!....I AN.............AAAARRGGGGHHHHH!\" shouted out the witch....as she was also mauling at her sweaty, well-formed breasts....her hands pinching her nipples hard!!!<br>\r\n<br>\r\n</span></div></div>",
            "created":1159333200,
            "id":348951,
            "title":"Sex round two"
        },
        "114":{
            "author_id":"dragonsoul",
            "author_name":"dragonx",
            "choices":[
                "run",
                "convince it"
            ],
            "content":"<div class=\"\"><div> <span>You gulp in fear as you see the giant Saber Tiger glare at you. It is at least 8 feet tall, with about a foot long saber fangs, golden yellow in color, fiery red eyes, short black tail, and sharp claws. It looks at you with a hungry expression, licking its lips, its fangs glisening in the moonlight.<br>\r\n<br>\r\nYou have two options: run or try to convince it not to eat you. If you run, it will chase you, and with those long, powerful legs, it will easily catch you and gulp you down. However, if you try to convince it not to eat you, it just might leave you alone... maybe... Or it could just think you are even tastier than you look, (and with legs and a bust like yours, no surprise) and decide to just open its mouth and chow down.<br>\r\n<br>\r\nEither way, there is no escape for you.</span></div></div>",
            "created":1150347600,
            "id":324623,
            "title":"Saber is Hungry"
        },
        "1142":{
            "choices":[
                "the tiger begins to ravage you....",
                "you allow the tiger to have sex with you...."
            ],
            "content":"<div class=\"\"><div> <span>You decide to try and convince it....not to eat you. 'I am so getting tired of this damn eating revive cycle....what are the gods thinking?' you ponder, as the big, male tiger walks around your quaking, feminine form.<br>\r\n<br>\r\n'and what is he waiting for?' you ask, after several more minutes pass....with him just walking around you pacing in an angry, annoyed way. Then you see that reason why he has not eaten you....yet!<br>\r\n<br>\r\nHis large tiger's cock is out of itys sheath, the long, pink, hard muscle pre-cuming....and his balls slapping on his hind legs.<br>\r\n<br>\r\nYou gasp in sudden surpirse, while with some inner thoughts you assume a wanton, open position, spreading your elvish legs. All the while you clothing has mysteriously disappeared, your exposed titties are now throbbing and aching with your inner heat...and your pussy slit is now swollen, with your inner juices bubbling out and over your aroused, steaming hot cunt.<br>\r\n<br>\r\nWith a loud growl of success, the tiger pounces on your offered body....<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1159333200,
            "id":348955,
            "title":"The tiger gets you...."
        },
        "12":{
            "author_id":"dragonsoul",
            "author_name":"dragonx",
            "choices":[
                "IR Wolves",
                "AC Wolves",
                "Sword Ligers",
                "Gun Raptors"
            ],
            "content":"<div class=\"\"><div> <span>The eastern road you choose, mainly because you're closer to a village if you get into trouble, and there are a good supply of various foods for you if you get hungry. As you hike on, you scan around the area nervously, your giant ears twitching at every sound. \"Okay, Mayfair. Just relax. Nothing is going to eat you, I hope. Just stay calm and everything will be fine. Sure, you're tasty, but let's just hope that all the monsters have fed already. Just keep moving.\" You say this to yourself over and over, building up confidence.<br>\r\n<br>\r\nIt is getting dark, but you know for a fact that less than a mile away, there is a village you can stay at, and thus, you will be protected. But before you get near it, you hear some noises behind you. Turning sharply, you scan around, then you hear it again. \"M-Maybe I better pick up the pace!\" As you start to jog, you hear the soft \"patta patta\" of footsteps on the soft earth. Suddenly, out of the surrounding trees jump out... </span></div></div>",
            "created":1150261200,
            "id":324248,
            "title":"Being Followed"
        },
        "13":{
            "author_id":"dragonsoul",
            "author_name":"dragonx",
            "choices":[
                "a Shadow Saix (cheetah)",
                "a Black Rhimos",
                "a Nightmare Liger",
                "a Saber Tiger"
            ],
            "content":"<div class=\"\"><div> <span>You choose the west road, even though it is the longest, it is probably the safest. You march on, taking a look behind you ever so often, just to make sure you're not being followed. You hear a noise, but when you look around for the source of it, you see nothing, \"Agh! I've gotta stop being so jumpy. Just becuase I look delicious, and most likely I am, doesn't mean I have to lose my head over anything. Just remember, you are immortal, and you can't die... hopefully.\" You move on, heading towards the grassy plains.<br>\r\n<br>\r\nAs night falls, you unpack your stuff and start cooking dinner. As you munch on the meat apple, you feel an omnious wind blow, and your senstive ears pick up something coming from a distance. Grabbing the short sword you bought, you brace yourself for combat, scanning around the darkened plains. Suddenly, a large object is heading your way, slowly, you can't quite make it out. All you can really see are the glowing red eyes, and the large, sharp fangs. Suddenly, it starts to charge, you gulp, hoping this isn't the end.<br>\r\n<br>\r\nIt is...</span></div></div>",
            "created":1150261200,
            "id":324247,
            "title":"Darkened Plains"
        },
        "14":{
            "author_id":"dragonsoul",
            "author_name":"dragonx",
            "choices":[
                "a Pteras",
                "a Saberlion",
                "a mermaid",
                "a Saber Tiger"
            ],
            "content":"<div class=\"\"><div> <span>You choose the northwest road because you are more aware that it is less dangerous than the other roads. You just pray that nothing wants an elf snack. But then you realize something, that path is known for its Saber Tigers and Pteras. But you don't care, you just want to see your lover badly, so you push onward.<br>\r\n<br>\r\nAround noon, you come across a large river, and decide to take a bath, you'd feel better after hiking in this sun and heat. After removing your clothing, you slowly enter the water, nice and cool, just the way you like it. You relax for a minute, letting the cool water splash around your weary frame, but then you hear a splash nearby. You look around to see...</span></div></div>",
            "created":1150866000,
            "id":325638,
            "title":"A Little Break"
        },
        "142":{
            "author_id":"dragonsoul",
            "author_name":"dragonx",
            "choices":[
                "licks you playfully",
                "eats you"
            ],
            "content":"<div class=\"\"><div> <span>A Saberlion! A very rare creature indeed. I looks like it is a young one, playing in the shallow water. You think for a moment, even a young Saberlion would be good protection, and it is said that they never eat elves, but you're not sure. The Saberlion is probably about between 6 and 7 feet tall, with sea green and gray fur, a thin gray tail, two large spikes on the hing legs, mainly for balance when running, a triangle shaped head, and sharp claws and fangs. But the real reason why it is called a Saberlion is the large, almost frightening saber sword on its head, along with two additional ones on the side of its head, and all three can spread out and become firece weapons.<br>\r\n<br>\r\nYou realize it hasn't noticed you yet, so you try to slowly get out without startling it. Damn, you slip on a rock and make a big splash, getting the creature's attention. As you look up, you see it moving towards you, not sure if it is hungry or just curious.<br>\r\n<br>\r\nIt stops just inches from your face, sniffing you, you are almost terrified of those golden eyes. Then you see it open its mouth and you quickly close your eyes, ready for the worst.<br>\r\n<br>\r\nThe Saberlion...</span></div></div>",
            "created":1150866000,
            "id":325642,
            "title":"Saberlion: Friend or Foe"
        },
        "1421":{
            "author_id":"dragonsoul",
            "author_name":"dragonx",
            "choices":[
                "Ptera",
                "Saber Tiger"
            ],
            "content":"<div class=\"\"><div> <span>You feel his tongue on your face, and then on your elven breasts, it tickles. \"O-Okay! Stop! P-Please! That tickles!\" you cry, tears of laughter and relief coming out of your eyes. Guess the little guy just wants a friend. Finally, you manage to push him off, he wags his tail happily. Washing off the saliva, you scratch him behind his ear, he begins to pur.<br>\r\n<br>\r\nAfter getting dressed, you turn to the Saberlion, and you think of an idea. \"Say, little guy, wanna come with me? I need protection and I bet you need a friend. How about it?\" The creature is about to respond when you both hear a noise, both of you turn sharply.<br>\r\n<br>\r\nOut of the bushes came a...</span></div></div>",
            "created":1150866000,
            "id":325645,
            "title":"A New Friend"
        },
        "14211":{
            "choices":[
                "the demoness eats out Mayfair's pussy....",
                "the demoness makes Mayfair her slave...."
            ],
            "content":"<div class=\"\"><div> <span>Petra...a succubuss who just loves elf maidens....and she loves to make them come overe and over....<br>\r\n<br>\r\nThe demoness smiles at Mayfair, while the Sabrelion growls once, then springs away...running fast out of sight.<br>\r\n<br>\r\n\"Chicken!\" Mayfair shouts at its retreatinbg form, while Petra walked closer to the now afraid, lonely elf maiden.<br>\r\n<br>\r\n\"My, my, my....an endearing, lovely elf....and sassy too! Did I interupt something between you two??? she coyly stated while her hand reached up and began fondling Mayfair's heaving tittys.<br>\r\n<br>\r\nMayfair shivered as she felt warm, searching hands grope at her breasts...pinching her erecting nipples with expert ease...and she falling into the demoness' loving. With an inward cry, silent to all but herself, she gave into the succubuss' pawing of her turning on body....and in a moment she was completely naked,..and being pushed down onto the ground....carpeted by the grass of loving flowers.<br>\r\n<br>\r\n\"OHHHHHHHHHHHHHHHHH...UUHHHHHH&gt;&gt;&gt;&gt;\" was all she could say before her lips were mashed onto the demoness'...<br>\r\n<br>\r\nAll the while, their breasts were pressed into the other's, while the demoness' pussy mound ground into Mayfair's.....soon they began a nice, steady, hard humping, grinding each other's clit and creaming lips. They wer also kissinbg like lost lovers, their arms entwined, and groping the other's sweaty, glowing body.......</span></div></div>",
            "created":1159333200,
            "id":348958,
            "title":"Demoness Meets Mayfair"
        },
        "142111":{
            "choices":[
                "Mayfair now loves the Succubbus.",
                "Mayfair is given another choice."
            ],
            "content":"<div class=\"\"><div> <span>\"mmmmmmmmm....Mayfair....aaahhhhhhh....so good to find you, lover!\" the demoness states, as she begins to suck on elf's heaving tits. With another move of her head, the succubus begins to trail kisses down her necks, then towards her tits. She take the right nipple hard into her sucking mouth and draws gaps and moans from Mayfair as she continues to suck.<br>\r\n<br>\r\n\"OOHHHHHHHHHHHHHHHHHHHHHHHH......AAAAAAA!\" screams out Mayfair as she goes over the edge and comes while the succubbus is sucking that torrid tit.<br>\r\n?My, my, my....coming so soon?\" the demoness whispers, while she continues moving, licking and kissing down the elf's twisting, humping body.....towards her next target, Mayfair's just creaming pussy and clit.<br>\r\nSwollen with desires and needs Mayfair's cunt was sliming globs of feminine juices in a torrent. The river of juices was a sight for sore eyes, and with a cry of joy, the succubbus dove he r head down and began eating out Mayfair's creaming sex, and taking the hard nub of her clit in her sucking mouth....she continued on.<br>\r\n\"YES.....YES......SUCK MY PUSSY.....SUCK IT!\" Mayfair screamed while the succubbus drank down all that she could lap up. Meanwhile the demoness' hands were still mauling and tweaking on Mayfair's tits and nipples which seemed to drive Mayfair towards more orgasms.....as time went on!<br>\r\n<br>\r\nFor hours on end, the succubbus ate out Mayfair's pussy or sucked on the elf maiden's tits until it was too much for Mayfaior and she passed out from exhaustion....and the sheer number of times she had came. She was completely worn out from the succubbus' loving minstrations.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1171342800,
            "id":381984,
            "title":"Mayfair and the Succubbus."
        },
        "143":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "ate you ",
                "had some fun with you "
            ],
            "content":"<div class=\"\"><div> <span>you felt a splash. there sat a mermaid it looked human she had blonde hair and a green tail. ' mmm an elf in my river.\" she said looking at you. you got up but she grabbed you. ' my name is melody what is yours.\" you look at melody who was still licking her lips. \" i'm uum mayfair and i need to go and um see my boyfriend.\" you say getting up. ' dear your going the wrong way i know where your boyfriend is.'  you look back at her. ' you do where is he.' melody looks around and looks at you. ' i saw him going into the river not afew days ago he went to my cave oh we had some fun there.\" you sat down and listend. ' so my boyfriend is in your cave how am i supposed to believe you?\"<br>\r\n<br>\r\nmelody looked at you and smiled. ' it's rae that i see an elf and you look sweet.' you smile. \" thank you but i should get going flattery will get you no where.\" the mermaid called back as you picked up your stuff. \" miss mayfair will you not come and see me in my home we can have a fun time and you and me will be friends.' she said in a sing song voice.  the song was so relaxing your mind was starting to black out. \" i will go with you if you will take me.\" you say grabbing her hand.  melody gabbed your hand but instead of taking you to her home she knocked you to the ground and. </span></div></div>",
            "created":1273381200,
            "id":880693,
            "title":"a mermaid"
        },
        "1431":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "you wake up in your bed ",
                "your still in the dreamworld"
            ],
            "content":"<div class=\"\"><div> <span>the mermaid licked her lips as she looked at her meal. \" she fell for it just like the last elf that walked by my river.\" you were knocked out you could not move you felt something covering your feet. the mermaid opened her mouth as she swallowed your feet and legs. you sighed. you dreamed about your boyfriend. you danced had sex and promised you would never be apart again. but the mermaid was to busy eating you to know how you felt. she got to your pussy and licked it. in your dream you imagined it was your boyfriend doing ti. his long black hair his green eyes oh how you loved them so. \" kiss me\" you say as you sat up and kissed the mermaid on the head thinking it was your boyfriend. there was no replay the mermaid was to busy getting passed your sweet hips. you feel back down again and dreamed more. <br>\r\n<br>\r\n\" mayfair we can be together forever live with me we can have a family of little elf girls and boys.\"  your boyfriend said. you giggled. \" but i can't i'm not ready for children i just want to be with you forever.\" the two of you kissed. the mermaid was at your belly now and was haveing a wonderful time you you. her spell had worked. she had knocked you out and forced you into a dream like state so she could swallow you all the way with no struggle. she was a crafty predator tricking young maidens to their dooms by granting their hearts  desires.  this young elf wanted to see her boyfriend and you were happy to help but she was so tasty that she had to eat her.  the mermaid got to your breasts as you sighed still in a dream state. you and your boyfriend were haveing a picnic and you were laughing. \" oh mayfair you are my little bird we must not end this don't wake up let me take you.\"  he jumpped on you and rolled you over a cliff to a small river. but you saw something in the river. a mermaid just like the one you saw before. but she had red hair and a yellow tail. \" mayfair wake up my sister is eating you you must wake up.\" the mermaid said but you ignored her. <br>\r\n<br>\r\nback in the real world melody had just swallowed your head and had finished her meal. ' she was so good and she is with her boyfriend now for me to take my nap.\"  melody went back to the bottom of the lake and  was sleeping off her meal. </span></div></div>",
            "created":1273467600,
            "id":881204,
            "title":"ate you "
        },
        "14311":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "fight the wolf",
                "your dinner"
            ],
            "content":"<div class=\"\"><div> <span>you open your eyes and see your back in your room. \"  wait where did he go i thought we were finally together.\" you said sighing. you knew it was to good to be true that mermaid had tricked you and had you stat from the beginning. \" i'm never listening to a mermaid again.\" you say getting up and getting dressed. once again you got your supplies and headed out and looked at you home for the last time. your dream was so real it was like he was real. maby your dream was a vision and you would be with him forever and never see this place again. you walked down the path you walked not a day ago. you saw the river and the mermaid. you walked up to her. \" ok bitch why did you eat me and trick me and whatever it is you do to elves like me.\" melody looked at you. ' your not dead but every elf i ate always dies in my belly and never wakes from theier dreams.' you sat there and looked her in the eye. ' so all that was a dream huh well thanks alot now i'm delayed i need to get over that moutin.\" you say pointing to the peak in the distance. <br>\r\n<br>\r\nmelody looked at the peak. ' that place is in wolf territory you will be a fine snack for them.' she said and swam away. you went down the path again. it was mid afternoon when you sat down and went and looked at your rations. all you had were afew apples that would last only 3 days and some water which was limited. you sighed as you drank the water. \" i'm never going to get up that peak in 3 days oh if only a strong young elf was here instead of over that god damn peak.\" you got up but heard a noise. out of the woods was a wolf. he was bigger then most wolfs you saw in your village that always ate the live stock. it was about the same size as you and with grey fur. ' young elf would you be so kind and come out i do not mean you no harm.\" the wolf said nicely. you got out and he looked at you. ' why are you here  elves are not allowed in this place are you here to be my dinner?\"  you stood fast. these guys must be new to this area you did not remember a wolf tribe being here before. \" i'm mayfair and i'm going over the peak to see my boyfriend who is on the other side.' you explain to the wolf. the wolf laughed. \" thats a good one I like it when my food jokes.\" he said licking his lips. \" you do know no one has heard from the other side of the peak in years.\"  you looked at the wolf as he looked at you. \" i'm sure he is over the peak if I could only go over to it.' you say starting to get scared. the wolf looks at you with hunger in his eyes. \" i see you have food with you tell you what you give it to me and i'll let you go but the next time we meet your my dinner.\" you went to the bag and gave him the apples that were your only food for 3 days. ' yummy just yummy but not very tatsy.' the wolf said and he knocked you over. ' you said you would leave me alone.\" you screamed as the wolf opened his mouth to eat you. </span></div></div>",
            "created":1273467600,
            "id":881217,
            "title":"you wake up in your bed "
        },
        "143111":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "got to the fox village ",
                "go to the snake lands "
            ],
            "content":"<div class=\"\"><div> <span>you kick the wolf in the mouth as you got up and ran into the near by woods. ' a fighter huh this will be fun.\" the wolf said laughing.  that bastard had eaten all your food and wanted you for desssert. now you were going to go hungry unlesss you did get eaten and warped back to your village. but you did not want to have to restart again after the mermaid incident. \" ok mayfair lets see if i can lose that wolf.\" you said and looked around. this forest was new to you like the rest of the world. it was a normal wood trees and stuff. but you knew there was a wolf tribe in here somewhere and wanted to get as far away as possible from them. you jump over to a log and hide inside it as you heard the wolf comeing. ' where  is my tasty snack?\" the wolf said. you heard another wolf comeing by. ' commander we have to return to the village the foxes are at it again.\" the wolf commander sighed. \" I had just found a sweet elf maiden and the foxes attack what a day i'm haveing.\" as you hear both the wolves liveing you get out of the log. ' a war with the foxes and wolves huh well now i've seen everything.'  you stretched as you went and looked for the peak so you knew you were going in the right direction.  your stomach grumbled. ' great just great i'm out of food and now it starts asking for food.' <br>\r\n<br>\r\nyou went over to a bush whitch had afew berries in it. you took afew red ones and pu them in your mouth. they were sweet but you knew you had better find real food soon. you came up to a sign which read: left to fox village right to wolf village straight to snake lands. you did not want to go to the wolf village after all theier commander tried to eat you.  you saw the peak was straight but you hated snakes and did not want to be food for a python or something.whitch way to go?</span></div></div>",
            "created":1273467600,
            "id":881229,
            "title":"fight the wolf"
        },
        "1431111":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "you are interrupted by the wolf commander",
                "he eats you "
            ],
            "content":"<div class=\"\"><div> <span>you sighed as you went left and walked down the path to the fox village. you knew the foxes were going to eat you but you wanted to know what this war was about. besides maby they have extra food for you. you saw a small village full of red foxes standing on two legs. ' ok so the wolf village is defenseless we will reclaim the woods from those bastards.\"  said a female fox who must be a general.  the other fox looked like a grunt  as you knew about war tactics from reading about the old elf wars 100 years ago. \" yess sir the wolves are defenseless and word is an elf was spotted in theier land.'  said the fox grunt. you stayed on the wall as the two walked away. ' so an elf huh might be a spy we better find her and eat her.' said the general.  this was a bad idea and you knew it. but you had to get food soon or you'd die of starvation and you had no idea if you could be reformed from that. <br>\r\n<br>\r\nall the foxes seemed busy trying to form plans on attacking the wolves. you knew elves had had it rough with wars. mostly with humens as they did not understand you. thats why elves now live in valleys far away from normal human places.  you told this to your boyfriend but he still wanted to live in the human controlled elf village over the moutien. \" mayfair it will be ok that was 100 years ago times have changed.' he had said to you that day. <br>\r\n<br>\r\nyou remember that day well. he had been busy packing as you looked through his door. \" are you really going to go to Monuna the human village over the peak?\" you asked not 3 years ago. he looked at you. his green eyes his black hair so dreamy. ' mayfair times have changed it was 100 years ago sence that war humans are not as bad as you belive.\"  he hugged you and you kissed him. ' i;m nit sure i don't want to leave my family.\" he looked at you and smiled. ' i will always visit mayfair we can still be together even if we are far away.\" you started to cry as he took his sword and armor as he walked out the door. you ran after him. ' but the monsters they will eat you.' you said. he looked at yo. ' mayfair i'm a warrior i have fought and slain countless creatures in my 50 years of life.\"  this was true. he had been the one defending the village along with your father. but your father was dead due to an attack by some creature unknown to you or anyone in the village. \" mayfair i know you think i'm leaving the village defenseless but i'm not the sage of the village is setting up a barrier you will be fine.\" you look at him one last time as he walks off to the gate. \" are you going there to protect that village or are you dumpping me?\" you joked. he laughed you loved it when he laughed. \" mayfair if you ever want to come just come you need to learn to be brave like me you need to stand up for yourself thats why your my gal.\" <br>\r\n<br>\r\nthat was 3 years ago he never came back to you. he did send letters but never came in person. you knew he was fine he talked about his adventures in stopping creatures and how humans had changed. but you still missed him. you could never be brave like him you were not a warrior you knew nothing of combat. the only reason you stopped that wolf was beacuse you kicked him if he had been there he would have slain. \" i miss him so much.\" you say starting to cry. you hear someone comeing. you hide behind a abrrol and see 2 foxes. \" the commander of the wolves is here to speak to the cheif we will not let him in we know it is a trap.\"  one of the foxes said. you heard breath on your neck. \" we found her.' said a voice behind you and you were grabbed and tied up and thrown into a hut. there sat a old and aged fox. he looked like he was blind. ' what is it you need young one?\" the chief said as he just sat there. <br>\r\n<br>\r\n\" i'm mayfair I want to help you with this war and maby hel me with supplies.\" the chief looked at you. \" outsiders are not allowed to deal with other affairs now if you kindly would leave. you were tied up how can you leave. \" oh your tied up hmmmm it has been days sence i had my last meal stupid wolves eating everything.\" the fox cheif got up. you were going to die again. <br>\r\n</span></div></div>",
            "created":1273467600,
            "id":881250,
            "title":"remembering the past "
        },
        "14311111":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "yes",
                "no "
            ],
            "content":"<div class=\"\"><div> <span>you hear the door open. ' so the foxes have allied with the elves.' the wolf commander said as he walks towards the chief. you also hear the fox general enter the room. \" leave him alone the elf is your spy not ours.\" the wold looked at you. \" you fool this elf is not from this area she must be from that remote village she is an outsider and should be eaten.\" you sighed. ' can you unti me now/' you say bit they ignore you. \"  we do not care where she came from why is she here wolf?\"  the wolf laughed. ' i found her outside our forest and chased her here said she was looking for her boyfriend.\" the general looks at you. ' looking for your boyfriend how sweet but why come all the way out to fox and wolf forest?\"  you tried to get up but were still tied up. ' my boy friend is at Monuna a human controlled elf village over the mountains.' both the wolf commander and the fox general looked at you. \" is she talking about that warrior who was in these woods not long ago?'  you eyes were wide. he was here he was in these woods. maby he was going to see you but got caught up in the war. \" you mean that cocky bastard who slain half my troops.' the wolf said and the fox general nodded. you knew it was him you just knew it. you were untied as the cheif sighed. ' that was months ago he might have went back over the mountens.\"  you got up as the wolf looked at you. ' so your his lover huh had alot of issues with that one always picking fights with me always getting in my way.\" you giggled. \" i need to find him i miss him so much why would he be here and not in Monuna?\" you asked. the cheif said nothing. the wolf looked at you. \" there are strange things happening in this vally you never seen this place before but your lover has seen it all.\" <br>\r\n<br>\r\n\" maby it was beacuse of those black things?\" the fox general said. black things you remember 4 years ago a black cloaked thing killed your father.  \" those hooded things that suck the very soul out of you those things make me sick they should stay on the other side of the peak.' the wolf commander said. \" i heard rumors one is here in this forest if it is true we must end this fighting and take care of it before it destroy both tribes.\"  so he came to that villae beacuse thats where the black things are it kinda made snence. he always liked a challenge you remember the day your dad died.<br>\r\n<br>\r\nyou were crying by his grave and he walked up holding his sword. \" i could not kill the bastard it was like he was not alive.\" you looked at him. he had that serious face he always had when he fought but it did not go away this time. \" mayfair i'm sorry i'm to weak i could have saved yur daddy but i did not.\"  you looked at him. his face was dissaponted. he wanted to be the best warrior in the village but he failed. \" your a great warrior you know that.' you say and he kisses you. \" i love you so much if anything happened to you i would kill myself.\" <br>\r\n<br>\r\nback in reality the foxes and wolves were trying to deiced what to do. \" we should form a untied party and find this hooded black thing before.\" the cheif said. you sat in the back as the fox grunts and the wolf commander talked. this was getting stupid you wanted to find your boyfriend but one thing led to another. now here you are beinf led into a battle. the fox general looked at you. \" can you fight?' you shake your head. \" what can you d then?\" you explain your healing arts and how useless you are. the fox general looked at you and gave you a sword. ' mages are no use to us you must learn to fight with a blade or you will die out here.\"  she grabbed you hand. \" do you wish t join our fight maby you'll find him out there on the battle field.'\"</span></div></div>",
            "created":1273467600,
            "id":881273,
            "title":"you are interrupted by the wolf commander"
        },
        "143111112":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "you die ",
                "your reformedbut are in the fox village still "
            ],
            "content":"<div class=\"\"><div> <span>you look at the sword. sure he was a great warrior but you were just a mage and knew you could not help. \" sorry but i'm going to look for him else where have fun with your little battle.' you got up the fox general looked angry. she grabbed you and knocked you down. ' you say no to us outsider you have no right i will eat you here and then you will never see him again.\" the fox grabbed your legs and stuffed them in your mouth as you screamed. ' ok i'm sorry please just don't eat me i'm delayed enough as is.' the fox ignores you as she swallows your knees.  you knew you should have said yes as she gulped down your hips. ' mayfair your so stupid you know anything in the valley can eat you yet you play them for a fool.'  the fox gets to your belly as she swallows more of you. you rememer again how you and he had sepnt alot of time together after his battles.<br>\r\n<br>\r\nyou and vince [ you referred to him as he and him beacuse that made you feel less sad.] were at you parent's house after he had just come back from an epic fight with a liger. \" so i says to my mate that liger is a bastard and stab him right in the chest and then brought him here so we can eat together.'  you gasped as your boyfriend said this. ' vince did you kill matthew or are you talking about the liger.' your father asked him. your dad did like vince he was like a son to him and loved that you found someone you wanted to spend the rest of your life with. ' oh um i uh of course it was the liger what do you take me for pycho path?\" your father got up from the table. ' vince leave you need to leave and i never want you to talk to my daughter again do i make myself clear.' vince got up and you fallowed him. this was 6 years ago you two had only just met afew months ago. \" you know what kid your dad is an ass.' vince said throwing stones in the river.  you sat next to him. \" why did you kill matthew vince/\" you asked. vince looks into your eyes. ' mayfair you and me we are made for eachother it's just i'm a warrior and i take things to far your dad hates it.'  vince was ignoreing the question he always did this even before he left not 3 years later after this event. \" tell me why you killled him or we are done.' you screamed. this was the first time you said this. you said this about 6 times during your relationship before he left. \" mayfair your so stupid he was being controlled by a monster that i had never seen lets leave it at that.' vince walked back to his house as you walked back to yours.<br>\r\n<br>\r\nafter that your father forgave vince and you went back to being a happy boyfriend and girlfriend. then your dad died not a year later and then 2  years later vince left. you knew all this had to do with that hooded creature. what was it/ yu wondered as the fox general got to your breats. was it an animal a demon or was it something else. you had never heard of a creature that sucked out your souls. your father ha died and there was nothing on his face. it was like his soul was gone forever. your mother was heart broken after your dad died and she died not a week later. you hated that you lied to vince the day he left. you had no family left vince was the only one you had left. you cried as your head was swallowed by the fox and entered her stomach. the acids went over you. ' am i going to die or am i gonna begin anew?\" you wonder as you fell asleep. </span></div></div>",
            "created":1273615440,
            "id":881650,
            "title":"more memories "
        },
        "1431111122":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "you reach the battle field",
                "you are stopped by some creatures "
            ],
            "content":"<div class=\"\"><div> <span>you wake up in a bed that you don't remember. ' why am I here i thought i would be in my village.' you said getting up. you were still naked as you looked around. all the warriors from both the foxes and the wolves were gone. the fox general however was still here. \" your quite the thing mayfair you can be reformed after being digested.' you giggled. ' yes but why am i here i thought i always reformed at my home.' the fox general looked at you. ' this is your home now mayfair you said in your dreams while i ate you there was no reason to return there so your mind said this is home.\" you could not believe this. ' but where is vince.\" you tried to say but you cried at mentioning his name. ' i expect he is on his way here he wants to get that bastard as soon as possible and you being here might make him alittle happy.\" <br>\r\n<br>\r\nyour journey was gonna ned rather quickly iof vince was in deed coming here. now you just had to sit and wait for him to come and then try and either get him to go back to your village or you go with him to Monuna.  you got up as the fox general gave you some armor. ' you will need that sence you don't want to use a sword we need to protect you atlest.'  you put it on and sighed. ' i can't fight don't you understand that.' the fox genrral ignored you. ' mayfair this fight will be hard on all of us you need ti help us get this hooded thing out of our woods and back over demon peak where it belongs.' you nooded. ' ok i'll help.' then you got up and looked at the sword. \" i'll take it just in case but i want to wait for vince.' the two of you sat there and the you heard someone singing.' oh my girl mayfair is so far away but i need to fight another day but she loves me still i'm sorry we have not seen eachother in 3 years.\" you ran and saw it was vince. there he was his grey armor his trusty sword his horse and his long black hair. ' mayfair it's good to seeya my little love muffin.' he said as you jumpped into his arms. ' you bastard you had me waiting 3 fucking years where have you been.\" vince put you don and saw the fox general. ' where is it where is that bastard i need to kill it and i need to kill it now.'  vince had forgotten you were there he was in serious mode. ' the hooded creature is deep in the woods both mine and the wolf commander's men are out looking for it.' vince sighed. '  3 years chasing that bastard and he is right in the same place I just left oh what a day.\" he walked right passed you and did not even look at you. ' vince wait for me.' vince got on his horse and still ignored you.  you started to cry. ' does he not love me anymore?\" the fox general looks at you. ' he has alot of things on his mind he has been like this for the last 3 years.\" the two of you walk into the command room. ' you have been in contact with him for 3 years.' she nodds. \" yes he has been trying to find that hooded thing for so long he does not remember anything he did before then.' you sighed. ' once vince starts something he never stops until it is finsihed.\" the fox looks at you. ' this is serious mayfair he might die out there he is not himslef he is weaker then the vince you know he is ageing faster then a normal elf you need to give him this.' she gives you a bottle. \" it will help his ageing issues it must be from stresss i have no idea what he has been doing all i know is he has been in that desert for 3 years and it is showing it's toll.\" you took the bottle and climbed on toa horse. ' i'll save vince i love him to much for him to die.' you say going to fallow him. </span></div></div>",
            "created":1273616640,
            "id":881656,
            "title":"vince is not the same"
        },
        "14311111222":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "reborn at your village ",
                "reborn back at the fox camp "
            ],
            "content":"<div class=\"\"><div> <span>as you ride your horse and go deeper into the forst you are stopped by 2 creatures you had never seen before.  they looked like rats they were big with rat paws and ears. the only thing they were missing were tails but one was brown the other blue. \" look comrade an elf for us to snack on while the others fight oh joy.' the blue one said. you drew your sword whitch scared the rats alittle. ' she has a sword comrade we should get out of here.\" the blue one said but the brown one did not move. \" you idiot she is no warrior only male elfs are warriors you little twit.\" you were insulted by this. so what if female elves were more mages then warriors you remembered your mother tried to be a warrior once but she did not do so well. the rats knocked you off your horse and they broke it's legs. \" one of us will eat the horse the other eats the elf.' the brown rat told his friend. you looked at the rats as they faught for who got to eat you. ' i really need to get going guys.' you said getting up but the blue rat grabbed you. \" no we are starving or master has not fed us for weeks and he won't let us into the battle filed so we could eat the foxes and wolves.\"  the rat knocked you out and you heard your back snap. ' just great lets hope vince is coming any moment to save me.' you say and waited.<br>\r\n<br>\r\nyou waited and vince did not come. the rats were ready to eat you as you watched the brown rat ripping the flsh off the horse. the blue rat grabbed your body and ripped your outfit off and stuffed your legs into his mouth. ' no let me go i need to help vince god damn it.' you scream as the rat swallows your legs and then hips. the brown rat was laughing. ' why send a women to help they are uslesss  even in our tribe.\" then you remembered rumors about rat creatures lving in demon peak. ' oh shit why are you things here your not native to this valley you were exiled even before the human elf war 100 years ago.\"  the blue rat was to busy swallowing your belly to answer. ' stop swallowing comrade i will explain to the women here.'  the blue rat stopped as the borwn one grabbed your face. ' you see elf girl we have lived outside of this valley for years even before me and my friend were born.'  you bit the rat and it groweled. ' and one day a man with a hood told our cheif that we would rule the valley forever if we agreed to fight for him.'   a war was starting the foxes and wolves were fighting not only this hooded thing but these rats. you knew vince was in trouble;e you had to get out of this mess. if you reborn back in your village you would not have time to help him.  the rat swallowed you again as it got to your breasts. you screamed.  you needed to get to vince but these things were stopping you. they were not even that smart no wonder this hooded guy did not want them fighting. as the blue rat swallowed your head you entered his belly. ' yummy she was great comrade.' the rat said outside. ' and the horse was to lets see if we can find more elves out here.\" you kicked from the inside of the rat. ' touch vince and you die.' you screamed but they ignored you. the acid was comeing. lets  you don't end u far away. </span></div></div>",
            "created":1273701240,
            "id":882129,
            "title":"you are stopped by some creatures "
        },
        "143111112221":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "it was a  wounded wolf ",
                "it was a giant frog "
            ],
            "content":"<div class=\"\"><div> <span>you woke up and found yourself in your bed back at the village where you started. ' no vince no please be ok please be ok.' you said getting your stuff back together. you stopped by the supplie store and the owner was nervous. \" god mayfair where have you been the northern forest is in flames.\" you ran out side and sure enough the fox and wolf forest was ablaze. you started to cry knowing vince might not have made it. ' no vince why did i have to get eaten why did this happen.\"  but the shop keeper came with a letter. ' mayfair this came here afew hours ago it's from vince this is bad girl.\"  you opened the letter. <br>\r\n<br>\r\ndear mayfair <br>\r\n<br>\r\nwhy the hell did you get yourself in danger like that you know how worried i was. thank god the fox general explained your powers or i would have killed myself knowing you were dead inside a rat  creature's stomach. they eat elves mayfair you need to get the villagers out of there and fast relocate them to the southern part of the vally. don't worry about me just save yourself i'm going back to Monuna. that bastard disappeared as soon as i got there. wounded the rat creature chief thoe man that was some battle. i know your worried about my ageing problem but don't if i die then i die i just don't want you dying beacuse of me. you have along life to live mayfair and if you need to spend it with another guy so be it.I order you to stay as far away from me as possible. do not fallow me back to Monuna. that hooded freak is to powerful even for you. your no warrior mayfair so keep to the village. like i said relocate the village tell the sage and the elder. get your ass out of there the rats will be there in 2 days.  i love you not only as al over mayfai. before we started going out you were like a sister  to me. i know this bastard as something to do with my family being killled so i'm killing him no matter what. remember do not fallow me. <br>\r\n<br>\r\nlove vince.<br>\r\n<br>\r\nyou sat there as the shop keeper got the sage and the elder. ' so we need to relocate to elfwood village.' the elder said reading the letter. the sage looked at you. ' are you ok mayfair do you need to sit down and take a rest?\"  you stood up. ' no i'm going after vince you guys help the villagers i'm leaveing.'  you got a whole 3 months of supplies and another sword as you looked at the village. ' you said not to but i know you want me to vince you bastard.' you said turning to the ptah.  the path you went on was diffrent from the one you went on before. sence the rats were coming from the north you had to circle around and get to demon peak from the south. you saw a river and ducked down. you heard something. ' if it's a rat i'm killing it so help me.' you said holding your blade. <br>\r\n</span></div></div>",
            "created":1273702140,
            "id":882139,
            "title":"another journey begins "
        },
        "1431111122211":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "time to kill a wolf ",
                "reason with it "
            ],
            "content":"<div class=\"\"><div> <span>out of the woods came a wolf. it was bloody. must have been fromt the battle you thought. you got up as the wolf fell to the ground. \" are you ok?\" you ask the wolf. the wolf ignores you. maby this was not the same wolf from the tribe you had seen eailer. it had more dark grey fur the wolf commander had lighter grey.  the wolf looked at you. ' a elf here in the open my what a nice time for me but ugh.' the wolf was in pain. \" you need to stop your wounded what happend to you/' the wolf looked at you. ' i was attacked by some rats I knew the other wolf tribe was fighting them but had no idea some were hiding down here.\"  you looked at the wolf. ' so your not from the tribe of wolves from the north/\" the wolf looked at you. ' no i am a normal wolf living in the southern end of the valley.'  you went and got him some medicine from your pack. ' don't worry i'll clean you up just don't move.' you cleaned his wound and got some wrappings and wrapped the wound up.  the wolf got up. \" oh thank you my dear oh how i wish I was not so hungry i would help you.\" it said coming towrds you.<br>\r\n<br>\r\nyou grabbbed your sword. ' you bastard i helpped you and now i'm just food to you.' the wolf ignored you. ' i have not eaten in days the forest is getting less food lately your will do nicely.\" the wolf said licking his lips </span></div></div>",
            "created":1273795980,
            "id":882807,
            "title":"it was a  wounded wolf "
        },
        "14311111222112":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "sent to the master ",
                "fed to me "
            ],
            "content":"<div class=\"\"><div> <span>you looked at the wolf. ' come on a war is about to break out we need to work together.'  the wolf looked at you. ' a war no one told me about a war.' you sighed and explained. ' these rats want control of this valley they lived on daemon peak for along time now and want this for there home and that means killlling everything in it thats not them.\"  the wolf looked at you. ' so you are saying we must form a truce why should i belive a tasty snack like you.\" the wolf said licking his lips. <br>\r\n<br>\r\nthe wolf was comeing closer and you heard something comeing. it was the two rats from before. ' look comrade a wolf that we missed and wait it's the elf i ate afew days ago.' the blue one said. you saw the stupid rats look at the wolf as they were prepared to attack it.  thw wolf stood no chance as he was ripped apart and eaten by the rats. ' that was tasty comrade now what to do with this elf.\" the brown one asked. the blue one looked around. ' the cheif might want her for something she can reform after all might prove useful.\" the two rats grabbed you as you walked through the forest. \" let me go i'll killl you both.' but they ignored you as they dropped you off at a small cave. ' oh great kingdrok come out we have something for you.\" a giant rat  came out of the cave. in the light it was brown but you noticed it had one arm must be what vince was talking about. he held a small club to.  ' why have you idiots disturbed me i was takeing a nap and resting my wound you idiots.' he said bonking them on the head. then he saw you. \" it's another elf get her out of my sight.' he rawred and you fell over on top of the rats. the cheif was angry must be beacuse of what vince did to him. ' i never want to see another elf unless it is dead and on my plate you got it now why have you brought me a fresh elf?\" your stomached was turning as he said that. he must not want to take any chances eating a living elf after what happend with vince.  the two rats looked scared to. ' this elf is diffrent my lord she can reform my comrade ate her and she is still alive.' the brown one said. the cheif looked at you and smiled. ' the hooded one might have use for her maby as bait for that bastard who took my arm.\" he said looking at you. ' um mr cheif i'm mayfair and that bastard is my boyfriend now if you don't mind i have to go and see him so.' you say starting to walk away. \" no one leaves the great kingdrok and lives to tell the tale unless of course they are my minions or my master.' the chief screamed and banged his club. you fell over as the two rats grabbed you and took you deeper into the cave. <br>\r\n<br>\r\nkingdrok looked at you. you looked around. it looked like a throne room. must be where he lives you thought. ' what shoud we do with her master/' the two rats asked. \" we will do what must be done.\" the chief said. ' she will be.........\" </span></div></div>",
            "created":1273796820,
            "id":882819,
            "title":"the rat creature cheif "
        },
        "143111112221121":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "try to get your sword ",
                "your knocked out "
            ],
            "content":"<div class=\"\"><div> <span>\"we must inform the master of out findings\" kingdrok said and the two rats looked scared. ' but we have no idea where he is he lives in that desert it is wide sire.' kingdrok hit them with his club. \" idiots we only need to summon him with magic and send her to him through his own magic.\"  you were smileing. you had a chance to speak with the thing your boyfriend was after and you had alot of questions. the rats pounded the drums as the cheif said a chant. smoke fillled the room and sitting on the throne was a shdow like figure of a grim reaper. it had a cloak his face was not shown and he carried a blade you had never seen before. ' why have you summoned me kingdrok?\" the hood one said angerly.  the two rats ran from the room but kingdrok stopped them. ' master we have located an elf that might be useful for your plans.' the chief said and the hooded one walked over to you. \" do not be afraid i am an illusion i can not hurt you...yet.'  it was true you touched him and he turned into smoke. ' why do you want me for?\" you asked the man. the man sat back down. ' child have you ever heard of the changeing?' you looked shocked. the changing happend  even before the elf human war. ' yes it split the land into to and caused a drought which turned everything that did not turn into this vally into a desert.'  the hooded one laughed. ' good i'm glad you elves know your history.' he said getting up. \" you see elf the changeing not only effected menbut it effected everything animals plants even  these rats.' his hand pointed towards the 3 rat creatures next to you who stood there silent as there master spoke. \"  these things were so easy to tame and beacuse of that my army is getting closer to reclaiming the valley but.'  he looked at you. ' a man is searching for me and you know him don't you.\" you covered your mouth. you had to lie vince was in to much danger already. ' no i do not know who you are speaking of but about the changing.' <br>\r\n<br>\r\nthe man sighed. ' i wish the world to be the way it was again i want to bring it back to a lush green field of wonder not a heartless death trap.'  he then pointed his blade at you. ' and i also wish to rule this land as welll for my word will be law.' you laughed. ' oh come on are you serious your nothing but a typical villain from a fairy tale.\"  the man looked at you. ' to do this i need a pure soul and yours just might do my child.' he said touching your cheek. ' well sorry I have to much to do right now to be used for a stupid world rebirth plan sorry but you lose mr scary guy.\" you joked and started top walk out. ' you stupid girl you have no idea what you are getting yourself into do you.' you turn around as you felt you body being tugged. ' i'll show you what happends when you cross me.' the man said as the rats cheered. ' great mayfair your attitude just got you once step futher from vince.\" you felt your hands being tied but some force and a portal opend. you were pushed in and fell on your face. there stood the hooded man. ' so i'm not a threat to you huh.' he said swinging his blade right at you. </span></div></div>",
            "created":1273885740,
            "id":883289,
            "title":"sent to the master "
        },
        "1431111122212":{
            "author_id":"twlightking",
            "author_name":"twlightking",
            "choices":[
                "frog legs anyone ",
                "the frog makes you drop it "
            ],
            "content":"<div class=\"\"><div> <span>out hopped a giant frog. it did not notice you as it licked the water from the stream. maby you could walk passed it. it was green and very big. big enough to swallow you in one gulp even. you walked silently twords the forest but you stepped on a twig and the frog looked at you. it looked at you with a hungry look. ' no don't eat me please i have been eaten twice now and the 2nd time made me miss my boyrfriend so can you just let me go please.\" the frog stuck out it's tounge and licked you. you felt spit on your outfit and the frog just sat there. ' must not want to eat me i gusse.' you say with relief. atlest the frog knew you were not tasty but somewhere in your brain you were insulted.  the frog returned to drinking the water. it shot it's tongue at afew fish and looked at you again. it dropped some fish at you. \" oh you want me to eat these fish huh.' you say and it nodded. ' not much of a talker huh.' you say starting a cooking fire. it was getting dark and you knew you were takeing a longer path then last time to get to vince. that night you sat there and ate your fsh and the frog was still sitting there stareing at you.  \" so uh do you want something from me?\" you asked the frog. it just sat there. \" do you want to eat me when i fall asleep?\" you ask again the frog said nothing. the frog was stareing into space. ' your werid you know that right.' you say the frog just hops back to the river seeing more fish and eating them. <br>\r\n<br>\r\nyou set up your sleeping bag and lay down. the frog hopped back to you and dropped some fish on top of you. ' hey quit it i need to sleep.' you say but the frog hopped back got more fish and you were soon covered up in fish. \" god damn it what a stupid frog ' you say going to sleep. you felt the frog hitting the fish with it's tounge and swallowing them. one after another. soon there were no fish left all that lay there was you. \" are you done can i sleep now?\" you ask it. it just looks at you and licks it's lips. it sticks out it's tonge and your now in it's mouth. ' shit where is that sword.' you say and it's in the holder on your belt. </span></div></div>",
            "created":1273797360,
            "id":882826,
            "title":"it was a giant frog "
        },
        "15":{
            "author_id":"dragonsoul",
            "author_name":"dragonx",
            "choices":[
                "a male Shadow Fox Clanner",
                "a female Shadow Fox Clanner",
                "a Night Tortoise",
                "a Ptera Striker",
                "a Hell Kat"
            ],
            "content":"<div class=\"\"><div> <span>The northeast path sounds good to you. Even though it goes through the Black Forest, you bravely move onward. The Black Forest is known of the packs of Shadow Monsters and the Shadow Fox Clan. You think for a moment... maybe you can ask on of the Fox Clanners to guide you through the forest? Probably not. You have no idea where they live, nor you doubt that one would pass up on sexy elf maiden flesh just to help you. But then you think of something, what if you can compromize with one of them? Maybe? Regardless, you move on.<br>\r\n<br>\r\nEven in the day, the Black Forest is pitch... well, black. It is hard to navigate in such a dark and dense forest, but you keep moving. Finally, when you know it is night time (the forest is even darker, if you can belive it), you unpack your stuff to rest. The small camp fire barely lights up the small clearing. \"Damn, it's dark. Even with this fire, I won't know when a monster shows up until my head is in its mouth. Maybe this wasn't such a good idea...\"<br>\r\n<br>\r\nSuddenly, you hear a rustle of leaves, and swift footsteps. Grabbing you only defense, a short sword, you brace yourself for anything.<br>\r\n<br>\r\nIt is...</span></div></div>",
            "created":1150347600,
            "id":324627,
            "title":"Onward into the Black Forest"
        },
        "151":{
            "choices":[
                "sex",
                "food"
            ],
            "content":"<div class=\"\"><div> <span>Oh your suddenly swepped off your feet into the arms of a very handsome fox. \"Hello there m'lady.....\" he said, there was something about his eyes his deep blue eyes that hypnotised u he could do anything he wanted to u as long as u looked into his eyes and he wanted...</span></div></div>",
            "created":1174021200,
            "id":390163,
            "title":"male fox at 12 o clock"
        },
        "152":{
            "choices":[
                "Mayfair has an orgasm.....",
                "Mayfair gets eaten out by the fox woman!"
            ],
            "content":"<div class=\"\"><div> <span>The very sexy. alluring female Fox Clanner looked at Mayfair with an expectation in her bright green eyes.<br>\r\nShe slinked forward the surprised elf maiden,...her clothing dissolving about her, exposing her ever ready body glistening and aroused. She shook her thick, orange colored mane of hair as she got closer, which made Mayfair shudder with anticipation.<br>\r\n<br>\r\n\"soooo...you are Mayfair?...The elf that  revives after she is eaten....no?\" the fox looking female said as she put her arms around the unmoving, startled elf woman.<br>\r\n<br>\r\n\"uh....ye-e-e-s...I am.....sshhhheeee\" Mayfair stammered out as her clothing disappeared in a 'poof!' \"what do you...you....want with me???' but then her lips were covered by those lush, thick lips of the panting, moaning fox female. The two were soon dueling with their tongues battling in each other's mouths.<br>\r\n<br>\r\n\"mmmmm...you taste so good....Mayfair....mmmmm...\" the panting fox stated, as she made Mayfair lay down on the ground. \"Now...we play....then.....we eat....no?\" The fox woman then began anew her kissing of Mayfair's mouth, while pawing and squeezing the elf's heaving breasts.<br>\r\n<br>\r\nMayfair just laid back, while her body was taken over by the enormous feelings of joy and pleasure that coursed thru her tortured body. This was all brought on by the well-talented fox woman, that sure knew what turned on women...and Mayfair.</span></div></div>",
            "created":1159333200,
            "id":349043,
            "title":"Mayfair meets fox woman"
        },
        "1522":{
            "choices":[
                "Fox Lady makes Mayfair her lover!",
                "Fox Lady lets Mayfair go!"
            ],
            "content":"<div class=\"\"><div> <span>It was some time....before there was much of anything else in that area. The fox woman was on top of the aroused, panting Mayfair...and she seemed not to be able to move, at all!<br>\r\n<br>\r\nShe laid there, her arms above her thrashing head ....her legs spread wide, as the fox woman had her way with her new lover.<br>\r\n<br>\r\nFirst, after she had sat back to look at Mayfair, she dove her mouth down and began sucking loudly and long, on Mayfair's achingly sweet titty flesh. Biting down on the left tit's nipple, that caused Mayfair to scream out...as she crested over the edge and came,....her juices ejecting out of her pussy...and all over the fox's lower groin.<br>\r\n<br>\r\nAfter some more minutes...the Fox lady did the same attack on Mayfair's other tit...and nipple nub, which sent her again over the edge...and she screamed out her second coming!<br>\r\n<br>\r\n\"AAAARRRGGGGHHHHHHHHHHHHHH!!!! I AM COMING!!!!\" the ravaged woman shouted.....<br>\r\n<br>\r\n\"Yes...yes....I bet you are....lover....\" purred the fox woman,.....as she dug her hands into the torrid titty flesh and hefted them, sizing up their weight.<br>\r\n\"Your tittys are nice,...nice a full....mmmmm\"<br>\r\n<br>\r\nThen as Mayfair laid there trying to get her breath...the fox lady turned around....placed her own wet, slobbering pussy onto Mayfair's unmoved mouth and feed her prisoner this feast for lovers only....<br>\r\nShe sat down and made sure Mayfair was licking, sucking on her cunt, before she resumed doing the same licking job on Mayfair's flooding pussy.<br>\r\n<br>\r\nTaking extra great care,....the fox woman began to meet Mayfair's frantic sucking with her own,...and this elicited a cry of another orgasm that crashed through Mayfair......<br>\r\n<br>\r\n\"MMMMMMMMMFFFFFFFFTTTTTT!!!!!\" was all Mayfair could screech into the fox lady's pussy.....as she came, which sent the humping, groaning fox female over her edge to her series of orgasms....<br>\r\n<br>\r\n\"I-I-I-I......AAAMMMMMM.....CCCCUUUUMMMMMMMIIINNNN!\" screamed out the fox.....and her juices now cascaded out of her cunt...and made Mayfair choke of the flooding slime.<br>\r\n<br>\r\nFor another few minutes both came again....and again....and soon both were covered with their joined juices, sweat, and panting for breath.<br>\r\n<br>\r\nAt long last,...Mayfair had long since passed out from the exhurtations......the fox woman fell off her prey...and laid there as well,.....wishing it had not ended. </span></div></div>",
            "created":1159333200,
            "id":349046,
            "title":"Fox woman eats Mayfair out!"
        }
    },
    "info":{
        "author_id":"dragonsoul",
        "author_name":"dragonx",
        "brief_description":"You are Mayfair, an elf maiden, and you have trouble staying out of demon's stomachs.",
        "created":1150272720,
        "description":"<td align=\"left\" class=\"norm\">You are an elf maiden named Mayfair. You live in the forest clan of Treemout. You just have one problem... almost everyday, you end up inside any creature's stomach! But for some reason, everytime you are digested, you are revived back in your bed! Your main goal is to get to the far village of Monuna, at the base of the tallest mountain in the area. However, you have to avoid getting eaten by anything, because maybe one time, you might not be reborn. If you are eaten, then pray as hard as you can to survive. Good luck!<br>\r\n<br>\r\nThis is mostly Monster/elf vore, but I will allow other creatures, such as mermaids, to swallow you. Perhaps I wasn't too clear on what I said about sexual moments... When I said that, I meant that either a humanoid male seduces her, or when she is being swallowed, they can lick her breasts and so on. No monster sex!!! Take advantage of my gentle nature, and I will be forced to delete any chapters. Also, no gay/lesbian/underaged sex aloud, got it? Good. And please be good with spelling and grammer, it drives me crazy. Enjoy!</td>",
        "id":1118902,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1314405060,
        "modified":1314405060,
        "pretty_title":"An Elf's Life"
    }
}