{
    "chapters":{
        "1":{
            "author_id":"shadowofdeath",
            "author_name":"ShadowOfDeath",
            "choices":[
                "She shrinks him!",
                "She finds him already shrunken."
            ],
            "content":"<div class=\"\"><div> <span>You are at your sexy girlfriend Victoria's house, when suddenly you're shrunken! <br>\r\n<br>\r\nVictoria is you sexy, plump girlfriend. She is just below fat, has huge soft breasts, and a gigantic, mammoth butt that's even bigger than you're head at normal size!<br>\r\n<br>\r\nShe is a little on the playful side, but can be mean too. She is never gentle, however. She always loved to smother you to wake you up in the mornings, or jump on your face when you aren't expecting it.<br>\r\n<br>\r\nFirst off, how does he shrink?</span></div></div>",
            "created":1239080400,
            "id":671986,
            "title":"So how does it happen?"
        },
        "11":{
            "author_id":"shadowofdeath",
            "author_name":"ShadowOfDeath",
            "choices":[
                "I've always loved your big butt...",
                "Your massive tits!",
                "Your mouth."
            ],
            "content":"<div class=\"\"><div> <span>On a boring Saturday night, your girlfriend Victoria calls you over to her place for a little fun. With nothing to do, and having not seen her in a while, you get over to her place as fast as you can. <br>\r\n<br>\r\n\"Hey baby.\" He says as she answers the door, wearing a very sexy, tight matching bra and pantie set. Dumb founded by her outfit, you close your mouth and follow her into the house. \"Oh, this will be so much fun tonight..\" She said with a slight smirk on her face. <br>\r\n<br>\r\nAs she led you into the living room, you both sat down on the couch, and she began to climb onto your lap. \"I'm sorry, I'm just not in the mood for that tonight..Maybe we could just cuddle?\" You said in a quiet tone, hoping she wasn't too mad. \"Oh..It's alright..Well, would you like something to drink?\" Nodding your head, she walks into the kitchen.<br>\r\n<br>\r\nAfter a few minutes she comes back out with a glass and hands you it, smiling. Confused as to why she's still so happy, you shrug and drink the whole glass. Starting to feel a bit funny, you close your eyes for a moment. As you open your eyes, the first thing you see is Victoria's huge face grinning down at you.<br>\r\n<br>\r\n\"W-What's going on?! What the hell did you do to me?!\" Giggling, she smirked down at you. \"I shrunk you, silly! You said you weren't in the mood? Well too bad..I said we were going to have fun tonight, and this is exactly what I had in mind..\" She said as she stood back up, towering over you, her gigantic F cup breasts blocking out her face from view. She picked you up by the back of your shirt, lifiting you up to her face. \"Now now...What to do with you now...I know! What part of my body have you always loved the most?\" She said with a naughty look in her eye.</span></div></div>",
            "created":1239080400,
            "id":671987,
            "title":"She shrinks him!"
        },
        "111":{
            "author_id":"shadowofdeath",
            "author_name":"ShadowOfDeath",
            "choices":[
                "She decides to see how you taste",
                "She sticks you completely up her ass",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Well...I've always loved your butt..\" He says before quickly covering his mouth, shaking his head with fear in his eyes. \"N-Never mind that! I didn't mean it! \"He say's panicking, hoping she won't do what he think's she will.<br>\r\n<br>\r\nSmirking down at you, Victoria licks her lips a bit as she chuckles a bit. \"Well, if you love my butt so much, then I guess that's what I can do with you! How does that sound? Hmm?\" She say's, poking your belly. \"Have fun back there in my ass, okay my little lover?\" Blowing you a kiss, she bends over and brings you around to her back, pulling back her panties as she lowers you down to her butt crack, shoving you in between her butt cheeks until you're all the way in.<br>\r\n<br>\r\nScreaming in protest and trying to flail, it's all useless as you sink in deeper into her sweaty ass crack. You continue to squirm around however, slowly sinking more. \"Oooh yes! Keep squirming John!\" She screams in lust as you move around helplessly in her thick rump. She starts to grab at her ass and grind her butt cheeks together, until eventually..</span></div></div>",
            "created":1286168400,
            "id":968722,
            "title":"I've always loved your big butt..."
        },
        "112":{
            "choices":[
                "puts you inside her bra cup",
                "sits on you"
            ],
            "content":"<div class=\"\"><div> <span>well we both know that your always gaga over my massive tits so you can witness them up close and she then dropped you in between them and started to rub them together over and over again<br>\r\nwait a minute she takes you out and then she strips all her clothes off you then she startsto giggle at the sight of your dick and you try to cover up but she just holds your hands above your dick and then she continues laughing but the dropes you in between her tits again and continues to rub them together smothering you <br>\r\nshe then</span></div></div>",
            "created":1246251600,
            "id":715942,
            "title":"Your massive tits!"
        },
        "1121":{
            "choices":[
                "She tightens her bra.",
                "She takes you out.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>\" I hope you like where you are at because you are going to stay there for a looooong time, heheh. \" Victoria said. She immediately puts you onto her bra on the floor then picks it up. She squeezes the bra as tight as she can to her breasts then ties it up as tight as she can to make your erotic fantasies come true. You are smothered onto her breast and can barely move at all. She can see your body imprint through her bra and rubs you around causing your dick to become harder. She can feel it becoming harder and giggles. \" How is it going in there lover? \" She says. You can barely move your mouth to respond and since you are so tiny she would hardly hear your voice so you remain quiet. \" Well are you going to stay quiet like that all this time? That's no fun. \" She said sarcastically. You can feel her moving around and wonder what she is going to do.</span></div></div>",
            "created":1303016400,
            "id":1090091,
            "title":"puts you inside her bra cup"
        },
        "11211":{
            "choices":[
                "Move around.",
                "Don't Move."
            ],
            "content":"<div class=\"\"><div> <span>\" I'm going to have a little fun with you... \" She tightens her bra and your body becomes even more noticeable. You are squeezed against her breast harder and harder. It becomes impossible for you to move at all anymore. You wonder how she can even tighten it this far, but it didn't matter to you, you were just having fun being on your girlfriends breasts. She stopped tightening the bra and you saw you could nudge around a little. However any nudge you made caused Victoria to moan and get more motivated to make her bra tighter. You really do enjoy getting squeezed next to Victoria's breasts but you really didn't want to risk getting squeezed to death.</span></div></div>",
            "created":1303016400,
            "id":1090094,
            "title":"She tightens her bra."
        },
        "112111":{
            "author_id":"dwarf",
            "author_name":"The Dwarf",
            "choices":[
                "Gentle and caring.",
                "Rough, very rough."
            ],
            "content":"<div class=\"\"><div> <span>You couldn't help yourself and just started moving around to get comfortable. Victoria was feeling everything though and it just made her tighten her bra a lot more. She got it as tight as she possibly could, then tied it off, or whatever you did when you finished adjusting a bra. Some of the pressure had come off now and you could move around. But Victoria wasn't done yet.<br>\r\n<br>\r\nShe took a few steps and her boobs bounced with you against them. You couldn't see anything out of her bra but she was taking you somewhere. Suddenly her breasts were pressed into a flat surface. Victoria had just walked up to a wall and thrust her breasts into it making you the filling of a wall and boob sandwich.<br>\r\n<br>\r\n\"Oh John, I can feel your heart beating against my nipple\" and she put more pressure on you. If she pressed you any harder you felt you might fuse to her boob. After a few minutes of this she pulled away from the wall. \"Did you enjoy that? I know I did!\"<br>\r\n<br>\r\nShe then walks over to her bed and lays on her back on top of it. She looks at the bra cup containing your tiny form and she giggles and says.<br>\r\n<br>\r\n\"Enjoying your new home, John?\" as you came to your senses and moved a little in her tent sized bra you felt a lump at your back and moved to see her erected nipple pushing up at you. You rolled off it.<br>\r\n<br>\r\n\"Play with me John\" she said \"I know you want to, it's all yours. This is your home now after all, and my boob is part of your home.\" You could either play with her nipple gently by slowly rubbing, caressing and kissing it, or you can play with it roughly by hitting it, kicking it, trying to twist it and biting it.<br>\r\n<br>\r\nHow do you choose to play with Victoria's nipple?</span></div></div>",
            "created":1462683600,
            "id":2144892,
            "title":"101 things to do in Victoria's bra. No 1!"
        },
        "1121112":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "You try  escape, you can move.",
                "You try to escape, you is stuck in sweaty chest"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Although you like being in your bra, you were afraid to die, you decided to hit on her nipple, for her release. Victoria decided to walk, and let you inside the bra. It was hot, and Victoria began to sweat, sweat a lot.</span></div></span></div>",
            "created":1463202000,
            "id":2148138,
            "title":"Rough, very rough."
        },
        "113":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "She kisses you",
                "She gives u"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Your mouth?\" You ask, with less certainty. <br>\r\n<br>\r\nVictoria just smiles.<br>\r\n<br>\r\nwhat does she do?</span></div></span></div>",
            "created":1426222800,
            "id":1947909,
            "title":"Your mouth."
        },
        "1131":{
            "author_id":"daman12",
            "author_name":"Jacob Andreas",
            "choices":[
                "Blowjob",
                "kiss",
                "lipstick stick"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type?</span></div></span></div>",
            "created":1492282200,
            "id":2305571,
            "title":"She kisses you"
        },
        "1132":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "She gives you a tongue bath",
                "She tastes you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(Sorry about that!)</span></div></span></div>",
            "created":1426222800,
            "id":1947912,
            "title":"She gives u"
        },
        "12":{
            "author_id":"shadowofdeath",
            "author_name":"ShadowOfDeath",
            "choices":[
                "Picks you up and sticks you in her mouth",
                "Uses you as an ass slave",
                "Forces you to suck her nipples",
                "Makes you worship her",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>After coming home from a big party, you head over to your girlfriends house since it was closer and sneak inside, passing out on the couch in the living room after making sure she was asleep already.<br>\r\n<br>\r\nWhen you awaken, you rub your eyes and yawn gently as you look around the room. Your eyes widen and you instantly sober up as you notice that everything in the room is much, much bigger than you. <br>\r\n<br>\r\nHearing foot steps that sounded like an earth quake, you turn around only to see Victoria coming into the living room. Figuring since she's your girlfriend she'd help you, you start jumping and flailing your arms in hopes that she'd see you. \"D-Down here!\" You yell out, until she eventually looks down at the couch.<br>\r\n<br>\r\n\"John!?\" He exclaims in shock, rushing over and kneeling down in front of it. \"I-Is that you? What happened?!\". You fall backwards as you're now face to face with your giant girlfriend, now intimidated. \"I-I'm not sure...I think it might have been something I drank at that party last night..Will you help me get back to normal?\" You ask in a normal tone, figuring she'll say yes.<br>\r\n<br>\r\nAll of the sudden, she gets a look of surprise and it quickly turns into a grin, almost as if she just had a realization. \"Y'know what? I think I like you like this. No more complaining about you leaving the seat up, no more begging you to do things for me, and most of all, no more asking for pleasure..\" She says in a sultry tone, smirking down at you.<br>\r\n<br>\r\nYou swallow hard and back up, afraid of what she had in mind. She...</span></div></div>",
            "created":1286168400,
            "id":969003,
            "title":"She finds him already shrunken."
        },
        "121":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Tease him",
                "Eat him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does she do with him in her mouth? </span></div></span></div>",
            "created":1426222800,
            "id":1947914,
            "title":"Picks you up and sticks you in her mouth"
        },
        "1211":{
            "choices":[
                "I can rename you",
                "I can do whatever I want"
            ],
            "content":"<div class=\"\"><div> <span>She put you in her mouth, and it scared you. 'Is she gonna eat me?' You thought, getting goosebumps, then she started licking you, moving your body all over her mouth, she seemed to enjoy your taste, you were getting all wet. After a bit, she tilted her head back, bringing you down, and... Didn't swallow, in fact, you flung you forward and was laughing hard. She took you out, tears in her eyes, and said \"Wow, you, [laughs] you...\" She never finished, she calmed down and said, \"John, you tasted amazing, like, strawberries, Y'know, know your my pet, so...</span></div></div>",
            "created":1466902980,
            "id":2170854,
            "title":"Tease him"
        },
        "12111":{
            "choices":[
                "Her room",
                "The bathroom",
                "The kitchen"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait, what?\" You say, still traumatized, \"Yep, I'll name you... Strawberry!\" Embarrassment hit you like a train, \"Strawberry?\" You ask, getting red to the face, \"Isn't that a bit much?\" \"Nope! In fact, it is so cute I could just eat you up!\" She said, poking you, she then picked you up and took you to...</span></div></div>",
            "created":1466903160,
            "id":2170855,
            "title":"Strawberries?"
        },
        "121111":{
            "choices":[
                "Hide and Seek",
                "Cat and Mouse",
                "Climb the Mountain"
            ],
            "content":"<div class=\"\"><div> <span>She took you to her room, cupping you In her hands while you think about the situation, after a few seconds, she put you on her bed as she got undressed, captivized, you saw her take her shorts and t-shirt off, and leave on her bra and panties. \"Now, let's play a game, Strawberry.\"</span></div></div>",
            "created":1466910120,
            "id":2170901,
            "title":"A bit of fun"
        },
        "1211112":{
            "choices":[
                "Run!",
                "Trauma"
            ],
            "content":"<div class=\"\"><div> <span>\"And that game will beeee!!! Cat and Mouse! You know this game right?\" \"Yes, I've played it with you.\" \"Oh yeah! I sorta forgot!\" she said, walking to her closet and getting something out, \"Where I'd be the cat and you'd have to run from me? I remember.\" She says, getting out something, \"But I never showed you these!\" She said, with a cat ear headband and a cat tail, and also a tiny mouse ear thing with a mouse tail, \"Put these on.\" She says, throwing you the mouse stuff and putting on the cat stuff, \"Now, run.\"</span></div></div>",
            "created":1466910660,
            "id":2170905,
            "title":"Meow"
        },
        "123":{
            "author_id":"dwarf",
            "author_name":"The Dwarf",
            "choices":[
                "To the GYM",
                "To the Mall",
                "Go see a movie."
            ],
            "content":"<div class=\"\"><div> <span>Victoria picks you up and starts carrying you in her hands. She goes up stairs and into her bedroom closing the door behind her. She opens her hands and you look up at her smiling face which is grinning a grin you didn't like. She held you at stomach level and from here her massive breasts looked SUV sized. Poking through her top you could also see her nipples which were getting harder.<br>\r\n<br>\r\nShe places you gently on the bed and knees down next to it. She then removes her top and tosses it aside, she then reached behind her back, undoes her bra and lets it too fall to the floor exposing her massive breasts and perky nipples. She reached up and rubbed them so they were nice and hard.<br>\r\n<br>\r\n\"Victoria, what are you doing?\" you shout up at her as she lowers her bosom towards you.<br>\r\n<br>\r\n\"I want you to suck my nipples!\" she says nearly pushing the left one in your face.<br>\r\n<br>\r\n\"What?\" you said taking a step back. \"I need help returning to normal!\"<br>\r\n<br>\r\n\"And I want my nipples sucked. Open your mouth!\" she commands, but when you refuse to so much as open your mouth to talk she decides to be a bit rough. She pushes you onto your back and stands up so her boobs levitate above you. \"Open wide!\"<br>\r\n<br>\r\nWhen you refused she began lowering her boobs on top of you. You reached up, your tiny hands pressing against her nipple trying to push it away but Victoria just added more and more and more pressure until your arms buckled and her boob landed on top of you, totally covering you and hiding you. She giggled at the sensation feeling your tiny body kick, punch and struggle under her boob as the skin of it molded around you. After a few minutes of this she lifted herself off. A little disappointed that you hadn't taken the hint and started suckling her.<br>\r\n<br>\r\n\"Okay, if you want to play rough\" she said as she lowered herself again and you defiantly refuse to open your mouth, because the moment you started giving her what she wanted at your size then she'd always expect it. But when Victoria wanted something she made it happen. Her fingers snaked down to your crotch area and she positioned her fingers as if to flick you in between your legs. You tensed up and she flicked, she missed your groin and you had a feeling she intended to miss, but either way you screamed thinking the pain was going to be real and then Victoria's boob struck.<br>\r\n<br>\r\nIt came down with such force the hard nipple filled the gap in your mouth and when she laid her boob down on top of you, you felt it jam in.<br>\r\n<br>\r\nShe then got onto her bed and rolled onto her back looking at you, your mouth stuck over her giant nipple. She giggled \"You're like a nipple ring now\" she said. You still refused to suck but you didn't think she cared, the mere sensation of you stuck on her nipple was enough.<br>\r\n<br>\r\n\"Oh yes, John you really know what you're doing!\" she said and she started playing with her other nipple while you suckled this one. You pulled and pulled and pulled and you could feel yourself making progress but her nipple was getting harder and harder the more you struggled.<br>\r\n<br>\r\nVictoria reached up and squeezed the boob you were stuck against and you felt a jet of milk come out of her nipple and go down your throat.<br>\r\n<br>\r\n\"I've always loved when you play with my boobs\" Victoria said \"and I've always loved pressing you into them. Now you can play with them whenever you want, even in public.\"<br>\r\n<br>\r\nAfter another hour of this you finally managed to pop off her nipple. You were exhausted and you couldn't fight what Victoria did next. Clutching you to her boob she reached down to the foot of the bed and picked up her bra, laying it down on the bed in front of her. She then placed you on the bed next to it.<br>\r\n<br>\r\nVictoria pointed at the right cup and said \"Get in\"<br>\r\n<br>\r\n\"What?\" You asked and she said \"you're one lucky guy, I'm going to let you live in my bra, then you can play with my boobs and nipples whenever you want. It's also the best place to keep you nice and safe.\"<br>\r\n<br>\r\nWhen you didn't budge she began to look annoyed. You said to her \"I'm not living in your bra!\"<br>\r\n<br>\r\n\"Yes you are\" she nodded \"Don't you want to live in my bra, against these boobs you love so much?\" she said suggestively stroking them.<br>\r\n<br>\r\n\"Well...\" but before you could answer she'd picked you up and dumped you in the right cup.<br>\r\n<br>\r\n\"I knew you'd make the right choice.\" she said as she picked it up and her right breast came closer and closer to you, her right nipple getting harder and harder as if it was reaching out to touch you, as if the nipple itself yearned for your touch and in a few seconds it would have it. The space around you began to get darker as light struggled to bend around her boobs and soon you were in semi-darkness as the bra made contact and the nipple sharply jabbed you in the chest.<br>\r\n<br>\r\n\"Home, sweet home\" Victoria said as she fastened the bra around her back. She'd left you enough room to move around in the cup but whenever you came to the edge of her bra it became so tight you couldn't get out. You were trapped in the cup. More light was robbed as Victoria put her shirt back on. \"I've left some room for you to move around because I'm nice like that, also its so I can feel you rubbing against me as you move.\"<br>\r\n<br>\r\n\"I've got things to do today I think we'll both enjoy, you just get used to what daily life will be like in your new 'house', it'll be the best home you've ever had, I'm going to guarantee it. Today I'm going to the GYM, to the Mall and maybe see a movie, which you can get in and see for free from my bosom.\" she giggled patting the now subtle lump that was you on her right boob. \"What do you want to do first? Or should I decide for you?\"</span></div></div>",
            "created":1462683600,
            "id":2144920,
            "title":"Forces you to suck her nipples"
        },
        "125":{
            "choices":[
                "She plays gentle",
                "She gets up",
                "She plays rough"
            ],
            "content":"<div class=\"\"><div> <span>The grin turns into a slight giggle as Victoria turns around, showing off her huge but nice butt.<br>\r\n\"Gee I'm sure exhausted, I think I might have a seat\" she giggles and with that slowly starts to lower her beautiful butt toward you.<br>\r\nYou lie there frozen in fear, you can't believe your girlfriend is doing this to you.<br>\r\nHer butt makes contact with you and the couch, you feel the weight increasing slowly, the heat of her butt is incredible and the smell is everywhere and intoxicating.</span></div></div>",
            "created":1286859600,
            "id":973909,
            "title":"Time for a sit down"
        },
        "1251":{
            "author_id":"lolboy13",
            "author_name":"lolboy",
            "choices":[
                "\"HELL NO! You're crazy!\"",
                "\"W-well... I'd be willing to try new things...\""
            ],
            "content":"<div class=\"\"><div> <span>She giggles as she smothers you with her butt. The sheer weight of her is getting overwhelming. \"Ah.. V-victoria! Y-you're  crushing me!\" You shout up to her. <br>\r\n\"Oh? Am I?\" She asks caringly. \"Do you want me to lighten up?\"<br>\r\n\"Y-yeah.. c-could you get off me?\" She lifts her butt lightly off you, but not completely.<br>\r\n\"No.. I'm sorry John... but... I should have told you... you see.... I .. Have this fetish called... macrophilia.. its where.. I'm sexually attracted to tinies... like yourself.\" You simply cannot believe what she is saying! \"And.. I've always fantasized about finding you shrunken like this... and I was wondering... if you'd be interested in doing some fun things with me\" She asks playfully.<br>\r\nYou decide to humor her and ask \"what kind of things?\"<br>\r\n\"Well...you have already done a bit with butt smothering,\" She giggles as she rubs her booty over you.\" There is vore...where.... I eat you, foot worship, and my personal favorite... insertion...So John.. you interested?\"</span></div></div>",
            "created":1426050000,
            "id":1947142,
            "title":"She plays gentle"
        },
        "12511":{
            "choices":[
                "Takes you out",
                "Continues"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh really? I wanted to play gentle, and let you choose, but, I guess I should.\" \"W-what?\" Victoria picks you up, and puts you in her mouth. \"Hey! Victoria!\" You yell as she sucks on you, she proceeds to ignore you, but starts lightly chewing. \"Ow! Stop!\" You yell as you fell a large pain in you arm, and when you look at it, it is twisted, \"Stop!\" You yell, crying, she then...</span></div></div>",
            "created":1462597200,
            "id":2144547,
            "title":"Well then..."
        },
        "125112":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "You melt in your stomach",
                "You are digested in your gut"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Victoria decides to swallow you alive, imagining you turn into fat for your body, and . Victoria engulfs you. She lets out a burp and a one farting.<br>\r\n<br>\r\nYou melt in your stomach<br>\r\n<br>\r\nYou are digested in your gut</span></div></span></div>",
            "created":1463202000,
            "id":2148154,
            "title":"Continues"
        },
        "12512":{
            "author_id":"lolboy13",
            "author_name":"lolboy",
            "choices":[
                "i have always liked your feet...",
                "well.. What's vore like?...",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"W-well... I'd be willing to try new things... S-so long as I don't get hurt that is...\" She smiles and kisses your body \"oh thank you thank you thank you! I-I've really wanted to tell you these things.... So!\" She says happily. \"So.... What should we do first?\" She says biting her lip</span></div></div>",
            "created":1439269200,
            "id":2019873,
            "title":"A whole new world! Well ... Just bigger"
        },
        "125122":{
            "choices":[
                "Hard",
                "Soft"
            ],
            "content":"<div class=\"\"><div> <span>\"Vore? Oh, well, I'll let you see for yourself.\" She says, picking you up, and holds you up to her face, smiling, then she opens her mouth and puts you in. Everything was dark, and wet, the strong smell of mint filled you nose as she licks your tiny body, then...</span></div></div>",
            "created":1466901300,
            "id":2170844,
            "title":"well.. What's vore like?..."
        },
        "1251222":{
            "choices":[
                "You hung on",
                "You went down"
            ],
            "content":"<div class=\"\"><div> <span>Her large tongue lifted you up to the room of Victoria's mouth, and pressed against it, when she let go, she toyed with you a bit, sloshing you around her mouth and constantly licking you, she seemed to be enjoying it. Then came something you thought she was kidding about, she tilted back her head, causing you to slide to her thought, and swallowed.</span></div></div>",
            "created":1466901540,
            "id":2170847,
            "title":"Ohh"
        },
        "12512222":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "You turn into energy",
                "You've become fat"
            ],
            "content":"<div class=\"\"><div> <span>Victoria deceived you, she swallowed, and laughed, um, that delights, I hope you turn into energy, Victoria continued their day normally, as you began to be melted by acid, you body turned a folder and began to It is absorbed by victoria.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1472408520,
            "id":2202781,
            "title":"You went down"
        },
        "125123":{
            "choices":[
                "Body",
                "Breasts"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her entire body or her breasts?</span></div></span></div>",
            "created":1466901660,
            "id":2170850,
            "title":"Decide"
        },
        "1251232":{
            "choices":[
                "Keeps doing it",
                "Takes you ut"
            ],
            "content":"<div class=\"\"><div> <span>\"Your breasts.\" You say, looking away, \"Sure!\" She says, picking you up and placing you in them, you felt her heartbeat go on, as she jumped up and down, bounding you all over the place. Then she starts pressing them together, it started getting hard to breath, then she...</span></div></div>",
            "created":1466901960,
            "id":2170853,
            "title":"Nice"
        },
        "1252":{
            "choices":[
                "Toy",
                "Slave",
                "Pet"
            ],
            "content":"<div class=\"\"><div> <span>\"Victoria! Get up!\" You yell, trying not to breath through your nose, \"What? Oops! Sooorrry!\" She says, obviously fake though. She gets up, leaving you to catch your breath, \"Did you enjoy that?\" She asks, kneeling down in front of you, \"No! I did not!\" You yell, coughing, \"Well, you are now my...\"</span></div></div>",
            "created":1468788300,
            "id":2181922,
            "title":"Play"
        },
        "12521":{
            "choices":[
                "Have sex",
                "Sleep",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"A toy?!\" You yell as she moves her beautiful face closer to you, \"Yep.\" She says, giggling a bit, \"But aren't I your boyfriend?\" \"Not anymore!\" She says happily as she picks you up and spins you around, \"Now I can do anything with you!\" 'Oh God...' You think, getting nauseous, \"First rule is that you need to be with me at all times!\" She says, sitting down on the couch, \"Second, you must not complain about anything, and, umm... I can't think of anything else.\" She says, putting you on her breasts. \"Now, first let's...</span></div></div>",
            "created":1468788900,
            "id":2181930,
            "title":"Creative title"
        },
        "125212":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "hanging within a half",
                "inside my sweaty bra"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I'm still sleepy, I will rest a little, because we have a full day, hahahaha, she smiles. Where should I put you?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1472407260,
            "id":2202769,
            "title":"Sleep"
        },
        "125213":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Kiss and lick my toes!",
                "Ima gonna eat cha",
                "Worship my boobs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Now let's have some fun!\"</span></div></span></div>",
            "created":1530215460,
            "id":2512972,
            "title":"Reader's choice"
        },
        "1253":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Get up, look what happened",
                "Sit down with all his weight, flattening you",
                "Another fart, silent and deadly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><br>\r\nVictoria wants farting, without losing the opportunity, she lets out a fart, long, high and wet, to relieve your belly, it's a laugh and decide:<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1472407740,
            "id":2202773,
            "title":"She plays rough"
        }
    },
    "info":{
        "author_id":"shadowofdeath",
        "author_name":"ShadowOfDeath",
        "brief_description":"You are John. You are staying at you girlfriend Victoria's, when suddenly you shrink!",
        "created":1239094860,
        "description":"<td align=\"left\" class=\"norm\">Basically, you are John, and are shrunken at your girlfriend Victoria's house. <br>\r\n<br>\r\nRules:<br>\r\n<br>\r\nNo other characters, JUST John and Victoria.<br>\r\nNo additional shrinking/growing<br>\r\n<br>\r\nAllowed:<br>\r\n<br>\r\nBoobs<br>\r\nButt<br>\r\nSmothering<br>\r\nLaying on<br>\r\nMouth Play<br>\r\nVore<br>\r\n<br>\r\n<br>\r\nNot allowed:<br>\r\n<br>\r\nInsertion (Not including ass)<br>\r\n<br>\r\nEverything else is allowed!<br>\r\n<br>\r\nNewly added: Armpit and Feet are now not only allowed, but HIGHLY encouraged! And lot's of sweat play! <img loading=\"lazy\" style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/heart.png\" alt=\"*Heart*\" class=\"emoteZ\" title=\"Heart\" border=\"0\" width=\"15\" height=\"15\"><br>\r\n<br>\r\nPlease rate/add!</td>",
        "id":1547416,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1530215460,
        "modified":1530215460,
        "pretty_title":"Shrunken By Victoria!"
    }
}