{
    "chapters":{
        "1":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Stay home ",
                "Go shopping ",
                "Visit her friend at work",
                "Go to the lake or beach ",
                "More options "
            ],
            "content":"<div class=\"\"><div> <span>Lisa wakes up in her average apartment on a Saturday. She stretches her arms up and gets out of her bed and get dressed. She puts on a cute red bra and white crop top, she then gets out a matching pair of panties that she tugged on and a pair of booty shorts that she had a little trouble getting over her cheeks. Once dressed and made something to eat she decides to </span></div></div>",
            "created":1572486900,
            "id":2740460,
            "title":"Lisa’s day starts "
        },
        "11":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "reader choice ",
                "Reader choice ",
                "Reader chose "
            ],
            "content":"<div class=\"\"><div> <span>An package arrived at Lisa door step, she open the door and read the package label “ to Lisa from a old friend “. <br>\r\nShe bring the package to her living room table a open the box.<br>\r\n<br>\r\nLisa found a bottle full of a purple liquid. The bottle read if you drink it your body will expand but if you poor it on body parts if will only grow that part. She get a syringe and draw some of the liquid out. Let try this she take off her shirt and drop some liquid on her breast. <br>\r\n<br>\r\nHer breast started to grow stretching her bra out. Wow it actually works my bust is a C cup now. <br>\r\nI wonder what else I should grow? <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1575982080,
            "id":2757841,
            "title":"Stay home "
        },
        "111":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "Body full groeth",
                "Single body growth",
                "Other ways"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Should she drink it or other body parts to grow separately?</span></div></span></div>",
            "created":1580027400,
            "id":2778557,
            "title":"reader choice "
        },
        "1113":{
            "author_id":"boobs55",
            "author_name":"Wolf",
            "choices":[
                "Continue with life",
                "Stay home and have fun with lesbians "
            ],
            "content":"<div class=\"\"><div> <span>Well since I have C breastS I  might as well masturbate,Before she knew it she was in love with her body she started to masturbate her self it was exciting and all,then with all those moans She said” OH GOD I’M CUMMING“.then after she was through she started to kiss her breast’s and clit</span></div></div>",
            "created":1601664660,
            "id":2914082,
            "title":"Other ways"
        },
        "14":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "Reader choose ",
                "reader chose ",
                "Reader chose "
            ],
            "content":"<div class=\"\"><div> <span>After eating breakfast she decided to go on a walk. She changes into a blue crop top and jeans then fill up a water bottle and leave her house.<br>\r\n<br>\r\nDuring her walk she come across a lake full of murky water and saw large fish swimming in it. Wow those are massive there like the size of full grown adult human Lisa through to herself. She walk towards the lake to get a closer look at the huge fish. <br>\r\n<br>\r\nOnce the edge of the lake “yeah these fish are huge” she said to herself, then a gust of wind pushed Lisa into the water, the large fish turn around and swam towards her quickly. I got to get out of here she thought as she swam towards the shore line. <br>\r\n<br>\r\nThe fish were getting closer and closer to Lisa feet, ou one the fish bite her on to her left legs right as she leaves the water. The large was flapping back on her leg. Lisa grabs a branch next to her a hit off the fish. <br>\r\nOh this is bad, really bad her leg was gushing blood, she takes of her crop top reveling her B cup bra and rap her top around her leg to stop from bleeding. “I got to get the hospital” said Lisa, she calls 911 and requested an ambulance to pick her up. <br>\r\n<br>\r\nThe ambulance arrives two people rush over to Lisa on the ground struggling to stay alive. “Hurry get in the van and inject on IV in her arm”the nurse says.<br>\r\n<br>\r\nThey arrived at the emergency room entrance and wheel in the room ,three doctor come in to examined her left leg.<br>\r\n<br>\r\n<br>\r\n(What happen next is up to you)</span></div></div>",
            "created":1579819440,
            "id":2777560,
            "title":"Go to the lake or beach "
        },
        "141":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "Reader choose ",
                "Reader choose ",
                "Reader choose "
            ],
            "content":"<div class=\"\"><div> <span>The doctor put Lisa in an anesthesia state. The doctor removed the top form her leg to see the bite wounds, but what they saw was that wounds were regenerating healing the bite wounds, the doctor were shocked. “Well what should we do doctor “ask the assistant doctors, “well we could just put a bandage around her left leg and say that we stitch up her leg and then send her home “said the head doctor . <br>\r\n<br>\r\n30 minutes later once Lisa woke up they told her you’re free to go. So she was drove home by Uber.<br>\r\nLisa wonder why those fish were so big so she drove back to lake and walk around it ,but a safe distance from the water line. She noticed some barrels with an unknown liquid poring in the lake waters. She get out of her car to take an closer look at the barrel. <br>\r\n<br>\r\nShe bunt down looking at all side of the barrel but only two words that she could read were growth hormone that were faded. So that why the fish are so large wait that means I will grow to I hope not she though.<br>\r\nThen she drove back home to continue her watch tv.<br>\r\n<br>\r\nAn hour later after Lisa got home she began to feel an soothing sensation all over her body. Then her breast grow bigger stretching her bra out more.</span></div></div>",
            "created":1579901760,
            "id":2777924,
            "title":"Reader choose "
        },
        "15":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Masturbate ",
                "Talk to her neighbors ",
                "Go for a walk",
                "Go for a jog",
                "More options "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She decides to </span></div></span></div>",
            "created":1572486960,
            "id":2740461,
            "title":"More options "
        },
        "155":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Go on tinder to find a hot girl for the day ",
                "Browse the internet ",
                "More options "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She decides to</span></div></span></div>",
            "created":1572487080,
            "id":2740462,
            "title":"More options "
        }
    },
    "info":{
        "author_id":"shooter243",
        "author_name":"Death",
        "brief_description":"Lisa goes through some changes ",
        "created":1572486420,
        "description":"<td align=\"left\" class=\"norm\"><u>Lisa</u><br>\r\nAge: 19<br>\r\nHeight: 5'10\"<br>\r\nBlack shoulder length hair<br>\r\nBrown eyes<br>\r\nSmaller then average breast<br>\r\nWide hips and a large thicc butt<br>\r\nInto girls with big breasts<br>\r\n<br>\r\nGrowth is highly encouraged for Lisa, natural, stealing from other girls or any other way you can come up with.  <br>\r\n<br>\r\nCharacters outgrow their clothes slowly, no “Lisa grew 2 cup sizes bigger then her original size and her bra rips off” stuff </td>",
        "id":2204395,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1601661084/item_id/2204395.png",
        "last_full_update":1601664660,
        "modified":1601664660,
        "pretty_title":"Lisa interactive "
    }
}