{
    "chapters":{
        "1":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Note to readers"
            ],
            "content":"<div class=\"\"><div> <span>I rode my bike through the parking lot of my apartment complex, swerving to avoid the occasional pothole.  Arriving outside my building, I locked up my bike and went inside.  After checking the mail, I took the elevator up to the 3rd floor; hoping I didn’t get stuck in the elevator again.  This building sucks.<br>\r\n<br>\r\nThe condition of the building was to be expected; after all, it was public housing.  You see; my mom had me just after high school.  It put a stop to her dream of going to college to be a TV reporter; instead, she had to work two jobs just to make ends meet.<br>\r\n<br>\r\nOnce the elevator finally arrived on my floor, I walked down the hall to the apartment.  Letting myself in, I placed my backpack on the floor and closed the door.  “Mom! I’m home!”<br>\r\n<br>\r\nWhen I didn’t receive a response, I was about to look around when I saw a note on the kitchen counter.<br>\r\n<br>\r\n<i>Travis,<br>\r\nI got called into work tonight.  I spoke with Aaron’s mother; you can spend the night there.<br>\r\nMom</i><br>\r\n<br>\r\nAaron Sullivan had been my best friend since we were 5 years old.  I spent so much time at his house, I considered it my second home.  As I walked down the hall to my room, I thought that it would be nice to see Aaron again; his family had just gotten back from a trip to the Bahamas.<br>\r\n<br>\r\n<div align=\"center\">************************</div><br>\r\n<br>\r\nIt was a 15-minute ride from the apartment to Aaron’s house; I arrived there just as it was starting to get dark.  Walking up to the front door, carrying my backpack with a change of clothes, I knocked on the door.<br>\r\n<br>\r\nIt didn’t take long for Aaron’s Mom to answer the door.  “Hello, Travis.” Opening the door, she said, “Come on in.”<br>\r\n<br>\r\n“Thanks, Mrs. S.” walking in, I placed my backpack on the floor next to their suitcases.  “I’m sorry to barge in like this, but my mom had to work tonight.”<br>\r\n<br>\r\nAfter closing the door behind me, Mrs. Sullivan looked at me and said, “Can I talk to you for a moment, Travis?”<br>\r\n<br>\r\n“Sure.” Following Mrs. Sullivan into the kitchen, I said, “What’s wrong?”<br>\r\n<br>\r\n“There’s nothing wrong, Travis.” Gesturing to a seat, she sat down and said, “I just wanted to ask how things were going at home.”<br>\r\n<br>\r\n“We’re doing fine.” Sitting down, I looked at her and said, “I mean the diner cut back some of my mom’s house, but she’s picking up more hours at Hooters.”<br>\r\n<br>\r\n“You know you can always come to Mr. Sullivan or me for help; we’re always willing to help you.”<br>\r\n<br>\r\nMrs. Sullivan was always looking out for me, even though I wasn’t her son.  About a year earlier, when my Mom was going rough a financial rough patch, Mrs. Sullivan offered to adopt me in order to make things easier for her.  My mom refused the offer; saying she’d always make sure I was okay.<br>\r\n<br>\r\n“I know that Mrs. S.” pausing, I said, “I appreciate the offer, but we really are doing fine.”<br>\r\n<br>\r\nJust then Mr. Sullivan came walking into the room.  Seeing me, he said, “Hello Aaron, I heard you were going to be spending the night with us.”<br>\r\n<br>\r\nSmiling, I said, “Hi Mr. Sullivan.”<br>\r\n<br>\r\n“We were just getting ready to get some take out since I’m afraid we don’t have a lot of food here.” Grabbing his coat, Mr. Sullivan said, “I hope you’re in the mood for some pizza.”<br>\r\n<br>\r\n“That sounds great!”</span></div></div>",
            "created":1570510800,
            "id":2730223,
            "title":"The Beginning"
        },
        "11":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Waking Up"
            ],
            "content":"<div class=\"\"><div> <span>I walked upstairs shortly after Aaron’s parents went to get dinner.  Heading down the hall, I saw Aaron’s little sister, Madison walking out of her room.  “Hi, Madison.” Smiling, I said, “How are you doing?”<br>\r\n<br>\r\n“Hi Travis!” running over to hug me, Madison said, “You want to see what I found in the Bahamas?”<br>\r\n<br>\r\n“Sure.” Not wanting to disappoint her, I followed Madison into her room.  “What did you find?”<br>\r\n<br>\r\nMadison ran over to her bed and brought back what looked like an ordinary rock.  Showing it to me, she said, “It’s a wishing stone.”<br>\r\n<br>\r\nI decided to play along because I knew Madison would be upset if I didn’t.  “How does it work?”<br>\r\n<br>\r\n“You just hold it close to your mouth and whisper into it.” After whispering to the rock, she opened her window and threw it outside.  “Once you’re done, you just throw it away.”<br>\r\n<br>\r\n“What did you wish for?”<br>\r\n<br>\r\n“Nuh-uh; you know the rule.” giggling, Madison said, “If I told you, then it wouldn’t come true.” If you tell your wish before you get it, it won't come true.\"<br>\r\n<br>\r\n“Well, I hope it comes true for you.” Tousling Madison’s hair, I said, “I’m going to hang out with your brother now, I’ll see you later.”<br>\r\n<br>\r\n“Bye!”<br>\r\n<br>\r\nWalking down the hall to Aaron’s room, I went in to find him playing video games with his headphones on.  Sneaking up behind him, I tapped him on the shoulder just enough to distract him.  Not even a second later, the screen turned red – confirming that another player had just killed him.<br>\r\n<br>\r\n“What the hell, man!” Turning around, taking the headphones off, Aaron said, “I was just about to kill that guy!”<br>\r\n<br>\r\n“Yeah right.” Chuckling, I said, “You were always terrible at sniping people.”<br>\r\n<br>\r\nPutting the controller down, Aaron said, “My folks said you’d be spending the night.” Looking at me, he said, “Your mom working again?”<br>\r\n<br>\r\n“Yeah, she got called into work at the last minute apparently.”<br>\r\n<br>\r\n<div align=\"center\">************************</div><br>\r\n<br>\r\n15 minutes later, Aaron and I were playing a multiplayer level on Call of Duty when I had the sudden urge to use the bathroom.  The timing couldn’t have been better since I’d just been killed by a grenade.  “I’ll be right back; I’m just going to use the bathroom.”<br>\r\n<br>\r\n“Hurry back; I’m outnumbered here.”<br>\r\n<br>\r\nWalking out of Aaron’s room, I started to make my way down the hall to the bathroom; only to stop outside Madison’s room.  I didn’t know why, but I had the urge to go into her room.  Unable to shake the urge, I opened her door and walked into find her having a tea party with some of her dolls.<br>\r\n<br>\r\nWalking over to her, I sat down and said, “Mind if I join you?”<br>\r\n<br>\r\n“Sure!” handing me a teacup, pretending to pour something into it, Madison said, “Have some tea.”<br>\r\n<br>\r\nTaking a pretend sip, I said, “That’s very good tea, Madison.”<br>\r\n<br>\r\nMadison and I continued doing that for about five minutes until Aaron came into the room.  “I’ve been looking all over for you.” Looking at me, he said, “What are you doing here?”<br>\r\n<br>\r\n“We’re having a tea party!” I was surprised to hear my voice was higher than normal and sounded like Madison whenever she was excited.<br>\r\n<br>\r\nAaron was surprised as well.  “What’s wrong with your voice?”<br>\r\n<br>\r\nClearing my throat, I said, “Sorry, I-I don’t know what that was about.” Pausing, I said, “Madison and I were just having a tea party.”<br>\r\n<br>\r\nSuddenly Aaron had a shocked look on his face.  Looking at me, he said, “Travis, what’s happening to your face?”<br>\r\n<br>\r\n“What do you mean?” seeing the same shocked look on Madison’s face, I said, “Why are you both looking at me like that?”<br>\r\n<br>\r\n“You better look at yourself in the mirror.”<br>\r\n<br>\r\nStanding up, I walked over to the mirror Madison used when she was playing dress-up.  Looking at my reflection, I was shocked to say the least by what I saw.  My face was no longer that of a teenage boy, it was closer to that of a little girl’s.  I watched in silence as my hair started to get longer.<br>\r\n<br>\r\nOvercome with shock, I fainted and fell to the floor.</span></div></div>",
            "created":1570510800,
            "id":2730225,
            "title":"An Innocent Wish"
        },
        "111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "More Surprises",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>When I regained consciousness, I saw Aaron and Madison standing over me; with concern written on both their faces.  Looking at them, I said, “I dreamed...”<br>\r\n<br>\r\n“This isn’t a dream, man.”<br>\r\n<br>\r\nHearing the sound of my voice, which sounded like a little girl's voice, I realized Aaron was right.  Bringing my hands towards my face, I found long brown hair.  “What happened to me?”<br>\r\n<br>\r\n“We don’t know.” Looking at me, Aaron said, “Before you try and sit up...”<br>\r\n<br>\r\nAaron was too late, I was already sitting up before he could finish his sentence.  Looking down, I found myself dressed up as a Disney Princess; Belle to be specific.  I turned to Madison and noticed she was dressed as Cinderella.  “What’s the deal?  Why did you dress me like this?”<br>\r\n<br>\r\nShaking her head, Madison said, “We didn’t.”<br>\r\n<br>\r\n“All this happened after you fainted; first your clothes changed and then Madison’s did.” Looking at me, he said, “Soon after, you...well I think you’d better see for yourself.”<br>\r\n<br>\r\nIt was when Aaron helped me to my feet that I realized he now towered over me; even though we’d been the same height.  <br>\r\nLooking at my reflection in the mirror, I had to clap a hand over my mouth to keep from screaming.<br>\r\n<br>\r\nI had been 10 years older than Madison, but now it looked like we were practically the same age. “How could this happen?”<br>\r\n<br>\r\nAaron opened his mouth to speak, but Madison beat him to it.  “It worked.”<br>\r\n<br>\r\nBefore I could ask her what she meant, we heard a door closing in the distance; followed by Mr. Sullivan calling out, “Kids!   The pizza’s here!”</span></div></div>",
            "created":1570510800,
            "id":2730249,
            "title":"Waking Up"
        },
        "1111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>All three of us went pale when we heard Mr. Sullivan’s voice.  How would we possibly explain this to Aaron’s parents?  Looking at Aaron, I said, “What are we going to do?”<br>\r\n<br>\r\n“I don’t know.” Looking at me, Aaron said, “Perhaps we should just tell them what happened.”<br>\r\n<br>\r\n“We don’t even know what happened!” panicking, I said, “They’ll never believe a 15-year-old boy somehow turned into a 5-year-old girl.”<br>\r\n<br>\r\n“Well, we have to figure out something.” Pausing, Aaron said, “They’re probably going to start wondering why we haven’t come downstairs yet.”<br>\r\n<br>\r\nBefore any of us could do anything, the bedroom door opened and Mrs. Sullivan walked into the room.  “There you are.” Looking at Madison and me, she said, “Girls, why don’t you change out of those dresses for dinner.”</span></div></div>",
            "created":1570510800,
            "id":2730260,
            "title":"More Surprises"
        },
        "11111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I couldn't believe it; Mrs. Sullivan wasn't the least bit surprised that I was now a girl Madison's age.  In fact, it was as though she’d expected to see two girls in Madison’s room.  I was about to ask her about it, but she started walking towards the door.  <br>\r\n“Come on, Aaron.” Pausing, said, “Let’s give Lizzie and Madison some privacy so they can change.”<br>\r\n<br>\r\nOnce Mrs. Sullivan had closed the door, I walked over to where Madison was standing by the bed.  “She called me Lizzie.” <br>\r\nLooking at her, I said, “It’s almost like she doesn’t remember me being a boy.”<br>\r\n<br>\r\nLooking at me, as she took off her princess dress, Madison said, “I didn’t think it would work.”<br>\r\n<br>\r\nAs I took off my dress, I looked at Madison and said, “You didn’t think what would work?”<br>\r\n<br>\r\n“The wishing stone.”  Looking at me, Madison said, “I made a wish that you were my friend instead of Aaron’s, and now you are.”<br>\r\n<br>\r\nBefore all this, I would’ve found the idea of a magic rock granting wishes hard to believe.  But as I looked at myself in the mirror, seeing the body of a 5-year-old girl looking back at me, I couldn’t argue with the facts.<br>\r\n<br>\r\nI found some discarded clothes that Lizzie must’ve worn here; a pair of overalls and an orange shirt.  After putting them on, I noticed a Disney overnight bag in the corner; which I figured was mine.  Looking through it, I spotted a Frozen nightgown and a package that I couldn’t quite figure out what it was.<br>\r\n<br>\r\nOnce we were both dressed, Madison and I walked downstairs for dinner.</span></div></div>",
            "created":1570597200,
            "id":2730719,
            "title":"The Surprises Continue"
        },
        "111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>After dinner, Madison’s parents let us watch Despicable Me 3.  It was around 7:45 when Mrs. Sullivan walked into the den and turned off the TV.  Madison and I both groaned in annoyance.  “Sorry girls, but it’s time for you to go bed.”<br>\r\n<br>\r\n“But Mommy, we’re not tired!” looking at me, Madison said, “Can’t we just finish the movie?”<br>\r\n<br>\r\n“I’m sorry sweetie, but you know the rules.” Looking at us, she said, “Make sure you both brush your teeth.”<br>\r\n<br>\r\nWith no other option, Madison and I obediently walked upstairs to the bathroom.  After brushing our teeth, we walked by Aaron’s room.  As Madison continued on, I poked my head inside to find Aaron watching a movie.  Seeing me in the doorway, he paused the movie and said, “What’s up?”<br>\r\n<br>\r\n“Your mom said it’s time for Madison and me to go bed.” Pouting, I said, “It’s not even 8:00 and I’m not even tired.”<br>\r\n<br>\r\n“Don’t know what to tell you.” Looking at me, Aaron said, “As far as everyone else knows, you’re a 5 year old girl.  I guess that means you have an early bedtime.”<br>\r\n<br>\r\n“I guess so.” Sighing, I said, “I’ll see you in the morning.”<br>\r\n<br>\r\nI walked down the hall to Madison’s room; entering just as she was getting changed into her nightgown.  Looking at me, Madison said, “Come on, Lizzie; my mommy said she’d be up to tuck us in.”<br>\r\n<br>\r\nI’d just finished getting changed into my nightgown when Mrs. Sullivan poked her head into the room.  As Madison climbed into bed, she looked at me and said, “Lizzie, sweetie, can I talk to you for a moment?”<br>\r\n<br>\r\n“Okay.”<br>\r\n<br>\r\nI followed Mrs. Sullivan down the hall to the bathroom.  Closing the door, she knelt down to my height.  “Did you remember to wear your Pull-Ups?”</span></div></div>",
            "created":1570597200,
            "id":2730729,
            "title":"Bedtime"
        },
        "1111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Next Morning",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I was momentarily confused; until I saw the package from my bag sitting on the counter.  Looking closer, I saw that it was an open package of Pull-Ups.  As if being a 5-year-old girl wasn’t bad enough, I was not going to wear Pull-Ups to bed.  “Do I have to wear those?”<br>\r\n<br>\r\nMrs. Sullivan must’ve thought I was being stubborn instead of embarrassed.  Taking one out of the package, she looked at me and said, “I know you’re embarrassed to wear these, but your mom insisted.” Lifting up my nightgown, she said, “This is for your own good, sweetie.”<br>\r\n<br>\r\nI could only stand there, in silence, as Mrs. Sullivan got me into the Pull-Ups.  I was embarrassed enough by the notion that I was a bed wetter now, but I could’ve done without Aaron walking into the bathroom just as Mrs. Sullivan was pulling down my nightgown.  “Sorry, I didn’t think anyone was in here.”<br>\r\n<br>\r\nI hoped that Aaron hadn’t gotten a glimpse of the pull-ups I was wearing.  “We’re all set here, sweetheart.” Looking at me, Mrs. Sullivan said, “Let me throw out this packaging and then I’ll be up to tuck you girls in.”<br>\r\n<br>\r\nAfter Mrs. Sullivan left, Aaron looked at me and said, “Pull-ups, huh?” grinning, he said, “Are you a bed wetter now?”<br>\r\n<br>\r\n“Shut up!” I glared at him and said, “It’s bad enough I have to wear these; I don’t need you rubbing it in.”<br>\r\n<br>\r\nWithout giving Aaron a chance to respond, I left the bathroom and walked back down the hall to Madison’s room.  As I climbed into bed next to her, she said, “What did my mom want?”<br>\r\n<br>\r\n“I’d rather not talk about it.”<br>\r\n<br>\r\nIt wasn’t long before Mrs. Sullivan walked into the room.  After making sure we were snug underneath the sheets, she kissed us both on the forehead.  “Goodnight girls.”</span></div></div>",
            "created":1570597200,
            "id":2730734,
            "title":"Pull-Ups"
        },
        "11111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Talking over Breakfast",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I woke up just before 8:00 the next morning; hoping the previous night had just been a crazy dream.  But that wasn’t the case – as I soon discovered when I saw Madison asleep next to me.  Sitting up in the bed, I felt the Pull-Ups rubbing against my skin.<br>\r\n<br>\r\nHopping out of bed, I pulled up the nightgown to examine them and found a telltale yellow stain on the inside.  <i>Great, I really am a bed-wetter now.</i><br>\r\n<br>\r\nJust then Madison woke up.  Rubbing her eyes, she looked at me and said, “Good morning.”<br>\r\n<br>\r\nLetting my annoyance seep through, I said, “What’s so good about it?”<br>\r\n<br>\r\nSittin up, she looked at me and said, What's wrong?\"<br>\r\n<br>\r\nShowing her my soiled pull-ups, I said, “I wet myself during the night; all because of <i>your</i> stupid wish!”<br>\r\n<br>\r\n“How is that my fault?”<br>\r\n<br>\r\nLooking at her, as my annoyance turned to anger, I said, “Who else wished me into a little girl!?”<br>\r\n<br>\r\nBefore Madison could respond, there was a knock on the door.  Poking his head inside, Aaron said, “What’s with all the noise in here?”<br>\r\n<br>\r\n“Your stupid little sister made a wish that turned me into a little girl!” yelling, I said, “<i>That’s</i> what!”<br>\r\n<br>\r\nLooking at me, Madison yelled, “I’m <i>not</i> stupid!”<br>\r\n<br>\r\nIf Aaron was at all surprised to learn his sister was responsible for what happened to me, he didn’t show it.  “Look, why don’t <br>\r\nboth you of just calm down.” Turning to me, he said, “Liz...Travis, whatever your name is now, go get cleaned up and come down for breakfast.” <br>\r\n<br>\r\nMadison and I both ran towards the bathroom; but I just barely beat her.  That little triumph was enough to make me feel better about having to clean myself up because I wet the bed.</span></div></div>",
            "created":1570597200,
            "id":2730749,
            "title":"The Next Morning"
        },
        "111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>After getting dressed in another outfit I'd found in the overnight bag, I walked downstairs to find Madison and Aaron sitting at the kitchen table.<br>\r\n<br>\r\nAs I sat down, I noticed there was a distinct lack of food in the table.  Looking at Aaron, I said, \"What gives? I thought you said breakfast was ready?\"<br>\r\n<br>\r\n\"Breakfast will be ready in a few minutes.\" Sighing, Aaron said, \"In the mean time, I think you two need to talk.\"<br>\r\n<br>\r\n\"I have nothing to say to her.\" Glaring at her,  I said, \"Its because of her stupid wish that I'm a 5 year old girl now.\"<br>\r\n<br>\r\n\"I didn't think it would come true.\" Looking at me, Madison said, \"I just wanted you to be my friend.\"<br>\r\n<br>\r\n\"I am your friend, Maddy.\" Sighing, I said, \"I care about you very much.\"<br>\r\n<br>\r\n\"You don't really show it.\" Pouting, Madison said, \"You always want to spend more time with Aaron then you do with me.\"<br>\r\n<br>\r\n\"That's because he <i>was</i> the same age as me.\" Pausing, I said, \"He and I have more in common.\"<br>\r\n<br>\r\n\"Now that we're the same age, you have more in common with me.\"<br>\r\n<br>\r\n\"Okay, I think we're getting off track here.\" Looking at us, Aaron said, \"You've both done stuff in the last 12 hours that you need to apologize for.\"<br>\r\n<br>\r\n\"What for?\"<br>\r\n<br>\r\n\"Because, Travis, you're going to need Maddy's help learning how to behave like a 5 year old girl.\" Sighing, Aaron said, \"That can't happen if until you both apologize.\"<br>\r\n<br>\r\nI realized Aaron was right; if I wanted Madison's help, I'd need to apologize for what I did.  Getting off the chair, I walked over to her and said, \"I'm sorry I called you stupid.\"<br>\r\n<br>\r\nHopping off the chair, Madison looked at me and said, \"I'm sorry that I turned you into a little girl.\"<br>\r\n<br>\r\nAfter Madison and I hugged each other for a moment, Aaron said, \"Now that we've settled that, I'll serve you guys breakfast.\" Standing up, Aaron said, \"How do waffles sound?\"<br>\r\n<br>\r\nBoth Madison and I got huge grins on our faces.  As Aaron served the waffles, I wondered if he was prepared to deal with two 5 year olds hopped up on sugar.</span></div></div>",
            "created":1570683600,
            "id":2730961,
            "title":"Talking over Breakfast"
        },
        "1111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Mom Picks Me Up",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>The answer was no. Aaron wasn't the least bit ready to handle two 5-year-olds whose blood was now 50% maple syrup. \"I think I liked it better when you were fighting,\" he said.<br>\r\n<br>\r\nWe didn't care. We took turns pulling his limbs and climbing on him. \"Come play with us!\" we begged.<br>\r\n<br>\r\n\"I can't,\" he replied. \"I need to research that wishing stone. Go watch TV.\"<br>\r\n<br>\r\nThat sounded like a good idea, so we ran into the living room and turned on the TV. The Sullivans had been watching local TV last night, so the TV was tuned to that station. \"Hey, look,\" I said, \"my mom's on!\"<br>\r\n<br>\r\nShe was standing in front of the apartment building where we lived. Apparently, something bad had happened there, but I wasn't paying attention. There was something wrong.<br>\r\n<br>\r\nHer voice was different. Her eyes were different. What's more, she was called Melanie Richardson, not Melanie Rogers. \"Is... Is she still my mommy?\"<br>\r\n<br>\r\nAaron came in. \"What's wrong?\"<br>\r\n<br>\r\nI pointed at the screen, where the woman I had known as my mother signed off, identifying herself again as Melanie Richardson. \"What if she's not my mommy anymore?\"<br>\r\n<br>\r\n\"Hey, I'm sure it'll be alright,\" Aaron said. \"We'll see how things shake out when she comes to pick you up.\" He wiped the tears out of my eyes. \"Let's find you something else to watch.\"<br>\r\n<br>\r\nAaron changed the channel to something more kid-friendly. Before, I dismissed cartoons as kid stuff, but this cartoon held me enthralled.</span></div></div>",
            "created":1570683600,
            "id":2731185,
            "title":"Sugar Rush and a Big Surprise"
        },
        "11111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Madison and I watched cartoons for about an hour until her parents came home; having evidently gone grocery shopping.  Seeing Madison and me in the living room, Mrs. Sullivan said, “Good morning, girls.” Pausing, she said, “I hope you didn’t give Aaron too much trouble.”<br>\r\n<br>\r\nBoth Madison and I gave each other mischevious looks; before turning back towards Mrs. Sullivan.  “Nope, we’ve just been watching cartoons.”<br>\r\n<br>\r\n“That’s good.” Looking at me, Mrs. Sullivan said, “Lizzie, sweetie, your mom called; she’s going to be here in about 15 minutes.”<br>\r\n<br>\r\nNot wanting to show my concern, I said, “Okay.”<br>\r\n<br>\r\nJust then, Mr. Sullivan came in with a few more bags of groceries.  Turning to her husband, as they both walked down the hall to the kitchen, Mrs. Sullivan said, “When Lizzie’s mom gets here; don’t bring up what we were talking about in the car.  They haven’t told her yet.”<br>\r\n<br>\r\nAs they were going out of earshot, Mr. Sullivan said, “How many times do I have to say I won’t mention it?”<br>\r\n<br>\r\nI started to wonder what they were referring to; was it something important?  Before I could say anything, Madison said, “Lizzie, the shows back on!”<br>\r\n<br>\r\nUntil this happened, I never thought I’d be watching Thomas &amp; Friends again; having watched it the first time I’d been 5 years old.  But now I was excited to watch it again.  Giggling, I said, “Yay!”<br>\r\n<br>\r\n<div align=\"center\">**********************</div><br>\r\n<br>\r\nSure enough, 15 minutes later, I heard a car horn outside.  Mr. and Mrs. Sullivan were in the kitchen putting away the groceries; while Aaron was outside mowing the lawn.  Looking at me, Madison saw my worried look and said, “It’s going to be fine.”<br>\r\n<br>\r\nBefore I could say anything, Aaron walked in through the front door.  Turning to me, he said, “Lizzie, I think your mom’s here.”<br>\r\n<br>\r\nI stood up and slowly walked towards the door; worried that the woman I was about to see wasn’t the same one I’d seen yesterday morning.  My worries vanished when I stopped in the doorway.  Walking up the sidewalk was my Mom.  Sure she looked different than when I’d seen her last; before all this, my mom’s idea of a casual ‘out of work’ outfit was a t-shirt and jeans.  <br>\r\nWhile she wasn’t wearing the same outfit she’d worn on the TV, she still looked professional.<br>\r\n<br>\r\nOnce she got close enough, she smiled and said, “Hi sweetie.”<br>\r\n<br>\r\nI was suddenly overcome with joy.  With a smile on my face, I ran out the door yelling, “Mommy! Mommy! Mommy!”</span></div></div>",
            "created":1570770000,
            "id":2731319,
            "title":"Mom Picks Me Up"
        },
        "111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "A Few Hours Later",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Mom knelt down as I ran up to her, scooping me up in her arms and hugging me.  Kissing me on the forehead, she said, \"Hi sweetie, did you have fun at Madison's?\"<br>\r\n<br>\r\nUntil now I hadn't gotten a good look at what mom looked like now.  I could still tell it was her, but there were differences to be sure.<br>\r\n<br>\r\nFor starters, her eyes weren't dilated like they'd been when I saw her yesterday morning and she didn't smell like booze.  She'd always focused on taking care of me more than she did herself; in the last few years she'd been drinking and abusing cold medicine.<br>\r\n<br>\r\nI was glad to see this was no longer appeared to be the case - the only time I'd ever seen her like this was in a photo taken with some girlfriends a few months before I was conceived.<br>\r\n<br>\r\nSnapping back to reality, I put a smile on my face and said, \"Uh huh! We played dress up!\"<br>\r\n<br>\r\nBefore she could respond, Aaron walked up to us.  \"Hi Mrs. Richardson.\"<br>\r\n<br>\r\n\"Aaron, please call me Aunt Mel.\" With a smile on her face, Mom said, \"Now come here and give me a hug.\"<br>\r\n<br>\r\nAaron quickly leaned in and gave my mom a hug.  As he pulled back, I could see he was embarrassed about something.  I didn't know what it was until I saw him subtly adjust his pants.  I let out a little giggle, which got me a quick glare from Aaron while my mom wasn't looking.<br>\r\n<br>\r\nMom walked me back to the car, which looked to be a new SUV instead of the old clunker she used to drive.  As she opened the back door, I frowned when I saw a booster seat on the rear seat.<br>\r\n<br>\r\nI went silent as Mom placed me in the booster seat.  After making sure I was snug, she went back towards the house.  Once she was out of earshot, I started to squirm a little in the booster seat.<br>\r\n<br>\r\nSeeing Aaron walking towards me, I said, \"This is so embarrassing.\" Sighing, I said, \"I was getting ready to take my learner's permit test, now I'm forced to sit in this booster seat.\"<br>\r\n<br>\r\n\"That's what happens when you're a little kid.\" Looking at me, Aaron said, \"Madison doesn't have a problem sitting in them.  I'm sure if you give it time, you'll get used to it.\"<br>\r\n<br>\r\n\"I don't want to get used to it.\" Pouting, I said, \"I want to be a big boy again.\"<br>\r\n<br>\r\nSeeing the expression on my face, Aaron started to chuckle.  When I started to glare at him, he said, \"You look adorable when you're angry.\"<br>\r\n<br>\r\n\"You wouldn't think this was so adorable if you were in my position.\"<br>\r\n<br>\r\nJust then Mom came back to the car with my overnight bag.  Seeing the annoyed look on my face, she said, \"Is someone getting a little cranky?\"<br>\r\n<br>\r\nWanting to have a little fun at my expense, Aaron said, \"She and Madison both had 5 waffles for breakfast; I think she's coming down from her sugar rush.\"<br>\r\n<br>\r\n\"Well then, it's a good thing daddy doesn't land for a few hours.\" Placing the bag next to me, Mom said, \"That's just enough time for you to have a nap, young lady.\"<br>\r\n<br>\r\n\"But I'm not tired!\"<br>\r\n<br>\r\nMoving to close the door, Mom said, \"Say goodbye, sweetie.\"<br>\r\n<br>\r\nAs much as I hated to admit it, I was starting to get tired and a little cranky.  Without looking at Aaron, I simply said, \"Bye.\"<br>\r\n<br>\r\nAfter saying goodbye to Aaron, mom got into the car and we drove off.  I waved to Madison as we drove by.<br>\r\n<br>\r\nAs we left the neighborhood, I was worried about what was coming next - I was going home to a family that only remembered me as a little 5 year old girl.</span></div></div>",
            "created":1570770000,
            "id":2731340,
            "title":"Going Home"
        },
        "1111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Airport",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Despite my protests to the contrary, I did end up taking a nap almost immediately after coming home.  I woke up about 3 hours later, just after 2:45.  Sitting up in the bed, I got my first decent look at my new room – and there was no doubt it was a room for a 5-year-old girl.<br>\r\n<br>\r\nAlmost everything was in varying shades of pink.  It looked a lot like Madison’s room; there was a dollhouse along with a table and chairs for tea parties.  I even saw a chest sitting on the floor, next to a mirror, that I could only assume had dress-up costumes inside it.  <i>This certainly beats my old room; even if it’s for a little girl.</i><br>\r\n<br>\r\nGetting out of bed, I walked over to a window and looked outside; surprised to find a spacious backyard with a playhouse and swing set in one corner.  A big smile appeared on my face when I saw an above ground pool attached to the deck.  <i>I guess if I’m stuck like this for a while, there are worse places to live.</i><br>\r\n<br>\r\nHeading towards the bedroom door, I walked out into the hall.  I slowly made my way towards the stairs, not really having any idea where I was going.  Walking downstairs, I found myself standing outside a large family room; half of which was taken up what I could only assume was a play area for me.  <i>Wow, this place is awesome!</i><br>\r\n<br>\r\nWalking through the family room, passing the large TV on the wall, I spotted some photos out of the corner of my eye.  Most of them were of me at various ages, but there was one in particular that caught my eye.  It was a picture of my mom and a man standing in front of a tree.  My mom was wearing a wedding dress, so I could only assume the photo was on their wedding day.  Looking at the photo, I saw how happy mom looked; a far cry from the woman I’d known until yesterday.<br>\r\n<br>\r\nHearing a noise nearby, I walked back into the hall and found myself in the kitchen.  I saw mom sitting at the kitchen table, looking through some mail.  My heart dropped sank when I saw a pill bottle sitting next to her.  The mom I knew used to take pills regularly; I hoped that wasn’t the case here.  “Mommy, are you alright?”<br>\r\n<br>\r\n“Sweetie, you startled me.” Turning to face me, Mom said, “Mommy’s fine, I just have a little headache.”<br>\r\n<br>\r\n“When’s daddy coming home?”<br>\r\n<br>\r\n“His plane lands in an hour, so we’ll probably be leaving soon.” Picking me up, Mom said, “Why don’t you watch some cartoons until we leave.”<br>\r\n<br>\r\nAs mom carried me back into the family room, I once again spotted the wedding photo.  I would have preferred not to ask it in such a childish way, but my curiosity got the better of me.  “Mommy, how did you and Daddy meet?”<br>\r\n<br>\r\n“Daddy and I met in college; your Aunt Megan, Daddy’s sister, was my roommate.” Sitting down on the couch, with me in her lap, <br>\r\nMom said, “The three of us spent a lot of time together, much like you and Madison.  One day he stopped by our room and, instead of asking to see her, he asked if I wanted to go to the movies.”<br>\r\n<br>\r\nAs I listened, I hoped I was doing a good job of hiding my emotions; because I was feeling sad on the inside.  Mom always told me she never regretted having me; but after hearing this, I felt somewhat responsible for keeping her from having the life she deserved.</span></div></div>",
            "created":1570770000,
            "id":2731493,
            "title":"A Few Hours Later"
        },
        "11111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Back Home (A Few Hours Later)",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Mommy and I got to the airport about 20 minutes before daddy’s flight was supposed to land.  On the drive here, I learned that he’d gone to a friend’s bachelor party.  After finding a parking spot, with me in her arms, Mommy and I went into the airport to wait.<br>\r\n<br>\r\nI watched as other people came and went; waiting patiently for daddy to come down the escalator.  As I stood next to mommy, I started to worry as to why I’d subconsciously started referring to them as mommy and daddy instead of mom and dad.  The best explanation I could come up with was that Madison’s personality had rubbed off on me.  At least I hoped that was the case.<br>\r\n<br>\r\nI was starting to get antsy when Mommy squeezed my hand and said, “Here comes Daddy, sweetie.”<br>\r\n<br>\r\nLooking up, I saw her pointing towards the escalator.  It took me a moment, but I finally spotted the man from the photo – the man who was now my dad.  Before I realized what I was doing, much like when I’d seen Mommy at Madison’s, I started running towards him yelling, “Daddy! Daddy!”<br>\r\n<br>\r\nDaddy knelt down as I got closer and scooped me up in his arms; giving me a kiss on the forehead as he did so.  “There’s my little princess.”<br>\r\n<br>\r\nI giggled a little bit when I heard that.  Giving him a peck on the cheek, I said, “I missed you, daddy.”<br>\r\n<br>\r\nWalking towards mommy, he said, “I missed you too, pumpkin.”<br>\r\n<br>\r\nI watched as Mommy and Daddy kissed each other; surprised to find the whole display a little disturbing.  “Ewww!”<br>\r\n<br>\r\n<div align=\"center\">*************************</div><br>\r\n<br>\r\nAfter Daddy got his luggage from the baggage claim, the three of us walked back to where the car was parked.  Once I was buckled into my booster seat, and they got into the car, Mommy started driving towards the exit.<br>\r\n<br>\r\nOn the way, she turned to Daddy and said, “What do you say we treat Lizzie to a little family fun?”<br>\r\n<br>\r\n“I think that would be a great idea.” Looking at me, Daddy said, “Pumpkin, what do you say we take you to Chuck E Cheese?”<br>\r\n<br>\r\nA small part of me, the part that was still a 15-year-old boy, got the feeling that they were up to something.  But the part of me that was a 5-year-old girl didn’t care about that.  My excitement about going to Chuck E Cheese was greater than my concern that they were up to something.  “YAY!!”</span></div></div>",
            "created":1570770000,
            "id":2731503,
            "title":"The Airport"
        },
        "111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Chuck E Cheese was followed by a trip to Dairy Queen for ice cream.  I sat in my booster seat, eating my ice cream, as Mommy drove home.<br>\r\n<br>\r\nThe whole drive home, I found myself thinking that something was definitely up – why else would Mommy and Daddy take me to Chuck E Cheese and ice cream.  A growing part of me, however, didn’t care; I was having fun.  <i>Why did my brain insist on cluttering that up with suspicion?</i><br>\r\n<br>\r\nOnce we got back to the house, which I realized was in a neighborhood not far from Aaron’s house, Daddy carried me inside while Mommy closed the door.  Looking at Mommy, Daddy said, “Is there anything else, before I put our tired little princess to bed?”<br>\r\n<br>\r\n“I can think of one thing.”<br>\r\n<br>\r\n<i>Something is definitely going on here.</i><br>\r\n<br>\r\n“That’s right, I almost forgot.” Nodding, Daddy said, “It’s not something we can hide for very much longer.”<br>\r\n<br>\r\nAs Daddy carried me upstairs, Mommy said, “Who’s going to do the honors?”<br>\r\n<br>\r\n“I think it’s only appropriate that you do the honors, babe.”<br>\r\n<br>\r\nOnce we were in my room, Mommy took me and sat me down on her lap.  “Lizzie, sweetie, we’ve got some big news.” Looking at me, she said, “We think its time we told you what it was.”<br>\r\n<br>\r\n“What kind of news?”<br>\r\n<br>\r\n“You're going to be a big sister.\"<br>\r\n<br>\r\n<i>Mommy was pregnant.</i><br>\r\n<br>\r\nNormally that was happy news, and I would have shared in the happiness.  But these weren’t normal circumstances – I didn’t want to be a big sister.  As if the stress from the last day hadn’t been enough, this news was enough to push me over the edge – I began to cry.<br>\r\n<br>\r\nMommy pulled a tissue out of her purse and started to wipe away my tears.  Looking at me, she said, “Well, <i>say</i> something, sweetie.” <br>\r\n<br>\r\nI did, but it definetly wasn’t what Mommy and Daddy expected.  Looking at them, I said, “I don’t wanna be a big sister!  I don't wanna! I don't wanna! I don't wanna!\"<br>\r\n<br>\r\nMommy held me close to her shoulder as I cried.  Looking at Daddy, she said, “I guess she’s not quite ready yet.”<br>\r\n<br>\r\nBut that wasn’t why I was crying; at least not entirely.  I wanted to be a big brother, not a big sister.  Or maybe I still wanted Mommy and Daddy to myself.  But mostly it was the idea that I was going to be a big sister...I think.</span></div></div>",
            "created":1570770000,
            "id":2731573,
            "title":"Some Shocking News"
        },
        "1111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>When I woke up the next morning, my thoughts immediately went to the news Mommy and Daddy told me last night.  I instantly remembered not taking it very well.  Sitting up in bed, I realized that I needed to apologize for how I’d acted.  After all, Mommy was going to have this stupid baby whether I wanted her to or not.  <i>Wait, did I just call the baby stupid?</i><br>\r\n<br>\r\nPushing that thought aside, I climbed out of bed.  Hearing noises coming from Mommy and Daddy’s room, I walked down the hall.  Poking my head inside, I saw Daddy asleep in bed and a light on in the bathroom.<br>\r\n<br>\r\nQuietly sneaking past daddy, I walked into the bathroom and saw Mommy getting ready for work.<br>\r\n<br>\r\nI couldn't help but look at her and think about how pretty she looked in her dress. <br>\r\nI found myself wishing I looked that pretty when I grew up.<br>\r\n<br>\r\nMommy must’ve spotted me out of the corner of her eyes, because she put down her mascara and looked at me, “Sweetie, what are you doing up so early?”<br>\r\n<br>\r\nI turned and saw a clock on a nearby table – it read 6:15.  Looking back to Mommy, I said, “I’m sorry, Mommy.”<br>\r\n<br>\r\nKneeling down in front of me, Mommy said, “Sorry for what, sweetie?”<br>\r\n<br>\r\n“I’m sorry about last night with the baby.”<br>\r\n<br>\r\n“Sweetie, that’s alright; it’s normal for kids your age to react that way.” Looking at me, Mommy said, “Daddy and I should have told you more delicately.”<br>\r\n<br>\r\nAll my issues from last night started to come back; mainly how I didn’t want to share Mommy and Daddy.  “But you’re <i>my</i> mommy and daddy.”<br>\r\n<br>\r\n“Is that what this is all about?” picking me up, Mommy said, “Sweetie, just because you’re going to be a big sister doesn’t mean I won’t be your mommy anymore.”<br>\r\n<br>\r\nA part of me knew that, but a larger part of me wasn’t sure.  “Really?”<br>\r\n<br>\r\n“Of course, sweetie.” Kissing me on the forehead, Mommy said, “You’re my baby girl; I’ll always love you no matter what.”<br>\r\n<br>\r\n“Thanks, Mommy.”<br>\r\n<br>\r\nCarrying me back to my room, Mommy tucked me back into bed.  Kissing me again, she said, \"Have fun with daddy today, sweetie.\"</span></div></div>",
            "created":1570856400,
            "id":2731727,
            "title":"The Next Morning"
        },
        "11111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Beach Day",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>It was 8:30 when I woke up again.  As I sat up in bed, I heard some noises from downstairs.<br>\r\n<br>\r\nClimbing out of bed, I walked downstairs to find daddy making breakfast.  Going up to him, I hugged his leg and said, \"Morning daddy.\"<br>\r\n<br>\r\n\"Morning kiddo.\" Tousling my hair, he said, \"Did you sleep well?\"<br>\r\n<br>\r\n\"Uh huh.\"<br>\r\n<br>\r\n\"Since it's just the two of us today, what do you say we have one of our daddy-daughter days?\"<br>\r\n<br>\r\nI didn't want to disappoint daddy, but I had no idea what to expect from a daddy-daughter day.  In fact, until Madison's wish, I never really had a father figure in my life.  Looking at daddy, I said, \"Okay daddy!\"<br>\r\n<br>\r\n\"Great.\" Picking me up, daddy carried me over to the table.  Looking at me, he said, \"Why don't we have breakfast then how about we have a beach day?\"<br>\r\n<br>\r\nNever one to pass up a chance to go to the beach, be it as a boy or a girl, I was excited by the idea.  \"Okay!!\"</span></div></div>",
            "created":1570856400,
            "id":2731927,
            "title":"Breakfast with Daddy"
        },
        "111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Once we got to the beach and parked the car, our first stop was the bathroom.  “I don’t want you swimming on a full bladder.”<br>\r\nI wasn’t happy about the idea, but I went ahead and did my business anyway.  Walking out of the stall, I saw my reflection in the mirror – that of a little girl wearing a Dora the Explorer one-piece bathing suit.  I had to admit, as weird as this situation was, I did make an adorable little girl.<br>\r\n<br>\r\nWalking out of the bathroom, I saw daddy blowing up a pair of inflatable water wings.  Looking at me, he said, “You’re doing good in your swim lessons, but I just want to be on the safe side.”<br>\r\n<br>\r\nI was a little annoyed at that revelation; while I hadn’t been a pro swimmer before the wish, I was pretty good at it.  To find myself in a situation where I needed water wings was pretty embarrassing.<br>\r\n<br>\r\nDaddy and I walked onto the beach; after putting the water wings on my arms, he spread out a blanket.  Rather than go straight to the water, I turned my attention to a box of beach toys that Daddy had brought.  Looking at them, I said, “Daddy, can we make a sandcastle?”<br>\r\n<br>\r\n“Of course we can, sweetie.”  Taking my hand, Daddy said, “But first, why don’t we go for a swim.”<br>\r\n<br>\r\nAs I followed daddy down to the water, I dipped a toe into it and pulled it back – the water was cold.  Gesturing to the ocean, Daddy said, “Would you look at all that water, Lizzie?”<br>\r\n<br>\r\nLooking out at the water, seeing a few boats go by, I said, “Wow!”<br>\r\n<br>\r\n“And just think; that’s just the top of it!”<br>\r\n<br>\r\nWe both laughed at Daddy’s joke; after which we both went into the water.  We didn’t go too deep, just far enough that I could just barely touch the bottom; but it didn’t matter to me, we were swimming.  <i>This is amazing, I’m swimming my daddy.</i><br>\r\n<br>\r\nMommy never really talked much about my daddy before Madison’s wish; at least not to me.  I think there were times where she’d mention him to some of her boyfriends.  Mommy had a lot of boyfriends before the wish.  When I was little the first time, most of them would leave as soon as they saw me.]=<br>\r\n<br>\r\nAs I got older, some of them would stick around longer; but none came close to marrying her.  There was one guy, that I remember, who told me, “Kid, I like your mom, but she's got more issues than <i>National Geographic</i>.”<br>\r\n<br>\r\nI do remember one time, hearing her talk about someone who might have been my daddy.  I was about 9 years old; it was morning and I wanted some breakfast.  I’d stopped in the hall outside the kitchen as Mommy talked to her then-boyfriend.  “Sometimes I wonder if things would’ve been different if I hadn’t had so much to drink; or if my gown hadn’t been so low-cut.”<br>\r\n<br>\r\n“Why don’t you ever ask yourself what if he hadn’t done what he did?”<br>\r\n<br>\r\nBut that was before.  Now I had a happy mommy and a daddy who loved us both.<br>\r\n<br>\r\n<div align=\"center\">****************************</div><br>\r\n<br>\r\nWe stayed in the water for another 15 minutes or so.  After a while, we both started to get a little cold.  As we stepped out of the water, Daddy looked at me and said, “What did the ocean say to the beach?”<br>\r\n<br>\r\nLooking at Daddy, I said, \"What?\"<br>\r\n<br>\r\n\"Nothing.” Smiling, he said, “It just waved.\"<br>\r\n<br>\r\nDaddy and I both laughed as we walked back to the towel.  I began to think Daddy had a million of these jokes.</span></div></div>",
            "created":1570856400,
            "id":2732079,
            "title":"Beach Day"
        },
        "1111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Daddy and I spent almost 2 hours at the beach; where we built a sandcastle and Daddy let me bury him in the sand.  If anyone had been watching us, they would have seen a little girl having fun with her father.<br>\r\n<br>\r\nAfter we left the beach, Daddy took us to Burger King for lunch; after making me promise not to tell Mommy.  As we sat outside the play area, Daddy with his whopper and me with my Kid’s Meal, Daddy looked at me.  “Mommy told me why you were so upset last night.”<br>\r\n<br>\r\n“She did?”<br>\r\n<br>\r\n“Uh-huh.” Putting his burger down, Daddy said, “Lizzie, sweetie, you have nothing to worry about.  Just because you’ll have a little brother, or sister, doesn’t mean Mommy and I will love you any less.”<br>\r\n<br>\r\nI wasn’t entirely convinced.  “It doesn’t?”<br>\r\n<br>\r\n“Of course not.” Getting up, Daddy knelt down in front of me and said, “You’re our little girl; no matter what happens, we’ll always love you.”<br>\r\n<br>\r\n“You promise?”<br>\r\n<br>\r\n“I can’t promise we’ll always have time to spend with you; after all, babies need a lot of attention.” Looking at me, Daddy said, “You need a lot of attention yourself when you were a baby.”<br>\r\n<br>\r\n“Could I help you with the baby?”<br>\r\n<br>\r\n“Of course you can.” Smiling, Daddy said, “You’re going to be a big sister; you can help however you want.”</span></div></div>",
            "created":1570856400,
            "id":2732096,
            "title":"Lunch"
        },
        "11111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "That Night",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>After we got home, I helped Daddy carry some of the things inside.  Once that was done, he looked at me and said, “Time for your nap, pumpkin.”<br>\r\n<br>\r\nI wasn’t going to fight it like I’d done the day before; I did see the need for daily naps now.  “Okay, Daddy.”<br>\r\n<br>\r\nGoing upstairs to my room, I closed the door and climbed into bed.  As I rest my head on my pillow, I started thinking about how much my life had changed in such a short time.  Two days ago I was a 15-year-old boy, living in a crummy apartment and worried about his mommy.  Now I was a 5-year-old girl in a happy home.<br>\r\n<br>\r\nI spent the next minute or so trying to get comfortable.  As I did that, I brought my thumb up to my mouth.  Without even thinking about it, I stuck it in my mouth and started sucking.  It didn’t feel weird at all; it felt comforting...and <i> familiar.</i><br>\r\n<br>\r\n<div align=\"center\">*****************************</div><br>\r\n<br>\r\nIt was the middle of the afternoon when I woke up from my nap.  Climbing out of bed, I went downstairs to find Daddy.  It didn’t take long to find him in the kitchen, doing something in the fridge.<br>\r\n<br>\r\nHe must’ve heard me coming because, without looking up, he said, “Did you have a good nap, Lizzie?”<br>\r\n<br>\r\n“Uh-huh.” Walking up to the fridge, I said, “What are you doing?”<br>\r\n<br>\r\n“I’m checking to make sure the steaks are thawing for dinner tonight.” Closing the fridge door, Daddy turned to me and said, “I thought we were done with that.”<br>\r\n<br>\r\nI wondered what he was talking about; until I realized I was still sucking my thumb for my nap.  I quickly pulled my thumb from my mouth and, with a childish grin, said, “Sorry daddy.”<br>\r\n<br>\r\n“I see you’re falling back on some old habits.” Kneeling down, Daddy said, “This new baby must have you pretty nervous.”<br>\r\n<br>\r\n<i>You have no idea what has me nervous, Daddy.</i></span></div></div>",
            "created":1570942800,
            "id":2732365,
            "title":"Returning Home"
        },
        "111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Next Morning",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>It was just before midnight when I was suddenly awakened by a loud noise outside.  Sitting up in bed, holding Mr. Bunny, I wondered what the sound had been.  It was then that I saw a flash of lightning outside my window; followed almost immediately by a loud clap of thunder.<br>\r\n<br>\r\nMy heart immediately started to race.  Jumping out of bed, with Mr. Bunny in my arms, I ran down the hall to Mommy and Daddy’s room.  Stopping on Mommy’s side of the bed, I started shaking her.  “Wake up, mommy.”<br>\r\n<br>\r\nAfter a few seconds, Mommy woke up and looked at me.  “What’s wrong, sweetie?  Did you have an accident?”<br>\r\n<br>\r\nThat reminded me that I was once again wearing a pair of pull-ups.  Looking at Mommy, I said, “The thunder is scary.”<br>\r\n<br>\r\nDaddy woke up at that moment and saw me standing at the foot of the bed.  “What’s going on?”<br>\r\n<br>\r\n“It seems that Lizzie is afraid of the storm outside.” Looking at Daddy, Mommy said, “I <i>think</i> she’d feel better if she slept in here with us.”<br>\r\n<br>\r\n“I don’t see a problem with that.” Looking at me, Daddy said, “Don’t worry, pumpkin, we’ll keep you safe.”<br>\r\n<br>\r\nAs mommy lifted me onto the bed, I scrambled in between them.  I wasn’t sure who I wanted to sleep closer to; but Mommy and Daddy quickly made that decision for me – as they both turned to face me and moved closer to the point where I was snug between them.  Kissing me on the forehead, Mommy said, “Get some sleep, sweetie.”<br>\r\n<br>\r\n“Okay, mommy.”<br>\r\n<br>\r\nAs I lay in my parent’s bed, with my eyes closed, I started to think – <i>Why was I so afraid of thunder now?</i></span></div></div>",
            "created":1570942800,
            "id":2732432,
            "title":"During the Night"
        },
        "1111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>When I woke up the next morning, I immediately noticed two things: daddy wasn’t in bed and I was now lying in bed with my head on Mommy’s chest.  As I woke up some more, I became aware of the fact that I was sucking my thumb again.  <i>What’s that about?</i><br>\r\n<br>\r\nI took my thumb out of my mouth just as Mommy opened her eyes.  Looking at me, she said, “Aren’t you the perfect thing to wake up to in the morning.”<br>\r\n<br>\r\nI let out a giggle and kissed Mommy on the cheek.  “Morning, Mommy.”<br>\r\n<br>\r\n“Good morning, sweetie.” Kissing me, as she sat up, Mommy said, “Where is your father?”<br>\r\n<br>\r\nAs if on cue, Daddy walked in with a tray of food; what looked like eggs and sausage for Mommy and Daddy plus a bowl of cereal for me.  “Glad to see you’re both awake.”<br>\r\n<br>\r\nAs Daddy sat down at the edge of the bed, Mommy said, “What’s all this for?”<br>\r\n<br>\r\n“I was thinking since you don’t have to work today, that the three of us could stay in bed for a little while.” With a grin, Daddy looked at me and said, “Maybe watch some cartoons?”<br>\r\n<br>\r\nI don’t know what I was more excited about; having breakfast in bed with my parents or watching cartoons.  I quickly realized it didn’t matter; so long as I was with them.  “Cartoons!”<br>\r\n<br>\r\nDaddy climbed back into bed and served breakfast to Mommy and me.  As he did that, Mommy said, “I can’t ask for a better start to my day.”</span></div></div>",
            "created":1570942800,
            "id":2732441,
            "title":"The Next Morning"
        },
        "11111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I’m sure Mommy and Daddy hadn’t planned on spending the entire morning in bed with me; but that’s what ended up happening.  We had just finished watching Toy Story 3, when an idea popped into my head.  Looking at Mommy, I said, “Mommy, I want pigtails like Jessie!”<br>\r\n<br>\r\n“Okay sweetie.” Smiling, Mommy said, “If that’s what you want.”<br>\r\n<br>\r\n<div align=\"center\">**************************</div><br>\r\n<br>\r\nIt took about an hour for mommy to put my hair into the pigtails.  After thanking her, I ran back to my room.  Once inside, I started to rummage through my chest of costumes until I’d found what I was looking for – a sheriff’s costume.<br>\r\n<br>\r\nAs I stood in front of the mirror, putting the costume on, I came to a sudden realization.  Until now, I’d had no idea that costume was in the chest – how could I have possibly known it was there.<br>\r\n<br>\r\nPutting that thought out of my mind, I ran downstairs.  I walked into the kitchen to find Mommy standing by the fridge.  Seeing me, a smile on her face, she said, “Uh-oh, it’s the sheriff!”<br>\r\n<br>\r\n“Daddy’s been a bad person.” Giggling, I said, “I need to awest him.”<br>\r\n<br>\r\n“I think he’s in the garage, sheriff.” Chuckling, Mommy said, “But don’t be too hard on him.”<br>\r\n<br>\r\nWalking down the hall, I found daddy standing by his workbench in the garage.  Going up to him, I said, “You’re under arrest, Mister!”<br>\r\n<br>\r\nPlaying along, Daddy turned to me and said, “You’ll never catch me alive, Sheriff!!”<br>\r\n<br>\r\nBefore I knew what was going on, Daddy ran back into the house.  Chasing after him, I caught him in the kitchen.  “You’ve been bad!”<br>\r\n<br>\r\n<div align=\"center\">**************************</div><br>\r\n<br>\r\nDaddy and I continued playing around for about an hour; until I heard the doorbell ring.  Mommy went to answer the door; letting Aaron and Madison into the house.  Looking at me, Mommy said, “Sorry kiddo, but Daddy and I have to go; we have plans with Madison’s parents.”<br>\r\n<br>\r\nI remembered Mommy saying that she and daddy were going to see a movie with Madison’s parents.  Walking over to Daddy, who was in a ‘jail’ I’d made out of couch cushions, I said, “You’re free to go, daddy.”<br>\r\n<br>\r\n“Thank you, sheriff.” Kneeling down, Daddy kissed me on the forehead, “I promise I’ll be good from now on.”<br>\r\n<br>\r\nMommy gave me a kiss before walking out the door with Daddy.  Before closing the door, she said, “Be a good girl for Aaron, sweetie.”<br>\r\n<br>\r\n“Okay, mommy.”<br>\r\n<br>\r\nOnce the door closed, I turned to find Aaron and Madison looking at me; both of them with confused looks on their faces.  Looking at me, Aaron said, “You mind telling us what that was all about?”</span></div></div>",
            "created":1570942800,
            "id":2732457,
            "title":"Later that Day"
        },
        "111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Playtime",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>As soon as Aaron said, it was like my mind had cleared.  “I don’t know.”  Looking at Aaron, I said, “The other day, after my mom picked up me from your house, I took a nap.  When I woke up, I felt more like a little kid.”<br>\r\n<br>\r\n“What exactly does that mean?”<br>\r\n<br>\r\nGesturing to my sheriff’s costume, I said, “For starters, I knew exactly where to find this in my room.” walking into the family room, I said, “Not only that, but I started thinking of my parents as Mommy and Daddy, I’ve started sucking my thumb, and now I’m afraid of thunderstorms.”<br>\r\n<br>\r\n“How do you feel now?”<br>\r\n<br>\r\n“I feel more like myself.” Sighing, I said, “But I felt like myself for the past two days.”<br>\r\n<br>\r\nWalking over to me, Madison turned to Aaron and said, “What’s causing this?”<br>\r\n<br>\r\n“I can’t be certain, but I think it has something to do with us.” Looking at me, Aaron said, “When you’re not around us, Travis goes away and Lizzie takes over.”<br>\r\n<br>\r\nLooking at me, Madison said, “You said you’ve been sucking your thumb?”<br>\r\n<br>\r\n“Apparently it’s a habit that I used to have.” Looking at my thumb, I said, “My folks think it's a reaction.”<br>\r\n<br>\r\n“A reaction to what exactly?”<br>\r\n<br>\r\n“My mom’s pregnant.”<br>\r\n<br>\r\nIn shock, Aaron looked at me and said, “A-Are you sure?”<br>\r\n<br>\r\n“I’m sure.” Pausing, I said, “Otherwise that’s a pretty cruel joke to play on a 5 year old.”<br>\r\n<br>\r\n“Oh wow.” Taking a breath, Aaron said, “How did you take the news?”<br>\r\n<br>\r\n“Not all that well.” Sighing, I said, “I threw a temper tantrum after they told me.”<br>\r\n<br>\r\n“Really?” shocked, Aaron said, “You threw a tantrum over that?”<br>\r\n<br>\r\n“You would’ve done the same if you were in my shoes.”  Looking at Aaron, I said, “At the time, I was scared of the idea that I wasn’t going to be the center of attention anymore.”<br>\r\n<br>\r\n“I guess that’s pretty understandable.” Shrugging, Aaron said, “Most kids your age would probably react that way.”<br>\r\n<br>\r\n“I’m not like other 5-year-olds, Aaron.” Looking at him, I said, “I’m only this way because of Madison’s wish.”<br>\r\n<br>\r\n“Speaking of Madison’s wish, I’ve been doing some research over the last few days.”<br>\r\n<br>\r\n“Have you made any progress?”<br>\r\n<br>\r\n“Not really; most of the information I’ve been able to find has come from stories created by people online.”  Looking at me, he said, “I’m sure there are some legitimate sources out there, I just have to find them.”<br>\r\n<br>\r\n“So what do we do in the meantime?”<br>\r\n<br>\r\nGesturing to Madison, who was playing with some toys in the corner, Aaron said, “Why don’t you go play, I’ll do some more digging and see what I can find.”</span></div></div>",
            "created":1570942800,
            "id":2732499,
            "title":"What's Happening?"
        },
        "1111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Visiting the Psychic",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Madison and I spent the next hour playing some of my toys; all while Aaron sat on the couch with his laptop.  Looking at me, Madison said, “For what it’s worth, you seemed to be having fun before we showed up.”<br>\r\n<br>\r\n“I was having fun.” Leaning closer, I said, “Having never really had a loving family, I didn’t know what I was missing out on.”<br>\r\n<br>\r\n“Maybe making that wish wasn’t such a bad thing after all.”<br>\r\n<br>\r\n“I’d much rather be a guy right now, but there are worse things than being a 5-year-old girl.”<br>\r\n<br>\r\nJust then, Aaron looked up from his laptop and said, “I think I found something.”<br>\r\n<br>\r\nMadison and I walked over to the couch.  Looking at Aaron, I said, “Really?”<br>\r\n<br>\r\n“Yeah.” Looking at me, Aaron said, “There’s this psychic in town that might be able to help.”<br>\r\n<br>\r\n“How is a psychic supposed to help?” looking at Aaron, I said, “Most of them are fake anyway.”<br>\r\n<br>\r\nTurning the screen so I could see, Aaron said, “Just look at this.”<br>\r\n<br>\r\nI had to stand up on my toes to see the screen, but I saw a website for a psychic named Madame Burke.  Her page said she was not only a psychic but an expert on mystical objects.  Looking up at Aaron, I said, “Are you really thinking we should go see her?”<br>\r\n<br>\r\n“What do you have to lose?”<br>\r\n<br>\r\n“Okay fine.” Sighing, I said, “Let me get changed and then we’ll go.”</span></div></div>",
            "created":1571029200,
            "id":2732941,
            "title":"Playtime"
        },
        "11111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I kind of felt bad for Aaron as he led Madison and me downtown.  Almost as soon as we left the house, Madison and I got a sudden burst of energy.  We alternated between skipping down the sidewalk and running.  Aaron tried his best to keep us under control, but there wasn’t much he could do.<br>\r\n<br>\r\nUntil that is when Madison and I almost ran across a crosswalk into on-coming traffic.  After he’d stopped us at the last minute, Aaron grabbed us both by the arm and dragged us down a nearby alley.  “What the hell is wrong with you two; you almost ran into oncoming traffic.”<br>\r\n<br>\r\nI was surprised to find myself somewhat frightened by Aaron’s tone; looking at Madison, I saw she was feeling the same way.  <br>\r\nLooking at him, I said, “We’re sorry.”<br>\r\n<br>\r\n“I can understand Madison acting this way.”  Looking at me, Aaron said, “But I expected better from you.”<br>\r\n<br>\r\n“I’m sorry, Aaron.” Looking at him, feeling about 5 inches tall, I said, “I-I just got carried away.”<br>\r\n<br>\r\n“Just be more careful.”<br>\r\n<br>\r\nAfter Aaron finished his lecture, the three of us safely crossed the street and walked down to where Madame Burke’s store was.  As we walked into the store, I found that it was filled with all sorts of strange items.  I was starting to remember why I thought psychics were frauds; especially once I spotted bottles of what was supposedly ‘love potions.’<br>\r\n<br>\r\n“Can we get out of here; this place is giving me the creeps.” Turning to Aaron, I said. “Besides, how could she possibly help us?”<br>\r\n<br>\r\nBefore Aaron could respond, I heard footsteps from the back.  I saw a middle-aged woman walk through a doorway.  Looking at me, she said, “You, of all people, should be open to every possibility...Travis.”</span></div></div>",
            "created":1571029200,
            "id":2732950,
            "title":"Visiting the Psychic"
        },
        "111111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span> My eyes widened as soon as I heard that.  Looking at her, I said, “H-How do you know my name?\"<br>\r\n<br>\r\n“I’m Madame Burke; it is my business to know that which others don’t.” <br>\r\n<br>\r\n\"I guess we came to the right person,\" Aaron said.<br>\r\n<br>\r\nClutching her robe, I said, “Please, I need your help.” Looking up at her, I said, “I don’t want her to take over again.”<br>\r\n<br>\r\nRaising an eyebrow, Madame Burke said, “Her?”<br>\r\n<br>\r\n“My friend’s sister, Madison, used a wishing stone; it turned me into a 5-year-old girl.” Pausing, I said, “Sometimes Lizzie likes to take over.”<br>\r\n<br>\r\nKneeling down to my level, Madame Burke placed a finger on my lips.  “Exactly who do you think Lizzie is?” <br>\r\n<br>\r\n“She’s the 5-year-old girl that I turned into.” Gesturing to Aaron and Madison, I said, “We seem to be the only ones who remember that I was a boy.”<br>\r\n<br>\r\n“If that’s true, then why do you refer to Lizzie as someone else?”<br>\r\n<br>\r\n“Because I’m a boy.”<br>\r\n<br>\r\n“You just said you were a girl.” Sitting down, she said, “Travis, Lizzie; both are two sides of the same code.  Lizzie can’t ‘take over’; because the two of you are the same person.  Do you understand?\"<br>\r\n<br>\r\n\"I... I think so.\"<br>\r\n<br>\r\n“Madame Burke, we came here because we thought you could help us.” Taking the wishing stone out of his pocket, Aaron said, “What can you tell us about these wishing stones?”<br>\r\n<br>\r\n“Wishing stones are ancient and powerful, but they can only be used once.” Taking the stone from Aaron, she said, “They can’t be used with the intent of enriching anyone.”<br>\r\n<br>\r\n“That doesn’t make any sense.” Looking at Madame Burke, I said, “My mommy’s doing so much better with me as a little girl.”<br>\r\n<br>\r\n“I can only assume that wasn’t Madison’s intention when she made her wish.”<br>\r\n<br>\r\n“No, ma’am.” Shaking her head, Madison said, “I just wished that Travis could be my friend.”<br>\r\n<br>\r\n“That’s exactly my point.” Looking at me, Madame Burke said, “By delaying your birth, your mother’s life is different from the one you knew before.”</span></div></div>",
            "created":1571115600,
            "id":2733405,
            "title":"A Shock"
        },
        "1111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Back Home",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>“Is there anything you can do to help us find another one of these stones?”<br>\r\n<br>\r\n“I’m sorry, Travis, but I can’t.” looking at me, Madame Burke said, “Quite frankly, I didn’t believe they really existed until I met you.”<br>\r\n<br>\r\n“So I’m stuck like this forever?”<br>\r\n<br>\r\n“Would that truly be a bad thing?” kneeling down to my level, once again, Madame Burke said, “From what I can tell, your life now is much better than the one before.  You have two loving parents, and you’re going to be a big sister.”<br>\r\n<br>\r\nI almost asked how she knew about my mom’s pregnancy.  “But I don’t know anything about being a girl.” Looking at her, I said, “The only time I seem to act like one is when I’m not around Aaron or Madison.”<br>\r\n<br>\r\n“I suspect that will become more prominent as time goes by.” Pausing, Madame Burke said, “In time, Travis and Lizzie’s personalities will merge; until there’s no longer a way to tell them apart.”<br>\r\n<br>\r\n“I don’t like that sound of that.” Looking at Madame Burke, Aaron said, “You may not be able to help us, but is there anyone you can think of that might?”<br>\r\n<br>\r\n“I might know someone.” Standing up, Madame Burke said, “I’ll reach out to them and see what they know.”<br>\r\n<br>\r\n“That’s good enough for me.” Grabbing a piece of paper, Aaron said, “Here’s my cell phone number.”<br>\r\n<br>\r\n“I’ll be in touch.”<br>\r\n<br>\r\nAfter leaving the shop, I turned to Aaron and said, “I really hope that wasn’t a big waste of time.”<br>\r\n<br>\r\n“I’m sure she’ll be able to help us.”<br>\r\n<br>\r\nI was about to say something when I heard a ringing noise coming from Aaron’s pocket.  Looking at him, I said, “I think someone’s texting you.”<br>\r\n<br>\r\nReaching into his pocket, Aaron retrieved his phone.  After a second, he said, “That’s weird, I just got a text from Becky Goodwin.”<br>\r\nBecky Goodwin was a classmate of Aaron’s and mine at school.  The three of us were friendly, but never really hung out.  Looking at Aaron, I said, “What does she want?”<br>\r\n<br>\r\n“She just got back from vacation and wants to hang out.”<br>\r\n<br>\r\n“I guess we know who you’re friends are in this reality.” Pausing, I said, “You should invite her over to my house.”<br>\r\n<br>\r\n“You think your folks would be okay with that?”<br>\r\n<br>\r\n“I don’t see why not.”<br>\r\n<br>\r\n“Okay then, I’ll text her and tell her to come over.”</span></div></div>",
            "created":1571115600,
            "id":2733494,
            "title":"The Next Step"
        },
        "11111111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>The whole way home, Aaron expressed his astonishment. \"I can't believe I'm good friends with Becky Goodwin.\"<br>\r\n<br>\r\n\"Congratulations,\" I said. \"I wouldn't mind seeing Becky again.\"<br>\r\n<br>\r\nWe turned on the TV and tuned in to <i>Paw Patrol</i>. \"You like this show?\" Aaron asked.<br>\r\n<br>\r\nI shrugged. \"Guess Madame Burke wasn't kidding.\"<br>\r\n<br>\r\nAaron made macaroni and cheese for lunch, which was guaranteed to please. As we ate, I thought about what Madame Burke had said about my life now. I had a happy mommy, a daddy who loved me, and a little brother or sister on the way. And all it cost me was that I was now a little girl. Was it as bad as I thought before?<br>\r\n<br>\r\nThe doorbell rang. Aaron looked at the clock. \"That must be Becky.\"<br>\r\n<br>\r\nHe went to the door and opened it. \"Hey, Bec - \"<br>\r\n<br>\r\nThat was as far as he got. As soon as she came in, Becky wrapped her arms around Aaron and kissed him.</span></div></div>",
            "created":1571115600,
            "id":2733565,
            "title":"Back Home"
        },
        "111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Madison and I were leaning against over the back of the couch; watching Aaron and Becky kissing at the door.  Both of us started giggling; which was enough to stop them from kissing.  Looking at us, Becky said, “Sorry girls, I forgot you were here.”<br>\r\n<br>\r\nClosing the door, Aaron walked over to Becky and said, “What was with that kiss, Becky?”<br>\r\n<br>\r\n“I haven’t seen you in over a week.” Incredulous, Becky said, “Can’t I give my boyfriend a kiss?”<br>\r\n<br>\r\nThat was enough to cause Madison and me to start giggling again; until Aaron gave us an angry look.  We quickly went quiet as he turned to Becky.  “Boyfriend?”<br>\r\n<br>\r\n“Did you hit your head or something while I was gone?” confused, Becky said, “Aaron, we’ve been dating for almost 5 months.”<br>\r\n<br>\r\nI wanted to see how Aaron was going to get out of this.  Thinking for a moment, he said, “Sorry, it’s just a lot has happened over the last few days.”<br>\r\n<br>\r\n“I suppose I can forgive you.” Turning her attention to Madison and me, Becky said, “Besides, I’d love a chance to spend some time with these two munchkins.”<br>\r\n<br>\r\nMadison quickly jumped off the couch and ran over to hug Becky.  While still confused as to what was going on, I followed her example and ran over to hug her as well.  Looking at her, we both said, “Hi Becky.”<br>\r\n<br>\r\n“Hi girls.” Kneeling down to hug us, she said, “I missed you guys.”</span></div></div>",
            "created":1571115600,
            "id":2733569,
            "title":"A Surprise"
        },
        "1111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I hadn’t expected to have as much fun with Becky as I’d ended up having.  I did feel bad for Aaron though because most of the fun was at his expense; the part being when we painted his fingernails.<br>\r\n<br>\r\nAfter a while, Becky and Madison left the room to get something to drink.  Once Becky was out of sight, Aaron turned to me with an angry look in his eyes.  I started to get scared again; like I had when he yelled at us in the alley.  Looking at me, he said, “What did I ever do to you?”<br>\r\n<br>\r\n“What do you mean?”<br>\r\n<br>\r\n“What did I ever do to you to deserve getting my nails painted?”<br>\r\n<br>\r\n“For starters, you teased me about the pull-ups and the booster seat.” Looking at him, trying my best to look serious, I said, “Besides, I was just doing what Madison did.  You should be angry with her.”<br>\r\n<br>\r\n“Believe me, I’m plenty angry with her.” Sighing, Aaron said, “Because of that stupid wish of hers, you’re a 5-year-old girl instead of my best friend.”<br>\r\n<br>\r\n“If you want to fix that, then find another stone!” pausing, I said, “It’s not like I can do it; what kind of 5-year-old kid knows how to use the internet.”<br>\r\n<br>\r\n“Fine, I’ll do all the work to try and fix this.” Hearing footsteps, Aaron said, “In the meantime, try not to humiliate me in front of Becky.”<br>\r\n<br>\r\nThat gave me an idea.  As Becky came back into the room, I ran up to her said, “Aaron wants us to give him a makeover!”<br>\r\n<br>\r\n“Really?” glancing at Aaron, Becky said, “If that’s what he wants, I guess we can do it.”<br>\r\n<br>\r\nAaron was about to protest but was stopped when the front door opened.  My parents and his parents came into the house.  <br>\r\nSeeing Becky, my mom said, “Hello Becky, I didn’t expect to see you here.”<br>\r\n<br>\r\n“Sorry, Mrs. Richardson.” Smiling, Becky said, “I heard Aaron was babysitting the girls, and you know how much I love spending time with them.”<br>\r\n<br>\r\nTurning to Aaron, spotting the nail polish, Mr. Sullivan said, “I see the girls had some fun.”</span></div></div>",
            "created":1571374800,
            "id":2734993,
            "title":"Fun With Becky"
        },
        "11111111111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "At the Station",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Come with me, Aaron,\" Mommy said. \"I've got some nail polish remover.\"<br>\r\n<br>\r\nAs Mommy led Aaron away, Daddy came to me. \"Did you have fun while we were gone, princess?\"<br>\r\n<br>\r\n\"Lots,\" I replied. \"What did you do, Daddy?\"<br>\r\n<br>\r\n\"Oh, we did some mommy-and-daddy stuff.\"<br>\r\n<br>\r\nAfter a few minutes, Mommy and Aaron came back. \"We'll see you tomorrow, then,\" Mr. Sullivan said, then the four of them left.<br>\r\n<br>\r\n\"What's tomorrow?\" I asked.<br>\r\n<br>\r\n\"We're going to have lunch together,\" Mommy said. \"All of us.\" She knelt down to my height. \"Would you like to help Mommy?\"<br>\r\n<br>\r\n\"Yes!\"<br>\r\n<br>\r\n\"Well, how about you come to the station tomorrow morning, after breakfast?\"<br>\r\n<br>\r\n\"Okay. What do we do?\"<br>\r\n<br>\r\n\"You're going to help me tell them about the baby. It isn't often that you know something grown-ups don't know, is it?\"<br>\r\n<br>\r\n<i>More often than you know, Mommy,</i> I thought, but didn't say. Instead, I said, \"No!\"<br>\r\n<br>\r\n\"Okay. You just have to keep the baby a secret until I give the signal. Think you can do that?\"<br>\r\n<br>\r\n\"Yes, Mommy.\" I was thrilled. I was going to help Mommy.<br>\r\n<br>\r\nIt wasn't until I was back in my room that I realized what was happening. I was thinking like a little girl again. <i>It's happening again,</i> I thought. <i>And it'll happen more and more often, until there's no difference.</i><br>\r\n<br>\r\nThis time, though, it didn't scare me as much.</span></div></div>",
            "created":1571374800,
            "id":2735040,
            "title":"Continue"
        },
        "111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>After having a quick breakfast the next morning, Mommy and I got into her car and drove the Station.  When we got there, I was immediately overcome by half a dozen of my mommy’s coworkers running over to me.  I stood helplessly in the doorway while they fussed over me.<br>\r\n<br>\r\nI was on the verge of crying when Mommy thankfully came to my rescue.  With me in her arms, Mommy walked down the hall to the studio.  Before we made it very far, a woman about mommy’s age came over to us.  “Hey Mel, what’s Lizzie doing here?”<br>\r\n<br>\r\n“I need her help with a story, Grace.”<br>\r\n<br>\r\nTurning her attention to me, Grace said, “How are you doing today, Lizzie?”<br>\r\n<br>\r\nI was overcome with shyness as I looked at her; but I managed to say, “I’m good.”<br>\r\n<br>\r\n<div align=\"center\">***********************</div><br>\r\n<br>\r\nI was standing just off-stage, with a large sign, watching Mommy as she was delivering a news report.  When she was finished, she turned to the camera and said, “Before we go to commercial, I have an important announcement to make.”<br>\r\n<br>\r\nOne of the co-anchors, a somewhat older woman, said, “You’re not leaving us, are you, Melanie?”<br>\r\n<br>\r\n“No Margaret, I’m not leaving.” With a smirk, she said, “At least not for a few more months.”<br>\r\n<br>\r\n“Then I’m confused; what kind of announcement are you going to make?”<br>\r\n<br>\r\n“You’ll find out soon enough.  But,” gesturing to me, she said, “I’m going to need some help from a very special helper.”<br>\r\n<br>\r\nWith the signal given, I walked out on the set; feeling a little overwhelmed by the lights and cameras.  Turning to me, a male anchor said, “Hello Lizzie, what’s that you have in your hands?”<br>\r\n<br>\r\nWith a smile on my face, I turned the sign around to show it to the cameras.  Everyone in the studio let out shocked gasps when they read it:<br>\r\n<br>\r\n<div align=\"center\"><b>Baby Richardson<br>\r\nComing May 2020</b></div><br>\r\n<br>\r\nTurning to the cameras, Mommy said, “That’s right folks; the Richardson family is getting bigger.” Smiling, she said, “My little girl is going to be a big sister, and she couldn’t be more excited about it.”<br>\r\n<br>\r\nI knew Mommy was making that last part up; especially considering the tantrum I’d thrown when they told me.  Once the cameras stopped rolling and the commercials started, everyone ran over to congratulate Mommy on the news.  As I stood there watching her, I realized just how happy she’d become.</span></div></div>",
            "created":1571634000,
            "id":2736491,
            "title":"At the Station"
        },
        "1111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I stayed at the Station for the next few hours while Mommy worked.  I passed the time by doing little jobs for everyone.  We finally left around 10:45.  As Mommy and I walked to the car, she looked at me and said, “Hey sweetie, what do you say we go to the mall.” Smiling, she said, “We can get you a cute little outfit for your first day of school.”<br>\r\n<br>\r\n“Okay!”<br>\r\n<br>\r\n<div align=\"center\">****************************</div><br>\r\n<br>\r\nOnce we got to the mall, I made sure to stay close to Mommy; I didn’t want to get lost.  We immediately headed towards Old Navy; where Mommy quickly picked out a dress that she thought looked nice.  I had to admit that I thought it looked pretty.<br>\r\n<br>\r\nAfter paying for the dress, and a few other items, Mommy and I left the store.  We were headed for the food court when I spotted <br>\r\nMadison walking towards me with her Mom.  “Mommy! It’s Madison!”<br>\r\n<br>\r\nWalking over to them, Mommy said, “Hi Grace.”<br>\r\n<br>\r\n“Hi, Melanie.” Looking at me, Mrs. Sullivan said, “Hello Lizzie.”<br>\r\n<br>\r\n“Hi!”<br>\r\n<br>\r\n“What brings you two to the mall?”<br>\r\n<br>\r\n“I suspect the same reason you’re here; getting Madison an outfit for her first day of school.”<br>\r\n<br>\r\n“Can you believe they’re starting kindergarten?” chuckling, Mommy said, “It feels like just yesterday they were in diapers.”<br>\r\n<br>\r\n“They’re growing up fast, aren’t they.” Pausing, Mrs. Sullivan said, “I was actually going to call you later on.  I’m thinking of signing <br>\r\nMadison up for ballet, do you think Lizzie would want to join her?”<br>\r\n<br>\r\n“I don’t see why not.” Looking at me, Mommy said, “Sweetie, would you like to take ballet with Madison?”<br>\r\n<br>\r\nI wanted to say no, but I found myself unable to do so.  Damn this child’s mind!  Looking at Mommy, I said, “Yes!!!”<br>\r\n<br>\r\n“I guess it’s settled then.” Smiling, Mrs. Sullivan said, “I’ll text you the details later.”<br>\r\n<br>\r\nSuddenly Madison took my hand and pulled me over to a nearby fountain.  Looking at me, she said, “Are you okay?”<br>\r\n<br>\r\nMy mental regression started to dissipate a little.  Looking at Madison, I said, “I think so.  Why?”<br>\r\n<br>\r\n“Because you just agreed to take ballet classes with me.” Pausing, Madison said, “I just wanted to make sure that was Lizzie and not Travis.”<br>\r\n<br>\r\n“You heard that psychic lady; we’re the same person.” Sighing, I said, “I’m not happy about it, but I can’t back out now.”<br>\r\n<br>\r\nBefore Madison could respond, Mommy walked over with Mrs. Sullivan.  Looking at us, Mommy said, “Girls, you can’t just run off like that.”<br>\r\n<br>\r\nI began to wonder why Mommy was so concerned, until I remembered that I was now a little girl.  I wasn't the big, strong boy that I had been before the wish.  Looking at her, I said, \"Sorry, mommy.\"</span></div></div>",
            "created":1571893200,
            "id":2737987,
            "title":"A Shopping Trip"
        },
        "11111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>As Mommy and I made our way to the food court, I saw another familiar face walking nearby.  It was a girl named Amber Simmons; I had a bit of a crush on her.  I was tempted to run over to her, but two things stopped me from doing so – I didn’t want Mommy to yell at me again, and I knew Amber wouldn’t know who I was.<br>\r\n<br>\r\nOnce we got to the food court, Mommy led me to the Subway restaurant in the far corner.  After ordering our food, we took a seat in the center of the room.  As I ate my kid’s meal, feeling somewhat disappointed that I could no longer eat a foot long grinder, I looked at Mommy and said, “When can we buy my clothes for ballet, mommy?”<br>\r\n<br>\r\n“Not quite yet, pumpkin; although I’m glad to see you’re so excited.” Looking at me, she said, “We have to get you registered first.”<br>\r\n<br>\r\n“Oh.” Pausing, I said, “Will I be in the same class as Madison?”<br>\r\n<br>\r\n“We’ll have to see; her class may already be full.”<br>\r\n<br>\r\nSitting at the table, eating my sandwich, I found my thinking wondering if spending time away from Aaron and Madison was speeding up the process of my two personalities merging.  Because I certainly wouldn’t have been interested in ballet before this.</span></div></div>",
            "created":1572498000,
            "id":2740776,
            "title":"At the Food Court"
        },
        "111111111111111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>When we got home, there was someone else's car in the driveway. \"Look who's here, sweetie,\" Mommy said.<br>\r\n<br>\r\nI could see it was an older couple, but I had no idea who they were. Nevertheless, I found myself getting excited to see them. <i>It'll be a relief when I don't have to guess how I feel anymore,</i> I thought.<br>\r\n<br>\r\nGetting out of the car, Mommy waved at them. \"Hi, Ma, hi, Pa,\" she called. Getting me out of the booster seat, she asked, \"Wanna give Gramma and Grampa a great big hug?\"<br>\r\n<br>\r\nThat was all I needed to hear. As soon as my little feet were on the ground, I ran right over to the people I now knew to be my grandparents. Grampa looked like Daddy, so I knew which side of the family they were from. Gramma looked familiar, but I couldn't place it. Oh, well, they were my grandparents now. Having spent 15 years of my life estranged from one set of grandparents and having no knowledge of the other, I was perfectly happy to have these two. \"Mommy's gonna have a baby,\" I told them.<br>\r\n<br>\r\n\"We heard,\" Gramma said, \"but thank you for telling us.\" Turning to Mommy, she asked, \"How are you holding up, Mel?\"<br>\r\n<br>\r\n\"I'm doing okay, Ma,\" she said. I guess it was an endearment. \"Lizzie sounds excited about the baby now, but you should have seen the fit she threw when we told her.\"<br>\r\n<br>\r\n\"Kids are like that,\" Grampa said. \"Peter certainly wasn't thrilled when Megan first came along.\"<br>\r\n<br>\r\nJust then, a car I did recognize pulled into the driveway, and out stepped Mrs. Wilcox from Child Services. I didn't know why she was here, but I did know how upset Mommy got whenever Mrs. Wilcox came by. I stood there, watching, not sure what to expect.<br>\r\n<br>\r\nWhat I definitely didn't expect was what happened. Mommy called out, \"Megan!\" , then ran over and hugged her.<br>\r\n<br>\r\nI was puzzled at first, but then I put it together: Mommy had said that her college roommate, and Daddy's sister, was Megan. So, in this world, they were the best of friends.<br>\r\n<br>\r\n\"How are things at work?\" Mommy asked.<br>\r\n<br>\r\n\"Going alright,\" Aunt Megan replied. \"I've got my substitute trained, so it's maternity leave for me.\" She patted her big belly.</span></div></div>",
            "created":1573102800,
            "id":2743668,
            "title":"Surprises at Home"
        },
        "1111111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Playtime",
                "Later that day",
                "The Next Day",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>As the 5 of us stood outside the house, talking, I could hear some thunder in the distance.  I started to feel a little apprehensive like I’d been during the storm a few days ago.  A particularly loud clap of thunder came through and brought everyone’s attention to the approaching storm.  We all got inside just as the rain started coming down in buckets.<br>\r\n<br>\r\nWhile Mommy led the others to the couch, I started going towards the play area.  Suddenly I felt a hand on my shoulder.  Turning around, I saw Auntie Megan standing there.  Looking at me, she said, “Come sit with me, kiddo.”<br>\r\n<br>\r\n“Okay!”<br>\r\n<br>\r\nAuntie Megan picked me up and, with some difficulty, carried me over to the couch.  As we sat down on the couch, she said, “How are you doing, kiddo?”<br>\r\n<br>\r\n“I’m good!” giggling, I said, “I’m going to take ballet classes!”<br>\r\n<br>\r\n“Really?” looking at me, Megan said, “That sounds like fun.”<br>\r\n<br>\r\n“Uh-huh!” looking at Mommy, I said, “I told Auntie Megan about ballet!”<br>\r\n<br>\r\nLooking at Mommy, Auntie Megan said, “When does she start?”<br>\r\n<br>\r\n“I haven’t actually signed her up yet.” Sitting next to Megan on the couch, Mommy said, “We ran into Madison and her mom at the mall.  Long story short, Madison’s doing ballet and wants to do it with Lizzie.”<br>\r\n<br>\r\n“That sounds like fun!” smiling, looking at me, Megan said, “You know Auntie’s first serious girlfriend was a ballet instructor.”<br>\r\n<br>\r\n“That’s right, I totally forgot about her.”  Looking at Megan, Mommy said, “I have to admit, I never really liked her that much.”<br>\r\n<br>\r\n“Oh please, you never liked any of my girlfriends.” Looking at Mommy, with a smirk, Megan said, “Why do you suppose that is?”<br>\r\n<br>\r\nClearly getting uncomfortable, Mommy said, “I’m sure I have no idea what you’re talking about.”<br>\r\n<br>\r\n“Oh please.” Smirking, Megan said, “What about all the times we took some Maui Wowie and had some fun?”<br>\r\n<br>\r\n“Oh come on, I was only experimenting.”<br>\r\n<br>\r\n“Uh-huh.” Pausing, Megan said, “You were on your way to a Nobel prize before you became interested in my brother.”<br>\r\n<br>\r\n“Can we not talk about this right now?” gesturing to me, Mommy said, “I don’t think this is appropriate around my 5-year-old daughter.”<br>\r\n<br>\r\nIt was then that I had a momentary memory loss – forgetting what Maui Wowie was.  Looking at Mommy, I said, “Mommy, what’s Maui Wowie?”<br>\r\n<br>\r\nBefore Mommy could stop her, Megan said, “It’s a college thing, sweetie.” Looking at me, she said, “You’ll find out about it when your roommate starts putting dryer sheets inside paper towel rolls.”<br>\r\n<br>\r\nAfter glaring at Megan, Mommy looked at me and said, “Lizzie, sweetie, can you go upstairs and play?”<br>\r\n<br>\r\n“Okay.” Jumping off the couch, I ran upstairs.<br>\r\n<br>\r\nI stopped at the top of the stairs when I heard Mommy yelling at Megan.  “Meg, I’d really appreciate if you didn’t talk about drugs in front of my 5-year-old daughter.”</span></div></div>",
            "created":1574139600,
            "id":2748787,
            "title":"Continue"
        },
        "11111111111111111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Aunt Megan Visits",
                "An Intruder",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Upstairs, I put my favorite stuffed animals in chairs, and \"we\" had a tea party. \"I'm so delighted you all could come,\" I said. \"What with the rain, and the scary thunder.\"<br>\r\n<br>\r\n\"Oh, heavens,\" said Mrs. Snifflepuss, the elephant, \"you know we wouldn't miss one of your parties for anything.\"<br>\r\n<br>\r\n\"That's right,\" said Mrs. Whiskertail, the rabbit. \"Remember when the Queen apologized for scheduling a royal wedding on the same day as your masked ball?\"<br>\r\n<br>\r\nI shook my head. \"My memory has been giving me problems lately. I used to know what Maui Wowie was, but today I had to ask Mommy. She got nervous and wouldn't tell me, and then I heard her say to Aunt Megan that it was drugs.\"<br>\r\n<br>\r\n\"If you ask me,\" said Mrs. Honeysnout, the teddy bear, \"what's really puzzling you is what else your Aunt Megan said.\"<br>\r\n<br>\r\nI thought back. \"What was that about 'speriments? I didn't know Mommy and Aunt Megan were scientists.\"<br>\r\n<br>\r\n\"It's not that kind of experimenting,\" Mrs. Honeysnout said. \"Mommy and Aunt Megan used to make each other happy. Now, looking back on that makes Mommy uncomfortable. She's scared of what it means about her.\"<br>\r\n<br>\r\n\"I guess that makes sense, \" I said.<br>\r\n<br>\r\n\"Of course it does. You didn't think you were actually sitting here and talking to a bear, a rabbit, and an elephant, did you?\"</span></div></div>",
            "created":1574139600,
            "id":2748982,
            "title":"Playtime"
        },
        "111111111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "During the Night",
                "The Next Morning",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>I was sitting in the corner of my room, playing with my dollhouse, when I heard a knock at the door.  Getting up, I opened the door and saw Auntie Megan standing there.  Looking at me, she said, “Hey kiddo, you mind if I come in?”<br>\r\n<br>\r\n“Okay.” Looking up at her, I said, “Do you want to play with my dolls?”<br>\r\n<br>\r\n“I’m afraid I can’t, kiddo.” Walking into the room, Megan said, “I think you and I should talk.”<br>\r\n<br>\r\nI stood in the doorway for a few seconds, watching as Auntie Megan sat down on my bed.  I remember a few instances, back before the wish, where she’d say the same thing to me.  Only back then she wasn’t my aunt, she was just some woman from Social Services.  She’d pull me aside and ask me, with my mom not in the room, if I was doing okay.  This time, I knew it was going to be different.<br>\r\n<br>\r\nWalking over to the bed, I hopped up and sat next to her.   Looking at her, I said, “What do you want to talk about?”<br>\r\n<br>\r\n“Well, for starters, I wanted to see how you were feeling about being a big sister.” Ruffling my hair, she said, “I understand you didn’t respond very well when you first found out.”<br>\r\n<br>\r\n“I’m fine now, but I <i>was</i> upset when Mommy and Daddy told me about the baby.”  Pausing, placing my hands on my lap, I said, <br>\r\n“I’m just worried they won’t pay attention to me after the baby is born.”<br>\r\n<br>\r\n“You have nothing to worry about there, kiddo; your folks will always have time for you.” With a smirk, Megan said, “If they don’t, then Auntie Amber and I will make up for it.”<br>\r\n<br>\r\nIt didn’t take long to realize Amber was the name of Megan’s wife and my aunt.  Looking at Megan, I said, “Are you excited about your baby?”<br>\r\n<br>\r\n“Very much so.” With a grin, Megan said, “Between you and me, I’m looking forward to not having to go to the bathroom every 20 minutes.”<br>\r\n<br>\r\n“Will I be able to see the baby?”<br>\r\n<br>\r\n“Of course you will!” smiling, Megan said, “You’re going to be his cousin; of course you’ll get to see him.”<br>\r\n<br>\r\n“Boys are icky.”<br>\r\n<br>\r\n“Tell me about it.” Looking at me, Megan said, “I can’t believe your mommy left me for one; they <i>are</i> icky.”<br>\r\n<br>\r\nI knew, deep down, what Megan was referring to; although it was a surprise to hear it – she and my mommy had been a couple in college.  “Were you and mommy close?  Like Madison and me?”<br>\r\n<br>\r\n“Not quite like Madison and you, but close.” Taking a breath, Megan said, “You see, your mommy and I used to make each other very happy; until I messed things up and she left me for your dad.”<br>\r\n<br>\r\n“Do you miss Mommy?”<br>\r\n<br>\r\nSmiling, Megan said, “I did miss her; until I met Amber.”<br>\r\n<br>\r\nAfter that, the two of us played for a few minutes until Megan had to leave.  Following her downstairs, I said goodbye to her and my grandparents.</span></div></div>",
            "created":1574226000,
            "id":2749364,
            "title":"Aunt Megan Visits"
        },
        "1111111111111111111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Next morning",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>After Mommy put me to bed, I realized I was thirsty. I knew I couldn't reach the water faucet in the bathroom, which left me only one option: the kitchen downstairs. I thought I might get into trouble if Mommy and Daddy caught me, so I tried to be quiet.<br>\r\n<br>\r\nWalking as quietly as I could, I made my way to the refrigerator. Opening the door just a crack, I took out a juice box. I took a sip, and felt better already.<br>\r\n<br>\r\nI could hear Mommy and Daddy talking in another room, and wondered what they were talking about. I decided to get closer and see.<br>\r\n<br>\r\n\"What's wrong?\" Daddy asked. \"You've been on edge all night. Did something happen with my folks?\"<br>\r\n<br>\r\n\"No,\" Mommy said.<br>\r\n<br>\r\n\"Megan?\"<br>\r\n<br>\r\n\"Kind of. She brought up our time in college.\"<br>\r\n<br>\r\n\"Brought back memories, huh?\"<br>\r\n<br>\r\n\"It got me thinking. I was so scared and angry when she told your folks we were together.\"<br>\r\n<br>\r\n\"And you ran to me in tears.\" Daddy was quiet for a while. \"Do you regret it?\"<br>\r\n<br>\r\n\"Maybe a little. Don't get me wrong, I love you, I love our daughter, and I love this one.\" Now it was Mommy's turn to be quiet. \"I guess it's got me to thinking about all the things that might have been. I even asked myself what it would have been like if I'd said yes to Ed Malloy, back in high school.\"<br>\r\n<br>\r\n<i>Ed Malloy.</i> Who was he? Then, it occurred to me: Ed Malloy was my daddy, back when I was Travis.<br>\r\n<br>\r\nI went back upstairs and to bed. As I got back under the sheet, I remembered my bedwetting problem, and hoped I wouldn't wake up to dirty sheets in the morning.</span></div></div>",
            "created":1574312400,
            "id":2749894,
            "title":"During the Night"
        },
        "11111111111111111111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Any hope I had of not wetting the bed was gone the moment I woke up the next morning.  Sitting up in bed, I noticed a large wet spot on my blanket.  <i>Uh-oh.</i>  Pulling the blanket off, I saw that the sheets and my nightie were soaked with pee.<br>\r\n<br>\r\nJumping out of bed, I tried to think of something to do before anyone found out. “Shame on you, Elizabeth Ann Richardson!”<br>\r\n<br>\r\nToo late. Mommy had seen.<br>\r\n<br>\r\nWalking over to my bed, pointing at the sheets, she said, “This is why we don’t let you drink anything before bed.” Grabbing the empty juice box from my nightstand, she said, “I hope it was worth sneaking into the kitchen for a drink.”<br>\r\n<br>\r\nI hadn’t felt this frightened by Mommy’s yelling since Aaron and Travis had thrown the football inside the apartment.  Looking at her, beginning to cry, I said, “I’m sorry Mommy, please don’t be mad at me.”<br>\r\n<br>\r\nSeeing me crying must’ve been too much for Mommy; because she also started crying.  Kneeling down, she pulled me into a hug.  “I’m not mad, sweetie; but you have to listen to Mommy and Daddy if we telling you can’t do something.”<br>\r\n<br>\r\nSurprised by Mommy’s crying, I said, “Please don’t cry, Mommy.”<br>\r\n<br>\r\n“I’m sorry sweetie; it’s just something with the baby.” Wiping her eyes, she said, “Let me get these sheets in the wash; then I guess we’ll have to give you a bath.  You wouldn't want to meet all those other boys and girls smelling like you do now, would you?\"</span></div></div>",
            "created":1574398800,
            "id":2750337,
            "title":"The Next Morning"
        },
        "111111111111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Meet & Greet, Pt 2",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>After getting me washed up, Mommy got me dressed in a dress with some flowers on it.  By that point Daddy had gotten home, having apparently gone to get some coffee and donuts.  I was walking down the stairs as he walked into the house.<br>\r\n<br>\r\n“I wish time would slow down.” Looking at me, he said, “I can’t believe my little girl is about to start Kindergarten.”<br>\r\n<br>\r\nWalking over, Mommy gave Daddy a kiss. “Just think – it wasn’t that long ago she was in diapers.”<br>\r\n<br>\r\nThe three of us got into the car and drove to the school.  I briefly wondered why Daddy was coming; until I remembered he was one of the Kindergarten teachers.  Looking at him, I said, “Daddy, will you be my teacher this year?”<br>\r\n<br>\r\n“No, kiddo, I won’t; because you’re my daughter, I can’t teach you.” Looking back at me, he said, “But Ms. Eliza is a wonderful teacher, you’ll like her.”<br>\r\n<br>\r\n<div align=\"center\">****************************</div><br>\r\n<br>\r\nIt was only once we reached the school that I really realized what was going on.  Instead of starting 10th Grade with Aaron, I was about to repeat Kindergarten – this time as a little girl.  Daddy went ahead to make sure his classroom was ready, leaving Mommy and me to walk into the cafeteria.<br>\r\n<br>\r\nIt had been almost 5 years since I’d been in the building; it didn’t look that much different since the last time I was here.  The lunchroom had the same tables; the only difference I saw was the carpet had been replaced.  The only new addition I saw was a small stage in the corner.<br>\r\n<br>\r\nAfter signing us in, Mommy and I walked through the crowd.  As we did so, I started to feel a little apprehensive.  There were about two dozen kids running around the room – which made me realize something.  Until now my only contact with a 5-year-old was with Madison; now I found myself in a situation where I’d be spending five hours a day, five days a week with other 5-year-olds.  Would I be able to keep myself from falling too far into Lizzie or would I lose Travis forever?<br>\r\n<br>\r\nI was pulled back to reality when I heard Mommy say.  “Look, sweetie, there’s Madison and Aaron.”<br>\r\n<br>\r\nLooking to where Mommy was pointing, I saw them standing over by the snack table.  Running over to them, I immediately hugged Madison.  After saying hello to Aaron, as I helped myself to a juice box, Madison said, “How are you doing?”<br>\r\n<br>\r\n“I’m doing good.” Sipping my juice box, I looked at Aaron and said, “Do you remember Mrs. Wilcox from Child Services?”<br>\r\n<br>\r\n“I remember her trying to take you away from your mom a few times.” Confused, Aaron said, “Why?”<br>\r\n<br>\r\n“It turns out she’s my daddy’s sister.” Pausing, I said, “She’s having a baby and she's Lebanese.”<br>\r\n<br>\r\nA confused look on his face, Aaron looked at me and said, “She’s Lebanese?”<br>\r\n<br>\r\nFor the second time in two days, I found myself struggling to find a word that I know I remembered.  Looking at Aaron, I said, \"What's that thing where girls like girls?\"<br>\r\n<br>\r\n\"Oh, you mean she’s a lesbian.”<br>\r\n<br>\r\n<i>Lesbian! That’s the word!</i> “Thank you, I couldn’t remember the word.” Throwing out the empty juice box, I turned to Aaron and said, “Could you do me a favor and look up Ed Malloy for me?”<br>\r\n<br>\r\n“I suppose I could do that.” Looking at me, Aaron said, “But why?  Who’s he supposed to be?”<br>\r\n<br>\r\n“I think he’s Travis’ daddy.”<br>\r\n<br>\r\nBefore we could talk further, I heard a woman’s voice say, “We’re about to start; if the children could have a seat in front of the stage.”</span></div></div>",
            "created":1574485200,
            "id":2750768,
            "title":"Meet & Greet, Pt 1"
        },
        "1111111111111111111111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>After all the kids were seated in front of the stage, an older woman walked up to the microphone. “Hello children; my name is Mrs. Collins, I’m the school principal here at Beaumont Elementary.”  Looking around the room, she said, “I’m sure most of you are nervous about starting Kindergarten, and that’s alright.  Over the next year, you’ll learn many new things and make new friends.”<br>\r\n<br>\r\nI found myself looking around at all the other kids; finding it amusing that before last week, I probably never would have met any of them.  Now, due to a mysterious stone, I was likely going to be with them through High School.  Madison must’ve noticed me looking around.  Turning to me, she said, “Are you okay, Lizzie?”<br>\r\n<br>\r\n“Uh-huh.” Looking at her, I said, “I’m just thinking about how I’m starting school all over again.”<br>\r\n<br>\r\nReaching her hand towards me, she said, “At least we’ll have each other, right?”<br>\r\n<br>\r\nAs I took Madison’s hand, I came to another realization.  Thanks to her wish; as far as everyone knew, the two of us were best friends.  We’d be spending a lot of our time together over the next year.  Looking at her, I said, “Of course, we’ll have each other.”<br>\r\n<br>\r\nWe both turned our attention back to the principal, who’d just finished talking about some of what we’d be learning this year.  I watched as Daddy and a woman walked onto the stage and stand behind Principal Collins.  “Now before I hand you off to your teachers, I want to wish all of you luck.”<br>\r\n<br>\r\n<div align=\"center\">**************************</div><br>\r\n<br>\r\nIt took about 10 minutes for all the kids to be matched up with their teachers.  Although I remembered Daddy saying something a few days ago, I was relieved that Madison and I were in the same class.  The two of us were standing towards the center of the group when the woman, who looked to be about Mommy and Daddy’s age, turned to face us.<br>\r\n<br>\r\nPushing her glasses up onto her nose, she said, “Hello boys and girls; I’m Ms. Eliza and I’ll be your teacher.” Looking at us, she said, “I’m sure we’re all going to have a good time together, won’t we?”<br>\r\n<br>\r\nAll 15 of us, in unison, said, “Yes, Ms. Eliza!”<br>\r\n<br>\r\nWith that, Ms. Eliza got all of us into a single file line and led us out of the cafeteria.  It was a short walk down the hall to the kindergarten wing.  Opening a door, she gestured for all of us to go inside.  As we walked into the room, both Madison and I looked around with awestruck expressions on our faces.  The room was huge, at least from my perspective; with 3 tables situated in the center, each with 5 chairs around them.  I also saw a play corner with lots of toys and a fairly extensive library of children’s books.  Looking at me, Madison said, “This is so cool!”<br>\r\n<br>\r\n“It’s way better than the last time I was in Kindergarten.”<br>\r\n<br>\r\nIt was clear from the chorus of ‘wow’ and ‘cool’ that our classmates shared our enthusiasm.  Making her way through the jumble of kids, Ms. Eliza stopped in front of the chalkboard.  “Welcome to your classroom, boys and girls.  As you can see, there are many things we’ll be covering this year.” Smiling, she said, “Now why don’t we all take a seat; then we’ll go around the room and introduce ourselves.”<br>\r\n<br>\r\nWanting to stick together, Madison and I quickly grabbed two seats at the nearest table.  We were soon joined by two boys and another girl.  The girl, for some reason, stuck out to me.  She wore glasses like Ms. Eliza and it was clear she wasn't quite used to them. “Hi.” Offering my hand, I said, “I’m Lizzie, and this is Madison.”<br>\r\n<br>\r\n“It’s nice to meet you, I’m Rachel.” Shaking my hand, she said, “I really like your dress.”<br>\r\n<br>\r\nAfter that, we listened as everyone else introduced themselves.  As I sat at the table, looking around the room, I found myself thinking - <i>Maybe being in kindergarten again won’t be as bad as I thought.</i></span></div></div>",
            "created":1574485200,
            "id":2750838,
            "title":"Meet & Greet, Pt 2"
        },
        "11111111111111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "At the Doctor",
                "Later On",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>We stayed in the classroom for around an hour before Ms. Eliza brought us back to the cafeteria.  As we walked into the room, Madison and I said goodbye to Rachel.  I watched as she ran to a nearby table and hugged two men.  <i>I wonder if they’re lesbians like Auntie Megan.</i><br>\r\n<br>\r\nTurning my attention away from Rachel, I followed Madison as we made our way through the crowd.  It didn’t take long for us to find Mommy talking Aaron and Madison’s Mom.  The two of us ran up to the group, big smiles on our faces.  Turning to us, <br>\r\nMommy said, “Hello girls, how was it with Ms. Eliza?”<br>\r\n<br>\r\nIn unison, we said, “Great!”<br>\r\n<br>\r\n“Did you make any new friends?”<br>\r\n<br>\r\n“Uh-huh; her name’s Rachel and she gots glasses like Ms. Eliza.”<br>\r\n<br>\r\nThe two of us answered some more questions about what happened; some of whom came from Aaron.  I figured he was trying to see if I’d regressed more than I already have.  I had a little, but I didn’t really care.  Suddenly we heard someone behind us clear their throat.  We all turned around to find Rachel standing there with the two men I’d seen her hug moments earlier.<br>\r\n<br>\r\nReaching out his hand, one of them said, “My name is Thomas Anderson, and this is my husband Anthony; we’re Rachel’s parents.”<br>\r\n<br>\r\n“It’s nice to meet you both.”  Shaking their hands, Mommy said, “I’m Melanie and this is Grace and Aaron.”<br>\r\n<br>\r\nAfter introductions had been made, Anthony said, “It’s nice to see another same-sex couple here; Thomas and I were wondering if we would.”<br>\r\n<br>\r\n“Oh sorry, we’re not a couple.” Blushing, Mommy said, “My husband is the other Kindergarten teacher.”<br>\r\n<br>\r\n“Oh my, I’m so sorry.” Wincing, Anthony said, “I saw the two of you talking, and I just assumed you were a couple.”<br>\r\n<br>\r\n“Nope, we’re not.” Smiling, Mrs. Sullivan said, “We’re just close friends; Lizzie and Madison have been friends practically since they were born.”<br>\r\n<br>\r\n“Rachel couldn’t stop talking about them; we’re new to the area and she was afraid she wouldn’t make any friends.” Looking at Madison and me, Thomas said, “Thanks, girls, for making our daughter feel welcome.”<br>\r\n<br>\r\n“You can never have enough friends.”<br>\r\n<br>\r\nAfter that, the adults went back to talking with each other while Aaron kept an eye on us kids.  A few minutes went by before we all realized we had to use the bathroom.  Aaron escorted us to the bathroom and offered to wait outside.  Before I could go in, he stopped me and pulled me aside.  Looking at me, he said, “So, how was it?”<br>\r\n<br>\r\n“How was what?”<br>\r\n<br>\r\n“Don’t play stupid with me, Travis.” Sighing, Aaron said, “What was it like being around all those kids?”<br>\r\n<br>\r\n“First off, my name’s Lizzie.” Pausing, I said, “Second, it wasn’t that bad.  I actually think I’m going to enjoy kindergarten.”<br>\r\n<br>\r\n“You’re joking, right?” With an incredulous look, Aaron said, “We were both supposed to be starting the 10th grade; now you’re back in Kindergarten.”<br>\r\n<br>\r\n“I’m not joking, Aaron.” Sighing, I said, “Like it or not, I have the emotional maturity of a 5-year-old; Kindergarten is the best thing for me right now.”<br>\r\n<br>\r\n“If you say so.” Sighing, Aaron said, “I just hope you’ll be your old self again once we undo the wish.”<br>\r\n<br>\r\nI didn’t want Aaron to know that I was beginning to have serious doubts about undoing the wish.  “One can only hope, right.”  Looking at him, I said, “Now if you don’t mind, I really have to go potty.”<br>\r\n<br>\r\n<div align=\"center\">*********************</div><br>\r\n<br>\r\nWe stayed at the school for another twenty minutes or so; not before Mommy and Mrs. Sullivan made plans for Madison and me to have a play date with Rachel this weekend.  After saying goodbye to Aaron and Madison, Mommy put me in the booster seat.  As Mommy got in the car, I realized Daddy wasn’t there.  “Where’s Daddy?”<br>\r\n<br>\r\n“He has to stay for a little while.” Looking at me, Mommy said, “But don’t worry sweetie, we’ll pick him up after we go to the doctor’s office.”<br>\r\n<br>\r\nI don’t know why, but hearing the term <i>doctor’s office</i> sent chills down my spine.  Looking at Mommy, I said, “Why are we going to the doctor?”<br>\r\n<br>\r\n“The school requires us to make sure you’re properly vaccinated, sweetie.” Pausing, Mommy said, “I know you don’t like shots; but if you’re brave, we’ll get some ice cream afterward.”<br>\r\n<br>\r\nI tried my best to hide my anxiety – Travis never liked shots and it was clear that Lizzie didn’t like them either.  Looking at Mommy, I said, “O-Okay mommy.”</span></div></div>",
            "created":1574485200,
            "id":2750860,
            "title":"Meet & Greet, Pt 3"
        },
        "111111111111111111111111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Continue",
                "At Home",
                "The Next Day",
                "Skip Ahead to the Weekend",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, good afternoon!\" said the doctor, an older lady with big glasses. \"You must be Lizzie!\" Turning to Mommy, she asked, \"And what brings Lizzie in this afternoon?\"<br>\r\n<br>\r\n\"Making sure her vaccinations are up to date,\" Mommy answered. \"I should warn you, she's not a big fan of needles.\"<br>\r\n<br>\r\n\"Not to worry, I've dealt with many children who didn't like needles. Step one.\" She pulled out a tin that was full of suckers. \"See them all? And so many flavors, too! Why, I'll bet that you could find your favorite in here, no trouble at all, right?\"<br>\r\n<br>\r\nI nodded. I could already see my favorite.<br>\r\n<br>\r\n\"Well, I'll tell you what let's do: if you can be a brave little girl while we give you your shots, then you can reach in and take any sucker you want. Agreed?\"<br>\r\n<br>\r\nI <i>had</i> to agree. I wanted that sucker, even more than I was scared of needles.<br>\r\n<br>\r\n\"Alright. Now, we go on to step two.\" A nurse sat down in front of me. \"The nurse is going to read a short story, Lizzie, and I would like for you to pay close attention as she reads. Can you do that, Lizzie?\"<br>\r\n<br>\r\nCould I ever!  I sat and listened as she read her story.<br>\r\n<br>\r\nWhen she closed her book, I said, \"Okay, I'm ready for my shots now.\"<br>\r\n<br>\r\n\"Are you? Well, that's too bad, because I already gave you your shots.\"<br>\r\n<br>\r\nMy eyes widened.<br>\r\n<br>\r\n\"It's true. I gave you your shots while you were listening to the story.\" She brought back the tin of suckers. \"Here. I'm a woman of my word. You can take two.\"<br>\r\n<br>\r\nAs soon as I had two cherry suckers, Mom took me out of the doctor's office, and to the ice cream shop, where I got a big hot fudge sundae. Beat <i>that,</i> Aaron.</span></div></div>",
            "created":1574571600,
            "id":2751296,
            "title":"At the Doctor"
        },
        "1111111111111111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Later On",
                "The Next Morning",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>I had to use the bathroom after having my sundae, so Mommy waited for me outside while I went.  After a few minutes went by, I walked outside just as she got off the phone.  Looking at me, she said, “Sweetie, how would you feel if we stopped by the Ballet School on our way to pick up daddy?”<br>\r\n<br>\r\nMaybe it was the sugar, or maybe it was the adrenaline from the doctor’s office – but I started jumping up and down.  “Yes!!”<br>\r\n<br>\r\nIt was only about a 5-minute drive to Ms. Benson’s Dance Academy.  As we walked inside the building, I caught a glimpse of a few girls having a lesson in a nearby room.  From what I could tell, they looked to be close to Travis’ age.  <i>Maybe this won’t be so bad; I get to be around pretty girls.</i><br>\r\n<br>\r\nI held Mommy’s hand as she walked up to a nearby counter.  After a moment, an older woman came out of a nearby doorway.  “Hello, what can I do for you today?”<br>\r\n<br>\r\n“I was wondering if you had any available spots in your beginner’s ballet class?” gesturing to me, Mommy said, “My daughter wants to learn ballet.”<br>\r\n<br>\r\n“It just so happens that we have one more spot available.” Turning to me, she said, “What might your name be, little one?”<br>\r\n<br>\r\nI was suddenly overcome with shyness.  After a moment, I said, “Lizzie.”<br>\r\n<br>\r\n“It’s nice to meet you, Lizzie.” Smiling, she said, “I’m Gloria, and this is my dance academy.”<br>\r\n<br>\r\n<div align=\"center\">************************</div><br>\r\n<br>\r\nI was sitting in the waiting area with Mommy, reading a children’s book while she filled out the paperwork.  At least I was attempting to read it – I suddenly found myself having trouble with some of the bigger words.<br>\r\n<br>\r\nI was just about to give up in frustration when I heard someone call my name.  “Lizzie!”<br>\r\n<br>\r\nLooking up from the book, I watched as Rachel walked out of a nearby room with one of her daddy’s.  Putting the book down, I ran over and hugged her, “Hi Rachel!”<br>\r\n<br>\r\nIt took me a moment to realize the man with her was her father Thomas.  Looking at me, he said, “Hello Lizzie, it’s nice to see you again.”<br>\r\n<br>\r\nI was suddenly overcome with shyness again.  I was saved from having to say anything when Mommy walked over.  “Hello <br>\r\nRachel, Hello Thomas.”<br>\r\n<br>\r\n“Hello again, Melanie.” Looking at Mommy, Thomas said, “What brings you two here?”<br>\r\n<br>\r\n“I’m just signing Lizzie up for the beginner’s ballet class.” Pausing, Mommy said, “What about you two?”<br>\r\n<br>\r\n“I was just signing Rachel up as well; I guess our girls took the last two spots.”<br>\r\n<br>\r\n“I guess so.” Looking around, Mommy said, “Where’s Anthony?”<br>\r\n<br>\r\n“He got called into work; there was a car crash on the highway.”<br>\r\n<br>\r\n“I just realized I never asked what you both did for a living.”<br>\r\n<br>\r\n“Well I’m an interior decorator; I just started as the manager of Brightburn Interiors.  My better half works as an EMT.” Smiling, Thomas said, “How about you?  What do you do?”<br>\r\n<br>\r\n“Well, as I said at the Meet &amp; Greet, my husband Peter is one of the Kindergarten teachers.” Smiling, Mommy said, “Myself, I’m a reporter for the Channel 7 News.”<br>\r\n<br>\r\n“Now that you mention it, I remember watching your pregnancy announcement,” turning to me, Thomas said, “Are you excited to be a big sister, Lizzie?”<br>\r\n<br>\r\nWhen I didn’t respond again, Mommy said, “I think she’s a little overwhelmed with all the new people she’s met today.” Pausing, she said, “She didn’t take the news well at first, but I think she’s coming around.<br>\r\n<br>\r\nAfter talking for a few minutes, Thomas said, “We should probably get going; Rachel is very excited to try on her ballet outfit when we get home.”<br>\r\n<br>\r\nIt was then that I realized he was carrying a wrapped up ballet outfit.  Turning to Mommy, I said, “Mommy, can I wear mine when we get home?”<br>\r\n<br>\r\n“Of course sweetie.” Turning to Thomas, Mommy said, “It was nice seeing you both again.”<br>\r\n<br>\r\n“It was nice to see you again too, Melanie.”</span></div></div>",
            "created":1574658000,
            "id":2751790,
            "title":"Signing up for Ballet"
        },
        "11111111111111111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>It had been almost 2 hours since we all got home.  Almost immediately I ran upstairs to change into my new ballet outfit.  A small part of me was a little disturbed by how excited I was – but a growing part of me didn’t care.  As I put the package on my bed, I looked at what it contained; a pair of ballet slippers and a pink leotard with a little skirt around the bottom.<br>\r\n<br>\r\nI spent the next few hours running around the house; doing my best attempts at some ballet moves.  There were several times where I slipped but I quickly got back up.  I was up in my room, having a tea party when I heard the doorbell ring.<br>\r\n<br>\r\nWalking out of my room, I went to see who was at the door.  I stopped around the corner when I heard Mommy said, “Hello Aaron, what can I do for you?”<br>\r\n<br>\r\n“Hi, Mrs. Richardson.” Pausing, Aaron said, “I was coming back from practice, and thought I’d come to see how Lizzie was doing.  I know she doesn’t particularly care for the doctor’s office.”<br>\r\n<br>\r\nPeaking around the corner, I was surprised to see Aaron wearing what looked to be a football uniform.  <i>What’s going on, Aaron doesn’t play football.</i><br>\r\n<br>\r\n“Well aren’t you sweet; she actually did very well.” Pausing, Mommy said, “She’s upstairs in her room.”<br>\r\n<br>\r\n<i>Uh-oh.</i>  Quickly running back to my room, I debated whether or not to change out of my ballet outfit.  I could hear footsteps coming up the stairs; but before I could make a decision, I saw Aaron walk into my room.  He stopped in his tracks when he saw me in the ballet outfit.<br>\r\n<br>\r\nLooking at Aaron, feeling a little embarrassed, I said, “How do you like my outfit?”</span></div></div>",
            "created":1574658000,
            "id":2751794,
            "title":"Back Home"
        },
        "111111111111111111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Later On",
                "The Next Morning",
                "A Few Days Later",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Aaron was clearly taken aback by my outfit; I could tell from the shocked look on his face.  I was starting to feel a little insecure – worried that I didn’t look as pretty as I thought I did.  When Aaron hadn’t responded for a few moments, I said, “Don’t I look pretty?”<br>\r\n<br>\r\n“Yes.” Looking at me, Aaron said, “You look v-very pretty, Lizzie.”<br>\r\n<br>\r\n“Thanks!” giggling, I grabbed his hand and pulled him into my room.  “So what’s with all that stuff?”<br>\r\n<br>\r\n“Oh this?” gesturing to his football gear, Aaron said, “It turns out that I’m on the football team now.”<br>\r\n<br>\r\n“Really?” looking at him, I said, “You suck at football, why would they let you on the team?”<br>\r\n<br>\r\n“I guess I’m good at it in this reality.” Shrugging, Aaron said, “I saw some photos at the house; apparently I’ve been playing youth football since I was 7 years old.”<br>\r\n<br>\r\n“So I’m born a girl instead of a boy; suddenly you’re playing football?”<br>\r\n<br>\r\n“That’s not all.” Looking at me, Aaron said, “With Travis...out of the picture, it seems my best friend is Colin Sheppard; who’s the Quarterback.”<br>\r\n<br>\r\nColin Sheppard, at least prior to the wish, had been kind of a geek.  It was strange to think that my being a girl now had affected so many people’s lives.  Walking over to my tea set, I said, “Do you have time for a tea party?”<br>\r\n<br>\r\n“As fun as that sounds, I don’t have the time.” Looking at me, Aaron said, “I just stopped by to see how you were doing; I know you used to hate shots and figured it was the case now.”<br>\r\n<br>\r\n“Actually the doctor did a good job distracting me; a nurse read me a story and before I knew it, I’d gotten all my shots.” Rubbing my arm, I said, “I am feeling a little sore though.”<br>\r\n<br>\r\n“I’m glad to hear the shots didn’t bother you, but that’s not what I meant.” Looking at me, Aaron said, “I was surprised to see you so excited to wear that outfit.”<br>\r\n<br>\r\n“Is it a crime that I want to try it out before ballet?”<br>\r\n<br>\r\n“No, I...it’s just the Travis I knew would never be caught dead wearing something like that.”<br>\r\n<br>\r\n“This would never fit Travis; it’s too small for him, silly.”<br>\r\n<br>\r\nKneeling down to my level, Aaron looked at me and said, “Answer this question for me; do you actually like the outfit, or are you just doing this because you’re a little girl?”<br>\r\n<br>\r\n“Does it really matter?” taking a breath, I said, “I like this outfit because it makes me feel like a princess.”<br>\r\n<br>\r\n“Can you stop talking like that!” getting agitated, Aaron said, “You may look like a 5-year-old girl, but that doesn’t mean you have to act like one.  You’re a teenage boy for god’s sake.”<br>\r\n<br>\r\n“I’m not an icky, booger-faced boy!” starting to get upset, I said, “I’m a pretty little girl!”<br>\r\n<br>\r\n“Dammit Travis; you’re not supposed to be a little girl!”<br>\r\n<br>\r\n“You said a bad word!” making my way towards the door, I said, “I’m going to tell my mommy!”<br>\r\n<br>\r\nBefore I could make it to the door, Aaron stood in my way.  “Are you seriously telling me dammit is a bad word?” looking at me, he said, “Come on Travis, your favorite word has an M and an F in it!”<br>\r\n<br>\r\n“My name’s not Travis!” trying to get past Aaron, I said, “Stop calling me Travis!”<br>\r\n<br>\r\n“That’s it, I’ve got to put a stop to this before you completely become a girl.” Going to open the door, Aaron said, “I’ve got to find another stone so I can put things back the way they were.”<br>\r\n<br>\r\nI don’t know whether it was out of fear or just exhaustion; frankly, it could have been both.  Before Aaron could even start to turn the doorknob, I fell to the floor and started crying.  It didn’t take long for Mommy to come running into the room.  Seeing me in tears on the floor, she turned to Aaron and said, “What happened?”<br>\r\n<br>\r\n“I don’t know, we were just talking.” Pausing, Aaron said, “I must’ve said something wrong because suddenly she started crying.”<br>\r\n“I’m sure it wasn’t anything you did, Aaron.” Picking me up off the floor, Mommy said, “It’s been a pretty eventful day, I think she’s just tired.”<br>\r\n<br>\r\nI didn’t know what it would accomplish, but part of me wanted to get Aaron in trouble.  Turning from him to mommy, I said, “Mommy, Aaron said a bad word!”<br>\r\n<br>\r\nMommy turned to Aaron with a shocked look on her face.  “What did you say, Aaron?”<br>\r\n<br>\r\n“I may have accidentally said the word dammit.” Pausing, he said, “I’m sorry, it just slipped out.”<br>\r\n<br>\r\n“You should be more careful Aaron; Lizzie’s at an impressionable age.\" heading towards my bed, Mommy said, \"Her father and I don’t want her to repeat that kind of language.”<br>\r\n<br>\r\nAs Mommy turned to carry me over to the bed, Aaron glared at me.  Walking up behind her, Aaron said, “I’m sorry, Mrs. Richardson, it won’t happen again.”<br>\r\n<br>\r\n<div align=\"center\">************************</div><br>\r\n<br>\r\nAlthough Aaron left a few minutes later, I was still worried about his wanting to use the stone.  I didn’t want to lose this life; even if it meant being a girl.  After getting me out of the ballet outfit and into some pajamas, Mommy put me down for a nap.</span></div></div>",
            "created":1574744400,
            "id":2752101,
            "title":"A Confrontation"
        },
        "1111111111111111111111111111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "A Few Days Later",
                "Later On",
                "During the Night",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>After my nap, I had a bunch of things going through my head. Luckily, I had just the way to work things out: a tea party.<br>\r\n<br>\r\n\"I have some news to share,\" I said. \"I'm taking ballet lessons.\" I showed them what I'd learned.<br>\r\n<br>\r\n\"<i>Brava!</i>\" said Mrs. Honeysnout. \"I predict a command performance before the crowned heads of Europe!\"<br>\r\n<br>\r\n\"Your life is simply amazing,\" said Mrs. Whiskertail.<br>\r\n<br>\r\n\"So many things are different now,\" I said. \"For some reason, me not being Travis means Aaron and Colin are football players. Can you explain it?\"<br>\r\n<br>\r\n\"And he wants to throw that away?\" asked Mrs. Snifflepuss.<br>\r\n<br>\r\n\"He doesn't like me being a little girl.\"<br>\r\n<br>\r\n\"And he intends to change that as soon as he can,\" said Mrs. Whiskertail, \"doesn't he?\"<br>\r\n<br>\r\n\"As soon as he finds another wishing stone. How can I stop him?\"<br>\r\n<br>\r\n\"There's only one way,\" Mrs. Whiskertail said. \"When he finds a stone, you have to get it before he can use it.\"<br>\r\n<br>\r\n\"And then?\"<br>\r\n<br>\r\n\"You have to make a wish of your own. One that will keep him from trying to wish you into a boy.\"<br>\r\n<br>\r\n\"I don't want to hurt him, Mrs. Whiskertail.\"<br>\r\n<br>\r\n\"You're not going to wish to hurt him. Just make a wish that will make sure that, when he <i>can</i> make that wish, he won't <i>want</i> to anymore.\"</span></div></div>",
            "created":1574744400,
            "id":2752213,
            "title":"Later On"
        },
        "11111111111111111111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>A few days had passed since my argument with Aaron; it was now Saturday.  Almost everyone was in the backyard for the end of the summer BBQ that Mommy and Daddy were throwing.  I spent most of the first 30 minutes or so hanging around my grandparents.<br>\r\n<br>\r\nIt was strange being around Mommy’s parents; I’d only ever heard nasty things about how they disowned Mommy after she’d gotten pregnant with Travis.  Instead of wanting nothing to do with mommy and me; now they were spoiling me.  I guess it helped that, at least for now, I was their only grandchild.<br>\r\n<br>\r\nI spent some more time with Daddy’s parents too; since I hadn’t had the opportunity to see them much earlier in the week.  Poppa, as he liked to be called, was showing me some magic tricks when we heard the gate open behind me.  Turning around, I saw Auntie Megan walking over with another woman following behind her.  It didn’t take a genius to realize that the other woman was Auntie Amber.<br>\r\n<br>\r\nJumping off of Poppa’s lap, I ran over to them; barging into Auntie Megan harder than I’d meant to.  “Oof.” Kneeling down, Auntie Megan said, “Before careful sweetie, you don’t want to hurt the baby.”<br>\r\n<br>\r\n“Sorry, Auntie Megan.”<br>\r\n<br>\r\nAfter giving me a kiss, Megan got up and walked over to the adults; leaving me alone with Auntie Amber.  I was a little awkward around her; knowing next to nothing about her except that she was Auntie Megan’s wife.  She was very pretty; tall with brown hair.  <br>\r\n“Hi kiddo, are you excited for your first day of school on Monday?”<br>\r\n<br>\r\n“Uh-huh.” Looking at her, I said, “I’m also ‘cited about ballet.”<br>\r\n<br>\r\n“Your mommy told me you were doing that.” Smiling, Amber said, “I’m sure you’re going to do great.”<br>\r\n<br>\r\n<div align=\"center\">*********************</div><br>\r\n<br>\r\nAaron and Madison arrived with their parents a short time later.  Once everyone was settled, Daddy stepped in front of everyone.  “Melanie and I want to thank you all for coming.” Gesturing to Madison and me, he said, “It seems like only yesterday that these adorable girls were in diapers, but come Monday they’re going to be starting Kindergarten.”<br>\r\n<br>\r\nMadison and I stood there, feeling a little embarrassed, as everyone stared at us.  Turning his attention to the Sullivan’s, daddy said, “Kevin, Diane; who would’ve thought, 7 years ago, when I was assigned Aaron’s 2nd-grade class as a student teacher, that we’d become such good friends.” Smiling, Daddy said, “I love Aaron and Madison like they’re my own kids; just as you love Lizzie.”<br>\r\n<br>\r\nDaddy wrapped up his little speech a moment later; as everyone gave a toast.  Once that was finished, Madison and I ran over to the little playhouse.  I was about to go inside when Aaron walked over and said, “Lizzie, can I come in?”<br>\r\n<br>\r\n“Uh-Uh.” Trying my best to look angry, I said, “There are no icky boys allowed in my playhouse.”<br>\r\n<br>\r\n“Lizzie, please...”<br>\r\n<br>\r\n“No boys!”<br>\r\n<br>\r\nAfter Aaron walked off, defeated, I went inside and closed the door.  Looking at me, Madison said, “So, uh, what’s going on between Aaron and you?”<br>\r\n<br>\r\nI proceeded to explain what happened a few days prior.  When I was finished, I said, “I don’t want Aaron to undo the wish.” Pausing, I said, “I like being a girl.”<br>\r\n<br>\r\n“You do?”<br>\r\n<br>\r\n“Yeah.” Pausing, I said, “Sometimes my boy mind sneaks through, but most of the time I’m thinking and acting like a little girl.”<br>\r\n<br>\r\n“What if Aaron finds a stone and undoes the wish anyway?”<br>\r\n<br>\r\n“Mrs. Whiskertail suggested that I make my own wish.”<br>\r\n<br>\r\n“Who’s Mrs. Whiskertail?”<br>\r\n<br>\r\n“She’s my stuffed animal rabbit.” Looking at Madison, I said, “I, uh, talk to her and the other stuffed animals.”<br>\r\n<br>\r\nI was worried Madison would think I was crazy.  Instead, she looked at me and said, “Can I talk to them too?”<br>\r\n<br>\r\n“Sure!” grabbing Madison’s hand, I said, “Let’s go up to my room.”<br>\r\n<br>\r\nMadison and I ran out of the playhouse; making our way towards the kitchen door.  On our way, I saw that Becky had shown up; she was currently in a passionate kiss with Aaron.  As I ran past them, I could hear Mommy said, “Aaron, Becky, could you both tone it down a little around the kids?”<br>\r\n<br>\r\nRunning upstairs, Madison and I ran into my room only to stop in our tracks when we saw the psychic lady standing by my bed.</span></div></div>",
            "created":1574830800,
            "id":2752613,
            "title":"The Barbeque"
        },
        "111111111111111111111111111111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "The Aftermath",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, there you are, Lizzie,\" Madame Burke said, as if her being in my bedroom was the most natural thing in the world.<br>\r\n<br>\r\n\"What are you doing in my room?\" I demanded.<br>\r\n<br>\r\n\"You have a <i>great destiny</i> before you, Elizabeth Richardson,\" she replied. \"Come with me, and I shall prepare you.\"<br>\r\n<br>\r\n\"I've already got a density!\" I shot back, not caring that I messed up the word. \"I'm gonna be a ballerina!\"<br>\r\n<br>\r\n\"You are to bring forth the Messiah!\"<br>\r\n<br>\r\n\"I don't wanna bring <i>anybody</i>, forth or fifth or anything!\"<br>\r\n<br>\r\n\"Is that a fact?\" she asked, digging through her robes. \"Fortunately, I have a way to... persuade you.\"<br>\r\n<br>\r\nShe pulled out her hand, which was holding... <br>\r\n<br>\r\n\"A wishing stone!\"<br>\r\n<br>\r\nThe old woman raised the stone to her lips, and I was scared of what she might wish... <br>\r\n<br>\r\n... Until she screamed in agony, as Madison sank her teeth into Madame Burke's leg. Even better, the bite made her drop the wishing stone, which I kicked away.<br>\r\n<br>\r\nBy this time, somebody must have heard something, because Mommy came into my room, followed by Aaron. \"Lizzie! Lizzie, are you okay?\" she asked, giving me the hug of my life.<br>\r\n<br>\r\n\"What happened, Aunt Mel?\" Aaron asked.<br>\r\n<br>\r\n\"That - \" She looked around the room. We all did. \"I thought I saw an old woman in here.\"<br>\r\n<br>\r\nMadame Burke was gone.</span></div></div>",
            "created":1575090000,
            "id":2753982,
            "title":"Continue"
        },
        "1111111111111111111111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Cops Arrive",
                "Later On",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>A few minutes passed before everyone else came running upstairs; before too long there were over a dozen people in crammed into my tiny bedroom.  Madison and I clung to both our mommy’s; as the two of us were rather shaken up by what just transpired.<br>\r\nWalking into the room, the phone in hand, Daddy said, “I’m on the phone with the Police; they want to know if you have a description of the woman.”<br>\r\n<br>\r\nMommy proceeded to describe Madame Burke to Daddy.  Once she finished, Mommy said, “How could she sneak in here without any of us knowing?”<br>\r\n<br>\r\n<i>She has a magic stone; I’m thinking she can do anything.</i>  Looking at Mommy, I said, “Is the scary lady going to come back?”<br>\r\n<br>\r\n“Of course not, sweetie.” Giving me a kiss on the forehead, she said, “We’ll make sure she never comes back to harm you.”<br>\r\n<br>\r\nAfter getting off the phone, Daddy said, “The cops will be here in a few minutes.” Kneeling down, he looked at Madison and me.  <br>\r\n<br>\r\n“Girls, did she say anything before the screaming started?”<br>\r\n<br>\r\nMadison was still too shaken up to answer, but I managed to calm myself.  Looking at Daddy, I said, “She said I had a great density; that I was going to bring forth the messy.”<br>\r\n<br>\r\nDaddy and Mommy shared quizzical looks with each other; clearly Daddy wasn’t satisfied with my answer.  Looking at him, Mommy said, “A strange woman was just in her room, Peter; I don’t think that interrogating our daughter is the best thing right now.”<br>\r\n<br>\r\n“I’m not interrogating her, Melanie.” Sighing, Daddy said, “I just want to know everything I can.”<br>\r\n<br>\r\nWhile the other adults were talking, Aaron stepped forward and said, “Mr. Richardson, perhaps I can try talking to them?”<br>\r\n<br>\r\n“Well, it’s worth a shot.” Getting up, Daddy said, “Aaron, we’ll be downstairs waiting for the cops.”<br>\r\n<br>\r\nAfter everyone left the room, Aaron closed the door.  Turning his attention back to us, he said, “Would you two like to tell me what’s going on here?”<br>\r\n<br>\r\nI didn’t want Aaron knowing I talked with my stuffed animals, so I had to fib a little.  “Madison and I were coming up here to...to play with my stuffed animals.”  Pausing, I said, “We got up here and found Madame Burke waiting by my bed.”<br>\r\n<br>\r\n“She said Lizzie had some destiny or something; that she was going to bring forth the Messiah.” Looking at Aaron, Madison said, <br>\r\n“Lizzie refused and then she took out a stone; saying she had a way to persuade her.”<br>\r\n<br>\r\n“Wait, she had a stone?”<br>\r\n<br>\r\n“Uh-huh.” Gesturing to my bed, I said, “After Madison bit her, she dropped it and I kicked it under my bed.”</span></div></div>",
            "created":1575176400,
            "id":2754295,
            "title":"The Aftermath"
        },
        "11111111111111111111111111111111111111111111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "The Wishing Stone",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>The police finally arrived about 20 minutes after Daddy called them.  There were two of them; a young man in his 20s and a middle-aged woman.  While the young man was downstairs, the woman came into my room; where I was waiting with Mommy, Aaron and Madison.<br>\r\n<br>\r\nTaking one look around the room, the lady turned to everyone and said, “I’d like to speak with the child please; in private.” <br>\r\nSighing, she said, “The crime scene is well and truly trampled, so please give me the courtesy of allowing us to speak.”<br>\r\n<br>\r\nI guess trampling a crime scene was a bad thing, because everyone left my room with their heads down.  Once everyone was out of the room, the officer closed the door and came over to me.  Kneeling down, she smiled at me and said, “Hello sweetie, my name’s Doris.  What’s yours?”<br>\r\n<br>\r\n“Elizabeth Ann Richardson.” Smiling, I said, “But everyone calls me Lizzie.”<br>\r\n<br>\r\n“It’s nice to meet you, Lizzie.”  Pausing, Doris said, “So what do you like to do in your room?” <br>\r\n<br>\r\n\"I like tea parties.\" I showed her the table. \"Would you like to join me?\"<br>\r\n<br>\r\n\"I'd be delighted.\"<br>\r\n<br>\r\nI rearranged the chairs so Doris had room to kneel. Gesturing to each of the animals, I introduced them. \"This is Mrs. Snifflepuss, Mrs. Whiskertail, and Mrs. Honeysnout. Ladies, this is Doris.\"<br>\r\n<br>\r\nI knew Doris probably thought it was childish, but I was happy that she played along.  \"Delighted to make your acquaintance.”<br>\r\n<br>\r\nWith Doris at the table, I did notice something funny; I couldn’t hear the ladies talking like I did when I was alone.  After a while of us sipping pretend tea, Doris said, “Lizzie, I’d like to ask you about what happened here today; if that’s alright with you.”<br>\r\n<br>\r\n“Okay.\"<br>\r\n<br>\r\n\"Did you see the lady who got in here?\"<br>\r\n<br>\r\n\"Uh-huh.\" Pausing, I said, “She was old and scary looking.”<br>\r\n<br>\r\n“Did she say anything to you?”<br>\r\n<br>\r\n“Uh-huh.” Nodding, I said, “She said it was my density to bring forth the messy.\"<br>\r\n<br>\r\n“I see.” Nodding, Doris said, “What did you say to that?”<br>\r\n<br>\r\n“I told her I wanted to be a ballerina.”<br>\r\n<br>\r\nAfter asking a few more questions, and having some more sips of her tea, Doris got up to leave.  I followed her down the hall and watched as she went downstairs to speak with Mommy and Daddy. “I'd recommend you get a security system, Mr. Richardson.  That might keep this person away next time.\"</span></div></div>",
            "created":1575435600,
            "id":2755524,
            "title":"The Cops Arrive"
        },
        "111111111111111111111111111111111111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Later On",
                "The Next Day",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>The party started back up after that cops left; but not to the same extent it had been before Madame Burke.  After a while, everyone decided it was time to leave; except for Aaron and Madison.<br>\r\n<br>\r\nAfter his folks left, Aaron came up to my room with Madison following behind him.  Once he closed the door, he bent down and retrieved the stone from under my bed.  “Great; now that we finally have one of these, we can undo this stupid wish and things can get back to normal.”<br>\r\n<br>\r\nI was suddenly reminded of what Mrs. Whiskertail had said; about making sure Aaron didn’t undo the wish.  Before Aaron could stop me, I ran up and grabbed the stone out of his hand.  “I don’t want to undo the wish!”<br>\r\n<br>\r\n“Are you being serious right now, Travis?” scoffing, Aaron looked at me and said, “From the moment this happened, we’ve been searching for a way to undo this; now you’re telling me you don’t want to.”<br>\r\n<br>\r\n“That’s right.” Getting nervous, I said, “I-I kind of like being a little girl.”<br>\r\n<br>\r\n“What?” looking at me, Aaron said, “Please tell me you’re joking.”<br>\r\n<br>\r\n“I’m not joking, Aaron.” Sighing, I said, “Sure; when this happened I wanted to undo it.  But now, after living this life for almost a week, I-I don’t want to.”<br>\r\n<br>\r\n“What could possibly have changed your mind?”<br>\r\n<br>\r\n“Do you really have to ask me that?” looking at him, I said, “Look around; does this look like that crappy apartment I used to live in?  Now I’ve got two loving parents instead of a single, overworked druggie for a mom.”<br>\r\n<br>\r\n“Those are all good points, but come on; you’re really telling me being a 5-year-old girl is what you want?”<br>\r\n<br>\r\n“Yes.” Holding the stone close, I said, “Please don’t ruin this for me.”<br>\r\n<br>\r\nAfter a moment's hesitation, Aaron finally said, “Okay fine, I won’t undo the wish; at least not yet.” Sighing, he said, “Just give me the stone; if this situation has taught us anything, it’s that 5-year-old girls shouldn’t use one of these.”<br>\r\n<br>\r\nI reluctantly gave Aaron the stone; hoping I hadn’t made a big mistake.  With the stone in hand, Aaron turned to Madison and said, “Come on Maddy, let's go home.”<br>\r\n<br>\r\nAs she followed Aaron out of the room, Madison said, “I promise I’ll make sure he doesn’t undo the wish.”</span></div></div>",
            "created":1575694800,
            "id":2756817,
            "title":"The Wishing Stone"
        },
        "1111111111111111111111111111111111111111111111111111113":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "A Few Hours Later",
                "That Night",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I didn’t sleep very well that night; probably from worrying about Madame Burke or that Aaron would go back on his promise.  I hoped that I would be able to convince Aaron not to undo the wish; hopefully, he would realize that I was happy like this.<br>\r\n<br>\r\nMy worries must’ve shown through; because when I came down for breakfast the next morning, Mommy took one look at me and said, “What’s wrong, sweetie?”<br>\r\n<br>\r\n“I scared of the crazy lady.” Looking at Mommy, I said, “She’s not coming back for me, is she?”<br>\r\n<br>\r\n“I promise you, sweetie, that she’ll never come near you again.” Kneeling down, Mommy said, “Now why don’t you have some <br>\r\nbreakfast; Rachel and Madison will be here in a couple of hours.</span></div></div>",
            "created":1576040400,
            "id":2758269,
            "title":"The Next Day"
        },
        "11111111111111111111111111111111111111111111111111111131":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "That Night",
                "First Day of School"
            ],
            "content":"<div class=\"\"><div> <span>Rachel and her daddies were the first to arrive; Rachel was holding one of her dolls while her daddy Thomas was carrying a bottle of some dark liquid.  Referencing the bottle, Thomas said, “I was thinking the adults could have some wine while the kids play.”<br>\r\n<br>\r\nIt wasn’t long before Madison arrived with her folks.  When I didn’t see Aaron, I got concerned.  Looking at Madison, I said, <br>\r\n“Where’s Aaron?”<br>\r\n<br>\r\n“He went to the beach with Becky.” Pausing, Madison said, “Don’t worry; he didn’t bring the stone with him.”<br>\r\n<br>\r\nI breathed a sigh of relief upon hearing that; now I didn’t have to worry about that ruining my play date.<br>\r\n<br>\r\n<div align=\"center\">*************************</div><br>\r\n<br>\r\nWhile Rachel, Madison and I spent our time in the play area; the parents were chatting nearby.  I wasn’t paying much attention, but I did hear a few pieces of their conversation.  “So, you two, how did you end up with Rachel?” pausing, Mommy said, “My sister-in-law and her wife used a sperm donor.”<br>\r\n<br>\r\n“Our method wasn’t as conventional as that.” With a glance at Anthony, Thomas said, “You see I was born female; we simply combined one of my eggs with Anthony’s sperm, making us both Rachel’s biological parents.”<br>\r\n<br>\r\n“I’ve heard stories about trans men having babies, I just never imagined meeting one.” Looking at Thomas, Mrs. Sullivan said, “If you don’t mind my asking; how did that affect your mental health, identifying as a man but enduring the changes that come with pregnancy.”<br>\r\n<br>\r\n“There were some difficult times; especially once my breasts started getting bigger.” Taking Anthony’s hand, Thomas said, “But I have an amazingly supportive husband, and we now have an amazing little girl.”<br>\r\n<br>\r\n“Does Rachel have any idea?”<br>\r\n<br>\r\n“Not yet; we figured we’d wait until she was older.”<br>\r\n<br>\r\nAt that point, Mommy turned her attention to the three of us, in the midst of a tea party with our dolls.  “It’s amazing, isn’t it?  <br>\r\nMadison and Lizzie have been friends since they were babies, and they were so quick to accept Rachel into their little group.”<br>\r\n<br>\r\n“Kids are like that; they don’t see race or gender.” Smiling, Anthony said, “Everyone is the same to them.”<br>\r\n<br>\r\n“I don’t know about the rest of you, but I can’t believe our little girls are starting kindergarten tomorrow.”<br>\r\n<br>\r\n“Time sure flies, doesn’t it?”</span></div></div>",
            "created":1576040400,
            "id":2758282,
            "title":"A Few Hours Later"
        },
        "111111111111111111111111111111111111111111111111111111312":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Arriving at School",
                "Later On (Lunch Time)",
                "After School"
            ],
            "content":"<div class=\"\"><div> <span>When I woke up the next morning, I quickly remembered what day it was.  It was my first day of Kindergarten and, not surprisingly, I was looking forward to it.  I don’t really know what caused the change in my attitude; but over the last few days, as today got closer, I got more and more excited about the prospect of going back to Kindergarten.  Sure there was a part of me that wished I was still in High School with Aaron, but that part was slowly fading away.<br>\r\n<br>\r\nI was sitting up in bed when Mommy and Daddy came into the room; with Daddy holding a video camera.  I wondered what they were doing until I realized they were doing what most parents would do; videotaping their child on her first day of school.  Mommy was already in tears as she sat next to me.  “I promised myself I wouldn’t cry, but I can’t believe my little girl is starting Kindergarten.”<br>\r\n<br>\r\n“She’s growing up so fast.” Turning the camera to me, Daddy said, “Lizzie, sweetie, are you excited for your first day?”<br>\r\n<br>\r\n“Uh-huh!” giggling, I said, “I very ‘cited, daddy!”<br>\r\n<br>\r\nHaving composed herself, Mommy said, “Let’s get you ready; the school bus is going to be here soon.”<br>\r\n<br>\r\n<div align=\"center\">**************************</div><br>\r\n<br>\r\nIt didn’t take long for me to get ready; after taking a quick bath, Mommy got me dressed up in the outfit she’d picked out – a nice floral print dress.  I was starting to get excited, so I was squirming around as she tried to put a bow in my hair.  Thank god Aaron won’t see this.<br>\r\n<br>\r\nAfter having a bowl of cereal, I grabbed my Frozen backpack and went outside.  Holding Mommy’s hand, while Daddy recorded, we walked the half a block to the bus stop.  When we got there I saw a few kids from the meet &amp; greet, none of whom were in my class, as well as a few 2nd and 3rd graders.  I started to get nervous at this point; it really hit me that I was starting Kindergarten again.  I should have been starting 10th grade with Aaron, but now I was back in Kindergarten with kids who hadn’t been born yet when Travis had started Kindergarten.<br>\r\n<br>\r\nI kept to myself while I waited for the bus; I didn’t know the other Kindergarteners and the big kids wouldn’t show any interest in a <br>\r\n5-year-old girl.  Meanwhile, Mommy and Daddy were talking with the other parents.  I found myself wishing that Madison had the same bus stop as me, so at least I’d have a friend to talk to.<br>\r\n<br>\r\nIt wasn’t long before the school bus arrived; I was the last one to get on.  I hesitated briefly, looking back towards Mommy and Daddy, before taking a deep breath and stepping onto the bus.  <i>Here goes nothing.</i></span></div></div>",
            "created":1576040400,
            "id":2758290,
            "title":"First Day of School"
        },
        "1111111111111111111111111111111111111111111111111111113121":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Later On",
                "After School",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>When I got off the bus at school, the first thing I did was look for Rachel and Madison.  I quickly spotted them standing over by the flagpole.  Running up to them, I saw they were wearing similar outfits to mine.  “Hey guys!” smiling, I said, “What are we waiting for?”<br>\r\n<br>\r\n“Ms. Eliza had to go inside real quick.” Looking at me, Madison said, “She said she was going to bring us all in at once.”<br>\r\n<br>\r\n“I don’t know about you guys, but I’m kind of nervous.”<br>\r\n<br>\r\n“There’s nothing to be nervous about, Rachel.” Turning to Rachel, I said, “You’ll have Madison and me with you.”<br>\r\n<br>\r\nThat was enough to put a smile on Rachel’s face as she walked over to a bench to sit down.  Once she was out of earshot, Madison looked at me and said, “How are you doing?”<br>\r\n<br>\r\nI realized what she was talking about; so I looked at her and said, “I’m kind of nervous; I was supposed to be starting 10th grade today, not going back to Kindergarten.”<br>\r\n<br>\r\n“If you’re that nervous, why not just let Aaron change you back?”<br>\r\n<br>\r\n“I’m not sure I want him to.” Sighing, I said, “Yes, I’m nervous about starting kindergarten again, but that doesn’t mean I want to give up this life.”<br>\r\n<br>\r\nIt was at that point Ms. Eliza and Daddy came out of the building to gather their respective classes.  I gave an excited wave when I saw Daddy looking at me.  Ms. Eliza got all of us into 2 single file lines before leading us into the building.</span></div></div>",
            "created":1576818000,
            "id":2762285,
            "title":"Arriving at School"
        },
        "11111111111111111111111111111111111111111111111111111131212":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Lunch Time",
                "The Second Half of the Day",
                "After School",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>The first half of the day went by without any problems; once everyone was seated, Ms. Eliza started the class by teaching us some letters of the alphabet.  Deep down I knew what the letters were but as I sat at the table with Rachel and Madison, I had some difficulty remembering what they were.  I guess what Madame Burke had said was coming true; as time went by; I would start losing some of what I’d learned as Travis.<br>\r\n<br>\r\nThat became readily apparent when it came for us the class to color some drawings of the letters A B and C.  I was by no means a skilled artist before all this, but I knew how to stay in the lines.  Now, as Lizzie, I was having a really hard time doing it.  I was actually starting to get a little frustrated by my inability to do so.<br>\r\n<br>\r\nEventually, I got to the point where I threw the crayon down in frustration.  Rachel and Madison looked up at me briefly before returning to their coloring – they had no problem staying in the lines.  Ms. Eliza must’ve noticed I was getting frustrated, as she walked over and knelt down next to me.  “What’s wrong, Lizzie?”<br>\r\n<br>\r\n“I can’t draw inside the lines.” Pouting, I said, “It’s really fustrating.”<br>\r\n<br>\r\n“Not everyone gets it right on the first try, sweetie.” Picking up the crayon, Ms. Eliza said, “Here, I’ll show you a little trick from when I was your age.”<br>\r\n<br>\r\nGrabbing another copy of the letter 'A', Ms. Eliza took the crayon and started drawing along the outside of the letter.  Once she was finished, I looked at her and said, “What’s that for?”<br>\r\n<br>\r\n“This is just to make the lines easier for you to see.” Handing me the crayon, Ms. Eliza said, “I’m sure you’ll have no trouble staying in the lines now.”<br>\r\n<br>\r\nWith Ms. Eliza watching me, I started coloring in the letter again.  It only took me a few minutes to finish; this time I only strayed outside the line twice.  Looking up at her, a smile on my face, I said, “Tanks Ms. Eliza.”<br>\r\n<br>\r\n“No problem, sweetie.” Getting up, Ms. Eliza said, “Now finish the other two, because it’s almost time for lunch.”<br>\r\n<br>\r\nAfter Ms. Eliza turned to walk off, Madison leaned over and said, “I knew you’d get it eventually, Lizzie.”</span></div></div>",
            "created":1578632400,
            "id":2772005,
            "title":"Trouble Staying In The Lines"
        },
        "1112":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Getting Answers",
                "Looking for the Stone",
                "More Changes",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>Before any of us could react, Mrs. Sullivan walked into the room and saw me standing in front of the mirror wearing the dress.  Taking one look at me, she turned to Madison and said, “Madison, did you make a wish on that rock you showed me earlier?”<br>\r\n<br>\r\nAaron and I were both surprised when Madison slowly nodded and said, “After I made the wish, I threw it out the window.”<br>\r\n<br>\r\nWith a slight chuckle, Mrs. Sullivan turned to me and said, “Well...young lady, if you want to be a boy again, you’ll have to find that rock within the next 48 hours.”<br>\r\n<br>\r\nI didn’t like why Mrs. Sullivan was implying.  “What do you mean?”<br>\r\n<br>\r\n“I didn’t find out until it was too late.” Sighing, Mrs. Sullivan said, “My time was up by the time I found the stone again; leaving me as the woman you see before you.”<br>\r\n<br>\r\nGetting worried, I said, “How am I supposed to find a tiny rock in your yard?”<br>\r\n<br>\r\n“It’ll be the same color as the clothes you were wearing before the wish was made.” Looking at me, Mrs. Sullivan said, “After I found it again, I decided to hold onto it; although I didn’t imagine my 5-year-old daughter searching my underwear drawer.”<br>\r\n<br>\r\n“Sorry mommy.”<br>\r\n<br>\r\n“It’s too late to look for it now.” Turning serious, Mrs. Sullivan said, “I’d start looking first thing in the morning, but you better move quickly.”<br>\r\n<br>\r\n\"Why?\" Curious, Aaron asked.<br>\r\n<br>\r\n“With each hour that goes by, the more people will start believing that Travis really is a 5 year old girl; even to the point where he’ll start believing it himself.” Pausing, looking at us, Mrs. Sullivan said. \"The only reason I remember is because I held on to the wishing stone in hopes it won't trap anyone else.\"<br>\r\n<br>\r\nI sighed, wanting to scream but as Mrs. Sullivan said, there was little I could do tonight.</span></div></div>",
            "created":1573275600,
            "id":2744573,
            "title":"What happened before will happen again."
        },
        "11121":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Bedtime",
                "During the Night",
                "The Next Morning",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>After listening to what Mrs. Sullivan had said about the wishing stone, it wasn’t a surprise to see that Mr. Sullivan only remembered me as a little girl.  It did learn one crucial piece of information from talking with him – apparently, my name was now Elizabeth and my mom had dropped me off for the night while she went to work.<br>\r\n<br>\r\nOnce dinner was finished, and Mr. Sullivan went into the den to watch a pre-season baseball game, I decided that I wanted to get more answers.  With Aaron and Madison following behind me, I made my way to Mr. and Mrs. Sullivan’s bedroom.  Walking in, I found Mrs. Sullivan putting away some laundry.<br>\r\n<br>\r\nSeeing us, she said, “What can I do for you three?”<br>\r\n<br>\r\n“We want to know why you turned into a woman.”<br>\r\n<br>\r\n“Well, I see you get right to the point.” Sighing, she said, “Have a seat on the bed and I’ll explain everything.”<br>\r\n<br>\r\nWith some help from Aaron, I soon found myself sitting next to Madison on the bed.  Closing the door, Mrs. Sullivan said, “It all started about 16 years ago; about a year before Aaron was born.  As far as Aaron and Madison are aware, their father and I met in college after being introduced through a mutual friend.”<br>\r\n<br>\r\n“I guess you’re about to say that’s not really the truth?”<br>\r\n<br>\r\n“It is, as far as your father and everyone else is concerned.” Pausing, Mrs. Sullivan said, “We did meet in college, but before the incident with the stone, your father and I were roommates.  We’d been friends since Freshman year and did almost everything together.”<br>\r\n<br>\r\n“Everything changed a few months before graduation; it was the weekend of Aunt Rachel’s wedding.  Your father, over the previous few months, had been telling everyone about this amazing girlfriend he had; everyone expected that he’d bring her to the wedding.  The only problem was that she didn’t exist – your father had made the whole thing up.” Pausing, Mrs. Sullivan said, “He was so desperate in the days leading up the wedding that I was worried he’d do something insane.  It was the night before he was supposed to leave, and we’d just gotten back from a Frat party.  I’d found this weird looking rock I was going to give to Uncle Ryan since he loved rocks.”<br>\r\n<br>\r\n“You made a wish with the stone, didn’t you?”<br>\r\n<br>\r\n“Do you want to finish the story, Aaron?” sighing, Mrs. Sullivan said, “Yes – I drunkenly wished that there was something I could do to help your father.  Suddenly there was a shock from the stone and I dropped it – but that was only the beginning.  By the time we’d gotten back to our dorm, it was evident something was happening to me.  It wasn’t long before I’d gone from being a 6’3” muscular guy to a petite 5’5” woman.”<br>\r\n<br>\r\nCurious, I said, “So what happened next?”<br>\r\n<br>\r\n“We were both too drunk to do anything about the wish.” Sighing, Mrs. Sullivan said, “The next morning, after we’d sobered up, your father had the amazing idea to bring me to the wedding as his girlfriend.  I refused to do it, but he convinced me otherwise.  Anyway, we get the wedding and everyone is fawning over me as the girlfriend they’d heard so much about.”<br>\r\n<br>\r\n“So what happened to keep you from turning back?”<br>\r\n<br>\r\n“Please stop interrupting me, Aaron.” Pausing, Mrs. Sullivan said, “We get back to school after the wedding and manage to find the stone.  We both tried dozens of times to undo the wish but nothing happened.  I later found out about the 48-hour deadline – meaning I was stuck as a woman.  By that point reality had started to change – I was no longer your father’s roommate, instead, I was a member of Alpha Epsilon Phi.  We went our separate ways after that, I immersed myself in my new life while your father hung out with our former friends – who didn’t remember me being a guy.”<br>\r\n<br>\r\n“Wait, you said this was about a year before I was born.”<br>\r\n<br>\r\n“I was just getting to that part.” Turning to us, Mrs. Sullivan said, “About a month had passed since the wedding and I realized I hadn’t had a period since I became a girl.  I took a pregnancy test and found out I was pregnant – the result of your father and I drunkenly having sex after the wedding.  The rest is, as they say, history – I gave birth to Aaron 8 months later and we got married a few months after that.”<br>\r\n<br>\r\nThe three of us sat on the bed, taking in everything we’d just heard.  Looking at his Mom, in disbelief, Aaron said, “I-I can’t believe you used to be a guy.  You’re so...feminine.”<br>\r\n<br>\r\n“Well, I’ve had 15 years to learn how to be a woman.” Looking at Aaron, she said, “For what it’s worth, you look a lot like me when I was your age.”<br>\r\n<br>\r\n“Daddy doesn’t remember you used to be a guy?”<br>\r\n<br>\r\n“No, sweetie, he doesn’t.” looking at Madison, Mrs. Sullivan said, “He started to forget soon after we got back.  By the time I told him I was pregnant, he just remembered me being his girlfriend.”<br>\r\n<br>\r\n“What does this mean for me?” concerned, I said, “It’s bad enough I’m a 5-year-old girl; I don’t want to be stuck like this.”<br>\r\n<br>\r\n“Then we have to find that stone as soon as possible.”</span></div></div>",
            "created":1574053200,
            "id":2748493,
            "title":"Getting Answers"
        },
        "111212":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Mrs. Sullivan catches the woman",
                "She Gets Away",
                "I Chase After Her",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>I couldn’t sleep that night, as I kept replaying the conversation with Mrs. Sullivan in my head.  After a while of tossing and turning, careful not to wake Madison, I got out of bed and walked out of the room.  Making my way downstairs to the kitchen, I retrieved a flashlight and quietly walked outside.  It was unseasonably chilly outside – not the kind of weather my Frozen nightie was made for.<br>\r\n<br>\r\nSearching through the backyard wasn’t easy; I had to be careful not to wake anyone in the house.  On top of all that, the stone could’ve ended up anywhere.  As I searched through the garden alongside the house, careful not to trample Mrs. Sullivan’s plants, I finally spotted the stone nestled behind the machinery for the HVAC system.  This was where I realized the benefits of being a young child – I was small enough to reach in and grab the stone.<br>\r\n<br>\r\nLooking at it, I saw that it was a perfectly round stone with blue on the bottom and grey on top; matching the clothes I’d been wearing prior to the wish.  “Thank goodness I found it!” sighing, I said, “Now Madison can reverse the wish!”<br>\r\n<br>\r\nI carefully made my way back out of the garden, only for someone to smack my hand.  I yelped in surprise and watched, horrified, as the stone fell from my hand and into the hands of an elderly woman.  Looking at her, I saw she was wearing strange clothing; was around 5’6” and had long silver hair.  From her appearance, she reminded me of a gypsy.<br>\r\n<br>\r\nI couldn’t dwell on her appearance for too long, because she had something I needed.  Screaming, I said, “That’s mine!”<br>\r\nAn attempt to grab the stone back ended with my falling on my butt in the moist grass.  “This is a cursed item, little girl.” Staring at me, with a cold look in her eyes, she said, “You should consider yourself lucky that I found you in time.”<br>\r\n<br>\r\nAt this point, I was getting desperate.  Looking at her, I said, “Please, I need it to reverse a wish my friend’s sister made.”<br>\r\n<br>\r\nThe woman looked at me with a surprise.  “So you’re the stone’s latest victim.” Laughing, she said, “If it’s any comfort, your friend will not be having a fun time either.\"<br>\r\n<br>\r\nLooking at her, I gulped and said, “What do you mean...?”<br>\r\n<br>\r\n\"As I said, this is a cursed item.” Looking at me, she said, “Every wish comes with a price.”<br>\r\n<br>\r\n“My friend’s mommy was changed by a wish.”<br>\r\n<br>\r\nAs I silently wondered why I said mommy, the woman looked at me and said, “I recently learned about her, which is why I’m here.”  pausing, she said, “She wished to help a friend in need, but the price was having to start a new life in the process.”<br>\r\n<br>\r\nGetting to my feet, I jumped for the stone again.  “What about me?”<br>\r\n<br>\r\n\"Reversing a wish brings another price.\" Serious, the old woman said. \"The question now is if it’s one you’re willing to pay.”<br>\r\n<br>\r\nI wasn’t sure how to react to that.  Taking advantage of my inaction, the woman ran out of the backyard.</span></div></div>",
            "created":1574139600,
            "id":2748910,
            "title":"Enter a an old Gypsy."
        },
        "1112122":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Bedroom (talking with Madison)",
                "The Next Morning",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>I started to run after her, desperate to get the stone back, but I was stopped by Mrs. Sullivan.  Grabbing my arm as I ran by, she looked at me and said, “Travis, what do you think you’re doing?”<br>\r\n<br>\r\n“I wanted to find the stone.” Pointing to the gate, I said, “I had it, but some old gypsy lady took it from me and ran off.”<br>\r\n<br>\r\n“Gypsy lady?” pausing, Mrs. Sullivan said, “Was she wearing a necklace with a strange pendant on it?”<br>\r\n<br>\r\n“Yeah, it had some weird symbol on it.” Looking at Mrs. Sullivan, I said, “How did you know about that?”<br>\r\n<br>\r\n“A few weeks after I found out I was pregnant, a woman came snooping around the sorority house.” Looking at me, Mrs. Sullivan said, “My roommate found her in our room; said she was looking through my things.  Before she ran to call the cops, she said the woman had a necklace with a pendant on it.”<br>\r\n<br>\r\n“Was she looking for the stone?”<br>\r\n<br>\r\n“I didn’t find that out until later; after I did a little research about the pendant.” Taking my hand, she said, “It seems there’s this strange cult surrounding the stones; they don’t like outsiders using them.”<br>\r\n<br>\r\nAs the two of us walked inside the house, I said, “The lady said it was cursed; that there was a price to pay with each wish made.” Looking at her, I said, “She said you paid the price by getting pregnant with Aaron, while Madison will have to pay a price as well.”<br>\r\n<br>\r\nMrs. Sullivan clearly didn’t like the idea that her daughter was going to be harmed by the stone.  “It’s late, we’ll talk about this in the morning.” Walking me upstairs, she said, “I won’t tell your parents I found you walking around outside in the middle of the night.”<br>\r\n<br>\r\nStopping in my tracks, I said, “What did you say?”<br>\r\n<br>\r\nLooking at me, Mrs. Sullivan said, “I said I won’t tell your mom about finding you outside.”<br>\r\n<br>\r\n“No, that’s not what you said.” Looking at her, I said, “You said you wouldn’t tell my parents.”<br>\r\n<br>\r\nRealizing what was going on, Mrs. Sullivan said, “It seems that we’re starting to feel the effects of reality changing.”<br>\r\n<br>\r\n“I think you’re right.” Getting worried, I said, “Earlier, I said mommy instead of mom.”<br>\r\n<br>\r\n“Mr. Sullivan has a doctor’s appointment tomorrow morning.” Looking at me, she said, “While he’s gone, the four of us will do some research and find a way to return you to normal.”</span></div></div>",
            "created":1574226000,
            "id":2749398,
            "title":"She Gets Away"
        },
        "11121222":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "I try to search the attic.",
                "I find another stone.",
                "Madison screams, she has paid for her wish.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>The following morning, Mrs Sullivan shook me awake before hushing me quiet. She had dark rings under her eyes and her breath had a strong smell of coffee to it. \"I have been up all night researching that wishing stone.\" Tiredly, she whispered. \"We need to have a talk.\"<br>\r\n<br>\r\nI silently nodded and followed Mrs Sullivan our of Madison's bedroom to her private study where I found a coffee pot that was nearly empty next to a large stack of papers and books that dominated her desk around her computer. \"You did this all for me?\" Blushing, I asked.<br>\r\n<br>\r\n\"Well, for me as well in a way.\" Yawning, Mrs. Sullivan said. \"The stone I had found years ago was one of seven. When brought together, they will grant the owner any one wish he, she, or they desire including vast wealth or immortality.\"<br>\r\n<br>\r\n\"But a single stone grants a wish too.\" Curious, I said.<br>\r\n<br>\r\nMrs Sullivan nodded. \"Yes but for a price.\" Serious, she said. \"Each stone represents one of the seven human desires. Irony, justice, love, revenge, knowledge, want, and regret.\"<br>\r\n<br>\r\nI gulped at that. \"What was the stone you and then Madison used?\" Worried, I asked.<br>\r\n<br>\r\nMrs Sullivan sighed. \"When you consider the price I paid, I would have to say that stone I had was irony.\" Softly, she said. \"I had to live the life of a woman the man I married had made up just to have someone to brag about.\" She wiped a tear from her eye. \"All because I wished there was some way I could help him.\"<br>\r\n<br>\r\nI was touched by Mrs Sullivan's story so it hurt to have to ask, \"Did you find a way to change me back in your research?\"<br>\r\n<br>\r\nMrs Sullivan gave me a sad smile. \"I found a way but you are not going to like it.\" Softly, she said. \"There is an old book, which I have somewhere in the attic with an incantation that will reverse any wish within 48 hours of the wish being made.\"<br>\r\n<br>\r\n\"Just like the stone.\" Whispering, I said.<br>\r\n<br>\r\n\"The catch is I do not remember where in the attic I had put the book.\" Sadly, Mrs Sullivan said. \"Also, your parents will be over within the hour to pick you up...\"<br>\r\n  </span></div></div>",
            "created":1574744400,
            "id":2752253,
            "title":"The Next Morning"
        },
        "111212223":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Mommy Comes to Check On Us",
                "Later On",
                "Sometime Later",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Before I could respond to that, we were interrupted by a loud scream coming from upstairs.  Mrs. Sullivan ran upstairs and I followed behind her.  Thanks to my shortened legs by the time I’d gotten upstairs, she’d already arrived outside the bathroom.<br>\r\n<br>\r\nComing up behind her, I saw Madison sitting on the toilet; her pajama pants resting at her feet.  <i>Wait a minute – we both wore nighties to bed.</i>  Before I could think about that further, I saw Aaron standing by the shower with a confused look on his face.<br>\r\n<br>\r\nI suddenly felt very concerned about Madison.  Squeezing past Mommy, I walked over to her.  Looking at her, I said, “Are you okay?”<br>\r\n<br>\r\n“Uh-huh.” Pointing at Aaron, she said, “He walked in on me when I was going potty.”<br>\r\n<br>\r\nI watched as Mommy turned to Aaron.  Before she could say anything, he said, “Madison forgot to lock the door again!”<br>\r\n<br>\r\n“Aaron...err Travis, you should know you’re supposed to knock.” Sighing, Mommy said, “What if my girls had been taking a bath?”<br>\r\n“I’m sorry, I’ll be...wait.  What did you call me?”<br>\r\n<br>\r\n“Travis, of course.” Sighing, Mommy said, “Please knock next time; what if my girls had been taking a bath.”<br>\r\n<br>\r\n“What’s going on here?” confused, Travis said, “Mom, my name’s not Travis.”<br>\r\n<br>\r\n“Of course it is.” Looking at Travis, she said, “I’d appreciate it if you called me Mrs. Sullivan; I’m not your mother.”<br>\r\n<br>\r\nTurning to look in the mirror, Travis was clearly surprised by the reflection he saw looking back at him. “What’s going on here?” looking at Madison and me, he said, “Why does Lizzie look like Madison?”<br>\r\n<br>\r\nA part of me was aware that something was wrong, but I couldn’t quite put my finger on it.  I knew that Travis was the 15-year-old son of one of mommy and daddy’s friends, but I also had a strange feeling that I was supposed to be Travis.  But that was silly; I’ve always been Madison’s younger twin sister.  Looking at Travis, I said, “Because we’re twins, silly!”<br>\r\n<br>\r\n“Okay something really weird is going on here; I think it’s got something to do with that stone Madison had last night.” A confused look on his face, as if he was trying to figure out what was happening, Travis said, “I’m supposed to be your son Aaron, and Lizzie’s supposed to be my best friend Travis.”<br>\r\n<br>\r\nIgnoring Travis for a moment, Mommy turned to Madison and me.  “Girls, why don’t you go play in your room for a little while?”<br>\r\n<br>\r\n“Okay, mommy.” Turning to Madison, I saw that she had the same confused look on her face as Travis.  “Are you okay, Madison?”<br>\r\n<br>\r\n“Yeah, I-I’m fine.” Looking at me, she said, “Let’s go have a tea party.”<br>\r\n<br>\r\nWhile Travis looked on, Madison and I walked down the hall to our bedroom.  Once we were far enough down the hall, I heard Mommy said, \"Travis, honey, I think it's best if you don't come around here for a while.\" pausing, she said, \"You're a good kid, but you're clearly dealing with something and I don't want my little girls exposed to it.\"<br>\r\n<br>\r\nWe walked out of earshot before Travis could respond.  As we walked past the playroom; we walked past a framed photo – one of Daddy, Mommy, Madison and me at Disney World with Cinderella.<br>\r\n<br>\r\n<div align=\"center\">***********************</div><br>\r\n<br>\r\nMadison and I were having a tea party with our stuffed animals when, a short time later, we heard a car honking its horn.  We both went to the window as Travis walked out down the sidewalk.  We watched as he stopped halfway down and looked back at the house; spotting us watching him from our bedroom window.<br>\r\n<br>\r\nHe stood there for a moment before walking over to his mommy and daddy as they stood in front of their car.  Turning to Madison, I saw a sad look appear on her face – although I couldn’t figure out why.</span></div></div>",
            "created":1574830800,
            "id":2752647,
            "title":"Screaming From Upstairs"
        },
        "1112122231":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Not Really",
                "Gave a vague answer",
                "Told the truth",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Are you feeling better, Madison?\" Softly, mom asked from the doorway. \"You got what you think you wanted, did you not?\"<br>\r\n<br>\r\nI turned to mom... at least I thought it was mom... I shook my head as if to dismiss any doubt. \"What are you talking about, mommy?\" Confused, I asked.<br>\r\n<br>\r\nIt seemed very strange to call her 'mommy' as if it were wrong somehow. But how could it have been wrong? <i>I was Madison's twin sister... wasn't I?</i><br>\r\n<br>\r\nMom sighed, a pained look on her face as she turned to me but she quickly hid it with a kind, patient smile. \"Lizzie, why don't you go fetch a pair of pull ups for your sister.\" Pausing, Mom said, \"I think you two need a nap after all this excitement.\"<br>\r\n<br>\r\nI winced at that, somehow remembering that Madison wet the bed in her sleep. I noticed my sister wince even more, making me feel sorry for her.<br>\r\n<br>\r\nUpon returning about a minute later, I saw Madison in tears and mom holding a cross look on her face. Again, she quickly hid it with a patient smile as she took the diaper from me. \"I had to remind Madison that all mistakes, big and small, have a price.\" Stress in her voice, she said. \"She made a mistake and now she has to live with the price it carried.\"<br>\r\n<br>\r\n\"What did she do?\" Worried, I asked. \"Forget to lock the bathroom door again?\"<br>\r\n<br>\r\nMom shed a single tear. \"Yes, honey.\" Softly, she said. \"She forgot to lock the door again.\"<br>\r\n<br>\r\nI gave mom some privacy as she helped Madison, crying harder, into her pull ups. Once we were in our beds and the light was turned off with the bedroom door closed, I turned to Madison who was still shedding tears. \"Want to talk about it?\" Softly, I asked.<br>\r\n<br>\r\nMadison turned to me, tears falling before she...</span></div></div>",
            "created":1575176400,
            "id":2754124,
            "title":"Mommy Comes to Check On Us"
        },
        "11121222312":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "My Reaction",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Tears falling down her face, Madison looked at me and said, “Do you remember that stone mommy told us about last night?”<br>\r\n<br>\r\nI vaguely remembered something about a stone, but I couldn’t figure out what it was.  Looking at Madison, I said, “I think so, why?”<br>\r\n<br>\r\n“I made a wish last night that I’d have a best friend.” Pausing, Madison said, “The wish came true; but not exactly in the way I hoped.”<br>\r\n<br>\r\n“What do you mean?”<br>\r\n<br>\r\n“Travis used to be my...our brother Aaron.”<br>\r\n<br>\r\n“What are you talking about, Maddy?” confused, I said, “We don’t have a brother.”<br>\r\n<br>\r\n“That’s the thing, Lizzie” looking at me, Madison said, “You’re not supposed to be my twin sister.”<br>\r\n<br>\r\n“Huh?”<br>\r\n<br>\r\n“You’re supposed to be Travis; Aaron’s best friend.” </span></div></div>",
            "created":1575262800,
            "id":2754645,
            "title":"Gave a vague answer"
        },
        "111212223121":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "That Afternoon",
                "That Night",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I looked at Madison for a moment, not certain how to react. Part of me knew what she was saying was true but it was a very small part... pounding on the back of my mind. This caused me to wince before doing the only thing I could do... I giggled. \"You are silly sis.\" smiling, I said. \"If you did make a wish, why don't you just find the book?\"<br>\r\n<br>\r\nMadison looked at me, surprised and somewhat hopeful. \"What book?\"<br>\r\n<br>\r\n\"The book mommy told me she had hidden somewhere in the attic.\" Honestly, I said. \"She told me that it would reverse any wish once without a price... or something like that.\"<br>\r\n<br>\r\nMadison's mood seemed to improve, hearing that. \"Do you know where it the attic it might be?'<br>\r\n<br>\r\nI shrugged. \"I dunno.\" then I smiled, seeing Madison happy again. \"We could look for it after our nap; it'll be an adventure.\"<br>\r\n<br>\r\nMadison smiled more. \"Okay!\"<br>\r\n<br>\r\nWe both went back to sleep after that with anticipations of an adventure together; although, unknown to me, Madison had another reason to find the book.</span></div></div>",
            "created":1575781200,
            "id":2756952,
            "title":"My Reaction"
        },
        "1112122231211":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Searching for the Book",
                "Later On (Daddy's Home)",
                "That Night",
                "The Next Day",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>After Madison and I woke up for our naps, we ran downstairs to find Mommy working on something at the kitchen table.  Seeing us standing there, she smiled and said, “Hello girls; did you have a good nap?”<br>\r\n<br>\r\n“Yes mommy!”<br>\r\n<br>\r\n“I’ve got some good news.” Pausing, Mommy said, “Your father just called; his plane just landed, he’ll be home in an hour.”<br>\r\n<br>\r\nA small part of me, the same part that had been pounding at the back of my head earlier, told me that Daddy had been here last night.  But I knew that was silly; since Daddy had been on a business trip.  Needless to say, Madison and I could barely contain our excitement; after all, what little girls wouldn’t want to see their daddy.  After we’d stopped jumping around in excitement, I said, <br>\r\n“Mommy, can you get our costume trunk out of the attic?”<br>\r\n<br>\r\n“I suppose so.” Smiling, Mommy said, “Do you girls want to play dress up?”<br>\r\n<br>\r\n“Uh-huh!”<br>\r\n<br>\r\nWe then followed Mommy back upstairs; stopping outside the door that led upstairs to the attic.  Turning to us, she said, “You girls can come upstairs with me; just be careful.”<br>\r\n<br>\r\n“Okay Mommy!”</span></div></div>",
            "created":1576040400,
            "id":2758304,
            "title":"That Afternoon"
        },
        "11121222312111":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Mom took it away!",
                "It was in a strange language.",
                "continue.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>Upon entering the attic, Madison immediately began rummaging through every box she could reach, looking for something. She was mumbling something as she did so. \"Please be here...\" Tearing up, she muttered. \"Please be in here somewhere...\"<br>\r\n<br>\r\n\"What are you looking for, sis?\" Curious, I asked.<br>\r\n<br>\r\n\"A book.\" Searching another box, Madison replied. \"It's an old book mommy said I could read.\"<br>\r\n<br>\r\n\"There are lots of books up here, sweetie.\" Calmly, mom said. \"Only most of them are not for the eyes of kids your age.\"<br>\r\n<br>\r\n\"Always when we're older...\" Pouting, I said.<br>\r\n<br>\r\nMom giggled at that. \"Don't be in such a hurry to grow up.\" Bemused, she said. \"Sometimes, even a simple wish can backfire on you.\"<br>\r\n<br>\r\nMadison gulped at that then continued to search the boxes. Presently, she found an old and faded book that was entitled: <i>Wish Stones Spells and Incantations.</i><br>\r\n<br>\r\n\"This is it!\" Excited, she cried out. She opened the book to find the spell only...<br>\r\n</span></div></div>",
            "created":1580619600,
            "id":2781711,
            "title":"Searching for the Book"
        },
        "111212223121112":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "An old Gypsy.",
                "Grandma.",
                "someone else.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>Madison's excitement quickly turned into confusion and frustration as she gazed into the book she had found. \"What language is this?\"<br>\r\n<br>\r\n\"It's witch writing.\" Softly, mom said. she then whispered, \"Why do you think I hid it?\"<br>\r\n<br>\r\n\"You don't know witch writing...?\" Tearfully, Madison asked.<br>\r\n<br>\r\nMom shook her head. \"You would need a witch to translate and they do not do anything for anyone for free.\" Sadly, she replied. \"Also, you need to know where to look to find one.\"<br>\r\n<br>\r\n\"What are you two talking about?\" Curious, I asked.<br>\r\n<br>\r\n\"Madison was looking for a book i had told her about but she can't read it.\" Patiently, mom replied. \"Only it is in a language neither she or I understand.\"<br>\r\n<br>\r\n\"May I see?\" Still curious, I asked.<br>\r\n<br>\r\nMom sighed and handed me the book. I looked at it and shrugged. \"They look like stick figures doing a dance.\"<br>\r\n<br>\r\nMom giggled. \"They do, don't they?\"<br>\r\n<br>\r\n\"Do we know anyone who can read it or some book that can tell us what it says?\" Worried, Madison asked. \"Please, mommy...\"<br>\r\n<br>\r\nMom again sighed. \"The only one I know who can translate it is...\"<br>\r\n</span></div></div>",
            "created":1580878800,
            "id":2782969,
            "title":"It was in a strange language."
        }
    },
    "info":{
        "author_id":"homerj1987",
        "author_name":"Homer J Simpson",
        "brief_description":"A simple wish has drastic and unforeseen consequences for a teenage boy.",
        "created":1570579680,
        "description":"<td align=\"left\" class=\"norm\">Travis Roger's life is drastically changed when a simple wish made by his best friend's little sister turns him into a 5 year old girl.  As if that wasn't bad enough, he soon discovers that the only ones who remember he was a boy are himself, his best friend and his sister.<br>\r\n<br>\r\nRules:<br>\r\n1. Use proper grammar<br>\r\n2. Be creative with storylines but keep close to the original idea.<br>\r\n3. Use the 1st person perspective (I, I'm, I'll, etc) - keep it from Travis' POV<br>\r\n4. I reserve the right to edit, and/or/ remove chapters.</td>",
        "id":2202606,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1580944920,
        "pretty_title":"A Simple Wish"
    }
}