{
    "chapters":{
        "1":{
            "author_id":"almost2922",
            "author_name":"Lucius",
            "choices":[
                "Betilla gets you first.",
                "Helena gets you first.",
                "Edith gets you first.",
                "Annetta gets you first.",
                "Holly gets you first."
            ],
            "content":"<div class=\"\"><div> <span>The last thing you remember was receiving an email that asked you if you wanted to have a fun time, you didn't even respond to it, you just sarcastically said \"Sure\" out loud before a flash of light blinded you. Now you feel horrible, like you were spun around in a washing machine or something. The only thing you can hear is what sounds like an insects fluttering wings, followed by someone poking you, although you could have swore it was more like a punch. You swat at whatever hit you, only to hit thin air. Doing that must have been funny, because you then heard a girlish giggle coming from all around you as you slowly opened your eyes.<br>\r\n<br>\r\n\"Hey! He's waking up now! I think you poked him too hard Anny.\"<br>\r\n<br>\r\nOnce you opened your eyes and sat up, all you could say to yourself was \"Wow\" (Not that anyone heard you at your size)<br>\r\nAll you could see were the curvy bodies of the Nymph sisters from Rayman Origins, but they were giant sized!<br>\r\n<br>\r\n\"Who gets him when though?\" \"I think I should get him first!\" \"He does look pretty cute...\"<br>\r\n<br>\r\nFinally, Betilla pushed her way through her sisters and gently offered to pick you up. You kindly accepted her offer and stepped into the palm of her hand.<br>\r\n\"I think I should explain his situation first though\" Betilla said as she stared down at you. \"That'd be nice, like how and why I'm here!\" You said, talking loudly so you could be heard.<br>\r\n\"I'll explain everything little one, me aand my sisters have grown bored lately, and decided that maybe a small human would be able to provide some entertainment.\" This answer bewildered you. \"So you kidnapped me and shrunk me down?\" Betilla however, shook her head. \"No of course not, we sent an offer to whoever would accept it, and you accepted it.\"<br>\r\n<br>\r\n\"That's the last time I think out loud.\" You thought to yourself as you sat down in Betillas hand. \"So what, are you all going to play with me like a toy?\" you asked rather grumpily.<br>\r\n\"Well, yes that was the idea in the first place. But not to worry though, we put a spell on you that makes you.. what do humans call it? Like putty?\"<br>\r\nYou groaned. \"Great. Now I'm a plaything for these girls.\" You thought to yourself as you looked out of the corner of your eye, seeing Betilla's sisters huddled around her hand. \"Well, maybe it's not all bad.\"<br>\r\n<br>\r\n\"Of course, once we have our fun, you're free to go home if you choose. And we'll take good care of you.\" Betilla finished.<br>\r\n<br>\r\n\"Yeah! So let's get started!\" One of the sisters shouted as she attempted to grab you, which resulted in a big scrap between the sisters. You flopped onto the floor and rubber the back of your head. It really didn't hurt as much as you thought it would. As you stood up and turned around, you attempted to calm the sisters down. \"Ladies please! Stop all the fighting, you're giving me a headache!\" you yelled, however your yelling fell on deaf ears. Finally, Helena, the Nymph dressed in what looked like a snow dress, shoved Edith to the ground.<br>\r\nIt's too bad she shoved Edith in your direction, which resulted in you getting flattened by her plump rear end.<br>\r\n<br>\r\nAfter Edith dusted herself off, the girls looked around realizing you were gone. \"Uh, where did he go?\" Edith asked as she turned around to look for you. The rest of the sisters giggled as Edith turned her head. \"What's wrong?\"<br>\r\n<br>\r\nAnnetta was the first to point straight at Ediths rear, revealing you plastered over it, just like someone had sat in putty. \"I guess he's already having fun.\" Edith said as she peeled you off her skirt, which resulted in you reflating fast.<br>\r\n<br>\r\n\"Now that all of the fighting is over, let's discuss who gets our toy first.\"<br>\r\n<br>\r\nAfter a long talk, it's decided that...<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1325480400,
            "id":1250925,
            "title":"Waking up in this crazy world."
        },
        "11":{
            "author_id":"sianostraka",
            "author_name":"smr",
            "choices":[
                "Butt Crush",
                "Boob Crush"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And what does she do to ya?</span></div></span></div>",
            "created":1391922000,
            "id":1742524,
            "title":"Betilla gets you first."
        },
        "112":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Ok I guess.",
                "Actually, why don't we get to know each other first?",
                "Ok but can I pick a game?"
            ],
            "content":"<div class=\"\"><div> <span>\"I will play with him first\" Betilla announced. You actually heard her and actually felt relieved considering how gentle she was before. Maybe you and her can get to know each other and learn about this place and her sisters. Your train of thought was interrupted when the head nymph came to you and gently picked you up again. \"Ok little one. We've agreed that I get to play with you first\" she grinned. You simply said \"ok\". One of the sisters then said, \"Can I have him next?!\" \"No, me!\" another one said. \"I saw him first!\" another one said. You couldn't take it anymore and then decided to speak up, \"DO I GET ANY SAY IN THIS?!\" That got the sisters to quiet down. Then Betilla said, \"I think that's fair. So who do you think should be next, little one?\" They all grinned excitingly at you which made you kind of uncomfortable. \"Uhh\" you stuttered. You then spoke up, \"I'll have to think about it!\" you blurted out quickly. Betilla then spoke up, \"Ok. Until then, enjoy the ride!\" You were confused. \"What do mea- whoa!\" you said but Betilla put you between her... mounds and flew off. You were extremely flustered at this and your face was like a tomato. You never thought you would be in a situation like this before. Like that wasn't enough, you noticed that Betilla was flying real high which made you more nervous. \"Hold on tight now!\" She said. Yu asked why, only for to fly REALLY fast in a direction! \"WHEE!\" she shouted while you were screaming in terror. Finally after what seemed like forever of flying which was really not even five minutes, Betilla landed in the middle of the forest and said to you, \"Phew. That was fun, wasn't it?\" She then noticed you passed out, obviously from shock. Betilla used her finger to wake you. After a few taps, you come too in a daze saying something funny: \"Gramma, you ran another stop sign again!\" while cuckoo sounds were being made. Betilla giggled at this, \"So cute.\" She picked you out of her \"pillows\" and tried to snap you out of your daze... simply by shaking you which worked. You then face her with an irritated look and said, \"Why didn't you warn me???\" \"I kinda did actually\" Betilla said with a rather amused look. You sighed wanting to argue but realized it would just be a waste of time. \"Ok so where are we?\" You asked. Betilla answered, \"This is where I live. Here, I'll give the grand tour.\" \"Ok, but I'm staying on your hand.\" you said as you grabbed onto one of her fingers. Betilla flew you around the forest which you had to admit was beautiful. Lots of trees and plants. Sunshine through the branches. There was even a lake nearby. You were in awe as you turned around and looked at Betilla. For some reason, you couldn't help but stare at her now. The smile on her face, the slight breeze through her hair and the bit of sunshine on her made you feel something. She looked rather stunning. You snapped out of it and looked at the rest of the forest. Betilla noticed you enjoying the scenery and giggled. \"So what do you think so far, little one?\" You turn to face her and answered, \"It's pretty...like you.\" You then realized that last part you said and turned around and blushed in embarrassment. \"Oh gosh, did I really just call her \"pretty?!\" Betilla giggled again and said , \"Why thank you.\" After a while, Betilla flew you to her place which was some kind of hut. She took you inside and placed you on a table. \"We'll make yourself at home\" she kindly said to you. You said to her, \"Thanks miss...umm.\" You didn't get her name or the other nymphs. \"Betilla\" she told you. You repeated it to make sure you got it right. She then smirked at you saying, \"What? You're not going to tell me that's a pretty name like you told me I'm pretty?\" She said while waving her hair around. \"YOU HEARD THAT?!\" you blurted out before quickly sealing your lips and blushing. Betilla laughs at this and gently pats your head. \"Oh this is going to be a fun day!\" she said in a singing tone. \"Yay.\" You said in not so amusing tone. Betilla then asked, \"So, ready to play?\"<br>\r\n<br>\r\n<br>\r\nWell...</span></div></div>",
            "created":1587013200,
            "id":2819592,
            "title":"Betilla is first."
        },
        "1122":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Yes.",
                "How about I tell you about myself?",
                "Skip to play time "
            ],
            "content":"<div class=\"\"><div> <span>(Warning: may contain spoilers from the Rayman series)<br>\r\n<br>\r\n<br>\r\n\"Actually, why don't we get to know each other first?\" You bashfully asked. <br>\r\n<br>\r\nBetilla smirked, \"Really? Gee, if you want to date me, just say so.\" she said as she posed like a model, waved her hair around and then brought her face closer to you and then winked at you which made you blush even more than usual. You were in a daze after that but had to pull yourself together... which was getting more difficult by the moment. \"Uhh what I meant was like I tell you about myself and you tell me about yourself and what your sisters are like. You know cuz I'm going to play with them eventually.\" you said trying to find the right words.<br>\r\n<br>\r\n<br>\r\nBetilla smiled and answered, \"Ok. If you insist. Ask away, my dear.\" while putting both her arms on the table and resting her chin on them ready to hear you.<br>\r\n<br>\r\n<br>\r\nWell so far so good. \"Ok so my first question is: can you tell me more about this...world I'm in?\" You asked kindly. Betilla explained: \" Well this place is called the Glade of dreams where me and my sisters along with other magical creatures have lived for a long time.\" You were amazed by this, \"Wow. It must be very peaceful.\" you said. \" Well yes...on a good day at least\" Betilla said. You wondered what she meant as she continued. \"There have been times when this Glade fell into chaos, which is sad really. One time was thanks to a sinister dark monster with a cape. Another time, there was some kind of pirate who was all about slicing and dicing. And just recently, there was a swarm of dark and creepy monsters from the underground world. In fact, some of them even held my sisters and I prisoners.\" <br>\r\n<br>\r\n<br>\r\nYou were incredibly shocked at this.<br>\r\n\"Wow!\" You replied. \"I had no idea. How did you get out?\" You asked. <br>\r\nBetilla answered, \"We got help from the heroes of this world. One of which we actually created.\" You got more amazed by the minute. \"So where are the heroes?\" You asked. \" By now? More than likely sleeping in a tree somewhere. They did have a long journey after all.\" Betilla giggled at the thought. You felt both relieved and sorry for Betilla considering what she's been through. \"Well I'm glad you're alright now and sorry to hear about what's happened before.\" <br>\r\n<br>\r\nBetilla's heart melted at you being a gentleman, \"Aww well thank you little one.\" she said. She then gently picked you up outta nowhere and brought you closer to her face. You noticed her lovey dovey face which made you nervous. \"Uh oh.\" you thought. \"Don't tell me she's going to...\" but your train of thought was interrupted when Betilla puckered her lips and made contact. <br>\r\n<br>\r\n*SMOOOOCH* \"MMMMWAH\"<br>\r\n<br>\r\nShe kissed you! It was big and wet and it somehow left a kiss mark on your forehead which was funny considering your size differences.<br>\r\n<br>\r\n<br>\r\nNonetheless, you were once again in a daze and your face turned red. Not to mention your legs were like Jell-O and gave in causing you to fall on your back. Good thing you were on Betilla's hands again. Betilla couldn't help but laugh at this. \"I must be a really good kisser\".<br>\r\n<br>\r\nMinutes later, you finally came to and looked at Betilla who had an amused look on her face. Remembering what just happened, you complained, \"Was that really necessary?!\" Betilla giggled, \"Sorry, couldn't help myself. You're just so cute.\"<br>\r\n<br>\r\nYou simply sighed...<br>\r\n<br>\r\n\"So is there anything else you want to ask?\" Betilla asked<br>\r\n<br>\r\n<br>\r\nWell...<br>\r\n<br>\r\n</span></div></div>",
            "created":1587445200,
            "id":2822004,
            "title":"A VERY friendly conversation."
        },
        "11221":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Ok. Let's play.",
                "Maybe a quick explanation of me first."
            ],
            "content":"<div class=\"\"><div> <span>\"Yes. What are nymphs like?\" You asked.<br>\r\nBetilla explained: \"Well, we are magical and can fly.\" while showing off her wings and creating sparkles out of thin air with her hands.<br>\r\nYou were impressed by this. \"Nice\" you simply said. \"Mm hmm\" Betilla said. \"My sister's and I have different magic though, but a few things we have in common are that we are fun loving, we grant powers to anyone who need it and we also can speak pig Latin.\" <br>\r\n<br>\r\nYou were (once again) amazed, especially the \"pig Latin\" part. \"Really? Pig Latin?\" you repeated.<br>\r\nBetilla shook her head \"yes\" then said something: \" Ouyay areay utecay!\"<br>\r\n<br>\r\nYou simply said \"Huh?\" \"It means you are cute\"! Betilla clarified. \"Ohhh...\" you just groaned. She just keeps on flirting with you.<br>\r\n<br>\r\nYou simply shook it off and asked, \"So what about your sisters?\" Betilla answered, \" Well first, there's Holly Luya who's the music nymph. She just loves music and either sings or plays instruments. She also loves to dance which she probably would ask you for one. All can say is be a gentleman to her now.\" You shook your head, \"OK\" as she continued. \"Next is Edith Up who is the gourmet nymph. She enjoys cooking and eating and I think you'll love what she makes you. Then there's Annetta Fish who is the ocean nymph. She actually lives underwater so I hope you're a good swimmer. And finally our youngest sister Helena Handbasket who is the mountain nymph. She's a little rough but I'm sure you'll manage. I should also warn you that she lives in someplace REALLY cold. And that's about it\" She finished.<br>\r\n<br>\r\n\"Wow. Kinda alot to take in but thanks.\" You said. <br>\r\n\"Of course\" Betilla replied. \"So, shall we play now or would you like to talk about you now\"? <br>\r\n<br>\r\nYou answer...</span></div></div>",
            "created":1587445200,
            "id":2822010,
            "title":"A few more questions couldn't hurt."
        },
        "112212":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Ok.",
                "Ok, but can I pick a game?"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I'd like to tell you a few things about myself.\" you insisted. Betilla happily agreed.<br>\r\n<br>\r\n\"So as you know, I'm just a regular human being who tries to live life as best as I can. Still, there are things we \"need\" to do get by such as living under our parents rules, going to school, and figuring out our futures. There's also things that we love just like you and your sisters. We eat, sing, go swimming and some of us actually love winter. Myself included.\" <br>\r\n<br>\r\nBetilla seemed very interested in humans, \"Well, that's nice. We could all live and get along with one another.\" <br>\r\n<br>\r\n\"Yeah...if only\" you muttered under your breath.<br>\r\n<br>\r\n\"What was that?\" Betilla asked.<br>\r\n<br>\r\n\"Nothing.\" You quickly responded along with another question, \"By the way, how DID you know about us humans?\"<br>\r\n<br>\r\n\"We have our ways.\" Betilla simply answered. You just said \"OK\". You then realized something: \"Oh hey, I didn't tell you MY name, did I? Betilla shook her head, \"Mm mm\".<br>\r\n<br>\r\n\"Sorry\" you said. \"My name is...\" but when you said your name, for some reason a loud noise was heard like it was some kind of censor, but Betilla was still able to hear it. \"Oh, that's a nice name.\" she said. \"But I'm still going to call you little one and any other nicknames I come up with.\" she giggled as she used her finger to pat you on the head. You just said \"oookay?<br>\r\n<br>\r\n\" Well, this has been nice, but what do you say we play now, hmm?\"<br>\r\n<br>\r\nYou said...</span></div></div>",
            "created":1587445200,
            "id":2822054,
            "title":"Maybe a quick explanation of me first."
        },
        "1122122":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Hide and seek?",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You finally agreed to play with the lovely Betilla. Before you could do anything, you decided to ask her, \"Umm, can I pick what we play?\"<br>\r\n<br>\r\nBetilla said, \"Ok, as long as it's really fun. What do you have in mind?\"<br>\r\n<br>\r\n\"How about..\"</span></div></div>",
            "created":1587445200,
            "id":2822057,
            "title":"Ok, but can I pick a game?"
        },
        "11221221":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You thought hard and decided on a game that would actually be the best one, given your size of course.<br>\r\n<br>\r\n\"How about hide and seek?\" you asked.<br>\r\n<br>\r\nThat's a good idea. With you being small, you can pretty much hide anywhere. Maybe you could win this.<br>\r\n<br>\r\nBetilla had a look of excitement on her face, \"Oooh, ok! So are you going to hide?\" She asked.<br>\r\n<br>\r\n\"Yeah, and thanks to this size, I can hide pretty much anywhere. I wonder if you can find me.\" you said with confidence<br>\r\n<br>\r\nBetilla gave a smirk at that challenge, \"Oh I think I will! Let's not forget I can fly.\" she said as she flapped her wings.<br>\r\n<br>\r\n\"Yeah, I know, which is why I'm going outside to hide somewhere.\" You boldly decided. \"I mean, you did give me a nice tour of where you live. And there is a lot of places to hide. I think I got this.\" you said, keeping your confidence up.<br>\r\n<br>\r\nBetilla placed both hands on her hips and said, \"Well then how about a little wager?\" Oh boy, it's come to that.<br>\r\n<br>\r\n\"If I win, I get to keep you for another day.\" She said as she poked your chest which kinda tickled.<br>\r\n<br>\r\n\"Ok.\" you agreed. \"But what if I win?\" You asked.<br>\r\n<br>\r\nBetilla thought for a second and decided, \"Then that's all we'll get play together and you can play with one of my sister's next.\" You can tell she didn't want to wager that, but still had to be fair.<br>\r\n<br>\r\nYou agreed on the wager. \"Deal.\" you said as you let out a hand while Betilla let out her index finger so you can shake on it.<br>\r\n<br>\r\n\"Ok, let the game begin!\" Betilla announced. \"I'll count to 100 so that will give you plenty of time hide.\" <br>\r\n<br>\r\nYou shook your head, \"Got it.\" As the nymph turned around, closed her eyes and started counting. That of course was your cue to run and hide somewhere and fast.<br>\r\n<br>\r\nYou made for the exit out of Betilla's house and looked far and wide for a hiding space.<br>\r\n<br>\r\nWho will win?</span></div></div>",
            "created":1587445200,
            "id":2822063,
            "title":"Don't get caught by Betilla."
        },
        "112212211":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span>You ran outside Betilla's house to hide somewhere while she continues counting... only to realize because of your size that the forest is bigger than you! You were about as tall as grass. You were in forest within a forest. Still, you were determined to best the lovely nymph of the forest. You trudged through the grass looking high and low for a hiding spot. You found something: a hollow stump with a hold in front. \"Hmm this could work.\" you said and rushed right in. It was empty and spacious. Just then, you heard a familiar voice, \"Ready or not, here I come!\" Betilla said in a singing tone. She already finished counted! <br>\r\n<br>\r\nBetilla flew out of her house and started searching for you. She looked up and down, left and right. Then she looked at a hollow stump and took a closer look...which was bad news cuz that's where you're hiding! \"Oh shoot!\" You exclaimed as you poked your head out only to see the nymph fly closer to you then right back in. Your bones were shaking as you heard her wings fluttering meaning she was getting closer. Betilla landed right next to your hiding place which shook you and the whole hiding place. You almost stumbled down but regained balance. Outside, Betilla got down on her knees and brought her head down to the opening and one of her eyes looking inside for you. You backed up against a wall nervously and were sweating like crazy. \"Where are you?\" Betilla then spoke up again in a singing tone. You did not make a sound and hoped Betilla would leave soon. You then noticed Betilla brought her head up and she was out of sight. You exhaled in relief...but it didn't last. <br>\r\n<br>\r\nOut of nowhere, the stump was removed and you were out in the open. You were nervous again. Has Betilla won? But when you looked, you noticed Betilla wasn't looking at you, instead inside the stump thinking you were inside it! Looks like you got a break! You then looked around and saw a bush nearby and decided to make a run for it and dove right in while breathing a sigh of relief. \" That was close.\" you whispered to yourself. <br>\r\n<br>\r\nMeanwhile, Betilla was disappointed to see you weren't hiding the stump that she somehow lifted up and put it back down. \"Phooey! I thought for sure he was in there.\" she complained as she flew around to look for you some more.<br>\r\n<br>\r\nBack in your new hiding spot, you saw her fly away, but suddenly you felt an irritation in your nose. It was in fact enough to make you sneeze! \"Oh no! Ah..ah..AH!\"<br>\r\n<br>\r\nBetilla kept searching when all of a sudden...<br>\r\n<br>\r\n*AAAACHOOO!!!!*<br>\r\n<br>\r\nYou sneezed! You looked out the bush and saw Betilla just floating out there. You were worried if she actually heard you...<br>\r\n<br>\r\nTo be continued...</span></div></div>",
            "created":1587531600,
            "id":2822491,
            "title":"Flee from the fairy."
        },
        "1122122111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You were in suspense. Hearts pulsing. Seating like a pig. Teeth grinding. You hoped Betilla didn't hear your sneeze.<br>\r\n<br>\r\n<br>\r\nYou hoped and hoped and hoped...<br>\r\n<br>\r\n<br>\r\n<br>\r\n...but<br>\r\n<br>\r\nSlowly, Betilla turned around with a huge smirk on her face. She heard you!<br>\r\n<br>\r\n<br>\r\n\"NOOOO!\" you thought to yourself as Betilla flew closer to your new hiding spot, soon to be exposed.<br>\r\n<br>\r\n\"Well, well, well.\" you heard her say as she continued. \"Hiding in the sneezing bushes, are you???\" <br>\r\n<br>\r\nIs that really what they're called?<br>\r\n<br>\r\nReady to capture you, Betilla moved the branches out of the way and shouted, \"AH HA!\" ...only to find that you weren't there! The nymph was shocked and confused at this. She KNOWS you were hiding in the bushes. She decided to keep looking, unaware that something was going on behind her. Something was moving underground and getting far away from Betilla. Inches and inches later, something popped out; that something being you! You pulled a Bugs Bunny! \"Phew! Good thing I was on soft soil.\" you said as you climbed out of the ground and shook off the dirt like a dog. You got behind a tree nearby and peeped out seeing Betilla ruffling through the bushes before giving up and flying away somewhere and saying \"Hmph!\"<br>\r\n<br>\r\n\"Another close call\" you thought. Still, she could come back so you tried to find somewhere to, but out of nowhere something swooped in and grabbed you! It happened so fast, you couldn't see right away. Once you could, you saw a bird carrying you by your waist with it's mouth. You started to panic but it escalated when the bird flew up higher and higher making you woozy. Still you didn't want to be bird feed so you had to think fast. You tried tickling your predator and it immediately dropped you and you started falling and screaming. \"AHHH I DIDN'T THINK THIS THROUGH!!!\" You kept falling and falling until a big tree branch caught you by your shirt much to your relief. \"Well at least I'm not hurt...or dinner.\" you said to yourself. Unfortunately, the branches grip on you didn't last and fell some more. \"OH COME ON!!!\", you exclaimed. You tried to reach your arms out hoping to grab anything else but nothing...until...<br>\r\n<br>\r\n*OOOMPH!!* <br>\r\n<br>\r\nYou landed in something soft. You opened your eyes to see strands of red surrounding you. It was all long and wavy and actually smelled nice. Then out of nowhere, you heard a familiar voice, \"COME OUT, COME OUT WHEREVER YOU ARE!\" It sounded like your seeker was nearby but you couldn't see her. You then looked and saw something familiar: a pair of fluttering wings as well as a green hat on top along with what looks like earrings. Your was racing until you finally realized... you landed on Betilla! Really her hair! You grew nervous but it seemed that Betilla was unaware of you. You then had a sneaky idea and smiled. You could climb up Betilla's beautiful hair and hide under her hat until she gives up and tried to call you and tells you \"you win.\". \"Oooh boy. It's in the bag now!\" you thought as you started climbing. Victory was finally in reach, no pun intended. After an exhausting climb, you finally made it to her hat and quickly slipped inside and sat down very still and played the waiting game.<br>\r\nHer hair was nice and soft and couldn't help but sniffed it some more, \"Mmmm, strawberries.\" you whispered.<br>\r\n<br>\r\n<br>\r\nBetilla was still looking for you but has had no luck so far. She was still determined though. \"Hmmm, if I was a cute little boy, where would I hide?\" she said to herself. You heard her and chuckled softly. She really has no idea that you're in her hair.<br>\r\n<br>\r\n<br>\r\nAfter over an hour, Betilla was actually getting worried. She couldn't find you at all. Although she didn't want to call you and tell you that you win, she couldn't risk losing you either. Finally she  sighed and put both hands by her lips and called out for you: \"Little one? Umm can you come out please? I give up. You win.\" <br>\r\n<br>\r\nThat got your attention and you can finally show yourself in a way she wouldn't expect. You starting crawling out to the front of her head which she actually felt. <br>\r\n<br>\r\nBetilla felt something in her hair. \"Why is my head itchy?\" She reached out to scratch but then you popped out and brought your face in front of hers and shouted, \"SURPRISE!\"<br>\r\n<br>\r\n\"EEP!\" she was startled which made you fall, but she quickly caught you with her hands. You landed on your back and looked at Betilla. \"Hey\" you simply said.<br>\r\n<br>\r\n\"Oh thank goodness!\" Betilla said relieved to see you and continued, \"Where did you come from?\" \"From your hair.\" you simply replied. Betilla was surprised. \"You were in my hair this whole time?!\" she asked. You shook your head \"no\" and explained what happened this past hour.<br>\r\n<br>\r\n<br>\r\n\"...And that's pretty much what happened.\" you finished.<br>\r\n<br>\r\n\"Oh, I see. Well like I said, you win so I guess I should take you back to my sisters like I promised.\" Betilla said in a rather saddened tone.<br>\r\n<br>\r\nYou felt bad. You were actually felt bad for Betilla. You had alot of fun with her and now she said to see you go.<br>\r\n<br>\r\nAs she started to fly back, you decided to do something.<br>\r\n<br>\r\n\"Betilla, wait...\"</span></div></div>",
            "created":1587531600,
            "id":2822540,
            "title":"Continue..."
        },
        "11221221111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue",
                "Readers choice."
            ],
            "content":"<div class=\"\"><div> <span>Betilla looked at you curiously.<br>\r\nYou spoke up, \"Umm listen, I know we made a deal and all but...well where I'm from, some deals are made to be broken. So I actually wouldn't mind playing with you some more.\" <br>\r\n<br>\r\nBetilla gasped and grew excited, so much that you could hear her heart pounding really fast. \"You mean it?!\" she asked shaking in happiness.<br>\r\n<br>\r\n\"Yeah why not? It's still pretty early plus I do enjoy spending time with you.\" you said while blushing a bit and scratching your head. Just then, you were quickly brought to her chest and being squeezed while Betilla squealed in excitement. \"OH THANK YOU THANK YOU!!\" she shouted while you were still being squeezed.<br>\r\n<br>\r\nYou choked trying to get the words out, \"you're.... welcome.\"<br>\r\n<br>\r\nBetilla then let go of the \"hug\" and gave you air to gasp. You then looked at her and said, \"You're gonna have to not do that.\" Betilla just giggled.<br>\r\n<br>\r\n\"So, shall go back to my house? I have a really fun game in mind?\" She said.<br>\r\nYou simply said \"ok\" as she flew back carrying you along with her.<br>\r\n<br>\r\nYou felt good. You get to play with this lovely nymph. Sure you would still have to play with her sisters but maybe you could get used to this.<br>\r\nWhile riding on her hand, you wanted to say something to Betilla.<br>\r\n<br>\r\n\"By the way, your hair smells nice.\" you complimented. Betilla was flattered, \"Why thank you.\" Then she got an idea. \"Here. I'll let you ride in there for now.\" she offered as she brought you up to her head and lifted her hat up for you to jump in, which you did and she pulled her back down to keep you safe and continued to fly to her house. <br>\r\n<br>\r\nYou laid down on the nymphs hair and sighed in comfort. You mumbled something that you thought you would never say...<br>\r\n<br>\r\n\"I think I'm going to like it here.\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n(Author's note: I've already wrote chapters for the other nymphs and consider them continuations after Betilla. Just saying.)</span></div></div>",
            "created":1587531600,
            "id":2822548,
            "title":"Continue"
        },
        "112212212":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>( This is an alternate scene. Don't read if you're very squeamish.)<br>\r\n<br>\r\n<br>\r\nWhile Betilla was counting, you ran right outside the forest nymphs house looking for a place to hide. When you got out, you saw that the forest was bigger than you realized. You were about as tall as a blade of grass. You were in a forest within a forest. Still, you were determined to best the lovely forest nymph. You ran as fast and as far away as you could. You then saw something pretty interesting...not to mention pretty. It was a garden. You got a closer look and saw pretty much anything you would find in any garden. The usual fruits and vegetables. Does this garden belong to Betilla? She must be pretty talented to grow some delicious food. One thing that stood out however was a glowing piece of fruit. Being curious, you decided to get a closer look. Walking towards it, you saw that it was your size. You'd never even seen fruit like this before. It was round like an orange but colorful like a rainbow. Not to mention some kind of stem sticking out. You started drooling at it and decided you could use a snack. Considering your size however, it was more like a meal. Good thing too, cuz you were actually hungry. <br>\r\n<br>\r\n\"I'm sure Betilla wouldn't mind if I had a snack here.\" You said as you started to chow down really fast. Once you finished, you wiped your mouth and burped a little. You actually loved it. \"Wow! That's good. Maybe Betilla could show me how to grow these.\" you said to yourself. Suddenly you noticed something odd: everything was growing around you! Actually, you shrunk down some more! \"Whoa! Did I get smaller?!\" You panicked. You then realized something: if your smaller than usual, that would mean even more places to hide. Your panicking soon turned to excitement. \"Well cool. Maybe Betilla will never find me now.\" you said to yourself. Right now though, you were still kinda hungry. You then saw a strawberry nearby. You licked your lips thinking, \"Maybe a few more bites couldn't hurt.\" You then went to chomping on the strawberry creating a little tunnel inside for you to relax in.<br>\r\n<br>\r\n<br>\r\nMeanwhile, Betilla finished counting and flew outside shouting, \"Ready or not, here I come!\" She flew around looking all over the forest but so far, she didn't find you. She then flew towards her garden. She was about to pass it but a sound stopped her.<br>\r\n<br>\r\n*GROWWLLL\"<br>\r\n<br>\r\nBetilla realized that sound was coming from her. She put a hand on her tummy and said to herself, \"Oh my. Looks like I forgot to eat today. A quick little snack and then it's back to finding that little sneak\". She then flew towards her garden, looking at all the food she grew and was pretty proud of herself. \"Ahh, you've done it again.\" she said to herself as she went to picking some fruit and veggies to snack on. She decided that one more would do for now and looked at a bright red strawberry. She licked her lips and went to pick it. However, it wasn't the only thing she was about to eat...<br>\r\n<br>\r\n<br>\r\nYou were relaxing in the strawberry you were eating and felt full afterwards. Not only was it delicious but it turned out to be a pretty good hiding spot...or so you thought. Your world started to shake, interrupting your relaxation and you looked outside to see what was going on, only to find your hiding space floating up higher! You shook in fear of how high you were. You then heard a familiar voice, \"Bottom's up!\" You poked your head out and saw Betilla holding the strawberry (and your hiding spot) and bringing it to her face and opening her mouth. She was going to eat you! You had to get her attention somehow before it's too late. You started to scream at the top of your lungs, \"BETILLA! WAIT!! I'M IN HERE!!! IN THE STRAWBERRY!!!\" Unfortunately, you were so small now that your voice couldn't be heard. Betilla tossed the strawberry (and you) in her mouth and started chewing. \"Mmmm.\" she said as she was enjoying the flavor, completely unaware that you were part of it.<br>\r\n<br>\r\nYou were in Betilla's mouth being tossed around on her tongue. Thankfully, the teeth missed you. You tried holding on to the tongue but the ride was more bumpy than any you've ever been on. The ride stopped finally...only to have the tongue lift up causing you to lose your grip. You along with the strawberry pieces were being tossed down her throat. You saw something in the back that could save you: her uvula! You reached out and caught it. It was slippery, but you held on with all your strength. You watched the pieces of strawberry fall down her throat, obviously to her stomach. You sighed in relief, \"Close one. I hope she doesn't throw up though.\" while gripping tighter around the dangling flesh making a squishy sound.<br>\r\n<br>\r\nOutside, Betilla was rubbing her stomach, feeling satisfied with her snack. Then she started feeling a tickle in her throat. It was irritating in fact and made her hiccup and cough.<br>\r\n<br>\r\n*HICCUP! COUGH* HACK!*<br>\r\n<br>\r\nShe then looked for something to wash it down and found a little waterfall nearby. She flew towards it, opened her mouth and started drinking like crazy.<br>\r\n<br>\r\nInside, you saw Betilla open her mouth. You thought this could be your chance to escape...only to be met with a huge splash of water. It came rushing in so fast that it instantly pulled you down, loosing your grip and you fell down her throat meeting with a loud sound.<br>\r\n<br>\r\n<br>\r\n*GULP!\"<br>\r\n<br>\r\nBetilla finished drinking and felt no more irritations. \"Ahh. That's better. Now where is my little toy?\" She said, completely unaware that you were closer than she thought.<br>\r\n<br>\r\n<br>\r\nInside was like a waterslide as you continued down the depths of the lovely forest nymph. You then splashed down to the stomach along with the waterfall that you were riding on. You ended up swimming in something that wasn't water. Not only that but you saw the various fruits and vegetables floating around, not to mention the liquid was hot. You were horrified to realize that you were swimming in stomach acid! You tried to swim out before you were digested. You got up on dry land and gasped for air. You also looked at yourself to see how badly burned you were...only to find out that you were surprisingly ok! You then laid down flat and looked at your situation. You were eaten by Betilla the fairy and are stuck inside her body. You heard noises too, such as the stomach growling, the heart beating and the air rushing. This wasn't good. Even if Betilla searched for a long time, she still wouldn't find you and you don't have any way of getting her to know where you are. <br>\r\n<br>\r\n<br>\r\nExcept maybe one, and got the idea from watching some sci-fi. You could try reaching her brain and try and communicate with her. Of course getting out of the stomach would be the first step. After that, it's gonna be quite the \"fantastic\" voyage. \"Guess I don't have a choice.\" you said to yourself as You got up, walked towards the stomach wall, grabbed on real tight and got to climbing.<br>\r\n<br>\r\n<br>\r\n\"Here goes nothing.\" You said to yourself.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1587963600,
            "id":2825610,
            "title":"A little (er) problem."
        },
        "12":{
            "author_id":"almost2922",
            "author_name":"Lucius",
            "choices":[
                "\"Kick back and relax before we play.\"",
                "\"I mean, I give you some more time between these?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Maybe I could get him first?\" Helena asked as she snatched you from Ediths hand, making you get a bit of motion sickness in the process. \"Just make sure you take care of him, he might be under a spell but he can still...well kick the bucket.\" Betilla said as you gulped a bit at that statement. \"I'll take good care of him, you know that!\" Helena snapped back as she fluttered up into the air, getting ready to depart. \"Just make sure you give him to me tomorrow, in one piece.\" Betilla said as Helena nodded and started to fly back to her home in the mountains, with you in tow.<br>\r\n<br>\r\nThe snowy mountain tops stretched for miles, with Helena's house sitting at what seemed the center of the collection. Your casual clothes were definitely not enough to withstand the cold weather, you felt like you were turning into an ice cube! You can only suspect that since Helena is the mountain nymph, she must have natural resistance to cold weather. As Helena fluttered into her house, she sat down on her couch and lifted you up to her face. At this point, you were shaking like a leaf in a hurricane. Helena looked at you for a moment and frowned. \"I'm so sorry! I forgot that you're a human, not a nymph like me! You must be close to becoming an ice cube!\" Helena said as she continued to watch you shiver. An idea popped into her head as she smirked at you. \"I know how to warm you up, and I bet you'll love this idea!\" Helena said as she cupped you in both her hands and hugged you against her ample chest.<br>\r\nHelena's body heat slowly began warming you up, you were so comfy that you couldn't help cuddle into her. You heard her giggling as you did this, and looked up at her face.<br>\r\n\"You really like it down there huh?  I suppose I could let you stay there for a bit longer.\" Helena said as she sat back a bit and relaxed.<br>\r\n<br>\r\nYou did the same as you made yourself comfortable between Helena's endowments, finally feeling totally warmed up again. Enduring the cold weather was really worth it. Your world shifted a ton as you noticed Helena cupping her breasts, another smirk on her face. You were about to ask her what she was doing, but then both of her breasts crashed into you and crushed you between them. Helena laughed as you crawled out from in between them, and apologized. \"I'm sorry, I just couldn't resist!\" Helena laughed out as she pet you on your head with her index finger.<br>\r\n<br>\r\n\"Listen little guy, how about we...\"</span></div></div>",
            "created":1325566800,
            "id":1252021,
            "title":"Helena Handbasket"
        },
        "121":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "We play in the snow?",
                "Hide and seek?",
                "A little climbing?"
            ],
            "content":"<div class=\"\"><div> <span>\"Kick back and relax before we play, hm?\" You happily agree as snuggled some more on her chest.<br>\r\n<br>\r\nHelena looked at you and found you so adorable. \"Aww your so cute like this.\" Boy she knows how to make you blush.<br>\r\n<br>\r\nYou laid flat on her chest getting warm. But not only was she warm, she was soothing. So much in fact, you were about to doze off. You tried to stay awake but it's difficult. Helena makes you feel relaxed even more than you could remember. First, her body heat than you hear her start humming a tune. Another thing you hear is the sound of a drum. Ba bum, ba bum, ba bum. You realized it's Helena's heart beating next to you. It was a slow and steady heartbeat too.<br>\r\nEverything was really soothing that you started to...Zzzzz.<br>\r\n<br>\r\n<br>\r\nHelena heard you snoring and realized you fell asleep. She looked down towards you and smiled warmly at your sleeping form. \"Aww, my wittle toy is sweeping. she said in baby talk form. She was like a mother caring for her baby. As much as she wanted to play with you, she wanted to make this moment last.<br>\r\n<br>\r\n<br>\r\n*One hour later* <br>\r\n<br>\r\nHelena was still relaxing with you in her arms. She looks back at you and sees you yawning and stretching. Looks like nap time is over. She gently pokes you with her finger. \"Little one, it's time to wake up.\" She said in a gentle tone. She tried to poke you so you would wake up but instead you muttered in your sleep: \"Mmm...I want a cookie please.\" Helena found it so adorable and giggled. She pokes you a few more times until you finally woke up, albeit a bit startled. *Snort* \"I wasn't asleep!\" you quickly said.<br>\r\nYou then looked at Helena who was smirking at you. \"Oh hey.\" you simply said. <br>\r\n<br>\r\nHelena giggled and teased you a bit, \"Aww, did my wittle toy enjoy his nappy wappy?\" You tried to deny it, \"I wasn't sleeping!\" you said while looking left and right. Helena of course wasn't buying it. \"Really? You mean to tell me that you weren't so comfortable right here that you didn't fall asleep\"? she said while pointing to her chest. You looked down and then looked away and blushed in embarrassment. There really wasn't any point in hiding it. \"I I'm so sorry. I couldn't help it. Are...are you mad?\" you asked as you looked back at the mountain nymph.<br>\r\n<br>\r\nHelena was confused as to why you would think that, but the least she could do was cheer her up. \"No, of course not my little snowflake.\" Wow, she gave you a nickname. \"I actually do have that charm on alot.\"<br>\r\n<br>\r\nYou were relieved to hear that, \"OK, cool.\" you said as you gave another yawn and stretched some more.<br>\r\n<br>\r\nHelena giggled at this, \"Still tired? Here, I know just to wake you up.\" She then brought you up to her face and puckered her lips bringing you closer.<br>\r\n\"Whoa whoa! Are you going to...\" but your sentence was interrupted when Helena gave a nice warm kiss all over your face!<br>\r\n<br>\r\n*SMOOOCH* \"MMMMWAH\"<br>\r\n<br>\r\nOne Helena was done, you were left with a redder than tomato face and a kiss mark on your cheek, which was odd considering your size. Still, she was right: that DID wake you up.<br>\r\n<br>\r\n<br>\r\n\"Uuuhhh\" was all you can say. Helena laughed at your reaction and finally said, \"Well, now that that's done, you ready to play\"?<br>\r\n<br>\r\n\"Uh sure, what game?\" you asked.<br>\r\n<br>\r\n\"How about...\"</span></div></div>",
            "created":1587445200,
            "id":2822122,
            "title":"Comfy as comfy gets."
        },
        "1213":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"A little climbing?\" Helena suggested. \"What? You mean, like mountain climbing?\" you asked. Helena shook her head, \"Mm hm.\" You objected, \"But it's cold out there! Don't you remember what happened a little while ago?\" You had a point of course, but Helena had something else in mind, \"Of course I do, sweetie. Which is why you're going to climb THIS\" she said as she signalled to her body with her free hand.<br>\r\n<br>\r\nYou were a bit flustered and blushed a  little and then said to her, \"Uhh, seriously?\" \"Of course! After all, you are small enough to climb pretty much anything.\" Helena giggled.<br>\r\n<br>\r\nThere was another problem however...<br>\r\n<br>\r\n\"I've actually never climbed before, so how would this work?\" you asked<br>\r\n<br>\r\n\"Well I would let you climb my hair, but it's not long enough like my sisters.\" Helena said as she waved her hair around. She then thought of something and said, \"Wait here.\" as she placed you on the couch you both relaxed on, mostly her. She flew off somewhere and came back with what looks like a long string, but to you, it looks more like rope. She then spoke to you, \"Here, I will tie this rope around my neck and you climb all the way to the top of my head.\" Looks like she was going to make this easy for you. She did just what she said and then gently grabbed you, flew towards the center of the room and placed you on the floor next to her feet.<br>\r\n<br>\r\nYou looked up at her and asked, \"So just climb up the rope. That's it?\" Helena looked down at you with sneaky grin for some reason and answered, \"Sure, little one. That's it... maybe.\" she said the last part under her breath while snickering. You noticed it and was starting to worry. You didn't like the sound of her giggling.<br>\r\n<br>\r\nStill, you didn't have a choice really. Better get to climbing. You walked to the rope, grabbed it and got to climbing. Good start so far. You were climbing up her plump legs. Helena felt you climbing her legs with your feet while still grabbing on to the rope and started giggling, shaking your world. You almost slipped but kept your grip while looking up at her with an irritated look while she looked down to you with a grin saying, \"Sorry, you tickle!\" You just kept climbing while telling yourself, \"Don't look down.\" even though you almost did a few times. <br>\r\n<br>\r\nFinally, you reached her coat, you remember it was nice, warm and cozy and as much as you wanted to rest on it again, you had to finish this game. You were almost there as you reached her chest. Just a little more and you'll reach her head in no time. Helena noticed you and said, \"Well my little snowflake, looks like you're going to make it.\" \"Yeah, I am.\" you said, realizing she's right. \"This wasn't so bad.\"<br>\r\n<br>\r\n\"Uh oh, but what's this?\" Helena said out of nowhere. \"What's wha-WHOA!\" you tried asking but suddenly there was shaking going on. Helena was shaking the rope and you while you screamed, \"WHAT ARE YOU DOING?!\" <br>\r\n<br>\r\nHelena shouted, \"OH NO! IT'S AN EARTHQUAKE! AN AVALANCHE! HOLD ON TIGHT!!! WHEEE! as she started swinging you around while you screamed in horror. <br>\r\n<br>\r\nMeanwhile, your mind was racing. How could Helena Handbasket go from a comforting and sweet lady to a rough and tumble one? Perhaps that was her personality, given she is the youngest. Your train of thought was interrupted as she continued swinging you around and also yo yo'd you as well while you screamed again.<br>\r\n<br>\r\nHelena spoke up again, \"WHEEE! Don't let go, little one!\" You answered back, \"Why on Earth would I let go?!\" After a while, she finally stopped and you were dizzy. That was more scary than a roller coaster. You felt like you were about to vomit. Good thing you didn't eat today. You then snapped out of it and noticed something...<br>\r\n<br>\r\n<br>\r\nYou were back to where you started! Right where you started climbing the rope. You must've been slipping and didn't even notice until now.<br>\r\n<br>\r\nHelena looked down at you with a smirk, \"Uh oh! Look where you are now!\" she teased. You groaned at this. Now you had to start over. You climbed and climbed once again hoping she doesn't pull anymore shenanigans.<br>\r\n<br>\r\nAfter another tiring climb, you made up to her chest again. Surprisingly, it was much easier a second time. Still, you were being cautious. Helena noticed you and said, Well, well, look who's back up here.\" \"Yeah, yeah.\" you said while rolling your eyes. You now reached her neck which was the end of the line, or in this case, rope. You had to figure out how to get up the rest of the way. You remembered something, her hair! Since you can reach it now, you can use it to climb up the rest of the way. You reached up and grabbed it. It was soft and smelled like vanilla. Your favorite flavor. After some more climbing, you finally made it to her snow hat. You reached the top and took in the breathtaking view... even if it was just Helena's house. Speaking of which, the mountain nymph cheered at your success, \"Yay! You did it! That wasn't so bad, was it?\" while applauding at you. \"Yeah, I guess.\" you answered. <br>\r\n<br>\r\nUnknown to you, Helena grew another sneaky grin as she untied the rope from her neck. She then brought it towards you from behind and started quickly tying you up.<br>\r\n<br>\r\nYou grew nervous again and asked, \"Uhh Helena? What are you doing???\"<br>\r\n<br>\r\nShe then brought the rope attached to you to her face and said, \"Don't worry, this is part the game.\" with that grin still in her face. You were confused, \"Part of the game? I thought all I had to do was climb you like a mountain?\" Helena answered, \"Yes, but there's another thing I'd like you to do.\" \"And that is...?\" you asked as Helena giggled and held onto that grin of hers.<br>\r\n<br>\r\nWhat was this lovely but also rowdy nymph up to???<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1588772760,
            "id":2831212,
            "title":"Scaling the mountain nymph."
        },
        "12131":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue."
            ],
            "content":"<div class=\"\"><div> <span>Helena kept her sneaky grin up while you sweated nervously wondering what she was planning. Still hanging by a thread, or in this case, a string, all you could do was stare at Helena's face which was quite lovely from your point of view. Then out of nowhere, the mountain nymph opened her mouth wide and was bringing you closer!<br>\r\n<br>\r\nYou yelped in surprise and tried to stop her, \"Whoa, whoa wait! Are you trying to eat me?!\" Helena closed her mouth and spoke, \"No, of course not, dear. This is the next part of our game. You're going to go spelunking!\" You never heard of it and were confused, \"Wait, what?\"<br>\r\n<br>\r\nHelena explained, \"Spelunking is where you go exploring inside caves. It's a hobby of mine that I enjoy. It's really fun and I want you to try it.\" <br>\r\n<br>\r\nYou now got where this was going, \"Ok. And this \"cave\" I'm exploring is actually inside you?\" you asked nervously. Helena simply said, \"Mm hmm\"<br>\r\n<br>\r\nYou were unsure about this, \"Are you sure about this? What if something happens? Like I end up getting stuck or something?\"<br>\r\nHelena sighed at your worrying and had to calm you down, \"There, there sweetie. This is why I tied the string around you. To make sure you get out safely. Also because of your size, I doubt you'll cause any irritation going down or up\".<br>\r\n<br>\r\nYou were a bit calm but still had second thoughts...not that it mattered because Helena was still going through with this.<br>\r\n<br>\r\nYou gave in and said to her, \"Ok. I'm ready\". Helena smiled, \"That's my good little snowflake. Trust me, you'll a have REAL good adventure in here\". she said while patting her stomach. \"Oh, but first...\" she spoke again and tapped your forehead, causing sparkles all around you. You were about to ask but she quickly explained, \"This little spell will help you see in the dark.\" You nodded your head in understanding. Helena wasted no time and opened her mouth again bringing you slowly onto her tongue. She then brought it back in and closed her mouth, sealing you in. Thanks to her little magic, you can in fact see. It was like night vision without glasses. You stood up and looked around the mouth. In your size, it was exactly like being in a cave, with a little air roaring around, the teeth acting like stalagmites and stalactites and drops of saliva, some dropping on you, much to your disgust, but you shook it off. You then balanced yourself on the tongue and walked towards Helena's throat. You then noticed something hanging: her uvula! You got an idea from those cartoons you watch and decided to try it yourself. With your biggest leap, you grabbed on to it and swung back and forth. It was pretty fun just like on TV.<br>\r\n<br>\r\nOutside, Helena felt a tickle in her throat and thought it was you playing around. Thankfully, she was able to control her gag reflex. She called out to you, \"And what do you think you're doing in there?\" You answered back, \"Oh, just having a little fun in here.\" in a sly tone. You hung on her dangling flesh and looked down to her throat. You saw her vocal cords and windpipe and were amazed. This was different than any usual spelunking. <br>\r\n<br>\r\n<br>\r\nAnd you were just getting started...</span></div></div>",
            "created":1589781720,
            "id":2837420,
            "title":"Caved in."
        },
        "13":{
            "author_id":"almost2922",
            "author_name":"Lucius",
            "choices":[
                "\"Climb up me to get your food!\"",
                "\"Give my feet a good rubdown!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Can I please get him first?\" Edith pleaded, everyone looking skeptical. \"Weren't you and Helena a bit rough with your dolls back in the day?\" Holly asked as you sat down in Edith's hand.<br>\r\n\"So I'm a doll now?\" you sighed as Edith nervously avoided Holly's question. \"Well, you're doll sized aren't you?\" Betilla said with a smile as you simply sighed in defeat.<br>\r\n\"Well, I suppose he can go with Edith first. They've got quite a bond already as it seems.\" Annetta giggled as the other sisters finally agreed.<br>\r\n<br>\r\nEdith squealed with delight and hugged you like you were her newest toy. (Which in a sense, you are.) Being hugged by a bubbly girl like Edith has it's perks. Especially being in between her warm mounds. But, there are also downsides. Like suffocating. You violently struggled to get out of Ediths cleavage, grabbing her by instinct and trying to pull yourself out. It was a nice spot sure, but not when you can die while enjoying it. \"Hey! You're grabby!\" Edith said as she continued to hug you, seeming to not really care. \"Edith, I think that's because you're suffocating him!\" Betilla said as she pulled Edith's arms away from her chest, leaving you imprinted once again on her. \"Oops! Sorry!\" Edith said as she peeled you off of her right breast.<br>\r\n\"If you're going to do that again, please make sure you give me some air!\" You shouted. \"Sorry! Don't worry, I'll take care of you while you're with me!\" Edith reassured, as she began to fly off. \"Cya later girls!\" Edith said as she flew back to her home. \"Just be sure to give her to Holly tomorrow!\" Betilla shouted as Edith flew away with you in tow.<br>\r\n<br>\r\n<br>\r\nAs Edith settled into her home, she set you down on the floor, leaving the room for a minute and coming back with a sandwich. She settled down on her chair and began eating it, when your stomach growled. \"Wow, you must be hungry if I heard that from up here!\" Edith said in between mouthfuls of food. \"Tell you what, I'll let you have some of my lunch if you can do a task. If not, you'll have to wait for your meal.\" You reluctantly agreed, not like you had a choice. You were hungry.<br>\r\n<br>\r\n\"Alrighty then, I want you to..\"</span></div></div>",
            "created":1325480400,
            "id":1250950,
            "title":"Edith Up"
        },
        "131":{
            "author_id":"attackman234",
            "author_name":"lolman",
            "choices":[
                "You managed to tap her nose...",
                "Her tripped on her...flesh...",
                "You accidentally slipped in her mouth"
            ],
            "content":"<div class=\"\"><div> <span>Edith took a quick pause to take another bite of her sandwich,and turn her chair to face towards you.<br>\r\n<br>\r\n\"I want you to climb up me to get your food!\"She said,taking another bite of her sandwich.<br>\r\n<br>\r\nIs she serious?You're only 4 to 5 inches tall!How can she expect you to climb up her,when you can easily fall off and hurt yourself.However,if you don't agree,you have to listen to your stomach sing tunes,while you wait to get fed like a baby.<br>\r\n<br>\r\n\"Okay,how far do I have to climb up your body?\"You asked,kind of wishing you didn't,but again you were forced to.<br>\r\n<br>\r\n\"All you have to do is reach my nose.\"Edith said,wiggling and pointing to her nose.That was going to be tiring,but you really didn't feel like climbing from the ground up to her nose.You can't tell if the hunger is affecting your thoughts,or are you truly thinking it.<br>\r\n<br>\r\n\"Ah,come on,\"You complained.\"Can't I just sit in your lap or something?\"You placed yourself near her foot,waiting for her answer.<br>\r\n<br>\r\n\"Nope,my task is made up.Oh,and another thing,\"Edith leaned over in her chair,so she can see you.\"You have to do it before I finish this sandwich,or I might get too full to bring you food.\"She giggled at your facial reaction,which was basically an enormous frown,with you eyebrows aiming downwards.The sandwich is already half eaten,and considering that she may have a higher gluttony than her sisters,it could be a matter of seconds before she fully ingested the sandwich.<br>\r\n<br>\r\nThis isn't the time for getting angry,now it's the time to get climbing!One slight problem...you have no experience in climbing large objects.You couldn't even climb the tree in your front yard,without someone helping you.You had no choice,but to start climbing raw.You decided that you need to get a grip,despite her rather tender body,so you tried to warp your legs and arms around her legs.Okay,you managed to not slip downwards,until the vibrations of Edith up giggling caused you to slip,and eventually land back on the ground.<br>\r\n<br>\r\n\"Oh,sorry,you're just so ticklish.\"She giggled.<br>\r\n<br>\r\nOh boy,this is gonna take a while...a long while.<br>\r\n<br>\r\n*********<br>\r\n<br>\r\nOh...man...What.A.Challenge.<br>\r\n<br>\r\nIt felt like you took at least a good 3 hours or so,to get at least 2/3 of the way there.You managed to reach her...rather pillow like mounds before having to lie down and take a break.Again,being with a woman like Edith Up does have it's perks and downsides,like her constant giggling hindering your progress.<br>\r\n<br>\r\n\"Glad to see your determination for food,kind of like me.\"Edith Up said,grinning at you.You roll on your stomach and face her.<br>\r\n<br>\r\n\"Great...can I have some food now?\"You asked,as your stomach gave off another growl.She just shook her head.<br>\r\n<br>\r\n\"Ah-ah-ah...you didn't touch my nose yet,and lucky for you,I still have this little piece left.\"She raised one of her,revealing a very tiny piece of her sandwich.Alright,you made it!Or...at least you did...<br>\r\n<br>\r\nShe slowly raised the tiny piece of food over her head,and opened her mouth.She then lowered it closer to her mouth,ever so slowly.She isn't seriously teasing you like that!It doesn't matter,you were too hungry to wait,and your not about to lose after you've come this far!<br>\r\n<br>\r\nYou made a mad dash towards her nose,across what seemed like a field of orb-like flesh...</span></div></div>",
            "created":1371877200,
            "id":1615804,
            "title":"Climbing Mt.Fleshmore"
        },
        "1313":{
            "author_id":"foxtrotace",
            "author_name":"FoxtrotAce",
            "choices":[
                "Try to pry open her mouth",
                "Start pushing against her tongue"
            ],
            "content":"<div class=\"\"><div> <span>You run across the nymph's mountain sized chest, hoping to reach her nose as quickly as possible before she goes along with her tease and eats the last bit of her sandwich.<br>\r\n<br>\r\nwhen you reach to her chin, you put as much strength as you can into your legs and you jump as high as you could, arm reaching out for her nose. The distance is swiftly closing in, her nose is right at your fingertips! You're going to make it!<br>\r\n<br>\r\nBut all of that excitement within your dwindles away as you feel your right foot getting caught on Edith's lower lip, you swipe your hand in the air to touch her nose but find that you are but a centimeter too short. You then notice the large gap of Edith's mouth below you as you fall inside.<br>\r\n<br>\r\n<b>*GLOMPH*</b><br>\r\n<br>\r\n\"Mmmph!?\" Your body falling within her mouth startles the busty blonde making her instinctively close her mouth around you.<br>\r\n<br>\r\nAround you, you can only see the pink, wet insides of her mouth. Her pearly white teeth blocking your only exit. You can feel her wet and squishy tongue as you plant your hands on it to try and stand up and get your balance. <br>\r\n<br>\r\n\"Hey!\" You yell to get her attention \"Let me out of here!\"<br>\r\n<br>\r\nYou notice that Edith doesn't do anything right away so you take matters into your own hands.<br>\r\n<br>\r\nYou...<br>\r\n</span></div></div>",
            "created":1572757200,
            "id":2741855,
            "title":"Unsuspecting A Tasty Snack"
        },
        "13132":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Yes! She spits you out.",
                "No. She swallows you!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You try pushing on Edith's tongue hoping she'll do something but what happens next?<br>\r\n<br>\r\nDoes it work?</span></div></span></div>",
            "created":1587099600,
            "id":2820105,
            "title":"Start pushing against her tongue"
        },
        "131322":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Ok.",
                "Better idea..."
            ],
            "content":"<div class=\"\"><div> <span>You then heard her voice. \"Mmmm tasty.\" You did not like the sound of that. Just then the tongue started moving and rubbing all over you. Edith was actually tasting you much to your disgust and discomfort. \"Hey! What are you doing?!\" you shouted. You tried holding on to the tongue but it was slippery and out of control. You then started to slide down the abyss that was her throat. \"Is she trying to eat ME?!\" you panicked. Once you were close enough to her throat, Edith swallowed you on instinct as you shouted, \"EEDDIITH!\" You squeezed down her throat, through her esophagus and plopped down to her stomach. Once you landed in the depths of the hungry nymph, you bounced around like it was a trampoline until you came to a complete stop. You laid down flat for a minute until you came to the sound of the stomach growling. You moaned and groaned standing up and couldn't believe that you were actually eaten by a hot lady nymph. You then heard a familiar voice, \"Little guy? Are you ok in there?\" You then shouted, \"OK?! You ate me! Why would you do that?!\" \"Sorry. You kinda tasted good for a toy.\" Edith giggled. You moaned as you looked around the stomach. It actually looked pretty spacious on the inside but probably cuz you shrunk. Not only that but it was kinda warm in here. You can also hear noises like the growling in her belly as well as the sound of a drum. You guessed it was her heart beating and echoing in the distance. You then noticed the sandwich she ate floating in liquid nearby. You realized it was the stomach acid! That stuff burns like fire if you touched or got near it and even worse, you could get digested! Panicking at the thought, you tried to get out of here. Hopefully Edith can help you. You call out to her, \"Edith!\" \"Yes?\" She answered. \"Can you please help me get out of here?\"<br>\r\n<br>\r\n<br>\r\nWhat does she say?</span></div></div>",
            "created":1587099600,
            "id":2820111,
            "title":"Eaten up by Edith Up."
        },
        "1313222":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Ok. Why not?",
                "Nah. I'll climb out."
            ],
            "content":"<div class=\"\"><div> <span>You waited for Edith to respond. Finally she answered, \"Better idea. You can climb out of my belly.\" You were shocked at her response. \"What?! But I already climbed your legs, waist and...chest which was tiring enough as it is\" You complained as you pounded the stomach walls in frustration. Your world in her stomach suddenly shook as Edith giggled afterwards. You must've tickled her from the inside. Edith then spoke up, \"Aww but it was such a good and ticklish feeling.\" You then complained some more, \"I'm still hungry by the way!\" Edith answered back, \"Well I still have this little bit of sandwich left. I can save it for you if you climb out.\" Well there's some good news. She's actually gonna spare you what's left of her sandwich. Another thought crossed your mind, \"But if I do try and climb out, what if something happens? Like what if I fall in your stomach acid? You DO know what will happen, right?\" You asked in a worried tone. Edith answered, \"Don't worry little one, the magic that has been cast upon you actually protects you from such dangerous things.\" You were surprised at this information. She then continued, \"In fact, you can actually swim around in my belly. Maybe play with some of the food I ate that hasn't been digested or just relax in there.\" \"Wow\" you thought to yourself. You never thought this would be possible. Still, you had to be sure though as you looked at the acid. You decided to test this spell by sticking your hand in the dangerous liquid. After a second, you pull back your hand to see it in one piece. Not to mention it was kinda soothing. \"Wow! It's like a hot tub.\" You said out loud. Edith giggled at your reaction. \"Yes it is. So you want to stay in my tummy?\"<br>\r\n<br>\r\n<br>\r\nYou thought about it and decided...</span></div></div>",
            "created":1587099600,
            "id":2820116,
            "title":"Better idea..."
        },
        "13132221":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok. Why not?\" you answered. Like you said, you were rather exhausted after climbing earlier. You could use a break and this little \"hot tub\" inside Edith will do just fine.<br>\r\n<br>\r\nEdith spoke up, \"Well alright dear. Just let me know when you're ready to come out, ok?\" Could this mean Edith will actually let you out afterwards? You can only hope. Right now you just want some time to yourself. You then stood up and got ready for a dip in the acid since the magic made you immune. With one jump, you splashed right in and enjoyed the soothing yet also dangerous liquid.<br>\r\n<br>\r\nOutside, Edith felt you splashing around in her stomach, put a hand on it and giggled. She was glad you were having fun.<br>\r\n<br>\r\nBack inside, you were floating around, enjoying the warm comfort in the stomach... even if it smelled a bit. You then noticed the food she ate earlier was sinking in the acid. You decided to dive down and see where it went. As you followed it, you saw other food down below such as pancakes, eggs and various fruits...and lots of them! \"Wow! She eats alot!\" you thought in amazement. Then again, Edith's a big girl...and not just because you were small. You then noticed the food was starting to dissolve. Looks like digestion was starting. Your world was starting to shake a bit. You then quickly swam out of the acid before something else happened. Once you were on dry land again, you noticed the acid simply slid off of you. Looks like the magic made you wet proof. You turned around to see a whirlpool in Edith's stomach. It carried the food she ate down somewhere. Once it was over, the acid came back up and was pretty much clear of anything. You made a good call climbing out, otherwise you would have been pulled down too. Once it was safe, you dipped right back in and lounged around. It was relaxing. The warmth of your hot tub along with the sound of air rushing and the heart like a drum. You actually nodded off a bit.<br>\r\n<br>\r\nA little while later, you were awake again and still in the stomach. You yawned a bit and stretched yourself. You then heard giggling from Edith, of course and spoke up, \"Well well, awake are we?\" \"What? I wasn't asleep.\" you denied. Edith however wasn't buying it, \"Really? Cuz I'm pretty sure I heard snoring in there.\" she said as she patted her belly. \"Yeah ok.\" you said sarcastically. \"Well, I'm ready to come out now, can you let me out now?\" you asked nicely. You didn't hear Edith answer for a few seconds and then she finally answered, \"Yeah, about that actually...\"<br>\r\n<br>\r\nYou were in fear at that response. What did she mean by that???<br>\r\n<br>\r\n</span></div></div>",
            "created":1588301220,
            "id":2827911,
            "title":"Ok. Why not?"
        },
        "131322211":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"YOU MEAN I CAN'T GET OUT?!\" was literally the one thing you shout in fear. It was so loud, it echoed beyond the cavernous stomach. \"Please calm yourself, little one.\" Edith answered. \"I haven't even explained yet.\" <br>\r\n<br>\r\nYou can only imagine the horror she has say about leaving her body. Still, it didn't seem like you had a choice and just listened. Edith spoke up again, \"So, here's the thing: Believe it or not, I have had...well let's say \"Intruders\" peeping at me from time to time. When they are caught, I punish them by shrinking them down to bite size and imprisoning them in my stomach. If they want out, they have to go through a long and EXHAUSTING journey to get out.\" <br>\r\n<br>\r\n<br>\r\nOnce Edith was finished, you were once again bewildered, \"So what? Now I have to go through the same thing?\" you asked. Edith thought of something and answered, \"No no, instead for you I can make it easy...and by \"easy\" I mean \"less dangerous\" since it is my fault you're in there. First I'm going to give you a power that can help you change size. If you need to get through something, you'll automatically get small enough to fit right through and once you're out, you'll be back to normal. Well, normal-ish really. More than likely, you will find Alot of tight spaces. Another thing is, there's some little things inside me that act as bodyguards. If they see you, they'll cling on to you, making your journey difficult, but you can pull them right off. Other than that, the rest is up to you.\" she finally finished.<br>\r\n<br>\r\n<br>\r\nYour head was spinning after hearing sooo much. \"Oh boy.\" you moaned. \"Hey, think of it this way: this can be another fun game to play.\" Edith said. She actually had a point. It actually reminds you of videogame you enjoy playing. You agreed to this, \"Ok. I'll do it then.\" you said even though you didn't really have a choice. <br>\r\n<br>\r\n\"That's the spirit!\" Edith chirped. \"But let me do one thing first.\"<br>\r\n<br>\r\n<br>\r\n\"Power toooo... CHANGE SIZE!!!\"<br>\r\n<br>\r\nYou heard her shout and next thing you know, you were glowing. Looks like it worked. \"Wow. That feels kinda nice.\" you said to yourself.<br>\r\nEdith spoke up again, \"Ok, you're all set. Good luck my little morsel.\" She giggled. \"Uh, sure, thanks.\" you said while frowning at the nickname she just gave you. You just shook it off and then walked to the stomach wall and got to climbing. It was slippery, so you had to get a real good grip. You were already at the exit of the stomach and saw a small opening. You just had to trust Edith and the power she just gave you. You tried sticking your head through...only for you to get small enough to fit. It actually worked! You were able to squeeze right in. You were able to use both arms and legs to continue climbing, kinda like how you saw it in the action movies. Still, you had quite a way to go, but you'll make out just fine...right?<br>\r\n<br>\r\n<br>\r\nTo be continued...<br>\r\n<br>\r\n(Author's note: In case you are wondering, yes this was in fact inspired by the hit video game, \"Mario and Luigi: Bowser's inside story\". I never got the original, just the remake, but either way it's really fun! I do not own anything!)<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1588318380,
            "id":2828053,
            "title":"Edith's inside story."
        },
        "1313222111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You made it out of the stomach and kept climbing away from it. Up ahead, you saw not one but three choices on where to head to next. \"Oh boy.\" You said to yourself. Maybe Edith can help. You called out to her, \"Hey, Edith!\" \"Yes?\" she answered. \"I'm out of your stomach now. Which way do I go now?\" you asked hoping for an answer. \"I'm afraid you'll have to figure it out yourself, sweetie. Wouldn't be much of a challenge now, would it?\" Edith giggled. All you could do was sigh, \"ok\". You thought about it and decided to try the first path. You walked into the tight space, getting smaller of course. Once you were in, you were then transported through a tube and really fast like an arrow from a crossbow! \"WHOOAA!!\" was all you could shout.<br>\r\n<br>\r\n<br>\r\nWho knows where you could end up now...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1588322100,
            "id":2828071,
            "title":"Lost in inner space."
        },
        "13132221111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>After your crazy ride through the tube, you were then spat up and fell down a long way until you landed with a splat. You got up and noticed something, a tall bone like structure. You walked closer and rubbed it. It was actual bones! You then heard Edith's voice, \"Oh my, that feels odd.\" You talked to her, \"Hey Edith, I just fell down somewhere and there's a tall boney thing here.\" She answered, \"Well no wonder, I believe you're in my left leg.\" <br>\r\n<br>\r\nWeird. In no time you went from her stomach to one of her legs. You looked up and noticed the exit was all the way up... meaning you had to climb again. You looked at her bones and they looked pretty close like a ladder. This will be easy then. You grabbed on and climbed. While you were at it, you asked Edith something, \"I'm climbing up your bones now. It's not hurting you is it?\" \"No, not at all. You much to small to do that.\" she assured. You shook your head, \"Ok\" and kept climbing until you reached the exit and squeezed back into the area you started at.<br>\r\n<br>\r\n<br>\r\nYou looked at the other pathways and thought about the one farthest from you. That way could lead to the other leg. So you decided the middle path would be your best bet.<br>\r\n<br>\r\nYou squeezed right in and transported somewhere...but where to next?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1588323480,
            "id":2828073,
            "title":"Leggo my leg."
        },
        "131322211111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The path you chose lead you somewhere that was pretty loud actually. It sounded like, \"THUMPA THUMPA THUMPA!\" Even you could guess where you were headed: Edith's heart! You kept squeezing through until you arrived, only to keep getting bounced around. It was like a trampoline that forced you to bounce. \"Hey, this is fun.\" you said actually enjoying the ride.<br>\r\n<br>\r\n<br>\r\nOutside, Edith felt a tickle in her chest and put a hand on it while giggling. She wondered if it was you and tried talking to you. \"Little one? Where are you?\" <br>\r\n<br>\r\n<br>\r\nInside, you heard Edith's voice and answered, \"Edith! I'm in your heart!\" while you continued bouncing. \"Really? Does that mean you like me?\" she jokingly asked. You blushed at that response and quickly answered back, \"No! No! I mean I'm literally in your heart!\" Edith giggled, \"Oh relax. I knew what you meant. Looks like you're getting closer. By the way, that tickles!\" You chuckled a bit at what she said. Being in here reminds you of when you did have a trampoline a while back. You decided to re-live those good old days with somersaults and backflips. After a little while, you decided to press on. You saw an exit and literally jumped for it. You grabbed on and shrunk again to squeeze right in transporting you somewhere.<br>\r\n<br>\r\nHopefully closer to the outside world...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1588325940,
            "id":2828081,
            "title":"The way to a nymph's heart."
        },
        "1313222111111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>After your rather exciting adventure through the heart, you got transported to another area. This one had a few more different pathways to choose from. <br>\r\n<br>\r\n\"Oh man, not this again.\" you complained. You thought about the choices. You decided not to take the middle again because you felt like the same choice wasn't always right. You decided to go through the third pathway and got transported somewhere.<br>\r\n<br>\r\nBut where?<br>\r\n<br>\r\n</span></div></div>",
            "created":1588326780,
            "id":2828084,
            "title":"More paths."
        },
        "13132221111111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>After squeezing through the next tube, you landed in some sort of fleshy tunnel. All you could do was move forward. Not even a minute later you then saw something up ahead. It looked like...more bones? These ones looked familiar. Like the ones you saw in Edith's leg. Could you be in her arm this time? Then the flesh around you could be the muscles. You decided to travel a little deeper. Afterwards, you were close to her hand seeing more of Edith's bones. You were quite amazed.<br>\r\n<br>\r\n<br>\r\nUnknown to you, something was watching you. It wasn't friendly looking either. It saw you as an enemy. It then dropped from the fleshy ceiling. <br>\r\n<br>\r\nYou turned around and walked back to the exit but we're stopped by the creature lurking around, landing right in front of you. \"Whoa! What the...\" you shouted as You jumped back in surprise.<br>\r\n<br>\r\nGetting a closer look, you saw that it was a limbless creature with a green vegetable for a face and pupiless eyes. It was also smaller than you. It pointed it's fingers at you and shouted, \"INTRUDER!\" <br>\r\n<br>\r\nWait. Could these be the bodyguards that Edith was talking about? You then realized that you were in trouble now. You tried talking to it, \"No wait!\" but it was futile as the creature grabbed onto to you. Thankfully you remembered what Edith said and just pulled it off you and threw it behind you and ran in the other direction. However, the creature wasn't alone. As you continued your escape, more of the bodyguards dropped down in front of you in attempt to capture you...and then who knows what after that. Seeing that they were small, you simply jumped over them and kept running. You finally made it to the exit and squeezed on through the tube and found yourself back to the previous area you were in.<br>\r\n<br>\r\n<br>\r\nYou thought about going to the middle path since more than likely the other path would lead you to the other arm. You quickly ran right in and we're transported somewhere else. Hopefully those bodyguards wouldn't catch up to you.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1588335840,
            "id":2828111,
            "title":"Arm-ed and dangerous."
        },
        "131322211111111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Almost there!"
            ],
            "content":"<div class=\"\"><div> <span>After squeezing through yet another tube, instead of falling you were actually floating! Also, you were hearing roaring winds like there was a tornado. You looked around and saw the chamber that you were in was inflating and deflating like a balloon. All that told you one thing: <br>\r\n<br>\r\n<br>\r\nYou were in Edith's lungs!<br>\r\n<br>\r\nThis was pretty cool. You could use the strong winds to float even higher and reach the next tube. You proceeded to do so while at the same time do some loops. \"Alright! Whoo!\" you shouted.  But your fun was short lived. While you were upside down, you saw the bodyguards coming for you! You also noticed they were flying like helicopters. Weird, but now is no time to ask questions.<br>\r\n<br>\r\nYou tried to float away from them, but they managed to surround you. Just one chance...you had to somehow get rid of all of them if you were to escape. You then got into position and waited for the right moment. Then they all charged at you! Could this be it? Have they won?<br>\r\n<br>\r\nNo, cuz at the last minute, you flew up fast, causing the guards to ram right into each other... mainly their heads. \"That's gotta hurt!\" you winced. They all fell unconscious and down they went. You were victorious! You kept floating up and made it out of the lungs. You shrunk again and squeezed into the tube to your next destination.<br>\r\n<br>\r\n<br>\r\nWherever that could be...<br>\r\n<br>\r\n</span></div></div>",
            "created":1588338780,
            "id":2828127,
            "title":"Outta my airway!"
        },
        "1313222111111111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You popped out into another chamber and saw only one thing: another tall boney structure. This one also looked like a ladder. It seemed to go up and up and up. After seeing the leg and the arm, only one thing came to mind:<br>\r\n<br>\r\nThis was Edith's spine! <br>\r\n<br>\r\nYou could use this to climb all the way to her head! From there, you'll have a number of exits to choose from. Freedom was almost yours. You climbed again, hopefully for the last time.<br>\r\n<br>\r\nIt was an exhausting climb, but it was going to be worth it. After reaching the top, you saw a hole and jumped up through it and saw something big.<br>\r\n<br>\r\n\"Whoa! Is this...\"<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1588339320,
            "id":2828131,
            "title":"I got your back, Edith!"
        },
        "13132221111111111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You saw something big, pink, wrinkly, looked squishy and had bolts of electricity around it.<br>\r\n<br>\r\nThis was Edith's brain!<br>\r\n<br>\r\nYou were amused at this sight. \"Well this is something!\" You wanted to get closer but didn't want to risk getting zapped. You also happened to see her  \"memory bank\" as it was called. You saw her precious memories like when she and her sisters were born. As nice as they were, you didn't want to invade a lady's privacy and focused on leaving. <br>\r\n<br>\r\nYou walked around Edith's head and found another path. Hopefully one that will finally get outside. You jumped right in and were sliding down really fast.<br>\r\n<br>\r\nAfter a long and fun slide, you flew right off and smacked right into something. Looking at it, you saw it was shaped like a punching bag and looking down and around, it was all too familiar. The abyss down below, the white boulders, the long slimy ground. <br>\r\n<br>\r\nYou were in Edith's mouth! You were also hanging on to her uvula! Freedom was in reach. With one swing, you jumped and landed on her tongue. You then called out to her, \"Edith!\" \"Hmm?\" was all you heard. You continued, \"I'm in here, in your mouth!\" You then saw her open her mouth and you quickly jumped out onto a table. Finally! You were out!<br>\r\n<br>\r\nYou were flat on the table gasping in relief. You then turned around and saw Edith smiling down at you. \"Hey.\" was all you said.<br>\r\n<br>\r\nThe plump nymph gently brought her hands down and picked you up, bringing you to her face and spoke. \"Well look who's finally made it out!\" she chirped as she gave you a quick little kiss. \"Mwah!\" You blushed a little at that moment. Edith spoke again, \"So, did you have fun inside me?\" You answered, \"Yeah, you could say it was a \"fantastic voyage\". Edith giggled, \"Well I don't know if that's supposed to mean anything, but I'm glad to hear that.\" She then remembered something, \"Oh right!\" she said as she grabbed the last bit of sandwich from earlier and gave it to you. \"As I promised.\" she said.<br>\r\n<br>\r\nYou were drooling at your lunch and went crazy eating away like Taz. In no time you ate it all up and burped a little afterwards.You then said to her, \"Thanks. You know what's funny? I actually forgot that I was hungry after...well you know.\" You then laid on her hands as she giggled. \"Well I hope you saved room for a little something extra special.\" she sang. She then brought you over to the table you were on earlier and showed you something. You turned around and was wide eyed at what you saw.<br>\r\n<br>\r\nA tray of fresh baked cookies! There were lots of them. Some were chocolate chip, oatmeal raisin, and even macadamia nut! <br>\r\n<br>\r\n\"Surprise!\" Edith shouted. You were indeed surprised and tried saying something but couldn't find the right words. \"Whaa...how... where did?\" you stuttered.<br>\r\n<br>\r\nEdith laughed at your reaction and said, \"I baked them, you little silly!\" \"When???\" you simply said. \"What did you think I was doing while I was waiting for you to come out?\" Edith said with a smirk. \"That makes sense.\" you said.<br>\r\n<br>\r\nYou looked at the cookies and couldn't stop. You were drooling. The smell was also getting to you. You just had to ask. \"Soooo...may I?\" you turned to Edith and asked pointing at the cookies. \"Well of course. There's enough for both of us.\" Edith kindly said. You then jumped off her hands and landed on a macadamia cookie shouting, \"WHOO HOO!\" <br>\r\n<br>\r\nBeing small, you could eat a whole cookie and be full for a day...not that you really cared. Anything to satisfy your sweet tooth. You started to Chow down on your cookie and you loved it so much. It was still warm and soft. You looked up at Edith and saw her eating away at the cookies too. Boy can she bake. While you were still eating your cookie, you couldn't help but stare at her lovely form. She was rather THICC as most people would put it. Her hair was really long and blonde which was something you actually liked. After a minute of staring, you snapped out of it and blushed a little. You then got back to finishing your cookie while thinking back to your day with the beautiful food nymph so far. Sure it was a bit...bumpy at the start but after a little accident here and there plus a little adventure around her innards and finally a sandwich and dessert, you could get used to some fun time with Edith and her sisters. After you finished your cookie, you laid flat on the table muttering something you felt like saying...<br>\r\n<br>\r\n<br>\r\n\"I think I'm going to like it here.\"<br>\r\n<br>\r\nEdith then looked down, smiled at you and said, \"So my little morsel. After you rest, I would like to take you outside to one of my favorite spots, so we can play some more. Sound good?\" You simply nodded your head, \"yes\". You then wondered what she had in mind but decided to rest for now.<br>\r\n<br>\r\n</span></div></div>",
            "created":1588344060,
            "id":2828160,
            "title":"Getting out of her head and outside at last!"
        },
        "131322211111111111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Ice skate!",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>You've been lounging around on the same spot where the cookie you ate was. You couldn't get over how delicious it was. Boy, if Edith can bake something THAT delicious, imagine what else she can make.<br>\r\n<br>\r\nA while later, you stretched your arms and legs and finally stood up. You saw Edith was still eating cookies, but there was surprisingly still plenty left. Edith noticed you and flew over to you. \"Hey there little guy. How are you feeling?\" she kindly asked. \"Like I just had the best dessert ever.\" you answered. Edith smiled, \"That's good.\" as she finished her cookie. \"So how about we go to that favorite place of mine? I promise you and I will have a really fun time.\" Edith said offering her hand for you to hop on. \"Ok.\" you simply said as you got on her hand, grabbing hold of her fingers. You then both left Edith's house.<br>\r\n<br>\r\n<br>\r\nYou couldn't believe that Edith lived in a place that's both an Arctic glacier and what appeared to be a huge hot kitchen. Talk about a classic case of hot and cold. Edith was flying around the Arctic region while you enjoyed the view. You saw some stuff that you would never find in the Arctic region of your world such as watermelons floating around, giant forks with faces and what appears to be a school of piranhas. This made you want to ask Edith something: \"What's this place called again?\" Edith explained, \"Gourmand land. Where food is either nice and cold or fresh from the oven... literally.\" \"Gotcha.\" you replied back.<br>\r\n<br>\r\nEdith was starting to fly lower. You must be getting close to her favorite spot. She landed on what appears to be a huge round and flat iceberg. It was big enough to be a hockey rink. \"Here we are!\" Edith said. You were a bit confused as to how this plain empty area was Edith's usual spot so of course you had to ask her, \"Sooo, what are we doing here?\" \"Ooh, I'm so glad you asked!\" Edith said sounding a bit excited<br>\r\n<br>\r\n<br>\r\n\"We are going to...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1588514340,
            "id":2829233,
            "title":"Continue"
        },
        "1313222111111111111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"Ice skate!\" Edith squealed. You were surprised at her idea. Given her... figure, you'd never guess ice skating was one of her favorite activities. \"Really?\" you asked not sounding confident about her idea. Edith answered, \"yes, really.\" then asked, \"Don't you ever ice skate?\" As sad as your response was, you had to tell her, \"Not really. In fact, where I'm from, it takes a miracle for it to even snow.\" Edith frowned a bit at your answer, \"Well that doesn't sound fun where you're from. No offense.\" \"Nah. You're not wrong really.\" Edith perked up again and said, \"Ok then. I'm going to teach you how to skate.\" She then placed you on the ice and spoke again, \"In fact, you can watch me do the basics, some neat tricks, and a big finish to top it all off.\" <br>\r\n<br>\r\nEdith then flew to the center of the area and prepared to show you but not after some stretching and warm ups. All you could do was watch and learn. Edith stood motionless for a few seconds and then started skating around like an actual figure skater! She preformed jumps such as axels and waltz, as well as spins like camel and upright. <br>\r\n<br>\r\n<br>\r\nYou were in awe at this. Your eyes were wide eyed. You thought Edith was so majestic, that you couldn't stop staring at her. <br>\r\n<br>\r\n<br>\r\nFinally, Edith made a big finish and came to a complete stop right in front of you while wiping a little sweat off her head. \"Phew!\" she said. She then gently picked you up and asked, \"So, what did you think?\" while smiling at you. \"THAT WAS AWESOME!!!\" you quickly responded. You realized that you sounded like a silly fanboy and blushed in embarrassment a little while Edith giggled at it. \"Uh I mean uhh, yeah you were great. How did you learn to do all that?\" you followed up. \"Well I had to do something else with my spare time. So are you ready?\" She asked. \"Uh ok.\" You said still a bit unsure. Edith smiled, \"Great! With you and me skating together, this will be twice as fun!\" she squealed again.<br>\r\n<br>\r\nNow Edith decides you're her partner? You grew more nervous at that. You worried about how you were going to pull it off. But there lies another problem...<br>\r\n<br>\r\n<br>\r\nHow would you and her skate, despite the size differences?<br>\r\n<br>\r\n</span></div></div>",
            "created":1588522200,
            "id":2829294,
            "title":"Edith on ice."
        },
        "13132221111111111111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue?"
            ],
            "content":"<div class=\"\"><div> <span>You were about to skate with the lovely and THICC Edith Up, but there still lies the problem: You're still very small. How would this work? You asked her, \"So how are we going to do this? You know, with me being small?\"<br>\r\n<br>\r\nEdith didn't answer, instead she placed you back on the ice, touched your forehead with her sparkly finger and then...<br>\r\n<br>\r\n<br>\r\n*POOF*<br>\r\n<br>\r\n<br>\r\nNext thing you knew, you looked at yourself and saw that you actually grew a bit! You were surprised. You looked at Edith and saw she was still a bit taller than you but not big enough to eat you again, heaven forbid that happens again.<br>\r\n<br>\r\n\"There! Now your ready.\" Edith said. \"Wait, did you just...\" you tried asking but Edith already explained, \"Yes, I used my size changing magic to make you bigger.\" \"Wait. That was actually possible this whole time and you never even told me???\" you asked in bewilderment. \"You never asked.\" Edith shot back as you facepalmed yourself making her giggle. Edith spoke up again, \"Oh and also, it's temporary. Thought it was best to wait for the best moment.\" You understood, \"Ok, fair enough.\"<br>\r\n<br>\r\nWell enough talk, it's time.<br>\r\n<br>\r\n<br>\r\n\"So, shall we my dear?\" Edith said as she held out her hand asking for yours. Being a gentleman, you gently took hers and positioned yourself just as she did the same.<br>\r\n<br>\r\n\"On three, ready?\" Edith asked. You just nodded your head. \"One. Two. Three!\" She said as you both skated together. You both started off slowly and it was so far, so good for you. You remembered everything she showed you and it's been working. You both skated a few laps around the ice arena and then skated back and forth. At the same time, she started twirling you a bit and was signaling you to do the same. You did so and actually nailed it. Next you were both holding on to each other's hands and made circles while staring at each other. You blushed at looking at Edith's pretty face as well as her long blonde hair waving around.<br>\r\n<br>\r\nAs you both kept making circles, Edith spoke up again, \"You're doing great, sweetie. Now are you ready for a few new tricks?\" \"Uhh, I think so. Like what?\" You asked. Edith giggled and said, \"I'll show you.\" She then brought you to the edge of the ice and started spinning you until you were like a tornado and tossed across the arena while you shouted, \"WHOAOAOAO!\" You kept spinning and when you were close to the other side, Edith, who was already at the other side before you, caught you, making you stop spinning. You were dizzy but you shook it off and was told to do the same thing with Edith. You did so and spun her around until she was a tornado as she shouted, \"WHEEEE!\" and then caught her when was at the other side of the ice. She was a little dizzy herself. Guess you don't know your own strength.<br>\r\n<br>\r\n<br>\r\nEdith spoke up again, \"Ok, dear. Now we're going to do one last thing to wrap it up. I want you to do some more tricks and pull off that big finish I showed you.\" \"Ok.\" you simply said but Edith wasn't finished, \"While carrying at the same time!\" She flew up as you said, \"Wait, what was that last par-OOF!\" you tried to say but Edith then landed on your back. You were about to cave in but quickly used both hands and lifted Edith in the air. You were struggling and asked her, \"Are you sure about this?\" \"C'mon now! You're a big strong boy! You can do it!\" she cheered. She really trusts you with this. You couldn't let her down, literally nor metaphorically. You breathed in and out and said, \"ok\" to yourself and finished this, even though your legs were shaking.<br>\r\n<br>\r\nYou proceeded to skate again, pulling off everything you watched Edith do. Finally it was time for the grand finale. You then got to the center and started spinning like there's no tomorrow. Afterwards you came to a complete stop and posed like a strong man while Edith posed like a flyer, even though she already is one. You sweated and panted feeling good about everything.<br>\r\n<br>\r\nThen you started hearing applause and cheering. You looked around and saw various creatures out of nowhere clapping and cheering at your performance while a few others held up cards, all saying \"10\" on them. You were a bit confused at that but didn't feel like asking any more questions. Then Edith got off you and gave you a quick peck on the cheek which made you blush a bit.<br>\r\n<br>\r\nThe unexpected audience then disappeared, leaving you and your skating teacher alone. Edith was so proud of you, \"I knew you could do it! You very talented!\" You scratched your head smiled at her and said, \"Yeah well I couldn't have done it without you. So thanks.\" Edith smiled back, \"Of course.\" She then got closer to your face and said, \"So, I guess this makes you my ice King and me your ice queen, hmm?\" she said in a flirtatious manner. You blushed once again and said, \"Uhh ok.\"<br>\r\n<br>\r\nThen you started glowing. \"Uh, what is this?\" you asked in a worried tone. Edith of course knew, \"Oh just the magic wearing off.\" \"Oh, that's too bad. I was actually enjoying this.\" You said rather disappointed. Edith simply cheered you up, \"Don't worry, there's always next time.\" She then got closer to you with a lovey dovey face and said, \"Now I want to do one last thing before you return to normal.\" \"What's tha-WHOA!\" you tried to ask but she quickly grabbed you with both hands shouting, \"COME HERE, YOU!\" and embraced you hard, smothering you with kisses! \"AHH! IS THIS REALLY HAPPENING?!\" you shouted in the middle of a kissy attack.<br>\r\n<br>\r\n\"MWAH! MWAH! MWAH! MWAH! MWAH! MWAH! MWAH! MWAH! <br>\r\n*SMMMMOOOOOCH\"<br>\r\n<br>\r\nShe finally let you go, covered with kiss marks all over you and you finally shrunk back down and laid flat on the ice panting and dazed after what just happened. \"Where am I?\" you dizzly said.<br>\r\n<br>\r\n<br>\r\nEdith laughed and gently picked you up again and asked, \"So what shall we do now?\" You shook your head and thought about it. Only one idea came to mind, \"Well I'd sure love to eat some more of those cookies.\" Edith perked up, \"Ooohh, that's a great idea! Ok let's go!\" she said as she flew back to her house while you held on to her fingers.<br>\r\n<br>\r\nYou thought about what a fun day this was with the lovely and hungry nymph even if she was rather flirty with you, but that will probably happen with the rest of her sisters too. <br>\r\n<br>\r\nYou looked back at Edith and saw how majestic she was with her bright smile and long wavy blonde hair. You also wondered what she was wearing on her head. Still you blushed at how pretty she was and turned your head back and wondered about something after what she just did...<br>\r\n<br>\r\n\"Does Edith \"like\" like me?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1588570680,
            "id":2829730,
            "title":"A very \"cool\" performance."
        },
        "14":{
            "author_id":"almost2922",
            "author_name":"Lucius",
            "choices":[
                "Cat and mouse.",
                "Truth or Dare",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, Anny was the first to find him when he got 'lost' so I think she should get him first.\"  Everyone reluctantly agreed. Annetta took you carefully from Edith and began discussing your schedule with the others.<br>\r\n<br>\r\n\"Ok, so it'll be me, then Helena, then Holly, then Edith, and finally Betilla. That sound good?\" Annetta asked, and everyone agreed on the schedule. Annetta soon left and brought you to the pier. You looked down from her hand and saw the blue water rippling below. \"Uhh, what are we doing here, Miss Annetta?\" You asked Annetta as you looked up at her, you had to admit something about the sea air made her sparkle with even more beauty. \"Well, I am the ocean nymph. My house is at the bottom of the sea, so you might want to hold on!\" Annetta said as she dove into the ocean, you in her hand. The rush of water felt a bit painful at your size, but you managed to hold on to her index finger as you both drifted down to the bottom of the ocean floor. <br>\r\n<br>\r\nAnnetta might be the ocean nymph, but you can't breathe under water. Soon, you let out all your breath and began gasping for air halfway down to the ocean floor, waving your arms around trying to get Annetta's attention. Your attempts are successful, as Annetta looks at you with a questioning look on her face. You point to your head and make a breathing motion as you also point to go up. Annetta simple shakes her head and hoists you up to her face. You're curious as to what she's trying to do, but now you're really starting to suffocate. That's when Annetta places you near her mouth.<br>\r\n<br>\r\nAnnetta wraps her lips around your face and blows air into your lungs in order to keep you alive as you finish your descent to the ocean floor. She enters her house, which seems to be inside a bubble and opens the door and steps inside.<br>\r\n<br>\r\n\"Well... that was fun...\" you gasp as you cough up a bit of water. \"I dunno, you seemed to enjoy the last part.\" Annetta giggled as you blushed in embarrassment \"Maybe if you're lucky, you'll get another kiss early.\" Annetta said as she made a kissy face at you, making you blush even more. These nymphs were really flirty when they were alone with you.<br>\r\n<br>\r\n\"Well, I think it's time we had some fun. How about we play a game of...\"</span></div></div>",
            "created":1325480400,
            "id":1251310,
            "title":"Annetta Fish"
        },
        "143":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Hide and seek!",
                "Stop n go!",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else does Annetta have in mind?</span></div></span></div>",
            "created":1587445200,
            "id":2821988,
            "title":"Other"
        },
        "1433":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Pirate! ( How appropriate)",
                "Whale attack!",
                "Other. (Readers choice)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Annetta is still thinking...</span></div></span></div>",
            "created":1587704400,
            "id":2823617,
            "title":"Other"
        },
        "14332":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "\"Just keep swimming...just keep swimming"
            ],
            "content":"<div class=\"\"><div> <span>Annetta finally decided, \"Whale attack!\" You didn't like the sound of that. \"Uhh, how do we play that?\" you asked hoping it's not what you think it is. \"Weellll\" Annetta answered while giving a sneaky grin on her face which made you more nervous. \"It's where I pretend to be a hungry whale and try to hunt down my prey.\" Annetta explained while leaning her head closer to you while using a finger to poke your body, \"That prey being YOU of course!\" she finished.<br>\r\n<br>\r\nIt was just like you feared. All you could do was try and talk her out of it. \"What?! You mean you're going to try and eat me?! That's disgusting! What if I accidentally get chewed on? Or get digested by your stomach acid? Not to mention...I taste terrible!\"<br>\r\n<br>\r\nAnnetta simply laughed, \"Hahaha! Aww, don't worry my little starfish.\"<br>\r\n<br>\r\nAww, she gave you a nickname. How sweet!<br>\r\n<br>\r\nAnnetta then continued, \"Thanks to the magic, your protected from such things.\" \"Really?\" you simply asked. \"Of course!\" Annetta said. \"Remember your little... incident with Edith?\" She then asked. You shuddered at that reminder, \"Ugh! I was trying to block that off! Thanks alot!\" you sarcastically said.<br>\r\n<br>\r\nAnnetta laughed again at that moment awhile back and decided to get to playing, \"Ok enough talk, let's play! I hope you're a good swimmer.\" she said as she picked you up gently and took you back outside her house.<br>\r\n<br>\r\nA thought struck to you, however: \"Wait! In case you've forgotten, I can't BREATHE underwater!\" you spoke up. \"Oh! Of course. Silly me.\" Annetta giggled as she started doing something with her magic. Seconds later, she zapped you which surprisingly felt nice. Still, you had to ask, \"Whoa! What did you do?\" \"I cast a diving spell on you. Now you can swim AND breathe underwater.\" Annetta explained. Despite that, you were a bit unsure about this. \"Trust me. It will work. I've done this before.\"  the sea nymph assured. You nodded in agreement.<br>\r\n<br>\r\n\"Ok, once we're outside, I'm going to count to 100 and you're going to try and swim as far away as possible.\" Annetta told you. At least she's nice enough to give you a head start. You simply said, \"ok\".<br>\r\n\"Oh and also, I bet you do taste delicious!\" Annetta said as she licked her lips. You were irritated at this, \"Ok seriously?\" you groaned. Annetta giggled, \"What? I'm just saying, you're so cute, I could just eat you up!\" There she goes again being flirty.<br>\r\n<br>\r\n\"Shall we?\" Annetta asked... not that you had a choice, of course.<br>\r\n\"Ok\" you reluctantly said. Annetta then stepped out with you in her hands and in no time, you were both underwater again. Thankfully like Annetta promised, you were able to swim and breathe underwater. \"I could get used to this.\" you thought as you got off Annetta's hand and swam around. You were enjoying so much, you decided to do tricks like a loop de loop. Annetta watched and smiled in adoration. Then she spoke up, \"Having fun my little starfish?\" You nodded. \"Good. But it's time to play our game. I'm counting now.\" she said as she closed her eyes and counted. \"Oh shoot!\" you thought as started to do swim away really fast.<br>\r\n<br>\r\n<br>\r\nWhile you were swimming, a thought came to mind: That character Dory from \"Finding Nemo\" sang something you knew very well...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1587704400,
            "id":2823635,
            "title":"Whale attack!"
        },
        "143321":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"Just keep swimming...just keep swimming...\" you repeatedly sang in your mind as you kept swimming away from Annetta, your \"predator\".<br>\r\n<br>\r\n<br>\r\nWhile you were swimming, you couldn't help but admire the underwater scene. It was beautiful! The clear blue sea, the sun shining under water, the sea creatures, some that were singing. What surprised you though was that they actually sounded like Alvin and the Chipmunks! Of course you were in another world so it makes sense. Not to mention You now know what it's like to be on \"SpongeBob\" or \"The little mermaid\". ( Lot of famous underwater references, huh?) You saw more sea critters such as goldfish, clams, and even jellyfish... which knowing how dangerous they are, you turned around and swam somewhere else. You continued enjoying the peaceful scenery not even having a care in the world. In fact, so much, there's something you were trying to remember but nothing popped up. So you just lazily swam backwards, gently kicking your feet, closing your eyes thinking everything's all good. <br>\r\n<br>\r\n<br>\r\nUnfortunately, it didn't last.<br>\r\n<br>\r\n\"READY OR NOT, HERE I COME!\" A familiar voice rang.<br>\r\n<br>\r\nYou then snapped your eyes in realization of what that important thought was: You were being hunted by a beautiful underwater nymph! The peaceful music you were hearing just now turned into something from \"Jaws\". You started frantically looking around and noticed Annetta already looking around for you. Thankfully, she doesn't see you yet. You looked around again for somewhere to hide. You find a big rock and swim behind it to hide. Annetta swam right passed it. You peeped out and saw the mermaid-like nymph swim right passed you. You exhaled in relief and waited a few minutes until the coast was clear. <br>\r\n<br>\r\n<br>\r\nYou looked around some more while in a dark cove right behind you, a pair of eyes appeared. You then had a sick feeling in your gut that something was watching you. Even though you didn't want to, you had to turn around and see only to have your sick feeling come true. You did see a pair of eyes. Could this mean Annetta has found you and you were her snack???<br>\r\n<br>\r\n\"Oh no! Please no!\" You said while shivering in fear...<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1587704400,
            "id":2823649,
            "title":"\"Just keep swimming...just keep swimming"
        },
        "1433211":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span>You continued shaking in fear like Scooby-Doo. The pair of eyes came closer to you as you got ready to swim away.....<br>\r\n<br>\r\n<br>\r\nOnly to realize it was just a bunch of random sea creatures such as puffer fish and eels...which made no sense but you sighed in relief, nonetheless. You chuckled a bit and relaxed. You then saw another set of eyes and safely assumed it was more fishies. You said \"Hi more fishies.\" as you waved at them...only for the eyes to reveal your predator: ANNETTA FISH!<br>\r\n<br>\r\nYour relief turned back into fear, your color turned pale white and you shouted, \"OH NOOO\" like Mr. Bill as Annetta brought her face closer to you and said one thing to scare you more:<br>\r\n<br>\r\n<br>\r\n\"BOO!\"<br>\r\n<br>\r\nYou screamed and then swam away faster than the road runner on the road. After only a minute of swimming, you turned around (even though you didn't want to) to see that Annetta wasn't even behind you! Still you couldn't take the risk and kept swimming. You then turned your head back, only to smack into something. Two somethings really that kinda felt like pillows. You looked up and saw Annetta with a smirk, who somehow got ahead of you, meaning you smacked into her breasts, much to your embarrassment. \"Going somewhere?\" she said with both her hands on her hips as she plucked you out and held you with her fist and teased you, \"You didn't hide very well.\" \"What do you mean?\" you asked. \"I knew you were behind that rock. I wanted to do something sneaky.\" Annetta said getting more cocky by the second. You tried struggling to escape and then tried begging for mercy, \"Oh come on! Give me another chance please!\"<br>\r\n<br>\r\nAnnetta \"thought\" about it for a second. \"Hmmm...nope! Now come to my tummy, my little starfish!\" she said while bringing you closer to her mouth, licking her lips and opening her mouth wide, \"Ahhhh\". <br>\r\n<br>\r\nYou sweated in fear (even though you were underwater) and kept struggling and struggling to escape....<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1587704400,
            "id":2824041,
            "title":"UH OH!"
        },
        "14332111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "In the belly of the whale nymph."
            ],
            "content":"<div class=\"\"><div> <span>Annetta was getting closer to making you her snack, her mouth wide open! You continued struggling to escape. When Annetta was close enough to snatching you with her mouth, you manage to loosen her grip and slipped right out of her hand in the nick of time, her mouth missing you in the process. Annetta noticed this and saw you swimming away from her once again while you taunted at her, \"Whoo hoo! To slow!\" She snapped her finger and cursed, \"Aw seahorses!\" with an irritated look on her face. That look quickly changed to a smirk as she said, \"Well whatever. I love it when they play hard to get anyway!\" She then proceeded to chase you. <br>\r\n<br>\r\n<br>\r\nYou were swimming as fast as you can to get away from your lovely predator but no matter what, she was able to catch up to you. She then called out to you, \"You're a good swimmer, little guy. But I'M BETTER!\" \"We'll see about that!\" You shot back. You then noticed a bunch of obstacles underwater and tried using them to escape. You passed through a broken sunken ship, around a bunch of jellyfish, through a dark trench and even through that dark cove where Annetta surprised you. Not to mention some loop de loops to try and throw her off. Still, she's was right on your tail! You wondered if you could actually out run ( or in this case, out swim) her.<br>\r\n<br>\r\nFive minutes of chasing later, you were starting to get tired while Annetta was barely breaking a sweat. You wanted to call \"Time-out!\" but she probably wouldn't do it so you kept swimming, despite your strength still draining slowly. Unknown to you, Annetta had a sneaky look and tried something. While you were about to turn, you swam in one direction while Annetta swam in another. It took you not even ten seconds before you turned around and realized she was gone. You smiled in relief thinking you finally lost her. Unfortunately, you were wrong. While you kept on swimming, not even paying attention, Annetta popped her head out of nowhere, her mouth wide open! By the time you turned your head, it was too late! You swam right into her cavern of a mouth, her jaws snapping shut and trapping you in the process. \"NOOO!\" you exclaimed as you went back to fear. You were already near her throat. You then noticed her uvula and grabbed on to it. The little bit of flesh was dangling, but you were determined to hold on. Sadly, it didn't last as you saw her mouth open and water came rushing in all over you like a tidal wave. It made your grip start to slip until you finally fell down her throat. Annetta then gulped you up. She finally ate you like an actual whale! As she felt you go through her esophagus, she rubbed her tummy with a satisfied look and said exactly what she thought when she swallowed you...<br>\r\n<br>\r\n<br>\r\n\"YUMMY! HEEHEEHEE!\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1587790800,
            "id":2824268,
            "title":"Playing hard to get."
        },
        "143321111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You were spat out into the stomach along with some water and bounced around like it was a trampoline. Finally, you stopped and laid flat on the flesh, moaning and groaning. You came to and looked around hearing the stomach growling, and the heartbeat echoing. You were really eaten by the lovely sea nymph, Annetta fish. You got up and noticed the stomach acid and quickly stepped back not wanting to get digested. You backed up into the stomach wall, turned around and tried pounding it with your fist to try getting her attention. \"Hey!\" you called out. After some more pounding, your world shook causing you to stumble and land on your back. You also heard familiar giggling, it was Annetta. She answered, \"Hey, that tickles! Are you ok in there?\" You were irritated by her response and answered back, \"How is being in your stomach ok?!\" \"Sorry, just part of the game, that's all.\" she answered in a singing tone. You were still annoyed but she had a point. She really wasn't meaning to harm you. Playing with her and her sisters WAS in the \"contract\" that you \"agreed\" to. You spoke up, \"Ok well you ate me now. So I guess you win. Now can you get me out of here, please?\" \"Actually, the game is not over yet.\" Annetta said. Now you were confused, so of course you had to ask, \"What do you mean?\" Annetta explained, \"Well, I read about a cute little boy, like you are, who got eaten by a giant sea creature and had to find a way to escape. I want to see if you can do the same.\" You listened to her and realized that most of what she just said sounded familiar, like from a movie that was pretty dark for a children's movie. You facepalmed, \"You're kidding me.\" you muttered to yourself. \"No I'm not.\" Annetta said, surprising you. How did she hear that? She spoke again, \"Come on, you can do it. I mean look at what's happened so far. Someone could actually write a story about this. Just as long as it has a happy ending.\" Sounds like you didn't have much of a choice. You sighed, \"Alright I'll try.\" Annetta giggled at your dry response, \"That's the spirit. And don't worry, I'm patient, but don't keep me waiting too long, ok? No pressure.\" Now she was just messing with you. You looked up and saw the exit out of the stomach and there was only one option...<br>\r\n<br>\r\n\"Well, better get to climbing I guess.\" You grabbed on to the flesh tight which made Annetta giggled some more. \"Boy she sure is ticklish.\" you thought. Just then, a light bulb appeared over your head, and a bright one at that. Her constant giggling gave you another idea. A devious smile appeared on your face. What were you planning?<br>\r\n<br>\r\n<br>\r\nOutside, Annetta was lounging around the sea looking more like a mermaid than a nymph. She rubbed her tummy some more wondering how you will escape her belly. Just then she started feeling something that her giggle. Then it escalated into laughter as she put both of her hands on her belly. \"Hey! What are you doing in there?!\" she laughed so more.<br>\r\n<br>\r\n<br>\r\nBack inside, you heard laughing. It sounded like your plan was working but you had to go all out. \"Well, here goes nothing!\" you said with confidence...<br>\r\n<br>\r\n<br>\r\nWill you actually escape?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1587790800,
            "id":2824679,
            "title":"In the belly of the whale nymph."
        },
        "1433211111":{
            "author_id":"flashfan2",
            "author_name":"flash",
            "choices":[
                "Continue?",
                "Readers choice."
            ],
            "content":"<div class=\"\"><div> <span>You put your hands on the soft stomach wall and tickled with your fingers REALLY hard which made Annetta laugh like crazy! You can hear her, \"AHH! HAHAHAHAHAH!! PLEASE STOP! I CAN'T TAKE IT! HAHA!\"<br>\r\n<br>\r\nYou weren't going to stop however...unless she agreed to what you say to her next. You stopped tickling and told her, \"You want me to stop? Then let me out of here!\" You heard Annetta gasping for... whatever it is underwater and finally answered, \"No! I said for you to escape, not for me to let you out!\" Boy, she's relentless but you weren't having it anymore. \"C'mon miss Annetta, make this easy on yourself or else...\" you said as you went back to tickling her hard. She laughed like crazy again, \"AHH HAHAHAHA! PLEASE! NO MORE!\" \"Let me out!\" you said. \"NEVER! HAHAHAHA!\" she said back. Annetta was rolling around due to your extreme tickling which shook your entire world. So much in fact that you were rolling around too. When the shaking came to a complete stop, so did you. You laid flat thinking how fun that actually was. She really enjoyed it too. You can tell by the shaking and her heart beating faster than usual. Still, you weren't giving up. You wanted to tickle her again but your fingers were tired. You then noticed something that came out of nowhere: a piece of seaweed! \"Huh?\" you simply said. You crawled towards it to get a closer look. You wondered where it came from. Did Annetta eat it accidentally? Was it in her stomach acid and it splashed out because of the shaking? Wait! Why were you even thinking all that when you could use it to tickle her some more? You smiled mischievously and picked it up ready for another tickle attack. \"Let's see how you like this, Annetta.\" you said as walked back to her stomach wall.<br>\r\n<br>\r\n<br>\r\nBack outside, Annetta was laying down flat on her back, still hyperventilating from all the tickling. She looked down to her belly and thought, \"Oh my, he sure is a fighter.\" She realized you haven't done anything since then and thought you were resting. She was wrong! Out of nowhere, she felt another tickle attack and screamed, \"AHHH! NO! NOT AGAIN! HAHAHAHA! PLEASE STOP!!!\"<br>\r\n<br>\r\n<br>\r\nBack inside, you tickled her with the seaweed and boy was it working! She was laughing out loud again. Your world shook again, but you kept your balance this time simply by grabbing her flesh and kept tickling. You then noticed something: a bubble! You looked around wondering where it came from...only to see more bubbles in her belly. They were coming from the acid! You then had another idea. You could jump in one of the bubbles and float on out of here. You ran and jumped into one, with the seaweed still in your hand and it was working! You were floating higher and higher until you finally made it out of her stomach. You weren't out of the woods yet though as you made it back up the esophagus and continued floating up. Halfway through, you heard Annetta's heart again, only this time, it was louder but only because you were closer to it. BABUM BABUM! you listened to. You wanted to make a joke about winning a woman's heart, but you had to focus on getting out. <br>\r\n<br>\r\nFinally you reached Annetta's throat. You were near her uvula again and reached out and grabbed it, popping the bubble in the process. You were almost there. Now how were you going to get out? You then noticed something up above you: two passages. You guessed it was her nasal cavity. Once again you got another idea: you climbed up the dangling flesh, reached out and used the seaweed to irritate her nose. Otherwise known as pulling a \"Pinocchio\"! You tickled as much as you can and hoped for the best.<br>\r\n<br>\r\n<br>\r\nBack outside, Annetta calmed down from yet another tickle attack. She was wondering what you were up to this time. Then she started to feel a tickle in her throat. She rubbed it with her hand but then her nose started twitching. She was sniffling and felt a sneeze coming. <br>\r\n\"AH AHH AHHH!!\"<br>\r\n<br>\r\nInside, you saw that your plan was working. She was about to sneeze. You tickled one last time and braced yourself. This is it. Sweet freedom was but a sneeze away.<br>\r\n<br>\r\n\"AHHHH CHOOOO!!!!\" Annetta finally sneezed, sniffling afterwards. She then noticed something swimming towards her. She looked a little closer and was shocked. It was you! You finally escaped.<br>\r\n<br>\r\nYou swam closer to her and waved at her, \"Hey!\" you simply said. Annetta rubbed her eyes to make sure she was seeing right...and she was. You then spoke again, \"Looks like I win.\" with a grin. <br>\r\n<br>\r\nAnnetta was still shocked and finally spoke, \"What the? Wait...that tickle in my throat, the itching in my nose and the sneezing...THAT WAS YOU?!\" You chuckled at her reaction and answered, \"Yes ma'am, it was.\" Annetta then pouted, wrapping her arms around and gave a \"Hmph!\" \"Well you sure have alot of nerve doing all that to a lady like me!\" Is she really doing that now? \" Hey! You said to escape. Which I did!\" you said in your defense. Annetta then turned around still pouting. You tried to cheer her up, \"Besides, you have to admit that was fun... especially the tickling, right?\"<br>\r\n<br>\r\nA few seconds ago, the sea nymph turned back around, this time looking at you with a smirk. \"Yeah your right. Thanks for a fun time, my little merman.\" she said as she patted your head with her finger. Wow! You got a new nickname! You were pretty flattered at that. She then reached out her hand and you grabbed her finger. She brought you closer to her face and said, \"Oh and before I forget. Mmmm!\" <br>\r\nShe puckered her lips and gave you a big wet kiss! <br>\r\n<br>\r\nSMOOCH. \"MWWWAH!\"<br>\r\n<br>\r\nYou were completely dazed and your face was red. Annetta giggled and said, \"Like I promised. So...how about we go back to my house and relax?\" You snapped out of your daze and said \"Ok.\" <br>\r\n<br>\r\n\"Great. Maybe you can tell me more about yourself.\" Annetta said as she winked at you. She then swam back home with you hanging on to her finger.<br>\r\n<br>\r\nYou thought about this day you had and it wasn't even over yet. You played with a beautiful woman who is both a nymph and ( in a way) a mermaid. And a friendly one at that. You turned around and looked at her. She looked absolutely majestic. It made you feel something. You then blushed a little, turned your head back and said to yourself something you never thought you would say...<br>\r\n<br>\r\n<br>\r\n\"I think I'm going to like it here.\"<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1587877200,
            "id":2824797,
            "title":"The great and hilarious escape."
        },
        "15":{
            "author_id":"almost2922",
            "author_name":"Lucius",
            "choices":[
                "\"..Sure I'll dance, but I might not be good at it...\"",
                "\"Uuh... maybe some other time, let's do something else.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Holly's been pretty quite, how about we give him to her first?\" Betilla suggested, as Holly dug her foot into the ground a bit, blushing. Everyone agreed on this, and handed you off to Holly.<br>\r\n\"Alright then Holly, Betilla will get him next then-\" However, Helena never finished her sentence, the wind was nearly knocked out of you as Holly darted back to her home in the desert. She almost forgot to say goodbye, but she shouted it as she left the glade.<br>\r\n<br>\r\nYou gagged a bit when Holly set you down on her table, she flew at what seemed like the speed of light to get you to her house. After you gathered yourself, you noticed that a radio was on nearby and that Holly was swaying about her kitchen a bit. \"Guess that's why she's the music nymph...\" You sighed to yourself, as you felt a powerful force knock you over. \"Oops, I guess that was a little bit to rough...\" Holly said as you hit the table top. You got up and turned to see that she must have bumped you with her hips when she was swaying.<br>\r\n<br>\r\n\"You were a bit excited to get me here huh?\" Holly blushed a bit at this, and fiddled with her radio a bit. \"Sure... I've never had a little person like you in my home before. I've always wanted to try something...\" You gulped nervously at this, that could be a bad sign. However, your stress was eased a bit as she held her hand out. \"Care for a dance little one?\" Holly said with a warm smile. It was hard to resist a question like that, especially when a pretty woman asks you.</span></div></div>",
            "created":1325480400,
            "id":1251330,
            "title":"Holly Luya"
        },
        "152":{
            "author_id":"sianostraka",
            "author_name":"smr",
            "choices":[
                "Butt Crush",
                "Boob Crush"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What then should she do?</span></div></span></div>",
            "created":1414731600,
            "id":1879809,
            "title":"\"Uuh... maybe some other time, let's do..."
        }
    },
    "info":{
        "author_id":"almost2922",
        "author_name":"Lucius",
        "brief_description":"The lovely Nymph sisters of Rayman Origins shrink you down and use you as a play-thing",
        "created":1325479620,
        "description":"<td align=\"left\" class=\"norm\">It seems as though the Nymph sisters are a bit bored after the events in Rayman Origins, so they decided to poof up a human to play with.<br>\r\nBad news is, it's you. (Or is that good news?) However, the magic used to teleport you into this crazy world also effected you. You can be crushed, stretched and many other things and survive! <br>\r\n<br>\r\n<br>\r\nRules:<br>\r\nKeep this only between you and the sisters, you can have them all around, or choose one at a time.<br>\r\nYou can die, but in this world it's a bit difficult. Remember, you can be crushed and survive though it might still hurt.<br>\r\nVore and any insertion should be light. No toilet stuff.<br>\r\nDon't be afraid to get a little goofy, this is a crazy world! Just don't get too carried away.<br>\r\nPlease, no lesbian things. The Nymphs can shrink to your size, but they shouldn't do that during the story.<br>\r\nUse proper english to the best of your abilities.<br>\r\nThird person only please. (I.E. You jumped off the table)<br>\r\n<br>\r\n<br>\r\nCharacters: Keep in mind, while some of the Nymphs are wise they still act a bit goofy at times. It is rayman's world after all!<br>\r\n<br>\r\nBetilla: Betilla is the oldest of all the Nymphs, but she still succumbs to childish antiques like her sisters. <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://raymanpc.com/wiki/script-en/images/thumb/e/e6/RaymanOrigins_003.jpg/320px-RaymanOrigins_003.jpg\" target=\"_blank\">http://raymanpc.com/wiki/script-en/images/thumb/e/e6/RaymanOrigins_003.jpg/320px...</a><br>\r\n<br>\r\nHolly Luya: Holly is referred to as the Music Nymph. And is always up for making music or dancing to a beat. <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://raymanpc.com/wiki/script-en/images/thumb/1/16/HollyLuya.png/240px-HollyLuya.png\" target=\"_blank\">http://raymanpc.com/wiki/script-en/images/thumb/1/16/HollyLuya.png/240px-HollyLu...</a><br>\r\n<br>\r\nEdith Up: As her name might suggest, Edith is referred to as the Gourmet fairy. She eats quite a bit, but never seems to gain any weight. However, she's still the most bodacious of the sisters. Even though she is just a bit plump. <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://raymanpc.com/wiki/script-en/images/thumb/f/f6/EdithUp.png/240px-EdithUp.png\" target=\"_blank\">http://raymanpc.com/wiki/script-en/images/thumb/f/f6/EdithUp.png/240px-EdithUp.p...</a><br>\r\n<br>\r\nAnnetta Fish: As her name might suggest, Annetta is referred to as the Ocean Nymph. She spends most of her time in the water, but does come onto land occasionally. <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://raymanpc.com/wiki/script-en/images/thumb/9/9f/AnnettaFish.png/240px-AnnettaFish.png\" target=\"_blank\">http://raymanpc.com/wiki/script-en/images/thumb/9/9f/AnnettaFish.png/240px-Annet...</a><br>\r\n<br>\r\nHelena Handbasket: Helena is referred to as the Mountain Nymph. She's also the most rowdy of the sisters, and has been known to break her toys as a child. Good thing you're damage proof...To an extent. <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://raymanpc.com/wiki/script-en/images/thumb/7/7a/HelenaHandbasket.png/240px-HelenaHandbasket.png\" target=\"_blank\">http://raymanpc.com/wiki/script-en/images/thumb/7/7a/HelenaHandbasket.png/240px-...</a></td>",
        "id":1837281,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1589781720,
        "modified":1589781720,
        "pretty_title":"The Nymphs toy"
    }
}