{
    "chapters":{
        "1":{
            "author_id":"footlover123",
            "author_name":"feet",
            "choices":[
                "Sonic",
                "Shadow",
                "Tails",
                "Knuckles",
                "To the girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is  the victom</span></div></span></div>",
            "created":1226725200,
            "id":607985,
            "title":"Choose a guy"
        },
        "11":{
            "choices":[
                "He heads home.",
                "His feet grow to the size of Chemical Plant Zone.",
                "He heads to Tails's house.",
                "He goes to Angel Island.",
                "Sonic's feet grow to the size of Dr.Eggman's feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sonic was running through Chemical Plant zone,where the chemicals are used by Dr.Eggman to make someone's feet bigger.Sonic tripped on a Badnik and,being close to one of the chemical vats,fell in.He found a ladder and felt strange.</span></div></span></div>",
            "created":1353733200,
            "id":1474446,
            "title":"Sonic"
        },
        "111":{
            "choices":[
                "Eggman's feet",
                "Sonic's bedroom",
                "Sonic's House"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sonic arrived home and considered taking a nap.Tails got home,went into Sonic's room,and looked at his feet.They were growing to the size of…</span></div></span></div>",
            "created":1353733200,
            "id":1474454,
            "title":"He heads home."
        },
        "113":{
            "author_id":"mariomadman",
            "author_name":"Servant to the Blue",
            "choices":[
                "His feet were growing again (Options on size)",
                "Tails walked into the house",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Sonic pulled himself out of the vat, dripping with the chemicals,<br>\r\n\"Gross!\" he said in disgust. He tried best to shake  off as much of<br>\r\nthe stuff as he could, but it wouldn't come off. \"Oh well,\" He sighed,<br>\r\n\"I guess I'll just have to take a shower when I get to tails' place,<br>\r\nI'm sure he wont mind, sometimes it's practically like I live there!\"<br>\r\nSo the blue hedgehog, now covered in the greenish gunk started <br>\r\noff again, running to tails' house. <br>\r\n<br>\r\n                            On the way to his buddy's house,Sonic didn't notice <br>\r\nwhat the chemical was doing, it traveled down his legs and <i>into</i> <br>\r\nhis shoes! Shortly after arriving he noticed that the gunk was almost <br>\r\ncompletely gone, \"I guess a run was all I needed to get that stuff off,<br>\r\nbut something seems a bit wrong, it feels as if my shoes are tighter than<br>\r\nusual, probably just my imagination, those chemicals must've messed<br>\r\nwith my head.\"<br>\r\n          <br>\r\n    Sonic knocked, but no one answered, he then tried the knob,<br>\r\nbut the door was locked, \"Tails must be out testing some new<br>\r\ninvention,\" he thought, \"Well I'll just let myself in then.\" He pulled away <br>\r\nthe false panel on the door to reveal a spare key, unlocked the door and<br>\r\nlet himself in. Tails had a rule about not wearing shoes in his house so<br>\r\nthe blue hedgehog did as his friend would want and removed his shoes <br>\r\nat the door, placing them on the rubber mat. \"Ah, that feels much better.\"<br>\r\nHe figured he might as well remove his socks too if he was going to take <br>\r\na shower and he did. Sonic then made his way to the bathroom, his <br>\r\nbare feet making light slapping noises on the hard floor as he went.<br>\r\n<br>\r\n      \"Whew,I could really use this right now,\" he said after turning on the<br>\r\nshower. He then stepped in, the hot water greeting him with a bit of a jolt,<br>\r\nforcing him to adjust the knob to a cooler temperature. As sonic took his<br>\r\nshower something was happening:</span></div></div>",
            "created":1387258800,
            "id":1709048,
            "title":"Strange Effects"
        },
        "1131":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "They grow just a little bit...",
                "They grow to double their current size.",
                "His feet explode with growth, becoming so big that they fill the whole bathroom!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How much will Sonic's feet grow?</span></div></span></div>",
            "created":1504020120,
            "id":2376604,
            "title":"His feet were growing again (Options on size)"
        },
        "115":{
            "choices":[
                "Tails finds Sonic.",
                "Sonic walks back home.",
                "Eggman finds Sonic."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There is a flash of light and suddenly,Sonic looks at his feet and is amazed.\"My feet look like Eggman's! How am I going to get home?\" Sonic tries walking,but it is hard to.<br>\r\n</span></div></span></div>",
            "created":1353733200,
            "id":1474449,
            "title":"Sonic's feet grow to the size of Dr.Eggman&..."
        },
        "12":{
            "author_id":"footlover123",
            "author_name":"feet",
            "choices":[
                "He goes home",
                "His feet feel strange"
            ],
            "content":"<div class=\"\"><div> <span>Shadow was walking through the Green Hills. While he was, he was wondering where the emerlds were.All of a sudden he tripped. What the hell? An emarald? Shadow picked it up and continued.                                                               What happens next?</span></div></div>",
            "created":1231650000,
            "id":656609,
            "title":"Shadow"
        },
        "122":{
            "author_id":"footlover123",
            "author_name":"feet",
            "choices":[
                "He plays with them",
                "They start to grow again"
            ],
            "content":"<div class=\"\"><div> <span>All of a sudden his feet feel weird. What the...he takes his shoes off to examine them and notices his usally large feet are even bigger. What's goning on and why do I like it. His feet keep growing until they were the size of beds. I can't  belive the pure pleasure I'm feeling right now.</span></div></div>",
            "created":1234587600,
            "id":646816,
            "title":"His feet feel strange"
        },
        "1221":{
            "author_id":"footlover123",
            "author_name":"feet",
            "choices":[
                "Contine",
                "He starts to pleasure",
                "His feet start to grow again"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>All of a sudden a urge came over Shadow. Ya know my feet are kind of...sexy.He then starts to massage his feet.</span></div></span></div>",
            "created":1235019600,
            "id":649562,
            "title":"He plays with them"
        },
        "12211":{
            "author_id":"footlover123",
            "author_name":"feet",
            "choices":[
                "He makes Him Worship His feet",
                "He gives him the emerald"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As shadow was admiring his feet he noticed something in the bushes. Come out. Tails came out. Oh hey Shadow I was just noticing that your feet had grown.</span></div></span></div>",
            "created":1238130000,
            "id":667407,
            "title":"Contine"
        },
        "122111":{
            "author_id":"grzeskowiak",
            "author_name":"M. G.",
            "choices":[
                "Clean my feet with your tongue",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Shadow looked at Tails with evil grin, Tails go out from bushes and looked at him wondering what is he thinking about. Shadow said: \"Hey Tails! You like my feet?!\" Tails replied: \"Well, i dunno. I guess they're cool...\" Shadow then grinned even more and said: \"I hope you do like them, because you gonna service them! Now bow down in front of me on your knees!!!\" Tails knew that he cant refuse, Shadow is too powerful so he just accepted his fate. When he was in front of his new master, Shadow pushed him with his feet and said: \"What we should do first??? Hmmm... I know, how about you...</span></div></div>",
            "created":1274936400,
            "id":890239,
            "title":"He makes Him Worship His feet"
        },
        "1221111":{
            "author_id":"grzeskowiak",
            "author_name":"M. G.",
            "choices":[
                "Massage my feet!",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Hmmm... I know, how about you give me a good foot licking?\" Tails looked at Shadow's feet, he moved a little bit closer to them. He started sniffing them just to get used. Shadow was getting inpatient, he shouted: \"Lick them slave!!!\" Tails got scared so he quickly started licking his foot. After a while Tails was working his tongue from Shadow heel to his toes. He was licking them really carefully, sucking up extremely amount of Shadows foot sweat. Smell of his sweat was unbelievable, Shadow had really deep smelling feet that weren't taken off those shoes for ages. They were all covered up in sweat, with a lot of toejam and gunk between his toes. Shadow enjoyed humiliating Tails so he stared playing with Tails face using his feet. At the beginning it was just patting his head with his feet when he was licking the other one but later Shadow started pushing his toes into Tails mouth and making him suck them, \"Yeah... Good dog, suck them and massage them with your tongue...\" When Tails was sucking his toes, he started playing with his face again. This time he was pushing Tails nose between his toes, making him sniff his toejam. After few minutes Shadow said:...</span></div></div>",
            "created":1274936400,
            "id":890264,
            "title":"Clean my feet with your tongue"
        },
        "122112":{
            "author_id":"footlover123",
            "author_name":"feet",
            "choices":[
                "His feet burst through his shoes",
                " His shoes survive"
            ],
            "content":"<div class=\"\"><div> <span>What happened shadow. Sitting down with his arms crossed Shadow told Tails what had happened. Can I see the emerald Tails said incently. Fine shadow said now fixated on his feet. Shadow tossed the emerald to Tails. After Tails caught it it started to glow brightly</span></div></div>",
            "created":1238994000,
            "id":671727,
            "title":"He gives him the emerald"
        },
        "1221121":{
            "author_id":"writer911",
            "author_name":"kiba",
            "choices":[
                "To be licked inside and out.",
                "A nice massage then deep smelling"
            ],
            "content":"<div class=\"\"><div> <span>As the feet burst through the shoes the oder is released. Shadow can not control himself and ask to start sniffing Tails feet. Tails is flattered that Shadow likes the smell of his feet. Oh I did not know you enjoy feet to, because thats kinda why I came over here Tails said. I will make you a deal if I can sniff your feet you can sniff mine shadow replied. Its a deal Tails said and we can go back to my old hang out. They take the long route to make sure they are nice and sweaty. Tails ask how do you like your feet treated. Shadow replies I like to have my feet licked even between the toes. Tails replied I like mine.....</span></div></div>",
            "created":1264395600,
            "id":825835,
            "title":"His feet burst through his shoes"
        },
        "13":{
            "author_id":"footlover123",
            "author_name":"feet",
            "choices":[
                "Nothing for happens now",
                "His feet grow thourgh his shoes",
                "His Penis grows and his feet",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Tails was busy mixing chemeicals thinking about Sonic's big feet. The twin tailed fox loved feet he coudn't help it. Anytime he saw feet he got hard, and Sonic knew it Sonic teased Tails so much. But whlie Tails mixed the wrong chemicals. He drop the vile and the blue liguid fell to the floor. He was about to get a rag when his feet soak up all the liqued</span></div></div>",
            "created":1238216400,
            "id":780353,
            "title":"Tails"
        },
        "132":{
            "choices":[
                "Go stomp Sonic for teasing me\"",
                "Go clean and enjoy my feet\"",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh man!\" Tails said as he watched the strange liquid absorbed into his shoes. At first he thought his shoes were stained and infected from the chemical so he went to change them. As he pulls them off, he noticed that not a single place in his shoe was wet. Neither were his socks. Smelly, but not wet. His feet felt a bit wet, but he thought it was only sweat, since he was working for a while. \"Oh well, I guess it was nothing. it probably evaporated quickly around my feet.\" Tails thought as he put his shoes back on. Suddenly his feet started to hurt. \"Ow! What n the world? Why are my feet feeling constricted?\" Tails says with a whine. He decides to take a nap, since he was sleepy anyway. In his bedroom, he was so tired he just plopped on his bed with his shoes on and quickly fell asleep. After a few minutes nto his nap, Tails feet started glowing through his shoes. The glow was a powerful deep blue, and with a hint of orange. The glow started to fade and Tails' feet started to grow slowly through his shoes. Tails himself was moaning in pain, yet also pleasure. His shoes seemed to be very stretchy and durable until Tails splayed his 3 toes in his sleep. The outer part of the shoes outstretch and popped up to his cuff. The straps that were keeping his shoes on had already popped off, but his feet ahd grown too much for them to come off. The layer under the outer started to mold into Tails' growing 3 toed feet. Suddenly the shoe went \"BANG!!!\" as the soles detached from the main part. Tails' acute fox hearing caught it as he sprang up from his pillow, just in tie to see his feet bursting through his shoes. \"Wa..?\" was the only thing he could say as his feet continued to grow. Then a series of pops and bangs echoed i his room from his now colossal feet breaking through the now unrecongizable shoes. \"Ahhh, that's a whole lot better.\" Tails swung over and hopped off the bed. He grabs his ruler to see that he's gained two whole feet(no pun intended). Tails leans down and smelt his feet to make such that he wasn't dreaming. He nearly fainted from the smell of his paws. The potent smell started to grow along with his now 3' tall and 4' wide feet from before. \"Hmm, I wonder what to do now that my feet are bigger.\" Tails ponders. \"Oh I'll..</span></div></div>",
            "created":1311051600,
            "id":1150520,
            "title":"His feet grow thourgh his shoes"
        },
        "15":{
            "author_id":"footlover123",
            "author_name":"feet",
            "choices":[
                "Amy",
                "Rouge",
                "Tikal",
                "Cream"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Girl Then</span></div></span></div>",
            "created":1226725200,
            "id":608034,
            "title":"To the girls"
        },
        "151":{
            "author_id":"footlover123",
            "author_name":"feet",
            "choices":[
                "She stops and looks at her feet",
                "She ignores it",
                "She finds Sonic"
            ],
            "content":"<div class=\"\"><div> <span>Amy had just woke up and was getting up she had her clothes on and was getting some socks. She found a pair of socks she never had seen before. She put them on and her feet were instantly warm. Hmmm strange oh well. She went out to find sonic when her feet felt cramp.</span></div></div>",
            "created":1239080400,
            "id":672097,
            "title":"Amy"
        },
        "1512":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "ewwwww (smelly feet)",
                "mmmmm (aurosal)",
                "wow (normal reaction)"
            ],
            "content":"<div class=\"\"><div> <span>She put on her regular ugly boots but they started to show her 5 toes. And her heel, trying to endure it's contents, but started to rip as they were unable to contain her growing feet. Amy kept ignoring it until her boots bursted into pieces, leaving her in her new socks which magicaly expanded along with her massive feet, however those socks started to look tighten, so the shape of her feet was easily noticable.<br>\r\nAmy exclamed:</span></div></div>",
            "created":1396974180,
            "id":1775354,
            "title":"She ignores it"
        },
        "15122":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Yes",
                "Already had one"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she develope a foot fetish? </span></div></span></div>",
            "created":1446086220,
            "id":2054004,
            "title":"mmmmm (aurosal)"
        },
        "152":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "Her feet expanded",
                "Her feet don't expand yet",
                "she goes to sleep, but her feet expand while she is sleeping"
            ],
            "content":"<div class=\"\"><div> <span>Rouge was taking a buble bath, her curvy body was covered by bubbles, well almost all of it, her big boobs were totally exposed, so were they sexy big feet, and obviously her shoulders, her face and her right arm, which was holding a rare colored gem that she got in one of her recent \"missions\".<br>\r\n<br>\r\n\"you should be very valuable\" she said towards the uncannyish blue gem, which was neither green, cyan, blue or even violet... it was tagging and shining in all of those spectres making the entire room look even more exciting \"wonder what is your color? is it turquoise? ametyst? emerald?\" she said as her big gorgeous eyes were reflected in the gem, which cause her just get hypnotized by it, and she kept rolling it slowly using her long fingers.<br>\r\n<br>\r\nThat gem actually had some energy even stronger than chaos emeralds, and by a closer research towards it, it can only be used BY WOMEN (or just females, no male could activate it without dying). Rouge wonder how could it be activated and what power it involved.</span></div></div>",
            "created":1397016600,
            "id":1775792,
            "title":"Sexy Rouge"
        },
        "1521":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "her feet stopped growing",
                "growth continues"
            ],
            "content":"<div class=\"\"><div> <span>What she did't realized was that as she kept admiring the gem her feet stretched in all directions, Rouge kept watching the gem with greedy lust and her already big feet kept expanding slowly. Rouge's current focus didn't make her notice it<br>\r\n<br>\r\nUntil she switched her legs and hitted a lotion cabin whose bottles felt into the floor...<br>\r\n<br>\r\n\"Oh my...\" she exclamed as she took a look at her enormous feet, she could see her pedicured getting close to the floor, so she put the gem aside and</span></div></div>",
            "created":1397227800,
            "id":1776845,
            "title":"Her feet expanded"
        },
        "15212":{
            "choices":[
                "her feet continue alot more",
                "her feet continue a little more"
            ],
            "content":"<div class=\"\"><div> <span>watched her feet expand. Soles streaching across the tubs surface. She wiggles her toes, but her digits have grown heavy. she got out of the tube before her feet fill it up, and to admire her feet growing easily. The growth fastend, growing from size 14 to 16 to 19 to 25 in a few minutes. <br>\r\n\"Oh my... will this stop?\"</span></div></div>",
            "created":1432456740,
            "id":1982103,
            "title":"growth continues"
        },
        "152121":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "no, they will keep growing",
                "they stop growing... for now."
            ],
            "content":"<div class=\"\"><div> <span>As soon as the bat left the tube, her still wet body was getting a bit taller, but just because her feet keep growing more and more. In seconds the bathroom was getting smaller for her uncanny feet.<br>\r\nShe just had now  a pair of 81 size feet.<br>\r\n\"this is not going to stop right?\" she said while bitting her lower lip</span></div></div>",
            "created":1475292360,
            "id":2217137,
            "title":"her feet continue alot more"
        },
        "154":{
            "author_id":"metroidlover",
            "author_name":"kururu metroid master",
            "choices":[
                "cream has big feet and friends come over",
                "cream has big feet and tails comes over"
            ],
            "content":"<div class=\"\"><div> <span>one day cream was walking around a park while eggman was watching her carefully \"that's right cream step in the brown \"mud\" puddle\" cream unknowingly stepped in the \"mud\" while eggman followed \"time to what this stuff can do\" cream was walking back to her house where vanilla was playing with cheese seeing as cheese had no one to play with other than cream then cheese saw some bush shaking, cheese made some noises and ran up to the bush while eggman sweated nervously \"do i run and save myself or do i witnessed the epicness of eggman hmmm....\" eggman thought to himself \"come on out stranger we won't bite\" said vanilla in a sweet voice \"yup i'm runnin' for it\" eggman dashed away (as fast as a fat man could) then cream felt weird eggman looked back to see if anyone was following him, saw cream looked funny, knew what was happening and got a brilliant plan \"hmm...disguise myself time to try out my other invention\" he whistled, \"eggman location found commencing launch sequence.....3....2....1....DEPLOY\" the new eggmobile appeared at eggmans side in about 20 sec. \"now to disguise myself\" he dressed up in a doctor's uniform hid his awesomely noticable mustache and ran toward the rabbits house \"excuse me but i was in the area and i was trying to....find...the (come on eggman you're too obvious THINK) erm um the.......casino ya the awesome casino because that's what i'm looking for and i need directions\" \"ok....look my daughter is sick with something i don't know where the casino is but can you please help my daughter?\" \"why certainly what kind of dr. would i be if i did'nt\" \"thank you doc.\" eggman got out a small vile and gave it to cream via digestion then her feet were growing slowly \"PERFECT it works alright give her 5 beatings a day and screw off have a robotnik day hahahahahahaha\" eggman jumped out the window and landed in his eggmobile and flew off</span></div></div>",
            "created":1372770960,
            "id":1621284,
            "title":"Cream"
        },
        "1541":{
            "author_id":"metroidlover",
            "author_name":"kururu metroid master",
            "choices":[
                "amy, and tikal",
                "blaze, and tikal",
                "blaze, and amy"
            ],
            "content":"<div class=\"\"><div> <span>\"what a rude man, oh well he's gone now cream are you alright?\" \"ya the rude man cured me i don't feel sick anymore but my feet....\" cream looked at her big 2 feet tall feet \"well i don't know what to do......maybe some rest will do you good in anycase i'm leaving for the store if any strangers come in step on them\" \"that's not funny\" said cream vanilla left and cream looked out the window and saw some of her friends including tails,</span></div></div>",
            "created":1372772100,
            "id":1621291,
            "title":"cream has big feet and friends come over"
        },
        "15411":{
            "author_id":"metroidlover",
            "author_name":"kururu metroid master",
            "choices":[
                "gives in(normal)",
                "disobeys(extra people)"
            ],
            "content":"<div class=\"\"><div> <span>\"i wonder how cream is doing\" said amy \"well i hope she's ok\" tails said \"she probably is ok just in her house playing with cheese\" \"you're probably right amy\" said tikal they walk in the front door and are walking towards creams room, cream hears this and doesn't want them to see her like this \"hi everyone i'm kinda busy right now so please don't come in\" the others heard it and something struck them 1 vanilla is not in the house 2 cream is never busy and 3 cream always loves to play they thought it was kinda suspicious so they went up to creams room and saw her and tails held back a laugh but he could'nt he burst out laughing \"hahahahahaha your feet hahah how did ...did this happen hahaha\" \"TAILS!!\" yelled tikal \"how did this happen cream\" \"i don't know i was feeling weird i got home and i when i was cured of the sickness i got big feet\" while the girls tried to figure it out tails had an idea \"why don't i get us some tea to relax us from this kind of funny incident\" \"yes please\" \"sure\" said amy and tikal \"alright be right back\" tails got 3 cups one for each of the girls  filled it with water and added a teabag \"there all done\" tails walked in to see tikal and amy licking creams feet \"ok he should take about 1 min. so let's be quick\" said amy tails had another idea he quickly snapped a picture of them brought in the tea and said \"helloo girls\" tikal and amy stopped and said \"cream asked us to...\" \"ya we were helping her relax.\" tails looked at the sleeping cream \"oh ok then this picture is useless?\" tails showed them a picture of them licking creams oversized feet \"plan B?\" said amy in an almost whispering tone \"yup\" said tikal the same way \"whats plan B\" \"this\" said amy as she knocked him out with her pikopiko hammer \"oooh this is going to be fun\" said tikal tails had woken up tied the bottom of a chair \"now you clean our shoes then our feet in less than 1 hour ALL of our feet mine tikals and creams these are your new rules fail to do so and the punishment will be restarting with double the cleaning got it?\"</span></div></div>",
            "created":1372774440,
            "id":1621302,
            "title":"tails, amy, and tikal"
        },
        "154111":{
            "author_id":"metroidlover",
            "author_name":"kururu metroid master",
            "choices":[
                "ask to do cream's feet",
                "obey amy"
            ],
            "content":"<div class=\"\"><div> <span>\"good now who wants to start? cream no she's sleeping? how about tikal?\" \"ya i'll go first alright this is how it works amy will get you to clean my sandals and i will go outside and get my feet really dirty for you to clean got it?\" tails nodded \"good now amy heres my shoes have him clean them all around\" \"ok\" tikal left the house and saw it was raining \" hmm rain, dirt, mud just what i needed\" meanwhile tails is busy licking every corner of the straps on the sandals making sure all the dirt is off this took about 2 min. he then started licking the soles of the sandals as his tongue started turning a light shade of gray but he continued to lick even though the taste and smell was horrible. soon enough his saliva was all over the shoes it took him about 10 min. to finish off these sandals \"finally your done now i can call tikal\" amy opened a window and called tikal in some rain got in and tails was dreading what was gonna happen next \"she's coming back and wow her feet were covered with mud all over the tops all around the soles there's even a layer of mud between her toes hah what a lucky day for huh.\" tikal came in dragging muddy footprints all around the floor \" alright how cl-\" she saw her sandals clean \"wow i haven't seen them this clean ever since i put them on thanks tails hope you can do the same with my feet\" tikal sat in the chair and shoved her toes into his mouth \"suck\" was the only thing tikal said as tails sucked as hard as he could trying to clean it without gagging tails also licked between her toes and she said \"stop, right now you suck if you even get rid of a tiny bit of that mud in between my toes i will make you clean both mine and amy's muddy shoes and feet in 5 min.\" tails stopped and did his best at this challenge he sucked for 1 min. when she said \"switch\" she took her foot out of his mouth and replaced it with the one thats been collecting dust under the bed tails finally gagged and really wanted to spit it out but couldn't so he sucked as tikal inspected in between her toes to make sure all the mud was still there \"hmmm.....you're safe, for now\" tails responded by sucking harder hoping to end this quickly tikal put the wet toes under the bed to collect more dust and dirt tails really regretted taking that picture tikal stopped him and grabbed his tongue with her toes then she squeezed the mud out and tails could taste that horrible taste all over his tongue she took her fot out of his mouth and said \"lick\" tails then started licking as his tongue was now brownish greyish he cleaned her feet with his tongue gvetting all the mud off her soles off the tops of her feet and even the rest between her toes he was about to spit all of the mud out when tikal said \"nope you can either swallow it or put it onto someone else's feet with your tongue\" tails did not want to swallow it so he licked creams feet putting the mud all over her feet and cream giggled in her sleep \"that tickles\" tails then went back to licking tikals feet it has been 8 min. now as tails is almost done cleaning her feet then tikal rubs her feet all over tails' face cleaning off the saliva and dirt then tikal said \"continue licking my feet i don't think their clean yet\" tails continued licking until he could lick no more her feet were covered with saliva and in between her toes were just saliva nothing else \"good boy now wipe off my feet\" tails rubbed his muzzle around her feet tring not to make them dirty again \"alright so you finished tikals feet treatment in 23 min. congrats now its my turn\" said amy</span></div></div>",
            "created":1372777740,
            "id":1621324,
            "title":"tails gives in"
        },
        "1541112":{
            "author_id":"metroidlover",
            "author_name":"kururu metroid master",
            "choices":[
                "vanilla gets mad from the mud on the floor (end)",
                "vanilla joins the girls"
            ],
            "content":"<div class=\"\"><div> <span>\"finally its my turn, tails you'll love cleaning my feet, isn't that right?\" \"yup\" tails says hoping that cooperating will get him out of here soon \"ok ill be back soon, i expect to see shiny clean boots when i get back ok?\" tails nodded as amy walked out the door, tails noticed that it had stopped raining, a wave of relief washed over him but that soon disappeared as amy's boots were shoved into his face \"do a good job\" tikal said with a smile tails started licking the boots making them shine all over, the boots weren't really dirty but it did take tails a while to lick the insole but when tails finished 6 min. had passed and the boots were shiny with saliva tikal called in amy who was walking in a dirty mud puddle and sand, amy walked in dragging mud and sand on the floor she went into creams room and fell over \"amy you ok?\" tikal asked \"ya just feel weird...tails let's see my boots\" amy inspected her boots and gave him a thumbs up \"good now clean my feet\" tails started licking while amy's feet started growing bigger tails noticed and said \"amy your feet are growing\" she noticed and said \"ah well cream seems fine it just means you have bigger feet to lick no problems here\" tails continued to lick amy's 1 foot big feet cleaning all the sand and mud off, tails tongue was now covered with mud tails spit it out and amy saw that \"tails you can't spit anything out for that you will need to clean tikal's feet again and my feet again, after cream of course, now don't let me catch you doing that again, now suck my toes\" she wiggled her toes mud sliding in between, tails licked in between her toes as he sucked on them and swallowed the mud gagging a bit when he did that, he sucked hard and left nothing behind exept for a layer of saliva, it took tails half an hour in total to clean her feet and when he finished he rushed to the washroom to clean his mouth and looked out the washroom window he saw vanilla walking towards the house and tails thought thank god i'm safe</span></div></div>",
            "created":1375038720,
            "id":1635701,
            "title":"obey amy"
        },
        "15411122":{
            "author_id":"metroidlover",
            "author_name":"kururu metroid master",
            "choices":[
                "they get the collar and go for a walk",
                "cream wakes up"
            ],
            "content":"<div class=\"\"><div> <span>vanilla came in the front door as tails rushed towards her explaining his current situation \"vanilla help amy and tikal are being mean and making me clean their disgusting feet\" \"well we can't have any of that now can we? AMY, TIKAL please come down here\" the girls came down a little worried but they knew the odds were in their favor, if they could get vanilla in on this, there would be no one to stop them. \"Vanilla we can explain\" said amy in a calm tone \"tails stepped in on our fun with cream and made fun of us, then he took a picture and tried blackmailing us, so were teaching him a lesson, thats all thats happening here\" \"tails is this true?\" \"uhh...you see...I...uhhh...ya i did sorta... but is this a proper punishment?\" \"well maybe not, all you did was bully these two girls, blackmail them then lie to get them in trouble, so what do you think?\" tails looked depressed, his only source of protection had become what he wanted to be protected from, he was stuck licking their nasty feet. \"hey vanilla how about you come and join in the fun\" said tikal \"well i have been going around alot, besides i almost never get to do this...ok ill join\" \"hooray now go outside and walk barefoot so tails can lick off all the mud off\" said amy \"ya he will stay here and clean your shoes\" said tikal \"actually i would prefer not getting my feet dirty, just have tails clean them and that will be enough for me.\" so tails spent the next half hour cleaning her ruby red heels and the next half cleaning her quite dirty feet (even though she didn't go outside to make them dirty) tails licked her feet all around making sure nothing was left behind. He then went onto the toes licking inbetween them to get all the dirt and stuff out he then sucked on her toes to make sure they were clean. While sucking vanilla moaned and wiggled her toes in his mouth saying don't stop he obliged and stayed sucking for almost an hour, she then thanked the girls for a wonderful time and said \"you can finish playing in cream's room upstairs, oh and if you want there's a collar and leash in my room\" the girls looked at each other and said \"uhh...a dog they must've had a dog, yup a dog\" they both knew this couldn't have been true but that's what they were going with. \"come on tails were going to have some more fun.\"</span></div></div>",
            "created":1387118880,
            "id":1707927,
            "title":"vanilla joins the girls"
        },
        "154111221":{
            "author_id":"metroidlover",
            "author_name":"kururu metroid master",
            "choices":[
                "they find sonic first",
                "they get to tails' workshop first, and some one is there?"
            ],
            "content":"<div class=\"\"><div> <span>tails looked at them, confused as to why this was happening, \"why couldn't this be sonic instead of me\", then tails remebers back at his house, didn't sonic confess something like this? besides, i always get the tedious work \"I broke the tornado, tails can you fix it?\" i mean it's my plane... well better him doing this than me, \"hey amy, tikal, i have a suggestion\" \"no, you can't leave tails, this is punishment remember?\" tikal said in a sweet voice \"no, not that, i know someone who will do this, and LIKE it, and will possibly do it better than me.\" \"tails, i know what you're trying to do\" amy said in a threatening voice \"and it won't work, besides eggman is too dangerous-\" \"AMY, I DID NOT NEED THAT PICTURE IN MY HEAD\" tikal boomed \"sorry\" amy said, a bit shocked, but she continued to put the leash on tails \"oh for crying out loud, I'M TALKING ABOUT SONIC, YOU SIMPLETONS\" . . . there was a strong silence, then a crack, followed by another, and then cream's bed came crashing down through the floor, which momentarily muffled amy's rage. \"why's my bed in the living room? and why is tails on a leash? and where'd my mother go?\" tails spoke up as he was the only one who wasn't shocked or fueled with rage \"your giant feet caused the bed to become unstable, breaking one side of the legs, which in turn broke the other, and the result is this. As for this... it's a long story, also vanilla was here a while ago, i don't know where she-\" just then amy couldn't hold back any longer, she wacked tails so hard he passed out \"amy, why did you hit him?\" \"...he....umm....(damn it i got nothing) he umm....needed..a...rest...so i was helping him get to sleep.\" (i hope i didn't killl him...) \"well in any case, he said something about sonic, so we should bring him back home, and find sonic\" \"good idea tikal, but who's going to babysit cream?\" \"it's ok my mother lets me stay home by myself, besides i have cheese to look after me\" she points to a door and says \"come on out cheese, it's just me\" the door slightly opens and cheese looks carefully out, she then rushes out and hugs cream, \"that room is the closet, cheese goes there when he's scared\" \"alright then, i guess we should go to tail's place to look for sonic\" \"ok let's go amy\"</span></div></div>",
            "created":1391002260,
            "id":1734866,
            "title":"they get the collar and go for a walk"
        }
    },
    "info":{
        "author_id":"footlover123",
        "author_name":"feet",
        "brief_description":"Make the feet of sonic and friends grow",
        "created":1226769420,
        "description":"<td align=\"left\" class=\"norm\">Okay only sonic Charcters no death sexual stuff is alright and only feet expansion, other than that have fun<br>\r\n50 GP per chapter</td>",
        "id":1495861,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1504020120,
        "modified":1504020120,
        "pretty_title":"Sonic foot expansion"
    }
}