{
    "chapters":{
        "1":{
            "author_id":"alotofstuff",
            "author_name":"Shrinking Fandom Writer",
            "choices":[
                "TINY GIRL (INFERIER)",
                "GIANTESS GIRL (DOMINANT)"
            ],
            "content":"<div class=\"\"><div> <span>will you be a small defensless girl, destined to be used as a cock co-bob to fullfil a giants desire, and wear a latex bodysuit  or will you be a massive, muscular naked giantess, able to overpower a tiny girl with just one hand and use them to find yourself a mate, and liking to dominate tons of small less dominant girls</span></div></div>",
            "created":1514264400,
            "id":2432579,
            "title":"YOUR DECISION..."
        },
        "11":{
            "author_id":"alotofstuff",
            "author_name":"Shrinking Fandom Writer",
            "choices":[
                "TOMMOROW",
                "OTHER CHOICES"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Tracy, u live in a small tribe of girls and I all live somewhat peaceful life but tomorrow is when giantesses start to mate to have kids. “Those fucking bitches better not even try to use me for that” you say in a sassy way. Your mom looks at you worryingly and says “well I’m sorry dear but you do know they like the smallest ones the most and your the smallest one in the tribe ( your 16) and sadly it’s not really a choice, they are way bigger than us so there is nothing we could do, besides, it’s only for a week, it stops hurting after a while anyways, I didn’t remember but I was used as one too” after saying this she gives a look of sorrow to you, knowing your not gonna like it. “But what about the part where they made you drink semen” you yell. She then looks at you “well that’s just what they do” your mom the. Sits by you and says “look when the giants come to line us all up and everybody ain’t there they will destroy the village and kill everybody so please just go with it for a week, it will be fine” she says you get up and say to her “you thing having a huge dick rammed up your ass and through your mouth is ok? I’m not gonna he used as some sex toy” you scream, and with that you go upstairs and cry, knowing that you are gonna be chooses by the biggest giantess for mating season.</span></div></div>",
            "created":1514523600,
            "id":2434234,
            "title":"TINY GIRL (INFERIER)"
        },
        "111":{
            "choices":[
                "The giantess takes you home"
            ],
            "content":"<div class=\"\"><div> <span>You stay up an cry all night in your room until you eventually pass out around 4a.m. You wake up with the ground shaking around 11a.m. You run outside and see the giantess tribe has arrived and everyone else is already lined up. \"Hopefully I can sneak into the line so they don't notice I'm late.\" You run behind everyone in line and try to find your mom. Luckily you never really went through puberty and you're only 4 feet tall so sneaking behind even normal sized people was an option. You find your mom who whispers sternly to you, \"Where have you been, the giants are looking for anyone hiding to punish them\" As you and your mom are facing each other a shadow covers you both. The two of you turn around, Your mom who is 5 ft tall was staring straight into the crotch of a giant while you stared just above her knee. <br>\r\n\"You weren't in line before,\" said the giant.<br>\r\nYour mom stammer, \"sure she was, this is my daughter, we've been here the whole time.\"<br>\r\n\"No, It was jus you before, I would've remembered a kid this small.\"<br>\r\n\"Hey! I'm not a kid! I'm 16!<br>\r\n\"Honey shush, don't yell at the giantess.\"<br>\r\n\"HAHAHA, you're 16? But you're so tiny, I'm 14 and I'm 8 feet tall, you must be like 3 feet tall you midget.\"<br>\r\n\"Hey stop making fun of my daughter you sasquatch, it's bad enough you monsters physically abuse us.\" <br>\r\nIt seems your mom has had enough of this, she knows you've been bullied your whole life for your size and had to defend you.<br>\r\n\"You should know your place tiny,\" and with that the giant 14 year old lifting her massive foot above your moms head and started to press down. Your mom was now pinned on the ground with the giantess stepping on her chest. Her foot was the size of your mom's chest. you could see your mom was struggling underneath the weight and it was hard for her to breath. You wrap your arms around the giant's enormoous leg and try to pull it off your mom. \"please! let her go! this is all my fault, I was late so my mom was just trying to help me!\"<br>\r\n\"I knew I didn't see a shrimp like you before.\" and with that she stepped off your mom. <br>\r\nYou bend down to see if your mom is okay, you lift up her shirt and see an enormous foot print. As you see her gasping for breath two giant hands wrap around you and lift you off the ground, the giantess makes you face her with your feet dangling way off the ground. <br>\r\n\"I'm going to bring you home and make sure you get your punishment for being late and for your mom talking back to me.</span></div></div>",
            "created":1517720400,
            "id":2449330,
            "title":"TOMMOROW"
        },
        "1111":{
            "choices":[
                "Foot massage",
                "Go play"
            ],
            "content":"<div class=\"\"><div> <span>After a while of struggling in the giant's grip you accept your fate. the two of you approach her home, it looks like an ordinary place, maybe these giants like to feel bigger in a small home. Then you notice that you should've reached the house judging by the distance and size. Then you come to you come to your senses, the house is getting bigger as you approach. It looked ordinary from a distance but the closer you got you see just how massive this home is. It's so big that that when the giant holding you gets to the front door, she has to reach up for the doorknob. the two of you enter the house and you notice it's an ordinary home aside from the fact that everything is multiple sizes larger than everything you're used to. The giant girl sets you down in front a huge couch while she sits down on it. You stand in between two massive legs with knees up to your neck.<br>\r\n\"Alright runt, before we do anything I think we should get to know each other. My name's Fiona, you'll get to meet the rest of my family soon; my mom and two sisters should show up at any moment. Do you have any siblings?\"<br>\r\n\"No, it's just me and my mom\"<br>\r\n\"Well maybe one of my family members will choose your mom to come play so you can be reunited, until then let's have some fun, what was your name again?\"<br>\r\n\"'I'm Tracy.\"<br>\r\n\"Alright little Tracy, I'll let you decide what we do for now, your choices are we can either go play in my room, or you can give me a nice foot rub.\"<br>\r\n\"I...I just wanna go home.\"<br>\r\nFiona to bring her legs together effectively trapping you between her knees.<br>\r\n\"I said what your choices are, if you don't choose one of those I'll just crush you here and now.\" As she says that you feel her knees close in more and she starts squeezing you painfully.<br>\r\n\"OKOK, let go I can't breath.<br>\r\nFiona let's go and you drop to your knees trying to catch your breath.<br>\r\n\"Well, which one tiny?</span></div></div>",
            "created":1518238800,
            "id":2451367,
            "title":"The giantess takes you home"
        },
        "11111":{
            "choices":[
                "16 inches",
                "another size"
            ],
            "content":"<div class=\"\"><div> <span>Nervous what Fiona had in mind for \"playing\" you agree to the foot massage. Fiona tells you to grab an ottoman so she can kick her feet up. You find one in the room and try to pick it up but it's too heavy, this ottoman is like 3 feet in each direction. You get behind it and push with all your might to get it to Fiona. Fiona then rest her massive feet up on the ottoman and you walk up to them. The ottoman being 3/4 of your height meant now you're looking up to see her toes. You were eye level with her arch. You weren't sure if you reached up if you could even reach her toes. \"Well get to work\" Fiona commanded. You grabbed her meaty sole and proceeded to rub her left foot. \"You're feet are so big, what size are they\" you ask. <br>\r\n\"Oh i don't know, we giants go by inches, Go grab that tape measure\"<br>\r\nYou grab the tape measure and reach up to the top of her toes which you barely reach and drag the tape measure down to the base of her foot.<br>\r\n\"Well, how big are my feet?</span></div></div>",
            "created":1518238800,
            "id":2451462,
            "title":"Foot massage"
        },
        "111111":{
            "choices":[
                "The giant wants to keep comparing.",
                "She wants to move to the bed."
            ],
            "content":"<div class=\"\"><div> <span>The giant girl holds the top of the tape measure to her toe while you bring it down to the ottomon. “16 inches” you say in shock. “That’s basically the size of my torso.” The giant cracks a smirk, she brings her feet down and grabs you by the waist. You’re brought up to her faceband she says, “I wanna see something.” With that she brings you to her room. You enter her room and you see giant furniture, among which is a giant bed centered againat the back wall. The giants sets you down and commands you to lie on your back. Scared of disobeying you abide. “Lets see what’s bigger, my foot or your chest,” and with that the giant plce her foot with her hell against your crotch. You can feel her toes maybe am inch past your collar bone. “Haha, move foot is bigger than your little chest.” She then presses some of her weight down on you, not enough to hurt you but enough for your to strain breathing. You grab the sides of her foot trying to gwt her off and get air. “Aw your so cute struggling under my foot, and I’m barely putting any pressure on you.” </span></div></div>",
            "created":1556869920,
            "id":2654270,
            "title":"16 inches"
        },
        "1111111":{
            "choices":[
                "Keep comparing",
                "Fun studf"
            ],
            "content":"<div class=\"\"><div> <span>The giantess begins feeling flustered. She takes a step, with her foot that’s not covering you, thus crushing you woth her full weight for a second. You feel what little air you had in your lungs rush out and you ribs creak. Luckily it was only a split second, still the pressure sends pain throughout your hole chest and you writhe  in pain. The giantess sits on her bed and commands you to approach. You push through the pain and stand, you open you eyes and are greeted with an enormous cock. The giantess commands you the grasp it. It’s so thick you can’t even reach all the way around with both hands. She tells you to start stroking and you follow the order. You can’t believe your eyes but it continues to grow in your hands. She wasn’t even fully hard! “Ah that’s better, nice and hard. Now I want to see how small you are compared to my cock. Step closer til my head touches your chest and try to reach my balls.” You follow suit but your finger tips fall a few inches short. “Haha your are so small!” She spreads her legs and says to come close and press your back against her groin and to reach your arm out to compare your arm to her cock. You obey and see that your finger tips are just shy from the tip of this monster cock and you see that it’s many times thicker than your frail arm. </span></div></div>",
            "created":1556871240,
            "id":2654281,
            "title":"The giant wants to keep comparing."
        },
        "11111112":{
            "choices":[
                "Im bed?",
                "Out of bed?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does the giantess want to have fun?</span></div></span></div>",
            "created":1556871360,
            "id":2654282,
            "title":"Fun studf"
        },
        "111111122":{
            "choices":[
                "She cums.",
                "She gets bored and wants to switch things up."
            ],
            "content":"<div class=\"\"><div> <span>The giantess reaches down and picks you up under your armpits. She stands and places you on her cock. It doesn’t budge as if you weight nothing. She forces you on your stomach and you realize the tip of your head goes to the length of her cocks heads. She holds you in place and approaches a wall. She lets you go and slides her cock up the wall and you with it until your sandwiched between her cock and chest. Her cock is not up to your mouth. She commands you to start pleasuring her. You’re disgusted but know what will happen if you disobey. As you start making out with the head of her cock she begins grinding her cock up and down the wall, She keeps you in this situation for nearly 15 minutes grinding with you sucking.</span></div></div>",
            "created":1556871780,
            "id":2654283,
            "title":"Out of bed?"
        },
        "1111111221":{
            "author_id":"thedesfollower",
            "author_name":"Thedesignatedfollower",
            "choices":[
                "A shower",
                "More fun for “us”",
                "More fun for me “me”",
                "Someone enters the room unannounced"
            ],
            "content":"<div class=\"\"><div> <span>As the amazon continues to grind with your tongue in her dickhole you hear her moan. The amazon then grabs your head with her giant hand and forces your face against her cock. Your mouth stretched open and your nose smushed on the head. She let’s loose a giant moan and a torrent of cum shoots up into your mouth, with no place to go it floods your throat into your stomach. After her balls are emptied and your exhausted from the meal and suffocation she backs away from the wall. You try to catch your breathe aa you lie defeated on this cock strong enough to support you. She walks over to the bed and you feel her cock soften and you fall off onto the bed. “Now slave, for dessert you can suck whatever cum I have stuck in my shaft.” As disgusting the taste was before and as filled to the brim her stomach was she knew she shouldn’t disobey. The small girl got to her knees, picked up the heavy cock of the giantess and began to drink what leftover cum was in there. “Good slave, now it’s time for...”</span></div></div>",
            "created":1571443920,
            "id":2735015,
            "title":"She cums."
        },
        "11111112211":{
            "author_id":"alotofstuff",
            "author_name":"Shrinking Fandom Writer",
            "choices":[
                "she brings you in the shower with her",
                "she plays with her breasts infront of you"
            ],
            "content":"<div class=\"\"><div> <span>      The giantess stands from the bed for a few and gives you a few minutes to recover from your massive meal. you lay on the bed, gasping for air and sparatically twitching from the trauma you just went through. she hovers her massive now flaccid cock above you as if she is teasing you even more than she already was and then decides what to do next. \"OK my little living condom, now that you have calmed down after your use, we are gonna take a shower and just to make sure you dont become lazy your gonna help me clean my entire body...so get ready because your gonna be working for a while\" she tells you. you look up at her with disbelief since she had JUST got done torturing you with her massive penis \"n-no wait please, im so tired and i might drown in the water if i go in there with you\" you barely are able to say. she looks at you with a questioned look and a raised eyebrow. \"dont worry my little girl slave, i wouldn't let you drown or hurt you TO bad, your no use to be as a slave if your dead and besides i plan on using you for mating season in a while. and with that said she scooped you off the cum drenched bed and holds you by your stomach as she makes her way to the bathroom with your limp body dangling from her powerful hand. she sits you down on the sink and starts the water.<br>\r\n<br>\r\n<br>\r\n        she takes a while to feel the water to make sure its warm enough and ounce it is she takes off the one peice of clothing she had on (her bra) and her massive tits drop from it, bouncing a few times before the massive milk bags stand still. you look at the scary yet mesmerizing pair of wrecking ball sized tits you have ever seen and couldn't  help but feel a little aroused at the site. you think your looking at them in private until you look up and realize she is staring at you with her back against you and a smirk on her face. \"hmm does my slave see somthing she likes? if you wanna stare at them that bad then they can be the first things you can clean, and then my cock and balls\" you look away with a face full of blush and try your best not to be interested in it    </span></div></div>",
            "created":1577431740,
            "id":2765191,
            "title":"A shower"
        },
        "112":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Z or F Tier",
                "E or D Tier",
                "Another story"
            ],
            "content":"<div class=\"\"><div> <span>MACHROLANDIA is a beautiful fantasy world full of magic, adventure and a plethora of differently sized races, that all for some reason consist of only futas(or dickgirls). Some species are basically walking mountains, others are so small that they are barely visible by the naked eye. The smaller races have magical powers, that can give them the edge over the sheer strength and brute force of the larger races. The different species of this world are divided into several different size tiers, here they are, from smallest to largest.<br>\r\n<br>\r\n<br>\r\nZ Tier - below 2 mm<br>\r\nThe Z Tier represents the smallest sentient races in existence. They rarely live longer than 1 year largely due to the fact that they are unnoticeable to all other races.They are commonly referred to as \"Nanoes\" by the people who believe they exist.<br>\r\n<br>\r\nF Tier - 2 mm to 2 cm<br>\r\nThese species are still very, very small, but big enough so that the other races are able to see them and maybe consider them, which is for better or worse. They are commonly referred to as \"Microes\".<br>\r\n<br>\r\nE Tier - 2 cm to 10 cm<br>\r\nThese are considered to be the \"average\" small races. Mostly because they're just big enough to be useful to humans. They are commonly referred to as \"Tinies\".<br>\r\n<br>\r\nD Tier - around 1.8 m<br>\r\nThis is where the human race belongs. Races of this size tier are considered the average. They usually posses the strongest magic powers. They have no commonly used name.<br>\r\n<br>\r\nC Tier - 2 m to 4 m<br>\r\nJust slightly above average, this size tier still has some magic powers, but still not as much as D Tier. Their size allows them to coexist with average size races. They are commonly referred to as \"Amazons\".<br>\r\n<br>\r\nB Tier - 4 m to 10 m<br>\r\nThe species belonging to B Tier and all tears above posses no magical powers. They mostly live in their own villages, but some choose to protect or rule over amazon and normal people's villages. They are commonly referred to as \"Mini-Giantesses\".<br>\r\n<br>\r\nA Tier - 10 m to 100 m<br>\r\nThe members of this size tier rarely form villages or communities, as they prefer to lead a nomadic and isolated lifestyle. They are commonly referred to as \"Giantesses\".<br>\r\n<br>\r\nS Tier - 100 m to 1 km<br>\r\nThese races are fully aware of the smaller races, and they often use their superior size and strength to enforce their will. They are commonly referred to as \"Mega-Giantesses\".<br>\r\n<br>\r\nSS Tier - 1 km and above<br>\r\nThese creatures are feared and avoided by all other races. They are so unbelievably massive that their mere footsteps cause catastrophic earthquakes. not only that but they are completely oblivious to all other small races, and they unknowingly end hundreds of lives each day. They are commonly referred to as \"Titans\".<br>\r\n<br>\r\nSince you chose to be inferior you will have to choose between Z, F, E or D Tier.</span></div></div>",
            "created":1528520400,
            "id":2504908,
            "title":"OTHER CHOICES"
        },
        "1121":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Z Tier",
                "F Tier"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The completely unnoticeable Z Tier (below 2 mm) or the barely noticeable F Tier (2 mm to 2 cm)</span></div></span></div>",
            "created":1528520400,
            "id":2504913,
            "title":"Z or F Tier"
        },
        "11211":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "I'm a Gnat Fairy",
                "Some other race"
            ],
            "content":"<div class=\"\"><div> <span><b><span class=\"cgrey\">Gnat fairy</span></b><br>\r\n<br>\r\n<b>Size:</b> About 1 millimeter <br>\r\n<b>Appearance:</b> Microscopic, gray, futa, fairy like creatures<br>\r\n<b>Habitat:</b> literally anywhere<br>\r\n<b>Info:</b> The gnat fairies are by far the most pitiful and pathetic race in Machrolandia. They live very short, meaningless lives that they spend cowering and attempting to hide away from larger races. Once born, they fully mature after just 3 hours. There have been no records of a Gnat Fairy dying from natural causes, since all of them die prematurely at the hands of an oblivious giantess. But such is the life of the smallest creature on the planet and the Gnat faeries have come to terms with that, since they cherish every single second they stay alive. <br>\r\n<b>Powers:</b> None, unless you consider being incredibly unlucky a power</span></div></div>",
            "created":1528520400,
            "id":2504943,
            "title":"The pitiful Gnat Fairy"
        },
        "112111":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Hiding in the grass with your buddy ",
                "another scenario"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you exactly?</span></div></span></div>",
            "created":1528660140,
            "id":2505371,
            "title":"A Gnat Fairy where?"
        },
        "1121111":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "MAKE A RUN FOR IT!",
                "A giant shadow looms over you"
            ],
            "content":"<div class=\"\"><div> <span>\"Do you think it sees us?\" your friend Lisa asks. \"Zip it Lisa! If she sees us we're as good as dead!\" yous tell her. You then both shut up, and you try to stay as still as possible. You were trying to hide from a Garden Naga, standing at 5 centimeters these nagas were much smaller than their normal counterpart, but they were still formidable predators for the likes of the microscopic Gnat Faeries, such as yourself. This one had picked up your and was poking out it's small split tongue, tasting the air in order to find you and make you her next meal, or worse. You had no chance of escaping, even though you could fly you couldn't get away fast enough. Your only hope was that she wouldn't notice you both, so you laid perfectly still on the dirt and prayed to the gods for safety.<br>\r\n<br>\r\nAfter a few intense minutes of seeking you the garden naga pinpointed your general location, she starts to slowly slither her way towards you and Lisa. Then you...</span></div></div>",
            "created":1528661700,
            "id":2505389,
            "title":"Hiding in the grass with your buddy "
        },
        "11211112":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "A Bare Foot",
                "A Hand"
            ],
            "content":"<div class=\"\"><div> <span>You start tearing up, you close your arms around Lisa and you mutter through tears \"This is it Lisa, We've had many close calls before but we're not escaping this one!\". Lisa could only reply by returning the hug and crying softly. But before you two could properly bid farewell to the world of the living, a giant shadow loomed over you. The Garden Naga stops dead in her tracks and looks up and her jaw drops in shock. You muster the courage to gaze up and see what is blocking the sun. The blue sky was replaced by a giant fleshy wall that was sharply ascending towards you. You Close your eyes and you prepare for the end...<br>\r\n<br>\r\nBut what is this strange object? </span></div></div>",
            "created":1528712700,
            "id":2505666,
            "title":"A giant shadow looms over you"
        },
        "112111121":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "underneath a fallen leaf",
                "In the two adventurers"
            ],
            "content":"<div class=\"\"><div> <span>Before you or the Naga could react the giant fleshy and wrinkly object descended upon you with. The giant foot collides with the ground sending an intense shock wave through your entire body. You and Lisa lie there still in shock and far too afraid to open your eyes. For a moment you thought you already died, as when you opened your eyes you were in darkness and the Naga was nowhere to be seen, only for you to look up and see that the wrinkly object was still above you, having stopped just a few centimeters away from you.<br>\r\n<br>\r\n\"GOT ONE!\" A booming voice from above said.<br>\r\n<br>\r\n\"GOOD JOB CASSIE, ONLY 17 MORE TO GO AND WE WILL FINALLY BE ABLE TO BUY THAT NEW BOW\" Said another equally as loud voice.<br>\r\n<br>\r\nYou then realized that you were under the Arc of a giant foot! What luck! And luckily for you, the Naga didn't have the same fortune same you did. The giant being then lifted it's foot, to reveal that it was a colossal(for you) forest elf, accompanied by a human. The elf then scraped the bloodied and flattened body of the Naga off her foot and said.<br>\r\n<br>\r\n\"NORMALLY THESE THINGS ARE MORE WARY, IT MUST HAVE BEEN BUSY WITH SOMETHING\"<br>\r\n<br>\r\n\"THE ELVES AT HYRADIL ALWAYS GIVE THE LAMEST QUEST. LIKE \"OOH FIND AND KILL 20 GARDEN NAGAS AND I'LL GIVE YOU 30 GOLD\" AND THEN YOU HAVE TO SPEND 3 HOURS ROAMING THE FIELDS SEARCHING FOR THE DAMN BUGGERS\" said the human.<br>\r\n<br>\r\n\"YEAH I KNOW RIGHT? I NEVER UNDERSTOOD WHY THEY HATED THE LESSER RACES SO MUCH, THE ELVES BACK AT FROSTHOLM WERE MUCH MORE TOLERANT. I AIN'T GONNA ARGUE WITH THEM THOUGH, PAY IS PAY, SO LET'S STOP WASTING TIME AND RESUME HUNTING\" the elf said<br>\r\n<br>\r\n\"THE SKY IS GETTING REAL CLOUDY, IT'S PROBABLY GONNA RAIN, LET'S GO HOME\" said the human.<br>\r\n<br>\r\nAfter that the two adventurers start heading away from you, their footsteps sending tremors throught the ground. You look at Lisa who's still embracing you with closed eyes and say\"Lisa, come on everything is fine\" Lisa slowly opens her eyes and scans the surroundings, after concluding that the naga is gone she says \"Oh thank the gods for saving us.\" \"It's gonna rain, we need to find shelter quick unless you want to get crushed under a colossal raindrop\" you say<br>\r\n<br>\r\nBut where do you seek shelter?</span></div></div>",
            "created":1528714500,
            "id":2505679,
            "title":"An elf tries to stomp you"
        },
        "12":{
            "author_id":"alotofstuff",
            "author_name":"Shrinking Fandom Writer",
            "choices":[
                "In a teepee with your tribe",
                "lookin for a tiny to use for mating season",
                "playing with a tiny",
                "your choice",
                "your choice"
            ],
            "content":"<div class=\"\"><div> <span>You: your a massive 17 foot 11 year old giantess with a massive dick to go with your sheer size (basically a futa girl) you have silky brown hair that’s ends at your shoulders and you have green eyes, your actually a few feet taller than a few grown up giantesses and of course your not very smart but make up for it in sheer size and hornyness, you also have double D sized tits. <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nWHER ARE YOU CURRENTLY...</span></div></div>",
            "created":1518066000,
            "id":2450830,
            "title":"GIANTESS GIRL (DOMINANT)"
        },
        "122":{
            "choices":[
                "You manage to get a smaller girl",
                "The girl gets away but you take this chance to follow and chase after her"
            ],
            "content":"<div class=\"\"><div> <span>          You had been looking through the grass trying to find the perfect tiny. You were clearly getting frustrated with the fact that you couldn’t find one. <br>\r\n          Soon you heard some rustling behind you and charge at the sound.<br>\r\n          You find...</span></div></div>",
            "created":1546745940,
            "id":2599415,
            "title":"lookin for a tiny to use for mating season"
        },
        "1221":{
            "choices":[
                "Play with the girl more in your teepee",
                "Find out more about your new cock toy"
            ],
            "content":"<div class=\"\"><div> <span>          Your large hands manage to find a nice little cock toy. Smiling down at the girl you lift her up to your face. “Looks like I finally got one!” You giggle and immediately start to force your cock into the girl’s mouth. After several minutes of vigorous thrusting you finally cum into the girl’s mouth filling her up with your semen. <br>\r\n<br>\r\nPanting softly you begin to force the girl around your cock as you walk back home.</span></div></div>",
            "created":1546746540,
            "id":2599419,
            "title":"A new toy"
        },
        "1222":{
            "author_id":"alotofstuff",
            "author_name":"Shrinking Fandom Writer",
            "choices":[
                "“your not gonna like what happens next”",
                "“Ok tiny I’ll let you go this ounce”"
            ],
            "content":"<div class=\"\"><div> <span>It only takes a few seconds but you see the tiny girl start to run from her hiding spot. with hot raging hormones inside of you wanting her anus you leap up and start to chase her down. As your chasing her you can see the fear in her eyes as she looks behind her to see you staring her down like a predator to its prey, wanting her small, petite, fragile virgin body. each step you take trembles the ground beneath you making it harder for the tiny to run and at this point she isn’t so tired your really just chasing after her for fun, you know fully your not going your full speed but you want to see her struggle more to get away from you. you finally had enough and you for real speed up and with one swift jump, bash your massive sweaty body into the ground, sending the tiny flying a few feet of the ground and landing on her butt. <br>\r\n<br>\r\nyou get out of your crouched landing position and hover over the terrified tiny futa girl “heheh, you gave quite a chase there little girl, but I think now it’s time for you to be put in your place and be used as my personal cock sleeve, now since you gave me something fun to do for ounce I’ll give you a choice, you can willingly become my cocksleeve and come over here to make it a tiny bit easier for me so at the same time you can keep some dignity, or you can try to escape and fail horribly...your choice” with that all said all the tiny can do is stutter as she covers up her tits and tiny dick. Finally she musters the courage to speak up to you “b-but your just a little girl, what makes you think your gonna do that to me, As an adult I command go to leave me be and go back to your village” she says expecting it to fail miserably. </span></div></div>",
            "created":1547438460,
            "id":2603192,
            "title":"The girl gets away but you take this chance to ..."
        },
        "123":{
            "author_id":"alotofstuff",
            "author_name":"Shrinking Fandom Writer",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>you are standing in the grass naked (of course) when you remember the tiny you found and trapped...stripping it naked of course. You decide to go the the little room yo trapped her in and gon to get her. “Hey let me out you stupid giant, I’m older and smarter than you, you can trap me like this” she shouts up at you but you ignore her little pathetic screams and pick her up by her stomach with one hand wrapped around her whole body. She shrieked as you pick her fragile body up, thinking you were gonna hurt her for saying that but you just hoist up her naked body off the ground and take her outside before your mom tells you”don’t accidentally break her now, we might find some use for that tiny someday” she says. “I won’t mom, I’m just bringing it outside to play with it” you say sternly.and with that she walks outside.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n     You take her a while out to a secret spot your tribe doesn’t know about that you love to play bye and you sit down as your massive ass covers the ground with a load THUMP when you finally fully sit down. You then cross your thick powerful legs together and hold her out with both your hands. “Hey, I’m not a toy I’m a living person, please get me some cloths and let me go or else” she says in a desperate attempt to reason with you. You looked at her with questioned written all over your own face and say “uummm, or else what little girl, I’m 11 years old and I still was able to easily capture you, take your cloths off, and trap you and you couldn’t do anything to stop me, and yes, you are my toy and if you don’t be quit you’ll be my SEX toy” you said, ending the argument when you increased pressure around her stomach, making her squeal in pain.you then look at her again and say” well I’ll probiotic end up using you as a mating cock ring anyways since your pretty small, will you have the same thing to say when i force my cock all the way through you and wear you like an object, I can just imagine it...seeing your little body dangle from being impaled by my massive cock and slowly twitching and groaning in pain and not being able to do anything about it until I’m done with you” you say lustfully. She looks at you with fear and say” I’m sorry I’m sorry, please don’t do anything like that” she begs of you. You then start massaging her small breast and say “hhhmmm well I am 11 and you are 16, would it be really wrong if I started practicing the mating ritual of you?” You ask yourself while still looking at her with the eyes of a sex hungry predator...</span></div></div>",
            "created":1518152400,
            "id":2451152,
            "title":"playing with a tiny"
        },
        "1231":{
            "author_id":"alotofstuff",
            "author_name":"Shrinking Fandom Writer",
            "choices":[
                "Probably ",
                "no..."
            ],
            "content":"<div class=\"\"><div> <span>You decide that you are gonna practice the giant mating ritual, you turn the girls little body around to her backside so her stomach rests snuff in your palm.. her face instantly turns red when you do this and she squeals in panic “wait, your only like 10 or 11, you can’t do stuff like that to me, I’m older than you so I command you to put me down giant girl” she says to you still blushed. you the. Start to career her left buttcheek and say “well my dick alone is bigger than your whole body so when your smaller than my penis you don’t really got a lot in ay for what happens to you little girl” you say, you then get out of your cries-cross position and lay your massive giggly legs out, the small girl can see the sweat your massive plump body is producing and she actually starts to get a hard on, she tries to hide it but not good enough. “Hmm, so you like what’s about to happen to you bud, well then I guess I won’t hold back on you seeming you want it” you say with a mischievous face. She quickly turns her head back and say “wait, not-not at all please don’t do this” as she squirms around in your powerful grasp. So with both hands you lift her up by her sides and slowest slide her down your throbbing dick. The little girl moans as her butt makes contact with the huge tip of your cock. Your sweating so much that you don’t even need a lubricant. <br>\r\n<br>\r\n<br>\r\n<br>\r\nyour tip meets in between her ass cheeks and she starts to moan and wimpered as she knows she can’t do anything to do to stop this so she sits there still and defeated by what you are about to do to her. you then yank her body down while forcing your dick up her ass, gradually feeding your dick up her ass. a massive lump forms wherever your penis is inside her. She is yelling in pleasure and disgusts as your tip makes its way to her mouth. Then just a few moments later with one last powerful yank you FORCFULLY ram your cock all the way out her mouth. Her ass is down widely spread and to your body and her body forced to curve upwards with the shape of your erection as she gargles and cries. You can’t hardly make out what she is trying to say “huh, what was that tiny, I can’t hear you, bet you wish you hadn’t of said that huh?” You ask her mockingly. She thrashes around trying to free herself without success, she just dangles there and cry in pain as she gargles for air. you stand up as you admire your good work. her helpless naked body swings with each movement you make, while she still faintly twitches a little. “Hehehe, with you impalled by my massive dick you LOOK like my dick” you say then quietly laugh. Sooo...are you gonna keep her like this?</span></div></div>",
            "created":1518238800,
            "id":2451532,
            "title":"Yes"
        },
        "12311":{
            "author_id":"alotofstuff",
            "author_name":"Shrinking Fandom Writer",
            "choices":[
                "pull her off your dick",
                "SWITCH POV"
            ],
            "content":"<div class=\"\"><div> <span>You look at her looking up at you with pitiful eyes and decide that her torture isn’t over with, your gonna make her suffer through this for a whole day. “Well it sucks for you tiny girl but I’m gonna keep you like this for the rest of the day, I guess you should t have had that attitude towards me, I fact to make it even worse for you I’m gonna tie your limbs around me so you can’t move an inch” after hearing this she cries even more knowing it’s gonna be very painful. you grab two pieces of rope and tie her arms and legs to your sides so she can’t move them. With that done you say “hehehe, your starting to look for like a bikini that only covers the front side than a living person, not including my penis jutting out of your little mouth. sucks for you but hey, there ain’t anything you can do about it so whatever” you say with a cute smile. you finally get home avoiding the grown up giants and when you get in the house your mom isn’t there so you quickly get to your room and lock it. you plop your massive ass on the bed and lay down, stretching out you pull on the limbs of your tiny victems and causes her to moan in pain. for the next few minutes you lay on your bed staring at the tiny girl currently impaled by your massive pecker and slowest shifting to try to get comfortable while at the same time moaning and simpering in pain and embarrassment. you actually start to feel sort of bad for her that she can’t escape from you at all and that she has to endure this humiliating pain for so long “hm, I kind of feel bad for you tiny one, it must be so hot militating for you to be used and abused like this by an 11 year old, what should I do with you</span></div></div>",
            "created":1518325200,
            "id":2451796,
            "title":"Probably "
        },
        "124":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Firespike",
                "Emberfury",
                "Iceguard or Shadowbanner"
            ],
            "content":"<div class=\"\"><div> <span>The land is divided into four tribes. Their technology resembles that of stone age humans: they have discovered fire and can make shelter, some tribes can even produce clothing. Which tribe are you from?<br>\r\n<br>\r\n<b><span class=\"clred\">The Firespike tribe</span></b><br>\r\nThis tribe's land is covered in a vast jungle. The giantesses regularly raid the villages of the tiny people in order to acquire new slaves. It is considered a tradition among members of the tribe to always be barefoot and to never clean their feet, except when they force a tiny woman to lick them clean. Every year a few week before mating season they have a festival called crush fest. during the festival which last 10 days the giant women gather every undesirable small woman around, then they stomp them to death. This brutal practice ensures that only the most desirable tinies are used during mating season. The members of the tribe usually wear nothing, but some warriors can be seen wearing tooth necklaces and war paints. They are at a constant war with the Emberfury tribe over who gets more slaves.<br>\r\n<br>\r\n<span class=\"cyellow\"><b>The Emberfury tribe</b></span><br>\r\nThis tribe's land is covered in a vast Savannah, with large fields of tall grass complete with equally large wildlife that dwarfs the tiny people. Due to the fact that large predators like giant lions or cheetahs often make snacks out of tinies and that large herbivores like hippos and elephants often crush them without noticing, having a small slave is considered quite a commodity. Recently there has been a trend, in which its very popular among slave owners to torture their tinies with their butts, such as sitting on them or even using them as toilet paper. The giant women of this village are slightly more advanced that the other tribes, so they wear leather clothes. They are at a constant war with the Firespike tribe tribe over who gets more slaves.<br>\r\n<br>\r\n<b><span class=\"cblue\">The Iceguard tribe</span></b><br>\r\nThis tribe's land is covered in a vast tundra, in which rains snow all year around and the temperatures are always below zero. The tiny girls and the big girls live in the same cities in complete harmony. The big girls provide warmth and care to the small girls and the small girls in turn willingly participate in the mating season ritual. Due to the extremely harsh weather the giant girls have to wear thick fur clothing that almost completely covers them, the little girls wear nothing at all, since whenever they are not indoors or near a campfire they are transported around in a giant woman's warm place, which is usually their mouth, pussy or even asshole. All other tribes avoid attacking the Iceguard tribe because the extreme weather and the protective nature of the big girls there makes it very hard to properly kidnap a tiny woman.<br>\r\n<br>\r\n<b><span class=\"cmagenta\">The Shadowbanner tribe</span></b><br>\r\nthis tribe's land resembles a vast forest in which it is always night and the sun never shines. No one is sure why but one legend states that the Giant women of this tribe offended the gods, so the gods cursed their lands with eternal darkness and they cursed the giant women there with an insatiable hunger for tiny women. The giant girls of this tribe see tiny girls as a delicacy and they often swallow them whole or play with them their mouth so they can savor the taste. Because of this it is rather rare for a giant woman to find a tiny girl in time for mating season. The other tribes refuse to trade with them because they supposedly angered the gods, so members of the Shadowbanner tribe are sometimes forced to raid other tribes for tiny women. Since their lands are pitch black and the giant and tiny women can only slightly see, they wear nothing at all.<br>\r\n<br>\r\nWhich tribe are you from?<br>\r\n<br>\r\n</span></div></div>",
            "created":1526446800,
            "id":2493898,
            "title":"The four tribes"
        },
        "1241":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "it's feet worshiping day!",
                "It's crush fest!",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You: your a massive 30 foot 16 year old giantess with a massive dick to go with your sheer size (basically a futa girl) you have long black hair and red eyes. You sport a pair of massive, dirty and smelly feet that are always barefoot, you have a D cup breast and a plump ass. What are you doing today?</span></div></div>",
            "created":1526446800,
            "id":2493905,
            "title":"Firespike"
        },
        "12411":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "You get one of your friend's slaves.",
                "Time to go slave hunting."
            ],
            "content":"<div class=\"\"><div> <span>It was another glorious morning in the lands of the Firespike tribe, the sun had just risen and the new day held endless possibilities for adventure. Meanwhile you were just waking up, still feeling groggy and rubbing your eyes, you push away the animal furs that you use for bed sheets. You grab your foot and you bring it closer to your face. You sniff and then.<br>\r\n<br>\r\n\"Argh!\" you scream, jumping back instinctively.\" Damn my feet reek like death! I don't even remember the last time i cleaned them.\" you say as you get up. \"SLAVE! where are you! Your mistress needs your small tongue!\" you yell, but to no avail as your little servant is nowhere to be seen. \"Damn useless slave\" you mutter as you crouch on the floor searching for him. \"When i find you, and i will, you'll be in for a whole world of pain you slacker!\" you say trying to intimidate her, again to no avail. \"Where could she be...\" you stop, you just noticed a small red spot on the ground and yesterdays events start to come back to you.<br>\r\n<br>\r\n\"Ooohhhhhhh right...\" you say defeated. \"I remember now! Last night i was in a pretty crummy mood, then i got hammered, then i got home, then i got even angrier at my slave and then... SQUISH!\".You get up and you say \"Well crap. How do i always manage to crush my slaves at the worst possible times? Well anyways my feet need cleaning and i'm not going anywhere near them, so i'm going to need a new slave.\" you say. You get out of your house and you start walking around your village, contemplating your next action.</span></div></div>",
            "created":1526446800,
            "id":2494070,
            "title":"it's feet worshiping day!"
        },
        "12412":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Good ol' stomping, crushing and trampling",
                "Something *Special*"
            ],
            "content":"<div class=\"\"><div> <span>You wake up early in the morning, with the sun barely starting to rise. You get out of bed rubbing your eyes, you then look towards the wall on your left. On it there were a total  of eighteen black lines drawn with charcoal, above that the words \"Calendar\" were chiseled on to the wall. You gasp in shock \"It's Crush Fest!\" you yell, then you follow that revelation with giggles of child like glee. This was great! Crush fest was one of the biggest holidays in your tribe, right behind Foot Worship Day. Every year, for ten day you could stomp as many little girls as you wanted without having the elders punish you for being wasteful. You are supposed to crush only the \"unworthy\" little girls but nothing really stopped you from stomping any tiny you wanted. All you had to do was walk up to an elder with a tiny and say that the tiny said a mean word or something like that. Then you receive full permission to snuff out the poor girl in as cruel a way you can imagine.<br>\r\n<br>\r\nBut the questing is: Is this going to be normal crush fest or is there something *Special* this year?</span></div></div>",
            "created":1528434000,
            "id":2504458,
            "title":"It's crush fest!"
        },
        "124122":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Mystic power 1",
                "Mystic power 2 or more options"
            ],
            "content":"<div class=\"\"><div> <span>A few days back some girls decided to venture into the old ruins in the eastern part of the jungle. While normally girls stray away from the ruins because of all of the ghost stories the elders tell, this group of girls had an unexplainable urge to venture inside. The temple belonged to the precursors of the FireSpike tribe, who mysteriously disappeared around 5 millennia ago. Despite their throughout search, the girls only managed to find one ancient artifact, well there was a pretty large stash of them through. Upon first examining it the peculiar object, it appeared to be two pieces of leather stitched together in order to form a small bag-like shape. Next to the stash was a small sign that they could actually understand unlike every other writing in the temple, that's written in a long dead language. the sign said \"Shoes\" and just below that \"Goes on foot\".<br>\r\n<br>\r\nAt first the girls were totally dumbfounded, why would anyone want to cover up their feet? For them feet were always meant to be completely revealed, in order to get dirty, so they can force a tiny slave to clean them. Then it dawned upon them, these weren't just some accessories, they were tiny torture devices build by their ancient ancestors. further examination revealed that each \"shoe\" had a strange, faintly glowing rune on the bottom. While none of the girls knew the meaning of the runes, this proved that there was more to these shoes than it seems. So they quickly grabbed as much of these shoes as they could, and they brought them to the elders of the tribe. After a lot of convincing the elders finally decided that the shoes were safe enough to use.<br>\r\n<br>\r\nWhat's more they decided that every girl in the village would receive a pair of these on Crush Fest in order to spice up the festival.<br>\r\nWhich mystical power do these magic shoes posses?</span></div></div>",
            "created":1528434000,
            "id":2504515,
            "title":"Something *Special*"
        },
        "1241221":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Let's go for a loooooong walk.",
                "Let's jump around a bit."
            ],
            "content":"<div class=\"\"><div> <span>\"Are you sure this is safe Sarah?\" you ask worried worried. \"Don't worry, many girls before you have tried these \"Shoes\" and they're completely fine. They even said that it feels great with a tiny woman inside.\" she replies. With that you take a sigh of relief, you sat on a nearby chair and then you get ready to put on shoes for the first time. Your friend was even nice enough to bring along one of her tinies for you to use. The poor little thing was trembling on the floor and praying for mercy, it was so adorable. Without much hesitation you quickly pinch your index toe and big toe around it's neck, effectively trapping it's head between two giant pieces of flesh. Tiny tears start rolling down the little woman's cheek once you start lifting her up, and then you place her along with your foot inside of the shoe. With her head neatly rested between your toes and her body squirming between the sole of your foot and the sole of the shoe, you start getting up. Faint cracks and pops are heard as you get up and you shift your weight on to the helpless tiny woman. The cracking bones send pleasureful vibrations along the sole of your foot. \"Oh gods, this really does feel so good...\" you mutter in pure bliss. \"I know right? How come we never came up with this ourselves?\" Sarah asks.<br>\r\n<br>\r\nYou then shift your focus from the pleasure to Sarah's feet. That sneaky girl had already put a pair of shoes on, which no doubt have a tiny inside. \"Damn girl, you work fast!\" you say to her. \"Oh believe me i savore the pleas of the little girl too, you just spent a long time enjoying yourself\" she answers. \"What should we do now?\" she asks.   </span></div></div>",
            "created":1528434000,
            "id":2504523,
            "title":"Mystic shoes"
        },
        "12412211":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "You slept like a baby",
                "You couldn't sleep, you were thinking about the possibilities..."
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go for a loooooong walk.\" you say. \"i like the way you think girl\" Sarah said. You both headed to the outskirts of your village, where the flat landscape allowed for some really pleasant walks. The first few steps were filled with light snaps and pops as the bones of the little prisoners were getting pulverized. You and Sarah, finally make it out of the village, the outskirts were beautiful and sunny today. The birds are singing, the flowers are blooming, your shoes are making watery and squeaky noises, it truly is a beautiful day. By now all of the bones in the hapless little girls had been pulverized, so now the only thing making noise were their organs which were in the process of being ground up into a fine red liquid. You then realize something, your toes are completely closed which means you've already crushed the tiny woman's head, but she was still... moving? \" This is really weird you know? We already pulverized them, and she's still struggling?\" you say to Sarah. \"Yeah i know it's super weird. I don't even feel anything watery down there and they should have popped like grapes with the first step. But let's not argue with it for now, it still feels great after all\" she says. With that you stop questioning things and you just continue enjoying things while they last.<br>\r\n<br>\r\nEventually the whole day passes unnoticed, as you were too busy enjoying yourselves. \"I stopped feeling mine\" Sarah said. \"Yeah mine finally stopped moving a while ago, let's take them out\" you say. You then stop, you clench your toes and you take your foot outside the shoe. Instead of the expected bloody mess, the shoe was completely clean. And the little girl no longer looked like a girl. Her lifeless body resembled a human shaped piece of paper, covered in foot sweat and dirt. \"What the...\" you say surprised, as you bring the body of the girl close to your face. \"YEP, yep, sure smells like it's been in my shoe all day\" you say as you casually throw the body on to the ground. It gently falls to the ground just like a piece of paper. \"Yeah it's very unusual, maybe it's because of the shoes\" says Sarah, who you notice has already taken her shoe off and discarded the pancaked tiny on to the grass, damn, that girl is really fast. You then realize that the rune on the sole of the shoe started glowing a bright red. \"Cool we have magic shoes!\" you conclude. \"But how did they get enchanted? Who did it? Are there any more similar artifacts? Are there...\" you start asking. \"Look, i don't know about you but i'm tired and it's getting late. Let's go to bed and let's unravel this mystery tomorrow, after all there are nine whole days of Crush Fest right?\" she says. You can't help but agree, it has been a long day. Both of you make their way back to the village where you both go to your homes. You lie down in your bed and then...</span></div></div>",
            "created":1528434000,
            "id":2504529,
            "title":"Let's go for a loooooong walk."
        },
        "124122112":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Speaks.",
                "Reader's choice."
            ],
            "content":"<div class=\"\"><div> <span>You just couldn't sleep. The thought of the endless possible magical items in the temple was the only thing occupying your mind. You just had to know more, you just had to have it all. So you quietly got out of bed as to not wake your mother, you picked up the shoes and then you headed for the ruins in the middle of the night. You venture inside of the jungle, in search for the elusive temple. \"Goddammit, i'm sure it was somewhere here!\" you say to yourself in frustration. Welp, you're kinda lost, but wait what's this? the rune on the sole of the shoe is starting to glow brighter, you must be getting close to something. You can barely see in the darkness of the night. Luckily you've been traversing these jungles your entire life, you basically have every nook and cranny memorized. Which is why you're starting to doubt this glowing piece of footwear, because you've been in this part of the jungle and there's nothing he...<br>\r\n<br>\r\n*THWACK*<br>\r\n<br>\r\n\"OW!\" you yell, as you just smacked your head into something. \"What the hell? Since when is this... thing here?\" you say as you're touching it in an attempt to figure out what it is. It seem like it's rather large, made out of old,crumbling rock and it's covered in vines and moss... Wait a minute, this must be the temple. You make a mental note that there seems to be a huge ass stone temple here, and then you start going around the thing searching for the entrance. After a few minutes and several stubbed toes you manage to locate a large opening in one of the wall. You enter inside very carefully, you don't want to trip or to activate a trap accidentally. You step forward and...<br>\r\n<br>\r\n*CLICK*<br>\r\n<br>\r\nYou freeze in place. What the hell was that noise? What's happening. Hundreds of disastrous possible outcomes were instantly flooding your head. But luckily the only thing that happened was that the torches on the walls magically lit themselves. Sure the whole thing was creepy and eerie, but to hell with it, you didn't come so far just to give up now did you? You look around for a second and you realize that you're in a large circular room, and in the middle there was a cracked altar. The whole structure started shaking for a few seconds, almost making you fall over. You concentrate at the altar again, something is happening. A strange red substance was flowing out of the cracks on the altar. The moment the substance leaves the altar it starts to unnaturally lift up towards the ceiling only to stop and clump up midway towards it. The red ooze stopped flowing when the floating ball of it reached a diameter of about twice your height. You watch in awe as the red liquid starts to morph and change form. After about a minute the once formless blob now resembles a very large red shemale. The giant, even by your standards, girl opens her eyelids to reveal two bright yellow eyes staring right into your soul. You hold your breath in anticipation of what happens next.<br>\r\n<br>\r\nThe red figure then...</span></div></div>",
            "created":1528434000,
            "id":2504578,
            "title":"The ancient FireSpike temple"
        },
        "12413":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "You are going to war against the Emberfury tribe.",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could you do?</span></div></span></div>",
            "created":1526446800,
            "id":2493907,
            "title":"Something else"
        },
        "124131":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Made it to the village and started the attack",
                "Something happened"
            ],
            "content":"<div class=\"\"><div> <span>\"May you remind me why we're going to wage war against the Emberfury tribe?\" You asked the warrior girl, with whom you were marching with.<br>\r\n<br>\r\n\"It's over who gets more slaves, the Emberfuries have been stealing ours so we have to tech them a lesson.\" she says in a stern and monotone voice.<br>\r\n<br>\r\n\"Is that it? That's why the elders are sending 40 strong women to war. More slaves? I mean don't get me wrong i like having my feet worshiped just as much as the next girl but i'm not sure it's worth to risk my life for more.\" you answer.<br>\r\n<br>\r\n\"They started this war you know? They think they're entitled to the largest amount of tiny women, but since their lands have so very few  of them they constantly have to steal ours. This war isn't about slaves, well not entirely, it's about sending a message. And the message is that we wont just sit around and be humiliated like this. That's why we're marching towards an Emberfury village, so we can destroy it and take the spoils.\" she said.<br>\r\n<br>\r\n\"Well i guess it kinda makes sense now. The name's Emily by the way\" you say.<br>\r\n<br>\r\n\"I'm Harley\" the woman said.<br>\r\n<br>\r\nAs you and the other women continued to march the lush jungle was replaced by a dry savanna, a clear sign that you were entering in Emberfury territory.  You readied your spear as the leader of the attack group ordered you to be prepared for a potential ambush. In the end you...</span></div></div>",
            "created":1526446800,
            "id":2494030,
            "title":"You are going to war against the Emberfury tribe."
        },
        "124132":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "It's mating season ;)",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is it?</span></div></span></div>",
            "created":1526533200,
            "id":2494306,
            "title":"Something else"
        },
        "1241321":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Play a game with her",
                "No time for game. It's mating season after all."
            ],
            "content":"<div class=\"\"><div> <span>It's mating season. Which means that all 18 year old giant girls (you included) leave the village temporarily in order to find a small girl to wear as a cock decoration. \"Mom, i'm leaving so i can find a mate! Wish me luck.\" you say.\"Good luck sweetie. Oh i almost forgot to mention, you should start your search in the eastern parts of the forest, When i was your age i always found the smallest and most pathetic tiny girls there.\" your mother says. With that you hug her one last time before venturing outside. You head toward the village center where a whole bunch of giant girls your age had gathered, all waiting for the elders to let them loose into the jungle.<br>\r\n<br>\r\n\"hey Emily! I didn't know you'll be participating too.\" you say surprised that your friend is here.\"You're joking right? Every teenager in this village wants to get busy!\" she answered. \"I  hope we bump into each other after we find a tiny\" you say.\"Hey no promises, but if we do we're sooooo getting it on\" she says. \"Attention young ones!\" One of the Elders screams. \"As you may all know you are about to participate in the mating ritual. This is a sacred event as old as time and we all wish you luck on your journey. May the gods guide you to the perfect tiny girl. Now go, go forth and bring us a new generation of brave and strong women such as yourselves\". With those last words all of the girls jolted away, all in different directions. You noticed that most headed up north, some south or west, but almost none headed east.\"Perfect\" you say to yourself. \"Now all of the good girls are all mine!\"<br>\r\n<br>\r\nYou then resume the hunting. You weren't very familiar with the eastern region of the jungles but you took mental notes about the environment so you couldn't get lost. You stepped around very lightly as to not alert any small girls of your presence. You were looking around at a nearby oddly shaped rock when you saw her. She was tiny, even compared to other small girls you've seen she was truly pathetic. Her hair was dyed blue and she had tiny little boob and an almost flat behind. She was nervously looking around and changing directions often, it was obvious that she was lost. Having already acquired your target you make a big leap for her. You land right in front of the little girl, the shock wave of your impact with the ground made her fall back. \"Eeek! P-please don't hurt me!\" she squeaks in an adorable voice. \"What? I would never do that to you. Say, how old are you?\" you ask.\"I-i'm 16\". She's that old and this small? She's perfect! you think to yourself.\"Are you lost little girl?\" you ask.\"Kinda\"she mutters ashamed.\"Don't worry! I know a place where you'll be safe.\" you say. \"W-well i uh... i'm sure i'll find my way out eventually.\" she says,with a scared voice. \"Oh don't be like that.\" you say as you grab her.\"My way is perfectly safe and faster. I'm Katie by the way.\" you say.\" I'm Lily...\" she barely manages to say from sheer fear.</span></div></div>",
            "created":1526533200,
            "id":2494316,
            "title":"It's mating season ;)"
        },
        "12413212":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "More Firespike territory duh!",
                "Some other tribe's land. What?"
            ],
            "content":"<div class=\"\"><div> <span>There was no time for games, maybe the other girls had already found a tiny of their own? It's a race against time and you need to get down to business. You take off your loincloth revealing your massive member. \"W-what are you...\" the little girl begins to say, but she's cut off by a horrible realization. You started getting a hard on from the sheer idea of ramming her tight little ass. \"No no! please wait you, you can't do this.\" she yells.\"Don't worry Lily, as long as you cooperate you should get to safety... eventually\" you say reassuringly. You start lowering Lucy's small body towards your crotch. Eventually her ass cheeks and your penis meet and the prayers and pleas are replaced with moans of both pleasure and pain as the head of your penis starts to make it's way into her. Her squirming and thrashing serve only to increase your arousal. After a few minutes that seem like an eternity for poor little Lily you decide to stop slacking around.<br>\r\n<br>\r\nYou RAM your cock in to her. Her tiny body spasms as your shaft makes it all the way through her almost instantly. You moan in pleasure as the friction caused my your sudden thrust is enough to make you ejaculate. \"Woah, that felt better than ever before! Se little Lily it wasn't so bad now was it\" you say ironically to the little gun impaled on your cock. Sadly she couldn't properly respond as the giant cockhead sticking out of her mouth kinda made speaking impossible, so everything just came out as inaudible moan. \"I'm afraid that you won't be able to get off anytime soon so i hope you like semen for breakfast, lunch and dinner!\" Tears started coming out of Lily's eyes, as she realized just what she had gotten herself into. \"Well, part one of the plan is now complete. Now for part two i need to find a mate.\" you say.<br>\r\n<br>\r\nYou then get up and start marching into...</span></div></div>",
            "created":1526533200,
            "id":2494575,
            "title":"No time for game. It's mating season after ..."
        },
        "124132122":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Emberfury",
                "Shadowbanner or Iceguard"
            ],
            "content":"<div class=\"\"><div> <span>\"you know what Lily? i think i should look for a mate from another tribe!\" you say.\"Yeah, yeah i know that we firespikes aren't exactly \"liked\" by the other tribes but you only live once right? Plus i heard that mating season is the same time in every tribe.\" you conclude.\"So what do you think?\" you ask ironically, as you expect no answer from the currently impaled little girl. After a series of indistinguishable gurgles and moans, you say \"Well i'll take that as a yes! But which tribe should i choose?\"<br>\r\n<br>\r\nFirst off we have the Emberfury's who are probably the least likely to get along. After all, your tribe and their tribes have been at war for as long as anyone could remember. It is still possible to find a mate there, you hear that those Emberfury girls like to get frisky, so they may not realize you are their sworn enemy until you're already pregnant. You also heard that they are wimps who rely on their numbers to fight, so if you manage to find a lone member, a strong and proud warrior like you should easily overpower her. Then you can do whatever you please with her, kinda like a... regular sized slave!<br>\r\n<br>\r\nNext are the Shadowbanners they don't hate your tribe but they don't love it either. You hear they have a taste for tiny women, so you may be able to bride one with a snack. Although this is the most plausible option you're not sure how your fellow tribe members will react. After all the legend states that their land is shrouded in darkness because they angered the gods, and copulating with someone who angered the gods, can get you banished. Speaking of darkness, their land is pitch black, the natives seem to have memorized the place or something so they are capable of navigating it, you may get ambush there.<br>\r\n<br>\r\nAnd last... Ugh the Iceguard. This should be possible or impossible depending on your actions. The Iceguards love tinies, they respect them, they care for them and they even go so far as to ask for consent during the mating ritual! Which is everything your entire tribe stands against. There's no overpowering them, you hear they're massive and muscular due to constant hard work, so you'll need to pretend to care for tiny women in order to get close. Heck if you play your cards right you can even knock some logic into one and make them treat tiny women like what they are: worthless bugs. Oh and also it's really cold there so you'll need a sweater or something.</span></div></div>",
            "created":1526706000,
            "id":2495460,
            "title":"you'll mate with someone from another tribe"
        },
        "1241321222":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Shadowbanner",
                "Iceguard"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The ravenous Shadowbanners or the gentle Iceguards?</span></div></span></div>",
            "created":1526706000,
            "id":2495467,
            "title":"Shadowbanner or Iceguard"
        },
        "12413212222":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "*Bump* into a potential mate.",
                "Pass out due to the cold."
            ],
            "content":"<div class=\"\"><div> <span>\"Well little Lily i hope you're resistant to cold because we're heading up north to the Iceguard's lands\" you say confident in your choice. When you started making your way up north you realized that simple loincloths weren't going to cut it in the frozen wastes of the northern regions, especially since you had to ditch yours earlier in order to show off your massive erect cock and the pathetically tiny woman impaled on it. But showing off be damned, you weren't going to freeze to death just because you want everyone to know how large you are. But you didn't fret, after all the Firespike tribe prides itself on its ability to survive and adapt. You were no different, you quickly crafted a spear from a sharpened rock and a stick and you go hunting. After about half an hour of tracking you manage to locate a single adult buffalo. What a find! Usually these furry giants traveled in pack, which made them a hard target, but not this one. You sit around in the bushes, waiting for the perfect moment to strike. When the buffalo moves its head to the side revealing the side of it's neck, you react accordingly. You put all of your might into one throw, the spear flies through the air burying itself deep in the buffalo's neck, killing it instantly. The large animal falls to the ground with a loud thud, signaling your victory.<br>\r\n<br>\r\nDuring mating season it's completely normal for a girl to be extremely horny and so far you managed to contain your urges to relieve yourself. Up until now because the thrill of the hunt and the well aimed shot only served to intensify these urges. Unable to think about anything else you sit down and you grab Lily. you start moving her small body up and down stimulating yourself. The feel of her stomach and intestines grinding against your dick were unlike any other pleasure before. \"Dinner's ready Slut! Drink up!\" you yell as you release your load, which flies a rather impressive distance. Finally capable of normal thoughts again you get up and walk to the puddle of semen you made, you picked up a handful and you jammed it down Lily's mouth, after all we can't have her die from starvation before mating season ends. you then quickly skin the dead buffalo and you fashion yourself some fur clothing, it wasn't the prettiest but it should be able to warm you. You slice off some of the meat for the journey and you leave the rest to some other girl to find.<br>\r\n<br>\r\nYou then start the long trek to the Iceguard homeland. As you go further the lush forests start getting less and less populated and colder, you know you're in the right path. Eventually you make your way to a gigantic mountain that pierces the clouds, beyond this point it's Iceguard territory. After a few hours of exhausting climbing you finally make it to the top. The top of the mountain was almost perfectly flat, with thick layers of snow in every direction, punctured by the occasional pine tree  forest. You started marching forward, determined to find a mate. But as if cursed by the gods, a giant snowstorm appears as if out of nowhere. You however being the hardheaded individual you are, continued forward. Inside of the raging storm, in which you can barely see 5 feet in front of you due to the snowfall, you... </span></div></div>",
            "created":1526706000,
            "id":2495488,
            "title":"Iceguard"
        },
        "124132122222":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "A wooden cabin",
                "Someplace else"
            ],
            "content":"<div class=\"\"><div> <span>You should have headed back or at least tried finding some shelter, but no you had to keep going inside the raging storm. The fur clothes you wear don't provide enough warmth for you, and you start feeling lighter. As your vision starts blurring and the storm continues raging on, you can barely make out a shadowy figure making it's way towards you. But before the figure got close enough you pass out and you fall in the snow.<br>\r\n<br>\r\nLater you awaken at...</span></div></div>",
            "created":1526792400,
            "id":2495877,
            "title":"Pass out due to the cold."
        },
        "1241321222221":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Let's have dinner together.",
                "let's mate."
            ],
            "content":"<div class=\"\"><div> <span>You slowly wake up, as your body warms itself up. You realize that you are in a small cabin, specifically lying in a bed. \"Oh, your finally awake.\" a feminine voice said. You push aside the animal furs that were covering you like a blanket, you then get up so you can take a look at the source of the voice. She... she was beautiful! She had long blonde hair and blue eyes, she couldn't be any older than you!. As you look down you notice her huge size F breasts, looking further down you notice her stunning abs, she was very muscular from a life of hard work. You then gaze lower and you realize something, her cock is an absolute monster! It was colossal, bigger than any other you've seen even your own, and on that cock there was a small girl impaled, she looked like she was about to burst, barely able to stay together from the pressure of the massive cock. Speaking of size you just realize how big this girl was, even by giant's standards. You were used to being a little taller than your peers but she looked at least two or maybe even three heads taller than you.<br>\r\n<br>\r\n\"Are you feeling ok?\" she asks. You nodded as you were still in awe of her beauty. \"Oh where are my manners.\" she said \" I didn't introduce myself. I'm Siv and this is Klara.\" she said. \"We've been friends ever since childhood, and recently she granted me permission to use her in the mating season ritual\" she continued. \"I'm Katie and this here is Lily\" you say. You then quickly try to make up some convincing heartwarming story in order to get on the giant woman's good side. \"I found her lost in a jungle some years ago, ever since then i've been taking care of her and now she's given me the honor of using her\" you say, hoping she doesn't catch you lying. \"A jungle? So you're from the Firespike tribe right? It's good to see that other giants from other tribes also treat tinies fairly\" she says. Great! she fell for it and luckily little Lily can't say otherwise because she has a mouthful of your cock.<br>\r\n<br>\r\nSiv smiles softly and says... </span></div></div>",
            "created":1526792400,
            "id":2496000,
            "title":"Alone in a cabin with a muscular futa..."
        },
        "12413212222212":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "I want to stay with you forever.",
                "I'll stay until the storm is over."
            ],
            "content":"<div class=\"\"><div> <span>\"Let us mate\" Siv says in an extremely straightforward and assertive manner. You had no objection, you knew you wanted it bad after the second you gazed upon her. Normally before the mating commences the two women stand up next to each other, measuring their dicks to determine who fucks who, and if they were equal the two girls have a quick \"friendly\" brawl to determine. But there was really no competition here, Siv's member was practically twice as big as yours, plus you weren't even going to consider challenging her. So you simply got on all fours on the bed and patiently awaited your mate. Siv smiled as she made her way toward you. When she climbed up on the bed it started to creak under the massive weight of the two giantesses. Siv started out by inserting the head of her cock into you. You moaned as she then slowly started sliding in the rest of it. Midway through you felt a small bump, it was obviously the little woman stuck on her penis. She started out slowly as if trying not to hurt you, but that wouldn't last for long.<br>\r\n<br>\r\nThe small cabin was filled with soft moans as Siv started slowly increasing the speed of the thrust at a steady pace. With one final strong thrust the giant woman blew her load inside of you, sending shockwaves of pleasure across your entire body. After you two were done you both layed down on the bed embracing each other. Mating season was a tremendous success! Not only did you find a mate but you also found a mate much stronger and healthier than you, resulting in a stronger and healthier child. But that is not why you were happy, you were happy for a whole different reason. This woman made you feel like the most precious person in the world, she made you feel like someone fragile to protect, care for and please, someone to love. you couldn't get enough of this feeling, and something tells you Siv can't get enough of it either. After a few minutes of lying together with your partner, the romantic silence was broken.\"You should stay here for a while longer, at least until the storm's over. It's not safe outside after all.\" said your lover.<br>\r\n<br>\r\nWhat do say in response?<br>\r\n<br>\r\n</span></div></div>",
            "created":1526792400,
            "id":2496101,
            "title":"Mate with her."
        },
        "1242":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "You have a slave",
                "You don't have one, but you want one",
                "You don't want one"
            ],
            "content":"<div class=\"\"><div> <span>You are Anita a 26 feet tall, 22 year old futa giantess. You have tan skin, dark hair and brown eyes. You are a little smaller and frailer than a normal giantess but thats normal for the Emberfury tribe.<br>\r\n<br>\r\nNow the real question is: Are you lucky enough to have a little slave or are you unlucky like the majority of your tribe</span></div></div>",
            "created":1528002000,
            "id":2502422,
            "title":"Emberfury"
        },
        "1243":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Iceguard",
                "Shadowbanner",
                "Another unmentioned tribe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1526446800,
            "id":2493900,
            "title":"Iceguard or Shadowbanner"
        },
        "12433":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Hell yeah!",
                "No way i want another tribe."
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cgreen\"><b>The Greenfist tribe</b></span><br>\r\n<br>\r\nThis tribe's territory is comprised out of lush forest, filled with alien looking plants that aren't found anywhere else. The natives of these lands are perhaps it's most peculiar, as they stand two heads above the other giantesses, they also have green skin and small tusk in their mouth and they posses much more muscular features and a larger cock. The other tribes have come to refer to these creatures as \"Orcs\". These orcs have adopted a \"might is right\" philosophy, in which the strongest orc woman is elected chief (the strength is proven by beating up the former chief) and any human woman that is seen as too weak is enslaved. When mating season comes orcs are the only tribe that does not seek out and penetrate smaller girls, as they see them as far too pathetic to even come near their giant cocks. They are however not above \"playing\" with these little girls. When it comes down to playing with the tiny girls the orcs don't really have any preferences, be it feet, ass, armpit or mouth. However all these games have one thing in common: the stench. Orc women have incredibly sweaty and smelly bodies and they take great pleasure in forcing inferior creatures to inhale their musky aroma. Luckily the orcs tend to mostly stay in their territory, and the other stay away from their lands unless they want to be enslaved and have their assholes remodeled.<br>\r\n<br>\r\nAre you an orc in this tribe?</span></div></div>",
            "created":1527138000,
            "id":2498281,
            "title":"the Greenfist tribe a.k.a. futa giantess orc land"
        },
        "124332":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Yeah, i just want to take it easy.",
                "NO! I need another tribe!"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"chunter\"><b>The Swamplurkers</b></span><br>\r\n<br>\r\nThe Swamplurker's lands present a huge swamp, complete with murky and shallow pools of water. The natives of these lands wear simple clothes made out of leaves and other plants native to the swamps. Personal hygiene is a completely alien concept to the Swamplurkers as they can often be found bathing and even sleeping in the mud and dirty water. The members of this tribe live a very laid back and calm life, often napping and refusing to do anything not required for their survival( besides resting and sleeping of course). Some people may call this laziness but this is simply their way of life and they wouldn't have it any other way. They mostly leave tinies alone as they seem like too much of a hassle to catch, but certain times they can get \"In the mood\" and they will track down the tiny with frightening determination and then proceed to play with it. The Swamplurkers are but a myth to the other tribes, this is because the Swamplurkers actively avoid contact with the other tribes by hiding in bushes, mud or the water. This is in order to avoid getting embroiled in the complicated politics and wars of the other tribes.<br>\r\n<br>\r\nAre you a laid back Swamplurker?</span></div></div>",
            "created":1527138000,
            "id":2498317,
            "title":"The Swamplurkers"
        },
        "1243321":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Having a mud bath, duh...",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You are Inara and you are a massive 30 foot 19 year old giantess with a massive dick to go with your sheer size (basically a futa girl) you have short brown hair and green eyes. You have a C cup breast and a plump ass. Just like any other swamplurker girl you have a special bond with all plants and animals in the swamplands. You enjoy spending time in the mud baths with the other girls and hiding from adventurous girls from other tribes who seek to disturb your relaxation. What are you doing today?</span></div></div>",
            "created":1527915600,
            "id":2502150,
            "title":"Yeah, i just want to take it easy."
        },
        "12433211":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "An invader from another tribe!",
                "Whew. It's just an alligator..."
            ],
            "content":"<div class=\"\"><div> <span> You were currently laying down in the mud having a pleasant mud bath, you were gonna stay in the mud for a while, then you were gonna go find your friend and relax together, then finally you were going to take a well deserved nap after an entire day of doing nothing. You had it all planned out, but of course something had to happen and disturb your daily routine. You felt an ever so slight vibration in the air, something was coming closer. You react quickly and accordingly, lower your entire body into the mud with just the top of your head sticking out. luckily your green hair serves as a great camouflage in the swamp, you then shift your head slowly to see that the mysterious guest was...</span></div></div>",
            "created":1527915600,
            "id":2502154,
            "title":"Having a mud bath, duh..."
        },
        "124332111":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "The Greenfist tribe",
                "Some other tribe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Crap! It was a giantess invader! But from which tribe?</span></div></span></div>",
            "created":1527915600,
            "id":2502159,
            "title":"An invader from another tribe!"
        },
        "1243321111":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Your camouflage skills are unmatched!",
                "Uh oh... you're busted!"
            ],
            "content":"<div class=\"\"><div> <span>You saw two towering figures making their way towards you. They were both built like brick walls and they were covered in war paints, they didn't wear anything and were showing off their monstrous cocks. They had green skin and small tusks protruding from their mouths, it was obvious that they were orcs from the Greenfist tribe. CRAP! you thought to yourself, what were these green brutes doing in your swamp? Luckily they haven't noticed you yet. You lay down motionlessly in the mud hoping they just pass by, when the smaller orc woman interrupted the eerie silence and said: \"Why are we even here Urga? This place gives the the creeps!\". To which the larger one replied \"Relax Klara don't tell me you can't handle a few gators!\". \"It's not the animals i'm afraid of, it's the swamp people!\" Klara replied. \"Oh god you believe in that stupid myth don't you? Look there's no such thing as swamp people, those are just legend that the elders tells us so that we don't venture too far away\". Klara then sighted in relief and said \"I'll trust you on this one Urga, but still why are we here?\". \"Well look our Warchief said that if no one is using these lands for anything we might as well take them for ourselves. So she send us both to scout ahead for anything worthwhile\" said Urga.  Klara simply nodded in agreement and they both kept on marching through the mud.<br>\r\n<br>\r\nDo you remain unseen or do the orc women notice you?</span></div></div>",
            "created":1527915600,
            "id":2502167,
            "title":"Orc invaders!"
        },
        "125":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "C Tier",
                "B Tier or A Tier",
                "S Tier or SS Tier"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<b>MACHROLANDIA</b> is a beautiful fantasy world full of magic, adventure and a plethora of differently sized races, that all for some reason consist of only futas(or dickgirls). Some species are basically walking mountains, others are so small that they are barely visible by the naked eye. The smaller races have magical powers, that can give them the edge over the sheer strength and brute force of the larger races. The different species of this world are divided into several different size tiers, here they are, from smallest to largest.<br>\r\n<br>\r\n<br>\r\n<b>Z Tier</b> - below 2 mm<br>\r\nThe Z Tier represents the smallest sentient races in existence. They rarely live longer than 1 year largely due to the fact that they are unnoticeable to all other races.They are commonly referred to as \"Nanoes\" by the people who believe they exist.<br>\r\n<br>\r\n<b>F Tier</b> - 2 mm to 2 cm<br>\r\nThese species are still very, very small, but big enough so that the other races are able to see them and maybe consider them, which is for better or worse. They are commonly referred to as \"Microes\".<br>\r\n<br>\r\n<b>E Tier</b> - 2 cm to 10 cm<br>\r\nThese are considered to be the \"average\" small races. Mostly because they're just big enough to be useful to humans. They are commonly referred to as \"Tinies\".<br>\r\n<br>\r\n<b>D Tier</b> - around 1.8 m<br>\r\nThis is where the human race belongs. Races of this size tier are considered the average. They usually posses the strongest magic powers. They have no commonly used name.<br>\r\n<br>\r\n<b>C Tier</b> - 2 m to 4 m<br>\r\nJust slightly above average, this size tier still has some magic powers, but still not as much as D Tier. Their size allows them to coexist with average size races. They are commonly referred to as \"Amazons\".<br>\r\n<br>\r\n<b>B Tier</b> - 4 m to 10 m<br>\r\nThe species belonging to B Tier and all tears above posses no magical powers. They mostly live in their own villages, but some choose to protect or rule over amazon and normal people's villages. They are commonly referred to as \"Mini-Giantesses\".<br>\r\n<br>\r\n<b>A Tier</b> - 10 m to 100 m<br>\r\nThe members of this size tier rarely form villages or communities, as they prefer to lead a nomadic and isolated lifestyle. They are commonly referred to as \"Giantesses\".<br>\r\n<br>\r\n<b>S Tier</b> - 100 m to 1 km<br>\r\nThese races are fully aware of the smaller races, and they often use their superior size and strength to enforce their will. They are commonly referred to as \"Mega-Giantesses\".<br>\r\n<br>\r\n<b>SS Tier</b> - 1 km and above<br>\r\nThese creatures are feared and avoided by all other races. They are so unbelievably massive that their mere footsteps cause catastrophic earthquakes. not only that but they are completely oblivious to all other small races, and they unknowingly end hundreds of lives each day. They are commonly referred to as \"Titans\".<br>\r\n<br>\r\nSince you chose to be a giantess you will have to choose between C, B, A, S or SS Tier<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1528520400,
            "id":2504902,
            "title":"your choice"
        },
        "1251":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "I'm an orc",
                "I'm an amazonian",
                "I'm another C tier."
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cgreen\"><b>Orc</b></span><br>\r\n<br>\r\n<b>Size</b>: 3 meters<br>\r\n<b>Apperance</b>: green, well toned futas<br>\r\n<b>Habitat</b>: in orc encampments all over the land<br>\r\n<b>Info</b>: Orcs are a brutish and savage species that takes immense amount of pleasure in dominating smaller races. Their feet produce copious amounts of sweat and foot stench, so they always reek, which is made worse by the fact that they never wash their soles and that their footwear Is passed down from generation to generation. Stomping faeries is a popular pass time among orcs, and shoving their cocks into garden nagas and watching them struggle is always fun, but for an orc there is no greater joy than to completely subjugate a human or elf and turn them into an eternal, lustful footslave.<br>\r\n<b>Powers</b>: Great strength, inability to cast spells. Although repugnant and horrid, orc foot sweat has an addictive quality to it...<br>\r\n<br>\r\nAre you this prideful, dominating orc futa?<br>\r\n<br>\r\n<b><span class=\"ctan\">Amazon</span></b><br>\r\n<b>Size</b>: 3.5 meters<br>\r\n<b>Apperance</b>: tan, musclebound, prideful and dominating futas.<br>\r\n<b>Habitat</b>: jungles and rainforests<br>\r\n<b>Info</b>: The Amazon tribes pride themselves on their unmatched beauty and strength. They see humans as inferior beings, useful only for fulfilling their desires. They have earned themselves an unfavorable reputation, since they often raid human villages and enslave the humans there, forcing them into becoming sex slaves or cock sleeves.<br>\r\n<b>Abilities</b>: Great strength and full magic control. Superior to humans in every way except in brains <br>\r\n<br>\r\nAre you a strong, dominating Amazonian?</span></div></div>",
            "created":1538345640,
            "id":2557127,
            "title":"C Tier"
        },
        "1253":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "S Tier",
                "SS Tier",
                "Another? "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The titanic S Tier (100 m to 1 km) or the even more titanic SS Tier (1 km and above)</span></div></span></div>",
            "created":1528520400,
            "id":2504958,
            "title":"S Tier or SS Tier"
        },
        "12531":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Lets go with this",
                "Another giantess"
            ],
            "content":"<div class=\"\"><div> <span><b><span class=\"cyellow\">Golden Giantess</span></b><br>\r\n<br>\r\n<b>Size:</b> 240 meters<br>\r\n<b>Appearance:</b> Giantesses with shiny, reflective Golden skin<br>\r\n<b>Habitat:</b> In secluded caves, where they hoard their treasures<br>\r\n<b>Info:</b> A legend states that many years ago the great goddess Inara created 100 golden giantesses as a way of showing off her immense power off to the mortals. While most scholars would disagree with this legend, what they can't deny is that several giantesses made out of solid gold do exist, and that they regularly kidnap smaller beings. They kidnap these smaller beings in order to sate their lust for power, as supposedly being created by a goddess has seriously inflated their ego. The kidnapped humans and lesser giantesses are then forced to regularly polish and worship their golden overlords until they expire, at which point the Golden giantess has to find new servants.<br>\r\n<b>Powers:</b> Like all giants they cannot cast spells. They do however, have the strange ability to enforce their will on lesser beings, that power is often described as an aura of submissiveness, that \"saps the will to resist\". Also their golden skin is nigh impenetrable.<br>\r\n<br>\r\nAre you this powerful, golden being.<br>\r\n</span></div></div>",
            "created":1528520400,
            "id":2504968,
            "title":"The Glorious Golden Giantess"
        },
        "125311":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "Defending your treasure from human adventurers",
                "Doing something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you doing currently?</span></div></span></div>",
            "created":1528606800,
            "id":2505159,
            "title":"Lets go with this"
        },
        "125312":{
            "author_id":"eggzsupreme1",
            "author_name":"EggzSupreme",
            "choices":[
                "I'm an Obsidian Giantess",
                "Another giantess"
            ],
            "content":"<div class=\"\"><div> <span><b><span class=\"clgrey\">Obsidian Giantess</span></b><br>\r\n<br>\r\n<b>Size: 600 Meters to 800 Metres</b> <br>\r\n<b>Appearance:</b> Colossal, Gray, Futa Giantesses.<br>\r\n<b>Habitat:</b> Mountains, Caves, Canyons, anywhere that has plenty of rocks/stones and is far away from civilization.<br>\r\n<b>Info:</b>Obsidian Giantesses are one of the largest land races on Machrolandia Many call them \"walking-mountains.\" Despite being titanic in size they're extremely docile and shy and try to avoid civilization as much as possible for fear of hurting anyone. They aren't carnivorous and only diet off of rocks. In general really don't pose a threat to anyone, except during mating season. The smaller races refer to the Obsidian Giantess mating season as the Earthquake season. Even though they live far away from civilization, their size combined with their intense intercourse, causes great tremors in the neighboring kingdoms. NEVER insult and Obsidian Giantess, when you push these gentle giants too far they won't hesitate to remind you who the bigger is. Other than that they're down to earth and don't want to have to deal with the drama of civilization and predator VS prey. They'd rather chill on their mountain tops, snack on some rocks, and enjoy the view.<br>\r\n<b>Powers:</b> They have tough grey skin and are highly resilient to pain. They all are naturally strong, even for their size.<br>\r\n</span></div></div>",
            "created":1528743780,
            "id":2505842,
            "title":"Colossal Obsidian Giantess"
        }
    },
    "info":{
        "author_id":"alotofstuff",
        "author_name":"Shrinking Fandom Writer",
        "brief_description":"Petite frail futas share worlds with giant muscular dominant futas",
        "created":1476054060,
        "description":"<td align=\"left\" class=\"norm\">In this world, small almost human sized girls have to live in constant fear of giant girls 3 times there size and girls on this planet have penises. the small people are way smarter than giantesses but they are way more small and weak against giantesses. giants often use there shear size to humiliate, torture, rape, and kill smaller girls. small girls are very durable and can take alot before dying.<br>\r\n<br>\r\n     Small girls (being smarter) wear hide clothing to cover themselves, while giants wear nothing at all, being way to big to wear clothing. Ounce a year, tons of giants go into mating season and have to find a mate (all girls on this planet have penises and vaginas) and the way giants show their dominance is to find the smallest inferior girl (non-giantess) and wear them as a cock co-bob. small girls digestive systems are way more allieghnt that giants so they can slide there dicks into a tiny girls ass and it would come out on the other end out her mouth so they would look as if they were being impaled by a giant dick. Giants keep these tiny helpless girls like that for about a week, force feeding them endless amounts of semen to stay just alive, and when 2 giants finally find each other they fuck with the tiny girl still attached, ounce done, the giant will simply pull the tiny girl off her dick and let them be on there way but not without leaving a massive gaping hole where the dick entered to remind them that they were used as sex toys.<br>\r\n<br>\r\n     APPERENCE...<br>\r\n    Petite Female: maximum 3 feet tall, weak, wear close to nothing , is inferior race, smart, commonly used as cock decorations for giantesses looking to mate, fast, no hair except on head, they are also sort of stretchy (for you know what)<br>\r\n   Giantess:maximum 20 feet, thicc, huge, muscles, no clothing, dominant race, slow, dumb, very horny, sex hungry, uses tinies for fun, no body hair, only on head<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":2098985,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1577431740,
        "modified":1577431740,
        "pretty_title":"Futa World"
    }
}