{
    "chapters":{
        "1":{
            "author_id":"masonaut",
            "author_name":"masonaut",
            "choices":[
                "Moxy's friend finally shows up...",
                "Moxy has a free period straight afterwards...",
                "Moxy feels a little strange, but shrugs it off as nothing...",
                "Moxy notices her dress suddenly becoming a tiny bit tighter...",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>A door opens. A dull clopping sound fills the empty expanse of a room as a pair feet clad in black Doc Martens stroll in. A chair is pulled out. A bag is dumped onto the floor. Moxy squats and sits in the chair, relishing the plush feel of her prized black dress as she drapes it over her knees. She'd always wondered if the combo of the shoes and the dress really worked, but kept them anyway. Reaching into a pocket, she pulled out a bottle smaller than her hands. \"Instant 6-Hour Energy\", it said on the red and orange label. She had never been a morning person, so this should be just the thing to get her through a day of college. Swiftly unscrewing the cap, Moxy threw her head back and downed the slightly viscous liquid in one mouthful. Not the most pleasant tasting drink in the world, she noted as she threw the bottle across the room into a bin.<br>\r\n<br>\r\nThe door opens again, and Moxy straightens up. Not sure if it was from the boost of energy or the fact that the person walking in was a classmate she despised, she slumps back down again. Glancing at her timetable, she scowls as she realises she has two lessons with the classmate in question during the day. Her red lips curl into a faint smile as she daydreams. <i>I would make that guy wish he was never born,</i> Moxy thought to herself, <i>if only I wouldn't get in trouble for it.</i><br>\r\n<br>\r\nShocking her out of the depths of thought, the door swings open yet again. <i>How was I so early?</i> Moxy ponders, noting that the next arrival is also someone she can't stand. <i>I wonder why I hate so many people,</i> she thought. Peering through the window down the hallway, she could not see anyone she particularly liked approaching the classroom. Her gaze found its way back to her shoes as she wriggled her toes absent-mindedly, thinking about her thick boots and how she might be able to use them.<br>\r\n<br>\r\nThe arrival of the teacher snapped Moxy out of her daydreams once again. Looking around, she realised there were still none of her friends in the room. Perhaps they were ill... or maybe late. <i>No, they're never late.</i> Moxy snaps her pencil in half. <i>Looks like I'm getting through this day alone. That's okay, I'm used to being alone.</i> With a smug grin, Moxy grabbed one of the pencil fragments and throws it in a perfect arc across the room. It hits one of her enemies directly on the back of the head as planned, and she silently cheers. <i>Maybe I could make this day fun after all...</i></span></div></div>",
            "created":1322715600,
            "id":1232738,
            "title":"Meet Moxy"
        },
        "11":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Jane",
                "Rachelle",
                "Brandy",
                "Becky",
                "Mika"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it?</span></div></span></div>",
            "created":1516821600,
            "id":2444513,
            "title":"Moxy's friend finally shows up..."
        },
        "13":{
            "author_id":"masonaut",
            "author_name":"masonaut",
            "choices":[
                "Moxy notices an odd tingling in her muscles...",
                "Moxy suddenly becomes very dizzy and collapses...",
                "Somebody throws a paper plane at the back of Moxy's head...",
                "Moxy enters her class as normal...",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Moxy Atropos.\"<br>\r\n\"Yes, miss,\" Moxy answers with her satin-smooth voice. <i>Damn, I feel strange.</i> She rose from her seat groggily, still recovering from the clutches of early morning fatigue. The teacher dismisses the class with a passively uninterested voice, and Moxy picks her bag back up from the floor. It was quite a sight slung over her shoulder: a pale cream oval made of soft fabric with two large, black buttons that resemble eyes. There were long strands of wool coming from the top and draping over the sides like hair, and a zip where the mouth would be. Moxy opens the mouth of the disturbed looking face and stuffs a few books inside, sealing it tightly shut once again. <i>History first... great. I hate history.</i><br>\r\n<br>\r\nMoxy strolls down the drab corridor leading to her next class, barely reacting to a violent clap of thunder resonating outside. It had been stormy all week. Growling a little at the miserable weather, she readjusts her dress a little. It was usually quite loose and casual, but today it felt more... snug. <i>Jeez, I feel a little dizzy. Must be that energy drink.</i> With a grimace, Moxy brushes aside her long dark fringe and wipes a few beads of sweat from her forehead. <i>Argh, it'll pass. It always does.</i> Noticing her sleeves have somehow crept slightly up her arm, Moxy tugs them back down again impatiently. <i>Perhaps I'm growing out of this dress, I've had it for about two years now</i>...</span></div></div>",
            "created":1324357200,
            "id":1243369,
            "title":"Annoyance"
        },
        "132":{
            "author_id":"masonaut",
            "author_name":"masonaut",
            "choices":[
                "Moxy collapses again on the way home...",
                "Moxy stops in her favourite shop to buy some new, bigger shoes...",
                "Moxy decides to pay a quick visit to the doctor, still feeling unwell..."
            ],
            "content":"<div class=\"\"><div> <span>A sudden wave of light-headedness and blurred vision hitting her, Moxy stumbles a little and ducks into a nearby bathroom. Leaning tiredly on the sink for support, she looks into the huge mirror covering most of the wall. <i>Damn, Moxy, you look terrible.</i> She notices her skin is considerably paler than its usual pallid tone, and parts of her fringe are clinging to her warm forehead in moist strands. Moxy decides she can't walk around the company of others presented like this, so she forces herself up from the sink and, with a little effort, half walks-half falls into the nearest toilet cubicle. An onslaught of dizziness had begun to drown Moxy by this point, pushing her conscious thought deep inside her unconscious mind. Mostly through instinct, she groggily pulls the cubicle door to a close and slumps as she loses consciousness...<br>\r\n<br>\r\n-about 5 hours later-<br>\r\n<br>\r\nA conscious pair of eyes slowly open, thoughts no longer clouded by the fog of dizziness. Rubbing her aching head, Moxy realises she's still sitting on the toilet in the same cubicle. She feels her body temperature rise several degrees as she realises that by the different shadows, she must've been out cold for hours. Quickly getting to her feet, Moxy notices a distinct tightness in her chest. She pulls on her dress a little to loosen it, and wiggles her shoes a little as she notices a similar feeling in her feet. <i>I really hope I'm not growing out of these Doc Martens, I love them so much.</i> Moxy decides she still doesn't feel entirely great, so she bends over to retrieve her bag from the floor, only to notice how considerably lighter it seems. A quick investigation reveals that everything is still in the bag's pockets, so Moxy swings the bag around for a bit to make sure she isn't imagining things. <i>Nope, it's definitely lighter. Very odd.</i> <br>\r\nIgnoring this unexplained anomaly, Moxy slings the bag haphazardly over her shoulder and steps out of the cubicle. It's not a lot darker, so it can't quite be evening yet. Not liking the idea of wearing the embodiment of time on her wrist, Moxy had always told the time by checking the position of the Sun in the sky or the lengths of shadows. If her eyes didn't deceive her, it's some time between 3PM and 4PM. College closes at 3:30, so with that in mind, Moxy tiredly heads towards the college gates.<br>\r\n<br>\r\n</span></div></div>",
            "created":1327986000,
            "id":1269026,
            "title":"Tiredness"
        },
        "1322":{
            "author_id":"masonaut",
            "author_name":"masonaut",
            "choices":[
                "Moxy gets home just fine...",
                "Moxy is confused by the way that everything looks a bit smaller...",
                "Moxy runs into someone she hates..."
            ],
            "content":"<div class=\"\"><div> <span>The late afternoon air is crisp and cool as Moxy strides out of her college, and the sky is a clear shade of azure with not a cloud to be seen. Enjoying the sudden change in weather and approaching nightfall, she inhales a lungful of the fresh breeze and feels distinctly invigorated by it. Almost... strengthened. <i>Everything seems different today,</i> Moxy thinks to herself. <i>It's almost as if that short nap in the toilet cubicle made me feel better.</i> Tugging her long dark sleeve back down her milky white arm, Moxy realises she's already reached her destination: The Boot Shop. The walk from college to here is usually about 10 minutes but Moxy could've sworn the journey length was at least 3 minutes shorter.<br>\r\n<br>\r\nDucking slightly to avoid hitting her head on the bizarrely low doorway, Moxy grins as the sudden aroma of leather tickles her nose upon entry. She follows her nose and heads straight for the shelf of women's Doc Martens. Judging by the tightness of her current boots, Moxy estimates she is about a size larger since she last bought a pair. Checking the bottom of her beloved boots, she notices she was a modest size UK 6, so she scans the shelf for a moment and grabs a size 7.<br>\r\n<i>Damn, when did these boots get so tight?</i> Moxy wonders as she forcefully tugs the shoe from her foot, taking considerable effort to remove. To her surprise, her striped socks now had 5 holes in them, with a toe protruding from each one. <i>What the fuck? The material is all strained too... how did I manage to ruin these?</i> Moxy wriggles her toes in annoyance, and decides to ignore this for now. Purring as she feels the coarse material of the new boots from the shelf, Moxy attempts to pull the boot over foot but to no avail. <i>Damn, I must've grown more than a size.</i> Smiling as she looks along the shelf, Moxy notices the largest pair of boots is a UK size 9. She half-jokingly chooses these and attempts to pull them over her feet in a similar manner. <i>Holy shit, even these are too small.</i><br>\r\n<br>\r\nVexed, Moxy rises from the stool in her torn sock clad feet and approaches the front desk. \"Excuse me,\" she says with mock politeness, \"but it appears that your largest size of women's Doc Martens are too small for my feet. Would you happen to have any larger ones in the stock room?\"<br>\r\nThe somewhat short store attendant turns around to address Moxy. \"We...\" he begins but trails off for a second, his eyes widening slightly as he looks up at her.<br>\r\n\"Ahem,\" he coughs, \"I'm afraid we don't, but we do have some flats in lar-\"<br>\r\n\"I don't want flats,\" Moxy replies firmly, \"I want boots. Don't tell me you don't sell them in any sizes larger than 9.\"<br>\r\n\"L-like I said,\" the clerk replies a little shakily, \"unfortunately we don't. It's unusual for women to have feet bigger than-\"<br>\r\n\"Well, evidently, I do,\" Moxy replies in a voice oozing with hostility. She bends over slightly to make herself at eye level with the man. \"Listen to me. What you're going to do is find me a pair of black Doc Martens in my size. I will then purchase them and leave. Do we understand each other?\" she explains menacingly, grabbing the man by the tie and tightening it until his face turns red.<br>\r\n\"Y-y-yes, ma'am,\" he stammers, slithering out of her tight grip and hurrying into the back room. Moxy scowled at him as he left. <i>Fucking incompetent store workers,</i> she fumes. <i>No way in hell am I walking home in a pair of half-destroyed socks.</i><br>\r\n<br>\r\nThe small red-faced man re-appears from the back of the shop with a pair of even larger boots in his hand. \"Ma'am, we didn't have any larger women's boots,\" he tells Moxy nervously, enduring her furious glare, \"...however we do have a size 10 pair of men's boots. The only real difference is the shape of the insole.\"<br>\r\nMoxy snatches the boots from the man and returns to the stool she was perched on before. Undoing the laces, she finds her feet slip into the boots just fine. With a content smile, she puts them both on and approaches the till once again.<br>\r\n\"Thank you, these are fine,\" she smiles sarcastically. \"Now, how much will that be?\"<br>\r\n\"S-seventy pounds, ma'am.\"<br>\r\nMoxy pulls out her debit card from her purse and inserts it into the machine before her. Moments later, the purchase is complete.<br>\r\n\"See? You just saved yourself a <b>lot</b> of trouble by simply co-operating,\" Moxy tells the man patronisingly. Extending her arm, she ruffles the hair of the clerk forcefully and chuckles as he dwindles in size even more. <i>Look at him, crouching away from me,</i> she smiles to herself. <i>He looks so pathetic and feeble.</i> She wriggles her toes in her new shoes, enjoying the feeling of belittling other people like always.<br>\r\n<br>\r\nSuddenly, for a fleeting moment, as Moxy stops ruffling the clerk's hair childishly, a scene flashes across her eyes. In her mind, she tenses her arm fully and propels her fist at the man's face, instantly knocking him unconscious. She giggles as his limp body crumples under its own weight, causing him to smack his head against the counter on the way down, and proceeds to spit on his face.<br>\r\nMoxy is brought abruptly back to reality. The man looks confused and freaked out. Unsettled, Moxy promptly leaves the store without uttering another word. The daydream was so realistic, and... <i>Damn, it felt good.</i> Gathering her thoughts, Moxy begins the walk home...<br>\r\n</span></div></div>",
            "created":1332133200,
            "id":1297959,
            "title":"Strength"
        },
        "13222":{
            "author_id":"masonaut",
            "author_name":"masonaut",
            "choices":[
                "She's grown half a foot, and stands at 6'4...",
                "She is shocked to see that she has grown over a foot to a height of 7 feet..."
            ],
            "content":"<div class=\"\"><div> <span>On her way out of the cleverly named <i>The Boot Shop</i>, Moxy reminds herself to duck the annoyingly low doorway. To her surprise, she still somehow manages to smack the top of her head against it. <i>Damn it! I don't think I've ever seen a lower doorway!</i> she grumbles to herself, fixing her slightly ruffled hair. <br>\r\n<i>What's with the smallness of everything today, anyway?</i> she pondered as she strode down the street in her new shoes. Indeed, the average height of the people around her seemed a bit lower. Moxy was on the tall side for a girl of 17. She had a growth spurt to about 5 feet and 10 inches tall at the age of 13, and was always quite athletically built. This led to her being isolated by her peers since the beginning of teenagerhood because many of them were intimidated by her. But even so, Moxy would quite often see other people, almost exclusively males, walk past her who were taller. Yet today, the amount of taller men passing her in the street seemed close to zero. <i>Maybe... I've had another growth spurt? Girls can have two growth spurts during puberty, right?</i> Moxy sighed to herself. <i>At this rate I'm going to end up like the giantess from The Attack of the 50-Foot Woman</i>, she chuckled jokingly.<br>\r\n<br>\r\nTaking a left turn at the end of the street, Moxy was surprised to see she was already home. <i>That's odd...</i> she mused, taking out her MP3 player from one of her pockets. <i>I made this playlist so that I've finished it by the time I've walked home. But there are still two songs left on it... maybe I was walking a bit faster because that Boot Shop clerk pissed me off.</i><br>\r\nMoxy approached her front door and pushed it open, noting that there must be someone home since it was left unlocked. Her 10 year old sister happened to be running through the hallway as she slammed the door behind her.<br>\r\n\"Hey Moxy!\" she beamed, barely slowing down as she sped past with one of her friends. \"I like your new high heeled boots!\"<br>\r\n\"Thanks...\" Moxy replied blankly, glancing at her new boots. \"Wait a second, these aren't high heeled...\" she muttered to herself. \"Weird.\"<br>\r\nShe watched her sister thump up the stairs as she kicked her boots off, grunting at the holes in her socks. <i>Of course, my favourite striped thigh-highs have to be the ones that get fucking ruined.</i><br>\r\n<br>\r\n\"MUUM!\" she shouted, wriggling her toes through the holes in her socks.<br>\r\nNo response followed, however an idea popped into Moxy's head.<br>\r\n\"DAAAD!\" she shouted again, with increasing impatience.<br>\r\n\"What is it? I'm kinda busy,\" the faint response came. Judging by the distant sounding voice, he must be in the garden. Moxy headed for the back door, noticing her footsteps sounded a little louder than usual. As expected, her father was indeed outside, hectically putting some of his power tools into the shed due to the overhead clouds looking ready to burst. He was an avid builder, although you wouldn't be able to tell by looking at him. He was quite a small, lean, but kindly looking guy of 46. Moxy had outgrown him by about three inches when she had her growth spurt, much to his repeated embarrassment. Even his wife was an inch or two taller than him despite being three years younger, so Moxy figured that's where the tall gene in her came from.<br>\r\n<br>\r\n\"Dad, can I borrow a tape measure or something? One of those retractable ones?\" Moxy asked him as he hurried into the shed with an armful of drill bits.<br>\r\n\"Sure, I guess,\" he replied hastily, rummaging through a crate and fetching the requested item. \"What's it for?\" he enquired curiously, throwing it to Moxy.<br>\r\n\"U-uh, just a class project,\" she replied nervously. \"Thanks.\" With that, she went back into the house and quickly went upstairs. Her sister had already noticed her height change, who knows how her height sensitive father may react if he actually looked away from his tools at his daughter for a moment?<br>\r\nClosing her bedroom door and locking it to ensure privacy, Moxy took out the tape measure. <i>Right then, last time I measured myself I was about 5'10.</i> She re-adjusted her tight dress and pulled the metal hook from the end of the tape measure, securing it against the floor under her exposed big toe. Standing up as straight as possible, she pulled out the tape measure to the very top of her head and clicked the button on it to lock it. It was like habit for her, having measured her height so many times before, almost out of denial.<br>\r\n<br>\r\n<i>Okay, that should be a good enough reading,</i> Moxy mumbled curiously. She lowered the tape measure to her eye level...</span></div></div>",
            "created":1342155600,
            "id":1377911,
            "title":"Confusion"
        },
        "132221":{
            "author_id":"rian02",
            "author_name":"Rian",
            "choices":[
                "but she had already noticed her new height.",
                "and after it traded hands, she quickly closed her door behind her."
            ],
            "content":"<div class=\"\"><div> <span>Moxy checks the number on the tape, and stares at it, confused. <i>6'3\", Now that can't be right.</i> she unclicks the tape measure, allowing it to fully retract before putting it under her toe, bringing it up, and locking it again. She sighs, unlocks it, adjusts the height so it's as perfect as possible, and relocks the tape. she brings the numbers into her vision. <i>Oh. Of course it was wrong. 6'4\". I'm one hundred and fucking ninety three unforgiving centimeters. As if I wasn't tall enough as it was.</i> she gives off a deep sigh. <i>As if people didn't think I was a freak before. This can't be natural. There's no way someone just grows six inches in a few hours.</i><br>\r\n<br>\r\nMoxy mused on her day for a second, going through the long, tiring morning, waking up, shitty breakfast, groggily walking to school in a drizzle. The asshole that threw an empty cup of coffee at her. Then it hit her. <i>That energy drink. It made me pass out. After I woke up is when I got huge. Oh god, I'm going to beat that companies entire workforce so hard that when I'm done with them, they'll wish I sued them for every penny.</i> She pounded her fist on her desk, which caused everything on it to noticeably shake. She couldn't help but grin, clenching her fist, she felt overwhelming strength that it contained. <i>Then again</i> she grinned, <i>Maybe there is some good that can come from this mess.</i> Just then there was a banging at her door.<br>\r\n\"SIS!\" a voice yelled from the other side of her door. \"Dad wants his tape back!\"<br>\r\n<br>\r\n<i>Maggie.</i> she moaned in her own skull <i>Why does it have to be her.</i><br>\r\n<br>\r\nMoxy wasn't a huge fan of many people, but if there was anyone in the world that she wouldn't kill, it would be her younger sister Maggie. She shared Moxy's brown eyes and blonde hair (which Moxy dyed), but lacked her view on life. 'inexperience' Moxy liked to think of it. While Moxy would prefer everyone dead, Maggie couldn't stand living in a world where there were people that she didn't know. She literally tried to become friends with everyone. It would make Moxy sick if she didn't admire her perseverance. Maybe it because Moxy couldn't cope with not having her way that... <i>No. No time for this now.</i> Moxy thinks quickly <i>I'll just quickly open the door, hand her the tape, and close it again. Standard.</i><br>\r\n<br>\r\nMoxy quickly opens the door. Staring down on her now shorter sister and her much shorter friend. Maggie was about 5'6\", certainly tall for a ten year old, and she showed no signs of stopping. She would even joke about straightening Moxy out when she finally outgrew her. <i>doesn't seem so likely anymore...</i> she sighed. Suddenly, Moxy realized how much time she was wasting. She went to hand Maggie the tape measure....<br>\r\n</span></div></div>",
            "created":1347339600,
            "id":1425076,
            "title":"Lofty"
        },
        "1322212":{
            "choices":[
                "Moxy then wakes up, much taller",
                "Moxy wakes up slightly taller, but also with something more"
            ],
            "content":"<div class=\"\"><div> <span>Maggie was rather quick about getting the tape. Simply grabbing the tape in a most rude manner, she quickly dashed off to their fellow father. As per plan, Moxy silently closed the door again, feeling somewhat disappointed over her sister's ignorance. She could've at least say hello to Moxy, with it getting late and all, and having not seen her all day. Nonetheless the fact that no one gave her new stature the attention she wanted it to get, a stream of thoughts came to her. Would it be too daft to just say \"Hello world, I grew half a foot in a few hours\" or should she reveal it a bit more stealthily? That, and Moxy was beginning to feel tired again, despite the excitement the reveal of her new height had given her.<br>\r\n<br>\r\nIn order to uphold the secrecy she had decided to keep on her new size, Moxy pretended to have one of those \"Goths-are-introvert-in-their-room\"-days. Her parents had been used to such, ever since she had begun with the dark make-up, at age 14. So they brought her food, which Moxy would take in by the door, not showing herself. Then they´d go downstairs to watch some program about dysfunctional families with their daughter, and go to bed without a worry of their child, knowing that it was normal behavior for her. <br>\r\n<br>\r\nAs for Moxy, she spent the day, searching the worldwide web for what might´ve caused her sudden spurt, which of course were absolutely impossible to find. She was also searching for a set of clothes, as she had outgrown her current ones. Much to her annoyance, the only ones who didn't made her look like she was going to a whore-rally were some old vacation-clothes which she´d hate to wear in public. <i>God dammit, this is way too out of my style</i> Moxy mumbled to herself, as she stared with disappointed eyes at the largely oversized yellowy-brown T-shirt. It had large Spanish letters, spelling <b>Vez El Mundo</b>, as well as a picture showing a skeletal face drawn abstractly, looking away from the shirt, through large binoculars. <i>Well, at least it has a skeleton</i> she said to herself, grumpily. She tried it on, along with a pair of oversized jeans, that she'd dug up from the depths of her drawer, most likely a Christmas present that she was supposed to return, but never did. Though neither light-brown, nor light blue was her colour (and most certainly didn’t fit with her pitch-dark hair) it would have to do. It was payday soon anyways. <i>Guess I can afford to make up for todays spectacle, since I'll be paid soon, anyways</i> Moxy thought to herself. <br>\r\n<br>\r\nSuddenly noticing how fast time had passed (it was almost past 11pm) and though that wasn't THAT late, being reminded of the time returned her extraordinary exhaustion. She quickly got undressed and threw herself into bed. <br>\r\nAs Moxy slowly let her mind drift into sleep, images of her walking past her peers at school, as the tallest one in the hallway, filled her head. She fell asleep with a unusually exciting feeling in mind, and a small smile on her lips.<br>\r\n</span></div></div>",
            "created":1360603440,
            "id":1529897,
            "title":"5 new inches for herself"
        },
        "13222122":{
            "choices":[
                "Moxy´s family isn't home",
                "Moxy runs into a family member on her way down"
            ],
            "content":"<div class=\"\"><div> <span>While the night went relatively normal, the next morning bore yet another surprise to Moxy. It was a Saturday morning, and normally Moxy would be in a deep coma-like state of slumber, until at least 11am. Yet today she continued to wake up for short period feeling small stings of pain in her body. Every time she would shrug it off as a minor annoyance, and fall asleep again, only to have this repeat as a cycle every 40 minutes or so. Finally giving up sleeping the day away, Moxy got up from her bed. As she got up, she began to stretch her body, which resulted in the pain returning, much heavier than before. Moaning in pain, Moxy took a look on herself, to find the sinner for the pain. <br>\r\n<br>\r\nAt first she was slightly surprised to see herself that tall once again, but her attention quickly went to the pain problem. It was her underwear. Normally underwear wasn't a problem for Moxy, but today it was. They were too small. Her bra and panties were digging into her skin like a strangling snake. <i>What the hell?! My underwear wasn't this small yesterday?!</i> she aggressively said out loud. Before she could solve a problem, the spring on her bra snapped, forcing it to fall down on the ground. She looked at the fallen bra, with a shock in her eyes. Moxy sighed. <i>Oh well, if that can go, why not go all the way?</i> she said, and took off her underwear, standing now completely naked in her room. She then walked to the mirror, only to be further surprised. Moxy had overnight changed even more. Yesterday she had, past her growth spurt, been standing almost as tall as her 7 feet mirror, yet still more than half a feet below it. Yet today she was clearly above that, almost reaching the end of the mirror. She had to be at least 2 or 3 inches taller than yesterday. But that was not all. Along with her increased height, her body had changed as well. <br>\r\n<br>\r\nMoxy had always been very slim. A very natural body for her age. Yet now, as she stood naked and admired her own naked body, she seemed more fit than ever. And not only that. The problem with her underwear, had been that her breasts had grown at least a chest size, if not more, where her ass now seemed tighter and rounder. She took a feel at her breasts, easily measuring them to be a large c-cup, over her former somewhat small b-cup. An amazing development for a little more than 10 hours of sleep. But as she stood and felt her breast, something else caught Moxy's eyes. <br>\r\n<br>\r\nHer arms. They seemed bigger than usual. Not by much, though. Moxy made a quick flex with her biceps, and it was as she suspected. Her former arms were thin, not showing clear signs of naturally large muscles. She felt her new arms, and found that they felt almost like rocks. She then began to study the rest of her body, where she found more and more evidence on increased physique. Her legs, her back, her neck. Heck, even her stomach showed some signs of abs. While none of these improvements were very small, neither did she look like a bodybuilder. It was more as if her entire physique had changed to a more muscular one, rather than her slim and feminine former one. Taking this, and her last growth spurt of almost a feet, she looked like...  an amazon. <i>This is weird. No one is supposed to get this big,</i> she mumbled to herself, before she stopped. Taking a few daring flexes more, now with her legs and back as well, she stared at her own reflection with a shock in her eyes. But as she admired herself, she slowly began to get a liking of herself, as she stood here, naked and fit as hell. <i>Hmm. Maybe I COULD get used to this</i> she said to herself, while slowly forming a smile. Well, it wasn't like she had a choice, was it?<br>\r\n<br>\r\nQuickly trying out the new physique, with the set of clothes she had found last night, she found that they had a very natural fit on her now. Then she felt a rumble in her stomach. <i>Well, I guess hunger is very natural with all this growth.</i> She took a few steps to the door of her room, and took a slight breath before she'd go and show the big new her to her family.</span></div></div>",
            "created":1360615680,
            "id":1529996,
            "title":"Amazon"
        },
        "132221221":{
            "author_id":"masonaut",
            "author_name":"masonaut",
            "choices":[
                "Forgets them for now, it's time to go out and show her new self to the world...",
                "Drinks one now, and puts a few more in her bag just in case..."
            ],
            "content":"<div class=\"\"><div> <span>Moxy looked down the hallway as she opened her bedroom door, slightly disappointed to see that no-one was there. <i>Oh well, they must be downstairs,</i> she thought to herself. Stepping into the hallway, Moxy noticed the pleasant feeling of the plush carpet under her bare feet. <i>Usually I wear socks, gues I'll have to go barefoot more often,</i> she decided, slowly descending the stairs. The quietness in the house was a little unusual. In fact, Moxy couldn't hear anyone at all. Nevertheless, Moxy puffed her chest out a little in pride and strode confidently into the front room.<br>\r\n\"Good morning, everyo-\" she began, cutting her speech short when she realised the front room was completely empty. \"The hell is this?\" she grunted, turning around and checking the kitchen. To her annoyance, the kitchen was also completely devoid of life. However, there was a note on the fridge titled \"ROXANNE\" in her father's recognisable scrawly handwriting. Noticing this, Moxy stormed over and tore the note from the fridge with a frown that could burn a hole in the paper. <i>I fucking hate it when they call me that,</i> she fumed. Moxy's birth name was actually Roxanne, which was shortened to Roxy as a child. However there was one kid in her primary school class who had speech problems and couldn't pronounce her name properly, and so called her Moxy. She liked the sound of it, though, so it stuck. Moxy simply despised her original, full name, yet her parents usually still called her by it, or by Roxy.<br>\r\n<br>\r\n\"We've gone out shopping, and since we know you hate shopping, we let you sleep in. However, please do either the laundry or the washing up by the time we're back at about 3pm. If you go out, please lock the house up and take your key. Thanks, Dad.\", Moxy read aloud.<br>\r\n\"God-fucking-damnit!\" she yelled, kicking the fridge in frustration. Something inside it made a loud smashing sound, but she didn't care. \"I got an awesome growth spurt and a hot new body overnight and my family isn't even here to be jealous of me!\" Moxy strode into the front room and collapsed onto the sofa. \"And I'm stuck with these shitty clothes that don't suit me at all!\" she shouted, continuing her rant to no-one in particular. Standing up, she walked aimlessly over to the fish tank and crouched in front of it, watching the goldfish swim dumbly back and forth. \"The hell did I do to deserve this?\" she pondered, slightly calmed down by the fish. \"I guess I should feed you guys,\" she sighed, taking a bit of fish food from the nearby pot and sprinkling it into the top of the tank. As she watched the fish start eating, her stomach growled violently, reverberating through the room.<br>\r\n<br>\r\n<i>Oh yeah, I'd better eat too,</i> she thought, standing up and walking back into the cold-floored kitchen. Opening the fridge, Moxy noticed a smashed glass bottle of milk all over the bottom shelf. <i>Haha, that's what that noise was,</i> Moxy chuckled. <i>I guess my legs must have quite a bit of strength in them now.</i> Looking for something quick to eat, something at the back of the fridge caught Moxy's eye. Something distinctly coloured. Something small, with a red and orange label. \"Instant 6-Hour Energy\", it read. Suddenly, Moxy remembered drinking one of these yesterday, and passing out soon afterwards. Since then, she'd gained 9 or so inches in height, gotten noticeably more curvy and toned up in all the important areas without even trying. At first, she had thought this to be an annoyance due to her inability to fit into her clothing and the destruction of her favourite striped thigh-high socks, however upon seeing her new body this morning, she thought it might not be so bad after all.<br>\r\n<br>\r\nAnd there were still at least 10 of those energy drink bottles at the back of the fridge. Sitting there in their tacky red and orange labels. So tempting. <i>I could give in and drink another one now, but then it'd be even harder to find something to wear. Or I could buy some things to wear and drink one later...</i><br>\r\nPondering what she should do, Moxy...</span></div></div>",
            "created":1360624260,
            "id":1530131,
            "title":"Deadly Sin #2"
        },
        "1322212211":{
            "author_id":"masonaut",
            "author_name":"masonaut",
            "choices":[
                "Moxy finds a dress, but due to her height, it only just covers her butt...",
                "Moxy can't find a dress that fits, and is angry..."
            ],
            "content":"<div class=\"\"><div> <span>\"Ahh, fuck it,\" Moxy decided out loud. \"I don't really feel like fainting again right now, and who knows, I could still be growing from the last bottle.\" With this in mind, Moxy shut the fridge door, slightly startled at how it slammed loudly and rattled the whole fridge. <i>I'm definitely enjoying this new strength, though. I feel like I should be showing myself off.</i><br>\r\nTurning on her heels, Moxy ducked under the kitchen doorway and walked out into the hall, her bare feet slapping loudly against the linoleum floor. Her large new boots were in the same place as she left them yesterday after returning from college. <i>I sure hope an extra two or three inches in height hasn't affected my shoe size too much,</i> she ponders as she pulls the thick boots over her bare feet. To her delight, they fit well enough, if not a little more snugly than the day before. She wriggled her toes in satisfaction, although slightly displeased that she had no socks to wear with them.<br>\r\n<br>\r\n\"Damnit,\" she grumbled, looking in the hallway's tall mirror. \"They don't go at all with these weird jeans or this horrible shirt.\" She looked at the slightly gaudy orange shirt from her Spanish vacation several years ago. It was the smallest size the souvenir shop had, and it was still way too big for her at the time. But now, it hugged her figure quite satisfactorily, showing off her full breasts and feminine figure enough to catch the eye of any male whilst still leaving a lot to the imagination.<br>\r\n<i>Even so... I think I'll go shopping for some clothes more in my style,</i> Moxy decided. Grabbing her keys from a table by the landing, Moxy left the house, locking the front door behind her and enjoying the satisfying clomping sound made by her heavy boots.<br>\r\n<br>\r\nMoxy was instantly shocked by the new perspective as she stepped out of the house. Even though she'd only gained about three inches since yesterday (with an extra inch or so from the thick soles of her boots), everything seemed so much smaller. However, she wasn't scared or unsettled by it. In fact, she could not stop smiling to herself, despite the puddles of rainwater everywhere and almost black clouds overhead. To her slight disappointment, however, there were not many others around due to the foul weather. \"And I was hoping to see the faces of all the little midgets passing by,\" she chuckled to herself. Pulling her MP3 player from her pocket and pushing her earbuds into her ears, Moxy headed for the town centre.<br>\r\n<br>\r\n<i>Heh heh heh... this is just brilliant,</i> Moxy snickered, now in the town centre after a considerably shorter walk than usual. Despite the weather, there were quite a few people around. And they could not stop looking at the gigantic goth in the orange shirt. Young and old people alike would stare at her in amazement, admiration, curiosity, or even fear. The usually cocky gangs of guys in their mid-teens hanging around McDonalds didn't loudly mock Moxy for her gothic looks as she passed by. Instead, they looked on in bewilderment and kept silent. Moxy was simply loving the attention, despite being less than satisfied with her clothing.<br>\r\n<br>\r\nTurning a corner, Moxy finally reached her favourite clothes shop. It was a run-down looking place from the outside, with old, wooden paneling covering its exterior walls, but inside it was bustling with enthusiastic shoppers. Moxy stepped through the front door, closing it swiftly behind her. She savoured the feeling of at least half the population of the shop turning their heads to look at her in surprise.<br>\r\n\"Afternoon,\" she greeted the cashier as she strode confidently towards the back of the shop. The cashier, who knew Moxy as a regular to the shop, was too dumbfounded to even reply.<br>\r\nTaking off her boots, Moxy stepped into one of the shop's measurement booths. She felt the floor give a little as the scale underneath her recorded her weight. A glowing panel was mounted onto the wall in front of her, displaying the text \"Please select your gender\". Grinning in anticipation, Moxy tapped the pink \"Female\" box and watched as the laser measurement beam lowered from above. It slowly descended until it reached the top of Moxy's head, and then flickered off. With a mechanical \"beep\", the text on the panel suddenly changed.<br>\r\n\"Thank you for waiting. Your current height is 203.3cm (6ft 8in), and your current weight is 95.2kg (209.8 lbs). Your Body Mass Index is 23, which is in the Normal Weight category. Thank you for using this machine.\"<br>\r\n\"Yessss!\" Moxy cheered quietly, stepping out of the booth. \"I hadn't just gained 2 or 3 inches... but 4! And that's without my boots on!\"<br>\r\n<br>\r\nPulling her boots back over her feet and standing up proudly, Moxy strode over to her favourite section of the shop: the black dresses. This is where she had previously bought her treasured black dress that she could no longer fit into...</span></div></div>",
            "created":1361222100,
            "id":1534656,
            "title":"Hitting the Town"
        },
        "13222122111":{
            "choices":[
                "Moxy heads home to her family, to finally show them the BIG news",
                "Moxy is hungry, and wants some lunch for now"
            ],
            "content":"<div class=\"\"><div> <span>Not only dresses went through the testing-machine that was Moxy over the course of the next few hours. Her recent growth had, after all, resulted in many other things not fitting her anymore, something she had become aware of, ever since that incident with her underwear this morning. So as time passed, Moxy managed to pull more and more sets of clothes into her, now for her, small dressing room. Yesterday the small booth-like room would easily have fit her, but as her spurt had affected her frame, she found it to be more tricky to move around in it. <i>Annoying architects, never thinking ahead that big might need to buy clothes as well!</i> she thought to herself. Even so, Moxy actually enjoyed being able to categorize herself as a \"big person\". Especially when she once again began to admire her form in the booth's mirror. She was so tall, yet so feminine. Not like those tall people, who seemed liked solidified rubber bands stretched to their limit. She had to be the ideal image for an amazon, and it put her in a great mood, instead of her usual angered self.<br>\r\n<br>\r\nAs the hours passed, more and more clothes piled up outside the booth, as Moxy had trouble finding a fitting size for her in virtually all categories. It almost became routine for her to ask the store assistant for help in regards to finding the right size. <i>Do you have this in a larger fit? Does this come with longer? Can you find one of this with more room for my breasts?</i>. That and much more made the worker's day busy, as she politely replied back to the needy customer Moxy had become, only to waddle to the back of the store and return with either good or bad news regarding Moxy´s requests. Mostly bad news, which of course led Moxy to just search for a new set, increasing the pile of discarded clothes. Moxy noticed that the booth had become not only smaller to her new frame, but also shorter. Last time she had visited the store, she had been completely blind to the outside of the changing-booths, but now with her new height, she could easily scour the rest of the store, which seemed to grow ever emptier as Moxy made her presence more visible with her neediness. <i>Midgets can't respect a growing girl's needs?</i> she thought of them.<br>\r\n<br>\r\nAfter a long search, and many discarded rejects, Moxy finally managed to gather a set of clothes. She had decided to keep the boots, as she found them to be a quite decent fit for her. Instead she had been bedazzled by a dress, which was possibly the largest to be found in the store (at least for her body type). It was a dark dress, with thin, purple stripes moving horizontally across the dress. She had decided on this one, as it would fit with a lot of the make-up she had back home, but also because it largely emphasized her recently improved bodily proportions. Speaking of those, she had also bought 2 new pairs of underwear to match these. She had even bought one slightly bigger, just in case her development wasn't done (or she decided to drink some more energy drinks). Moxy grinned at the thought. The only problem with her dress was that despite being the shop's finest craft in terms of size, it still only barely covered her bottom, leaving her long legs heavily exposed. To deal with this, Moxy had procured herself a nice set of stockings (which also fixed her recent problem with socks), which hid her beautiful legs away between a web like darkness, yet still showing them enough to lure in the eyes of lustful boys. As Moxy took a last look at her new set, she found it pleasing to her needs, and walked up to the counter. Up there, she would look down on the cashier, now an entire foot shorter than her, as she'd try her hardest to speak casually to her long-time customer, despite still being quite shocked by her sudden surge in size. With a smile on her face, Moxy asked for a bag for her old clothes. \"I'd like to keep this set on when I leave,\" Moxy said politely. The cashier silently agreed, and took the payment for the clothes.<br>\r\n<br>\r\nMoxy walked out of the store, and took a deep breath and a long stretch, inhaling the fresh air, and feeling the rays of the sun shine on her bare arms (which the dress didn't quite cover) and face. She then looked across the street, still seeing a few people giving short and odd stares in her direction. <i>I am a unique sight, aren't I?</i> she thought, as she planned on how to continue her day....</span></div></div>",
            "created":1361390700,
            "id":1536077,
            "title":"One Needy Moxy"
        },
        "132221221112":{
            "choices":[
                "Moxy gets home to some rather shocked parents",
                "Moxy gets home to a still empty house"
            ],
            "content":"<div class=\"\"><div> <span>As Moxy stood and pondered on what to do next she felt a sudden rumble in her stomach. With the sun's heat bathing down on her as well, a heavy feeling of exhaustion came over her. <i>Well, guess a foot of growth needs energy as well</i> she told herself, as she slowly felt the rumbling from her tummy. Taking a glance at a nearby corner, she remembered that there would be some eating places just down the street, round the corner. Even though her newest clothes had been expensive, AND there was free food to be found at home, Moxy decided that her wallet still felt heavy, and began strolling down the street to treat herself to a fancy lunch.<br>\r\nAs Moxy strolled down, she once again took enjoyment in the improved view, this time with added leering eyes, now beholding her ever more visible physique. Though she wasn't the one to crave attention from all sorts of people, she kind of enjoyed the attention, and just told herself that she was more of a exciting attraction (Goth amazons were VERY rare after all), than a sex symbol.<br>\r\n<br>\r\nAs she finally turned the corner, she saw it. Stagehaus. A cafe she had come often to meet her gothic peers, as they enjoyed the poetic performances that local newcomers of professional poetry brought them every now and then. It was owned by a elderly German \"former\" beatnik, thus the haus, instead of house. It had been a while since she had been there, actually almost a year. She began coming when she was 14, and it was there she saw her first poetry reading. She had always dreamt of writing poetry herself, but she had never been really good at it. So she left that to the pros. Still she had a lot of good memories from that place. A lot of good time with her peers, and a lot of dates, though she had never really gone far with any boy in terms of relationship. If any, it would've been Slade..... <i>Nonono! Not him now,</i> Moxy told herself, as she quickly shook Slade out of her head. <br>\r\nThe reason that Moxy had stopped visiting was because the people she had been having a good time with had slowly moved away. She had been really young, in comparison to other customers there, and only really fit in because of her naturally adult height, despite her age. But they all got older and had to move away for education and jobs. Nowadays Stagehaus was mostly a hipster meetup, for modern hippies and Pseudo-goths. Though they still served a good sandwich.<br>\r\n<br>\r\nAs Moxy walked into the little cafe, she didn't find any old faces, but rather found that even this place, which had seemed so big and adult to her the last time she visited, seemed smaller than she remembered. Actually she even felt a bit alienated in her otherwise so familiar surroundings, and rather than using the majestic approach she had been posing with all day, she tried to casually find a empty table, which she eventually did. Even more negative nostalgia showed up in her mind, when a waiter quickly came and asked what she wanted, shortly after she had checked the menu. In the old days it would always have been Mr. Reinholt (the German owner) who would take all orders from every customer with a friendly and engaging smile on his face. Now it was just a youngster (max 2 or 3 years older than Moxy) who asked for her order. Moxy just casually asked for the sandwich she so loved from the kitchen, along with a coke. As the waiter wrote it down and left her with a dim smile, she looked around her old hangout-place. People in bright, colourful clothes were sitting all around talking about families, parties, love life and the goods of life, and more than ever Moxy missed the old mood of dark happiness the place had once emitted. Soon it came to her mind that while the place had changed a lot, she remembered that she had too. <i>Nothing really ever stays the same, does it?</i> she thought as she leaned in over the table with a small smile, similar to the one the waiter had earlier.<br>\r\n<br>\r\nSoon Moxy´s sandwich was served. It was just as she remembered it, as she took the first bite, to savour the delicious combination of spices that it was filled with. She took good time eating it, savouring every bite. It took a full 30 minutes to actually make it through the meal, as the more she consumed, the more happy memories of the place came to her. Even after she had finished it, and her coke, she just sat in small trance of philosophic thoughts, much regarding how fast her growth had changed her life in only 24 hours. She had outgrown all the expensive clothes in her draw in a single night. Her newfound strength and body, which she seemed to bond ever faster with. How her parents would react to her later on.<br>\r\n<br>\r\nShit! Her parents! Moxy remembered the note saying they would be home at 3:00pm. Quickly she checked her phone. it was 4:30pm! She quickly snapped out of her trance and went to the counter to ask for the bill. The cashier, quite shocked by her large frame, was very quick to give her it, and so was she with the payment, she quickly began walking towards the exit. Then, suddenly, she heard a familiar voice that clearly rang inside her mind, and she made quick turn. In a flash, she instantly spotted him between the careless crowd. It was Slade. He was not nearly as gothic as she remembered him, hell he even looked like a suburban young father. Although overly surprised by the sight of him, Moxy was still fast in motion, and the turn removed her attention from her path. Suddenly a somewhat powerful bump touched her back, and she tripped a few steps forward. Behind her a large grunt was heard, and then a crash. She quickly got her balance back and turned around, only to see the waiter who had taken her order earlier lie amidst the ruins of a broken table, soaked in the food that had been on it. Sudden silence spread across the room, as Moxy looked around embarrassed, and surprised over the power her body created simply by a small bump. She knew she was big and strong and all, but.....damn!<br>\r\n<br>\r\nThen suddenly reality snapped into Moxy´s head, and she looked around at the many curious customers, who now all gave their attention to the sight that was the more than 2 metres tall gothic giantess that was Moxy. Lowering her head over the embarrassment, she quickly sprinted out of Stagehaus, with more attention than before.<br>\r\n<br>\r\nOnce Moxy got a good 2 streets away from the cafe, she finally began to slow down. Moxy thought everything over, while she took a look at her hands. <i>Wow.... I'm.... I'm strong. Very strong,</i> she thought, as she evaluated the situation. At first she was shocked over the situation, but then a stream of joyful thoughts came to her. She quickly let her hands travel across her tight and fit body. <i>Superiorly strong, actually!</i> Moxy told herself. Feeling how her size affected her truly was actually an attractive thought to her. Yes, she was big AND powerful, but that also meant other people were small and weak to her now!<br>\r\n<br>\r\nQuickly snapping out of her thoughts she remembered that she had to head home. She began to walk fast down in the direction of her house, still thinking of her strength. On the way a young lad the age of 16 passed her, and was bewildered by the sight, so he quickly stopped up to follow her with his eyes for a second. <i>What a large lady!</i> he thought. Suddenly his eyes found their way to a  most peculiar sight. Despite wearing a dress larger than any piece of cloth he himself owned, a little butt was showing below it. As she disappeared from view, he continued his walk, as the distance between him and Moxy grew...</span></div></div>",
            "created":1361398080,
            "id":1536129,
            "title":"New Moxy's trip to the past"
        },
        "1322212211122":{
            "choices":[
                "Moxy decides to get dinner and watch television, slacking the evening away",
                "Moxy falls asleep, but soon wakes up, even bigger than before"
            ],
            "content":"<div class=\"\"><div> <span>Moxy expected a minor chaos to start once she arrived at her house, but like so much else that had happened lately, what she expected was not what reality would turn out like. Because once she was finally there, she'd see that neither her parents' car was in the driveway, nor did it seem like any activity had been going on since she left the house. Quickly she dashed to the door and locked herself in. Once she was inside she began to call out for her seemingly missing family: \"MUM?! DAD?! SIS!?!?!\" her voice echoed throughout the house. As no reply came, Moxy walked to the kitchen, where she, much to her surprise, found another note stuck to the fridge. Quickly picking the note from the fridge door, she read it out loud to herself, as if she needed her own attention: <br>\r\n<br>\r\n\"Dear Roxanne,\" (there that GOD awful name was again), \"while we were shopping we got a call from your grandmother, about an accident your grandfather had earlier, so we drove off to be with her. We'll probably not be home again before Sunday evening, but since you're a big girl, I know you can take care of yourself over the weekend. Love, Mummy.\"<br>\r\n<br>\r\nMoxy found the writing overly ironic. Big girl. She should know just how big a girl she was now. Moxy looked across the empty kitchen. <i>Well this is great! Biggest change of my life, and I'm alone with it over the entire weekend.</i> She had never really liked her grandparents. Her grandfather was a conservative bastard, to such a degree even the heavy conservatives would consider him fundamentalistic. He had not liked the change of style Moxy had during her teens. And as she got older, she had just started taking the 2-hour ride to them with her parents less and less, until it had been ages since she saw him and her grandmother. Still, it was unfair for her parents to just leave her so rudely for the entire weekend. <br>\r\n<br>\r\nMoxy felt a great frustration build up inside of her. Without words to describe herself (or people to listen to her) she threw the note on the floor, and looked in the direction of the hallway leading upstairs. Angrily she marched to the stairs, and up she walked, caring even less about the amazing new weight she had, as her heavy footsteps echoed throughout the creaking wood in the stairs and walls. Quickly going into her room, she undressed herself, until only her underwear remained. She then in the same pace marched towards the bathroom, throwing her underwear in the hall as she went. Once she was in there she faced the shower, and rapidly entered it. Instantly she turned on the water, which fell on her as a stream of freezing liquid. She didn't flinch, not one bit. She stood unmoved, as the water slowly warmed up, and soon she once again looked down on the new her, amazed by the sensation of her new body slowly becoming wet. Even though it was a completely normal shower, it was an entirely new experience with her new proportions.<br>\r\nHowever, soon her rage once again rose, and Moxy quickly filled her hair with shampoo from the bottle on the shelf. Crudely she began to rub her hair with it, as she began expressing her rage with a monologue for herself. \"Stupid family! I'm big, I'm a new me and I've got nothing but myself to show it for. No one ever appreciates me, never ever ever!!!\" it came loudly for her, as her hands dug ever deeper into her scalp, scraping every inch of filth from her dark hair.<br>\r\n<br>\r\nAfter rubbing her scalp for a good 5 minutes straight, with the water falling heavily on her, adjusted to the greatest temperature her body could stand, Moxy's head began to feel sore. A headache suddenly spread across her upper head, so Moxy lazily turned the water off and stepped out of the shower-cabin, with heavy, tired stomps. The bathroom was all foggy from the steam that the shower had produced, and the mirror hanging across the room, fogged as well. Moxy took stepped towards it and washed away the dew with her hands until the mirror was clear. She then stepped back to look at herself, only to find the confident expression she had been wearing all day was washed away to that of a sad frown. A sad frown on her still vastly improved body. <br>\r\n<br>\r\nAs if by nature, Moxy began to brush her hands up from her butt to her breast, where she'd squeeze them slightly. They felt so heavy and full, from what she had been used to, less than a day ago. Soon her hands began to sneak across the chests surface to the nipples, where she dared to give them a slight twist. A sensational spasm ran through Moxy's body as she did so, and one twist soon turned many. She began to sink down on her knees and breathe heavily, as she continued her self-pleasuring. Soon the sensation from her upper body alone was not enough, and a hand quickly found its way between her legs, where she'd bury inside with 2 fingers and twitch around. The deep breathings soon turned into small moans, as she sank onto her side, lying on the floor, one hand between her legs, the other at her chest. Images of the many couples from her school, that she had both hated and envied pinged through her head. Images of Slade from her past, and the one she had of him today began to travel through her mind as well. She felt a tear fall while maintaining the position she had, and the physical ecstasy of what she was currently doing. Soon she reached her climax and let her hands fall back, as she felt the old sensation, of being done with herself below, while leaving a mess behind.<br>\r\n<br>\r\nFor a while Moxy just lied still on the bathroom floor, exhausted and pleased, still having a heavy feeling of depression in her head... before she knew it, she simply had a void in her mind, that soon became ideas of what to do next.</span></div></div>",
            "created":1361479440,
            "id":1536723,
            "title":"I'm so angry I could take a bath"
        },
        "13222122111221":{
            "choices":[
                "Someone breaks into Moxy´s house during the night",
                "Moxy grows in her sleep"
            ],
            "content":"<div class=\"\"><div> <span>Coming to conclusion that despite her new clothes fancy looks, it wasn´t the most comfy set of clothes to put on, and instead decided to go for the Brown skull shirt from earlier, as it had been the more relaxing set for Moxy earlier on the day. Sadly, she couldn´t be bothered to actually find pants of fitting size (as the ones WHO had went with the shirt was quite uncomfortable as well) so Moxy just enden up in a Loose outfit of the well-fitting big-people shirt and a pair of her newest panties. <i>Not like anyone is going to see it</i> she thought.<br>\r\n<br>\r\nDespite feeling slightly renewed energy from the shower (and self pleasuring) Moxy soon grew tired and did not bother to make her own food. Instead she called up a local restaurent , which did take-away, and ordered a large pizza, of her favorite kind, along with a big coke. On an ordinary day she wouldn´t drink this much cola, but she´d just lied to herself about her new body wouldn´t mind a Little sugar, with having become so fit and all.<br>\r\nThe pizza boy, WHO many times before had delivered pizza to the door, and Thus knew Moxy relatively well, was (not much to her suprise) quite shocked to see the girl, whom he had been at the same height as last time he saw her, not Tower over him, and not being terribly virginal with covering her skin. As a matter of fact, he almost forgot about his job, and instead began to inspect Moxy´s new curves, with special focus on her extraordinary long legs, and well-formed bottom, which only her panties covered up. Moxy was quick to deduce this, and aggressivly interrupted his short stare-a-ton by offering him his payment in a Deep and serious tone. Shocked back to reality by the amazonic Moxy, he quickly accepted the Cash with a \"thank you\" that was said with a clearly covered studder, only to see the angered dame smash the door before him, leaving him in the darkening weather outside.<br>\r\n<br>\r\nMoxy consumed both the pizza and coke with much pleasure, and soon after found a much relaxing position in her couch, where she´d spend the rest of her eve skimming through the channels for a decent movie. Moxy had always been a rare case of character, but she was just like normal girls with her interests in movies. For her it was a question of finding a movie with a handsome male protagonist, and then imagining the face of the one you loved over his. Soon, after some search she found the movie \"Mysterious skin\" starring a younh Joseph Gordon-Levitt. This one brought a small joy back in Moxy, as it reminden her of Slade. He was the one she saw it with, and at the time she had fallen head over heels for the Young actor. As it had gone on, She and Slade would watch it until late at night, where the film had brought the two in the right mood, and eventually the 3-year older, at the time gothic gent had made his move, which the young and love-sick Moxy gladly had accepted. That night had been her first time, and that memory was running through Moxy´s mind multiple times over the course of the film. As it ended and the credits started to roll, Moxy began wondering what Slade had been doing in town. Not that it was any of her business, he was a past memory of the time she had gone from girl to woman. Moxy shut off the TV and began to look around the dark house, as she fell into a Deep sleep....</span></div></div>",
            "created":1364933880,
            "id":1563258,
            "title":"Mysterious Skin"
        },
        "132221221112211":{
            "author_id":"masonaut",
            "author_name":"masonaut",
            "choices":[
                "\"This is bad. This is reeeeally bad...\" she panics, unsure of what to do",
                "\"I know it's wrong, but damn, this feels good...\" she grins, clenching her fist"
            ],
            "content":"<div class=\"\"><div> <span>Inside Moxy's mind, another one of her movie-like dreams was playing out as she slept peacefully. Moxy was on the roof of an apartment at night, overlooking the deserted city below through the scope of a sniper rifle. There were no people roaming the shadowed streets below; at least not any living people. The only movement in her crosshairs was the slow stumbling of a handful of undead zombies looking for food.<br>\r\nNarrowing her eyes and brushing a lock of hair out of the way, Moxy lined up the scope's crosshairs with the head of an idle zombie. With the cool night breeze causing her hair to wave a little, she grinned to herself and squeezed the trigger on the rifle...<br>\r\n<b>*BANG*</b><br>\r\n<br>\r\nA loud noise suddenly echoed throughout the empty house, tearing Moxy's consciousness from her fantasy-like dream and back into reality. She instantly sat bolt upright with the expression of a startled rabbit. <i>Something is not right... no, I'm not alone,</i> Moxy thought to herself. The room was pitch-black so Moxy could not make out if anyone else was in there with her, however she could feel her legs sticking over the end of the sofa more than before she had gone to sleep, so it was evident at least that she had grown somewhat.<br>\r\nStanding up cautiously, Moxy listened. Her breathing was quiet and she stepped lightly as she moved to make as little sound as possible.<br>\r\nThe kitchen. The sound was coming from the kitchen. It was an irregular rustling sound; the sound of someone looking for something. <i>It has to be a burglar,</i> she thought silently. <i>Is there anything I can use as a weapon? ...Damnit, it's too dark to see!</i><br>\r\n<br>\r\nMoxy gave up on the idea of using a weapon, and instead decided to sneak into the kitchen as quietly as possible. <i>I may be tall and strong, but for all I know this guy is armed,</i> she warned herself, tiptoeing through the black hallway.<br>\r\nJust as she was about to enter the kitchen, a sudden noise confirmed her suspicions.<br>\r\n<b>*CLANG*...</b> <i>\"...shit!\"</i><br>\r\nThe voice was a slightly gravelly male voice, sounding hushed, frustrated and slightly desperate. <br>\r\n<i>Great, well now I know it's a guy and he's probably here to steal something, I can think of a plan,</i> Moxy decided. She continued her near-silent journey into the kitchen to discover that the door had conveniently (and stupidly) been left open.<br>\r\n<br>\r\nUpon entering the kitchen, it was immediately apparent to Moxy that the sound was coming from the pantry. The pantry was a small room in the corner containing mostly pots and pans and food that didn't need to be refrigerated. <i>The hell could he be looking for in there?</i> she pondered. She briefly thought that he might be a poor person looking for food and almost felt guilty for him, but that feeling was quickly outweighed by the burning desire to punch his lights out for trespassing. <br>\r\nPartially thanks to the complete darkness, Moxy was somehow able to sneak up behind the trespasser without even being acknowledged. This was her chance.<br>\r\n<br>\r\n\"Oi, fuckwit, I think you got the wrong house,\" Moxy spoke loudly in her most intimidating voice. The man shrieked in surprise and a sudden frantic rustling sound could be heard.  Using this as a point of reference, Moxy propelled her fist into the darkness as hard as she physically could. To her pleasure, she heard a satisfying crack and felt the familiar feeling of her fist hitting some part of a human head. There was no vocalization of pain from the man: only the dull thud of a limp body collapsing to the floor.<br>\r\n\"Get up!\" Moxy yelled in a scarily demanding voice. No response.<br>\r\n\"<b>Now</b>, you piece of shit!\" she shouted, chuckling slightly from her enjoyment of the situation. But still, no response. Not even a sound.<br>\r\nSlightly annoyed, Moxy felt her way in the darkness to the light switch and pressed it firmly, shielding her eyes for a few moments as the bright, artificial light flooded the room with a click.<br>\r\n<br>\r\nThe first thing that caught Moxy's eye was the broken window above the sink. The majority of the worktop was covered with broken shards, with some smaller ones on the floor. <br>\r\nThe floor... was further away than she remembered it. <i>Holy crap...</i> Moxy muttered. <i>I've not even been asleep the whole night and I must have grown at least 2 or 3 inches.</i> Wandering around for a few moments to familiarize herself with her new height, Moxy suddenly noticed the body in the pantry. Even she flinched at the sight.<br>\r\nThe man's body lay there limp and unmoving, with blood splatters on the floor near his mouth along with some dislodged teeth. On his cheek was already a nasty mulberry coloured bruise forming, which spread all the way to his eye. She hastily moved over to him and crouched down to examine his injuries more closely.<br>\r\n\"Damn, I sure showed him,\" she smirked, clenching her fist in front of her face. She could feel the raw strength in her muscles as she did this, and it felt good. <i>Really. Fucking. Good.</i><br>\r\n<br>\r\nSuddenly, as she was admiring her own power, Moxy noticed something about the man's chest. It was not moving. Not even rising and falling as if he was breathing. She felt her heart rate instantly quicken as she held her hand under his nose: nothing. No breath. Panicking, she pressed her ear against his chest. He was wearing a jacket so it was heard to tell, but she could not detect any signs of breathing, and even more worryingly, no heartbeat.<br>\r\nHer heart pounding increasingly loudly in her ears, Moxy sat up. <i>No way... he's dead. Somehow, by punching him in the head... I killed him.</i> She paused for a moment...</span></div></div>",
            "created":1370133300,
            "id":1601607,
            "title":"The Thief"
        },
        "1322212211122111":{
            "choices":[
                "Moxy doesn't reach the river without problems",
                "The plan proceeds smoothly"
            ],
            "content":"<div class=\"\"><div> <span>Although a positive sensation of suprise ran through Moxy as a reaction to discovering just how strong she´d become, a more humane thought began filling her mind in the time span of nanoseconds: The self-resenting and fearful realization that she had just killed another man. Taken a fellow human's life. For a while the shock made Moxy simply stand and stare at the still slightly bleeding corpse. But she gradually came to her senses and started stressing out when she began to think the conversation through.<br>\r\n<br>\r\n\"<i>Shit! Shit, shit and shitty shit! What the fuck have I done?!</i>\" she thought to herself as she began walking back and forth across the floor. What increased her stress further was the subsequent discovery of her apparently still growing body's latest progress. Despite the fact that she had just a few minutes ago successfully had performed silent stealth in her attack on the thief, she now found that her much more active movements combined with her increased size gave her a very clear presence in the house, as her weight seemed to have grown along with her, making her foot-stomps loud and clear and causing them to echo in the house´s woodwork.<br>\r\nEven so, the fact that she'd now likely topped the 7 foot mark, therefore making her just about a foot taller than anyone she knew was dwarfed by the dead burglar in front of her.<br>\r\n<br>\r\nWhen she finally took a glass of water to settle down and think the problem through, several ideas came to her, but they all seemed dumb. They flew through her head, but Moxy was a bright girl, and combining that with the short-term paranoia of actually killing someone gave her all sorts of forced thoughts about police officers showing up on her doorstep the next day and taking in her in for questions. As these thoughts poured through her, the fear began forcing tears from her eyes, and her hand which held the glass of water began shaking violently. \"<i>What have I done....just WHAT have I done?</i>\" she tearfully asked herself, while sitting before her victim. \"<i>I can't be a criminal. I can't go to jail. I've always been as good a girl as I could. He came into my house, he brought it onto himself! He did!</i>\" it came from her, as her voice increasingly lost its confidence. \"<i>I cant go to jail.....</i>\" she muttered as a single tear fell from her eye, and showed her the very solution she was looking for. <br>\r\n<br>\r\nThat one tear crawled down her face, until it hung neatly over her glass of water. Then it was as if the entire sound spectrum focused on bringing the sound of the \"drip\" that the tear made as it landed in the water to Moxy´s ears. Instantly, that bright mind of hers came up with an idea: \"<i>The river! Of course</i>\" she said with returned confidence in her voice. She quickly checked the time. It was a few minutes past 1:30 AM, and it would be at least a couple of hours before the first sun rays would break the remaining darkness outside. She quickly rushed upstairs to clothes, which became her (still unlikable, but likely much more useful for running) Brown T-shirt, combined with her nylons as she felt they gave more freedom for her legs. She then went downstairs again and dug the out the large garbage sacks from the kitchen locker. The large black ones you´d use for the big garbage cans when you cleaned up from a party.<br>\r\n<br>\r\nWhen Moxy once again stood before the dead thief, she saw that he was not an awkwardly tall man himself. Heck, Moxy had probably out-sized him massively, even before she had started growing. When she quickly fitted his head first into the bag, and then began to slowly lift the remains of his body into it, she measured him to not he much more than 5'6, maybe even less.<br>\r\nAfter a little effort of bending the corpse to fit in the bag, Moxy used all of her hands might to tie a strong knot on the end. Cleaning the blood could wait till she came home later that morning. She then hauled the body over her shoulder, and once again made her heavy steps through the house. Finally she opened her front door, and stepped out into the still dark night. A slight wind could he heard across the empty street, as Moxy inhaled and began to run.</span></div></div>",
            "created":1373124780,
            "id":1623649,
            "title":"Staten Scenario"
        },
        "13222122111221112":{
            "choices":[
                "Moxy finds her snack",
                "Something comes in the way of Moxy´s plans"
            ],
            "content":"<div class=\"\"><div> <span>If you were the type to go to bed during the later hours of the weekend days. and you happened to be looking out a window in the timespan between 1:30 - 1:40 AM on this particular saturday, wether it was an odd hobby of yours to stare out Windows at night or it was just by chance for a second, you´d have the chance of seeing the perhaps tallest girl you´d ever ses in your life running across the streets of Chance Point, with a strangely formed bag over her shoulder. One could become suspicious of such sights, but just as many could not be bothered the slightest.<br>\r\n<br>\r\nThe plan was simple. Moxy recalled having attempted to get into running for her Health last year and the trip to the river taking about 15 minutes, but thanks to her new body´s suprising stamina and considerebly extended legs, it took her a little less than 10 minutes to reach the river. Once there Moxy would follow it for a short 2 minutes, still in her running pace before she would reach a bridge. The bridge was well-lit, and she would not dare to dump the body there. Instead she looked at her true goal: the tunnel below the bridge. A small stair led down to a place where rowing boats COULD dock, but rarely did, due to the last few years severe increase in streaming, resulting in boats quickly drifting away from any stationary location they choose. Instead the little area beneath the bridge had come to be known as the \"lover hideaway\" namely given to it by the young people who from time to time would sneak beneath its shadows to meet up for romantic meeups. Moxy herself had never been there, though the first time she had seen, but not talked to Slade back then....<br>\r\n<br>\r\nTime was still not ripe for memories of him now. Moxy quickly scouted the area around her \"<i>Perfect! no one around this early, even for a saturday</i>\" she thought, before she dashed to the stairs leading below the bridge. Once she had descended them, she went to the bank of the river, and with a grunt threw the bag in. As she had predicted, the body quickly was taken hold of by the stream, and in less than 10 seconds, the bag floated out of Moxy sight. Now all she had to hope for, was that the bag would take the dead thief to the sea, where some fish hopefully would eat him before any person would find it. Finally with the burden of a dead person coming of her shoulder (literally) Moxy took a second to inhale and enjoy the chilly air on the summer night.<br>\r\n<br>\r\nStanding and thinking for a few seconds, Moxy once Again caught a glimpse of her body, and for the first time managed to get a look at what the latest growth spurt had affected her. It was almost immedeatly that Moxy found that she was far beyond simply a tall girl now. If there had been any doubt, such would be gone now. She was sure she could now define as Amazonic. She at least topped the 7 feet mark, and was by far the tallest girl she herself had ever known of. And for her body, it too had changed slightly since. From what she could judge from sight, and a few touches here and there,her stature was now more fit than ever, if not.... \"<i>dare i say to myself</i>\" sexier! Her legs and hips had widened slightly looking healthyli well trained in the still sexually attractive way. Her breast felt slightly more filling, and would proberbly reach another cup size if her growth continued. All in all she was more woman than she could have DREAMED of seing herself of less than 2 days ago. It was in this moment of self-admiration that Moxy clearly felt that she told herself that she had found a definition of beautiful, that Moxy could honestly tell herself she was proud of having achieved.<br>\r\n<br>\r\nIn the midst of her thoughts she noticed that the clouds had once Again cleared and the moonlight danced on the wildly running river. Moxy felt a pinch of hunger strike her. Feeling her stomach, Moxy thought to herself that despite having practically been living on junkfood the entire day, it didn't seem to ruin her physique in any way and decided to once Again get a snack. \"<i>Mum and Dad wont be home with Maggie ´till evening, so cleaning can wait abit. What a suprise they´ll be in for once they get home!</i>\" Moxy told herself. She then ascended the stairway, leaving Lovers Hideaway behind with a oddly strong lust for french fries....<br>\r\n<br>\r\n(what now?)</span></div></div>",
            "created":1373140200,
            "id":1623763,
            "title":"Lovers Hideaway"
        },
        "132221221112211121":{
            "choices":[
                "Someone else enters the pub",
                "Ewan shows odd interest in Moxy"
            ],
            "content":"<div class=\"\"><div> <span>After walking a few streets from the bridge, Moxy was standing before a glorious light, which also was the source of what she so desired: a small place knowns as The Witch, named so for its tendency to serve sandwiches in a similar manner to that of an American Subway. It was one of the few places which served as a more alternative dining opportunity that the township of Chance Point had, for while it in the daytime served as a everyman family friendly restaurant, after 7PM it opened up for the sale of liquors and became a popular place for young people at Moxy´s age to “warm up” before going wild around town, In the weekends. Moxy had never been there for more than a few lunches. She didn’t have the social circle for those kind of shenanigans. It had been actually been almost 4 months since Moxy last got drunk and wild, not to mention actively went to socialize with anyone. <br>\r\nRegardless of thes thoughts Moxy wanted a late night snack, and as this place was the only one she knew had open at roughly 2AM in the morning. <br>\r\nMoxy then walked to the entrance, and as she was about to push the door open, felt a compelling need to change her posture. Still slightly slouching due to the sudden urge of tiredness that had hit her, after she stopped running with the dumped body. She rubbed her eyes, and took a look at herself once again getting a look at her new amazonic body. She then took a confident stand, and marched into the store, knowing that now someone was ought to see and actively give attention to the new her<br>\r\nThe place was as empty as one could believe a restaurant who served daily at 2AM would be. No one at the standing tables or at the sitting spots. The only being in sight in there was a cashier reading a magaz….<br>\r\n“<i>oh shit!</i>” it boomed in Moxy´s mind, when she saw just who the cashier was: Ewan Lawrence. More specifically the person sitting 3 seats behind Moxy during most of her classes at school as well as one of the persons Moxy had the least seen eye to eye with during her life, both in terms of mentality as well as height. Ewan had stopped growing at 5,10 feet, only an inch from the even then tall Moxy´s former 5,11. Now that distance was even greater.<br>\r\nWhile Moxy was rarely the person to ever be insecure in such a situations. But of all the people who could have night shifts at their job, it was someone she actually knew. It was just then it came to her just what had been happening the last 2 days, and despite her tremendous praise for the new her, now where she finally was supposed to show it to the rest of the world she froze in panic.<br>\r\nThe panic furthered when Ewan suddenly took his attention off the magazine and to her. “<i>Fuck shit fuck</i>!” Moxy thought as she saw Ewan right in the eyes. At first he didn’t really seem moved by the sight of Moxy, but then suddenly his expression changed. He looked as if he had seen a ghost, or at least something shocking. Moxy mustered the force to act normally and began walking towards the countere, where Ewan sat. When she got there Ewan still with a  slight sense of surprise in his face got up on his feet, making the more than 1 feet difference in the height between  Moxy and him even clearer. For a second there was a moment of odd silence between the two, until Ewan final snapped out of his surprise and managed to speak. “Can I take your orders, mrs?” He said, as casually as he could.<br>\r\nMoxy felt blown away while maintaining her façade. “Hi Ewan” she said, only to be replied by a awkward “hello” back from him. What was going on? Didn’t he recognize her? What was with him?<br>\r\nThen it hit her. She took a quick look down at herself, and understood Ewan’s reaction. Moxy, who usually wore a darkgrim outfit at school, and never went out later than 11, was the person he knew. The girl standing before him was much taller, well build than that girl. That person also wore a VERY brown shirt and nylons. Add to that Moxy, who usually hated revealing outfits, stood now in the most revealing pair of nylons on her lower body. They had been a quick solution to the rush with the dead thief, and only now did see how overstretched the nylons truly were. While Moxy could have gotten away with the nylons the stature and shirt was obviously beyond Ewan’s mind to understand that it was his classmate.<br>\r\nSaving herself the awkwardness Moxy simply pointed at Ewans namebadge and said “it says Ewan on your badge, hence the name” with a smile that was unlike any she had given HIM the last many years. Ewan gave a short giggle from him, then coughed and repeated himself.<br>\r\n“can I take your order then?” he said, not with a similar smile than what Moxy was used to. Moxy too regained her sense of situation and looked for a few seconds, before simply ordering a Menu 4: A chicken sandwich with a ice coffee. Ewan brought the order up with a big smile, and served it at to the point where the tray actually looked like the one on the picture. Moxy paid up, and lifted the tray to the nearest standing table. <br>\r\nJust as Moxy was about to place the tray a thought hit her. She looked back at Ewan, who still stood smiling to her. She quickly spied on her overstretched nylons, and it came to her that her butt most likely was very clear through the overworked material. Fearing that Ewan might stare, she instead went to a sitting table. Much to her dismay, she found that her legs, who had bulked in size along with her body has trouble getting in through the bench and table. After a little work she managed to fit them if, but feared her muscular legs and broken something, as it became surprisingly more spacy after she had forced her way in. Watching the counter, Ewan didn’t seem to mind, so she simply dug into her sandwich.<br>\r\nAs she ate and drank, Moxy noticed several times how Ewan actively kept watch at his latest, and currently only, customer. The two shared a few eye contacts and awkward smiles. Then, during Moxy´s meal a moment of total silence occurred in the atmosphere before nights next even would unfold…….<br>\r\n</span></div></div>",
            "created":1373948820,
            "id":1628709,
            "title":"Moxy finds her snack"
        },
        "1322212211122111211":{
            "choices":[
                "Moxy wakes up to her parents having returned",
                "Moxy wakes up to yet more growth",
                "Moxy has a dream"
            ],
            "content":"<div class=\"\"><div> <span>Ewan maintained a vigilant watch over his customer. So much that Moxy for a second feared he may had grown infuriated with her this late night hour. The silence present in the building was only interrupted by the sound of Moxy's eating, and the occasional silent creaks produced by the weary bench as Moxy moved slightly around. Though Moxy was happy with her new below-waist curves, she admitted to herself that it was uncomfortable for her lower body to make space down there.<br>\r\n<br>\r\nSuddenly the silence in the restaurant was broken, as a unexpected sound could he beard from outside. A mildly noisy bash came from the door, and soon the restaurant was filled with voice and activity. It was 4 young people, who came thundering into the place, loudly talking in a slightly incomprehensible tongue, which Moxy quickly recognized as the sound of dumb, drunk teenager. There were 4 of them: two girls and 2 guys. Moxy recognized none of them. The two girls, both blonde, wore somewhat revealing dresses and made a clear sound with their high-heel shoes hammering into the floor, as they rushed up each in the arms of the confident boy that held them as if they were prizes for his evening. He himself was tall fellow, wearing tuxedo pants and a blue bow-tie on a red shirt. The three of them stumbled their way to the counter where they started loudly discussing what they would order. Their loud presence and attitude annoyed Moxy who despite having felt awkward, being alone in the building with Ewan, was disgusted by their drunk and careless attitude. \"<i>Just because its late it doesn't mean they can act like they know the place,</i> she thought to herself. <br>\r\n<br>\r\nWhile Moxy had her sight on Ewan's manner-less customers, she was careless to see the grim presence that had encroached on her. It was not until it had stood there for a few seconds that Moxy focus on the teenagers shifted to the 4th customer, who stood beside her now. He was a tall fella, with a bald-shaven head and a brutishly scary expression on his face. Moxy's reaction to him suddenly standing practically right in front of her was that of a short fright. He was a well built man, broad shouldered and with mighty arms that seemed to lack space in his worn-to-its-edge t-shirt. Before Moxy could get a word in to him, he said something to her. A simple \"Hello missy\". His expression did not change the slightest during his sentence.<br>\r\n\"Evening\" Moxy replied. He made a small nod to her before saying his next words.<br>\r\n\"What's a pretty girl like you doing outside this late all alone?\" he said as he pulled a chair from a nearby table to sit on. He placed himself at the far end of Moxy's table, next to her. His companions were still trying to make a decent order, much to Ewan's annoyance. <br>\r\n\"Just getting myself a snack\" Moxy replied calmly. \"Yourself?\" she then asked. He inched his chair closer to the table.<br>\r\n\"Partying. Me and my mates thought we'd get a snack too while we were between houses\", he said, still not changing his expression. It was now that Moxy noticed a strong sound of breathing coming from the buffoon's nose, which created an uncomfortable note to their conversation, adding to Moxy's frustration over his noisy friends at the counter.<br>\r\n\"And what's it to me?\" she said, smiling awkwardly, trying to make closure of his bothersome conversation.<br>\r\n\"Just thought you'd come with us to the next place, missy\", he replied, as if it was planned. Moxy was surprised by this reply.<br>\r\n\"And why would I do that?\" she just asked. The reply she recieved was most unexpected. She was aware at this point that he was trying to hit on her, which made her stomach turn, but she did not expect the directness of his reply.<br>\r\n\"Because,\" he said, making a short pause, \"you seem like a missy who wants to take a pounding,\" he said, aiming his eyes towards her. Moxy's smile instantly vanished for two reasons: First of all, his reply was somewhat predictable but had nonetheless come out of nowhere, and for a girl of Moxy's nature it bordered on that of an insult. Second, as he had spoken the insulting sentence, Moxy felt a creep sneaking up her right leg beneath the table. It was here that Moxy saw that he had his right arm placed flat on the table, while the left had snuck out of her view, and now was sneaking up her thigh. Initially it had simply resulted in a shivering disgust running through Moxy, as this was not the first time she had tried that a male had made such an approach to her, although he was the first man of such character. But when his hand reached halfway across her thigh towards her crotch, showing no signs of stopping, just before reaching its goal Moxy's disgust caused her to act.<br>\r\n<br>\r\nThe result was that Moxy who all along had felt mashed in at her table suddenly, as if by reflex, tightened every muscle found in her lower body, hammered her feet to the floor, and raised her formation while still having her legs caught beneath the table. Moxy, having acted by instinct would have believed that she would simply have been caught under the table because of her move. Yet she had underestimated her own new strength. The table which was held together by bolts, sprang up as her legs broke free. The table slid down on the floor, as Moxy got onto her feet with very little difficulty. The offensive fellow jumped from his chair and clutched his arm, which had been crushed between Moxy's mighty thighs and the table. <br>\r\n\"Hell!\" he screamed as he furiously stepped towards Moxy, angered by her action. His voice boomed so much that it distracted his friends and Ewan, who now all stood faced to the commotion in silence. He stomped towards Moxy, likely with the intention of setting her straight. Though both he and Moxy were met with surprise as they stood face to face. Or at least as close as they could get.<br>\r\nThe fellow was tall, at least six feet. But standing next to the well-grown woman that was Moxy, gave her a chance to realize the reality of her size. Having known that she had grown since she last woke up to the burglar, yet not having had a chance to really measure herself towards anything or anyone, Moxy found that the 6 feet tall man, barely reached above her chin level, as she majestically stood at least 7 feet tall, or almost 215 centimeters above the ground. Moxy and the fellow stood and stared at each other, she with anticipation to what would happen, and he with a look that was shocked to see how tall she was. Moxy saw that she was the dominant factor in the encounter, and once again acted with speed. While working every muscle from her legs acquiring stance to her back as a propel, Moxy pummeled her fist into the side of the pervert's skull, again letting violence overcome her. It was not as bloody as it had been with the thief, but he nonetheless fell to the floor with such force that Moxy feared the fall had been the hardest impact he had ever felt.<br>\r\nQuickly Moxy scoured to the crowd at the other end of the floor. The two blonde girls saw everything and showed fear, while the two men had more surprise in their faces. Moxy escaped the shop with fast-paced steps and before anyone could do anything to stop her (if that had even been their plan) Moxy once again marched home to her house.<br>\r\n<br>\r\nAt her house, Moxy quickly dashed inside, and locked the door, before walking towards the couch that had been her bed. In awe of herself, Moxy fell onto its soft pillowy surface while letting her adrenaline slow down. As many thoughts raced through her mind she was soon overcome with tiredness, as it was as ever late in the night. Moxy just managed to catch a glimpse of a rising sun outside the blinds of her living room window, before her eyes closed and her mind fell into sleep.....</span></div></div>",
            "created":1396142460,
            "id":1770374,
            "title":"The maiden and the bear not so fair"
        },
        "13222122111221112112":{
            "author_id":"masonaut",
            "author_name":"masonaut",
            "choices":[
                "Go look for bigger clothes",
                "Stay home and eat more, and relax for a bit",
                "Go out to show off her new size"
            ],
            "content":"<div class=\"\"><div> <span>Her mind still a thick soup of conflicting thoughts and feelings from the night before, Moxy slowly began to open her eyes. The modern living room around her was just as still as it was yesterday, but something was different.<br>\r\n<i>This sofa isn't quite as comfortable,</i> Moxy pondered in her still half-asleep state. She groggily leaned forward and propped herself up with her arms, feeling the sofa sink under her rear end a little with a tired creak. <i>It was absolutely a lot softer than this last night,</i> she thought, scooting around and sitting upright. <i>Last night...</i><br>\r\n<br>\r\n\"Oh shit, the blood!\" Moxy blurted out loud, suddenly recalling the events that unfolded, and how she still had some cleaning to do.<br>\r\nShe stood bolt upright in an instant, and just as instantly smacked her head on the light fixture attached to the ceiling. With an uncomfortably loud smash, the impact broke both the glass lampshade and the light bulb inside.<br>\r\n<i>Damn, that woke me up.</i> Moxy looked down at the glass on the ground around her, impressed at how little the impact actually hurt. At the same time, she noticed something else that made her heart dance in her chest a little.<br>\r\nThe tights Moxy was still wearing from last night were looking even more strained over her considerably long legs, even having ripped a little in some places. Moreover, her big toe had created a hole in the right foot of the tights and was poking out rather unceremoniously. <br>\r\n<br>\r\n\"No way...\" she gasped, temporarily too awestruck to consider the blood on the kitchen floor. \"I'm still growing?\"<br>\r\nShe looked around, considering her surroundings quietly. Moxy was certain that everything looked even smaller than before. A satisfied feeling welling up in her chest, Moxy turned on her heel and strolled towards the kitchen where the blood still remained dry on the floor.<br>\r\nAnother thing Moxy noticed was the heaviness of her footsteps. With every casual step, she could hear the shelves fixed to the kitchen wall rattling slightly. <i>This is awesome!</i> she squealed internally, already feeling better than yesterday, even as she scrubbed the sticky remains of the former burglar off the floor. She could feel the weight and strength behind every movement she made, and she loved every second of it. <br>\r\n<br>\r\nSeveral minutes of vigorous scrubbing later and there was scarcely a sign that the wooden floor was ever stained to begin with. To Moxy's contentment, it was much less hassle than she'd thought. <br>\r\n<i>Growwwwwl</i><br>\r\n\"But more importantly, I'm hungry as sin\", she muttered under her breath. <br>\r\nA cursory glance in the now seemingly undersized fridge revealed a wealth of snacks, barely concealing the several energy drinks still at the back. There was a plate of leftover chicken, some rice, and an array of various lunchbox snacks. Her stomach still complaining, Moxy decided to take the whole plate of chicken, a generous helping of rice, and several of each snack. Her arms full as her stomach was about to be with food, she slammed the fridge door slightly too hard and sat down at the table. <br>\r\n<br>\r\n\"Maaaaan...\" Mozy groaned, wiping the last of the chicken from her face after she had finished enthusiastically tucking in. \"That still wasn't enough... And I've almost emptied the fridge...\" <br>\r\nMoxy's stomach grumbled loudly again, unsatiated as she leant back in her chair. \"I guess more size comes with more appetite,\" she said aloud, still speaking to herself, punctuating the sentence with a burp of such volume that it rattled the window panes. <br>\r\n<i>Speaking of size...</i><br>\r\n<br>\r\nMoxy shoved her chair back, rising from her seat with much caution to avoid breaking anything with her impressive strength. Slightly less carefully she ambled over towards the hallway, where the full length mirror was hung on the wall. As before, she could feel the power behind every footfall, shaking the house slightly each time.<br>\r\n<br>\r\nIn the mirror before Moxy stood a sight that almost took her breath away. Since she had last checked, Moxy must have grown at least another head in height, if not even more. Her body looked even more toned than before, starting to appear downright buff. Her feeble tights were clearly struggling to contain her ever-thickening tree trunk like legs, and her previously baggy and unflattering vacation shirt now hugged her upper half very tightly, almost like a crop top. Beneath the hem of the shirt, Moxy grinned to see a very distinct six pack in place of her once flat and featureless midriff.<br>\r\n<br>\r\nMoxy's arms were becoming equally as impressive, beginning to look very intimidating with the slowly increasing size of her biceps. Even Moxy's face looked brighter and more cheerful than she could ever remember. She ran her slightly meatier hands down her body with a fire rising in her chest, enjoying every curve and ridge. This was like heaven to Moxy.<br>\r\n<br>\r\n\"I suppose I'd better find some new clothes, though,\" Moxy sighs out loud. \"I miss my old dress, and I can't go out like this. I'll draw too much attention.\" <br>\r\n\"On the other hand, I could just hang around here until everyone gets back,\" she pondered, still checking her amazon self out in the mirror. \"Or I could just go out anyway and... Test my strength.\" she muses, with a smile that could chill someone to the core. Pondering her choices, Moxy decides to... </span></div></div>",
            "created":1527740100,
            "id":2500943,
            "title":"Moxy wakes up to yet more growth"
        }
    },
    "info":{
        "author_id":"willum",
        "author_name":"Willum",
        "brief_description":"One girl slowly becomes more and more powerful with each passing day...",
        "created":1322096280,
        "description":"<td align=\"left\" class=\"norm\">Hello, and welcome to the story! This is my attempt at creating a slightly darker growth story as compared to my other, more light-hearted interactives. What you will not find here is a list of characters, as I feel that they're better explained in the story itself, however there are some rules for those wishing to add. But firstly: allow me to give you an outline of the actual story so you know what you are reading.<br>\r\n<br>\r\n<i>The town is Chance Point, a modestly sized place in the middle of England. The date is April 2017. Chance College is a well-known educational establishment on the outskirts of town for youths aged 16-20. Life is pretty much normal in Chance College. There are the usual social groups of nerds, emos, goths, sport players, the popular, the unpopular and many others. But what happens when one day, one particular girl starts becoming slowly more and more powerful? When the only two social groups remaining are predator and prey...?</i><br>\r\n<br>\r\nAs you may have guessed, this is a giantess story. However I wish to write it in such a way that sets it apart from all the others, so here are some rules if you would like to add:<br>\r\n<br>\r\n-The story is supposed to have something of a dark atmosphere, so please do your best to maintain this.<br>\r\n-Usually I like stories with multiple giantesses, but not in this one. The only growing girl is the main character introduced in the first chapter. This is to keep her as the only one with power once she grows. This also means no male giants.<br>\r\n-Go crazy with feet and vore stuff, hard or soft, it's fully permitted here. Feel free to go as graphic with it as you like.<br>\r\n-Sex is OK (such as insertion, etc) but I probably won't write any because I'm not all that good at it. Don't get too obsessive with it, though, and keep it tasteful!<br>\r\n-Please, no weight gain or body part expansion here, although increasing strength is permitted and so is muscle growth to an extent.<br>\r\n-No shrinking, please. This is growth only. 1 inch people VS a 50 ft giantess is just silly.<br>\r\n-Adds must be a reasonable length (at least 4 sentences is an estimate). Try to flesh out choice chapters with a little story if possible.<br>\r\n-Watch your spelling and grammar, please. I will correct any minor mistakes I spot, but illegible chapters will be removed.<br>\r\n-If you want to introduce your own character, please email me first. I'm paying lots of attention to the characters in this story. By this I mean a major recurring character, adding your own minor/temporary character without asking is fine.<br>\r\n-If a storyline appears to be going with slow growth, don't add a chapter like \"Suddenly, she became 50ft tall\". It ruins the flow. On the flipside, if a story appears to be going with fast growth, don't suddenly slow it down. Either is OK, but it has to stay consistent.<br>\r\n-Although this is bascially a giantess story, you don't have to make the main character huge. It's fine for her to stay the same size and simply become stronger and more powerful somehow, or even go mini-giantess (ie 15 feet) and stop growing.<br>\r\n-If you have an idea for a chapter but don't want to add, tell it to me via email and I'll see if I can fit it anywhere! I love hearing other peoples ideas and I won't charge GP or anything.<br>\r\n-Finally, have fun and enjoy the story!<br>\r\n<br>\r\n-Willum<br>\r\n<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":1828005,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1527740100,
        "modified":1527740100,
        "pretty_title":"The Growing Goth"
    }
}