{
    "chapters":{
        "1":{
            "author_id":"dragonbard2372",
            "author_name":"The writing lizard.",
            "choices":[
                "Male-Male",
                "Male-Female",
                "Female-Female",
                "Female-Male"
            ],
            "content":"<div class=\"\"><div> <span>Welcome into the magic of my tome! Within the pages lies a potent spell, which will let you see first-hand the journey of an Arisen.<br>\r\n<br>\r\nWith that said, it would be best if you were able to identify with the Arisen you shall be following. So, choose your Arisen's gender and that of the pawn that serves them.<br>\r\n<br>\r\nAre they...?</span></div></div>",
            "created":1374704280,
            "id":1633655,
            "title":"Identify yourself..."
        },
        "12":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "At the beginning, when the Dragon attacks",
                "Somewhere in the middle.",
                "After defeating the Dragon.",
                "After defeating the Daimon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you are a male, and your Pawn is female. Where in the story shall our tale begin?</span></div></span></div>",
            "created":1374707940,
            "id":1633691,
            "title":"Male-Female"
        },
        "123":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "One of the ladies.",
                "My Pawn of course!",
                "Both!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is your love interest? One of the girls of the series, or perhaps your Pawn itself?</span></div></span></div>",
            "created":1374708060,
            "id":1633693,
            "title":"After defeating the Dragon."
        },
        "1233":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "I'll just stick with the two I have.",
                "I'll add on another girl...",
                "Third option for the win. I get to choose!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Both you say? That would imply you want a harem route. So, you want your Main Pawn(female) as well as a girl from the game. How about multiple girls?</span></div></span></div>",
            "created":1374708360,
            "id":1633696,
            "title":"Both!"
        },
        "12333":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Quina, Selene, Madeline, Aelinore, and Mercedes!",
                "Different set of girls please."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Oh my! So, in this case, which girls are you going to pick alongside your main Pawn?</span></div></span></div>",
            "created":1374708600,
            "id":1633698,
            "title":"Third option for the win. I get to choose!"
        },
        "123331":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "They arrive in Cassardis."
            ],
            "content":"<div class=\"\"><div> <span>The Arisen escaped out of Duke's Demesne, making out to the grain fields in the city. \"That stupid lying Duke!\" He cursed.<br>\r\n<br>\r\nThe Arisen: Leo Godwin, was a individual of medium height, around 5 foot 5 inches with a mop of white-silver hair. His almond brown eyes were piercing and sharp as he hid stopped to catch his breath. His skin wasn't dark like Mason's, but it was olive colored, much like his friend's Mercedes Marten's skin color. His occupation was Strider.<br>\r\n<br>\r\n\"Master!\" Jogged a rather tall and powerful individual, making Leo turn. Heading towards him was his ever faithful Pawn, the one he conjured back at the Encampment, Arza. She was taller than Leo, standing at 6 foot 6 and her legs and arms were ripe with muscle and power, such was one who took the occupation of Fighter. Though there was another thing about his beautiful fair faced blonde-haired blue-eyed pawn.<br>\r\n<br>\r\nShe was...quite chubby. Her large breasts bounced when she ran, and she had a big wide rump and soft tummy, making a perfect pear shape. She was quite able to handle tanking blows and dishing them back, for despite her size she can be quite nimble, nimble as Leo was. Her face was fair and beautiful, even despite all the bulk that was fat and muscle.<br>\r\n<br>\r\nThe two hid in a barn as guards ran past, shouting and yelling orders to find the Arisen for the curse that was set on Duke Edmun, where in reality he lost his boon after making the deal with the Dragon long ago. Without the Dragon alive, Edmun no longer has claim to the realm of Gransys and eternal youth. He is now but a frail and dying old man.<br>\r\n<br>\r\nOh, and insane too.<br>\r\n<br>\r\nLeo looked up at his Pawn, \"We need to head back to Gransys somehow. It's only a matter of time before they find us here in Gran Soren.\"<br>\r\n<br>\r\nArza nodded, agreeing. \"Yes. We should get out of here as soon as we-\"<br>\r\n<br>\r\n\"Arisen!\" The voice made the two jump, Leo reaching for his new Bow he had took from the Dragon and whirled around the door and aimed and he saw...<br>\r\n<br>\r\n\"Mercedes?\" He gasped, eyes wide. The dark skinned slender brunette of a Knight had her hands on her hip, face in concern. Leo lowered his bow. \"Mercedes what are you-\"<br>\r\n<br>\r\n\"Listen to me Arisen...Aelinore sent me a message and told me everything.\"<br>\r\n<br>\r\nAelinore! The Duchess he saved from Edmun's lecherous grasp from the Manse, then saved her once more from the Dragon at the Tainted Mountain. Wasn't she in Cassardis with Selene? \"How did she tell you?\" Asked Leo, he wasn't too keen to trust someone just yet...<br>\r\n<br>\r\n\"Messenger bird. A raven. Listen to me Ser,\" Mercedes inquired, walking up to him. \"We must escape from this place. The Duke maybe dying, but he will do whatever he can to preserve his throne. And since he has no heir...\"<br>\r\n<br>\r\n\"The Kingdom will fall into chaos,\" Arza finished for the knight.<br>\r\n<br>\r\n\"Then we don't need to get out of the city...but the entire realm?\" Leo said, eyes wide with a dark revelation. Mercedes nodded.<br>\r\n<br>\r\n\"It pains me to leave my post...but Arisen...\" The knight's features softened. \"I-\"<br>\r\n<br>\r\n\"Heee-llooo~\" Popped a familiar voice, making them all turn their heads. There leaning on a farm post dressed in a traveling trek yellow dress, possessing a rather curvy physique, long golden blonde hair and an amused and mischevious glint in her eyes, Madeleine sashayed forward. \"From what I hear, seems like you lot are in cahoots with making the Duke look like a rotten prune.\"<br>\r\n<br>\r\nMercedes drew her sword and aimed it at the blonde. \"This has nothing to do with you merchant! Back away and let us be and I shall let you go!\"<br>\r\n<br>\r\n\"Mercedes!\" Leo put a hand on her shoulder. \"It's fine. Leine, did you also hear the tidbit about the kingdom falling to chaos?\"<br>\r\n<br>\r\n\"Ummm...\" Madeleine pointed into the darkened sky. \"I think we're in enough chaos really. But you make for a good argument.\" She walked forward, standing next to the much taller Arza. \"Without a Duke there will be power struggles for who will rule the realm, people will die and naturally, that IS bad for business.\" She gave off a sigh. \"And my shop is really starting to kick off too.\"<br>\r\n<br>\r\nLeo was deep in thought as he heard the two girls bicker and talk, Arza silent as always. Then an idea hit him.<br>\r\n<br>\r\n\"Madeleine. You know how rich I am right?\" He said, making the blonde girl turn her head.<br>\r\n<br>\r\n\"Eh? You? Rich?\"<br>\r\n<br>\r\n\"I have 20 million gold pieces. I can help you restart your-\" He was cut off from the merchant running up and hugging his arm in a vice grip.<br>\r\n<br>\r\n\"Take me with you! Yes yes yes yes!\"<br>\r\n<br>\r\n\"Unhand him you unslightly sow!\"<br>\r\n<br>\r\n\"Look! There they are!\" The group's heads turned, seeing guards draw their swords and run to them.<br>\r\n<br>\r\n\"Arza! Ferrystone!\" The titan of a woman threw him a glowing jewel. \"Mercedes! Madeleine! Hold onto me!\" Madeleine was already doing so, latching onto his arm like a parasite. Mercedes placed a hand on his shoulder.<br>\r\n<br>\r\nLeo threw the Ferrystone into the air...<br>\r\n<br>\r\n'Cassardis!' And there was naught but light.<br>\r\n<br>\r\nAnd they were gone.</span></div></div>",
            "created":1376195640,
            "id":1643919,
            "title":"After the End"
        }
    },
    "info":{
        "author_id":"dragonbard2372",
        "author_name":"The writing lizard.",
        "brief_description":"Wherein the powers of an Arisen can have a rising effect on a girl's waistline...",
        "created":1374704040,
        "description":"<td align=\"left\" class=\"norm\">The powers of an Arisen...<br>\r\n<br>\r\nTruly, it is the Arisen who are not fully understood by the people of this land - their ability to summon familiars, their skills at fighting, and the influence they generally seem to gather.<br>\r\n<br>\r\nWhat is understood is that most of the Arisen meet a terrible end against a Dragon trying to reclaim their souls. But perhaps the greatest mystery of all is how, shall we say, 'fertile' an Arisen can make women in their vicinity.<br>\r\n<br>\r\nFor those who wish to study the Arisen in their entirety, this tome cannot be overlooked. If however, like so many others, you are determined to view them solely by their martial prowess, then put this tome down at once.<br>\r\n<br>\r\nThere are some factors which must be taken into account before one begins reading this tome - First, you will learn through the magic of interaction: you shall do what the Arisen do, feel as they feel, see what they see. Second, is the usual rules jargon before opening this tome...<br>\r\n<br>\r\nNo Scat.<br>\r\nWeight Gains must be realistic.<br>\r\nViolence, blood and sex are allowed, but only if relevant to the storyline.<br>\r\nPregnancy is allowed, but with discretion.<br>\r\n<br>\r\nNow that you have read the legalese, we shall begin. Open the tome and explore what lies within...</td>",
        "id":1944533,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1376195640,
        "modified":1376195640,
        "pretty_title":"Dragon's Dogma Female WG Interactive"
    }
}