{
    "chapters":{
        "1":{
            "author_id":"narutothegiant",
            "author_name":"Daylightgs4449",
            "choices":[
                "She finds him",
                "She explores first",
                "Another giant",
                "Mikado pops out ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Celty is a Japaness women with no head and her crazy boyfriend of a doctor made her helment her new head so so can talk and eat without her phone and see has been called in from shinra her boyfriend to try a new growth formula to scare the police from chasing her and give her transporting her self from one spot to the next. The formula was doing it's best then it kicked in with her clothes growing with her till she broke the ceiling in sucsese. She was at least 110ft tall and she liked it. Shooter/bike drove up her leg and celty grabbed her bike with eace but not wanting to crush it with boyfriend on it. Shinra was scared of hights but if celty was a giantess, he might make a acception eventhough he wanted off. \" hey shinra can you make my bike big so I have something to ride?\" she ask nicely. Shinra froze in her hand shaking and celty plucked him off the bike and into her other hand and said it might be possible to. She knew that he could trust him and set both the bike and him on the ground so they could work. All and all celty enjoyed herself by meeting mikado by the russin sushi eventhought everyone move out of her way. See tap Simon on the back with her knuck and asked if mikado was inside\" he be inside, one sec please?\" celty smiled wilel she tilled her head a little then came out mikado and simon. Scared Simon ran inside and closed the shop early. When the closed sign in Japaness came on celty grabbed mikado and stood tall while smiling and bolted to the docks. Unknown to her she was being fallow by a black rider with thin red lineing. The bike is from America and it was her target but she didn't care at all. She was having fun with mikado in her hand and laughing with joy she felt great. That was until the black rider showed with cat-like helmet but with a train # 4449. The rider the some how was Celtys size in 2 second and then his bike Changed size he then shoved her out of the way when a heat seeking missle came out of no ware but struck the rider in the head and the helmet fell off. Celty then remembered why she was hired. Her target was a giant in disguise. As the helmet rolled away the teen looked at her and she looked at him. \"Shit\" grabbing his helmet and cutting off her leg stance he took off to the country side to hide. \" What the hell is his problem\" said mikado. Just then Celty then remembered that this was her target but without her own bike she ran to the city to find the rider but that was harder than easy. Jest then she herd her bike whin\" shooter is that you?\" said Celty \" look at who can change size, shooter show her please?\" after that shooter was rideable to Celtys size. She yelled. \"Danm shooter you look great!\" jumping on with mikado in her pocket as a wind breaker so he didn't fall out she rode around town and stopped at a inter section to search but couldn't see him any where until he felw passed her and the chase cotinued till they reached America through Russia and Canada. Then the reached Ohio but just as celty was vining grab him he telaported away. Celty came to stop in new philadelphia Ohio and lost the teen </span></div></div>",
            "created":1322966460,
            "id":1234208,
            "title":"Time Travel giantess"
        },
        "11":{
            "author_id":"narutothegiant",
            "author_name":"Daylightgs4449",
            "choices":[
                "Truth ",
                "\" Who Are You \"",
                "Seth and Ian's Talk With Celty",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Celty keeped Mikado on her helmet with facegrad up so he can see for Celty. out of no ware Celty seen the Black rider playing Basketball with two other kids.\" hey Seth pass it here\" \" No, Ian Look.\" Apparently Seth and Ian saw Celty stop on the highway. \"Mikado stay with shooter, i'm going to talk with them and figure out how the know the black rider. </span></div></div>",
            "created":1327358940,
            "id":1264227,
            "title":"Found And Explanion"
        },
        "113":{
            "author_id":"narutothegiant",
            "author_name":"Daylightgs4449",
            "choices":[
                "safe ",
                "under fire",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>not wanting to suprize them, Celty taps ian with her knuckle and got their attenion.<br>\r\n<br>\r\nCelty: Hey, how do you guys know the black rider?\" <br>\r\nSeth: He's me and ians Brother\"<br>\r\nCelty: Whats His name?\"<br>\r\nIan: Chaz\"<br>\r\n<br>\r\nThen out of no ware chaz came in and stole the ball from seth and the game was back on but Chaz never took off his helmet. Celty thought that the Black Biker Jacket and Black Pants(&amp;and black shoes) With Silver Lining, was close to a steam engine lining, then things changed when chaz grew again and moved everyone from the driveway just as a bulit shot off chaz's helmet dropping seth and ian in celtys hands, chaz grabbed his helmet and yanked it off.<br>\r\n<br>\r\nCelty: O..MY..GOD\"<br>\r\nSeth: what the\"<br>\r\nIan: WHOO\"<br>\r\n<br>\r\nWhen chaz took off his helmet ever on was silent, his head was on fire but didnt destroy the skin and his eyes went his eyes the were Nazi Eyes(aka the Nazi Symblo).<br>\r\n<br>\r\nChaz(Distored Voice): Dude Run!!!\"<br>\r\n<br>\r\nAnd they bolted from the house. Chaz Bike grew and he grabbed seth and ian and took off. Celty did the same And Ran off with chaz seth and ian.</span></div></div>",
            "created":1328714040,
            "id":1272842,
            "title":"Seth and Ian's Talk With Celty"
        },
        "1131":{
            "author_id":"narutothegiant",
            "author_name":"Daylightgs4449",
            "choices":[
                "explain",
                "Chaz Runs Away ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Chaz(still distored): you guys ok?\"<br>\r\nOthers: Still Alive\" Hoping off the bike and kneeing on the ground so seth, ian &amp; Mikado Dont have to scream just to hear them.<br>\r\n<br>\r\nCelty: Chaz why is your head on fire unlese...\"<br>\r\nChaz: yeah Im A Dullahan and ulahan.\"<br>\r\n<br>\r\nChaz Wasnt kiding. 2.5 years ago Chaz Was save by a dying Dullahan and He gave Chaz his powers and Chaz avioded Death 500 times and enlisted in the Marine Corps as a undieable commander and he was retunred to the states after he was apointed head Commander and Drill Sargent. After The Planes Touch Down, Chaz was given the Medal Of Steam And Steel. The highest award ever given to a Marine.unknow to Chaz and Celty Dullahans Grow to fight and Protect the people, and the Dullahan could eat people with their heads on but tried to aviod eating a ton of peaple. <br>\r\n<br>\r\nCelty: That would why you save me and mikado but are you german by any means?\"<br>\r\nChaz: Yeah My Ansister, Why\"<br>\r\nCelty: This is going scare you but im your cousion From Ireland, i know your ansisters because they where my parents, before the accident.\"<br>\r\nChaz: Ho...How?\"</span></div></div>",
            "created":1328741640,
            "id":1273086,
            "title":"safe"
        },
        "1133":{
            "author_id":"narutothegiant",
            "author_name":"Daylightgs4449",
            "choices":[
                "Wake up",
                "Explain ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Chaz: Seth, Ian, Celty do you guys know the movie called \" DEAD SNOW \"?\"<br>\r\nAll: no<br>\r\nChaz: it's real. <br>\r\n<br>\r\nFashback:<br>\r\n<br>\r\nChaz: Danm what's with weather. This challenge suck. That's alot guys!!!!!!!!!!!!!!!.\"<br>\r\nJust then a nazi zombie commander walked from the tree line while Chaz stumbled backwards. Chaz closed his eyes expected to die but it never came.<br>\r\n<br>\r\nNZC: ARISE.<br>\r\nGround started to shake as nazi zombies came from the ground. Then the commander shifted Chaz to a siting spot then noticed blood to his waist. Screaming for the nazis 2 of them picked Chaz up and caried Chaz off instead of ripping him up.<br>\r\n<br>\r\nAfter 10 mins of walking they reach a big log cabin and ley Chaz down on a cott.<br>\r\n<br>\r\nNZC: how is he?\" <br>\r\nNZL: he stable for now. We can smell German blood in his vains and he was hunting deer here too. <br>\r\nNZC: good enof I'll stay here to watch the kid everyone have the night off. Have fun.<br>\r\n<br>\r\nThey saluted the nazi way and walked out the door while the commander stayed behind and watch the kid sleep.<br>\r\n<br>\r\n</span></div></div>",
            "created":1331487360,
            "id":1292724,
            "title":"Dead Ground"
        },
        "11332":{
            "author_id":"narutothegiant",
            "author_name":"Daylightgs4449",
            "choices":[
                "NZC: help him men",
                "Hold back"
            ],
            "content":"<div class=\"\"><div> <span>NZC woke up to the door opening and seeing drunk zombies with American beer!<br>\r\nNZC: what none for me. Ugh the kids going to need to change clothes to stay warm.\"<br>\r\n<br>\r\nThe lutenite heard him and ran for his room. He grabbed a new nazi uniform that was never <br>\r\nused or worn. Run to the spare room. They undressed Chaz and slipped on the uniform.<br>\r\nSurprised he did look like a general in that uniform but the kid never woke. Everyone got scared. Just<br>\r\nthen a soldier noticed something on chaz's shirt. On the back it said Amer-nazi. What did that mean. Just then Chaz woke<br>\r\nup in new clothes and not in his.<br>\r\n<br>\r\nChaz: wha where am I and why are their zombies helping me?\"<br>\r\nNZL: we changed alot since the war. Plus we got time Warrener cable!\" <br>\r\nNZP: and I know your grate grandpa.\"<br>\r\nChaz: Fuck! Agh my head, wait medal?\"<br>\r\n<br>\r\nChaz bolted out the door and grew 60 ft tall and had the bodie of<br>\r\na steamer. <br>\r\n<br>\r\nChaz: huh wha Danm it not now! NOT NOWWwwwwwwwwwwwwwwwwww.<br>\r\n<br>\r\nFallen to his knees. Humanoidsteamer grabs his head and let's off a deadly unhuman scream/cry of pain<br>\r\n</span></div></div>",
            "created":1334031840,
            "id":1312619,
            "title":"Explain "
        },
        "14":{
            "author_id":"narutothegiant",
            "author_name":"Daylightgs4449",
            "choices":[
                "Danm he's gone ",
                "He stays ",
                "Other",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Mikado poped out and cralwed up her right arm \" Danm he's gone like take and mo......\" before mikado could finish another giant rolled up to celty. \"You looking for my boyfriend \" Chaz Huprich\" is that right?\" the other giantess asked. \"Yea I wanted to talk to him but he shoved me away from a missel and his helmet fell of. I wanted to thank him but he said shit kicked me down and took off here. Do you know where he is? By the way what's you name?\" \"Ashley jones. Why\" \" just so I could remember you for later. That's all\" \" If you want Chaz you'll have to come with me to his house.\" Celty agreed they had to find Chaz and fast. \"He doesn't stay in one spot for long so we better hurry and tell that horse of a bike to calm down he's driving up a fucking road!\" celty didn't say anything as the giants rode to the hill side. Their they saw Chaz in a train form as the southern pacific/ nazi uniform. Chaz's eyes werent like anything that celty hasn't seen before they rode up the hill side to Chazs spot they saw the bike but no Chaz. Then they saw a hand over the hill side higher then were they were standing. Chaz had fallen asleep and it would take a nucke to wake him up. \"Chaz, celty said to me to tell you.....\" bstore Ashley could finish Chaz woke and didn't want to her anything except the wind against his funnel. Celty slapped him over and over again and again but wouldn't wake up. Chaz was a heavy sleeper and wouldn't buge. Soon Chaz woke up and left them in confusion and toke off for the woods. Celty, Mikado and Ashley stood their in silence. Chaz soon reapered in sight and drove away to the highway in his nomual size. On the way to the school since Chaz and Ashley graduated 1 year ago, Seth and Ian came out to go to school and notied Chaz and went over to talk to him. Chaz's mom wasn't happy with him so Chaz pulled out his desert eagle hand gun and aimed at him mom if she came over and caused Chaz problems. He didn't have time to talk he put his gun away and took of to his job in drug buster program. But half way down the road, celty retuned to normal size but mikado was still on her shoulder and now he was the size of a doll.</span></div></div>",
            "created":1323024540,
            "id":1234539,
            "title":"Danm it round 2"
        },
        "141":{
            "author_id":"narutothegiant",
            "author_name":"Daylightgs4449",
            "choices":[
                "Look for him",
                "Stay down ",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Before they caught up with Chaz he sped off will changing size. Celty was beyond nevus and didn't know what to do now. she and Ashley shrunk down to normal size but Celty was bigger the Ashley And Chaz's Mom. \" So Now What?\" Before Ashley could answer, A Russian , German, japaness and american group of 4 walk around but the German was easy to identify as Dr Maxis helper Dr Edward Richtofen \" O joy more people How Vundfa\" Saying it as a joke. Dempsey was american and understood Nikolai and Takeo but Richtofen was a pain in the ass for a Nazi And laugh crazy day and night but Richtofen had one secret that the group knew. He was a giant Nazi And could grow any time any where. and He grew to help see where Chaz was but Chaz was long gone. As it turned out chaz was part Nazi And American, No one Belived him But on Ansestery.com it proved him right, Chaz Huprich Was a German Nazi. Seth Was yanked by Dempsey as chaz ran by in southern pacific Daylight/Nazi Uniform With An M60 Gun. He Soon Stopped to See Richtofen standing at 100ft tall but chaz Was 150ft tall. so chaz bounced of Edwards Head And Ran to the hill side were he was staying. \" HEY!!!!!!\" Screamed Edward But Chaz Was to Far Way to Hear Him. Nikolai wasnt going to deal with this all day, he tryed to shoot chaz but missed or wouldnt get his attenion. celty tryed to grab him but his eletromagnite braryer prevented that. Nothing was stopping chaz. \" He Wont stop to talk or anything.\" Said Seth \"Celty pick me and ian up please?\" \"Sure\" Grabbing both Seth and ian carefully not to crush them she opened he palm and mikado slid down to them to talk to Chazs Brothers.    </span></div></div>",
            "created":1323101820,
            "id":1235134,
            "title":"Zombie Killers And a Giant Nazi"
        },
        "1411":{
            "author_id":"narutothegiant",
            "author_name":"Daylightgs4449",
            "choices":[
                "Peaceful night",
                " oh GOD!!!!!!",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Celty, Seth &amp; Ian saw Chaz on old steel hill road and wanted to stop him but Ashley took out her brand new motorcycle and took off for Chaz leaving the other confused. \"Chaz were are you?\" it was to quite in the woods. Then see herd a voice and saw the nazi looking for Chaz to\" let me try my German ascent that might help, Vondafa, hiel huprivh, vendrva, vell?\" then out of noware they herd a low growl \" go away you German hitler bastered.\" \" there he is , Chaz it me Ashley and your brothers we just want to talk? Were are you?\" \"Let me be Ashley I want to be alone so beat it!\"<br>\r\n<br>\r\n\"Chaz what's the matter?\" \"Ashley being giant is like a curse you can't get ride of it both of us a bound together until we die but I don't see that happing anytime any soon. So back off and leave ME ALONE!!!!!!!\" not wanting to push any ones luck she let Chaz go into the deep part that only he knew about. Ashley sigh and to take Seth and Ian home for the night but Seth and Ian escaped to go sleep with Chaz. \" suicidal is what their are\" mummed Chaz \" why can't they just leave me alone\" he keeped saying to him self as he change to nazi/daylight to sleep in but he's eyes pick up other foot steps. He stop and armed his guns for an ambuse. Just as Chaz turned around Seth and Ian screamed as his gun were drawn from their hoslter and they looked at each other. \"Danm it guys I thought you were somebody else, go home.\" \" to late now Chaz besides me and Seth wants to stay with you for a night please?\" \"Why should I you guys hate he so forget.\" looking at the sky it was pitch black out and chaz's headlights on top of his head and not the face lights were focused on his young brothers.Laying down his hand he said. \" get on you spend one night with me and that's it. Understand Ian, Seth &amp; and Ashley I know your hiding behind the tree so just come out\" \" Danm it is it the easy to see me.\" \"Only train with heat seakers, come Seth and Ian have school in the morning so thell stay with me alright ashley.\" </span></div></div>",
            "created":1323587220,
            "id":1237869,
            "title":"Look for him"
        },
        "14111":{
            "author_id":"narutothegiant",
            "author_name":"Daylightgs4449",
            "choices":[
                "They make it no problem",
                "Stop along the way"
            ],
            "content":"<div class=\"\"><div> <span>Chaz fell asleep after making sure Seth and Ian were asleep but they fell asleep Chaz chest and they thought it was hard as steel but was soft like his chest. \"Weird Ian metal shouldn't feel like skin right?\" \" he's part nazi and steam train so it could change right\" \" I guess so let's ask Ashley.\" they walked of Chaz and found Ashley reading book or something. Seth spoke up but not to load to wake up Chaz but he had his iPod with him fully charged so they got her attenion. \"Ashley when Chaz changes forms does he get hard or soft when he sleeps?\"  \" why ask now, what's the matter?\" picking them up and while lying down on her back she placed them by he cans infront so they don't fall off.  Before they could answer Chaz walked up with top lights on full blast to see Seth and Ian on Ashley. Before anyone said any thing Chaz smiled and walked back to his camp site. \"weird is that what you guys ment.\" Ashley stood up with Seth and Ian in her hand just as celty woke up from Seth passing her ealier. \"What's going on guys, were the fire?\" celty said as she tried to wake up as best as she can. Ashley spoke up. \"Weres mikado?\" \"Iin my helmet sleeping why.\" opening up her visiors to see mikado sleeping in mid space. \"WOW\" all 3 said at the same time. Beside Celty, Chaz knew about mid space in heads before his nuclear accident that changed Chaz &amp; ashley's life forever. \"So know what?\" said Ian. Celty had an idea \" Ian, shut up and sleep you and Seth have school tomorrow and your mother would kill you if you fell asleep in class so you'll stay with me wi'll Seth stays with Ashley understand!\" Celty swipped Ian from Ashley and fell asleep again but held Ian down with both hands. Ian set his iPod to go off at 4 am so they had time to get ready for school. <br>\r\n<br>\r\n4 came faster than ecpeted and Celty had her phone set for 4 too. She sleeped up by a rock wall and head way tilled side ways. Ian woke up because Celty was drooling all night and his iPod his life savor. Celty felt Ian waking up on her chest and so she set him down so she could get Seth up. Seth was up and ready to go but celty couldn't see very well when she walked right passed him and passed out waking up Ashley but Chaz was gone around 2. Out of no ware Chaz came thundering down through the sky with 50 passenger cars. \"Danm, I thought that Chaz scrapped those years ago?\" said Ashley \"What are they?\" said celty \"Batering passenger, me and Chaz fought in the great iron war 1 1/2 ago and Chaz must have hid the cars away for some reason.\" cab pov-\"Nate you ready for take off\" \" all clear Chaz were ready\" \"Ten-four were fling.\" breaks release, steam hissing hard and pistons pumping and the engine took off for the day to Pearl harbor. Swapping his outfit from Nazi/Daylight to ghost rider. This is the same outfit the Chaz was in when the nuclear meltdown in tokoy Japan happened last year. Wearing 49 on both arms representing the fallen U.S.S Arizona, in all black as when Chaz saw Celty for the first time.\"&lt;Chaz it Nate were ready are you ok bud&gt;?\" \"Wa yeah I'm ok ready for departure Nate.\" But Chaz wasn't sure should he let Ashley pull the train well it to late the station master blew the whistle and Chaz resopnded by blowing his own whistle as he moved out. \"Danm what's wrong with me and the hawaii train?\" said quietly to him self but Nate him and now he was worered.<br>\r\n</span></div></div>",
            "created":1323685200,
            "id":1238415,
            "title":"Peaceful night"
        },
        "141111":{
            "author_id":"narutothegiant",
            "author_name":"Daylightgs4449",
            "choices":[
                "lets talk",
                "Stay put"
            ],
            "content":"<div class=\"\"><div> <span>Noon, guns, ships, trains everywhere.\"California sure is running a lot of stuff right Chaz? Chaz?\" Nate tried to get his attention but chaz was shaking through California. they soon reached Pearl Harbor &amp; chaz let out a long whistle to let them know the stopped at Hawaii. <br>\r\n<br>\r\nWhen chaz decoupled from the train 2 Hawaiian Marines guided chaz to a round house that they built for him to stay at with the New Philadelphia high school marching band. chaz put his train away and walked over to the U.S.S. Arizona Battleship. unknown to the high schoolers chaz had power to raise the dead from any ground. all he has to do is throw a Nazi symbol at the ship and it will become indestructible any ship that is at pearl harbor including The USS Belknap, USS Huprich (same as Arizona), &amp; USS Indianapolis.Throwing one into the gun turret, the Arizona started to rebuild it self in 5 minutes, Belknap Came out of nowhere and chaz Changed his size again and Nate ran up to see the Arizona standing in front of them and was the first ship to walk and talk. But Chaz was a steamer and an ass kicker so he can take down arizona if nessisary. \"Wha... What happened, i saw a missile no two missiles eh am i dead?\" screamed arizona.\"Ah Nope\" Said Chaz while putting Nate on his Shoulder.\" you got luck that they didn't scrap you completely otherwise you wouldn't be eh standing on you eh oh feet.\" finished Nate               </span></div></div>",
            "created":1323730080,
            "id":1238746,
            "title":"They make it no problem"
        }
    },
    "info":{
        "author_id":"narutothegiant",
        "author_name":"Daylightgs4449",
        "brief_description":"Huprichs and durarara interAction as giants/giantess",
        "created":1322957580,
        "description":"<td align=\"left\" class=\"norm\">Japaness durarara celty travel to the united states in search of a boy named \"Chaz Huprich\" and to make him a deal he can't refuse. </td>",
        "id":1830296,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1335391620,
        "modified":1335391620,
        "pretty_title":"Giant marines and Japaness"
    }
}