{
    "chapters":{
        "1":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "Sci-Fi Technology!",
                "Magic!",
                "A Strange Phenomenon!",
                "Aliens!",
                "Something Else Entirely!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay!!! What will be the primary source of the Body-Control nonsense going down in our tale(s)?!?!</span></div></span></div>",
            "created":1534827600,
            "id":2536709,
            "title":"Getting the Ball Rolling!"
        },
        "11":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "Govermental Efforts.",
                "Corporate Shenangians. ",
                "Mad Science or Super Villainy. ",
                "A.I. mishchief. ",
                "Some other cool thing. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>OOoo! High tech shenanigans! What's the source of our enslaving technology?!?!</span></div></span></div>",
            "created":1534827600,
            "id":2536711,
            "title":"Sci-Fi Technology!"
        },
        "111":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "They're \"Improving Society.\"",
                "Espionage and Intelligence Clap-Trap. ",
                "Something Else..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The government?!?! Of course!!! And folks called me a conspiracy nut!!! What kind of underhanded skullduggery are they up to?!?!</span></div></span></div>",
            "created":1534874220,
            "id":2536717,
            "title":"Govermental Efforts."
        },
        "1111":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "A Female. ",
                "A Male. ",
                "Writer's Discretion. "
            ],
            "content":"<div class=\"\"><div> <span>(This is heavily inspired by the series of \"Dolls\" doujinshi/manga of Fan No Hitori. It's a work of fan-fiction intended to be a homage, but is probably more of a rip-off. I claim no ownership of the inspiring works. ;) )<br>\r\n<br>\r\nA few years ago (3-5) a special law was passed in the island nation of Japan. Called \"THE SPECIAL WELFARE LAW,\"  it mandated that citizens would be chosen at random to perform special social and community services. Those chosen are used for what is called, \"sexual relief.\"<br>\r\n<br>\r\nThose chosen are fitted with special high-tech collars. Once slipped on, the collar links and integrates with the wearer's nervous system. In a matter of minutes, it bypasses the subjects conscious control of their physical body. Their minds remain their own, and they're able to think, speak, act, and feel as they normally would, BUT, the collar is able to override their physical actions making them beholden to whims and wishes of others.<br>\r\n<br>\r\nThose \"enlisted\" in the special welfare service lose all of their rights, becoming mere objects and property. They're basically treated as appliances...living sex-dolls. They're packaged in enormous, Barbie-Doll-like packages/boxes that list their names, measurements (breast size, height, weight, ect...), former careers/hobbies/interests and so on and so forth, and sold like any other good or appliance. One bought, the doll's new owner downloads a special app to their smartphone that gives them complete control over their new doll's body and actions. The doll must follow their orders, and their new owner can control their levels of sexual excitement and pleasure, dialing it up and down at their whim.<br>\r\n<br>\r\nThough the law was controversial, it was considered a great success as sex-crimes (prostitution, rape, assault, ect...) became a thing of the past. It quickly became an accepted sacrifice that society had to make for the greater whole. That \"greater good\" argument mitigated most potential protests and complaints, while generous financial compensation to those conscripted's former families and loved ones helped as well. On top of that, statistically, much is made of the fact that one is more likely to get in a car accident or win the lottery, than be chosen to be a special welfare slave. While nearly all women dread the thought of being \"enlisted,\" they're able to comfort themselves by thinking that it's something that happens to other people, and will most likely not impact their own life, whether that's true or not.<br>\r\n<br>\r\nThe program is such a success, that the U.S. is taking the bold step of emulating it. Similar laws have been passed, and deals have been made for the doll/collar technology. Partnered with a Japanese corporation, a new agency, the DEPARTMENT OF SPECIAL WELFARE. A P.R. campaign touting the law and programs success in Japan, and the necessity of it in the U.S. has been going on for months. Small numbers of women, U.S. citizens, have had their rights stripped away. Reduced to the status of property, they're taken into custody, collared, and packaged for sale.<br>\r\n<br>\r\nA series of stores are built across the nation, owned and operated by the Japanese corporation that has the rights to the collar tech, with agents of the Department of Special Welfare on hand monitoring the sales and dispensation. The stores will be called DOLL-MART. Though they haven't opened yet, the nation's men are excited about the prospect of shopping their wares very, very soon.<br>\r\n<br>\r\nWho's our main character?!?!<br>\r\n<br>\r\n</span></div></div>",
            "created":1534874820,
            "id":2536722,
            "title":"They're \"Improving Society.\""
        },
        "11111":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "Young. 18-ish.",
                "In her 20s. ",
                "Older. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old is she?!?</span></div></span></div>",
            "created":1534875060,
            "id":2536724,
            "title":"A Female. "
        },
        "111111":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "A senior schoolgirl.",
                "A criminal delinquent.",
                "She's something else. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So she's on the cusp of adulthood, eh? What kind of youth is she?</span></div></span></div>",
            "created":1534898400,
            "id":2536931,
            "title":"Young. 18-ish."
        },
        "1111111":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "Little Miss Popularity.",
                "A Stellar Student.",
                "An Outcast on the Fringe."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Oooo, a schoolgirl?!?! Splendid. What kind of schoolgirl?</span></div></span></div>",
            "created":1534945140,
            "id":2537276,
            "title":"A senior schoolgirl."
        },
        "111112":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "She's A College Girl.",
                "She's a Young Professional. ",
                "She's Something Else. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where's she stand in society?</span></div></span></div>",
            "created":1534875240,
            "id":2536726,
            "title":"In her 20s. "
        },
        "1111122":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "Later, at Doll-Mart...",
                "Meanwhile...",
                "Well, funny thing..."
            ],
            "content":"<div class=\"\"><div> <span>Jami Song stomped angrily across the parking lot, the narrow heels of her knee-high stiletto boots clicking with each footfall. The gorgeous little Korean-American woman had never really been a morning person anyways, and something had obviously pissed her off and started her off on the wrong foot this morning as well. <br>\r\n<br>\r\nPetite, she was only 5 foot 2, but tended to compensate for her lack of height by wearing preposterously high heels. A life-long fashionista, she paired her black boots with a set of black patterned hose that highlighted the smooth contours of her lovely little legs. The hem of her gray mini-skirt fell high on those lovely hosed legs thighs, it's fabric clinging to curves of her delightful little tush. A tight, thin, green sweater clung to her upper body, showing off her trim little waist and perky little breasts. She'd tossed her expensive, enormous black handbag over her shoulder as she stomped toward the building, her expertly coiffed dark black hair brushing on her shoulders as her head bobbed in time with her cursing. <br>\r\n<br>\r\nAs she stomped into the cubicle-filled office building, passing co-workers did their best to duck out of her sight, or, at the very least not make eye contact. No one wanted to risk the ire of \"Princess Jami\" when she was on the warpath. <br>\r\n<br>\r\nDropping her purse off at her desk on without stopping, she threw her shoulder into the door of her boss's office, before striding inside. Throwing her expertly manicured, painted-green-fingernailed hands on her hips, she stared daggers at Mike Cooper as he sat behind his desk and let out a sigh. <br>\r\n<br>\r\n\"Good morning Ms. Song. I take it something has displeased her majesty this morning?\" the middle-aged, bearded, professorial man asked as he looked at the young woman over the top of his glasses frames. <br>\r\n<br>\r\n\"You're damn right I'm \"displeased.\" You didn't put my video report about the boat-show at the top of the page-feed, OR link my PhoGram site at the top of it!\"<br>\r\n<br>\r\n\"Look, Jami, we're trying to build NowzFeed into a top-tier news and lifestyle update website, and sometimes the social media career of Ms. Jami Song has to take a backseat to other considerations. The boat show was a local event, and if someone wants to track down your \"look at me being pretty\" pictures on your PhoGram site, they can click the link to your author page.\"<br>\r\n<br>\r\n\"You talk like you know the first thing about building a social media presence Mike, but you're living in the past! Hell, my PhoGram account has 3 times the subscribers NowzFeed does! You're not thinking of the synchronicity!\"<br>\r\n<br>\r\n\"I'm not interested in arguing with you about any of this. We don't have the time, and I don't have the inclination!\" Mike was starting to get more than a little annoyed. \"I have a interview and story lined up that's going to be of national interest. Not only will you get prime placement on our page, it's VERY possible you'll get picked up nationally and internationally by the big sites.\"<br>\r\n<br>\r\nJami looked at him skeptically. \"What's the scoop?\"<br>\r\n<br>\r\nMike smiled, knowing he'd baited his hook right. \"Are you familiar with any of this Department of Special Welfare stuff that's been going on?\" Mike knew full well that despite her being in the news and current events business, Jami was usually behind the curve on these things. She was too focused on herself and her career to keep up with that stuff. <br>\r\n<br>\r\n\"It's a community service law or something right? They're copying the Japanese or something?\"<br>\r\n<br>\r\nMike chuckled. \"More or less. The Department is opening one of their new Doll-Mart's in our city. It's due to open it's doors in another month. So far, they, and their Japanese corporate partners have been hush-hush as to how everything is going to work. Only vague press releases and no interviews. WELL, some back-channel communicating has led me to find out that the General Manager of our soon-to-be open Doll-Mart, a Mr. Tanooki, is a fan of yours. He's agreed to an interview, the first one any of these Doll-Mart folks have been willing to grant. Are you up for it?\"<br>\r\n<br>\r\nShe hesitated, but her self-promotional instincts eventually and easily beat-out her anger. \"Fine. I'll do it. BUT, I want you're guarantee I'll be at the top of the headline feed for a week, AND, that you'll put my Pho-Gram link right under the title.\"<br>\r\n<br>\r\nMike shook his head. \"Fine-fine. This story's too big to argue about details, and Tanooki only agreed to the interview if you were the reporter. You've got a deal.\" Mike reached out to shake her hand. <br>\r\n<br>\r\nJami made a point not to reach her own hand out, spinning on her heels and marching out the office door, her nose in the air, a smug grin on her face. \"You're welcome.\"<br>\r\n<br>\r\nJami marched over to her desk, retrieving her big purse. She quickly clicked over to another, smaller cubicle. A bushy-brown haired, bespectacled young man in blue-jeans, sneakers, and a baggy green army surplus jacket snapped too as she approached. \"Oh! Hi Jami!\" He grimaced, catching himself too late, \"I mean, Ms. Song! Sorry!\"<br>\r\n<br>\r\n\"Phil. Get your camera and stuff. I've got an interview at that new Doll-Mart place.\" She looked down her nose at him, always a little disgusted to see how disheveled and disorganized he and his desk were. <br>\r\n<br>\r\n\"The new Doll-Mart?!? Really?!?! They haven't been talking to anyone!\" he was genuinely impressed. <br>\r\n<br>\r\n\"They're not talking to just anyone, they're talking to me. Now, let's get going.\"<br>\r\n<br>\r\nPhil scrambled to gather up his bags and equipment. \"Sure-sure! Uh, am I driving, or...\"<br>\r\n<br>\r\n\"I am NOT riding in your little piece of crap car, Phil, and you are most definitely not going to track anything in to mine! We drive separately.\" Jami marched out of the office and into the parking lot, with Phil struggling to carry all of his gear close behind her. <br>\r\n<br>\r\n</span></div></div>",
            "created":1534878540,
            "id":2536746,
            "title":"She's a Young Professional. "
        },
        "11111221":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "\"Okay, I guess so...\"",
                "\"I think I'd prefer to leave...\"",
                "\"Well...\""
            ],
            "content":"<div class=\"\"><div> <span>Within the hour, Jami was marching from her car towards the yet-to-be-open-for-business Doll-Mart. Having pulled in in his own car just minutes behind her, Phil did his best to catch up with her as he juggled his bags and gear. <br>\r\n<br>\r\n\"Wow, it's distinctive, I'll give them that.\" Phil said as he looked over the large building. It was as large as your run of the mill box-store or IKEA, but it was decorated in pastel shades of pink and purple. It had turrets, gingerbread gables, and architectural accents that put one in mind of a fairy-tale castle conglomerated with a dollhouse. Enormous illuminated letters spelling out DOLL-MART were prominently displayed, as well as a stylized cartoon mascot depicting a Japanese schoolgirl wearing a uniform and a strange collar smiling and waving at the viewer. <br>\r\n<br>\r\n\"It's a hideous color combination. It's more of a twisted Toys-R-Us than some sort of government-affiliated dispensary.\" Jami was clearly not impressed. <br>\r\n<br>\r\nAs the pair neared the front, they could see banners flapping in the wind, each of them festooned with \"Opening Soon!\" and \"Grand Opening!\" in bold lettering. The large automatic doors at the main entrance opened, a pair of beefy men in brown jumpsuits manually parting them so that a small man in a business suit could step outside. <br>\r\n<br>\r\n\"Ahhhh, Ms. Song! I'm delighted to finally make your acquaintance!\" he smiled and clapped his hands as he approached Jami, looking her up and down. He looked to be in his late 60s, with a head a white hair and a thin, almost frail build. <br>\r\n<br>\r\nJami offered him her hand, \"Mr. Tanooki I presume? I'm glad to meet you as well!\" she chirped with her most charming sing-song voice. Tanooki kissed her green-nailed fingers delicately. <br>\r\n<br>\r\n\"You presume correctly! Before we begin, I'd just like to say how much I admire your work. Since stumbling upon your video-news updates and PhoGram account, I've become a devoted fan!\"<br>\r\n<br>\r\nTelling herself that she would be sure to mention his praise of her PhoGram account when next she met Mike, she did her best to blush and act appreciatively demure. \"Please don't, I'm much too modest for such praise!\" Phil snorted, causing Jami to give him a quick angry look silencing him immediately. <br>\r\n<br>\r\n\"Shall we head in? My office is quite comfortable and I'd love to discuss our operation and it's pending grand opening in detail\" Tanooki gave her a wink and offered her his arm. <br>\r\n<br>\r\nLooping her own arm with his, Jami flashed him a smile. \"Lead the way, sir!\"<br>\r\n<br>\r\nSurrounded by several burly men in brown jumpsuits, Tanooki led Jami and Phil into the main foyer of the darkened store. In the poor lighting conditions, Jami and Phil could make out several aisles of shelving with enormous boxes lined up and on display, but couldn't make out any details. <br>\r\n<br>\r\nHeading down a dimly lit side-hallway, the group arrived at Tanooki's office. The jump-suited men waited outside as Tanooki led Jami and Phil inside. The office was well-appointed, but sparsely decorated. Mr. Tanooki seemed to use only the best, but to keep around only what was absolutely necessary. As Phil set up his cameras and recording gear, Jami sat down in a seat opposite Tanooki's across his desk. <br>\r\n<br>\r\nAfter some introductory pleasantries, Jami dug into the interview. \"Now, Mr. Tanooki, as I understand it, you're the most senior representative of your corporation at this location, and will be the head honcho of this particular Doll-Mart location for the foreseeable future?\"<br>\r\n<br>\r\n\"That's quite correct, Ms. Song, to a point. While I will be taking lead in this retail establishment's activities, I will be doing so in partnership and under the guidance of your government's Department of Special Welfare. They will be taking the lead in gathering resources and resupply, and we will be deferring to they, and your laws', wishes.\"<br>\r\n<br>\r\n\"While that may be true, aren't the newly passed laws carbon copies of those originally passed in your country just a few short years ago?<br>\r\n<br>\r\nTanooki chuckled. \"You're special welfare laws were based on the incredibly successful laws Japan passed yes, but they are wholly those of your own nation. We'll follow them to the letter. It's also important to remember that I, and my corporation are NOT representatives of the Japanese government. We've merely entered into an agreement with your government to provide our proprietary technology and expertise in implementing your own special welfare programs.\"<br>\r\n<br>\r\n\"It seems like a lot of effort and infrastructure for a community service program.\" Jami remarked. <br>\r\n<br>\r\nMr. Tanooki looked amused. \"Community service? It's a bit more substantial than that.The sacrifices of a few have almost completely eradicated the problems pertaining to sexual vices, crimes, and health risks. The Doll-making program has led to a healthier, more cohesive society. And, the revenue stream, benefiting the private enterprise of my corporation AND your government through taxation will be just as big a boon to your country as it was to mine.\"<br>\r\n<br>\r\n\"And what exactly are the sacrifices of this doll-making program?\" Jami asked, matter of factly. <br>\r\n<br>\r\nTanooki looked confused for a moment. \"Are you really not aware...I assumed someone in the news industry would have researched this?\"<br>\r\n<br>\r\nJami blushed. She stammered a bit before answering. \"Uh, well, I've looked into the basics. I have a very busy schedule a lot to keep on top  of so..\"<br>\r\n<br>\r\nMr. Tanooki chuckled. \"Of course, of course. You do have a very demanding career. As I told you, I am a fan. I apologize for any slight.\"<br>\r\n<br>\r\nJami tried to recover and project some confidence. \"T-think nothing of it.\"<br>\r\n<br>\r\n\"You're very gracious. Allow me to explain.\" Tanooki stood up, his hands behind his back as he began to pace back and forth behind his desk. \"The social welfare laws seize a statistically insignificant portion of the female population, strip them of their rights, and make them appliances who's sole purpose is to relieve sexual tendencies, cravings, and cravings in order to build a better society.\"<br>\r\n<br>\r\nJami looked confused. \"\"Strip them of their rights...?\" I don't understand? I thought this was some kind of community service program or something?\"<br>\r\n<br>\r\n\"It does serve the community Ms. Song, but it goes beyond mere servitude. For the greater good, a very, very small and carefully selected group of the population is turned into sexual gratification tools. The sale of these dolls generates millions of dollars, AND, the sexual outlet they provide after conversion provides a release valve for society as a whole.\"<br>\r\n<br>\r\nJami looked confused and concerned. \"Objects? This sounds really weird and creepy...\"<br>\r\n<br>\r\n\"Think of it this way, Ms. Song. A greater percentage of the population is lost to auto accidents every year, in both of our countries. The doll program harvests a FAR smaller number of citizens with actual tangible, demonstrable benefits. You look confused and upset. Perhaps if I demonstrate our process, and our wares?\"<br>\r\n<br>\r\nJami slowly stood up before answering.  </span></div></div>",
            "created":1534883940,
            "id":2536791,
            "title":"Later, at Doll-Mart..."
        },
        "111112211":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "Jami gets VERY upset!",
                "Looking over the Dolls.",
                "Meanwhile..."
            ],
            "content":"<div class=\"\"><div> <span>Mr. Tanooki led the way as the trio left his office. Leaning close in behind her, Phil whispered, \"This is getting weird.\" Jami shushed him as she quickened her heel-clicking pace to catch up with Tanooki. The group of brown jumpsuit-clad men took up positions behind the trio, tailing them as they headed down the hall and out into the main retail space of the prospective store. <br>\r\n<br>\r\nSuddenly, the formerly dimmed overhead lighting kicked on with a loud pop, showering the room with illumination. Still following Tanooki, Phil continued to film as Jami looked over the aisles of large pink boxes on display. <br>\r\n<br>\r\nThe aisles consisted of several long lines of short shelving. Arrayed side by side on that shelving, displayed like the product in a box-store, were large neon pink boxes that stood a little over 6 feet tall, being 3-4 feet across and in breadth. The Boxes were decorated with slogans and word balloons,  while the front side facing out into each aisle consisted primarily of a clear vinyl, plastic, or cellophane \"window\" showing the bulk of the interior of each box. <br>\r\n<br>\r\n\"And here we have our Dolls!\" Tanooki proclaimed proudly, gesturing to the nearest aisle. Taking cautious, tentative steps, a slightly hunched Jami approached the nearest box and gazed within. <br>\r\n<br>\r\nIn the window, standing ram-rod straight, arms at her sides, her cowboy boot clad feet pulled together, stood a pretty young woman. She was in a translucent, backing sleeve cut to follow the contours of her body, her arms and legs secured by zip-ties of some kind. <br>\r\n<br>\r\nHer pretty eyes were narrowed, looking as if she were in a trance or half awake, her mouth slightly agape. She had her long brown hair tied off on either side of her head in a pair of perky ponytails. Her long tan legs were well shown-off by her tiny cut-off jean shorts, her mid-riff exposed by a tiny, tight, dull red half t-shirt with the phrase \"YEE-HAW\" written across her chest. She sported a strange, metallic collar or choker around her neck, with the glowing word \"SUSPEND\" in a small display on the front. <br>\r\n<br>\r\nLooking over the writing, Jami read alive in a hushed whisper, \"Mindy Reed- Yee-Haw Cowgirl...19 years old...C-cup...5'5...118 pounds...never pregnant...no stretch marks...\"<br>\r\n<br>\r\n\"Yes, I suspect Mindy will not long linger on our shelves.\" Tanooki grinned.  <br>\r\n<br>\r\n\"Is she asleep or something?\" Jami asked. <br>\r\n<br>\r\n\"The collar has put her in a state of suspended animation. She's unconscious. She'll only be awakened when her new owner receives her and activates the Doll app on his smartphone.\"<br>\r\n<br>\r\n\"Owner?\" Phil sounded startled. <br>\r\n<br>\r\n\"Yes. A Doll is property. The Department of Special Welfare procures them, strips them of their former lives and rights, joins them to their control collars, and prepares them for sale. Any citizen can shop for, and buy a doll, to be used for whatever purposes they choose...excepting doing anything to physically degrade the value of the doll in question. They enter into a contract with my company, who will continue to provide warrantied technical and software assistance for as long as they maintain ownership.\"<br>\r\n<br>\r\n\"D-did these women volunteer for this? Did they know what they are doing?\" Jami asked nervously. <br>\r\n<br>\r\n\"No. Voluntary Dollhood would never allow us to maintain an acceptable level of inventory. All Dolls are drafted into their new status, with them losing all of their previous rights to citizens and individuals, becoming instead, the property of the Department.<br>\r\n<br>\r\nJami felt sick to her stomach. \"This...this is wrong. It's slavery.\"<br>\r\n<br>\r\n\"A slave is a person. These are appliances. Sexual objects. But, they are valuable sexual objects and will be very well taken care of, I can assure you.\" Tanooki answered as he began walking down the line of Doll packages next to Mindy.</span></div></div>",
            "created":1534886640,
            "id":2536819,
            "title":"\"Okay, I guess so...\""
        },
        "1111122112":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "Jami manages to break free!",
                "Tanooki continues.",
                "Phil does something."
            ],
            "content":"<div class=\"\"><div> <span>As Mr. Tanooki walked on, whistling a cheerful little tune. Jami looked over the Doll boxes they passed, taking a look at their occupants and reading the information on their packaging. <br>\r\n<br>\r\nFirst up was Pom-Pom-Paisely Walters, a very cute 18 year old with curly blond hair wearing a fetching little high-school cheerleaders uniform, complete with a pair of pom-poms in her hands. She wore the same trance-like expression Mindy had, with a identical metallic collar shining the word \"SUSPEND\" from it's front display panel. <br>\r\n<br>\r\nNext, she passed tall, very pretty red-head who's box proclaimed she was Trophy-Wife-Tammy-James. The woman wore expensive designer clothes, a white-skirt and a ruffly pink blouse, and pink high heel pumps. She appeared to have had breast augmentation at some point in the past. Jami read that she was 37 and had been an exotic dancer in her youth, and had retired to marry a elderly wealthy man. Her box claimed that she still had a lot of potential, but was discounted due to her being \"slightly used goods.\" She was zip-tied and out of it as well, her collar keeping her unconcious. <br>\r\n<br>\r\nAfter her, Jami looked over Naughty-Officer-Sofia Ruiz, a beautiful young, curvy Latina who's box said she was 22 years old. She was wearing a slutty little police uniform, complete with short shorts, black thigh boots, a badge, a cap, and a utility belt that seemed to have a tool that combined the features of a billy club and a dildo. <br>\r\n<br>\r\nSickened, Jami couldn't look at anymore trance-like faces, and instead looked directly at the ground as she continued to follow Mr. Tanooki. \"How can this be legal?!?! These women have rights?!?!?\"<br>\r\n<br>\r\n\"You're legislation's special social welfare laws make it legal, and confirm that these Dolls have no rights, other than being considered the property of others. You'll see, the benefits far outweigh any silly notions like those you speak of.\"<br>\r\n<br>\r\n\"Are they still themselves?!?! Are they mindless robots now?!?! Zombies?!?!\" Jami was genuinely upset. <br>\r\n<br>\r\n\"Oh no! They still have all of their mental faculties, I can assure you. Their minds need to be intact in order for the collars to work. Granted their conscious motor control is supplanted but they're still themselves, with all of their memories. Of course, their minds are merely icing for the cake, being unnecessary for their new roles.\"<br>\r\n<br>\r\n\"This is monstrous...\" Jami actually felt sick to her stomach. Phil stopped filming, grabbing her arm and attempting to steady her. <br>\r\n<br>\r\n\"I think you're taking this too personally, and not seeing the bigger picture. I have one last thing to show you before out interview is complete. Follow me.\" Tanooki walked toward a big set of swinging doors, a couple of the burly brown jumpsuit-wearing men held them open for him as he passed into a large warehouse at the back of the facility. <br>\r\n<br>\r\nJami shook off Phil's concern, and followed the old man into the warehouse, her boot heels clicking as she did so. <br>\r\n<br>\r\nTanooki stopped, turning to look at Jami. She didn't like the look on his face, and came to a stop herself, with Phil standing a few paces behind her. Jami suddenly felt VERY insecure as she noticed that several of the big burly workers were forming a ring around them. \"What is this?\"<br>\r\n<br>\r\nA short, chubby middle-aged man in a rumpled suit, sporting a comb-over. He carried a hard-copy file of some kind in his hand as he approached and shook hands with Mr. Tanooki. \"Jami, this is Special Agent Oswald Pierce. He's this facility's liaison with the Department of Special Welfare.<br>\r\n<br>\r\nAgent Pierce smiled and opened the folder, reading a document aloud. \"By order of the Federal Government of the United States of America, you, Ms. Jami Song, are hereby informed that you have been seized by the Department of Special Welfare for the good of the nation. You are no longer a citizen of these United States, but rather, are now the property of the aforementioned government.\"<br>\r\n<br>\r\n\"What?!?!?!\" Jami was apoplectic. Before she could do anything further, two of the brown jump-suited men flanked her, grabbing her arms and holding her in place. Glancing over her shoulder, she could see that Phil was similarly being restrained. \"I have rights!!! This is ridiculous!!! I want a lawyer!!! You can't do this!!!\"<br>\r\n<br>\r\n\"Correction, Ms. Song. You HAD rights. Those rights have just been stripped from you. You are now the property of the government, a natural resource to be utilized in any way we see fit.\" Agent Pierce corrected her. <br>\r\n<br>\r\nOne of the men approached Mr. Tanooki, handing him one of the metallic collars. The old man slowly walked toward the struggling, grunting, rapidly panicking Jami. \"There there. You'll be well-cared for and appreciated. You are a very desirable and valuable piece of merchandise, Jami.\"<br>\r\n<br>\r\n\"L-let me go!!! God damn it...get your hands off of...Please!!!\" she grew increasingly desperate, even trying to stomp on the feet of the men restraining her with her high heeled boots to no effect. <br>\r\n<br>\r\nOne of the men grabbed a handful of her hair, pulling her head back as Mr. Tanooki placed the metallic collar around her neck and snapped it shut. </span></div></div>",
            "created":1534888980,
            "id":2536835,
            "title":"Looking over the Dolls."
        },
        "11111221121":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "Phil protests.",
                "Later, at the Grand Opening.",
                "Meanwhile..."
            ],
            "content":"<div class=\"\"><div> <span>One of Jami's wildly stomping booted feet found it's mark, hitting the man on her right's foot! He groaned, releasing her! Losing his balance, he tumbled into the other man, knocking her other arm loose! Pawing at the collar, desperately trying to pry it off of her neck, Jami sprinted as fast as she could on her ridiculously high heels toward the nearest gap in the ring of men surrounding her. <br>\r\n<br>\r\n\"Get off...get off...\" she whimpered as she tried to find a clasp or opening in the collar. Calmly, Mr. Tanooki pulled his smartphone out of his pocket, hit the Doll App's button, and tapped a button marked \"Jami Song.\" In response, Jami shrieked in agony, coming to a stop and nearly falling to the grown as a great wave of fiery, electrified pain washed over her body from the toes on her feet all the way up to the last hairs on her head. The color's display blinked, revealing the word \"SYNCING.\"<br>\r\n<br>\r\nFinally, mercifully, the wave of pain faded, leaving Jami standing there, recovering and struggling to regain her breath. The flashing display replaced \"SYNCING' with \"READY.\" Jami fumbled with the collar once more, trying in vain once more to get the awful thing off of her. \"W-what...please don't...\"<br>\r\n<br>\r\nHitting his phone's app buttons again, Tanooki smiled. \"Please calm down. You're risking damage and a degradation in your value.\" In response to his button strokes, Jami's body shudderd. Seconds later, her legs snapped together, her boots clicking into one another. Her arms dropped to her sides, her posture going absolutely straight as her head is forced to look up and straight ahead. <br>\r\n<br>\r\nJami's brow furrowed in concentration, as she tried to will her body to do as she wanted. In response, she twitched almost imperceptibly, her body now under new management when it came to motor control. \"I DEMAND you release me!\" Jami growled. <br>\r\n<br>\r\n\"Don't be ridiculous. Can a vacuum clean make demands? A printer? An automobile?\" Tanooki sounded genuinely amused. Strolling past her, Tanooki chirped \"Now, follow me.\"<br>\r\n<br>\r\nTo her horror, Jami felt her body spin on it's boot heels, turning to face after Tanooki. Her collar flashed the word \"MARCH\" as her legs began to kick straight out, stomping with great force as she was forced to follow the little old man out of the warehouse and back out into the store-proper. Jami grunted and stammered, trying to get herself to stop as her body marched in a stilted, wooden, almost robotic manner despite her wishes. <br>\r\n<br>\r\n\"Don't worry. Over the next few months as the collar integrates itself more fully with your nervous system you'll be back to moving with much more grace and fluidity.\" Tanooki called back to her over his shoulder. <br>\r\n<br>\r\n\"Phil! Phil!!! Do something! Call the police or something!!\" Jami called over her own shoulder. <br>\r\n<br>\r\nPhil scrambled after her. \"I-I don't think that would help. They're working for the government...I mean this is the law now Jami. Jesus...what are we going to tell Mike...\"<br>\r\n<br>\r\n\"Your boss, Mr. Cooper already knows what's transpiring, young man. When we contacted him to tell him about Ms. Song's impending Dollhood, he was gracious enough to set up this interview as a pretext to getting her here with no fuss or muss.\"<br>\r\n<br>\r\n\"WHAAAAAAAATTTT?!?!?!\" Jami was absolutely livid. \"That son of a...Phil you idiot!!! Do something!!! Anything!!!\"<br>\r\n<br>\r\nPhil looked mortified and ashen. \"I-I'm so sorry...\" he just didn't know what to do as Jami continued marching after Tanooki. <br>\r\n<br>\r\nCutting down an aisle they hadn't been down earlier, Tanooki stopped toward the end, turning to face Jami. She continued her awkward stride before coming to an at-attention stop 4 or 5 feet in front of him. Her collar's display returned to \"READY.\" <br>\r\n<br>\r\n\"Turn, Doll.\" Tanooki chuckled. <br>\r\n<br>\r\nJami's body took a step to the left and turned, spinning her until she was face to face with one of the tall pink Doll boxes. Unlike the others, this one was empty. She read it. \"Jami Song- The Slutty Newsgirl.\" Glancing down, she saw that they had her measurements, age, height, and weight correctly listed. In addition, the box promised that she was ready for love, and that she neglected her love-life due to the demands of her career so she was guaranteed to be fresh and \"tight.\"<br>\r\n<br>\r\nGrowling she glanced toward Tanooki. \"You son of a bitch...you'll never get away with this! If it's the last thing I do I'll make you pay for this!!!\"<br>\r\n<br>\r\nTanooki laughed and gently patted Jami on her fanny. Two of the burly jump-suited men climbed up on either side of the box, opening it's front door. Jami's body stomped forward, stepping up onto the shelf, turning, and slowly backing into the box. Taking up position, Jami grunted, cursed, and growled as the two men secured her limbs and body with zip ties, before closing the front panel and locking her into her package. <br>\r\n<br>\r\n\"It's fortunate that you already dressed in such a pleasingly provocative manner. It streamlined the process rather well.\" Mr. Tanooki smiled, hitting his phone again. Jami's collar flashed \"SUSPEND,\" her facial struggles ceasing as her eyes slipped into an open, dull, trance-like state and her lips slightly parted.<br>\r\n<br>\r\n\"I bet we sell her minutes after opening.\" Mr. Tanooki laughed as he turned and headed back toward his office.  </span></div></div>",
            "created":1534892100,
            "id":2536869,
            "title":"Jami manages to break free!"
        },
        "111112211212":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "Her buyer's home.",
                "A business. ",
                "Somewhere else. "
            ],
            "content":"<div class=\"\"><div> <span>Slightly more than a month passed. As more women were procured and added to the store's inventory and final preparations for the grand opening were made, Jami stood in a completely unaware state of suspended imagination in her personalized Doll package. All of her biological processes ground to a halt, a combination of the collar's control and the Doll Box's integrated systems locking her in a state of unconscious storage. <br>\r\n<br>\r\nCleaning staff periodically dusted her, and the other Dolls' boxes, using cleaner and squeegees to keep the transparent front window clean. Occasionally, a workman or lumbering male employee would stop to admire the young woman. Some even read through her features, doing the mental math to see if they could afford her when the Doll-Mart finally opened for business.<br>\r\n<br>\r\nFinally, on the morning of Doll-Mart's grand opening, the doors were flung open and a massive, clamoring crowd rushed in. While the vast majority of the crowd were excited, horny men of all ages, there were a few curious women amongst the herd of shoppers and gawkers.  <br>\r\n<br>\r\nWhile everyone seemed excitable and cheerful, one shopper looked incredibly desperate and anxious. Phil, Jami's put-upon gear-monkey and photographer had waited all night in line, in the hopes of getting in and purchasing Jami before anyone else. He wasn't interested in making her his living sex-doll. In fact, he was hoping to save her from such a fate due to his failing to stop her being conscripted into being one. <br>\r\n<br>\r\nHis plan was to get to her before anyone else, and, if not outright buy her, to put some money down or get some sort of financing. Sadly, over the course of the month, he'd forgotten exactly what aisle it was her box was located in. Phil rushed from one aisle to the other, looking over countless Dolls in the hopes of spotting Ms. Song before she got scarfed up. <br>\r\n<br>\r\nHe nearly tripped over a cart as an eager shopper and some of the brown jumpsuit-clad employees loaded a fit, pretty young woman in figure hugging (booty shorts...a sports bra) jogging gear, her headphones still on as if she were ready to be turned on to go for a run. <br>\r\n<br>\r\nHis heart skipped a beat as he found an elderly shopper making final arrangements to purchase an Asian-American Doll. Fortunately, Phil quickly figured out it wasn't Jami, but rather was some poor young nurse named Wendy Kim clad in a slutted-up health-care worker's uniform. <br>\r\n<br>\r\nMaking his way through a large knot of shoppers, his heart skipped a beat as he spotted \"Jami Song- Slutty Newsgirl\" written across the top of a Doll Package on the other side. He rushed over. <br>\r\n<br>\r\nUnfortunately, his heart sank as he spotted a sign taped to the front of her container with \"SOLD: ONLINE BUYER.\" He walked over and looked at Jami's slack-jawed, entranced looking face. \"I'm sorry.\" he whispered. Shoulders slumped, Phil slowly headed toward the door and back to work. <br>\r\n<br>\r\nAfter a little while, a pair of burly Doll-Mart employees loaded Jami's pink carrying case up on a cart, and wheeled her toward the loading dock, a packing slip taped to the side. <br>\r\n<br>\r\nLate that afternoon, a U.P.Ex. delivery truck arrived. The driver exchanged paperwork with the dock employees, before walking over and taking a look at Jami in her pink packaging. \"Wow. This is the first one of these I've delivered. So she's really real? Not just a realistic looking doll or robot or something?\"<br>\r\n<br>\r\nThe Doll-Mart employee laughed. \"A little from column A, a little from B. She used to be real, but that little collar basically turns her into a hot little remote control appliance.\"<br>\r\n<br>\r\nThe driver looked Jami over, closely inspecting the gorgeous young woman's rigid, stationary form. \"I think I've got a reason to work overtime now. I have GOT to get me one of these!\" Then men laughed as they wheeled Jami into the back of the delivery truck. <br>\r\n<br>\r\nThe next morning, Jami was delivered to...<br>\r\n<br>\r\n</span></div></div>",
            "created":1534909860,
            "id":2537066,
            "title":"Later, at the Grand Opening."
        },
        "111113":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "In her 30s or 40s. ",
                "In her 40s or 50s",
                "Older?!?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But how old, roughly...?</span></div></span></div>",
            "created":1534898280,
            "id":2536930,
            "title":"Older. "
        },
        "1111131":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "An Accomplished Professional.",
                "A Housewife.",
                "A Teacher."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So we're talking M.I.L.F.'s eh? What manner of M.I.L.F. are we dealing with?</span></div></span></div>",
            "created":1534944960,
            "id":2537275,
            "title":"In her 30s or 40s. "
        },
        "12":{
            "author_id":"jackhalf",
            "author_name":"JackHalf",
            "choices":[
                "Wizardly Spellcraft. ",
                "Demonic Creepiness. ",
                "Mythological Godliness. ",
                "Otherdimensional Menaces. ",
                "Some Other Nonsense!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fantastical magic?!? Cool! What kind of magic?!?</span></div></span></div>",
            "created":1534874040,
            "id":2536713,
            "title":"Magic!"
        }
    },
    "info":{
        "author_id":"jackhalf",
        "author_name":"JackHalf",
        "brief_description":"A cornucopia of Body-Control naughtiness.  ",
        "created":1534873380,
        "description":"<td align=\"left\" class=\"norm\">For the uninitiated, Body-Control is a close relative of Mind-Control. In Body-Control, the subject loses control of their physical body, while their mind remains intact. They can think, speak, and act however they wish, BUT, their control of their own body is overwhelmed by some other force or mind. Their will is sidestepped, reducing them to the status of a passenger in their own body, helpless to do anything but go along for the ride. <br>\r\n<br>\r\nThis interactive story will be a lose collection of anthology of diverging tales. The only rule is that Body-Control is the primary theme or scenario of each branching plot-line. You can feature whatever characters you want, and can do anything with, or to, them that you want. All I ask is that you have fun and get creative with whatever you choose to add! </td>",
        "id":2166787,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1534945140,
        "modified":1534945140,
        "pretty_title":"Body-Control Brouhaha"
    }
}