{
    "chapters":{
        "1":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Greta accidently drops the Marble. Breaking it, swapping heads with her Brother",
                "She buys it and Robert and her go home",
                "Robert buys it and they go home",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>“Hey Robert,’ called out Greta from across the School’s Parking Lot.  ‘Are you done with Cross Country Practice?  I need a ride home.”<br>\r\n<br>\r\nLooking behind him, Robert saw his little sister Greta come running up to him from the direction of the School Gym.  “Yeah, I’m heading home now.  What are you still doing here? I thought Basketball didn’t start until next month.”<br>\r\n<br>\r\nComing to a stop a foot away from her brother, Greta said, “True, but I still wanted to get some practice in with some of the other Varsity players.  So, I can improve my game.”<br>\r\n<br>\r\n“Sounds good. Hop in.  I just need to stop at the store for a few things, okay?” said Robert as he opened the front driver side door of the minivan that his parents got him; threw his gym bag in the back and got in.<br>\r\n<br>\r\n“Fine,” said Greta as she got into the front seat next to her brother.  Putting down her gym bag down at her feet.  <br>\r\n<br>\r\nRobert drove 10 minutes down the road to the local Safeway store and parked near the front of the parking lot.  “Ok, so are you going to wait for me here or going to come in with me?”<br>\r\n<br>\r\n“Na, I’ll step into that shop over there. Mystic Worlds.  I always get a kick out of looking around those type of places.  You never know, I might find something I’m into that I didn’t know I was into,” said Greta, getting out of the car and heading to the shop next to the grocery store.  <br>\r\n<br>\r\n“See ya in a few minutes out here Greta.  Fifteen minutes max.  I’ve got homework to do,” said Robert as he got out of the car walked towards the Grocery store.<br>\r\n<br>\r\nGreta walked into ‘Mystic Worlds’ and started to browse.  The store itself was a basic type of store of its’ kind, filled with figurines of Dragons and fairies and castles to go along with shelves of books from Wiccan to ghost sightings to “Natural” healing.  Nothing caught Greta’s interest.  Making her way back towards the door, Greta passed a table near the corner of the store, when something caught her eye on the table.  Stopping in her tracks, Greta looked down at the table.  Browsing the tabletop she saw many different nick-knacks sitting on the table, but one in particular caught her eye.  It was a white marble shaped item only bigger.   Greta picked it up, it fit snugly in her right hand.  Holding it up to her face Greta saw that there was a neon white glow to it that started to get brighter and brighter.  <br>\r\n“That’s a special one you have there.  One of a kind actually,’ said a female voice behind Greta.  ‘Very powerful.”<br>\r\n<br>\r\nGasping, and almost dropping the marble, Greta turned around to see the store owner standing behind the cash register.  “Oh, I’m sorry.  I didn’t see you there Mrs. Maple.  I was just looking that’s all….”<br>\r\n<br>\r\n“…Greta? Are you still in here? It’s time to go,” said Robert as he walked in through the front door of the store.<br>\r\n</span></div></div>",
            "created":1582434000,
            "id":2791824,
            "title":"The Beginning"
        },
        "11":{
            "author_id":"mumbalo",
            "author_name":"mumbalo",
            "choices":[
                "\"Luckily for you, reality changes to adjust the changes.\"",
                "\"Luckily for you, reality changes to adjust the changes.\" (But not clothes)",
                "\"I can try to help you hide the changes, if you want\"",
                "\"I really don't know, you have to try to find out yourselves\"",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Surprised by her brothers arrival, Greta momentarily lost hold of the smooth marble in her hands. With a shriek, she dropped the priceless artifact, much to Mrs. Maple horror. Using his athletic skills and reflexes, Robert made an attempt to catch the orb and almost in sync with his sisters hand, they missed the fragile item by fractions of a section.<br>\r\n<br>\r\n\"No, get away!\", a panicked Mrs. Maple shouted out to the siblings, but it was already too late for them to react.<br>\r\n<br>\r\nThe glass shattered on the floor and bright flash of light blinded everybody inside the store. Smoke and electricity was in the air, causing all three bystanders to cough. Mrs. Maple managed to hold onto a shelf next to her, despite her temporary blindness, while Robert and Greta both fell down to the floor. Slowly, their vision returned, as they where coughing from the smoke.<br>\r\n<br>\r\nWhile slowly recovering from his coughing fit, Robert noticed how he was facing in a direction, opposite from what he expected. He could have sworn, that he should see the wall at the back of the store, and not the entrance, from where he came. He coughed a last few times, when a slight breeze swept through the room and over his exposed shoulders and bare legs. Confused, he was about to check what happened to his t-shirt, when he suddenly noticed the fist he had coughed into the whole time. The hand was smaller, you could call it almost petite. His fingernails where painted in yellow nail polish, which had already started to wear off. He followed along his now slender and hairless arm, over to shoulders way to slim for young man of his age. A yellow strip that belonged to a striped spaghetti top and another that was connected to a training bra lay over each of his slim shoulders. With a gulp, Robert looked down at himself and saw the rest of what used to be his sisters outfit. The top went far enough to cover the cleavage, a pair of b-cup breasts would be producing, from his perspective though he could see it anyway. Coughing one last time, the weight he was aware of now started to shift. Cold sweat started to collect on his forehead, as his eyes went further down to his jeans shorts, that ended halfway above his smooth knees and the unprotected, hairless legs which where connected to them. His small feet where covered by a pair of beige sandals, inside he could see his cute toes, painted in the same color, his nails where. Still in disbelieve about what he was seeing, he wiggled them inside his new footwear, somewhat amazed by seeing them move. His heartbeat started to rise, and he prepared for his final test. Spreading his legs a little bit further apart, he could already feel the material of his jeans shorts press tighter against his crotch, causing him some unfamiliar sensations. Carefully, he ran his slim fingers along the rough material, confirming his worst fears.<br>\r\n<br>\r\nPanic began to take hold in him, as Robert looked around for his sister. He was not surprised, when he found her in a quite similar condition as himself, but what shocked him was her head. She may have had his body, but her head was still the same! Shoulder length brown hair, blue eyes and a feminine face. Grabbing for his own hair, he felt his regular short hairstyle. Tracing his face, he got the sensation of soft feminine hands gracing his slight stubble.<br>\r\n<br>\r\n\"What the hell just happened?\", he asked, while trying to stand up on his unfamiliar appendages. The slight shifting of weight on his chest made him cringe internally.<br>\r\n\"I- I don't know...\", Greta replied while exploring her hairy arms and flat chest.<br>\r\n<br>\r\n\"Oh my dear children, I'm afraid the orb has swapped your bodies around. These once where very valuable, magical artifacts, made by cruel rulers to extend their own lives. I'm afraid the process is quite irreversible.\", Mrs. Maple explained in a sad voice.<br>\r\n<br>\r\nBy now, Greta managed to stand up as well. Robert wasn't that much taller than her, but from his new body, he still had to look up a little bit. Seeing his sister, with his athletic, manly body from the neck down and then looking down at himself, made his new girly legs weak. His breath got a little more shallow and his heart rate did rise once more. Only it wasn't his heart, it was Greta's. It also were her lungs, he not used to get oxygen from the air. Suddenly he became aware of every minute aspect of his new body. Strange sensations, unfamiliar clothes, his stomach turned upside down, as he thought about all those foreign organs inside him.<br>\r\n<br>\r\n\"What are we going to do now? How can we even go to school like this?\", he asked in a scared tone, while Greta looked down at the floor, feeling like this was all her fault.<br>\r\n</span></div></div>",
            "created":1584853200,
            "id":2805166,
            "title":"Greta accidently drops the Marble. Breaking it,..."
        },
        "111":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Robert Understands, they head out to their new lives",
                "Robert is too stunned still to react...Greta does...",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Luckily for you two, reality changed to fit your new bodies,\"  said Mrs. Maple matter of factly.<br>\r\n<br>\r\n\"What does that mean!?\" asked Robert.  Having to look up at Mrs. Maple, accenting the surrealness he was already feeling.<br>\r\n<br>\r\n\"It means, once you two walk out of the front door to this shop.  The world, and everyone in it, will think you are each other.  Robert, that means that you are now Greta to the world.  Greta, that means you're now Robert to the world.  And once you two walk out that door you will be each other even to me.  The only people who will realize that you two swapped heads will be each other,\" explained Mrs. Maple.<br>\r\n<br>\r\nTears started to come from Greta's eyes, as she continued to embarrassingly look at the ground.  Robert just stared at Mrs. Maple agape, too stunned to say or do anything else.<br>\r\n<br>\r\nIt took several minutes before either sibling could do or say anything.  <br>\r\n<br>\r\n\"I'm...I'm....I'm So Sorry Robert!  I shouldn't of come in here. I've stolen your life.  Will you ever forgive me!?\" whimpered Greta as she turned to face Robert, tears still flowing down her cheeks.  </span></div></div>",
            "created":1584939600,
            "id":2805696,
            "title":"\"Luckily for you, reality changes to adjust..."
        },
        "114":{
            "author_id":"mumbalo",
            "author_name":"mumbalo",
            "choices":[
                "They arrive home, their parents are gone.",
                "They arrive home, their parents are waiting for them.",
                "Some distraction on their way happens."
            ],
            "content":"<div class=\"\"><div> <span>\"I don't know my child. You will have to find that out yourselves. There is no magic left in my shop to rival that of the orb and not much is known about it anyway.\", Mrs. Maple told Robert and Greta.<br>\r\n\"It's not so bad, you know. Your sister is pretty big for a girl, I'm sure you will get your strength back in no time! And you Greta, you are on the basketball team, yes? Just think about what you could do with that height boost you just got!\", she tried to cheer them up.<br>\r\n<br>\r\nMaybe she had a point, Robert thought, ignoring the greater picture in his shocked state. He was way lighter and slimmer than anybody on his team. Combined with his skills an a firm training routine, this could prove to be an advantage! Greta was also kind of blinded by the idea, that she would now tower over bitch Brittany from her team. They both almost forgot for a second, that they swapped genders and everything that was implicated by that.<br>\r\n<br>\r\n\"M-maybe you are right. There might be something good about this mess.\", Robert said, unsure of his own words. He felt like he was just sold a broken pickup truck by some sleazy used car salesman. His words made Greta feel visibly less worse about dropping the marble, so he took at least comfort in that.<br>\r\n<br>\r\nThey both leave Mrs. Maples store and returned back to Roberts car. Both siblings had a weird feeling of helplessness. Not knowing what to do, they decided to drive home. Robert took seat on the driver's side and Greta returned to the passenger seat. Luckily, Robert didn't really need to adjust his mirrors, since he has only lost a few inches in the swap. Subconsciously, he closed the door and grabbed the seat-belt, like he always did. Without thinking too much about it, he buckled himself on, and suddenly found himself with the strap between his sister's former boobs. Really not expecting the sensations, he looked down at himself once again and took the reality of his situation in. Slender, girly body, hairless legs, tiny feet, flat crotch, boobs. His face got red from embarrassment, while he started the car.<br>\r\n<br>\r\n\"I'm sorry.\", Greta told her brother.<br>\r\n\"It doesn't matter, it wasn't really your fault.\", he replied.<br>\r\n<br>\r\nAs they drove, Greta inspected her sports back. To her surprise, it still contained a basketball uniform, only now it was the boy's version. It still had her name stitched on it, so she deducted, that something in reality must have changed. This gave her an idea. Without saying a word, she grabbed her brother's wallet inside the glove compartment. It still had his name and previous body's sex! Looking at the picture, it still had his face, but below that was something similar eery to the sight now sitting beside her. His shoulders were bare and looked slimmer than they should. She could see the beginning of a especially girly dress she used to own a few years back and had to picture her brother wearing it. Not to upset him anymore, since he did seem to take this whole thing in a lot worse than she did, Greta stifled a laughter with all her power.<br>\r\n<br>\r\n</span></div></div>",
            "created":1584939600,
            "id":2805733,
            "title":"\"I really don't know, you have to try t..."
        },
        "1142":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Follow Robert into his room",
                "Follow Greta into her room",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Robert parked the car in the driveway.  Looking at the two cars sitting in front of his car, Robert’s stomach dropped.  Nervously looking over to Greta, he saw concern plastered all over her face.  <br>\r\n<br>\r\nSighing, Robert said, “I guess this it.  We can’t stay out in the car all night.  I just hope mom and dad don’t freak out too badly over this.”<br>\r\n<br>\r\n“I’m not handling this, this whole thing very well Robert.  I’m sitting here with your body below my neck.  What are we going to do!?  Mom and Dad are going to kick us out of the house as Freaks! We’ll be homeless and have to live on the streets,” said Greta in a near panic.  <br>\r\n<br>\r\n“It’s Okay Greta.  We’ll be fine.  I swear it.  I’ll make sure everything will be alright.  But first we have to go inside and get our bearings.  Try to figure out our next move if it comes to that, but I don’t think it will,’ said Robert, opening the car door.  ‘Are you coming?”<br>\r\n<br>\r\nTaking a moment to look at Robert, eyeing him up and down, an uneasy feeling overcame Greta.  That was her body Robert was attached to. Her clothes, her breasts, her female parts. Not Robert’s.  Yet, his head was sitting a-top of her shoulders.  He controlled her hands, her feet, her body.  And it looked like Her body would now be attached to him forever.  Looking down at Robert’s body, her body now, and realized she may be attached to it for the rest of her life too.  Looking back up at Robert, Greta realized he was in the same boat she was.  They would have to get through this together.  That idea made her smile, it was nice to have someone there to support her and know exactly what she was going through.  <br>\r\n<br>\r\nWith a smile, Greta said, “Let’s go inside and get this over with.”<br>\r\n<br>\r\nBoth getting out of the car, they got their gear from the back and walked into the house.  <br>\r\n<br>\r\n“Mom? Dad? Are you two home?” called out Robert from the Foyer, slamming the door behind him.  Throwing his gym bag to the floor, Greta placing hers next to Robert’s.<br>\r\n<br>\r\n“I’m in the kitchen sweetie.  Your dad is working late today.  The closing Manager at the Hardware store called out sick so he has to do a double shift today.  Dinner will be ready in thirty minutes.”<br>\r\n<br>\r\nWalking into the kitchen, dreading his mom’s reaction when she saw him, Robert asked, “What’s for dinner?”<br>\r\n<br>\r\nTurning to him, she said, “We’re having meatloaf, green beans, and corn.  I really like that top Robert.  It fits you so well.  You should wear it more often.  Oh, look, your nail polish is chipping off of your finger nails.  Maybe after dinner I can do your nails.  Have some mother and son time together.  It will give them time to dry before bed and have a fresh coat on for school tomorrow.”<br>\r\n<br>\r\nConfused and shocked at his mother’s reaction, Robert could only say, “Uh, um.  Sure mom, that’ sounds good.”  <br>\r\n<br>\r\nHe walked out of the kitchen.  Not knowing how to react to the fact that his mother talked to him as if him having his sister’s body was nothing out of the ordinary.  Waiting for him at the front door, Greta heard the entire conversation.  Her mouth agape.  <br>\r\n<br>\r\n“I guess we have our answer Greta.  I guess reality changed to suite or new…life,’ said Robert somberly.  ‘I’m, I’m just going to go to my room until dinner.  I just need some time alone to process all that has happened in the past couple of hours.  Are you going to be fine?”<br>\r\n<br>\r\n“Yes, um, yeah. I mean, sure I’ll be fine,’ mumbled Greta.  ‘I guess I’ll just go upstairs to my room too.  A lot has happened today.  I guess I can take time to just process things too.”<br>\r\n<br>\r\nThey both headed up the stairs to their respected rooms.<br>\r\n<br>\r\n</span></div></div>",
            "created":1591116300,
            "id":2844757,
            "title":"They arrive home. Mom is home"
        },
        "11423":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Their Mother",
                "A Mutual Friend",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Robert ran across the finish line.  Outpacing the opposing team’s runner by two steps.  Slowing down, Robert looked up at the timer, he had crossed the finish line at 18 minutes and 37 seconds for the 5k run.  It was a new personal best for him since, last year, him and his sister had switched bodies from the neck down.  He smiled.  He was getting his times down, and quickly.  <br>\r\n<br>\r\nAt first Robert wasn’t too happy about having to rebuild his speed in his sister’s body.  But now, he was glad he stuck with it.  Only thing that was still somewhat annoying was finding the right kind of sports bra to help keep his breasts from bounding wildly around while running.<br>\r\n<br>\r\n“Hey! Great running Robert.  That’s your best time this year,” said a Feminine Voice.<br>\r\n<br>\r\nRobert turned and saw his sister, Greta running up to him.  Her body had filled out, in an athletically masculine way, her tight basketball t-shirt showed signs of her now flat, not yet six-pack, abs and an obviously well-defined male chest and arms.  Her basketball shorts still hiding her male legs before her long legs came out of her shorts at the knees.  She kept her hair long still, down to her shoulders, to accent her very feminine facial features.  It still caught Robert off guard when he wasn’t totally expecting it, but that was becoming few and far between now.  She had grown too.  Her 5’ 11” was a memory of last year, she stood at 6’ 1”.<br>\r\n<br>\r\nShe ran up to Robert and gave him a big hug, lifting him up off of his feet by several inches.  <br>\r\n<br>\r\n“Hey, Watch it Greta.  You’re still stronger than me.  Let me down,” said Robert, ruefully.  In the past year, Robert only grew an inch, becoming 5’ 10”.  He still had to look up at his ‘little sister’.<br>\r\n<br>\r\n“What!? I can’t give my older brother a big hug after a good run like that?’ said Greta, a sly smile beamed out of Greta’s mouth half a second later.  ‘Or are you afraid that you can’t use your Big girls there to try to lure the actual girls over here when I’m giving you a hug?”<br>\r\n<br>\r\nReadjusting his Sports bra, which grew from the B-Cup he started out with a year ago to its current size of C-Cup.  Robert said, “No!  It’s just that you’re strong and sometimes you don’t know your own strength.  Sometimes, I think you don’t remember what’s it’s like to have a female body attached to your head Greta.  And ‘These Girls’ you are talking about are a C-Cup, as if you would know what’s that like.  Last time you had ‘These Girls’ they were a B-Cup.  There is a huge difference between the two I’ll have you know.”<br>\r\n<br>\r\n“Whoa!  I was just trying to have some fun with you.  FYI, I DO remember having them and how guys always use to stare and ogle at them at school,” said Greta.<br>\r\n<br>\r\n“I’m sorry Greta.  It isn’t your fault.  Sometimes, I’m just reminded what I’ve lost.  And it happens at random times.  I would have probably would have said something similar to what you did if I still had that body attached to my head.  Plus, you used to call me ‘big brother’.  Lately, you’ve being calling me ‘older brother’,” said Robert.<br>\r\n<br>\r\n“I have?’ said Greta.  ‘I’m sorry.  I didn’t notice I started doing that.”<br>\r\n<br>\r\n“It’s okay,’ said Robert.  ‘Things are different.  I get that….”<br>\r\n<br>\r\n“Hey Robert! Hey Greta!  What’s up?  That was one Heck of a time to run Robert,” said a voice coming from Robert’s Left and Greta’s Right.<br>\r\n<br>\r\nThey Both looked too see….<br>\r\n</span></div></div>",
            "created":1595311080,
            "id":2872369,
            "title":"A Year Later..."
        },
        "114232":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Follow Robert",
                "Stay with Andrew and Greta",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Seeing Andrew walk up to them, Robert felt his nipples go hard and a feeling of butterflies in his neither regions, Robert felt himself blush.  “Thanks Andrew.  I’m glad you were able to make it.”<br>\r\n<br>\r\n“Of course, Robert.  This was a big meet for you. It got you into Regionals didn’t it?” responded Andrew.<br>\r\n<br>\r\nAndrew and Robert have been friends since middle school, ever since the day at recess when Andrew stepped up to several bullies that were picking on Robert. Andrew was a naturally muscular person and  was several inches shorter than Robert, or at least before the ‘Incident’ as Robert and Greta called it, now Andrew stood at 6’ even, an inch taller than Robert.  It was disconcerting for Robert to have to look slightly up at Andrew at first but it ‘normalized’ for him in the past year.  But Robert still felt the butterflies, making him feel uncomfortable around his Friend.  He felt like his sister’s, now his, body betray what he thought of his friend.  <br>\r\n<br>\r\n“Yes, it did,” said Robert simply.<br>\r\n<br>\r\n“How’s it going Andrew?” said Greta.<br>\r\n<br>\r\n“Great, Greta.  How’s it going with you?  Basketball doing good?” said Andrew.<br>\r\n<br>\r\n“Great actually.  Our team is looking like we’ll be one of the tougher teams in the League.  But the season doesn’t start for another month,” said Greta.<br>\r\n<br>\r\n“I’m sure the other girls on your team get jealous of your size.  How’s it going being the new starting Center of your team,” said Andrew.<br>\r\n<br>\r\n“It’s going good.  A little getting used to but good,” said Greta.<br>\r\n<br>\r\n“It looks like I have to meet up with my coach,’ said Robert, still embarrassed about his body’s reaction to Andrew.  ‘See ya later okay?”<br>\r\n<br>\r\n“See ya,” said Andrew with a smile.<br>\r\n</span></div></div>",
            "created":1601923920,
            "id":2915594,
            "title":"A Mutual Friend"
        },
        "1143":{
            "author_id":"mc123",
            "author_name":"Mc123",
            "choices":[
                "A passerby notice their adnormality",
                "A police car is following them",
                "The car suddenly break down"
            ],
            "content":"<div class=\"\"><div> <span>Robert was driving the car with his new girly body. Greta was sitting in the driver with her new masculine boy. She was feeling guilty about their new changes.<br>\r\n<br>\r\n\"Don't worry Greta. It was an accident. We'll get through.\" Greta said<br>\r\n<br>\r\n\"But we have each other other body forever. How will everyone react?\" Robert said<br>\r\n<br>\r\n\"I don't know. But it couldn't be worst.\"<br>\r\n<br>\r\nAfter saying that, the siblings then find themselves in another situation.</span></div></div>",
            "created":1588309200,
            "id":2828334,
            "title":"Some distraction on their way happens."
        },
        "11433":{
            "author_id":"mumbalo",
            "author_name":"mumbalo",
            "choices":[
                "Talk to Nancy.",
                "Ignore these feelings.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, the car's motor began to make a banging noise and smoke started rising from the hood. Cursing, Robert steered towards the roadside. After turning the motor out, he went outside to look what the damage was.<br>\r\n<br>\r\nAfter popping the hood and taking shaky steps with his sister's legs around to the front of the car, Robert came to the conclusion, that there was not much he could do about it, the motor was fucked. He was just about to clean his yellow manicured and oil-stained hands on his pants, when Greta gave him a stern look. She handed him a napkin from her duffel bag and Robert used that instead.<br>\r\n<br>\r\nJust as luck would have it, Mr. Jenkins came drove around the corner in his towing truck. He was the local mechanic and probably picked his daughter Nancy up from school. He parked his car in front of Robert's and walked towards the two stranded and swapped siblings, his daughter right behind him.<br>\r\n<br>\r\nNancy was about Roberts age, but thanks to the swap swap she now towered a couple of inches over him. She gave him a shy look and her face went red. He noticed her doing that a couple times in class and guessed she might have had a little crush on him. Apparently she still did, as neither her nor her father reacted to his and Greta's condition.<br>\r\n<br>\r\n\"Lucky we were just on our way behind you folks! Doesn't look too good. If I can't fix this, we will have to tow your baby back to the shop\", Mr. Jenkins told Robert.<br>\r\n<br>\r\nIt only took a few minutes for him to decide, until he started to load the car onto his truck. The three kids just stood there slightly awkward, waiting for him to finish. Greta had sat down on the sidewalk, while Robert shifted awkwardly around, still trying to adjust to his new center of gravity.<br>\r\n<br>\r\n\"I like your top, where did you buy it?\", Nancy complimented Robert, looking back down at the pavement afterwards.<br>\r\n\"Thanks... err... my sister gave it to me\", he told her. It wasn't even a lie.<br>\r\n<br>\r\nJust then, Mr. Jenkins came back around.<br>\r\n\"So, we are ready to go, but my truck only has one free seat left. Sorry girl, but I'm gonna need to take your bro here with me for the paperwork. It's his car after all.\", he told them.<br>\r\n\"It's ok, I can call dad to pick me up\", Greta replied and got her phone out.<br>\r\n<br>\r\nMr. Jenkins, Nancy and Robert went to to the tow truck, and one after the other went inside. Robert was still extremely uncomfortable to be under people in his current form, but there was not much of a choice. This day seemed to only get better and better.<br>\r\n<br>\r\nHe was seated on the far right side, getting sandwiched between the door and Nancy. As the drive went on, she seemed to covertly shift nearer and nearer, until they touched their hips and upper thighs against each other. Robert could see Nancy blush, when that happened. The feeling of her soft body against his sister's exposed skin caused something to happen to him too. Goosebumps went over his smooth skin and he instinctively put his hands over his crotch. Instead of a boner however, a feeling like somebody turned on the seat heater came over him. Shocked by the unfamiliarity of those sensations, he began to shift in his seat, only adding to their body contact.<br>\r\n</span></div></div>",
            "created":1588741200,
            "id":2831202,
            "title":"The car suddenly break down"
        },
        "115":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Greta has new memories and doesn't remember her 'old' memories",
                "Greta has new memories but remembers her 'old' memories",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Go to school as what?” asked Robert, looking at Greta blankly.<br>\r\n<br>\r\nLooking down at her brother, she said, “I can’t go to school with your body. What would people say? What would my friends say? Heck, what would mom and dad say about this?”<br>\r\n<br>\r\n“My body? How can you possibly go to school with my body?” asked Robert, obviously confused.  Robert winced, he closed his eyes and moaned pain.<br>\r\n<br>\r\n“Robert, our heads are attached to each other’s body…,” Greta began before she felt a migraine engulf her mind.  Closing her eyes, Greta held her now teenaged boy hand up to her head.<br>\r\n<br>\r\nMoaning in pain, Greta memories started to flash before her eyes.  Her memories of being a toddler flowed as easily as water. Memories of being a child and into her preteen years followed.  Suddenly, with a sharp jolt to her mind, a second set of memories came flooding into her mind.  As before it was her toddler years, followed by her childhood years and straight into her preteen years and early teen years up until that particular moment.  The difference, they were memories of her head attached to her brother’s body and how no one seemed to notice the difference. She was still Greta, 14-year-old female, but with a male body.  Those memories continued to flow in like a wave.  Her other memories of being Greta, the 14-year-old girl with a girl’s body seemed to start to melt away.    The new memories washed over her in a matter of seconds.  Then suddenly her migraine stops.  <br>\r\n<br>\r\nOpening her eyes, Greta looked around. Looking at Robert Greta thought….<br>\r\n</span></div></div>",
            "created":1585112400,
            "id":2807106,
            "title":"Other."
        },
        "12":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "They get home and Greta reads the instructions",
                "Robert Finds out Greta still has the marble",
                "Greta reads the intstuctions on the way home.....something happens",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>“Yeah Rob,’ called out Greta.  ‘I’m over here by Mrs. Maple and the cash register.  I found this marble trinket that looks cool.”<br>\r\n<br>\r\n“Oh cool,’ said Robert as he walked to the back of the store, stopping next to Greta.  ‘It looks like a plain milky white marble to me.  What’s so special about it?”<br>\r\n<br>\r\n“It’s a magical marble young sir,’ said Mrs. Marple.  ‘It’s a very powerful magical item actually.  I probably shouldn’t sell it to someone so young.”<br>\r\n<br>\r\n“Oh! It’s magical? What kind of magic it does it hold?” asked Greta enthusiastically.  <br>\r\n<br>\r\n“Come on Greta.  Let’s go.  It’s obvious she just giving you a Sales Pitch,’ said Robert, rolling his eyes as he turned and walked out the door.  ‘We have to get home Greta.  Come on.”<br>\r\n<br>\r\n“Okay! Give me a sec to put this down,’ yelled Greta towards the door of the shop.  ‘Gosh.  So pushy.”<br>\r\n<br>\r\n“Tell you what Greta,’ said Mrs. Marple lending closer to her so she could whisper.  ‘The marble is on the house. Go ahead take it.  You won’t regret it.  Oh! And before you go.  Here’s instructions on how to use the marble.  The magic contained in it is very powerful and very Permanent.  So be cautious.”<br>\r\n<br>\r\nTaking the piece of paper out of Mrs. Maple’s hand, Greta mouthed,  “Thank you” to her and ran out of the store, placing the marble in her pocket.  <br>\r\n</span></div></div>",
            "created":1585371600,
            "id":2809009,
            "title":"She buys it and Robert and her go home"
        },
        "14":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Greta and Robert switch bodies again",
                "Greta/Robert switch bodies with one or both of their parents",
                "Greta and Robert invite their mutual, Sophomore friend, Hansel",
                "Greta and Robert invite a mutual, Freshman friend, Velma",
                "Greta/Robert switch bodies with their puppy/kitten "
            ],
            "content":"<div class=\"\"><div> <span>Greta turned to the sound of her brother's voice, who was out of her line of sight. \"I'm back here.\" She called. I will be up there in a minute.\" She gazed back white smoke-like substance that danced around within the orb. It reminder her of a crystal ball, but it was smaller and not completely see-through. She turned her attention back to the store owner. \"Mrs. Maple, what is this orb?\" She cupped it with both hands as she walked toward the front of the store. <br>\r\n<br>\r\nThe old lady smiled, \"That is a very precious artifact. If you ever wanted to know what it was like to 'be in another's shoes', this is what you would want to buy.\" <br>\r\n<br>\r\n\"Greta... you're buying that old thing.\" Robert shakes his head as he approaches his sister. \"It looks like a faulty crystal ball. Let me see it.\" He reached out and palmed the topside of the orb. Instantaneously, the orb glowed brightly. <br>\r\n<br>\r\nGreta felt the marble buzzing with power in the palm of her hands. Her fingers began to glow with the same white light as the orb. The glow, the energy seemed to travel through her hands and into the rest of her body, causing her whole form to glow purple. She noticed that the same seemed to be happening to her brother, who now glowed like a sparkling, silver ghost. <br>\r\n<br>\r\nThe mist within the orb began to spin faster, and faster. As the cloudy substance rotated with great speed, Greta felt herself being pulled into the orb. No, her light was being pulled into the orb. She was not sure how, but she felt herself, as the glow, being sucked into the orb. Greta began to panic, but her body was paralyzed, unable to move. Inside the orb, she felt her brother's presence. He was also inside. \"What's going on!\" each spoke to the other, without mouths. They spoke with thoughts, a strange concept. <br>\r\n<br>\r\nA moment later, Greta felt herself being pushed, forced out of the orb. She wondered if toothpaste felt like this, being squeezed outward. Her 'light' flowed outward from the orb, and then all at once the glow faded. Greta was breathing heavily as she stared at the orb, her hand gripping the top of it. She blinked, her brain slow to process what had happened to her. But she knew that something was off. She looked past the orb, and saw herself. \"What?\" She spoke, but her voice was not hers. She let go of the orb, and looked at her hands. They were larger and harrier, with short, trimmed nails. Greta knew immediately that these were her brother's hands.<br>\r\n<br>\r\nShe looked back at her body. She recognized the same panicked, confused look on herself. \"Robert... is that you?\" She asked in her brother's voice.<br>\r\n<br>\r\nRobert, inside her body, screamed, dropping the orb. Something told Greta, to not let the orb break. With reflexes, quicker than she remembered, she caught the orb, just before it would hit the hard tile floor. Cautiously, she cupped it with both hands and turned to store owner. \"What did you do?\" <br>\r\n<br>\r\n\"I did nothing, dear.\" Mrs. Maple commented. \"The orb did all the work, just like I said it would. You are now in each other's shoes... literally.\" <br>\r\n<br>\r\n\"How is this possible?\" Robert, in Greta's body, asked. She was staring at her hands. \"How do we undo this?\"<br>\r\n<br>\r\n\"Well dear, if the orb had fallen onto the floor... there would be no undoing this.\" Mrs. Maple scolded. \"But since your... sister,\" She paused seemingly unsure if that was the correct noun to use. \"...your previous sister... caught the orb, switching back is easy enough. Both of you need to simply hold onto the orb again. Be careful not to drop it.\" <br>\r\n<br>\r\nFollowing the old store keeper's directions, Greta, in Robert's body, cupped the orb while Robert, in Greta's body, touched the top. The contents within the orb immediately began to spin. Now that Greta knew what to expect, the process seemed to happen faster. She was pulled back into the orb and then pushed out. She now stood, looking at her brother's body. Her hands were over the top half of the orb. <br>\r\n<br>\r\nRobert pulled the orb away, cupping it with both hands carefully. \"Wow, that was... crazy.\" <br>\r\n<br>\r\n\"More like freaky.\" Greta smiled. \"And its not even Friday.\" <br>\r\n<br>\r\n\"Now that things are back to how they were... do you plan on purchasing something? The orb perhaps?\" Mrs. Maple asked.<br>\r\n<br>\r\nGreta looked towards her brother, and an understanding seemed to pass between them. She then turned to the store owner. \"So the orb can switch people's bodies? Is there anything else about it?\"<br>\r\n<br>\r\nMrs. Maple smiled, \"No dear. The purpose of the orb is for two people to experience the other's life. I will restate though, this is one of kind. All of the other orbs were lost to time. If it breaks, nothing else can reverse a switch.\" <br>\r\n<br>\r\n\"Okay, so we need to be really careful, like holding the orb only over carpet or the sofa.\" Robert smirked. He then peaked at the orb between his fingers. \"We should get it.\" <br>\r\n<br>\r\nAfter a few minutes, Greta and her brother left the Mystic Worlds store with the orb, and a soft interior, clam-like case to contain it. Neither knew of the store owner had purposefully overcharged, or undercharged it, since this was the first magical object they had purchased. But in either case, both had to cough up quite a bit of their saved funds to buy it. Robert parked his car in front of their house, and they eagerly walked inside the house.</span></div></div>",
            "created":1584766800,
            "id":2804735,
            "title":"Learning of the Switcheroo Orb"
        },
        "143":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "The orb breaks while Robert and Hansel were switched",
                "While switching back, Greta pushes one of their bodies away from the orb",
                "The three decide to use the orb while all three touch it"
            ],
            "content":"<div class=\"\"><div> <span>Robert smiled as he closed the front door, his sister having entered the house a head of him. His parents typically parked in the driveway, as the garage was cluttered with boxes, and only one car was parked in the drive way. He checked his phone, which notified him of one new message. \"Date night tonight!\" Robert read the text aloud for his sister. \"Will be back late. Leftovers are in the fridge. Smiley-face. Heart.\" <br>\r\n<br>\r\n\"That couldn't have worked out any better.\" Greta grinned. \"Gives us plenty of time to experiment with the Switcheroo Orb.\"<br>\r\n<br>\r\n\"What did you call it?\" Robert asked.<br>\r\n<br>\r\n\"The Switheroo Orb. Mrs. Maple never said what it was called, so I named it.\" She explained cheerfully. <br>\r\n<br>\r\n\"I guess that works.\" Robert pondered the name for a moment but decided that he like it. He then commented abruptly, \"We should invite Hansel over.\"<br>\r\n<br>\r\n\"What? Why?\" Hansel questioned as she turned her head slightly away. <br>\r\n<br>\r\nRobert smiled as his sister's cheeks turned a slight shade of red. Hansel was a mutual friend of theirs and a 10th grade student at their high school, the grade in between his and his sister's. Robert had met Hansel back in elementary school, and they became fast friends despite the slight difference in their grade level. Back then, the three of them often rode dirt bikes, played video games, or other activities together. As they grew up, Hansel continued to be close friends with both of the siblings, but more recently, he knew his sister had formed an infatuation with their good friend, hence the rosy red cheeks when he mentioned inviting Hansel over. <br>\r\n<br>\r\n\"We have to include some others in this. It won't be anything interesting if it is just us two.\" Robert reasoned. His sister acknowledged his point, and he quickly pulled out his phone again to call their friend. After not-so-patiently waiting for Hansel to arrive, he and his sister enthusiastically greeted him as he opened the front door. Hansel was slightly taller than him, roughly an inch or two. But, he also had a lean build, having spent the last two years in the high school's swim team. He smelled faintly of chlorine. <br>\r\n<br>\r\n\"Dude, this is incredible.\" Robert began as he lead Hansel and Greta into the living room. The room was spacious, with a soft white carpet, two couches, and an dark oak coffee table. The carpet was soft, perfect in case the orb accidentally fell from someone's hands. <br>\r\n<br>\r\n\"What is so incredible that I had to rush over here?\" Hansel questioned. <br>\r\n<br>\r\n\"This.\" Greta slowly opened the case containing the Switcheroo orb. <br>\r\n<br>\r\n\"That looks like a... foggy crystal ball?\" Hansel guessed. \"Are we having a seance? I'm down.\" <br>\r\n<br>\r\n\"Not quite.\" Robert said as he carefully removed the orb from the clam-like chest, cradling it in his hands. \"Touch the top of the orb, and tell me what you think?\"<br>\r\n<br>\r\nHansel had a puzzled look on his face as he stared from one sibling to the other. \"Okay...\" He said as he placed a hand over the orb. <br>\r\n<br>\r\nImmediately, the smoke-like substance in the orb began to spin. Robert smiled as his soul, or essence, began to glow in a silver light, and as he looked at his friend, Hansel seemed to glow in a strange steel grey color. He wondered for a moment, why he and his friend both glowed in similar colors, and why his sister was a purple. He lost his train of thought when he felt himself, his soul, being pulled into the orb. He rotated around, feeling the presence of his scare friend. A moment later, he was expelled. He blinked a couple of times, watching as his original body, currently being inhabited by Hansel, fearfully looked at him. <br>\r\n<br>\r\nThe orb fell from his original, Hansel's, hands. Greta was quick to catch it, having been prepared for the orb to fall. \"Its such a strange feeling, right?\" She asked.<br>\r\n<br>\r\n\"What the hell just happened?\" Hansel, in Robert's body questioned. \"Am I... Did we switch bodies?\" He looked at his original body, currently being occupied by Robert.</span></div></div>",
            "created":1585198800,
            "id":2807837,
            "title":"Switcheroo Orb: Hansel and Robert Exchange Bodies"
        },
        "1432":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Robert and Hansel are stuck in the orb together",
                "Robert and Hansel are both expelled into Robert's body",
                "The orb begins to absorb Robert's body"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah! The orb actually swaps people's bodies.\" Robert exclaimed, though the sound of his voice, Hansel's voice, made him pause. Even though he knew what the orb was going to do, switching into his best friend's body was still surreal. He looked at his hands, his friend's body's hands, turning them around slowly. \"Its pretty freak, right?\" He walked over to the mirror hung on the far wall of the living room. His reflection was that of Hansel's body. Then, Hansel walked up beside him. Standing beside his original body, and seeing someone else 'drive' it made chills run down Robert's spine. <br>\r\n<br>\r\nRobert watched as Hansel pressed a hand on the mirror, as if it were some elaborate prank. \"We really are in each other's bodies. Where did you...\" <br>\r\n<br>\r\n\"From Mystic Worlds\" Robert answered, knowing his friend knew of the little shop by the grocery store. Mrs. Maple had set up shop a year ago, but Robert never understood why. It had the appearance of an antique store, and he did not understand who in their small town would actually shop there. Obviously, she had more to sell than simple old trinkets. \"Greta is actually the one you can thank. She found the orb, and nearly scared the shit out of us.\" <br>\r\n<br>\r\nHansel turned around quickly to look at Greta. \"You and him... me, no... his body.\" he stammered, seemingly having difficulty coming up with the right words. <br>\r\n<br>\r\n\"Yeah, my brother and I switched bodies by accident.\" Greta clarified. \"Trust me, it was very awkward experience, but it is easily fixed. All you have to do is touch the orb again.\" <br>\r\n<br>\r\n\"Like this...\" He reached for the orb in Hansel's hand, but Greta, quick on her feet, stepped back.<br>\r\n<br>\r\n\"If you wanted to switch bodies with me, then yeah. But, I'd prefer not to be in his body again.\" She stated, matter of factly. <br>\r\n<br>\r\n\"Yeah, because I am sure you would want to 'experience' this one.\" Robert teased.<br>\r\n<br>\r\nGreta immediately turned red, \"No...\" <br>\r\n<br>\r\nHansel looked between them, clearly clueless of Greta's crush on him. \"Um... do you want to fill me in?\"<br>\r\n<br>\r\n\"How about you guys just switch back? I would like to have my brother, as my brother.\" Greta stated, having difficulty looking at either Robert or Hansel. <br>\r\n<br>\r\n\"But why, we just switched places?\" Hansel questioned. \"You guys wanted to experiment right? There must be more that the orb can do than just switch people's bodies. What if there was only one body touching the orb after both people were pulled inside?\" <br>\r\n<br>\r\n\"Huh, I wonder what would happen.\" Robert thought about the swirling cloud within the orb. For a few moments with each switch, he was inside the orb, not inside any body. \"Lets do it.\" <br>\r\n<br>\r\nDespite Greta's complaining, she agreed to help with their little experiment. It was decided that Hansel, in Robert's body, would hold the orb while Robert, in Hansel's body, would touch the orb with one hand. Greta would then push Hansel's body's hand off of the orb once both were pulled inside of it. <br>\r\n<br>\r\nWith everyone in agreement, they started the process. Robert felt himself being pulled into the orb, immediately after placing a hand on top. Separated from Hansel's body, he watched from inside as Greta grabbed their friend's arm, yanking it away from the orb.</span></div></div>",
            "created":1585198800,
            "id":2807925,
            "title":"Switcheroo Orb: What Else Can It Do?"
        },
        "14323":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Robert and Hansel awake inside identical bodies (Identical Twins)",
                "Robert and Hansel awake inside a single body (Conjoined Twins)"
            ],
            "content":"<div class=\"\"><div> <span>It was on this day that Robert, Greta, and Hansel all learned never to experiment with magical artifacts, for the result is rarely beneficial for the individuals involved. Magical objects, like the orb, are created for one purpose in mind, and unexpected consequences can occur when the magic is interrupted. Robert and Hansel were going to learn this lesson first hand. <br>\r\n<br>\r\nRobert's hands continued to cup the orb while Hansel's arm was pulled away. Robert felt his soul being expelled from the orb and into his body, and not unexpectedly, he sensed friend also being pushed into his body as well. He figured that since only his body was in contact with the relic, it only made since that it would try to put both of them into one body. 'Guess Hansel and I are going to be closer friends for a bit.' he thought to himself. <br>\r\n<br>\r\nAs the orb pushed himself and his friend into his body, he felt a growing resistance of sorts. The only way he could describe it was being cramped. His body felt cramped. Robert realized with dread that his body, perhaps all bodies, could only house one soul. Despite the uncomfortable resistance, the orb seemed to push harder, forcing his and Hansel's souls into the too small confines of his body. His body begin to convulse. <br>\r\n<br>\r\n\"Robert... Hansel...\" He heard his sister call their names, her voice in a panic. \"What is happening?\" <br>\r\n<br>\r\nRobert tried to speak, but only garbled noises came out. He realized that Hansel was also trying to talk, and his mouth could not form the words that either was trying to convey. Sweat began to drip from his forehead and from his armpits. His palms grew clammy. The veins in his arm began to grow dark, as if suddenly filled with lead. \"Am I dying!' Robert panicked. <br>\r\n<br>\r\nAs if to answer, the contents within the orb began to spin and glow brighter than before. Robert felt himself and Hansel being pulled back into the safety of the orb. But his body continued to to be wracked with some unknown symptoms. Steam began to lift from his shoulders. His skin seemed to vibrate and move like individual grains of sand. <br>\r\n<br>\r\nGreta, probably in a panic as well, placed Hansel's hand back onto the orb. Robert felt himself and Hansel being pushed, expelled like toothpaste from a tube, into Hansel's body. But the same thing began to occur. Hansel's body began to convulse, and then his veins became dark. Robert and his friend found their souls back inside the orb and watched in horror as their bodies began to disintegrate before their very eyes. <br>\r\n<br>\r\nThe orb not levitated into the air, no longer being held aloft by Robert's hands. Like a small sun, the particles that made up Robert's and Hansel's bodies began to orbit around the relic, creating a thick ring of sorts. Whatever magic was occurring, seemed to be taking its toll on the orb. Robert panicked from within the relic as cracks began to appear over the surface. If the orb shattered, Robert did not want to find out what would happen to himself or Hansel if they were still contained within.<br>\r\n<br>\r\nMiraculously as if the sand had a mind of its own, it began to take shape. The particles, in a stream, left orbit around the orb and began to form, legs, arms, a torso. Robert realized that they were forming into a body. He smiled, though he had not face yet. He and Hansel would not die within their current prison. It was forming them bodies. Robert did not care what his body looked like, so long as he and Hansel were able to escape for the orb broke into pieces. As if reading his mind, Robert felt himself being expelled from the orb. The world became dark as his soul passed into the still forming body. But just before he lost all sense of what was going on in the outside world, he knew the orb had shattered. </span></div></div>",
            "created":1585371600,
            "id":2809131,
            "title":"Switcheroo Orb: Learning the Hard Way"
        },
        "143232":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Greta leaves to ask Mrs. Maple for assistance",
                "Robert and Hansel explore their combined body"
            ],
            "content":"<div class=\"\"><div> <span>\"Robert... Hansel... Robert...\" a voice called, sounding a lot like his sister. Her tone indicated concern about something, but Robert's foggy brain could not reason why. At the sound of his name being repeated, he slowly awoke. He tried to sit up, but an unusual weight to his left kept him pinned down. <br>\r\n<br>\r\n\"Greta...\" he whispered groggily. <br>\r\n<br>\r\n\"Yeah... Are you Robert or Hansel?\" she asked.<br>\r\n<br>\r\n\"Of course its me.\" The questions sounded preposterous to him, until the events that had just occurred began to flood his mind. He remembered being in the orb, his body and Hansel's body disintegrating, and the orb forming something new. He assumed that the orb remade their bodies, but they may not have been placed back into the correct ones. \"Right... its Robert.\" he answered, though he became aware that the sound of his voice was off. It did not sound like himself, and he wondered if he was placed into Hansel's body. <br>\r\n<br>\r\nIgnoring the strangeness of his voice for now, he focused his eyes ahead of himself, realizing that he was lying on the carpet of his living room and staring at the ceiling. His bare ass was touching the carpet, and he had a blanket over himself, probably from Greta. He reasoned that his new body must have been naked, and his sister hastily covered him up. <br>\r\n<br>\r\nGreta walked into his view, concern clearly etched on her face. \"I'm glad your okay Robert.\" Her tone of voice seemed to indicate that he did not look okay though. <br>\r\n<br>\r\n\"I'm... is okay too. Thanks for asking.\" an unfamiliar voice spoke up beside him.<br>\r\n<br>\r\nRobert rotated his head to the left and was surprised to see another boy, lying close beside him, looking upwards at his sister. He did not recognize him, but he figured that it must be his friend. \"Hansel?\" he asked, to confirm his suspicion. <br>\r\n<br>\r\nThe other boy turned at the sound of his name. \"Robert? Is that you?\" <br>\r\n<br>\r\n\"Yeah...\" He answered, his cloudy mind working to process what had occurred. Hansel clearly did not recognize him, and he did not recognize his friend's face. But as he looked at his friend's confused face, Robert felt like he should know that face. His friend's new face seemed familiar and not at the same time. \"So... I guess we got two totally new bodies from the little accident.\" Robert reasoned aloud. <br>\r\n<br>\r\nHe noticed his sister make a pained expression after he spoke, which concerned him. \"What?\" he and Hansel asked in eerie tandem. He and Hansel turned to look at each other, seemingly studying each other's face. \"Are we twins now?\" They asked in tandem again.<br>\r\n<br>\r\nDespite the situation, Robert smiled. He found the idea of having Hansel as a twin, or himself being Hansel's twin, interesting. Why Hansel looked familiar, and yet not would make since if the orb mixed up their features. It was defiantly not the worst thing that could have happened. <br>\r\n<br>\r\nBut, something nagged at his brain, that he and Hansel were not just identical in appearance. His skeptical side asked, 'Why were they under the same blanket?' He would answer himself, 'Because they fell beside each other after the orb created them new bodies.' His skeptical side followed up, 'Why were you having difficulty sitting up then?' He would answer himself, 'Because Hansel must have fallen on top of him.' His answer seemed reasonable enough, and it would account for why his left arm and leg felt numb. The weight of his friend's body was slowing the circulation to his limbs. <br>\r\n<br>\r\nRobert looked at his friend again. He realized that Hansel's head was not positioned in a way for him to be lying on top of him. It was more like he was lying directly beside him, flat on the carpet. Robert pressed his right hand and foot into the carpet and pulled. He felt like he was dragging his half-limp body, but Hanel's head seemed to move with him, staying just as near to him. His friend was uncomfortably close, about half a shoulder length away. <br>\r\n<br>\r\n\"Why are you dragging me?\" Hansel complained.<br>\r\n<br>\r\n\"I'm not dragging you, I'm dragging me.\" Robert replied. A moment later, he felt himself being jerked to the left, but it felt different than someone simply pulling his arm. It was like his torso was being pulled from the inside, as if half of his muscles tried to pull him in the opposite direction. He knew that something was very wrong, and his friend's expression mirrored how he felt. <br>\r\n<br>\r\nRobert pressed his elbow into the carpet and tried to raise his torso off of the carpet again. This time, the extra weight to his left was lessoned, as if some other force was pushing his torso up as well. As his torso rose, the blanket fell off his chest, and Robert had to stifle a scream. There was only one body under the blanket. With his gaze, he followed the outline of two legs from under the blanket, to his unfamiliar, toned stomach. His gaze continued upward to his chest, to a second neck, and then to his friend's head. The orb had not given them their own bodies, only one. \"No... way...\" he whispered. He and Hansel were sharing a single, combined body. <br>\r\n<br>\r\nHe slowly raised his hand into his view, examining it. His arm was different, unfamiliar, but it was his. As he looked toward what should have been his left arm, he had no feeling of it. Despite the left arm being attached to the same body as him, he could not control it. He realized that the sensations of his body seemed to stop half-way across his chest. He watched as what should have been his left arm clench and unclench the fingers. Hansel was moving it, not himself. Robert looked at Hansel, just has his friend turned to look at him. They stared at each other for a few long moments. Unceremoniously, he and his friend stated in tandem, \"Shit!\"</span></div></div>",
            "created":1585630800,
            "id":2811137,
            "title":"Switcheroo Orb: One Two-Headed Body"
        },
        "1432321":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Perspective Change: Greta seeks Mrs. Maple for help",
                "Robert and Hansel explore their body"
            ],
            "content":"<div class=\"\"><div> <span>Robert flinched when he and Hansel spoke at the same time, in eerie stereo. He tried to pull away, to get more room between himself and his friend, and seemingly, Hansel had the same idea in mind. He felt the muscles in his chest and abdomen be pulled uncomfortably taught, like the center of their chest was the rope in a game of tug of war. He moved no further away from his friend. Robert stopped his attempt, nearly as soon as he started. <br>\r\n<br>\r\nHis eyes gaze back at his unfamiliar chest. \"What the hell happened to us?\" His brain was having a difficult time processing what he saw, what he felt. It was a strange experience being within someone else’s body, but this was something else entirely. He felt his chest, or at least his half of it, raise from an unsteady breathe by his friend. He could feel the air enter his lungs. <br>\r\n<br>\r\nOut of the corner of his eye, he saw Hansel look towards Greta. His friend's voice came out, like a whimper, \"How do we fix this?\"<br>\r\n<br>\r\nGreta looked teary-eyed, and Robert knew his sister felt shameful, as if this was all her fault. \"I... I... I don't know. Mrs. Maple...”<br>\r\n<br>\r\nHansel looked at Robert, his eyes seemed to plead with him. \"I...\" Robert swallowed hard, trying to keep his voice steady. He clenched his fist tightly, his knuckles becoming white. \"We'll figure something out.\" His words sounded empty.<br>\r\n<br>\r\n\"We'll figure what out?\" Hansel questioned, sweeping his arm over them. Panic and fear emanated in his voice, but Robert did not need to hear his friend's words, to understand his alarm. Beside his own terry, he could almost feel his friend's fear, on top of his own. <br>\r\n<br>\r\n\"We can't panic. That's not going to help us.\" Robert tried to keep his voice calm. His words were far easier to say than to practice. His mind raced with questions. ‘Was this permanent? How to they separate into two bodies? Why did the orb only make one body?’ <br>\r\n<br>\r\nHansel took a deep breathe, seemingly trying to quell his own emotions. \"And what will?\" <br>\r\n<br>\r\n\"Mrs. Maple...\" Greta offered. \"She may know... something.\"<br>\r\n<br>\r\nRobert realized that his sister was holding something. It took him a moment to see that it was the open box that they had purchased along with the crystal ball. Inside were the fragments of the once whole orb. Greta seemed to have hastily picked up the pieces while he and Hansel were unconscious.  <br>\r\n<br>\r\n\"Go... maybe she knows of something.\" Robert urged.<br>\r\n<br>\r\nHis sister abruptly turned to walk towards the front door, but stopped just outside the living room threshold. She set the box down on shelving in the hallway and walked back to Robert and Hansel with her phone out. \"Pictures are sometimes greater than words...\" Greta stated, her voice sounded more controlled. <br>\r\n<br>\r\nRobert looked toward Hansel, sharing a knowing look. He imagined that Mrs. Maple may need a photo of them, at least just to see the extent of what the orb had done to them. They both nodded their heads in approval. Greta took a picture of them, with half of their body still underneath the blanket. She picked up the box as she left the house. <br>\r\n<br>\r\nRobert almost called out to ask her how she was going to get to Mrs. Maple's shop, since she did not know how to drive, but he decided against saying anything. His sister would think of something, even if it just meant that she bicycled the few miles to the shop. Their hometown was small, easy to traverse from one side to the other in less than an hour on bike.<br>\r\n<br>\r\nRobert turned towards Hansel, his friend already looking at him from the corner of his eyes. He knew that they would be alone together for one or two hours while his sister was gone. He hoped that this was the only time they would have alone together, in their current state.  They were best friends, but he could not imagine, did not want to imagine, being forced to live his life side-by-side with Hansel. <br>\r\n<br>\r\nHansel sighed heavily beside him. \"How does an orb that switches people's bodies make us into... this.\" <br>\r\n<br>\r\nRobert shrugged his shoulder in response, and he felt the muscles between his and Hansel's necks flex. \"That felt weird.\" Robert stated to himself.<br>\r\n<br>\r\nHansel turned his face toward him again. \"I felt you... shrugging here.\" He touched the space between their necks, and Robert flinched. <br>\r\n<br>\r\n\"I didn't expect to feel that.\" Robert stated as he placed his hand beside Hansel's. He traced this common center, down the length of their chest and abdomen, and Hansel shuddered in response. \"Looks like there is some overlap where we can... both feel.\" It was an odd experience to feel his hand touch his stomach, but also know that his best friend could also feel him touching his stomach. <br>\r\n<br>\r\nRobert’s eyes shifted downward to the blanket that hid the bottom half of their body. He stared for several long moments at the space between their two legs. Curiosity getting the better of him, he grabbed the side of the blanket around their hips and tossed it aside, revealing their lower half. <br>\r\n<br>\r\n\"Dude!\" Hansel complained, but did not reach to grab the blanket. He seemed just as curious as Robert was. <br>\r\n<br>\r\nThey both stared at the single, unfamiliar penis nestled between their individual legs. \"That doesn't look like mine...\"<br>\r\n<br>\r\nHansel frowned. \"Its not mine either.\" After a few moments, he stated. \"The orb didn't just slap us together, it completely blended us into one person.\"<br>\r\n<br>\r\n\"We're still two separate people.\" Robert stated. <br>\r\n<br>\r\n\"Where?\" Hansel argued. \"Please, show me where you end and I begin.\"<br>\r\n<br>\r\nRobert had to concede that Hansel had a point. Not only were their two heads on top of the same body, but their body seemed to be some combination of their previous forms. The only parts that were not completely blended together were their heads. “Granted, we share… most of this body, but we each seem to only have control over our half...” <br>\r\n<br>\r\n“A lot of good that does.” Hansel scoffed. “We get to retain half of the body each, but we have to move together just to go anywhere.”<br>\r\n<br>\r\nRobert had not thought that far ahead, but clearly his friend had. He was not sure how they were going to move their joint body. “Let’s take this one step at a time. Greta is going to get help. We can…” He paused, feeling a familiar pressure build in his bladder, their bladder.  “…relieve ourselves…” Robert’s cheeks flushed red as he spoke. Hansel seemed to have a similar reaction as his friend’s cheeks turned ruby red as well. Robert could feel the heat leaving his friend’s face. <br>\r\n<br>\r\n“Then get dressed.” Hansel supplied. “No use running around in the nude.” </span></div></div>",
            "created":1586062800,
            "id":2813718,
            "title":"Switcheroo Orb: Trying to Remain Calm"
        },
        "14323211":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Perspective Change: Hansel and Robert explore their body",
                "Perspective Change: Hansel and Robert hear the news from Greta"
            ],
            "content":"<div class=\"\"><div> <span>Greta rode as quickly as she could with the box, containing the shards of the crystal ball, under her arm. She had suggested leaving the house to find Mrs. Maple for two reasons. The first was obvious. The old shopkeeper of magical relics was the only person she knew who could have answers, and if there was anyone that could help her brother and friend, it would be her. The second was to get away from the now conjoined twin boys. Greta felt a lump form in her throat; guilt was welling up in her chest. She felt responsible for Hansel and Robert becoming what they were now. She could not stay in the house, or the guilt would have been too much.<br>\r\n<br>\r\nEven now, remorse threatened to overwhelm her. She forced herself to focus on the road, taking the quickest route she knew back to the shop. \"All I can do now is find Mrs. Maple...\" She whispered to herself. <br>\r\n<br>\r\n<br>\r\nAfter turning into the store's parking lot, she unceremoniously dropped her bike just outside the door. She ran inside, the container still in one hand. \"Mrs. Maple... Mrs. Maple!\" she called out.<br>\r\n<br>\r\n<br>\r\n\"Dear... I heard you the first time.\" She walked into Greta's view from the back of the shop. She gave Greta a once over and brought a finger to her chin as if in deep thought. \"To whom am I speaking too?\" <br>\r\n<br>\r\n\"Its me... Greta. I am still myself, but...\" Greta replied but had difficulty finding the words. \"Please just look.\" Greta opened her phone to the image of her brother and friend. <br>\r\n<br>\r\nMrs. Maple took the phone but squinted at the image. \"I don't have my glasses... These little screens are so hard to see.\" She set phone down on the counter. Greta watched as the woman did what she could only describe as real 'magic'. The older lady put each of her pointer fingers against her opposite thumb, creating a rectangle. Keeping her fingers in their 90 degree angle positions, she moved her hands apart. As her hands separated, the image on the phone seemed to expand off of the phone, as if it were some kind of hologram. \"Oh my...\" was the only comment the lady could make upon seeing the image clearly. <br>\r\n<br>\r\nUpon request from Mrs. Maple, Greta explained what had transpired. She described how her brother and friend had switched bodies with no trouble, and that Hansel had a curious idea about the object. The three of them decided to test it, and it resulted in Hansel and Robert sharing a twin-like body. \"And then... the crystal ball shattered. I... have all of the pieces. If that helps...\" Greta said meekly. <br>\r\n<br>\r\nThe old lady seemed shocked, as she stumbled into a chair. \"My... I have never heard of such a thing occurring. If you did not have the image, I am not sure I would have believed you.\" She cupped her hands. \"You never should have tampered with a magical object. It always results in unexpected consequences.\"<br>\r\n<br>\r\n\"I know... but can you help them.\" Greta begged. \"You have to be able to do something.\"<br>\r\n<br>\r\nMrs. Maple sighed heavily, \"Unfortunately, I doubt I could do anything to help.\"<br>\r\n<br>\r\n\"But you're a witch!\" Greta exclaimed.<br>\r\n<br>\r\n\"Don't call me that!\" The old woman spat. She then appeared to visibly calm herself down. \"I have some magic, yes, but I do not have the strength to undo what has happened to your brother and friend. And like I had said before... that was the last orb in existence. All of the others were destroyed, long ago. I am sure you can imagine why...\" Mrs. Maple explained. \"Being able to swap bodies gives a person a limited form of immortality. Rasputin, himself, was the last wielder of an orb. That is how he was able to survive those attempts on his life.\"<br>\r\n<br>\r\n\"I don't care about the history lesson. Robert and Hansel didn't just switch bodies!\" Greta angrily spoke up. \"They... fused together.\"<br>\r\n<br>\r\n<br>\r\n\"Its possible that you three stumbled onto a secret function of the orb, or they just got lucky...\" Mrs. Greta explained.<br>\r\n<br>\r\n\"Lucky!\" Greta fumed. \"Look at them... that does not look lucky.\"<br>\r\n<br>\r\n\"Do not raise your voice at me girl! That is a much better fate than being trapped inside the orb, or dead.\" Mrs. Maple explained. She waved her hand, and the image shrunk back into the phone. Sensing that Greta was near to tears, the woman said gently, \"Unfortunately, there is nothing I can do. But, I will put word out to others that I am in contact with. One of them may know something I do not.\" She sighed again, \"Do not get your hopes up, but contacting my acceptances is the least I can do.\"<br>\r\n<br>\r\nWith little else to say, Greta walked out of the shop, with the box under her arm. It suddenly felt much heavier than it had before.</span></div></div>",
            "created":1589000400,
            "id":2833130,
            "title":"Switcheroo Orb: Seeking Help"
        },
        "1432322":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Robert and Hansel Learn to Walk",
                "Get Dressed",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>“I think both of you should learn how to stand and walk together before you try anything else,’ said Greta.  ‘Wouldn’t that be one of the first things you try to do anyway?”<br>\r\n<br>\r\nBoth Hansel and Robert were taken aback by that thought.  Neither even considered what it would be like now, having to work in tandem to walk.  Robert, took a deep breath, it felt weird.  Like breathing only half as much as he was used to.  Breathing again, it felt different this time, both lungs breathed at the same time. Then both lungs filled up with air again.  “Our bodies must be in the process of synchronizing,’ thought Robert.  ‘No, that thought is just to distract me from the truth!  Greta is right, Hansel and I will have to learn how to walk again, together.  We can’t just Lay here all day.”<br>\r\n<br>\r\n“What?! Shouldn’t we be getting help from someone?  I mean shouldn’t we be going back to get help from Mrs. Maple at least?  Practicing walking seems petty,” said Hansel, a tinge of panic in his voice.  <br>\r\n<br>\r\n“And how are you going to do that Genius,’ said Greta.  ‘You going to get me to drag you all the way down the Mrs. Maple’s shop?”<br>\r\n<br>\r\n“I don’t know.  This is sort of, crazy.  I mean I’m stuck to my best friend and now I also kind of look like a mix of him and me,’ said Hansel.  ‘This all is just so much to take in.”<br>\r\n<br>\r\n“’Stuck to my best friend’.  You make it sound like Greta and I planned this just to torture you,’ said Robert.  ‘Why don’t we at least just try to get our balance and working knowledge of how to walk before we completely panic?  Greta is right, she can’t drag us down to Mrs. Maple’s shop to figure out what happened to us.  Let alone go to the hospital.  At the hospital they’ll probably have to quarantine us and study us for years to come if we go there and tell them what happened to us.”<br>\r\n<br>\r\n“Sorry, I didn’t mean to snap at you two,’ said Hansel.  ‘This just took me by surprise.  You’re right Robert.  We have to work the problem at hand first.”<br>\r\n<br>\r\n“Okay, lets start by trying to sit all the way up,” said Robert.<br>\r\n<br>\r\nIn tandem, Robert and Hansel tried to sit up.  After several times of failing, there were able to sit up, as one, completely. <br>\r\n<br>\r\n“Well, that wasn’t too hard was it?” said Hansel with a smile of success.  <br>\r\n<br>\r\n“Still have a long way to go,’ said Robert, reaching his hand out to Greta.  ‘Greta, if you could help us stand up it would make things go a lot smoother.”<br>\r\n<br>\r\n“Sure,” said Greta, grabbing his hand and pulling them upwards.<br>\r\n<br>\r\nTrying to stand up in unison, Both Robert and Hansel tripped over their respected foot and fell forward as the stood up at their zenith.  Tumbling over on top of Greta.<br>\r\n<br>\r\nThe left head of Robert’s and Hansel’s new body dropped onto Greta squarely, coming within a couple of inches of her face.<br>\r\n<br>\r\nGreta moaned, out of breath.<br>\r\n<br>\r\n“Are you okay!?” asked Hansel.<br>\r\n<br>\r\nOpening her eyes, Greta looked into worried Green-blue eyes.  “I’m Fine.’  A wave of Butterflies fluttered through her belly.  ‘Are you two okay?”<br>\r\n<br>\r\n“Yes, we’re Fine,’ said Robert and Hansel simultaneously.  Hansel felt butterflies rush through his belly.  Robert felt the beginnings of arousal, embarrassment flushed his face once he realized it was coming from Hansel.<br>\r\n<br>\r\n“Let’s keep trying at this,” said Robert quickly, trying to avert what he knew Hansel felt, in that moment, towards his sister.<br>\r\n<br>\r\nRealizing who he was attached to, Hansel’s face reddened.  “I’m sorry Robert. You’re right, let’s get focus on standing and walking.”<br>\r\n<br>\r\n“Uh, yes,’ said Greta, embarrassed herself at her butterflies.  She pushed the two off of her.  Standing up, she continued, ‘Here.  Take my hand.  Let’s Try to get you two standing.  Steadily this time.”<br>\r\n<br>\r\nHansel reached for her hand, grabbed it.  Robert and Hansel, more steadily, stood up.<br>\r\n</span></div></div>",
            "created":1589950800,
            "id":2838523,
            "title":"Switcheroo Orb: Hansel an Robert Learn to Stand"
        },
        "14323222":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Robert and Hansel practice walking",
                "Greta drives them to Mrs. Maple's shop"
            ],
            "content":"<div class=\"\"><div> <span>Robert smiled at Hansel, \"Hey, we're standing.\"  It was a small victory that he and his friend remained upright. It was difficult to put words to the sensation, but simply standing felt very different while sharing his body. Robert felt that his center of gravity, or rather his and Hansel's center of gravity, was somewhere in the space between their two heads. It felt unusual because their heads were off-center, seemingly evenly spaced across their broadened shoulders. To Robert, he felt as if he was balancing on one leg and leaning slightly into an invisible wall. Since he could not feel the left side of their joint body, he could not sense their left leg holding up half of their weight. That lack of sensation made him feel off-balance even though he and Hansel were standing fairly securely. <br>\r\n<br>\r\n\"Yeah, but we still have a long way to go...\" Hansel reiterated what Robert spoke just a minute ago, though he too had a matching smile.<br>\r\n<br>\r\nRobert noticed that Greta was still holding onto his friend's hand. It was strange seeing what should have been his left hand casually holding his sister's, and not feeling Greta's hand in it. While he could not feel that hand, he could sense a spark between the two of them. He noticed Hansel hastily pull his hand away after sharing a knowing glance with her.<br>\r\n<br>\r\n\"Right so...\" Greta did not seem sure how to finish her statement or where to look. She was blushing. Her eyes drifted downward, and her cheeks became bright red. Her eyes quickly shifted back to Robert and Hansel's faces.<br>\r\n<br>\r\nRobert suddenly felt very uncomfortable, remembering their nakedness. \"Um... Greta, can you get some of my clothes from the closet. I hope they will fit us...\" He also felt faint heat from his left cheek. He turned slightly to see that Hansel's cheeks were also crimson. <br>\r\n<br>\r\n\"Yeah, good idea.\" She readily agreed, walking briskly toward the stairs. She called back, \"I will get you guys a couple options to choose from.\" <br>\r\n<br>\r\nRobert decided to not speak about the obvious feelings between his friend and Greta. In his head though, he cursed why now Hansel seemed to realize Greta had those feelings for him. \"You up for a short trip...\" Robert commented as he pointed towards the mirror, a few paces away. <br>\r\n<br>\r\n\"Yeah.\" Hansel agreed quickly, and Robert sensed his friend was looking for any distraction to ignore the 'elephant in the room' that was his romantic feelings. <br>\r\n<br>\r\nHowever, walking the few short steps proved to take much longer than Robert anticipated. They took turns verbalizing what action they were going to do, slowing their movement to snail pace. \"You brace your leg. I'm moving my foot. Hold still! You're going too fast! My turn. Hold our weight!\" each spoke to the other as they slowly crossed the living room. The slow and methodical process did reward them with not tripping over each other's feet again, and they now stood in front of the ornate mirror.<br>\r\n<br>\r\n\"Oh wow...\" Robert sighed as he stared at their reflection. \"We're like identical, identical.\" <br>\r\n<br>\r\n\"Is that the official term.\" Hansel teased. <br>\r\n<br>\r\nRobert rolled his eyes at Hansel's reflection and did not give him the satisfaction of a response. Robert instead focused on their faces. He and Hansel were identical in appearance, like he suspected. But they seemed to be exact copies of one another, more so than typical identical twins. And as an added benefit, their faces were pleasant to look at. He and Hansel had the same short, spiked brown hair with piercing green-blue eyes. A few freckles dotted their noses and cheeks, but the marks appeared to be located on the exact same locations on both of their faces. <br>\r\n<br>\r\nIt was disorienting enough for Robert to see himself wearing a new face, but it was even more so with an exact copy beside him. \"We look like the exact same person.\" he commented aloud. In his mind he noted that they were essentially the same person from the shoulders down; he decided not to verbalize that thought. <br>\r\n<br>\r\n\"Well, twins do tend to look alike.\" Hansel replied.<br>\r\n<br>\r\n\"But not like this...\" Robert insisted. \"If we had our own bodies, we could stir up so much chaos. We could switch places in classes and no one would be the wiser.\"<br>\r\n<br>\r\nHansel's expression soured. \"That is pipe dream because clearly we don't have our own bodies...\" <br>\r\n<br>\r\nRobert hung his head, feeling bad for ruining the mood. His imagination had gotten the better of him and reality came flying back into perspective. Robert had been so focused on their faces that he neglected to take in their entire reflection. His and Hansel's incredibly identical heads sat on the same lean muscled body. He tried to lighten the mood, \"At least our body looks attractive. My running muscles and your swimming muscles combined well. We're studs!\" <br>\r\n<br>\r\n\"Yeah, okay...\" was all Hansel replied. A silence fell over them until Greta came back into the room with an arm full of clothes. \"Thanks Greta.\" he spoke up. He then seemed to force a smile towards Robert's reflection, \"Lets get our stud body dressed.\"<br>\r\n<br>\r\nGreta laid out the clothes on the nearest sofa. Robert and Hansel slowly and methodically stumbled towards it, verbalizing each action like before. He and and his friend then painstakingly began to dress themselves. Having to sit on the sofa, Hansel begrudgingly helped pull a pair of boxers around their waist. He did not like the idea of wearing Robert's boxers but agreed that it was better than having to feel their penis rub up agains a zipper. Next, they pulled up a pair of blue jeans, but Robert and Hansel struggled to button them. \"Dude... just stick it in the hole. I'm trying. Give it to me! Would you hold on!\"<br>\r\n<br>\r\nBoth of them each held up different shirts against their torso, but it was quickly apparent that most would not fit. Their shoulders were much too wide, and they did not like the idea of stuffing their necks into a single, small head-hole. Greta retrieved a sweater from hers and Robert's father's closet. It was far larger than Robert's shirts, and the two of them could more comfortably fit inside. Robert stared at their now clothed body. For a moment, he could imagine that he and Hansel were simply dressing up early for a halloween costume, that they still had separate bodies underneath the clothes. </span></div></div>",
            "created":1590123600,
            "id":2839661,
            "title":"Switcheroo Orb: Dressing their Two-headed Body"
        },
        "143232221":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Their mom comes in the kitchen, everything is Normal to her",
                "Mom comes into the kitchen, panicks",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Hansel and Robert took nearly the rest of the afternoon and some of the evening to relearn how to walk.  A lot of missteps and falls happened.  But Hansel and Robert pulled through, with Greta’s Help, and by seven pm they were walking well enough to slowly walk around the first floor effectively. <br>\r\n<br>\r\nStepping into the kitchen, Hansel said, “I think I’m really getting the hang of this.  Great job Robert.  This is kind of awesome.  To work as a team to get around.”<br>\r\n<br>\r\n Robert, moving his foot forward awkwardly, balanced on Hansel for support.  His foot plopped onto the ground.  “Yeah, we’re starting to get the hang of this.  Great job, Hansel.  Let’s walk over to the refrigerator.  I’m starved.”<br>\r\n<br>\r\n“Now you’re speaking my language,’ said Hansel.  ‘I haven’t eaten since around noon.”<br>\r\n<br>\r\nLeaning into each other, Hansel and Robert made their way to the refrigerator.  Robert leaned into the refrigerator as Hansel opened the door.  <br>\r\n<br>\r\nSuddenly, the Front door opened.  A female voice called out, “Hey kids, are you home?”<br>\r\n<br>\r\nGreta, Robert, and Hansel were all stunned.  They didn’t even consider the ramifications of when Robert and Greta’s parents got home.  How would they react, would they freak out?  Would they be okay with it?  <br>\r\n<br>\r\nRobert and Hansel froze. Panic gripped them.    <br>\r\n<br>\r\nBiting her lower lip, not knowing what else to do Greta said, “Mom, we are in the kitchen.”<br>\r\n</span></div></div>",
            "created":1590607980,
            "id":2841869,
            "title":"Robert and Hansel practice walking"
        },
        "1432322212":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "The three of them explain about the orbs",
                "Amanda drives them to Mrs. Maple's Shop"
            ],
            "content":"<div class=\"\"><div> <span>The door to the fridge was still open with Robert's hand gripping a carton of milk. He let go and pulled his hand away just as Hansel closed the fridge door. They stared at each other in the reflection of the spotless fridge. <br>\r\n<br>\r\n\"Sorry I'm late!\" their mother called front doorway. \"Greta, can you put the frozen pizza in the over for me.\" Her voice was moving further away, likely going upstairs to the master bedroom. <br>\r\n<br>\r\nRobert let out a quick sigh of relief. He tried to turn away from the fridge, but felt the now familiar tug along his abdomen as his other half did not move with him. He glanced at Hansel who seemed to still be frozen. \"Turn around with me...\" Robert urged, and his friend moved with him to turn towards Greta. \"Great move by the way...\" He shook his head at his sister.<br>\r\n<br>\r\n\"I panicked... I wasn't sure what to say.\" Greta crossed her arms defensively. <br>\r\n<br>\r\n\"What are we going to do?\" Hansel asked, ignoring the argument between the siblings. <br>\r\n<br>\r\n\"We can't let her see us.\" Robert answered after a brief moment of silence. He decided that it was best to hide what happened, for now.<br>\r\n<br>\r\n\"Why?\" Greta asked. <br>\r\n<br>\r\n\"Just for now...\" Robert tried to explain himself but he was at a loss for words.<br>\r\n<br>\r\n\"Where will you guys hide then?\" Greta argued. \"We should just get your reveal over with... Maybe the orb's magic protected you... Maybe they think you guys sharing a body is normal...\" <br>\r\n<br>\r\n\"This is not normal.\" Hansel spoke, his voice firm.<br>\r\n<br>\r\n\"My point is that the orb may have...\" Her voice trailed off, as she seemed to have a difficult time explainer her thoughts as well.<br>\r\n<br>\r\n\"May have what...\" Hansel pressed. \"We don't know much about it, but I could hazard a guess that it did not make people think we're twins. You saw the pictures around your house. Nothing has changed.\" <br>\r\n<br>\r\nRobert nodded in agreement. They had not spoken about it, but it was hard to miss his family photos that lined the walls. \"So we hide.\"<br>\r\n<br>\r\n\"Where?\" Greta pressed again. <br>\r\n<br>\r\n\"I can call my mom, and tell her I'm at your place...\" Robert said to Hansel. \"You do the same with your parents. That way, they will not miss us.\" <br>\r\n<br>\r\n\"That still didn't answer my question.\" Greta glared at her brother. <br>\r\n<br>\r\n\"What question?\" their mother's voice came from down the hall. This time it appeared to becomming closer. <br>\r\n<br>\r\nRobert cursed in his head. His mother was always so silent moving around the house, like a ninja. There was no time for himself and Hansel to slip away unnoticed. \"...About how we were going to show you something...\" Robert spoke aloud. <br>\r\n<br>\r\n\"You have a friend over hunny?\" Their mother stepped into the kitchen. Her eyes were glancing at mail in her hand, so she did not spot Hansel and Robert at first. When she looked up, her smile turned into confusion, and then into shock. The mail dropped to the floor<br>\r\n<br>\r\nRobert figured that his voice now sounded different enough, that his mother had not recognized it. \"It's me Mom, Robert...\"<br>\r\n<br>\r\n\"I'm here to... obviously.\" Hansel spoke but seemed to scold himself for using poor choice in words. \"Its me, Mrs. Smith, Hansel...\" <br>\r\n<br>\r\nTheir mother seemed to not know where to look. Her gaze shifted from one to the other, and then to their single body. Her mouth opened a few times, but no sound escaped. <br>\r\n<br>\r\n\"You may want to sit down mom...\" Robert spoke. \"We have a lot to explain.\" </span></div></div>",
            "created":1590786660,
            "id":2842870,
            "title":"Switcheroo Orb: Revealing Themselves to Mrs. Smith"
        },
        "14323222121":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "They continue talking about the Orb",
                "Amanda continues to talk about their Uncles",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Amanda sat down at the kitchen table, taking several seconds to gather her thoughts, she said, “Is that you Robert? What happened?”<br>\r\n<br>\r\n“Yes, mother it’s me,’ said Robert.  ‘I’m the right head.  The head to my left is Hansel.  Yes, my best friend Hansel.  It’s kind of weird how this happened.  Are you mad at us?”<br>\r\n<br>\r\n“No, of course I’m not angry with you.  Why would I be? I’m just trying to process this situation.  How did this exactly happen?” asked Amanda. <br>\r\n<br>\r\n“Well, um, I can explain that mother,’ said Greta.  ‘See, it was this magical orb I got from the magic shop next to the grocery store I like to visit.  You know? Mrs. Maple’s place.  I thought it would have been cute to call it the ‘Switcheroo Orb’ since it switched mine and Robert’s body.  We were so excited about it that we wanted to show Hansel and This happened.  They are sharing a body and we spent the rest of the day making sure they could walk.”<br>\r\n<br>\r\n“I see,’ said Amanda.  ‘Well, that’s great that you three are trying to take responsibility to getting things moving in working on the problem.  But Mrs. Maple’s is something we are going to have worry about tomorrow.  For right now, we have to call Hansel’s parents and let them know he’ll be staying with us tonight so they don’t start to worry.  Next, Let’s get you two something to eat and talk about what is going to happen next.  Third, probably be best for your body to get some rest for the night Robert and Hansel.”<br>\r\n<br>\r\n“I’ll call them,” said Greta as she took out her cell phone and started to call Hansel’s parents.<br>\r\n<br>\r\n“You’re taking this surprisingly well Mom,” said Robert as he and Hansel were able to sit down next to Amanda fairly well.<br>\r\n<br>\r\n“Yeah.  Well, to be honest. Something like this isn’t the first time that has happened to someone I knew and care about,” said Amanda.<br>\r\n<br>\r\n“What!?,” said Robert.<br>\r\n<br>\r\n“Really? Who else do you know something like this happened to,” asked Hansel.<br>\r\n<br>\r\n“You remember your Uncles Mike and Mark?  I know it’s been about 10 years since you and Greta have seen them.  See, they weren’t always conjoined.  Mike was always my younger brother, but Mark use to be our cousin Mark Sims.  But in high school they magically transformed into conjoined twins.  In the end they decided to consider themselves brothers and Mark took on our last name.  They’ve have had a successful life together,” said Amanda.<br>\r\n<br>\r\n<br>\r\nRobert, Hansel, and Greta, who just finished up the conversation with Hansel’s parents, were all shocked and in awe of the bombshell Amanda had just told them.<br>\r\n</span></div></div>",
            "created":1591466880,
            "id":2846886,
            "title":"The three of them explain about the orbs"
        },
        "143232221212":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Robert and Hansel excuse themselves to Robert's room",
                "Robert and Hansel get into a fight"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait...\" Robert tried to speak, but his mind again had a difficulty time processing what his mother had just said. Mike and Mark were his conjoined twin uncles who lived on the other side of the country. They had also lived in town until about 10 years ago when they moved across the country. Due to monetary reasons, neither his uncles nor his family could visit each other, but his uncles texted his mother often, at least three times a week. And, they had phone calls at least once a week. Robert had only just spoken to them the other day. <br>\r\n<br>\r\nAn image of his uncles appeared in his mind's eye. Their hair was dark brown, almost black. Their faces were nearly identical except they seemed to like differentiating themselves based on facial hair. Mike had a mustache and Mark was always clean-shaven. They were joined together just as he and Hansel were now. His uncles shared a single body from the shoulders down, and as they worked as personal trainers, their joint body was always fit. <br>\r\n<br>\r\nWhen Robert was growing up, he did not think his uncles' appearance as strange. That was just his uncles, 'two peas in a pod' as his father often joked. Learning that they were not always like that made his brain spin. \"Uncles Mike and Mark were separate...\" It was all that he could manage to say. <br>\r\n<br>\r\n\"Let me show you.\" His mother rubbed his hand affectionately before stepping away from the kitchen table. She walked out of the room and back upstairs. Robert realized that his mother was probably going to the attic.  <br>\r\n<br>\r\nGreta took a seat across from them. \"Something like this has happened before...\" she said breathlessly. \"That can't be true... Uncles Mike and Mark have always been..\"<br>\r\n<br>\r\n\"But were they really?\" Robert cut her off. \"When I was making my family tree for Ms. Robinson's class...\" It was an assignment from his 8th grade history teacher. The class was told to make a family tree going back as far as they could. Robert was not a history buff, but this assignment was surprisingly engaging for him. With his parents help, he tracked his family tree back to the civil war. \"I could not find any young pictures of Uncles Mike and Mark. The youngest I got was when they were seniors in high school. Nothing before that.\" <br>\r\n<br>\r\n\"That's because there weren't any.\" Amanda spoke as she walked back into the room quietly. \"Here are a couple pictures of Mike and Mark before...\" Her voice trailed off as she handed a few to Greta, and to Robert and Hansel. The images he held showed two men posing by a lake. They looked nothing alike, but they did seem to be similar in age. The one on right right had dark, almost black hair, and the one on the left looked similar to his mother, like a long lost sibling. \"Mark was a few months younger than Mike; he had the dark hair. That quality was shared between them after the accident.\" <br>\r\n<br>\r\n\"What happened?\" Hansel spoke for the first time in several minutes. \"Did they have an orb too?\"<br>\r\n<br>\r\nAmanda sat beside Robert and Hansel, nearest her son. \"No... we knew nothing of the orb you described from Mrs. Maple's shop.\" <br>\r\n<br>\r\nCreases formed in Robert's brow at his mother's statement. He wondered just how long Mrs. Maple's shop had been in town, but he decided against interrupting his mother. <br>\r\n<br>\r\n\"To give you some background of our family that I was unable to tell you before, Mark was the youngest in his family by years. His next closest sibling was 18 when he was born.\" Amanda spoke from memory. \"But, he was just a few months younger than Mike. Growing up, they were always getting into trouble together, pushing limits and such. While they were a few years younger than me, the four of us, including your father, did hang out together. We each bought a strange items from Mrs. Maple shop, but they bought a pair of 'gemini rings'.\"<br>\r\n<br>\r\n\"Gemini? The twins?\" Greta asked.<br>\r\n<br>\r\n\"Yes, the zodiac for twins.\" Amanda nodded in agreement. \"The rings did nothing like the orb you described. Initially, all they could do was allow the two of them to sense each other's presence and emotions across any distance.\" She put a picture on the table to the two rings. They seemed to be made of some silvery-white metal which Robert could not identify. Each had the symbol, in a reddish-orange stone, of the roman numeral one. \"But since they never took the rings off, they seemed to connect them more and more. Over time, they could send thoughts, messages, to each other, both verbally and visually. It made them quite the devious pair.\" Amanda smiled warmly as if remembering some joke they had played on her. <br>\r\n<br>\r\n\"Then what happened?\" Robert pressed.<br>\r\n<br>\r\n\"Nothing, not for years. That seemed to be the extent of what the rings could do.\" Their mother paused before continuing. \"But then there was the accident... The four of us had a picnic by the lake during the summer of their junior year. Your father and I were lying on the sand, enjoying each other's company while Mike and Mark were racing. They often complained about not being able to play Marco Polo against each other, since they intuitively knew where the other was.\" <br>\r\n<br>\r\nHer face hardened as if the memory was painful. \"While they were playing, we still do not know for sure what happened. Mark simply went under.\" She breathed out slowly. \"It could have been a stroke, maybe a seizure, but in any case, he suddenly sank. And Mike was panicking. He claimed that he could not sense where Mark was. Your father and I jumped into the water to help look for Mark.\" She shivered. \"I remember it vividly. The wind suddenly became eerily still. I saw Mike clutching his hand and staring at his ring, almost like he was praying. In the next moment, he dived down as if knowing exactly where Mark was. He was down there for a long time, and I became fearful for him as well. Then, he popped up to the surface but struggled to keep his head above the water. Your father swam over and helped take him to shore.\"<br>\r\n<br>\r\nA shiver ran down Robert's spine as his mother continued. \"Your father had not just pulled Mark from the water, but also Mike. Your father and I could not help but stare. They had been changed somehow, joined as conjoined twins. One ring was on their left hand, and other on their right. You can probably guess what happened next. When Mike and Mark came to, they were shocked at their appearance, at their sudden closeness, but over time they adjusted.\" Amanda sighed heavily. \"They had no choice.\" <br>\r\n<br>\r\nRobert turned to look at Hansel, whom stared him in the eyes. \"We're stuck like this... aren't we?\" Hansel asked, his tone sounded defeated, as if he knew the answer already. <br>\r\n<br>\r\nRobert, just as much as his friend, hoped that there was some way to undo this. But if his uncles who were joined like they are now were never separated, what hope did they have. \"Yeah... I think that is what my mom is trying to say.\" He answered. \"We... have a lot to talk about...\" </span></div></div>",
            "created":1591560420,
            "id":2847569,
            "title":"They learn about Robert and Greta's Uncles"
        },
        "1432322212121":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Someone Knocks on the door",
                "Continue with Robert and Hansel",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Breathing became heavier for Robert and Hansel.  Robert was still processing the information that his mother just told him.  Hansel, well, it was obvious that he was barely holding it together.  <br>\r\n<br>\r\n“Excuse us,’ said Robert.  ‘I think Hansel and I need a moment alone.  To, process everything.  We’ll be in my room.”<br>\r\n<br>\r\nThey unsteadily got up from the chair and walked out of the kitchen.  Walking to the stair of the house, Robert and Hansel realized that they hadn’t practiced walking up and down stairs.  Giving each other a determined look, Hansel said, “I’ll step up first.  Then you.”<br>\r\n<br>\r\nLeaning into Robert, Hansel stepped up onto the first step.  “Okay, Robert.  It’s your turn.”<br>\r\n<br>\r\n“Here goes nothing,” said Robert as he leaned into Hansel and stepped up onto the first step.  They nearly lost their balance before Robert leaned towards the wall, with an outstretched hand, Hansel following suit, and caught their balance against the wall.  <br>\r\n<br>\r\n“Maybe I should lean against the wall for the rest of the way up the stairs,’ said Robert.  ‘It’ll give us some extra support.”<br>\r\n<br>\r\n“Probably for the best,” responded Hansel.  ‘I’ll lean into you more heavily and take another step up.  Then you step up. Once we get our balance correct.  I’ll step up again, you follow suit. So, on and so forth until we get up the stairs.  Sounds good?”<br>\r\n<br>\r\n“Sure, let’s do this,” said Robert.<br>\r\n<br>\r\nLeaning into the wall, Robert felt Hansel lean into him and step up. Robert followed Hansel’s lead and stepped up right after him.  The process was slow but effective for the now Conjoined twins.  After several minutes they made it up the stairs and onto the landing on the 2nd floor.  <br>\r\n<br>\r\n‘Great team work there Hansel,’ said Robert, holding up the right hand, the only arm he had control over.  ‘How about a high five?”<br>\r\n<br>\r\n“You’re such a dork Robert,’ said Hansel with a laugh.  ‘But I’ll give one.”  Hansel raised his left hand and gave Robert a high five.<br>\r\n<br>\r\nThey went to Robert’s room, closing the door behind them, being on an emotional high of successfully walking up the stairs in the first try both Robert and Hansel momentarily forgot why they had gone to Robert’s room.<br>\r\n<br>\r\nSitting down on Robert’s queen-sized bed.  Robert asked, “So, what do you think of being attached to me for the rest of your life?  Does it seem as terrible as it did when we first woke up like this?”<br>\r\n<br>\r\n“We don’t know that for certain.  There still may be a way,” said Hansel, even to himself his voice didn’t sound convincing.  <br>\r\n<br>\r\n“Well, think of it this way, in the search the definitive answer to that, we aren’t alone in the world.  We can always talk to my Uncles.  I’m sure they can talk to us about their experiences after being pulled from the lake as conjoined people,’ said Robert somberly.  ‘That is so strange to say.  Here I thought they were born that way and now I find out they weren’t.  Throws a curveball into everything.”<br>\r\n<br>\r\nHansel chuckled, “How Ironic you say that.”<br>\r\n<br>\r\nFor the first time since waking up conjoined, Robert and Hansel laugh together.<br>\r\n</span></div></div>",
            "created":1591821840,
            "id":2849220,
            "title":"They excuse themselves to Robert's Room"
        },
        "14323222121212":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Robert and Hansel get into fight",
                "Robert and Hansel calm down, and walk down stairs."
            ],
            "content":"<div class=\"\"><div> <span>Hansel felt good, laughing with his friend, and for a few moments, everything seemed okay. When the laugher ended, he and his friend were left alone in the quietness of the room. His eyes wandered the room. Hansel had been to Robert's bedroom countless times through the years, but he seemed to see the room with new eyes. On the shelf across from them were several medals from Robert's races in track and cross-country. Hansel hated running. He was not good at it, being flat-footed, but he was an excellent swimmer. While his friend ruled the running sports, he dominated in the water. Buttery and freestyle were his best strokes, and he earned several medals to prove it. <br>\r\n<br>\r\nHansel grimaced when he looked down at their two feet. He pressed the toes of his foot, their left foot, into the carpet. Despite his youth, there was talk of him competing in the olympics one day. Now, that seemed to be a pipe dream, an impossibility. \"How are we going to compete?\" He asked aloud.<br>\r\n<br>\r\n\"Compete with what?\" His friend asked, clearly not following.<br>\r\n<br>\r\n\"In sports...\" Hansel did not like how his voice sounded defeated. \"If this is our new norm... We'll never be as good as we were before... I'll never...\" He did not want say aloud that he would not make it to the Olympics, for fear that saying it aloud would make it true. <br>\r\n<br>\r\n\"We can still make our sports work.\" Robert spoke as if he had it all figured out. \"I know you don't like running, but we can do cross country in the fall. Track and Swim... they are during the same season, but I would give up track to compete in swim with you.\" <br>\r\n<br>\r\n\"Robert...\" Hansel stressed his friend's name. \"I am in swim year round... or I used to be.\" During the off-season, he drove to the next, larger town to practice with a club team there, seeing as their small town did not have one. <br>\r\n<br>\r\nHansel noted that his friend had a pain expression, seemingly just remembering that he practiced all the time. \"I'm sorry... I...\" Robert began to speak, but he stumbled over his words.<br>\r\n<br>\r\n\"Its fine.\" Hansel said quickly, though to him, it was not fine. \"We couldn't solve everything tonight anyways.\" He knew that they had more pressing issues like explaining this to his parents and dealing with school tomorrow morning. A smell wafted into the bedroom despite the closed door, and he jumped on the excuse. \"Lets just go down stairs; I'm hungry.\" Hansel leaned forward, and simultaneously, he lifted with his leg and pushed his hand into the mattress. He felt his half of their body rise but the movement abruptly stopped. Robert seemed to have done the opposite to keep them planted on the bed. \"Let's go!\" Hansel spoke again, but the other half of his body did not cooperate. <br>\r\n<br>\r\n\"Clearly there is more you have to say.\" Robert said. \"Lets just talk, they will save us some.\" <br>\r\n<br>\r\nHis friend was always like this, a talker. Robert always wanted to talk through and solve the problems as soon as possible. But right now, Hansel did not appreciate this aspect of his friend's personality. \"I don't want to talk about it right now.\" Hansel answered through gritted teeth.<br>\r\n<br>\r\n\"Okay... fine.\" Robert answered, his tone indicating that he was dropping it for now. <br>\r\n<br>\r\n\"Good. Let's go.\" He stated simply just before he lifted with his leg and pushed with his hand again. Hansel knew right away that their timing was off. They stumbled forward but Robert caught sturdy wood of his desk. <br>\r\n<br>\r\n\"Even if you don't want to talk, we still need to talk.\" Robert said, emphasizing 'need'. <br>\r\n<br>\r\nHansel knew what he meant, which made him more frustrated. After spending all afternoon learning how to walk together, it was evident that they needed to communicate back and forth with nearly everything. Simply turning around meant that one would have to announce that they were going to pivot their hips while the other braced their weight. The movement would get them turned sideways, and then the one who shifted their hips, would have to announce that they were now bracing their leg. Then, the other would finish pivoting. The whole afternoon, and into the evening, they always needed that back and forth communication. Now, Hansel was starting to resent it. <br>\r\n<br>\r\nHe did not see how they could run in Robert's cross country meets when their walking was a series of stop-go steps. Swimming seemed out of the question. Hansel imaged them doing nothing more than floundering like a fish since they could not speak to each other underwater. \"I'm taking a step.\" Hansel said though gritted teeth, but he had already begun to move before speaking. They stumbled forward another step, but as nothing was there to grab, they tumbled onto the ground. </span></div></div>",
            "created":1591910820,
            "id":2849838,
            "title":"Robert and Hansel Talk Alone"
        },
        "143232221212121":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Continue with Hansel and Robert",
                "Amanda's point of view",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Crying, Hansel looked up at the ceiling, Anger overwhelmed him.  “This is all YOUR Fault Robert!  You did this on purpose to get us turned into a freak! You wanted to screw me out of being on the swimming team because you are jealous of how good I am.”<br>\r\n<br>\r\n“What!? I did no such thing.  Why would I want to, my best friend, screw you out of swimming?  You think that I wanted to lose control of the right side of my body?”<br>\r\n<br>\r\n“Yes! You did!” yelled Hansel.<br>\r\n<br>\r\n“NO, I DIDN’T!”  Yelled Robert, as he raised his right hand and tried to pull at Hansel’s Hair.<br>\r\n<br>\r\nHansel saw the hand coming and raise his left hand and grabbed at Robert’s right hand.  “It’s all your fault,” said Hansel through clinched teeth.<br>\r\n<br>\r\nThey Wrestled around the floor, trying to gain the advantage through brute arm strength.  Grunting the entire time.<br>\r\n<br>\r\nMoments later, Amanda burst through the door, “What is going on in here?”<br>\r\n<br>\r\nSeeing the two boys rolling around the floor like a pair of cod fish on the deck of a boat she knew instantly what was going on.<br>\r\n<br>\r\n“Okay boys, knock it off.  This isn’t helping either of you,’ said Amanda, walking over to the boys and she pushed down the boys’ shoulders.  ‘Knock it off!”<br>\r\n<br>\r\nLaying, staring up at the ceiling again, the boys let go of their grip on each other’s hand and started to cry again.  <br>\r\n<br>\r\n“Everything will be okay boys.  We’ll figure things out.  I promise.  It’s good to get it all out now,” said Amanda sympathetically.<br>\r\n</span></div></div>",
            "created":1592842140,
            "id":2855046,
            "title":"Robert and Hansel get into fight"
        },
        "1432322212121212":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Robert and Hansel eat dinner",
                "Skip to the next morning"
            ],
            "content":"<div class=\"\"><div> <span>Amanda kneeled next to the two-headed teen which was her son and his friend. \"Everything will be okay...\" She repeated herself, trying to calm them down. Though, she was not sure if everything would return to normal as the two boys seemed to hope. Seeing them fight reminded her Mark and Mike after they had just learned their condition was permanent. They did not take it well. <br>\r\n<br>\r\nEven Mrs. Maple was astonished at her brothers' appearance, not knowing that the rings could do such a thing. For a few days, she took back the rings to analyse them, but the prognosis was not good. Mrs. Maple gently explained that the rings' power was gone after the incident in the lake, seemingly having been used up. She theorized that Mark and Mike had stumbled onto a failsafe of sorts, to protect the wearers. Likely they both would have died that day, but the rings saved them by binding them together. <br>\r\n<br>\r\nThe boys did not take the news well, but they kept their anger, their fear in check until reaching the Smith house. They excused themselves to Mike's room, wanting to be alone. Amanda and her parents discussed this unfortunate news for several minutes before they heard a loud thud and shouting voices. Amanda had rushed up to her brother's room to see Mike and Mark beating on each other. They screamed at each other, blaming each other for ruining their life. It took Amanda and her father to pin them down. When the dust settled from Mark and Mike's fight, they began to cry. Mark had a black eye, and Mike had a busted lips. Bruises formed on their abdomen and each other's limbs. That was the last time they fought each other so viciously. <br>\r\n<br>\r\n\"Mom...\" Robert spoke suddenly, drawing her out of the memory. <br>\r\n<br>\r\nAmanda helped them sit up and wrapped her arms around them and placed her head in the crook of their necks. \"We will figure this out, okay.\" She was surprised for a moment to feel both of their arms wrapped around her, but she felt that Hansel needed an embrace just as much as her son did. She held them for several long moments before finally releasing them. <br>\r\n<br>\r\nBoth Robert and Hansel had identical expressions of regret when the turned to look at one another. \"I'm sorry...\" They said at the same time. Hansel continued though, \"I know you didn't do this on purpose, Robert.\" He wiped a tear from his eye. \"I felt like I was drowning... I suddenly realized all the things we could not do, and I needed someone to blame.\" <br>\r\n<br>\r\nRobert look down at their feet. \"I'm sorry for trying to hit you first. What you said... I started to blame me too.\" <br>\r\n<br>\r\n\"This wasn't your fault... I was the one who suggested we use the orb in a different way.\" Hansel reminded him. \"If anything, we are both to blame...\" <br>\r\n<br>\r\n\"No boys. This is no one's fault. But, we will get you through this.\" Amanda stood up and offered them a hand. \"Let's get you two down stairs for dinner.\"</span></div></div>",
            "created":1593192960,
            "id":2857149,
            "title":"Amanda Reminisces about her Brother and Cousin"
        },
        "14323222121212122":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Follow the boys to Breakfast",
                "The Boys bump into Robert's Sister",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Robert woke up feeling a little groggy.  He kept his eyes shut for a moment; he didn’t feel fully awake.  “What a nightmare I had,” thought Robert, raising his right hand up to his forehead.  Robert opened his eyes.  Looking up towards the ceiling he realized he had slept on his back; he hadn’t slept on his back since he was a little kid.  Not thinking much of it, Robert felt like he needed to go to the bathroom so he tried to get out of bed; only to be able to move his right side of his body.  Surprising him.<br>\r\n<br>\r\n“What the…?” Robert said out loud in a low raspy voice, looking to his left.  He gasped. A sleeping head was laying there, less than two inches away from his face.  It was attached to his body at the shoulders.  The room was still dark, the sun was barely rising over the horizon; Robert couldn’t identify what the head looked like clearly.  Robert gasped again, as memories of yesterday flooded back into his mind.  The Magic Shop him and his sister went into, the orb she bought, it switching the user’s bodies and then suddenly it breaking after Him and Hansel’s bodies combined into one. On top of that, Robert realized that his mom gave him a bombshell with admitting that his uncles weren’t always conjoined but the first half of their childhood they were separate people, cousins, but still separate people.  It was still a lot for Robert to process, especially so early in the morning.  <br>\r\n<br>\r\nHansel stirred, moaned, and slowly opened his eyes.  “Man, that was one hell of a nightmare.  For a second there I thought I was actually attached the Robert,” said Hansel sleepily.<br>\r\n<br>\r\n“You’re telling me,” said Robert sarcastically, feeling wide awake and still feeling the need to get to the bathroom.<br>\r\n<br>\r\nGasping, Hansel looked to his right.  Eyes widened in surprise.  “It actually happened, I’m a freak!” said Hansel, as the memories of yesterday flooded his mind.  <br>\r\n<br>\r\n“I don’t know about being a ‘Freak’ Hansel but I know for a fact that you feel the need to go to the bathroom just as much as I do.  So, if you don’t mind, could we get each other to the bathroom before we do anything else,” said Robert, matter of factly.  <br>\r\n<br>\r\n“Okay, okay. Let’s go,” said Hansel, more awake than a second ago.<br>\r\n<br>\r\n“On three.  One, two, Three,” said Robert as the two of them sat up together.<br>\r\n<br>\r\n“Okay, great! Let get out of bed and to the bathroom,” said Hansel.  The two of them quickly got out of bed, walked slowly to the bathroom and did their business.<br>\r\n<br>\r\nAs they washed their hands, Robert asked, “So, how are you doing Hansel? With our…, situation?”<br>\r\n<br>\r\nSighing, Hansel responded, “A serious question this early in the morning?  Well, as best as I think I can.  Today, at least, we can get over to Mrs. Maple’s shop to figure things out.  And what exactly are we going to do about clothes? It’s not like we can wear oversized T-shirts every day.  There is a lot of stuff we have to figure out today.”<br>\r\n<br>\r\n“True, there is a lot we have to figure out.  But I just want to say ‘Thanks’ Hansel.  For being a good sport about this whole situation.  Even though this wasn’t what we both hand in mind when fooling around with that damn orb, I don’t think I could have held it together as well as I am if it wasn’t for you holding together so well,” said Robert.<br>\r\n<br>\r\nShocked, Hansel said, “That’s the reason why I’ve held it together.  Because of how well you’ve held it together.”<br>\r\n<br>\r\nBoth boys smiled at that, everything didn’t seem so insurmountable at that particular moment.  <br>\r\n<br>\r\n“Well, what do you say we get some more experience walking down our ‘archnemesis’, The Stairs!” said Robert.  <br>\r\n<br>\r\n“Well the kitchen is downstairs and I am hungry,” said Hansel with a smile.  <br>\r\n</span></div></div>",
            "created":1594139160,
            "id":2863504,
            "title":"Skip to the next morning"
        },
        "143232221212121223":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Continue on with Robert and Hansel",
                "Continue on with Uncle Mike and Mark",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>“Uncle Mike, Uncle Mark.   Look, we’re doing it,” called out Robert, him and Hansel riding the bike on the driveway of Robert’s Uncles house. They had been working up to riding a bike the past few weeks since they moved to their Uncles house.  <br>\r\n<br>\r\nIn the three months since Robert and Hansel had magically been transformed into conjoined twins, it was decided it was best for them to move in with Robert’s Uncles for the rest of the school year.  To help their transitioned into a life together.  In the first week of their joint life together it was found out, through Ms. Maple, that it was indeed permanent, their conjointment.  So, a discussion between Robert’s mother, Hansel’s parents, who took the transformation very hard, Robert’s Uncles, and of course Robert and Hansel, talked about what needed to be done.  And the conclusion was to send Robert and Hansel to Robert’s Uncles house to learn what they can from them.<br>\r\n<br>\r\n“That’s great boys,’ Said Uncle Mike, Uncle Mark raising the phone, recording them riding the bike.  ‘You’ll be riding around the town in no time.”<br>\r\n<br>\r\n“Your mother would love to see you two doing so well,” said Uncle Mark, with a smile.<br>\r\n<br>\r\n“Thanks Uncle Mark,” said Hansel.<br>\r\n<br>\r\n“We’ll take the bike around the neighborhood and be right back,” said Robert as they rod off the driveway and to the left.<br>\r\n<br>\r\n“Be back soon,” called out Uncle Mike.<br>\r\n</span></div></div>",
            "created":1597089300,
            "id":2883578,
            "title":"Uncle Mike's and Mark's House"
        },
        "1432322212121212231":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Continue with Robert and Hansel",
                "Continue with Mark and Mike"
            ],
            "content":"<div class=\"\"><div> <span>Robert gripped the handlebar of the bike harder, a nervous energy running through him. Though, he was not sure if it was just his anxiousness or if his friend/brother had some share of the blame. He could see Hansel's white knuckles gripping the left handlebar, and Robert knew that the churning their stomach stemmed from both of them. <br>\r\n<br>\r\nAs his uncles had explained before, being conjoined meant that emotions sometimes bled together. It was not that Robert could read Hansel's mind, or had some empathic ability to feel his other half's emotions. The reality was much more physical. The biological factors related to emotions inevitably effected them both to some extent. If Robert became angry, the stress hormones would build in their system, their heart would begin to beat faster, and Hansel would feel a tinge of anger grip him as well. Of if Hansel became sad, Robert's mood would dampen. However do to their current situation, they were both nervous which meant the anxiousness was compounded. <br>\r\n<br>\r\nRobert focused on keeping time with Hansel's movement, allowing the bike to move forward at a leisurely pace. Slowly, his grip on the right handlebar relaxed. The risk of falling seemed to dwindle as they peddled down the long neighborhood road. Out of the corner of his eye, he caught Hansel with a wide grin. Robert could not help but match the expression. <br>\r\n<br>\r\nThey reached the edge of the cul-de-sac, the streets dead end, and Robert indicated for them to turn around. Just like they had practiced, they turned the handlebars to the left and leaned slightly. The bike gracefully turned around, and they began peddling back. They stopped in front of the driveway but stumbled getting off of the bike. Robert favored their right leg just as Hansel favored their left. So even after peddling and balancing together, they each still tried stepping off the bike in opposite directions. A reminder that they used to be two completely separate people. <br>\r\n<br>\r\nThrowing his leg over so they could pull away from Hansel's side, Robert commented, \"That was fun, wasn't it?\"<br>\r\n<br>\r\n\"Yeah, it was good to go biking again.\" Hansel replied. With one hand on each handlebar still, they walked the bike into the garage and set it against the wall. <br>\r\n<br>\r\nMark and Mike stepped into the garage, keys in Mike's hand. \"Good, you guys are back.\" Mike said upon seeing them. \"We have to give Sarah a hand.\" <br>\r\n<br>\r\nSarah was the mutual fiancé of Robert's uncles, whom Robert was very familiar with. Over the weeks that he and Hanzel spent with Mike and Mark, Sarah had also been living with them. He liked her. She seemed to understand both of her uncles, and made them happy. <br>\r\n<br>\r\n\"Her tire blew out on the freeway.\" Mark explained as he and his brother stepped into the parked car. \"She's fine, but we're going to replace it.\" <br>\r\n<br>\r\nRobert had always been in awe at how his uncles moved so seamlessly together, as if they could reach each other's minds. Since being joined to Hansel, he had a new appreciation for their level of coordination. \"Okay... I guess we'll see you guys soon.\" </span></div></div>",
            "created":1597530480,
            "id":2886080,
            "title":"Robert and Hansel riding a bike together"
        },
        "14323222121212122311":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "At the Ice Cream Shop",
                "Robert and Hansel bump into someone they know",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>“Since Uncle Mike and Mark are gone for at least an hour, what do you want to do?” asked Robert as him and Hansel walked into the kitchen from the garage.  Their walking had become more consistently harmonious, it was almost to the point of them walking together as if they always had been conjoined.  There were of course still some balancing issues they had to work out, like riding a bike, but for the most part they walked together very naturally.<br>\r\n<br>\r\n“Let’s just grab something front the refrigerator to drink and turn on the tv,’ said Hansel.  ‘It’ll be nice to just watch something and zone out for a while.”<br>\r\n<br>\r\n Walking over to the refrigerator, Hansel opened the door, Robert looked in first, followed closely by Hansel.  “How about a coke?  There’s some in the back.  Can you see Hansel?”<br>\r\n<br>\r\n“Yeah, sure sounds good,” responded Hansel.<br>\r\n<br>\r\nRobert grabbed one and Hansel slammed the refrigerator door shut.  They walked into the living room, sat down, they opened the coke can without even a second thought, set it down, and Hansel grabbed the remote control and hit the power button.  The tv blinked onto one of the news channels that Mike and Mark enjoyed watching.  <br>\r\n<br>\r\n“Gag! I don’t want to watch the news,’ said Robert, giving a disgusted look.  ‘Turn it to something else Hansel please.”<br>\r\n<br>\r\n“With pleasure,’ said Hansel, clicking the channel ‘up’ button several times before settling on a rerun episode of The Fresh Prince of Bel-Air.  ‘This looks good.”<br>\r\n<br>\r\nBoth of the boys leaned back onto the couch pulled their respected foot up onto the table.  Without realizing it Robert swung his leg over Hansel’s, his ankle leaning on top of Hansel’s ankle.   Throughout the episode the boys laughed at the same moments, or nearly at the same moments, talked about the scene, took sips of the coke and just was having a good time watching tv.  The episode ended nearly 20 minutes later.<br>\r\n<br>\r\n“Hey, it looks like there is another episode.  You want to watch it or do something else,” asked Hansel.<br>\r\n<br>\r\n“Let’s go for a Run.  We could run over to the local ice cream place.  Get some ice cream and run back.  It'll be good practice on our Coordination together.  What do ya say,” responded Robert.<br>\r\n<br>\r\n“Sure, we can use the practice.  It’s amazing how much athletic ability we have kept since this happened.  Plus, some ice cream sounds good,” said Hansel with a smile.  <br>\r\n<br>\r\n“Let’s race over there then,” said Robert.<br>\r\n<br>\r\nIn one flowing motion both the boys stood up and walked out the front door. <br>\r\n</span></div></div>",
            "created":1598308560,
            "id":2890816,
            "title":"Continue with Robert and Hansel"
        },
        "144":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "The Orb breaks on the floor",
                "It lands softly on the carpet",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>“Hey, why don’t we invite someone over to try this thing out,’ said Greta as her and Robert walked into the living room.  ‘How about Velma? She lives next door and she likes hanging out with the both of us.”<br>\r\n<br>\r\n“Sounds Fun.  Maybe she’ll swap with one of us to prove to her that it really works.  But the only concern I have is that mom and dad are home or will be home soon,’ said Robert, giving a worried look around the living room.  ‘They may get angry or upset with us over it. And I don’t want this to end so soon.”<br>\r\n<br>\r\n“Come on Robert, it’s only like 5:30 pm.  Mom doesn’t get off of work until nearly 7 pm and dad is working late tonight.  We’ll have a couple of hours before Mom is even home.  Plenty of time to have a little bit of fun.  What else do you have to do? Watch TV,” said Greta with pleading, almost begging facial expression on her face.  <br>\r\n<br>\r\n “Okay, fine.  Let’s do this,’ said Robert.  ‘Go Call Velma.  I’m sure she’s home.”<br>\r\n<br>\r\n“Yes!” yelped Greta as she took out her cellphone and called Velma.  <br>\r\n<br>\r\nWithin 5 minutes, Velma came knocking at the front door.  Opening the front door, Robert saw a 5’ 4” raven black haired, green eyed girl that very much looked like a skinny 14-year-old girl that she was.  Robert smiled, he said, “Hey Velma. Come on in.”<br>\r\n<br>\r\nVelma stepped by Robert.  “So, what was so important that I ‘had to come over immediately’?”<br>\r\n<br>\r\n“It’s to show you this,’ said Greta, hold up the marble like object.  ‘It’s called the Switcheroo Orb.”<br>\r\n<br>\r\n“Wait, you called me over here to see an oversized marble?  Tell me that it’s worth a lot of money or something,” said Velma.<br>\r\n<br>\r\n“Well, it is a, unique marble to say the least,” said Robert.<br>\r\n<br>\r\n“It has magical powers Velma.  It allows people to switch bodies.  Robert and I accidently switched bodies at The Magic Dragon earlier,” said Greta with an excited smile.  <br>\r\n<br>\r\nVelma gave an unbelieving look towards Robert to see his reaction.<br>\r\n<br>\r\n“Hey, don’t’ look at me.  She’s telling you the truth Velma.  We DID switch bodies earlier,” said Robert.  <br>\r\n<br>\r\n“Wait a minute.  You two actually are telling the truth, aren’t you?” said Velma.   <br>\r\n<br>\r\n“Yes,’ said Greta.  ‘I can prove it to you.  I’ll switch bodies with you if you are willing to be in my body for a few moments.”<br>\r\n<br>\r\n“Okay, yeah.  I switch with you,” agreed Velma.  <br>\r\n<br>\r\n“Great!  Now all you have to do is touch the top of the orb.  I just have to continue to hold to bottom of the orb,” said Greta.<br>\r\n<br>\r\nVelma touched the orb with her palm, laying her fingers down slowly over the rest of the orb.  The milky white mist within the orb began to spin faster, and faster. Velma’s eyes widen at seeing this. As the cloudy substance rotated with great speed, Velma felt herself being pulled away from herself, like one would feel when they felt their very being is being conducted through their arm.  It was a surreal feeling, exciting yet scary.  Velma was fascinated by this feeling.<br>\r\n<br>\r\nSeveral seconds went by as Velma continued to feel the pulling sensation when suddenly she felt herself enter the orb.  She felt like she was on a rollercoaster ride, being twirled around in the chair.  Then suddenly, she could see again, blinking, she realized she was looking directly at herself.  With a surprised yelp, Velma pulled back the arm that was holding onto the orb and covered her mouth, allowing the orb to drop to the floor. <br>\r\n</span></div></div>",
            "created":1587186000,
            "id":2820685,
            "title":"Greta and Robert invite a mutual, Freshman frie..."
        },
        "15":{
            "author_id":"fares002",
            "author_name":"Fares002",
            "choices":[
                "Robert swaps heads with someone in family",
                "Greta gets the marble back when they're home",
                "Major Reality Changes done by accident",
                "Life Changes",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>“Over here Robert,” called out Greta.<br>\r\n<br>\r\nLooking in the direction of her voice, Robert saw Greta standing next to Mrs. Maple near a table of knick-knacks.  He walked towards them, as he got closer, he saw that Greta was holding what looked like a large milky white marble, as he got up to her he said, “Whatta you got there?”<br>\r\n<br>\r\n“I don’t know.  It just seemed like a really cool Marble,” said Greta, holding it up to Robert.<br>\r\n<br>\r\n“Cool,’ said Robert.  ‘What does it do? Do you play marble games with it?”<br>\r\n<br>\r\n“Well, actually, I was about to explain to your sister that the marble she is holding contains magical powers.  It can bend and change reality in ways that one only dreams about,” said Mrs. Maple.<br>\r\n<br>\r\n“Like how? You mean like a good luck charm,” said Robert.<br>\r\n<br>\r\n“To some it can be a good luck charm.  To others, it can be a negative change.  Just depends on your perspective,” said Mrs. Maple.<br>\r\n<br>\r\n“Well that’s cryptic,” said Robert sarcastically.<br>\r\n<br>\r\nTaking a moment to look Robert up and down, it looked like Mrs. Maple was trying to make up her mind about something.  “Tell you what Robert.  How about you and your sister here take that marble home, free of charge.  All you have to do is both touch it at the same time and say, ‘We two ask for this mighty marble to change reality as it seems fit.’ And it will change reality in some way, although to give fair warning the marble itself changes reality as it sees fit.  Sometimes it changes something meaningless and other times it changes something major.  It’s crap shoot to be honest.  Even if you don’t believe me what do you have to lose?  Some time?  Think of it this way, you two, at worst, would get a toy out of it right,” said Mrs. Marble.<br>\r\n<br>\r\nRobert thought about it for a moment.  Greta, looked at Robert, feeling half excited about the possibility of the marble and half afraid that Robert wouldn’t want to have any fun with it, even if it wasn’t really magical.<br>\r\n<br>\r\n“Okay, I’ll take it then.  I guess it can come to no harm,” said Robert.<br>\r\n<br>\r\n“Great,” said Mrs. Maple.<br>\r\n<br>\r\n“Awesome!” said Greta, giving a little jump of excitement.<br>\r\n<br>\r\n“I’ll hold onto it,” said Robert as he held out his hand.<br>\r\n<br>\r\nPouting, Greta handed over the marble.<br>\r\n<br>\r\n“Thank you, Mrs. Maple,” said Robert with a smile and headed out the door to the shop.<br>\r\n<br>\r\nGreta said, “Bye Mrs. Maple.  I’ll see you in a few days.”  As she followed her brother out of the store.<br>\r\n<br>\r\n“Bye you two!” said Mrs. Maple, watching the two siblings leave with a knowing smile.<br>\r\n</span></div></div>",
            "created":1585630800,
            "id":2811043,
            "title":"Other Reality Changes Can Happen"
        }
    },
    "info":{
        "author_id":"fares002",
        "author_name":"Fares002",
        "brief_description":"You Head Swap for Life. Extra points for Good Chapters",
        "created":1582475880,
        "description":"<td align=\"left\" class=\"norm\">The Main Characters:<br>\r\n<br>\r\nRobert Smith: your average 17-year-old.  Is a part of the Varsity Cross Country and Track &amp; Field teams at the High School he attends.  Grades are good but not Outstanding. Is a Junior. Has a few good close friends but isn’t the most popular person at school.  Stands at 5’ 11”, 140lbs, short brown hair green eyes.  <br>\r\n<br>\r\nGreta Smith: 14-year-old sister of Robert.  A Freshman at the same high school as Robert.  Long brown hair, passed her shoulder blades.  Blue eyes, is a little taller than her classmates, standing at 5’ 9”.  Is a part of the Freshman Basketball team.  Is about 110 lbs.  <br>\r\n<br>\r\nAmanda Smith:  Mother to Greta and Robert.  Married her high school sweetheart.  Is 36 years old.  Stands at 5’ 7”.  Is mainly a house wife and is known to go to the gym to work out on a daily basis.  She has shoulder length brown hair and blue eyes.  <br>\r\n<br>\r\nJeffery Smith: Father to Greta and Robert. Was a Start athlete in high school. Had a severe knee injury in College and lost his scholarship because of it.  Still was able to get a Finance degree and is working full-time at a Finance company.  Stands at 6’ 1”. Short Brown hair, green eyes<br>\r\n<br>\r\nPlease keep the storyline consistent and as believable as possible.  Please add at least a Paragraph to the story before posting.  If there are too many 1-2 sentence parts then some may get deleted.  If you want to add additional characters please go for it.  Have fun with it.  Remember, the Head Swap is a one time deal and is permanent.  The real questions are is how the characters deal with it, Do they swap lives, do others notice, and how it all continuously changes for them.  Please add.  Extra Points for good chapters. Please keep it at the 13+ level, nothing overly specificly sexual in nature.  <br>\r\n</td>",
        "id":2213777,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1601923920,
        "modified":1601923920,
        "pretty_title":"Head Swap...For Life"
    }
}