{
    "chapters":{
        "1":{
            "author_id":"gooba11",
            "author_name":"Michael Jackson",
            "choices":[
                "Take out some of the girls sleeping singularly in the upstairs rooms",
                "Make a big entrance into the living room where the majority of the girls are",
                "Find a closet or a bed to hide under and wait",
                "POV of one of the girls",
                "POV of other / such as a cop investigating"
            ],
            "content":"<div class=\"\"><div> <span>You are Krek and you are a house monster, however you are a supreme failure. No matter how hard you have tried you have been too shy to show yourself and strike fear into the hearts of the snotty rich college bitches of Everfluent college. After years of being laughed at by the rest of the community you have finally snapped. You will do anything you can tonight to show the rest that you are not just a terrifying house monster but THE worst. The girls of the house just finished a massive party and have all crashed into drunken slumber and now is your time to strike. After sneaking about the house you have locked the doors and windows and barricaded them. Will you make a big entrance or take them out one by one. Or perhaps you would like to experience it as one of the girls?</span></div></div>",
            "created":1234674000,
            "id":647323,
            "title":"It Begins"
        },
        "11":{
            "author_id":"gooba11",
            "author_name":"Michael Jackson",
            "choices":[
                "Just eat them and be done with it",
                "Have a little fun with them",
                "Find other girls"
            ],
            "content":"<div class=\"\"><div> <span>Crawling out of the closet and across the floor you climb up the wall to the upstairs and slide into a dark room and quietly click the door shut behind you. Peering through the darkness you notice a two girls collapsed on the floor, passed out drunk. These two girls are incredible bitches, you constantly hear them making plans on how to embarass the less popular of the school. Demi who is a japanese girl with shoulder length hair was sent here by her parents so they could enjoy life without any responsibilities towards a daughter. She was passed out facing the bed, her outstretched arms reaching into the darkness under the bed. Nina was a swedish girl with long blond hair, a cute face with pouty lips, and a tight little ass that made the boys in the college constantly chase her. These would be your first two victims. Quickly you decide . . .</span></div></div>",
            "created":1234674000,
            "id":647326,
            "title":"Take out some of the girls sleeping singularly ..."
        },
        "111":{
            "author_id":"thorlantos",
            "author_name":"Morkano",
            "choices":[
                "Demi",
                "Nina"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> You step into the room and look over your victims. You are so hungry that it is hard to decide who to eat first, but decide you must.  </span></div></span></div>",
            "created":1425013200,
            "id":1940827,
            "title":"Just eat them and be done with it"
        },
        "1111":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "eat her up and move on to your next targets",
                "reader's choice",
                "cause some mischief"
            ],
            "content":"<div class=\"\"><div> <span>You stare at Demi, seeing her as a special prey to eat. She lies vulnerable before you, available in becoming the prey to your ravenous desires. If anything, eating her flesh will be quite the delicacy. She might be worth trying out, as you never tasted mean people before.<br>\r\n<br>\r\nYou can always try and copy what other monsters have done and kill them for a reason, such as having sex before marriage, cheating on and betraying others, being stuck up and evil, being too dumb to live, or something else that is seen as bad in the life of a human. Besides her cruel intentions with her friend, there's got to be a moral to being a villainous being dealing with humans. Did she eat her fruits and vegetables, donate to charity or lend some money, or even do the chores? How will becoming precise over what should be done to handling all the others around fit? What type of monster will you be? Questions can only come forward before a decision is made.<br>\r\n<br>\r\nWith Demi still asleep, there is always a chance to get an answer from her without truly waking her up and alerting everyone. This is a good chance to resolve some things and clear the mind up a bit.<br>\r\n<br>\r\nPerhaps lightly waking her up to ask if she's done anything bad or reasonably wrong could work. People sleep-walk and sleep-talk at times, so it should be easy. Then again, there might be something new or she might try to strike a conversation while asleep about her needs and what she wants in life before waking up to realize that she is talking to someone who wants to eat her alive.<br>\r\n<br>\r\nThese kinds of choices matter a lot or not at all. As a creature, one must be careful not to make the wrong move.<br>\r\n</span></div></div>",
            "created":1488692220,
            "id":2285176,
            "title":"Demi"
        },
        "1112":{
            "author_id":"thorlantos",
            "author_name":"Morkano",
            "choices":[
                "undress her first",
                "eat her clothes and all",
                "she's so sexy you must rape her first"
            ],
            "content":"<div class=\"\"><div> <span> Your eyes stray over Nina. The sexy blonde is laying face first on the bed. She has a tight pink t-shirt and a short red mini-skirt that shows off her fine ass. Her shapely legs are cover with dark red nylons and she is wearing bright red high heels. Your stomach growls at the sight. How would you like to begin your meal?</span></div></div>",
            "created":1425013200,
            "id":1940837,
            "title":"Nina"
        },
        "11122":{
            "author_id":"thorlantos",
            "author_name":"Morkano",
            "choices":[
                "start at the head",
                "her firm ass calls to you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You can't wait. You quickly approach the bed. Now the only question is where to start your feast.</span></div></span></div>",
            "created":1425013200,
            "id":1940838,
            "title":"eat her clothes and all"
        },
        "111222":{
            "author_id":"thorlantos",
            "author_name":"Morkano",
            "choices":[
                "rape Demi",
                "eat Demi"
            ],
            "content":"<div class=\"\"><div> <span>  You quickly approach Nina. You sink your teeth into her firm butt. As your teeth pierce the fabric of her red miniskirt and into her tasty ass, Nina jerks awake. You slide a claw across her throat slitting her layrax. Nina's scream becomes a gargle. You hold her struggling form down as you eat her butt. She is delicious. You quickly reach her pelvic bone and crack it open. Nina now lies still as you devour her rectum. You gnaw your way deeper eating her ovaries and womb.Nina dies as you eat her flesh. Her pussy is swallowed then you begin to eat those shapely legs biting through the red nylons her meat is delicious. You tear off her shirt and quickly eat her fits. Soon nothing is left of the young girl but broken bones and a pool of blood. You look over at Demi.</span></div></div>",
            "created":1440478800,
            "id":2025314,
            "title":"her firm ass calls to you"
        },
        "11123":{
            "author_id":"thorlantos",
            "author_name":"Morkano",
            "choices":[
                "continue to fuck nina",
                "Its time to eat"
            ],
            "content":"<div class=\"\"><div> <span> You gently lift up Nina's mini-skirt. Your mouth waters at the sight of her firm ass. The red thong underwear hide nothing. carefully you pull it off her. She stirs slightly as you run your tongue over her ass tasting her. She is delicious. You begin to force your tongue up her butthole. She moans painfully as you lubricate her hole with your tongue. You stand up licking your chops. You can't wait to eat her but first you have other needs to take care of. You move behind Nina and grab her nylon covered legs. Spreading them apart you pull the girl to the edge of the bed. You then thrust your huge dick into her asshole.<br>\r\n Nina is snapped awake as you tear your way into her anus. She lets out a terrified scream.  you reach around her body, pulling her back.  You grip her large tits. Your claws dig through her pink t-shirt and you tear both it and her pink bra away. <br>\r\n  You hump her wildly. Nina continues to screams as you ass fuck her over and over. You cum, filling her rectum with your juice. Nina falls forward unto the bed, She whimpers and shivers witch shock and terror. </span></div></div>",
            "created":1477431420,
            "id":2228317,
            "title":"she's so sexy you must rape her first"
        },
        "111231":{
            "author_id":"thorlantos",
            "author_name":"Morkano",
            "choices":[
                "you fill her pussy ",
                "you decid to cum in her mouth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> You turn the terrified blonde onto her back. She screams in pain and fear as you plunge into her vagina. You thrust hard and your clawed hands squeeze her tender tits you must release your load.</span></div></span></div>",
            "created":1487009460,
            "id":2277113,
            "title":"continue to fuck nina"
        },
        "112":{
            "author_id":"gooba11",
            "author_name":"Michael Jackson",
            "choices":[
                "Fuck her before you eat her",
                "Just Eat Here",
                "Leave her tied up in the room"
            ],
            "content":"<div class=\"\"><div> <span>Quickly searching about you find rope and duct tape, then you find a sock in the closet. Sliding over toward nina you quietly tie her arms and legs together as she moans drunkenly, then you ram the dirty sock into her mouth and quickly tape her mouth shut. As she awakens with a start you have allready slid under the bed. Her muffled cries wake Demi and as she blearily opens her eyes she sees yours staring back at her from the darkness under the bed. Grabbing her arms you drag her under the bed and plant her head in your mouth and slap your mouth shut around her neck your large fleshy lips sucking around her shoulders as you pin her arms at her side and her screams of terror reverberate in your throat. All poor Nina can see is her friends legs kicking around and being pulled further under the bed as you feed her down your long throat. Finally as her ass reached your lips you placed both front hands on her rear and pushed her in quickly and grasping her legs fed her down as the last of her screams echoed outward she slid down your neck into one of your nine stomachs forming a lump in your belly. Nina had laid there crying as she listened to muffled screams gulps and snorts that when they finally died down where followed by a massive belch. As you slowly slide across the floor toward her from under the bed her eyes widen with fear and she screams uselessly into her gag. You have allready decided to...</span></div></div>",
            "created":1234674000,
            "id":647328,
            "title":"Have a little fun with them"
        },
        "1121":{
            "author_id":"gooba11",
            "author_name":"Michael Jackson",
            "choices":[
                "Search for more food",
                "Search for more sex"
            ],
            "content":"<div class=\"\"><div> <span>Picking her up you turned her on her belly and tear her skirt up and pull her panties off. As terrified thoughts race through Nina's mind he thinks \"It's going to rape me! this monster is going to rape me!, theres no way i can take him.\" As she yells at herself in her mind for keeping her virginity for all these years, you stand in front of her and slide your cock from its sheathe. A massive scaley monstrosity that was over a foot long as you let go of it and it slaps onto her forehead her eyes screw upward toward it resting in the middle of her face in terror. Going behind her she begins to realize you have much worse in plan for her, placing the tip against her wrinkled anus you push into it without further warning and pick her up with your middle set of arms bracing yourself on your two front and back. Sliding her forward and backward on your cock tears run down her face and she screams into her gag. After a few minutes of this you pull out with a audible plop and drop her, by this points shes screamed herself hoarse and you move in front of her. Tearing the gag from her mouth you rub the tip back and forth across her lips spreading precum on her face. As she spits out the sock and opens her mouth to scream at the top of her lungs you lunge forward slamming into her throat with such a force that her body goes strait and your cock nearly enters her stomach. She cries in horror and disgust as your dirty wet penis rub around her mouth and throat and you realise stream after stream of cum straight into her stomach the throbbing of your cock visible through her strained neck. Pulling out quickly she gasps for air as you toss her into the air and catch her head and torso in your mouth legs kicking wildly. Looking straight up you jerk your head upwards and downward all the while swallowing allowing gravity to do most of the work for you. As her pretty little feet slide into your mouth and gulp her down the visible lump of her body moving across your body suddenly comes to a stop close to the other lump. As you slide under the bed and curl up to sleep for twenty minutes or so and digest the screaming and crying girls inside you. As you drift off you feel your stomachs starting to fill with stomach acid and the girls splashing around in terror as it starts to reach above their heads. Twenty minutes later your eyes slide open and you climb out of the bed with a smooth body and prepare to enjoy the rest of the night. </span></div></div>",
            "created":1234674000,
            "id":647331,
            "title":"Fuck her before you eat her"
        },
        "1123":{
            "choices":[
                "Wait under the bed for an \"art critique\" to come by",
                "Go search out more prey"
            ],
            "content":"<div class=\"\"><div> <span>You could just leave her hog tied in the middle of the floor as she silently cries, but that would just appear as a sign of weakness to the rest of the monster community; no, you had to leave a message, a message that put fear back into the hearts of mortals and monsters alike.<br>\r\n<br>\r\nThe first step was to remove what little clothing she had, so that she may feel a sense of dread as you looked upon her naked flesh. The second was to regurgitate the undigestible bits of Demi in front of her; but the digestion took time, and you could still feel her struggling in your gut, but this gave you ample time to make the rest of the preparations. You stripped the bed of its garnishing, leaving only the bare mattress which you tied Nina down to so that her limbs were fully extended in their respective directions and tight enough that she couldn't move if she were hit by, you don't know, an orgasm maybe? It didn't take much searching therein to find a vibrator, which you wired to emit the magnitude of a 5.6 earthquake, and subsequently forcefully adhere it within her vagina. Then Demi's leftovers were dropped onto Nina's taught convulsing stomach then rearranged the bones around her body making a macabre artwork, then carefully worked with the hair so that it could cover the most of the ropes that held her.<br>\r\n<br>\r\nAfter that it was merely a matter of replacing the sheets and admiring his work. The heavy comforter on the bed made it look like nothing was amiss. Peel back a layer and find that someone is under the sheets that commonly separate the mattress from the person. Take that layer off and find a sweating young girl surrounded by the bones of her dead friend as she is rocked by orgasm after orgasm from the angry buzzing coming from between nethers as she struggles against the bonds made from her friends hair and tries to scream through the dirty sock that you soaked in your own semen (did you forget to mention that?).</span></div></div>",
            "created":1326603600,
            "id":1258860,
            "title":"Too Easy..."
        },
        "12":{
            "author_id":"joeball",
            "author_name":"kreeper57",
            "choices":[
                "Just dive in",
                "Divide by breast size",
                "Divide by another criteria"
            ],
            "content":"<div class=\"\"><div> <span>\"All right ladies, the real party starts now!\"<br>\r\nYou leap into the living room and take a loving look around. The girls are groggy and slow to react, that plus the sight of a huge monster pretty much stuns them. They proabaly think they are hallucinating. This gives you enough time to corrall them all into the center of the room, stripping them as you do. Now there is a quivering mass of meatty maidenhood just waiting for your next move. <br>\r\nYou count 21 girls of a variety of shapes and sizes. Where to begin?</span></div></div>",
            "created":1281330000,
            "id":933046,
            "title":"Make a big entrance into the living room where ..."
        },
        "121":{
            "choices":[
                "Stick your penis up one of the girls's pussy it goes through her ass.",
                "Stick your penis up one of the girl's ass it goes through her pussy. ",
                "Start Partying with the girls! "
            ],
            "content":"<div class=\"\"><div> <span>You smile and decide it's going to be a blood bath you roar loudly and jump into a group of girls while one claw goes through the stomach one of girl you have another claw go through a girl's pussy who moans in pleasure before limping over dead you rip out her intestines and eat it before ripping out the ribs of the first girl they fall dead as you eat the ribs....the rest of the girls are  all still partying even though two of their class mates lay on the floor disemboweled. The creature seems to have plenty of time to enjoy his meal as all the girls are just to drunk and stupid to realize what is going on...growling you realize this is boring just tearing them apart and decide to do something that will get the drunk girls attention something that will make them scream in horror. You Roar before you </span></div></div>",
            "created":1330232400,
            "id":1284821,
            "title":"Just dive in"
        },
        "1212":{
            "author_id":"thorlantos",
            "author_name":"Morkano",
            "choices":[
                "eat the redhead",
                "continue to fuck the redhead",
                "toss the girl aside to get another "
            ],
            "content":"<div class=\"\"><div> <span> You grab a petite redhead and pull her close to yourself. The girl giggles drunkenly as you hold her firmly. You bend her slightly at the waist and with a mighty roar ram your giant penis up her asshole. She screams in pain and struggles violently as thrust inand out. The pain as her rectum is tore makes her fully sober. You cum in her as her body quivers. Now you have the other girls attention. They press against the wall with screaming and crying.</span></div></div>",
            "created":1505738100,
            "id":2387616,
            "title":"Stick your penis up one of the girl's ass i..."
        },
        "122":{
            "author_id":"joeball",
            "author_name":"kreeper57",
            "choices":[
                "GJJs",
                "Muffin Mamms",
                "Itty Bitties"
            ],
            "content":"<div class=\"\"><div> <span>There is really no question on how to divvy them up. There is only one way to judge female meat.<br>\r\nSo, you pick up each girl and shake her up and down to test the bounce per ounce. You make 3 piles. Itty bitty titty: flatties and no bounce. Muffin Mamms: perky and firm with little bounce, GJJ: Gigantic Jiggling Jugs-massive and meatty and full of flop. <br>\r\nAs it turns out there are 7 babes in each pile. Which one do you try first?</span></div></div>",
            "created":1281330000,
            "id":933053,
            "title":"Divide by breast size"
        },
        "1221":{
            "author_id":"joeball",
            "author_name":"kreeper57",
            "choices":[
                "Savor them ",
                "Devour them"
            ],
            "content":"<div class=\"\"><div> <span>With them all laid out like this the choice is clear. The more the meat the bigger the treat!<br>\r\nYou wrap the other two piles up and place them to the side and lay out the sexy septet. Or perhaps septits is more appropriate. There is one plain faced but pleasing plump girl that looks like she will be a great main course, but first there is a pair of thin but stacked girls that you know are snooty stuck up rich bitches, the queens of the house. They will go first. You grab one in each hand and start to play with them. You grab them so you are holding down their arms. shaking them up and down and side to side, only their well tanned titties bounce freely. then you shove them together so those chesty chunks of meat squeeze together. As they come to, you bop their heads together to stun them and then turn them so they face you. <br>\r\nTilting them horizontal so their hooters hang down you lift them over your head and tilt your head back You lowere one pair between your teeth and bite down very slowly until the meatty teatty goodness slides on your tongue, and then do the same to her comrade. As you masticate their mammaries you realize there is no real meat left on them, and the rich skanks are probably spoiled so with your thumbs you flick off their empty heads and go back to rest.<br>\r\nThe well rounded zaftig girl is still looking good, but it is not the time yet, you wiull save her for next, there is still time for another appetizer, and ther she is!<br>\r\nShe looks like an old fashioned Playboy centerfold, or a soft bodied soft core cutie from a Jim Wynorski movie. very curvy, very cute and nicely busty, 36D delightful. She is definitely a ballable babe. So, to work up an appetite your push her legs apart and push your engorged member in deep. She moans as you work her in and out slowly screwing her. She is about to scream in orgasm, but you snap her neck in time. Then you pull her off and slide her long legs into your mouth and chew away, crunching her up until you get to her chest, then you just slide the rest in and swallow her top half whole, feeling her full firm bosom slide down yout throat. that was nice, but there is a quartet of exquisite busty babes left.</span></div></div>",
            "created":1281330000,
            "id":933267,
            "title":"GJJs"
        },
        "13":{
            "choices":[
                "Walks into the shower.",
                "Walks naked, into the closet with you. ",
                "Her lesbian friend, 17-year-old Heather walks in, and she is naked too.",
                "She just goes to sleep, in the nude.",
                "Other, you choose?"
            ],
            "content":"<div class=\"\"><div> <span> You sneak into the closet and wait, but not for long. You see threw a crack in the door that the lamp near a bed is being turned on in the room, by an incredibly beautiful young woman. Her name is Julie, she stands 5’3, and she has just turned seventeen. Julie has long golden blonde hair, crystal blue eyes, soft milky smooth skin, firm double D size breasts, and she has a fantastically firm, yet round ass, with a slim, yet curvy body. Julie is currently wearing a pink tank top, and silk pink panties, that’s it. You watch eagerly as she slowly pulls her tank top over her head, and onto the floor. You can’t keep your eyes off her now bouncing breasts. Man, those things are nice, and huge, you think to yourself. You can also see her red nipples starting to become erect too.  <br>\r\n<br>\r\n You then watch in aw, as she grabs the sides of her silk pink panties, and slowly slides them down, past her slender, yet muscular legs, to her bare feet. As she steps out of them, you see that she has nicely trimmed, blonde crotch. You can also see her lovely, firm, bare ass cheeks too, as she walks around in the nude. As she stands in the room completely naked, you watch as she…     <br>\r\n</span></div></div>",
            "created":1237179600,
            "id":661652,
            "title":"Julie and the closet monster."
        },
        "131":{
            "author_id":"thorlantos",
            "author_name":"Morkano",
            "choices":[
                "Follow her into the shower",
                "Wait for her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> She heads into the shower. In a moment you hear the water begin to run. your stomach growls. Do you want to go into the shower after her or do you want to wait for her to finish?</span></div></span></div>",
            "created":1303362000,
            "id":1092012,
            "title":"Walks into the shower."
        },
        "1311":{
            "author_id":"tundrax",
            "author_name":"TwoFace",
            "choices":[
                "Fuck her now!",
                "Eat her now. Fuck the girls later."
            ],
            "content":"<div class=\"\"><div> <span>You find yourself unable to hold back. Slowly, you nudge open the closet door and advance upon the bathroom. Your stomach continues to growl. Anticipation builds as you realize that she was absent-minded enough to leave the bathroom door open. Steam rolls out of the room and hits you, sending tingles down your scaly skin. You continue to slither your way in, licking your lips in hunger. You grin as you see that she even left the curtain open, putting her gorgeous body on display. She looked great in the bedroom, but here in the shower, she looked absolutely sexy. The water cascading down her voluptuous breasts and continuing down her slender body elicited a new feeling deep within you.<br>\r\n<br>\r\nNeedless to say, you are not only hungry, but you are also horny. You can't decide what to do. Will you attack and fuck her now? Or will you go ahead and eat her now? On one hand, you may as well go ahead and savor your hot meal. On the other, surely there are other delicacies in this dorm that you can have your way with.</span></div></div>",
            "created":1314680400,
            "id":1177865,
            "title":"Follow her into the shower"
        },
        "13111":{
            "author_id":"tundrax",
            "author_name":"TwoFace",
            "choices":[
                "Force her to give you oral.",
                "Take her now!"
            ],
            "content":"<div class=\"\"><div> <span>For now, you decide to indulge your lust. Why not? Her eyes are closed and she's practically showing off her hot body to you in this shower.<br>\r\n<br>\r\nYou grin evilly as she slowly moves to one end of the shower, blissfully unaware of your presence. You climb in with her, making sure to not touch her just yet. Your eyes fall to her perfect ass, then trailed up the column of her back. As you think about the rest of her body, you try to think about which part of her you want to attack first. You smirk as you decide sneak attack from behind would be more fun.<br>\r\n<br>\r\nHer back still to you, you lower your head to be level with her ass. You open your gaping maw and let your tongue slide out and in between her fantastically supple thighs. You hear her moan softly as your tongue continues upward, lightly grazing her pussy. You felt her tremble against your tongue. You attempt to penetrate her pussy with your tongue, but you find something you didn't expect. It won't go in; she's a virgin!<br>\r\n<br>\r\nThis couldn't possibly get any better!<br>\r\n<br>\r\nFinally, you make your attack! You silence any screams she may have had by forcing her clawed hand over her mouth, holding tightly. You feel her voice attempt to escape from your palm as you roughly turn her around. Her once healthy and lovely skin turned pale in fear. You growl as you force your free hand onto her breast, toying with it to your amusement. It was firm, yet supple. It continued to arouse you, as well as heighten your hunger. You take her nipple between your thumb and forefinger, lightly pulling on it. You feel yourself salivate. Your lust and hunger was really taking it's toll on you. Still, you wanted to follow through with this. What do you do now?</span></div></div>",
            "created":1314680400,
            "id":1177873,
            "title":"Fuck her now!"
        },
        "131112":{
            "author_id":"tundrax",
            "author_name":"TwoFace",
            "choices":[
                "Go ahead and eat her.",
                "Fuck her again and try new positions."
            ],
            "content":"<div class=\"\"><div> <span>You can't take it. You know that you would need to get your rocks off soon, or you would be starving!<br>\r\n<br>\r\nHand still over her mouth, you pick her up, sliding her against the wet shower wall. Her tiny hands grasped at your wrist, trying to pry you away from her. The rest of her body was limp with terror. She couldn't bring herself to kick against you.<br>\r\n<br>\r\nYou give her a toothy grin as you reveal your massive 12-inch erection. She looks down and sees your length. Tears start to slide down her cheeks. Not that you could tell, what with the shower water still pummeling the two of you. You place her pussy at the tip of you cock, gently pressing at first just to tease yourself a little. She screams against your hand once more, begging you to stop. Again, it doesn't matter, since you can't hear her.<br>\r\n<br>\r\nFinally, you shove yourself all the way in, tearing past her virgin barrier. She screams in agony, while you moan in ecstasy. This Julie-girl had the perfect, tight pussy. Her inner walls clenching around your massive shaft. You begin to buck into her, sending pleasurable tremors throughout your body. Julie on the other hand, continued to whimper. She wasn't going to be able to take much more of this. Your cock was really hurting her, but it was starting to feel a bit nice.<br>\r\n<br>\r\nYou growl as you feel yourself begin to reach your climax. You feel her pussy begin to tighten even more. She was close as well.<br>\r\n<br>\r\nFinally, you unleash your load, filling her up completely. She screamed again as her limbs went limp. You growl again as you pull yourself out of her. Julie was a fantastic lay, but you still had your other primal urge to satiate. Then again, you feel your dick slowly become hard again. What will you do now?</span></div></div>",
            "created":1314680400,
            "id":1177877,
            "title":"Take her now!"
        },
        "1311121":{
            "author_id":"tundrax",
            "author_name":"TwoFace",
            "choices":[
                "Run and Hide! You must digest first!",
                "Wait for this girl to come in."
            ],
            "content":"<div class=\"\"><div> <span>As great as she was, you have to eat. <br>\r\n<br>\r\nHer eyes were closed and you could feel her heavy breath against your hand. You smirked triumphantly. Your animal lust wore this chick out big time! She would provide no struggle if you began to eat her now. That was okay, you decided. Easy prey first, just to get acquainted with this sick little game of yours.<br>\r\n<br>\r\nYou smirk as you lower yourself to her now aching pussy. You can smell the sweetness that was her own scent mixed with the slightly coppery smell of the blood that seeped out as you ravaged her body. You slide your tongue inside of her, causing her to gasp and writhe against you. Your tongue slithered up further and further inside her, making sure to not miss any of her delicious taste. You felt her pussy become wet once more. While tempting, you can't help yourself.<br>\r\n<br>\r\nYou slide her onto the floor of the shower, letting her catch her breath as you released her mouth. You pick up her feet by her ankles and slide your reptilian tongue along the flesh. She writhed again. You were tickling her this way, but what was to occur next wouldn't quite tickle. You slide her feet into your mouth, pulling her in inch by inch. Her flesh was so delicious, it almost pained you to not chomp away. However, you wanted to REALLY savor this sexy meal.<br>\r\n<br>\r\nWhen you reached her thighs, you saw her pussy once more. You couldn't wait to get there.<br>\r\n<br>\r\nFinally, her hips slide into your mouth. Your tongue slipped between her slender legs, penetrating her again. She moaned and shifted, a smile crossing her face. She was enjoying this, but not for long. You continue to slide her into your throat, finally reaching her supple breasts. You smirk as her eyes slowly flutter open. It was only then that she realized what you were doing. She attempted to scream, but you silence her by placing your hand over her mouth again. You could feel her attempt to kick from within your stomach. It was an odd sensation, but all it did was continue to make you hungry. You open your mouth wider to allow her giant breasts to slide in and clamp down about halfway past her tits. They were soft yet firm. Finally, you give into your hunger and push her in completely. She continued to struggle within your stomach, trying to find someway to get out. Too bad for her, there was no way. You sigh contently, only to be interrupted by hearing a soft, feminine voice call into the bedroom you were in.<br>\r\n<br>\r\n\"Julie? Are you taking a shower?\" the girl called out. \"Mind if I join you?\"</span></div></div>",
            "created":1314680400,
            "id":1177881,
            "title":"Go ahead and eat her."
        },
        "13111212":{
            "choices":[
                "Somebody open the closet and finds you! ",
                "You sleep peacefully without being disturbed "
            ],
            "content":"<div class=\"\"><div> <span>With The ability  to disguise your voice as your latest victim you giggled like Julie...now that you eaten one whole it was time to cause carnage it was time to taste flesh on bone it was time to spray a little blood and it was time to hear somebody scream out of fear then sexual pleasure...the steam was covering you so the female that jump in wouldn't see you till she rubbed against you <br>\r\n\"Julie you really must shave\" She said that would be the last words she spoke as you grabbed her by the arms twisting them in the back a way no human arms should be with that said you heard the loud *CRACKS: of her arm bones breaking as she screaming in pain...You growled low as you ripped off the rest of the arm and gorged on it hungrily  before tearing off the other arm...the woman now laying on the bathtub floor bleeding out. You grab her by the legs making her hang upside down and now she sees you face to face you show her, your blood covered teeth as you lick her vagina before tearing off one of her legs and letting her hit her head on the floor eating viciously you grab her other leg tearing it off....she was dead now and no longer any use to you. Climbing out of the shower you quickly made it back to the closet...The sounds of the rest of the girls finding her mangled body making you smile as you decided to masturbate. <br>\r\n<br>\r\nThen </span></div></div>",
            "created":1339995600,
            "id":1362076,
            "title":"Wait for this girl to come in."
        },
        "131112121":{
            "choices":[
                "Time To Eat",
                "Time For Sex"
            ],
            "content":"<div class=\"\"><div> <span>it was perfect timing just has you were shooting you goo the door opened suddenly 4 girls were completely covered in sperm, the screaming only made you masturbate harder and get the other 4 girls that had heard the screaming to come in and get covered as well, 8 girls all dripping of your cum, you decide it was time to<br>\r\n<br>\r\n<br>\r\neat again, the sounds of the screaming girls were making your stomach growl and you ate 8 delicious meals right in front of you<br>\r\n<br>\r\nthey want to know what REAL screaming was it was time to show them what real screaming was you could easily get your penis in all 8 of their Virgina's not that they would actually survive the experience though. </span></div></div>",
            "created":1375851600,
            "id":1642436,
            "title":"Somebody open the closet and finds you! "
        },
        "132":{
            "choices":[
                "Take her",
                "Feast on her flesh"
            ],
            "content":"<div class=\"\"><div> <span>You stand stricken in disbelief as the young girl confidently staggered her way into the closet, then closed and locked the door behind her. \"They'll never find me in here\" she giggled to herself, obviously still hammered beyond what a seventeen year old liver should be able to handle. You could not believe your luck. You didn't care who had been playing; by now they were all passed out somewhere in the house except her, through chance or remarkable stamina she still stirred, and had decided to leave clothing on the floor to deceive her competitors. Little did she know how well her ruse might work, for now she may win and never be found.</span></div></div>",
            "created":1326603600,
            "id":1258856,
            "title":"Walks naked, into the closet with you. "
        },
        "1321":{
            "author_id":"valareos",
            "author_name":"Valareos",
            "choices":[
                "Let her Scream",
                "Keep her from screaming"
            ],
            "content":"<div class=\"\"><div> <span>You grin and lick your lips, moving just a bit to rustle some of the clothes. Being a monster, you can make yourself seen, or not seen.. as you wish. For now, you dont wish to be seen.  Julie turns around real quick as she feels the rustling. \"Whos there? Aww come on, dont tell me this place has already been taken!\"  She moves forward, groping to see if she can find who was hiding in there. \"Sarah?  Michelle? Is that you?\" You move behind her quietly, and still invisible, run a talon down her back, barely touching, to cause her to shiver with the feeling. She turns around again, and sees no one there. \"Come on guys, this isnt funny!\"  The air gets quiet, and just the sound of her heartbeat could be heard, until a second could be heard, just barely out of tune with hers.  Using his talon again, he runs it carefully against her slit, causing her to shudder again. \"Damn... the dark must be getting to me. Im scaring myself silly.\"  She feels around the closet, looking for the doorknob, but instead touches you instead.  Her eyes widen as her hands feel your fur, and runs it down your body slowly, unsure what she has found.  as those hands reach your crotch, and feel your hard, slimy member. It takes her a moment to realize what it was.. and that it didnt attach to anything human. She opened her mouth to scream.</span></div></div>",
            "created":1397624400,
            "id":1780283,
            "title":"Take her"
        },
        "13212":{
            "author_id":"bestial1",
            "author_name":"John Doe",
            "choices":[
                "Rape her, then eat her.",
                "Play with her a bit."
            ],
            "content":"<div class=\"\"><div> <span>You don't want the others to discover you quite yet--not until you've had a chance to enjoy Julie a bit first. You clap one large hand over her mouth, then spin her around to face you. She still can't see you very well in the dark, but you can see her. Her gorgeous tits are bouncing slightly as she breathes, and her slit is already wet. You just need to decide what you will do with her first?</span></div></div>",
            "created":1402981200,
            "id":1813608,
            "title":"Keep her from screaming"
        },
        "1322":{
            "choices":[
                "Wait Till Somebody Finds You",
                "Go Out And Make \"friends\"",
                "Experiment on yourself first you never been a female before"
            ],
            "content":"<div class=\"\"><div> <span>grabbing her by the arms you hold her up, she screams, making a growling sound you quickly stuff her in your mouth no time to chew only time to swallow, before long she is in your stomach, she is still screaming in pain as the acid's are now eating at her, you belch loudly now you wait, you have this amazing ability to turn into your victims, you can now disguise yourself as your meal and blend in with other humans, you decide to,<br>\r\n<br>\r\nwait till somebody finds out<br>\r\n<br>\r\ngo out and get to know your human prey<br>\r\n<br>\r\nsince you never been a female before you decided to experiment on yourself</span></div></div>",
            "created":1407214800,
            "id":1837747,
            "title":"Feast on her flesh"
        },
        "133":{
            "author_id":"dragon32078",
            "author_name":"Mark Twain",
            "choices":[
                "Cock vore Heather, and impregnate Julie",
                "Cock vore Julie, and impregnate Heather",
                "Devour them"
            ],
            "content":"<div class=\"\"><div> <span>She is a gorgeous 5' 6\" woman, and she also has bouncing cantaloupe-sized breasts. Her eyes are a beastial brown, and she has pointed incisors. Heather's honey blond hair cascades down to her nipples, and she sports a nice well-toned belly. \"Wow, what did I do to deserve these two delectable young ladies?\" you think to yourself. Heather even has brown patch of hair pointing straight at her slightly moist vagina. You, can hardly contain yourself, when she tosses her golden locks, and gives Julie a sultry look.<br>\r\n<br>\r\n\"So what exactly do you have in mind?\" asks Jule.<br>\r\nHeather does not even bother to reply, as she cups one of Julie's breasts in her hand, and she lightly nibbles on her other breast. That is when you notice Julie's back is turned to you, and Heather's view is blocked by Julie.<br>\r\n<br>\r\nSo what do you have in mind?</span></div></div>",
            "created":1239426000,
            "id":674463,
            "title":"Her lesbian friend, 17-year-old Heather walks i..."
        },
        "1333":{
            "author_id":"gooba11",
            "author_name":"Michael Jackson",
            "choices":[
                "Rape her ",
                "Leave her for the moment",
                "Share her with a friend"
            ],
            "content":"<div class=\"\"><div> <span>quickly sliding out of the closet you rear up in front of them, casting a shadow over them. As they look up in confusion and terror. Standing on only your back two legs you reach forward grasping each in a hand and quickly look about. Seeing a pair of panties sticking out of a drawer you grab them with your two free hands and shove them into the mouths of the girls while they are still in shock and quickly grab some tape and cover their mouths before they can spit them out. Now using your free set of arms you pass Julie off to them and turn her wiggly sobbing form upside down and start feeding her dainty feet into your throat while at the same time using your free hand to wrap up heather in rope. You plan on enjoying her for a while but not quite yet, finally finishing up you lay her down on the floor. Bending your lower body upward you unsheathe your massive penis, and tear the tape off of Julies mouth. As she spits the panties out you cut off her scream with your slimy dick. Jamming it into her throat you start bucking your lower body fucking her throat and coating her tongue and mouth in slimy precum. While you do this you continue feeding her into your throat at this point reaching the base of her tits. Her sobs and wet gasping sounds are getting you off even more as you reach her neck. And finally you release a massive stream of cum down her throat and splashing out of her straining mouth and nose. As she gasps and sputters as you pull trying to get the breath to cry out you gulp down her teary face as her friend watches the lump that was Julie travel down your belly before coming to a rest in your first stomach. With a bellyfull of squirming girl meat you turn to heather and appraise her, shes as beautiful as you thought and the terror in her eyes only adds to that. Finally you...</span></div></div>",
            "created":1263790800,
            "id":822001,
            "title":"Devour them"
        },
        "13333":{
            "author_id":"gooba11",
            "author_name":"Michael Jackson",
            "choices":[
                "Shes Gone!",
                "Shes right where you left her, tied awaiting your pleasure."
            ],
            "content":"<div class=\"\"><div> <span>Leaving her for the moment you slither back into the closet and quickly find your friend Treklik, a creature looking like a humanoid beetle. He stood eight feet tall and stood on spindly carapaced legs that held up a massive kettle belly and thin horny arms. His broad black bug head was a marvel of terror with its uncaring black orbs for eyes and a horrofic leering lipless human mouth. However he had been having a dry spell and had not gotten prey for atleast a month. As you quickly explained to him the situation that you had a tasty young luscious treat that you felt like sharing back in your neck of the woods his grin grew much wider. Nodding his affirmation he followed you back to Heather.</span></div></div>",
            "created":1263790800,
            "id":822004,
            "title":"Share her with a friend"
        },
        "133332":{
            "author_id":"gooba11",
            "author_name":"Michael Jackson",
            "choices":[
                "Make her suck your dicks",
                "Just let him eat her"
            ],
            "content":"<div class=\"\"><div> <span>Upon seeing Treklik she pissed herself, he was a creature of true nightmare. His excitement was palpable and he quickly moved to her picking her up and bringing her to his face to better investigate her. Finally with a shrug he quickly reworked her bindings till they only bound her arms to her sides turned her over sticking a finger into her tight little rear end. Treklik had a mean streak a mile wide and he quickly dropped her on the ground, jerked her hips up, and quickly positioning his shiny black foot long cock plugged her ass. Her eyes burst open in pain and nearly fainted as he started slamming in and out of her asshole. You sat beside the bed digesting the still very lively girl in your belly until with a grunt he jerked out of her and turned her to face him splattering black jism all over her face and chest. He used her quite harshly so there was shit and blood all over his dick along with dripping lines of cum, quickly grasping a large handful of her pretty honey blond hair and cleaned his dick off with it. After a brief conversation of clicks and rasps you agree to pound her together. Picking up her whimpering form you turn her around and push into her asshole, as Treklik slides into her pussy. You both start pumping into her the enormous size of your dicks showing as they push against the inside of her stomach visible even from the outside. Leaning forward Treklik licks the tears streaming down her face before slapping her and pumping harder. After five more minutes Treklik fills her womb and pulls out sitting on the bed to rest as you finish with her asshole firing cum into her bowels. Pulling out you unceremoniously drop Heather on the floor, and sit back on your haunches. </span></div></div>",
            "created":1263790800,
            "id":822009,
            "title":"Shes right where you left her, tied awaiting yo..."
        },
        "1333321":{
            "author_id":"gooba11",
            "author_name":"Michael Jackson",
            "choices":[
                "Well... you only said YOU wouldnt eat her",
                "Honor your deal"
            ],
            "content":"<div class=\"\"><div> <span>Finally you reach down and pick her up raising her face to yours. You shake her until she gains some sense back and looks at you with a look of pure terror. \"If you please us with your mouth i wont eat you, however you must make no sound? Do you agree wench?\" you rasp at her and at first her eyes widen in shock that you can speak but that is quickly replaced by hope. Heather knew she could rock these two smelly beasts worlds, as long as she could live she would do anything. Quickly nodding emphatically you grunt and tear the panties and tape out of her mouth before dropping her and sitting back next to Treklik. Heather quickly crawled over on her hands and knees and took your cock in her mouth struggling with the size of it. But she began working your balls with her free hand and began working vigorously on getting you off flinching a little as you placed a hand on her ass sticking a finger in and working it around. Finally after minutes of feeling her moist tongue and mouth jerk about your dick you release right as she pulls it free of her mouth splattering her chest and face. Next she crawls over to Treklik hesitating before putting his dick into her mouth but before she can start he grasps two big handfuls of her hair and jerked down until his cock so far down her throat her chin was resting on his balls. Pulling up and down he face fucked her for five minutes before spraying so hard into her black jism sprayed out of her nose and mouth. Releasing her hair she pulls back gasping. \"There, i did it now i go free!\" she gasps looking about with relief and a little bit of triumph in her eyes. </span></div></div>",
            "created":1263790800,
            "id":822012,
            "title":"Make her suck your dicks"
        },
        "13333211":{
            "author_id":"gooba11",
            "author_name":"Michael Jackson",
            "choices":[
                "Look for more singular girls",
                "Have a feast in the main room"
            ],
            "content":"<div class=\"\"><div> <span>\"And a good job you did you little whore but now i must itch another scratch,\" Treklik said before grasping her under the shoulders. Triumph and relief quickly changed to confusion and fear, \"You said you wouldnt eat me!\" she yelled at you accusingly. Shrugging you look back and say \"And so i am not\" As Treklik pushed her head and upper body into his mouth. Her screams were muffled by his throat as he fed her fighting body further in, past her breasts and then grabbing her kicking legs pushing her in with them gulping quickly. Finally after a few minutes her feet slid into Treklik's mouth and out of sight as a screaming lump traveled down the front of him stopping in his huge belly. Burping he leaned down and said \"Over the lips through the gums watch out stomach here i come, eh girl?\" with a bug grin. As a muffled \"Ahhh mhnnnhn Gahhr Aahhh\" Was all the reply he got, leaning back against the bed and closing his eyes \"i just love the fighters, they feel the best in your stomach.\" \"Yeah and i gotta say, that blowjob was great for the digestion,\" you awnser back patting your belly the struggles being much more feeble now. \"Feel free to round us up some more fun and grub but i need to finish with my current dish, wouldnt want her to grow jealous would i?\" he said laughing. You decided to finish your meal as well and sat back listening to the cries in your stomachs and screams coming from Trekliks. Finally when both the girls were digested you...</span></div></div>",
            "created":1263790800,
            "id":822015,
            "title":"Well... you only said YOU wouldnt eat her"
        },
        "134":{
            "choices":[
                "tie up Julie, and make her watch you fuck or eat Teri",
                "tie up Teri, and make you watch her fuck or eat Julie",
                "get ambitious -- fuck one girl while you eat the other"
            ],
            "content":"<div class=\"\"><div> <span>walks over to her bed and lies down on it. She is lying on her stomach, breasts pillowed against the mattress. With her head to one side and her arms shielding her head, she closes her eyes. It doesn't take her long to fall asleep.<br>\r\n<br>\r\nYou eye her excitedly. You are confident she will be delicious. Part of you wants to take her now, eat her right away, gobble down the those beautiful breasts and butt. But you wait.<br>\r\n<br>\r\nYou have a very good reason for waiting. There is a second bed in the room, and it is empty. Julie has a roommate, and if you are patient and wait long enough, she might come to bed, too. Then you can have them both.<br>\r\n<br>\r\nPatience gets rewards. After about a half hour, Teri, Julie's roommate, slowly opens the door and slips through. She quietly closes the door and crosses over to the empty bed.<br>\r\n<br>\r\nTeri is taller than Julie, and also older. She is 19, and will be 20 in a few weeks. She has long, silky black hair with blue highlights and dark green eyes under thick eyelashes. You know from having seen her before that she has an even better body than does Julie. At the moment, however, she is wearing a long, somewhat baggy robe, and it conceals her figure rather nicely.<br>\r\n<br>\r\nYou watch, hoping Teri will take off the robe. She does so, to your great delight. Her breasts are even better than Julie's and her butt is every bit as round and firm.<br>\r\n<br>\r\nTeri drops the robe to the ground. She is wearing only a pair of black panties under it. She takes he panties off, and climbs into the other bed. She rolls over onto her back. Soon she's asleep, too.<br>\r\n<br>\r\nThis is great. Two absolutely gorgeous girls, ripe for the taking. Still watching from the closet, you carefully consider your next move.<br>\r\n<br>\r\nYou decide to . . .</span></div></div>",
            "created":1342501200,
            "id":1381165,
            "title":"She just goes to sleep, in the nude."
        },
        "135":{
            "author_id":"a.jrules",
            "author_name":"Bio Draft",
            "choices":[
                "Bend her over the bed ",
                "Eat her",
                "Make a bloody mess"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Take action on the girl, she will not be expecting it. </span></div></span></div>",
            "created":1442819940,
            "id":2037741,
            "title":"Other, you choose?"
        },
        "1352":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "find more prey",
                "become Julie",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>You can't wait to feel the flesh touch your tongue. The thought of having the chance to feast on a human fills your mind. You watch as Julie search around her room for some clothes to wear. She seems flustered over not finding what she is looking for. Eager to catch your prey, some saliva falls from your mouth as you wait for the opportunity of eating the young woman.<br>\r\n<br>\r\nSoon, Julie decides to give up. Instead, she walks over to the closet with the hopes of finding something to wear before joining the other girls. You become patient and willing to watch her get closer. This will be a great opportunity. Readying yourself, you await her to come over and get the scare of a lifetime.<br>\r\n<br>\r\nJulie opens the door and sees a bunch of clothes on a hanger. Some shoes are on the floor placed in an organized manner. The closet is dark, capable of hiding your true self within. She does her best to search through the clothes present from within. Deciding to act, you appear out of the shadows and grab her. Shocked, Julie tries to cry for help, until you extend your tail over to her mouth and cover it. This chance will not slip away from you. Now that you have the girl, you plan to eat her whole. Opening your mouth wide, you begin to lift her in the air. She does her best to scream, but you are blocking her chance of doing so.<br>\r\n<br>\r\nSlowly, you push her deep into your mouth, making sure she gets in easily. Julie unwillingly gets inside your mouth as you take her body in. She disappears into your mouth as you bring out your tail. Right now, Julie is tucked away inside your belly.<br>\r\n<br>\r\nOh, the taste of human flesh warms you up. It feels like you have finally tasted something good after all this time. Before you would settle for less, but would have always thought of one day eating a human just to feel a part of the monster community. You never thought that you would get this chance, but today might be different. <br>\r\n<br>\r\nThere are more people in this house. So in the end, you decide to...</span></div></div>",
            "created":1462175640,
            "id":2142137,
            "title":"Eat her"
        },
        "13522":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "here's a person",
                "here's a person"
            ],
            "content":"<div class=\"\"><div> <span>Julie wiggles inside of its body. The sensation of having its meal fighting back tickles the creature, knowing it did a job well done. Now that it has gotten a hold of Julie, it plans to do away with the rest. They will all be in its stomach soon, the taste of flesh will satisfy its cravings. All it has to do is find them, wait for an opening and eat them all up.<br>\r\n<br>\r\nIt then realizes something. Why take them down using its own shape and form when it could deceive the others and have them fall prey to its tastes. That would surely be a better idea than waiting long for the others to find it and react. After all, deception is a good tactic to use.<br>\r\n<br>\r\nFinding this a great opportunity to tests its infiltration skills, Krek decides to change its shape. And the form it will take will be that of the girl it has eaten. By wearing her face, the group will be none the wiser when it comes to getting eaten up by the creature.<br>\r\n<br>\r\nTransforming itself to look like Julie, the creature bares its fangs out, licking them happily. The process continues as it's body takes the shape of Julie's, even growing hair and getting all the traits of its meal. Now, the creature looks exactly like Julie, but is still presently nude. Deciding to not look naked while pretending to be her, the creature grabs whatever clothes it can find in the closet to wear. It will be a delight for the creature to feel and eat them.<br>\r\n<br>\r\nAfter awhile, the creature has gotten accustomed to the new clothing it found. It won't have to waste extra energy on forming some on its own. Now it will be among them, and when it finds an opportunity, take them down. Heading outside, the creature sets off to check up on the others.<br>\r\n<br>\r\nWalking downstairs, the creature scans the room and searches for the meatsacks it will eventually consume. Now that it acquired a fitting form to blend with the others, it won't have to waste the time and energy to eat them up. It finally is able to make things easier for itself. Even if it has to be one of the meaty humans.<br>\r\n<br>\r\nAs it gets downstairs, the creature heads to the living room, hoping to find someone it can snag away and eat. After Julie, the creature continues to crave more meat. It just tastes so good, like never-ending bliss.<br>\r\n<br>\r\nThe disguised creature then sets it sights on someone. They appear to be asleep, innocent and unprotected, while laying on the couch. It seems as though they fell asleep after watching some TV. All that makes a good meal for the monster.<br>\r\n<br>\r\nGrinning madly, it goes to the couch and sneaks up on one of the girls. Sleeping soundly on the couch is...</span></div></div>",
            "created":1464651540,
            "id":2156328,
            "title":"become Julie"
        },
        "135221":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "she wakes up",
                "eat her now!"
            ],
            "content":"<div class=\"\"><div> <span>It's Katherine, one of the cheerful girls of the party. She is soundly asleep and under a cover. <br>\r\n<br>\r\nRelishing this chance, they see the human's beauty and plump form. Their body will fit right inside rather easily.<br>\r\n<br>\r\nCreeping up to the sleeping Katherine, the creature makes sure that nothing will wake the meal up. <br>\r\n<br>\r\nReadying itself to latch on to the girl, it uses Julie's hands to get near Katherine. It takes its time, knowing to not rush things or else the girl will wake up and scream.<br>\r\n<br>\r\nJulie's face smiles at the helpless situation that the girl is in. It is one that is awkward and strange.<br>\r\n<br>\r\nThe time draws closer as Julie gets near her, thinking about how things will go once she wraps her hands around the girl and tastes her fleshy skin.<br>\r\n<br>\r\n<i>You know she’s tasty Krek. Dig in to your meal now while you have the chance! Taste that succulent meat and prove that you are a fearsome monster!</i><br>\r\n<br>\r\nThe hunger takes control, making the creature fantasize about tasting the girl even more. It gets harder to regain self control. With the girl not knowing of the monsters presence, the drive<br>\r\n<br>\r\nAs soon as the monster is about to lose control and dive in to eat the prepared meal set for it...</span></div></div>",
            "created":1467177300,
            "id":2172404,
            "title":"Katherine"
        },
        "1352211":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "just then...",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Katherine wakes up, snapping the fake Julie back to normal. She seems tired from sleeping.<br>\r\n<br>\r\nThe girl yawns and looks over to Julie. She seems well-rested. \"Hey Julie, were you trying to wake me up for the show coming on tonight?\"<br>\r\n<br>\r\nJulie sees the girl stretching and being active. Darn it! It was a perfect moment too! Many thoughts form in its mind. \"Yes, human friend. I'm here to be a friend to you.\"<br>\r\n<br>\r\n\"Oh, thanks Jules.\" Katherine says.<br>\r\n<br>\r\n\"So why are you awake?\" Julie asks.<br>\r\n<br>\r\n\"Dunno, Just felt like it.\" Katherine answers.<br>\r\n<br>\r\n\"You should get back to sleep.\" Julie prods.<br>\r\n<br>\r\n\"But I just got up.\"<br>\r\n<br>\r\n\"Seriously, why are you awake? You should really sleep and get some rest.\" Julie says in an irritated way.<br>\r\n<br>\r\n\"Nah, I'm good. Besides, I don't wanna sleep through our slumber party adventure.\" She watches as the girl starts to get off the couch, stretching herself and twisting her upper half in order to feel free.<br>\r\n<br>\r\nDon't you dare do this to me, meaty human! Her eyes widen up as she internally rages with passion. She wants to let her anger out. \"What a shame. Makes sense too.\" Julie says to the girl in a calm tone.</span></div></div>",
            "created":1467177540,
            "id":2172405,
            "title":"she wakes up"
        },
        "13522111":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "Katherine changes",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Katherine's phone begins to ring, alerting the girl to it. Reaching for her phone, she begins to read the message laid out for her.<br>\r\n<br>\r\nBehind her, 'Julie' watches her as she gets distracted with her phone. A bit of irritated tension rises within Laurie as she wants to get her meal.<br>\r\n<br>\r\nFeeling not up for the task of dealing with the girl, the fake Julie decides to deal with her prey. But the question is how is it going to be done?<br>\r\n<br>\r\nLooking at Katherine texting back on her phone, Julie decides to reach over and settle things. As soon as she places her hand on Katherine's shoulder...</span></div></div>",
            "created":1468914540,
            "id":2182845,
            "title":"just then..."
        },
        "135221111":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "a monster you know takes Katherine's place",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Katherine's phone begins to ring, alerting the girl to it. Reaching for her phone, she begins to read the message laid out for her.<br>\r\n<br>\r\nBehind her, 'Julie' watches her as she gets distracted with her phone. A bit of irritated tension rises within Laurie as she wants to get her meal.<br>\r\n<br>\r\nFeeling not up for the task of dealing with the girl, the fake Julie decides to deal with her prey. But the question is how is it going to be done?<br>\r\n<br>\r\nLooking at Katherine texting back on her phone, Julie decides to reach over and settle things. As soon as she places her hand on Katherine's shoulder...</span></div></div>",
            "created":1468914660,
            "id":2182846,
            "title":"Katherine changes"
        },
        "1352211111":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "'Katherine' becomes defiant",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Instead, Julie finds herself confronting with someone else other than Katherine. The face of Katherine appears to be replaced by a more pudgier and ogre-like one. She appears to have big lips and purple eye-shadow. \"Oh hey there Krek. How's the monster business going for you? Judging by the look of things, I'd say you have your hands full. What a figure.\" The person says in a low and feminine tone.<br>\r\n<br>\r\nKrek get startled by this. To think the disguise was found out by someone almost immediately. But the question is, what are they doing here of all places?<br>\r\n<br>\r\n\"Uh, what're you talking about?\" Krek says nervously.<br>\r\n<br>\r\n\"Oh, I love how you're playing the curious card. Thinking that you might get by as though no one from the monster world will catch on to your disguise. How daring, and somewhat sexy.\" 'Katherine' then grins at what she just said. Her face shifts back into Katherine's original one, but still controlled by the entity.<br>\r\n<br>\r\nKrek can't believe this. To think someone has ruined the mood it once had a second ago. \"This is supposed to be my feeding ground right now! Get your own!\"</span></div></div>",
            "created":1468914960,
            "id":2182847,
            "title":"a monster you know takes Katherine's place"
        },
        "13522111111":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "'Katherine' toys with 'Laurie'",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>'Katherine' just looks at 'Julie'. \"Well, I just wanted to see how things were going, but oh, you're still not done. You may have enough time with how long the girls are sticking around but if you want to satisfy your cravings, then you might as well get to it. It be best to be the monster you truly are, it's so sexy to look at.\" She then licks her lips.<br>\r\n<br>\r\nKrek gets angrier, yet somewhat calm. \"Why do you care about how I look? I'm trying to get a good meal by pretending to be one of their own.\"<br>\r\n<br>\r\nInstead of anger, Katherine just smiles. \"Is that so? Krek I doubt you're capable of manipulating your body as well as other monsters can. For now, I managed to astrally send my form out and possess this female while retaining my own abilities and her memories. Quite easy to do with magic, I suppose. Well, either way, the real you is so attractive despite your luck.\" <br>\r\n<br>\r\nKatherine then gets up and places her hands on Laurie's hips. She then get's close to Julie's face, pressing Katherine's body to the fake Julie's form. \"You have great potential. Although you may be weaker than many of the monsters back home, you still prove yourself capable of trying to become what you aren't. And that's what makes you oh so sexy.\"</span></div></div>",
            "created":1468916460,
            "id":2182851,
            "title":"'Katherine' becomes defiant"
        },
        "135221111111":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "an interruption occurs",
                "Krek decides to eat Katherine"
            ],
            "content":"<div class=\"\"><div> <span>'Katherine' then motions her hands up and down 'Julie's' side and then her back. She draws herself in closer, with her breasts pressing against Julie's. \"Ooh, splended. You've managed to copy the human's form well. I must say it's really quite an achievement for you.\" She moans out.<br>\r\n<br>\r\nNervous and unsure about what's going on, Krek tries to move away. But for some reason, instead of pushing her away, Krek's body does the exact opposite. 'Laurie's' hands begin to slowly motion up and down Katherine's body. Laurie's left hand moves up and down Katherine's back while her right hand begins to grab Katherine's firm ass and squeezes it. Wanting to know what's going on, Krek questions the possessed Katherine. \"What's going on? My body won't move the way I want to too.\"<br>\r\n<br>\r\n\"It's less more of what you want your body to do and more of what you should be doing with me here. My trickery magic is too powerful for a low-level monster such as yourself. It's best to give up when I'm around.\" Katherine gets close to the side of Laurie's ear. \"This game of yours, pretending to be these feeble humans is simply adorable. You really think you can pull it off. But as you play your game of secrets, I'll play my little game of mischief.\" She then places her hands on Julie's breasts and motions Laurie towards the couch. Krek feels it's body sit down on the couch, not under it's control. Staring at the possessed Katherine, Krek doesn't know what to do.<br>\r\n<br>\r\nKatherine licks the side of Laurie's face, slowly tasting it and playing with Krek. What seemed like a strange lick felt like burning acid to the monster. \"Mmmm, yummy. Still needs a little work, but you've got the form right. I've got so much control you don't even know it. I could possess another one of the girls or enhance this measly frail body. Hopefully the others get to come by and see your progress. It will surely make things interesting. \"Their magic and mischief is indeed strange. It's like this possessor wants to ruin the work Krek's made. <br>\r\n<br>\r\nAs Krek watches this possessor toy around with their powers, Katherine lets her hands go of Julie's form. Krek soon lowers it's hand, finally free from whatever possessed it to act differently. \"As much as I wish to enjoy our time together, it's best for me to get back to my own duties and plan. Maybe I'll come by when you've returned to your regular form. It'll be much more satisfying then.\" Satisfied with herself, Katherine gets off of Krek and lets it continue on in Laurie's form. \"Perhaps I will come by later and see your progress, hm? Hopefully things have gotten interesting since then.\"<br>\r\n<br>\r\nKrek can't believe what's going on. Whoever this person is, they are strangely powerful and are able to control Krek however they wish. There are so many questions running through Krek's mind. Before Krek can say anything, Katherine shakes slightly and begins to shift back into her normal personality, relieved from the possessor's control. Looking around the room confused, Katherine then yawns out loud and gets back to finishing her text as though nothing happened. <br>\r\n<br>\r\nAll Krek can think about is how things are going to go tonight. If something strange happens again, Krek won’t know what to do.</span></div></div>",
            "created":1468916700,
            "id":2182852,
            "title":"'Katherine' toys with 'Laurie'"
        },
        "1352211111112":{
            "author_id":"pawnling",
            "author_name":"Syzygy",
            "choices":[
                "Julie stops to think",
                "Julie goes on with her plans"
            ],
            "content":"<div class=\"\"><div> <span>With Katherine back to being herself, 'Julie' feels that things will not go in her favor. Things seem to be going on as they should, but the question is for how long will it truly last?<br>\r\n<br>\r\nStill trying to cope with everything going on, Julie wonders if her treats might escape her grasp when the slumber party is over. It would be a hassle to chase each girl down to eat them, and will be quite a problem if Julie has to be patient in eating her prey when they fall asleep or are alone. With the added intervention of another being or monster coming to this event, it might be a problem to deal with. <br>\r\n<br>\r\nThinking of all of this irritates Julie. Hopefully not much else occurs tonight and however long the slumber party lasts. Julie looks down at the girl that was possessed earlier and wonders if she should eat her now. With many humans present for this slumber party, the disguised creature can relish in having their meal eaten whenever they wish. The taste of human flesh is quite astounding.<br>\r\n<br>\r\nYet that strange possessor being from before might come back to taunt Krek, in some other way. But the only way to not feel conflicted by it all would be to feast on her prey right now and then the others. Looking over at Katherine, Julie sees that Katherine is off in her own little world. A strange feeling gets Julie to realizes that this is the perfect chance to consume her prey.<br>\r\n<br>\r\nOpening her mouth and raising her hands, Julie walks over behind the couch to Katherine, a bit hungry than usual. Placing her mouth on Katherine's head. Julie clamps her hands down on Katherine's shoulders. Katherine giggles at this act, thinking how weird her friend must be acting.<br>\r\n<br>\r\nWithout her knowing, Julie continues her process, just to get it over with. Consuming Katherine whole, Julie feels replenished from all the trouble she has been dealing with. Julie eats her prey, finally able to feel a sense of piece in her mind. Satisfied with herself, Julie heads out to go meet the others.<br>\r\n</span></div></div>",
            "created":1490940180,
            "id":2297656,
            "title":"Krek decides to eat Katherine"
        }
    },
    "info":{
        "author_id":"gooba11",
        "author_name":"Michael Jackson",
        "brief_description":"As a house monster you are terrible, and have decided its time to make up for lost time.",
        "created":1234682400,
        "description":"<td align=\"left\" class=\"norm\">You are a house monster, your job is to strike fear into the residents and really beyond that its free game as to what you want. For years upon years you have lived in this college girl dorm house and made not even a single appearance. You have been the laughing stock of the monster community for many years. Finally you have decided to make up for lost time and show the others what exactly you can do. You are a creature that look like a massive fourteen foot tall lizard that has six legs all with grasping hands on the end. Generally you walk on four legs and use your front legs as arms, you are bright yellow and have small beady eyes and a wide mouth on a blunt wedge shaped and heavily scaled head. You have decided to have some serious fun with the many girls that currently live in the home. The home itself is part of a large group of houses spread throughout a forest that surrounds the small but prestigous college. It is about a mile away from any other of the houses so after securing all the doors and windows. You can be sure that none of your victims will escape to spread the tale. Your going to show these rich bitches what fear means. <br>\r\n<br>\r\nNo homosexuality please or giant women or overweight women or men. Please keep the characters to only the monster and the girls. No girls under the age of seventeen, the monster forcibly having sex with the girls is ok as well. </td>",
        "id":1528885,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1505738100,
        "modified":1505738100,
        "pretty_title":"Closet Monster"
    }
}