{
    "chapters":{
        "1":{
            "author_id":"darps3",
            "author_name":"dasan15",
            "choices":[
                "Make himself an  1 inch tall",
                "Make Chelsea 50 feet tall",
                "Make Chelsea 100 feet tall",
                "Make Chelsea 500 feet tall",
                "Bigger"
            ],
            "content":"<div class=\"\"><div> <span>Mike has finally done it. Mike has made the first shrink ray.But know he need to use with someone special to use it with. Then he remembers he already got someone visiting you. Porn star Chelsea Charms. She thinks she's coming to just to visit her fan but she is in for something else. Chelsea  finally reaches your house and knocked on the door. You open the door and meet the most beautiful woman you seen in your life. She is 5 foot 3 inches, her hair was dirty blond, her eyes were dark green and she had huge breast. Her breast size was 153XXX. When Mike stops staring in disbelief he welcomes her in his house. She gladly comes in with a big smile on her face. When she comes in and sits down on the couch she asks \"So what do you want to do?\" Mike then reached into his pocket to take out his shrink ray. \"What's that?\" Chelsea asked. \"It's a shrink ray, I can use it to make you grow or shrink me\" Mike answered. \"Your kidding\" Chelsea said. Mike then said \"I can prove it.\" Then Mike used his shrink ray to...      </span></div></div>",
            "created":1166928120,
            "id":367712,
            "title":"A Fantasy Come True"
        },
        "11":{
            "author_id":"darps3",
            "author_name":"dasan15",
            "choices":[
                "She pushes Mike insde her breast",
                "She stops and puts Mike between her moutain sized tits",
                "She continues to breast feed"
            ],
            "content":"<div class=\"\"><div> <span>Wow! You weren't kidding Chelsea now boobing voice said. She picked mike up and just looked at how cute he is. \"Hay I got a idea\", Chelsea said. \"I don't have any children and and I always wanted to know what it is like to breast feed. Then Chelsea took of her shirt and pushed Mike hard on her nipple. Her nipple was as big as him so her milk hit him all over Mike's body. Chelsea loved the feeling of milk be squirting out of her tits. Mike was enjoying the breast milk until he shrunk again. He was now small as a speck. The made Chelsea... </span></div></div>",
            "created":1171133820,
            "id":381089,
            "title":"Milk Mountain"
        },
        "111":{
            "choices":[
                "His is hit by the massive tits",
                "he runs for safety"
            ],
            "content":"<div class=\"\"><div> <span>He is sucked into her giant nipple. He is scared and starts thrashing around inside of it. His is in a river of tasty milk. He swims around and driks some, gagging for air. She finds the gun and squirts him out. SHe brings him up to an inch and brings her breasts on top of him...</span></div></div>",
            "created":1182187020,
            "id":417793,
            "title":"In the nipple"
        },
        "113":{
            "choices":[
                "Bigger than earth and smothers it between her breasts",
                "The size of the universe",
                "15 Miles tall"
            ],
            "content":"<div class=\"\"><div> <span>For some reason her milk makes you shrink, unfortunately she is forcing you to be breast fed by her. Drinking away you slowly shrink smaller and smaller. You shrink past half an inch, a quarter of an inch, a fiftieth of an inch tall. Chelsea finally stops forcing you to be breast fed. She holds you out in her enormous hand which seems to stretch out forever and brings you close to her titaness face, which is bigger than anything that you had ever seen before. <br>\r\n<br>\r\n\"Wow Mike, you are so small that I can barely see you, you look like just a speck in my hand.\" she exclaims, then seductively she says \"This so sexy, I have complete power over you. I'll let you play with my girls, or what you can play with.\" she then takes her hand and gentle drops you on top of her breast. Each breast at your size is over several thousand feet tall, weighing millions of tons each. While on top of her breast she then strips out of the rest of her clothes and starts to masturbate. <br>\r\n<br>\r\nReaching her climax, she screams and her breasts jiggle causing it to feel like you are on an earthquake. She then looks at the raygun and says \"Why should I share my breasts with only you when I can share them with the entire world?\" Taking the raygun she sets it to max and then pulls the trigger. Unfortunately you stay the same exact size while she grows. How big does she grow?</span></div></div>",
            "created":1227935880,
            "id":612833,
            "title":"She continues to breast feed"
        },
        "12":{
            "author_id":"nostalgia18",
            "author_name":"oliver",
            "choices":[
                "smaller",
                "stay the same size",
                "bigger"
            ],
            "content":"<div class=\"\"><div> <span>mike starts laughing \"this will give you a lift\" he said and aims the device at chelsea presses a few buttons and then said\" are you sure your ready chelsea\" \"sure hun I dont really believe it will work but surprise me\" she says ,mike presses the button and for 5 seconds chelsea glows \"wow what was that \"said chelsea \"you will see in a minute\" mike laughs. chelsea starts to grow slowly at first her clothing starts to stretch and then rips her giant breasts bouncing out of her destroyed top \"wow this is great the feeling im getting\" moans chelsea now she starts to grow taller banging her head on the celing ouch says chelsea that hurt<br>\r\nchelsea is now 10 foot tall thats as high as your going to get but I adjusted the device to make you grow to 50 feet  tall hmmm well guess this will work mike presses another button and chelsea moans and bursts through the roof of the room you was in and rapidly grows to the height of 50 feet towering over the buildings nearby wow says mike in awe of giant chelsea says please make me..........</span></div></div>",
            "created":1451944860,
            "id":2084354,
            "title":"Make Chelsea 50 feet tall"
        },
        "14":{
            "author_id":"precedente",
            "author_name":"Inventor",
            "choices":[
                "Take you for the ray",
                "Help arrives",
                "Proclaim herself Queen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well well this is awosome-she says then takes sometihng and said- what a tiny tower- you look and is a 125 floors bulding. in that moment the pepole inside scream for some one to rescue them and... </span></div></span></div>",
            "created":1439674680,
            "id":2021388,
            "title":"Mini Me"
        },
        "15":{
            "choices":[
                "Chelsea Starts Lactating",
                "She says grow my boobs more",
                "your choice to what happens next"
            ],
            "content":"<div class=\"\"><div> <span>Mike then uses the ray to make Chelseas already supersized boobs even bigger by about one cup size. She says \"wow it really works....\"she takes a slight pause and says \"make my boobs bigger.\" you hesitate at first then Chelsea pushes her huge chest in front of your face and says \"pleaz\" Mike thinks \"i cant argue with that\" He makes Chelseas breasts one more size bigger. Watching she says \"bigger\" so you do what she says. Chelsea gets so excited she starts bouncing and your instantly hypnotized your eyes follow her massive boobs up and down. Then Chelse says \" do you want to feel them?\" Its not hard to answer that question \"yes\" so you start to message Chesea's huge boobs. She maons pleasurably and says \"harder\" so you squeeze and rub now Chelsea moans even louder and screams louder \"harder\" so you start to really let her tits have it. They Chelsea says i want my boobs bigger. You quickly increase her size again. The bigger her boobs get the more sensitive they are so Chelsea is moaning really loud now and she rams your face in her giant chest and commands you to squeeze and mash harder.</span></div></div>",
            "created":1257909060,
            "id":790165,
            "title":"Bigger"
        },
        "152":{
            "author_id":"nostalgia18",
            "author_name":"oliver",
            "choices":[
                "Mike makes her bigger",
                "Mike stops there"
            ],
            "content":"<div class=\"\"><div> <span>Chelsea says\" please make them bigger I will do what ever you want, the feeling every time they grow is the best feeling in the world\" you think twice as she is already quite big, but before you can argue or say anything Chelsea begins to rub the top of your leg and says \"anything I will even be your girlfriend now please make me bigger\". Mike does not know what to say but nods his head up and down a couple of times \"good that's settled then\"says Chelsea pulling Mike into her breasts and kissing him hard on the lips \"mmmm this growing is getting me very horny now suck my nipples\"Chelsea's massive breasts have made her nipples extra big and long nearly two inches now ,\"honey make me bigger\" .  Mike thinking he's dreaming gives her a bigger dose of the ray this time and her breasts grow five cup sizes bigger \"aahhh  yes \" says Chelsea \"more I want to squash you and be double my original size at least do not stop now\".Mike getting turned on lots by Chelsea's size and her rubbing gives her a 10 second burst with the ray gun \"oh my god yes I think im gonna cum lick my nipples now \" said Chelsea as her breasts start to grow bigger and more sensitive Mike licks her nipples and sucks on them.All the growingis stretching Chelsea's bra it starts to strain on her shoulder straps and tear as her breasts get bigger and bigger \"yes yes aahhh ahhh ahhhh! \"Chelsea shouts louder and louder as her breasts get to double the original size she orgasms shouting and screaming. A few seconds later Chelsea says \"oh my god Mike your the best\"  as the orgasm subsides \"wow\" im huge I can hardly see your face over my breasts \"Chelsea was now so big Mike could only see her face if he stood up Mike lost for words is putting his head on her huge breasts \"I think that's enough now Chelsea \"said Mike. No Mike I want to be bigger much bigger then no-one can ever compare me to anyone else ever again\" says Chelsea.</span></div></div>",
            "created":1267685100,
            "id":845705,
            "title":"Chelsea wants to grow bigger"
        },
        "1521":{
            "author_id":"blind_seraphim",
            "author_name":"Blind_Seraphim",
            "choices":[
                "GO FOR IT YOU DUMBASS!",
                "Or you could be boring and do the more moral thing..."
            ],
            "content":"<div class=\"\"><div> <span>With a big grin on his face, Mike fires again. There is a small boost in her breast size, and Chelsea looks up at him with a devious smirk. \"No, I mean I want you to hold down on that trigger, and never let go.\"<br>\r\n<br>\r\nHe blinked uncomprehendingly, and said, \"Y- you wanna get that big? I... I don't know if I can do that...\"<br>\r\n<br>\r\nChelsea puts a finger to his lips, and says, \"Let me tell you a little story. See, I first got boobs before all of the other girls my age. And they were a pretty good size, too. I got so much attention for it, and I loved every second of it. As I got older, they got bigger, sure, but eventually, other girls caught up to me. Suddenly, I didn't have all the attention anymore. I took to nude modeling, but it wasn't the same. So I got implants. I figured if my breasts were bigger, I'd get more attention. But I didn't, not as much as I wanted. So I went bigger. And bigger. Until I finally got the biggest implants humanly possible. Then I finally got the attention I wanted. But its still not enough. There are some girls out there with bigger boobs than me, and I can't stand that. So, for a while now, I've wanted to find a way to make my boobs even bigger. And now, I've finally found then man that can make my dreams come true.\"<br>\r\n<br>\r\n\"But... you definitely have bigger boobs than any other girl on the planet now. Why go bigger?\"<br>\r\n<br>\r\nChelsea grinned. \"What about other planets, though? What about the rest of the universe? Don't they all deserve to see my tits too?\"<br>\r\n<br>\r\nThe realization was slowly dawning on Mike, \"Wait, you don't mean...\"<br>\r\n<br>\r\n\"When it comes down to it, I'm the happiest I've ever been when my boobs are getting bigger. I want to be satisfied, Mike, in a way no one else can satisfy me.\" She leaned in close to him, and said, \"And I won't be satisfied until my boobs are so big that there isn't any more room in the universe left for them to grow in.\"<br>\r\n<br>\r\nMike swallowed hard. This was a decision that held a lot of weight. What would he do?</span></div></div>",
            "created":1345661880,
            "id":1410524,
            "title":"Mike makes her bigger"
        },
        "15211":{
            "author_id":"blind_seraphim",
            "author_name":"Blind_Seraphim",
            "choices":[
                "Continue the growth.",
                "Shrink her down and save himself."
            ],
            "content":"<div class=\"\"><div> <span>Mike couldn't even begin to resist. He knew that what he was about to do could potentially have dire circumstances, but the part of him that wanted to see her desires fulfilled was much, much stronger. So, he held down the trigger, without any intention of ever letting it go.<br>\r\n<br>\r\nThe effects hit Chelsea instantly. She moaned, rubbing her hands over her tits as they got larger and larger. \"This is the feeling I've been craving all my life... this is the perfect feeling. Make my boobs grow forever. Bigger than everything.\" With this, she slipped one hand into her pants and into her wet slit.<br>\r\n<br>\r\nHer boobs were getting to the point where it was difficult for Mike to see Chelsea around them, but he could see her start to play with herself. Part of him wished it was his hands in her pants, but knowing that he was the cause for her pleasure was enough for him (not to mention seeing her tits get so impossibly huge). He began to run his free hand over her left breast, as it steadily approached the point where it was the same size as him.<br>\r\n<br>\r\n\"Mm, yes, rub against it. It feels amazing when you do that...\" Chelsea moaned.<br>\r\n<br>\r\nMike nodded, and looking at the massive mammary before him, slid his body right up against it, embracing it with his free hand. Almost instinctively, he began to thrust against it.<br>\r\n<br>\r\nChelsea giggled. \"I can feel that bulge in your pants rubbing up against me. Let it out. I wanna feel your cock on my giant tit.\"<br>\r\n<br>\r\nMike was unzipping his pants before she was even finished talking. He let out his member and started to really go at it, floored by the sensation of rubbing up against the wall of warm, soft flesh.<br>\r\n<br>\r\nChelsea smiled, and said, \"Oh god, they're so sensitive, it feels wonderful. Keep going, please don't stop.\"<br>\r\n<br>\r\nMike had no intention of doing so. Her breast was now as tall as he was, and he began kneading her flesh with his free hand, and laying kisses all over her skin. Chelsea let out a sigh of pleasure, and began to work her clit over really hard. \"Bigger, I want more, so much more.\"<br>\r\n<br>\r\nMike did what he could to increase the output. Her tits climbed higher and higher, pushing him back further an further. Suddenly, with a bump on his back, he turned to see that he had hit the wall. Looking around now, he saw that Chelsea's tits were close to filling the entire room. She was moaning really loudly now.<br>\r\n<br>\r\n\"Oh god, I can feel the walls, the floor, the ceiling... all of it pushing on my tits. Ngh, oh it feels so good. Keep going, please, never stop. I want to fill this room. I want to break through it. I'm.... mm, I'm so close...\" Her breathing was getting labored as her fingers drove her closer and closer to climax.<br>\r\n<br>\r\nMike knew he was potentially in some very grave danger being pressed so tightly between her breast and the wall, especially if that wall was to be broken through, but he was also close to climax himself, and that was a very difficult urge to resist. Taking a moment to pause and reason things out, he decided to...</span></div></div>",
            "created":1346028660,
            "id":1414210,
            "title":"GO FOR IT YOU DUMBASS!"
        }
    },
    "info":{
        "author_id":"darps3",
        "author_name":"dasan15",
        "brief_description":"She is vary busty and really big",
        "created":1166925300,
        "description":"<td align=\"left\" class=\"norm\">Your Mike who just invented the growth ray and decided to suprize your favorite porn star, Chelsea Charms with (if you want to know more about her you can check her out on her website Chelsea Charms.com). She has the biggest breast in the porn business and you have the chance to make her the biggest person in the world.<br>\r\n<br>\r\nRules:<br>\r\nOnly rules are no deaths you can add more characters but Chelsea is the only giantess. </td>",
        "id":1193752,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1451944860,
        "modified":1451944860,
        "pretty_title":"Chelsea Charms: Big Breasted Giantess"
    }
}