{
    "chapters":{
        "1":{
            "author_id":"misty_crom",
            "author_name":"Misty_Crom",
            "choices":[
                "Cafe at around 3pm",
                "Cinema at 8pm",
                "In bed whilst you sleep",
                "WHSmiths, 4pm",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Okay, before I start, I realise I forgot to include the list of what you can change into in the intro and I can't edit it, so I'll put it here. Apologies for awkwardness.<br>\r\n<br>\r\nFox - 3 - 4 ft tall (Arctic for around 3ft, Red for around 4ft)<br>\r\nSquirrel - 1ft - 18 inches tall<br>\r\nMouse - 4 - 6 inches tall<br>\r\nFennec Fox - 18in - 30 inches tall<br>\r\n<br>\r\n________________________________________________________<br>\r\n<br>\r\n<br>\r\nYou're a 26 year old English guy; 5' 4, slim build - probably slightly underweight, reasonably tallented martial-artist.<br>\r\nYou lost your job ages ago - not that that was too bad a thing, you figure you're probably better without it. Despite your best efforts, you dont seem to be having any luck. with finding a job or a girl. Shyness doesn't help, nor does the fact that you don't drink or smoke. and as for going to a nightclub for the music? No thanks, you'd rather eat your own hands.<br>\r\n<br>\r\nThat said, you are personable when you are with people and people do tend to like you. Good guys finish last. Yep, seems right.<br>\r\n<br>\r\nanyways, enough of depressing you readers with the depressing lot I've given you (:P), lets get to the main yes? <br>\r\n<br>\r\nWell, first off, when and where does it happen? <br>\r\n<br>\r\n</span></div></div>",
            "created":1182087720,
            "id":417429,
            "title":"Begining"
        },
        "11":{
            "author_id":"misty_crom",
            "author_name":"Misty_Crom",
            "choices":[
                "Mouse",
                "Squirrel",
                "Fox (red/Arctic)",
                "Fennec Fox",
                "Other (alternate chapter, something else... up to you)"
            ],
            "content":"<div class=\"\"><div> <span>You've been wandering around town for a while when you decide to head to Le Petit Four Francais, a French cafe (no... really?) for something to eat and a nice cup of tea. Smiling politely at the simply gorgeous waitress as she greets you, you take a seat at the second table back in the middle. All the window seats are taken. As soon as you're sat, the same girl's stood by you. She's probably at college you figure. or only just left school. she's got perfect skin, a beautiful face and an awesome body. not overly busty or anything, but... just right for her. You've seen her in here plenty of times of course, this is pretty much where you always come. Initially it was that it was the only place that serves drinkable tea, but it's got a great, calm and relaxing atmosphere, nice music, great food and of course you've yet to see a girl working here whom you'd rate lower than 8 out of 10 if you were the sort to do so. \"Just a tea for now please. three sugars with it please.\" you reply when she asks what you want. \"Okay, I'll go get that now for you.\" she smiled sweetly. You can't help glancing at her backside and legs as she heads away. Under the dark blue skirt that reaches just below knee length, she's wearing sheer tights. Either they're white, or they're clear, and the shine makes them seem so. she also has straight brown hair that's tied back in a simple pony-tail which sways slightly across her back. <br>\r\n<br>\r\nOnce you've ordered your food - just having a mixed fruit tart today, you turn to your tea. They just put the water and tea bag in the mug, spoon by the side ad a little jug of milk. This is why the three sugars. you take two, but given the mug/sachet size, you need three to balance it out. <br>\r\n<br>\r\nAs you take a sip to check it doesn't need more milk or stiring, as you set the mug back down, you get a sudden head rush that makes you almost drop the thing. For a moment, your head is agony, like you just whacked it on something.  When you re-open your eyes, you cant figure out whats going on. everything's... bigger. Looking down quickly, you sigh with relief that your cloths seem to still fit propperly. <br>\r\n<br>\r\nA point that may or may not deem to be a saving grace as stood over you, plate and cutlery in hand is the waitress, and she's looking... down at you. and she looks absolutely stunned. \"Wh.. what happened? you're...<br>\r\n<br>\r\n</span></div></div>",
            "created":1182089520,
            "id":555515,
            "title":"Just going for a quiet cuppa... or not"
        },
        "111":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "Izz thinks she's seeing things ",
                "Izz trys to coax you a bit ",
                "Readers choice "
            ],
            "content":"<div class=\"\"><div> <span>Cold blue eyes swerled around a shocked black pool. A un-tended strand of golden hair escaped her band, waving over her face. A tray of red glided carefully towards the table, laying at rest. Your eyes searched her face, her pony tail flopped carelessly behind her head. The croud and noise seemed to become quiet in awe as there eyes locked briefly. The motion began with a poke.<br>\n<br>\n------------------------------<br>\nIzz's view<br>\n------------------------------ <br>\n<br>\nIzz gazed curiously at the mouse, her mouth slightly open.<br>\n\"God... he seemed so nice too... but forcing a mouse to dress up?\" She glowered, angrily picking the mouse up and trying to take it's clothes off,<br>\n\"Wait a second!\" She paused, glancing behind her,<br>\n\"Hello?\" A shriek ecoed out and the sound of plates smashing on the cracked floor could be heared.<br>\n\"Mouse!\" She shrieked, her hand to her mouth in horror. A stunned silence came to the room.<br>\n\"Hey, it's fine! I'm taking care of it!\" She cradled the mouse in her arms, walking out of the door with her mobile phone out.<br>\n\"Wh.. what's going on?\" A tiny voice whispered out. Izz looked up at the empty street. A small crisp packet tumbled past the cracked pavement. Her eyes flickered up and down the street with curiousity.<br>\n\"Hello?\" She paused.<br>\n\"Hello\" The voice replied. She looked down at the mouse, her phone shattered into a million pieces as she jutted a finger at the mouse, prodding it.<br>\n\"You... can talk!?\" She eyed the mouse, red eyes shone back, brown hair like autumn and teath of a rodent. Yet it stood like a human and acted like one, amazing.<br>\n\"Why shouldn't i?\" The mouse looked back in horror.<br>\n<br>\n------------------------------<br>\nYour view<br>\n------------------------------ <br>\n<br>\n You gazed in horror at the pink serpent prepared to strike, you might only have seconds. You try to bat the snake away, but it acted like a third arm. A pause came out, lond and slow.<br>\n\"I have a tail?\" You looked at the waitress in dispare. Panic crept over. </span></div></div>",
            "created":1233957840,
            "id":643385,
            "title":"Wairess, theres a mouse! "
        }
    },
    "info":{
        "author_id":"misty_crom",
        "author_name":"Misty_Crom",
        "brief_description":"You're a normal(ish) 26 yr old guy. One day you suddenly find yourself furry and shrunk.",
        "created":1182087240,
        "description":"<td align=\"left\" class=\"norm\">You're a normal(ish) 26 yr old guy. Out of work for a fw months now, finding work's tougher than you figure. You're not the most social of types either. No hermit, just not the type for clubs.<br>\r\n<br>\r\nOn day, you suddenly turn into a furry. an anthropomorphic animal. But unlike the ones you see of mostly on the web, you're not human sized. but what? Where? When?<br>\r\n<br>\r\nrated 18+ because sex and violence is okay. but nothing too graphic on the latter please. <br>\r\n<br>\r\nKeep it creative, but at the same time try to keep it real-ish at least. <br>\r\n<br>\r\nanyways... Have fun and please add.<br>\r\n<br>\r\nGift-points given for good chapters</td>",
        "id":1278239,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1233957840,
        "modified":1233957840,
        "pretty_title":"A Little Change Can Be A Good Thing"
    }
}