{
    "chapters":{
        "1":{
            "author_id":"gunsblazin88",
            "author_name":"gunsblazin88",
            "choices":[
                "Jessy",
                "Cassie",
                "Emily",
                "Sofie",
                "Jen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You where walking down the steaming summer sidewalk, \"Oh my God I need to go inside\" you said as you slowly sulked down the road. You wanted to visit a friend, Who was it?</span></div></span></div>",
            "created":1211237580,
            "id":533865,
            "title":"Beggining"
        },
        "15":{
            "author_id":"251enon",
            "author_name":"152",
            "choices":[
                "Pulled out what looks like a toy gun (shes gonna shrink you)",
                "Gave you a simple hug and kiss",
                "Says to meet her in her room"
            ],
            "content":"<div class=\"\"><div> <span>You went inside of Jens house and then you Jen your girlfriend it looks like every time you see her she looks more beautiful shes wearing a blue tank top short shorts and no socks or shoes. Although you notice something different about her its her smile it seems rather sinister. You then say to her is there something wrong Jen. You asked. She then said oh nothing  just happy to see you that's all she then...</span></div></div>",
            "created":1314467520,
            "id":1176174,
            "title":"Jen"
        }
    },
    "info":{
        "author_id":"gunsblazin88",
        "author_name":"gunsblazin88",
        "brief_description":"You are shrunken by a girl who has acquired a shrink ray gun.",
        "created":1211237460,
        "description":"<td align=\"left\" class=\"norm\">Hey guys! this is Gunsblazin88 who is the author of the story Trapped in A room with her. That story may have been insulting or difficult to write or add because many of you are older and my characters are set at teen ages. The story and plotline of it was set back for my age as a teen. <br>\r\n<br>\r\nAnyway this story takes place in the future of my older story. The girls and characters are older now so it is easier for you to add. One of the girls acquires a shrink ray gun and shrinks you. Instead of the character being you like in the older story, it will be told in your perspective but you now have a name. <br>\r\n<br>\r\nTechnically this is just a modified version of my old story so I apologize if I didnt impress many of you. <br>\r\n<br>\r\nThanks Alot! <br>\r\nIf you add please keep these rules in mind<br>\r\n<br>\r\nNo Gay stuff<br>\r\nNo furries or animals, unless girl swallows a fish whole or animal whole<br>\r\nKeep the story mainly focused on vore, other stuff is okay<br>\r\nNo Giants or growing men<br>\r\nGiantess is okay but mainly focus on Shrunken people<br>\r\nGive great description and try not to keep words like \"You get swallow, You die by acid\"<br>\r\nKeep chapters at least 2-3 sentences long<br>\r\nDo Not add characters unless I allow you, and if you do please write that they where not in the title after their names<br>\r\nThank You and have fun!<br>\r\n<br>\r\nJason Tran- You are a nineteen year old college student with an athletic body type, blue eyes and brown hair<br>\r\n<br>\r\nCassie Micheals- She is one of your closest friends, she has blonde hair, blue eyes, 19 years old and just loves to be talkative, popular and funny.<br>\r\n<br>\r\nEmily Shane- She is the most popular girl in school and is one of Cassie's best friends, she has a little bit of weight around her hips and belly. She likes you as a friend but really nothing more and she likes to give people their just desserts. Emily has brown hair with dyed blonde streaks and dark brown eyes<br>\r\n<br>\r\nAlice Shneider- She is a quiet girl, that is still in high school, she has alot of friends and seems to like you. She has dark brown wavy hair and beautiful green eyes. She is 18 years old<br>\r\n<br>\r\nNicky Dean- She is a loud type of girl, and the kind you can never tell what to expect next from her. She has dark brown hair and dark brown eyes and is 19 years old<br>\r\n<br>\r\nSarah Mason- Sarah is a loud popular type of party girl. She loves to be loud and funny, she also likes to eat alot but has a lean stomach. She is 21 years old and is your next door neighbor, you liked to spy on her when she went swimming in her pool. She has light brown hair and dark brown eyes<br>\r\n<br>\r\nJannete Parker- She is your real best friend and has been your friend since pre- school. You have had great times with her and you really have felt some affection for her as she seemed to expose some to you. Jannete is 19 and has sandy blonde hair and dark brown eyes.<br>\r\n<br>\r\nSian Simon- She is a friend of yours only knowing her for a few years after middle school, she has cherry blonde hair and light green eyes with a great smile. She is 20 years old and secretly likes you.<br>\r\n<br>\r\nJen Maffae- She is your girl friend, her perfect body type but being on the short side have made you love her even more. She has light blue eyes and dark brown hair. She is a bit older than you, being 20 years old.<br>\r\n<br>\r\nEmma McVae- She is one of your college partners in your biology project, you dont really like her much, being in alot of arguments with her. She has light sandy blonde hair and dark blue eyes. She is 19 years old.<br>\r\n<br>\r\nSofie McVae- Sofie is Emma 's twin sister, being the nicer of the twins she is one of your best friends. She has light brown eyes and light brown hair with her hair usually in a ponytail. She secretly loves you and is 19 years old. She has a special talent where she can swallow large objects whole.<br>\r\n<br>\r\nJessy Talls- Jessy is one of your lesser friends. She is extremely tall being 6'5 in college. Her body type is amazing and she has bright blonde hair. Her skin is tanned, full body ;) and she loves to swim and also likes to eat even though she is very skinny<br>\r\n<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":1427956,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1314467520,
        "modified":1314467520,
        "pretty_title":"Shrunken with her"
    }
}