{
    "chapters":{
        "1":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "You feel dizzy and fall over",
                "A booth selling what looks like talismans!",
                "Some kind of sleep sanctuary, looks different!",
                "A group of people surrounding a sign-up booth for a competition!",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The doors open as you see thousands of brightly colored outfits and the roar of people enjoying another day of cosplay. As you enter the door, your attention is stolen by...</span></div></span></div>",
            "created":1385417880,
            "id":1699013,
            "title":"So Much To See, So Little Time"
        },
        "11":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Some American cosplayers",
                "A japanese gang",
                "Japanese cosplayers",
                "Management ",
                "FBI"
            ],
            "content":"<div class=\"\"><div> <span>Your attention is stolen by a dizzy feeling in your head. No thoughts. Just teetering on your feet and falling backwards. <br>\r\n<br>\r\n\"There he goes!\"<br>\r\n<br>\r\n\"Wonder why it took him so long?\"<br>\r\n<br>\r\n\"I don't know, but now he's ours...\"<br>\r\n<br>\r\n\"... to do with as we please!\"<br>\r\n<br>\r\nConsciousness comes back to you slowly. The first thing you notice is that you can't move your arms or legs. you were in a chair. In a dark room. You were captured! <br>\r\n<br>\r\nBy who?</span></div></div>",
            "created":1517327340,
            "id":2446801,
            "title":"You feel dizzy and fall over"
        },
        "12":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "bent down to touch her toes!",
                "began to get changed into street clothes",
                "slid down to take a seat",
                "slipped off her high heels",
                "grabbed her stomach as it began growling for food"
            ],
            "content":"<div class=\"\"><div> <span>“Sir! Sir! Come over here sir!” a woman shouted as you entered the doors in your home-made wizard outfit. As you looked around at the detailed costumes people flocked by you in, you felt like a pit was opening in your stomach. Even in the place you were supposed to fit in most, you felt like an outsider. You hung your head in despair, wondering if you should just turn and leave when suddenly a hand clasped your arm and began dragging you over. You looked up in shock and felt your jaw hit the floor as a girl in a perfect super-girl outfit was pulling you towards the booth with the woman sales-person (<a rel=\"nofollow\" href=\"http://www.comicbooktherapy.com/wp-content/gallery/soni-aralynn/539357_119795378169450_1151815120_n.jpg\" target=\"_blank\">http://www.comicbooktherapy.com/wp-conte...</a>).<br>\r\n<br>\r\n“Cheer up, the costume is good, you just need a few touches!” the girl in the outfit said as she picked up what looked like an old talisman from the table and held it up next to you.<br>\r\n<br>\r\n“That’s a powerful one, it grants a person’s strongest desire,” the saleswoman said as you couldn’t take your eyes off the beautiful girl looking at you so intently. You felt your face turn red as she smiled and dropped some cash on the counter. Quickly she hung the talisman around your neck and grinned.<br>\r\n“Perfect, that was what you needed! Just smile man, this is supposed to be fun!” she said as she began walking away gracefully. You stood frozen for a moment as you felt your heart yearning to follow her, a crowd forming a cocoon around her as she strode through them like a queen in her court. As she disappeared in the crowd of cameras and cosplayers, you felt a cold sting in your heart as a tear rolled down your face.<br>\r\n<br>\r\n“I want to be near her,” you said under your breath as the tear rolled off your face and fell onto the talisman. The paper began to glow softly as you looked down in wonder and confusion. Franticly, you tried to get it off, but found that you could no longer find the strings that were attached to it before. You felt a searing pain in your chest as you ran for a bathroom. <br>\r\n<br>\r\nBANG!<br>\r\n<br>\r\nThe door shut behind you as you clawed at the robes clinging to you, tearing them away to reveal a bright red vision of the talisman’s writing etched into your skin. You ran your fingers over it as you stared incredulously at your reflection. The image grew a brighter red as pain seared your chest again and you closed your eyes tightly, a jolt of electric pain running through your body. Almost in an instant, the pain was gone, replaced with the gently feeling of wind on your bare chest. Opening your eyes, you saw that the talisman markings were gone from your chest…but something was wrong with the floor…<br>\r\n<br>\r\nBOOM!<br>\r\n<br>\r\nThe tremor knocked you on your face as a huge shadow was suddenly cast over you…<br>\r\n<br>\r\nBOOM!<br>\r\n<br>\r\nYou looked up as you saw a thick black tower standing up before you…the back of a woman’s high heel. Slowly, you raised your head till you were once again staring at the back of the super-girl…but there was one small difference. She was gigantic! You stifled a scream as you tried getting up, slipping as you realized you were resting on gravel, but to you it was like trying to walk through a quarry. You slid on a small rock and fell on your ass as the giantess turned around on her heel, the sound of hundreds of rocks crunching under her massive foot as she gracefully swirled made you shudder. Looking forward, you gulped as you saw her toes behind a mesh of black stockings, each toe as big as a cottage to you as they scrunched in their prison (<a rel=\"nofollow\" href=\"http://www.j1studios.com/wordpress/wp-content/uploads/2012/11/37775_119795318169456_1931246342_n.jpg\" target=\"_blank\">http://www.j1studios.com/wordpress/wp-co...</a>). <br>\r\n<br>\r\n“Look, just tell them I’m flattered but I can’t make the panel that day, I’m already booked solid,” the giant woman said as she spoke into her telephone, leaning against a wall taller than you could fathom. Her foot slid forward towards you as her high heels loomed down at you menacingly. <br>\r\n<br>\r\nCRUNCH!<br>\r\n<br>\r\nThe gravel quaked as she leaned forward again, shifting her weight onto it as she smile and hung up the phone. “Good job Soni!” she said to herself as she slid the phone into her bag and pulled out a can of soda. The sound of carbon dioxide entering the air was welcome as she brought the can to her mouth and began to drain it, massive bulges flowing down her elegant throat one after another. Smiling, she pulled the can away and crumpled it in her grip, smiling as the image fit well with her heroine’s outfit. <br>\r\n<br>\r\nBUUUUURP!<br>\r\n<br>\r\nThe giantess laughed as she patted her stomach, the belch echoing above you as she set her bag down and stretched up high, her body sore form posing all day. You watched in awe as the graceful giantess…. </span></div></div>",
            "created":1385434980,
            "id":1699106,
            "title":"Stunning Soni!"
        },
        "123":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "you suddenly grew a little in her hand!",
                "you began to shrink more!",
                "you were pulled off the side and came lose from the threads!"
            ],
            "content":"<div class=\"\"><div> <span>You stood transfixed as Soni’s arms came back down, slapping against her sides as they hung loosely, the super-girl looking very uncharacteristically tired. She steadied herself and took a deep breath, straightening up as she tried striking the super-girl pose once more, but as she did, a wave of exhaustion rolled over her (<a rel=\"nofollow\" href=\"http://templardigital.files.wordpress.com/2012/09/soniaralynn12.jpg\" target=\"_blank\">http://templardigital.files.wordpress.co...</a>). The gravel looked comfortable to her. Soni yawned as she let the can drop from her hand, watching as it bounced off the hard gravel floor and awkwardly rolled away from her. Slowly, she began to squat more and more, her feet grating across the ground as they grew further and further from the wall.<br>\r\n<br>\r\nGRRRRRRRR<br>\r\n<br>\r\nYou fell on your ass as the black train of her high-heels skid mere inches past you, kicking up gravel that battered your body. You looked as you saw the wedge of the heel cutting across the gravel like a massive ski on rough ice. But as you saw her feet retreat, you realized something was wrong…or rather the pit in your stomach told you that something important was being forgotten. Darkness was suddenly engulfing you as you realized what you had forgotten about… Soni’s ass was descending upon you. Looking up, you saw as the red booty-shorts stuck true to their name and wrapped tightly around her toned behind as it came down upon you like the sky itself had broken lose (<a rel=\"nofollow\" href=\"https://www.facebook.com/photo.php?fbid=248072852008368&amp;set=pb.111744362307885.-2207520000.1385436061.&amp;type=3&amp;src=https%3A%2F%2Ffbcdn-sphotos-f-a.akamaihd.net%2Fhphotos-ak-prn1%2F881911_248072852008368_561148963_o.jpg&amp;smallsrc=https%3A%2F%2Fscontent-b-lga.xx.fbcdn.net%2Fhphotos-ash3%2F9825_248072852008368_561148963_n.jpg&amp;size=1200%2C1200\" target=\"_blank\">https://www.facebook.com/photo.php?fbid=...</a>)! You began running for your life as the red orbs fell upon you, making first contact with the gravel a mere few feet behind you as they shook the ground like an earthquake!<br>\r\n<br>\r\nBOOOM!<br>\r\n<br>\r\nTumbling, you fell as you saw a wall of red approaching you at breakneck speed. Fumbling around, your arms wrapped around a pointed stone as you clung to it like a life raft in the ocean. The rock was a godsend as it created a small dome under Soni’s rear, like an umbrella in a downpour. Looking up, you saw as red threads hung down loosely, the stone’s point cutting away at the material as Soni let more and more of her weight down.<br>\r\n<br>\r\n“Ow!” Soni yipped as she raised her butt in the air, the threads wrapping around you and the rock as you were suddenly hoisted into the sky by your crush’s ass. <br>\r\n<br>\r\nFOOM! <br>\r\n<br>\r\nIt was like a shockwave rippled across a lake as Soni’s rear froze in the air. You could feel tiny tremors shake the threads of her shorts as her muscles tensed ever so slightly with her every motion. An acute sense of vertigo made you lose what little food you had eaten as you tried to get your bearings, your body spinning as you were still suspended by threads of red fabric. As your body hung limply, Soni was still frozen as she looked down at the ground to see if there was anything obvious mixed in with the gravel that she had perched her posterior on. Seeing nothing she slowly lowered herself again, feeling the cold stone under her ass.<br>\r\n<br>\r\n“Ouch!” she shouted as she once again shot her pelvis up in the air, an acute sting in her butt telling her that whatever the problem was, it was still unresolved. Slowly, she lifted a hand from the ground, rubbing her fingers over her palm to knock off lose pieces of gravel that clung to her palms. She felt as her hand made contact on her lower thighs, and then traced her way back up to her ass, cupping it in her hands as she slowly began to investigate.<br>\r\n<br>\r\nYou shuttered as you were suddenly between Soni’s fingers, her hand clasping her butt right where she had felt the sharp pain when she sat down. Her fingers were upon you quickly as they began feeling around her rear for the point of contention. Her index finger bumped into you and the rock just briefly, but it was all she needed. You soon found yourself wrapped in her fist as Soni plucked you and the stone from the web of threads and swiftly brought you to her face. <br>\r\n<br>\r\nAs her fingers unfurled, you could only look up at her face in total awe as you drank in the sight of the girl that got you into this wonderfully dangerous mess in the first place. And for a brief moment, you felt a slight tingle where the talisman had etched itself onto your skin. The moment quickly deteriorated as you pieced together what the expression Soni had on meant…she hadn’t noticed it was you in her hand. Her nose crinkled as she stared at the rock that had just given her one more shock than she wanted that day. She sneered as she began to slowly tilt her hand to the side. The rock began to slide down her palm, and the threads still entangling it quickly wrapped around your leg. As you were pulled down by the stone, you looked up at Soni’s face and again felt a familiar pain in your heart, the pain of going unnoticed. Your chest burnt again as….<br>\r\n</span></div></div>",
            "created":1385439480,
            "id":1699132,
            "title":"Please Remain Seated for Your Safety "
        },
        "13":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "Smiling down at you",
                "looking down as the word \"bug\" came from her mouth",
                "turning to leave the room",
                "getting changed",
                "clutching her stomach in pain, either hungry or indigestion, neither good for yo"
            ],
            "content":"<div class=\"\"><div> <span>Lying back in the seat you had been led to, you felt your heart pound with excitement. You had heard about this event for weeks leading up to the Con, and now that you were reclining back, your heart kept hammering with excitement. The glass came over the sleeping pod as the room went dark and the screen above you flashed on. Glowing in pixilated perfection was the second reason you had been excited for this experience, Allison Scagliotti waved as the presentation got underway. <br>\r\n<br>\r\n“Welcome fans of Warehouse 13 to our main event! The seat you are in now is part of a brand new experience being offered for the first time here today! You’re going to feel a slight headache in a minute, but don’t worry, it’ll pass!” she said as the visor above you suddenly came down. Closing your eyes you felt like your head was going to pop for a brief second as the pressure equalized. Suddenly, you felt a breeze over your body. <br>\r\n<br>\r\nYour eyes opened to suddenly see a vast landscape rolling out ahead of you…and a booming voice.<br>\r\n<br>\r\n“You should all now be in your very own lucid dream! Enjoy, and have fun in Dreamscape!” Allison’s voice echoed like thunder around you. You could feel your heart going a mile a minute as you thought about how lucky you were to be one of only 10 people who got this chance for testing! Running along the smooth ground, you smelt something strangely fragrant in the air as you reached the edge of the cliff you started on. You couldn’t wait to explore your dream, you thought as you suddenly tripped over something, tumbling to the edge. Groggily, you shook yourself off as you looked down…and then felt a tinge of fear. <br>\r\n<br>\r\nYou were clearly looking down off what had to be a tremendous cliff, but somehow at the bottom of it was a shoe…one that must have been as big as a football field. Looking up, you felt your stomach plummet as you finally recognized the alien landscape around you….it was a room. But the room was bigger than anything you had ever experienced…almost like you were bug sized. Suddenly you felt queasy, you had always had these kinds of dreams before, they always happened when you went to sleep too excited…. Fuck. You weren’t in a lucid dream anymore; you were in a lucid nightmare. <br>\r\n<br>\r\nBOOM! BOOM! BOOM!<br>\r\n<br>\r\nThe nightmare always started like this, the ground rumbling as a titan-like person appeared, totally unaware of you. You could feel your heart hammering as the massive door on the other side of the room opened…and in walked Allison.  Looking around, you realized the stupid dream had put you on the vanity in a mock-up dressing room, with discarded clothes barring your way on every side as the giantess approached (<a rel=\"nofollow\" href=\"http://img005.lazygirls.info/people/allison_scagliotti/allison_scagliotti_foto_por_wittyhandle_instagram_D80pCcr4.sized.jpg\" target=\"_blank\">http://img005.lazygirls.info/people/alli...</a>).<br>\r\n<br>\r\nYou watched as you were soon level with her stomach, looking at the tan wall of skin before you as she began to lower her bag onto the table. The dream normally ended like this, crushed under something without being able to move, but this time the damn program was actually on your side for once. While you couldn’t make her stop, you could move! Running forward, you jumped off the edge of the table as her bag slammed down right where you had been not even a second ago. The shockwave rocked you in the air as you began plummeting to the ground. <br>\r\n<br>\r\nTerrified, you wished for a way to land softly, a parachute, or anything! <br>\r\n<br>\r\nWOOSH!<br>\r\n<br>\r\nYou began to lift suddenly as a glossy pair of wings sprouted from your back. Frantically, you tried to fly with them, but found you could just barley glide as you slammed into something soft…and warm. Looking at the ground, you recognized the color as the same creamy tan of Allison’s skin. As you tried getting up, the ground shifted as you were thrown on your back, and found yourself looking up at the massive form of Allison as she continued to work on the desk. Flipping back over, you again felt your stomach drop in panic as you could clearly tell what the five jutting shapes ahead of you were…. Allison’s toes (<a rel=\"nofollow\" href=\"http://www.wikifeet.com/pictures/Allison-Scagliotti-Feet-328554.jpg\" target=\"_blank\">http://www.wikifeet.com/pictures/Allison...</a>). <br>\r\n<br>\r\nYou tried standing up to run, but tripped on one of your wings and ended up tumbling to the thong of the sandal she was wearing. Grabbing onto the leather strip, you felt the world shift as you looked up to see Allison…<br>\r\n</span></div></div>",
            "created":1396226280,
            "id":1770862,
            "title":"Nightmares do Come True"
        },
        "133":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "She feels you",
                "you are crushed...waking up to a new nightmare",
                "she begins grinding her foot on you"
            ],
            "content":"<div class=\"\"><div> <span>Allison turned too quickly as the towering woman went to leave. You were thrown as she pivoted her feet; the toes of her left foot now even with the heel of her right. The dead-stop they came too sent you flying forwards towards her other sandal! The thick pale strap was headed right towards you (or rather you towards it) as you flew through the air. The band of fabric was all that stood between you and the hellish crevice between the cupped back of the sandal and Allison’s heel! Reaching out, you felt for a moment that you might just be able to reach it!<br>\r\n<br>\r\nWHOOSH!<br>\r\n<br>\r\n Your hand went through it as though it were vaporous…nightmares do not play fair you remembered as you slammed, hard, into the back of her sandal without the slightest bit of mercy from the materials (<a rel=\"nofollow\" href=\"http://www.listal.com/viewimage/4272679\" target=\"_blank\">http://www.listal.com/viewimage/4272679</a>). <br>\r\n<br>\r\nCLANG!<br>\r\n<br>\r\nThe impact was tremendous for you as you could only lie back against the cold steel of the zipper, the tan wall basking in shadow before you refusing to stop spinning. Nauseous, you cursed the reality of this damn machine as the ground began to once again move! As her foot lifted up, you saw what you feared from the moment you landed back here. The damn nightmare was playing tricks on you as you saw a red smear on the bottom of her heel, most likely your minds way of saying that going under was game over for you at this size. <br>\r\n<br>\r\nBOOM!<br>\r\n<br>\r\nThe wall before you slammed down as you saw her heel turn white from the base as her weight came down upon it. Reaching out, you couldn’t help but touch it as it bulged towards you. Your hand brushed against it as you felt how warm her foot was…and how soft as well! As Allison suddenly came to a stop, you slammed against her foot, feeling just how soft and warm it really was, like a bed! But your impact wasn’t unnoticed (<a rel=\"nofollow\" href=\"http://www.zap2it.com/media/photo/2009-07/48293352.jpg\" target=\"_blank\">http://www.zap2it.com/media/photo/2009-0...</a>). The world shifted a little as you suddenly heard a grating sound above you.<br>\r\n<br>\r\nZRRRRRRR!<br>\r\n<br>\r\nThe zipper was coming down as Allison inserted a finger before you, her nail almost slicing off a very important area by sheer millimeters as it slid underneath her massive heel. You saw as her finger pushed against it, lifting the heel free as her knuckle slammed into the wall of the heel cup above your head. You watched as you saw the red spot suddenly come closer and closer…as her heel was repositioned to right on top of you.<br>\r\n<br>\r\nBOOM!....ZRRRRRRRR!<br>\r\n<br>\r\nYou were zipped into place as Allison let her full weight come down on top of you, nearly crushing you into another red blotch yourself. You got a face-full of her foot as you were suddenly unable to breathe, the crushing force of her body coming down on you intensely. It felt like you were being smothered as you tried to put your arms up to defend yourself from the onslaught of sole. But it was useless, her soft skin was unyielding as her heel came down on you step, after step, after step…<br>\r\n<br>\r\nBMMMMMM!<br>\r\n<br>\r\nYou heard a kind of electric hum as the horrible stamping stopped. For a moment, you thought things might actually be over…. But then you wouldn’t still be dreaming would you? An explosion of sound nearly made you deaf as the heel suddenly slammed down on you more forcefully than it ever had before! <br>\r\nYour dream Allison was busy playing guitar as she tapped her heel to the beat of her songs (<a rel=\"nofollow\" href=\"http://www.celebritywallpapers.ws/Celebrities/Allison_Scagliotti/Allison-Scagliotti-005.jpg\" target=\"_blank\">http://www.celebritywallpapers.ws/Celebr...</a>).<br>\r\n<br>\r\n As her heel continually beat down on you, the nightmare decided to get creative with the horror as…<br>\r\n</span></div></div>",
            "created":1396230960,
            "id":1770898,
            "title":"Walking the Beat"
        },
        "14":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "her foot lifted in the air again",
                "she began to slide her foot out of the shoe",
                "she dropped a pen under the table",
                "her phone buzzed next to her foot",
                "she suddenly looked down and spotted you"
            ],
            "content":"<div class=\"\"><div> <span>“Ladies, and gentlemen! Please keep an orderly line!” the booth’s attendant roared as the swarm in front of the stand began to form a rudimentary order. You looked on, perplexed as you began drawing towards the commotion, wondering what the excitement was all about. As the crowd began to grow thicker you noticed a banner flying high above the stand, outlined in bold letters and bright colors.<br>\r\n<br>\r\n“WIN A DATE!” shined glaringly through the obnoxiously designed banner, images of some of your favorite cosplayers spread over it.<br>\r\n<br>\r\nYour heart stopped for a moment as you realized what everyone was so excited about. You could win a date with an idol and all it cost was $5 as an entry fee. No one needed to say anything more as you pressed your way into the serpentine line that was rapidly growing by the minute. The stand was easily the main attraction as it was soon flooded with more patrons than it could handle. You were knocked against and crushed between bodies, outfits, shields, plastic swords and weapons of all kinds. It was a mythical mosh-pit as you finally managed to push your way to the front, your money snatched up immediately as a piece of paper and a pen was slapped down on the table. You hastily scribbled your name down and felt as the crowd ejected you to make room for the next entrant. For the next hour you sat with the crowd, waiting in anticipation as name after name was dropped into a large dish. Finally, the head of the stand called for quiet and raised the bowl of names above his head. <br>\r\n<br>\r\n“There will be two winners in this!” he cried, arousing a huge cheer from the crowd. He cleared his throat as the screams settled down, “Like I said, there will be two winners who will participate in a final round challenge! Everyone who entered please feel free to watch here!” He said as two strong men brought in a huge flat screen TV and turned it on, revealing a screen of static.<br>\r\n<br>\r\n“Just pick the winners already!” someone screamed from the crowd as the ocean of people once again grew tumultuous with jeers and calls.<br>\r\n<br>\r\n“Ok, ok, calm down! Our first winner is…” the man said as the cheer went up. You couldn’t hear what was said, but nearly cried as you saw your name, clear as day on the screen! Waving, you pushed your way up through the crowd and waved your hands as you were pulled up onto a stage, where applause rained down on you. Smiling, you waved as you soon were guided back into a tent. <br>\r\n<br>\r\n“Please take a seat,” a man said as you entered a surprisingly empty space. There was a small table on one side with a briefcase, a chair in the middle, and a computer set up on a desk before the chair. Taking a seat, you heard the main open the briefcase as the computer flashed to life, revealing the face of a drop-dead gorgeous young woman.<br>\r\n<br>\r\n“Who is that?!” you said, your heart racing.<br>\r\n<br>\r\n“That would be Olivia Alexander, actress, and one of the big guests we have with us this year,” the man said as you heard what sounded like glass shifting. You were transfixed on her as the slide changed to a image of her face with wild red hair and a mischievous grin on it (<a rel=\"nofollow\" href=\"http://smhttp.13422.nexcesscdn.net/80666D/KillerCDN/wp-content/uploads/2011/12/o21.jpg\" target=\"_blank\">http://smhttp.13422.nexcesscdn.net/80666...</a>).<br>\r\n<br>\r\n“This is who my date is with?” you said, dumbfounded.<br>\r\n<br>\r\n“IF you win the challenge, yes,” the man said as he seemed to draw closer. Suddenly you felt a sharp pain in your arm. Your head snapped to the side to see a needle lodged in your body as you suddenly got up to run. It was like a wrecking ball hit you as the man hit you in the gut and sat you back in the chair, just as the screen changed to a clip of your future date in some kind of movie as a giantess.<br>\r\n<br>\r\n“You son of a bitch, what did you just do?” you said as you felt like you were getting weaker and weaker by the second. <br>\r\n<br>\r\n“You signed the contract kid, don’t blame me. Now listen well, your challenge is to get Olivia’s attention before the other contestant does. If you do get in contact with her, she’ll know what to do from there. Now be a good brat and go to sleep!” the man said as you felt the exhaustion mounting. You slipped forward and hit your head on the table as the light began to fade. The last thing you saw was an image of your date in a cat fight with another girl as you finally passed out.<br>\r\n<br>\r\nBOOM!<br>\r\n<br>\r\n“Fuck!” a voice shouted as you suddenly jerked back to life. Looking forward, you saw as someone was running towards you frantically. Your head hurt as you wondered what was wrong with the guy, he looked scared out of his mind as-<br>\r\n<br>\r\nBOOM!<br>\r\n<br>\r\nYou felt a warm pool by your crotch as you pissed yourself. A shoe the size of a small house just landed right behind the man, bringing him down as you only saw him screaming, the sound not making it to your ears as they continued ringing from the foot’s impact. It felt like you were paralyzed as you saw the man clawing at the ground, desperately trying to crawl away as the foot seemed to shift forward more and more. His face grew more desperate as it reddened with each passing second. Like a horror movie on mute, you could only watch as the silent nightmare came to a climax. The man grew red as a cherry tomato, right before he popped like a balloon filled with red paint.<br>\r\n<br>\r\nSQUELCH!<br>\r\n<br>\r\nThe sound was back on as you looked up the massively long legs before you to see Olivia chatting away at the signing table you were under (<a rel=\"nofollow\" href=\"http://a.images.blip.tv/ComicsOnline-SDCC2012AttackOfThe50ftCheerleaderJenaSimsAndOliviaA764-920.jpg\" target=\"_blank\">http://a.images.blip.tv/ComicsOnline-SDC...</a>). She had no idea what she had just done, and it seemed like it would be your turn next as….<br>\r\n</span></div></div>",
            "created":1385428860,
            "id":1699074,
            "title":"Attack of the 50ft Blind Date!"
        },
        "15":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "You woke up shrunken by a celeb panel",
                "other",
                "other",
                "other",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some more options!</span></div></span></div>",
            "created":1385950020,
            "id":1701686,
            "title":"other"
        },
        "151":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "Jael's fingers were coming down towards you",
                "Jael was getting up",
                "You began to slide off the side of her foot!"
            ],
            "content":"<div class=\"\"><div> <span>You woke up in the ditch of a strange valley. Looking around, you saw what seemed like the face of a black cliff rising up so high it hurt your neck to crane and see it. You trudged towards it slowly, your body stiff as you struggled not to trip over the uneven ground you found yourself upon. Nearly slipping, you put your hands to the ground and noticed something very odd about what you were standing on…it felt a lot like plastic. <br>\r\n<br>\r\nAHHHHHHH!<br>\r\n<br>\r\n\tIt sounded like deafening thunder as you suddenly felt the ground below you rumbling with a rhythmic beat to it. Looking around, your heart nearly stopped as you saw the towering figure of Jael  de Pardo approaching. She was waving and smiling as she looked elsewhere. Suddenly it hit you; there was a panel today that Jael was supposed to be a big part of. Well, the big aspect was certainly there you noted as she suddenly was next to you, her knees coming even with you as the rest of her seemed to stretch up unfathomably high. Her hand grabbed the cliff as it suddenly clicked that you were in her chair. As she pulled it out, you lost your balance and fell, looking up at her like a bug might look up at a child about to squish it (<a rel=\"nofollow\" href=\"http://desktop.fansshare.com/gallery/photos/11258720/jael-de-pardo-cleavage-haunted-highway-ozark-howler/?displaying\" target=\"_blank\">http://desktop.fansshare.com/gallery/pho...</a>)!<br>\r\n<br>\r\nBOOM!<br>\r\n<br>\r\nYou looked up slowly at Jael’s backside as she stood in front of the chair, waving to the crowd of fans. Looking around, you saw you were right in the middle of the seat, directly where her ass would land the second she decided that the waving had been enough. You pushed yourself to your feet and began running as fast as you could towards the archway of her legs. The chair shook as Jael began to lower herself down. You could see the fabric of her jeans cling to her ass as it approached you.<br>\r\n<br>\r\n“Fuck! I AM NOT GOING TO DIE LIKE THIS!” you screamed as you sprinted with all your might, just making it as you felt your body get lifted by a gust of wind as the crotch of Jael’s jeans came down right behind you.<br>\r\n<br>\r\nThe gust was stronger than you thought as it sent you flying over the precipice, leaving only empty air below you as you began a free fall from the sky! Reaching out, your hand grasped hold of the fabric of Jael’s pant leg as you suddenly felt the pull of your body as it tried to stop.<br>\r\n<br>\r\nBAM!<br>\r\n<br>\r\nYou smacked hard against Jael’s shin and continued falling down, smacking against her leg and gripping hold of her jeans to try and slow your descent as much as you could. As you neared her foot, you found yourself getting stuck more and more in the fabric of her jeans till you were soon tumbling head-over-heel down a crease towards her foot.<br>\r\n<br>\r\nSMACK!<br>\r\n<br>\r\nThe air was knocked out from you as the leathery strap of Jael’s sandal caught you right in the stomach, making you feel nauseas as you tried to keep your breakfast down (<a rel=\"nofollow\" href=\"http://pics.wikifeet.com/Jael-De-Pardo-Feet-733476.jpg\" target=\"_blank\">http://pics.wikifeet.com/Jael-De-Pardo-F...</a>). The momentum faded as you hung limply from the strap, slipping off and landing on the warm skin of Jael’s barefoot. Looking up, your rest was short lived as….<br>\r\n</span></div></div>",
            "created":1385956080,
            "id":1701744,
            "title":"Fact or Fucked?"
        },
        "152":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "trying out some new game systems",
                "changing into her costume for the day",
                "everything she needed to get ready for the next day at Con"
            ],
            "content":"<div class=\"\"><div> <span> You dodged just in the nick of time as the massive figure landed next to you, kicking up debris as the impact created what felt like a small storm! Quickly, you scuttled to your feet as you brushed off some of the dirt that was sticking to you. For a brief moment, your heart was skipping a beat as you thought you were like a real anime hero. But the moment passed as the shadow of the colossus before you were once again hanging dangerously over you. Looking up, all you can see is a dirt-encrusted ceiling above you; it looked like the roof of a cave was hanging above you as it began to slowly descend once again.<br>\r\n<br>\r\n\tBOOM!<br>\r\n<br>\r\n\t“Fuck!” you screamed as you realized the backpack you had with you was wedged underneath a small tread before you. It felt like your heart was going to burst as you swallowed your fear and began inching towards it. Life threatening danger or no, there was no way you were going to abandon all the things you managed to buy at this Con.<br>\r\n<br>\r\nGrabbing the strap of your bag, you began to pull harder as you noticed half of it was crushed underneath the brown structure that had nearly crushed you more times than you could count in the last few minutes. Pulling with all your might, you heard a ripping sound as your arms burned with exhaustion.<br>\r\n<br>\r\n\tRIIIIIIIIP!<br>\r\n<br>\r\n\tFalling flat on your ass, you looked up at the towering form of Amie Lynn that hovered above you, posters and comics raining down on you as the collection in your bag rained after the explosive tear (<a rel=\"nofollow\" href=\"http://i1.ytimg.com/vi/AmK5CUaZPtg/maxresdefault.jpg\" target=\"_blank\">http://i1.ytimg.com/vi/AmK5CUaZPtg/maxre...</a>). The giant cosplayer was busy trying to buy some new jewelry at a stand as you had been struggling at her sandals for the last few minutes. Every time she shifted it was another life or death situation for you as her treads almost crushed you. Now, as you lay in the middle of what remained of your spoils for the day, you wondered if it would be easier to just let yourself get stepped on. You could hear the leather of her sandals begin to groan as she shifted her weight. It was a ridiculous situation you were in, not even bugs were this small next to a normal person. <br>\r\n<br>\r\n\tVOOOM!<br>\r\n<br>\r\n\tOnce again the shadow of her foot eclipsed you as her sandal hung over your head. Your heart began to race as you braced yourself for impact; apparently you weren’t able to give up and die like that.<br>\r\n<br>\r\n\tBOOM!<br>\r\n<br>\r\n\tSuddenly you were trapped between treads as you were crawling towards the light at the end of the tunnel before you. Running out of the tunnel, you turned and saw that you couldn’t afford to stay on the floor any longer. You were near her toes, so the sandal was low to the ground. Grabbing onto the rubbery sole, you began climbing, scaling the stitching that attached the sole to the main body of the leather sandal. It formed a perfect ladder as you finally pulled yourself, panting from exhaustion, up onto the top of Amie’s sandal (<a rel=\"nofollow\" href=\"http://sutsurikeru.com/wp-content/uploads/2013/11/7MtXyOK.jpg\" target=\"_blank\">http://sutsurikeru.com/wp-content/upload...</a>). As you rolled onto it, the smell of Amie’s foot was nearly suffocating you. Holding your nose, you tried to find a way off of it, but once again the giantess began to move. Screaming, you slide down towards the underside of her foot as you passed underneath her big toe. Reaching out, you grabbed onto a strap of her sandal as the foot crashed down once more, almost ending you. <br>\r\n<br>\r\n\tAmie on the other hand was ecstatic as she bought some necklaces and began heading for the bathrooms. Her head buzzed with excitement as she thought about…<br>\r\n</span></div></div>",
            "created":1404183720,
            "id":1820611,
            "title":"Amie Lynn"
        },
        "1521":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "the food stalls",
                "the bathroom",
                "a dressing room to pick up some things of Leeanna's"
            ],
            "content":"<div class=\"\"><div> <span>Amie’s attention was stolen from her as she saw something by the game demos. Smiling, she slowly began to make her way through the crowd. Still in her street clothes, Amie could pull up her hood and hide pretty well for now at least. Once in a while it was cool to sneak in like this; it felt like a stealth mission in Assassin’s Creed as she waded through the throngs of guests towards the object of her fancy. Her feet were trampled on a few times by self-absorbed guests. Ignoring the pain in her exposed toes, Amie boldly headed on towards her destination (<a rel=\"nofollow\" href=\"https://www.facebook.com/amiehabit/photos/pb.146737515491691.-2207520000.1425675782./293270760838365/?type=3&amp;theater\" target=\"_blank\">https://www.facebook.com/amiehabit/photo...</a>). Slipping between two larger men, Amie found herself right before what she’d been looking for. It was an FPS game, not really her thing…but the design of the gun was something she couldn’t keep away from. She fidgeted as the crowd seemed to pass by the shabby looking game; their attention caught up in other things, but Amie’s hand was already around the handle. The cool plastic against her skin felt awesome as her head began buzzing with dozens of costumes she could come up with using this at the core. <br>\r\n<br>\r\nIn her head, Amie already put her new character in a war zone, bullets and lasers whizzing over her head. A group of enemy soldiers were coming up behind her…needed to make a move now! Turning, she fired a few rounds into the chest of the enemy before her.<br>\r\n<br>\r\n“Amie!” a familiar voice rang out as Amie snapped back to reality. She hadn’t realized the attention she had drawn as she had the gun leveled in thin air, a dozen or so sneering faces on her. A few people poked and prodded each other, recognizing Amie even as her face flushed red. She nervously began walking away through the small part in the crowd, her ears burning, the gun still in her hand. It was just then that a hand clapped down on her shoulder.<br>\r\n<br>\r\n“Ah!” Amie shouted as she jolted in freight. Tuning, she came face-to-face with a smiling Leeanna Vamp.<br>\r\n<br>\r\n\t“Hahaha, what the hell were you doing over there?” Leeana asked, motioning to the empty table.<br>\r\n<br>\r\n\t“Oh, I just saw this really cool game and…” Amie said tuning around, only to see that the table she had been at was gone from sight. Not a sign remained of the vintage game except for the gun clutched tightly still in her hand. <br>\r\n<br>\r\n\t“You ok?” Leeanna asked, taking a step closer and putting the back of her hand on Amie’s forehead.<br>\r\n<br>\r\n\t“Yes!” Amie said, pushing back and laughing. It was at this moment Amie finally noticed what Vamp was wearing, her Apu costume had made a resurgence it seemed (<a rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/236x/d2/b7/ba/d2b7baf76eb55fbf1b47fa263567718e.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/236...</a>). Leeanna could tell where Amie’s eyes were as the cosplayer laughed.<br>\r\n<br>\r\n\t“Yeah, my first design fell through so I went for this one again!” she said striking a pose that made Amie laugh….<br>\r\n<br>\r\n\tBABOOOOOM!<br>\r\n<br>\r\n\t“Grahhh!” you screamed as the thick wall of flesh of Leeanna’s foot crashed down right next to you. Leaping, you hoped to God that you’d avoid being caught under the avalanche of foot coming down on you!<br>\r\n<br>\r\nCRUNCH!<br>\r\n<br>\r\nStaring breathlessly, you watched as the small splinters of your table were now scattered before you, some fragments sticking out pathetically from under the tan wall of skin to your right. You didn’t know what was happening. One second you were trying to figure out how to get people to come to your booth, next thing you knew everyone was staring at some weird chick….then this happened! <br>\r\n<br>\r\nYou looked up at the dark underside of the foot that now hung over your head. The giant woman’s skin was stretched so tightly against her sole that you could see every line and ridge along it like an art exhibit. In the innumerable ridges and channels, you saw grains of dirt and dust around your side stuck to the woman’s sole. Terrified, you began backing up on your quivering legs. It was like every muscle in your body was screaming at you to move a different way, to flee in a thousand directions at once. The discord left you shivering, standing still, prone to the mountain of foot that was now slowly starting to descend on you….<br>\r\n<br>\r\nBOOM!<br>\r\n<br>\r\nYour body was pressed into a layer of dust that seemed a few inches thick. It was like you had dove into freshly fallen snow as the grey dirt swallowed you up underneath the tremendous foot. The weight of Leeanna’s body came down on you for just a brief moment as she shuffled, but in that instant you thought you were going to explode just like your desk had a few seconds before. As the foot lifted off of you just a second later, you felt like you were going to die. Slowly, you found yourself lifting up into the air, plastered to the giantess’ sole in the layers of dust and filth encrusted to her skin.  For a few moments, you were left floating in mid-air as Leeanna rested her weight on the ball of her foot, crushing what was left of your wares into dust that was sure to be stuck to her sole as well. Confused and disoriented, you didn’t even know which way was up as you began to put up a fight, trying to get free from the massive sole. Pressing your hands into the dry surface of the foot, you tried to pry yourself off. As your body began to lift off, you noticed something troubling…you were stuck to her sole upside down. Even if you wanted to stay stuck, at this point, you already found yourself beginning to get pulled loose as Leeanna’s foot shifted ever so slightly. Like a droplet of water on a faucet, you found yourself hanging precariously for a brief second…then you fell!<br>\r\n<br>\r\n“Aaaaaaah!” you screamed as you flailed in midair for a few seconds.<br>\r\n<br>\r\nTHWACK!<br>\r\n<br>\r\nYou landed painfully on the cold, dirty tile floor as the giantesses above continued to converse.<br>\r\n<br>\r\n“<b>DID YOU EAT YET TODAY?</b>” Leeanna’s voice boomed from above, her words echoing on the floor like fresh thunder amidst the dull roar of the convention. <br>\r\n<br>\r\n\t“<b>NOPE! I HEAR THEY HAVE A GOOD PLACE OVER AT THE NEXT VENUE, BUT CAN WE STOP AT A BATHROOM FOR A SECOND?</b>” Amie asked as the tremendous foot above you finally lifted away, crashing down a football field away from you as Leeanna began to turn to go.<br>\r\n<br>\r\n\t“<b>SURE, LET’S GET GOING THOUGH, THIS CROWD IS GOING TO RUN US OVER!</b>” Vamp replied as she began to walk through the crowd.<br>\r\n<br>\r\n\tBABOOOOOOM!<br>\r\n<br>\r\n\tYou were shaken off your feet again as another tremendous foot landed before you, this time belonging to Amie. Looking at it, you saw her pale skin wrapped up in endless arches of brown leather as the towering body above looked on at the convention unknowing of the drama going on below. Terrified as you were of your last encounter at a giant woman’s foot, even you knew that it was better to try and hitch a ride on this woman’s sandal than risk sitting alone on the floor of the convention at this size. Running, you leapt with all your might and snagged your arms into a rung of threading as the massive foot began to slowly lift into the air once more (<a rel=\"nofollow\" href=\"http://amielynn.net/wp-content/uploads/2014/06/10155301_293270720838369_92293437104750772_n.jpg\" target=\"_blank\">http://amielynn.net/wp-content/uploads/2...</a>). Now, at the foot took off, you screaming as you started on a massive roller coaster-ride. <br>\r\n<br>\r\n\tBABOOOOOOOOOOOM!<br>\r\n<br>\r\n\tYou were almost shaken off instantly as Amie’s massive foot hit the floor. Hanging onto a clutch of threads was going to get you killed, you deduced as you swung your leg up onto the thick plateau of leather. You managed to pull the rest of your body onto the top of the sandal as Amie began to take her next step. As the foot tilted and shifted in flight, you found yourself shifting dangerously towards the tremendous walls of flesh….<br>\r\n<br>\r\n\tBABOOOOOM!<br>\r\n\t<br>\r\nGrunting, you looked around for a safe place to stay when you saw it…a splattered person on the underside of one of Amie’s toes. You threw up in shock as the pained face looked at you lifelessly. It hardly looked like a person anymore after being underfoot. As Amie’s toes pressed back down onto the corpse, you heard the wet squelch of the body under tons of pressure…. This wasn’t a game, and you couldn’t afford to take chances. Uncomfortable as the ride on the side of the sandal was, it was safer there. Or so you thought until the giantess made it to…..<br>\r\n</span></div></div>",
            "created":1425691920,
            "id":1944949,
            "title":"New Game+?"
        },
        "15213":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "Vamp sees the little guy on the ground...",
                "Marcus was looked over completely...."
            ],
            "content":"<div class=\"\"><div> <span>THOOOOM!<br>\r\n<br>\r\n\t“<b>WHAT’S THE NEW OUTFIT?</b>” Amie’s voice thundered from on high as you continued clinging onto the leather straps of her sandals for dear life. Your stomach was still spinning from the roller-coaster ride of the giantess’ footsteps. To make matters worse…you’d seen quite a few others disappear under Amie’s and Leeanna’s feet on the trip to the changing areas. Whatever had caused you to shrink, it seemed that the problem was still going on and Amie was none the wiser to the miniature massacre her sandals had partaken in. <br>\r\n<br>\r\n\t“<b>SEEECRET~</b>” Leeanna teased as you watched her bare sole come down on a screaming couple…you turned away before you could see their remains, but the sound of their bodies crunching under Vamp’s foot echoed clearly in your ears. <br>\r\n<br>\r\n\tTHOOOM!\t<br>\r\n<br>\r\n\tEntering what appeared to have been a cleaned out clothing store, Amie and Leeanna noticed things were almost unnervingly empty. Still, it at least gave them a chance to breath without being crowded as they went to the back of the store and the changing booths that still remained there. The two finally made it to their destination as Leeanna promised Amie it would be a quick wait and disappeared into one of the stalls. As the brunette entered the stall, Amie sighed and walked into a stall of her own, planting her butt on the bench and stretching out her legs. You had a split-second to re-affirm your grip on Amie’s sandal…but this time you messed up. It all happened in an instant. Amie’s feet swung up into the air and you felt your arms already starting to grow numb after enduring the long exodus just to get to this point. When her heel hit into the floor, the shock was strong enough for your weakened arms to lose their grip on the leather strap. Screaming, you flailed and floundered, trying desperately to grab hold of another strap as you felt gravity take hold of you…it was too late! You were quickly sliding down the smooth surface of Amie’s sandal insole on your stomach. Staring up, you could watch the light streaming in under the gap left by her toes growing dimmer by the second as you began coming dangerously close to her heel! As you fell further down the slope of Amie’s sandal, you quickly began to find yourself running out of room in a hurry. The fleshy ceiling of Amie’s bare sole seemed to be growing closer and closer until suddenly; you felt your body get jammed between it and the leather surface. Your heart leapt into your throat.<br>\r\n<br>\r\n\t“<b>YOU’RE TAKING FOREVER IN THERE!</b>” Amie groaned; the impatient giantess leaned against a wall, unaware that her heel was slowly rolling over your tiny body and threatening to crush it at any second. The giantess took out her phone and began scrolling through it. She was following the twitter and Instagram feed that had been set up for the con. The feeds were filled with dozens of tweets and photos of awesome costumes, friends laughing, merchandise being signed, and tweets about everything from ‘famous’ individuals at the con to stands people couldn’t seem to find and scorned friends who couldn’t find the others they’d come with. Some posts were directed at her or Leeanna, wondering where they were. The thought of fans waiting in anticipation just gave Amie butterflies; the giantess rolled back, her weight settling painfully on top of your tiny frame. “PEOPLE ARE WAITING FOR US,” Amie’s voice boomed from above. You were in a living hell. If not for the softness of her sole, your little body would have already been reduced to a red paste long ago. Amie wasn’t concerned…inside the changing room, another victim of Amie’s wanton ray firing was also dealing with the consequences.<br>\r\n<br>\r\n\tTHOOOOOOOM!<br>\r\n<br>\r\n\tLeeanna’s foot slammed down just an inch away from Marcus. The lanky college freshman still didn’t know how the hell he’d ended up in this situation. Once second he was walking with friends, the next thing he knew the world was massive and Vamp’s bare foot had crashed down just a few inches to his side. He had grabbed on before he really knew what was going on…now he just wished this was all a dream. <br>\r\n</span></div></div>",
            "created":1470637080,
            "id":2192748,
            "title":"Change of Pace"
        },
        "1522":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "she felt something tickle inside!",
                "she forgot about the \"toy\"",
                "she inhaled by accident!"
            ],
            "content":"<div class=\"\"><div> <span>The door closed behind her as Amie set her bag down in the spacious bathroom. She had been talking to an employee who pointed her in the direction of some very good employee bathrooms she and other cosplayers were allowed to utilize today. <br>\r\n<br>\r\nThe room was really spacious she noticed as she took a small sip from her iced-tea and placed it down, turning her attention to her outfit for the day. She was going to take the Lightning look for a spin once more today she thought, before revealing her new outfit tomorrow. Smiling, she took out her wig and placed it down carefully on the sink. Amie wiggled her toes happily, removing each piece of her outfit with an ever-increasing smile… till she realized she forgot something.<br>\r\n<br>\r\n\t“Oh shit!” she shouted as she stomped her foot in frustration, “How could I forget the boots?!”<br>\r\n<br>\r\n\tUnderneath her foot, you were hyperventilating as you were surrounded on all sides by her tan skin. A small crack of light seemed to seep in between her toes as you realized that you had survived the sudden stomp of Amie. The overhead arch of her toes seemed to have spared you, letting the deadly force pass instead to only the tips of her toes and the tremendous ball of her foot. Looking around nervously, you could see that she had actually managed to collapse a small portion of the sandal even more under the weight of her frustrated fidgeting. You felt a little nausea as you thought about what would have happened if you were underneath there when she stomped down. It was then that you remembered how crushed your backpack had become from just a normal step; if you had been stomped on then there wouldn’t even be enough of you remaining to recognize you were once a human! Quickly, you began running towards the toes of her sandal as quickly as you could; this plan turned out to be a bust as well. Passing between her toes, you were suddenly thrown on your face as the world began to move. Her toes pressed down into the ground next to you as suddenly they seemed to be getting dragged away! Soon, her barefoot was hovering above you, free of the sandal they had been trapped in (<a rel=\"nofollow\" href=\"https://www.facebook.com/photo.php?fbid=440240399367260&amp;set=o.146737515491691&amp;type=3&amp;theater\" target=\"_blank\">https://www.facebook.com/photo.php?fbid=...</a>).<br>\r\n<br>\r\n\t“Guess these will have to do,” Amie said as she reached down and grabbed the sandal you were on, her hand covering you like a fleshy cage. As she lifted it in the air, you suddenly began sliding as the slick surface of the sole was not giving you much assistance with the constantly changing conditions. Your foothold soon turned into a vertical wall as you began to fall down past the tremendously long legs of Amie, fearing that you were about to become a speck of red on the bathroom floor…<br>\r\n<br>\r\n\tSPLOOSH!<br>\r\n<br>\r\n\tRising to the surface, the aroma spinning around you was incredibly familiar. Iced Tea. You sank below the surface again as the weight of your water-logged clothes began to weigh you down. Quickly, you ditched the jacket you had on and felt as you once again began to head for the surface. Breaking into fresh air once again, you took in a deep breath and tried to look around. The air seemed to get weird past a certain point, becoming incredibly difficult to see through. Everything was distorted past a certain point and you couldn’t figure out why…until you looked up more. High above there was a clear circle of air…you were inside a bottle of iced tea with no way out.<br>\r\n<br>\r\n\tBOOM!<br>\r\n<br>\r\n\tLooking up, you were suddenly greeted with the visage of Amie’s face looking into the bottle thirstily (<a rel=\"nofollow\" href=\"http://punchingthewallsofreality.com/wp-content/uploads/2013/09/Amie-Lynn-LIGHTNING-FFXIII.jpg\" target=\"_blank\">http://punchingthewallsofreality.com/wp-...</a>). Soon, the sky was completely dark as her massive open mouth latched onto the top of the bottle, which began tilting towards the cavernous maw! Swimming like an Olympian going for the gold, you were crying out in fear as the powerful current slowly pulled you towards Amie’s mouth despite your best efforts!<br>\r\n<br>\r\n\t“Help! Please stop! I’m in here!” you called, tears rolling down your face as the raging river of iced tea became a lake filling the space of Amie’s mouth….<br>\r\n<br>\r\n\tGULP!<br>\r\n<br>\r\n\tThe deep sound reverberated in your bones as the river one again began filling a totally empty mouth. A lake larger than an Olympic sized pool had suddenly disappeared down Amie’s throat in a fraction of a second! Once again the race was on to not end up in the massive mouth as Amie’s hot breath began to fog up the bottle, making the only sight available to you the dark cavern behind you and an emptying bottle ahead! You screamed as suddenly a large wave of tea swept you up and deposited you inside of Amie’s mouth…right in the middle of the lake. Terrified, you knew you didn’t have much time till the next swallow occurred as you began swimming for her teeth. In the limited light seeping in through the bottle you saw her molars glistening in the darkness as the hollow sound of your swimming echoed in her cavernous mouth. You were a few meters away when suddenly the bottle was withdrawn and you were plunged into darkness!<br>\r\n<br>\r\n\tCRSSSSSSH!<br>\r\n<br>\r\n\tThe sound of Amie’s tongue rising from the depths of the iced tea lake were disturbing as you suddenly slammed head-long into the side of one of her molars. Wasting no time you wedged your arm between her teeth as you suddenly felt her tongue rising, the wet serpentine muscle-mass brushing against you. In your fear, you could have sworn you felt yourself being tasted, but in the next second that thought would be drowned out.<br>\r\n<br>\r\n\tGULP!<br>\r\n<br>\r\n\tIt felt like you were once again in the rapid river of the bottle as the lake quickly emptied itself down Amie’s throat. As her tongue began to lower it brushed past you once again, but this time it took interest. You were suddenly set upon by her tongue as it poked and prodded you. Suddenly it slid under you and lifted up; pulling your arms free from between her teeth as you were thrust into light and squeezed between her fingers. As your eyes adjusted to the light, you saw Amie’s eyes looking at you inquisitively as they focused on your tiny form (<a rel=\"nofollow\" href=\"http://madcatz.com/wp-content/uploads/2013/02/Mad-Catz-LT3-Amie-Misshabit-Lynn.jpg\" target=\"_blank\">http://madcatz.com/wp-content/uploads/20...</a>).<br>\r\n<br>\r\n\t“Some kind of toy?” she said aloud as you noticed you were outside the bathroom.<br>\r\n<br>\r\n\t“Hey! Can I grab a picture?” a voice shouted as you suddenly found yourself shoved into some kind of humid, dark space.<br>\r\n<br>\r\n\tAs Amie’s finger was lodged firmly up her nose, she smiled for the picture as…<br>\r\n</span></div></div>",
            "created":1404191640,
            "id":1820693,
            "title":"Lightning Can Strike Twice..."
        },
        "15221":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "there was another tiny person on her stuff",
                "there was some kind of toy gun left with her things... and a note"
            ],
            "content":"<div class=\"\"><div> <span>Amie froze for a moment as she felt something wriggle in her nose. She slowly opened her eyes, finger still up her nose as she politely bowed out from the photography session and made her way back to an empty area. Looking around, she made certain no one was around to see what was about to happen as she began to slowly lower her finger from her nostril, the wriggling thing still stuck to her finger, whatever it was. As she fully removed her finger, Amie saw something she wasn’t expecting at all. The “toy” from her drink was what was moving in her nose…she had just shoved a real person up her nose.<br>\r\n<br>\r\n\tSlowly, you felt your strength return as you looked up to see Amie looking down at you with total shock. Carefully, you waved at her, hoping she would recognize you for what you really were.<br>\r\n<br>\r\n\t“Are you kidding me?” Amie said as you suddenly saw the shocked face turning to one of anger. As she began to glare at you menacingly, you realized you were in trouble here (<a rel=\"nofollow\" href=\"https://www.facebook.com/photo.php?fbid=460256310699002&amp;set=o.146737515491691&amp;type=3&amp;theater\" target=\"_blank\">https://www.facebook.com/photo.php?fbid=...</a>). Her thumb soon pressed down on you as you were pinched between her fingers, at her mercy as she bit her lip thinking of what to do with you next. You thought about trying to wriggle free, but it seemed like a bad idea as you noticed her eyes were locked on you intently.<br>\r\n<br>\r\n\t“Um, I just wanted to say that I’m really sorry,” you said. You thought you hadn’t been heard and were about to say it again when you felt like you were being squeezed harder.<br>\r\n<br>\r\n\t“I don’t want to hear excuses, what you did is just wrong. Who the hell pretends to be a toy and tries to go into a person’s mouth?! Like seriously?” Amie fumed as she glared at you. You were about to respond when you suddenly felt like you were dropping once again! Suddenly you noticed where you were headed, back to her sandal once again. Quickly you began fighting her fingers, but it was useless as they refused to budge. Your mind flashed to the stomping and the terror of her footsteps as you waited to be under her toes once more, but then you saw that you were headed somewhere much worse. Amie had lifted her heel as you got closer, the small cupped back of her sandal offering no haven as you were dumped there and quickly set upon by her massive heel!<br>\r\n<br>\r\n\tAmie stamped her foot a few times just to make sure that you were in place before going back to the convention. With every step she took she felt your tiny body smack against her heel pathetically. Smiling she enjoyed the small sensation until she got wrapped up in the convention, forgetting about you all together. It wasn’t until hours later when her feet were killing her did she remember the passenger she had aboard. <br>\r\n<br>\r\n\t“How are you down there?” she said as she took a seat and ran a finger against her heel, feeling the sweat she had built up over the day collecting onto her finger until she hit a tiny object which stuck instantly. Pulling her finger out, she smiled as she saw your tiny, beaten up body stuck to her finger.<br>\r\n<br>\r\n\t“Fuck you,” you said back under your breath, thinking she couldn’t hear you. You were right, she couldn’t, but she could at least tell when you were being rude.<br>\r\n<br>\r\n\tCRUNCH!<br>\r\n<br>\r\n\tYou screamed in pain as your right leg was shattered between her fingers. Being lifted by the fractured leg, you were suddenly handing over her open mouth… when she suddenly let go (<a rel=\"nofollow\" href=\"https://www.facebook.com/photo.php?fbid=10151316554601367&amp;set=o.146737515491691&amp;type=3&amp;theater\" target=\"_blank\">https://www.facebook.com/photo.php?fbid=...</a>)! Landing on her tongue, you were instantly tossed onto the teeth you had been grabbing onto before this whole fiasco started, but this time you were on the flat tops of them. Looking up, you could already see her upper teeth coming closer! With only one working leg you dragged yourself as quickly as possible out from under her teeth. Only one pull away from freedom, you were plunged into despair as Amie’s tongue set upon you once again; pinning your upper-body to the side of her tooth with your legs left on top her molars came together with devastating consequence…<br>\r\n<br>\r\n\tCRUNCH!<br>\r\n<br>\r\n\tYou couldn’t feel your legs anymore as Amie’s teeth reduced them to pulsating masses of pain. Her wet tongue seemed to enjoy your struggles as it played a tiny contest of strength with you, pushing you back onto her tooth fully as they came together on you. Powerless, you sat there as her teeth came together teasingly on your body, your unbroken bones bending dangerously. Her massive fingers slowly reached into her humid mouth to retrieve you as she grew tired of this game. Whimpering, you screamed in pain as you suddenly were dumped into a small plastic cup, your useless legs hitting the floor limply.<br>\r\n <br>\r\n\t“Don’t really think I have any more use for a little bug like you, now do I?” Amie said as she glared down into the cup, her massive hands painting the walls tan as they eclipsed your vision. <br>\r\n<br>\r\nAll that there was to see was the pressed palm of her hand, and Amie’s glaring gaze weighing down upon you. Her words made you nearly piss yourself as you wondered what she was going to do to you next. It was then that you noticed the sides of the cup were starting to warp. Amie was squeezing as she spoke down at you, but you weren’t paying attention to her words, only the closing walls. You did manage to catch the end of her last sentence though…<br>\r\n<br>\r\n\t“So, this is going to be goodbye then,” she said as the walls suddenly shot in sharply, the cup getting crushed in her hand as it was reduced to a tower of sharp angles you had no hope of climbing with two useless legs. But things were not over as you suddenly found yourself being lowered to the ground, it was like a bad dream as you were once more finding yourself before her massive feet. Through a crack in the plastic, you saw as she pressed her toes firmly into the ground before her foot slowly lifted. <br>\r\n<br>\r\n\tBOOM!...BOOM! BOOM! BOOM!...BOOM! BOOM!...BOOM!<br>\r\n<br>\r\n\tAmie grinned as she continued stomping on the plastic cup, watching the plastic bend and warp under her toes until it was compressed into a small disk. Removing her foot, she saw a tiny red splatter in the center as she lifted it from the floor and tossed it into a nearby garbage can. Walking back to her stuff, she was surprised to see that…<br>\r\n</span></div></div>",
            "created":1404201000,
            "id":1820757,
            "title":"Struck"
        }
    },
    "info":{
        "author_id":"alinagoth",
        "author_name":"Alina",
        "brief_description":"When you shrink during a cosplay convention, the outfits aren't the only unique thing!",
        "created":1385417700,
        "description":"<td align=\"left\" class=\"norm\">What happens when what was supposed to be a \"normal\" day of cosplay turns into an adventure of gigantic proportions? Follow as you are brought into a world where the intricacy of your outfit is no longer your biggest worry. Watch as big names become bigger, and a small problem spirals out of control! Will you survive the convention? Or will you be squashed by the competition?<br>\r\n<br>\r\nRules:<br>\r\n1. Please use proper grammer. Spelling counts!<br>\r\n2. Please no short adds. Additions that are only a few scentences long don't add the kind of excitment to the story that you want.<br>\r\n3. Have fun with it!<br>\r\n<br>\r\nThe Cosplay Cuties:<br>\r\n<br>\r\n1. Soni Aralynn<br>\r\n2. Amie Lynn<br>\r\n3. Olivia Alexander (from 50ft Cheerleader)<br>\r\n<br>\r\nMore to come!!!!!</td>",
        "id":1964226,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1517327340,
        "modified":1517327340,
        "pretty_title":"Cosplay Shrinking Adventure"
    }
}