{
    "chapters":{
        "1":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "Carry you home in her stomach",
                "Turn you into one of her tampons and use you",
                "Carry you in one of her stockings that she is wearing",
                "readers choice",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Wake up John, its time to eat your breakfast!\"  Mary yells...   You Slowly open your eyes and look at the time... it read 7:00 am.You reply back\"Geez, mom its only 7 o'clock in the morning\"  \"Don't talk back to me.. I told you today was going to be a big day and i was going to need your help.\" Mary yelled back.  You reluctantly replied back \" Fine, ill be down in a minute\" with that you sat up and procedded to put on a old tshirt that you normally wear when you are home...   then headed down stairs...<br>\r\n<br>\r\nWhen you entered the kitchen your mom had a plate of pancakes, and 6 slices of bacon and a glass of orange juice already set up for you to consume.. It was a surprise for you as she usually only makes pancakes on special occasions..not only that to go as far as already making a plate for me to eat...  Your mom looks at you and says \" Well are you just going to stand there or are you gonna eat?\"  You look at her with a puzzling look thinking to your self shes usually not this nice to me except on my birthday and christmas...  but you shrug it off and start to sit down in front of your meal and start eating.  You then ask your mom \" Why are you being so nice to me?\"   Mary replied \" Do I need a reason to be nice to my son, besides you agreed to do this one favour for me the least I can do is make you your favourite breakfast\"  You then grab the glass of Orange Juice.and started to drink it..  your mom watching you intently as you drink it.  You then look at your mom and say\" By the way, you didnt tell me what this favour was.\"  Your mom smiling \" Youll soon find out my dear...  \" She was not able to finish what she saying as you are now passed out on the table...  <br>\r\n<br>\r\n1 hour later,  <br>\r\n<br>\r\nYou started to open your eyes..  and look around your surroundings...   You hear a female voice comming from behind you saying \"Look mother hes finally waking up\" you turn around seeing your sister Kate looking down at you, you fall back surprised to see that she is now huge.  Kate giggles and says \" Surprised little brother?\"  You relize after taking a look around the room noticing that you are actually standing on top of the table and you were actually barely the height of the juice glass that your standing beside.. You yell back\" Why are you doing this to me?\"  Kate replied back\" Remember that little favour you promised our mother to do?  Well this is it, you are officially not our mothers problem anymore...  after all the years being mean to me and my mom.. I decided to take you off our moms hands and use you as paruess i should let you know t of a little internet game show i run\"<br>\r\n<br>\r\n\" Game show?  \" you ask..  Kate replied back \" Yes i guess i should let you know the details...  Well fist thins first you will be placed in a random spot in a huge maze...  all divided up into squares much like a game board...beside each square there are also doors layed out at each square, now a internet viewer who is picked at random each day will roll 2 dice and you will be allowed to move the resulting number in any direction open to you... once you made the last move you must pick one of the doors available to you...  and then the cycle will restart with another viewer rolling the dice.. \"  Kate stopping now noticing a look of fear in your eyes, then laughs\" It gets better...  now there are a total of 150 doors  bwettin the maze... only 1 door will lead to your freedom of this game, you find that door and you will find your self back to normal...  and hopefully for the  better, there are 5 doors that will take you to a break room on where you will meet girl volenteers who are your size and all they will do is pleasure you in all kinds of ways for 1 whole day before you are back in the maze.\" Kate pauses then continues\"  However the other 144 doors will lead to a torture, that could consist of vore tortures, transformation tortures, squash tortures etc.. when you end up in one of these doors the viewer will roll one dice to determine on how long you will have to endure the torture for up to 6 days, dont worry you wont die from any of them... but im sure after some tortures you may wish for death\"  Kate then adds\" Oh if you choose not move i wouldnt.. as there are 3 vorish dolls moving around the maze, if you get caught by one either by you not moving or running into one the doll will then pick you up and vore you... and the concequence of that would be you will go through the entire process of digestion which then you will transform into a piece of shit then you will be shit out where you will sit there for a few days slowly transforming back to normal...  , oh and you have 2 weeks to find the exit door after which if you fail all the doors will change positions, not only that the current participating viewer at the time may choose to set a condition on you, ie you have to wear panties \"<br>\r\n <br>\r\nJohn yelled\" You can't do this to me!\"  Kate replied back\" Well I can because i just did... now be a good brother and help me make money.\" she then smiles then says\" Well im going to need a way to carry you to your new home...  \" She then looks around then she got a evil look  in her eyes. \"Ahh i know what im going to do, im going to do one of the possible tortures to you while i take you to your new home, im going to ......\"</span></div></div>",
            "created":1312693200,
            "id":1163619,
            "title":"And it begins......."
        },
        "11":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "Put your arms in hopes of getting out of her mouth",
                "Say there's no way you're going to do her game!"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm going to eat you whole\" she said with a smug look on her face<br>\r\n\"What!?!\" you shouted at her. Her giant open hand surrounded you as you tried to run with no avail. Your sister's giantess fingers trapped you and squeezed you leaving only your head visible from her fist.<br>\r\n<br>\r\nShe licked her lips and looked you in the eyes \"Well... I was hungry anyways, so let's kill two birds with one stone\"<br>\r\n<br>\r\nYou screamed but she shortly muffled you with her giant index finger \"Now now John, if you're going to play this game you need to get used to being eaten.\" She dangled you over her mouth and dropped you in where you tried to hang on to her tongue but slid right off into her gullet.<br>\r\n<br>\r\nYou hear an exaggerated \"gulp\" followed by a slimey, warm adventure through a passage which was her throat. Half way through you hear her say \"Mhhhh, I knew you'd taste good. Can't wait for you to accidentally stumble onto a vore torture.\" You shook with your whole body and squirmed you then heard her say \"Yes... struggle more it feels so good.\"<br>\r\n<br>\r\nSoon enough you fell head first into stomach juices in a flesh chamber that vibrated with a *gurgle* noise ever so often. You sat in the stomach juices and noticed that they did not seem to burn as you thought they would. It was very warm in the chamber. You got drowsy and slept in her tummy. After a long nap you were awoken from her smacking her belly \"Wake up you idiot!\" she screamed<br>\r\n<br>\r\n\"Now there are 2 ways out of this... I'm going to try to vomit you up, all you need to do is put your arms in the top hole in my stomach, if you don't do this you're going to be stuck there. Understand?\"<br>\r\n<br>\r\n\"Now get going\" she screamed</span></div></div>",
            "created":1428306360,
            "id":1959701,
            "title":"Carry you home in her stomach"
        },
        "112":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "That the number behind her back is 1",
                "That the number behind her back is 2",
                "You stay silent...."
            ],
            "content":"<div class=\"\"><div> <span>\"There's no way I'm coming out! I don't want to play your stupid game!\" You shouted.<br>\r\nShe heard this and screamed back \"JOHN YOU BETTER DO AS I SAY NOW OR THERE WILL BE {b]HUGE CONSEQUENCES\" <br>\r\n<br>\r\nYou said nothing and there was a moment of silences.<br>\r\nYou leaned against the fleshy wall of her stomach and slept.<br>\r\n<br>\r\n<br>\r\nYou soon were awoken when you were waist deep in a hole at the bottom of her stomach being rinsed with some of her stomach juices.<br>\r\n<br>\r\n\"What the?!?\" You shout<br>\r\n<br>\r\nShe speaks calmly back to you \"I said there will be huge consequences, and now you're about to see them you lil' shit\" <br>\r\n<br>\r\n\"No, no please Katie, I'll do whatever you want just please not like this\"<br>\r\n<br>\r\nShe snapped back \"It's too late John just accept your fate\"<br>\r\nYou started to plead only to be muffled by her stomach juices -- you held your breath and went down the slimy trip and soon out into the light. You hit a boundary that was your sisters underwear<br>\r\nShe opened up her pants and saw you stuck on her ass \"Told you... this is why you always listen to me\" <br>\r\n<br>\r\nYou moaned and then said softly \"please Katie... let me out\"<br>\r\nShe said \"well, since you're down there... and I haven't been... <i>active</i> in a while I might as well use you for my own pleasures.\"<br>\r\n<br>\r\nShe grabbed you and wrapped you in some kind of plastic wrap preventing you from moving your arms or legs much. She then put you face to face with her and licked you on the head. \"How does it feel disobeying your master? This is what you get John.\" She pulled down her pants and put your head inches away from her shithole. She giggled happily \"Hold your breath kiddo!\" <br>\r\nYou responded \"What? Will I not be able to breath in there or som-\" you were cut off by a blast of putrid air from her ass as she laughed up a storm<br>\r\n<br>\r\nYou lay there in her fist stunned from the foul odor <br>\r\n\"Oh god John\" she said laughing still \"That wasn't even a bad!\"<br>\r\nShe then stuck you in between her ass-cheeks into her shit-hole, at first bringing you completely in then halfway out and repeat this process until another fart emerged into your face.<br>\r\n<br>\r\nShe laughed even harder before she finally shoved you all the way up her ass. You squirmed and struggled which caused her to moan from sexual pleasure \"Please john more... move around more\" <br>\r\nYou did what your sister told you and she moaned with every swift action you made in her ass hole. She eventually tooted once more and the laughing continued. <br>\r\nThe laughing was followed by another blast of hot air and an odor then you loss consciousness.<br>\r\n<br>\r\nWhen you woke up you were in an open matchbox overlooking a giant maze with many doors and big rooms. <br>\r\n\"Hey my butt-plug is awake\" she said laughing<br>\r\n\"Boy did you give me quite the... experience, you went really far up me!\"<br>\r\nYou tried to get up but you were still restrained by plastic wrap. <br>\r\n\"Aww, can you not get up? You're so pathetic. But so cute at the same time... like a little taco.\"<br>\r\n\"Anyways...\" she switched to a serious tone \"Remember the rules and everything? There are some doors that lead you to tortures from me or some of my giantess assistants and there are some pleasure rooms. And if you see a fox humanoid thing that's called a doll. And they want to eat you\"<br>\r\nShe said bluntly<br>\r\n\"Oh yeh, don't get caught by more than one of them... they might keep you for a long... long... time...\" \"and speaking of time, don't take too long, if you take too long I'll just give you to the dolls forever or you'll be my little sex toy forever\"<br>\r\nYou shuttered at the thought of being in her for another second<br>\r\n\"Aww, was it that bad to be in my butt? Well... get used to it. Because I am sure you'll be there again soon enough.\" she gave you a kiss with her giant lips and held you in the palm of her hand<br>\r\n<br>\r\n\"Anyways... a viewer has rolled a number 1 or 2. Guess the number, if correctly I'll place you as far away from any dolls in the maze as possible and unwrap you from the plastic-wrap. If you guess wrongly... I'll place you in the lair of the dolls and they'll have a fine dinner. The only thing on their menu is you! And the activities after pooping you out is doing more terrible things to you. Trust me... you'll be there for a while if you guess wrongly\"<br>\r\n<br>\r\n\"Anyways... guess! C'mon 50/50\" she said in a happy tone<br>\r\n<br>\r\nYou guess....</span></div></div>",
            "created":1428307800,
            "id":1959705,
            "title":"Pouting in her tummy."
        },
        "1121":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "Make a run for it -- even though she is standing above you.",
                "Don't do anything, give Julie a meal that she deserves... you!",
                "Negotiate with Julie to not be eaten -- even though she told you not to."
            ],
            "content":"<div class=\"\"><div> <span>\"Is the number behind your back one?\" you shouted in her direction<br>\r\nShe pulled a card from behind her back with a proud look on her face<br>\r\n\"Congratulations!\" she said<br>\r\n\"You're going to make a fine dinner for the dolls\"<br>\r\nYou shook in horror as she picked you up and dropped you into a large room fully lit.<br>\r\nYou tried to get up and run away but you were still restrained in the plastic wrap.<br>\r\nYou tried to negotiate with your sister \"Please no! Katie please! I'd rather go back in your ass ho-\" before he could finish he saw what he thought was a \"doll\" a creature that looked like a fox humaniod. It walked slowly but seductively towards you and sat on your face exposing its female genitals than an inch in front of your nose. The creature was big, its fists being the size of your head, but your sister said that they could eat him whole. How was this possible you thought to yourself.<br>\r\n<br>\r\nIt has been a solid 30 seconds since the Doll sat on your face and you thought you'd try to talk but her weight wouldn't let you talk. She felt that you were trying to talk to her and she said \"Hi my name is Julie... and you are\" she sat up to let you talk<br>\r\nYou said in a shy voice \"I'm John... I'm here on a game show an-\"<br>\r\nShe interrupted \"I know... I know...\" she said in a soothing voice.<br>\r\nShe spoke again \"Just to get this clear, I see many people like you John walk into this game. And before we eat them whole they always plead with us, don't be one of those people.\" <br>\r\n<br>\r\n\"Really?\" you say<br>\r\n\"Like what ab-\" she cuts you off by sitting on your mouth again.<br>\r\n\"Yes...\" she said in a calm voice<br>\r\n\"Now, my girlfriends are showing up so I guess you'll just be my meal.\" she said bluntly.<br>\r\nShe layed on your belly so you both were eye and eye. She then licked your face and said \"hmmm, you're going to be a tasty one\" She cut your plastic wrapping restraining you from moving and she said \"Well now, can't eat a meal with its wrapper, I'm so glad you get to be my meal\" in a seductive tone<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1428309960,
            "id":1959713,
            "title":"That the number behind her back is 1"
        },
        "1123":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "She stuffs you in her boot",
                "She stuffs you in her \"pleasure\" area",
                "She stuffs you on a plate"
            ],
            "content":"<div class=\"\"><div> <span>You stay silent while your sister awaits a response from you... she looks at you disappointed and soon you shake in fear in her fist. <br>\r\nShe says in a disappointed tone \"Really? Didn't we already go over what happens to people who don't listen to their goddesses?\" <br>\r\nAs you're about to say something she muffles you with her giant finger and says \"Shhh, it's too late now, I guess you're just going to have to not play the game...\"<br>\r\n<br>\r\nYou shout victory in your mind but don't notice for a second that she stuffs you in her...</span></div></div>",
            "created":1428308100,
            "id":1959707,
            "title":"You stay silent...."
        },
        "11231":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "content":"<div class=\"\"><div> <span>As you shout victory in your head she drops you into her boot which reeks of a foul odor of sweat. You  wiggle to look up out of the shoe and you see her standing above you. She says \"Well, I have another game for you... it's called be a stain on Katie's foot.\"<br>\r\nYou screamed for help but she interrupted<br>\r\n\"You win the game by being my slave in my shoe. Now enjoy this last breath of fresh air, it's about to get smelly\" she said in an angry voice. \"And lick my toes clean or else it'll only get worse\"<br>\r\nShe lifted her foot above the entrance of her boot as the light was blocked out and a giant foot smushed you into the smelly chamber that was her boot, she then shifted her foot over you and you turned upwards, with your face locked between her big toe and her second big toe.<br>\r\nYou took a deep breath of the putrid odor and faced this was the rest of your days until your sister gave mercy on you which wouldn't happen for a long long time.<br>\r\n<br>\r\n<br>\r\n<b>THE END<br>\r\n<br>\r\nYOU FAILED THE GAME. </b><br>\r\n<br>\r\n</span></div></div>",
            "created":1428308400,
            "id":1959708,
            "title":"She stuffs you in her boot"
        },
        "11232":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "content":"<div class=\"\"><div> <span>Before you notice she tightened her grip on you and unzipped her pants slowly so you could witness what was about to happen. You tried to scream but she just put your mouth further in her fist so only your eyes and top of your head where visible from her fist. She then took off her pants and slowly unwrapped her panties<br>\r\n<br>\r\nShe said angrily \"Well, you're not going to be a part of the game so you might as well pleasure me... slave\" She finally unwrapped her panties and revealed her 'pleasure area' and slowly moved your head towards it.<br>\r\nYou squirmed and struggled but could not win the fight against her giant grip. You loss consciousness fast but with your unconscious body she had a fun time using you and came a lot. She wiped up her mess with you then shoved you far up her butt as her forever butt-plug. You awake with slime all over you in her butt-hole. You scream and squirm once more before she lets out a big toot and then laughs. She then says \"That's what you get for not following your mistress's directions. Now get some rest if the smell doesn't keep you up. I've been feeling lonely recently and am going to be using you a whole lot tomorrow.\"<br>\r\n<br>\r\n<b>THE END<br>\r\n<br>\r\nYOU LOST THE GAME</b></span></div></div>",
            "created":1428308820,
            "id":1959710,
            "title":"She stuffs you in her \"pleasure\" area"
        },
        "11233":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "content":"<div class=\"\"><div> <span>She pulls out a plate and places you on it. You squirm around but you are still wrapped in plastic-wrap. You ask what she's going to do with you<br>\r\n\"Oh you know...\" she says in a seductive tone<br>\r\n\"I know how much you loved being in my tummy you might as well be in there one last time\" she said sarcastically \"... and trust me you won't be coming out for a long while...\" Her tummy then rumbled and she said \"Hear that? That's my belly... it says it wants you now!\" She pulled out a pair of chopsticks and gently put firmly grabbed you between them and hovered you over her mouth before dropping you into her gullet. Where you stayed for a very very long time.<br>\r\n<br>\r\n<b>THE END<br>\r\n<br>\r\nYOU LOST THE GAME AND WERE DEVOURED BY KATIE!</b></span></div></div>",
            "created":1428309060,
            "id":1959711,
            "title":"She stuffs you on a plate"
        },
        "13":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "6 hours later... already at his new home",
                "3 hours later Kate Decided to give John a Break from her feet",
                "Kate keeps John in her stocking for 2 days to rub it in.... before starting"
            ],
            "content":"<div class=\"\"><div> <span>\"... Carry you in one of my stockings that im currently wearing!\"  Kate said..  You look at Kate with fear in your eyes...  remembering the last time she put her feet to your face when you were younger...   remembering how stinky they were...  even made worse when she was younger she didnt have showers or take a bath for the longest periods of time... as she always delayed it as long as possible before her mom forced her to take one..  One time she managed to not take one for a whole week..  Kate looking at John realizing what he must be thinking decided to let him at ease telling him.  \"Don't worry John, I did take a shower this morning so it shouldnt be so bad...but i cant say you wont be put though much worse, during the game\"  <br>\r\n<br>\r\nWith that Kate started to remove one of her nylon stockings..slowly making sure you watch every moment of it...   You try to run away but your mom was soon to stop you from running,  You look up at your mom and yell\" Please stop this, i'll treat you better i swear!\"  Your mom looks down at you and says\"  Im sorry son, I gacve you many chances to change your ways, but now i had enough, you will go with your sister and you will participate in her internet game show..  Hopefully if you do make it out to freedom you will be the better for it...\" As Kate finally removed her stocking she is now holding the opening up in the air, as your mom now lifted you up and held you over the opening of the stocking..  with one last look your mom says, \" Well, goodbye son...\" your mom now letting you go with you now falling down into the stocking..  as you hit the bottom part of the stocking Kate proceded to put the stocking back on... trapping you inside, eventually with you being pressed under her foot in the stocking..  She then says, \" Comfy brother?? I sure hope so bewcause it will be about 6 hours before you get to your new home, and i plan to keep you in this for the whole duration.\" She then laughs then went to put on her shoes...  She then stood up and hugged her mother good bye then goes for the door...  <br>\r\n<br>\r\nWhile you were trapped under your sisters foot you were feeling alot of pain with every step that she took, not only that it was stinky in there smelling her foot, while you admit it wasnt as bad as your previous experiences with your sisters foot in your face when you were younger  but it was still bad enough to make you pass out a few times...  </span></div></div>",
            "created":1312779600,
            "id":1164134,
            "title":"Carry you in one of her stockings that she is w..."
        },
        "131":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "Of course I remember the rules, you think I'm dumb?",
                "You expect me to remember something you said?",
                "I don't want to play this game Kate, I want out!"
            ],
            "content":"<div class=\"\"><div> <span>You wake up smelling terrible and to the feeling of your sister scrapping you off of her foot. She giggled as you flopped to the floor. You look up at her seeing the white walls and ceiling of the room and Kate's 2 giant feet hovering above you. She sat back in her chair \"Remember those rules we went over? Because you're going to need to remember them for this game\" She swung her big toe into you smashing you back into the ground. She talks in a louder tone than before \"So? What's taking you so long, do you remember the rules?\"<br>\r\n<br>\r\nYou say...<br>\r\n</span></div></div>",
            "created":1428296400,
            "id":1959652,
            "title":"6 hours later... already at his new home"
        },
        "1311":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "North",
                "East",
                "West"
            ],
            "content":"<div class=\"\"><div> <span>\"Well then\" she said with a smile looking down on you. \"Let's begin the games\"<br>\r\nYou feel two giant fingers pick you up from the feet and dangle you over a giant maze<br>\r\n\"No peaking\" said Kate. You shut your eyes in terror of what the consequences could be. You felt the cold floor of the maze and opened your eyes. Kate let go of you and the rest of your body hit the floor with a painful crack.<br>\r\n<br>\r\nYou got up disoriented and looked up at your giant sister. \"Any... tips on this game?\"<br>\r\n\"Nope, besides watch out for the Vore Dolls\" she said bluntly, \"Just remember we have an audience\" She turned away then right back and looked you in the eyes and said \"And by the way, I can't wait to torture you; let's hope you get all the wrong doors -- I wonder what you taste like... mhhhh.\"<br>\r\n<br>\r\n*There was a short pause before she checked her phone*<br>\r\n<br>\r\n\"Looks like we're starting already: The first viewer just rolled. You can move 5 spaces, which path do you want to take?\"<br>\r\n </span></div></div>",
            "created":1428296400,
            "id":1959656,
            "title":"Unto the game!"
        },
        "13111":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "A brown door with a star on it",
                "Another brown door with a square on it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You take five steps North, noticing doors as you walk. As you get to the final step you hear from speakers on the wall in your sister's voice \"Well chose a door you dummy\" <br>\r\n<br>\r\nThere are two doors...</span></div></span></div>",
            "created":1428296400,
            "id":1959661,
            "title":"First roll: Five steps North."
        },
        "131111":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "Move 11 South",
                "Move 11 North"
            ],
            "content":"<div class=\"\"><div> <span>You open the door with caution, scared for what could be in there... it is pitch black. You walk in and the door shuts behind you. You open your eyes and see that your sister giantess is on her knees in front of you. She grabs you into her giant palm, your head and shoulders the only things sticking out of her fist and she brings you up to eye level with her. She says in a smug voice \"Now I get to find out what you taste like, and by the way; I'm not the only one that will torture you\"<br>\r\nShe opened her gigantic mouth showing her tongue and placed you on it.<br>\r\n<br>\r\nYou struggled violently but to no avail as she closed her mouth and you were left grasping to her tongue for dear life. She said \"Now now, no one likes a feisty meal\" which came out more distorted due to you being in her mouth. With one more lash of her tongue and a strong gulp you find yourself in a tight, warm, and wet area descending slowly before eventually landing in her stomach.<br>\r\n<br>\r\nA loud gurgle and burp was audible from outside the flesh walls then a soft \"excuse me\" <br>\r\n<br>\r\nYou yelled and squirmed with no success. You touched the juices that covered almost all of the floor and to your surprise they didn't burn like you thought they would. You found a spot in her chamber and leaned against the flesh walls listing to her steady heart beat before falling asleep.<br>\r\n<br>\r\nYou are then rudely awoken by more gurgling and you notice that your legs are being sucked into a hole on the bottom of the flesh chamber; you squirm and scream once more to no avail. You accept your fate and go slowly down the chute. It was slimy and warm just like Kate's mouth.<br>\r\n<br>\r\n You soon see the light at the end of the tunnel after a minute or two, and once your head pops out you realize where you have been coming out of this whole time. You cough at the putrid smell and try to climb out which doesn't help at all, until two giant fingers help pull you out of her. The fingers bring you around to Kate's face<br>\r\n<br>\r\nShe says \"Well... well. That was fun. You should be glad I didn't digest you that time, or I'd have to wipe you out of there instead of simply pick you.\"<br>\r\n<br>\r\nYou say nothing<br>\r\n<br>\r\n\"Ok then, the next person rolled an 11 good luck\"<br>\r\n<br>\r\nShe then placed you at the doorway and flicked you into the hallway.</span></div></div>",
            "created":1428296400,
            "id":1959670,
            "title":"A brown door with a star on it"
        },
        "1311112":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "Dark Green door with an octagon",
                "Light blue door with a cylinder"
            ],
            "content":"<div class=\"\"><div> <span>Still a little bit traumatized of being eaten and flushed out of your sister you walk 4 spots North, you look to the right to see another path. You are heading towards a dead end... You then take another 6 steps into the dead end... then one last one and lay on the ground. <br>\r\n<br>\r\n*sigh* \"What a farce\" you say loudly, making sure the audience, giantesses, and your sister could hear. You crawl and look at the three options you have, you look up and see that the door in front of you has no handle... so you are left with two doors once again.<br>\r\n<br>\r\nWhich one do you open?</span></div></div>",
            "created":1428296400,
            "id":1959675,
            "title":"Move 11 North"
        },
        "13111121":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "Backed into the deadend in hopes to plead with the doll.",
                "Tried to roll under its legs in a desperate attempt of escape"
            ],
            "content":"<div class=\"\"><div> <span>You enter the room slowly, hesitant to what could possibly torture you in this one...The lights turn on and all you see a a bench and a girl. She says \"Welcome to the break room Hun\" she walks over to you and walks around you dragging her hand from your right shoulder down to your waist to your crotch. She looks you in the eyes and says \"Anything I could do for you? We don't have long... and I don't mind doing too much.\"<br>\r\n<br>\r\nYou awkwardly look at her and open your mouth but the only thing that comes out is \"uhh....\"<br>\r\nShe sits you down on the bench \"Maybe I'm going too fast for you? Take a seat, tell me what you've been through so far.\"<br>\r\n<br>\r\nYou sit down as she rubs you<br>\r\n\"Uhm, well... my sister put me in this stupid game show... and I took one turn walked into a door and was eaten by her\"<br>\r\n<br>\r\n\"Aww, that's awful\" she said in a soothing voice \"By the way my name is Kristie\"<br>\r\n\"Tell me more though\"<br>\r\nYou say softly \"Well... that's really all I've been through so far.\" <br>\r\nShe responds \"Hun, you have a long way to go... I'd enjoy this break while it lasts. I've had other contestants come in here who have gone through things way worse!\" <br>\r\n<br>\r\n\"Any advice for someone like me?\" You ask her<br>\r\n\"Not much... just enjoy the breaks and that's about it\"<br>\r\n\"Are there no secrets or anything?\" you ask hoping for assurance<br>\r\n<br>\r\n\"No, none at all. Anyways, enough talk this might be the last favor you get in this game. Tell me what's your strongest desire?\" She says in a seductive tone, while feeling you up.<br>\r\n<br>\r\n\"Uhm... I don't really have anything that I want\" you say to her<br>\r\n\"Nonsense\" she said Unzipping your pants and bringing her mouth towards your crotch.<br>\r\nYou sit there awkwardly as she proceeds to pleasure you.<br>\r\n<br>\r\nA few minutes pass and she has touched every part of your body<br>\r\nShe gets up and hands you your cloths<br>\r\n\"What a swell time! I'm sorry to have to go so soon... but it's time for you to go!\"<br>\r\n\"What happens if I stay here, with you Kristie\" you say desperately.<br>\r\n\"Well let's just say the last contestant that did that became one of your sisters 'play toys' poor guy...\"<br>\r\nThere was a sudden silence and you decided to leave<br>\r\n<br>\r\nYou give her a kiss on the mouth and leave closing the door behind you. You try to open the door again but it is locked. While all of this is happening you hear footsteps to your right. You turn your head to see what must have been a 'Vore Doll' that your sister told you about earlier. <br>\r\n<br>\r\nIt looked very like a fox human creature, it had paws a tail, cat ears and much more. It walked towards you with hunger in its eyes<br>\r\n<br>\r\nIn response you...</span></div></div>",
            "created":1428303600,
            "id":1959684,
            "title":"A break with Kristie"
        },
        "131111211":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "Sprint away from the sleeping Doll.",
                "Tip-toe towards the doll to grab the key from the Doll"
            ],
            "content":"<div class=\"\"><div> <span>You back into the wall of the dead end and slouch down to the floor \"Please don't eat me!\" you shouted. She took another step closer towards you. Then another. Soon she was two feet away you kicked at the doll and it was stunned in place for a second before looking at you again and licking its snout<br>\r\n<br>\r\nYou yelled again \"Please! Maybe we can make a deal! I'll do anything!\" It kept walking and you kicked again where you missed in your paniced state. You kicked again and soon fell with your back on the floor. It took another step and its legs were right above your knees<br>\r\n\"please...\" you said in one last desperate attempt. It squatted down as you tried to push your legs and body under it with the only reward being your face a few inches in front of her crotch.<br>\r\n<br>\r\nShe grabbed you by the waist as you struggled in her grasp and she put both of your legs in her mouth, which she shoved down slowly. She soon got your torso in her mouth and you could tell there wasn't much room put magically your head was soon the only thing sticking out of her mouth -- her lips stretching around the side of your head. She soon closed her mouth with you in it and more than 90% of your body swallowed she took one last huge gulp and down you went. It was tight in her stomach... unlike in your Sister's. You could feel her smack her belly and you heard \"You were a tasty one...\" You feel a tingling sensation as you lose consciousness in her belly. Occasionally hearing many burps and gurgles. <br>\r\n<br>\r\nYou woke up on the floor in a fetal position very sore. The doll much more talkative this time. <br>\r\n\"I must say... you are tastier than you look, but you didn't have the easiest time leaving my belly.\"<br>\r\nShe started again \"I tried to just cough you up... but you wouldn't fit so there was only one other way out\" she said as she smacked her butt. \"Anyways, get outa here before I get hungry again.\" ending the sentence with a wink then kissing you on the cheek. She lays down and rests her eyes in the dead end where you become Doll Food<br>\r\n<br>\r\nYou hear over the speakers a giggle from your sister and then \"Oh boy, that was priceless. How you squirmed and pleaded as she ate you then how you plopped out of her like the loser you are\" she then laughed a bit more \"Oh my... that was... amazing. Anyways you have no dice to follow right now because you just got eaten up and shitted out of a doll. So have fun running as far as possible away from that doll so she doesn't snack on you again if she wakes up.\"<br>\r\n<br>\r\n\"If someone rolls for you I'll tell you and you better follow those directions no matter what's chasing you. Unless you're being snacked on... then you can ignore the directions\"<br>\r\n<br>\r\n\"By the way... if you want there's a key around the Doll's neck if you want to risk being eaten up again. With the key you can open any door and see what is in it before you go in -- one time use kiddo is it worth it? I dunno. Go find out if you want\"<br>\r\n<br>\r\nYou look back at the doll in fear with its tail and ears twitching occasionally as she snores quietly<br>\r\n<br>\r\nWhat do you do?<br>\r\n</span></div></div>",
            "created":1428305100,
            "id":1959695,
            "title":"Plead with the doll"
        },
        "1311112111":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "Let Olivia squish you",
                "Accept Olivia's random torture"
            ],
            "content":"<div class=\"\"><div> <span>You walked away from the doll and stopped at the first door you saw<br>\r\n\"Well...\" your sister said<br>\r\n\"Open it. The game is still goin!\"<br>\r\nWithout a key you could not see what would be behind this door; you opened it anyways. You soon opened your eyes to find that you were in the middle of a large room and in-front of you was a naked giantess with her legs crossed in a chair.<br>\r\n\"Hello\" she said in a happy tone<br>\r\n\"I'm Olivia, I'm going to be your godness for now\"<br>\r\nYou looked at her... she had pale white skin with freckles and long ginger hair.<br>\r\nYou said in a scared voice \"W-well goddess Olivia... what shall I do for you to leave this room?\"<br>\r\n<br>\r\nShe picked you up with two of her giant fingers and brought you to her lips<br>\r\n\"Hmmmm... let me think\" she said letting hot air blow out from her lips onto you.<br>\r\nYou shivered in her grasp and she noticed this<br>\r\n\"Don't be shy little one... Just do as I say and nothing bad shall happen.\"<br>\r\n<br>\r\nShe opened her mouth and licked you head to toe drenching you in her saliva<br>\r\n\"Grrr...\" she said angrily \"You don't fit my taste... so I guess you're spared from my tummy\"<br>\r\n<br>\r\nShe then outlined your body and let out another sigh \"You don't feel like you'd be the best fit in my pleasure areas\" <br>\r\n<br>\r\nYou let out a sigh of relief and said \"oh... well then does that mean I'm free Goddess Olivia?\" with a smug smile on your face<br>\r\n<br>\r\n\"No no\" she said. There's still one more thing you can do for me<br>\r\n<br>\r\nShe placed you on floor and you immediately knew what she was going to do.<br>\r\nYou quickly pleaded with her \"Please, is there anything else I can do? I can tell already your feet smell terrible and I don't think I could survive under your feet.\"<br>\r\n<br>\r\nShe looked at you with a perplexed face...<br>\r\n\"Well... Uh... I've never had someone plead with me before... but I think that's because no one has ever tasted as bad as you before and so I got to eat them\"<br>\r\nYou looked at her in terror<br>\r\n\"What can I do? A girl's gotta eat\"<br>\r\n<br>\r\n<br>\r\nShe broke the silence \"Well... I guess I could do something else... but it might be a bit worse...\"<br>\r\n\"What is it?\" you ask politely<br>\r\n<br>\r\n\"That's the catch\" she says, \"You'll have to be a stain on my foot... or suffer another consequence that you'll only find out what it is when I'm about to do it to you\"<br>\r\n<br>\r\n\"I'll let you decide\" she said calmly</span></div></div>",
            "created":1428383880,
            "id":1960219,
            "title":"The hand without a key."
        },
        "1311112112":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "You run left",
                "You run right"
            ],
            "content":"<div class=\"\"><div> <span>You take steps slowly towards the doll in hopes of getting the key around its neck. You come up next to it and feel its warm breath go over your face. The smell of its breath made you shutter reminding you of the few hours you spent in its tummy. You grab the key from its necklace and pull it over its head. Success! you say to yourself. You take a few steps back and turn around to admire the doll. What an odd thing you say to yourself. You use the key on the last door near the doll to see that if you went into it you would have become a stain on a giantess's foot<br>\r\n<br>\r\nYou dodged a bullet there, you soon notice the key that went into the lock is now gone.<br>\r\n<br>\r\nYou walk away out of the dead end but before you turn you hear from behind you<br>\r\n\"By the way... my name is Julie\"<br>\r\nYou turn around to see the doll still with its eyes closed pretending to sleep talk to you.<br>\r\n\"And you were by far the tastiest snack I've ever had\" She... the dolll... Julie opened its eyes and looked at you \"Just for being such a good snack I thought I'd let you have that key, but you better bet that you'll be back inside my tummy in no time. She licked her lips and rubbed her stomach in a mocking gesture.<br>\r\n<br>\r\n\"Anyways... see you soon I had a fun time; but next time please don't put up a fight\" She winks then closes her eyes<br>\r\n<br>\r\nYou need to run away from this dead end...</span></div></div>",
            "created":1428305640,
            "id":1959696,
            "title":"Tip-toe towards the Doll..."
        },
        "131111212":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "If you think I'd listen to you, you're insane!",
                "Yes mistress. I'll please your every whim..."
            ],
            "content":"<div class=\"\"><div> <span>You flung yourself under her legs only for her to drop down and sit on the back of your head<br>\r\nyou squirmed violently but it was no use. You slowly moved your head facing up which proved to be a bad idea because now her ass and tail were in your face. <br>\r\nYou heard a soothing voice \"Comfy down there?\" it said calmly<br>\r\nYou said something but was muffled by the doll's ass on your face<br>\r\n<br>\r\n<br>\r\nShe turned around and looked down at you in-between her thighs.<br>\r\n\"Now...\" she said<br>\r\n\"You know what happens to little boys like you who try to run away\" she said giving you a boop on the nose with her paw<br>\r\nYou looked at her in terror<br>\r\n\"Well... I'm sure you don't like it if your food were to try and run away -- huh?\" <br>\r\n\"Now I have an idea. Do as I say and maybe I won't digest you once I eat you... don't follow and trust me you're not going to have a pleasant exit.\"<br>\r\n<br>\r\nThere was an awkward pause and she brought her thighs closer together around your head making it very tight.<br>\r\n<br>\r\n\"So what shall it be? Will you listen to my commands, or do we need to do things the hard way?\"<br>\r\n<br>\r\nWhat do you say?</span></div></div>",
            "created":1428380520,
            "id":1960191,
            "title":"Tried to roll under its legs in a desperate att..."
        },
        "1311112121":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "A red door with the number 14",
                "An orange door with the letter 'T'"
            ],
            "content":"<div class=\"\"><div> <span>She looked at you angrily and tightened her thighs harder making it hard for you to talk.<br>\r\n\"That's too bad\" she said in a pout-ful voice \"I thought you were pretty cute, I might have even let you go\"<br>\r\nShe stood up and grabbed your feet in-between her snout and starting slurping you into her small mouth.<br>\r\nYou squirmed and even tried to get out of her grip<br>\r\nYou smacked her in the face and she coughed and stopped swallowing...<br>\r\nYou tried to escape again but your knees were already down her throat<br>\r\nYou flipped sides to lay on your belly and started to try and crawl out<br>\r\nShe grabbed you by the waist and started to pull her into her gullet<br>\r\nYou felt your legs drenched in her warm saliva when only your arms and head were sticking out you looked her in the eyes as she angrily glared at you then gestured 'good bye' with her paws.<br>\r\nSoon your head disappeared her lips and was laying on her tongue.<br>\r\nShe stopped slurping you into her belly and started to use her tongue to lick all of your face mockingly before doing one last gulp sending you into her belly.<br>\r\n<br>\r\nYou could hear her, outside of her stomach \"you really hurt me there...\"<br>\r\nyou screamed back \"You're not the one being eaten for Christ's sake!\"<br>\r\n\"Welcome to the food chain then. Prey shouldn't be hurting their predators!\" <br>\r\n\"I hope you feel bad for what you did out there while you sit in my tummy\"<br>\r\nYou screamed at her making her feel bad about herself<br>\r\n<br>\r\nShe remained quiet and no longer responded to your shouts of hate.<br>\r\n<br>\r\nSoon you started to get sucked into her lower stomach passage \"Oh god\" you muttered to yourself as you went head first into the second stage of being eaten. Your head was the first thing to exit her body between her plump ass. You saw the light and saw right under you was the floor of the maze. You fell limp out of her and smelled terrible. You tried to move but you couldn't... you were paralyzed! After she finished exiting you from her body she turned around and stood over you.<br>\r\n\"Well well...\" she said with a victorious tone<br>\r\n\"Looks like we see what we get when a meal tried to escape\"<br>\r\nShe put her foot onto your face rubbing it in<br>\r\n\"You're the prey... I'm the predator get used to it. If you don't you'll just be ending up in my tummy more and more.\" <br>\r\n<br>\r\nShe then started again \"Well... you should be able to get up in about ten minutes I guess. You look so pathetic. You tried to fight back and what happened to you? You just ended up plopping out of me.\"<br>\r\n<br>\r\n\"Victory smells good the top of the food chain\" she kept rambling \"Want to know what it smells like down there\" she retorted smiling<br>\r\n<br>\r\nShe squated down above your face and lifted her tale about your mouth and let out a huge toot and a gust of warm air<br>\r\n<br>\r\nShe stood back up and looked down on you again \"Anyways... I hope you didn't learn your lesson. It just means more time for you to be in my tummy\"<br>\r\n<br>\r\nShe stomp away without looking back.<br>\r\n<br>\r\nYou closed your eyes and took a nice rest.<br>\r\nWhen you woke up you awoke in a diffrent spot and heard the speaker from your sister<br>\r\n\"Now... listen here\" she spoke<br>\r\n\"Don't fight a doll... they'll just do worse and worse things to you kiddo -- next thing you know they'll just be using you to wipe their ass, and trust me I've seen them do that to someone once.\"<br>\r\n<br>\r\n\"Anyways, the game is still going. You know what to do. 2 doors next to you. Chose one.\"<br>\r\n<br>\r\nYou look at the doors...</span></div></div>",
            "created":1428382200,
            "id":1960205,
            "title":"A doll's fighting snack"
        },
        "1312":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "Well then let's start, no need to waste time!",
                "I really don't want to do this... please can we stop?"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't talk to me in that tone!\" she blurted out.<br>\r\n\"You're lucky I don't make you a stain on my foot right now mister!\"<br>\r\nYou back away slowly in fear and there is a small silence. \"Well... the rules... are you going to tell me them or are we just going to have a staring contest?\"<br>\r\n\"Oh yes\" she said in a suddenly calm tone<br>\r\n<br>\r\n\"A viewer will roll two dice, you will move that number in a direction and open a door near that spot.<br>\r\nThere are three types of room, a torture room, a break room, and your freedom door.\" She said \"There are also some things that I have called made called 'Vore Dolls' if you encounter one they will chase you and... 'vore' you up.\"<br>\r\n<br>\r\n\"Vore? What's that?\" You said<br>\r\n<br>\r\nShe sighed dramatically \"They'll eat you whole. Then you will... meet an unfortunate exit and have to escape from there; make sure you don't get caught by two... it will take a while until they get bored of you... or think about doing other things to you.\" <br>\r\n<br>\r\n\"Anything else I should know?\" you shouted<br>\r\n<br>\r\n\"Nope. There are a few secrets here and there but... you'll find those yourself. And make sure you finish this fast, if you're here for too long I guess you'll just be my little slave\"<br>\r\n<br>\r\nYou say...</span></div></div>",
            "created":1428296400,
            "id":1959659,
            "title":"You expect me to remember something you said?"
        },
        "13121":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You say you are ready<br>\r\n(Follow this link to the next part)<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1780550-Maze-of-Torture/map/1311\" target=\"_blank\">http://www.writing.com/main/interact/ite...</a></span></div></span></div>",
            "created":1428363060,
            "id":1960032,
            "title":"Into the game!"
        },
        "132":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "Chooses to be eaten",
                "Chooses to be unbirthed",
                "Doesnt make a choice in time, therefore up Kates shithole"
            ],
            "content":"<div class=\"\"><div> <span>\tWhile Kate was walking back to her home, she decided to stop at a washroom to give John a break from her foot...  She removed her stocking that had John and gentally had John fall right into her left hand.  John looks up at Kate, Kate said\" You should know Mom origionally was going to make you a part of her favourite breakfast and then eat it, thinking that if you can't be a good son then you should at least be good as a part of her food\" John replide back\" But what your doing would kill me anyways so what would be so different\"  Kate replied back\" Look brother, even though you been rude to me, I still care alot for you alot more than mom does for you at this point..  I did what I had to do to save you, and at the end Mom will welcome you back with open arms, knowing you will have changed your ways when this is all over.\" Kate paused then continued\" Dont worry John I meant the truth when I said you wont die, unlike the shrinking potion Mom would of gave you, the one I had her give you also renders  your body immortal, meaning no matter what you go through even full digestion, you will wake up in the same place it was done to you allowing you to continue on in the maze\" John now sitting down now contempating what is being said to him, he himself admits that maybe this is for the best.  <br>\r\n<br>\r\n\tJohn than looks up and asks\"How long average does someone go through this maze?\"  Kate looks down and answers \"An average person takes 5 weeks, people usually take too long the first time around,  however mom did set a condition, if you are still in the maze by the time Mom's birthday in 6 months, she does not want you back, meaning you will then be permanently trapped in the maze, as you see I put a special bracelt on you that is glowing green.\"  John looks at his wrist and sees the bracelet which also sported a timer..  Kate continued\" The timer will run till the day of moms birthday, until that time the bracelet will keep glowing green. The exit door will only open and allow those whos bracelet is still green through, Once it turns red any attempt to open the door will cause the maze to reset.\" John looking at Kate and said\"But, you said...\"  Kate interupted\" Look brother, While I do care for you, I can't see that being true should you let our Mom down by not competing the maze before her birthday, infact to send you a message on that day should you not make it out, she already reserved a play spot for that day, and if her turn makes you end up on a punishment spot or you end up in the hands of a vore doll, you will be put though that punishment for every year you been bad, which by my count is 10 years. Imagine being trapped in a vore dolls belly then being slowly and painfully converted to mush, then formed into a log of shit, with all that being done in a course of 10 years.\"  John's face had the look of fear.  Kate said\"Don'rt worry, while i cant make it obvious ill leave you suttle hints of where the exit is.\"<br>\r\n<br>\r\n\tKate then said\" Well its time to be on our way, but first to put you somewhere different, i think after all this talk about vore, I am going to put you inside me the rest of the way, dont worry though ill give you something to make the first experience painless, and guess what...  Ill let you choose..   either I eat you like I would a piece of food... or I insert you into my womb, your choice, but take to long  and Ill put you in my shithole.\"<br>\r\n<br>\r\nJohn .......  </span></div></div>",
            "created":1346648400,
            "id":1420227,
            "title":"3 hours later Kate Decided to give John a Break..."
        },
        "133":{
            "author_id":"doomblessing",
            "author_name":"DoomBlessing",
            "choices":[
                "You do nothing, in fear of a punishment",
                "You scream for help hoping to get the attention of your sister",
                "Crawl out of her stocking and boot to the outside world"
            ],
            "content":"<div class=\"\"><div> <span>You hear her open the door to your new home and she starts to stomp around the place making sure to rub her smelly foot into you as much. You notice that she is not letting you out of her stocking and that you are still trapped with your face being smushed by the soles of her foot.You hear her voice through the walls of the jail you are in which is her foot.<br>\r\n<br>\r\nYou hear a treadmill start up and soon painful stomps from her foot push you further and further into her foot. The air starts to smell of sweat. You start to scream for help only to hear your sisters laugh vibrate through her boot. She takes one more large step and you are squished out of consciousness.<br>\r\n<br>\r\nWhen you wake up you are in her sweaty, foul smelling boot and stocking; aching all over.<br>\r\nYou know you are at your destination... but your sister hasn't told you to do anything<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1428362460,
            "id":1960024,
            "title":"An extended stay..."
        }
    },
    "info":{
        "author_id":"tkmaster",
        "author_name":"Teus",
        "brief_description":"You are shrunk and given to your sister for her to torture you",
        "created":1306714320,
        "description":"<td align=\"left\" class=\"norm\">Your John a 18 year old who is very mean towards your mother and your sister..<br>\r\n<br>\r\nYour mom Mary had enough of your attitude and decides to get rid of you by shrinking you and giving you to your sister Kate for her to do whatever she feels necessary..<br>\r\nKate as your older sister who was quite successful, you know that by the fact she seems to making alot of money even though you don't know what it is...  but you will soon find out.....<br>\r\n<br>\r\n<br>\r\nRules<br>\r\nno 1 line chapters...<br>\r\nno killing (as part of the shrinking process it renders the victim immortal) but feel free to put the character in as many situations as you can think of even ones that would normally kill a person<br>\r\nand have fun...</td>",
        "id":1780550,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1428383880,
        "modified":1428383880,
        "pretty_title":"Maze of Torture"
    }
}