{
    "chapters":{
        "1":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "Kim Pine",
                "Ramona Flowers",
                "Knives Chau",
                "Envy Adams",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who should we start with?</span></div></span></div>",
            "created":1545428340,
            "id":2591676,
            "title":"Let's get started!"
        },
        "11":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "\"Scott?!? Is that you?\"",
                "\"Ugh, a bug.\" "
            ],
            "content":"<div class=\"\"><div> <span>*Groan* \"What happened last night?\" Scott said as he woke up with a nasty headache. He quickly noticed his surroundings, he was in someone's room, but everything was really big! He appeared to have been shrunken overnight! Scott couldn't believe his eyes. \"This has to be a dream, right?\" he asked himself. Before he could pinch himself to see if he was dreaming, the bedroom door opened. Kim enters the room looking as unenthusiastic as ever and completely unaware of Scott staring up in awe of how big she was compared to him. Scott yells at Kim to try to get her attention. \"HEY KIM! IT'S SCOTT! I'M DOWN HERE!\" \"Hm?\" Kim looked down and noticed him.</span></div></div>",
            "created":1598594640,
            "id":2892920,
            "title":"Kim Pine"
        },
        "111":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "She decides to eat him",
                "She makes him her sex slave",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Kim's eyes lit up \"Scott?!? Is that you?\" She then picked him up and lifted him to her face. \"How did you get this small, And why are you in my room?\" She asked. \"I don't know! I just sorta woke up here!\" Scott replied \"Uhhh Kim? Why are you looking at me like that?\" Kim's shocked face soon turned into a grin realizing the kind of things she could do to Scott while he's this small. She could crush him beneath her feet, make him her slave and have him do humiliating tasks for her, or she could even just swallow him whole and have him become a part of her sexy body. \"Oh I have some good ideas of what to do with you, Scott.\" She said \"This is gonna feel soooooo good.\" And with that...</span></div></div>",
            "created":1598596620,
            "id":2892939,
            "title":"Scott the tiny"
        },
        "1111":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "Bye Bye Pilgrim",
                "No! He can't give up!"
            ],
            "content":"<div class=\"\"><div> <span>After staring at Scott for a few seconds, Kim licked her lips and then decided what she was gonna do to him. \"You know what? I think I'll just eat you here and now.\" She says \"You'd be way more useful as a snack anyway.\" She then lifts Scott over her head and opens her mouth wide open. \"Can't we talk about this?\" Scott pleaded with the hungry giantess. \"No.\" She said plainly. And with that Kim drops Scott into the dark cavern below and closed it shut preventing him from getting out. She begins to lick him all over while moaning. \"He tastes a lot better than I thought he would.\" She thought to herself. Meanwhile Scott was on quite the ride inside his Ex-girlfriend's mouth. Her tongue kept pressing him against her cheeks and he kept getting her saliva in his mouth. Suddenly Kim's tongue began to lift towards the back of her mouth and deposited Scott into her throat. *Gulp* Kim then places her finger on her throat so she could feel Scott sliding down into her stomach. \"Ahhhhh you were surprisingly tasty Scott.\" She said as she placed a hand on her belly. \"I wonder what part of me you'll become, my breasts, my sexy ass, or whatever. It really doesn't matter to me.\" \"The main thing is I don't have to deal with you ever again. Oh and don't worry about Ramona, I'll let her know that you don't want anything to do with her ever again.\" She said with a smug look on her face. \"Besides, I'm sure she wouldn't mind having a threesome with me and Knives anyway. I'd say it was nice knowing you, But I'd just be lying to myself. Goodbye Scott Pilgrim.\" And with that Kim gets up and grabs her phone to call Ramona. Is this the end for Scott Pilgrim?</span></div></div>",
            "created":1598600640,
            "id":2892964,
            "title":"Kim Pine's Tasty Little Snack"
        },
        "1113":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "Makes him massage and lick her feet",
                "Calls either Ramona or Knives to join in the fun",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does she do to him?</span></div></span></div>",
            "created":1598600880,
            "id":2892965,
            "title":"other"
        },
        "15":{
            "author_id":"megaman7",
            "author_name":"KimPinefan7",
            "choices":[
                "Roxie Richter",
                "Lynette Guycott",
                "Julie Powers",
                "Lisa Miller",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay how about these lovely ladies?</span></div></span></div>",
            "created":1545428700,
            "id":2591678,
            "title":"How about someone else"
        }
    },
    "info":{
        "author_id":"megaman7",
        "author_name":"KimPinefan7",
        "brief_description":"Scott Pilgrim is now at the mercy of the females in Toronto! Will he survive? ",
        "created":1302842220,
        "description":"<td align=\"left\" class=\"norm\">The only rules are that Scott is the only male in the story and he is the only one that shrinks.<br>\r\n<br>\r\n<br>\r\nOther than that go nuts.</td>",
        "id":1767948,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1598600880,
        "modified":1598600880,
        "pretty_title":"Scott Pilgrim's Shrunken Life"
    }
}