{
    "chapters":{
        "1":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Mighty Morphin",
                "Zeo",
                "Turbo",
                "Space",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose a season either one of the earlier ones or newest existing ones</span></div></span></div>",
            "created":1425358800,
            "id":1942961,
            "title":"Starting off"
        },
        "11":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Jason or Rocky",
                "Billy",
                "Zack or Adam",
                "Tommy",
                "You youself"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ah the first one! So who gets shrunk? You can either be found by Kimberly,Trini or Rita herself</span></div></span></div>",
            "created":1425358800,
            "id":1943089,
            "title":"Mighty Morphin"
        },
        "114":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Step on him",
                "Swallow him",
                "Something more extreme"
            ],
            "content":"<div class=\"\"><div> <span>In this episode Rita attempts to shrink down the Power Rangers but only manages to shrink down Tommy(still the Green Ranger) without aid from the other Rangers he is helpless at the mercy of the evil sorceress \"Ha,ha little Tommy looks like I got you in my clutches don't worry I'm not going to turn you evil again only give you the worst day and possibly last day of your life!\" She cackled \"You won't win Rita somehow I'll get out of this and you'll pay!\" \"Highly doubtful Green Ranger its most unfortunate that your Power Morpher didn't shrink with you otherwise this might be easy for you now prepare for Pain Goldar time for a game of destroy Angel Grove and the other Rangers I'll send down a group of Putties to assist you I'll take care of the puny Green Ranger.\" \"Yes my Queen!\" Goldar replied as Rita set to torture the mini Ranger but how?</span></div></div>",
            "created":1425358800,
            "id":1943124,
            "title":"Tommy"
        },
        "1142":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "*Gulp.*",
                "Spits him out. Let's have some more fun."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Time for supper!\" Rita yells, laughing. \"NOOOOOOO!\" Tommy screams and Rita puts him near her mouth. She puts Tommy in her mouth and......</span></div></span></div>",
            "created":1591457760,
            "id":2846819,
            "title":"Swallow him"
        },
        "11422":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "Change her mind",
                "In the Shirt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I am not done with you yet. She decides... </span></div></span></div>",
            "created":1591457820,
            "id":2846820,
            "title":"Spits him out. Let's have some more fun."
        },
        "114221":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Just joking!\" Rita then swallows him.</span></div></span></div>",
            "created":1591457880,
            "id":2846821,
            "title":"Change her mind"
        },
        "115":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Kimberly",
                "Trini",
                "Rita"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which are you found by</span></div></span></div>",
            "created":1425358800,
            "id":1943118,
            "title":"You youself"
        },
        "1151":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Regular clothes",
                "Pink Ranger uniform"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One final question will Kim be in either her citizen clothes or Pink Ranger attire when she finds you?</span></div></span></div>",
            "created":1425445200,
            "id":1943583,
            "title":"Kimberly"
        },
        "11511":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up on a massive chair. Suddenly, Kimberly walks in wearing civilian clothing. She turns around and is about to sit on top of you! Does she notice you at the last second?</span></div></span></div>",
            "created":1506142800,
            "id":2390410,
            "title":"Regular clothes"
        },
        "115111":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Kimberly is shocked and wants to help",
                "Kimberly smiles and wants to have some fun",
                "Kimberly faints on the spot"
            ],
            "content":"<div class=\"\"><div> <span>Fear. An unpleasant emotion caused by the belief that someone or something is dangerous. That sounded about right. What was slowly descending above you was definitely dangerous. It couldn't be real. It was downright impossible. But yet here it was.<br>\r\n<br>\r\nA giant pink panty covered ass in a skirt. It was massive, about as big as a meteorite hurdling towards earth. Scratch that, two meteors headed towards earth. Both cheeks were firmly attached to a giant girl,clearly a teenager with shoulder length brown hair,a pure pretty face with equally brown colored eyes and a ultra slim but still highly toned,athletic body. How was that even possible. You couldn't even fathom your situation as you began to hyperventilate.<br>\r\n<br>\r\nThis wasn't real. This all had to be just one bad dream. Suddenly your knees started to tremble before finally giving weigh. You broke out in a cold sweat as your doom came closer at an astoundingly slow rate. Was the universe trying to troll you. That would be just your luck, right?<br>\r\n<br>\r\nJust what were you supposed to do. This girl or... Whoever she was clearly couldn't see you. You'd end up as nothing more than a stain on her rear end. That thought only terrified you more. To be crushed flat like Wiley in an episode of Looney Tunes. <br>\r\n<br>\r\nIt would be such a horrible way to go too. The human ass was disgusting. It smelled and felt gross when it began to sweat. Was this really to be your end? You could see your life flashing before your eyes. Images of the past and future were laid bare. You could see the embarrassing words that served as your epitaph, 'rear ended!'.<br>\r\n<br>\r\nNo! No! No! This couldn't be how you died! There were still so many things you hadn't even gotten to yet. The ass's shadow only grew as it closed in. Running wouldn't help and trying to hold it off yourself was out of the question. With nothing left to loose, you did the only thing your fragile mind could do.<br>\r\n<br>\r\nYou screamed. You screamed to the high heavens and begged for a miracle. Much to your shock it would seem you had a guardian angel watching over you. The ass ceased it's descent not even an inch from your face before rising. Think god. You could literally smell the remnants of sweat.<br>\r\n<br>\r\nMuch to your growing relief the giantess in question stood tall and turned around to face you, When she did she looked almost confused as if searching for something before her eyes settled on you. When they did you almost thought they would fall out of her head they were so wide.<br>\r\n<br>\r\n\"H-Hi!\" you waved.<br>\r\n<br>\r\nThe pink-clad girl's jaw hung open before giving her oh so intelligent reply. \"Huh?!\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1564203600,
            "id":2692945,
            "title":"Pink Moon"
        },
        "1151111":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Rita's Putties attack",
                "Zordon summons her and the others ",
                "Bulk and Skull pop up out of nowhere"
            ],
            "content":"<div class=\"\"><div> <span>At first the gigantic Pink Ranger is clearly shocked out of her mind,here she was staring face to really small face at a actual tiny person! It was completely unreal but then again ever since she first became a Power Ranger,she had seen stranger things!<br>\r\n<br>\r\nBut collecting herself Kimberly simply leaned in a bit closer and gasped.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://www.google.com/url?sa=i&amp;source=images&amp;cd=&amp;ved=2ahUKEwj3jbODhNXjAhUF0lQKHfTFBMwQjRx6BAgBEAU&amp;url=https%3A%2F%2Fgifer.com%2Fen%2Ftjx&amp;psig=AOvVaw0q0QEjOBV8HW3E41FLUsHE&amp;ust=1564314486268891\" target=\"_blank\">https://www.google.com/url?sa=i&amp;source=i...</a><br>\r\n<br>\r\n\"O-oh Oh my gosh! Are you a real tiny person...I mean human? H-how did you wind up like this? And right under me?\" She choked out.<br>\r\n<br>\r\n\"I have no clue honest!\" You had to cup both hands over your mouth just to yell up at the teenage chick. \"P-please don't be angry that I was beneath you like that! I-I only wanted...\" But she slowly extended her enormous hand tenderly picking you up and bringing you towards her massive pretty face.<br>\r\n<br>\r\n\"It's alright I won't hurt you! And I'm not mad.  My name's Kimberly Ann Hart and you say you have no idea how you ended up this way,all tiny and such?\" As you nodded.<br>\r\n<br>\r\n\"Were you put under a spell by Rita Repulsa or something?\" She asked curiously.<br>\r\n<br>\r\n\"Who's that?\" You asked arching a eyebrow as her expression changed.<br>\r\n<br>\r\n\"Uh never mind! Anyway this is terrible but fortunately I have a friend named Billy who might be able to help you out of this unfortunate predicament.\" As she stood up smiling sunnily at you.<br>\r\n<br>\r\n\"So looks like you'll be staying with me for a while okay little guy? Oh by the way I almost forgot what's your name?\" She asked curiously.<br>\r\n<br>\r\n\"Willy.\" You replied as she nodded as she went to head to the local Juice Bar here in Angel Grove,CA when out of the blue.....</span></div></div>",
            "created":1564203600,
            "id":2693019,
            "title":"Kimberly is shocked and wants to help"
        },
        "1151112":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Kimberly takes you upstairs for some \"fun\"",
                "Kimberly decides to play a game",
                "Kimberly gets a call from the command center"
            ],
            "content":"<div class=\"\"><div> <span>Kimberly Hart had seen many strange and bizarre things in her brief time as a Power Ranger. She'd seen monsters, robots, aliens, witches, ape men, and even magic. But never before in her life had she ever seen a shrunken person. This by far took the cake as the most bizarre thing she'd ever seen.<br>\r\n<br>\r\nSo much so that all she could get was a simple, \"Huh?\"<br>\r\n<br>\r\nSeeing that the giant girl was at a loss for words and simply staring at you, you decided to see if you could get things moving again. \"H-hey there? Can you help me? I'm in a bit of a fix here?\"<br>\r\n<br>\r\nYou prayed to God this didn't end poorly.<br>\r\n<br>\r\nHearing your words seem to do the trick as the stunned pretty young giantess returned to reality. She did her best to shrug off her surprise and give you a reassuring smile. You said you needed help and it was her duty as a ranger to assist you. \"Ohh...Oh yeah I-I'm s-sorry anyway my name's Kimberly, Kimberly hart. And you are...?\"<br>\r\n<br>\r\nYou smiled nervously before introducing yourself. You then went on to explain that you were lost and didn't know what was going on. Your explanation of events had the giant girl's full attention, although she wished she could unhear the part about nearly crushing you with her butt.<br>\r\n<br>\r\nHer very toned and well rounded butt.<br>\r\n<br>\r\n\"I'm really sorry about that. I-I didn't realize you were underneath me l-like that!\" Kimberly apologized turning literally red as she clasped a hand to her mouth. As embarrassing as it was to hear she still needed to let you know she was sorry. <br>\r\n<br>\r\n\"It's alright.\" You shrugged. No harm no foul. \"I just need a little help.\"<br>\r\n<br>\r\nKim nodded before holding her hand out. <br>\r\n<br>\r\n\"Ohh sure thing! I'll be happy to help you out....careful now...quick step onto my hand!\" Taking this as a sign to hop on, you leap into the girl's outstretched palm. The feeling of being able to fit in a person's hand was as amazing as it was horrifying. Not to mention you had that giant face looming over you. The same one that was trying to assure you everything would be okay.<br>\r\n<br>\r\nAs you began to get lost in your own head, Kimberly began to feel an odd sensation in her chest. Holding you in her hand like this was... totally weird. Never in her life did she think she'd be literally holding a life in the palm of her hand, It felt oddly gratifying.<br>\r\n<br>\r\nMaybe she could keep you for a while? \"Hey?\" she called, gaining your attention.<br>\r\n<br>\r\n\"Yeah?\"<br>\r\n<br>\r\n\"Since you're in such a bad way right now, you're going to need someone to take care of you until a cure for your condition can be found, right? I'll take care of you, until then. You'll be perfectly safe alright? I-I'm going to lift you up now okay?\" Kim grinned. For some odd reason she just felt compelled to have you. <br>\r\n<br>\r\n\"Oh. Um, maybe you could just take me to a hospital?\" You suggested. Something had just changed. Maybe it was the eyes. You didn't like how she was looking at you right now, as if you just a small piece of meat. <br>\r\n<br>\r\n\"Nonsense.\" Kim waved off. \"I'll take good care of you and you can tell me a little more about yourself.\"<br>\r\n<br>\r\nYo gulped nervously. Maybe getting the giant's attention wasn't such a good idea?</span></div></div>",
            "created":1580014800,
            "id":2778538,
            "title":"Other Plans"
        },
        "1151113":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Risk climbing down to Kimberly",
                "Stay put and wait for Kim to wake up",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Huh!?\" Was all the giant  pink-clad girl could do before her eyes rolled in the back of her head,Kimberly's too bright lips quivered(you couldn't make out a single word she was muttering but managed to catch a few unrecogizable ones like 'Zordon' and Rita Repulsa') What came next left you reeling. The teenage girl took a trust fall without a partner there to catch her as she slumped over!<br>\r\n<br>\r\nYou reached as if to stop her decent, but it was all for naught after all,she was about two hundred feet bigger than you right now! <br>\r\n<br>\r\nShe hit the ground hard and the impact sent you falling flat on your face. Your entire perch felt like it was being ravaged by an earthquake unlike any other. It was as if someone had just dropped a bomb not too far from your position. The quake was just that intense.<br>\r\n<br>\r\nOnce the world finally seemed to settle the first thing you did was run to the edge of the chair. Sure enough you could see the young woman laid out spread eagle in a dead faint. The shock of seeing a tiny person must've been to much for the poor girl to handle.<br>\r\n<br>\r\nOh well. This was preferable to being trapped in a room with a psych or pervert... or a psychotic pervert. That would've been bad. \"H-hey!? Can you hear me!?\" you called.<br>\r\n<br>\r\nNo response. As she continued to lie there as if in a deep sleep or as if she was...but you couldn't bear to think that right now! <br>\r\n<br>\r\n\"Are you alright!\" You cried out again as again no response from the giant Pink Ranger.<br>\r\n<br>\r\nSilence.<br>\r\n<br>\r\nIf it weren't for the obvious rise and fall of her chest letting you know she was still alive, you'd be more panicked right now. \"Huh, I guess she's really down for the count.\"<br>\r\n<br>\r\nYou then looked to her and how far of a drop it would be to reach her. If you were going to get out of this situation and figure out what was going on then you needed her help. <br>\r\n<br>\r\nYou could risk climbing down and making it to her enormous  body at least 300 Feet compared to you! Maybe you could rouse her from unconsciousness somehow? Or then again you could just wait for her to wake up on her own. At least that way you wouldn't be putting yourself in any kind of danger.<br>\r\n<br>\r\nBut then again who knows what could happen now that you were tiny and vulnerable. Maybe waiting isn't such a good option? You were wracking your brain now. \"Dang it! What do I do?\"</span></div></div>",
            "created":1577422800,
            "id":2765384,
            "title":"Out Cold"
        },
        "115112":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "You were behind her ass and almost in the seat cushions.",
                "your head was under her pussy. her leotard was tight enough to have a cameltoe",
                "Kimberly stood up and saw you.",
                "something else happens"
            ],
            "content":"<div class=\"\"><div> <span>You didn't even get a chance to cry out before the workout-leotard-covered building-sized butt landed on you. Only the fact you were lucky enough to be in the path of her crack allowed you to live.<br>\r\n<br>\r\n\"Woo... Gymnastics training was tough today, but it'll be worth it when the Pan Global Games comes around. I doubt I'll get up anytime soon, though,\" Kimberly said as she adjusted herself, grinding her butt against the chair and you. When she felt you, she said, \"Huh... must be sitting on a rag or something.\"<br>\r\n<br>\r\nYou yelled, hoping to be heard. Alas, your cry was muffled by the ass.<br>\r\n<br>\r\nWhen you heard what sounded like news from the TV, you knew you had to wriggle free or risk either being crush or farted on. <br>\r\n<br>\r\nAnd at your size, being farted on in such a tight space was a death sentence.<br>\r\n<br>\r\nWriggling in one direction did allow you some movement, but only backwards or forwards. Ass flesh blocked you from any other direction.<br>\r\n<br>\r\nAs you wriggled towards freedom, Kimberly began to realize that she was not sitting on a rag or some other tiny object.<br>\r\n<br>\r\nEventually, your head came into contact with fresh air.</span></div></div>",
            "created":1557464400,
            "id":2658079,
            "title":"Under Kimberly Hart's heart-shaped ass"
        },
        "1151121":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "You grabbed a finger and she held you in front of her face.",
                "You hid and Kim quickly gives up",
                "You hid, but Kim doesn't give up looking for you.",
                "you did something else"
            ],
            "content":"<div class=\"\"><div> <span>You were pleased to find some more room to move and breathe. As you slowly got on your feet in an enclosed space, you saw you were right in the space between the crack of the giant woman's ass and the chair.<br>\r\n<br>\r\nNot having many options, you decided to climb up, using the chair fabric as a makeshift ladder.<br>\r\n<br>\r\nThe climb was a tight one and the only good part was that you were surrounded by a giant shapely female posterior.<br>\r\n<br>\r\nSeveral times, she leaned back and you were unable to climb, enveloped by spandex and female ass. The first couple of times, you nearly ran out of air. After that, you took deep breaths whenever you thought she was getting read y to lean back.<br>\r\n<br>\r\nWhen your head and shoulders were finally out in the open air, Kim finally was certain she felt something by her butt.<br>\r\n<br>\r\nAs she reached back with one hand, you had a few options<br>\r\n<br>\r\nYou could grab her finger and hope she's in a nice mood.<br>\r\n<br>\r\nYou could climb between the seat cushions and hope she doesn't find you for now.</span></div></div>",
            "created":1564203600,
            "id":2693235,
            "title":"Between seat cushions and ass"
        },
        "1151122":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "She called Trini",
                "She called another power ranger",
                "she decided against calling, as she felt like doing naughty things with you"
            ],
            "content":"<div class=\"\"><div> <span>As you took some needed fresh air, you felt what felt like large marshmallows on the back of your head.<br>\r\n<br>\r\nLooking back, you blushed. The back of your head was touching the leotard-covered-pussy of the MMPR Pink Ranger. It was so skin-tight, you could swear it was painted on.<br>\r\n<br>\r\nReturning your head forward, you mouthed, \"Oh my god...\"<br>\r\n<br>\r\n===<br>\r\n<br>\r\nAs she watched news about the Power Rangers, Kimberly now felt a tiny furry object by her pussy. She muttered, \"Oh great... please let it be a dust bunny and not a bug...\"<br>\r\n<br>\r\nSo she reached down and tried to move the dust bunny out of the way.<br>\r\n<br>\r\nWhen Kimberly felt your head and face, she muttered, \"What the...\"<br>\r\n<br>\r\nShe looked down and gasped when she saw you shake your head.<br>\r\n<br>\r\nSo Kimberly stood up and got on her knees to look you in the face. With restrained anger, she asked, \"W-who are you And...Why were you under me?\"<br>\r\n<br>\r\n\"I don't know. I just woke up this small and on this chair,I-I'm terribly sorry Miss....I didn't...mean any harm honest!!\" You said as you slowly moved about to sit up.<br>\r\n<br>\r\nShe stared at you for a few moments, making you wonder if she was going to hurt you.<br>\r\n<br>\r\nEventually, she sighed, looked away, and muttered, \"I'm too kind-hearted for my own good...Well I suppose you're telling the truth. And I'm really sorry for accidentally sitting on you.\"<br>\r\n<br>\r\nShe looked at you and asked, \"Is there any place or anyone I can call to pick you up?\"<br>\r\n<br>\r\nYou opened your mouth... and realized you only remembered who she was and your name. \"I... don't know. I only know my name is Will...\"<br>\r\n<br>\r\n\"Well, my name is Kimberly Hart.  But my friends call me Kim, though anyway no need to be scared,I won't hurt you okay? I'll let you stay here with me, but I'll need to call a 'friend' to see if they can help,\" Kimberly said before she stood up and went to a telephone.</span></div></div>",
            "created":1558069200,
            "id":2660934,
            "title":"Kim's cameltoe"
        },
        "1151123":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Kimberly shows up and tells you that she's going to keep you like this",
                "The pink Ranger shows up and says she has perverted punishments for you.",
                "Rita appears and asks Kimberly if she's willing to join her to keep you"
            ],
            "content":"<div class=\"\"><div> <span>It took you a few moments before you realized the reason you were breathing fresh air was because Kim had stood up and was looking down.<br>\r\n<br>\r\nShe had a flat look on her face and asked, \"Alright, how did you get that small and why are you on my chair?\"<br>\r\n<br>\r\n\"I don't know. I woke up like this and I don't know how I got here,\" You said.<br>\r\n<br>\r\nKimberly then glared at you as she asked, \"Did you make any attempt to get my attention or even move before I sat on you?\"<br>\r\n<br>\r\nYou gulped, as Kimberly looked really scary.<br>\r\n<br>\r\n\"I tried to get your attention, but I guess you didn't hear me. I was only able to run enough to... get stuck in your crack. S-sorry, but I don't know how to phrase that in a more polite way,\" You said.<br>\r\n<br>\r\nKimberly continued to glare at you for a few more minutes until she sighed and rubbed her forehead. She muttered, \"I'm sorry, but I had a really tough day working out and had to deal with a few.... troublesome people.\"<br>\r\n<br>\r\nShe congratulated herself for preventing herself from telling you she was a power ranger and still fought monsters.<br>\r\n<br>\r\nGiving you a smile, she continued, \"So I have an idea how bad things can suddenly happen especially in Angel Grove. What with the Monsters and stuff. I'll go find the power rangers. They're a really big help.\"<br>\r\n<br>\r\n\"That'd be nice,\" You said.<br>\r\n<br>\r\n\"Good, I'll be back soon!\" Kimberly said before she left the room.<br>\r\n<br>\r\nOn the way, Kimberly had been secretly attacked by Scorpina, who shrunk you. Th raygun Scorpina had altered Kim's attitude. <br>\r\n<br>\r\nNow Kimberly wanted to keep you small, even ask some female friends if they wanted to play with a small guy.</span></div></div>",
            "created":1564203600,
            "id":2693246,
            "title":"Kimberly stood up and saw you."
        },
        "11511231":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Kim uses her tongue on your dick",
                "She gives you a full-bodied blowjob",
                "Uh oh, Kimberly pulled down her pants. Where are you going?"
            ],
            "content":"<div class=\"\"><div> <span>Some time later, Kimberly strode into the room and looked down on you with a smile. A smile that seemed way too prideful.<br>\r\n<br>\r\n\"Miss Hart?\" You asked.<br>\r\n<br>\r\nKmberly nodded, muttering, \"I guess I am famous, what for my gymnastics.\"<br>\r\n<br>\r\nEven under the raygun's effects, she wouldn't tell you that she's a Power Ranger.<br>\r\n<br>\r\nWhen she began to slowly  reach for you, you tried to run away. But with your smaller size, she was easily able to grab you. You briefly struggled in her massive tree trunk sized fingers as you said, \"Miss Hart?\"<br>\r\n<br>\r\n\"Call me Kimberly or Kim. I mean, we're going to be dating, after all,\" Kimberly replied as she slightly pouted in a playful way, giving you the duck lips pout.<br>\r\n<br>\r\n\"Wha?\" You uttered in either surprise or confusion.<br>\r\n<br>\r\n\"Yup! A cute tiny guy like you needs a cute tough girl like myself. Not only that, I'm single! Well, formerly single now...\" Kimberly said before kissing your face with her far too red puckered lips a few times. It was like being kissed by pillows covered in lipstick. Once she was done, she said, \"Ohh Mwah,Mwah.....How was my kisses?\"<br>\r\n<br>\r\n\"They.. they were alright,\" You answered, wondering what madness you were in.<br>\r\n<br>\r\nNow the pout became a bit sad or annoyed. She said, \"Awww... Here I thought you would just <i>love </i>my kisses. I guess you might be more of a breast man.\" The gigantic cute teen smirked.<br>\r\n<br>\r\n\"Wait,what?\" You asked as Kimberly pulled her massive purple/white top revealing her almost C-sized breasts and shoved you in her bosom, which was still a bit sweaty, making the air thick with her pheromones.<br>\r\n<br>\r\nAfter letting go of her shirt collar, she pressed her boobs together and asked, \"Giggle...How are my girls?\"<br>\r\n<br>\r\nHer boobs were incredibly soft, so there was no worry of being crushed at the moment. You yelled,\"They're great! Now please free me!\"<br>\r\n<br>\r\n\"Hmm... No response. I guess they need to be tighter,\" Kimberly said to herself. So she began playfully hugging her boobs.<br>\r\n<br>\r\nNow her boobs were nearly smothering you, making you worry that you might die from suffocation.<br>\r\n<br>\r\nAfter a few moments, Kimberly took you out of her bosom and said, \"Soooo little cutie how were they?\"<br>\r\n<br>\r\n<i>'Something must have happened while she went out looking for the rangers,'</i> you thought. Fearing she might hurt you, you said, \"Perfect like the rest of you.\"<br>\r\n<br>\r\n\"Awww... You're sweet! And for that you deserve another big.....\" Kimberly said beaming before giving you another kiss.</span></div></div>",
            "created":1576126800,
            "id":2758816,
            "title":"Kimberly's new love"
        },
        "115112313":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "You get pressed against her pussy",
                "you get placed in her pussy",
                "you get placed between her buttcheeks",
                "you get placed in her anus",
                "something else happened"
            ],
            "content":"<div class=\"\"><div> <span>You were placed back on the chair. Kimberly said with a very serious face, \"Alright, Lil'guy. Now I'm gonna put you in a very special place. So special,  you can't get perverted....\"<br>\r\n<br>\r\nAfter a few moments, Kimberly's face spouted a big smile as she giggled, \"I can't hold it. It's so perverted, I'd actually be offended if you didn't get a bit perverted... alright, a lot perverted.\"<br>\r\n<br>\r\n\"Just... where are you putting me?\" you asked.<br>\r\n<br>\r\nKimberly giggled some more as she rubbed her crotch, \"Maybe here?\"<br>\r\n<br>\r\nShe then turned around, bent forward, and wiggled her rear at you. \"Or maybe here?\"<br>\r\n<br>\r\n\"Kimberly? We just met. Aren't both a little too forward?\" you asked as she began to pull down her leotard, sexually wiggling her hips as she did so.<br>\r\n<br>\r\nEven though you were tiny and terrified, you found the sight very erotic.<br>\r\n<br>\r\n\"Maybe, but you're cute enough that I'll overlook it,\" Kimberly answered as she revealed that she wore a thong under her leotard. \"Now... do you want to be near my perfect pussy?\"<br>\r\n<br>\r\nShe spun around, grabbing you as she did so. The Pink Power ranger held you near her pussy. It was very musky, letting you know without a doubt she was very aroused.<br>\r\n<br>\r\n\"Or maybe you want to be by my big beautiful butt?\" Kimberly asked as she then held you near her behind. The air was thick with her pheromones. \"I make sure to clean that area every day, as I am a very skilled gymnast and need to reduce weight wherever I can.\"<br>\r\n<br>\r\nShe then held you up to her face and said, \"Make your choice quick, as I'll put you there and head onto my next workout!\"<br>\r\n<br>\r\nBefore you could speak, Kimberly began to lick you all over. You shouted, \"Hey! What gives? Why are you licking me?\"<br>\r\n<br>\r\n\"Lubrication, duh?\" Kimberly asked in a thick Valley girl tone, as if you were thick-headed.</span></div></div>",
            "created":1576904400,
            "id":2762611,
            "title":"Kim pulls down her pants"
        },
        "1151123134":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Kim goes to her workout",
                "Kim gets a call from the other rangers",
                "You try to escape from Kim's clutches"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey! What gives? Why are you licking me?\"<br>\r\n<br>\r\n\"Lubrication, duh?\" Kimberly smirked in a thick valley girl tone, as if you were thick-headed. <br>\r\n<br>\r\nYou really didn't appreciate that. And you certainly didn't appreciate being covered in spit by the Godzilla sized pretty teen! Even if said spit belonged to an very attractive member of the opposite sex. And what was that she said about a workout? She was going to workout again? Only this time with you on her person.<br>\r\n<br>\r\nYou gulped nervously as your own sweat began to mix in with the Pink Ranger's thick saliva. This wasn't good. As clearly sweet 15 year old Kimberly Ann Hart clearly wasn't right in the head, which meant there was probably no way to talk her out of this. Either way you were screwed and if you didn't pick soon then  she would more than likely choose for you.<br>\r\n<br>\r\n\"Crap!\" You whispered. Just what did you do? Either way it was either being trapped within her giant pussy or equally giant ass! One had the potential to drown you and the other had the potential to leave you scarred for life. <br>\r\n<br>\r\nBoth options sucked. <br>\r\n<br>\r\n\"Alright.\" You said nervously. You held up your hands and looked down at the ground towards Kimberly's massive yet completely clean and pedicured  feet. There was only one way to decide this, \"Eeny meeny miny moe, catch a tiger by the toe...\"<br>\r\n<br>\r\n\"Er okay that's enough of that!\" The giant teen said impatiently.<br>\r\n<br>\r\nYou didn't get very far as Kimberly's patience reached it's end. She gave you a large pout before addressing you. \"Hmmm....I'm bored. I didn't think it would take you this long to make a choice.\" she sighed. \"Fine then, I'll choose for you.\"<br>\r\n<br>\r\n\"No! Wait!\" You screamed frantically. \"I-I've just come up with a deci.....\" <br>\r\n<br>\r\n\"Too late.\" Kimberly interrupted grinning savagely. \"You had your chance little guy.\" <br>\r\n<br>\r\nShe then gave you a big smile which terrified you even more as you struggled to get out of her crab like pincher grip.<br>\r\n<br>\r\n\"I-I think I'll stash you away in my butt for a while.\" She grinned even more.<br>\r\n<br>\r\nYou heart sank at those words. She was going to what!? \"Kim-- Kimberly? Miss Hart? No,No Y-You can't.....\" You choked out but she ignored your pleas.<br>\r\n<br>\r\nYour entire world shifted as Kimberly bent over, giving you a clear view of her massive pink colored(as she was still wearing her classic bright dark blue/white and pink leotard) Netherlands. She gave her whole ass a good shake which you'll admit got your heart racing. \"Have fun little cutie! I know I will.\" She beamed innocently.<br>\r\n<br>\r\nQuicker than you could blink you were thrust between her massive yet moist ass cheeks. It was very  hot and humid in there and your momentum didn't cease nor could you move a inch. You were continuously thrust through what felt like miles of ass flesh until you felt your body impact something soft and squishy.<br>\r\n<br>\r\nIt didn't take a genus to know what it was. It was her anus. Oh god you were pressed against her anus. You wanted to scream, in fact you did, but it was muffled by her plum cheeks.<br>\r\n<br>\r\n\"Mpppphhhhhh....Kim......\" Was all you could yell out as you were practically covered in the Pink Ranger's ass sweat and flesh. But again she only let out a cute giggle.<br>\r\n<br>\r\n Her left hand then released you before you felt her soft  fingers  gently press against your back.<br>\r\n<br>\r\n\"Alrighty little guy here we go!\" Kimberly giggled again. <br>\r\n<br>\r\nAgain you screamed as Kim wasted no time thrusting you through. Her pucker put up no kind of resistance whatsoever and the feeling of a foreign intruder in her backdoor made the teenage Power Ranger shudder.  She quickly removed her finger and savored the feel of having a living person roaming her back entrance. <br>\r\n<br>\r\n\"Ahhhhhhhhh... Kimberly...Noooo NOT THIS...PLEASE LET ME OUT!!\" You screamed at the top of your lungs but once more,your pleas fell on deaf ears.<br>\r\n<br>\r\n\"Oh wow!\" Kimberly happy as can be moaned softly.<br>\r\n<br>\r\n</span></div></div>",
            "created":1577422800,
            "id":2765378,
            "title":"Kimberly's Anus"
        },
        "11512":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Start at Josh's P.O.V.",
                "Begin as Kimberly"
            ],
            "content":"<div class=\"\"><div> <span>(Spoken from the narrator of each opening episode)<br>\r\nToday on Power Rangers a new kid Josh in Angel Grove is accidentally shrunk by one of Rita's newest monsters called the Shrinkator meanwhile the Rangers are up to their necks in fighting off a endless amount of Putties and the Shrinkator itself but it gets worse as perky Kimberly is the one to find the shrunken Josh who's only other fear other than being shrunken and surrounded by ferocious odd monsters is being captured by a gigantic girl and here's where our story begins:</span></div></div>",
            "created":1425445200,
            "id":1943933,
            "title":"Pink Ranger uniform"
        },
        "115121":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "It's play time ",
                "It's Morphing Time Again Duty Calls"
            ],
            "content":"<div class=\"\"><div> <span>\"Ahh my aching head!\" You moan as the world stopped spinning and your sight returned only to notice something enormous a gigantic eyeball staring back at you! <br>\r\n\"Hey little guy you alright?\" The girl looked somewhat familiar she must have been that Kimberly Hart chick from school always hanging out with those other four guys and being harassed by the bullying duo dimwits Bulk and Skull but why are she so big? \"Hello can you hear me are you okay Josh? You must have passed out after that thing zapped you!\" <br>\r\nYou blink around noticing everything was a thousand times bigger than you she was right you have shrunk but your head was still spinning you couldn't remember a thing prior to ending up in Kimberly's purse as she snuck you to her house following the fearful battle with Putties. \"Yeah I'm fine wait a second how do you know who I am?\"<br>\r\nAs Kimberly frowned \"Don't you remember when the teacher introduced you to our class early this morning?\" <br>\r\n<br>\r\nAs you shake your head no. \"Really you don't remember following me and my friends in the park and witnessing those guys in gray attacking us(clearly she was trying to preserve her secret identity) then passing out when that monster saw you?\" Again you shake your head no and a small sinister smile formed on Kimberly's lips this was too good to be true for her thinking of all the 'things' she could do to her tiny captive. \"Okay Josh in that case you can stay here with me until the spell wears off(secretly inside she was hoping it never wore off) It will be a lot of fun( for me mostly)now..\" As she picks you up </span></div></div>",
            "created":1425531600,
            "id":1944621,
            "title":"Start at Josh's P.O.V."
        },
        "1151211":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "The clock runs out",
                "go for the ass, you don't think she'll put you on the other side of her spandex"
            ],
            "content":"<div class=\"\"><div> <span>          Kimberly looks at you with large greedy eyes, licking her luscious red lips before speaking. \"Well Josh, who knows how long we have before this thing wears off? I simply wouldn't be able to forgive myself if we wasted this opportunity...\" The look in her eyes is making you extremely nervous, and it takes a few seconds for you to find your words.<br>\r\n          \"Wha.. What do you mean opportunity?\" Her immediate response made it seem like she was hoping you would ask this. Was Kimberly toying with you?<br>\r\n          \"Isn't it sort of obvious? How many girls can say they've had a tiny slave before? I've got a chance to go down in history.\" She dangles you above her open mouth after her words from your leg, you can see straight down her throat. She lets go of your foot and you plummet towards her open maw, only to be caught by her other hand a second before being consumed. She is <i>definitely</i> toying with you.<br>\r\n          \"But what fun would it be if I swallowed you without running the idea by you first?? After all, you're the one who's kind enough to be my slave...<br>\r\n<br>\r\nYou could go here...\" Kimberly presses you against her throat and swallows, so that you can feel her throat shift downward. As she does, she slides your body downward, as though simulating your path down her esophagus if she were to swallow you.<br>\r\n          \"Oh! Or there...\" You've reached Kimberly's perfectly round and ample breasts, and become wedged inside of her cleavage. She places a hand on each one and playfully jostles them around, massaging your body in the process.<br>\r\n          \"Oh I know! We're too focused on my upper body! Let's see... How do you feel about... HERE!\"<br>\r\n          As the giantess spoke she retrieved you from her cleavage, and moved her arm around to the posterior half of her lower body, bending slightly at the knees. Her massive spandex-clad ass form two perfect gravity defying mountains, and the crack seemed to be swallowing her spandex, creating one hell of a wedgie and outlining each individual cheek.<br>\r\n          Simultaneously to reaching the last word she thrusted you forward, and you joined her spandex as you plunged into the crack, stopping when you reached the deeply wedged spandex, which only just separated you from her contracting anus. <br>\r\n          A giant finger found your back and pushed you forward, creating unbearable pressure. Before long the spandex gave way as her greedy asshole opened, accepting both the spandex and your body. You were now trapped just one inch within her ass, being kept from going any further and being lost by the spandex. As quickly as you were shoved in, you feel Kimberly unpicking the wedgie, thus rescuing you from oblivion. Her giant hand grasps you once more, and you're brought back to eye level.<br>\r\n          \"Well shorty, what will it be? How would you like to please your master first?\" Kimberly is smirking.<br>\r\n          \"You're kidding! NO WAY!\"<br>\r\n          \"Hahaha oh yes way! Now hurry up before I decide for you...<br>\r\n          10..<br>\r\n          9..<br>\r\n          8..<br>\r\n          7..</span></div></div>",
            "created":1438146000,
            "id":2014181,
            "title":"It's play time "
        },
        "11512111":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "In her mouth",
                "Straight up her ass!"
            ],
            "content":"<div class=\"\"><div> <span>\"6.....5.....4.....3\" Kimberly's voice is getting quite impatient you can tell by the way her eyes are scanning every inch of you hungrily and finally you cry out unable to take it anymore \"I.....I...can;t decide you're too sexy looking! I can't choose!\" the giant teen smiles you a even weirder smirk crossed with a sweet smile \"Awww that's really nice of you to say Josh but since you can't choose I'll just have to pick for you hmmm let's see.....where can I put a cute little boy like you?\" by now you're truly shaking with fright what was to become of you? Finally Kimberly comes to a fatal decision \"Ohhhh I know just where you can go Josh(giggle)!\" and with that she puts you </span></div></div>",
            "created":1438232400,
            "id":2014455,
            "title":"The clock runs out"
        },
        "115121112":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "try to escape",
                "explore"
            ],
            "content":"<div class=\"\"><div> <span>          \"Oh, I know!\" Kimberly swings you around to the backside of her body, and you see her giant round ass directly in front of you. Her other hand reaches back and pulls on the waist band of her spandex, as the hand holding you moves to hold you directly above the gap.<br>\r\n          \"take a good look into my crack little guy, that's your new home! Or at least... the outside of your new home!\" You had a feeling of what Kimberly meant, and it terrified you.<br>\r\n          You began desperately squirming, punching and kicking at her fingers in an attempt to get free as Kimberly laughed. You bit down hard on her finger, and finally she dropped you. Your success was short-lived, however, when you remembered where she was holding you. With a <i>plunk</i> your body was wedged between Kimberly's giant ass cheeks. Warm flesh hugged you on all sides.<br>\r\n          \"Oooh, eager I see!\" Kimberly teased. \"Don't worry, I'll take over from here!\" You felt her finger pressing on you through her spandex, forcing you towards her puckered anus. Your head made contact, and slipped into her with a <i>pop</i>. Kimberly moaned as she pushed hard, wedging your shoulders into her hungry ass. From there she planted her hand on the bottom of your feet and held her breath, temporarily enjoying the feeling of having a tiny man halfway inserted into her booty.           With a great moan, Kimberly pushed on your feet with all her might, and you shot up her anus, along with an inch or two of her finger. You fell into an open cave, with walls made of pulsing flesh. You watched with horror as the finger retreated, and her puckered ass hole closed up behind it, trapping you in the giantesses backside.</span></div></div>",
            "created":1445922000,
            "id":2053479,
            "title":"Straight up her ass!"
        },
        "1152":{
            "author_id":"greenharold18",
            "author_name":"G.Harold",
            "choices":[
                "You're in a middle of a large field",
                "You're in a large buliding",
                "You're on a strange landscape (Nearly microscopic on someone's body)"
            ],
            "content":"<div class=\"\"><div> <span>It all have started, you were just at home watching a bunch of episodes of Mighty Morpin Power Rangers on TV, it was all pretty normal for you when all the sudden your TV stopped working for no reason You try to check behind the TV to see what happened but it seems that everything looks fine in your point of view As you wondered what just happened, you suddenly heard the TV finally turning on but when you looked at the screen, you see nothing but white static this continues for a few seconds when all of the sudden, the entire screen begin to glow different colors and suddenly shoots down a beam right towards you You feel like your entire body is been decreasing in size and soon you felt you're been dragged to the TV screen This happened real quick as you soon blacked out<br>\r\n<br>\r\nAfter what appeared to be like two or three minutes, you finally woken up and soon retrieved your strength but as you soon opened your eyes, you noticed that you are no longer in your home anymore</span></div></div>",
            "created":1451106000,
            "id":2079658,
            "title":"Trini"
        },
        "11523":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Imprisoned in her belly button",
                "Her panties uh oh!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You find yourself somewhere incredibly dark and sweaty on the giantess Trini's body but where in the world could you possibly be?</span></div></span></div>",
            "created":1451106000,
            "id":2079659,
            "title":"You're on a strange landscape (Nearly micro..."
        },
        "115231":{
            "author_id":"greenharold18",
            "author_name":"G.Harold",
            "choices":[
                "You got it!",
                "Meanwhile..."
            ],
            "content":"<div class=\"\"><div> <span>You couldn't make out where you are as everything is completely dark but you do feel that the entire ground is strangely soft and comfy Walking around was slightly tricky but it was still easy to walk as you head for a random direction until you bumped into a wall that was just as soft as the ground You still don't know where you are but by the entire shape of it you could be in some kind of tunnel that is oddly soft and warm and....seem to smell like sweat around here but it doesn't seem smelled that very bad but still You don't know what to do next so you sat down on some kind of large object and begin to think about what to do</span></div></div>",
            "created":1451192400,
            "id":2080197,
            "title":"Darkness..."
        },
        "1152311":{
            "author_id":"greenharold18",
            "author_name":"G.Harold",
            "choices":[
                "You're done!",
                "Meanwhile, outside the strange tunnel....."
            ],
            "content":"<div class=\"\"><div> <span>An idea sprangs out of your head when you look down at the giant object you're sitting on, you could just make a large shelter out of these thing and be safe until you finally realize where you are You stand up and look around to find these large pille of junk scattered around somewhere inside this dark tunnel Traveling a little deeper, you see a few of them on the walls and you pluck them off and begin to roll them up into balls and started to head back to the smaller pile and soon you put the ball on the pile and created a large ball that was almost big as you so you head on to get some more pieces</span></div></div>",
            "created":1454994000,
            "id":2102113,
            "title":"You got it!"
        },
        "11523112":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Stuck a finger in to investigate",
                "Reached in and pulled you out!"
            ],
            "content":"<div class=\"\"><div> <span>Trini had just gotten up from another tiring day of both schoolwork and being a Power Ranger from her bed As she stretched her Power Ranger communtor went off groaning she half wanted to toss it on the dresser and not answer it but she knew that would be rude and picked it up \"Yes Alpha what is it?\" the little robot's voice as usual was worried and troubled as he replied through a moment of static \"Trini sorry to bother you on your weekend but Aiyyyaaa Rita's just sent a new monster to attack Angel Grove the other Rangers have already gotten the message quickly we need you to get downtown as soon as.....\" Trini nodded of course Rita couldn't just take one day off for once \"Of course Alpha tell the others I'll be there shortly....\" she switched it off and went to her closet to change into some decent clothes as she and Kimberly planned on going shopping following this if they managed to defeat this new monster after getting them on she began to feel a weird sensation inside her belly button and </span></div></div>",
            "created":1455512400,
            "id":2104566,
            "title":"Meanwhile, outside the strange tunnel....."
        },
        "115231121":{
            "author_id":"greenharold18",
            "author_name":"G.Harold",
            "choices":[
                "Wait for another weird event to happen ",
                "Get out of here as fast as you can!"
            ],
            "content":"<div class=\"\"><div> <span>You have finally done it, you created a huge ball made out of these strange gunk of fluff and now you'll be safe from whatever danger awaits inside this cave You crawl inside the ball and found yourself slightly squeezed by the fibers but at least it's still comfortable despite the surrounding and smell of it You still wanted to know where you are but you thought you'll might end being danger as you exit your safe spot so you decided to avoid the risk<br>\r\n<br>\r\nAs you push the bit the fibers to get more room, you suddenly felt a very tiny vibration around you Confused, you pop your head from the ball and looked around outside \"Hmm I could've sworn I felt something around here\" you said as you burrowed back to your shelter but as you got inside, that's where the crazy event happens<br>\r\n<br>\r\nThe entire tunnel slightly start to shift a bit in which you started to noticed till in a quick second the tunnel immediately begins to shift all the way to a now sideway position as you and your giant ball dropped down from the wall (Which used to be the ground) \"W-W-What just happened\" you said as you got frightened from the unexpected experience You don't know what's happening but it seem the tunnel is oddly moving as you now feel a slight vibrant that's seem to be going up and down as it the entire place was walking on it's own You also felt the tunnel beginning to stretch slightly as the walls started to do so But as all of these unfolded, you soon heard voices which echos around the tunnel The voices seems to be coming from high above from where you are but because of that, the voices are muffled up and you couldn't tell what they seem to be talking about but you tell that the voices sounded slightly feminine After a while, the conversation soon ended as you could no longer hear anything but the familiar vibrations that moved up and down<br>\r\n<br>\r\nBut you as thought things couldn't get even more bizarre, the small vibrations have finally stopped which leave you even more confused For second time, you popped out of your ball shelter and once again you didn't see anything As you about to go back inside, you heard a loud rustling that's coming from the right side of the tunnel and when looked at the source......you couldn't even believe what your seeing Coming right towards you was a ENORMOUS finger tip that was about the size of an giant football stadium You quickly go back inside as the finger stopped about where you are and begin to twirl and scratch around the walls \"What's going on here? First the tunnel started shifting, then the tunnel started moving, third some voices I heard and now a gigantic finger that came from out nowhere\" you said \"Why will there be a giant finger around here?! Unless....unless....unle...\" your train of thoughts was soon interrupted when the gigantic finger push your ball around causing it and you to bounce around the tunnel until your shelter soon got stuck on the ceiling along with you inside it You take one final peek of that gigantic finger and soon once again heard voices from above and you watch as the finger retreats from the tunnel \"OMG that was terrifying, I just hope I don't come across that big finger again\" you said to yourself as you look all the way down to the ground You definitely wanted to get out of here as fast as possible but you don't want to come across that gargantuan-sized finger without your ball of protection Thinking of a plan, you could stay here and wait for an even more weird event to happen Maybe it could help you get of this crazy place<br>\r\n<br>\r\nWhat path shall you take?</span></div></div>",
            "created":1455598800,
            "id":2105271,
            "title":"What kind of world is this?!"
        },
        "1152311212":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Pulls you out into her palm ",
                "Pulls you out but you fall onto her shoe"
            ],
            "content":"<div class=\"\"><div> <span>Like a hamster in his metal wheel you began running in the opposite direction back to nowhere in particular as you can't see a thing meanwhile outside Trini is preparing herself to teleport to the Rangers' exact location when she feels that weird sensation in her navel again after failing to find out what it was previously this time it annoys her so much that she sticks a small  q-tip just enough to reach the inside caverns of her belly button and</span></div></div>",
            "created":1455771600,
            "id":2105992,
            "title":"Get out of here as fast as you can!"
        },
        "11523112122":{
            "author_id":"greenharold18",
            "author_name":"G.Harold",
            "choices":[
                "...Trini was going shopping with her friend, Kimberly",
                "...Trini was busying fighting with her friends against a villain"
            ],
            "content":"<div class=\"\"><div> <span>You really didn't see where you are going as everything was dark and because of that you ended up bumping into the soft walls Finally you gave up and sat down but a few seconds later you heard a another rustling behind, you stood as you think that the giant finger is back again and is ready to scrap up the entire tunnel again but this time a brand new object comes into view as you turn around<br>\r\n<br>\r\nThe giant object was instead a large white cotton that wasn't as big as the earlier object was but it was still incredibly huge to you, about the size of a ferris wheel And unlike the other, this one was much faster, so fast that you didn't have time to react before you ended up getting stuck on the giant cotton You could feel yourself now moving away as the cotton now begins to treat to the exit Although you wanted to get out of this cave but you don't to be taken by what ever this thing is, so you try at all your might to struggle and escape<br>\r\n<br>\r\nAs you try and try, you finally got out of this strange cotton object but as you do, you find yourself falling off and ended up bouncing up and down on the soft surface before finally coming across the exit to this strange cave You bounced off into the exit before you once again found yourself falling down at neck breaking speed The speed of your fall was so fast that all you saw so far was a yet other enormous object that was way down below you Preparing for impact since there's nothing else to do but fall, you closed eyes tight and soon you ended up going straight for it<br>\r\n<br>\r\n*CRASH!!*<br>\r\n<br>\r\nThe suface was soft enough to cushion your bones but it wasn't enough to shield your consciousness as you immediately blacked out<br>\r\n<br>\r\nAfter many time has passed, you finally woken up and gain your conscious back but now this time you're now in a another brand new strange world as you barely move around at all Your view was completely covered by a huge white wall of fiber that seems to be pressing on you bit due to the size of it, you were unharmed by it \"I really have to say this but I wish I was back inside that cave at least I could move around in there\" You said<br>\r\n<br>\r\nMeanwhile,...</span></div></div>",
            "created":1455944400,
            "id":2107058,
            "title":"Out of the frying pan"
        },
        "115231121221":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "choices":[
                "Trini feels something moving below...",
                "Trini finds some nice footwear"
            ],
            "content":"<div class=\"\"><div> <span>The thrilling fight against the monster before having reached its conclusion, Trini finally had some free time, a sense of accomplishment, and a fair amount of sweat built up. She needed days off like this to maintain a disciplined mind and body; and no matter what Rita did to ruin that, she'd find some way to recover her lost time. Listening to her friend talk excitedly about events at school that day, she smiled quietly. They might not even find anything at this store - but something good would come out of this.<br>\r\n<br>\r\nOf course, nothing good was coming out of this excursion for you, pinned down by the immense, blank wall. With a THWUMP, the whole cavern moved forward, crashing to the ground. Only a few seconds later, you heard something similar in the distance - followed by another lift, and a loud SLAM. Thankfully, there was enough cushioning to keep you safe for now; if incredibly rattled. The constant movement, sudden shifts in gravity, and loud noises outside, coupled with a thin layer of moisture and a slight foul odor, combined to make a sickening sensation churn up in the depths of your gut.<br>\r\n<br>\r\nWhat was this bizarre landscape, anyway? You tried to look around for hints. Small puddles formed around the floor, which was soft enough for your feet to sink in - unnatural for a cave. No visible stalagmites on the floor, or stalactites on the absurdly high ceiling. Only these soft fibers fighting against you, pinning you down onto the base. Every time they lifted up again in the same rhythmic motion, you felt the grip loosen, giving you more room to move - for a few seconds, before this bizarre barrier fell on you once more.<br>\r\n<br>\r\nOutside, Kimberly - having found a particularly nice-looking dress - made a beeline for it. With a half-pleased, half-irritated chuckle, Trini followed behind, moving in a dash to catch up.<br>\r\n<br>\r\nYou struggled to keep still as the movements became more rapid, more violent. Without the slightest hint of a warning, the damp fabric was suddenly pushing onto you again and again, squeezing into your torso and upper body. You called out to see if anyone else was trapped here, still struggling against the behemoth before you; no response. The voice was lost in the intricate pattern of pale strings, and the dark shell surrounding it. With no provocation, not even giving you time to respond, this THING was continually assaulting you, its movements somehow perfectly synched to the rest of the area.<br>\r\n<br>\r\nAfter a quick jog forward, Trini spotted the item. She reached up for it, heels lifting from the ground - tiptoeing closer.<br>\r\n<br>\r\nThe sudden tilt sent you completely off balance. Now, the entire weight of this white wall was pressing on you, unmoving, with no sign of stopping. If you weren't small enough to be cushioned by the soft surface, the sheer weight would easily break you apart in an instant. However, despite the bone-breaking pressure, there was one upside to this; at this angle, the salty puddles slid over you, providing you with enough lubrication to squirm out. To what direction, you're not sure - but maybe, if you can get away from this thing for a few minutes, something would clear up.<br>\r\n<br>\r\nOn the outside:</span></div></div>",
            "created":1469854800,
            "id":2188311,
            "title":"Trini was going shopping with her friend, Kimberly"
        },
        "1152311212212":{
            "author_id":"greenharold18",
            "author_name":"G.Harold",
            "choices":[
                "You made it and climb aboard it",
                "The dreadful ceiling has returned!"
            ],
            "content":"<div class=\"\"><div> <span>With all of your might, you slowly try to slither underneath this cottony ceiling and escape. So far, you still don't know where you are and how you got here, but wherever you are is quite strange. You still haven't choose a path, but you didn't care anyways you just wanted to get out of this mess right away.<br>\r\n<br>\r\nAfter what sounds like hours of struggling, you hand soon come across another similar material, but this time it felt more like a wall than the floor you were pressed on. \"It must be the end of this place, but I'm not sure.\" you said and just as you were about to check it out, the entire tunnel stopped moving. You're aren't sure what's going on but you soon heard a faint voice from high above that you still couldn't make out and suddenly the entire tunnel starts moving once again. \"When will this end?\" you thought.<br>\r\n<br>\r\nFinally for a few second, the whole ride stopped again and you stood there, trying to check if it did stopped. The entire ceiling pushed you down even harder and to your surprise, lifted itself up and exited the dark tunnel. You could finally stand up after that killer ride. You stretched your arms, legs and soon entire body and think about what just happened. \"So what was that strange object that tried to crush me?\" you wondered as you soon once again, heard faint voices from outside. You decided to find the exit and escape.<br>\r\n<br>\r\nYou ran and look around to see anything that might be an exit as you reach another wall; it was a dead end. However, there was a mass ray of light coming from above; it was the exit! \"I wonder how I'm I going to get up there?\" you asked yourself. Your eyes then landed on something next to the wall and saw what looked alot like a rope. \"Maybe I could climb up there.\" you said and ran towards it.</span></div></div>",
            "created":1475816400,
            "id":2220292,
            "title":"Freedom....for now"
        },
        "11523112122122":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Trini goes home",
                "Trini feels something in her shoe",
                "Trini switches shoes outside"
            ],
            "content":"<div class=\"\"><div> <span>Trini was very pleased with the new footwear she'd found. The black sandals felt really comfortable on her feet. After working so hard fighting of evil witches and monsters, comfort like this was a godsend. The decision was as clear as day, she just had to but these. The look on Kimberly's face told her she approved.<br>\r\n<br>\r\nBut there was still the matter of the store policy. A strange one the more she thought about it. A person couldn't just walk out wearing there new purchase. It didn't really bother her as she would rather freshen up first before breaking her new sandals in. With that in mind she removed her foot from the sandal before retrieving her sock.<br>\r\n<br>\r\nShe easily slid the garment over her foot before spotting her abandoned sneaker. At least her old shoes were still comfortable enough for now. Meanwhile back inside the moist shoe, you were still making your way to the bright light of freedom. You couldn't get out of this place fast enough.<br>\r\n<br>\r\nYour heart began to well up with joy as you inched closer, before fate viciously ripped it away. Your eyes widened as the light above began to fade... And an all too familiar foe returned. The dreaded white ceiling! \"Oh no!\"<br>\r\n<br>\r\nSelf preservation kicked in as you turned tail to flee. You ran as fast as you legs could carry you but it wasn't enough. Up above you could see more and more of the ceiling leaving you in dust. Before you knew it, the dreaded white fibers started to descend, and you were once again pinned.<br>\r\n<br>\r\nThe pressure was immense and the faint odor that surrounded you earlier had returned twofold. Why oh why was this happening to you, you wondered? Just were where you anyway? What was this damned ceiling that continuously taunted you?<br>\r\n<br>\r\nNo matter how much you wracked your brain no answers would come. All you knew for certain was the ride you were on wasn't over yet. This uncomfortable rollercoaster of pressure, odor, and dampness would continue. For how long you couldn't say. All you could do was hope another opportunity to escape would come soon.</span></div></div>",
            "created":1563253200,
            "id":2687777,
            "title":"Return of the dreaded ceiling!"
        },
        "115231121221221":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Trini lies flat on her stomach",
                "Trini stretches out on her back",
                "You move in the nick of time"
            ],
            "content":"<div class=\"\"><div> <span>Trini sighed in relief as she stretched her sore muscles, there was no place like home. After a long day of battling monsters and shopping, she more than ready to plop herself down and relax. She placed her new sandals down before kicking off her shoes and flopping face first on her bed,<br>\r\n<br>\r\nThe soft and cool sheets were doing wonders for her. She finally sat up and took a seated position before finally getting truly comfortable. While this was happening you felt the immense relief that came with the dreaded white ceiling's retreat, unfortunately for you it would appear you were going along with it.<br>\r\n<br>\r\nApparently the cavern's bizarre moisture that smelled oddly like sweat had seeped into your clothing and was working as some sort of adhesive. When the world shifted violently and the ceiling took off, so to did you, Light immediately assaulted your vision and for a moment you thought you'd go blind.<br>\r\n<br>\r\nThen it happened. You felt the world around you shift once more, and you found yourself descending. The wind speeds from your descent were so powerful you were forced to close your eyes. Panic went through your body as you couldn't understand what was happening. Where had that ceiling taken you?!<br>\r\n<br>\r\nSoon it was over, and you were compressed against another hard ground. Only this time it wasn't as spongey as the cavern. It was much more dry and sturdy. The pressure was unreal, but as soon as it came it vanished, You felt yourself rise, only to fall again. It was like an endless rollercoaster at a theme park. You didn't dare open your eyes.<br>\r\n<br>\r\nAgain the pressure came and went until finally it didn't return. After a minute you realized you were no longer in a constant state of rise and fall. Even though your heart was beating a mile a minute, you finally cracked open your eyes. Your vision was blurry at first, but soon everything came into focus.<br>\r\n<br>\r\nWas this some kind of room? It must be. There were shelves, books, carpet, windows, a closet. No different from your own room. So why was everything so giant?! While you pondered this you felt yourself shifting again. You were so lost in thought you forgot you were still stuck to the white ceiling.<br>\r\n<br>\r\nThis time you tried to struggle and to your own surprise you managed to unstick yourself. Thankfully the ground below you was soft and comfortable. It was like looking at vast desert of yellow sand. As you looked this landscape over an enormous sound akin to thunder filled your ears.<br>\r\n<br>\r\nOn instinct you covered them and turned to the source. When you did your whole body went stiff. There was someone else on this barren landscape with you. Not just any person though, but a real life giant. You were beyond scared now. It all made sense, everything was so giant because you were in the room of a giant. Or to be more precise, you were tiny!<br>\r\n<br>\r\nOn instinct you began to back away until you got a good look at the giant's face. She was very pretty, but also familiar. Just where had you seen her before? You scowled in thought until it finally hit you. This was the very same girl you watched on TV almost every day. Trini the yellow ranger from Mighty Morphin Power Rangers.<br>\r\n<br>\r\nBut how? This was impossible. She was just a fictional character on TV. This didn't make any sense. She wasn't real. But yet here you were, damn near microscopic and standing on her bed. This was insane. You must've been dreaming. Either that or you've final gone crazy.<br>\r\n<br>\r\nBefore you could do anything else however, the ground beneath your feet began to shift. That could only mean one thing. Trini was changing positions. </span></div></div>",
            "created":1563339600,
            "id":2688195,
            "title":"No Place Like Home"
        },
        "115232":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Front or Back?</span></div></span></div>",
            "created":1563339600,
            "id":2688197,
            "title":"Her panties uh oh!"
        },
        "1152322":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Trini finds an exercise bike",
                "Trini feels something in her panties ",
                "Rita is attacking Angel Grove"
            ],
            "content":"<div class=\"\"><div> <span>Where in the world were you? This didn't look like home. Your house usually wasn't this dark, or cramped. Well wherever you were you could barely move and it smelled awful. Not to mention it was also really moist. And what was that muffled noise all around you?<br>\r\n<br>\r\nThis didn't make any sense. One minute you were at home watching power rangers and the next you were being compressed in this soft but smelly dark prison. What was this place? You tried to struggle free, but to no avail. In fact struggling seemed to push you a little bit deeper, wherever you were.<br>\r\n<br>\r\nBefore you could come up with some sort of plan, the room you were in began to shift. When it did you felt you cramped prison compress all around you. The force was incredible, so much so you thought you might pop like a cork. Thankfully you didn't.<br>\r\n<br>\r\nThat still didn't change the fact that something soft and moist had clamped itself around your body and was squeezing you tight. Your dark world was shifting in all sorts of directions and it made you start to feel sick. It was a good thing you hadn't eaten otherwise this place would smell worse.<br>\r\n<br>\r\nYou needed to get out of... whatever this was that putting the squeeze on you. But every time you tried to get free from whatever it was compressing you, you would shift and get ground mercilessly. With no current means of escape you did the next best thing you could do.<br>\r\n<br>\r\nYou called out for help.<br>\r\n<br>\r\nNo one answered you of course. You were well and truly alone. It was just you and the apparent grinder you were tossed in. You closed you eyes and did your best to hold the air in your lungs as you hoped someone would come save you. Either that or you hoped something would come along and let you save yourself.<br>\r\n<br>\r\nMeanwhile outside your prison. A lone girl was honing her skills at the gym. Trini Kwan was a woman possessed as she delivered kick after kick at the sandbag, The next time Rita attacked Angel Grove she would be ready. Until she did though, more training was in order.</span></div></div>",
            "created":1563339600,
            "id":2688209,
            "title":"A Dark Place"
        },
        "11523222":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Screamed in shock and anger",
                "She was surprisingly understanding",
                "Fainted,never seen a tiny person before"
            ],
            "content":"<div class=\"\"><div> <span>As the young Power Ranger was about to start hitting the bag some more to improve her already impressive martial art skills,Trini suddenly jerked back up,her eyes wide.<br>\r\n<br>\r\n\"What Th- What's this wiggling around? Uggh i-it feels like there's something moving around in my.....\" But she couldn't force herself to finish as she felt it again and indeed it <b>felt </b>like it was moving around in her under garments of all places.<br>\r\n<br>\r\nMeanwhile with you as the giant Yellow Ranger had finally stopped moving you were able to both breathe a sigh of relief and slowly inch your way upwards towards the thin layer of light that would hopefully lead the way out of this cramped,smelly nightmare! But the moment Trini felt you moving she jerked up and back down you fell,right towards her fatty,blubbery ass cheeks(like Kimberly the Pink Ranger,Trini was well built and had the body of a trained athlete including a pretty sizable rack in the front and a equally huge rear end).<br>\r\n<br>\r\n\"What's this thing moving around in my...my...rear end?\" Trini thought as she tried to keep her focus on her training but that annoying itchy feeling kept distracting her and she had to stop and look around.<br>\r\n<br>\r\n\"Good there's no one here in the gym today...but just to be safe,I better head into the girls' restroom for some privately.\" She thought as she hiked up her yellow shorts giving herself a wedgie unknowingly causing you even more discomfort and quickly walked off to the gym's restroom facility.<br>\r\n<br>\r\nOnce there Trini took no time pulling down her shorts then solid white panties revealing her chucks rear end to see what that annoying itch was and the moment her soft eyes laid upon the tiny man clinging on for dear life on one of her butt cheeks Trini......</span></div></div>",
            "created":1564117200,
            "id":2692613,
            "title":"Trini feels something in her panties "
        },
        "115232222":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "You introduce yourself",
                "Trini quickly hides you as someone else enters the bathroom",
                "You faint from shock"
            ],
            "content":"<div class=\"\"><div> <span>Very gently,  the gigantic Yellow Ranger or Trini pinched you from her massive rear end. You almost felt yourself go blind when the light assaulted your vision. It was then you realized where you were, or to be more precious where you weren't. You were being hoisted up in the air by two tree trunk sized giant fingers.<br>\r\n<br>\r\n\"Wha--\" Was all you could get out before you followed the fingers to the hand they were attached to until eventually you made it to the giant face of the young Asian girl staring at you in surprise,her eyes in shock at the recent discovery on her buttocks of all places! Trini's  first instinct was to call Billy,the Blue Ranger or contact Zordon at the Command Center as this wasn't a everyday thing...okay it actually was but then again she felt like this was something she could handle on her own.<br>\r\n<br>\r\nAs for you, your own natural instinct was to scream, but for some reason the scared yelp in your throat wouldn't break free.<br>\r\n<br>\r\nInstead you thought you continued to look at the very pretty girl until your eyes settled lower and saw her shorts were around her ankles. Putting the pieces together, you began to realize where you were. It all made sense. The darkness, the pressure, the moisture! You felt ill. You were pressed up in this girl's shorts.<br>\r\n<br>\r\nOh God. You've seen movies and shows, this was the part where the girl freaks out, labels you a pervert and beats you within an inch of your life. And considering how small you are compared to her, all she'll have to do is press her fingers together.<br>\r\n<br>\r\nIt was then you found your voice. \"I'm sorry! P-please don't hurt me!\" You barely choked out,fearing for your life.<br>\r\n<br>\r\nYou squinted your eyes shut as you felt something beneath you. You still didn't open your eyes but you did feel something incredibly  gentle rubbing against your head then found out the gigantic girl was tenderly rubbing your head with one massive finger.<br>\r\n<br>\r\n\"No,No please wait....It's alright.\" A booming young female voice rang. \"I'm not going to hurt you honest.\" <br>\r\n<br>\r\nNormally that would've been a red flag in this sort of situation. What woman would say that after finding a tiny man in their butt? Yet, for some reason when this girl said it, it sounded soothing. Most of your fear began to vanish and you cautiously open your eyes.<br>\r\n<br>\r\nThe thing gently caressing you was her finger and apparently the ground beneath you was her palm. The look in her face told you she wasn't angry and her eyes spoke the same. She really wasn't going to hurt you.<br>\r\n<br>\r\n\"It's alright honest, I won't hurt you little one.\"  She said in a very gentle tone as she studied you from top to bottom. \"My name is Trini... Trini Kwan. And you are...?\"<br>\r\n<br>\r\nYour eyes widened when she gave her introduction. It was impossible, but... Looking at her now. It was really her, the original Yellow Ranger ... Trini Kwan.<br>\r\n<br>\r\n\"Great Scott.\"</span></div></div>",
            "created":1577422800,
            "id":2765396,
            "title":"The Understanding One"
        },
        "12":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Kat duh",
                "I'll try Tanya "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So will it be Kat or Tanya the Yellow Ranger?</span></div></span></div>",
            "created":1475730000,
            "id":2219676,
            "title":"Zeo"
        },
        "13":{
            "author_id":"tkdigiboy",
            "author_name":"tkdigiboy",
            "choices":[
                "t.j",
                "justin",
                "carlos",
                "adam or tommy",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who will be the shrunk male?</span></div></span></div>",
            "created":1461128400,
            "id":2136729,
            "title":"Turbo"
        },
        "132":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "A disgusting kiss ",
                "A meal for her ",
                "Something else "
            ],
            "content":"<div class=\"\"><div> <span>Justin the youngest of the mighty Power Rangers has have the most horrible day ever first he received a D on his math quiz then the girl he wanted to ask for the annual Angel Grove Spring Dance turned him down on top of that he wound up losing his Turbo Morpher and this was the chance the evil Divatox needed so she send one of her own special monsters to shrink the youngster to a microscopic size \"Ahahahahaha finally I have you miserable little blue ranger....\" She laughed as she held him up the tiny boy screamed and yelled \"Hey what's going on why am I tiny? And when I get my hands on you you evil...\" \"There's no need for harsh words like that pitiful blue ranger you will be my plaything forever and there is absolutely nothing you can do to stop me....\" Divatox hissed as she licked her lips bringing the tiny helpless ranger towards her massive lips for </span></div></div>",
            "created":1461128400,
            "id":2136749,
            "title":"justin"
        },
        "1322":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "It's snack time for Divatox ",
                "The other Rangers figure out where he is "
            ],
            "content":"<div class=\"\"><div> <span>Divatox licked her massive lips again and Justin feared for his life as here he was totally helpless send without his Turbo Morpher or the other Rangers to help him out he fearfully cried out \"No please don't eat me please!!\" The evil woman looked quite surprised at him \"Hmmm you're right I won't eat you for...now but eventually I will but for the moment you should consider yourself lucky I'll keep you around as a pet but I don't want filthy human slime on my nice clean fingers I need to put you somewhere like in a...\" Then she spotted the tiny bird cage used for a few of the intergalactic bird creatures from other worlds it was large enough to contain one tiny kid \"A cage perfect you'll serve me as my little songbird!\" Divatox laughed evilly as she reached up putting the squirming,struggling and screaming boy into the metal cage giggling with evil glee as he tried to punch and kick his way out \"You'll tire yourself out quickly little Blue Ranger that's no ordinary metal either it's made of the toughest material known to the universe you'll never break out and will serve me as my little singing sparrow until I get bored with you or become famished for some....\" She licked her lips again \"Ranger Burgers!\" Justin tried again to punch,kick even insult her but to no avail eventually he was forced night and day to make up all sorts of songs for the evil sorceress to entertain her until eventually she became bored with him and....</span></div></div>",
            "created":1461128400,
            "id":2136760,
            "title":"A meal for her "
        },
        "13221":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Divatox decides, \"I am hungry!\". She puts Justin near her mouth and gulps him down. \"Hm... Delicious!\".</span></div></span></div>",
            "created":1591457580,
            "id":2846818,
            "title":"It's snack time for Divatox "
        },
        "1323":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Decides to torture him further by her really bad gas ",
                "She gets up and the torture for Justin really begins ",
                "She decides its time to eat him "
            ],
            "content":"<div class=\"\"><div> <span>Halfway towards opening her mouth the alien mistress changes her mind \"On second thought maybe simply eating you may end up giving me bad gas!\" Divatox moaned as Justin breathed a sigh of deep relief \"Don't get too comfy boy you may have been spared the horrors of my stomach but that doesn't mean I'm letting you off the hook that easily.\" Divatox smirked as she lowered the struggling boy from her mouth towards her ultra tight spandex like outfit for a while Justin was wondering where he was headed to until he felt the giantess drop him roughly onto her squishy royal throne so to speak then glaring up confused he could only stare up in horror as he saw a massive round object blocking out all light \"Oh no she wouldn't.....\" Justin thought beyond terrified as the shape of Divatox' massive ass came closer and closer until SPLAT! he was pinned between two massive twin mountains unable to move at all yet he could still hear her every word \"Ha,ha if you aren't going to be my tasty snack at least you can serve as my seat cushion....enjoy pleasuring your new mistress' sexy and massive ass!\" \"Mppppphhhhhhhhh!\" Was all Justin could mutter as he was 100% helpless eventually after a hour of sitting on one of her greatest enemies Divatox </span></div></div>",
            "created":1461128400,
            "id":2136784,
            "title":"Something else "
        },
        "135":{
            "author_id":"tkdigiboy",
            "author_name":"tkdigiboy",
            "choices":[
                "you",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>will you be the one to shrink?</span></div></span></div>",
            "created":1461128400,
            "id":2136773,
            "title":"others"
        },
        "1351":{
            "author_id":"tkdigiboy",
            "author_name":"tkdigiboy",
            "choices":[
                "kat",
                "divatox",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who will be your giantess?</span></div></span></div>",
            "created":1461128400,
            "id":2136774,
            "title":"you"
        },
        "13511":{
            "author_id":"tkdigiboy",
            "author_name":"tkdigiboy",
            "choices":[
                "kat sitting down on top you (aware)",
                "kat bringing her hand towards you"
            ],
            "content":"<div class=\"\"><div> <span>You were watching your favorite episode of power rangers when all of a sudden you get pulled in by the television. You stumble into the desert area not far from the headquarters. while returning to the base kat gets a bit winded and stops while the others go on. she starts to set down for a drink of water from her water bottle. You look up to see....</span></div></div>",
            "created":1461128400,
            "id":2136797,
            "title":"kat"
        },
        "135111":{
            "author_id":"intermant",
            "author_name":"Intermant",
            "choices":[
                "She got up to inspect you.",
                "She is to tired to get up."
            ],
            "content":"<div class=\"\"><div> <span>As Kat was returning to the base, she felt her throat became dry from hot weather outside and being on her feet and active all day. She shook her water bottle in order to check if it is not empty. Then she stopped and started to look around for a place to take a break and drink some water. She found a good clean space, took couple of steps forward to it and noticed a very tiny figure on the ground. “A bug”, she thought, “This little and impudent insect is occupying my perfect sitting place”, she said in angry tone, “I think that I deserve to sit there instead of this miniscule mite, and if It does not want to go away, I will not spend any more time waiting”. With these words she moved right in front of you, turned around and…<br>\r\nYou were trying to figure out, what happened to you and where are you. Big rocks under your feet were really heated up under sun and surroundings were very strange. You had never in your life seen such type of terrain. Then your thoughts were interrupted by something bizarre. Suddenly everything became dark. You looked above and screamed in terror. It was an unbelievably humongous figure of a blond girl looking right at you. “Who the in hell is that?” you exclaimed, but instead of an answer, this girl started to turn around. “Didn’t she notice me?” you asked yourself, but then your worst nightmare begins to happen. Giant girl squatted, put her hand in the ground in order to support her weight and proceeded to sit right on top of you. Not a fraction of a second had passed as you were pressed to the ground by her giant butt, right between her enormous butt cheeks. In an instant you felt an extremely humid and smelly air of sweaty butt surrounding you. You started coughing and trying to wiggle your way out of here, but you could not move even an inch. <br>\r\n“Ahh, it is good to sit down on a ground after walking for a long time”, said Kat, grinning ta what just happened. “I could sit all day like that.”<br>\r\n</span></div></div>",
            "created":1461301200,
            "id":2137452,
            "title":"kat sitting down on top you (aware)"
        },
        "1351111":{
            "author_id":"intermant",
            "author_name":"Intermant",
            "choices":[
                "...was smiling.",
                "...was angry."
            ],
            "content":"<div class=\"\"><div> <span>As Kat continued to sit on top of you, blocking all fresh oxygen from you and making you inhale her humid and rank air from her sweaty bottom, you were not losing your hope to get away from her and tried to wiggle you way out, but no matter how hard you tried, it had no use. After some time passed, you felt that you started to lose your strength, however you decided not to stop and continue trying to wiggle out, “I will not die like this, I will get out of here no matter what”, you thought, giving your last bits of strength. As you were about to pass out from exhaustion and extreme heat, you hear a loud and booming voice “Wow, this little thing is so persistent”.<br>\r\nAs Kat was sitting down on you and drinking water, she was constantly feeling you wiggling under her butt. From the beginning, she felt that amusing and didn’t gave you any attention, not counting some giggles at your weak attempt of getting out. But after couple of minutes, Kat thought that your behavior is somewhat different from regular insect behavior, because a mere bug would be already crushed, suffocated or just gave up idea of escaping. ”Wow, this little thing is so persistent”, she thought and lifted her butt from you.<br>\r\nYou couldn’t believe your luck, you were just saved from your butt prison. Bright sunlight got right into your eyes, blinding you temporarily, and because of that you didn’t seen how a giant figure turned around and was looking at you for a couple of seconds. When you finally was able to see, you saw a giant hand descending upon you and powerful voice booming from above, “Is that a tiny person?!”<br>\r\nIn a matter of seconds, you were pinned between two fingers, dangling in front of humongous face, which was bigger than a large house. And this giant face…<br>\r\n</span></div></div>",
            "created":1461301200,
            "id":2137502,
            "title":"She got up to inspect you."
        },
        "13511111":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Play with you in her hand starts tickling you ",
                "Dropped you down her shirt for fun "
            ],
            "content":"<div class=\"\"><div> <span>Kat was smiling innocently as she slowly lifted you to her face as you were praying frantically \"Please be friendly,please be friendly, please don't hurt me!\" As if she could hear you the massive beautiful blond teenager finally spoke in a deep Outback Australian accent<br>\r\n<br>\r\n\"Don't worry little one no harm will come to you I'm Kat Hillard may I ask how you got that way and more importantly why were you under my butt?\" You struggle to speak as you're still in dire pain from being under her massive rump<br>\r\n<br>\r\n\"I..I was watching TV and I wound up like this when I was sucked into it and you sat on me remember?\" Kat giggled then covered her mouth looking ashamed<br>\r\n<br>\r\n\"Sorry  yeah I forgot about that  but I thought you were a bug and you said you were sucked into the TV like in the movie Poltergeist? That's incredibly odd are you sure it wasn't Rita or Zedd or the Machine Empire?\"<br>\r\n<br>\r\n\"Who are they?\" You ask curiously though you knew perfectly well who they were you just didn't want to freak her out by telling her she and her world was make believe<br>\r\n<br>\r\n\"Never mind!\" Kat quickly replied she brought you closer to her gigantic pretty face and you stared right into her baby blue eyes \"Hmmm you certainly are adorable at that size! Mind if I hold on to you for a while?\" She asked playfully but you shook your head<br>\r\n<br>\r\n\"No,No you can't I have to get back home...I...\" But the giant Pink Ranger got annoyed and said sternly<br>\r\n<br>\r\n\"Well I found you and I should said whether or not I get to keep you or not and I want to keep you and you have no say in it!\" You screamed<br>\r\n<br>\r\n\"No wait! You can't keep me I'm not a pet...I'm a....\" Kat grinned fully as she brought you even closer to her face whispering<br>\r\n<br>\r\n\"You're all mine now and right now I want to have some fun with my cute little pet *giggle*.....\" You can only watch in horror as she begins to </span></div></div>",
            "created":1461301200,
            "id":2137513,
            "title":"...was smiling."
        },
        "135111111":{
            "author_id":"intermant",
            "author_name":"Intermant",
            "choices":[
                "\"Now it's your tirn to tickle me!\"",
                "\"Get ready for more tickling!\""
            ],
            "content":"<div class=\"\"><div> <span>You were lying on her palm and looking on your new giantess owner with a horror sign in your eyes. Then, you saw a giant hand, with each fingers bigger than a truck, coming down in your direction. You tried to cover yourself, even though it was completely obvious that you could never in your life cover yourself from such a big hand.<br>\r\n“Hey, little guy, I mean no harm to you, I just want to play a little bit.\" The gigantic Australian blonde cooed and, as you opened your eyes, you saw her gently smiling. Then you saw her giant finger coming at you. Next second Kat ‘gently’ tapped you with her massive digit index finger, which made you fall on her palm again. Then she lightly pressed her finger on your stomach area and started to move it a little bit, tickling you so much that you could not hold your laughter, “Hahaha, pp..pleassse, ssstoppp, hahaha, it tickles!!” You screamed wiggling around however the giant Pink Ranger was having so much fun tickling you that she didn’t hear you, “*giggle!  Coochie Coo! You are so funny, I should play with you for the rest of the day in fact I think I will!\" She said with a smile. <br>\r\nThis was only a game for her and torture for you continued for a good bit of time, as Kat got an idea. As she took her finger away from you and smiling, she said…</span></div></div>",
            "created":1461301200,
            "id":2137566,
            "title":"Play with you in her hand starts tickling you "
        },
        "1351111112":{
            "choices":[
                "You Did",
                "She Caught You"
            ],
            "content":"<div class=\"\"><div> <span>\"Hahahahaha Stooooooooppppppppp!\" You begged squirming around while laughing your head off as the gigantic Pink Power Ranger simply sat on the rock stroking your belly in the palm of her hand <br>\r\n<br>\r\n\"No way this is too much fun! Coochie,Coochie Coo!\" Kat giggled but as she endlessly tickled you even more you suddenly got the urge to bite her finger which surprised her <br>\r\n<br>\r\n\"Coochie Coo hahaha-Owwwww hey that hurt! Why did you do that?\" Kat cried angrily but you took the opportunity to leap out of her hand and hit the ground hard but you didn't care about the pain in your legs instead you began running as quickly as you could <br>\r\n<br>\r\n\"Hey get back here!\" Kat cried as she got up and chased after you......do you manage to get away in time?</span></div></div>",
            "created":1497416400,
            "id":2335909,
            "title":"\"Get ready for more tickling!\""
        },
        "135111112":{
            "author_id":"intermant",
            "author_name":"Intermant",
            "choices":[
                "She peeled you off from her breasts.",
                "She decided to keep you in there for a while."
            ],
            "content":"<div class=\"\"><div> <span>As you listen to Kat’s loud giggles, she, with a smile on her face, brought her hand, with you in it right above her shirt. Right at this moment you felt already familiar hot and moist air coming from her sweaty body. “I think that I should play with you just a little, I hope you will enjoy that as much as I enjoy it”, you hear her voice as you felt that she is dropping you inside her sweated up shirt. In a moment, you found yourself screaming and falling right into the depths of her heated shirt, right between her massive breasts. When you finally landed, you could feel that you are stuck between her breasts, then you felt extreme heat coming from them, it was almost boiling hot.<br>\r\nWhen Kat let you fall inside her shirt, she laughed at how little you were compared to her, “How does that feels, little man? I hope you are enjoying this”, she said as she squeezed her breasts carefully, not to crush your tiny and fragile body. Even though she squeezed her breasts lightly, you felt like you had been compacted by two trucks. In addition, this massive boob squeeze made you more stuck to her sweaty breasts.<br>\r\nWhen Kat looked down on you, she laughed at your completely plastered body, “Hahaha, look at you, looks like you make a perfect tattoo for my pretty breasts, don’t you? Hahaha…” she continued to laugh at you as… </span></div></div>",
            "created":1461301200,
            "id":2137567,
            "title":"Dropped you down her shirt for fun "
        },
        "1351112":{
            "author_id":"intermant",
            "author_name":"Intermant",
            "choices":[
                "...felt a preassure in her lower body.",
                "...wiggled more, pressing you deeper in her butt."
            ],
            "content":"<div class=\"\"><div> <span>Some time passed, but giant girl was not willing to get up from you. You were losing last bits of your strength and decided to give up, “This is it, it is not possible to get out from here, her ass is too big for me”, you thought, coughing at revolting air all around you. <br>\r\nMinutes passed, the area around you started to fill with a hot mist, which indicated that her butt was really sweaty from her daily activities. The moisture of her sweaty butt was transited right on you and on the ground around you, creating a huge sweaty butt print on the ground. For you this was a real hell on Earth.<br>\r\nFor the Kat, situation was completely opposite. She was enjoying her break and cold water from the bottle. “Whew, this is such a hot day and I had to running around and fighting villains for last 8 hours, I am literally soaked in sweat”, then she remembered about you and laughed, “Haha, little bug should be dead by now, that will teach the lesson to all bugs not to occupy my resting place”, she thought for a moment, “I think that I can sit here for eternity, I hope this little speck won’t mind, haha”, then she wiggled her butt, pressing you deeper inside her butt crack and smearing you more in her sweat.<br>\r\nAfter some more minutes Kate…</span></div></div>",
            "created":1461301200,
            "id":2137501,
            "title":"She is to tired to get up."
        },
        "13512":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Random person.",
                "future power ranger"
            ],
            "content":"<div class=\"\"><div> <span>So you were shrunk by the intergalactic pirate queen of evil! One who can extend her tongue and likes to taunt her enemies/victims when she knows she is in full control.<br>\r\n<br>\r\nBut why were you shrunk?<br>\r\n<br>\r\nWere you just a random person, who she had a passing fancy for? She is petty enough to do so. Perhaps your reactions to her teases, taunts and etc... might upgrade it from a short affection to one where she has genuine feelings for you, but her evil role has her insuring that she is in full control. And what better way to do so, than to make sure you never grow back to normal?<br>\r\n<br>\r\n===<br>\r\n<br>\r\nOr is it that you would become a power ranger in the future, since she saw the future message that the Blue Senturion had? And since you would become a power ranger that would overthrow the alliance of evil, Divatox decided to shrink you with two possible purposes. <br>\r\n<br>\r\nOne: if you're shrunk and in her possession, then you can't become a power ranger and overthrow evil. You're nothing but a trophy. One that as long as she has you, insures that a certain group of power rangers can never be.<br>\r\n<br>\r\nTwo: Since you're probably going to become a power ranger no matter what, she's going to do a conditioning of torture and pleasure to make you into her power ranger! The moment you gain your powers, she gains a powerful body guard that she keeps on her person, one that she can grow and shrink on a whim.</span></div></div>",
            "created":1493528400,
            "id":2313079,
            "title":"divatox"
        },
        "135122":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "\"Treasure! As long as I have you, a group of rangers will never exist!\"",
                "\"Personal power ranger! Now give your Pirate queen a kiss!\""
            ],
            "content":"<div class=\"\"><div> <span>You were a teenager, who looked up to the power rangers. You worked out and helped out others when you could, since that's what power rangers do. That wasn't always the case. Once, you were a wallflower who wished they could do more.<br>\r\n<br>\r\nHeck, you were surprised when the Power rangers unmasked themselves when a big force of alien monsters attacked.<br>\r\n<br>\r\nbut the knowledge that some ordinary people were given powers to fight evil was what inspired you to do more. Still, you were lonely and often wished for a girlfriend.<br>\r\n<br>\r\nYou did hear that the big force of evil monsters had been either defeated, purified, or neutralized by a powerful energy wave, one that the rangers had refused to talk about.<br>\r\n<br>\r\nHowever, evil always finds a way.<br>\r\n<br>\r\nOne of the beings that had been purified was one who had been Divatox, who went by two titles. One was <i>Intergalactic Pirate Queen of Evil</i> and the other was<i> Toxic Diva</i>.<br>\r\n<br>\r\nShe found something that her adoptive mother, Mama D, had left her. It looked like her necklace from when she was evil. When she touched it, the good being was overcome by evil, once again becoming Divatox. however, it was not the original Divatox. It was one with an altered personality and increased intelligence, recrafted to be a better evil villain in Mama D's eyes. <br>\r\n<br>\r\nHowever, Divatox recalled the message from the future and the rangers it spoke about. The group in the message was a different group than the space rangers. Remembering some items that Mama D had stolen, she planned on waiting for that group...<br>\r\n<br>\r\nand then using those stolen items to steal the power ranger's powers before they could become power rangers. All she needed was to wait for one of those rangers to appear and then she'd kidnap them.<br>\r\n<br>\r\nOne of the devices would then use the captured power ranger's connection to the morphing grid to siphon energy from it to reviving monsters and strengthening them and herself.<br>\r\n<br>\r\nAccording to the notes Mama D had left, the siphoning device would work better if the ranger lusted after her or one of her minions. The siphoning device would only revive female monsters. It was something of a last laugh from Mama D.<br>\r\n<br>\r\nEventually, Divatox was able to make another Subcraft. She searched and waited until she found you. You were by yourself in a park, drinking a bottle of water after a good run.<br>\r\n<br>\r\nShe sent a shrinking missile. It flew out of the bottle of water and exploded, shrinking you. After you shrank to about four inches, a tongue extended out of the bottle and wrapped around you, pulling you in.<br>\r\n<br>\r\nAfter a scary portal travel scene, you landed in Divatox's palm. The tongue that had pulled you in was hers, as it unwrapped around you and retracted back into her mouth.<br>\r\n<br>\r\n\"Greetings, tiny human! I am Divatox! The once and future Intergalactic Pirate Queen of Evil!\" Divatox said before she looked up at the ceiling and let out an evil laugh. She then looked at you and said, \"And you... You will be... My...\"</span></div></div>",
            "created":1493614800,
            "id":2313809,
            "title":"future power ranger in Divatox's hands"
        },
        "1351222":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "\"I'll make my perfect body even sexier! My figure will be more curvy!\"",
                "\"I'll revive monsters, like Lipsyncher and Archerina as my minions!\""
            ],
            "content":"<div class=\"\"><div> <span>With a rather smirky pursed lips, Divatox looked at you and said, \"And you... You will be... My...\"<br>\r\n<br>\r\nYou looked at her, as she purposely held off for effect for a few seconds before she said, \"Personal power ranger! Now give your Pirate queen a kiss!\"<br>\r\n<br>\r\n\"What?!\" You cried out.<br>\r\n<br>\r\nDivatox began to lean in for a moment before she said, \"Ah. I see a problem.\"<br>\r\n<br>\r\nYou were relieved... until she quickly used her other hand to rip off your clothes, leaving you clad in only your underwear.<br>\r\n<br>\r\n\"Briefs! Ha! My Power ranger is such a child!\" Divatox said. She then began to lean in as she said, \"So let Mama Divatox give you big adult kisses!\"<br>\r\n<br>\r\nYou tried to push, kick, and thrash about, all to stop her. All it did was make Divatox adjust her fingers, so now her fingers held down your arms and legs.<br>\r\n<br>\r\nShe then proceeded to kiss you all over your body. Each  contact with her soft lips briefly made you stronger... before that strength quickly was sapped into her lips. To your embarrassment, the experience was making you aroused.<br>\r\n<br>\r\nThat did not go unnoticed by Divatox. She laughed for a moment before she said in a mocking tone, \"Aww... did my luxurious luscious lips do that to you? Let me take care of it...\"<br>\r\n<br>\r\nShe opened her mouth and let her long tongue lick you all over, but mostly concentrating on your crotch until you cummed. That made you feel stronger than ever before, but Divatox drained it faster as well.<br>\r\n<br>\r\n\"What power! I feel stronger! Like I could do anything!\" Divatox said as her body began to glow. She then said...</span></div></div>",
            "created":1494910800,
            "id":2320541,
            "title":"Divatox's personal power ranger! Kissy-kiss!"
        },
        "13512222":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "panties, where you were pressed against her pussy.",
                "Bra, where you were pressed against her nipples"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll revive monsters, like Lipsyncher and Archerina as my minions!\" Divatox cackled as she held you above her head.<br>\r\n<br>\r\nThere was a flash of light before Divatox began to swagger in place. She put her hand on a wall to balance herself as she muttered, \"Woah... Energy easy come, easy go... Where are my minions?\"<br>\r\n<br>\r\n\"Right here, boss!\" Lipsyncher said, waving her hand.<br>\r\n<br>\r\nStanding right by her were two robots, glaring at Divatox.<br>\r\n<br>\r\n\"While I appreciate being revived, I cannot stand being enslaved to a crass diva such as you!\" Queen Machina said, waving a fan to calm herself down.<br>\r\n<br>\r\n\"When we find a way to free ourselves, I will make sure to-\" Archerina began, shaking her fists as she spoke.<br>\r\n<br>\r\n\"My first order is for no one even thinks or takes any action of betraying me! The second order is to always tell me anything you want to keep secret!\" Divatox said as she stuffed you into her bosom, leaving only your head and shoulders out.<br>\r\n<br>\r\nQueen Machina and Archerina both looked furious before they unnaturally calmed down quickly and gave Divatox a slight bow.<br>\r\n<br>\r\n\"Who's the tiny guy?\" Lipsyncher asked.<br>\r\n<br>\r\n\"Oh, nobody important, just my new power source,\" Divatox pridefully answered as she gestured towards you like you were a piece of jewelry. \"Once we revive a monster that can make specialized clothes, I'll have her make a few that'll have him as the centerpiece!\"<br>\r\n<br>\r\n\"I... can make new clothes. It was... an upgrade I had a long time ago...\"Archerina said, not liking how she's forced to obey.<br>\r\n<br>\r\n\"Then make a bra and panties, ones that have a little pouch for my little power source to fit into,\" Divatox answered.<br>\r\n<br>\r\nWithin moments, Archerina produced a bra and panties. Divatox took them and said, \"While I change, you three go and find something to do on this ship!\"<br>\r\n<br>\r\nDivatox then walked into her personal room and took you out of her bosom. She did her best to undress in a sexy way for you. To her credit and your displeasure, you did grow aroused, giving Divatox more energy.<br>\r\n<br>\r\nOnce she was nude, Divatox then grabbed you and put you in her new...</span></div></div>",
            "created":1496552400,
            "id":2330981,
            "title":"Divatox's power ranger : revive monsters!"
        },
        "135122221":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Divatox demands a pair of panties where you're in the rear.",
                "Divatox uses tape to stick you on Archerina's butt",
                "You get placed on the captain's chair and sat on.",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>Divatox quickly put you in a small pouch in her panties.<br>\r\n<br>\r\n\"No... No... Please no,\" You cried out.<br>\r\n<br>\r\n\"Oh yes! You can't imagine the number of men and women who desire to be in your place!\" Divatox cooed as she slipped her legs in the leg holes. \"I'm doing your a service! A kindness, in fact!\"<br>\r\n<br>\r\nAs she slowly pulled the panties up, you were able to see that her pussy was just like a normal human's.<br>\r\n<br>\r\n\"No! don't!\" You yelled, right before coming into contact with the self-proclaimed space pirate queen.<br>\r\n<br>\r\n\"Oh, just shut up and enjoy it before I ask my tincans to make a pair of panties where you're stuck in my divine derriere and I fart on you until everything I do turns you on!\" Divatox growled.<br>\r\n<br>\r\nYou struggled, which only had the effect of arousing Divatox.<br>\r\n<br>\r\n\"Ooohhhh, now you're showing your proper respect, my pet! Keep doing that!\" Divatox moaned.<br>\r\n<br>\r\nEventually, she cummed, making you fear you would drown in alien space pirate female cum. So much so, you struggled even more, causing Divatox to cum more and more. Oddly, you also were becoming more aroused.<br>\r\n<br>\r\nEventually, Divatox bellowed, \"Stop!\"<br>\r\n<br>\r\nWhen you didn't stop struggling, Divatox took off the soaking wet panties and glared at you.<br>\r\n<br>\r\nYou eventually stopped.<br>\r\n<br>\r\n\"When I say stop, I mean stop! I don't care how good you made me feel or how much I needed it, insubordination calls for a punishment!\" Divatox growled as she plucked you out of the panties and headed back to the bridge.</span></div></div>",
            "created":1551848400,
            "id":2627129,
            "title":"In Divatox's panties"
        },
        "135122222":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Divatox puts you in Archerina's hands",
                "Divatox keeps you"
            ],
            "content":"<div class=\"\"><div> <span>As soon as you were placed in the bra cup, threads quickly spun themselves around your arms and legs.<br>\r\n<br>\r\n\"And now for you to enjoy the bosom that galaxies have lusted over!\" Divatox said as she quickly put on her new bra.<br>\r\n<br>\r\nYou were pressed against her left breast, able to hear her heartbeat... which you found odd, since she was an alien and might have her hearyt in a different place.<br>\r\n<br>\r\nAs she put back on her clothes, Divatox asked, \"I do hope you don't develop a strong interest in<br>\r\nmilk!\"<br>\r\n<br>\r\nShe then laughed for a few moments before she finished putting on her clothes. Her nipple was just under your face.<br>\r\n<br>\r\nDivatox then marched to the captain's chair. Archerina was doing something on a terminal. Queen Machina was in what was Porto's invention room, busy making new contraptions. Lipsyncher was marching around the ship, looking for soemthing to do.<br>\r\n<br>\r\n\"Archerina! What are you doing?\" Divatox asked, adjusting her chestplate to shove you into her boob.<br>\r\n<br>\r\n\"I was hacking several databases to see what monsters you can revive,\" Archerina answered.<br>\r\n<br>\r\n\"Well, they can only be female monsters. It's a limit of the method I can use,\" Divatox replied, not wanting to tell her new minions the real method, which was some devices and magical artifacts.<br>\r\n<br>\r\n\"We also have to choose what minions to use,\" Archerina answered.<br>\r\n<br>\r\n\"We use Piranhatrons. I used them to defeat the turbo rangers!\" Divatox answered, as she continued to press her chestplate. By now, Divatox was getting aroused, her nipple was becoming erect. Both her actions and your current situation was turning you on, giving her more energy.<br>\r\n<br>\r\n\"They aren't female and the ones I am able to locate are serving other masters, ones who are more powerful than us,\" Archerina replied.<br>\r\n<br>\r\nGrimacing for a moment, Divatox asked,\"Putra Pods?\"<br>\r\n<br>\r\n\"Same problem,\" Archerina answered, glad her face prevented her from smirking.<br>\r\n<br>\r\n\"Chromites! They were General Havok's minions, but I can still... We can't use them, can we?\" Divatox muttered.<br>\r\n<br>\r\n\"We can use their special variant, the shadow Chromite and your special power source to make evil clones of female power rangers of different groups. We might even be able to create duplicates of female monsters that still live at the moment and even ones from the future,\" Archerina said. \"But Queen Machina and I will need to inspect your power source to create the necessary device to do so.\"</span></div></div>",
            "created":1497243600,
            "id":2334978,
            "title":"Divatox's power ranger : in her new bra."
        },
        "1351222221":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Archerina installs a device, so she can keep you safe inside her",
                "Queen Machina kidnaps you and learns a way to rebel against Divatox",
                "It gets discovered the more you're aroused, the more energy you give off",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>Divatox made an orverdramatic sigh before she said, \"If I must... but do return him. He is my property, just like you!\"<br>\r\n<br>\r\nAngry thoughts ran through Archerina's mind as Divatox undid her chest armor and bra before the Pirate queen plucked you out.<br>\r\n<br>\r\n\"My little power source, you will have to leave me for a time, but Archerina will be taking care of you,\" Divatox cooed before covering you with one of her kisses. She then dropped you in Archerina's hand as she said, \"Tata for now!\"<br>\r\n<br>\r\n\"...Thank you, Divatox,\" Archerina said, barely holding her anger. <br>\r\n<br>\r\n\"You may go, you pink tin can,\" Divatox said in a dismissive tone.<br>\r\n<br>\r\nArcherina then headed to the ship's laboratory. After she placed you in a large tray that had walls bigger than you, she said, \"Now to run some tests.\"<br>\r\n<br>\r\n\"Like what?\" you asked.<br>\r\n<br>\r\nThe Pink Gynoid picked you up and quickly placed some bands around your wrists and ankles. After she put you back down, the bands forced you to lay down.<br>\r\n<br>\r\nFinally, Archerina picked up a small brush and answered, \"Whatever I can think of.\"<br>\r\n<br>\r\nArcherina then used the brush on your crotch. She used it so softly, you grew aroused enough to cum. Her next action was to place the brush in some device and explained, \"This will see if we can get more energy by arousing you.\"<br>\r\n<br>\r\n\"Oh... so what next?\" You asked.</span></div></div>",
            "created":1555477200,
            "id":2646109,
            "title":"Divatox puts you in Archerina's hands"
        },
        "14":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "Cassie, in costume",
                "Cassie, out of costume",
                "Ashley in costume",
                "Ashley out of costume",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Should it be Cassie or Ashley?</span></div></span></div>",
            "created":1496552400,
            "id":2331158,
            "title":"Space"
        },
        "144":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "Long Sleeves and Long Pants",
                "Shorts or Skirt with Tank Top"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select An Outfit!</span></div></span></div>",
            "created":1591419600,
            "id":2846747,
            "title":"Ashley out of costume"
        },
        "1442":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "Shorts",
                "Skirt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Shorts or Skirt</span></div></span></div>",
            "created":1591419600,
            "id":2846748,
            "title":"Shorts or Skirt with Tank Top"
        },
        "14421":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "She steps on you.",
                "Notices you."
            ],
            "content":"<div class=\"\"><div> <span>You are walking along. You think it is a normal day, but today is different. You are shrinking for some weird reason, and you do not even realize it. Until you open your eyes to see a giant shadow over you. You look up to see a girl, but not just any girl. It is Ashley wearing a tank top and shorts. Then you just stand there and look at her. Her beautifully muscular thighs, her giant breasts, her beautiful face, and flat stomach. This is the girl of your dreams. Suddenly...</span></div></div>",
            "created":1592766420,
            "id":2854591,
            "title":"Introduction"
        },
        "14422":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "You",
                "Andros"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Ranger is Shrinking?</span></div></span></div>",
            "created":1591450260,
            "id":2846749,
            "title":"Skirt"
        },
        "144221":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "Noticed you",
                "Steps on you accidentally!"
            ],
            "content":"<div class=\"\"><div> <span>One day on a pure sunny,cloudless day in Angel Grove,CA you are busy walking,enjoying a nice time at the local park then carefully walking alongside the sidewalk as this is your usual schedule when out of the blue,you feel a very odd sensation flowing through your entire body and although you don't realize it yet, but as you're still carefully walking down the street,without a care in the world,you're mysteriously shrinking in height to about a mere two feet!<br>\r\n<br>\r\n\"HUh? What th-H-How did this happen?\" You cried out loud as you notice how much larger everything suddenly is! Then as you're pondering to any in the heck any of this madness was even possible,there was a series of violent earth quakes as something very,very BIG was headed in your direction and at first,you do not realize until you see a girl walking straight in your direction and taking no notice of you at all!<br>\r\n<br>\r\n This girl was Ashley Hammond, the newest Yellow Power Ranger with her long brown hair,equally brown eyes and very cute appearance. As she also wore a yellow tank top and skirt. You could see her white colored panties underneath her really short,shorts as she slowly and joyfully, walked down the busy streets,apparently happy about something.  Then she....</span></div></div>",
            "created":1591450380,
            "id":2846750,
            "title":"You"
        },
        "1442211":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "In her breasts",
                "In her panties"
            ],
            "content":"<div class=\"\"><div> <span>As the young newest Yellow Ranger Ashley suddenly paused in her tracks and gasped loudly as she noticed the tiny man on the street just mere feet from her at the last second before accidentally stepping on you. <br>\r\n<br>\r\n\"GASP...Ohhhh... OH MY GOSH!!! I-I'M SOO SORRY....I DIDN'T SEE YOU...HEY HOLD ON...Y-YOU'RE A TINY LITTLE MAN.....\" She is apparently suddenly very  concerned and a bit disturbed since you were previously looking up at her panties and large breasts and a bit annoyed, she says, \"Hey! My eyes are up here....Normally I should be hopping mad but since you are a really small person and are serious need of help,I guess I can overlook it this one time...now let's see....\"  As the Yellow Ranger decided to take you somewhere safe! She puts you.....</span></div></div>",
            "created":1592756760,
            "id":2854531,
            "title":"Notices You"
        },
        "14422111":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "Bra",
                "Panties"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She decided to put you in her clothing. The thing is... Where?</span></div></span></div>",
            "created":1592756820,
            "id":2854532,
            "title":"In her clothing."
        },
        "144221112":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "An mission suddenly emerges,prompting the Rangers to action!",
                "You end up falling out of her panties."
            ],
            "content":"<div class=\"\"><div> <span>\"Let me put you in here.\" The really cute teenage girl  says cheerfully, as she carefully opened up her shorts and dropped you right into  her white colored panties. \"There,you should be safe in there! I'll check up on you a bit later.\" As you're both bewildered and awed at the same time,that she would attempt to do something like this without even asking how you ended up this way! As it was pitch dark,you couldn't see a thing,save your own two hands and you felt extremely  hot and stuffy, but it is comfortable. You can still make out the outline of the gigantic Yellow Ranger's outer underwear though. <br>\r\n<br>\r\nAs joyfully and a bit giddy,Ashley finally arrived at the location of the newest Power Rangers In Space's HQ on Earth and while nobody including her fellow comrades is looking, she carefully takes you out of her panties, and...</span></div></div>",
            "created":1592756940,
            "id":2854537,
            "title":"Panties"
        },
        "1442211122":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "You have been found by one of Astronema's minons.",
                "You are still on the ground, and Ashley quickly grabs you!"
            ],
            "content":"<div class=\"\"><div> <span>As the gigantic Yellow Ranger Ashley finally arrives to the scene in the assigned spot,the trouble was taking place,in the same park where you were a few hours ago and she takes you out of her panties. The only problem is,although you narrowly avoiding touching or even getting anywhere near her very 'private parts',due to the very closed in space,and sweat,you fell out hundreds of feet all the way to Ashley's sneakers but managed to remain quite unharmed,though stunned.<br>\r\n<br>\r\n\"Whew! Finally here.....okay little guy,I'll let you out.....Oh no...huh? W-Where did he go?\" Ashley thought as she was freaking out,as she couldn't feel the weird but somewhat fascinating movements of her undergarments. As she wonders where you are. And begins looking all over the grassy grounds,frantically for the tiny man. Meanwhile,you are stuck on the ground still,stunned until suddenly...</span></div></div>",
            "created":1592766660,
            "id":2854594,
            "title":"You end up falling out of her panties."
        },
        "14422111222":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "Breasts/Bra",
                "Shoe"
            ],
            "content":"<div class=\"\"><div> <span>While on the ground, you see a large shadow and hear heavy footsteps. You are terrified of who this could be. When the figure gets closer, you realize it is Ashley. You get a chance to look at her again. Ashley picks you up from the ground and she stares at you for a moment. \"I need to put you somewhere, so that you do not fall out again!\" claims Ashley. She puts you in her....</span></div></div>",
            "created":1593037020,
            "id":2856333,
            "title":"Saved by your beautiful giantess."
        },
        "144221112221":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "She has changed her mind.",
                "She sees Astronema and her minions."
            ],
            "content":"<div class=\"\"><div> <span>\"Maybe here.\" Ashley says, as she puts you in between her massive and long breasts. She looks down at you and says, \"Let's go.\" She runs, and you are feeling slightly comfortable. It seems like you have been running for a long time, but she suddenly stops because... </span></div></div>",
            "created":1593037140,
            "id":2856335,
            "title":"Soft Spot"
        },
        "1442211122211":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "I eat you? I am hungry after all!\".",
                "...nevermind. I need to continue!\"."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While running for what seems like a long time in Ashley's massive breasts, Ashley suddenly stops. You look up at her and she has an interesting look. She has a face that looks like she is wondering about something. \"What happens if....</span></div></span></div>",
            "created":1593037260,
            "id":2856336,
            "title":"She has changed her mind."
        },
        "14422111222111":{
            "author_id":"bobjoe96",
            "author_name":"Bob",
            "choices":[
                "Terrified. Please do not eat me! ",
                "Curious. What would happen if I go inside her body?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"What if I eat you? I am hungry after all!\" was stated by Ashley after she stopped running. She looks back down to see you in her two massive breasts to see your reaction to this wild request. You look..</span></div></span></div>",
            "created":1593037380,
            "id":2856339,
            "title":"I eat you? I am hungry after all!\"."
        },
        "15":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Lost Galaxy",
                "Light speed Rescue",
                "Time Force",
                "Wild Force",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay some the more older versions Eh?</span></div></span></div>",
            "created":1425358800,
            "id":1942963,
            "title":"Other"
        },
        "152":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Carter Grayson ",
                "Chad Lee",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Power Rangers Lightspeed Rescue! Who will shrink in this epic series?!</span></div></span></div>",
            "created":1563339600,
            "id":2688030,
            "title":"Light speed Rescue"
        },
        "1523":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Joel Rawlings",
                "Ryan Mitchell",
                "Even more options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More Lightspeed Rangers!</span></div></span></div>",
            "created":1563339600,
            "id":2688032,
            "title":"More Rangers"
        },
        "15233":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Captain William Mitchell",
                "You!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more options!</span></div></span></div>",
            "created":1563339600,
            "id":2688034,
            "title":"Even more options"
        },
        "152332":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Kelsey Winslow ",
                "Dana Mitchell",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where to begin?</span></div></span></div>",
            "created":1563339600,
            "id":2688037,
            "title":"You!"
        },
        "1523323":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Angela Fairweather",
                "Marina ",
                "Final Selections "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More Choices!</span></div></span></div>",
            "created":1563339600,
            "id":2688038,
            "title":"More Choices"
        },
        "15233233":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Queen Bansheera",
                "Vypra "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Final Selections!</span></div></span></div>",
            "created":1563339600,
            "id":2688040,
            "title":"Final Selections "
        },
        "152332332":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "You awoke in dark and cramped space",
                "You found youself in a soft but suffocating prison",
                "You were trapped in an empty birdcage "
            ],
            "content":"<div class=\"\"><div> <span>You were walking through Mariner Bay as you normally did on a Sunday night. The cool calm of the city and nighttime air really contributed a lot. Plus, how the full moon illuminated the back streets saw absolutely beautiful. Too bad you normal routine was ruined by the telltale sound of blaster fire.<br>\r\n<br>\r\nBeing the ever curious individual that you were, you decided to investigate. You cut across the abandoned back alleys to find the source of the disturbance. And find it you did. Your jaw dropped when you saw them, the lightspeed Power Rangers in all their multi-colored glory.<br>\r\n<br>\r\nYou'd seen news reports of them sure, but never had you had a front row seat to the action like this. They seemed to be engaged in a battle against a few throwaway grunts. The goons were obviously no challenge as the Rangers dispatched them with little effort.<br>\r\n<br>\r\nWhile the grunts on the ground didn't scare you, the one barking out orders did. You'd seen her on the news a few times as well. Vypra they called her. For a demon she was quite cute, even if she scared you half to death. The serpent armored woman was apparently carrying some sort of ray-gun.<br>\r\n<br>\r\nYou watched in awe and terror as she fired away. The Red Ranger dodged in the nick of time, but the trashcan behind him wasn't so fortunate. It vanished in the blink of an eye. Holy cow! Did she just vaporize it?! Just imagining the trashcan getting torn apart on a molecular level terrified you. <br>\r\n<br>\r\nWhat would happen if she hit a human. Against your better judgment, instead of calling the police, you moved a little closer to the action. You found cover behind a large dumpster that was just far enough away that you wouldn't be noticed. This was getting way out of hand.<br>\r\n<br>\r\nThe more grunts the Rangers defeated the more arose in their place. This wasn't good. Just when you thought things couldn't get any worse, that Vypra chick sent an energy wave at the Rangers that sent then flying. Each and every one of them landed somewhere different. <br>\r\n<br>\r\nThat woman must not have cared her own teammates  either because that blast threw them away too. But it was just your luck that the Pink Ranger Landed in your direction and was the first to get back up. That meant that Vypra's attention rested squarely in your area.<br>\r\n<br>\r\nYou could practically hear the heavy breathing coming from the Pink Ranger and could tell she was still a little messed up from the blast. Grandstanding would do her no favors here. There was no way she could dodge Vypra's next attack. All color drained from your face as you realized this and saw the grin on the demon's face.<br>\r\n<br>\r\nVypra walked closer as she readied her gun to finish off the Pink Ranger. Time seemed to slow to a crawl and the Rangers voices had turned into a mess of distorted white noise. Vypra took aim... And squeezed the trigger. You knew she couldn't dodge. So you decided to give her an assist. Right before the beam hit, you sprung from cover... And pushed the pink Ranger aside.<br>\r\n<br>\r\nYou were struck, and everything went dark.</span></div></div>",
            "created":1563339600,
            "id":2688054,
            "title":"Vypra "
        },
        "155":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Ninja Storm",
                "Dino Thunder a favorite pick",
                "Or more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Still more</span></div></span></div>",
            "created":1425358800,
            "id":1942964,
            "title":"Other"
        },
        "1552":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Dino Thunder please ",
                "Nah something else!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure you want Dino Thunder or something else? </span></div></span></div>",
            "created":1531458000,
            "id":2519580,
            "title":"Dino Thunder a favorite pick"
        },
        "15522":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Choose one of Dino Thunder Villainesses",
                "Choose something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else is there to choose from? </span></div></span></div>",
            "created":1531458000,
            "id":2519625,
            "title":"Nah something else!"
        },
        "155222":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Yeah a couple more ",
                "No not really"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else is there to choose from though anymore shows? </span></div></span></div>",
            "created":1531544400,
            "id":2519759,
            "title":"Choose something else"
        },
        "1553":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Power Rangers SPD",
                "Mystic Force",
                "More still"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>PR-SPD maybe,Mystic Force perhaps?</span></div></span></div>",
            "created":1425358800,
            "id":1942966,
            "title":"Or more"
        },
        "15533":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Operation Overdrive",
                "Jungle Fury or RPM",
                "Choose from Nick's versions"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Winding down here these maybe? Operation Overdrive or Jungle Fury or RPM?</span></div></span></div>",
            "created":1425358800,
            "id":1942968,
            "title":"More still"
        },
        "155332":{
            "choices":[
                "Jungle Fury",
                "RPM"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one? Jungle Fury, or RPM?</span></div></span></div>",
            "created":1448514000,
            "id":2067049,
            "title":"Make up your mind!"
        },
        "155333":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Power Rangers Samurai",
                "Super Megaforce",
                "Last one I promise"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Either Samurai or Megaforce by any chance?</span></div></span></div>",
            "created":1425358800,
            "id":1942971,
            "title":"Choose from Nick's versions"
        },
        "1553333":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Yeah",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The final pick is the recent 2015 Dino Charge yes or no?</span></div></span></div>",
            "created":1425358800,
            "id":1942972,
            "title":"Last one I promise"
        },
        "15533331":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "The red ranger Tyler or blue caveman like ranger Koda",
                "Or you yourself uh oh!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character gets to be encountered by the giant Shelby? </span></div></span></div>",
            "created":1436418000,
            "id":2005489,
            "title":"Yeah"
        },
        "155333312":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Take a daring leap on one of her shoes",
                "You stay put and scream for her attention "
            ],
            "content":"<div class=\"\"><div> <span>You're one of the newest associate helping at the local Amber Beach Dinosaur Meseum portraying historic creatures dinosaurs included though you're a nice all around person you are forced to work with know-it-all expert Shelby who despite her cuteness is a total nagging snob always harping on what you did wrong and you're wishing you never took this summer job to begin with if you knew you had to endure this much abuse \"Ahh come on stop nagging me already I'm not that familiar with this stuff as you are!\" You moan as due to her clumsiness Shelby knocks over a fragile display case of very old dinosaur bones but ordering you to pick them up before the curator himself saw what happened you moan as you do \"Ohh how I wish something bad happens to her one of these days!\" You groan after picking up the last ancient bone as you go to place it back into the glass case you notice a strange amulet nearby and curiously pick it up its glowing a vomit green color and instantly you feel the odd effects as you mysteriously shrink down to microscopic size or at least two inches luckily your clothes shrunk with you or this would be a pretty embarrassing episode for you \"What the- How did this happen? Now I'm puny sized!\" You cried fortunately the museum's empty as it's nighttime so there's little chance of someone coming in and noticing your tiny state but as you try and search for the glowing amulet responsible for your current situation you hear booming footsteps \"Where's that lazy new associate at? And who left this thing lying around?\" Peeking around a corner you see your worst fears confirmed:Shelby she looks enormous and completely massive at that alarming state! staying overnight is busy tidying up for tomorrow's big event as the Grand Opening was first thing tomorrow was holding the amulet placing it back at its assigned spot then walking away and you</span></div></div>",
            "created":1436418000,
            "id":2005503,
            "title":"Or you yourself uh oh!"
        },
        "15533332":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Kimberly the Pink Ranger(2017)",
                "Trini the Yellow Ranger(2017)",
                "Rita the rogue Green Ranger(2017)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or maybe you wind up shrink in front of one of the female Rangers from the recent 2017 reboot film? Yes Rita included! So which one will you be shrunk in front of? </span></div></span></div>",
            "created":1492146000,
            "id":2305246,
            "title":"No"
        },
        "155333323":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "The PR Ninja Storm",
                "Head on back to the 2017 film",
                "Something altogether make up your own characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Almost forgot this one maybe the newest Nick show: Power Rangers Ninja Storm or go back to the recent 2017 flick?</span></div></span></div>",
            "created":1503896400,
            "id":2376384,
            "title":"Rita the rogue Green Ranger(2017)"
        },
        "1553333233":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Yes",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or maybe you or another character winds up shrunk by one of the female Rangers from the series that inspired PG Super Sentai: <a rel=\"nofollow\" href=\"https://www.google.com/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;source=images&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=0ahUKEwjh-tyW6dzXAhUJkeAKHQYiBRUQjRwIBw&amp;url=https%3A%2F%2Fnobuharuudou.deviantart.com%2Fart%2FThe-41-Super-Sentai-Teams-690215352&amp;psig=AOvVaw3XEOfdyU4buBWu_Cunm_hb&amp;ust=1511805674809950\" target=\"_blank\">https://www.google.com/url?sa=i&amp;rct=j&amp;q=...</a> <br>\r\n</span></div></span></div>",
            "created":1511672400,
            "id":2420601,
            "title":"Something altogether make up your own characters"
        },
        "15533332331":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Yeah ",
                "Try with the next one"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay we'll start with Zyuranger,the 1992 series that started it all and what MMPR is based off of? How about the Japanese counterpart of Kimberly Princess Mei of the Lithia Tribe: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Lithia_Tribe_Princess_Mei\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Lithi...</a> she's hot.</span></div></span></div>",
            "created":1511672400,
            "id":2420612,
            "title":"Yes"
        },
        "155333323312":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Yeah her",
                "Nah next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Dairanger: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Dairanger#Characters\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Daira...</a> maybe the Pink Ranger Rin of the Heavenly Winds: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Rin_of_the_Heavenly_Wind_Star?\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Rin_o...</a></span></div></span></div>",
            "created":1511672400,
            "id":2420618,
            "title":"Try with the next one"
        },
        "1553333233122":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Yeah!",
                "Next!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay then how about Kakuranger then: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Kakuranger\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Kakur...</a> Maybe you'd rather be shrunk by Tsuruhime,the Ninjawhite Ranger: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Tsuruhime\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Tsuru...</a> </span></div></span></div>",
            "created":1511672400,
            "id":2420625,
            "title":"Nah next"
        },
        "15533332331222":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Ohyellow",
                "Ohpink",
                "Oh no!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well how about Ohranger: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Ohranger,the\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Ohran...</a> counterpart to Power Rangers Zeo? <br>\r\n<br>\r\nMaybe you're shrunk by Ohyellow: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Juri_Nijou\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Juri_...</a> or Ohpink: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Momo_Maruo\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Momo_...</a> or not?</span></div></span></div>",
            "created":1511672400,
            "id":2420631,
            "title":"Next!!"
        },
        "155333323312223":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Yellow's cool",
                "Pink's better",
                "Bail out next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Carranger then: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Carranger,or\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Carra...</a> Power Rangers Turbo?<br>\r\n<br>\r\n<br>\r\nHow about getting shrunk by Yellow Racer: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Natsumi_Shinohara\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Natsu...</a><br>\r\n<br>\r\nor Pink Racer: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Youko_Yagami?\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Youko...</a> </span></div></span></div>",
            "created":1511672400,
            "id":2420634,
            "title":"Oh no!"
        },
        "1553333233122233":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Megayellow yeah!",
                "Megapink more yeah! ",
                "Next series please"
            ],
            "content":"<div class=\"\"><div> <span>Okay then maybe the darkest and best series in the entire saga then Megaranger: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Megaranger\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Megar...</a> aka Power Rangers in Space?<br>\r\n<br>\r\nHow about it you're either shrunk by determined,brilliant photographer wannabe  <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Chisato_Jougasaki\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Chisa...</a> Megayellow or dimwitted and gluttonous but cute Megapink: <a rel=\"nofollow\" href=\"http://powerrangers.wikia.com/wiki/Miku_Imamura\" target=\"_blank\">http://powerrangers.wikia.com/wiki/Miku_...</a></span></div></div>",
            "created":1511672400,
            "id":2420637,
            "title":"Bail out next"
        },
        "15533332331222332":{
            "choices":[
                "She wanted to learn about you",
                "Miku started to get hungry again"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Chuck. You are a respected young pilot in the Air Force and love to help people. You lived alone in a small house, happy with your life. Though you were mature and acted like an adult most times, you still liked to watch cartoons like Power Rangers or more specific the Japanese counterpart Super Sentai A couple of your friends thought this was silly, but you didn't care what they thought.<br>\r\n<br>\r\nOne day, you were talking to someone when the ground started to shake. You were confused and tried to figure out what started it. You drove towards the danger until something froze you in your tracks. There, right in front of you was an enormous young woman, a  teenaged Japanese girl in the traditional school outfit and it wasn't just any girl, it was Miku Imamura, the pink Power Ranger or as she was known Megapink from Megaranger(Power Rangers in Space in America)   She looked to be about 50 feet tall and was looking around smiling. You weren't sure what to do so you decided to just see what she did at the moment.<br>\r\n<br>\r\n\"こんにちは(HELLO!!)\" She cried out happily at her now tiny surroundings she had no idea how she got to be on the other side of the world in America of all places and so big but also didn't care if only the other Megarangers especially Shun,the red ranger could see ditzy and gluttonous Miku now.....<br>\r\n<br>\r\nAs Miku started to walk away from you, you drove after her. Her giant feet left massive craters in the road, making it hard to drive. As she walked, there was chaos around her. Lots of people were screaming, terrified of her. A couple were just staring in awe at her beauty. Her giant feet were also sending tremors throughout making it hard to drive and people more afraid. You weren't about to give up though, you needed to figure out what to do.<br>\r\n<br>\r\nThe giantess kept walking, trying to avoid stepping on people, though it was difficult. Suddenly, someone ran in front of her, making her disorientated. She stumbled backwards, hitting the building next to her. Miku got up and started walking again, she had no idea how she got here, but she was starting to get hungry. Suddenly, she stepped on something hard, making her flinch. She lifted her foot to reveal a squashed car.<br>\r\n<br>\r\n<font class=\"size5\" style=\"\">\"Ohhh <br>\r\nごめんなさい(Oops, I'm sorry!)\"</font> She said and continued. Though she was trying to be careful, she kept stepping on cars until she accidentally tripped on one, making her stumble and fall onto her butt. The screams of the people became louder and crazier as they saw her trembles knock down buildings and leave giant cracks in the road. You decided you needed to do something, so you left to get something. Meanwhile, the Megaranger stood up and saw what her accident caused. In the road was now a giant butt shaped crater. Miku blushed and continued as if she hadn't done anything.<br>\r\n<br>\r\nThe giantess took one more step before seeing what she was looking for, restaurants. She happily jogged over to a couple, making super tremors that knocked buildings down from miles and miles away. Without thinking, she ripped the roofs off and started grabbing food. People screamed and ran, not wanting to be part of her meal. She targeted both American and Japanese restaurants, shoving the food down her throat. She was so hungry, she couldn't have waited any longer. She went from restaurant to restaurant, eating everything that she could, not stopping for a minute.<br>\r\n<br>\r\nOnce she was finished, she sat on the last restaurant she raided, crushing everything in the building. Since there wasn't anybody in the building, she didn't care. She looked around at the beautiful city she was in. She wished she could get people to see she didn't want to hurt anybody. Suddenly, a funny feeling developed in her stomach and the rumbling got louder as the citizens' panicking state increased  She put her hands on her stomach, worried she might have accidentally devoured someone by accident finally she could hold it in any longer her brown eyes grew wide as she muttered \"Ohhhhhhh......\"  Without warning though, she instinctively opened her mouth and gave the loudest burp ever. <br>\r\n<br>\r\n<b>BUUUUUUUUUURRRRRRRRRRRRRPPPPPPPP!!!</b>The sound waves traveled throughout the city,causing the ground to shake a bit and shattering glass everywhere. Miku immediately covered her mouth, blushing hard.<br>\r\n<br>\r\n\"すみません (Excuse me!)\" She said, embarrassed, however she was glad that the feeling in her stomach went away.<br>\r\n<br>\r\nMeanwhile, you had gone to get your personal jet. You weren't sure if the military knew what was happening, but even if they did, they were miles away so you had to take this matter into your own hands. As you got in, you heard a massively loud sound. You weren't sure what that was but you knew it came from the giantess. You flew out and went straight for her. It didn't take you long to get there, you found her walking in the street. It looked like most citizens fled so you didn't have to worry about casualties. You flew right next to Miku's legs, trying to get to her front. As you did, you got a look at her panties above you, making you blush, but you couldn't think about that right now. You quickly got her attention and flew around in front of her. Your plan was to try and get her to follow you out of the city.<br>\r\n<br>\r\nAs you flew around, you could tell that Miku was starting to get a little annoyed which worried you. Miku raised her arm, ready to smack you like a fly. You quickly moved out of the way just in time. For a few minutes, you kept having to dodge her hand, you actually enjoyed the feeling of teasing her. Unfortunately, you were so focused on her dominant arm, you didn't see her other arm in time. She grabbed your ship, opened it with force and pulled you out. She dropped your vehicle to the ground and stomped on it, breaking it instantly. She then smiled at you and carefully started to poke you.<br>\r\n<br>\r\n\"Please don't hurt me!\" You begged, making her giggle.<br>\r\n<br>\r\n\"I won't, if you let me play with you.\" She said,'luckily Miku despite disliking school work had taken a few English speaking classes making you confused at first. Suddenly, she started to tickle you on the stomach, making you laugh hard and squirmed around Miku leaned against a tall building and kept tickling you.<br>\r\n<br>\r\n\"Ahaaaaaaaaaaaaaha! Plllleeeaaasssssseee stooooopppppppppppp Haaaaaaaaaaaaaaaaa!\" <br>\r\n You begged her to stop, but she simply smiled at you.<br>\r\n<br>\r\n\"くすぐる(Tickle,Tickle!)\" Miku cooed as she gently stroked your stomach with her index and middle fingers with girlish playful glee <br>\r\n<br>\r\n  She then nuzzled you with her cheek softly, giggling a little. This was a little fun for you, but it was also awkward. \"You are just  so cute and small, I could just eat you up. Oh well, I guess I'll just have to settle for a kiss instead.\" She said, bringing you in for one you could see every inch of her huge pink lips as they came closer and closer <br>\r\n<br>\r\n\"Muah!\" She kissed you in a way thinking you were Shun in disguise but she thought you were way cuter than him covering you entirely in lipstick and her spit.<br>\r\n<br>\r\n You had a feeling she was going to own you for a while. After tickling you some more…</span></div></div>",
            "created":1511758800,
            "id":2421219,
            "title":"Not the best day to be a hero"
        },
        "155333323312223321":{
            "choices":[
                "We get something to eat",
                "You show me around"
            ],
            "content":"<div class=\"\"><div> <span>Miku held you in the palm of her hand, smiling. You were just glad you got time to breathe after what happened. You looked up at her, unsure of what to do.<br>\r\n<br>\r\n<font class=\"size35\" style=\"\">\"そう(So)\".</font> She said, making you confused.<br>\r\n<br>\r\n\"What?\" You asked, making her giggle.<br>\r\n<br>\r\n<font class=\"size35\" style=\"\">\"Tell me mister about yourself, like for instance who are you?\"</font><br>\r\n<br>\r\n\"Why should I? Give me one good reason.\" You said without thinking. Suddenly, her other hand came towards you, putting her finger on your chest gently.<br>\r\n<br>\r\n<font class=\"size35\" style=\"\">\"Talk little man, unless you want to be tickled again.\"</font> Miku smiled, her eyes glittered.<br>\r\n<br>\r\n\"Okay fine, just don't hurt me.\"<br>\r\n<br>\r\n<font class=\"size35\" style=\"\">\"I don't plan on it.\"</font> You told her your name and that you were in the air force. You told her your favorite color, you like to help people and that you liked cartoons. She carefully listened quietly, catching every detail mentioned. When she first grabbed you, you were pretty scared. After all, she was really big and could hurt you easily. However, as she listened, you felt more comfortable around her. She asked if you had a family. You hesitated before answering.<br>\r\n<br>\r\n\"No, I don't. Both of my parents passed away, and I don't have a girlfriend. I do have a lot of friends though.\"<br>\r\n<br>\r\n<font class=\"size35\" style=\"\">\"I'm sorry for your loss. Hey, how about …\"</font></span></div></div>",
            "created":1512277200,
            "id":2423579,
            "title":"Getting more comfortable"
        }
    },
    "info":{
        "author_id":"supermario5",
        "author_name":"Brown",
        "brief_description":"Either you or a fellow Ranger are shrunk and found by one of the females on the show",
        "created":1425360180,
        "description":"<td align=\"left\" class=\"norm\">Rules-Choose from any of the shows new ones included <br>\r\n1.No giant male interaction you can be either yourself or one of the male characters in the show shrunken to a tiny size by one of the females<br>\r\n2.Females good or evil included <br>\r\n3.Sex is alright just don't go overboard</td>",
        "id":2032860,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1593037680,
        "modified":1593037680,
        "pretty_title":"Power Ranger shrink"
    }
}