{
    "chapters":{
        "1":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "stay with the shrunken Parents POV",
                "Jack Smith's POV",
                "Eric Smith's POV",
                "Erin Johnson's POV"
            ],
            "content":"<div class=\"\"><div> <span>It was a normal day in the Smith Household, Ed was upstairs, working on his shrinking machine, able to reduce objects, (and organics) to toddler-bite-sized.<br>\r\n<br>\r\nThat day, Ed and Kathy were about to go on a romantic dinner, and they 'hired' one of the cousins of the family, Erin Johnson, to babysit Eric and Jack.<br>\r\n<br>\r\nEd ran up to his little room, Kathy followed him, mainly because she wanted to see what her husband was up to every day.<br>\r\n<br>\r\n\"Look Kathy, with this, we could be rich!\" Ed touched a panel of buttons as Kathy settled down on a couch placed in front of the device! The device roared to life, as Ed jumped forward to get Kathy out of the way, it fired!<br>\r\n<br>\r\nOh crap, someone entered the door right after the parents got their berings...</span></div></div>",
            "created":1197349200,
            "id":474262,
            "title":"And so it begins"
        },
        "11":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "It's Jack!",
                "It's Eric!",
                "It's Erin!"
            ],
            "content":"<div class=\"\"><div> <span>The door creaked open-<br>\r\n<br>\r\n\"Don't worry, I'll get us out of this\" Ed said, trying to calm down his hysterical wife.<br>\r\n<br>\r\n\"What if it's Jack? I don't want to be eaten! Or Eric, he might do something!\"<br>\r\n<br>\r\n\"Don't worry, nothing bad is going to happen.\"<br>\r\n<br>\r\nIs he right?</span></div></div>",
            "created":1197349200,
            "id":474260,
            "title":"Oh Man, not-"
        },
        "111":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "Your Choice",
                "Author of story's choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The soft patter of footsteps sounded on the carpeting, with little, naked except for a little sesame street diaper around his waist, Jack thundering into the room.<br>\r\n<br>\r\n\"Cwol Bwugs!\" Jack was reaching for the little couple...</span></div></span></div>",
            "created":1197349200,
            "id":474266,
            "title":"It's Jack!"
        },
        "1111":{
            "choices":[
                "Squish them with his foot",
                "Crush them with his diaper",
                "Play with them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jack comes into the room and sees the little specs on the ground and assumes there bugs. \"Bugs!\" He comes over to his parents, ready to</span></div></span></div>",
            "created":1197608400,
            "id":475646,
            "title":"Your Choice"
        },
        "11111":{
            "author_id":"numerio",
            "author_name":"Tex",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We have to run! said Ed, \"We're gonna end up feet decorations! Both of them run, but its no use, Jack squishes them!<br>\r\n<br>\r\nThe parents both end up eternally smelling his feet.</span></div></span></div>",
            "created":1264222800,
            "id":824415,
            "title":"Squish them with his foot"
        },
        "11112":{
            "author_id":"joshe2810",
            "author_name":"Josh Edwards",
            "choices":[
                "Hungry?",
                "Ready to fill his diaper?"
            ],
            "content":"<div class=\"\"><div> <span>Jack picks them both up, opens the elastic on his diaper and drops them in. He then sits down on his diapered butt bringing Kathy and Ed with him. The pressure of Jack's butt is very heavy on Kathy and Ed<br>\r\n<br>\r\n\"Oh God. How much do we feed him\" moaned Ed as he struggled to stay upright<br>\r\n<br>\r\n\"Well. Judging by how he's sitting on us, a lot\" replied Kathy<br>\r\n<br>\r\nA while later Jack's stomach begins to rumble. Kathy and Ed hear it as well.<br>\r\n<br>\r\n\"OH! Please let him be hungry\" said Ed<br>\r\n<br>\r\nWhat is it?</span></div></div>",
            "created":1281243600,
            "id":932752,
            "title":"Crush them with his diaper"
        },
        "111121":{
            "choices":[
                "Eat more",
                "Burp more"
            ],
            "content":"<div class=\"\"><div> <span>Jack's stomach rumbles in great hunger. He remembers that his parents are in his diaper, so he takes them out.<br>\r\n<br>\r\n\"Please Jack! Don't eat us!!\" Ed says to his son, as Jack takes his parents closer to his big mouth, opening to accept his snack.<br>\r\n<br>\r\nJack does not care for what Ed has to say to stop him. The parents are tossed into their son's mouth, and swallowed into his big, rumbly belly.<br>\r\n<br>\r\n\"Jack!! Let us out, please!!\" Kathy yells in her son's stomach. The parents begin to pound on Jack's stomach walls, has the growls and grumbles of his belly surround them. *GRRRUMMMMBBBLE* *GLOOORRRP* *BLOOOOORRP*<br>\r\n<br>\r\nJack feels his parents' struggles and enjoys it. He rubs his big belly as it fills with gas that has already rendered the parents unconscious. Jack's expression changes as he feels a huge belch coming on...<br>\r\n<br>\r\n*UUUUUUUUUUUUUUUUUURRRRRRRPPP* \"Ahh...\" Jack's belly rumbles, digesting the last of his parents.</span></div></div>",
            "created":1367730000,
            "id":1584494,
            "title":"Be careful what you wish for"
        },
        "111122":{
            "choices":[
                "Eric",
                "Erin"
            ],
            "content":"<div class=\"\"><div> <span>Jack shifted his weight and stood up \"MOMMY!\" Jack ran out of the room to find his mother, who would certainly help him with his diaper about to fill. His stomach rumbled again, and he suddenly remembered the bugs. He grabbed the bugs out of his diaper and set them on the table \"Stay dewe! i gots to go!\" Jack stood there, feeling his diaper getting less roomy. <br>\r\nThe parents held their noses, as they were little, their noses smelled more than the average one. Jack shifted his weight on both feet, sort of like a dance, and whined at his uncomfortable state.. until he heard someone calling his name and he turned to see...</span></div></div>",
            "created":1315630800,
            "id":1184852,
            "title":"Ready to fill his diaper?"
        },
        "1111222":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "She notices the parents!",
                "She doesn't notice, and the parents are once again in a diaper prison"
            ],
            "content":"<div class=\"\"><div> <span>\"PHEEEEEEW!\" Erin's voice could be heard, the shockwaves of her exclamation shaking the parents to their cores. \"Did baby Jacky do a stinker?\" Erin's hand went for the waistband of his Pamper, her looking down the back to survey the damage. \"Wowsers lil guy, that's a lotta poopy you just made!\" She lifted Jack up into her arms, the baby grabbing the two 'toys' he had left on the table. The parents who had previously Awww'ed at his little diaper dance that shook the fresh feces into his diaperseat were now deathly quiet, scared. Surely they could trust Erin, couldn't they?<br>\r\n<br>\r\n\"ERIN!\" they shouted, however, at that time, Jack's hiney went active, producing a thick wet fart into his packed Pamper.<br>\r\n<br>\r\n\"Phew! Lil jacky still making poopies?\"<br>\r\n<br>\r\n\"Nuhhhh...\" Jack replied, before Erin lifted him back up.<br>\r\n<br>\r\n\"One poopy Jacky coming in for a landing!\" Erin smiled, laying Jack onto the changing table, the tot giggling at the little game she was playing with him. His parents clasped in his little fist, Jack laid out his arms and spread them, lifting his legs up to allow Erin some access to his diaper. Erin got out the neccesary supplies, and untaped Jack's diaper.<br>\r\n<br>\r\n\"Wow kid, you're worse than your brother\" Erin chuckled, Eric hadn't pooped yet... she'd have a heck of a job ahead of her if he didn't go in the potty.<br>\r\n<br>\r\nJack smiled, then shivered as the wipes cut away at his fresh 'creation.' \"I know buddy, they're cold... dear gawd you're so stinky!\" Erin gagged.<br>\r\n<br>\r\n\"Glad I'm not the only one who thinks that way\" Ed broke the silence with a little joke.<br>\r\n<br>\r\n\"Shush!\" Kathy whispered, trying to cut down the sound. From their prison they noticed Erin lift Jack's legs, sliding out the old poopy Pamper and sliding a new one into place.<br>\r\n<br>\r\n\"Darn it. Forgot the powder.\" Erin looked down at the diaper she had just rolled up, turning around to toss it into the pail and to get the powder. Jack however decided to use this time for something else.<br>\r\n<br>\r\nJack lifted up his fist, opening it up over his new diaper, one with his favorite cartoon character, Simba the lion, adorning its front. \"Diapa! Diapa!\" Jack chuckled.<br>\r\n<br>\r\n\"You got it little dude, that's a diaper!\" Erin giggled, grabbing the powder and moving back over to Jack's table. \"Okay little guy, ready for a blizzard?\"<br>\r\n<br>\r\nJack nodded a bit, and Erin opened up the powder container's nozzle...</span></div></div>",
            "created":1316494800,
            "id":1191456,
            "title":"Diaper change!"
        },
        "11112221":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "\"So, as for the many times I've gone unpaid...\"",
                "\"We need to get you help. Now.\""
            ],
            "content":"<div class=\"\"><div> <span>Erin was about to squeeze and shake the powder when she noticed two buglike things in Jack's new Pamper...<br>\r\n<br>\r\n\"Mister and miss Smith?\" She was surprised, dropping the powder onto the table. You- you- you're tiny?\"<br>\r\n<br>\r\nEd spoke up. \"Yes Erin- you saved us- thank you, thank you SO MUCH!\" Ed and Kathy were incredulous. \"You saved us.\"<br>\r\n<br>\r\nErin grinned. \"I guess I did, I couldn't imagine being wrapped up against a cute lil' kid's bottom like yours.\" She began to look around.<br>\r\n<br>\r\n\"Well...\"</span></div></div>",
            "created":1316581200,
            "id":1191674,
            "title":"Saved! Or not..."
        },
        "111122211":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "Heads. Parents are din-din.",
                "Tails. Parents get rolled up and tossed!"
            ],
            "content":"<div class=\"\"><div> <span>\"So. Now that I'm in a good position here... as for the many times I've gone unpaid...\" Erin grinned.<br>\r\n<br>\r\n\"Unpaid?\" Ed and Kathy looked at each other. They had been using Erin for a while now as their babysitter, they knew her parents, and despite them telling their daughter she didn't need payment for her services, she had been wanting payment.<br>\r\n<br>\r\n\"Your mom said she didn't want you paid\" Ed said.<br>\r\n<br>\r\n\"Really? Hmmf. Knew it. Well you could have done it anyway.\"<br>\r\n<br>\r\n\"We needed your mom's and dad's permission, Erin.\" Kathy replied. Erin just pouted, crossing her arms.<br>\r\n<br>\r\n\"Well now that you're behaving like that...\" her pout developed into a wolfish grin. She had something hidden in her mind...<br>\r\n<br>\r\n\"What are you grinning at?\"<br>\r\n<br>\r\n\"Oh nothing\" Erin smiled, placing the parents back on the changing table as she finished diapering up Jack, setting him loose. She took out a coin, and grinned again<br>\r\n\"Since I'm bigger, and can make the rules, I have a little game. Heads, I toss you into dinner. Tails, You spend tonight in the diaper pail.\"<br>\r\n<br>\r\n\"WHAT?\" Ed and Kathy replied, angry, but praying they got tails... at least smelling their diapers would be better than...<br>\r\n<br>\r\nErin flipped the coin.</span></div></div>",
            "created":1316581200,
            "id":1191678,
            "title":"Unpaid revenge."
        },
        "1111222111":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "Erin comes back. Food done!",
                "Climbing down the changing table we go!"
            ],
            "content":"<div class=\"\"><div> <span>\"Well would you look at that!\" Erin smiled. \"It's heads! Good thing the kids are having oatmeal tonight! Something so soft and silky for you to ride down into their tummies...\"<br>\r\n<br>\r\n\"No. Erin. No. I refuse.\"<br>\r\n<br>\r\n\"You can't refuse, little bugs.\" Erin chuckled, then sang and taunted. \"You're gonna be ba-by poo...\"<br>\r\n<br>\r\nKnowing they couldn't escape, they had to accept their fate as Erin moved into the kitchen to cook the kids' dinner.<br>\r\n<br>\r\n\"We need to do something- escape- now\"<br>\r\n<br>\r\n\"Kathy calm down\" Ed nodded. \"We'll have to run. I know.\"<br>\r\n<br>\r\nThe parents sat down, and using a marker and a Pamper nearby, they began to draw out their plans...</span></div></div>",
            "created":1316581200,
            "id":1191682,
            "title":"Lunchtime!"
        },
        "11112221111":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "Jack!",
                "Eric!"
            ],
            "content":"<div class=\"\"><div> <span>\"OOOOHHH BOYS!\" Erin smiled, placing the hot bowls of oatmeal on the dinner table in the family room. She walked into the living room, seeing the changing table.<br>\r\n<br>\r\n\"Aww, lil' bugs drawing on the big babies' diapers?\" She snickered. \"For shame... Poor Simba didn't deserve to be written on.\" She walked out of the room with the two parents in her clenched fist. She approached the table and started holding her fist over one of the bowls of oatmeal. \"Eenie, meany, miney, mo..\" she began to rhyme, moving her hand over each bowl.<br>\r\n<br>\r\n\"And you, are, not, it!\" She dropped the parents, screaming, into the soupy muck below. Their vision obscured by oatmeal, they couldn't notice who was sitting where. However, after the food reasonably cooled off, they scraped the muck off their faces, looking right into the smiling face of...</span></div></div>",
            "created":1316581200,
            "id":1191685,
            "title":"Erin comes back. Food done!"
        },
        "111122211112":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "Movement. Uh oh!"
            ],
            "content":"<div class=\"\"><div> <span>\"Eric...\" Ed looked up, scared. His son was dressed in his usual lounging attire, a shirt with characters from The Lion King, his absolute favorite movie, as well as his Lion King sweatpants, deep below that was his Lion King adorned Pamper. The kid was obsessed, he even had a plush lion he named \"Mufasa\" that he never slept without. Ed and Kathy had even played with him when he imagined he was a lion, roaring and hunting with members of the family. Little Eric was obsessed with lions.<br>\r\n<br>\r\nA scary thought. Eric would clear his bowl.<br>\r\n<br>\r\n\"Eat up, my little lion\" Erin noogied Eric's head, the young boy letting out a hearty \"RAWR!\" as he took a spoon and dug in, scooping masses of oatmeal up into the air and into his mouth, where it was slowly mushed before it went down into his gullet. Right where Erin wanted the two to go.<br>\r\n<br>\r\n\"See ya when you're a pile of Eric's shit...\" Erin pouted and smiled. The five-year-old's spoon began to lift up near Ed's position...<br>\r\n<br>\r\nAnd began to lift Kathy up into the sky to her doom.<br>\r\n<br>\r\n\"ED!\" She extended an arm, Ed gripped her arm, however he was also lifted high up into the air, headed toward their son's gleaming white chompers.<br>\r\n<br>\r\n\"RAWR!\" Eric grinned. \"Time ta be lion food!\" he dumped the spoonful into his mouth and began chewing, all the while moving his parents toward the chasm at the back of his throat...<br>\r\n<br>\r\n\"No Eric- no, NO!\" Ed and Kathy began to shout, to no effect however.<br>\r\n<br>\r\n\"RAWR! INTO MY TUMMY!\" They could hear Eric's voice getting louder... all of a sudden they felt the sensation of being lifted, then tossed- right into the deep dark chasm of Eric's throat, being squeezed by his esophagus until they ended up in the dark bag of muscle known as Eric's stomach. The place was becoming packed with oatmeal, old and newly arriving. Soon the mechanisms of nature would be tripped...</span></div></div>",
            "created":1316581200,
            "id":1191689,
            "title":"A Lion's Meal..."
        },
        "1111222111121":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "content":"<div class=\"\"><div> <span>Ed took a step, sloshing through the muck. Kathy however looked and shouted at Ed.<br>\r\n<br>\r\n\"Hon! Don't move- if you do, his stomach...\" They could hear sounds, Eric's heartbeat, then a deep rumbling.<br>\r\n<br>\r\n\"That's not gas, is it?\" Ed gulped, gagging on the gas within their son's belly.<br>\r\n<br>\r\n\"It is. It's what happens when he swallows air, or wolfs down food too fast.\"<br>\r\n<br>\r\nTheir surroundings shook.<br>\r\n<br>\r\n\"That wasn't gas.\" Ed became worried. In a corner of the pit they were in, the oatmeal began floating up as a liquid began seeping into Eric's tummy. When it made contact with Ed's shoes, they began to melt away.<br>\r\n<br>\r\n\"ACID! HELP!\" Ed shouted, Kathy began shouting.<br>\r\n<br>\r\n\"ERIN! HELP US! WE'RE GONNA BE DIGESTED!\"<br>\r\n<br>\r\nMuch to their dislike, Erin was outside, collecting the bowls, she noticed Eric's one empty. With a smile, she walked over to him.<br>\r\n<br>\r\n\"Heya my big fierce lion!\" She patted his belly. \"How's that food doing?\"<br>\r\n<br>\r\n\"It's in my tummy Erin!\" Eric replied, each pat making Ed and Kathy lose their footing... should they lose it...<br>\r\n<br>\r\nAnother strong pat later, Both parents were on their sides, completely being bathed in the acids of their son's stomach. Screams of theirs were silenced by Eric's mighty lion roar impersonations.<br>\r\n<br>\r\n\"And what's gonna happen to the oatmeal inside my big fierce lion?\"<br>\r\n<br>\r\n\"Dunnos...\" Eric replied.<br>\r\n<br>\r\n\"It's gonna turn into ewwies!\" Erin smiled, rubbing his belly and putting her ear to it. No screams... the parents had already begun a sleep they would never awake from, deep in the depths of Eric's mighty five year old stomach. A few minutes later, the kid plopped down in front of a TV, playing video games on his new console that his parents had given him as a gift. Deep within him though, the parents were disintegrating into soup, nutrients bound for different parts of Eric's body, his growing legs, his brain, and even some 'baby fat'. This is what presented the chyme as it worked its way through the mighty 'Lion's\" digestive tract. Eventually, a few hours later, Eric did indeed feel something.<br>\r\n<br>\r\nWithin him, a sphincter opened, spilling excess soup into his colon, where it would be dried out, pushed, and packed into his rectum for later disposal. A fearsome lion's meal ended only naturally, as a fearsome lion's dung. Another hour later, Erin noticed Eric fall into a position where his legs were staggered. By now, Ed and Kathy were nothing but greenish-brown remenants of their former selves. \"Poopified\" in Jack's terminology.<br>\r\n<br>\r\nWith a smile, Eric began to squat, his young bowels automatically releasing the load into his Pamper's seat. Erin was prepared.<br>\r\n<br>\r\n\"Is my little lion making some dung?\"<br>\r\n<br>\r\n\"Uh huh-\" Eric quickly replied, grunting as he passed another log, this one containing the bones of his former parents, now reduced to poo, into the seat of his Pamper.<br>\r\n<br>\r\n\"PHEW! I didn't know lions were big stinkers.\" She looked down the back, noticing a log sitting in his diaper pockmarked with white 'flecks.'<br>\r\n<br>\r\n\"I did know they were big poopers.\"<br>\r\n<br>\r\nAnd so began the parents' new lives. After Eric was wiped up, the wipes were laid in the diaper, as Erin unceremoniously rolled up the diaper and tossed it in the pail.<br>\r\n<br>\r\nA few days later, when the parents didn't show up for work, the police were called. As the CSI team navigated through the house, no one bothered to check the diaper pail. When Erin moved the bag inside to the outside trash, they didn't bother. Not even when the garbage man came, emptying the diapers and the parents' remains into the back to be crushed.<br>\r\n<br>\r\nEventually, the diapers ended up on a conveyer belt, headed to the county's incinerator. At the end of the day, what was once \"Eric the lion's\" pile of dung was now particles of dust spread through the air... no part of them ever identifiable.<br>\r\n<br>\r\nNot bad for being a piece of Eric dung!</span></div></div>",
            "created":1316581200,
            "id":1191696,
            "title":"A Lion's Dung"
        },
        "1111222112":{
            "author_id":"mysteriousboy",
            "author_name":"DeeDev",
            "choices":[
                "Messy diaper",
                "Wet diaper"
            ],
            "content":"<div class=\"\"><div> <span>They got lucky as they got tails. \"Well, it looks like dirty pail time,\" Erin said with a smirk. Ed and Kathy were relief about it, as they prefer spending a night in the stinky pail then being eaten.<br>\r\n<br>\r\n\"Now, lets see. Either wet or messy diaper,\" Erin said as she grinned.<br>\r\n<br>\r\n\"How about letting us go?\" Kathy suggested, but Eric couldn't hear her.<br>\r\n<br>\r\n\"I know! I would put in you into....\"</span></div></div>",
            "created":1370840400,
            "id":1608502,
            "title":"Tails. Parents get rolled up and tossed!"
        },
        "11112222":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "Baby Jack goes exploring...",
                "Jack looses a mighty 'lion fart'"
            ],
            "content":"<div class=\"\"><div> <span>And let loose, the powder sprayed out, covering the parents in it, blending them in completely with the absorbent polymer of Jack's Pamper.<br>\r\n<br>\r\n\"RAWR!\" Erin giggled, obviously playing the role of Simba the lion, the cartoon character that adorned Jack's diaper. \"I'm goin' onna baby's butt!\"<br>\r\n<br>\r\n\"Ahh! Wion!\" Jack giggled, kicking his legs happily.<br>\r\n<br>\r\n\"Hey, at least he's cute!\" Erin broke character, then went back to the voice of Simba \"Yup, I agree!\" Ed and Kathy had to giggle, then snapped back to reality. Simba was their prison, and knowing Jack, where he had pooped before, this time his breakfast, it was only a while until lunch worked its way through his system and slid out of his bottom.<br>\r\n<br>\r\n\"RAWR!\" Erin taped up the diaper, leaving the parents in darkness. The parents heard a pat from above as Erin patted the baby's front and smiled, rubbing it a bit and then picking up Jack, going off to search for Eric. She went outside- setting Jack in the grass, leaving the baby to his own devices. All the while, his parents were at his mercy, and could notice the smiling lion imprinted above them, reminding them that they were in their son's diaper now, at his mercy.</span></div></div>",
            "created":1316581200,
            "id":1191665,
            "title":"Simba: the crinkly prison"
        },
        "1112":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "Into the diaper you go!",
                "Time to be eaten!"
            ],
            "content":"<div class=\"\"><div> <span>Kathy caught sight of the kid reaching toward her like she was a popular toy. She screamed, but Jack was called out of the room for a second and left.<br>\r\n<br>\r\n\"What's wrong? Jack doesn't eat bugs\"<br>\r\n<br>\r\n\"Yes he does! Look in his diaper the next time you change him, you can see little ants in it!\"<br>\r\n<br>\r\nJack thundered back into the room- Eager to wonder what these new bugs tasted like, and if they liked seeing the inside of a diaper. The fate of the couple now rested in the hands of a 2 year old. Either they would meet his stomach, or have the possibility of meeting his meals from yesterday...</span></div></div>",
            "created":1197349200,
            "id":474269,
            "title":"Author of story's choice"
        },
        "11121":{
            "choices":[
                "He needs a diaper change",
                "He Plays around"
            ],
            "content":"<div class=\"\"><div> <span>Jack bring both of them up to his little face smiling at Ed and Kathy. They couldn't help but smile. He was there baby and he was about to shun them into his diaper prison. He lifted up the elastic and let them both drop in there screaming. They fit into the side of the diaper right next to his front or back.<br>\r\n<br>\r\n\"Now what do we do, were stuck!\" Cried Ed<br>\r\n<br>\r\n\"All we can do is wiat and hope he doesn't need a diaper change soon. </span></div></div>",
            "created":1197608400,
            "id":475636,
            "title":"Into the diaper you go!"
        },
        "111211":{
            "choices":[
                "diaper change by Erin",
                "diaper change by Eric"
            ],
            "content":"<div class=\"\"><div> <span>Kathy had a feeling that it was going to come. Being the one who is usually in charge of his changing it was bound to happen at this time.  A large fart was released from Jack making them moan and feel sick to their stomach. \"Dear god that's awful!\" cried Ed.<br>\r\n<br>\r\n\" He's only getting stated.\" Kathy said as a yellow liquid filled the diaper. Soon they were partly submerge in very thick pee and were experiencing the worst feeling in there life. After soaking in the pee and excramint, the second wave came in. The brown menece cover them mushing into there faces and causing Kathy to pass out. Ed was soon to follow. When they came to Jack was being changed by</span></div></div>",
            "created":1198213200,
            "id":477908,
            "title":"He needs a diaper change"
        },
        "1112111":{
            "choices":[
                "She takes em back to the ray",
                "She has another idea"
            ],
            "content":"<div class=\"\"><div> <span>A bright light showed through the diaper and stench to revile the young face of Erin. She was staring straight at Ed and Kathy but did not see them  due to there disguise. Ed and Kathy started yelling at Erin to get her attention  but they were smothered by toliet paper.<br>\r\n<br>\r\n\"Wow you made a bad one Jack. Eric don't play with that!\"<br>\r\n<br>\r\nShe cleaned up the rest of the poop with you in it and was about to throw the diaper and them away. You finally decided to start jumping around to get her attention. She bent over to look at the poop to see what was in it. With her fingers she lifted you up to her face.<br>\r\n<br>\r\n\"Jack are these bugs?\"<br>\r\n<br>\r\nShe brought them under the sink and rising them down. She brought them up to her face again. She jump up and threw them up in the air with only enough time to bearly save them.<br>\r\n<br>\r\n\"Mr and Mrs Smith what happen to you?!\"<br>\r\n<br>\r\n\"My shrink ray I've been working on.\"<br>\r\n<br>\r\n\"Shrin ray?\"<br>\r\n<br>\r\n\"I'm  scientist and I work on that kind of stuff. Just take us to the shrink ray and I can have it so we can change back.\"</span></div></div>",
            "created":1199509200,
            "id":483687,
            "title":"diaper change by Erin"
        },
        "11121111":{
            "choices":[
                "Eric on the control panel of the ray pressing buttons ",
                "Jack run in slamming into the equipment"
            ],
            "content":"<div class=\"\"><div> <span>She comes into the laboratory where the trouble started. Ed explans what she needs to do in order to bring us back to size. She works with the controles on the ray and configures it. <br>\r\n<br>\r\n\" Ok now place us on the marking spot.\" She followed the directions and place them on the spot.<br>\r\n<br>\r\n\"Finally adjust the ray and just fire. I can't wait till we get back to size.\" Erin turns around and sees.</span></div></div>",
            "created":1203829200,
            "id":502258,
            "title":"She takes em back to the ray"
        },
        "111211111":{
            "choices":[
                "He shrinks Erin",
                "Ray grows Jack"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"No Eric don't play with that!\" Eric finally hits the shooting button.</span></div></span></div>",
            "created":1203829200,
            "id":502265,
            "title":"Eric on the control panel of the ray pressing b..."
        },
        "1112111112":{
            "choices":[
                "Erin gets Jack shrunk while she changes him",
                "Eric gets out and enlarges himself and Jack to 100ft."
            ],
            "content":"<div class=\"\"><div> <span>All of a sudden a beam hit Jack who had just crawled into the room causing him to grow 10 ft. \"Awesome,\" yelled Eric who ran toward the confused but happy Jack.  He ran straight between Jack's legs and climbed up his diaper to start talking to Jack.\"Wow how did you do that? what does it feel like?\" Of course Eric was oblivious to the shrink/growth ray. Jack just looked down and answered as best as his 2 yr. old vocabulary allowed,\"I don know. Hop in my diapa though and i can give you a wide.\"<br>\r\n\"Awesome\"<br>\r\nEric climbed straight into Jack's diaper into the front and and used Jack's \"Guy part\" as a seat. Jack started crawling through the house, but then all of a sudden he says,\" Oopsie gotta go potty.\" He pees soaking Eric completely.<br>\r\n</span></div></div>",
            "created":1220072400,
            "id":576135,
            "title":"Ray grows Jack"
        },
        "11121111121":{
            "choices":[
                "Jack stops shrinking at Erin's height",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Erin gets behind the ray and shrinks Jack. But there is one problem...</span></div></span></div>",
            "created":1337490000,
            "id":1341421,
            "title":"Erin gets Jack shrunk while she changes him"
        },
        "11121111122":{
            "choices":[
                "He had another feeling, complete opposite of the last one, he was shrinking!",
                "He was growing again! (his diaper does eventually stretch to size)"
            ],
            "content":"<div class=\"\"><div> <span>(not included in the last chapter, Erin changed Jacks diaper with the coincidentally bought super-stretch diapers in the diaper bag his family had out for the baby sitter in Jack's room)<br>\r\n<br>\r\nAfter growing to 100 feet, Eric looks over the town. Erin quickly thinks and plans to shrink them both back down to normal size. She aimed the ray at Eric (being sure to make it shrink) and he is reduced to about his normal size, give or take a couple inches. After she prepares the gun for another shot, it causes a surge at the wall outlet, destroying the parts of the machine--it was useless, and Jack was still 100 feet tall! Erin tries to shoot the laser at Jack, ignoring the smoke, it sends out one last zap, but it has enough energy to cause Jack to GROW to 200 feet.<br>\r\n<br>\r\nJack looks down on all of the houses in the areas, and picks Erin and Eric up and puts them in his diaper. Jack was just changed recently so he doesn't need to go for a while. Jack hears the horns honking in the city, his curiosity peaks, and he \"waddles\" over the \"short\" distance of 2 miles. (about the length of his house when he was small) He tripped over an empty semi trailer, after lying on his stomach for about 10 minutes he decides to crawl over to the city. Picking up the cars and shaking the people out of them, then puts them in his diaper with the rest of the family and Erin as he goes. After making it to the city, Jack looks at the 20 story buildings, since the regulation height for a floor in the city was 9 feet, the buildings were still 10 feet lower than him. He easily crawled over several buildings to get to his center of attention: A two story day care center. It was Monday so parents were eager to drop off their kids and get to work to finally have them out of their hair.<br>\r\n<br>\r\nJack Lies on his stomach as low as he can (with his head tilted up to see inside of the building) and all the kids (from 1 year-3 year olds) immediately grin when they look out the window at his soft face. Jack reached into the building (easily breaking most of the windows from his 5-foot wide pudgy fingers. After reaching in he grabbed all of the children in it and shoved them into his diaper along with the other poor souls. As Jack gets up he wants to play with the buildings. After trying to pick one up, he realizes he can't. And as if on cue, there was a side affect to the ray he received from the surge in his house, causing him to reach 500 feet. Only allowing him to pick up small business offices and one-story houses. When he looks down he sees, what seems like a toy tank to him, a high-powered military tank with 5 foot thick steel walls (they came prepared!) and 12\" (inch [1 foot]) wide bullet shells with tranquilizer darts in them. When they fired the first shot, Jack jumped to the ground being very interested with this tank, the rumble made the pilot enter the wrong coordinate and fire just between his legs, into a fire truck happening to be rolling his way. (the fire truck will have nothing to do with the story.... unless someone else wants it to be)<br>\r\n<br>\r\nThe second fire is a direct hit, and just as Jack loses interest, the dart hits him really close to his heart, so the tranquilizer spreads instantly through his body, causing him to fall onto the tank, the 5-foot steel walls (sounds pretty sturdy though) actually weren't meant to withstand 600 tons of 2-year old, causing the tank to be crushed (poor people, might have been better off in his diaper). Upon waking up, Jack was lying on his back in a net being carried by 90 Tandem Rotor helicopters (here is an image url to give you a better picture of what this kind of helicopter is: <a rel=\"nofollow\" href=\"http://www.enemyforces.com/helicopters/ch47_chinook.jpg\" target=\"_blank\">http://www.enemyforces.com/helicopters/c...</a>) with a net which, to Jack, looked like rope, but was actually millions of chain-links which were about 2 feet wide, and said to hold 5 tons each. All the people that were in his diaper were now on his belly waiting for air rescue before the helicopters started the move. Most of the people were sitting down to regain their balance from the dizzying journey in his diaper. The children were not rattled (confused/nauseated, as in no sense of direction) at all since they were in there for about the time he fell over, not much motion. Most of the people notice he's awake since he's starting to breathe more heavily. They all soon start to notice since they were being shoveled back into his diaper by his, now 2 story-wide arm. Even though the helicopters are ready to move, Jack did sleep for about 10 hours before they actually got him off the ground.<br>\r\n<br>\r\nGetting the chains around him was no easy task. They had to burrow under the street and thread the chain through there. Some parts of Jack squished into the holes, so they had to dig deeper. Jack was about 10 feet off the ground. Traffic (not a wise choice anyway) was beginning to flow underneath him after the police decided to open up the road. There was so much traffic under him since everyone wanted to see this \"giant baby\" which was told to them by their friends. There was a crowd about as much as an average Super Bowl game standing on the entire block. Jack had another one of those feelings by now, he was growing, and he was growing fast. Soon the chain links broke from the force of the growing baby, causing him to fall. He put his hands and feet down, amazingly killing absolutely 0 people (I don't like the blood and gore, if you do put it on the next chapter).<br>\r\n<br>\r\nJack's diaper lost it's expandable-ness and was barley making it around his 2-block-wide, baby-smooth belly. Jack was now 1000 feet tall (about as tall as the empire state building) The people in his diaper noticed the diaper wasn't expanding so they had less room... down there. They were getting pretty used to being forced to be in a diaper. That is until he directed his attention on the mass crowd of people who were starting to flee for their lives... (or their, free-from-being-in-a-diaper-life). The people closest to him weren't exactly his first target. He smashed about 5 buildings and placed them around the edge of the crowd, keeping them confined. At once he took out the helicopters that were circling above him. (heh... gently setting them down on near-by buildings) Jack started loading his diaper full of the people in the crowd. As he sifted through the crowd, he stopped at one person, and asked that person if he likes him (the last him is Jack) in his 2-year-old vocabulary... \"You like Jack?\" The person replied with a simple nod, being terrified by being in his hand which was longer and wider than his own house. After getting his reply, he put that person on his shoulder and continued putting the rest of the people in his diaper.<br>\r\n<br>\r\nHe stopped... but why?<br>\r\n<br>\r\n(really sorry about the length if you don't like to read)</span></div></div>",
            "created":1221973200,
            "id":585095,
            "title":"Ahh, not a cloud in the... Jack?"
        },
        "111211111221":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Play time",
                "Squish time"
            ],
            "content":"<div class=\"\"><div> <span>Jack had 100 people already in his diaper. He reached to grab more, but he felt a strange feeling throughout his body. He put his hands on his stomach. He started to shrink. The people on the ground were happy that the giant toddler was shrinking. His clothes were shrinking with him, but the people inside his diaper stayed the same size. They could tell that he was shrinking because they could see that they had more space than before. As he shrunk past 500 feet the space started to shrink again. The captives were thinking that soon the diaper was going to rip. Then he stopped shrinking at 200 feet tall. Everybody, both inside and outside his diaper, started to panic again<br>\r\n.<br>\r\nJack smiled at the toys in the street. This caused the citizens to start screaming. They looked around for an escape route. Every route they had was blocked by rubble, but then they noticed one escape route. That route would take them right between Jacks giant legs and beneath his diaper.. The citizens looked up at him and hoped that they would be let go. Unfortunately, that was not what Jack had in mind. He felt that he already had enough people trapped in his diaper. Then another idea came into his young mind. He giggled at the little bugs and shouted out, “Twoys go squish”.<br>\r\n<br>\r\nEveryone below screamed and, taking a chance, started running towards him. Jack just slammed his diapered butt into the pavement. Crunching and cracking sounds could be heard as Jack’s weight crushed several people and caused the ground to crack. Jack giggled as he felt the ground crack and blood stain his diaper. Several of the people did escape, but Jack didn’t care. Somehow all the people on the inside survived. Jack wanted to do it again. He stood up again and the people seized the opportunity and started running. Jack shouted out, Buggies meet my diapa”. He sat down again crushing several more people, but a couple more people escaped. Now Jack had about another 20 terrified people right in front of his blood stained diaper.<br>\r\n<br>\r\nNow his stomach growled, and the little toys screamed. Jack smiled and picked them all up in his hands. He lifted them up to his face and said, “Tummy wants you”. He stuffed all 20 screaming people into his mouth. He titled his head back and swallowed them whole with a loud gulp. The other terrified people in the city looked up and watched as a 20 people became a bulge in a toddlers’ throat. Jack felt the little people land in his stomach and desperately banging on the walls. He was giggling at the tingling sensation of their squirming. After a couple minutes, the people were mush. Jack yelled out, “Buggies was dewicious”. He was still hungry. He pulled out the waistband of his diaper and looked at the people inside. He reached down and grabbed another 20 people. He held the waistband open and the other captives watched them get devoured. They were screaming, and trapped. They all ended up eaten by the giant toddler. He smiled and patted his belly.<br>\r\n<br>\r\nWhen all the people were turned to mush, Jack smiled. He looked around at his toy city. He stood up and started walking down the street. He saw an untouched building that reached his crotch. He smiled and turned around. He patted his diaper and sat down on the building. It started to buckle and crack. Then it collapsed into rubble. Jack fell with the building. When the dust settled, he was sitting amongst the rubble smiling. He yelled out “building go boom”. He saw another building that reached halfway up his torso when sitting down. He grabbed 10 nearby people and walked over to the building. He ripped off the roof and deposited the ‘toys’ inside. He smiled at the little people.<br>\r\n<br>\r\nWhat does he do now?<br>\r\n</span></div></div>",
            "created":1437703320,
            "id":2011647,
            "title":"Jack Shrinks"
        },
        "111211111222":{
            "choices":[
                "Jack shrinks, it was full of a cure",
                "Jack dies, it was a normal missle"
            ],
            "content":"<div class=\"\"><div> <span>Jack grew to 1000 ft!.<br>\r\nIt was all seeming hopeless when suddenly, a giant taco came flying through the sky, the taco flew into jacks mouth.<br>\r\nJack seemed intrigued, this taco was actually a missle disguised as a Taco<br>\r\nEveryone prepares for the worst</span></div></div>",
            "created":1297400400,
            "id":1052315,
            "title":"He was growing again! (his diaper does eventual..."
        },
        "1112111112221":{
            "choices":[
                "Squish, squish squish!",
                "He crushes nobody."
            ],
            "content":"<div class=\"\"><div> <span>The people who hadn't been stuffed into the enormous diaper watched in awe as the \"missile\" was swallowed whole by the big boy. The quickly flee but stop when they notice the boy is shrinking down! All of the people suddenly begin to cheer as it is over and this boy's reign of terror will surely end.<br>\r\n<br>\r\nNot.<br>\r\n<br>\r\nJack only shrunk down to 750 feet; the people are in despair as they realize their fate may still be upon them. They continue to flee away from the boy, who is angry now at the arrogance of the little people.<br>\r\n<br>\r\nHe starts stomping down the street, very violently...</span></div></div>",
            "created":1396572360,
            "id":1773054,
            "title":"Jack shrinks, it was full of a cure."
        },
        "11121111122212":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Giant Jack's tantrum ",
                "delayed reaction! Jack shrinks some more",
                "so much for a cure! Jack's Growth spurts return!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He starts stomping down the street, very violently. Shockingly he crushes no one yet.<br>\r\n<br>\r\n<br>\r\nJack's current objective is causing damage and throwing a tantrum.<br>\r\n<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1429777380,
            "id":1968177,
            "title":"He crushes nobody."
        },
        "1112111112222":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Jack dies, it was a normal missle",
                "Jack has another last moment growth spurt and survived the missile unharmed",
                "Jack Survives! The missile was defective "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do we really want him to die? He is a child after all giant or not</span></div></span></div>",
            "created":1429775940,
            "id":1968175,
            "title":"Jack dies, it was a normal missle"
        },
        "11121112":{
            "choices":[
                "She says\"Jack do you want to eat?\"",
                "She says \"Jack do you want to play?\""
            ],
            "content":"<div class=\"\"><div> <span>Erin got a great big smile on her face as we were in her hand. She walks back over to jack on the changing table.<br>\r\n<br>\r\n\"Erin, Erin what are you doing?\" She gets a clean diaper from the diaper bag and places it  on Jack. She finishes powdering him in complete quietness. \"Why is she finishing this?\" She finish and chucks both of them back into the diaper. They hit the white powdery butt and couch from the white evil and Erin closes the diaper till there was no escape.</span></div></div>",
            "created":1203829200,
            "id":502255,
            "title":"She has another idea"
        },
        "111211121":{
            "choices":[
                "calls eric",
                "tells jack to belch and fart the air out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you tell jack to swallow them he swallows them erin feels them in his throat erin knew jack had to belch the air out of his stomach to digest them fully but how did she get him to do it?</span></div></span></div>",
            "created":1364878800,
            "id":1562895,
            "title":"She says\"Jack do you want to eat?\""
        },
        "111211122":{
            "choices":[
                "Jack pees in his diaper.",
                "Jack keeps humping the pillow"
            ],
            "content":"<div class=\"\"><div> <span>\"Yay,\" Jack yelled, \"Wha awe we pwaying.\" <br>\r\n\"We are going to play a new game,\"said Erin as Jack squealed with joy.  She grabbed two pillow and tossed Jack one and he was so excited he started bouncing with joy, his butt squishing his parents every time he bounced.  \"I don't like where this is going,\" said Kathy who was squashed up against Jack's dick by now.\" \"Neither do I,\" agreed Ed,\" that damn babysitter sucks.\"<br>\r\n\"OK Jack, the game we are going to play is called follow the leader where you follow what I do,\" said Erin.  She curled around the pillow in a ball and Jack followed as best he could giggling the whole time and smiling.  Erin then began humping her pillow which in turn started Jack doing it. Inside the diaper, Jack's dick was ramming up against Kathy and Ed beating them around and bruising them.  \"I never thought our 2 year old son would be humping us in his diaper,\" yelled Kathy as Ed agreed with him.  Soon, Erin stopped and</span></div></div>",
            "created":1211086800,
            "id":533465,
            "title":"Follow the leader"
        },
        "1112111221":{
            "choices":[
                "Sees what the two of you are",
                "Uses you to play with Jack after his diaper change"
            ],
            "content":"<div class=\"\"><div> <span>All of a sudden, while resting from your beatings on Jack's dick, he lets loose straight onto you gagging you guys.<br>\r\n\"Ewin I made an oopsie,\" said Jack<br>\r\n\"It's okay here I'll change you,\"<br>\r\nErin picked Jack up and you sat soiled in the bottom of his diaper.  Erin took off Jack's diaper and grabbed you two.<br>\r\n\"First I think I will keep you two miserable though,\" she stated,\"Eric come here\"<br>\r\nEric came and Erin dropped Ed and you into his underwear.<br>\r\n\"That's all Eric, go ahead and keep playing.\"<br>\r\nThen Eric</span></div></div>",
            "created":1219899600,
            "id":575619,
            "title":"Jack pees in his diaper."
        },
        "1112112":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "You're doomed!",
                "You're saved!"
            ],
            "content":"<div class=\"\"><div> <span>Ed got up, covered in what used to be Jack's lunch. \"Eric!\" Can you see us!?\"<br>\r\n<br>\r\n\"Cool, Jack I can't believe you filled your diaper, okay, I'll get a new one\"<br>\r\n<br>\r\nBut as Eric was taking off the diaper, he noticed the two parents in there...<br>\r\n<br>\r\n\"Bugs! Jack! you pooped out bugs!\"<br>\r\n<br>\r\nApperantly Kathy just now recognised that this would end horribly.<br>\r\n<br>\r\nSome time later, they were thrown into a bag, and crashed into...<br>\r\n<br>\r\nCoughing, Kathy recognised \"Oh my god! We're in the garbage!\"<br>\r\n<br>\r\n\"And, Oh my god, it's garbage day!\"<br>\r\n<br>\r\nEric handed the bag to the nice and friendly trash man.<br>\r\n<br>\r\n\"OH MY GOD!\" Kathy went crazy </span></div></div>",
            "created":1198386000,
            "id":478700,
            "title":"diaper change by Eric"
        },
        "11121121":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "content":"<div class=\"\"><div> <span>Kathy was right, the trash man stared the compactor. slowly squishing diapers, old food, and plastic together.<br>\r\n<br>\r\n\"NO! NO!\" Kathy screamed as she was pushed into the diaper.<br>\r\n<br>\r\nNow the parents are with jack's smelly excrement. stuck in it forever!<br>\r\n<br>\r\nSome time later, they are reincarnated, into flies!<br>\r\n<br>\r\nThey fly into a room, only to be grasped by a tiny hand, and eaten.<br>\r\n<br>\r\nThey came out the next day, another batch of fresh, smelly poop. it would seem ironic that they were eaten by Jack's son!<br>\r\n<br>\r\nNow the parents are stuck inside, and with, the toddler excrement FOREVER!</span></div></div>",
            "created":1198386000,
            "id":478704,
            "title":"You're doomed!"
        },
        "111212":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "Jack eats"
            ],
            "content":"<div class=\"\"><div> <span>Jack ran around the house, causing the duo in his diaper to bounce around, and around. Judging by what Jack did, he ran around, and caused quite a little mess.<br>\r\n<br>\r\nErin came around the corner. \"Jack? Wow, you made a mess\"<br>\r\n<br>\r\nErin helped jack pick up the mess.<br>\r\n<br>\r\n\"Are you hungry?\" Erin asked.<br>\r\n<br>\r\n\"Yes\" Jack said<br>\r\n<br>\r\n\"Alright, I'll get you some food\" Erin siad, bounding into the kitchen.<br>\r\n<br>\r\nEd and Kathy knew that they would be meeting Jack's butt very soon...</span></div></div>",
            "created":1209272400,
            "id":524919,
            "title":"He Plays around"
        },
        "1112121":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "Gastro-Colic Reflex, Ed was Wrong!",
                "Jack continues to eat..."
            ],
            "content":"<div class=\"\"><div> <span>Jack immediatly bounded into the dining room, bouncing around Ed and Kathy unknowingly.<br>\r\n<br>\r\n\"Let's hope he doesn't sit down!\" Kathy said.<br>\r\n<br>\r\nToo late, the crackle of Jack's diaper indicated that they were going to meet with their son's butt.<br>\r\n<br>\r\nJack's titanic butt came crashing down on them, the baby fat cushoning the impact for Ed and Kathy.<br>\r\n<br>\r\nImmedatley, Jack started to eat pieces of a burger, cut up of course.<br>\r\n<br>\r\n\"Well, this is gross!\" Kathy said. \"We're trapped under Jack's butt!\"<br>\r\n<br>\r\n\"Hey, at least we aren't covered in one of his infamous poops!\" Ed said in response<br>\r\n<br>\r\n</span></div></div>",
            "created":1209704400,
            "id":527337,
            "title":"Jack eats"
        },
        "11121211":{
            "author_id":"joshe2810",
            "author_name":"Josh Edwards",
            "choices":[
                "Does Kathy take him out the highchair and let him play",
                "Or change him quickly"
            ],
            "content":"<div class=\"\"><div> <span>Jack keeps eating and burps when he was done<br>\r\n<br>\r\n\"More\" said Jack as his banged the table on his highchair<br>\r\n<br>\r\n\"Wow\" said Erin \"You ate that quickly. Here you go\" Erin put some more cut up burger on his plate and some fries. He ate really quickly. When he finished he burped again and his stomach rumbled. He had too many to quickly.<br>\r\n<br>\r\n\"Oh no!\" said Kathy. \"I know what's to come\"<br>\r\n<br>\r\nJack lifted himself up to give his butt some room. Kathy and Ed tried to take the chance but did not prevail. Jack started to poop and judging by how much he ate, he was gonna be a while. The brown mess exited his butt and landed softly in his diaper. He carried on pooping for about ten minutes, with Kathy and Ed at the bottom of his bottom.<br>\r\n<br>\r\nWhen Jack finished, he let out a sigh of relief after pooping for so long and sat back into his chair, squishing all his poop against his skin. And Kathy and Ed<br>\r\n<br>\r\n\"Phew!\" Kathy said, holding her nose \" You really pooped your diaper. Jack blushed at her.</span></div></div>",
            "created":1281330000,
            "id":933106,
            "title":"Uh Oh!"
        },
        "11122":{
            "choices":[
                "Accept your fate",
                "Get away!"
            ],
            "content":"<div class=\"\"><div> <span>Jack like a boy in a candy shop decieds to try his father first. He separates him from hs wife. Jack places Eric in his mouth and starts sucking. The slimy drowl covers Eric as tiny baby teeth start nawing on his back. <br>\r\n<br>\r\n\"No baby don't do this to daddy! It's me Mommy!!!\"<br>\r\n<br>\r\nBut Jack would pay attention he had his delicious treat. He finally heard his conformation coo and swallowed Eric down his through with a gulp.<br>\r\n<br>\r\nHe licked his fingers and brought me to his face. </span></div></div>",
            "created":1197349200,
            "id":474429,
            "title":"Time to be eaten!"
        },
        "111221":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "dissolve in detail"
            ],
            "content":"<div class=\"\"><div> <span>I decide to wait and see where this goes, as he opens his mouth. \"bye-bye!\" Jack drops me, and I grab on to his tooth. Jack moves his tongue to knock me flat on my back. He swallows me down.<br>\r\n<br>\r\nA short while later I land in the stomach with Eric.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1264222800,
            "id":824412,
            "title":"Accept your fate"
        },
        "112":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "\"Flush you down the potty!\"",
                "\"Eat you!\"",
                "\"Feed you to Jack!\""
            ],
            "content":"<div class=\"\"><div> <span>Eric opened the door, and walked into the room. he looked down at his small parents, who were cowering in fear at their giant son. \"Bugs!\" he said, running out of the room and coming back into the room with-<br>\r\n<br>\r\nToilet paper?<br>\r\n<br>\r\n\"Oh no, what's he going to do to us?\" Kathy looked on in horror.<br>\r\n<br>\r\nEric bent down. \"Little buggies belong in the potty or my brother's diaper, or me!\"<br>\r\n<br>\r\nEd looked on, in stunned suspense he said to Kathy \"Our son eats bugs?\"<br>\r\n<br>\r\n\"Both of them!\" says Kathy<br>\r\n<br>\r\n\"Oh god, then what is he going to do to us?\"<br>\r\n<br>\r\nEric said, \"I'm gonna-\"</span></div></div>",
            "created":1197781200,
            "id":476300,
            "title":"It's Eric!"
        },
        "1121":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "Ed loses the raft!",
                "Ed maintains the raft"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm gonna flush you down the potty!\" Eric says, and scoops you up in the little square of toilet paper.<br>\r\n<br>\r\nKathy freaks out \"No! Honey! we're your mom and dad!\"<br>\r\n<br>\r\nEric suddenly stops and holds them down to his butt, and farts, the sound is muffled by his pants.<br>\r\n<br>\r\n\"Oops, looks like you guys are gonna see my poop!\"<br>\r\n<br>\r\n\"NOO!!\" Kathy freaks out, and Ed pulls out a small tube<br>\r\n<br>\r\n\"This is an inflatable raft, it'll work when it hits the water.\"<br>\r\n<br>\r\nIt was time, and Eric arrived at his destination, his little behind wiggling behind him.<br>\r\n<br>\r\n\"Okay buggies, time to go in the potty!\" he tossed the toilet paper into the toilet bowl...</span></div></div>",
            "created":1197781200,
            "id":476303,
            "title":"\"Flush you down the potty!\""
        },
        "11211":{
            "choices":[
                "Eric starts using the bathroom.",
                "Eric changes his mind."
            ],
            "content":"<div class=\"\"><div> <span>As Eric tossed the little piece of toilet paper into the toilet bowl with the parents inside Ed dropped the raft outside the toilet on to the floor and as the two parents landed their son sat down and his left foot landed on top of the raft smashing it to pieces.And the only thing keeping the parents from drowning in the water is the toilet paper.</span></div></div>",
            "created":1450822380,
            "id":2078183,
            "title":"Ed loses the raft!"
        },
        "1122":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "You=Eric's stomach",
                "RUN!!"
            ],
            "content":"<div class=\"\"><div> <span>I'm gonna eat you! Eric says, and runs up the stairs to his room, plucking you off of the floor. He sets the \"bugs\" on his bed, and sits bed level while staring at them.<br>\r\n<br>\r\n\"Mommy says I had to brush my teeth, they're clean!\" he shows his teeth to his tiny parents. \"I love to eat bugs!\"<br>\r\n<br>\r\nEric's stomach gurgled, he responded \"My tummy wants you to be in it\"<br>\r\n<br>\r\nYou tried shouting, but he didn't listen<br>\r\n<br>\r\n\"Alright buggies! get in my tummy!\"</span></div></div>",
            "created":1201410000,
            "id":491550,
            "title":"\"Eat you!\""
        },
        "11221":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "shrunken parents POV"
            ],
            "content":"<div class=\"\"><div> <span>WHAT DO WE DO!! ED, IF HE EATS US, WE'LL BE KIDDY POO!!\"Kathy was hysterical.<br>\r\n<br>\r\n\"Hee Hee! that's right buggies! YOU get to be MY poo!!! Not everyone gets such an honor! Now my tummy wants you!!\" Eric lifts his to his mouth, and drops you in. He then swallows you whole... </span></div></div>",
            "created":1264222800,
            "id":824390,
            "title":"You=Eric's stomach"
        },
        "112211":{
            "choices":[
                "Eat something else",
                "Burp more"
            ],
            "content":"<div class=\"\"><div> <span>The stomach of Eric was, in a word, digusting. Half-digested bits of food, mistakenly-swallowed small toys, and countless pieces of hard shells, most likely from all the bugs he's eaten, little the bottom of his belly.<br>\r\n<br>\r\n\"Eric, please! Let us out!!\" Ed pleaded with his son, pounding on the stomach walls.<br>\r\n<br>\r\n*BUUUUUUUUUUUUUURRRP* Eric burped, rubbing his belly at his parents' struggles to survive.<br>\r\n<br>\r\nAcids poured in and sent the parents into a deep pool of the stuff. Within minutes, they were gone.<br>\r\n<br>\r\n*GUUURRRGLE* Eric's tummy rumbled as it made its way through the last of the parents. *UUUURRRRRRP* Eric messily belched, crumbs of food flying out of his mouth.</span></div></div>",
            "created":1367470800,
            "id":1582678,
            "title":"shrunken parents POV"
        },
        "1122111":{
            "choices":[
                "Wake up hungry",
                "Wake up gassy"
            ],
            "content":"<div class=\"\"><div> <span>Eric decides that his parents weren't enough to fill his belly, and heads to the kitchen. On the counter, a bowl of candy is left, but normally, he is only allowed to have a couple pieces a day. Now, without anyone to restrict him, he grabs the whole bowl and eats every last bit. Wrappers litter the floor around him, and his belly gurgles, slowly digesting its massive new meal. Eric pats his bulging stomach, full of his sweet snack, and burps.<br>\r\n<br>\r\n\"Ahh...\" He sighs with relief, and lays down to let his stomach handle its snack. As he falls asleep, he lets out a huge, loud burp. It has a sweet smell to it, from all the candy.</span></div></div>",
            "created":1389416400,
            "id":1725379,
            "title":"Eat something else"
        },
        "11222":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "He pulls down the front of his pants, he's gonna pee in the hill!",
                "He pulls off his pants, he's gonna poop in the hill!"
            ],
            "content":"<div class=\"\"><div> <span>RUN!!! Ed shouted as he ran, Eric looked down, \"Alright buggies, let me take you back\" he grabbed his tiny parents and opened his door. he opened the sliding door and took you to a place in the backyard, it was an anthill!<br>\r\n<br>\r\n\"Eric, no!\" Kathy shouted.<br>\r\n<br>\r\ntoo late, the parents were dropped into the anthill, it had an enlarged enterance.<br>\r\n<br>\r\nWhile walking through, the place was empty, vacant, unusual...<br>\r\n<br>\r\nthe parents wandered into the enterance chamber, the peace of the moment was shattered by a sudden thump, looking at the only way into the massive system of tunnels was blocked by debris. looking up, was Eric's smiling face, this wasn't a normal smile.<br>\r\n<br>\r\nsuddenly, a large \"bzzzt!\" broke the silence afterward, they knew it<br>\r\n<br>\r\nEric had farted<br>\r\n<br>\r\n\"smell that buggies?\" Eric unbuttoned his pants<br>\r\n<br>\r\n\"Oh no\" Ed said, looking up at his titanic son in fear.<br>\r\n<br>\r\nEric...</span></div></div>",
            "created":1204088400,
            "id":503355,
            "title":"RUN!!, And into a trap"
        },
        "112222":{
            "author_id":"joshe2810",
            "author_name":"Josh Edwards",
            "choices":[
                "Should Eric wear a diaper",
                "Or help his parents"
            ],
            "content":"<div class=\"\"><div> <span>Eric revealed his butt to his parents and let out another fart in the anthill.<br>\r\n<br>\r\n\"Oh my.... Eric!\" Ed shouted<br>\r\n<br>\r\n\"Uh-oh, I gotta go.\" said Eric, giggling<br>\r\n<br>\r\nSuddenly there was two large brown logs that fell into the anthill. It absolutely stunk<br>\r\n<br>\r\n\"Eric. You let us out here right now!\" Kathy demanded<br>\r\n<br>\r\n\"OK. But I'm gonna do something else. You always hated me wearing diapers and I've still gotta go so....</span></div></div>",
            "created":1281243600,
            "id":932754,
            "title":"He pulls off his pants, he's gonna poop in ..."
        },
        "1122221":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "Take an adventure... into my pamper!",
                "Change my diaper after I'm done!"
            ],
            "content":"<div class=\"\"><div> <span>So I'm gonna wear a diaper! Just like Jack! Eric stormed off, leaving his parents at the mercy of his two reeking turds.<br>\r\n<br>\r\n\"What just happened?\" Ed asked his wife.<br>\r\n<br>\r\n\"Our son just put us in an anthill and took a dump on us\" Kathy replied, grabbing her nose. Eric's fresh poop was indeed stinky. his parents had feared it ever since he was in diapers... now they feared it. And their son was going to get a diaper.<br>\r\n<br>\r\nAfter a few minutes...<br>\r\n<br>\r\n\"I'm BAAACKKK...\" Eric's voice sounded. \"In a DIAPER!\" The titanic kid giggled.<br>\r\n<br>\r\n\"Oh no...\"<br>\r\n<br>\r\n\"So, little bugs, I still gotta go... so... You're gonna-</span></div></div>",
            "created":1286859600,
            "id":973603,
            "title":"Pampered Eric"
        },
        "11222212":{
            "author_id":"chilly1992",
            "author_name":"chilly",
            "choices":[
                "Resist. Try to save your own life.",
                "Try to change your giant Son"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"left\"></div> Eric pick his both parents up and go inside his home. He took them to the changingtable and than clim it up, he squats down over seem and lower his butt closer to them \" Eric dont do this please!\" his mother screams but a fart comes out of his butt, the two asdults are raised up her feet and Eric laugh. Than he pees hin his diaper and his parents could see that the diaper got thicker and thicker, the lion on the diaper waistband are smiling over them. He put his dad into his diaper and starining at his mom. \"mooommmy I want an new diaper..\" he says gigling and raised his legs into the air and start kicking with his foots. His mom was gabbed by him and setting in front of his diaperd giant butt. \"change me or daddy will die!.. Kate has only a few seconds to make a choise....</span></div></div>",
            "created":1315717200,
            "id":1185194,
            "title":"Change my diaper after I'm done!"
        },
        "1123":{
            "choices":[
                "To jump",
                "Just get eaten",
                "Let "
            ],
            "content":"<div class=\"\"><div> <span>Obscured by the pice of toilet paper. Eric takes the two little bugs across the house screaming for all the mayhem. The little kid finally stop in what you could tell is the kitchen. The tolet paper dropped out of the hand with both of you in it. \"No I don't want to fall to my death!\" Kathy said. The paper unraveled revealing you true view  when a giant hand extended out and caught you.<br>\r\n<br>\r\nYou looked up to see you savoir and it was Jack who had catch you. He gave a sweet little smile and Kathy and Ed's parental love set back in. This was short lived when Jack dropped the bugs on to the white surface of his high chair.<br>\r\n<br>\r\n\"Since I can't find Mommy and Daddy Jack, I'll have to feed you today. So today you will have Bug finger food!\" Jack gave out a deep belly laugh that shock the high chair. Hee brought out his two thumbs and started trying to crush thebugs. His massive baby thumb came opoun them and smashed them into the ground. <br>\r\n<br>\r\n\"I can't take this!\" Kathy said to Ed.<br>\r\n<br>\r\n\"Well it is either being smashed to death or being eaten by our 2 year old. So we're pretty much screwed. \" After a few minutes of playing with his food he finally decided to place them down the hatch. He scopped them up and as they screamed to get his attention. Ed got an idea to jump. \"ARE YOU CRAZY!?\" <br>\r\n<br>\r\n\"We can land on Jack's diaper and move our way down, we don't have much of a choice.\"<br>\r\n<br>\r\nKathy decided</span></div></div>",
            "created":1198213200,
            "id":477897,
            "title":"\"Feed you to Jack!\""
        },
        "11231":{
            "choices":[
                "Jack has to pee",
                "Jack needs to poop"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay let's jump on the count of three,\" said Kathy.<br>\r\n\"One\"<br>\r\n\"Two\"<br>\r\n\"Three\"<br>\r\nThe couple jumped and landed on Jack's diaper but Jack pulled his diaper's waist line out a bit and quickly shoved them in and they landed near his crotch.<br>\r\nJust then</span></div></div>",
            "created":1208667600,
            "id":521839,
            "title":"To jump"
        },
        "112311":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "they drown",
                "luckily it stopped filling just at torso level"
            ],
            "content":"<div class=\"\"><div> <span>From their diaper prison, Kathy and Ed could see Jack's crotch contract, as if he was preparing for the bathroom.<br>\r\n<br>\r\nOH NO!! they thought.  Kathy and Ed looked in fear at Jack's \"wee wee\", and saw the slit start to open. Urine began flooding the diaper.<br>\r\n<br>\r\n\"We're gonna drown in pee!!\" Kathy screamed.   </span></div></div>",
            "created":1264222800,
            "id":824404,
            "title":"Jack has to pee"
        },
        "11232":{
            "content":"<div class=\"\"><div> <span>Kathy didn't decide in time and Jack got his meal. Both of them were placed in his drolly mouth and sucked on for a few minuets and then started crunching with his tiny baby teeth. They were mushed and broken until they were swallowed and become nothing but baby poop. </span></div></div>",
            "created":1198213200,
            "id":477899,
            "title":"Just get eaten"
        },
        "13":{
            "choices":[
                "Eat Them",
                "Crush Them",
                "Torture Them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You could see yourself in a sesame street blue diaper. Very wet, almost soaked. When you walked in and saw your small parents standing there on the ground in fear as you towered over top of them. What do you do to them?</span></div></span></div>",
            "created":1322283600,
            "id":1229288,
            "title":"Jack Smith's POV"
        },
        "131":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "They try to escape",
                "Down the hatch!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see them standing there, to you they look so yummy like all the other buggies you loved. \"Nummy!!\" You yell happily as you toddle over to them, your diaper swinging on your hips. You pick them up and lick your lips..</span></div></span></div>",
            "created":1329109200,
            "id":1276666,
            "title":"Eat Them"
        },
        "1311":{
            "author_id":"numerio",
            "author_name":"Tex",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The little bugs, you notice, are scurrying away from you. You giggle; this game is fun! You simply walk in front of the bugs path. \"Where du yu tink yowr goin?\" You then stomp on them, leaving red marks.</span></div></span></div>",
            "created":1392526800,
            "id":1746817,
            "title":"They try to escape"
        },
        "1312":{
            "choices":[
                "Burp some more",
                "Eat some more",
                "Parents' POV"
            ],
            "content":"<div class=\"\"><div> <span>You feel your belly growl. You want to eat them! They try to plead with you but you barely understand them and have already made up your mind. With your mouth gaping open, you drop your parents in, swallowing them whole into your stomach. You put your hands on your tummy and begin to pat it and rub it, as the growls give way to more deep rumbles of imminent digestion of your newest meal.<br>\r\n<br>\r\nAfter 5 or so minutes you've grown quite fond of your belly's glorps and bubbly gurgles. The air around you smells like your burps, as you've made a few during your parents' diges- *URRRP* Oh, there you go again.<br>\r\n<br>\r\nYou can't imagine what pain they must be experiencing and you don't care. All you care about is that your tummy is full of them and of gas for you to burp.</span></div></div>",
            "created":1367470800,
            "id":1582664,
            "title":"Down the hatch!"
        },
        "132":{
            "choices":[
                "Ed Smith",
                "Kathy Smith"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You yelled with excitement. In fact, you yelled so loud that you lost your balance and fell over on your butt, crushing one of them. The other lives. Which one is crushed?</span></div></span></div>",
            "created":1322283600,
            "id":1229290,
            "title":"Crush Them"
        },
        "1321":{
            "choices":[
                "Kill Her",
                "Torture Her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You could only look up at your sons giant diaper about to come down on you! You tried to run, but it was too late. Your son had sat on you, and you were crushed. Now what does Jack do with Kathy?</span></div></span></div>",
            "created":1322283600,
            "id":1229291,
            "title":"Ed Smith"
        },
        "13212":{
            "author_id":"deferiouz",
            "author_name":"Xero",
            "choices":[
                "Shove her in his diaper.",
                "Put her in his mouth."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jack then gets up and starts walking toward katty. She trys to run but he quicky grabs her with his massive hand and brings her close to his face. He then smiles evily and....</span></div></span></div>",
            "created":1322629200,
            "id":1232045,
            "title":"Toddler Torture"
        },
        "132121":{
            "author_id":"deferiouz",
            "author_name":"Xero",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does he put in in the front or back?</span></div></span></div>",
            "created":1322629200,
            "id":1232046,
            "title":"Shove her in his diaper."
        },
        "1321211":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Time to eat!",
                "Changing time!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You smile as your mother topples into your diaper. Once she is pressed up against you; trapped, you start toddling around the house, you giggle as your mother is rubbed up against you. Soon enough..</span></div></span></div>",
            "created":1329109200,
            "id":1276668,
            "title":"Front"
        },
        "13212111":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "change him",
                "put him in his room"
            ],
            "content":"<div class=\"\"><div> <span>soon enough erin came looking for jack to give him and eric some thing to eat. just the kathy remembered what day it was \"shoot! its wednesday, to days the day jack has his laxative and laxatop to help him pee and poo when ever he has these he goes almost instantly\" she said to her self. before she knew any thing eles jacks willie shriviled up as if he needed to pee  and she saw the head of his poop and knew he was ready for that too. but before she could move a galliant of pee and poop was hiting and landing on her but the pee consumed her but before she drowned the pee was absorbed and erin was about to</span></div></div>",
            "created":1336107600,
            "id":1329446,
            "title":"Time to eat!"
        },
        "132121111":{
            "author_id":"guard54",
            "author_name":"Unknown001",
            "choices":[
                "Disposable",
                "Cloth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>as jack is getting his diaper changed the changer decides to use</span></div></span></div>",
            "created":1520033580,
            "id":2459775,
            "title":"change him"
        },
        "14":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "feed them to Jack",
                "give them to Jack to squish",
                "Squish them yourself",
                "Eat them yourself",
                "give to Jack or keep them to torture"
            ],
            "content":"<div class=\"\"><div> <span>As the door opened, Eric entered looking for his parents because he wanted them to fix him something to eat. He caught sight of a gun (shrink ray), that was still emitting smoke. Eric looked in the direction the gun was pointing, and he saw his parents, but they were mini sized. He stood there with his hands on hips. <br>\r\n<br>\r\n\"Well well well, what do we have here, my parents are the perfect size to be used!!\"<br>\r\n<br>\r\nHis parents were shaking in fear at seeing their own son towering over them.<br>\r\n<br>\r\nWhat shall Eric do with mommy and daddy?    </span></div></div>",
            "created":1267333200,
            "id":844016,
            "title":"Eric Smith's POV"
        },
        "141":{
            "choices":[
                "Eric wants to eat",
                "Eric gives Jack his first soda"
            ],
            "content":"<div class=\"\"><div> <span>\"Jack!\" Eric picks up Ed and Kathy and brings them over to Jack, who crawled over to Eric.<br>\r\n<br>\r\n\"Who wants a tasty snack?\" Jack clapped his hands at the prospect of eating whatever Eric was going to give him.<br>\r\n<br>\r\nIgnoring his parents' screams and pleadings, Eric dropped Ed and Kathy into Jack's gaping mouth,as Jack's stomach growled, empty and awaiting food.<br>\r\n<br>\r\nJack didn't even bother to chew up his snack. *GULP* The parents were swallowed into Jack's cavernous, hungry belly.<br>\r\n<br>\r\nEric rubbed Jack's tummy as it rumbled, accepting Ed and Kathy wholeheartedly. *BUUUUUUUUUUUUURRRP* Jack burped in Eric's face, the belch stinking of whatever the 2-year-old had eaten earlier.<br>\r\n<br>\r\n*UUUUUUUUURRRRRPP* Jack burped again, giggling as his tummy grumbled and sloshed around, digesting whatever was left of his parents inside his large stomach, smelling of stomach acid and various foods he ate.</span></div></div>",
            "created":1369198800,
            "id":1595106,
            "title":"Feed them to Jack"
        },
        "142":{
            "choices":[
                "Eat Him",
                "Death By Diaper",
                "More Torture"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh Jack!\" Called Eric in kind of a taunting voice towards his parents. He found Jack playing in his room squatting over a few ants he found and injured before plopping his saggy diaper down on top of them, squishing the bugs. \"Buggies!\" Yelled Jack as he saw his parents. \"No Jack we're n-\" His mother was cut off by Jack squeezing her in his giant hand. He squeezed harder and harder, until she finally exploded everywhere from the strength of his grip. Eric and Jack both giggled. \"Ok Jack, here's buggy number 2!\" Said Eric with joy in giving his Daddy to Jack. How shall Jack kill Daddy?</span></div></div>",
            "created":1346994000,
            "id":1423122,
            "title":"Jack Squishes Them"
        },
        "1421":{
            "choices":[
                "Jack wants to eat more",
                "Eric wants to eat something",
                "The brothers have a burping contest"
            ],
            "content":"<div class=\"\"><div> <span>Eric drops the dad into Jack's open mouth. Without a second thought, Jack swallows him, sending the boys' father to a dark, gassy doom.<br>\r\n<br>\r\n*GRUUMMMBBLEE* * BLOORRP* Jack's belly starts to gurgle busily, drowning out the dad's screams from within.<br>\r\n<br>\r\n*BUUUUUUUUUUUUURRRP* Jack lets out a giant belch that amuses Eric.<br>\r\n<br>\r\nA few minutes later and the father was completely digested by Jack, who continued to loudly burp out the gas in his tummy.</span></div></div>",
            "created":1367470800,
            "id":1582656,
            "title":"Jack eats him"
        },
        "1422":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "His dad makes a break for it.",
                "Jack crushes him."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jack smiles, delighted to have a very scared bug. He drops his dad onto the ground, he then turns and squats. His diapers hideous smell mixed with the sight of smashed bugs on his diaper was enough to paralyze his dad. All of a sudden..</span></div></span></div>",
            "created":1346994000,
            "id":1423125,
            "title":"Death By Diaper"
        },
        "14222":{
            "content":"<div class=\"\"><div> <span>Before Jack's Daddy could run, he felt the full force of Jack's weight and diaper come smashing down into him. Jack moved his body on his butt back and forth, mushing his Daddy into the ground, blood was all over the back of his diaper, and Jack was delighted to see it when he stood up. Jack then went back to squishing and eating other bugs.</span></div></div>",
            "created":1346994000,
            "id":1423128,
            "title":"Jack Crushes Him"
        },
        "143":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Squish time"
            ],
            "content":"<div class=\"\"><div> <span>Eric towers over the parents with his hands on his hips. \"Well, mommy, daddy, I know you probably think that we'll protect you, but the truth is: at that size, you're not much use as anything but entertainment. Just squishing you is only a short amusement, so I don't intend on killing you. I will step on you, but you won't die, you will live forever inside my foot. It'll smell, but trust me, it's a deal for you, because you'll live as long as I do, and never die. I won't need to watch Saturday morning cartoons anymore, I can just look at my foot!\"</span></div></div>",
            "created":1349067600,
            "id":1438318,
            "title":"Squish them yourself"
        },
        "144":{
            "author_id":"majis",
            "author_name":"Haxas",
            "choices":[
                "Digest them",
                "Puke them to eat again or torture them",
                "Find Erin to swallow her"
            ],
            "content":"<div class=\"\"><div> <span>“Could be fantastic eat you!!!<br>\r\nyou say while, laughing, walk toward them. <br>\r\nYour mum is terrified by those words and start to scream and pray you to not eat her. <br>\r\nYour daddy is in panic and taking the arm of his wife start to run under bed.<br>\r\n“ Oh good, daddy, I like playing before eating, and I like much more playing with my lunch!!”<br>\r\nYou  take them under bed with your hand and put your mum in left hand and dad in the other.<br>\r\n“ I’ve catched you and now you are mine, only mine”<br>\r\nGroooollllll…<br>\r\nYour stomach want them inside, NOW.<br>\r\nYou put them near your belly and say” hear, hear the sound of your new house”.<br>\r\n“ Oh noooooo I don’t want go in that place, I don’t want to be absorbed by my 5 years old son, I pray you, Eric, let us go” cry your father .<br>\r\nWhile your mother try to say “ if you don’t let us, who will think to you and your brother?”<br>\r\n“I ‘ll think after to this, now I want to think to you and my tummy is very hungry…dad you are mine now and noone can help you, you will go  inside me, inside your son’s body…and inside my poop, eheheheh” you laugh while starting to bring them near your mouth and your breathe hit your parents. <br>\r\nYou open your 5 yeas old mouth and they can see your tongue waiting for them and especially your uvula and a dark hole. They start to scream. You close your mouth and play with them inside your mouth than you make a burp and you laugh when you decide to swallow one of them…<br>\r\nyou put your father on a side of mouth with the tongue and swallow your mum with a gulp. She scream like never had screamed in his life. <br>\r\nYou can feel her in your throat screaming and giggling and than in your stomach. <br>\r\n“ahhhh, what a meal…” you say satisfied while your father continues to cry and scream. <br>\r\nBut when you open your mouth for another burp he jump out your mouth and start to run away from you and from your stomach and his scary fate.<br>\r\nHe runs when suddenly is inside a dark place, humid and smelly, and he understands to be in your mouth. <br>\r\n“ Where do you think to go? You are my meal.” And you start to swallow your poor father.<br>\r\n“ You are been bad and now you must go inside me”<br>\r\n“ Noooooo, please, noooooooo, son, have pity, don’t eat me. I am your daddy”.<br>\r\nIn one gulp he was inside and you can hear them screaming and cryng while you massage your full tummy and make another burp and some farts.<br>\r\n“AHHHHH delicious”…and now?<br>\r\n</span></div></div>",
            "created":1288846800,
            "id":986702,
            "title":"Eat them yourself"
        },
        "1441":{
            "choices":[
                "Go to eat Erin",
                "Go to feed Erin to Jack",
                "Go to get a drink and burp some more"
            ],
            "content":"<div class=\"\"><div> <span>*GRRUMMMBBLE* *BLOOOORRRP* You sit there and put your hands on your belly, feeling your parents' feeble struggles inside you and the gurgling of your own stomach.<br>\r\n<br>\r\n*BUUURRRRRPPP* \"Ah...\" You enjoy the feeling of your loud burping while your parents digest. Your belly is bigger than it was before, showing signs of fullness, though the outside world would never guess that the reason you were full was because you had just gobbled up your own shrunken parents...<br>\r\n<br>\r\n*BRAAAAP* *URP* More burps are released out of you, as you...</span></div></div>",
            "created":1367470800,
            "id":1582670,
            "title":"Eric digests them"
        },
        "1442":{
            "choices":[
                "Eat them again",
                "Torture them with his feet",
                "Put them down his undies or Jack's diaper"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>All of the sudden, Eric gets a devious idea. He quickly sticks his finger down his throat and pukes his parents up. He goes over and picks up their writhing bodies. He decides that he wants to...</span></div></span></div>",
            "created":1288933200,
            "id":987512,
            "title":"Puke them to eat again or torture them"
        },
        "14421":{
            "choices":[
                "Find someone else to eat",
                "Continue burping"
            ],
            "content":"<div class=\"\"><div> <span>*GROOOOWLL*<br>\r\n\"Tummy need food again!\" Eric stuffs his parents into his mouth again and *GULP*<br>\r\n\"Aaahhh...*URRP*\" Eric burps in satisfaction.<br>\r\n<br>\r\nEric's stomach quickly goes to work digesting its newest visitors. The evil 5-year-old pats his slightly bulging belly, enjoying the sounds of his parent's demise. *RUUMMMBBLE* *GLOOORRP* *SLOSH*<br>\r\n<br>\r\nSuddenly, Eric let out a huge belch. *BUUUUUUUUURRRP* His stomach was filling with gas! *BRRAAP* *UUURRRRP* \"Aaaah...\"<br>\r\n<br>\r\nHis belly groans and sloshes around some more, his parents nothing more than bones and the soupy content of their son's big, gassy belly.</span></div></div>",
            "created":1364014800,
            "id":1556283,
            "title":"Eat them again"
        },
        "144211":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "yes, and shrinks him down",
                "no, find something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Eric frowns; he's still hungry! Walking through the house he sees Erin; Jack; and Pete, Erin's boyfriend. Pete's new, and not necessary.<br>\r\n<br>\r\nDoes he go after Pete?</span></div></span></div>",
            "created":1364014800,
            "id":1556380,
            "title":"Find someone else to eat"
        },
        "1442111":{
            "choices":[
                "eat him ",
                "torture him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>eric shrunk pete down what does eric do with pete?</span></div></span></div>",
            "created":1364965200,
            "id":1563790,
            "title":"yes, and shrinks him down"
        },
        "14421111":{
            "choices":[
                "more burping and farting ",
                "he sleeps and digests his meal"
            ],
            "content":"<div class=\"\"><div> <span>Eric said to Pete im hungry im going to eat you Eric tossed Pete into his mouth and swallowed him outside Eric felt his stomach bubble knowing whats going to happen he pounds his chest and belches a loud belch UUUUUUUUUUUUUUUUUUUUURP! aaaaah much better said Eric what does Eric do now?</span></div></div>",
            "created":1364965200,
            "id":1563791,
            "title":"eat him "
        },
        "14422":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "They do it",
                "They don't, and risk worse punishment"
            ],
            "content":"<div class=\"\"><div> <span>Once his parents get sent up his throat, Eric says \"I decided to feel the pleasure of both your little tongues on the stinky sole of my foot!\" <br>\r\n<br>\r\n\"SON!!! DON'T DO THIS!!!\"<br>\r\n<br>\r\n\"It's too late!!!\" Eric brought his parents down to his foot. His toes were wiggling in anticipation. \"Now, be good mommy and daddy and start kissing my feet!\"<br>\r\n<br>\r\nDo they, or do they not, and risk worse punishment?</span></div></div>",
            "created":1288933200,
            "id":987695,
            "title":"Torture them with his feet"
        },
        "144221":{
            "author_id":"majis",
            "author_name":"Haxas",
            "choices":[
                "Swallow him whole",
                "Put him in his Butt"
            ],
            "content":"<div class=\"\"><div> <span>\"Smell my barefeet and lick it, now if not I'll swallow you again and forever\".<br>\r\nThey,scary and covered by his saliva and smelly gastric acids, started to smell his feet, one for the father and one for mum.<br>\r\n\" Ahahah what a sensation!!! It's fantastic...\" he says when they start to lick his feet.<br>\r\n\" The parents should make this to their sons because they must be slave of them. Are you happy to be my slave?\"<br>\r\n\" please son, stop this, it's gross and humiliating, we want to finish this cough....\"<br>\r\nwhile his father is talking, his foot steps on him. <br>\r\n\"This is your place now dad, accept and smell my feet eheheheh\".<br>\r\nWhen he raise up his foot, his dad escape, but his son caught him and say \"Bad daddy, now I'll punish you. But before...\"<br>\r\nPut him under his foot and grubs his mum and say \" sorry mum but my tummy is hungry, I want eat you and continue to play with dad\"<br>\r\n\" Son, you can't eat your mother, please, don't eat me, I don't want to return in that scary and smelly place, please\".<br>\r\n\" I WANT eat you, and all that I want, you must do, now see...\"<br>\r\nTake his mother near his mouth that is opened wide and while she scream and cry, he make a Mega long and smelly burp.<br>\r\nThan tosses his mum, that smell of feet, inside his mouth and opening his mouth saying her to say bye to her husband.<br>\r\nShe tries to escape but his tongue pull her on the back of mouth and keeping mouth open, swallow. <br>\r\n\" Ahhhhh, what a beauty feeling you, giggling and screaming inside me\".<br>\r\n\"Now daddy we can continue to play\".<br>\r\nAnd grubbing your father, he puts him under butt and release a long fart.<br>\r\nThan put him under his foot again while from his stomach coming screams and gurgles...</span></div></div>",
            "created":1292994000,
            "id":1020070,
            "title":"They do it"
        },
        "1442211":{
            "author_id":"majis",
            "author_name":"Haxas",
            "choices":[
                "Two electric technics",
                "postal man"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, someone knock at the door...<br>\r\n\"Oh, we can't play more\" and say this he takes his father in front of his mouth and release a loud belch in his face than lick his father two or three times, and put his screaming and frightened father in his mouth swallowing immediately while his father continued to say\"No noo noooooooo\" and after pass the throat he was silenced by his son...\"ahhhh what a beauty\" say Eric. Than he goes down to open the door hoping that was someone to fun with and to....eat at the end.<br>\r\nWho is?</span></div></div>",
            "created":1322197200,
            "id":1228770,
            "title":"Swallow him whole"
        },
        "14423":{
            "author_id":"colonelnj",
            "author_name":"Spartan1156",
            "choices":[
                "Jack's diaper",
                "His pull-up"
            ],
            "content":"<div class=\"\"><div> <span>Eric giggled while his parents were freaking out. His parents had made him wear pull-ups to contain his bedwetting problem, and he despised wearing them. Now he had his parents in his grasp, and happiness. Eric walked into Jack's room, where the toddler was playing with a train set.<br>\r\n<br>\r\n\"No- No Eric, don't do it!\" His dad called.<br>\r\n<br>\r\nEric dropped his pants, revealing the pull-up.<br>\r\n<br>\r\n\"Your choice daddy... my diaper or his! Well... it's my choice!\" Eric giggled while his parents cringed in fear.<br>\r\n<br>\r\nEric giggled again, his hand reaching for...</span></div></div>",
            "created":1289192400,
            "id":989762,
            "title":"Put them down his undies or Jack's diaper"
        },
        "144231":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Shoved them in Jacks Diaper",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>He reached for Jack's Diaper, but instead of putting them in his diaper, Eric rubbed them all over the outside of it, \"This feels soggy and awful!\" his mom screamed but Eric kept going for several minutes, when he finally stopped, he put them onto the seat of Jack's high chair. \"Thank god that is over, I thought it would never en--\" but before they could move Jack's full body weight and his soggy diaper were put on top of them, they could feel Eric rubbing Jack around crushing them, once Eric took Jack off them he -- </span></div></div>",
            "created":1301374800,
            "id":1078218,
            "title":"Jack's diaper"
        },
        "1442311":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "pee",
                "poo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>after taking jack off them eric shoved them down jacks diaper which hadent been changed yet so there was still pee and poop in there after a while eric started to feel an urge to....</span></div></span></div>",
            "created":1334120400,
            "id":1313274,
            "title":"Shoved them in Jacks Diaper"
        },
        "14423111":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>After a while of being in  jacks diaper eric realised that he needed to pee so he reached in to jacks diaper and pull out his parents then shoved them into his pull up and his parents immediately knew what was coming then eric let's go  of all the pee and started to flood his diaper<br>\r\n<br>\r\n<br>\r\n<br>\r\nBut did his parents survive <br>\r\n</span></div></div>",
            "created":1335157200,
            "id":1321360,
            "title":"pee"
        },
        "14423112":{
            "author_id":"roryritt",
            "author_name":"mysterious mister R",
            "choices":[
                "An hour later Erin comes in and smells a messy diaper.",
                "Eric decides to play with the back of Jacks diaper while he is sleeping."
            ],
            "content":"<div class=\"\"><div> <span>Jack stands up and begins to grunt. Ed and Kathy struggle getting stuck to the poop already in the diaper right below jacks asshole. After straining jack begins to push out a very large turd which lands directly on top of his parents coiling around mushing and burying them in poop up to their necks. The poop goes in their mouths making them cough and choke on the pooh having to swallow some just to breathe as they struggle stuck in the prison of poop.... after jack finishes his big mess, Eric pads him firmly on the butt shaking his parents new world, and splashing more poop onto them. Jack says he is sleepy and eric lays him down covering him in a blanky while his parents suffer from the stench of their awful new home.</span></div></div>",
            "created":1363669200,
            "id":1554193,
            "title":"poo"
        },
        "144232":{
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As he reaches for the front of his pull-ups he can hear his father yelling \"Please don't anything but this!\" \"ok dad, would you rather go down the front or back?\"</span></div></span></div>",
            "created":1289538000,
            "id":992565,
            "title":"His pull-up"
        },
        "1442321":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "in the back of his diaper",
                "in Jacks diaper"
            ],
            "content":"<div class=\"\"><div> <span>Before he can respond, Eric shoved them into the front of his pull up. he dropped his parents into his diaper tomb, \"Haha, this is what you get for making me wear these!\" <br>\r\nhe pushed the front of his pull up forcing them to be pressed against his cock. \"Uh oh, looks like I have to go!\" he yelled, \"No, Please Sto--\" But before she could finish a wall of piss hit them and they began to drown, after it was absorbed into his diaper, Eric took them out, \"Don't worry, that's only the beginning\" he said and he picked them up and put them</span></div></div>",
            "created":1301288400,
            "id":1078008,
            "title":"Front"
        },
        "14423211":{
            "choices":[
                "Eat Them",
                "Kill Them Beneath Jack Or Himself"
            ],
            "content":"<div class=\"\"><div> <span>Eric opened the back of his Pull-Up and stuffed them back there. As soon as they were back there, he sat down. And Eric started to rub his butt on the ground squashing his parents up against his giant butt. Eric was laughing while they were screaming. \"Please get us out of here!\" Shouted the dad. This time they were screaming even louder! Next Eric wants to...</span></div></div>",
            "created":1305435600,
            "id":1106405,
            "title":"In The Back Of His Diaper"
        },
        "144232112":{
            "choices":[
                "Eat Her",
                "Stomp On Her"
            ],
            "content":"<div class=\"\"><div> <span>\"And now you will both die hahhahahah!\" Shouted Eric with excitement. His parents screamed so loud, that they could feel and hear that they were losing their voices. He gave the mom to Jack and told him to do whatever he wanted with her, but to make sure to finally kill her. This was one thing that even Jack could understand. \"Now Daddy, how do you want to die?\" Asked Eric. \"But I don't even want to di--\" Before his dad could even finish, he was being squashed up beneath the really wet Pull-Up. Now, Eric's dad was dead, and there was a big blood stain on the bottom of Eric's Pull Up. Now Eric sat there, still on top of his dead dad. Laughing. And now it's time for mommy to die, and still in the grasp of her giant 2 year old. How does she die?</span></div></div>",
            "created":1305435600,
            "id":1106410,
            "title":"Kill Them Beneath Jack Or Himself"
        },
        "1442321121":{
            "content":"<div class=\"\"><div> <span>\"No Jack! Please! It's your moth--\" But before she could finish, she was being eaten by her 2 year old. She looked down at his diaper now, and that was the last thing she ever saw. And now, with both of them dead, Eric and Jack both now sit there, in half full diapers. Until they heard a scream from down stairs, they both go down there to find Erin, their baby sitter, shrunk. And so more people's fate are to come.</span></div></div>",
            "created":1305435600,
            "id":1106413,
            "title":"Eat Her"
        },
        "1442321122":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Please Jack, noooo--\" \"Squashy!\" Shouted Jack. Now Jack and Eric both relaxed peacefully, sitting in there full diapers.</span></div></span></div>",
            "created":1305435600,
            "id":1106414,
            "title":"Stomp On Her"
        },
        "1443":{
            "choices":[
                "Just barely missed",
                "Got her",
                "Missed, but it got her attention"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Eric took the gun and went to find the babysitter. She was just on the couch watching TV.<br>\r\nHe pointed the gun at her and did he hit her?</span></div></span></div>",
            "created":1444265880,
            "id":2044894,
            "title":"Tracking down the babysitter"
        },
        "14432":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Yes",
                "No it made her bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He got her but did it shrink her?</span></div></span></div>",
            "created":1510363500,
            "id":2413519,
            "title":"Got her"
        },
        "145":{
            "choices":[
                "Continue With Eric",
                "Switch To Jack"
            ],
            "content":"<div class=\"\"><div> <span>Immediately Eric grabbed his parents up and took them back to his room. Eric put his parents in a jar as he went to go get jack, where he found him playing in nothing his sesame street diaper in his room. When he got back, he found his parents trying to escape the jar...and their fate.\"Well, well, well, look who's trying to get free.\" Eric said mocking them at their failed attempts to escape. Eric then took off his shirt, revealing the top of his Thomas The Train undies. He gave his mommy to Jack and kept his father for himself. \"Ok Jack, you can do whatever you want with mommy, stuff her down your diaper, suck on her, sit on her, I don't care. Enjoy your evil work.\" Said Eric with an evil smile coming across his face. He locked his room door. Jack began by sucking on his mommy, he loved hearing her screams. Eric squatted down over his dad and gave him fart torture, almost making him pass out. \"Please stop!\" His daddy shrieked. \"No! You're not the boss of me!\" Yelled Eric in his 5 year old voice. Who's POV do you want for torture now?</span></div></div>",
            "created":1346821200,
            "id":1421728,
            "title":"Torture Time!"
        },
        "1452":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Takes her inside his diaper",
                "Stays with her under him"
            ],
            "content":"<div class=\"\"><div> <span>Meanwhile, Jack is viciously sucking on his mom, while she screams he smiles, enjoying his fun. Then he takes her out with a *pop*. She coughs and begs, \"Jack, please!\" Then Jack had an idea. He placed his mom on the ground and squatted, his diaper stuck to him. The smell drifting down to her. \"Mikey! Don't you can't--\" Then he sat down, smashing his mom between his diaper and the floor. Jack enjoys the feeling of her squirming and her distant screaming, he let out a fart and heard her scream a little more. He loved it. Then he..</span></div></div>",
            "created":1346821200,
            "id":1421765,
            "title":"Switch To Jack"
        },
        "14521":{
            "author_id":"scienceputty",
            "author_name":"scienceputty",
            "choices":[
                "Take her out and try to wake her up with something really bad",
                "Put her in a jar"
            ],
            "content":"<div class=\"\"><div> <span>Jack picks up his mom and pulls back the back of his diaper. \"Have fun, mummy!\" and he said as he dropped her in. Kathy was lodged between his butt cheeks and the smell of his farts was still lingering. \"Jack, please let me out, it smells so bad in here\". Jack was silent. Suddenly BFFFFFTTTTTTTT. He let out the loudest, smelliest fart. Kathy screamed as she was pushed to the back of his diaper. This continued until Jack could not hear him mom scream anymore. He then decided to...</span></div></div>",
            "created":1486900200,
            "id":2276554,
            "title":"Takes her inside his diaper"
        },
        "15":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yes, and she helps them ",
                "yes, and gives them to Jack",
                "yes, and gives them to Eric",
                "Yes, and keeps them herself",
                "No, Erin doesn't see them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Erin Johnson opened the door as she knocked, \"helooo? Mr. and Mrs. Johnson?\" She walked further into the room, looking around. \"I came to babysit  Eric and Jack!\" <br>\r\n<br>\r\nDoes she notice Ed and Kathy?                    </span></div></span></div>",
            "created":1397099820,
            "id":1776239,
            "title":"Erin Johnson's POV"
        },
        "153":{
            "choices":[
                "Not yet",
                "Yep, down he goes",
                "Erin gets shrunk somehow"
            ],
            "content":"<div class=\"\"><div> <span>\"Whoa how did you get so small?\" She asked.<br>\r\n\"We got shrunken down by the shrink ray\" says Ed. She looks over and picks up the gun.<br>\r\n\"Ohh, well that's too bad that there is a reverse\" she said sarcastically, \"Guess I will take you for myself.\"<br>\r\n\"MOM, DAD I'M HUNGRY!\" Yelled Eric. Erin looks at them and smiles. She happily brings them down to the kitchen and looks at Eric.<br>\r\n\"Sorry, little buddy, but I'm going to feed you.\" She showed him his parents.<br>\r\n\"Yummy\" he opens his mouth and Erin drops Ed in his mouth. Does he swallow?</span></div></div>",
            "created":1461189960,
            "id":2136572,
            "title":"Feeding the child"
        },
        "1533":{
            "choices":[
                "Sits on them",
                "drops on in his mouth",
                "Gives one to Jack"
            ],
            "content":"<div class=\"\"><div> <span>Erin was looking at the shrink gun and accidentally hits herself with it. She shrinks down and Eric looks at her. He swallows Ed and picks her and Kathy.<br>\r\n\"Yay more food\" Eric said happily.<br>\r\n\"No just her, not me!\" Erin said.<br>\r\n\"This wouldn't have happened if you helped us before!\" Kathy said yelling. Ric takes them to his bedroom. What does he do with them?</span></div></div>",
            "created":1464293580,
            "id":2154382,
            "title":"Erin gets shrunk somehow"
        },
        "154":{
            "choices":[
                "\"Eat you\"",
                "\"Sit on you\"",
                "\"Play with you\""
            ],
            "content":"<div class=\"\"><div> <span>\"Oh wow!\" She exclaimed.\"You are so small!\"<br>\r\n\"Please help us\" Ed pleaded.<br>\r\n\"Nah, I don't think that is possible, I think I will keep you as pets\"<br>\r\nEd and Kathy ran but they were too slow. Erin grabbed them and sat on the bed.<br>\r\n\"Now what should I do with you?\"</span></div></div>",
            "created":1444265160,
            "id":2044890,
            "title":"Erin's toys"
        },
        "1542":{
            "author_id":"hitman1996",
            "author_name":"thehitman",
            "choices":[
                "2 hours she farts on them the whole time",
                "1 day she makes them kiss her butthole",
                "6 wks she farts on n makes em' kiss her butthole then takes em' home"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I know what ill do ill sit on you hows that sound\" Erin Said before the tiny pair could respond Erin placed them where she was sitting then turned around and lowered her butt on top of them how long was she sitting on them for</span></div></span></div>",
            "created":1519604760,
            "id":2457705,
            "title":"\"Sit on you\""
        },
        "155":{
            "author_id":"megadude3",
            "author_name":"Rockdude2",
            "choices":[
                "You try to follow her",
                "You wait."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She looks high and she looks low but she doesn't see you leaving you to whatever fate will come next.</span></div></span></div>",
            "created":1408171620,
            "id":1842099,
            "title":"No, Erin doesn't see them"
        }
    },
    "info":{
        "author_id":"colonelnj",
        "author_name":"Spartan1156",
        "brief_description":"Be either a parent, kid, or babysitter!",
        "created":1197354000,
        "description":"<td align=\"left\" class=\"norm\">The Smith family is one of those weird families, sort of like the parents from the \"Honey I Shrunk the Kids\" type. The Parents are:<br>\r\n<br>\r\nEd Smith: Has built and is experimenting with shrinking technology. Married to Kathy Smith, his wife. Father of Eric and Jack Smith. Age 32<br>\r\n<br>\r\nKathy Smith: Normal housewife who helps her husband with work. Married to Ed Smith, her husband. Mother of Eric and Jack Smith. Age 31<br>\r\n<br>\r\nEric Smith: 5 Year old kid, normal but loves to misbehave, Changes Jack's diapers rarely...<br>\r\n<br>\r\nJack Smith: 2 Years Old, Toddler. Wears Diapers<br>\r\n<br>\r\nErin Johnson: Babysitter for the Smiths, does not know about the shrinking technology. can tolerate a wild household. Age 15.<br>\r\n<br>\r\nStory should be detailed, and imagine this event is actually happening, written in 3rd person \"Ed\" or \"Erin\" No Magic Portals, Vore is preffered with the kids.</td>",
        "id":1360183,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1520033580,
        "modified":1520033580,
        "pretty_title":"Little Kid Madness"
    }
}