{
    "chapters":{
        "1":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "The Original Series",
                "The Next Generation",
                "Deep Space 9",
                "Voyager",
                "Enterprise"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick which series:</span></div></span></div>",
            "created":1346043600,
            "id":1415033,
            "title":"The start"
        },
        "11":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Nyota Uhura",
                "Christine Chapel",
                "Janice Rand",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick which woman</span></div></span></div>",
            "created":1346043600,
            "id":1415036,
            "title":"The Original Series"
        },
        "111":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the Communications Officer, Lieutenant Nyota Uhura, wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415038,
            "title":"Nyota Uhura"
        },
        "1112":{
            "author_id":"hyro",
            "author_name":"Hyro",
            "choices":[
                "Captain Kirk (for punishment or necessity)",
                "Dr. McCoy (for medical reasons)",
                "An omnipotent alien entity"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who forces Uhura into diapers?</span></div></span></div>",
            "created":1396846800,
            "id":1775097,
            "title":"She is forced into them"
        },
        "11123":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Option A",
                "Options B or C"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When and where did this entity affect her<br>\r\n<br>\r\nA- She gets separated from her landing party<br>\r\n<br>\r\nB- She’s affected while onboard the Enterprise<br>\r\n<br>\r\nC- She gets abducted from the Enterprise</span></div></span></div>",
            "created":1542862800,
            "id":2580478,
            "title":"An omnipotent alien entity"
        },
        "111232":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "B",
                "C"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does it start with...<br>\r\n<br>\r\nB- her on the Enterprise<br>\r\n<br>\r\nC- being abducted from the Enterprise</span></div></span></div>",
            "created":1542862800,
            "id":2580479,
            "title":"Options B or C"
        },
        "112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the Head Nurse, Christine Chapel, wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415040,
            "title":"Christine Chapel"
        },
        "1122":{
            "author_id":"hyro",
            "author_name":"Hyro",
            "choices":[
                "Dr. McCoy (thinks she takes too many bathroom breaks)",
                "Starfleet regulation for all nurses",
                "An omnipotent alien entity"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who forces Chapel into diapers?</span></div></span></div>",
            "created":1396846800,
            "id":1775100,
            "title":"She is forced into them"
        },
        "113":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would Captain Kirk's yeoman, Janice Rand, wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415043,
            "title":"Janice Rand"
        },
        "114":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Helen Noel",
                "Ann Mulhall",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick another character</span></div></span></div>",
            "created":1346043600,
            "id":1415092,
            "title":"Other"
        },
        "1143":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Nyota Uhura, Christine Chapel, and Janice Rand",
                "The entire female staff of the Enterprise",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about more than one woman in diapers?</span></div></span></div>",
            "created":1349586000,
            "id":1442316,
            "title":"Other"
        },
        "11431":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "They like them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why are these three lovely ladies in diapers?</span></div></span></div>",
            "created":1350104400,
            "id":1446153,
            "title":"Nyota Uhura, Christine Chapel, and Janice Rand"
        },
        "114311":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Uhura gets diapered first.",
                "Rand gets diapered first."
            ],
            "content":"<div class=\"\"><div> <span>It was a fairly ordinary day for the crew of the U.S.S. Enterprise. They had been ordered by Starfleet to investigate an anomaly in the Horsehead Nebula, and they were en route to the star now.<br>\r\n<br>\r\nMost of the senior staff was on the bridge. Captain James Kirk was in his chair, Commander Spock was standing at the Science Station, Lieutenant Hikaru Sulu was positioned at the helm, Ensign Pavel Chekov was seated next to him at navigation, Lieutenant Nyota Uhura was working at the Communications Array, and Yeoman Janice Rand was standing behind Captain Kirk, awaiting commands from him.<br>\r\n<br>\r\nNothing much had happened since they had received their assignment; they were expecting this to be a fairly ordinary day. However, Uhura and Rand were eagerly looking forward to something else.<br>\r\n<br>\r\nBefore long, the speaker on the bridge came on and Nurse Christine Chapel's voice was heard: \"Lieutenant Uhura, Yeoman Rand, please report to sickbay for a routine checkup.\"<br>\r\n<br>\r\nThat was what the two women had been waiting for. Both of them casually moved away from their posts and proceeded to the turbolift. Lieutenant Hadley took over for Uhura at comm. When the turbolift doors opened, the women entered it and waited for it to close.<br>\r\n<br>\r\nOnce it started moving, they dropped their emotionless display, looked at each other, and grinned.<br>\r\n<br>\r\n\"You think she finally got it?\" asked Uhura.<br>\r\n<br>\r\n\"Considering that we already had our routine checkup last week, I'm certain of it,\" replied Rand.<br>\r\n<br>\r\nA few minutes later, the two women in red had arrived in Sickbay. As usual, Dr. Leonard \"Bones\" McCoy and his assistant Nurse Christine Chapel were there. However, Commander Montgomery Scott and a number of his crew in the engineering department were there as well. A conduit had ruptured down in the engine room, injuring several of them. Scott had not been hurt in the rupture; he was simply there to assure himself of the well-being of his men.<br>\r\n<br>\r\nNurse Chapel noticed Uhura and Rand entering the room. Once they did, she told McCoy \"Doctor, I would like to give Yeoman Rand and Lieutenant Uhura their health exams now.\"<br>\r\n<br>\r\n\"That might be difficult right now, Christine,\" Dr. McCoy told his assistant, \"Sickbay's already crowded enough as it is.\"<br>\r\n<br>\r\n\"In that case, do you suppose I could just give them their checkups in my quarters?\" Chapel suggested.<br>\r\n<br>\r\n\"Sure, that's acceptable,\" McCoy responded.<br>\r\n<br>\r\nChapel grinned and said \"Thank you, sir. I just need to get my equipment and then we'll be out of your hair.\"<br>\r\n<br>\r\nShe went into her office, retrieved a large black box, and then told the other two women \"Come with me, please.\"<br>\r\n<br>\r\nThe three ladies left Sickbay and headed towards Chapel's quarters. Once they arrived there, Chapel instructed the computer to seal off the door. Then she placed the black box on a counter, opened it, and removed two packages of adult diapers; one for cloth, one for disposable.<br>\r\n<br>\r\nShe smiled, turned to her friends - who were also smiling - and asked them \"Alright, dears; who wants to be first?\"</span></div></div>",
            "created":1397710800,
            "id":1781140,
            "title":"They like them"
        },
        "1143111":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She picks cloth",
                "She picks disposable"
            ],
            "content":"<div class=\"\"><div> <span>The Communications Officer stepped forward and stated brightly \"I'll go first.\"<br>\r\n<br>\r\nThe Nurse smiled down at her and nodded her head. Then she turned to the Yeoman and said \"Janice, can you help me get Nyota undressed?\"<br>\r\n<br>\r\n\"Of course, Christine,\" the attractive blonde affirmed.<br>\r\n<br>\r\nThe two Caucasian women approached the African American woman and swiftly but delicately removed her uniform, her boots, and then her earpiece, her bra, and her panties. Once Uhura was completely naked, Rand laid her down on the bed while Chapel picked up the two packages of diapers and asked her \"Which would you like to try on first?\"<br>\r\n<br>\r\nUhura spent a few seconds contemplating, and then she made her decision.</span></div></div>",
            "created":1397710800,
            "id":1781142,
            "title":"Uhura gets diapered first."
        },
        "11431111":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She picks cloth",
                "She picks disposable"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll go with cloth,\" Nyota tells her, \"It's been a really long time since I last wore them; I would love to experience them again.\"<br>\r\n<br>\r\n\"Cloth it is,\" Chapel announced. She tore open the side of the package labeled \"Cloth\" and removed a diaper, along with a pair of safety pins and a bottle of baby powder. Then she slowly approached Uhura with these items in hand. Rand took a few steps back to give them some room. <br>\r\n<br>\r\nChapel knelt down in front of Uhura and had her lift her bottom up so she could get the cloth diaper under her. Uhura did as she was ordered but her eyes where tightly closed. Obviously, she was already quite excited by what was about to happen.<br>\r\n<br>\r\nChapel got the bottle of baby powder open and tried to lift Uhura's legs to start with her bottom but Uhura had rather large legs, so this proved to be a bit of a challenge. Chapel told her to bring her legs up to her chest. Uhura complied, and Chapel generously powdered her bottom and then had the African American woman put her legs back down. After this, she had Uhura spread her legs so that she could powder all of her crotch.<br>\r\n<br>\r\nUhura's private regions were smooth and clean, as if they had been shaved.  Chapel stood there and admired her pussy for a full 10 seconds. Soon after, Uhura opened her eyes briefly and noticed the nurse admiring her. Without another word, she tightly shut her eyes again. Chapel powdered her, taking her time to get every inch covered. While she was doing this, Uhura started moving slowly in correlation with the nurse's hand.<br>\r\n<br>\r\nThis startled Chapel, so she quickly finished with the powder. Then she pulled the diaper tightly up between Uhura's legs, brought the sides up around her waist, and pinned them in place. She made sure to tuck in all the openings to Uhura's diaper to prevent leaks. Then she said in a loud proud voice \"Okay, baby, all done.\"<br>\r\n<br>\r\nRand and Chapel slowly pulled Uhura to her feet. She was naked except for the thick soft white cloth diaper, and she loved it. The other two women led her over to the full-length mirror in the room, and Uhura spent more than a minute admiring her padded crotch and bottom. She did a complete turn whilst keeping her eyes focused on the mirror. Finally, she turned to Chapel and told her \"Great work, Christine.\"<br>\r\n<br>\r\n\"My pleasure,\" was all the nurse said.<br>\r\n<br>\r\nRand stood behind Uhura and patted her diapered bottom, whispering \"You know, you look really cute in that diaper, Nyota.\"<br>\r\n<br>\r\nUhura blushed furiously, causing Rand to giggle. Chapel simply smirked and said \"Glad you think so, Janice. Cause you're next.\"<br>\r\n<br>\r\n\"Oh, boy,\" the yeoman remarked, anticipation apparent in her eyes.<br>\r\n<br>\r\nUhura and Chapel stood on either side of her, and then they helped her out of her clothes. Her uniform, boots, bra, and panties were quickly removed. Since Chapel had diapered Uhura, Uhura decided that she would diaper Rand, and that Rand would diaper Chapel when she got her turn.<br>\r\n<br>\r\nChapel laid Rand down on her bed, right where Uhura had been just moments earlier. Uhura then picked up the packages of diapers, held them up, and asked her friend \"Cloth or disposable?\"</span></div></div>",
            "created":1397710800,
            "id":1781156,
            "title":"She picks cloth"
        },
        "114311112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She picks cloth",
                "She picks disposable"
            ],
            "content":"<div class=\"\"><div> <span>\"Disposable,\" Rand told the comm officer, \"They feel a little more constricting, and I really like the crinkling sound they make.\"<br>\r\n<br>\r\nUhura nodded her head and stated \"Very well.\" She placed the opened package of cloth diapers onto the counter, and then she teared open the side of the package of disposable diapers. Then she pulled out a large white diapers made of plastic. Chapel moved away a bit so that the African American room had some more room to work with.<br>\r\n<br>\r\nUhura placed the package of disposables back onto the counter. Then she turned her attention to the naked yeoman on the bed. She knelt down before her friend, unfolded the babyish garment, and told her \"Lift up.\"<br>\r\n<br>\r\nRand obeyed and allowed Uhura to slide the large diaper underneath her bottom. Chapel handed the already diapered woman the bottle of baby powder. Uhura removed the cap and sprinkled plenty of powder over Rand's crotch. She slowly began rubbing the powder into her skin. Rand softly moaned in pleasure and squirmed for a few moments, but she relaxed after that, letting her friend finish with the powder on her crotch.<br>\r\n<br>\r\nOnce her crotch was totally covered, Uhura had Rand pull her knees up to her chest so that she could spread powder all over her bottom and rub that in as well. She took her time, and she gentle caressed Rand's ass and womanhood so that she could enjoy the process. Once her entire private section was powdered up, Uhura had her lower her legs back down so that her bottom was lying right on the disposable diaper.<br>\r\n<br>\r\nUhura pulled the front padding up tight between the blonde woman's legs, and then she brought both of the sides up and fastened the tapes in place. She inspected the front of the diaper to make sure it was on securely, and once she was certain it was, she patted the front of the crotch, and she announced \"There you go, all nice and comfy.\" <br>\r\n<br>\r\nRand remained lying down to cherish this moment. The diaper was amazingly soft, and it fit her perfectly. Neither too loose nor too tight; just on well enough that she could feel it pressing up lightly against her vagina. It made her feel very hot and sexy.<br>\r\n<br>\r\nUhura and Chapel took Rand's hands and stood her up. Then they watched as she walked around the bedroom to get used to the feel of the thick bulk between her legs. Much like Uhura, her diapers were so thick that she had to resort to a waddle as well. After about a minute, she approached the mirror and admired her reflection. She delicately rubbed the front of her diaper, savoring the blissful feeling it brought her.<br>\r\n<br>\r\nNyota walked up to her from behind and patted her padded bottom, saying \"Wow, Janice; you look just as adorable in your diaper.\"<br>\r\n<br>\r\n\"Thank you,\" Rand uttered ecstatically. She looked over her shoulder at the woman in cloth diapers and announced \"Well, looks like it's time for the nurse to join her patients.\"<br>\r\n<br>\r\n\"Indeed,\" stated Uhura. She turned to the only woman in the room who was not yet diapered and commented sweetly, \"I'll bet you're actually the cutest of us in diapers, Christine.\"<br>\r\n<br>\r\n\"Only one way to find out, Nyota.\" remarked Chapel.<br>\r\n<br>\r\nIt only took one minute for the yeoman and the communications officer to get the nurse undressed. Before she knew it, her uniform, boots, bra, and panties were scattered on the floor with her colleagues' clothes. Uhura guided Chapel over to her bed and helped her get comfortable while Rand went over to the two packages of diapers and asked the naked woman \"So, what's it going to be? Cloth or disposable?\"</span></div></div>",
            "created":1397797200,
            "id":1782015,
            "title":"She picks disposable"
        },
        "11433":{
            "author_id":"whywithwords",
            "author_name":"withwords",
            "choices":[
                "Sure",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Carol Marcus?</span></div></span></div>",
            "created":1505019600,
            "id":2383936,
            "title":"Other"
        },
        "115":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Amanda Grayson",
                "Marla McGivers",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick another character</span></div></span></div>",
            "created":1346043600,
            "id":1415094,
            "title":"Other"
        },
        "12":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Deanna Troi",
                "Beverly Crusher",
                "Tasha Yar",
                "Katherine Pulaski",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which woman should be diapered?</span></div></span></div>",
            "created":1346043600,
            "id":1415045,
            "title":"The Next Generation"
        },
        "121":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the ship's counselor, Deanna Troi, wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415055,
            "title":"Deanna Troi"
        },
        "1211":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Yes, her mother",
                "Yes, someone else",
                "No, it's a secret"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does anyone else know about her interest in diapers?</span></div></span></div>",
            "created":1349586000,
            "id":1442302,
            "title":"She likes them"
        },
        "12111":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "They go to Deanna's room.",
                "They go to Lwaxana's room."
            ],
            "content":"<div class=\"\"><div> <span>Deanna Troi stood in the main transporter room of the USS Enterprise-D. She was waiting to greet her mother, the flamboyant Betazoid ambassador Lwaxana Troi.<br>\r\n<br>\r\nNormally, Deanna would feel somewhat embarrassed or exasperated to have her mother around the ship, given her previous history and behavior around the others. But this time, she was coming aboard to spend some personal time with her daughter.<br>\r\n<br>\r\nWhen Deanna was seven years old, her Human father Ian Troi died. This devastated both her and her mother. Deanna initially felt she would never be happy again. She began have accidents at night for no apparent reason other than being struck with grief.<br>\r\n<br>\r\nLwaxana decided to put her daughter into diapers at night for a short time until she could regain her control. Deanna agreed to this arrangement.<br>\r\n<br>\r\nA few weeks later, Deanna stopped have accidents. However, she had also begun to develop an interest in the diapers she wearing. She hesitantly told her mother about this, and instead of being disgusted, Lwaxana was pleased to find out; her daughter had found some solace in a simple garment.<br>\r\n<br>\r\nLwaxana continued diapering her daughter day and night often for several years after that. Deanna did not wear them every day, but she always savored her time in diapers. She and her mother were actually able to bond better when she was in diapers than when she was out of them.<br>\r\n<br>\r\nWhen Deanna turned eighteen, she entered Starfleet. Subsequently, she saw her mother less and less. But every once in a while, the two of them would meet up and spend some quality time together. Sometimes, that quality time would involve diapers.<br>\r\n<br>\r\nA few days earlier, Deanna had spoken with her mother on a long-range communication line and Lwaxana had informed her that she would be paying her a visit. Deanna was initially uncertain how to respond, but then Lwaxana assured her that this visit was explicitly for her and not for Captain Picard, Commander Riker, or anyone else on the ship.<br>\r\nNow that Lwaxana was here, Deanna could finally indulge herself. Of course, she could always diaper herself, but it just wasn’t the same thing as having her mother do it for her. She had once experimented with the Holodeck, but it still wasn’t the same thing to her; a hologram could never utilize the grace and care Lwaxana always employed.<br>\r\n<br>\r\nAside from Chief Miles O’Brien at the transporter pad, the only other person in the room was Captain Jean-Luc Picard.<br>\r\n<br>\r\n“Mrs. Troi is ready to beam aboard, sir,” O’Brien remarked.<br>\r\n<br>\r\nPicard just stated in his usual business tone “Bring her up, Mr. O’Brien.”<br>\r\n<br>\r\nThe Chief did as he was ordered and a few moments later, Lwaxana appeared on the pad. As usual, her manservant Mr. Homn was with her. In addition to Lwaxana’s usual suitcases, Mr. Homn was carrying a rather large bag over his shoulder. One he did not usually carry. Deanna had a good idea as to what was inside of it.<br>\r\n<br>\r\n“How lovely to know you’re just as excited as ever to see me, Jean-Luc,” Lwaxana remarked deviously, talking to the Captain, “But you simply must learn to control those thoughts; they’re quite unprofessional for someone of your standing!”<br>\r\n<br>\r\nCaptain Picard pretended to be amused and replied “Indeed, not my dear.”<br>\r\n<br>\r\nLwaxana quickly turned away from him and looked to her daughter. She smiled at her lovingly and said “I’m glad you’re not reluctant to have me back, darling.”<br>\r\n<br>\r\n“Of course I’m not, mother,” said Deanna, “Why would I be?”<br>\r\n<br>\r\n“Oh, you never know what could come up,” Lwaxana stated in response, “Now, shall I be shown to my quarters?”<br>\r\n<br>\r\n“Of course, madam,” stated Picard, “Come with me to-“<br>\r\n<br>\r\n“I appreciate the gesture, Jean-Luc,” Lwaxana interrupted him, “But I’d prefer to have Deanna show me to them. She and I have… something of a personal matter to see to.”<br>\r\n<br>\r\n“Very well,” Picard agreed, “If you need me, I’ll be on the bridge.”<br>\r\n<br>\r\nWith that, Picard left the transporter room. Chief O’Brien followed him close behind. This left Deanna alone with Lwaxana and Mr. Homn.<br>\r\n<br>\r\n“So, little one, where would you like to go?” asked Lwaxana.</span></div></div>",
            "created":1349586000,
            "id":1442449,
            "title":"Yes, her mother"
        },
        "121112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "cloth",
                "disposable"
            ],
            "content":"<div class=\"\"><div> <span>\"We may as well go to your room, mother,\" Deanna replied, \"After all, we need to drop off your bags.\"<br>\r\n<br>\r\n\"Indeed we do,\" Lwaxana agreed.<br>\r\n<br>\r\nThe Betazoid ambassador and her towering manservant stepped off the transporter pad. The empathic counselor led them down various corridors until they reached the turbolift. Once they were inside the turbolift and ordered it where to go, the doors shut and it began to descend.<br>\r\n<br>\r\nLwaxana looked at her daughter and told her telepathically <i>We're going to have a wonderful time together, darling.</i><br>\r\n<br>\r\nDeanna smiled at her mother and replied back <i>I certainly hope so; I've been looking forward to this.</i><br>\r\n<br>\r\nSoon, they arrived on the deck where Lwaxana normally stayed when she was on board the Enterprise. They made their way through the hallways until they finally arrived at Lwaxana's reserved quarters. Deanna entered the security key into the console outside the door and it let them in.<br>\r\n<br>\r\nDeanna, Lwaxana, and Mr. Homn stepped inside. As soon as Homn set the suitcases down, Lwaxana said \"That will be all for now, Mr. Homn. My daughter and I will like some time alone.\"<br>\r\n<br>\r\nAt first, Mr. Homn seemed uncertain about leaving his mistress alone; as she had been abducted by the Ferengi the last time he had done so.<br>\r\n<br>\r\n\"Ten-Forward is always open,\" Deanna informed him, \"I'm certain Guinan's inventory will appease you, Mr. Homn.\"<br>\r\n<br>\r\nAt the suggestion of having a few drinks, Mr. Homn's uncertainty was purged. He bowed to his mistress and her daughter and left the room. As soon as he stepped out, Deanna ordered the computer to lock the doors and to only open them under her security code.<br>\r\n<br>\r\nNow that Deanna and her mother were alone, they could finally bond.<br>\r\n<br>\r\nDeanna turned to her mother and saw her opening up her new bag.<br>\r\n<br>\r\n\"You're going to love what I've brought you, darling,\" Lwaxana remarked.<br>\r\n<br>\r\nLwaxana then removed two transparent packages  from her bag. One of them was full of cloth diapers; the other was full of disposable diapers.<br>\r\n<br>\r\nLwaxana set them down on the bed and told her daughter \"I had these made exclusively for you; they're your exact size down to the nanometer.\"<br>\r\n<br>\r\nDeanna was impressed. \"How did you manage that, mother?\"<br>\r\n<br>\r\n\"I know this one organization that actually makes diapers for people of all ages, sexes, and species,\" Lwaxana remarked, \"What is rather interesting is that only a very small percentage of them are for people with incontinence or bed-wetting problems. There are many more diaper lovers than we ever thought existed.\"<br>\r\n<br>\r\n\"Thank you so much for them,\" Deanna said gratefully.<br>\r\n<br>\r\n\"You shouldn't thank me yet, dear,\" said Lwaxana, \"Now how about you let your mother get you out of that restrictive uniform and into something much softer and more comfortable?\"<br>\r\n<br>\r\n\"I'd like that very much,\" said Deanna.<br>\r\n<br>\r\nShe walked over to her mother and stood right next to her.<br>\r\n<br>\r\n\"Before I get you undressed, would you like to try a cloth or a disposable first?\" asked Lwaxana.<br>\r\n<br>\r\nDeanna decided to try out <br>\r\n</span></div></div>",
            "created":1349672400,
            "id":1443039,
            "title":"They go to Lwaxana's room."
        },
        "1211121":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Lwaxana sings to Deanna.",
                "Lwaxana brushes Deanna's hair."
            ],
            "content":"<div class=\"\"><div> <span>\"I'd like to try on a cloth diaper first,\" Deanna decided, \"They're a little softer and less noisy than the disposables.\"<br>\r\n<br>\r\n\"I'm inclined to agree,\" remarked Lwaxana.<br>\r\n<br>\r\nDeanna wanted to ask what her mother meant, but decided not to, as it did not seem to matter at all to her.<br>\r\n<br>\r\n\"Now, let's get you undressed,\" stated Lwaxana.<br>\r\n<br>\r\nWith that, she brought her hands up to Deanna's back and pulled down the short zipper on the top of her catsuit. Once it was down all the way, Deanna took her arms out of her sleeves. Now she was topless. She did not normally wear a bra when she was in uniform, as her catsuits did a fair job of securing her cleavage on their own.<br>\r\n<br>\r\nAs Deanna stepped out of her boots, Lwaxana pulled the lower part of her catsuit down to her ankles. Deanna stepped out of it. Now she stood naked in front of her mother.<br>\r\n<br>\r\nLwaxana took two cloth diapers and unfolded them. Once they were together, she set them out on the large bed and told her daughter \"Lie down.\"<br>\r\n<br>\r\nDeanna did not need to be told twice. She sat her curvaceous bottom down on the soft garments and laid her back onto the bed. Lwaxana kneeled before her and said \"That's a good girl.\"<br>\r\n<br>\r\nLwaxana then removed some baby powder from the bag. She sprinkled some of it over Deanna's freshly-shaven private region and lightly rubbed it in. Deanna moaned in pleasure.<br>\r\n<br>\r\nLwaxana then removed a small box of pins from the bag and removed four of them. She instructed Deanna \"Spread your legs apart.\"<br>\r\n<br>\r\nDeanna did just this. Lwaxana took the front of the diapers and pulled them up snugly between her daughter's legs. The top of the diapers came all the way up to Deanna's navel. Lwaxana then took two of the pins and pulled the left side of the diapers up over Deanna's left hip. Then she pinned that side snugly up. She did the same thing with the other two pins on the right side of the diapers over Deanna's right hip. Once all four pins were in place, Lwaxana inspected the diapers to make certain that they were on perfectly. Once she was satisfied with her work, she smiled and said \"All done. How do they feel?\"<br>\r\n<br>\r\nDeanna was undergoing tremendous ecstasy at that moment. She had not felt this happy in a very long time. She looked up at her mother and replied \"They feel wonderful, mother. Just wonderful.\"<br>\r\n<br>\r\nLwaxana remained smiling and said \"I'm happy you like it. What would you like to do now?\"</span></div></div>",
            "created":1349672400,
            "id":1443053,
            "title":"cloth"
        },
        "1212":{
            "author_id":"hyro",
            "author_name":"Hyro",
            "choices":[
                "Her mother",
                "Commander Riker",
                "An omnipotent alien entity"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who forces Counselor Troi into diapers?</span></div></span></div>",
            "created":1396846800,
            "id":1775102,
            "title":"She is forced into them"
        },
        "1213":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "She unexpectedly visits a parallel dimension",
                "It’s an experimental new therapy technique",
                "Some other cause"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does the councilor of the enterprise end up back in diapers</span></div></span></div>",
            "created":1543035600,
            "id":2581442,
            "title":"Other reasons"
        },
        "12131":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "On her home planet Betazoid",
                "Still on Enterprise but things seemed different"
            ],
            "content":"<div class=\"\"><div> <span>Deanna Troi was walking the halls of the enterprise minding her own business when suddenly space seemed to shift around her. Her vision rippled like a mirage as things started to change. Her standard issue catsuit gave way as it became a ruffled sun dress that only reached down to her mid waist. Underneath this new dress her underwear blew up like a balloon until it was a soft cushy baby diaper scaled up to her size The band she used to tie her hair back was replaced with a few hair clips made to looke like flowers. Her feet were now wrapped in some kind of baby booties instead of her normal footwear. And her comm badge had become a pacifier with the same starfleet insignia on the front on the end of a string connected to the front of her dress in the same place her comm badg had been affixed to her catsuit.<br>\r\n<br>\r\nAs Deanna tried to make sense of what had happened she really she was...</span></div></div>",
            "created":1543035600,
            "id":2581446,
            "title":"She unexpectedly visits a parallel dimension"
        },
        "121312":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Sick bay. Doctor Crusher might be able to find some kind of solution or answers",
                "10 forward. To get full scope of these changes by observing a populated area"
            ],
            "content":"<div class=\"\"><div> <span>Deanna was taken aback by the sudden change, stumbling back in shock as she tried to understand what had just happened. She looked around to see if anything else had changed, had she been abducted, had she blacked out and lost who knows how much time, was the ship itself damaged. But when she looked around she saw it was the same corridor she was in before and no time seemed to have past. Everything seemed normal, aside from the fact that she was now dressed like a baby.<br>\r\n<br>\r\nAt that moment a female ensign turned the corner in front of Deanna dressed just as ridiculously as she was. The ensign wore a sun dress just like the councillors, except hers was a sea foam green where as Trois was a maroonish purple and pink. The same went for the womans baby booties and the hair ties that held her shoulder length hair in a set of high pigtails. She also had the same kind of diaper councillor Troi wore, and with the better view of the diaper on another person Deanna could see it was dotted with stars ringed planets and a starship flying through them. She even had the same star fleet insignia pacifier, however she was sucking on hers.<br>\r\n<br>\r\nAnd that was the strangest part, none of these things seemed to bother her in the slightest. She was carrying on as if none of this was at all out of the ordinary. Deanna could detect nothing but normal emotions if not contentment.<br>\r\n<br>\r\n\"Hebbwo counciwow,\" she gave a friendly if not muffled greeting before removing her pacifier to deliver a clearer statement. \"Is everything alright councillor, you seem distressed?\"<br>\r\n<br>\r\n\"Oh, uh, yes I'm quite alright\" she stammered back. \"It's just that I... well...\"<br>\r\n<br>\r\n\"Say no more ma'am\" she said with almost a knowing look \"it's bad enough when I'm cranky, hungry, need a nap, change whatever. I can't imagine having to put up with those feelings from a whole ship full of littles.\" And with that she returned the pacifier to her partially drooly mouth and continued to waddle along on her way, giving councillor Troi a good look at the sizeable starfleet insignia plastered across the back of her diaper and ergo her diaper. For the next five seconds all the Betazoid woman could do was blush.<br>\r\n<br>\r\nThen the questions came rushing in. Was she considered like a baby now, was everyone on the enterprise, why did that seem normal to that ensign, had things always been like this, had she gone completely mad? She needed to find out what was going on. And thankfully she was near a place that could give at least some answers.<br>\r\n<br>\r\nWhere does she go?</span></div></div>",
            "created":1543294800,
            "id":2582548,
            "title":"Still on Enterprise but things seemed different"
        },
        "122":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the ship's Chief Medical Officer, Dr. Beverly Crusher, wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415058,
            "title":"Beverly Crusher"
        },
        "1221":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She replicates some.",
                "She hides them under her bed.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Dr. Beverly Crusher was in the Infirmary. She was working on a report to Captain Picard about the most recent patients she had treated in Sickbay. There weren't many, thankfully, so the report was short.<br>\r\nShe was eager to get back to her quarters once this shift was over. Wesley had volunteered to take a double shift on the bridge, as Worf was busy with Commander Riker on a reconnaissance mission and this provided the aspiring protege with an opportunity to get more experience in.<br>\r\nAdding to that the fact that Beverly had the entire afternoon off, she was looking forward to some personal time to indulge herself in a longtime desire of hers.<br>\r\nEver since Beverly was a little girl, she had a strange fascination for diapers. She never told anyone about it, as she feared negative reception from her peers. But she had a strange desire to wear them. During her Academy years, she would occasionally go out and buy some, trying to let them last as long as possible.<br>\r\nIt wasn't until Wesley was born that she had a legitimate reason to have diapers in her house. And with her husband Jack away a lot, she was free to wear them whenever she pleased.<br>\r\nAfter Jack's death, it became harder and harder for Beverly to indulge herself, as she had to care for both her son and herself full-time.<br>\r\nBut every now and then, she took the time to give in to her desires.<br>\r\nOnce her report was finished and she submitted it to the Captain, she got up and went out into Sickbay. She told her assistant Nurse Ogawa \"Alyssa, you're in charge til I get back.\"<br>\r\nOgawa smiled and said \"You got it, Doctor.\"<br>\r\nBeverly hastily departed Sickbay and made her way over to her quarters. As soon as she got there, she said \"Computer, seal door and inform me in advance if anyone comes by.\"<br>\r\n\"Acknowledged,\" stated the computer.<br>\r\nBeverly made her way to her room and prepared herself for a wonderful afternoon.<br>\r\nWhere does she get the diapers?</span></div></div>",
            "created":1346475600,
            "id":1418741,
            "title":"She likes them"
        },
        "1222":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Some kind of virus or disease she comes across",
                "Some Q like entity (or maybe just Q)",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Forced By what?</span></div></span></div>",
            "created":1542862800,
            "id":2580481,
            "title":"She is forced into them"
        },
        "12221":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "She had a visitor",
                "She looked over the toys"
            ],
            "content":"<div class=\"\"><div> <span>Doctor Beverley Crusher sighed to herself. While on an away mission to an alien planet she had been exposed to an unknown pathogen that had given her what locals refer to as infants flu. Thankfully it wasn't a life threatening ailment but it wasn't without it's embarrassing side effects. For the following week until the virus leaves her system her motor skills will be acutely duller, her attention span will become shorter and overall more simplistic. and her bladder and bowel control will be practically nonexistent.<br>\r\nThe planets inhabitants had been dealing with this virus for so long that the populace had developed an immunity. But when the human anatomy had no such defenses, leaving Dr crushed completly vulnerable to the virus. Thankfully the disease was detected as soon as she had beamed aboard, and Beverley was the only one who seemed to have contracted it. After the doctor had been placed into quarantine the enterprise contacted the planets surface the situation had been sorted out.<br>\r\nThe disease had been dubbed infants flu because the symptoms combined would lead to brief episodes of behaving like a baby or small child. As far as they could gather the only cure was to let the illness pass in its own time in quarantine, kept in diapers to contain all practically guaranteed accidents with toys made to entertain babies for when she experiences her episodes of mental regression, and the bulk of her meal in the form of baby bottles and pureed mush. <br>\r\nSo here she was, sitting in her quarters with enough thicker than standard issue Starfleet medical diapers and baby toys to last her for days trying to figure out how to pass the time when...</span></div></div>",
            "created":1543208400,
            "id":2582189,
            "title":"Some kind of virus or disease she comes across"
        },
        "122211":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Councilor Troy ",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Dr Crusher sighed as she poked at the front of her diaper in boredom. They were supposed to be adult diapers but they reminded Beverly too much of the baby diapers She used to put her son Wesley in when he was a baby. The doctor grimaced at the idea of her own son seeing her like this, or god forbid unable to do anything but shake a rattle, drool cry and make messes in her pants. What would he say, what would he do, would he be willing to... change her?<br>\r\nShe shot to her feet and started pacing (with a slight regrettable toddle) around her quarters, trying to ignore her own crinkling. She couldn’t let herself think of this. Wesley wouldn’t see her like this, he was off at star fleet academy. She almost wished for an episode of temporary infantile insanity to set in so she could at least enjoy her affliction for a bit.<br>\r\nThat was when the door chime broke through the panicked crinkling in the room.<br>\r\n“Ent- I MEAN HOLD ON”  Dr Crusher quickly corrected herself when she realized she wasn’t wearing any pants. She quickly grabbed a fresh pair of uniform pants, and with a bit of effort (from both her waists extra volume and her fingers lack of dexterity. Once fully dressed the Doctor approached the door and said “Now you can enter.<br>\r\nThe Doctor was able to receive guests for a short time with limited unprotected contact.<br>\r\n<br>\r\nThe door opened and_____ entered.</span></div></div>",
            "created":1549083600,
            "id":2611831,
            "title":"She had a visitor"
        },
        "1222112":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Her son Wesley",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else came to visit the sick Doctor</span></div></span></div>",
            "created":1549083600,
            "id":2611832,
            "title":"Someone else"
        },
        "123":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the ship's Security Chief, Natasha Yar, wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415056,
            "title":"Tasha Yar"
        },
        "1233":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Misunderstanding",
                "Incontinence",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick another reason:</span></div></span></div>",
            "created":1348894800,
            "id":1437222,
            "title":"Other reasons"
        },
        "12331":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Data",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Lieutenant Natasha \"Tasha\" Yar woke up in her crew quarters on the Starship Enterprise. She had gone to bed early last night due to the exhausting task of evacuating a colony from near the Cardassian border. However, she always woke up early every day to get her work started as quickly as possible.<br>\r\nShe shifted in her bed under her sheets for a moment. Then she realized something.<br>\r\nShe wasn't wearing a top.<br>\r\n<i>Isn't that odd?</i> She thought to herself. <i>I could have sworn I fell asleep in my uniform last night.</i><br>\r\nShe sat up a little and pulled the covers down to her stomach. Her shoulders, arms, and chest were in fact bare. Her womanly, full-developed breasts were completely uncovered. She sat still for a moment and then just shrugged.<br>\r\nHowever, something else caught her attention. When she moved, she heard a distinct crinkling sound, like plastic. She also felt something soft rubbing up against her clitoris. It was a very gentle sensation, but she had no idea what it was. She pulled back the covers and was surprised by what she saw.<br>\r\nShe was naked except for a thick white disposable diaper. The diaper was large enough to cover her entire crotch and bottom, and when Tasha moved her hips, she noticed that the diaper fit her frame perfectly.<br>\r\n\"What's going on?\" she said aloud.<br>\r\nThe security chief thought about reporting this, but only for a moment; she quickly realized how ridiculous she would appear to be if she mentioned something like this so hastily.<br>\r\nShe slowly turned to the side of the bed and got onto her feet, the diaper rustling softly as she did so.<br>\r\nIt was then that she noticed someone was in the room with her. It was...</span></div></div>",
            "created":1348894800,
            "id":1437227,
            "title":"Misunderstanding"
        },
        "123311":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "she was amused",
                "she was disgusted"
            ],
            "content":"<div class=\"\"><div> <span>The Enterprise's Second Officer, Lieutenant Commander Data was standing near the couch, looking over the contents of a PADD. He looked up for a moment and noticed that Lieutenant Yar was up.<br>\r\nHe remarked \"Ah, good morning, Tasha\" in his usual monotone voice.<br>\r\nLieutenant Yar found it odd that Data did not seem surprised that she was in a diaper. He was just as emotionless as ever. Tasha brushed her hair out of her forehead and asked her fellow officer \"Data, do you notice anything strange about my appearance?\"<br>\r\nThe android replied \"No, Lieutenant. Based on what I already know, every Human female looks exactly the same when she wakes up as when she goes to bed. Only a little less... organized, perhaps.\"<br>\r\n\"No, that's not what I meant,\" she said, \"Why am I wearing a diaper?\"<br>\r\n\"Because I put you in it,\" Data told her.<br>\r\nTasha was alarmed by his response. \"Data, why did you do that?\"<br>\r\n\"I was merely carrying out your request, Tasha,\" he replied.<br>\r\n\"What request?\" she asked, confused.<br>\r\n\"Do you not remember last night?\" Data stated.<br>\r\nHe then explained what he meant...<br>\r\n<br>\r\n*flashback to the previous night, still in Tasha's quarters.*<br>\r\nTasha and Data were sharing a meal together. Even though Data did not require to eat or drink, he had the ability to partake in consumption of them. Despite having no taste buds and no sense of hot or cold, he acted as if he enjoyed it all.<br>\r\nTasha had had a little too much to drink. Instead of using the traditional syntheholic beverages that accommodated replicated meals, she had gotten some authentic wine from the cargo hold. After her fourth glass, she started to act a little strangely.<br>\r\nOnce the meal was done, Tasha stood up and walked over to Data. She sat down in his lap and wrapped her arms around him.<br>\r\nData asked in mild concern \"Are you feeling alright, Lieutenant?\"<br>\r\nTasha just scoffed and said \"Data, this isn't the bridge. We're off-duty and in my quarters; you can call me 'Tasha.'\"<br>\r\n\"Very well,\" Data agreed, \"Are you feeling alright... Tasha?\"<br>\r\nShe responded by pressing her lips against his. She let her soft, pink Human lips touch his rough, rubbery metallic ones. Data did not change his expression, as he was not entirely certain how to react to what Tasha was doing.<br>\r\nWhen Tasha came apart, she smiled at Data and said \"Data, I want to talk to you about love.\"<br>\r\n\"I am already well-versed in the different concepts of love, Tasha,\" stated the android, \"There is platonic love, familial love, romantic love, infatuation-\"<br>\r\n\"Let's stop at romantic love,\" Tasha cut him off, \"I want you to tell me something.\"<br>\r\n\"What would  you like me to tell you?\" he inquired.<br>\r\nShe smiled and said seductively \"Tell me I'm your baby.\"<br>\r\nData raised an eyebrow and remarked \"What do you mean?\"<br>\r\n\"Just say I'm your baby,\" Tasha repeated.<br>\r\nData was confused by this odd request, but he wanted to please Tasha so, he said \"Tasha, you are  my... baby.\"<br>\r\nShe smiled and said \"Treat me like I was your baby, Data. I want to be your 'baby.'\"<br>\r\nData was once more stunned, but merely replied \"If that is what you wish, than I shall do just that.\"<br>\r\nTasha stated \"Thank you.\"<br>\r\n*end of flashback*<br>\r\n<br>\r\nTasha vaguely recalled all of the previous night's events. But she remembered nothing after saying \"Thank you\" to Data other than getting into bed.<br>\r\nData was still explaining: \"After you thanked me, you asked me to help you into bed. I did just this, and as soon as you were lying down, you fell asleep. I decided to go ahead and carry out your request to be my 'baby.' So I replicated a few diapers to fit your specific measurements, removed your uniform, and put you in one of the diapers. Of course, that is only a start; I am currently contemplating other ways to carry out your request.\"<br>\r\nTasha sat other bed, taking in everything Data told her. Once he was finished with his explanation,<br>\r\n</span></div></div>",
            "created":1349586000,
            "id":1442314,
            "title":"Data"
        },
        "124":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the ship's former Chief Medical Officer, Katherine Pulaski, wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415057,
            "title":"Katherine Pulaski"
        },
        "125":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Ro Laren",
                "Keiko O'Brien",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick one of the minor characters</span></div></span></div>",
            "created":1346043600,
            "id":1415046,
            "title":"Other"
        },
        "1253":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Sonia Gomez",
                "Alyssa Ogawa",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick another character</span></div></span></div>",
            "created":1346130000,
            "id":1415840,
            "title":"Other"
        },
        "13":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Kira Nerys",
                "Jadzia Dax",
                "Ezri Tigan Dax",
                "Kasidy Yates",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which woman should be diapered?</span></div></span></div>",
            "created":1346043600,
            "id":1415050,
            "title":"Deep Space 9"
        },
        "131":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the Station's First Officer, Colonel Kira Nerys, wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415063,
            "title":"Kira Nerys"
        },
        "1313":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She is under a lot of stress",
                "She has accidents",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick another reason:</span></div></span></div>",
            "created":1346389200,
            "id":1417737,
            "title":"Other reasons"
        },
        "132":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the Station's Science Officer, Lieutenant Commander Jadzia Dax, wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415064,
            "title":"Jadzia Dax"
        },
        "133":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the Station's Counselor, Lieutenant Ezri Tigan Dax, wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415066,
            "title":"Ezri Tigan Dax"
        },
        "1333":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Unfortunate side effects",
                "Baby therapy",
                "Some other reason"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Could incontinence be a side affect of her rushed bonding to the Dax symbiote.<br>\r\n<br>\r\nOr maybe it's some experimental new form of therapy</span></div></span></div>",
            "created":1553317200,
            "id":2633796,
            "title":"Other reasons"
        },
        "134":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would Freighter Captain Kasidy Yates wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415067,
            "title":"Kasidy Yates"
        },
        "135":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Leeta",
                "Keiko O'Brien",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick another character</span></div></span></div>",
            "created":1346043600,
            "id":1415091,
            "title":"Other"
        },
        "1351":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She is aroused by them",
                "She has been having accidents",
                "Other reason"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why is the shy and sensitive yet sweet and caring dabo girl in diapers?</span></div></span></div>",
            "created":1424581200,
            "id":1938528,
            "title":"Leeta"
        },
        "13511":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Leeta plans her evening",
                "Leeta takes a nap"
            ],
            "content":"<div class=\"\"><div> <span>It had been a long day of work at Quark's bar, and Leeta felt rather exhausted. Luckily, she was not too tired to indulge herself in her favorite private hobby.<br>\r\n<br>\r\nOnce her shift ended, she left the Promenade and made her way to her quarters. When she got there, she instructed the computer mainframe to lock the door and only unlock it on her word.<br>\r\n<br>\r\nAfter that, she knelt down to her bed and pulled out a box. Inside the box were two stacks of diapers; one of cloth, one of disposable. She decided to go with the latter this time.<br>\r\n<br>\r\nOnce she had the diaper out, she placed it on her bed. Looking around the room nervously, she started undressing and gradually stripped down to nothing. She lay down on the bed and picked the diaper up again. After unfolding it, she lifted her butt off the bed and put the back end of the diaper under her. Then she laid back down and moved in place. Pulling the front of the diaper up between her spread legs, she took a moment to enjoy the wonderful thickness. It made her wet with excitement. Grinding her hips slowly, she pushed her butt farther into the diaper and rubbed her moist clitoris through the plastic thickness. It was the most pleasant feeling she had ever experienced, and she had experienced many, many times before. Each new time was just as pleasant as the one preceding it.<br>\r\n<br>\r\nWhen she was sufficiently satisfied, she lay there sweating, and breathing deeply. When she managed to catch her breath, she began to notice that she was getting cold, and finished diapering herself. She pulled the diaper snugly between her legs, and used the two large tapes to fasten it. Sitting up first, Leeta bounced up and down slightly. She felt like she was wearing - and sitting on - a pillow at the same time. It felt awesome and invigorating. She stood up and walked over to her full length mirror, waddling a bit in the thick diaper. She stood there a while, admiring herself and her attire. Turning around, she rubbed her hands over her thickly padded butt, and squeezed the material in her fingers. She could feel the diaper pushing her legs apart and rubbing against the backs of her legs, and loved every second of it</span></div></div>",
            "created":1424581200,
            "id":1938539,
            "title":"She is aroused by them"
        },
        "135112":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "She was well rested and needed a diaper change ASAP",
                "Something woke her up early"
            ],
            "content":"<div class=\"\"><div> <span>Leeta giggled and cooed at herself for a few more minutes as she stared into the mirror for a few more minutes until she let out a yawn.<br>\r\n<br>\r\n“Leeta sleepy” the dabo girl mumbled to herself and rubbed her eye as she had slipped into a much more babyish headspace “me go nap nap time” and without any ceremony she took a few clumsy steps and flopped down into her bed. After that she reached over for her trusty stuffed animal, held it against her bare chest while sucking her thumb all with the same arm and reached her free appendage down to lazily rub the front of her diaper as she gently fell asleep snoring and drooling<br>\r\n<br>\r\nWhen she woke up...</span></div></div>",
            "created":1600801440,
            "id":2908200,
            "title":"Leeta takes a nap"
        },
        "1352":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Transporter accident",
                "She just likes them",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Now why would the wife of the stations head engineer, mother of two and accomplished botanist, Keiko O’Brien go back to wearing diapers?<br>\r\n<br>\r\nCould she have suffered a transporter accident, temporarily scrambling her brainwaves. Effectively reducing her to the mentality of a big baby while leaving her personality and memories in tact.<br>\r\n<br>\r\nOr perhaps she just likes to wear diapers as some kind of therapeutic stress relief. She does typically have a lot on her plate. And who knows, some time in diapers and maybe a few other babyish things could be just what the doctor ordered</span></div></div>",
            "created":1600802640,
            "id":2908216,
            "title":"Keiko O'Brien"
        },
        "13521":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "“Goo goo gaga” (instant baby brain)",
                "“Miles?” (It’s a gradual decline)"
            ],
            "content":"<div class=\"\"><div> <span>The bridge of deep space nine was frantic with activity as up on the view screen a runabout spiraled out of control with one thruster completely dead and the other severely overactive. One crewman in particular, Miles O’Brien, was worked up into a panic as the only person left on the ship was his wife Keiko. She was just returning from a long research trip on when her shuttle had not only completely malfunctioned but after everyone had been beamed away they just couldn’t get a lock on Keiko.<br>\r\n<br>\r\nO’Brien was rapidly rotating from frequency to frequency trying to pull her out as the runabout grew closer and closer to overloading. Eventually he found a frequency that gave them the closest thing to a lock he’d found so far,  it it was flickering in and out, the timing would have to be perfect. So without any other options the head engineer took a deep breath and engaged.<br>\r\n<br>\r\nAnd after a nerve wracking instantaneous moment the transporter pad just beside the bridge whirred to life and the glowing mass of light took shimmered into existence before taking the shape of his beloved wife slumped over on the gound.<br>\r\n<br>\r\nAs soon as she was close to home Miles wasted no time rushing to her side “Keiko? Keiko can you here me!?” Her called to her as he caressed the side of her head, completely ignoring the wet spot slightly visible on her dress.<br>\r\n<br>\r\nThe botanists eyes fluttered open as she looked up at her husband and said... </span></div></div>",
            "created":1600838760,
            "id":2908466,
            "title":"Transporter accident"
        },
        "135212":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "A pair that is practical yet rather thick",
                "A rather childish pair"
            ],
            "content":"<div class=\"\"><div> <span>“Miles?” Keiko moaned as she stirred from unconsciousness in her husbands arms “I... I think I wet myself” <br>\r\n<br>\r\nSoon after keiko was sat down in sick bay as she was examined by doctor Bashir. “There seems to be some kind of discrepancy in your brain waves, it doesn’t seem life threatening but I’ll have to cross reference it with your previous records to be sure as to what it means.” Julian explained as he gestured to her charts and readings. “As for your... other symptoms, I haven’t been able to find any damage to your bladder. But non the less your control has certainly diminished, so I’ll be prescribing you some medical briefs for the time being”<br>\r\n<br>\r\n“Diapers?” Keiko said indignantly, a slight blush on her cheeks as the absorbent pad between her and her chair crinkled whenever she adjusted herself.<br>\r\n<br>\r\n“Well, yes. But it’s only for a short time until I can determine what treatment to administer. I’ll allow you a moment alone with your options to decide.” With that Julian wheeled out a cart with an assortment of different diapers in all shapes sizes and designs before leaving the mother her privacy.<br>\r\n<br>\r\nKeiko hesitated for a moment before picking up the first diaper. The soft material felt interesting in her hands, almost mesmerizing. Squeezing the soft rectangle between her fingers, shaking it slightly to hear the gentle crinkling and before she could think about what she was doing she put it in her mouth. Quickly realizing what was happening Mrs O’Brien quickly removed the diaper from her mouth and wiped the drool away from her lips.<br>\r\n<br>\r\nWith her mind now cleared by the shock, Keiko focused on her decision, occasionally sucking her thumb without noticing.<br>\r\n<br>\r\nWhat diapers do Keiko choose?<br>\r\n</span></div></div>",
            "created":1600885680,
            "id":2908735,
            "title":"“Miles?” (It’s a gradual decline)"
        },
        "14":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Kathryn Janeway",
                "B'Elanna Torres",
                "Seven of Nine",
                "Kes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which woman should be diapered?</span></div></span></div>",
            "created":1346043600,
            "id":1415051,
            "title":"Voyager"
        },
        "141":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would Captain Kathryn Janeway wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415054,
            "title":"Kathryn Janeway"
        },
        "1412":{
            "author_id":"hyro",
            "author_name":"Hyro",
            "choices":[
                "She's stuck in a holodeck program gone wrong.",
                "She is hit by an alien weapon causing incontinence.",
                "Another crewmember blackmails her into wearing them."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who or what forces Captain Janeway into diapers?<br>\r\n</span></div></span></div>",
            "created":1346648400,
            "id":1419737,
            "title":"She is forced into them"
        },
        "14123":{
            "author_id":"hyro",
            "author_name":"Hyro",
            "choices":[
                "Chakotay",
                "Tom Paris"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which crewmember blackmails Captain Janeway into diapers?<br>\r\n</span></div></span></div>",
            "created":1346648400,
            "id":1419739,
            "title":"Another crewmember blackmails her into wearing ..."
        },
        "141232":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Let me dominate you",
                "Let me spank you"
            ],
            "content":"<div class=\"\"><div> <span>Kathryn Janeway was in her quarters, reading a book from Earth's 21st century when the door to her room chimed. She slowly looked up and called out \"Come in!\"<br>\r\n<br>\r\nThe door opened to reveal her Navigator, Lieutenant Tom Paris. Janeway smiled up at him and said \"Good evening, Tom. Come on in.\"<br>\r\n<br>\r\nHe smiled back at her and stepped inside, the door sliding shut behind him.<br>\r\n<br>\r\n\"Do you have a moment, Captain?\" asked the Helmsman.<br>\r\n<br>\r\n\"Certainly, take a seat,\" Janeway responded, gesturing for him to sit down at a chair across from the couch.<br>\r\n<br>\r\nTom walked across the room and sat down. He was holding a PADD in his hands. He seemed abnormally rigid for someone with a reputation as a joker.<br>\r\n<br>\r\n\"How're B'Elanna and Miral doing?\" Janeway asked him.<br>\r\n<br>\r\n\"They're doing fine. B'Elanna is still on duty, so Samantha Wildman offered to look after Miral for a while,\" was his answer.<br>\r\n<br>\r\nJaneway decided to give Tom her undivided attention. She bookmarked her spot in the book and put it off to the side. Then she asked Tom \"What can I do for you?\"<br>\r\n<br>\r\n\"Captain, I was just spending a bit of my off-duty time working on a program that B'Elanna, Miral, and I could all enjoy as a family,\" Lieutenant Paris explained, \"However, when I was saving the file. I came across something very interesting.\"<br>\r\n<br>\r\n\"What do you mean?\" inquired Janeway.<br>\r\n<br>\r\nTom did not answer verbally; he merely held out the PADD and she took it.<br>\r\n<br>\r\n\"What's this?\" Kathryn asked as she examined its contents.<br>\r\n<br>\r\n\"I was hoping you could tell me that,\" Tom replied.<br>\r\n<br>\r\nJaneway was a little confused at first. But soon, she quickly realized what it was that Tom had found. These were some of her top secret programs that were restricted from all other members of the crew. She had saved them under a special file in the Holodeck. She had used a special encryption key, so she did not bother going to great lengths to hide them. However, she had foolishly underestimated Tom Paris' determination and skill with Holodeck programs.<br>\r\n<br>\r\nShe anxiously looked up at her helmsman, who was smirking slightly. He told her \"I know they were saved under your name, Captain. I know what these programs basically involve. But I was hoping you could explain them to me.\"<br>\r\n<br>\r\nJaneway was stunned. Unbeknownst to the crew, she had an almost insatiable desire to be dominated, controlled, or ordered around by younger men. This was not only because she - as the ship's Captain - wanted to see a command hierarchy from a lower position of power, but also because they were some sort of sexually-motivated yearning of hers. The Holodeck was the closest thing she had had to living out these fantasies.<br>\r\n<br>\r\nJaneway did not speak a word at first, but her silence told Tom plenty. He raised an eyebrow and remarked \"It would appear as though even my superiors have their own secrets and fantasies.\"<br>\r\n<br>\r\nThen Kathryn covered her eyes with one of her forearms and began to sob. Tom was surprised by this. His Captain was the strongest woman he knew; he had never seen her break down like this.<br>\r\n<br>\r\n\"Captain, it's alright. There's nothing to be ashamed of. EVERYONE has their own deep personal desires.\" Tom tried to reassure her. Then he added in, \"Although, based off of what little of your programs I saw, I must say; I've never known anyone with THAT sort of desire-\"<br>\r\n<br>\r\n\"Tom, you can't tell anyone about this!\" Janeway interrupted, wiping her eyes.<br>\r\n<br>\r\nOnce more, Tom was surprised. In the past, the Captain would always calmly and orderly give out commands for her officers to carry out. Now, she was not commanding Tom Paris. Not she was PLEADING with him. Tom had an idea.<br>\r\n<br>\r\n\"Captain, I wasn't going to tell anyone,\" he told her, \"But out of curiosity, what would you do to keep me quiet?\"<br>\r\n<br>\r\nJaneway looked up at Tom and thought about those words. She quickly realized that her navigator had leverage of her.<br>\r\n<br>\r\nShe decided to approach his question carefully and asked him \"What do you want me to do?\"<br>\r\n<br>\r\nTom replied \"I think I'll let you live out some of your programs. To start with, I want you to</span></div></div>",
            "created":1348376400,
            "id":1433932,
            "title":"Tom Paris"
        },
        "1412322":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "He still spanks her",
                "He relents"
            ],
            "content":"<div class=\"\"><div> <span>\"I want you to let me spank you,\" Tom replied.<br>\r\n<br>\r\nKathryn seemed stunned by this request. But she knew she had little choice. After thinking about it for only a few moments, she said \"Alright then. Just one moment.\"<br>\r\n<br>\r\nShe looked up and said \"Computer, soundproof the door and the walls.\"<br>\r\n<br>\r\n\"Acknowledged,\" replied the monotone voice of the computer mainframe.<br>\r\n<br>\r\nJaneway turned to Paris and gazed at him. Tom noticed that she did not seem all that reluctant. In fact, it almost appeared as though she was containing a great deal of excitement.<br>\r\n<br>\r\nShe slowly walked up to Tom and he suddenly reached up and grabbed the top of her uniform pants.  He pulled them down quickly and in an instant, they were down around her ankles.<br>\r\n<br>\r\n\"My pants!\" Janeway cried.<br>\r\n<br>\r\n\"You're not old going to need them for this,\" he said.<br>\r\n<br>\r\nShe couldn't believe she was standing there in from of her navigator, pants pulled down.<br>\r\n<br>\r\nShe was not some bimbo in a voyeur-inspired Holodeck program!<br>\r\n<br>\r\nTom caressed her smooth, long, nicely-formed legs.<br>\r\n<br>\r\n\"This is better; trust me\", he said.<br>\r\n<br>\r\nHe began to massage her center, and she could only stand there, partly supported by him as his hands explored her most private places.<br>\r\n<br>\r\n\"Ah, oooooohh!\" she moaned.  \"TOM!\"<br>\r\n<br>\r\n\"Say my name!\" he commanded, continuing to caress her.<br>\r\n<br>\r\n\"What.... Why?\" she said breathlessly, squirming and wiggling in her place, her hands braced on her knees.<br>\r\n<br>\r\n\"Let me hear it!\" he shouted suddenly, snaking his hand under the waistband of her panties.<br>\r\n<br>\r\n\"Fine, I'll do it!\" she squealed, waves of pleasure engulfing her.<br>\r\n<br>\r\nHis hands continued their ruthless exploration.  She began to coo.  <br>\r\n<br>\r\n\"I want....  I want...\" she said between sighs.<br>\r\n<br>\r\n\"What do you want?\" he said, showing her no mercy.<br>\r\n<br>\r\n\"Treat me....  Treat me like...\" she gasped out, her orgasm near.<br>\r\n<br>\r\n\"Treat you like what?\" he asked, his hands moving faster.<br>\r\n<br>\r\n\"Ahhhhhhh!\" she cried.  \"Treat me like a little girl!  Spank me!  Make me pay for being such a spoiled brat!  Ahhhhhh!\" she cried, weakening and collapsing into his arms.<br>\r\n<br>\r\nThe world seemed to swim for moment as she basked in the reality around her.  Tom swept her up and carried her to the couch. Her then went over to the replicator and said a few things to it. She could neither see the items nor hear what he said, but he only returned with a large bag.<br>\r\n<br>\r\nWhen Kathryn able to focus her thoughts again, she found herself over Tom's lap!  Her feet were bare, her pants around her ankles.  Her uniform jacket was unbuttoned.  <br>\r\n<br>\r\nShe imagined that Tom was getting an eyeful.  Her pert, rounded ass was protected only by a thin layer of silk.<br>\r\n<br>\r\nIt took but a moment more to realize his intentions.<br>\r\n<br>\r\n\"Tom!\" Kathryn squealed, trying to kick her legs.  \"Stop this RIGHT NOW!  I WON'T be spanked!  I've changed my mind!<br>\r\n</span></div></div>",
            "created":1348376400,
            "id":1433939,
            "title":"Let me spank you"
        },
        "14123221":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Bring out the diapers",
                "Get her padded"
            ],
            "content":"<div class=\"\"><div> <span>He ignored her.<br>\r\n<br>\r\n\"Too late that for that,\" he said with determination in his voice.<br>\r\n<br>\r\nBefore she could say another word, his thundering hand had come down, landing squarely on her silk briefed ass.<br>\r\n<br>\r\n\"Owww!\" she yipped, not believing the pain.  \"Tom, you bastard!\"<br>\r\n<br>\r\nHe spanked her three more times.<br>\r\n<br>\r\nJaneway couldn't believe what was happening to her.  She was an accomplished career woman, a Starfleet Officer and a Starship Captain. She was attractive. Men often found her mysterious and enigmatic.<br>\r\n<br>\r\nSo how was it that she was across her navigator's lap, her uniform pants pulled down, and getting spanked like a little girl?<br>\r\n<br>\r\nTrue she had asked for it, wanted it, but she hadn't really believed he would actually DO it!<br>\r\n<br>\r\nHe spanked her again; she cried out in pain and pleasure again.<br>\r\n<br>\r\nThe spanking continued. Janeway almost felt her adulthood and accomplishments melt away.  <br>\r\n<br>\r\n\"We're going to reach some conclusions, Captain,\" said Tom between spanks.  \"Isn't that what we officers like to do?  Reach conclusions?\"<br>\r\n<br>\r\nHe spanked her again.<br>\r\n<br>\r\n\"There's just a couple things I'd like to clarify,\" said Tom with a grin on his face.  \"Let's discuss this business about your desire to be dominated. You've been fantasizing about doing something like this with me, haven't you?\"<br>\r\n<br>\r\nThis was going one step to far!  Janeway would hold firm on that!<br>\r\n<br>\r\n\"I have fantasies, but certainly not with you!\" she shouted, \"For one thing, you're a married man. For another thing, you're my navigator! I can have you thrown into the brig for this, Mr. Paris!\"<br>\r\n<br>\r\nHe just spanked her again.<br>\r\n<br>\r\n\"Of course you can,\" said Tom, \"But you and I both know that's not going to happen.\"<br>\r\n<br>\r\n\"OH!  OH!\" Kathryn yelled, as she writhed over Tom's lap.  She was kicking and crying.<br>\r\n<br>\r\nHer satin panties provided little protection from the stinging spanks.  She knew that Tom was determined to teach her a lesson.  Her ass was on fire.<br>\r\n<br>\r\nTom told Janeway \"I'm disappointed in you, Captain.  I think a little bare-bottomed contact is needed for you to see the light....\"<br>\r\n<br>\r\nThe impact of his words penetrated her pain clouded mind.  <br>\r\n<br>\r\nBefore she could react, Mulder seized the waistband of her panties and yanked them down to her knees.<br>\r\n<br>\r\n\"I'm just getting warmed up here!\" he said, doing his best Al Pacino impersonation.<br>\r\n<br>\r\nJaneway was beyond mortified.  Nothing in her fantasies had her prepared for the actual reality of being spanked like this.<br>\r\n<br>\r\nThe pain in her burning ass was beyond description, but so was her growing excitement.<br>\r\n<br>\r\nLess than an hour ago she had been secure in her adulthood, ego and self-image intact.  She was attractive, assertive, and able to command respect. Her Starfleet uniform, education, training, and intelligent manner all proclaimed to the world that she was a woman to be reckoned with.<br>\r\n<br>\r\nLike a rickety house of cards, that all had been shattered in seconds.<br>\r\n<br>\r\nA few firm spanks had reduced her to a crying child, her maturity unwinding exponentially with every swat.  She almost felt herself growing smaller on Tom Paris's lap!<br>\r\n<br>\r\nNormally impeccably groomed, she knew she must now look like a mess.  Her hair was somewhat disheveled, her uniform jacket open. She was not wearing her undershirt at that time. Both of her bra straps were now down low on her upper arms, and she was in real danger of losing her bra.  <br>\r\n<br>\r\nBoth sets of cheeks were red, the upper from crying, and the lower from Tom's uncompromising blows.<br>\r\n<br>\r\nShe was barefoot, lying prone across her helmsman's lap in the classic spanking position.  Worse, it was happening on the VOYAGER, in the room where she spent most of her personal life.  <br>\r\n<br>\r\nWith her pants and panties pulled down, she hardly presented the image of a powerful woman.  In a matter of moments she had been reduced to a kicking, screaming, spanked little girl!  Her business suit, education, poise, and former smug confidence couldn't save her now!<br>\r\n<br>\r\nAll this went through her mind in seconds.  Tom was speaking.<br>\r\n<br>\r\n\"You're not REALLY an adult, are you?  You're actually a little girl PRETENDING to be all grown up.  You've covered your tracks well.  You've been fooling people for years, but now your secret is out....\"<br>\r\n<br>\r\nJaneway remained silent, her breathing rapid, her heart pounding.  Her breasts felt full and her crotch throbbed. She was incredibly turned on!<br>\r\n<br>\r\n\"You're just an academy girl whose been hiding behind a Starfleet uniform, isn't that true?\" Tom asked.<br>\r\n<br>\r\nShe wanted desperately to scream out yes, but her pride held her back.  How could she say something like that out loud?<br>\r\n<br>\r\n\"I'm NOT a little girl!  I'm not!  I'm not!\" she said, wiggling and kicking on Tom's lap.<br>\r\n<br>\r\nIn response, he spanked her again.<br>\r\n<br>\r\n\"And I thought we were making such good progress, Captain.\"<br>\r\n<br>\r\nAs he continued spanking her, Janeway could no longer fight the pain, nor deny the truth.<br>\r\n<br>\r\n\"Yes, it's true!\" she sobbed.  \"Everything you said is true!\"<br>\r\n<br>\r\n\"That wasn't so hard to admit, was it?\" he remarked<br>\r\n<br>\r\nHe spanked her again.<br>\r\n<br>\r\n\"TOOOOM!\" she squealed.<br>\r\n<br>\r\nSuddenly she felt it.  The orgasm that had been threatening through the whole spanking now burst upon her like sudden thunderstorm.<br>\r\n<br>\r\nHer back arched, waves of pleasure engulfing her, combining with the pain of the spanking.  Each reenforcing the other.<br>\r\n<br>\r\nIt was the mother of all orgasms.<br>\r\n<br>\r\n\"AHHHHHHHHHHHHHHHHHHH!\" she cried, her body writhing.<br>\r\n<br>\r\nRational thought was obliterated, and she became a creature of pure emotion.  Like a roller coaster, she could only endure the ups and down of the ecstasy now encompassing her.<br>\r\n<br>\r\nAnd then the grandmother of all orgasms paid her a visit.<br>\r\n<br>\r\n\"AHHHHHHHHHHHHHHHH!\" she screamed, writhing and bucking her arched body over Tom's lap.<br>\r\n<br>\r\nIt was then over.<br>\r\n</span></div></div>",
            "created":1348376400,
            "id":1433947,
            "title":"He still spanks her"
        },
        "141232211":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Tom messes around with her.",
                "Tom babies her."
            ],
            "content":"<div class=\"\"><div> <span>She must have blacked out for a moment. She was dimly aware that Tom was rubbing a cool liquid on to her very red, well spanked ass.<br>\r\n<br>\r\nInstantly the pain from the spanking retreated. She heard a rustling sound, like plastic being stretched. “Lift your hips,” Tom commanded.<br>\r\n<br>\r\nToo spent to even think of resisting, she did as she was told. She then felt padding between her legs and plastic on her stomach. Dreamily, it felt like an open clam shell had been placed between her legs, over her ass, and under her tummy.<br>\r\n<br>\r\nRealization flooded in to her mind as Tom drew the two halves of the strange garment together.<br>\r\n<br>\r\nIt was a diaper! Kathryn Janeway was being diapered!<br>\r\n<br>\r\n“Tom... please, no,\" she said weakly.<br>\r\n<br>\r\n“Shhhh!” he said. “Just lie quietly”.<br>\r\n<br>\r\nIn an instant it was over. He fastened the tapes, sealing her in to the infant’s prison.<br>\r\n<br>\r\n“I’ve been diapered”, was all she could say, over and over again.<br>\r\n<br>\r\nTom then rolled her gently off his lap to the floor.<br>\r\n<br>\r\nGetting up from the couch, he approached and stooped to yank off her pants and panties, which had been bunched down around her ankles.<br>\r\n<br>\r\nHe threw her pants off to the side and took a close look at her panties.<br>\r\n<br>\r\nSeeing this, Kathryn could only moan in shame. It was humiliating to have him handle her undergarments!<br>\r\n<br>\r\n\"You certainly have style, Captain,\" Tom remarked as he tossed aside her panties, \"B'Elanna has a lovely bra and panty combination that she saves for the nights when she and I make love. Perhaps you can talk to her about that later on.\"<br>\r\n<br>\r\nDiapered on the floor, she could only squirm at his mocking words.<br>\r\n<br>\r\nHe then collected her uniform jacket and bra, which had indeed come undone. He threw the garments off to the side.<br>\r\n<br>\r\nKathryn quickly got on her hands and knees, on all fours, looking over her shoulder at her now diapered hips and ass.<br>\r\n<br>\r\n“I’m not an infant!” she cried.<br>\r\n<br>\r\nThere was a full-length mirror on the other side of the room. In it, Janeway suddenly caught sight of her own reflection. Her face and eyes were red from crying, her once impeccable makeup job running and ruined. Her fashionable hair was a tangled mess, soaked from sweat. Her normally smooth skin was appeared to be a little rough. Her breasts hung down, like ripe fruit from her lithe, taunt body. She turned sideways towards the mirror, still on her hands and knees.<br>\r\n<br>\r\nViewing herself in profile, she couldn’t help seeing the bulky yet tight disposable diaper as it hugged her ass.<br>\r\n<br>\r\nShe saw the white plastic shell glistening in the overhead light, noticed the flat stab of padding just underneath. She then shifted to a kneeling position, resting herself on the balls of her feet. Her thighs slightly parted; she rested her hands on them and continued to stare at her true persona. Her mind refused to accept the image.<br>\r\n<br>\r\nShe was Kathryn Elizabeth Janeway. A Starfleet graduate. A well respected woman who carried herself with natural authority. She was a leader.<br>\r\n<br>\r\nShe was also beautiful and stylish; her uniform held an outward proclamation to the world about who she was and what she was about.<br>\r\n<br>\r\nSo how was it that that she was now kneeling on the floor, in a posture of submission, recently spanked and wearing only a tight disposable diaper?<br>\r\n<br>\r\n“It’s not me! It’s not me!” she said repeatedly. She then dropped to the floor on her stomach, hands clutching at the carpet and crying silently.<br>\r\n<br>\r\nTom looked at her and reached down. Pulling her gently to her feet, her eyes meet his in an electric moment. She knew in an instant that her status as his superior was finished. She was now only a chastised little girl, her adulthood terminated. She moaned in her diapers and buried her face in his chest.<br>\r\n<br>\r\nTom wanted to comfort her, so her pulled his arms around her and hugged her.<br>\r\n<br>\r\nHe held her, and the storm of emotion eventually passed. She was both mortified and humiliated from her recent spanking and diapering, but she also felt an emotional catharsis. She had accepted a part of her self that had long been denied. The road ahead would not be easy, but she felt that it could now be faced with equanimity.<br>\r\n<br>\r\nTom released her and stepped back.<br>\r\n<br>\r\n“Everything okay?” he asked, touching her cheek.<br>\r\n<br>\r\nHow could she even begin to answer that question?<br>\r\n<br>\r\nNaked except for her tight yet bulky disposable diaper, Janeway placed her hands on her throbbing ass. With a small noise of impatience, she attempted to shift the diaper to a more comfortable position.<br>\r\n<br>\r\nTom of course noticed.<br>\r\n<br>\r\n“I don’t think that will do much good. I’ll bet it feels strange—you take your panties completely for granted, don’t you? You put them on in the morning and then forget about them. You’re comfortably wrapped and packaged in silk and nylon, a smooth streamlined look under your clothes. You’re in complete control—after all, that’s your right as an adult…”<br>\r\n<br>\r\n“But diapers are different,” he said after a moment’s pause. “You feel the bulk between your legs. Your balance is off. Your ass looks huge. The diaper traps the heat and you feel the humid confinement. The leg bands dig in to the creases below your cheeks and become sore. The waistband irritates your tummy. With every step you hear the humiliating plastic rustle as your confined ass sways in its tight plastic prison…”<br>\r\n<br>\r\n“The point is,” he concluded, “Is that you’re AWARE of your diapered condition with every step. You’re out of control. Someone else is deciding about your comfort, not to mention your bathroom habits. You’re an infant, a child, and you’ll do as you’re told. The psychological aspects of being diapered are almost as interesting as the physical ones, don’t you agree?”<br>\r\n<br>\r\nShe could only nod in shell shocked agreement. This morning she was an adult- an important woman with a high powered career. Now she was a disposable diaper wearing little girl, well spanked, docile, and compliant.</span></div></div>",
            "created":1348376400,
            "id":1433953,
            "title":"Bring out the diapers"
        },
        "1412322111":{
            "choices":[
                "mentaly",
                "physicly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does he do this mentaly <br>\r\nOr <br>\r\nPhisicly </span></div></span></div>",
            "created":1366952400,
            "id":1578712,
            "title":"Tom messes around with her."
        },
        "14123221112":{
            "choices":[
                "diaper change-oral sex",
                "Q-anal sex"
            ],
            "content":"<div class=\"\"><div> <span>Tom quickley walks over to the replicator and orders some items. Janeway, still Iin shock, doesn't notas till he walks over and forces a tube up her ass. \"What are you doing tom!?!?\" She shouted as she heard a flip of a swtich and a warm liquid filled her bowles \"this should help you loosen up littel girl\" he says. Soon the strain is to great and she dumps a load in the seat of her diaper. Tom then toke her hand and used it to spread the mess from back to front rubing it in to EVERY crack. Then</span></div></div>",
            "created":1366952400,
            "id":1578720,
            "title":"physicly"
        },
        "1412322112":{
            "author_id":"carrier",
            "author_name":"carrier",
            "choices":[
                "Wet Diaper",
                "Dry Diaper"
            ],
            "content":"<div class=\"\"><div> <span>As she sat on the floor taking it all in she just barely heard Tom talking \"Look, Captain, I have to ask I have some things that I want us to do and I want to know if you feel comfortable doing them.\"<br>\r\n<br>\r\nJaneway thinks for a long time and decides to release her inner desire after spending years bottling up. Today would be the day where she finally accepted who she is and damn the consequences. \"Yes, Tom I'm fine with it but, please when I say stop please stop.\" Tom just nods.<br>\r\n<br>\r\nTom moves to the replicator you watching all the way, Tom inputs Janeway's measurements, and soon a bottle of milk and what appears to be an adult-sized baby onesie and a Pacifier soon materialize. Janeway watches as Tom unravels the Onesie and gently pulls it over her head bringing the crotch up and snapping it shut over her bulky diaper, then bringing up the pacifier around her neck and plopping it in her mouth.<br>\r\n<br>\r\nJaneway feels the strange object now in her mouth and begins experimentally sucking it. She finds it soothing and continues to suck it while Tom heats up the milk. Janeway is at ease with herself having accepted a part of herself that was always continuously denied she felt strangely at ease and was soon eagerly awaiting Tom's return.<br>\r\n<br>\r\nTom soon returns and sits on the couch \"Get on my lap Captain.\" Janeway subtly snickers when she hears the word Captain as if Paris could ever obey an order from her ever again. But, soon enough Janeway has her head laid back and is sucking on a bottle with Tom creasing her hair, and with the warm milk and Janeway already tired state she is soon asleep.<br>\r\n<br>\r\n\"You look, cute Captain, I hope we can do this another time until then I'm gonna put you to bed\" Tom lays Janeway onto her bed and plops her Pacifier back into her mouth and carefully slips out of her Room without anyone noticing.<br>\r\n<br>\r\nJaneway wakes up with a paci in her mouth and a<br>\r\n<br>\r\n</span></div></div>",
            "created":1509512400,
            "id":2409559,
            "title":"Tom babies her."
        },
        "14123221121":{
            "author_id":"carrier",
            "author_name":"carrier",
            "choices":[
                "wear a diaper",
                "or not"
            ],
            "content":"<div class=\"\"><div> <span>Janeway woke up in her bed a cold feeling in her crotch and something strange in her mouth, her catsuit was missing her legs were bare, and something was off about her undergarment. <br>\r\n<br>\r\nEverything then came back to her. The humiliation of being spanked and diapered the sheer enjoyment she received from the experience and her acceptance of the deep-seated desires hidden inside her. <br>\r\n<br>\r\nShe then looked at her attire and remembered what her navigator had put her in. She, Kathryn Janeway captain of the Voyager dressed as a baby in a Pink onesie a thick diaper and a pacifier that has been tied around her neck.  <br>\r\n<br>\r\nThere was a full-length mirror on the other side of the room. In it, Janeway caught sight of her reflection. A grown woman, a Starfleet graduate, dressed like this? What would her crew think? <br>\r\n<br>\r\n\"Better get out of this before someone enters.\" <br>\r\n<br>\r\nAs she removed the onesie, she caught a glimpse of her diaper seeing the yellow tint that made the fact that she a grown woman has had an accident very clear.<br>\r\n<br>\r\n\"Yet another sign of my adulthood fading away I guess looks like I can't even control my bladder these days.\" <br>\r\n<br>\r\nJaneway removed the infantile clothing and put it away in a secure location. She had thought about throwing it away but, if she was honest with herself, she had genuinely enjoyed herself when officer Paris had given her an opportunity to live out her desires. Thus She carefully stored the diapers, bottles, and clothing for a later date. <br>\r\n<br>\r\nNow in a wet diaper, Janeway ripped off the tapes and curled the diaper up to be disposed of in the incinerator, before going to get dressed in her uniform. Janeway had a thought would she<br>\r\n<br>\r\n</span></div></div>",
            "created":1509685200,
            "id":2410409,
            "title":"Wet Diaper"
        },
        "1413":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Goes undercover on a planet where women act and dress as babies",
                "It just happens one day",
                "Another reason"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How else could the captain of the starship Voyager end up back in diapers</span></div></span></div>",
            "created":1553317200,
            "id":2633842,
            "title":"Other reasons"
        },
        "14131":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "A male crewman",
                "Another female crewman"
            ],
            "content":"<div class=\"\"><div> <span>Voyage had come across a planet ripe with deposits of an ore the ship needed. But the ship wasn't developed enough for them to just ask them for it without breaking the prime directive. So captain Janeway decided to lead a small landing party to determine the whereabouts of the ore and have it beamed out without anyone noticing.<br>\r\n<br>\r\nAfter a few days of surveillance they had learned enough to try to blend in. Thankfully the inhabitants were human enough for them to easily pass. But the real difference was how women were in this culture.<br>\r\n<br>\r\nOn this planet the females dressed acted and were treated very similarly to human babies. The captain wasn't too pleased about it but for the sake of the crew she'd go through with it and bite the bottle so to speak.<br>\r\n<br>\r\nSo there she stood in the transporter room, dressed in a pink onsie with a diaper underneath and a pacifier clipped, her bare legs ending in Velcro shoes with frilly socks.<br>\r\n<br>\r\n\"Are you ready to head out captain?\" Asked Chakotay as he entered<br>\r\n<br>\r\n\"I think so, the pigtails seem like a bit much\" the captain adjusted one of the twin ribbons in Her hair.<br>\r\n<br>\r\n\"It works just fine\" he reassured as he handed her the diaper bag with all the equipment she'd need hidden inside. With that she was ready to depart on her mission with...</span></div></div>",
            "created":1553385780,
            "id":2633860,
            "title":"Goes undercover on a planet where women act and..."
        },
        "141312":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "One other crewman",
                "Two more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The landing party was supposed to be small, but how small?</span></div></span></div>",
            "created":1553386500,
            "id":2633863,
            "title":"Another female crewman"
        },
        "1413121":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Bellana",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who goes with her?</span></div></span></div>",
            "created":1553386680,
            "id":2633865,
            "title":"One other crewman"
        },
        "14131211":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "A residential area",
                "A more secluded area where the ore was detected"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll be ready to go as soon as B'elanna arrives.\" And as soon as she said that the door opened again and in trudged lieutenant Torres on bare feet dressed in a frilly yellow sun dress,  a matching yellow bonnet to hide her forehead ridges and a pair of plastic pants over a thick cloth diaper, grumbling all the way.<br>\r\n<br>\r\n\"Captain are you absolutely certain we need to go about it this way?\" The half klingon fumed, gesturing to the mess of frills she was wearing.<br>\r\n<br>\r\n\"Don't worry lieutenant, it should be a relatively short mission. And no one will ever have to know what happens on the surface, not even Tom Paris\" she reassured, placing a hand on the puffy fabric around her shoulder. With a blush the lieutenant agreed to go along with her captain as the two waddled up to the transporter pad before they were beamed to...</span></div></div>",
            "created":1553388180,
            "id":2633868,
            "title":"Bellana"
        },
        "141312111":{
            "author_id":"doomvsville",
            "author_name":"doomsville",
            "choices":[
                "They were captured!",
                "Strange things started happening"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bellana and janeway beamed to the surface though bellana was not thrilled things were going smoothly until.</span></div></span></div>",
            "created":1555315020,
            "id":2644955,
            "title":"A residential area"
        },
        "1413121111":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "To daycare",
                "Into custody under suspicion of being invaders"
            ],
            "content":"<div class=\"\"><div> <span>The two women materialized in an alleyway before stepping out into the streets of the planet. There were venders selling wares, people on their way to their various businesses and big baby women of all shapes and sizes. One was at her own little shop patiently waiting for customers with a big smile behind the pacifier she sucked on, another rode inside a stroller wearing nothing but a diaper as her friend wearing pushed her wearing a onesie and another woman stopped in the middle of a conversation to evidently use her diaper.<br>\r\n<br>\r\nThe half Klingon grumbled to herself as she adjusted her plastic pants “let’s get this over with, I wanna get out of here as soon as possible”<br>\r\n<br>\r\n“Let’s not be too hasty Be’lana, we don’t want to attract too much attention to ourselves. And besides, it’s not every day you get to return to childhood like this” Janeway smiled, as she put her comm badge disguised as a pacifier into her mouth to sell the look “and I’d stop pulling at those plastic pants is I were you, someone might get the wrong idea and try to change your diaper”<br>\r\n<br>\r\nThe engineer blushed as she let the elastic of the garment snap back into place, reviled by the idea for some alien inspecting her for a poopy diaper like she was some overgrown baby.<br>\r\n<br>\r\n“First things first” the captain continued as she looked around “we need to find some kind archive or library to track down the ore deposits. Then we-“<br>\r\n<br>\r\n“Excuse me miss.” Suddenly two people who seemed to be some kind late enforcement approached the pair of disguised diaper women.<br>\r\n<br>\r\n“Is there a problem officer?” Torres asked, her anti authoritative demeanor slipping in despite her thick padding and yellow sundress too busy looking cute to hide said diapers.<br>\r\n<br>\r\n“I’ll say” said the other officer, a woman who was dressed very similarly to her mail counterpart aside from a skirt rather than pants with a few crinkles or rustles emitting from underneath “you two don’t seem to possess any identification.”<br>\r\n<br>\r\n“We don’t know how you got here but we gotta take you in” her partner said as they took them both by the hand as if they were unruly children as they were taken...</span></div></div>",
            "created":1577470080,
            "id":2765359,
            "title":"They were captured!"
        },
        "14132":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "She was in a diaper",
                "Something wrong with her replicated beverage"
            ],
            "content":"<div class=\"\"><div> <span>Captain Janeway was in her office one day when she decided to treat herself to some coffee from the replicator. \"One coffee, black\" But as she crossed the room her underwear suddenly and inexplicably transformed into a pair of thick soft cushy diapers. The captain stopped in surprise as she realized...</span></div></div>",
            "created":1553381220,
            "id":2633846,
            "title":"It just happens one day"
        },
        "141322":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Why is my coffee in a baby bottle?",
                "Why would I ask for coffee? Coffee's yucky!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Catherine raised her eyebrow in surprise, somehow not noticing the babies garment around her waist but instead at the drink her replicator had just given her.<br>\r\n<br>\r\nShe gasped as she asked herself</span></div></span></div>",
            "created":1553381880,
            "id":2633849,
            "title":"Something wrong with her replicated beverage"
        },
        "1413222":{
            "author_id":"doomvsville",
            "author_name":"doomsville",
            "choices":[
                "Mentally regressing due to spacial anomaly (whole ship)",
                "Physical regresion and or another form of mental regression"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So she doubled back around to the computer and said \"computa on fomua pwease\" and the computer barley being able to pick up the degrading language of captain janeway gave her one bottle of milk little she knew she was </span></div></span></div>",
            "created":1555315320,
            "id":2644957,
            "title":"Why would I ask for coffee? Coffee's yucky!"
        },
        "142":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the ship's Chief Engineer, Lieutenant B'Elanna Torres, wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415070,
            "title":"B'Elanna Torres"
        },
        "143":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the former Borg drone Seven of Nine wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415071,
            "title":"Seven of Nine"
        },
        "1432":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Q Junior",
                "The Doctor",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who forces her into diapers?</span></div></span></div>",
            "created":1346216400,
            "id":1416471,
            "title":"She is forced into them"
        },
        "14321":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "cloth diaper.",
                "disposable diaper."
            ],
            "content":"<div class=\"\"><div> <span>One regular day on board the Starship Voyager, Seven of Nine was busy at work at her usual station in the cargo bay.<br>\r\nShe was working on a way to strength the sensors in the Astrometrics Bay in effort to locate unusual anomalies, as well as potential methods to get the ship home faster.<br>\r\nIcheb was not in the room at that time. He was busy working with Tuvok and B'Elanna in Main Engineering. Thus, Seven had the room to herself.<br>\r\nIt was nice and quiet, just as Seven preferred it to be.<br>\r\nAll of sudden, there was a bright flash and a spark-like sound. Seven of Nine felt cold for no apparent reason.<br>\r\nThen she heard giggling behind her.<br>\r\nSeven of Nine slowly looked over her shoulder and saw Q's son, Q Junior standing on the opposite side of the room. He smirked and said \"Hello, Seven of Nine. I love your new uniform?\"<br>\r\n\"What do you mean?\" she inquired in slight confusion, \"This is one of my standard catsuits I have always worn. It is not new.\"<br>\r\nQ Junior tried to prevent himself from bursting out laughing. Seven of Nine queried \"What is it you find so amusing?\"<br>\r\nHe just told her through his laughs \"Look down.\"<br>\r\nSlowly, Seven of Nine looked down at her body, and to her vast surprise, she was wearing nothing but a thick, white</span></div></div>",
            "created":1346389200,
            "id":1417725,
            "title":"Q Junior"
        },
        "143211":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Tried to remove her diaper.",
                "Got angry at Q Junior."
            ],
            "content":"<div class=\"\"><div> <span>She was wearing nothing but a thick, white cloth diaper. It wrapped every inch of her crotch and bottom in soft, cozy padding. It was pinned up securely with two pins on either side.<br>\r\nShe slowly looked up at Q Junior and asked him gravely \"Why have you put me in a diaper?\"<br>\r\nQ Junior snickered and walked a little closer, saying \"I've been studying the habits and tendencies of numerous biological lifeforms. I was quite amazed that so many species can develop strange fetishes. Bolians, Cardassians, Bajorans, Romulans, Klingons, Ferengi, and even the Vulcans. However, the Humans have the most interesting fetishes of them all. After examining weight gain, shrinking, growing, feet, and many others, I arrived at something known as 'infantilism.' That is the fetish one has when they have a desire to wear diapers and behave or be treated like a baby. Only the diaper-wearing part caught my attention, though, so I decided to explore it a little more. But I wanted an actual person to do so.\"<br>\r\n\"And why me?\" asked Seven of Nine.<br>\r\n\"Because you're the sexist woman I've ever met!\" Q Junior responded cockily.<br>\r\nSeven of Nine responded nonchalantly \"I am flattered by that, Q. But I am a grown woman. I cannot strut around the ship in nothing but diapers all day long.\"<br>\r\n\"But you look so cute in them!\" he insisted.<br>\r\n\"Does your father know what you're doing?\" Seven of Nine questioned him.<br>\r\nQ just laughed again before responding \"No, he's too busy managing the Continuum, so he left me to study the universe. I told him I wouldn't get into too much trouble.\"<br>\r\nHe paused a moment before adding in \"Emphasis on TOO much.\"<br>\r\nSeven of Nine looked down at her diapered body and then back up at Q.<br>\r\n<br>\r\nWhat did she do next?</span></div></div>",
            "created":1346389200,
            "id":1417733,
            "title":"cloth diaper."
        },
        "1432111":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "\"Nope, I want to see your diapers at all times.\"",
                "\"Sure, I suppose it is too cold in here for just diapers.\""
            ],
            "content":"<div class=\"\"><div> <span>Seven of Nine looked down at her diaper again and held her hand against one of the pins. She tried to unpin it, but it was stuck in place. She then tried to pull the pin out, to break it, and to crush it. But nothing she did even moved the pin from its position. Then she tried to pull the diaper down her legs. It wouldn't move in the slightest. Despite the fact that her diaper fit her perfectly (being neither too loose nor too tight), Seven of Nine could not take it off, no matter how hard she tried.<br>\r\nAfter taking about three minutes in an attempt to remove her diaper, she looked back up at Q Junior and asked him angrily \"Why won't this come off?\"<br>\r\nQ Junior replied \"I've designed that diaper so that only I can remove it. Hence, I'll be the one to change you.\"<br>\r\n\"When can I take it off?\" she asked him.<br>\r\n\"When I'm satisfied with my findings on infantilism,\" Q Junior replied, \"Until then, you'll be wearing them full-time.\"<br>\r\nSeven of Nine grimaced at him and said \"If my only way out of this is to be a part of your erotic, juvenile fantasies, so be it. But may I at the very least have my clothes back?\"<br>\r\nQ Junior stood thinking for a moment. After that, he replied</span></div></div>",
            "created":1346389200,
            "id":1417736,
            "title":"Tried to remove her diaper."
        },
        "14321111":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Seven had to leave the room.",
                "Icheb came in."
            ],
            "content":"<div class=\"\"><div> <span>He told her \"Nope. I want to see your diapers at all times.\"<br>\r\nSeven of Nine tried to argue \"But I have duties in different parts of the ship. The rest of the crew will see me like this. What do you suppose they would say to seeing a grown woman wearing an infant's garment?\"<br>\r\nQ Junior raised his hand up slightly and told her \"Don't worry about that. I've slightly altered reality so that every member of the crew believes it is perfectly normal for you to be wearing diapers and none of them ridicules you for it.\"<br>\r\nSeven of Nine raised her eyebrow in interest and said \"You are actually capable of doing something like that?\"<br>\r\n\"Yes, of course,\" stated Q Junior, \"I can switch between parallel universes, too. But I'm fine with this one. Now, my sweet diapered Borg Queen, how about you carry on with your day? I'll just stand over her and observe you.\"<br>\r\nSeven of Nine hesitated for a moment. She still felt very uncomfortable about being dressed in only a diaper. But after a little deliberation, she just turned to her console and began to work.<br>\r\nShe worked in silence for about five minutes, trying to forget what she was wearing. But there were too many sensations that reminded her of the diaper's presence: the bulkiness between her legs, the padding caressing her bottom, the baby powder smell from the top, and the feeling it gave her when they rubbed up against her more sensitive areas.<br>\r\nAfter these five minutes, Q Junior stepped closer to her and remarked \"I can see that you're starting to get attached to them.\"<br>\r\nSeven of Nine tried to look repulsed or aggravated. But the truth was, she was beginning to fear that Q Junior was actually right.<br>\r\nHe stood directly behind her and gave her diapered bottom a few firm pats. He then rubbed his hand over her padded bum and let it rest there for a moment. Seven of Nine just continued on with her work.<br>\r\n\"You know what?\" Q Junior stated, \"I think I like you in diapers more than when you're naked.\"<br>\r\nSeven of Nine's initial reaction to that sort of comment would normally be disgust, but instead, she ended up blushing a little. Apprehensively, she just said \"I will regard that as a compliment on your part. So I will reply with... Thank you.\"<br>\r\n\"You're quite welcome,\" responded Q Junior.<br>\r\nAfter about ten more minutes of working in silence,</span></div></div>",
            "created":1346389200,
            "id":1417738,
            "title":"\"Nope, I want to see your diapers at all ti..."
        },
        "143211111":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "dressed in diapers, too.",
                "in her standard uniform."
            ],
            "content":"<div class=\"\"><div> <span>At one point, Seven of Nine turned around and said \"I need to take a report to the Captain. Are you certain no one will say anything about my... attire?\"<br>\r\n\"I swear it,\" Q Junior assured her, \"I've manipulated their minds so that to them, you still appear to be wearing your catsuit.\"<br>\r\n\"I certainly hope it would appear that way,\" remarked Seven of Nine, \"Now, I must go see the Captain.\"<br>\r\nQ Junior nodded and said \"She doesn't know I'm here yet. I'd prefer it if you keep it that way.\" Then with a flash, he disappeared. Seven of Nine looked around the room in bewilderment.<br>\r\nShe called out \"Where are you?\"<br>\r\n\"I'm still with you, just not in the physical sense,\" he replied, \"I'll be following you the whole time. If anything goes wrong, I'll fix it. Just trust me on this one.\"<br>\r\nSeven of Nine shrugged and stated \"Very well.\"<br>\r\nShe slowly waddled her way over to the door and exited. She began walking through the corridors to the turbolift. On the way there, she encountered several of her crewmates. However, none of them seemed to notice her unusual outfit. The most any of them did was just give her a friendly nod to greet her.<br>\r\nBefore long, she arrived at a turbolift and stepped inside, saying \"Bridge.\"<br>\r\nThe doors closed and the turbolift ascended. Soon, Seven arrived on the bridge and waddled her way over to Janeway's Ready Room. She pressed the buzzer and then a voice said \"Enter!\"<br>\r\nThe doors opened and Seven of Nine entered the room.<br>\r\nOn the other side, Janeway sat in her chair.<br>\r\nShe was</span></div></div>",
            "created":1346475600,
            "id":1418755,
            "title":"Seven had to leave the room."
        },
        "1432111111":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "The captain was embarrassed",
                "The captain thought all this was normal"
            ],
            "content":"<div class=\"\"><div> <span>When Seven entered captain janeways office the first thing she noticed was the captain herself standing with her back to the door looking out the window into the stars. But instead of her standard issue starfleet uniform the only thing she wore was a big thick diaper just like seven with the strarfleet insignia plastered on the garments rear (leading seven of nine to realize she must have her own branded on the back of her diaper). Seven also noticed a frilly bow in the captains hair, seven somehow recognized that this babyish accessory symbolized the captains authority. As the captain turned around to address the borg she could tell...</span></div></div>",
            "created":1522818000,
            "id":2474873,
            "title":"dressed in diapers, too."
        },
        "143212":{
            "author_id":"hyro",
            "author_name":"Hyro",
            "choices":[
                "tried to remove her diaper, finding it stuck to her body.",
                "opened her closet, finding all of her uniforms replaced with extra diapers."
            ],
            "content":"<div class=\"\"><div> <span>Seven's gaze fell upon what she recognized as a puffy, white disposable diaper. She had seen adult disposable diapers before in sick bay, but the medical-grade diapers issued by Starfleet were thin and discreet. What was currently strapped around her waist was so thick and obtrusive that it forced her to spread her legs slightly. Further differentiating the garment from the ones in sick bay was a pattern of rubber duckies marking the top half.<br>\r\nSeven of Nine returned her attention to Q Junior.<br>\r\n\"Why have you replaced my uniform with a diaper?\" she queried.<br>\r\nQ Junior once more laughed at the flat, collected question coming from a grown woman standing before him dressed like an infant.<br>\r\n\"Do you remember our first meeting, Seven?\" asked the young Q. \"With a snap of my fingers, I evaporated the clothes right off of you, and yet you showed no response at all. With my amusement denied I simply put your catsuit back where it was and went to make my fun elsewhere. But that incident has gnawed at me since then. What sort of omnipotent overseer of the universe am I supposed to be if I can't even get under the skin of one mortal?\"<br>\r\nSeven raised an eyebrow at Q Junior.<br>\r\n\"So you believe that by simply choosing different attire for me, you will succeed at causing me embarrassment where you once failed? I regret to inform you that I have several spare uniforms right here at my alcove to change into. Furthermore, I work alone here in the cargo bay, with no one else to view your handy work, so your attempt at \"getting under my skin\" is in vain.\"<br>\r\nA devious smirk crept onto Q Junior's face.<br>\r\n\"Don't assume my new idea is so simple.\" said Q Junior. \"You seem to have made two assumptions. One, that you'll be able to hide in here forever. And two, that you'll be able to actually change back into your other uniforms.\"<br>\r\nSeven of Nine looked, puzzled, toward her closet, which appeared to be in its normal spot.<br>\r\nShe turned back toward Q Junior and began to ask, \"Why would I be prevented from changing back into my--\" but stopped when she realized he had vanished.<br>\r\n<br>\r\nAfter a moment of bewilderment, Seven of Nine</span></div></div>",
            "created":1346562000,
            "id":1419432,
            "title":"disposable diaper."
        },
        "14323":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Naomi Wildman",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else could force this Borg beauty into diapers?</span></div></span></div>",
            "created":1402981200,
            "id":1813733,
            "title":"Other"
        },
        "143231":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "To get closer to her",
                "To help her relax"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why does the half-Ktaran daughter of Ensign Samantha Wildman force Seven of Nine into diapers?</span></div></span></div>",
            "created":1402981200,
            "id":1813735,
            "title":"Naomi Wildman"
        },
        "1432312":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Naomi wants to give her a childhood",
                "Naomi wants to make her a diaper slave"
            ],
            "content":"<div class=\"\"><div> <span>It was a fine day for the crew of the Starship Voyager. The vessel had landed on a tropical planet which was seemingly uninhabited. Captain Janeway had given the crew a much needed shore leave.<br>\r\n<br>\r\nThe vast majority of the crew took advantage of their environment and decided to spend their time outside on the beaches. They wanted to get some sun, catch some waves, and mingle with friends.<br>\r\n<br>\r\nThere were only two people in the entire crew who remained on board. The ex-Borg Seven of Nine, and Naomi Wildman, daughter of Ensign Samantha Wildman. Seven felt that vacationing would have been a waste of time, and Naomi simply preferred to stay on the ship.<br>\r\n<br>\r\nAfter a long day of examining the ship's auxiliary systems, Seven of Nine decided to take a break. When she finally wrapped up her work, she headed over to the Wildmans' room to meet up with her young friend.<br>\r\n<br>\r\nNaomi had been alone reading, playing, and studying all day long. When she heard the door open, she eagerly looked up to see who her visitor was.<br>\r\n<br>\r\n\"Hi, Seven,\" she greeted her friend sweetly, \"What are you doing here?\"<br>\r\n<br>\r\n\"I just finished overhauling the power network on all fifteen decks,\" Seven responded with no emotion, \"I have decided to rest before continuing with my work. I assumed you would like some company.\"<br>\r\n<br>\r\n\"Well, you assumed right,\" Naomi remarked, \"I think my Mom is going to camp out on the beaches tonight. So will everybody else, as far as I can tell. You're welcome to stay with me until tomorrow morning. I haven't had company in while.\"<br>\r\n<br>\r\n\"You would not mind if I lingered here?\" Seven of Nine queried, \"The Doctor advised me to spend some time around company to help me better my social skills. And although I have no complaints about my work habits, sometimes my duties can be very tiring. I'm hoping to find a way to relax.\"<br>\r\n<br>\r\n\"Sure, I don't mind,\" Naomi assured her. She quickly got an idea and offered \"How about I help you relax?\"<br>\r\n<br>\r\n\"Really? How?\" Seven asked.<br>\r\n</span></div></div>",
            "created":1402981200,
            "id":1813738,
            "title":"To help her relax"
        },
        "14323121":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Seven complies",
                "Seven does not comply"
            ],
            "content":"<div class=\"\"><div> <span>\"Do you still have any memories of your childhood at all?\" Naomi asked curiously.<br>\r\n<br>\r\nSeven of Nine had to think way back for this. After a minute, she replied with \"I do have a few, but not very many. Most of my childhood is lost. Why do you ask?\"<br>\r\n<br>\r\n\"Well, how about we give you a childhood!\" suggested a very excited Naomi.<br>\r\n<br>\r\n\"I am not sure I understand what you are entailing,\" Seven stated, \"What do you mean by that?\"<br>\r\n<br>\r\n\"Oh, I thought it was obvious,\" Naomi cheekily pronounced,\"What I mean is I'll treat you like a baby! I'll diaper you, change you, feed you, burp you, etc.\"<br>\r\n<br>\r\nSeven of Nine raised an eyebrow in surprise and stated in astonishment \"I beg your pardon, Naomi, but did I just mishear you? Diapers? Seriously? I am a grown woman with the cumulative knowledge of thousands of individuals. I assist in running this ship for a living. You cannot possibly be serious...\"<br>\r\n<br>\r\n\"Do I look like I'm joking?\" Naomi barked, bringing a sudden and very serious look on her face, \"You are gonna stay here and have a childhood whether you like it or not!\"<br>\r\n</span></div></div>",
            "created":1402981200,
            "id":1813740,
            "title":"Naomi wants to give her a childhood"
        },
        "143231211":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Seven removes her clothes",
                "Naomi undresses Seven"
            ],
            "content":"<div class=\"\"><div> <span>Seven of Nine knew she could not escape this situation now. Whenever Naomi wanted something, she got it. She sighed in frustration and muttered \"Very well. I will go along with your idea.\"<br>\r\n<br>\r\nNaomi smiled widely and nodded in approval. Then she walked over to the replicator and asked for a few certain items. She loaded all of them in a bag. Then she approached her Borg friend and told her proudly \"Follow me.\"<br>\r\n<br>\r\nSeven followed the little half-Human out of the room and through the corridors. She was blushing and feeling defeated.<br>\r\n<br>\r\nSoon, they reached the holodeck. Naomi requested a nursery designed to Seven of Nine's parameters.<br>\r\n<br>\r\nThey stepped inside and found a large room which looked like it was designed for a baby the size of a grown woman.<br>\r\n<br>\r\nNaomi walked over to the large changing table and instructed the ex-Borg \"Okay, Seven lie down.\"<br>\r\n<br>\r\nSeven of Nine hopped onto the changing table, her catsuit was still on.<br>\r\n<br>\r\n\"Catsuit and other clothes off, too,\" Naomi added in.</span></div></div>",
            "created":1402981200,
            "id":1813742,
            "title":"Seven complies"
        },
        "1432312111":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Naomi puts her in a crib for a nap",
                "Naomi puts her in a highchair to feed her"
            ],
            "content":"<div class=\"\"><div> <span>Seven of Nine hesitated at first but then did what she was told. She got up from the changing table and began to remove everything. Catsuit, boots, undergarments, everything until she was fully naked. Then she hopped onto the changing table again. She uneasily commented to Naomi \"I certainly hope you know what you're doing, Naomi.\"<br>\r\n<br>\r\n\"Oh, I do,\" Naomi assured her. She then opened up her bag and took out a bottle of baby powder and a fluffy, thick diaper coated with pictures of the Starfleet insignia. Naomi then proceeded to powder and diaper Seven. She started by carefully unfolding the garment. Then she lifted up Seven's legs and slid it underneath her. After setting the Borg woman back down, Naomi took the baby powder, sprinkled a fair amount on Seven's crotch, and gently rubbed it in. Then she pulled the front padding up snugly between Seven's legs and on her stomach. Then she brought up the sides and taped them in place. After that, she gently patted the front of Seven's diaper and said \"There you go.\"<br>\r\n<br>\r\nSeven blushed hard as the little child diapered her. After it was secure on her, she got off the table to examine it. Much to her surprise, the diaper fit her perfectly, almost as if it had been made specifically for her measurements. Despite her opposition, she could not deny how soft and comfortable her diaper felt. Still, it was very bulky and it made her feel infantile. Noticing the prints on top, she commented \"It was produced by... Starfleet? How peculiar; I was unaware that Starfleet made diapers for adults?\"<br>\r\n<br>\r\n\"Well, of course they do,\" Naomi affirmed, \"They come in all sizes, and your size happens to be one of the most popular. You're wearing the same type of diaper that thousands of other Starfleet women are wearing right now. Now follow me, it's time for the baby to get into her new role.\"<br>\r\n<br>\r\nSeven of Nine rolled her eyes at being called 'baby' and followed Naomi. She tried to walk but ended up waddling due to the thickness of the Starfleet diaper.<br>\r\n</span></div></div>",
            "created":1402981200,
            "id":1813752,
            "title":"Seven removes her clothes"
        },
        "14323121112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Naomi comes back with food",
                "Somebody comes into the holodeck"
            ],
            "content":"<div class=\"\"><div> <span>Naomi led the ex-Bord over to a highchair in the holodeck. She then instructed her \"Okay, Seven, sit down in this highchair, and I'll feed you lunch.\"<br>\r\n<br>\r\nThe diapered woman raised her eyebrow in perplexity and remarked \"Is that necessary? I am more than capable of feeding myself, courtesy of Mr. Neelix.\"<br>\r\n<br>\r\n\"I know that,\" Naomi proclaimed, \"You're missing the point, Seven. The whole reason we're doing this is to help you relax.\"<br>\r\n<br>\r\n\"By diapering me and treating me like an infant?\" Seven of Nine presumed.<br>\r\n<br>\r\n\"Pretty much, yes,\" Naomi affirmed, \"I think that by letting somebody else take care of you, you'll be able to get rid of a lot of stress. Just go along with it, alright?\"<br>\r\n<br>\r\nSeven of Nine was very hesitant to continue, but she decided to obey Naomi. So amidst her profound embarrassment, she climbed onto the high chair. She was still wearing nothing but a diaper, just like a real baby.<br>\r\n<br>\r\nOnce Seven was on the chair, Naomi fastened the tray into place. The fit was very tight; so tight, that Seven's arms were trapped underneath the tray. However, that was not enough for Naomi.<br>\r\n<br>\r\nThere were two handcuff-like attachments to the sides of the highchair. Naomi positioned Seven of Nine's hands on them and fastened the handcuffs in place.<br>\r\n<br>\r\nSeven of Nine asked in interest \"What are you doing now?\"<br>\r\n<br>\r\n\"Securing the baby so she doesn't hurt herself or fall off,\" Naomi replied straightforwardly.<br>\r\n<br>\r\nThe diapered Borg said in response \"I find it very unlikely that either scenario would transpire. This chair is very constricting on its own.\"<br>\r\n<br>\r\n\"Please don't argue, Seven,\" Naomi patiently requested, \"Let Mommy Naomi handle everything.\"<br>\r\n<br>\r\n\"Alright then,\" Seven of Nine concurred. There were two more restraints at the base of the chair. Naomi used them to fasten Seven's ankles, as well. Once she was strapped in, Seven tried fidgeting a little to see how much movement she could manage.<br>\r\n<br>\r\nShe could barely even budge. However, every move she made - regardless of how slight it was - caused her diaper to crinkle a little bit.<br>\r\n<br>\r\nNaomi smiled at the woman's actions and told her \"You look kinda cute like that, Seven.\"<br>\r\n<br>\r\nA small blush appeared on the diapered woman's face, but she managed to get out \"Thank you, I suppose.\"<br>\r\n<br>\r\n\"No problem,\" Naomi told her. She then walked over to a replicator in the room and declared \"I'll be right back with some food. You just sit tight and enjoy yourself.\"<br>\r\n<br>\r\n\"Very well,\" Seven of Nine acknowledges. For the moment, she was bound in a highchair, wearing only a bulky disposable diaper. If somebody came in at this time, they would easily see both her exposed breasts and the babyish garment around her waist.<br>\r\n<br>\r\nThis occurred to Seven, and she was grateful that every other member of the crew was off the ship at the time.<br>\r\n<br>\r\nAt least, she hoped they all were...</span></div></div>",
            "created":1415941200,
            "id":1886676,
            "title":"Naomi puts her in a highchair to feed her"
        },
        "1433":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "A borg implant malfunction ",
                "An attempt to raise efficiency",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could put the ex-drone back in diapers</span></div></span></div>",
            "created":1539320400,
            "id":2563013,
            "title":"Other reasons"
        },
        "14331":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Seven looses control of her bladder and bowels (maybe more)",
                "She mentally regresses"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of malfunctions</span></div></span></div>",
            "created":1539320400,
            "id":2563014,
            "title":"A borg implant malfunction "
        },
        "143312":{
            "author_id":"doomvsville",
            "author_name":"doomsville",
            "choices":[
                "Someone walks into the room ",
                "Seven of nine messes her catsuit"
            ],
            "content":"<div class=\"\"><div> <span>In the bowls of the starship voyager somthing was afoot in seven of nines work room she is hard at work caculating the effecincy aboard the ship when their is a spaek in the back of seven of nines head causing her to fall to.the floor rhis implant was the borg implant which boosted brain power motor skills and higher brain function it had short circuted causing all of these to be wiped from sven of nine whixh as a cause regressed her to the state of a newborn once seven of nine was on the floor she stared blankly into the walls of the ship and began to drool and also began to bable a few seconds passed and then</span></div></div>",
            "created":1542776400,
            "id":2580174,
            "title":"She mentally regresses"
        },
        "1433122":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Feet",
                "Come badge (accidentally alerting someone to her situation)"
            ],
            "content":"<div class=\"\"><div> <span>Seven sat on the floor of the cargo bay, her legs splayed out haphazardly as she gurgled to herself sending drool cascading down her chin and onto her uniform. She wasn’t entirely sure where she was but what was left of her memory told her she was in a good safe place so she didn’t worry.<br>\r\n<br>\r\nBut just then seven felt a funny feeling tummy. She didn’t know what this sensation was but she didn’t have to worry long as infantile instincts took over. Her face scrunched up and her bottom reflexively raised ever so slightly as her body started reliving itself of gas before experiencing a much greater release. When her body unclenched with a sigh of relief her butt lowered to find her pants were mushier than she remembered. Curiously she shifted around spreading her mess further until she fell onto her back. With the ex borg ex adult lying there with her legs swaying above her and an awful stench encompassing the room she decided to play with her...</span></div></div>",
            "created":1544245200,
            "id":2587304,
            "title":"Seven of nine messes her catsuit"
        },
        "14331222":{
            "author_id":"doomvsville",
            "author_name":"doomsville",
            "choices":[
                "Captin janeway",
                "Tuvok"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was sent to check on the strange noises on sevens com badge</span></div></span></div>",
            "created":1553589060,
            "id":2635004,
            "title":"Come badge (accidentally alerting someone to he..."
        },
        "144":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the Ocampa Kes wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415072,
            "title":"Kes"
        },
        "1443":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "They only use diapers",
                "She’s trying out potty training",
                "No that isn’t why"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do The Ocampa even know what a toilet is. Maybe her species just naturally uses diapers</span></div></span></div>",
            "created":1539320400,
            "id":2563007,
            "title":"Other reasons"
        },
        "14432":{
            "author_id":"doomvsville",
            "author_name":"doomsville",
            "choices":[
                "She still new every thing else but was incontinent",
                "She never had any brain power to leaen other basics skilss (walking talking etc)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kes the only offical onboard the starship voyager who dosent even know what a toliet is or what it does kes ever since she was born has always used diapers she never had the brain power strong enough to know what a toliet was and as a result</span></div></span></div>",
            "created":1542776400,
            "id":2580175,
            "title":"She’s trying out potty training"
        },
        "144321":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "A male crew member ",
                "A female crew member"
            ],
            "content":"<div class=\"\"><div> <span>Kes was still same as we knew her, she could still walk and talk and do everything another officer could, except for the glaring fact that she had no idea what a toilet was.<br>\r\nShe had heard others on Voyager mention it but she still didn’t know what it was or what it did, although she did have a few theories. She knew it had something to do with the fact that they didn’t wear diapers. Maybe they were some kind of transporter that beamed their waist directly from their bodies to the waste disposal system. Perhaps they telepathically told them when they were about to make a mess, they got to one, and then it changed them faster then they could go. Or maybe they made their bodies hyper efficient so their bodies never produced waste.<br>\r\nIt had to be something like that because she’d never seen captain Janeway go boom boom. She never saw anyone check Be’lana Tores to see if she wet herself or made a doody. And for all the time she’d spent on Voyager she’d never seen anyone having their pants changed<br>\r\nEventually this mystery became so great she couldn’t take it anymore, she just had to know what the potty was. So one day she asked...</span></div></div>",
            "created":1542862800,
            "id":2580468,
            "title":"She still new every thing else but was incontinent"
        },
        "1443212":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Captain Janeway",
                "Be’lanna or someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who did she go to</span></div></span></div>",
            "created":1542862800,
            "id":2580469,
            "title":"A female crew member"
        },
        "14432122":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Be’Lana",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kes went to...</span></div></span></div>",
            "created":1542862800,
            "id":2580474,
            "title":"Be’lanna or someone else"
        },
        "144321222":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "She inspects the potty solo",
                "She needed a guide"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if Kes didn’t go to anyone to ask about what a toilet was. What if she decided to go looking into one herself.</span></div></span></div>",
            "created":1542862800,
            "id":2580475,
            "title":"Someone else"
        },
        "144322":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Kes herself ",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Kes was essentially a big toddler. She relied on others to dress her, feed her and change her. She could still do her job of the ships botanist but she was also the ships charge with the crew on a constant rotating shift to take care of her.<br>\r\nBut no one seemed to mind, mostly because of how cute she was. All her little babyish outfits and diapers she’d wear, toys she’d play with, and especially the little walker she used to move around the ship without resorting to crawling were so precious that everyone was more than willing to deal with the occasional stinky diaper temper tantrum or childish faux pa. But one day (blank) decided that it was finally time for the okampa to start potty training.</span></div></div>",
            "created":1542862800,
            "id":2580473,
            "title":"She never had any brain power to leaen other ba..."
        },
        "145":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Samantha Wildman",
                "Naomi Wildman",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick another character</span></div></span></div>",
            "created":1346043600,
            "id":1415052,
            "title":"Other"
        },
        "1451":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the ship's xenobiologist Ensign Samantha Wildman wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415074,
            "title":"Samantha Wildman"
        },
        "14513":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She is playing House with Naomi",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe this is part of a game?</span></div></span></div>",
            "created":1403326800,
            "id":1815572,
            "title":"Other reasons"
        },
        "1452":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would Ensign Wildman's daughter Naomi Wildman wear diapers?</span></div></span></div>",
            "created":1346043600,
            "id":1415076,
            "title":"Naomi Wildman"
        },
        "14523":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She is being punished",
                "Other reason"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose another reason</span></div></span></div>",
            "created":1346043600,
            "id":1415078,
            "title":"Other reasons"
        },
        "145231":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Her mother.",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is punishing her?</span></div></span></div>",
            "created":1346043600,
            "id":1415080,
            "title":"She is being punished"
        },
        "1452311":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She was being disobedient",
                "Other reason"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why is her mother punishing her?</span></div></span></div>",
            "created":1346216400,
            "id":1416359,
            "title":"Her mother."
        },
        "14523112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She is having accidents",
                "Other reason"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick another reason</span></div></span></div>",
            "created":1346216400,
            "id":1416360,
            "title":"Other reason"
        },
        "145231121":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Give her a bath",
                "Soothe her"
            ],
            "content":"<div class=\"\"><div> <span>Ensign Samantha Wildman was not having the best day. Her department had been assigned three different tasks that had to be completed by the day after tomorrow, which meant she and her fellow officers had to work around the clock to get them done in time.<br>\r\nShe had little time to socialize with her friends or Captain Janeway, much to her dismay. She enjoyed spending time with the others, especially when Neelix was looking after her daughter Naomi.<br>\r\nUnfortunately, the versatile Talaxian was much too busy working up some recipes with some new ingredients the Voyager had acquired from an alien planet a few days beforehand. He was working on a way to preserve them long-term, but doing that to some of them was a delicate process, so he was busy around the clock as well.<br>\r\nTo top it all off, Naomi was having accidents for an unknown reason. When Samantha came back from her duty shift, she found Naomi crying.<br>\r\nWhen she went to comfort her daughter, it was discovered that she had wet herself for the fourth time that week.<br>\r\nSamantha was starting to become overstressed; so many things were doing on at once, but she needed to solve them otherwise she would risk going mad.<br>\r\nShe calmly hugged her daughter and told her \"It's alright, sweetie. We'll fix this problem.\"<br>\r\nNaomi slowly stopped crying and looked up at her mother, asking her \"How, Mom?\"<br>\r\nSamantha took the process one step at a time. She first decided to</span></div></div>",
            "created":1346216400,
            "id":1416363,
            "title":"She is having accidents"
        },
        "1452311211":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Call The Doctor",
                "Get a diaper"
            ],
            "content":"<div class=\"\"><div> <span>She decided to give Naomi a bath.<br>\r\n\"Let's just get you out of those wet clothes first. I'll draw a bath.\"<br>\r\n\"Okay, Mom,\" Naomi smiled sweetly at her mother.<br>\r\nSamantha went into the bathroom and started the water. After using the computer to adjust it to the proper temperature, she walked back out into the bedroom. She told her daughter \"Here, let me help you.\"<br>\r\nShe knelt down to Naomi's level and unfastened her jumper. After letting it drop to the ground, she helped Naomi out of her shirt, shoes, socks, pants, and shirt. After helping her out of her underwear, she led Naomi over to the bathroom and helped her into the tub.<br>\r\n\"You know where everything is, right?\" said Samantha.<br>\r\n\"Yep, the red bottle's shampoo, the blue bottle's conditioner,\" Naomi confirmed.<br>\r\n\"I'll be in the next room,\" stated Samantha, \"Call me when you're done.\"<br>\r\nNaomi nodded and began to clean herself with the soap. Samantha walked out to the bedroom and sat down at the table. She rubbed her forehead in frustration. So far, there was no logical explanation as to how or why Naomi was suddenly having accidents. She was a Human-Ktarian hybrid, and given the fact that she matured as quickly as a normal Ktarian, she should have as much control over her body as one as well.<br>\r\nThe way Samantha saw it, she had one of two options: Consult The Doctor, or get Naomi some... protection.<br>\r\nAfter thinking for a moment, she decided to</span></div></div>",
            "created":1346216400,
            "id":1416366,
            "title":"Give her a bath"
        },
        "14523112112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "told her daughter to come out",
                "went to get her daughter"
            ],
            "content":"<div class=\"\"><div> <span>Samantha sighed, stood up, and made her way over to the replicator on the other side of the room. She stated \"Computer.\"<br>\r\nThere was a beeping sound and the monotonous voice said \"Ready.\"<br>\r\nSamantha ordered the computer \"Replicate a diaper.\"<br>\r\nThe computer responded \"Specify color: red, yellow, orange, green...\"<br>\r\n\"White, please,\" Samantha interrupted.<br>\r\nThe computer stated \"Specify measurements.\"<br>\r\nShe answered \"Size it to fit Naomi Wildman.\"<br>\r\nOnce more, the computer remarked \"Specify: cloth or disposable?\"<br>\r\nSamantha rolled her eyes. Sometimes, the computer could become very incessant and even a little annoying. She just told it \"Disposable. Replicate one white disposable diaper to fit my daughter Naomi Wildman!\"<br>\r\nThere was another beeping sound and a flash of particles. A moment later, a disposable diaper appeared on the replicator.<br>\r\nSamantha slowly picked it up and examined it. It was indeed larger than the type of diapers she had used on Naomi when she was a baby. She just smiled at the thought of how her daughter had grown so much.<br>\r\nShe inhaled the scent of the diaper. It smelled very nice, like baby powder. It also made a distinct crinkling sound as she rubbed her hands over it.<br>\r\nA moment later, she heard Naomi call out \"Mom, I'm done!\"<br>\r\nSamantha</span></div></div>",
            "created":1346216400,
            "id":1416371,
            "title":"Get a diaper"
        },
        "145231121122":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "\"I'll do it myself.\"",
                "\"Can you do it?\""
            ],
            "content":"<div class=\"\"><div> <span>Samantha tossed the diaper onto her bed and went to get Naomi. She grabbed her towel, helped her daughter out of the tub, and dried her off. Naomi giggled as this happened; she was a little ticklish.<br>\r\nAs Samantha finished drying off her half-Ktarian daughter, she told her \"Naomi, I believe I may have found a potential way for us to help you control these accidents of yours.\"<br>\r\nNaomi smiled and said \"Really, Mom? That's great! What is the answer?\"<br>\r\nSamantha did not answer straight away. She just wrapped the towel around her small daughter's body and told her \"Come out to the bedroom with me. I'll explain there.\"<br>\r\nNaomi nodded, smiling gleefully at her mother and walked with her to the main part of their quarters. Samantha led her daughter over to her bed. That was when Naomi noticed something was lying on top of it. When she got close enough, she picked it up and soon realized what it was.<br>\r\n\"Mom, is this a diaper?\" she asked anxiously.<br>\r\nSamantha slowly nodded her head. She anticipated that Naomi would react a little like this, but she told her \"This is only temporary, sweetie. At least until we can figure out why you're having accidents, okay?\"<br>\r\nNaomi stood thinking about this for a long while. Eventually, she agreed to her mother's request. \"If you say so, Mom,\" was all she said.<br>\r\n\"Would you like to put it on yourself, or do you want me to do it?\" Samantha asked.<br>\r\nNaomi replied</span></div></div>",
            "created":1346216400,
            "id":1416486,
            "title":"went to get her daughter"
        },
        "1452311211222":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "stay in their quarters",
                "go with her to work"
            ],
            "content":"<div class=\"\"><div> <span>Naomi replied \"Can you do it, Mom? I don't really know how to put a diaper on.\"<br>\r\nSamantha just smiled her motherly smile and said \"Of course I will, honey. After all, I changed your diapers not long ago.\"<br>\r\nSamantha picked up her young daughter and placed her gently on the bed. She unfolded the diaper and slid it carefully under her daughter's bottom. She brought the front of it up between Naomi's legs and fastened the tapes up nicely. After pressing her hands on the front of the diaper to make certain it was on correctly, she picked up Naomi and set her on her feet.<br>\r\n\"How does it feel?\" she asked her.<br>\r\n\"It feels... great!\" Naomi answered brightly, \"It's pretty thick, though. I can barely even put my legs together.\"<br>\r\n\"Let me see you walk in them,\" requested Samantha.<br>\r\nNaomi did her best to walk straight, but her diaper made her waddle around the room instead. Samantha just giggled and muttered to herself \"So cute.\"<br>\r\nAt that moment, Samantha's combadge beeped. A voice emanated from it \"Janeway to Ensign Wildman. Come in, please.\"<br>\r\nSamantha quickly tapped her combadge and replied in her business tone \"Wildman here, Captain. What is it?\"<br>\r\n\"We're about to begin those experiments with that anomaly we picked up an hour ago,\" the Captain replied, \"We need you in Astrometrics in ten minutes.\"<br>\r\n\"Alright, Captain,\" agreed Samantha, \"I'll be there in five. Wildman out.\"<br>\r\nShe tapped her combadge again and turned to Naomi, who was still trying to get used to her diaper.<br>\r\n\"Naomi, sweetie, come here, please,\" Samantha sweetly asked her daughter.<br>\r\nNaomi smiled and waddled back over to her mother. Samantha knelt down and let Naomi walk into her open arms. She hugged her firmly and gave her small diapered bottom a few firm pats.<br>\r\n\"I need to go to work now,\" said Samantha as they pulled apart, \"Do you want to come with me or just hang out here for a while?\"<br>\r\nNaomi stood thinking for a moment. On the one hand, she could accompany her mother to work. She knew her mother would be ralways enjoy her company as long as she did not interfere with the workload, but she was uncertain that she would want to go out into the hallways of the ship wearing diapers underneath her clothes. On the other hand, she could stay in their quarters without any need for clothes and just lounge around in her diapers, but she wouldn't have anyone to hang out with.<br>\r\nAfter some more consideration, Naomi told her mother that she would</span></div></div>",
            "created":1346216400,
            "id":1416491,
            "title":"\"Can you do it?\""
        },
        "1453":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Seska",
                "One or both of the Delaney Sisters",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick another character:</span></div></span></div>",
            "created":1346043600,
            "id":1415084,
            "title":"Other"
        },
        "14531":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "Other reason"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the Cardassian infiltrator Seska wear diapers??</span></div></span></div>",
            "created":1346043600,
            "id":1415085,
            "title":"Seska"
        },
        "14532":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "One",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it going to be one or both of them?</span></div></span></div>",
            "created":1346043600,
            "id":1415086,
            "title":"One or both of the Delaney Sisters"
        },
        "145321":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Jenny Delaney",
                "Megan Delaney"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one will it be?</span></div></span></div>",
            "created":1346043600,
            "id":1415087,
            "title":"One"
        },
        "14533":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Marla Gilmore",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick another character:</span></div></span></div>",
            "created":1346043600,
            "id":1415088,
            "title":"Other"
        },
        "145332":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Mariah Henley",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick another character:</span></div></span></div>",
            "created":1346216400,
            "id":1416476,
            "title":"Other"
        },
        "1453322":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Tal Celes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick another character:</span></div></span></div>",
            "created":1346216400,
            "id":1416480,
            "title":"Other"
        },
        "14533222":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "The entire female staff",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hell with it! Why don't you just diaper the ship's entire female staff?<br>\r\n<br>\r\nActually, that's not a bad idea. So go with that unless you've got someone else in mind.</span></div></span></div>",
            "created":1346216400,
            "id":1416482,
            "title":"Other"
        },
        "145332221":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Strange anomaly",
                "Abductions"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Actually, you know what? That's not a bad idea. But how will this happen?</span></div></span></div>",
            "created":1346475600,
            "id":1418757,
            "title":"The entire female staff"
        },
        "1453322211":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "This anomaly",
                "Another anomaly"
            ],
            "content":"<div class=\"\"><div> <span>What kind of anomaly.<br>\r\n<br>\r\nWhat if one day a female crewman wakes up and everything is different, every woman onboard is behaving like babies/toddlers, and everyone except this one person, be they man woman or computer believe this to all be normal. It’s up to this lone woman to find out what has happened to her crew and how to fix it, or remain one of starfleets cutests. Or maybe they already were all along</span></div></div>",
            "created":1539320400,
            "id":2563037,
            "title":"Strange anomaly"
        },
        "1453322212":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "the men",
                "the women"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who gets abducted, the men or women?</span></div></span></div>",
            "created":1346475600,
            "id":1418758,
            "title":"Abductions"
        },
        "14533222121":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "back off",
                "investigate"
            ],
            "content":"<div class=\"\"><div> <span>(Note: in this universe, I decided to have Kes remain on board the ship. This is AU, after all.)<br>\r\n<br>\r\nCaptain Kathryn Janeway was on the bridge in her chair. She was reflecting on the events of the past few days. B'Elanna had given birth to her and Tom's baby girl Miral, Icheb had become the first person accepted into Starfleet Academy at such long-distance, and her crew was a little closer to home. She felt that things were looking better than ever before for her crew and the ship.<br>\r\n<br>\r\n\"Captain, I'm picking up a vessel about a light-year in front of us,\" Tuvok reported.<br>\r\n<br>\r\n\"Designation?\" Janeway inquired.<br>\r\n<br>\r\n\"Unknown,\" reported Tuvok.<br>\r\n<br>\r\n\"It's definitely not the Borg, but it appears to be technologically superior to Voyager,\" reported Ensign Harry Kim.<br>\r\n<br>\r\n\"Heading, Tuvok?\" said Janeway.<br>\r\n<br>\r\n\"They appear to be coming directly for the ship,\" replied the Vulcan.<br>\r\n<br>\r\n\"Tom, bring us closer to them,\" Janeway ordered the helmsman, \"Try to stay as close to our present route as possible.\"<br>\r\n<br>\r\n\"You got it, Captain,\" Tom replied, making a slight adjustment to the ship's heading.<br>\r\n<br>\r\nBefore long, the Voyager reached the alien ship. Janeway had Harry send a standard greeting in all known languages. There was no response.<br>\r\n<br>\r\n\"It seems to be inactive,\" noted Tom.<br>\r\n<br>\r\n\"The Lieutenant is correct,\" stated Tuvok, \"There are no indications of any life signs on board.\"<br>\r\n<br>\r\n\"But it halted its engines when we came within a certain distance of it,\" Harry pointed out, \"How could a ship do that without a crew?\"<br>\r\n<br>\r\n\"This could simply be a ship that is programmed to seek out ship's of other races, much like our own,\" theorized Tuvok.<br>\r\n<br>\r\n\"What do you think, Captain?\" asked Chakotay \"Should we investigate it or should we back off?\"<br>\r\n<br>\r\nJaneway sat thinking for a moment about their options. In the end, she decided they would</span></div></div>",
            "created":1346475600,
            "id":1418762,
            "title":"the men"
        },
        "145332221212":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "the ship is boarded",
                "the ship is bombarded"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's investigate,\" she decided, \"It would be foolish to pass up an opportunity like this to learn more.\"<br>\r\n<br>\r\n\"As much as I'd love to search it, Captain, that might be a little difficult,\" stated Tom, \"The shields are up. We cannot transport through.\"<br>\r\n<br>\r\n\"What about a shuttle craft?\" queried Janeway<br>\r\n<br>\r\n\"I can detect no signs of any shuttle doors,\" Tuvok replied after a quick scan, \"There does not seem to be a way to board it, either.\"<br>\r\n<br>\r\n\"Tom, bring us closer,\" Janeway ordered the Lieutenant, \"There might we another way inside.\"<br>\r\n<br>\r\nParis brought the ship forward at bare minimum impulse. But just a few hundred meters later, the alien ship came to life.<br>\r\n<br>\r\nIn the span of no more than three seconds, the alien ship's engines were activated, its weapons were brought online, Voyager was targeted, and a powerful burst of energy was launched near Main Engineering.<br>\r\n<br>\r\nThe crew of Voyager was taken completely by surprise. Several people were knocked off their feet while others struggled to remain standing.<br>\r\n<br>\r\n\"Pull us back!\" Janeway shouted hastily.<br>\r\n<br>\r\nLieutenant Paris did not need to be told twice. He reversed Voyager's heading. But just a few seconds later, Harry reported \"Captain, two more ships just materialized behind us!\"<br>\r\n<br>\r\nAlmost immediately after he said this, Voyager was hit from behind by another burst of energy.<br>\r\n<br>\r\n\"We're surrounded!\" Tuvok shouted.<br>\r\n<br>\r\n\"Tuvok, get the weapons up!\" Chakotay demanded.<br>\r\n<br>\r\n\"I'm afraid I cannot; that second blast disabled the phaser array and the photon torpedoes!\" shouted Tuvok.<br>\r\n<br>\r\nJaneway swore under her breath, thinking furiously about another alternative. Just then,</span></div></div>",
            "created":1346475600,
            "id":1418768,
            "title":"investigate"
        },
        "1453322212121":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "They went to work",
                "Hours later..."
            ],
            "content":"<div class=\"\"><div> <span>\"Captain, I'm picking up signs of transporter activity!\" yelled Harry, \"They're trying to beam aboard the ship!\"<br>\r\n<br>\r\n\"Shields up!\" shouted Janeway.<br>\r\n<br>\r\n\"They're already up!\" Harry informed her, \"But they're still getting through!\"<br>\r\n<br>\r\n\"Oh no,\" muttered Janeway, \"Where are they mainly entering?\"<br>\r\n<br>\r\n\"Main Engineering, Astrometrics, the Cargo Bay, and several hallways throughout decks 2-9!\" said Harry, \"Wait... Oh, God, they're coming onto the Bridge now!\"<br>\r\n<br>\r\nJust then, three armed figures materialized onto the Bridge. They were fully clad in black suits with gas masks covering their heads. Tuvok whipped out his phaser, but he was shot by one of the intruders.<br>\r\n<br>\r\n\"Red Alert!\" shouted Janeway.<br>\r\n<br>\r\nA burst of activity happened on the bridge. Everyone tried to arm themselves, but the figures were elusive. They drew some small canisters from their belts and dropped them onto the ground. Almost immediately, a greenish gas started emanating from them.<br>\r\n<br>\r\nEvery person on the bridge started coughing violently. It was not hard to determine that the gas was making them lose consciousness.<br>\r\n<br>\r\nBefore long, the gas was distributed throughout the entire ship and every single member of the crew slipped out of consciousness.<br>\r\n<br>\r\nOn the bridge, one the figures slowly approached Janeway's figure and remarked to the others \"It appears we have a healthy find here. Let's get to work.\"<br>\r\n<br>\r\nThe others agreed.</span></div></div>",
            "created":1346475600,
            "id":1418773,
            "title":"the ship is boarded"
        },
        "14533222121212":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "They search the ship",
                "They have the computer locate everyone"
            ],
            "content":"<div class=\"\"><div> <span>Hours later, Captain Janeway began to stir from her uneasy slumber. She coughed a few times and rubbed her eyes.<br>\r\nShe began to look around herself. She realized that she was lying on the floor of the Bridge. Nothing about the room itself had changed. All the panels and equipment were still there. However, she quickly realized that Tuvok, Harry, Tom, and Chakotay were all gone.<br>\r\nShe also felt a little cold for whatever reason.<br>\r\nShe slowly sat up onto her knees, hearing a strange plastic-like crinkling sound. She paid no mind to that, though.<br>\r\nShe reached up to tap her combadge. But she was not wearing it. In fact, she wasn't wearing her uniform shirt either. Janeway looked down and saw that to her horror, she was wearing nothing but a thick white disposable diaper.<br>\r\nBefore she could react to this, she heard a groan coming from the other side of the room. She looked around and saw Crewman Tal Celes spread out on the ground. Like Janeway, the Bajoran crewman was clad in nothing but a diaper, as well.<br>\r\nJaneway walked over to her and helped her up, saying \"Are you alright, Tal? Tal? Celes, are you okay?\"<br>\r\n\"Yes, Captain, thank you,\" responded the disoriented crewman as she got onto her feet. After a moment, she quickly realized that her uniform was gone and had been replaced with something most unusual. \"Captain, what's going on?\"<br>\r\n\"I don't know, Tal,\" responded Janeway, \"But we need to search the ship for the others.\"<br>\r\n\"Couldn't we just have the computer locate everyone?\" suggested Tal.</span></div></div>",
            "created":1346562000,
            "id":1419331,
            "title":"Hours later..."
        },
        "145332221212122":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Stay with Voyager",
                "On an alien ship"
            ],
            "content":"<div class=\"\"><div> <span>\"That's not a bad idea, Crewman,\" stated Janeway.<br>\r\nShe looked up slightly and said \"Computer, locate Commander Chakotay.\"<br>\r\nThe computer took a moment, then responded \"Commander Chakotay is not on board.\"<br>\r\nTal and Janeway looked at each other nervously. Then Janeway said \"Locate Lieutenant Tom Paris.\"<br>\r\n\"Lieutenant Paris is not on board.\"<br>\r\n\"Locate Ensign Harry Kim.\"<br>\r\n\"Ensign Kim is not on board.\"<br>\r\nTal and Janeway were seriously starting to become concerned.<br>\r\nJaneway then said \"Locate Lieutenant B'Elanna Torres.\"<br>\r\nThis time, the computer answered \"Lieutenant Torres is in Main Engineering.\"<br>\r\nTal and Janeway breathed a sigh of relief. Then Tal asked the computer \"Is she conscious?\"<br>\r\n\"Negative,\" replied the Computer.<br>\r\n\"We'll see to her later,\" Janeway decided, \"Let's look up the crew manifest and run through it.\"<br>\r\n\"Great idea, Captain,\" said Tal.<br>\r\nThe two diapered women waddled over to the command module and brought up the crew manifest. They ran through every person on it.<br>\r\nIn the end, they discovered that about half of the crew was gone and the other half was accounted for.<br>\r\nWhat really stood out was that only the female crew members were still on board; the male crew members had disappeared.</span></div></div>",
            "created":1346562000,
            "id":1419336,
            "title":"They have the computer locate everyone"
        },
        "15":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "T'Pol",
                "Hoshi Sato",
                "Other",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which woman should be diapered?</span></div></span></div>",
            "created":1346043600,
            "id":1415053,
            "title":"Enterprise"
        },
        "151":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She likes them",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the ship's Science Officer and First Officer, Subcommander T'Pol, wear diapers?</span></div></span></div>",
            "created":1346130000,
            "id":1415841,
            "title":"T'Pol"
        },
        "152":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Samantha Wildman",
                "She is forced into them",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would the ship's Communications Officer, Ensign Hoshi Sato, wear diapers?</span></div></span></div>",
            "created":1346130000,
            "id":1415842,
            "title":"Hoshi Sato"
        },
        "1523":{
            "author_id":"ermbackwards",
            "author_name":"E RM backwards",
            "choices":[
                "She starts having accidents",
                "A mistranslation on a dipolmatic mission",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other reasons why Hoshi should end up in diapers?</span></div></span></div>",
            "created":1374901200,
            "id":1635298,
            "title":"Other reasons"
        },
        "15232":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Hoshi was nervously preparing for her latest mission. The enterprise had recently made first contact with a species called the Dorama. and apparently they were the first ones to come across them, not even the Vulcans knew about them. Everyone was eager to meat their knew hopefully future friends to learn more about each other and maybe even establish relations. But there was one odd tradition of the Doramans that complicate things just slightly.<br>\r\nThe crew soon learned that the doramans were one of the few, if not the only race in the galaxy to develop a waste management system that revolved around the use of diapers and not some form of a bathroom. So in short the entire species wore diapers, as for the sake of diplomacy requested that any delegates who come over to their ship wear them as well.<br>\r\nWhen Hoshi was first briefed on the mission she had felt a healthy mix of excitement and uncertainty, but now she was mostly uncertain as she inspected herself in the mirror bare from the waist down except for the thick diaper that swaddled her crotch and buttocks. The garment felt soft and secure but was endlessly embarrassing, she had to use a little more force than she liked to make her thighs touch. <br>\r\n“But they’re nessesary for the mission” she reminded herself. So she took a deep breath, pulled up her pants, tried not to notice her diaper bulge, and left for the airlock.<br>\r\n<br>\r\nBut was she going on the mission alone</span></div></div>",
            "created":1523077200,
            "id":2476017,
            "title":"A mistranslation on a dipolmatic mission"
        },
        "152322":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Tpol ",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was going with her</span></div></span></div>",
            "created":1523077200,
            "id":2476020,
            "title":"No"
        },
        "1523221":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Yes, it was quite obvious",
                "No, but how could that be"
            ],
            "content":"<div class=\"\"><div> <span>The doramans had asked that the boarding party be small. Hoshi was a definite first choice for this diplomatic mission. Captain Archer was planning on going as well until the Vulcans found out and insisted Tpol be the second person to represent the Vulcan race.<br>\r\n<br>\r\nBut was she in a diaper</span></div></div>",
            "created":1523077200,
            "id":2476022,
            "title":"Tpol "
        },
        "15232211":{
            "author_id":"carrier",
            "author_name":"carrier",
            "choices":[
                "A monogendered female race that uses diapers",
                "or do they not use diapers at all"
            ],
            "content":"<div class=\"\"><div> <span>A quick glance at the Commander showed of her padded rear quite clearly. Hoshi quickly joined T'Pol at the shuttle and said their introductions.<br>\r\n<br>\r\n\"Well Ensign let us hope for good fortune on this mission and that we don't have to use these waste disposal garments.\" T'Pol patted the bulge in her crotch.<br>\r\n<br>\r\n\"I concur, ma'am, though I do have to admit they are rather comfy\" Hoshi's cheeks flushed a deep red upon realizing what she had just said fearing a rebuke but, T'Pol only gave a knowing smile<br>\r\n<br>\r\n\"I concur as well Ensign now let us focus on the task at hand.\"<br>\r\n<br>\r\nYou and T'Pol soon arrived on the Doramas ship<br>\r\n<br>\r\nNow are the Dorama a<br>\r\n<br>\r\n</span></div></div>",
            "created":1538110800,
            "id":2556009,
            "title":"Yes, it was quite obvious"
        },
        "153":{
            "author_id":"cats101c",
            "author_name":"Tuba God",
            "choices":[
                "She likes to wear them",
                "She is forced to.",
                "Other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><a rel=\"nofollow\" href=\"https://memory-alpha.fandom.com/wiki/Cutler\" target=\"_blank\">https://memory-alpha.fandom.com/wiki/Cut...</a><br>\r\n<br>\r\nWhy does Crewman Cutler need diapers?</span></div></span></div>",
            "created":1604981340,
            "id":2937575,
            "title":"Crewman Cutler"
        }
    },
    "info":{
        "author_id":"arnoldjameson0",
        "author_name":"Stendier",
        "brief_description":"The female characters from everyone's favorite sci-fi franchise get diapered!",
        "created":1346112600,
        "description":"<td align=\"left\" class=\"norm\">Rules:<br>\r\n<br>\r\nKeep the women in diapers (you can have some men in diapers, but the main focus is on the women).<br>\r\nNo killing off main characters<br>\r\nSex is okay, as long as it's not guy on guy.<br>\r\nNo age regression, transformation, or vore. No growing/shrinking.<br>\r\n<br>\r\nAnd most importantly:<br>\r\nPlease make long chapters with decent grammar and spelling.<br>\r\nI want you to try to go into detail and make it vivid and lively.<br>\r\nSo please try to make long chapters.<br>\r\nThat includes you as well, CardinalPriest!<br>\r\n<br>\r\nGive it your best!</td>",
        "id":1887680,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604981340,
        "modified":1604981340,
        "pretty_title":"Star Trek Women Diapered"
    }
}