{
    "chapters":{
        "1":{
            "author_id":"tiger189a",
            "author_name":"That Goddess",
            "choices":[
                "...in school",
                "....at work",
                "....as a hero",
                "...spent with Ema",
                "...spent with friends/family"
            ],
            "content":"<div class=\"\"><div> <span>Your life had always been quite hard since the day you became malleable. You seemed to have become quite unlucky during that, as well, spending more time squished than normal.<br>\r\n<br>\r\nThough, you always managed to recover, letting you get on with life even with some difficulty.<br>\r\n<br>\r\nToday was another day...</span></div></div>",
            "created":1560265260,
            "id":2671910,
            "title":"A New Day"
        },
        "11":{
            "author_id":"tiger189a",
            "author_name":"That Goddess",
            "choices":[
                "You're interrupted during your walk",
                "You could see the school's bully waiting at the gate",
                "You could see one of your friends at the gate, waiting",
                "You could see a teacher at the gate",
                "You managed to get to school uninterrupted"
            ],
            "content":"<div class=\"\"><div> <span>You sighed, slowly falling out of your bed. Barley able to stand. Today was another day at school... not that you actually learned anything as most of your time was spent as someones cushion, insole or just as a big stain somewhere.<br>\r\n<br>\r\nYou slowly pushed yourself up, feeling as if your arms would squish from that alone and slouched over to your dresser. Your clothes had been especially made to survive your condition being made of almost the same material you had become. Someone would have to deliberately rip them off for you to lose them.<br>\r\n<br>\r\nYou heard your roommates still sleeping - you had to leave earlier to avoid being squished by someone, be it by accident or not - as you slowly got dressed in some plain clothes, a black shirt with some unreadable logo, as well as shorts and some plain socks. You looked in the mirror, seeing your long, blond hair, which somehow seemed to have survived everything so far. Slowly walking out into the living room you quickly are breakfast, some off-brand cereal, brushed your teeth, put your shoes on and left for school, hoping that nobody was waiting for you.</span></div></div>",
            "created":1560266100,
            "id":2671912,
            "title":"Beginning of the Day"
        },
        "113":{
            "author_id":"tiger189a",
            "author_name":"That Goddess",
            "choices":[
                "...to test your absorbance, again!",
                "...to test out your capabilities!",
                "...to test something! It's secret though!"
            ],
            "content":"<div class=\"\"><div> <span>Your walk was luckily undisturbed, letting you shake off the last of your tiredness and clearly seeing the person waiting for you at the gate... one of the few friends you had in the school, Ivy.<br>\r\n<br>\r\nIt was kinda weird that she was your friend to be honest and you figured it was just because of your condition. Ivy was the head of the science club and probably the smartest person in the school. As such she was fascinated with your condition, becoming your friend and conducting test after test on you, most of which were voluntary. Only a few were done under heavy protesting and usually took days or weeks to complete... like the one time she cut you in half and stuffed you into her sneakers for a month, just to see how that would affect you.<br>\r\n<br>\r\nYou looked her other, mainly to check if she was carrying sedative, seeing her comically huge labcoat, her white shirt and her jeans behind it, her feet in those dreaded sneakers. She had brown hair that went to her shoulders and had a smile that could kill... literally, as she almost swallowed you during a test because she smiled, once.<br>\r\n<br>\r\n\"Hello, Sam!\", she greeted you, her voice sweet as honey, a telltale sign that she had been waiting just for you. Mentally preparing for whatever test she had in store for you, you replied with a simple \"Hi\", hoping to shut her down right there. You didn't.<br>\r\n<br>\r\n\"So, Sam! I'm sure you won't mind helping me with a little experiment, being early and all, right~?\", she asked, knowing you couldn't really say no, anyways... nobody ever could Ivy just seemed to have that kind of aura... and even if you did, you couldn't stop her. \"Uhh, sure? What kind?\" you asked sheepishly, hoping it'd be just some simple thing like holding something for her. \"Well, I wanted...\"</span></div></div>",
            "created":1560268020,
            "id":2671917,
            "title":"Introducing: Ivy"
        },
        "12":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Seat Cushion.",
                "Foot Goo.",
                "Old Friends.",
                "Waiting for later."
            ],
            "content":"<div class=\"\"><div> <span>You worked in a cubicle at an office building. Most people would say that it was one of the worst jobs ever, but you beg to disagree. Ever since your body had changed you had grown a real pervy streak where you take advantage of your bodies special properties. One time you had even squished yourself onto a seat so you could be sat on by your gorgeous co-workers. <br>\r\n<br>\r\nThe question is, what are you going to do today?<br>\r\n<br>\r\nA: Try the seat cushion strategy again since it worked so well the first time.<br>\r\nB: Hide under someones desk and turn yourself into a ball so they step on you with their shoes and feet. <br>\r\nC: Employ the help of an old friend that also works at the company.<br>\r\nD: Just keep working and bide your time. <br>\r\n</span></div></div>",
            "created":1560397380,
            "id":2672522,
            "title":"Boring 9 to 5."
        },
        "13":{
            "author_id":"tiger189a",
            "author_name":"That Goddess",
            "choices":[
                "...using your power as well as gadgets",
                "...using the other powers that you gained over time",
                "...using nothing but your squishiness",
                "...to become their toy out of choice"
            ],
            "content":"<div class=\"\"><div> <span>After working in your dead-end for what seemed like way too long, constantly being bullied by your colleagues and used in inappropriate manners, you had eventually decided to quit and use your power for good!<br>\r\n<br>\r\nIt didn't work out that well, though... most villains had their way with you and you usually only managed to help by distracting the villain, making them toy with you instead of doing what they actually wanted to do.<br>\r\n<br>\r\nBut oh, well, you still tried! And you tried your best each time...</span></div></div>",
            "created":1560531180,
            "id":2673192,
            "title":"SS to the rescue"
        }
    },
    "info":{
        "author_id":"tiger189a",
        "author_name":"That Goddess",
        "brief_description":"Join Sam in different parts of her live... from school to hero. But always unlucky!",
        "created":1560264900,
        "description":"<td align=\"left\" class=\"norm\">You're Sam, a decently sized, blond girl. You've been made malleable early in your life for an unknown reason. Yet you continued to go through life, enduring lots and lots of hardship in school, eventually managed to get a job only to later become a superhero...<br>\r\n<br>\r\nWhat you didn't know is that there were countless other universes, one for each encounter... and every encounter could've ended your life in some way.<br>\r\n<br>\r\n<br>\r\nSo, rules!<br>\r\n<br>\r\n1. Water Sports, and basically any vore that doesn't involve eating is forbidden.<br>\r\n2. 18+ is allowed, unless it's \"forced\" or only focuses on it.<br>\r\n3. Try to write in a way that doesn't give people a headache...<br>\r\n4. I reserve the right to delete or change anything that doesn't make sense and doesn't fit with previous chapter.<br>\r\n<br>\r\n<br>\r\nStory wise:<br>\r\n<br>\r\n1. You're not tiny... yet. You're actually a bit bigger than most people, though that can quickly change. From science to magic to just having parts of your body removed... as long as it's explained, it goes.<br>\r\n<br>\r\n2. You're gummy-like. Meaning you can be squished, stretched, cut, molten, formed, etc. There might also be a way for people to harden your body solid.<br>\r\n<br>\r\n3. You can turn out to love being abused, hate it or not minding it. Once again, as long as you give a reason, it goes.<br>\r\n<br>\r\n4. You didn't receive any other powers. You're gummy for better or worse, but you never got anything else. You can still get someone during a story-line, but not before that.<br>\r\n<br>\r\n<br>\r\nYou can make up your own characters or simply choose one of a few premade ones I'll add over time(Nothing after this, if you don't care, you can skip)<br>\r\n<br>\r\n- Ema Pobra<br>\r\nQuite oblivious and easy to entertain. She has long, red hair, is quite well-developed and dresses casually (Sneakers, t-shirts, etc.).<br>\r\nShe's been Sam's roommate throughout Sam's life and often got her into some unaware disasters, though they always love about it in the end</td>",
        "id":2193105,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1560531180,
        "modified":1560531180,
        "pretty_title":"Squishy Sam"
    }
}