{
    "chapters":{
        "1":{
            "author_id":"khlover369",
            "author_name":"KHL",
            "choices":[
                "Well I am hungry ",
                "I feel like smash you",
                "How far can I throw"
            ],
            "content":"<div class=\"\"><div> <span>You are sailing out in the middle of the sea hoping to find some treasures to bring back home for a better life when a terrible storm broke out. You fall off the boat and swim for your life. You end up on a shore too tired to care where you are you fall fast asleep.You wake up to find that you are tied down to the ground you look at your surrounding and find yourself surrounded by little people. Still tied down, the little people take you to their town chain you up and leave you untied, but hungry. <br>\r\nAfter a few hours of not eating anything you start to wonder, \"I wonder if these little people taste good?\" your belly growls in wonder also.<br>\r\nSuddenly, the king of the town comes and he has soldiers behind him a long with a man in chains the king comes up to you and says, \"You will be our executioner for this town and I demand that you punish this man at once!'<br>\r\n\"But I haven't done anything,\" said the man<br>\r\n\"Silence you cur!\" shouted the king,\"Now throw him to the giants feet he will be at it's mercy now,\" and with that the king walked away.<br>\r\nThe soldiers pushed the man at your feet and they too walk away. The chained man also tries to leave, but the chains keep him bound he looks at you with terror in his eyes he says, \"Wh-what are you going to do with me?\"<br>\r\nYou stare back a little confused, \"I guess i have to punish you.\" You reach for his chains and pull him closer to you and the man yelps as you pull. Suddenly you hear a low growl coming from you belly you look at your belly and pat it gently the man then panics and shouts, \"NO, please no, don't do it, please I beg of you, please don't eat I don't taste very good I'll give you indigestion.\" <br>\r\nYou think about it this for a few minutes and you decided....... </span></div></div>",
            "created":1296963300,
            "id":1048397,
            "title":"You begin your jounry!"
        },
        "11":{
            "author_id":"khlover369",
            "author_name":"KHL",
            "choices":[
                "You should be puinshed",
                "I'll find a way to help you"
            ],
            "content":"<div class=\"\"><div> <span>\"I don't know you look mighty taste right now especially since I haven't eaten in a while,\" you say and your belly growls evenly louder.<br>\r\nThe man tries to get away, but grab his shirt between your fingers and bring him up to your face and notice the chains on him, \"hmmm I don't think those chains are digestible maybe I can break them off?\" So you try to break the mans chains after a few minutes the chains fall on the ground and the man was freed, \"Oh thank you, thank you so much,\" said the man<br>\r\n\"No I should be thanking you,\" you say with a smile<br>\r\n\"Why?\"<br>\r\n\"For being my lunch,\" you lick your lips and lift him over your mouth ready to swallow him whole.<br>\r\n\"NO don't, please I-\"<br>\r\nYou drop him in your mouth and quickly close it \"Mmmmm\" you say tasting the man, then you lift your head and swallow hard you can feel the man going down your throat, past your chest and in to your stomach.<br>\r\nYou lick your lips savoring the taste of him and then you pat and gently rub your belly. You can feel the man in your belly squirming around inside your belly, you let out a satisfied burp, \"buuuuuuurrrrrrrrp,\" you sigh and pat the bugle in your tummy.<br>\r\n\"What was that?\" said the king coming back with his soldier.<br>\r\n\"Just doing my... urp.. job your highness.\" <br>\r\nThe king looks at your belly and surprised he says, \"you ate him?\"<br>\r\n\"Hic.... yes and he was delicious,\" you say licking your lips again<br>\r\n\"Well.... all right your the executioner,\" said the king with a smile.<br>\r\n\"By the way what was his crime?\"<br>\r\n\"Oh, that man woke me up from a nap just to say hello i was very tired that day,\" said the king and turned to his soldiers<br>\r\nSuddenly you start feeling a little sick. Is it because of the squirming little man inside your tummy or did that sound like a ridiculous reason to punish someone.<br>\r\n\"Bring in the next prisoner,\" said the king and the soldiers pushed a little boy at your feet and before they walked away the king said, \"you can eat him as well I like this eating people thing.\" he chuckled and left.<br>\r\nYou look at the little boy trying to get away, but you pull him closer by his chains\"What- what are you going to do with me?\" said the terrified boy.<br>\r\nYou sigh and say,\"ask you what your crime was and start from there.\"<br>\r\nThe boy looks at you then at the bugle in your belly, \"Oh, please don't eat me I beg of you please.\"<br>\r\n\"Your crime what is it?\" you say almost losing your patients.<br>\r\n\"I ran in the halls of the castle only to deliver a message and the king said, 'no running my halls,' and now I'm here being punished.\"<br>\r\n\"Well you shouldn't be punished like this,\" you say and you stop to think about what to do.\"<br>\r\n\"Well,\" you say to the boy, \"I think...........\"</span></div></div>",
            "created":1296967320,
            "id":1048432,
            "title":"Well I am hungry "
        }
    },
    "info":{
        "author_id":"khlover369",
        "author_name":"KHL",
        "brief_description":"It's traveling story for you to decide what to do!",
        "created":1296962940,
        "description":"<td align=\"left\" class=\"norm\">You are a part of Gulliver's Travels, but in a very different way<br>\r\n*Note no sexual stuff* <br>\r\n</td>",
        "id":1748820,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1296967320,
        "modified":1296967320,
        "pretty_title":"Your Travels"
    }
}