{
    "chapters":{
        "1":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "The Worker, Minos",
                "The Author, Idward Focks",
                "The Mechanic, Miles Lionheart",
                "The FABULOUS One, Randal Hawthorne",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off, choose which worker you'd like to expand.</span></div></span></div>",
            "created":1220072400,
            "id":579285,
            "title":"Choose a Worker"
        },
        "11":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Butt expansion, Muscle expansion, or Mpreg {split road from here due to update}",
                "Fruitification",
                "Penis expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your choice is Minos? You have excellent taste! How would you like him to expand today?</span></div></span></div>",
            "created":1220072400,
            "id":676591,
            "title":"Minos"
        },
        "111":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Force Feed",
                "Overeating",
                "Motive"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does he pack on the pounds?</span></div></span></div>",
            "created":1234155600,
            "id":645026,
            "title":"Weight gain"
        },
        "1111":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Mora, deciding she wants him larger",
                "Miles, as some sort of revenge",
                "Rachael, out of love"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will forcefeed him?</span></div></span></div>",
            "created":1234242000,
            "id":645127,
            "title":"Force Feed"
        },
        "11111":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Make Minos grow fatter even without stuffing him.",
                "Minos can only get fatter as long as he is getting stuffed."
            ],
            "content":"<div class=\"\"><div> <span>\"Minos dear, I think we need to talk,\" said Mora to Minos in a leering tone.<br>\r\n\"What is on your mind, Mora?\" the bull responded. \"Is there something wrong?\"<br>\r\n\"Hm, maybe...\" Mora said with a sly look on her face. \"It's just that you've been hanging around with Rachel for quite a while now.\"<br>\r\n\"How is that a problem with our relationship?\"<br>\r\n\"Oh, it's not that at all, it's just that I want to try something new,\" Mora pulls out a clear glass bottle containing a blue-green liquid. She opens it and jams the bottle into Minos' mouth.<br>\r\n\"Ack, what was that and why does my body feel so numb?\"<br>\r\n\"It's a special fluid made by Alejandra's company. You see, me and Alej have recently settled our differences and became once again the best of friends even though she did manage to trick me into taking this one weird drug that makes me inFATuated with \"bigger\" guys.\"<br>\r\n\"That's good to hear, but what does this have to do with the stuff you gave me and arn't I big enough as it is?\" Minos said as he begins to lose his balance.<br>\r\n\"Oh, you're big alright but not big in the right places,\" Mora said with now a devilish look. \"I want you fatter!\"</span></div></div>",
            "created":1243746000,
            "id":700242,
            "title":"Mora, deciding she wants him larger"
        },
        "111111":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "The growth stops for now",
                "The growth continues"
            ],
            "content":"<div class=\"\"><div> <span>Minos looks down, his eyes widening as he sees his abs disappearing, being replaced by a flabby belly. \"Wh-What is this?\", he wonders out loud. Mora grins and giggles, rubbing Minos' gut. \"A special formula that makes the user grow massively fat!\", she proudly announces. \"I've decided I want you to be incredibly fat, my dear bull.\"<br>\r\n<br>\r\n\"But why?\", Minos questions her, feeling his chest develop into a nice soft pair of moobs. \"I can't quite explain it--something to do with whatever Alej slipped me.\", Mora replies. The two bovines watch as Minos' body grows fatter and fatter, his clothing growing tighter. Finally, his belly flops out of his shirt, allowing Mora to rubs it more directly, and his pants begin to pop at the seams in the back.<br>\r\n<br>\r\n\"Mmmm, yeah, NOW you're making progress...\", Mora murrs, noticing Minos' limbs becoming significantly less muscular.</span></div></div>",
            "created":1243832400,
            "id":700447,
            "title":"Make Minos grow fatter even without stuffing him."
        },
        "1111111":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Force the meat bomb in one go!",
                "Stuff Minos, piece by piece."
            ],
            "content":"<div class=\"\"><div> <span>\"Ah, I want you bigger now...\" Mora sighed as the fattening stops on Minos' body that is now slumped to the ground. \"Now what am I going to do?\"<br>\r\n<br>\r\nAs if on cue, Alejandra walks in the room with Mora and witness Minos' new development. \"My, my, what do we have here?\"<br>\r\n<br>\r\n\"Something that would be better if he actually continues to grow,\" said Mora, still disappointed in the results.<br>\r\n<br>\r\n\"Mora, did you even read the instructions on the bottle?\" Alejandra asked and pointed to the printed label on the glass bottle. \"It says you have to continue feeding him to speed the process, not just give him the bottle. That's like driving a new fuel efficient car, you still have to put gas in it.\"<br>\r\n<br>\r\n\"Well duh, why haven't I think of that?\" Mora responded after finally realizing the problem.<br>\r\n<br>\r\n\"Because that stuff I gave has a side affect that makes you slightly \"irrationally,\" for a lack of a better word. Not to mention, since I've already anticipated this situation. I've brought this along.\" Alejandra pulls out a large burrito shaped object wrapped in tin foil. \"I call it, the potato meat bomb!<br>\r\n<br>\r\nWhat it is is a giant sausage wrapped in bacon, layered with hamburger meat, wrapped with another layer of bacon, layered with mashed potatoes, a third layer of bacon, added with shredded chiken, a fourth layer of bacon, added with another layer of mash potatoes, and finally another layer of bacon. <br>\r\n<br>\r\n\"I think I need some help to move that thing!\" Mora suggest.<br>\r\n<br>\r\nThe girls were ready to shove the potato meat bomb into Minos' gullet when suddenly.<br>\r\n<br>\r\n\"The other Crests will come for me to stop this madness!\" Minos weakly responded.<br>\r\n<br>\r\nMora and Alejandra started laughing as Alejandra later explains. \"Those Crests are out of the picture. Just so you know, they're not dead but \"decommissioned.\" Even the High Prime was sent to an early retirement when some kind of king came by and took over.\"<br>\r\n<br>\r\n\"Who is this king? Is it the emperor?\"<br>\r\n<br>\r\n\"No, I think it some kind of elf from Sweden I think. Anyways, OPEN UP!\"</span></div></div>",
            "created":1243832400,
            "id":700855,
            "title":"The potato meat bomb"
        },
        "11111111":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "The girls let him stop gaining and play with him",
                "The girls keep feeding him, wanting him even fatter before they have their fun"
            ],
            "content":"<div class=\"\"><div> <span>With that, Mora and Alej force the entire meat bomb into Minos' maw and down his throat. His belly starts to rumble ominously and his entire body visibly grows fatter and softer. The girls both giggle lustfully as the once muscular bull's flab causes his clothes to burst off.<br>\r\n<br>\r\nHe expands at a very fast pace now, his gut and moobs piling in front of him, resting on his blubbery legs, his flabby ass pushing out behind him. Even his face was getting fatter now, his chin count now at three and climbing, his cheeks becoming round and plump. \"Oooh, he's making even better progress than the other Crests did!\", Alej murrs, \"Even Ambar didn't fatten up this fast!\"<br>\r\n<br>\r\nMinos watches helplessly as he grows, soon forced into a sitting position, his legs spread wide to accomodate his belly, among other bits. He lets out a low moan, struggling to get up, but the treatment he's received has also weakened his muscles.<br>\r\n<br>\r\n\"Mmmm, isn't he sexy?\", Mora coos, stroking the bull's swelling gut. \"Indeed he is\", Alej replies, sensually licking one of Minos' moobs. \"P-Please... Stop this...!\", Minos whimpers, feeling powerless for the first time in his life, becoming very sweaty and a bit short of breath. After another few minutes, his growth slows down, his massive jiggling body now filling half the room, his arms getting harder to move, his legs impossible to move. The bull was now immobile, and Mora and Alej likely couldn't be happier.</span></div></div>",
            "created":1243918800,
            "id":700980,
            "title":"Force the meat bomb in one go!"
        },
        "111111112":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Too big! Move Minos to a different location!",
                "Miles walks in."
            ],
            "content":"<div class=\"\"><div> <span>\"We need more!\" Mora gleefully said. \"Hold on, let me get some of Taffy's pudding. That would make him even bigger!\" Mora ran down to get the pudding while Alej is getting ready to have some fun.<br>\r\n<br>\r\n\"Want to know why all of the Crests are decommissioned?\" Alej asked Minos even though his mouth is too squished by his own cheeks to speak. \"Because they've gotten away with my business. You see, that liquid Mora gave you was actually the beta version of my new \"Power Mass\" product. What the alpha product does is increase the body fat of males and muscle increase. Also, strangely enough, improves sex performance. The problem is is that Crests don't like it because \"it does more harm than goo\" they said. But mostly because they don't bigger people to overtake them.\"<br>\r\n<br>\r\nMora walks in with a big bowel of chocolate pudding. \"If this doesn't fatten him up the way we want it, I don't know what will.\" She takes the bowel and begins pouring the pudding down the bull's throat. Fat starts to bubble over in Minos' body with barely any sign of the progress slowing. The girls begin to marvel at what they've done to the formerly buffed Crest.<br>\r\n<br>\r\n\"Look at him go, he's defiantly ready to play with!\" Alejandra exclaimed. The girls were ready to pounce the giant mound of fat.<br>\r\n<br>\r\nBut suddenly...!</span></div></div>",
            "created":1243918800,
            "id":701228,
            "title":"Pudding"
        },
        "1111111121":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Alej came prepared with a special device",
                "Mora calls Digit to teleport Minos"
            ],
            "content":"<div class=\"\"><div> <span>Minos was almost filling the entire room!<br>\r\n<br>\r\n\"Hm... Looks like it's time to move him somehow...\", Mora giggled, \"Maybe we should move him into the barn, so Rachael can watch.\" Minos struggled to move, obviously getting nowhere. \"You got Rachael too...?!\"<br>\r\n<br>\r\n\"Oh, of course! In exchange for me taking care of the Crests, Mora agreed to fatten everyone here until they were too massive to help you!\", Alej joyfully explained, \"Starting with Rachael, of course--Mora was quite bitter indeed about how you chose Rachael over her recently. Your precious kitty is now a big black blob sitting helplessly in her gym, ironically enough.\" Minos glared down at Mora. \"So that's what you've been doing the past couple of days... That's why you made sure I didn't go in the barn, or check anyone's rooms...\"<br>\r\n<br>\r\n\"Yeah, pretty much! Now the question is\", Mora added, \"How do we get you out of here?\"</span></div></div>",
            "created":1243918800,
            "id":701303,
            "title":"Too big! Move Minos to a different location!"
        },
        "11111111211":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Have Minos drop on top of Rachel!",
                "Set Minos next to Rachel."
            ],
            "content":"<div class=\"\"><div> <span>\"Behold, the Fattrap!\" Alej held up of what appeared to be a rectangular box with a handle sticking out.<br>\r\n<br>\r\n\"Okay... You've been watching way too much Ghostbusters,\" said Mora with a slightly disappointed tone.<br>\r\n<br>\r\n\"It was the R&amp;D department's idea.\" Alej responded with a similar amount of disappointment.<br>\r\n<br>\r\nAlej stuffs the trap into the bull's flab and flicked the switch. Minos' entire body was sucked into the box the instant it opened. Strangely enough, Alej held the trap as it was empty despite the fact that a blob of bull was stuffed inside. After the Crest was dealt with, Alej and Mora head towards the barn where the rest of the now immobilly obese gang is located.<br>\r\n<br>\r\n\"How could you do this to us,\" Randal demanded who is now more like a puppy's head on top of a fluffy beanbag. In fact, each of the fattened victims had a different result due to the fact that they were given the beta formula. Taffy has no fat anywhere around her head nor her arms but everywhere on her body, mostly in her breasts, is loaded with blubber. Miles looks he was being consumed by his own colossal ass (kind of fits his personality, doesn't it?) Idward seem to be a continuously morphing entity of mass. Sarah by far has the most obscure result, she is literally a giant, white chibi (oxymoronic, ain't it?) bouncy ball with cat ears, a tail, oversize kitty paws, and THE FACE! <br>\r\n<br>\r\nEach victim is stuffed in his or her stall in the barn. Finally, Rachel is stuck in the back with similar results as Minos.<br>\r\n<br>\r\n\"You're a real bitch!\" Miles accusing Mora.<br>\r\n<br>\r\n\"Ah, you're just pissed because you were the easiest to beat,\" Mora mocked the blubber-butt cat. \"All we had to do was just flash our boobs at you and you go into an orgasmic shock.\"<br>\r\n<br>\r\n\"Fuck...\"<br>\r\n<br>\r\nOh Rachel, we got you a special friend.\"</span></div></div>",
            "created":1244005200,
            "id":701388,
            "title":"The Fattrap!"
        },
        "111111112112":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Mora and Alej begin stuffing all of them, focusing especially on Minos",
                "Mora and Alej continue to stuff just Minos as a warning to everyone else"
            ],
            "content":"<div class=\"\"><div> <span>Alej opens up the Fattrap, letting Minos out in the stable right next to Rachael's. \"Minos!\", Rachael cries, \"They got you too?\" Minos nods, his face jiggling. \"I should've figured this out sooner and helped you, Rachael...\" Rachael sniffles, trying not to let Minos see her tears. \"Minos, don't feel so bad... I still love you, okay?\"<br>\r\n<br>\r\n\"Awww, how touching.\", Mora says sarcastically, \"Now, what should we do with you blobs?\" Alej grins widely. \"Well, we could have our way with each and every one of them right away... Or we could make them even more helplessly fat...\"<br>\r\n<br>\r\nTaffy begins sobbing, burying her face in her hands. \"This is cruel, Mora! I thought we were friends!\", she whimpers. \"Rach was right about you, you're terrible!\", Sarah squeals through her puffy cheeks. \"How could you do this to us, my Morita?!\", Idward questions angrily, his flab constantly shifting as if it were alive, \"You should be ashamed of yourself!\"<br>\r\n<br>\r\n\"Shut up, all of you!\", Mora shouts back at them, \"Now you're REALLY gonna get it!\"</span></div></div>",
            "created":1244005200,
            "id":701402,
            "title":"Set Minos next to Rachael."
        },
        "1111111121122":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Idward manages to escape by morphing through a hole without anyone knowing",
                "The Pump is Sapped and affect all the guys! (Except Carl, because he's cool)"
            ],
            "content":"<div class=\"\"><div> <span>\"You can't silence us!\" Idward's head begins to expand and thanks to the sunlight going through a old, big green bottle sitting on the window sill of the barn, it makes Idward's head turn green and more intimidating. \"I... am... IDWARD!!!\"<br>\r\n<br>\r\nShowing no surprise or discomfort, Mora throws a bucket of water at Idward to shut him up. \"Ow, you're mean,\" whimpered Idward.<br>\r\n<br>\r\n\"Unless you want the fat to melt through your bodies, you best keep quite!\" Mora barked. \"Looks like you need a little more discipline. Alej, have your boys bring out the Pump!\"<br>\r\n<br>\r\n\"No! Not the Pump,\" cried Taffy. \"Please, not the pump!\"<br>\r\n<br>\r\n\"What's the Pump? What the hell is the Pump?\" Miles asked while becoming frantic.<br>\r\n<br>\r\n\"I... was...,\" Taffy begins to sob and can barely finish her sentence.<br>\r\n<br>\r\n\"Taffy was the first victim of the Pump,\" Alej explained. \"It was something that was developed by the Reliable Excavation and Demolition company.\"<br>\r\n<br>\r\n\"RED made this? You crazy bitch!\" Miles responded in anger. \"You have that crazy holding company make that machine?\"<br>\r\n<br>\r\n\"So you've heard of them? I find that relieving since I don't have to explain it to one person,\" said Alej. \"In fact, why don't you tell us who they are.\"<br>\r\n<br>\r\n\"I thought it was some crazy conspiracy theory, there are two co-op holding companies that works in the industrial sector, the Reliable Excavation and Demolition and Builder's League United or RED and BLU for short. That's what they are on the outside, but on the inside they militarily fight each other even inside the company's own factories and they both developed the most demented weaponry.\" <br>\r\n<br>\r\n\"That's true, but you forgot one thing Miles,\" a voice came behind a wheeled machine that is being rolled inside the barn. \"You say it's a conspiracy when you refused the offer I gave you because you were to busy trying to get laid. When you realized that I was making way more money than you can imagine, you try to pit the blame on the RED company for its \"unpopular\" endeavors because you could have been my partner. Look at you now, you're literally a lard ass while I'm the one making money off of your huge ass.\"<br>\r\n<br>\r\n\"Carl...\" Miles responded to the engineer that was preparing a the Pump,<br>\r\n<br>\r\n\"Hey, at least you still have the brain power to remember my name,\" Carl replied while finishing up the prep work and turns it on like as if it was a proton to Mora's lack of surprise. \"Okay Ms. Coldthorn, who's the target?\"<br>\r\n<br>\r\n\"That brown blob over there.\"<br>\r\n<br>\r\n\"Right away,\" Carl jumps up on the mound and begins to force the nozzle into Minos' mouth causing him recklessly explode in size. The blubber begins to overflow out of the stall and into Rachel's.<br>\r\n<br>\r\n\"Oh Minos, no matter what happens to us, I still love you...\" Rachel sobbed.<br>\r\n<br>\r\nThe blobby gang witnessed the onslaught of force feeding. But something happened...</span></div></div>",
            "created":1244005200,
            "id":701415,
            "title":"Mora and Alej continue to stuff just Minos as a..."
        },
        "11111111211222":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Sarah suddenly manages to break her stable open",
                "The machine begins feeding the girls next"
            ],
            "content":"<div class=\"\"><div> <span>The Pump suddenly began sparking and smoking, hoses shooting out from it and into Randal, Idward and Miles' mouths, feeding them along with Minos!<br>\r\n<br>\r\n\"What the hell?!\", Carl yells, examining the device, \"Damn thing's malfunctioning!\" Mora's face goes red with anger. \"Oh, GODDAMMIT! This is just great, we only wanted Minos getting huge for now!\", she fumes. \"Well, Mora, look at it this way\", Alej chuckles, \"We get to watch FOUR hot guys bloat up now...\"<br>\r\n<br>\r\nThe males moan helplessly as they're forced to gulp down countless gallons of feed substance, their bodies swelling larger and larger by the second, flowing into Taffy and Sarah's stables now. Miles' ass looks as though it may explode, Randal is becoming less like a dog and more like a big furry blob of dough, and Idward is no longer recognizable at all, every part of his body rapidly shifting, bloating and shrinking at random.<br>\r\n<br>\r\nSarah starts to cry now, trying to roll away. \"I'm scared!! I don't wanna end up like them!!\"</span></div></div>",
            "created":1244005200,
            "id":701429,
            "title":"The Pump is Sapped and affects all the guys!"
        },
        "111111112112222":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "The Pump ceases to function, no \"deflation\" on any characters",
                "Sarah \"deflates\" back to normal"
            ],
            "content":"<div class=\"\"><div> <span>\"Ha ha, I've finally got my revenge on you, Carl. Now I can... ACK!\" A BLU spy was cut off when he was smacked by Carl's wrench.<br>\r\n<br>\r\n\"Dammit, Anton!\" yelled Carl. \"Now is not the time to fight with me!\"<br>\r\n<br>\r\nIf things hasn't gotten worse, tubes fly out towards Rachel, Taffy, and Sarah.<br>\r\n<br>\r\n\"Let's make like a tree and get the fuck at of here!\" yelled Mora, knowing full well that the barn is about to shatter.<br>\r\n<br>\r\n\"Right behind you.\" Alej said while bailing out through a window.<br>\r\n<br>\r\nCarl swipes Mora off her feet and ran through the door before it was blocked by Taffy and Randal's fluffy bellies. Seconds later, the barn walls blow apart like tooth picks and roof shingles flew off like a giant flock of pidgeons. Nothing was left but giant mounds of fat.<br>\r\n<br>\r\n\"Abram, Get the truck ready! These things look as if they're about to blow,\" Carl told the big Russian heavy weapons expert, who is completely oblivious to the whole event because he was too busy eating a sandwich. \"Abram, you can have that sandwich later. Now we need to get out of here.\"<br>\r\n<br>\r\nAbram finally turns his head to see the colossal mounds and understood the situation. \"Everybody to the truck!\" The Russian called out to a group of battle ready men.<br>\r\n<br>\r\n\"Sweet mother of calories! I don't think those critters are going to last,\" Bill the soldier said. \"We've got to get out of here!\"<br>\r\n<br>\r\nThe two cowgirls and the rest of the guys pack into the back of the truck and sped off to anywhere that would guarantee their safety.<br>\r\n<br>\r\n\"How much did you put in that pump?\" Alej asked Carl.<br>\r\n<br>\r\n\"The feed substance wasn't suppose to filled into the target's body at a fast rate or else the target will expand twenty times than suppose to.\"<br>\r\n<br>\r\n\"Meaning?\"<br>\r\n<br>\r\n\"There's a 50/50 chance that the targets will \"deflate\" back to their original size.\"<br>\r\n<br>\r\n\"What do you mean by \"deflate?\" Their not filled with air... Oh my God\"</span></div></div>",
            "created":1244005200,
            "id":701431,
            "title":"The machine begins feeding the girls next"
        },
        "1111111121122222":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Rachael deflates next",
                "Miles deflates next"
            ],
            "content":"<div class=\"\"><div> <span>Sarah suddenly moans as her belly gurgles, the kitten letting rip a massive fart, before letting out something extra in a constant stream. She quickly deflates, and within a couple of minutes, she finally looks like herself again, though she still carries a bit of flab.<br>\r\n<br>\r\n\"Yay! I'm not huge!\", she giggles, squealing as she sees how tiny she is compared to everyone else. They all feel ready to burst--except Idward, who continues to devolve into a bigger pile of mush. \"Everyone, try to fart or something!\", the white kitten calls up to them, \"Do something, quick!\"<br>\r\n<br>\r\nThe others hear her, trying and trying to \"deflate\" as she had, but none of them are successful. Until...</span></div></div>",
            "created":1244005200,
            "id":701434,
            "title":"Sarah \"deflates\" back to normal"
        },
        "11111111211222222":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Randal deflates",
                "Taffy deflates"
            ],
            "content":"<div class=\"\"><div> <span>Like a missile, Miles flew across the fields with no sign of stopping until he crashes into a haystack. <br>\r\n<br>\r\n\"Note to self, kill the bitch!\" Miles schemed as he crawls out of the haystack. \"Nobody treats me like a science experiment. Nobody!\"<br>\r\n<br>\r\nSarah ran towards Miles to see if he was okay. She noticed that Miles' under side was flabby as much as her belly. \"You okay?\"<br>\r\n<br>\r\n\"More like pissed. I'm going to get that bovine slut if it's the last thing I do!\"<br>\r\n<br>\r\nSeconds late, the two heard a loud burst of gas.</span></div></div>",
            "created":1244005200,
            "id":701441,
            "title":"Rocket Ass"
        },
        "111111112112222221":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Taffy and Rachael deflate",
                "No one else deflates"
            ],
            "content":"<div class=\"\"><div> <span>Randal is the next to deflate, panting heavily and wagging his tail as he does so. \"Ooooh... Finally...\", he murrs, shrinking down to a far more manageable size.<br>\r\n<br>\r\n\"Now we have to help the others!\", Sarah points out. \"Yeah, but how? There's nothing we can do!\", Miles replies, very frustrated to say the least. \"All we can do now is sit back at wait for them to fart!\"<br>\r\n<br>\r\nAfter another moment of waiting...</span></div></div>",
            "created":1244005200,
            "id":701443,
            "title":"Randal deflates"
        },
        "1111111121122222211":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Minos only deflates to a really fat bull",
                "Minos can't deflate"
            ],
            "content":"<div class=\"\"><div> <span>\"I got it! Randal, remember that spicy food you made us? Do you gave any reserves of it?\" Sarah asked with an idea.<br>\r\n<br>\r\n\"Yeah, I've stored it in the cellar,\" Randal replied as the gang ran to the house to get the reserves.<br>\r\n<br>\r\nAfter climbing a while, the freed gang managed to give the reserves to Taffy and Rachel to free them of their fatty prisons. With most of the fat gone, Rachel was still flabby and Taffy has a much larger chest than before. All they group need to do is to return Minos back to normal, but there was a problem.<br>\r\n<br>\r\n\"I don't think we have enough reserves for Minos for him to deflate,\" Randal regrettably discovers. \"We can only hope that he would be at least be mobile.</span></div></div>",
            "created":1244005200,
            "id":701449,
            "title":"Taffy and Rachael deflate"
        },
        "11111111211222222112":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "They decide to keep trying, in case Minos just needs more food for it to work",
                "They wait it out awhile to see if Minos might deflate later on"
            ],
            "content":"<div class=\"\"><div> <span>Try as they may, no matter how much they feed him, Minos can't deflate. They finally manage to help Idward deflate, but still can't help Minos do the same during a second try.<br>\r\n<br>\r\n\"Oh no... My poor Minos is gonna be a giant blob for the rest of his life!\", Rachael sobs, running up and hugging the massive bull, who seems to have finally passed out from fullness and bloated lethargy. Idward, now mostly a huge pile of morphing apparently boneless fox flab, manages to waddle up to her. \"Maybe this won't be so bad...\", he suggests, \"Now you just have more Minos to love...\"<br>\r\n<br>\r\nRachael dries her eyes with her flabby arm and nods. \"Maybe you're right... Perhaps this won't be too bad...\", she whimpers, hoping Idward is indeed correct.</span></div></div>",
            "created":1244005200,
            "id":701454,
            "title":"Minos can't deflate"
        },
        "111111112112222221121":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Minos deflates!",
                "Minos doesn't deflate..."
            ],
            "content":"<div class=\"\"><div> <span>\"This is the last of it,\" said Idward who hands Rachel one of Randal's reserves and also managing to control his morphing ability. \"I don't think we have time to make another batch without fearing that Minos will never be return to normal.\"<br>\r\n<br>\r\n\"It's the best we can do for him,\" said Rachel looking down at the unconscious bull. \"It would be a miracle if Minos returns to normal, or at least more manageable.\"<br>\r\n<br>\r\nThe group waited near Minos to see what would happen while Miles was scheming on how to get back at Mora and Alejandra for the torment they have put him through. <br>\r\n<br>\r\n\"Just you wait Mora. Not even Carl would help you.\"<br>\r\n<br>\r\nDespite of their change, Idward and Taffy were getting along rather well. They might consider their previous predicament a mixed blessing in terms of better body results despite of what their friends went through.<br>\r\n<br>\r\nThen something happened...</span></div></div>",
            "created":1244005200,
            "id":701461,
            "title":"They decide to keep trying, in case Minos just ..."
        },
        "1111111121122222211211":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "They capture Mora, but Alej gets away",
                "They capture both of them"
            ],
            "content":"<div class=\"\"><div> <span>After a few rather painful minutes of waiting, Minos finally lets out a nice long fart, slowly deflating, eventually shrinking to about the size of a tractor. Still incredibly fat, but alot more manageable than what he had just been.<br>\r\n<br>\r\nRachael cries tears of joy, clinging to the still unconcious bull, purring loudly. \"We did it! My bull, you're back to a normal size!\", she squeals. \"Looks like a happy ending after all!\", Idward chuckles, Taffy giving him a big smooshy hug, the fox murring as his head expands from the hug, his face buried in the rabbit's cleavage. \"I knew my cooking would be appreciated someday...\", Randal declares in a playful faux dramatic fashion, as Sarah pulls him close and kisses his cheek.<br>\r\n<br>\r\n\"Now, we just need to find those cow bitches and take care of them.\", Miles says with a mischievous grin. \"That won't be necessary\", Taffy giggles, \"They're watching from the bushes.\" She points to a nearby bush, where it seems Mora and Alej had indeed come back to watch what was happening. And before they knew it...</span></div></div>",
            "created":1244005200,
            "id":701462,
            "title":"Minos deflates!"
        },
        "11111111211222222112111":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Mora becomes a big boobed muscle cow!",
                "Mora gets a very fatty hourglass body"
            ],
            "content":"<div class=\"\"><div> <span>\"Jump em!\" Miles yelled out as the group charged at the two cows.<br>\r\n<br>\r\n\"Let's get out of here, Alej... Alej?\" Mora said as she saw her friend already a mile ahead of her. \"Alej, you back stabbing bitch!\"<br>\r\n<br>\r\nDespite her anger, it wasn't enough to hold off the vengeful attackers. The gang strapped her down to the picnic table while using Idward' limbs as ropes to hold Mora in her place. They pondered what kind of punishment the group should give to the cow. It took a lot of thought until it was decided that it would be fair to give Mora the same treatment she used on the whole household, especially when Sarah found the beta formula that was used on them.<br>\r\n<br>\r\n\"It's time for you to feel the pain you've given us!\" Rachel cried out as she plunges the bottle into Mora's mouth.<br>\r\n<br>\r\nIt didn't take long for the fluid to do its work as Mora's breasts begins to plump up and hips as well, but something unexpected happened...<br>\r\n<br>\r\n </span></div></div>",
            "created":1245906000,
            "id":714166,
            "title":"They capture Mora, but Alej gets away"
        },
        "111111112112222221121111":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "She fattens Rachael first",
                "Flab suddenly starts piling onto her body before she can fatten anyone"
            ],
            "content":"<div class=\"\"><div> <span>Mora lets out a loud moo as power and heat course through her body, her muscles rapidly swelling to massive proportions, the cow's clothing soon in shreds. She destroys the table and breaks free of Idward's hold, standing up. The bovine is now naked and several feet taller, with the most gigantic muscles any of them have ever seen!<br>\r\n<br>\r\n\"Time to get you your figures back!\", Mora growls, \"I have plenty more formula where that came from, and it'll all be for you--especially you, Rachael!\" She points at the black cat, who looks completely terrified for once. \"As soon as I finish fattening you, cat-bitch, YOU'RE FIRED!!\"<br>\r\n<br>\r\n\"Mora, please stop!\", Taffy sobs, watching Mora pick up the nearby box containing the remaining bottles of the formula. \"You don't know what you're doing! You'll single-handedly put this place out of business!\", Randal adds, whimpering. Mora picks up one of the bottles and opens it. \"Now then, which one of you should I start with...?\"</span></div></div>",
            "created":1245906000,
            "id":714240,
            "title":"Mora becomes a big boobed muscle cow!"
        },
        "1111111121122222211211112":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "The laughter causes the gang's body to inflate",
                "With the gang distracted, Alej rescues Mora with the fat trap."
            ],
            "content":"<div class=\"\"><div> <span>*FLOUMP*<br>\r\n<br>\r\n\"Eh?\" Mora felt something bulging at her midsection.<br>\r\n<br>\r\n*FLOUMP*<br>\r\n<br>\r\n\"What's going on?\" Mora demanded as the group stared with amazement as the cow now felt that her butt is getting bigger.<br>\r\n<br>\r\n*BOOUMF*<br>\r\n<br>\r\n\"What the hell?\" yelled Mora as she begins to lose balance when mounds of fat begin to flow over. This of course made everyone start busting up laughing. \"Stop laughing at me! I'll get my revenge!\"<br>\r\n<br>\r\nThe more Mora struggles with the ever growing fat, the more the gang starts laughing. Idward is suffering from a Charlie Horse because of his new body is not use to such laughter, not that it bothered him any. In one last attempt for Mora to swing a fist at someone, the entire arm blew up in enormous fat that it can barely budge.</span></div></div>",
            "created":1245992400,
            "id":714401,
            "title":"Flab suddenly starts piling onto her body befor..."
        },
        "11111111211222222112111122":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "They focus on helping Minos first",
                "They focus on choosing a new leader first"
            ],
            "content":"<div class=\"\"><div> <span>Mora shrieked in rage, trying to lift her gigantic useless arm, the other one suddenly becoming just as massive, both hands swollen into permanent fists. Her neck fat exploded out, making her look like she had a huge inner tube around her neck. Her thighs were now consuming her legs, as her ass was doing to her tail, and her boobs were sagging over the sides of her collossal gut.<br>\r\n<br>\r\n\"Holy shit, this is hilarious!\", Rachael laughed, \"She's getting exactly what she deserves!\" Idward is now little more than a puddle, exhausted from laughing. \"Oh, this is just too rich!\" As everyone was laughing, however, they didn't notice Alejandra returning...<br>\r\n<br>\r\nMora suddenly disappeared, going into Alej's Fat Trap. \"You're all going to pay for this!\", the black and white cow declares, \"I'll think of something terrible to do to all of you, and then you'll be sorry!\" With that, she picks up the Fat trap and runs off, leaving the farm's flabby workers without a boss...</span></div></div>",
            "created":1245992400,
            "id":714510,
            "title":"With the gang distracted, Alej rescues Mora"
        },
        "111111112112222221121111222":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "The cake is a lie! (fatten to immobility)",
                "The real esate agent is a spy! (works for Alej)"
            ],
            "content":"<div class=\"\"><div> <span>With Mora gone, for now at least, the gang is in a bit of a rut. Since the owner of the ranch is gone and it doesn't take much to realize that the group is no longer welcomed, it was time to find a new leader and a new home. It was decided that it will be Rachel to be the new leader since Minos is still in a fat induced coma. \"Where will we go, big sis?\" asked Sarah.<br>\r\n<br>\r\n\"I didn't expect it to be so soon, but we're going to a place where I was investing on as a new home,\" Rachel answered. \"It isn't much but it will do.\"<br>\r\n<br>\r\nIt took them awhile, but they managed to get their new home. It's a small house near a gravel plant and there waited the real estate agent. \"You came just in time,\" said the agent. \"Just sign here and we'll be in the agreement for the leasing.\"<br>\r\n<br>\r\nRachel paused as she has to accept the fact that they whole group has to work extra hard to pay for it all.<br>\r\n<br>\r\n\"There's a cake waiting for you all as a complimentary gift from us,\" the agent said finally as Randal gave him a suspicious look.<br>\r\n<br>\r\n\"What's wrong, Randal?\" Sarah asked.<br>\r\n<br>\r\n\"There's something I don't like about that guy,\" Randal replied. \"I don't know what it is, but something's not right.\"<br>\r\n<br>\r\nWith everyone inside, they decided to celebrate by eating the huge cake waiting for them on the table.</span></div></div>",
            "created":1246251600,
            "id":716003,
            "title":"They focus on choosing a new leader first"
        },
        "1111111121122222211211112221":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Cut back to the farm {Alej and an immobile Mora continue their planned fun}",
                "Stay with this scene {The gang tries to figure out a plan to escape}"
            ],
            "content":"<div class=\"\"><div> <span>When everyone got inside, they soon discovered there was no cake at all... And as they went to go back outside and question the agent, the doors and windows all locked themselves! \"What the fuck?!\", Rachael yelled, kicking the front door, \"Let us out!\"<br>\r\n<br>\r\nThe agent laughed a sinister laugh. \"I'm afraid I cannot do that, mademoiselle\", he replied, \"FYI, I am a spy. And I had strict orders to keep you all in there.\" He pulled out a little switch from his coat pocket and activated something in the house. A light green gas began filling the place. \"Rach! I think he's trying to poison us!\", Sarah squealed in fear. \"Non, it is a special new concoction I was told to install in the house\", the spy chuckles, \"One Tootsie Roswell developed it.\"<br>\r\n<br>\r\nAs soon as the gang breathed in the strange gas, they started bloating up again, this time all looking much like Minos. \"Alejandra and Mora got you to do this, didn't they?!\", Rachael fumed. \"Oui, they did.\", the spy replies calmly, \"And with all of you out of the way and unable to pick up your bull friend, the two of them are likely to go back to your farm and do whatever they want with him!\"<br>\r\n<br>\r\n\"Minos... I've failed you...\", Rachael whimpers, feeling herself being forced to sit down by the unbearable weight of her ass.</span></div></div>",
            "created":1246597200,
            "id":718483,
            "title":"The cake is a lie! (fatten to immobility)"
        },
        "11111111211222222112111122211":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "They fatten Minos more",
                "They use Minos as a trampoline."
            ],
            "content":"<div class=\"\"><div> <span>\"You poor thing, you can't the way you are,\" said Alej in a sad tone to the immobile Mora. \"What you need is some help.\"<br>\r\n<br>\r\n\"So now you're trying to help me even though you ditched me?\" Mora replied in anger.<br>\r\n<br>\r\n\"It's not like that, I'd thought you were behind me when I ran.\"<br>\r\n<br>\r\nWhile Alej was rubbing Mora's fat, Carl brought a machine that looks similar to the fat trap. \"This is the FTM you wanted. I'll be waiting out back if you need me.\"<br>\r\n<br>\r\nThe FTM, or the Fat Transfer Modulator, was applied to Mora the same way the fat trap was applied to her earlier. In seconds, Mora started to shrink down like a balloon until she returned to her normal self with the exception of some flab here and there and some larger breasts.<br>\r\n<br>\r\n\"Damn! Why didn't you use that earlier when I was stuck?\"<br>\r\n<br>\r\n\"Then the gang would have noticed and attack us.\"<br>\r\n<br>\r\n\"Point taken. So what are we going to do with the extra fat that's in that thing?\"<br>\r\n<br>\r\n\"Give it to Minos, you numbskull,\" Alej replied in sarcasm.<br>\r\n<br>\r\n\"Don't push it, I'm still a little upset that you ditched me.\"<br>\r\n<br>\r\n\"Oh hush, we'll have plenty of Minos to play around with anyways!\"<br>\r\n<br>\r\nThe excess fat was stuffed into Mino which obviously made him even bigger than before. \"So, what do you want to do to him?\" asked Alej with an evil grin.</span></div></div>",
            "created":1246770000,
            "id":719338,
            "title":"Cut back to the farm {Alej and an immobile Mora..."
        },
        "111111112112222221121111222111":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "He gets his wish and the girls keep feeding him",
                "The girls decide to stop feeding him"
            ],
            "content":"<div class=\"\"><div> <span>Once alone with Minos, the cows fed the still unconcious bull as much specially modified fattening foods as they could. Slowly but visibly, the bull grew fatter and fatter. His blubber spread in every direction, and he soon became a blob the size of the house, his head soon small compared even to one of his nipples.<br>\r\n<br>\r\n\"He'd need years of liposuction to get rid of this flab!\", Mora giggled, stuffing more and more food into the bull's mouth. Both girls were taken by surprise as a low moan of pleasure escaped Minos' food-covered lips. \"He's starting to enjoy it!\", Alej cheers, \"We have to keep feeding him!\"<br>\r\n<br>\r\nAnd continue feeding him they did, making him unbelievably massive. Before long, he was even larger than the barn had been, and still growing. By now, Minos was actually opening his mouth for more food.</span></div></div>",
            "created":1246770000,
            "id":728457,
            "title":"They fatten Minos more"
        },
        "1111111121122222211211112221111":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Bounce on the Bull",
                "Push Wars"
            ],
            "content":"<div class=\"\"><div> <span>\"I hope this doesn't turn into a chore,\" said Mora as she shoves a pie into Minos' maw. \"I really want to play soon.\"<br>\r\n<br>\r\nTime went by as Minos slowly starts to overcome the whole farm. It was actually getting hard for the girls to work around Minos' fat as it starts to become so flabby that it's like walking on a sea beanbags. However it is getting easier for the girls to get off of Minos by using his fat to slide down.<br>\r\n<br>\r\n\"I think this should be enough,\" said Alejandra. \"Not to mention he almost chomped on my hand.\"<br>\r\n<br>\r\n\"Ooh, I know!\" Mora gleefully said. \"Let's play a game like Bounce on the Bull to see who can go up the highest!\"<br>\r\n<br>\r\n\"Or how about Push Wars where we have to knock each other off the mounds!</span></div></div>",
            "created":1248670800,
            "id":733375,
            "title":"He gets his wish and the girls keep feeding him"
        },
        "11111111211222222112111122211111":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Minos starts trying to fart to deflate himself like last time",
                "Minos feels unbearably hungry... He needs to eat!"
            ],
            "content":"<div class=\"\"><div> <span>\"Bouncing on him should be enough to arouse him--outside of feeding him more, of course.\", Mora giggled, noticing the sleeping bull's expression of pure bliss. With that said, the excited cows began bouncing on Minos' gigantic gut, laughing and squealing as his soft blubber and well-stretched skin sent them higher with each bounce.<br>\r\n<br>\r\nSoon, Minos finally woke up from his long food-induced coma. His eyes flew open once he realized what was happening, and he let out a startled moo as he saw how massive he was. \"What's happened to me?!\" The girls keep playing on him, Alej answering him between fits of laughter. \"You've become the sexiest man alive, that's what's happened to you!\"<br>\r\n<br>\r\n\"Where are the others...? Where's Rachael...?!\", he asked furiously, his breathing sounding rather laboured. \"She's off somewhere else, probably the same size as you by now!\", Mora replied, grinning, \"Along with everyone else, of course! Now you and Alej and I can stay here together without anyone to get in our way!\"</span></div></div>",
            "created":1248930000,
            "id":734935,
            "title":"Bounce on the Bull"
        },
        "111111112112222221121111222111111":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Mora gets fatter",
                "Mora bumps Alej!"
            ],
            "content":"<div class=\"\"><div> <span>With a huff and a puff, Minos tried to fart his way out. But in vain, nothing came out of him. \"You silly bull!\" said Alej as she laughed. \"With all of that fat we've put in you, you got all plugged up inside. Now keep quite so that we can play with your fat more.\"<br>\r\n<br>\r\nMora, with her new added weight, bounced higher and higher and knocked over Alej. \"Hey, no fair!\" Alej responded. \"You got more fat on you that you're taking away all of the bounciness for me.\"<br>\r\n<br>\r\n\"Well maybe you should pack on a few more pounds!\" Mora said sarcastically.<br>\r\n<br>\r\n\"Hmm, maybe I should then.\" Alej took the house that lead to the pump and put it to her mouth and in a few seconds her waist became a nice pudgy ball. \"Beat that, Mora!\" Alej said as she bumps her belly into Mora's.<br>\r\n<br>\r\n\"Oh, it's on!\"</span></div></div>",
            "created":1251090000,
            "id":749241,
            "title":"Minos starts trying to fart to deflate himself ..."
        },
        "1111111121122222211211112221111111":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Mora releases her gas and manages to slim down",
                "Mora is unable to fart and instead starts inflating"
            ],
            "content":"<div class=\"\"><div> <span>She grabs the hose from Alej, shoving it into her mouth, gulping down gallons of special weight gain food, growing into a huge shapeless blob, her limbs sinking into herself. With a loud pop, Alej pulls the hose back out of Mora's mouth, shoving it into her own, growing even fatter. Unfortunately for her, Mora's completely immobile, so once Alej loses use of her arms, she comes to the frightening realization that she's stuck growing until the machine runs out!<br>\r\n<br>\r\n\"Mmmmph!! Mmmphmmm!!\", she screams through the hose, wanting it turned off, but no one is around to hear her except a pair of equally immobile bovines. She grows out of control, eventually becoming as fat as Minos, her ass finally crushing the machine. She spits out the tube and lets out a huge belch, her beautiful fat jiggling wildly.<br>\r\n<br>\r\n\"Now what do we do?!\", Mora whines, \"None of us can move!\" Alej grunts and tries to fart, but finds her ass just as blocked up as Minos'. Mora tries it herself, realizing that now she has two helpless toys to play with and feed...</span></div></div>",
            "created":1251435600,
            "id":752091,
            "title":"Mora gets fatter"
        },
        "1111112":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Taffy goes to everyone to tell them what happened and plan to save Minos",
                "Taffy tries to steal the fattening goo from Mora"
            ],
            "content":"<div class=\"\"><div> <span>\"Who needs hard muscles when you got a nice flow of soft fat,\" Mora said as she begins to rub the continuously fattened bull as he slowly turns into a giant ball of flab with his arms and legs sinking into the growing body. \"Oh, I wish I could have developed this fetish sooner!\"<br>\r\n<br>\r\nAs the Minos continues to bloat, Taffy accidentally walks in on the scene. \"Mora, do you know where the... eh?\" Taffy sees what appears to be a giant blob of flesh that is being used as a bean bag by Mora. \"Mora, what is that thing?\"<br>\r\n<br>\r\n\"Can't you tell? It's the new and improved Minos!\" Mora exclaimed as she maneuver Minos' Head around his newly developed fatty chins to show it to Taffy. <br>\r\n<br>\r\n\"Oh raspberries, I can tell it is new but I think it's more like torture than an improvement!\" <br>\r\n<br>\r\n\"Nonsense! He'll learn to enjoy his new life as my big blob of sexiness. Isn't that right, Minos?\" Mora said as Minos replied with a moan. \"Just give it some time is all.\"<br>\r\n<br>\r\n\"Well could you at least tell me what happened to him?\" Taffy asked in a worrying manner.<br>\r\n<br>\r\n\"It's a new kind of goo that I made him drink that's making him huge and I have it with me.\"<br>\r\n<br>\r\nTaffy is stuck in a spot and doesn't what to do.</span></div></div>",
            "created":1277096400,
            "id":903385,
            "title":"The growth continues"
        },
        "11111121":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "They fatten Miles and use him as a distraction",
                "They fatten Idward and use him as a distraction"
            ],
            "content":"<div class=\"\"><div> <span>\"It's true! Mora has turned Minos into a huge blob!\"<br>\r\n<br>\r\nTaffy had gathered the others to tell them about what she had seen. Needless to say, everyone was rather shocked that Mora would do such a thing to her best worker.<br>\r\n<br>\r\n\"We have to do something about this!\", Rachael fumed, \"Turn the tables on her somehow!\" Miles nodded in agreement. \"Yeah, we should! Taffy, did she have anything we can use to her advantage?\"<br>\r\n<br>\r\n\"Yeah, this!\", Taffy replies, holding up the goo, \"I stole some from her while she wasn't looking--she has tons of these!\" Rachael suddenly gets an idea. \"I know how we can save Minos...\", she giggles, glancing at Miles, then at Idward...</span></div></div>",
            "created":1278565200,
            "id":913830,
            "title":"Taffy goes to everyone to tell them what happen..."
        },
        "111111212":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Rachael gets the goo but an accident happens",
                "Rachael gets caught by Mora trying to get the goo"
            ],
            "content":"<div class=\"\"><div> <span>\"What we need to do is distra...\" Rachael was quickly cut off by Idward, who's now wearing only black ninja-looking pants and holding a rose. (Insert cliche love scene and cliche romantic Spanish music)<br>\r\n<br>\r\n\"My heart is and always will be for my sweet Mora!\" said Idward as Rachael is just completely confused by all of this. \"I will do anything to free her from the temptations of the fattened bull and have her see me as her true love!\"<br>\r\n<br>\r\n\"Um... Okay,\" Rachael responded to the strange outburst. \"I guess we have a volunteer.\"<br>\r\n<br>\r\n\"If were going to distract Mora, maybe we should get more of the goo to make Idward bigger than Minos,\" said Randal.<br>\r\n<br>\r\n\"You have a point. Taffy, you know where there are more of this goo stuff?\" Rachael asked as Taffy responds by nodding.<br>\r\n<br>\r\n\"Yes, it's over in the main bedroom but you have to be real quite about it since Mora is in there with Minos,\" said Taffy.<br>\r\n<br>\r\n\"Please hurry... glug,\" Idward said as sips on the tiny sample of the goo. \"My love for Mora has become impatient!\"<br>\r\n<br>\r\n\"We get it, lardass!\" Miles snapped.</span></div></div>",
            "created":1278565200,
            "id":914046,
            "title":"They fatten Idward and use him as a distraction"
        },
        "1111112121":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "She swallows it all..."
            ],
            "content":"<div class=\"\"><div> <span>Rachael finds the goo stored next to Minos in Mora's room. She sneaks in, purring as she gazes at the massive sleeping bull. She grabs a container of the goo and kisses Minos' cheek before turning to leave.<br>\r\n<br>\r\nShe opens it up, sniffing it. \"Hm... Actually smells kinda good.\", she realizes. Her thought is cut short as she suddenly trips, falling hard and rolling onto her back, the goo flying into the air, coming straight down at her face...</span></div></div>",
            "created":1283144400,
            "id":947189,
            "title":"Rachael gets the goo but an accident happens"
        },
        "11111121211":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Rachael embraces her new form just to be with Minos",
                "Rachael calls for help"
            ],
            "content":"<div class=\"\"><div> <span>Rachael's belly begins to bulge along with legs as they begin to grow in fat. \"Oh crap, this wasn't suppose to happen!\" Rachael panicked. The black cat manages to get herself back up only to realizes that her butt and thighs are swelling when her pants starts to rip apart. \"Stop swelling!\"<br>\r\n<br>\r\nRachael's stomach was the size of a beach ball before her breasts started to bulge their way out of her shirt. The bulging fat has gotten so big on her ass that it made Rachael fall back on to the floor again, only this time Rachael fell at a much shorter distance then she would if she was thin. <br>\r\n<br>\r\n\"Rachael, is that you in there with Minos?\" asked Mora with a happy smile as she looks at the fattening progress on the hapless cat girl. \"Well, look at you. You seem to have 'spread' out quite nicely.\" Mora said as she begins to her hands across Rachael's giant belly. \"You and Minos are going to be real fun to be with, you know that?\"<br>\r\n<br>\r\nWith her body still growing, Rachael tries to think of what she could do. She could either let this incident happen so that Rachael can at least be with Minos or she could call for help though it would risk the rest of the farm crew and that they might suffer the same bloating fate.</span></div></div>",
            "created":1283317200,
            "id":948146,
            "title":"She swallows it all..."
        },
        "111111212111":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "The end ",
                "Mora decides this isn't enough--she needs more fatty playthings!"
            ],
            "content":"<div class=\"\"><div> <span>Rachael looks at her obese naked self, disgusted. She could no longer move anything below her chins, except her bloated fingers. But the more she looks at herself and the equally fat and naked Minos, the more she realizes that perhaps this wasn't so bad. She decides to just let this happen, knowing she was finally with Minos, very likely forever.<br>\r\n<br>\r\nMinos moos helplessly, an apologetic look on his fat face directed to Rachael. Rachael giggles softly and gives him a \"Don't worry about it\" look, blushing as Mora rubs both of their gigantic bellies. \"We're gonna have so much fun from now on, my fatties.\", she murrs, \"And you're never leaving this room again, so get comfy...\"<br>\r\n<br>\r\n\"Oh, I am comfy...\", Rachael thought, licking her plump lips as she gazes at her beloved bull, who gazes back lovingly. They were finally together. True love had prevailed and Mora had no clue.</span></div></div>",
            "created":1283835600,
            "id":951760,
            "title":"Acceptance"
        },
        "1111112121111":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "content":"<div class=\"\"><div> <span>It took time to get adjusted with the bulging fat on their bodies, but if Rachael and Minos maintain their hidden love for each other, they relish it. Content with her giant plaything, Mora no longer holds any animosity towards Rachael and willingly act as a substitute of sisterhood with Sarah. But not all was good at Las Lindas, at least not to the remaining males, as they now have to work harder to compensate for the lack of a bull.<br>\r\n<br>\r\nThe End...</span></div></div>",
            "created":1287896400,
            "id":980177,
            "title":"The end {Epilogue}"
        },
        "1113":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Minos finds out Mora sexually prefer fatter men, but also loves them more dearly",
                "Enough is enough! Minos wants to splurge for the rest of his life!",
                "Something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what prompts Minos to become big and fat? Is it because Minos finds out that Mora actually prefer fatter men or maybe it's because he had enough of being the worker and wants to pig out forever?</span></div></span></div>",
            "created":1314680400,
            "id":1178055,
            "title":"Motive"
        },
        "11132":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Minos goes on an eating binge",
                "Restrains the hunger for now, at least until dinner time."
            ],
            "content":"<div class=\"\"><div> <span>After days of working for Mora, Minos began to feel as though he was being unappreciated. Minos is aware that he does get a roof over his head and some good food from Taffy, but he feels as though there is something missing.<br>\r\n<br>\r\n\"You don't look so well, Minos,\" said a calm voice. Minos turned to where the voice was and immediately recognized who it is. <br>\r\n<br>\r\n\"Are you sure it's a good idea for you to come here, Alejandra?\" asked Minos. \"You know full well what will do if she sees you, right?\"<br>\r\n<br>\r\n\"It's not her I'm worried about, I'm not going on her property am I?\" Alej responded as she walks up to the fence. \"I'm here to ask you a few questions.\"<br>\r\n<br>\r\n\"What do you want?\"<br>\r\n<br>\r\n\"Are you happy like this? Tilling away for someone who vaguely appreciates you? Don't you want more in your life?\" Alej asked before she secretly took a deep breath.<br>\r\n<br>\r\n\"I am content with what I have and you've already offered me a job to work for you so why do you ask?\" <br>\r\n<br>\r\nAlej took a hand and placed to her face as she shows that she going into a deep thought. It took a few minutes until she made up her mind. \"I'm still giving you the opportunity to change your mind, all you have to do is ask,\" Alej turned around proceed to walk away. <br>\r\n<br>\r\nMinos returned to his work as if nothing had happened but the thought was still there for some reason and so was a since of hunger. Little did Minos knew was that while Alejandra was holding her breath, she was secretly squeezing a small item behind her back that was pumping out a strange gas that causes someone to continuously hunger for more food. When Alejandra put her hand to her face, she was placing a small filter that prevented her inhaling the gas long enough until the gas dissipates. Another devious plot by Alejandra but what will happen to Minos?</span></div></div>",
            "created":1314766800,
            "id":1178329,
            "title":"Opportunities and a plot"
        },
        "112":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Air",
                "Helium",
                "Water"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will Minos be inflated with?</span></div></span></div>",
            "created":1220158800,
            "id":604565,
            "title":"Bulloon"
        },
        "1121":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Sarah",
                "Mora",
                "Miles"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will inflate him?</span></div></span></div>",
            "created":1234242000,
            "id":645209,
            "title":"Air"
        },
        "1122":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Miles, as some form of convoluted revenge",
                "Sarah, who has been inflating everyone on the farm",
                "Mora, as punishment for thinking of dumping her for Rachael"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will inflate Minos and why?</span></div></span></div>",
            "created":1245992400,
            "id":714514,
            "title":"Helium"
        },
        "11221":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                " The gas activates as planned and Minos starts to swell from the inside out.",
                "The gas activates but works on everyone! Miles too! Minos inflates the largest."
            ],
            "content":"<div class=\"\"><div> <span>“Mmmm…Happy birthday big guy.” Mora spoke softly as she planted a kiss on Mino’s cheek. The two lay in bed together watching the sunrise through the window and listening to the first sounds of morning. Minos was simply content with his life here at Las Linda’s. He had found a wonderful new love in Mora, and a new friendly family with the rest of the house. Sure there were highs and lows here and there but things had changed for the best, long gone were the days of his far and forgotten war torn past. He’d gotten quite comfortable helping here at the ranch and could see himself spending the next part of his life here.<br>\r\n<br>\r\n“Hey,” Mora said sliding closer now practically on top of him. She traced circles over his beefy chest as she continued.  “Just how old <i>are </i>you anyways?” she asked, still whispering to him gently.<br>\r\n<br>\r\nMinos only laughed; having rehearsed an answer to this question many a time, maybe one day he’d tell her the truth, what he could remember of it anyways. In actuality Minos didn’t know his true age or his true birthday. Today was only the random date he’d given officials to put on his personal I.D. card, but the date had stuck and now it had come.  <br>\r\nSo for now he simply answered Mora with “Old enough” ever attaining an air of mystery about him. Then swiftly changing the subject, he slid out from underneath Mora’s embrace and the blankets, and stood beside the bed, tan, tall, and still in the buff. “Come on, I think everybody else is already up.” Minos began to put on what may as well have been his uniform of a white t-shirt and blue jeans.<br>\r\n<br>\r\n“Aww, leaving so soon birthday boy?”  Mora whistled, and pinched the left cheek of his well muscled butt.  She knew he never really responded to her mischievous teasing but that had never stopped her. She too eventually got dressed and they both left their bedroom. As they entered the kitchen they saw it had been decorated in full birthday party décor.<br>\r\n<br>\r\n“Happy Birthday!” shouted the household, and at the sight of all of them gathered there just for him, Minos gave one of his rarely seen smiles. He’d never had a birthday like this, with a family, not one that he could remember at least. Taffy had even baked a cake for him too<br>\r\n<br>\r\n“..Thank you…everyone.” He said in a low voice, almost near a whisper he was so full of emotion. <br>\r\n<br>\r\n“Cmon’ you got a whole lot of presents and balloons!” Sarah said as she led him by the hand to the table filled with waiting gifts. Sitting down he began to open the first wrapped gift, but was interrupted when a high pitch voice cried out.<br>\r\n<br>\r\n“HEY Minos!”  It was Sarah’s voice but in a pitch ten times higher than her own. This sent the house into a fit of giggles. <br>\r\n<br>\r\n“Let me try!” said Taffy, Sarah passed her the helium filled balloon. Taffy took it and inhaled a short breath of the gas inside. “Hi there!”  She said, her voice too was raised form the helium. <br>\r\n<br>\r\nMora hooted “When do you guys get these?” she asked between laughs. <br>\r\n<br>\r\nTaffy passed the balloon to Randall’s outstretched paw. He in turn took a deep breath of the stuff. “Well” he squeaked. “Miles actually was the one who brought the balloons.”<br>\r\n<br>\r\n“Heyyy, you know who’d sound <i>really </i>funny…” Miles said quickly cutting in as he undid another balloon. Miles took a breath from it. “Minos!” he shouted in a tiny sized voice. He handed the balloon to the bull who looked bewildered by it.  The rest of the house exploded into laughter simply at the idea of hearing Mino’s deep rough voice elevated to a sprightly tone.<br>\r\n  <br>\r\nWhy had Miles decided to bring the balloons himself? One needed to look no farther than the infinitesimally small logo that had been left on the outside of the balloon. Alej Corp Labs. Yes, Miles in a sneaky (but convoluted) act of revenge decided to bring a certain special brand of balloons to the birthday bash. Miles had sought revenge against Minos ever since he’d given Miles a swift punch to the gut. Month’s ago he explained his idea for revenge to Mora’s rival Alej Coldthorn who simply loved the idea of the bovine’s boyfriend blowing up. Alej immediately had Tootsie her genius (though sometimes absent minded) assistant lace the helium inside of the balloons with Nano Zells (such wonderful things)  that were programed release  more helium inside of an unsuspecting victims body. And now, this was the perfect part, both Alej and Miles explicitly told Tootsie to activate the Nano Zells only when they were in someone bovine in nature. Miles was sure that Sarah would want to try sucking on one of the balloons full of helium and then he’d swoop in and make sure both Mora and Mino’s got a big old lungful of the stuff and the two would puff up into parade size balloons.  Both of their personal vendettas would be completed<br>\r\n<br>\r\nNow Tootsie, who had been having a busy day already, now tasked with this new demand, quickly threw something together. She wasn’t sure whether or not she’d remember to make it only work on the cows but she was sure it wouldn’t matter that much.<br>\r\n<div align=\"center\">___  </div><br>\r\n<br>\r\nBack to Minos, as he brought the gas filled balloon to his lips and inhaled deeply. “Hello there” he said voice unchanged. <br>\r\n<br>\r\n“Hmm… I know what's the problem!” Miles said, seeing his plan had been slightly delayed. “He’s got bigger lungs” he explained jokingly poking a finger into Minos.  “Lungs these big and strong needed at least two or three balloons to make his voice sound funny.”  Still hiding his true attentions Miles handed Minos two more balloons to inhale, watching as Minos was now sucking deeply from within them. Minos inhaled again and again finishing two entire balloons of the helium. He was getting pretty light headed now, in fact his whole body seemed a little...off.<br>\r\n<br>\r\nMiles watched as …<br>\r\n</span></div></div>",
            "created":1296795600,
            "id":1047234,
            "title":"Birthday Ballooning"
        },
        "112212":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Digit! Thank goodness! She’s here to help…Well try anyway",
                "Alejanda and Toosie? Oh no, there here to blow them up larger!"
            ],
            "content":"<div class=\"\"><div> <span>Miles along with Alej ( who was watching from a hidden camera she’d  installed at the ranch) watched as their long plotted plan came to fruition. Minos stomach had started steadily swelling from all the helium the Nano Zells were pumping inside of him. The rest of the house watched in shock at Minos blowing up in size and quickly panicked as they backed away from. His belly grew rounder and had begun to protrude out from under his t-shirt. He grew slightly taller as well, as his arms and began looking distended from so much of the weird gas. Minos himself began to panic too, as he realized that he was no longer sitting down...the helium was causing him to float and he was becoming down right buoyant!<br>\r\n<br>\r\nToo busy watching Minos and his transformation  the other didn't notice that they were beginning to grow big. Sarah’s own white and slim stomach was having the same kind of gas being rapidly pumped into it.  Soon she  saw that she along with everyone else was getting rounder.  Rachael freaked as she filled and filled, losing her rigid six packs in a sea of overinflated flesh. Randall and Idward could feel their own skin straining, as their bodies grew taught with helium stretching the threads of their outfits. Taffy and Mora were looking pumped up as well, the inflation amplifying as it hit their curved chests and spherical stomachs. Soon the house tore through their tight clothes, leaving the entirety of them looking ballooned and bare. Their bodies had lost all sense of hardness to them growing quite padded and soft in their new plumpness. <br>\r\n<br>\r\nMiles was the last one to realize what was happening, much too caught up over the sight of Minos enlargement. He felt a funny tingling sensation in his arms and legs, then looking down to see what was causing it, he whimpered realized what must have happened. Whoever had made this stuff programed the Nano Zell's to be activated after it touched a cow-prime’s lips, what it should have done was work <i>only</i> on the primes bovine in nature. It was too late now, and Miles could only  watch as his beloved black jacket was ripped to smithereens to make way for more of his massive figure. <br>\r\n<br>\r\nWhile the other floated immobile and much too surprised at this turn of events to know what to do next, Minos continued to grow. His entire body was enlarging in oversize proportions until he covered half the room, continuously pushing upward and outward. Now looking like a small parade float, Mino’s naked body  almost covered the ceiling above the ranch’s room. What had Miles done? <br>\r\n<br>\r\nWait! Someone was coming through the door, maybe they could help them out. Or maybe they would find a way to blow them up bigger.Turning in the air as well as he could Miles could see it was…<br>\r\n</span></div></div>",
            "created":1296795600,
            "id":1047329,
            "title":"Balloon Animals"
        },
        "1122121":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Digit can at least stop the nanozells for now but everyone is stuck at this size",
                "Digit actually activates more nanozells and Minos swelling continues"
            ],
            "content":"<div class=\"\"><div> <span>“Hey guy’s what’s up…up…up… Oh my gosh you guys!” Digit stammered as she saw the sight of the several swollen bodies with tatters of clothes hanging from their bodies.<br>\r\n<br>\r\nThe Nano spirit floated about the room studied everyone. Most notably was Minos who filling up half the room with his floating form. He filled out from floor to ceiling as well, as his stomach had increased in size after being blown up to great proportions with the helium gas. An odd look was on his face as he was caught between feelings of fright and strangely…pleasure. His full looking limbs were fun to wiggle back and forth, and the feeling of weightlessness sure was different from the strong and heavy posture his legs were constantly used to. In fact this buoyant body was quite a relief… in short, he was enjoying this. The others didn’t seem to share his sentiments as they struggled to adjust themselves in zero gravity.<br>\r\n<br>\r\n“Digit! There must have been something in those balloons, maybe nanozells?” Miles shouted,careful to not reveal his plan or how it had backfired.<br>\r\n<br>\r\n“Uhhh...Uhhhh…Uhhh” The not quite grownup Digit muttered as she frittered and fluttered on what plan of action to take.<br>\r\n<br>\r\n“Take care of Minos first. He’s about to burst through the roof!” Squeaked Rachael, and as the others turned to where Rachael had pointed, the y could see it was true. Now swelling too big for this room alone, cracks were forming in the ceiling of the room. The second floor of the house was all that separated him from floating into the endless sky, but who knew how long even the roof would contain him as he stretched to parade balloon size. Minos was lost in his own world unaware of the damage he was doing. He enjoyed the feel of his body stretching now, arms lengthening, pecs pushing outward with every heaving breath he took.<br>\r\n<br>\r\nGaining control of herself and her sensors Digit focused on the unbelievably big bull. She zoomed towards the tail end of Minos and did her impression of a ghost by “sliding” through him. Getting closer, she saw the Nano machines working away expelling more helium.<br>\r\n<br>\r\nWell here it goes, she pressed an invisible finger to his insides and...<br>\r\n</span></div></div>",
            "created":1299560400,
            "id":1067353,
            "title":"Digit! Thank goodness! She’s here to try and help "
        },
        "11221211":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Digit can still fly thanks to her wings!",
                "Someone has to float up there and restart her!"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cpblue\">Zapp! </span>The arc of light zipped through the bull and hit the main nanomachine that had been pumping helium inside of Minos. The teal light fried its mark; completely stopping not only the nanite army inside of Minos, but the ones inside the rest of the house as well.  Everyone began to cheer as they realized they were no longer expanding any larger, well, all except Minos who secretly looked a little glum.<br>\r\n<br>\r\n“There!” she said encouragingly. “That takes care of one problem” she brushed her hands together in a job well done manner. “Now to get you guys back down to size” This would be a little bit trickier as she would have to-“Woah!” She said abruptly her senses burning as she spoke aloud. “I …feel…funny… <b>*Error Nano Zell Overload*</b>” sounded a machine like voice from within her.  Soon the rest of the ranch could see the cause for her malfunctioning, somehow Digit was beginning to grow just like them. <br>\r\n<br>\r\nHer once nymph like belly began to  blow up, and up with every passing second. Ping! It had swelled so massive it had broken the gold colored belt of her outfit and it still expanded.  Her arms were pushed outward as she expanded with nano zell made Helium, effecting her digital form in exactly the same way as if it had been flesh and bone. Soon her stomach had been pumped to big for her outfit to handle and here bell shaped outfit was violently torn to shreds. Digit's eyes were faced over with static as she continued to do her best impression of a blimp blowing up with more and more from within. <br>\r\n<br>\r\n“Oh no Digit!” cried Mora watching as her child of sorts blew up into a helpless blob. The rest of the house was beginning to panic too; there one hope to return to normal and get rid of these yoga ball bellies was in trouble. <br>\r\n<br>\r\nThat’s when they realized,,,</span></div></div>",
            "created":1303448400,
            "id":1092327,
            "title":"Digit to the rescue?"
        },
        "112212112":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "It works Digit’s back! But Rachael’s Minos sized now… And Minos likes it!",
                "It works but not as planned…There’s a different side effect?"
            ],
            "content":"<div class=\"\"><div> <span>Everyone in the house could tell that something had gone wrong with Digit. Her eyes had gone blank and fuzzy, and while the rest of the groups swelling had gone down hers continued! <br>\r\n<br>\r\nOn the spur of the moment Rachael took action; she knew Digit needed a hero! “Mora better give me a raise for this!” Rachael thought as she moved toward one of the inactivated balloons and breathed deeply from it.  Soon she began to feel lighter and light headed. She watched as her plan came into action, feeling her stomach begin to bloat up once more. Slowly she began to rise, as her stomach began growing from beach to yoga ball in size and shape. Spreading outwards like a black ocean Rachael’s whole body began filling with more and more helium.  The others could only watch helplessly as Rachael’s body began ballooning upwards towards where Digit’s own ballonification was taking place.  <br>\r\n<br>\r\nRachael was soon big enough and more importantly “lite” enough, to reach Digit. However, now that she was within reach she had no idea of how to treat the Nano-zell infection. Her mind racing she knew she had to act quickly before Digit reached “Minos” size.  <i>Mmmm Minos</i> Her eyes drifted slowly upwards to that huge hunk of beef that hovered mere feet from her head now. Oooh, she'd like to just float up there and give him-<b>That was it!</b> Quickly she snapped her eyes back onto the glowing globe of a girl in front of her.<br>\r\n<br>\r\nRachael had only one idea on how to fix Digit, it was only thing she could think of. She puckered up leaned in closer to Digit’s face and <span class=\"chotpink\">*smooch!</span>* She planted a deep kiss right on the youth’s lips, making sure to inhale as much of the helium making nanozells as she could.  She closed her eyes, enjoying the sensation. and hoping this would work...<br>\r\n</span></div></div>",
            "created":1304398800,
            "id":1099447,
            "title":"Rachael to the Rescue"
        },
        "1122121121":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Together Alone…High and far away from the rest of the ranch ",
                "Floating but heading towards Alej. Corp as Part of Alej's plan?"
            ],
            "content":"<div class=\"\"><div> <span>Rachael broke away from the kiss as Digit flicked her wings showing that her system had restarted. <br>\r\n<br>\r\n“<span class=\"cgrape\"><u>All Systems Online</u></span>…Woah…“ Digit said sprightly as her eyes returned to normal. “Rachael what happened? OH!” Digit was unable to get  an answer to her question as she was to startled by the sight of Rachael expanding  with helium again.  Recalling her  last bit of memory from before her systems crashed Digit remembered the helium nanozell situation the Las Lindas farm faced.  It looked like most of the house was back to normal size now, well except Minos and the increasing larger Rachael.<br>\r\n<br>\r\nAs she began to bloat once more with helium Rachael did her best to explain “I…<b>unnf</b>… guess that the nanozells inside of you transferred to me when I …<i>oooh</i>… made contact with you.” <br>\r\n<br>\r\n“Well then let’s try this again!\" Said Digit as she flicked closer to Rachael, before adding \"Uh…or maybe not...\" as she remembered her system shocking experience from her last attempt. <br>\r\n<br>\r\n“Well *<i>hssh</i>* No rush” said Rachael who was now blushing  and smiling slightly as she began to enjoy the sense of  engorgement taking over her body. <br>\r\n<br>\r\n“But Digit, how do we get them back to normal?” Asked Mora from below, unaware that the two blimp like primes above her were increasingly less concerned with getting back to normal size.<br>\r\n<br>\r\n“Simple really. You know how a balloon goes flat after a while?  Well this should work the same way.We just wait for the helium inside of them to go flat” Explained the resident Nano sprite of Las Lindas.<br>\r\n<br>\r\n“So… basically your saying they’re stuck like that for few days” Said Miles liking the idea of Rachael and Minos out of his way for a while.<br>\r\n<br>\r\n“Uh, maybe not a day, maybe shorter, maybe longer… My sensors can’t pick up anything, this stuff is tricky.\" Digit said as she whizzed down and returned to Mora's side.<br>\r\n<br>\r\n“Well I think we’ll manage…”  Minos said his rumbling yet gentle voice taking everyone by surprise. Then adding to the surprise he reached down to pluck Rachael from the air, his overinflated limbs just managing to bring her up higher to the spacious attic of the house. “What do you think Rachael? Are you fine with being a “high prime” for a bit?” Rachael too rapt in the moment, could only nod her head and blush. Then brining her to eye level he easily raised her in closer and kissed her deeply on the lips. Rachael already light headed was thrilled, and like the others below her a little  confused.<br>\r\n<br>\r\nThats when she felt it, her tail end was bunched against something… It was the wall. Slowly Minos was blowing up Rachael even further,  inflating her to match him equally in size.  The inflation continued tail first as she was inflated further and further, pushed against the walls until they began to crack slightly. Now far above from where anyone could reach them, and far to big for anyone to stop them Rachael returned the kiss to the bull of her dreams, blowing up Minos in turn.Now both of them were grinning in ecstasy as they swelled knowing they both wanted  what was about to happen next.<br>\r\n<br>\r\n“What are they...?” asked Idward finally at the surreal sight.<br>\r\n<br>\r\n“Watch out they’re going to...!” Randall said announcing what was now obvious to everyone.<br>\r\n<br>\r\n<b>Crasshhh!</b><br>\r\n<br>\r\nRachael’s rear had swollen so much that it finally broken down the wall it had been squeezed against, then it jutted out from the side of the house, and still her big behind ballooned! <br>\r\n<br>\r\n<b>Kabooom!</b> <br>\r\n<br>\r\nMinos' big and strong muscled back busted upwards and finished off the roof of the Las Lindas ranch, sending debris scattering along the outside of the house. As the rest of the group watched wordlessly from below them, the pair floated upwards still grinning from their shared helium high. <br>\r\n<br>\r\nA minute or two their swelling stop, and looking about them they realized they were…</span></div></div>",
            "created":1306126800,
            "id":1111689,
            "title":"Fit for a King (Size)"
        },
        "11221211211":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Minos decides some mid-air making out couldn’t hurt…",
                "Cooler heads prevail and Minos stoically declines Rachael’s offer."
            ],
            "content":"<div class=\"\"><div> <span> Minos looked about as he floated higher; even with his distend limbs blocking his view. Just below him was Rachael. Comparing her to barn below she was pretty big, (her now literally ballooning butt was big enough to crush the barn) but she was fortunately being lifted higher away from causing any more structural damage. Seeing her size he realized he  must be absolutely HUGE! He watched as the tiny dots that must have been the other ranch members glanced upwards and viewed his enlarged from as it began to dominate the sky around them. <br>\r\n<br>\r\nSuddenly his own private view of Neo-earth disappeared into white as he suddenly flew high into a cloud. The sensations surging through him were thrilling, both being absolutely huge in size and yet he was somehow as lite a feather it was odd to say the least, but strangely exciting.  As the floating sensation stopped, the rounded out Rachael rose up to meet him at eye level. Realizing he was still grinning raunchily he concentrated and his normal calm demeanor returned to his blushing face. <br>\r\n<br>\r\nRachael however continued to grin wildly still very much enjoying the sensation of being pumped up from the inside out. <br>\r\n<br>\r\n“Well…we appear to be leveling off…” he noted trying to rouse Rachael from her day dreaming demeanor.<br>\r\n<br>\r\n“Yeah…” was all Rachael muttered distracted, her gaze soaking up every bit of Minos and his now nude form (which was indeed quite a lot of bull!) <br>\r\n<br>\r\n“Well then…would you may be like to talk?” he asked  not sure how to spend the next few hours of what was increasingly becoming the most bizarre birthday he had ever had. <br>\r\n<br>\r\nRachael shook her head, slowly “swam” through the air, and latched  tightly on to Mino’s form. “I think we can do more than just talk…” she growled. “This high up in the clouds I don’t thinking anyone can see us, even at this size. So… how about a <i>very </i>special birthday present?” she purred throatily as she began to explore Minos inflated frame. <br>\r\n<br>\r\nMinos did love the way Rachael’s fur felt as she brushed against his hide but he also knew that this wasn’t the ordinary Rachael though; it could possibly be the chemical based helium augmenting or at least enhancing her emotions-Wait! Now he was beginning to feel light-headed, almost like...laughing. He couldn’t exactly see, but whatever Rachael was doing,he was hoping she wouldn’t stop! It was now or never maybe he could go along with whatever Rachael was planning (something no doubt sexual in nature),  but then again maybe now wasn’t the time for it. Perhaps he could at least brush her off in hopes that her claws wouldn't cause him to pop? <br>\r\n</span></div></div>",
            "created":1315890000,
            "id":1186300,
            "title":"High above and far away"
        },
        "1123":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Mora",
                "Rachael",
                "Himself, in a water-chugging contest with Miles"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who inflates him?</span></div></span></div>",
            "created":1220158800,
            "id":576805,
            "title":"Water"
        },
        "113":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Muscle",
                "Butt",
                "Mpreg"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1287896400,
            "id":980446,
            "title":"Butt expansion, Muscle expansion, or Mpreg"
        },
        "1131":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "Digits Nanozells",
                "Special substance(not Steroids)",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does he do it?</span></div></span></div>",
            "created":1362027600,
            "id":1541138,
            "title":"Muscle Expansion"
        },
        "11311":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "To have more fun with Mora and Alejandra",
                "To have fun with all the girls within the series"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why does he do it?</span></div></span></div>",
            "created":1362027600,
            "id":1541140,
            "title":"Why"
        },
        "11312":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "By Choice",
                "unwilling"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He takes special pills that make his muscles grow along with his little man. does take these pills by choice or unwillingly?<br>\r\n</span></div></span></div>",
            "created":1363962000,
            "id":1555697,
            "title":"a special substance"
        },
        "11313":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "Genie",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does magic come into play in this scenario? Din and Jin would obviously have nothing to do with this since it's helping Minos not Idward.</span></div></span></div>",
            "created":1471152180,
            "id":2195632,
            "title":"Magic"
        },
        "114":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Blueberry",
                "Watermelon",
                "Pumpkin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of these will Minos turn into?</span></div></span></div>",
            "created":1237352400,
            "id":663014,
            "title":"Bullberry"
        },
        "115":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "He fattens himself, most of the weight going to his penis {weight gain bonus}",
                "He inflates it {inflation bonus}",
                "He uses pills {side-effect: muscle bonus}"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Minos make his penis even more impressive?</span></div></span></div>",
            "created":1269579600,
            "id":857099,
            "title":"Penis expansion"
        },
        "1152":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "choice",
                "accident"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does it happen by choice or accident?</span></div></span></div>",
            "created":1362027600,
            "id":1541135,
            "title":"He inflates it "
        },
        "11521":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "To impress",
                "Boredom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To impress Mora and Alejandra, more of his \"little man\" for the girls to enjoy. Is it because hes bored?</span></div></span></div>",
            "created":1362027600,
            "id":1541137,
            "title":"Why does he do it?"
        },
        "1153":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "Volintarily",
                "accidently"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>By choice or by accident</span></div></span></div>",
            "created":1362027600,
            "id":1541408,
            "title":"He uses pills {side-effect: muscle bonus}"
        },
        "11531":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "He takes a new pill given to him by Ambar to test",
                "ask digit for something ( accidental in truth)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does he do it?</span></div></span></div>",
            "created":1387082820,
            "id":1707811,
            "title":"Volintarily"
        },
        "115311":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "Does he open it at the mail box",
                "Or waits to open until he's in his room"
            ],
            "content":"<div class=\"\"><div> <span>Minos was asked by Mora to pick up the mail on his way to check on how far Miles was coming with fixing the thermostat. when Minos got to the mail box he found it was filled with the usual mail, bills, fans of Alejandra and Mora asking for naked photos. Alejandra and Mora had become famous after the festival some time ago. While looking through the usual mail he found a package that was marked with ambars symbol. He became curious and decided to inspect it.</span></div></div>",
            "created":1394937780,
            "id":1761000,
            "title":"He takes a new pill given to him by Ambar to test"
        },
        "1153112":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "He bursts out of his clothes",
                "He removes his clothes off before the shred"
            ],
            "content":"<div class=\"\"><div> <span>Minos was careful not let anyone see the package he had carried up to his room. He felt a Sense of caution when opening the box, given how unpredictable Ambar was some times. He removed the lid and saw vial of blue liquid with a note be to it. He picked up the note and read it throughly. What it said was that the vial contained a new substance use to enhance the qualities of people to their most optimal form. What ever it actually meant was lost on Minos, he knew Ambar would never try to poison him so he decided to test the substance out. The taste was both metallic, sweat,salty, and strangely savory. Almost instantaneously he felt a strange sensation through his body.</span></div></div>",
            "created":1564309560,
            "id":2693552,
            "title":"Or waits to open until he's in his room"
        },
        "115312":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "Digit gets pushes into him",
                "Digit's Nanozells get into The Asprinin pills"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Minos finds a bottle of aspirin but wishes to make sure that the substance is indeed aspirin to cure his head ache. He takes the aspirin to Digit to confirm it's aspirin. But how do the digits nanozells get into Minos</span></div></span></div>",
            "created":1392339780,
            "id":1745306,
            "title":"ask digit for something ( accidental in truth)"
        },
        "11532":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "Secretly through medicine",
                "Through his food"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does he take it from a bottle that has been disguised as an medicine container or served to him through his food. Or could it bee something else.</span></div></span></div>",
            "created":1376607480,
            "id":1646638,
            "title":"accidently and possibly in the loosest terms."
        },
        "115321":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mora an Alejandra want to beef  up  the bull. Should the enhance themselves as well later in the story (hourglass expansion).</span></div></span></div>",
            "created":1380175260,
            "id":1669863,
            "title":"As a Mediation"
        },
        "1153211":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "Headache",
                "Stomach"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is giving Minos so much pain.</span></div></span></div>",
            "created":1381098360,
            "id":1675312,
            "title":"The Bull in Pain"
        },
        "12":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Butt expansion",
                "Fruitification",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You've decided to go with Idward? Very good choice! Now, how shall he be expanding today?</span></div></span></div>",
            "created":1220072400,
            "id":676593,
            "title":"Idward"
        },
        "121":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Force Feeding",
                "Overeating",
                "A Motive"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So does the Arctic fox pack on the pounds?</span></div></span></div>",
            "created":1314766800,
            "id":1178288,
            "title":"Weight gain"
        },
        "1211":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Mora, who's secretly into fatter men but she doesn't want anyone else to know",
                "Din & Jin, for the sake of fun",
                "Someone else instead?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who will be Idward's feeder?</span></div></span></div>",
            "created":1314766800,
            "id":1178291,
            "title":"Force Feeding"
        },
        "1212":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "After making a successful novel, Idward decides to splurge a little... or a lot.",
                "Taffy wants to form a relationship with Idward through food.",
                "Another reason of overeating."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What makes Idward overeat?</span></div></span></div>",
            "created":1314766800,
            "id":1178293,
            "title":"Overeating"
        },
        "1213":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "All of the LL girls think that fatter men are drop dead sexy.",
                "Idward gets involved in a bet.",
                "Some other motive?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What motivates Idward to become fat</span></div></span></div>",
            "created":1314766800,
            "id":1178296,
            "title":"A Motive"
        },
        "122":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Air",
                "Helium",
                "Water"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will he be getting inflated with?</span></div></span></div>",
            "created":1220158800,
            "id":576811,
            "title":"Id-flation"
        },
        "1221":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Din and Jin",
                "Taffy",
                "Mora"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will Iddy be inflated by?</span></div></span></div>",
            "created":1220158800,
            "id":576817,
            "title":"Air"
        },
        "1223":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Sarah",
                "Din and Jin",
                "Rachael"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will inflate him?</span></div></span></div>",
            "created":1234242000,
            "id":645210,
            "title":"Water"
        },
        "125":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Penis expansion",
                "Muscle expansion",
                "Mpreg"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of these choices for the little guy, perhaps?</span></div></span></div>",
            "created":1252040400,
            "id":755314,
            "title":"Other"
        },
        "1251":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "He gets it pumped full of nanobots",
                "Din and Jin use magic on it",
                "He uses pills that work a bit too well"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does he make it grow?</span></div></span></div>",
            "created":1282798800,
            "id":944410,
            "title":"Penis expansion"
        },
        "1252":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Use the nymphs to gain a body worth Mora's attention.",
                "Idward's already built buffer. ",
                "Another  third idea."
            ],
            "content":"<div class=\"\"><div> <span>So how does he go about gaining some girth?<br>\r\n<br>\r\nPerhaps the most obvious answer would be to use those magic nymphs of his to bestow him with some brawniness. Maybe to attract Mora's attention away from Minos?<br>\r\n<br>\r\nOr he could take the shorter route to a larger body, and have him mega muscular at the start of the next chapter. Perhaps earning him some amorous glances from someone else on the ranch.</span></div></div>",
            "created":1295067600,
            "id":1035955,
            "title":"Muscle expansion for the Fox"
        },
        "12521":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "A body packed with muscles, nice and thick on his petite frame. Just as planned!",
                "He was HUGE! The nymphs overdid it and he’d grown even taller than Minos!"
            ],
            "content":"<div class=\"\"><div> <span>The plan for more muscle began to form inside Idward's mind when, for the nth time, he’d again been unsuccessful in trying to court the sun of his life Mora Linda out for a date. <br>\r\n<br>\r\n“Come on, Idward we’re two completely different types of people” she’d said nonchalantly passing on him. Then adding insult to injury she added. “Besides what with Minos say…”<br>\r\n<br>\r\nMinos! Always Minos! Minos, as Idward saw him was just Mora’s current distraction. Albeit Idward harbored no ill will towards the bull. No, Minos was just another player in this game of love with Mora. But what was it that Minos had, that he didn’t?  They both harbored a deep passion for the arts, were polite, and both were well kept, it didn’t take long till the obvious answer hit him, it was their physical appearances.  <br>\r\n<br>\r\nMora, Idward realized, was a woman who (unfortunately for him) was the type who went more for brawn, over brains.  It was true for most women in this cruel world he wistfully reminisced, remembering how no publishers would take his original romance novel featuring a less than model male lead. In response he’d churned out a trashy novel in one night, featuring the superficial and stereotypical, muscular male lead. The publishing house had bought it instantly to his dismay, and then stuck a picture of the cliché’ muscular male lion prime Fab-Leo on the front. Idward’s revulsion grew when the book sold like hot cakes, but he’d made enough from it to work on his more subjective romance novels. <br>\r\n<br>\r\nDeciding to scope out the competition he headed outside to get a better perspective of what he was up against.  Heading out into the cool late autumn air, Idward watched certainly impressed as Minos lifted a massive boulder blocking a future grove, and carried it a distance to a waiting pile of rocks.  Idward comparatively flexed a bicep of his own, not coming within half the size of the bulls. It reminded him of how by no means was he out of shape; his body was far from muscular. <br>\r\n<br>\r\nWell he would change that, he could change that instantly! Personally he’d been fine with his body; comfortable with it as it suited his wants and needs. But this was for a different reason, this was for love! And not just any love his soul-mate Mora! With an image of a perfect body in mind, he retreated to his private writing nook in the barn, brimming with an excellent plan.<br>\r\n<br>\r\n“Oh my muses, I summon you” he whispered to the empty walls. <br>\r\n<br>\r\n“Yes great creator, how can we serve you!” the two wisps that were the nymphs Din and Jin appeared before him. <br>\r\n<br>\r\n“I have a new plan in my eternal quest for love. I’ll need a massive body one to rival that of Minos!”  He explained to them.<br>\r\n<br>\r\n“Right away mast-”<br>\r\n<br>\r\n“No! People will get suspicious if I just show up with a brutish figure out of the blue. I don’t want to have to hypnotize them into forgetting your mischief <i>again</i>. We’ll take it slow, and soon Mora will<i> have</i> to take notice of the new body I’ll have.”<br>\r\n<br>\r\n“Once again you show your genius, our master!” Din and Jin said as they unanimously cast the spell over him.<br>\r\n<br>\r\nFeeling no difference other than a light tingle in his body, he headed back and out and continued the rest of his day as normal, his magical metamorphosis began.  <br>\r\n<br>\r\nSnow soon covered the Las Linda’s ranch and Idward’s bulky winter attire concealed his body changes from the others. Only a trained eye would notice if his shoulders had broadened a little, or that his arms looked a little larger<br>\r\n<br>\r\nWhat was obvious was that he was around the gym more often. Every day that winter he made sure someone saw him as he left the house early in the morning  in his baggy tracksuit for the gym inside of the barn. Although when he got there he went straight to his writing and let the magic take it's course naturally, always making sure the barn was empty beforehand less someone find out about his lie.<br>\r\n<br>\r\nAlso obvious was that his appetite was greatly increasing, along with his consumption. <br>\r\n<br>\r\n“Easy Idward you’re going to blow a gasket. Did you miss lunch hun?” Taffy had said taking note of the pile up of meat and potatoes on his plate. <br>\r\n<br>\r\n“No, I’m actually carbo loading. I’ve been thinking of maybe doing a little bulking up.” he said in his eccentric manner.<br>\r\n<br>\r\nThis caused the others at the table to scoff at his claim, playing it off as one of his odd jokes, but they would soon learn that he was serious. Perhaps as a side of effect from the nymph's spell, Idward found himself eating platefuls of food with a rapid pace due to hunger.<br>\r\nWeeks of this cycle passed and soon winter had ended, and springtime had finally arrived!  One certain sunny day looked to be a great for tanning, and while it was a little early in the year for it, Idward decided this could be a good chance to reveal his newly formed brawny body. <br>\r\n<br>\r\nDisrobing before his room’s full length mirror he saw his body was…<br>\r\n</span></div></div>",
            "created":1295067600,
            "id":1035982,
            "title":" A Certain Magical Metamorphosis"
        },
        "125211":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "The black cat bunch of Rachael and Miles looking for work out tips.",
                "Mora and Taffy seriously impressed with his new size."
            ],
            "content":"<div class=\"\"><div> <span>“Wow!” Idward said marveling at his reflection in the mirror… It seemed like the fox’s youthful face had been detached from his once shapeless pale body and replaced on top of a lightweight bodybuilder’s. The wide ripped back, the wide toned shoulders and traps, the hard thick pectoral muscles, the thick veined arms, the six-packs showing on his washboard stomach, along with the thin waist. He removed his sweatpants to reveal his thick fibered thighs and calves.<br>\r\n<br>\r\n\"Magnificent!\" he said as his two nymphs joined his reflection.<br>\r\n<br>\r\n“Did we do good oh creator? They asked as they fluttered around his figure.<br>\r\n<br>\r\n“You’ve done me so proud!” he said flexing a bicep.  \"But there’s still one more test left…\"<br>\r\n<br>\r\nThe blond furred fox was eager to show off his improved physique, only a few people actually cared about asking about his unusual attire he worn that winter, so he’d actually managed to keep his developing body concealed until this exciting moment of due revelation. All would witness that he had indeed made some gains, well that was putting lightly. He was built, stacked, ripped, and gone under an unlikely metamorphosis, all in a noble quest to win the adoration of Mora. <br>\r\n<br>\r\n The muscles looked good compressed onto his frame, it was a body he never would have imagined he’d actually have even in his wildest dreams.<br>\r\n<br>\r\n Now it was time to strut his stuff. So sporting a  new pair of  tight tanning shorts (<i>which also revealed that another part of him had seemingly grown</i>) and donning his killer black shades he headed outside and found a tanning chair perfect to show of the goods. Idward began to bask in the sunlight that felt so good against his fur and new bulk he’d almost fallen asleep. <br>\r\n<br>\r\nStretching out in the sun, he was content just waiting for the first person to take notice. That’s when not one but a pair shadow’s blocked the sun from his view.<br>\r\n<br>\r\n“Whoa!” came the voice from one of the shadows. <br>\r\n<br>\r\n“What the..?” asked the voice from the other figure.<br>\r\n <br>\r\nUnable to see the faces in the sun’s glare, he sat up and removed his shades to see it was…<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1295499600,
            "id":1039269,
            "title":"A body packed with muscles, nice and thick on h..."
        },
        "1252111":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "He’s fine just being buff and stays as is.",
                "He would asks the nymphs to grow him as well, but they overdo it (Giant)"
            ],
            "content":"<div class=\"\"><div> <span>“What the hell Idward!” came the rising voice of Rachael, standing over him.<br>\r\n<br>\r\n“You’ve got so much bigger way too fast! You’re not doing steroids are you?” asked a mystified Miles.<br>\r\n<br>\r\n “Yeah, like I’d poison my own body with that stuff!” Idward said standing up and lavishing in the shocked looked on their faces. Everything was so ripped and developed that two almost didn’t recognized the once pint-sized fox. “I’ve just been working out with dedication, eating properly, and resting plenty. Trust me I am not doing anything illegal!” He noticed the new deeper tone in his voice sounded sexier too, another bonus that came with this new body of his. Idward struck a double bicep pose for the duo and then crossed his arms over his beefy chest. <br>\r\n<br>\r\n“Wow!” Rachael said seriously impressed with his gains. “So, how much you bench?” she asked giving his body the once over. <br>\r\n<br>\r\n“Uh, what?” Idward said completely at a loss at what the term “bench” meant.<br>\r\n <br>\r\n“You know bench press?” Miles asked seeing Idward was clueless. “Lift? Clean and jerk?” All of the lifting terms seemed to be flying over Idward’s head. <br>\r\n<br>\r\n“Well what the hell do you do?” Miles asked.<br>\r\n<br>\r\n“Well,I uhhh…he” began unsure what to say. Even with his master planning he hadn’t planned for this, he’d just have to play things by ear… ”I have a very rigorous technique, I don’t know the official terms, but I guess I could show you a little of it sometime.”<br>\r\n<br>\r\n”You gotta show us your technique!” Miles begged him, eager for such a bod.  <br>\r\n<br>\r\n“Yeah, I can’t argue with those results.” Rachael said.<br>\r\n<br>\r\nUnable to argue with the two he found himself in the barn and in front of the barn’s gym and weights. Unsure of where to start, he started with the lightest dumbbells there. The other two watched with confused looks on their faces as he lifted the very small lightweight dumbbells. Unbeknown to them, he was biding his time to think. OH, he knew that he had the <i>body </i>of a weightlifter thanks to Din and Jin, but he also knew that those nymphs of his were tricksters enough to not give him the strength to go along with the muscle.<br>\r\n<br>\r\n“C’mon ID stop dicking around!” Miles said having enough.<br>\r\n<br>\r\n“Just warming up…” Idward joked. “Got to stay limber and all that...”<br>\r\n<br>\r\n“Look just show us your max lift huh?” Rachael said growing impatient. She walked over to the large barbell lying over on the ground. “It’s gotta be what? 350, no 400 pounds?<br>\r\n<br>\r\n“Uh,yeah I think so…” Idward answered with an concealed gulp. Now in center spotlight he made his way to the loaded barbell. His plan would be ruined if he couldn’t at least move it, he had to try. <br>\r\n<br>\r\n“Well here it goes..” he prayed silently as he began to lift. The monumental blond fox gave a slight gasp and moan as he felt his muscles augmenting to lift the weight.  He easily lifted it above his head, without another sign of strain. So the nymphs had given him strength along with size. Marvelous! <br>\r\n<br>\r\n“I could do maybe a little more..” he said and Rachael slid two more 50lb plates on to each side for a total of 500lbs. This time, he put on a show, trying to look stressed as he tried to lift the weight. Looks of surprise adorned the cat’s faces and they certainly didn’t doubt him now. <br>\r\n<br>\r\nWow! Such strength, as a writer himself he was one who mostly put his brain over his brawn. But now, it was if he was living a different life.  He moved the weights higher almost above his head; at a level he’d only seen Minos and his incredible bulk barely lift. Appreciate the attention he was getting, loving the feeling of the pump his body now had.  <br>\r\n<br>\r\n“Well Idward that was amazing. Let us know if you are getting any more of that “good diet” stuff, and be sure to share some with us.” Miles zinged as he left. <br>\r\n<br>\r\n“Yeah whatever you did or used, you’re almost as big as Minos now!” Rachael hooted as she left.<br>\r\n<br>\r\n<i>ALMOST</i> as big, the remark stuck with him. Hmph, this right here was all he needed wasn’t it? Then again, if he was going to go he was going to be big, he might as well be the biggest, he reasoned. The thought of him as a 6’8” beast, that embodied the very ideal of virility was both frightening, and thrilling to him. <br>\r\n<br>\r\nIdward decided that…<br>\r\n</span></div></div>",
            "created":1295672400,
            "id":1040102,
            "title":"“Test your mite(s)”"
        },
        "13":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Butt expansion",
                "Fruitification",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, your choice is Miles? Alright then, now choose how you'd like him to expand.</span></div></span></div>",
            "created":1220072400,
            "id":676588,
            "title":"Miles"
        },
        "131":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Forcefeeding",
                "Overeating",
                "Gaining due to a motive"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Miles pack on his extra weight?</span></div></span></div>",
            "created":1234242000,
            "id":645129,
            "title":"Weight gain"
        },
        "1311":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Rachael, to keep him away from her and Sarah",
                "Taffy, to teach him not to be so shallow",
                "Mora, just because she feels like it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will feed the kitty?</span></div></span></div>",
            "created":1234242000,
            "id":645130,
            "title":"Forcefeeding"
        },
        "13113":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Force feed through a tube that dispenses larding cream",
                "Stuff fattening food into Miles' mouth"
            ],
            "content":"<div class=\"\"><div> <span>Over at the Las Lindas farm, things has changed for the both good and bad and somewhere in between. Minos and Rachael have finally gotten together as a married couple leaving Mora heart broken, though it was later healed through the help of Digit who has now matured into a very lovely adult spirit. Taffy and Sarah have joined together to establish a very successful restaurant chain called Neko Bun-Bun that specializes in sweets and soups. With the income coming from both the crop sells from the farm and the income from Neko Bun-Bun, Mora Linda manages to obtain enough money to buy harvesting robots to fill in the void of physical labor that Minos left. With almost everyone on the farm including Randal, who went off with Idward to help write his next best seller by exploring historical sites as references, left for their own ambitions, it leaves only Mora, Miles, and Digit.<br>\r\n<br>\r\nOn one peculiar day, Miles was sitting at the porch with nothing better to do but stare at the fields, where all of the harvesting robots are working. Miles' boredom was somewhat disturbed by Mora when she walked out of the door to sit next to him. To Miles' surprise (and pleasure), the busty anthro bovine is wearing a rather revealing red tank top. <br>\r\n<br>\r\n\"You know, there isn't much to do now since everyone's is gone,\" said Mora as she broke the silence. \"Just the robots doing all of our work for us and all we have to do is sit back.\"<br>\r\n<br>\r\n\"Okay, Mora,\" Miles responded. \"What are you suggesting?\"<br>\r\n<br>\r\n\"Well, since you have been sitting on your ass almost every day now, I guess we can put that to good use,\" Mora said with a smile.<br>\r\n<br>\r\n\"Oh, what do you mean by that, my Lady?\" Miles said sarcastically.<br>\r\n<br>\r\n\"You'll see...\" Mora quickly knocked Miles out with a rag of chloroform. A few hours later, Miles wakes up only to realize that he is strapped to some kind round, soft pad. \"Wakey, wakey Miles!\"<br>\r\n<br>\r\n\"What the hell is this? I didn't know you were into that bondage thing,\" said Miles as he is startled by all of this.<br>\r\n<br>\r\n\"Oh, it's nothing like that. Not at all,\" Digit replies to Miles with a devious look.<br>\r\n<br>\r\n\"A threesome? Fuck yeah!\" Miles roared with anticipation.<br>\r\n<br>\r\n\"You wish!\" Mora said with an equal deviant look as Digit's. \"You're not going to get any of this. We already have a plan just for you.\"<br>\r\n<br>\r\nMora and Digit show that they both share the same insanity that they will use on Miles.<br>\r\n<br>\r\n\"Wha... What are going to do to me?\" whimpers Miles.<br>\r\n<br>\r\n\"Were going to make you fat!\"</span></div></div>",
            "created":1278565200,
            "id":913723,
            "title":"Mora, just because she feels like it"
        },
        "1312":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Din and Jin, causing some mischief?",
                "Taffy, cooking up some extra helpings for the house?",
                "Some other third thing?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what's the reason for Miles to start overeating?</span></div></span></div>",
            "created":1299646800,
            "id":1067639,
            "title":"Overeating"
        },
        "13121":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Din's plan goes into action.",
                "Wait! Jin has a diffrent idea."
            ],
            "content":"<div class=\"\"><div> <span> It was Miles birthday on the LL ranch and that night a small party was taking place inside the farm house. With everyone gathered around the table, Taffy strode out with a chocolate cake adorned with candles and placed it before Miles. Everyone watched as Miles blew out the candles.<br>\r\n<br>\r\n“So what did you wish for?” asked Sara innocently leaning in towards Miles with her eyes wide in eagerness for an answer.<br>\r\n<br>\r\n“Wish?!” Din and Jin said as the silently and invisibly flickered from their perch on Idward’s shoulders at the sound of their favorite word. The two nymphs had a love for wishes but an even greater love of pranks and shenanigans. Using their near limitless reality powers they loved changing the mundane into the unexpected for their own entertainment, and this situation was no different.<br>\r\n<br>\r\n“Ha-ha! I don’t believe in that kiddy wish stuff.” Miles said sardonically to Sarah. Din and Jin looked disappointed by this statement, no wish after all. Miles continued as he took a bite of Taffy’s moist fluffy cake. “If I had wished though, I wish I could eat Taffy’s cooking all the time this is fantastic!” He offhandedly remarked, the rest of the house agreed with this compliment causing Taffy to smile and bow her head in thanks.<br>\r\n<br>\r\nDin and Jin upon hearing this new wish went into action. Din being the brash woman of action between the two, was about to grant Miles wish right away, raising her hand to cast a spell. She was stopped however by her blue haired counterpart Jin.<br>\r\n<br>\r\n “What are you doing” Jin asked her accomplice.<br>\r\n<br>\r\n\"Well you heard what he said.” Din began. “He wishes to eat the pink haired one’s food all the time right?”<br>\r\n<br>\r\nJin nodded “It does seem to be a sort of special celebration for the lazy one.”<br>\r\n<br>\r\n“Then let’s just make it so she wants to cook for him more often. I say we make her think he’s too thin, her nurturing instincts will take over and she’ll feed him. He'll start overeating till he nearly pops!” Din said giggling at the literal thought of that happening.<br>\r\n<br>\r\nJin thought about this, she supposed there was no harm in this plan “As long as the creator doesn’t find out it sounds fun!”<br>\r\n<br>\r\n “Its fine we’ll do it overnight no one will know…” Din said excited to wreck a little havoc into the boring house.<br>\r\n<br>\r\nThat night…</span></div></div>",
            "created":1299646800,
            "id":1067641,
            "title":"Birthday Wish"
        },
        "131211":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Abra cadabra! The cat gets fatter faster...",
                "Better not risk it. Leaves things as they are... "
            ],
            "content":"<div class=\"\"><div> <span> That night Din and Jin mischievously snuck into Taffy’s room, and gave the bunny a slight zap! The next morning she would see Miles as skinny and malnourished. The imps giggled away as they waited for the magic to unfurl.<br>\r\n<br>\r\nThe next morning was the same routine for Taffy, waking up early and starting breakfast; First for herself (jam covered toast a side of carrot juice and coffee) then Minos who’d usually been out doing yard work, out even earlier then herself, then Mora, Idward, Sarah and Rachael, Randall, and then, finally Miles. One thing that really got on her very short list of pet peeves was that Miles would take forever for breakfast. She’d often thought of just skipping his breakfast all together but just hadn’t the heart to actually do it.<br>\r\n<br>\r\n         Finally Miles entered the kitchen “Morning Taff.” He said still squinting through his eyelids in one early morning daze. Taffy turned around to great him, putting on her regular happy face but then she gasped.<br>\r\n<br>\r\n“Miles!” she said fretfully and brought a hand to her mouth in surprise. Din and Jin snickered as she did so, as they privately watched their plan take action. To Taffy Miles now looked half-starved. How could she have not noticed before? Was this the reason why he seemed to be so irritable all the time? Well she would be sure to do something about this right away!<br>\r\n<br>\r\n“You o.k.?” Miles asked the benevolent bunny.<br>\r\n<br>\r\n “Fine, Fine, you just sit and eat!” She said placing a big plate of pancakes before him. “And your getting seconds whether you like it or not!” she said hurrying back to the stove top.<br>\r\n<br>\r\n“What’s with her?” Miles wondered to himself. Taffy was usually a busybody during the day, but never like this. Miles decided to chalk up Taffy’s weird actions to being her time of the month and helped himself to the several pancakes before him.<br>\r\n<br>\r\nJust as he was finish the already large meal, Taffy brought out a second plate piled with more food then the first; bacon, eggs, toast and jam, he was getting the plush treatment!<br>\r\n<br>\r\n “What’s all this for?” Miles asked though he wasn’t complaining, (Taffy was his favorite chef) he couldn’t help but feel like something was up.<br>\r\n<br>\r\n“No-No reason. Just keeping your energy up.” She said not wanting to bring his “scrawny stature” into discussion. He probably didn’t want to talk about the embarrassing condition he was in she would make sure no to hurt his feelings. Of course Miles was nonplussed to Taffy’s true feelings, and ate away much to Taffy’s delight.<br>\r\n<br>\r\nDin and Jin laughed as they watched Miles barely finish seconded and turn down Taffy who insisted on thirds. As he walked away from the table his noticeably swollen belly gave a slight jiggle and Miles was forced to readjust his belt for a looser fit. This was fun Din thought, but it was going way slower then she’d expected maybe she could hurry things along…</span></div></div>",
            "created":1299646800,
            "id":1067643,
            "title":"Din's plan goes into action."
        },
        "1312111":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "The next morning..",
                "Digit realizes something’s up!"
            ],
            "content":"<div class=\"\"><div> <span> “This is fun and all Jin but what say we hurry things up a bit huh?” Din said. It might take a lot out of her but Din wasn’t going to let a good chance for mischief go to waste.<br>\r\n<br>\r\n“I don’t know Din, won’t everyone eventually else notice?” Jin began.<br>\r\n<br>\r\n“Not if we take care of them first and hey less completion for the creator…” Din pointed out.<br>\r\n<br>\r\n“I guess that's true.” The blue haired nymph agreed.<br>\r\n<br>\r\n“Come on the creator will never know...” Din mentioned on the sly.<br>\r\n<br>\r\n “O.K!” They said simultaneously, and took off zooming around the farm while giggling deviously, poking the various farm workers and bamboozling them into thinking Miles had always been a slight tub of blubber.<br>\r\n<br>\r\n“Watch this!” said Din as she zapped the cat himself “Now his metabolism is completely slowed.”<br>\r\n<br>\r\n“Uhh what’s that mean?” Jin asked.<br>\r\n<br>\r\n “It means he’ll get twice as fat twice as fast cause he’ll be twice as hungry! Now watch!” The flamed haired vixen explained.<br>\r\n<br>\r\nDin’s words were true, for as the day grew long, Miles grew wider. After Taffy’s breakfast he had loosened his belt, but buy lunch he forgone the need for a belt entirely his belly surging forward and filling the loose space in his jeans. Taffy made sure Miles had all that he wanted to fill his budding belly and when he dug in at lunch he began bulging from all of Taffy’s cooking. His hyper-gaining causing his stomach to first press against his t-shirt, then swell tight against it causing it to ride up his not quite notable belly his gut swelling further outwards until his attire was near ripped. Miles uncaring to this fact first finished his meal (and dessert) before grabbing an appropriate sized garment (also courtesy of Din and Jin.) The nymphs giggling as the cat now had a slight waddle to go with his new found weight.<br>\r\n<br>\r\n Later at dinner time, Taffy furthermore made sure Miles had the lion’s share of the roast she cooked. Miles already filled belly grew, as mashed potatoes with gravy, stuffing, and rolls disappeared down his throat. Even taking thirds of the pie she’d made. Everyone saw no irregularity in this, thanks to Din and Jin and even Miles seemed pleasantly adjusted to this new lifestyle.<br>\r\n<br>\r\nYep as Miles saw it things were good for him a full belly, and warm cooked meals around the clock. But how long would they stay that way….</span></div></div>",
            "created":1299646800,
            "id":1067644,
            "title":"Abra cadabra! The cat gets fatter faster..."
        },
        "13121111":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Taffy returned.",
                "Someone else shows up."
            ],
            "content":"<div class=\"\"><div> <span> Miles turned over and stretched grandly in his bed. It was Saturday so that meant he could sleep in as long as he wanted. Just then he remembered that the game he’d wanted to watch all week was coming on soon. Miles stood up from his bed causing the springs to creak, and stretched again. Looking down he realized his black and white paunch was now completely blocking the view to his feet. Miles tummy growled with hunger and he decided to head to the living room and see what was on the tube.<br>\r\n<br>\r\nMiles plodded his way to the couch and heftily sat in front of the TV. This left Din and Jin in a fit of chuckles as his now quite wide posterior was taking up half the couch.<br>\r\n<br>\r\nThen right on cue Taffy was awaiting him. “Please eat up hun.” She said quickly placing a stack of hotcakes in front of the massive Miles.<br>\r\n<br>\r\n“No problem Taffy” he honestly answered and started right away on the meal.<br>\r\n<br>\r\nSuddenly out of the corner of his eye came a black cloud to rain on his parade. Rachael Saleigh moved her toned body between the T.V and Miles, annoyingly blocking his view.<br>\r\n<br>\r\nDin and Jin made sure to have a front row seat for this clash of the titans,both of the nymphs tittering with anticipation.<br>\r\n<br>\r\n“Hey tubbo move! My shows on!” Rachael commanded.<br>\r\n<br>\r\n“No way! I was here first!” Miles snapped back.<br>\r\n<br>\r\n“Miles…” she muttered now quite pissed.<br>\r\n<br>\r\n“Make me…” Miles wasn’t going down this time without a fight, even if it meant a fistful of fury from Rachael.<br>\r\n<br>\r\n “All right, you asked for it!” Rachael shouted and wound up and gave a powerful blow to Miles midsection. Miles cringed at impact, but surprisingly it didn’t hurt. Rachael also seemed surprised as she hit the soft squishy fat, but she immediately countered with a left cross to his arm, but again the blow bounced off his blubber.<br>\r\n<br>\r\n“Ha! Looks like you need to hit the gym girl.” He said quite delighted with the series of events.<br>\r\n<br>\r\n “Ok, doing things the hard way.” Rachael clasped her hands together and breathed deeply, with a running start she charged the perfectly placated pudge and pushed as hard as she could. Her might was no match against Miles gastronomic girth. Her hands sank into the rolls that were his sides and her forward progress soon halted leaving her running in place. Trying with all her might now face to face with his weight, Rachael realized grimly he wasn’t budging. In fact Miles looked bemused by her futile attempt.<br>\r\n<br>\r\n“God Miles!” Rachael said grunting “How much do you weigh now anyways fat ass!”<br>\r\n<br>\r\n “Last I checked, I was around the 500lbs area lil kitten, and I’m not stopping I plan on being a literal tons of fun!” He said and getting up quickly gave a large belly bump to Rachael, knocking her flat on her well toned tushy.<br>\r\n<br>\r\n“Yeah, well the other T.V is better anyways.” She said getting up head slightly low in defeat. Not before echoing a “Fat Ass!” as she left the room.<br>\r\n<br>\r\nFinally Miles was able to enjoy his pancakes in peace.<br>\r\n<br>\r\n That was until later when…</span></div></div>",
            "created":1299646800,
            "id":1067646,
            "title":"The next morning.."
        },
        "131211111":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Make Taffy see Miles as his \"real\" self.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span> Miles munched away on the hotcakes that were so plump and slathered with syrup, turning them into bite sized snacks. In a matter of minutes the stack of pancakes was completely gone, and Miles leaned back into the couch sighing in contentment while rubbing his full belly.<br>\r\n<br>\r\n Suddenly Taffy appeared with another plateful of food, this time waffles eggs and bacon. “Here you go hun, please eat up” she said setting the plate before Miles massive form. Miles gave a shrug and conquering his feelings of fullness, decided to not let this meal waste and dug in. Something about watching Miles filling himself to the brink on all of her cooking filled her with so much warmth and pleasure.<br>\r\n<br>\r\n This scene of the black cat stuffing himself and growing was now getting old for Din and Jin however, and they decided to do something to change things up again.<br>\r\n<br>\r\nDin and Jin both grinning flew right towards the cotton tailed bunny, and then used their powers to…</span></div></div>",
            "created":1299646800,
            "id":1067648,
            "title":"Taffy returns but then a twist... "
        },
        "1312111111":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Taffy's interested in the bigger cat.",
                "Taffy doesn't like what she sees."
            ],
            "content":"<div class=\"\"><div> <span> Flying right behind Taffy’s behind, the two nymphs gave the gray hare a slight zap. Instantly her eyelids fluttered open and she no longer saw Miles as a thin defenseless kitten. Now Taffy could see exactly where most of the food she’d made had gone. There on the couch before her was the engorged shape of Miles, chowing down on an extra large sized helping of bacon and eggs.<br>\r\n<br>\r\n         “Miles!” shouted Taffy now seeing what the cat had become. But there was something more in her voice then she let on... Was it interest in Miles now that there was more to love? Or was it disgust in the fact that there was now more of his gluttonous guts to hate? </span></div></div>",
            "created":1299646800,
            "id":1067649,
            "title":"Make Taffy see Miles as his \"real\" self."
        },
        "13121111111":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Take this to the bedroom...",
                "Take this to the kitchen.."
            ],
            "content":"<div class=\"\"><div> <span>Taffy looked at the chunk of a man in front of her. Miles stomach had grown overstuffed and heavy. It rolled over his larger waistline and rolled over onto his paunch. His thick and fattened legs hung over the side of the couch. Once toned, they now had become lost in softness. Watching him eat the breakfast she’d just made, and ravenously wolf it down. Taffy truly enjoyed it when Mile’s belly began to grow from all the food, she saw it slowly rise, inflating like bread in the oven, and she felt happy watching. All that mattered to her was that belly of his and helping it grow anyway she could. To start with, she had to try something she was now dying to do.<br>\r\n<br>\r\n “Could you stand up please Miles?” she requested her rotund co-worker after he cleaned his plate of all cuisine that had once been there. Not wanting to disobey his favorite food maker Miles sat up, and then with some effort now got off the couch obediently. The couches springs creaked in relief; as Miles removed the weight that had been forcing them down to fit his very big frame. Miles began blushing as he noticed Taffy eying him up and down like a piece of meat…<br>\r\n<br>\r\n “What?” he asked, and in an action of self-consciousness crossed both his flabby arms in front of himself.<br>\r\n<br>\r\n“Nothing, hun… just, could you turn around for me too? Please?” asked Taffy her voice sounding lost in a trance while marveling at Miles’ big body. Miles submissively did this too, and Taffy was greeted to the sight of his rear and tail. The profound cheeks had become round and squashy. Both easily jiggled with each of his steps. This came along with a much thicker, fuller tail that waved behind the feline. She felt so compelled to do what she would do next, that it would be impossible to stop her. Taffy took two steps and the poked Miles right in his blubber butt, enjoying how malleable it felt underneath her paws. Miles’ gave a yelp of surprise at the sudden push on his posterior, but if it felt painful to him he showed no other signs of wanting Taffy too stop.<br>\r\n<br>\r\nThen the pink haired rabbit slowly slid her dainty arms under Miles’ flabby ones to form a sort of hug from behind. Taffy found to her delight that she could only make it around to halve of the cat not being able to bring her hand around his belly. She took one hand and slapped it against the side of one of his rolls of fat; it gave a dull thud in response as if she had just stricken a pumpkin instead of a person.<br>\r\n<br>\r\n “Taffy…” whispered an amazed Miles, “What are you doing?” he asked her as she continues to explore and fondle his flabby body. To be honest the bunny didn’t know exactly what had urged her to do what she was doing now, possibly a primal attraction to a bigger healthier male, possibly just a weird fetish for fatties she never knew she had, what she was sure of is she l.o.v.e. loved Miles body, and lusted for more of it.<br>\r\n<br>\r\n “It’s so big and squishy” she said softly burying her face deeper into Miles furry backside, allowing her arms to reach the center of his solid middle. Taking one finger and stroking it up and down, she traced a line over the white fur of Miles midsection, taking time to trace circles around his belly button as well. Miles could feel himself melting in her arms; he was totally under her control.<br>\r\n<br>\r\n “Miles” Taffy began excitedly “Let’s say we…</span></div></div>",
            "created":1299646800,
            "id":1067651,
            "title":"Taffy's interested in the bigger cat."
        },
        "131211111112":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "“Now let’s head upstairs so you can return the favor” hinting sexily.",
                "“But I hope you have still room for desert\" as she brings out a tub of ice cream"
            ],
            "content":"<div class=\"\"><div> <span>“Let’s say we take this to the kitchen? Taffy asked eagerly. “I want to see just how much this amazing tiger-sized tank of yours can hold” she said smacking Miles’ belly for emphasis making a dull thud noise and causing it to quiver. Miles could not say no to the idea of more food and more time with Taffy, and she led him to the kitchen by the hand, easing him in front of the table while making sure to give him plenty of room for his super-sized stomach.<br>\r\n<br>\r\nMiles took his hand and pinched one of his stomachs rolls. So this is what Taffy liked huh? Thinking about it, he liked it too! If that was the case, then he was going to pig out and really thrill her!<br>\r\n<br>\r\nMinutes later Taffy had prepared a big banquet for Miles, cooking a meal to help him become even fatter.Taffy’s food was very sumptuous a meal consisting of country fried steak and potatoes with eggs - all fried in fat. Miles shoved the meal into his mouth, chuckling gluttonously as he did so. He ate without stopping, making forkfuls after forkfuls disappear into his cavernous mouth, while the pink haired rabbit watched on.<br>\r\n<br>\r\n“Keep going big boy.” Taffy said placing her head on her hand with a content look on her face<br>\r\n<br>\r\n“Now, why would I stop? There's no way I could resist your cooking and if you say 'bigger is better,' then I do too!\" He gave a deep belly laugh and slapped his gut, making it ripple. Taffy laughed as well.<br>\r\n<br>\r\n\"Bigger is better,\" Taffy said drawing out her words as she slid her hand up under his left breast, cupping it and squishing it between her fingers.<br>\r\n<br>\r\n\"You know what they say, nothing satisfies the ladies like an extra-large,\" Miles purred under her gentle touch.<br>\r\n<br>\r\n“Or an extra extra large,\" Taffy said she pushed her paw against the curve of his belly, making the expansive flesh around it tremble.<br>\r\n<br>\r\nAs Miles and Taffy sat at the table, she can't help but watch him as he stomach slowly swelled from food, and as he began swallowing mouthfuls of her fried eggs, whole baked potatoes, and delicious fatty chicken fried steak, happily devouring every morsel.<br>\r\n<br>\r\nFinished stuffing himself, he gave a little belch and ceremoniously leaned back in his chair causing it to creak under his bulk. He roll up his shirt and fully exposesd his tubby tummy and Taffy sighed intently at the sight. She rubbed his overstuffed paunch with both hands now, making his two black and white furred rolls jiggle. She could only guess how big those rolls would grow to be…<br>\r\n<br>\r\n\"Taffy, that was delicious.\" He murmured contently.<br>\r\n<br>\r\n\"Thanks Miles” she said, then added...</span></div></div>",
            "created":1299646800,
            "id":1067739,
            "title":"Lionheart’s Lion Sized Hunger"
        },
        "1312111111121":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "as big as Miles and getting horny, scraps of her clothes hanging from her...",
                "much bigger than Miles, naked, clothes in shreds around her, unable to move!"
            ],
            "content":"<div class=\"\"><div> <span>“Now let’s head upstairs so you can return the favour...\"<br>\r\n<br>\r\nMiles' eyes went wide at this. \"W-Wait, you mean...?\" Taffy nods and interrupts him, \"Yes. I want to be a VERY big bunny. So I expect you, Mr. Tubby, to feed me until I'm a huge sexy fatty like you.\" Miles couldn't possibly refuse this offer. \"I accept, Taffy...\", he murrs, Taffy proceeding to prepare more food, the two of them bringing it all to Miles' room.<br>\r\n<br>\r\nBefore long, the room is full of stuff to feed to Taffy, who is now laying on Miles' bed. Din and Jin can't help but work their magic once again, casting a gaining spell on Taffy. The couple remains oblivious, and Miles begins stuffing the beautiful rabbit's face. Neither of them have ever felt happier.<br>\r\n<br>\r\nWithin a few hours, Taffy has grown...</span></div></div>",
            "created":1299646800,
            "id":1067744,
            "title":"Miles' Big Bunny Babe"
        },
        "13121111111212":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Taffy moved so Miles can join her in bed, for some corpulent comingling",
                "Taffy tries to get up from the bed on her own power to do something else.."
            ],
            "content":"<div class=\"\"><div> <span>Nearly finished with feeding Taffy and oblivious to the bunny’s ballooning, Miles swizzled the last of the chocolate covered strawberries around Taffy’s pink waiting lips. She nipped at it and finished it in two big bites. As she swallowed she sighed in content and smiled, causing profound rolls to form on her cheeks and newly formed triple chin. Sensually sucking the last bit of chocolate drizzle from Mile’s plump paws, they both remained oblivious to the bunny's ballooning. The only signs of Taffy’s previous skinny self were the shreds of clothing in tatters around her elephant like stomach. Apparently the mischievous Din and Jin's magic towards Taffy's bigger size had also brought about a sexy sensuousness that her previously lighter self had lacked. Wild and confident Taffy’s eyes were beckoning Miles to explore her expansive body.<br>\r\n<br>\r\nDin &amp; Jinn watched as Miles brought a paw to Taffy’s tummy that had ballooned to massive proportions thanks in part to their mischief. As he rubbed and kneaded the doughy mass of gray and pink fur he paid no attention that she had far surpassed him in size and stature not thinking it out of the ordinary. Taking up almost entirety of the king size bed she comfortably rested on everyone in the room could see she how big and full she now looked, but they could also sense how things in the room were getting hot and heavy, as Miles and Taffy were having hungers of a different sort.<br>\r\n<br>\r\nHer feasting finished she attempted to do a sit up but failed, unable to conquer her round stomach’s weightiness.<br>\r\n<br>\r\n“Hey big guy, I… I’m soo stuffed I don’t think I can move. ..Could you give me a hand hun?” I t was hard to determine if she could even stand as she was now.<br>\r\n<br>\r\n“Sure what do you want?” Miles said wanting to do anything to attend to. He was heavyset himself and that meant he was slower the most, but he was still far from Taffy’s immobile state<br>\r\n<br>\r\n“No *huff* hang on. I just need you to…” she managed to wriggle and turn herself to the far side of the bed.</span></div></div>",
            "created":1299646800,
            "id":1067747,
            "title":"A Stuffed Bunny"
        },
        "131211111112122":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Din and Jin make her mobile. Even with her new size she can get around!",
                "Taffy can't make up and makes a little mess. (Watersports/Scat)"
            ],
            "content":"<div class=\"\"><div> <span>Taffy looked frantic as she worked and wriggled her way to the edge of the bed.  \"I just need you to help me up, I gotta go!\" <br>\r\n<br>\r\n\"Oh!\" said Miles surprised by such a blatant statement. There was few forces greater than when nature calls and Taffy looked hellbent on moving her half-ton body to answer the call. <br>\r\n<br>\r\nMiles leaned in and extended a flabby arm to Taffy who gripped it tightly. Miles pulled and lifted with all of his might but seemed unable to heft the hefty housekeeper. <br>\r\n<br>\r\nEventually...<br>\r\n</span></div></div>",
            "created":1299733200,
            "id":1068225,
            "title":"When you gotta go..."
        },
        "1312111111121222":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "How about a soapy sexy sponge bath to freshen her up",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>After a few moments Taffy was completely frustrated.  Unable to elevate herself from the bed, she was forced to relive herself where she was. Embarrassedly she turned from Miles as the trickling warm wet spot beneath her grew. <br>\r\n<br>\r\nMiles watched as she let out a short sob clearly disgusted with the act<br>\r\n<br>\r\n“Relax, I’ll take care of you my big sexy bunny.”  Miles assuaged her. He began massaged her stomach with his chubby finger tips very lightly.  He leaned in closer giving her wide expanses kisses, working everywhere from her long thick ears, to her succulent chubby, fuzzy chest. Taffy had always been the motherly type, taking care of the various members of the house, and now it was his turn to take care of her. Miles felt obligated to cheer her up.<br>\r\n<br>\r\n“Please Taffy, what can I do for you to make you feel better?” he asked truthfully concerned.<br>\r\n<br>\r\n“…*sniff* Well..” Taffy whispered softly.<br>\r\n</span></div></div>",
            "created":1299733200,
            "id":1068239,
            "title":"Showers of a different kind…"
        },
        "1313":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "He wants to be pampered",
                "He thinks the girls might like him better fat",
                "Not so much a motive, but he has a weight gaining disease"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why does Miles gain?</span></div></span></div>",
            "created":1269579600,
            "id":857098,
            "title":"Gaining due to a motive"
        },
        "132":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Air",
                "Helium",
                "Water"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will Miles be inflated with?</span></div></span></div>",
            "created":1220072400,
            "id":576804,
            "title":"Inflated Ego, Inflated Body"
        },
        "1321":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Din and Jin",
                "Taffy",
                "Minos {using only his breath!}"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will be the one to inflate him?</span></div></span></div>",
            "created":1220158800,
            "id":677053,
            "title":"Air"
        },
        "1322":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Mora",
                "Sarah",
                "Minos"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will inflate him?</span></div></span></div>",
            "created":1234242000,
            "id":677049,
            "title":"Helium"
        },
        "1323":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Sarah",
                "Rachael",
                "Digit"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will inflate him?</span></div></span></div>",
            "created":1234242000,
            "id":677047,
            "title":"Water"
        },
        "135":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Muscle expansion",
                "Penis expansion",
                "Mpreg"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Miles' last two options.</span></div></span></div>",
            "created":1239771600,
            "id":676590,
            "title":"Other"
        },
        "1351":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "He chooses to do it",
                "It's done to him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does he decide on his own to get huge, or is it done to him unexpectedly?</span></div></span></div>",
            "created":1239771600,
            "id":676598,
            "title":"Miles' Massive Muscles"
        },
        "13511":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "To attract girls and boost his own ego",
                "To beat Minos"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why has he chosen to do this?</span></div></span></div>",
            "created":1239771600,
            "id":676602,
            "title":"He chooses to do it"
        },
        "135111":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does this story begin with him already buff?</span></div></span></div>",
            "created":1294203600,
            "id":1029818,
            "title":"To attract girls and boost his own ego"
        },
        "135112":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "...use muscle enhancers!\"",
                "...get Digit to fill me with nanobots!\""
            ],
            "content":"<div class=\"\"><div> <span>Miles breathed a deep sigh as he examined his body after his weekly workout. He had what most would indeed consider a good body. He had alot of lean muscle despite being such a slacker, and had managed to keep it that way. But he wanted more. He wanted to be huge, insanely strong, so he could beat up Minos.<br>\r\n<br>\r\nBut so far, it would only happen in his dreams.<br>\r\n<br>\r\n\"Why the hell haven't I gotten any bigger?!\", he yelled to himself. He was beginning to wonder if perhaps it was time to get some help...<br>\r\n<br>\r\n\"That's it!\", he exclaimed after a moment of thought, \"I'll...\"</span></div></div>",
            "created":1239858000,
            "id":677039,
            "title":"Far From His Goal"
        },
        "1352":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "He uses special pills he ordered",
                "He inflates it and makes Sarah think it's a pooltoy",
                "He gets Digit to give his penis a nanobot treatment"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Miles make his penis grow?</span></div></span></div>",
            "created":1239858000,
            "id":677062,
            "title":"One COCKy Cat"
        },
        "13523":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "The change begins",
                "The change begins but something goes wrong"
            ],
            "content":"<div class=\"\"><div> <span>\tMiles headed downstairs in a huff. He hadn't had a piece of action in weeks. Feeling pent up, from being so backed up he decided to go pump some iron and work his aggressions out.<br>\r\n<br>\r\n “Stupid farm so far in the middle of nowhere, and here I am with no way into the city.” Miles grunted  while doing bicep curls. “Every piece of tail here is either taken or not interested…Twenty-six!…Twenty-seven!” He continued clanking the weights together as he did. <br>\r\n<br>\r\n    \tHe gathered his thoughts together as he finally rested, his body pulsing in reaction to the moderately heavy lifting. Thinking as he chugged his water “All because of that stupid Minos. I mean I could be a whole new man if I was built like him, him and his big dick.” Why else would any girl find a person with absolutely no personality attractive. As soon as he thought this however Miles had felt bad. “It’s not Minos fault entirely I guess.” he imagined. <br>\r\n\t<br>\r\nMiles hadn’t thought  of himself  as being un-endowed until now, and now for the first time felt like his stuff just didn’t stack up when compared to Minos. “Still I wondered what it would be like to have his kind of endowments…”  Miles went back to working out , but his words echoed dully through the barn and just happened to reach the two ears of the nanocell resident spirit of the ranch Digit. Her ears ablaze with this “wish” of sorts she decided to do what she did best helping other people.  She whizzed down from the rafters and hovered invisibly above Miles. With a simple flick of the wrist she went unnoticed and tapped Miles right on his manhood. As soon as she did show she fluttered off humming as she buzzed away not even bothering to watch her magic begin to work.<br>\r\n<br>\r\n    </span></div></div>",
            "created":1252558800,
            "id":758629,
            "title":"He gets Digit to give his penis a nanobot treat..."
        },
        "135231":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "He continues straight into the next morning...",
                "He works out endlessly for days... {bonus muscle expansion}"
            ],
            "content":"<div class=\"\"><div> <span>Miles felt a slight pinch in his dick and looked down, pulling his shorts down. \"Holy shit!\", he yelled in excitement--if he was seeing things correctly, his penis had just grown by several inches. He grinned and started experimentally stroking it, making it harden and grow more. He now had a plump, healthy, 10-inch erection.<br>\r\n<br>\r\n\"I'm huge!\", he purred, tossing his shorts away. He decided to spend the rest of his workout naked, and he didn't care who saw. \"I wonder if I can make it even bigger than this...\", he chuckled to himself as he continued his routine. \"Maybe working out more will make it grow...\"<br>\r\n<br>\r\nAs it turned out, he was right. By the end of his workout, his dick had grown to be over a foot long. He proudly patted his sausage and decided to keep up the good work...</span></div></div>",
            "created":1268888400,
            "id":852997,
            "title":"The change begins"
        },
        "1352312":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "The girls like his body",
                "The girls are frightened by him--but can't help noticing his penis"
            ],
            "content":"<div class=\"\"><div> <span>Miles continued his workout for the next couple of weeks straight, without stopping for anything. He monopolized the barn, making it his home for awhile, surviving on his own cum, his excitement making him frequently ejaculate. He was thankful that Rachael wasn't well at the time and couldn't work out--this meant no interruptions and no spoiled surprises.<br>\r\n<br>\r\nFinally, after a 15-day/360-hour workout, Miles was finished. Good thing too, as his head was halfway towards hitting the ceiling and his dick threatened to break down the wall. He took a slow, thunderous step forward and flexed, his gigantic muscles growing twice as massive. \"I..am...AWESOME!!\", he declared proudly in his new lower and more powerful voice.<br>\r\n<br>\r\nHe then pretentiously gave his cock a kiss, the organ now a tremendously long, thick, veiny behemoth. \"Look at you, little buddy. No one can resist you now.\" With that, he stepped out of the barn for the first time in two weeks and headed for the house. He squeezed in, breaking the door frame and knocking a few things over with his penis, soon making it to the dining room, where everyone was having lunch. He was greeted with speechless stares.<br>\r\n<br>\r\n\"Hello, everyone.\", he murred, \"Happy to see me?\"</span></div></div>",
            "created":1268974800,
            "id":853337,
            "title":"Massive Miles"
        },
        "13523122":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Miles picks on the girls for himself",
                "One of the girls wants to \"ride\" him"
            ],
            "content":"<div class=\"\"><div> <span>With great shock, the women backed away to a corner thinking that a giant just crashed into the building which is pretty much of what just happened. But their real focus is on the Miles' oversize meaty log. \"What... the... freaking... fuck?\" Rachel responded to the behemoth's presence. \"What the hell happened to you?\"<br>\r\n<br>\r\n\"I've simply improved,\" replied Miles as he is flexing muscles. \"But also I've been blessed in a way.\" Miles leans back to put more emphasis of his penis. Miles gives off the \"you know you want this\" glance to each girl starting at Rachel, then to Sarah, Taffy, and finally to Mora. <br>\r\n<br>\r\n\"So ladies, who wants to take a ride on Ol' Faithful?\"</span></div></div>",
            "created":1270184400,
            "id":861071,
            "title":"The girls are frightened by him--but can't ..."
        },
        "135231221":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Mora!",
                "Sarah!"
            ],
            "content":"<div class=\"\"><div> <span>Miles lustfully looks over his options, flexing his throbbing naked meat log for the awestruck girls. Giving it a soft pat to calm it down, he tries to make his decision based on who is looking at his cock in the lustiest manner. Thanks to his ego, however, he doesn't fully realize that they haven't fallen for him, only the tremendous penis attached to him...<br>\r\n<br>\r\nHe soon narrows it down to two girls...<br>\r\n<br>\r\n\"Alright, Ol' Faithful\", he says to his cock after a moment, having decided to officially name it that, \"Time for some action.\" He turns his attention back to the girls. \"My decision is made! I choose...\"</span></div></div>",
            "created":1270184400,
            "id":861128,
            "title":"Miles picks one of the girls for himself"
        },
        "1352312211":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Miles wants to tittyfuck Mora (BE on Mora)",
                "Mora gives Miles a blow job "
            ],
            "content":"<div class=\"\"><div> <span>\"Mora!\" said Miles as he points his penis to the busty cow. Regardless of putting so much effort in establishing a relationship with Minos, Mora didn't even hesitate to clasp herself onto the giant member. Rachael became disgusted at Mora's actions, but then again it would make Minos available. For the most part, it's a win-win.<br>\r\n<br>\r\n\"My, aren't you impatient,\" said Miles. \"So where do you want to do it?\"<br>\r\n<br>\r\n\"Let's try the barn,\" Mora replied while she begins rubbing the humongous member. In practically the fashion as Miles entered the house by wrecking the door frame even more and heads towards the barn with his new lustful lover still hitched to his penis.<br>\r\n<br>\r\nBack inside the house, Minos walked into what was left of the kitchen, sees the girls in an awestruck manner, and notices that Mora is missing. \"Okay, how did Mora find the tequila stash?\"</span></div></div>",
            "created":1270270800,
            "id":861330,
            "title":"Mora!"
        },
        "13523122111":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "Fast working drug",
                "Digit"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she change her breast size?</span></div></span></div>",
            "created":1332651600,
            "id":1301959,
            "title":"Miles wants to tittyfuck Mora (BE on Mora)"
        },
        "13523122112":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "select another girl to fuck",
                "select a girl to help him with another weeks-long workout"
            ],
            "content":"<div class=\"\"><div> <span>Miles carried Mora to the barn, where she almost immediately began sucking on the cat's huge penis. Miles arched his back and moaned, his mega-dick pushing itself down Mora's throat, stretching her jaws wide and forcing her to use her throat muscles to pleasure him.<br>\r\n<br>\r\nHe had to admit, it felt great. Mora was certainly a professional, and she hadn't lost her touch at all. The cow began rubbing the massive penis, tracing her soft hands along its giant pulsating veins. This, of course, only got Miles even hornier, making him meow loudly in total bliss.<br>\r\n<br>\r\nAfter a few minutes, the cat could feel his balls swelling, filling with hot cum. Mora seemed to notice, now suckling much harder, mooing hotly into the gargantuan dick. Miles let out a proud roar as he blew a generous load into Mora's stomach.<br>\r\n<br>\r\nWell, generous would be putting it lightly. Her entire body inflated! By the time he was done, she was a fat sphere with tremendous breasts and a painfully stretched pussy, her face decorated with huge cheeks and a couple of extra chins, her neck and limbs gone, and her bellybutton and tire-sized brown nipples bloated up separately as an indicator of her fullness.<br>\r\n<br>\r\nMiles pulls out of the confused and bloated cow. \"So\", he panted, grinning, \"Like me now, Mora?\"<br>\r\n<br>\r\nMora could only belch in reply, spitting up a mouthful of cum. Miles rolls the cow out of the barn and went back into the house to...</span></div></div>",
            "created":1270443600,
            "id":862318,
            "title":"Mora's Biggest Meal"
        },
        "135231221122":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Rachael {bonus female muscle+breast expansion}",
                "Minos {bonus Minos muscle+penis expansion}"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, girls!\", he called out as he entered the kitchen again, \"I'm gonna choose someone to help me with my next workout!\" It was then that he noticed Minos, who was already getting close to Rachael.<br>\r\n<br>\r\n\"It's gonna be one of them\", Miles thought to himself, \"I'll force one of them to be my workout partner...\"<br>\r\n<br>\r\nHe chuckles and thinks for a moment, and soon points Ol' Faithful at his new partner...<br>\r\n<br>\r\n\"My new workout partner for the next month is...\"</span></div></div>",
            "created":1270443600,
            "id":862327,
            "title":"An Unexpected Surprise"
        },
        "1352312211221":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Digit makes Rachel bigger than Miles",
                "Digit makes Rachel the same size as Miles"
            ],
            "content":"<div class=\"\"><div> <span>With one swing, Miles cockslapped Minos across the room leaving Rachel vulnerable. \"You're coming with me, missy!\" Miles carried Rachel over his shoulders sense it's far better for her to claw at his back than it is on his dick. \"You're going to be my workout partner for a while.\"<br>\r\n<br>\r\n\"Let go of me, you fucking oversized asshat!\" Rachel screamed as she tries in vain to tear away at Miles arm. \"I hate you! I hate you so much! There's going to be Hell to pay when I... holy shit...\" Rachel looked at what is now a bloated ball of a bovine that's now drooling cum.<br>\r\n<br>\r\n\"Don't worry, I promise that you won't end up like her... unless otherwise,\" said Miles. \"What I'm going to do is make pump up like me.\"<br>\r\n<br>\r\nMiles throws Rachel onto the ground and make her bench press Miles throbbing penis. Rachel thought to herself, \"I'm going to make this bastard regret this. I'm going to outsize Miles and beat the living crap out him!\" That dream will take a lot of time in order for it to be accomplished unless a certain spirit decides to intervene.</span></div></div>",
            "created":1270443600,
            "id":862416,
            "title":"Rachael "
        },
        "13523122112212":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Rachael is too fast for him despite her enormous size and weight",
                "Miles is faster and manages to force himself on her"
            ],
            "content":"<div class=\"\"><div> <span>Unbeknownst to either cat, Digit had invisibly followed them and now wanted to get back at Miles for what had happened to Mora. She could tell that Rachael wanted to get back at him too, so she decided to help...<br>\r\n<br>\r\nWith a few light taps, she filled Rachael's body with nanobots that would, over the next month, end up making her whatever size Miles reached. Within the first few minutes, it gave her a head start, Rachael soon finding her muscles alot larger than they had previously been, apparently thanks to her bench-pressing. She didn't know what was happening, but she loved it already.<br>\r\n<br>\r\nFor the next entire month, the two of them worked out endlessly, Rachael grudgingly accepting Miles' \"no clothes\" rule. Not a single break was taken, not even for a mere moment, both cats working their bodies over, their nanobots repairing any damage they did to themselves. The female grew more and more every day, soon matching her captor.<br>\r\n<br>\r\nBefore long, the continuous month-long workout was over. Both cats were gigantic, and had completely destroyed the barn with their massiveness. As a bonus, Rachael now had gargantuan breasts, her shiny black nipples standing thick and proud, and Miles' dick was rivalling a skyscraper.<br>\r\n<br>\r\nThey took a good look at each other, grinning and flexing hard, their muscles expanding more. \"Looks like I've caught up to you.\", Rachael bragged in a much lower and huskier voice. Miles didn't seem the least bit intimidated. In fact, he looked...horny, Rachael realized with slight building fear.<br>\r\n<br>\r\nAnd that's when the giant overmuscled male made his move, Ol' Faithful throbbing longingly...</span></div></div>",
            "created":1270443600,
            "id":862738,
            "title":"Digit makes Rachael the same size as Miles"
        },
        "135231221122121":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Mora comes, now muscled, wants revenge on Miles too",
                "Miles gets his revenge"
            ],
            "content":"<div class=\"\"><div> <span>\"And I'm going to kick your ass!\" roared Rachael as she side swipes Miles legs and then puts him in choke hold with her thighs. \"You've given me a lot of shit when I was partner, now Karma is coming back like a psycho bitch!\" Rachael swings Miles out the barn, making him land dick first.<br>\r\n<br>\r\n\"Ooooow, my fai...thful...\" Miles tries to regain himself until he gets clawed on the face and then gets taken down by Rachael. \"Get off of me, you bitch!<br>\r\n<br>\r\n\"Oh no, it's your turn to be the bitch this time,\" Rachael replied.<br>\r\n<br>\r\nUnknown to Rachael, it was Digit who made Rachael far faster than Miles. Now Miles is receiving his comeuppance and is forced into a submission because of his arrogance. But then...</span></div></div>",
            "created":1271480400,
            "id":869351,
            "title":"Rachael is too fast for him despite her enormou..."
        },
        "1352312211221212":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Everyone comes to her rescue, all pumped up insanely massive by Digit",
                "She's not rescued in time and becomes too huge to deflate"
            ],
            "content":"<div class=\"\"><div> <span>Miles takes advantage of this position and shoves Ol' Faithful right into Rachael's ass!<br>\r\n<br>\r\n\"YEOW!! What the fuck?!\", Rachael screams, squirming and trying to get away. But it's too late. Miles lets out all his pent-up cum into the poor catgirl.<br>\r\n<br>\r\nRachael rapidly inflates, losing more and more of her muscle every second as she turns into a big flabby balloon. \"HEEEEELP!! Someone stop him!!\", she cries, quickly rounding out. Miles moans gleefully as Rachael presses down on him. \"Finally, I've claimed you, bitch!\", he laughs, \"You're my helpless pet balloon-kitty now!\"<br>\r\n<br>\r\nThe female continues inflating, hoping someone rescues her...</span></div></div>",
            "created":1271480400,
            "id":869363,
            "title":"Miles gets his revenge"
        },
        "13523122112212122":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "He grabs Sarah",
                "He grabs Minos"
            ],
            "content":"<div class=\"\"><div> <span>But it's too late. Miles has bloated her beyond repair, the kitty now a gigantic cum-drooling blob like Mora.<br>\r\n<br>\r\nPulling out and rolling his newest toy aside, he goes back to the house and lifts off the roof, reaching in for a new training/sex partner...</span></div></div>",
            "created":1284872400,
            "id":959579,
            "title":"She's not rescued in time"
        },
        "14":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Butt expansion",
                "Fruitification",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ooh, you've chosen Randal? FABULOUS, honey, FABULOUS! What kind of expansion will you choose for him?</span></div></span></div>",
            "created":1220072400,
            "id":676587,
            "title":"Randal"
        },
        "141":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Overeating",
                "Force-feeding",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, you want Randal to put on a few hundred pounds? How will he do it?</span></div></span></div>",
            "created":1220158800,
            "id":576841,
            "title":"FLABulous!"
        },
        "1412":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Miles",
                "Taffy",
                "Rachael"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will feed the lovely puppy?</span></div></span></div>",
            "created":1234242000,
            "id":645128,
            "title":"Force-feeding"
        },
        "142":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Air",
                "Helium",
                "Water"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What would you like to inflate him with?</span></div></span></div>",
            "created":1220158800,
            "id":576807,
            "title":"Pumped Puppy"
        },
        "1423":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Taffy",
                "Rachael",
                "Sarah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will inflate Randal?</span></div></span></div>",
            "created":1220158800,
            "id":576835,
            "title":"Water"
        },
        "144":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Pear",
                "Tomato",
                "Eggplant"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What would you like the sexy pup to become?</span></div></span></div>",
            "created":1236834000,
            "id":659866,
            "title":"Fabulous Fruitification"
        },
        "145":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Muscle expansion or Mpreg {not enough spaces left, so both go up here}",
                "Penis expansion",
                "Breast expansion {because he's just that FABULOUS!}"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two more options for Randal, along with a Randal-exclusive bonus option!</span></div></span></div>",
            "created":1239858000,
            "id":677042,
            "title":"Other"
        },
        "1452":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "He's feeling a bit jealous of Minos' size",
                "He wants to see if a huge one will help catch the girls' attention",
                "He just wants to feel it grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why does he decide to try and make his cock larger?</span></div></span></div>",
            "created":1239858000,
            "id":677046,
            "title":"Pretty Puppy's Powerful Penis"
        },
        "14522":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "Randall manages to endure temptation",
                "Randall gives in despite the consequences."
            ],
            "content":"<div class=\"\"><div> <span>After dinner, Randall cheerfully bid his housemates good night and made his way to his room.  It had been a pleasant day, full of the vibrancy that came from living with such colorful characters.  Once inside his room, he locked the door and opened his closet, pulling down a box from the top shelf.  Things had been relatively drama-free over the last few weeks, and the occasional flare-ups were nothing more than the friction one should expect from such a diverse, close-knit group.  This had allowed him to relax enough to consistently indulge in his secret hobby.<br>\r\n<br>\r\nSitting down at the edge of his bed, the collie opened the box and pulled out a large penis pump and a bottle of blue medicine.  Most people took one glance at his metrosexual looks and flamboyant personality, and even if they didn't assume he was gay, would simply think him effeminate and silly.  In truth, while he was genuinely comfortable enough with himself to ignore any snide comments thrown his way, there was one area in which he entertained his more primal, masculine urges.<br>\r\n<br>\r\nAfter removing his clothes, Randall looked down at himself and grinned as he saw he was already at full-mast from anticipation.  Thanks to a steady indulgence of his 'hobby,' it was already a thick nine inches long, proudly arching up toward the ceiling.  Certainly enough to impress just about any romantic companion he might find, but in Randall's fantasies, there was no clear-cut goal to be reached.  Only a constant journey toward an increasingly massive, awe-inspiring log jutting out from his fluffy, unassuming body.  Every time his cock measured slightly larger than before, it filled him with an incredible rush and a desire to see just how much farther he could go.<br>\r\n<br>\r\nWith that thought in mind, the collie placed his stiff shaft into the tube of the penis pump, making sure that it was good and snug before slowly turning up the suction.  And when he started to see its length slowly increase, its girth fattening in the tube, Randall moaned and caressed the plastic shaft.  \"Ahhh... Mora...\" he moaned, imagining for a moment that it wasn't a device of metal and plastic sucking on his growing cock, but his beautiful bovine adopted sister.  Though she was involved with Minos, a man that Randall held no animosity toward, it did nothing to stop the fact that Mora had been the very first girl he had 'noticed' when he started to have desires for more than friendship.  Those feelings had only grown after their reunion upon finding that she was truly dedicated to rebuilding the home of his youth, and if he couldn't approach her in reality, then at least he could be a true friend to her.  But it would never stop him from fantasizing about making her fall in love with him, being both a confidante and a man able to satisfy a passionate, earthy woman like her.<br>\r\n<br>\r\nNor would it stop him from allowing those feelings to spread to the other ladies with whom they shared a home.  Though he hadn't known them long, each of them was so uniquely beautiful, he couldn't help but imagine what it would be like to love any of them.  Sweet, bubbly Sarah.  As refreshing and joyful as a summer breeze.  So innocent and naive about how attractive she was, he would give anything to preserve that joyful innocence innocence of hers.  It didn't stop him from his fantasies, but in his daydreams their lovemaking would a loving, gentle affair of exploration and tenderness.<br>\r\n<br>\r\nOf course, if such a thing were ever to happen, he would have to contend with Sarah's 'sister,' Rachel.  Ahhh, Rachel.  A creature of fire and drive.  A divine protector so concerned with Sarah's well-being that she didn't seem to realize just how special she herself was.  Like him, she wanted to give her heart to someone that was already out of reach.  If he could, Randall would gladly prove to her how beautiful and worthy of love she was.  Break down her defenses bit by bit until he could reach the tender heart that she had placed so much armor around.<br>\r\n<br>\r\nAnd then there was Taffy... darling Taffy.  A caregiver every bit as sweet as her nickname.  So shy and selfless, and yet there was something more, he could tell.  Hints of a wild, creative soul that was too often hidden.  He could see it whenever she finished one of her role-playing sessions with Idward and their group.  A tide of warmth and life that washed over everyone around her.  To love her would be as to love a bright, shining jewel.  It wouldn't be enough to enjoy merely one facet, but would require seeing and accepting every angle of her complex, changing being.  A journey that she seemed to be undergoing herself.<br>\r\n<br>\r\nSlow to awake from daydreams of his four loves, Randall smiled and imagined what he could do for and with each one of them with the hard, aching member between his legs.  His affection for them all was tender and gentlemanly, and yet he also wanted something raw and exciting.  He wanted to be able to see the look of surprise on their faces when he revealed himself to them.  Those first, trembling moments of nervousness and curiosity that slowly build into passion, when they would begin exploring and pushing each other's limits.  And speaking of limits...<br>\r\n<br>\r\nRandall looked down at the pump.  According to the measuring ticks along its side, his penis had responded well and was at least an inch and a half longer than when he put it in.  He knew from experience that this wouldn't last long, and any permanent gains would be minute at best, only cumulative over a great length of time.  However, that's what the medicine was for.  Bought off-market from an old college friend, he had been promised that it would help enhance his 'training', allowing him to maintain his gains more easily.  When it was obvious that the pump wouldn't make him any bigger tonight, the collie opened the bottle and carefully poured a small, measured amount into the cap and gulped it down.<br>\r\n<br>\r\nThe taste was awful, but nothing he couldn't put up with if it gave results.  Supposedly, it would subtly affect his hormone levels and increase cellular generation.  In other words, while the spongey tissue in his penis was expanded by the pump, the formula would grow more tissue where it was stretched, making far more of the inch and a half he'd gained permanent.  Within a few minutes, he could feel something changing.  A slight heat in his loins beyond what was already there from his fantasies, but that heat quickly grew into a prickly fire in his penis!  He threw himself onto his back, writhing on the bed and accidentally hitting the off-switch of the pump, but he didn't need any more suction.  What it felt like he needed, more than anything, was to pull off the tube and furiously masturbate as if scratching a terrible itch.  What his friend had described as 'subtle' was a rush of pure, unbridled desire.  Images of his loves and their naked bodies, all of them offering themselves to him, asking him to let go of restraint and vent his lusts on them with his huge, swelling cock.<br>\r\n<br>\r\nThen he felt a painful tightness, as if someone was crushing his testicles in their fist.  Panting and whimpering, Randall looked down.  Instead of seeing some attack, however, he saw his testes swelling, stretching his ballsac as if it were a too-small balloon.  It felt like he was going to burst, and if his taut sac didn't rupture, then he would burst in another way.  He was already leaking precum like a faucet, and would probably cum like a firehose if he so much as breathed on his cock.<br>\r\n<br>\r\nAnd yet, a warning voice in his head warned him not to.  One thing his friend had expressly warned him about was not to engage in <i>any</i> sexual activity aside from the pump for 24 hours after taking the formula.  Abstaining would result in safe, steady gains, but failing to do so could introduce any number of unpredictable variables to the processes going on in his body.  At the time, Randall had agreed readily, but at the time, he hadn't had every single molecule in his body screaming to let him cum.<br>\r\n<br>\r\nHe wasn't sure if he could handle it...</span></div></div>",
            "created":1289278800,
            "id":990997,
            "title":"Love, Daydreams, & Agony"
        },
        "145221":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Randall has an uneventful night, but he starts the new day off right.",
                "Randall has a very erotic dream that night."
            ],
            "content":"<div class=\"\"><div> <span>The burning sensation raged within Randall’s rigid erection, begging him for release from the pressure building inside.  But Randall was a man of wills and if abstaining from masturbation was what it would take, then Randall would do it, anything for the even larger manhood he sought. The warning of his friend echoing throughout his mind Randall clenched his bed sheets tight into his fists and hunched into a place to wait the reaction out. He could feel himself tearing up at the corners of his eyes at this unsatisfied craving to jerk it, he put his mind off the excruciating throbbing going on inside the very tip of his shaft by thinking of the rewards his endurance would bring. The chance to see any of the Las Lindas ladies in shock and awe before his domineering dick was enough to hold him steadfast. He fantasized over the idea of watching them wriggle and writhe in ecstasy underneath him as he filled their nubile bodies with more and more of his ever expanding member.<br>\r\n<br>\r\nThese fantasies filled his focus long enough for the irritation to subside, and soon he felt his body overcome with the cool wave of relief. Letting out an audible “Ahhh” of content Randal stared down and appraised his transformed tool. Although unsure if there would be any lasting gains to his now flaccid penis he’d had enough for the night and simply put was exhausted. Wiping the unusually copious amounts of precum away with a tissue Randall prepared for sleep, alone again in a bed that was too empty to his liking.   <br>\r\n<br>\r\nThinking about it as he crawled beneath his blankets, the episode he just experienced only deepened his lustful desires for fornication. His new size had definitely given him a boost in self-confidence and he was sure now that he could please almost any woman, <i>physically at least</i>, but the real problem had always been his metro-sexual attitude. He could see why the others might get the wrong impression on his sexuality, but deep down he was just another average hot-blooded male. He decided would change things up tomorrow, that would be the day he would move from flamboyant friend to a fuckable fellow worker.<br>\r\n <br>\r\nFeeling sleep slowly fall upon him Randall drifted off dozing into the night thinking of all the possibilities tomorrow held. Although with all those reactive hormones still running through his body while he slept Randall might have some sultry and wildly sexy fantasies that night…<br>\r\n</span></div></div>",
            "created":1290574800,
            "id":999954,
            "title":"Randall manages to endure temptation"
        },
        "1452211":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Sarah wanting to go fishing.",
                "Taffy ready to sweep the porch as usual."
            ],
            "content":"<div class=\"\"><div> <span>Randall awoke early the next day after an uneventful night’s sleep. While dressing he found that another part of him was also “awake” so to speak although only it was only soft and at half mast, not the fully extended beast from last night. Randall remembered the pain he’d experienced the night before and then the immediate and surprising results the blue medicine brought with it. He retrieved the bottle for its well hid location, and decided to read exactly what was in this stuff. It wasn’t like he was going to quit taking it, not with these kind of results, but last night had definitely caught him off guard.  <br>\r\n<br>\r\nGlancing through the ingredients he noticed nothing out of the ordinary, so he switched to the other side of the label that had the instructions and warnings on it.. His friend from college who had sold him the stuff had given the fundamentals of the instructions to Randall, but here the tiny warning text was what interested him now.<br>\r\n<br>\r\nWARNING! THE USE BEFORE SLEEP MAY CAUSE PSYCHOLOGICAL DREAMING. DO NOT TAKE WITH ALCOHOL. USE MAY CAUSE SLIGHTLY PAINFUL SENSATION. UNPREDICTABLE RESULTS MAY OCCUR IF ANY SEXUAL ACTIVITY IS ENGAGED WITHIN 24HRS. ALTHOUGH PROPER USE WILL NATURAL INCREASE CELL REGENERATION AND HORMONE LEVEL INCREASED PHEROMONES LEVEL MAY ALSO OCCUR AS A SIDE EFFECT.<br>\r\n<br>\r\n“Humph” he scoffed out loud holding the bottle, “slightly painful indeed.” Randall remembered the urge to masturbate he felt last night. It was less like :slightly painful” and more like it was burning with the force of a thousand suns, all urging him to cum. Well other than that everything else seemed in order, except for the bit about pheromones… Recalling what he could on the subject pheromones had to do with biology, something to do with animals that used smells to send information. There  were a few that let other animals know if predators were near, or ones that would alert bees to where flowers were, but the one he remembered in particular was the sex pheromone that would let all other females of a species know that a male was ready to mate. <br>\r\n<br>\r\nRandall sniffed the air around him, not detecting anything other than his usual fabulous aroma Randall shrugged and left his bedroom. One phrase from last night was still burning in his head “Today’s the day!” The mantra invigorated him; he was certainly ready to “play the field” today when it came to the wonderful women around him, for better or for worse. The same conundrum that bothered him all his life, still painfully plagued him though, at nine inches long Randall had so much to give, just no one to give it to.<br>\r\n<br>\r\n Heading outside with a spring in his step, Randall looked around for any other early risers this morning perhaps someone he could seduce with his new flirtatious personality. Alas, it seemed he was alone to watch the sunrise from the porch. That was until he was joined by…<br>\r\n</span></div></div>",
            "created":1291266000,
            "id":1007082,
            "title":"Randall has an uneventful night, but he starts ..."
        },
        "14522111":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "That he was getting an erection.",
                "They were being watched…"
            ],
            "content":"<div class=\"\"><div> <span>Randal was watching the sunrise from the porch when he was surprised to see the white kitten Sarah bounding towards him. “Hey’ Randy-Dandy-Doo! You’re up! Great!” she yelled from a distance. As she got closer Randal saw she was carrying two fishing rods, he could easily piece together what the kitten was up to. <br>\r\n<br>\r\nRandal had previously fished alone on the farm as a form of relaxation, but soon Sarah had wanted to give fishing a try, and found she too enjoyed catching some tasty fish with him. Randal had often told the eager to learn kitten that the best time to catch fish was early in the morning and that one day they should both head out at the crack of dawn and try their luck. Unfortunately getting Sarah (or on some days Randal himself) out of bed early was impossible, and the collie had forgotten all about his tip until now.<br>\r\n<br>\r\nRandal got up from the porch and met the excitable teen. “Sarah, you really want to go fishing with this old fart?” Randal had already forgotten to put on his “stud” attitude, and reverted to his former self in front of Sarah.<br>\r\n<br>\r\n“Yeah, I was on my way to wake you up, but I guess we can go now.” She explained holding out the pole towards the puppy. The look in her eyes telling him, she was dead set on fishing right now. <br>\r\n<br>\r\nThey reached their small fishing boat and prepared to fish. The boat seemed a lot more cramped then Randal remembered, he was basically touching back to back with the kitten, but is she was bothered by it she didn’t show it. A few minutes passed as the two hunkered into positions both ready to reel in a big one. Soon dullness set in and the Sarah always did what she could to fend off boredom. <br>\r\n<br>\r\n“Randal did you shower already?” she asked standing up in the boat and stretching.<br>\r\n<br>\r\n“No why?” Asked Randal who was still focused Zen like on the pond, his pole, and fishing.<br>\r\n<br>\r\n“No reason. You just smell realllly niceeee.” Then leaning in towards the unsuspecting Randal, Sarah took a deep whiff of his oh so poufy hair, consequently pressing her breasts into his shoulders, (whether the latter was intentional or unintentional, remained to be seen.)<br>\r\n<br>\r\n“Sarah!” he choked out exasperated, when suddenly he felt a bite on the end of his line. Pulling back instinctively on his pole, he bumped the kitten behind him and accidentally sent her tumbling into the pond. <br>\r\n<br>\r\n“Randal!” she cried her head bobbing up and down in the water as she tried to stay afloat. Unsure if she could swim or not Randal’s instincts took over and he immediately dove in immediately after her. He scooped her body to his side her clothes soaked completely through. Reaching the shoreline he found the kitten was fine.<br>\r\n<br>\r\n“Thanks” she said coughing up a bit water.<br>\r\n<br>\r\n“It was nothing. Sorry about that” said Randal apologizing for the accident, he shook his entire body trying to dry himself off. <br>\r\n<br>\r\n“No, it was my fault.” Said the kitten in return, walking closer towards Randal, and gave him a hug both their wet bodies grinding against each other.<br>\r\n<br>\r\nThat’s when Randal noticed…<br>\r\n</span></div></div>",
            "created":1291266000,
            "id":1007185,
            "title":"Sarah has a look in here eyes..."
        },
        "145221111":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Stay here with Sarah",
                "Head back to the house..."
            ],
            "content":"<div class=\"\"><div> <span> Randal escaped from the embrace of the oblivious kitten. To Sarah Randal had just saved her, and was rewarding him with a hug, But to him it was more, so much more. Here he was alone, with the bubbly and modestly busty teen, both of them wet from head to toe, her attire now leaving little to the imagination as Randall thought he could see the kittens nipples now quite hard from the cold water. Then when they hugged, the grinding was enough to send him over the edge, and embarrassingly he felt himself getting an erection. Conflicted about whether he was finally going to act on his harbored emotions towards the feline, it seemed it was decided for him.<br>\r\n<br>\r\n“Randal, it’s O.K.” Sarah’s young voice came from behind him. “Rach has kept me in the dark about certain things; but maybe you’re someone who could teach me maybe? I’ve heard about some stuff that’s pretty wild” She walked up behind him and embraced him once more. This time her hands explored, further as she buried her face into the small of his back. Her fingers walked down to his zipper, and skillfully unzipped the front of the pooch’s shorts. <br>\r\n“Yes!” he gasped in passion without thinking. But again he escaped the cat’s clutches, and turned around to face her as a terrible though struck him, a thought that was enough to make his whole body shirk into itself. “But, Rachael, if she ever found out she would kill me. KILL ME!” he repeated for effect and made a cross mark over his neck so the kitten was sure to understand. <br>\r\n<br>\r\nSarah mimed back to him zipping her lips, and throwing away the key showing she could keep a secret. “Good” Randall thought at least that takes care of one problem, but what about the warning of no sexual activity for twenty four hours? There was no way he was going to miss this unintended encounter; he supposed he could give in to his urges now. After all the worst that could happen would be that he wouldn’t gain as fast, right? <br>\r\n<br>\r\n“Well…O.K.”. He said finally and began quickly undressing himself from his wet clothes, only to lose to the lithe kitten that stripped even faster. He scanned the area for any prying eyes, but he doubted anyone was around anyways. It was early in the morning and they were a short distance away from the house, so it wasn’t likely there would be any onlookers.<br>\r\n<br>\r\nHe marveled at the nude Sarah, her blond hair still wet, and blue naïve eyes staring back at him, trusting him. He loved seeing the whole of Sarah’s white breasts, which were remarkably perky and sported pink stiff nipples. Now was the big moment, here he would gently show sweet Sarah what lied beneath his flamboyant exterior. He watched her eyes as they traced his own body stopping at the obvious “star attraction”. <br>\r\n<br>\r\n“That’s it?” Sarah asked innocently a hint of slight disappointment in her voice. <br>\r\n<br>\r\n“No…give it a second…the water was cold.” Randall began, hoping he would actually be able to perform, right now when it needed to. But it was too late, Sarah fell to her knees, opened her mouth and was had the entirety of it in her mouth, her sandpaper like tongue sending shock waves through his body as she reached his testes. <br>\r\n<br>\r\n“Sarah! What are you…Where did you learn to…Ohhhhh!” he moaned and he almost lost it right there but his years of playing soccer in school gave him the gift of endurance and he was able hold back the initial flood. Blood rushed swelling his penis to three times its previous size, growing from six inches to seven to eight, bulging out thicker as well in pace with the expansion. Sarah face screamed of surprise as she hadn’t expected this monster to be her in her mouth. There was no stopping Randall now though, as his member peaked out to its full proud size pushing deeper and deeper to the back of the kitten mouth. He watched her face, as her eyes lit up with a mixture of surprise and delight at this new development. Sarah scooted herself back giving Randall a little more room to maneuver. Size did not make up for inexperience, and so had Randall pretend like he was in control now. Sarah returned to moving her bumpy tongue along his long tallywacker, gently tickling a vein on his underside or bobbing her lips around the outside of his girth. Randall felt her short warm breaths coming from her nose, and they only added to the several feelings of pleasure he was currently feeling.<br>\r\n<br>\r\n“So much for being the teacher” Randall thought to himself, as he was totally putty in Sarah’s hands. This was a dream come true for him, and he begged that the sensation could somehow last forever. But Randall could feel the urge to cum coming upon him again, this time twice as strong as before, his balls swelled the were becoming so full. Randall went with the polite thing to do, and went to immediately alert Sarah of this fact. “Sarah I’m about to cum” he told the white fur colored vixen.  He went to pull out but she stopped him, clearly still enjoying the sensation.  Randall fought the urge to come as long as he could, not wanting Sarah’s first time to “end” like this but alas he could hold back no longer.  Sarah too managed to pull back some, but Randall came into her eager mouth just the same, releasing spurt after spurt of hot man juice. Randall’s orgasm was sending a violent shiver through his body, and the feeling still echoed for seconds afterwards as he pulled the highly sensitive shlong from her mouth. Then the burning sensation he'd felt returned again sweeping quickly through his meat and potatoes, but only briefly, before Randal was at an after orgasm peace.<br>\r\n<br>\r\nSarah’s cheeks bulged slightly with the unbelievable, amount. She swallowed once then again before speaking to him. “Sorry.” She gasped, both from being out of breath and apparently thrilled. “I don’t know what happened, I couldn’t help myself. But wait till I tell the others what a whopper you’ve got!” Sarah exclaimed excitedly, as if her tail had be set on fire. <br>\r\n <br>\r\n“No, Sarah you promised you’d tell nobody.” said Randall regretting his decision to go through with this already. Well maybe only slightly regretting it a tiny bit. It was his “first time” too, and he really hadn’t done that much to stop it, but boy was it wonderful. “For what it’s worth, uh, I’m sorry to, I wasn’t supposed to um, do that in your mouth.” He apologized.<br>\r\n<br>\r\n “That was great!” the kitten exclaimed,<br>\r\n<br>\r\n “Really?” Randal replied, flabbergasted at this revelation<br>\r\n<br>\r\n“Yeah” Sarah said, and Randall could tell she was speaking the truth.<br>\r\n<br>\r\nRandall weighed his next decisions  carefully in his mind. He could stay here with Sarah and continue their “learning process”, or they could both head back to the ranch now at the safest time. <br>\r\n<br>\r\nRandall said <br>\r\n</span></div></div>",
            "created":1291352400,
            "id":1007230,
            "title":"Randall the Teacher?"
        },
        "1452211112":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Mora",
                "Rachael "
            ],
            "content":"<div class=\"\"><div> <span>Randal hated passing up another chance to have a tender moment with the wild and young kitten but he was not going to push his luck. Not with the thought of Sarah’s over protective sister Rachael discovering them. He shuddered again at the thought of the abrasive black cat. Randal turned away from Sarah and went for his clothes he had set on a rock nearby; they were now dry from the early morning sun and hid all signs of every being wet. Tucking himself away into his shorts, he had the slightest feeling something was different. Wait. Was his penis actually looking bigger, then before? No, it couldn’t be, unless… unless the medicine was at work again, he was still growing and even after breaking the 24hr rule too!…The pup puzzled this sight over, before a white hand pawed him from behind. <br>\r\n  <br>\r\n“Stop being so shy and get closer. I want to see it again.” said Sarah the white ball of fur eager for another chance at a sexual experience.<br>\r\n<br>\r\n“Not now. There’s a time and place for this sort of thing, and I’m afraid that what we just did was really crazy.” Randal explained to the one farm member who was well known for her craziness. He zipped his fly and picked up Sarah’s clothes as well handing them to her. “You really got me by surprise you know. But next time, I could definitely…ummm…<i>teach</i> a young miss like you anything you wanted to see.” He said bringing down the hyper active girl to a more manageable level.<br>\r\n<br>\r\n“Well, then definitely better be a next time.” she insisted dressing herself, a little saddened that this fun new game had ended so quickly. <br>\r\n<br>\r\n “There was going to be a next time!” Randal swooned over the idea in his head as they both headed for the ranch. He watched as the kitten sashayed in her shorts that clung to her backside, and stared at the notable rack that he had just seen uncovered. This would actually be fun, holding private lessons in such sessions with the cat, pretending to be a scholar on the subject of sex, but really he would be learning along with her. <br>\r\n<br>\r\nThey both reached the farmhouse which was bustling with a few other members already up. “Umm just so there are no questions, why don’t you go ahead first…” Randal suggested to the cat, holding the door open for her in true gentleman like fashion. Sarah departed from Randal and entered waving to him and giving a small wink to him as she disappeared into the house. Randal decided to wait a few minutes before entering, and found himself again on the porch swing, now in an even better mood then he’d been in this morning.<br>\r\n<br>\r\nAfter a moment, Randal silently made his move into the house sneaking towards his room not wanting to alert anyone of his presence. He was almost to his bedroom when a voice came from behind him, not really a whisper not really a shout but enough to make him freeze on the spot.<br>\r\n<br>\r\n“What are you doing up so early?” asked the voice that belonged to. <br>\r\n</span></div></div>",
            "created":1291352400,
            "id":1007403,
            "title":"Holding back and Heading back"
        },
        "14522111121":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "How about a  tittyfuck? she asked sticking out her tounge and caressed her boobs",
                "I'm all yours Randal do what you want with me.She was completey overtaken by him"
            ],
            "content":"<div class=\"\"><div> <span>“What are you doing up so early?” came the voice of the one and only boss of Las Lindas ranch Mora. In nothing but her pink night robe holding a mug of coffee in her hand she advanced towards Randall, who had been just inches away from his escaping to his bedroom.<br>\r\n<br>\r\n “What exactly are you up to my fabulous lil’ puppy?” she asked coyly. Randal still frozen on the spot, his mind racing couldn’t come up with an excuse. There was no way she could know what he had just done with Sarah was there? <br>\r\n<br>\r\nPanic set in and he forced himself to at least make some words out from his mouth “I…I.I was….”he mumbled. <br>\r\n<br>\r\n“You were just in the shower I see.” she said using her free hand and combing it through his bouffant hair. What little moisture left from the lake incident had fortunately gave him the appearance of having just showered.<br>\r\n<br>\r\n“Ah yep, got to start early this good.” grateful that his tongue would get him out of this mess. “Got to get my good looks early, don’t want to hog it for the others” he added nervously laughing and inching towards the safety of his bedroom. <br>\r\n<br>\r\n“Well you sure smell lovely!” she joked as she often did with the chic collie. She took a finger and curled a strand of his snowy chest hair, teasingly. Smiling wickedly she added “Don’t worry I won’t tell that hard ass Rachael as long as the two of you “play nice”, but you and Sarah I would never have guessed!” <br>\r\n<br>\r\nRandal’s eyes widened as he realized what she meant. She did know what they’d been up too!    “What, oh, we were just fishing…” he started attempting to regain his composure and hide the guilt from his face.<br>\r\n<br>\r\n“Randal I can put two and two together. And when it comes to you, I can see the look all over your face. Hell I even think I heard you moaning my name last night after dinner.” Mora stated a smile sneakily creeping along her own face as Randall turned bright red and shifted his gaze to the floor. “Let’s talk in private...” she added and opened the door to Randall’s small bedroom. <br>\r\n<br>\r\nGlumly he followed her as she had a seat on his bed, she motioned for him to sit too, and he complied. What was to happen to him now? Randall could only think of the worst as waited for judgment. <br>\r\n<br>\r\n“In fact, now that I mention it, I guess I kind of missed out on you huh?” she said in a much more quiet and straightforward tone. Setting her coffee aside she brushed some hair out of his face Mora went and scratched behind Randal’s ears which he absolutely loved. It seemed he could do no wrong today... <br>\r\n<br>\r\n “Mora if he’d only been a little earlier…” he started, but she placed her other hand to his lips. <br>\r\n<br>\r\nLights flickered behind the temptress eyes, “Now listen, I’m already seeing someone, so I can’t do the full nasty, but for my first childhood “husband.” I can make some exceptions.” She said. Randal nodded in mutual agreement. Eager about what was going to happen next.<br>\r\n<br>\r\n“Minos is too serious when it comes to love making, he’s never ever seen my “wild side” in the bedroom. So how about this: You show me what I’ve missed out on and I’ll give you what Minos is missing. Just this once…”  She disrobed and Randal’s eye bulged yet again at the sight of the bra-less beauty.<br>\r\n<br>\r\n He could feel himself raising to the occasion his erection growing rock hard in his shorts in a matter of seconds.   He got up and turned around, wanting to give Mora a sight that would amaze her.  <br>\r\n<br>\r\n“I’m sure I’m no Minos…” he laughed setting her up for an even greater shock when all was to be revealed. While undressing for the second time that day, he was sure of one thing he was definitely longer and larger then this morning. His own privates had grown to have the length of his arm, and a third as thick too! It arched skyward luridly as it coursed with blood, before lowering and jutting out straight in front of him. If he had to guess he’d probably say he was ten inches now, which meant there was more of him for Mora to love he was definitely not complaining <br>\r\n<br>\r\n“Well come on let’s see this thing!” Mora whispered teasing him. Randall sighed; there was no going back now. Turning around he splayed his powerful king sized penis into her view watching her face devotedly for reaction.<br>\r\n<br>\r\nInstantly a look of almost fear sprang into her brown her eyes, her jaw dropping leaving her mouth gaping. Yes this look was exactly as he’d dreamed it would be, watching her fawn over his expanding member now made things that much better! <br>\r\n<br>\r\n“Randal!” she said breathlessly obviously stunned at his size. “Randal!” again she gasped but was able to finish her sentence, “I had no idea!” Randal grinned here he was in all his naked glory in front of the just as naked Mora. Mora’s milk filled breasts looking just as luscious and tempting as they had the first time he’d begun to notice such things. He felt a deep animal instinct based joy buzzing in his body, one that hadn’t been there with Sarah. No, he had sought Mora for a long time badly, and now here she was ready for action. <br>\r\n<br>\r\nMora wrapped a hand around his member barley able to hold the entirety of Randal’s girth. “I think something like this deserves a little special treatment.” Mora said her voice as sultry and sensual as ever.  <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1291352400,
            "id":1007518,
            "title":"A morning with Mora"
        },
        "145221111211":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "“Breakfeast is ready!” Taffy’s voice rang from downstairs.",
                "“Let’s go again” Mora demanded eager for another go."
            ],
            "content":"<div class=\"\"><div> <span>Sitting seductively on the bed for Randall, Mora cupped her breasts and winked at the pup sticking her tongue out playfully at him. “How about a titty-fuck?” she asked Randall, lewdly daring him to say no. Randall’s eye nearly popped out of his head as he watched her groped her own mega sized melons<br>\r\n<br>\r\n“What? I don’t count it as cheating.” Said the brunette who had at one time (unknown to Randall) had been quite promiscuous around town. Randall was speechless now that his time with Mora had come. He simply nodded boyishly and crawled into the bed with the chocolate brown skinned bovine. He breathed in her essence, and she smelled of tanning butter and earthiness.  He kissed her passionately and deeply on the lips enjoying the warmth he felt. One kiss was all the femme fatle would allow, before she pushed Randall back with one finger to lay him down on the bed. Mora began to massage his meat between her globular bosoms. <br>\r\n<br>\r\n“Impressive!” she noted to Randall, as the tip the head of his “little man” barely poked from between her cumbersome H-cups. “Your one of the few men I know who can do that, you should be proud of that thing!” Randall was unable to hear her compliments however as he was busy being completely rolled with pleasure. He tilted his head back and forth with ecstasy as Mora continued kneading Randall’s red hot sausage. Randall felt that his whole body was warming up, no  the whole room was growing warmer from their love making meeting. He felt himself melting with pleasure as her milk filled breasts continued to envelop and re-envelop him.<br>\r\n<br>\r\n“Just a little more…” Mora whispered a knowledgeable pro for when a man was at his limits.<br>\r\n<br>\r\nFeeling himself about to explode Randall made to notify Mora of the pressing issue, but only moans of pleasure escaped from his throat. Unable to hold up any longer, Randall rocketed a burst of his white juices high into the air, continuing to cum a geyser like stream of cum.<br>\r\n<br>\r\nMora slowed testicular jiggling with a sultry smirk of satisfaction as the collie collapsed. Dazedly Randall watch as Mora withdrew from on top of him and moved to lie beside him on the bed. “Whoa! You were backed up huh?” Mora joked her face and chest covered in Randall’s jizzim. <br>\r\n<br>\r\n“Huh yeah. I guess I was. I’m um, sorry about that Mora.” he admitted embarrassed, still slightly reeling from the aftershocks of his earthshaking orgasm. No, it was more like the burning sensation when his groin grew last night.  In fact Randall carefully watched his cum covered pecker, this time as it began to swell up again, growing larger and larger,definitely bigger than it had been just minutes ago. This time physically feeling his balls began to lower and stretching from their new size and weight.   Mora who was also observing it re-enlarge was slightly drooling, eager at the thought to ride his flawless throbbing package.<br>\r\n<br>\r\nThe next sound Randall heard as the burning sensation ceased was…<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1292043600,
            "id":1013112,
            "title":"Of boners and breasts"
        },
        "1452211112111":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Taffy brazenly pressing her bunny breasts into him to get his plate",
                "Rachael’s tail tangling with his below the table"
            ],
            "content":"<div class=\"\"><div> <span>“Breakfast is ready!” Taffy’s voice rang from downstairs, causing Randall to realize where he had been before his erotic trip to paradise with Mora.  Immediately he got up from the warm bed, and instantly regretted his decision. <br>\r\n<br>\r\n“Leaving so soon?”  She asked him dishearteningly as the warmth left his body, Mora’s sad eyes watched him leave the bed and begin to get dressed. He knew if things had been different he could have lain in bed with Mora all day, and she was his to have whenever he wanted. Things weren’t different however and this secret sneaking around with the women of the ranch needed to be kept secret. <br>\r\n<br>\r\n“I’m so sorry Mora, but we really can’t get caught” he pleaded to her as he began to get dressed.<br>\r\n <br>\r\n“It’s O.K., I understand. It’s not like you’ll be going anywhere, and I’ll be right here if you need me for anything Randall. Anything.” Mora said as she pulled her beautiful nude body out of the bed. Bringing herself to Randall side, she ruffled his matted hair and gave him a sincere motherly hug.<br>\r\n“I…love you Mora” Randall blurted out in this tender moment.<br>\r\n<br>\r\n“Same here Randall.” She whispered back and gave him a kiss on the cheek. Then after the moment passed, she suddenly switched to her energetic self, slapping the puppy hard on his backside. “Now get dressed quick or we’ll both have hell to pay!” she teased and finished dressing. Double checking for any unwanted peepers outside in the hallway, Mora left Randall alone in the room to finish dressing. <br>\r\n<br>\r\nAs he headed downstairs Randall’s mind was completely preoccupied with how beautiful and thrilling his day had gone. With his bushy tail wagging with excitement Randall entered the kitchen full of life. <br>\r\n<br>\r\n“Smells good Taffy!” he said taking a seat at the table. He was the  first one to reach the table, and was happy to see that he and Mora would not have to be awkwardly lying about why they both had been late. The two were later joined by Idward, Rachael, Minos, Sarah, and then eventually Mora who had perfectly masked any sign of her recent excursion with Randall. Taffy served breakfast and everyone dug in together. Randall smiled and sighed contently as he watched this new found family of his share in the wonderful meal.<br>\r\n<br>\r\nHelping himself to the delicious breakfast he suddenly felt a new sensation stroke across his body. A feeling so noticeable it made him drop his fork.<br>\r\n<br>\r\nIt was the feeling of...<br>\r\n</span></div></div>",
            "created":1292043600,
            "id":1013209,
            "title":"We need a break. Fast!"
        },
        "14522111121111":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "Try to act nonchalant.",
                "Divert everyone's attention onto Miles."
            ],
            "content":"<div class=\"\"><div> <span>Just a few minutes after the meal began, Randall suddenly felt a soft pressure smooshing against his upper arm.  He hadn't even noticed her standing up, but Taffy was suddenly there, leaning against him with her chest pressed up against his arm as she reached out to take his empty plate.  This startled him so much, his fork slipped out from between his fingers.<br>\r\n<br>\r\nIt wasn't that she had suddenly taken it upon herself to do this.  Taffy was very much the motherly one of the 'family', always taking care of everyone else.  Nor was it that he had cleared his plate so quickly without even realizing it.  Though he had been quiet about it, his body had subconsciously devoured his breakfast with much more gusto than usual to make up for the energy he'd burned off earlier in the morning.  No, it wasn't that.  To the best of his recollection, Taffy had never been so casual with physical contact, let alone such <i>intimate</i> contact.<br>\r\n<br>\r\nIn that moment, it felt as though all of Randall's senses heightened as time slowed down.  He didn't simply feel the warmth and softness of Taffy's bosom against his arm, but also a small, stiff nub rubbing against his bicep through her shirt.  Her breath tickled his ear a little hotter, a little quicker than it would normally be, and Randall thought he heard her inhaling deeply as if to drink in his scent.<br>\r\n<br>\r\nHer own was intoxicating.  Delicate and womanly, the shampoo she'd used gave one's senses the hint of a flowery meadow, accentuating her natural scent instead of overpowering it.  Whether he was imagining it or not, every signal told the collie that Taffy was offering herself to him, and his body responded in kind by leaning into the contact as he felt his swollen cock come to life yet again and creep down his leg.<br>\r\n<br>\r\nUnfortunately, as perfect as the moment felt, it couldn't be stretched out indefinitely.  All of a sudden, the fork hit the floor with a clatter, sending the flow of time rushing back to its regular speed and drawing the attention of the rest of the table.  As all eyes turned in their direction, Randall was suddenly immensely grateful for the presence of the table between those eyes and his erection.<br>\r\n<br>\r\nBlushing noticeably, Taffy nevertheless laughed and said, \"I'm sorry, I didn't mean to startle you.  I just saw you were extra hungry and wondered if you wanted seconds.\"<br>\r\n<br>\r\nMiles piped in by asking, \"Is that why you're practically giving him a lap dance?\"  There was no small amount of bitterness in the cat's voice when he spoke, particularly when he muttered under his breath, \"Talk about barking up the wrong tree...\"<br>\r\n<br>\r\nThis heckling made Taffy tense up, and though she probably wasn't aware of it, the sweet bunny clung to his arm.  While it was common knowledge around the farm that she and Miles had dated, the circumstances of their breakup had been too sore a subject for Randall to try to bring up.<br>\r\n<br>\r\nIt felt as though a cold wind suddenly blew through the dining room.  Sarah and Mora were both looking at him and Taffy with an intense stare.  Rachel seemed more bemused than anything, Minos quietly arched an eyebrow in curiosity.  Ironically, out of all of them, Idward seemed to be the closest to action, the little white fox practically ready to spring out of his chair in defense of his friend, Taffy.<br>\r\n<br>\r\nDespite the sudden combination of tension and arousal brought on by Taffy's uncharacteristic closeness, Randall knew he had to act quickly.  How best to deal with the situation?</span></div></div>",
            "created":1296277200,
            "id":1044010,
            "title":"Hungers"
        },
        "145221111211111":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Her bedroom wanting this to be something really special. ",
                "The bathroom to hide their love making the fuffy pair take a sexy sensual shower"
            ],
            "content":"<div class=\"\"><div> <span>The pause had lasted far too long to be comfortable so Randall had only an instant to play off Taffy’s brush up. Quickly his brain gave his mouth the words.<br>\r\n <br>\r\n“Th-Thanks Taffy, but you out to warn a guy, you gave me quite the surprise. Fabulous breakfast all the same though!” He sang in his sunny and perky voice acting as nonchalant as possible. This was the cheery Randal the house knew and the rest of the table returned to their breakfast satisfied with the explanation for the incident. The looks of envy left the faces of the other women, and Miles gave one last envious glance before returning to his food.<br>\r\n<br>\r\n“…Yeah, I’m uh, sorry about that I must have tripped or something. I’m glad you like it though.” Taffy said looking like she had snapped from a trance.  “Oh, here let me get you fork.” She bent down under the table to retrieve the utensil. Randall realized he was still fully aroused and couldn’t stop her before what she might see next. Maybe she wouldn’t notice? <br>\r\n<br>\r\n<i>Down boy!</i> he willed himself, partially knowing it was useless to try and tame his rock hard erection which stood fully aroused and now rising in length to near his knees. As she handed him the fork a look of amazement was all over her face, as it was her turn to be startled. And Randall wasn’t sure but that might have been drool, forming at her mouth. <br>\r\n<br>\r\n“Thanks…” he said taking the fork from her outreached paw. He was sure that she’d noticed the tent he was pitching, that outline of his organ sticking out tightly against his pants. <br>\r\n<br>\r\nShe returned to her place at the table, and everything returned to normal as the incident faded from everyone’s minds. Randall tried to enjoy his second helpings but he found the bedroom eyes glance he was getting from Taffy were distracting him. He decidedly ate slower than the rest, until he had fully settled down; finally finishing as Taffy was clearing everyone’s abandoned table places. He knew what he had felt from her, and he could only watch in anguish, a she coldly carried the dishes to the kitchen and the Digit powered dishwasher. Stricken over the sight of the bunnies’ bouncy and delicious looking behind, Randall saw his chance to make a move and took it. Now doing nothing but letting his body take control, he snuck up from behind her feeling his heart race, feeling like a wolf about to pounce upon the defenseless rabbit. Randall felt he could do no wrong, here after such a thrilling morning iit appeared he was going to greedily gobble up Taffy. Silently he snaked his arms around her and closed in quickly into a reverse hug. She gasped obviously caught in surprise by this act. The she relaxed realizing it was Randall who had locked her in his sculpted arms. <br>\r\n<br>\r\n“I wanted to say sorry for that little scene, but I don’t think the others would have understood.” He halve whispered have hummed into her ears. <br>\r\n<br>\r\n“Randall, we... I…Randall I’m sorry. I don’t know what came over me! It was just, a spur of the moment thing.” she started to apologize; Randall could feel how she was tensing up.<br>\r\n<br>\r\n Now he felt words spill from his mouth, words he’d always wanted to say to Taffy, but always kept hidden. Perhaps the morning’s erotic events had freed them, or maybe the medicine itself, whatever the cause, he poured passion into every word. He lowered his voice even more to both calm her and drive her wild at the same time. <br>\r\n<br>\r\n“Hmmm, well, to be quite honest, I’ve always felt the same I mean about you, Rita.” He rolled the R in Rita as a sign of his desire, only elevating tensions by calling Taffy by her real name. “I’m glad you wanted something more. I think we’re lucky the whole house is empty for a change, because it’s time I returned that brush up you gave me.”  <br>\r\n<br>\r\nRandall could feel himself swelling with blood again, and he pressed himself tightly to Taffy’s backside so she could feel it too, feel the life within him, feel how badly he wanted her right then and there .. His pants strained to the threadbare as he swelled impossibly big with overflowing passion. If she wanted him to stop she gave no sign letting only a sign of pleasure escape from her lips. He squeezed in closer making sure she could feel his unbridled ache for her that was mounting in his nether regions.  Now with only thin fabrics separating his sturdy tip from her tail, she quivered in his arms at the sensation of his monstrously over-sized sex. He buried his nose into her cotton candy hair; it was his turn to take in her essence. His hands locked firmly underneath her matronly breasts, he could sense both of their hearts beating in time, both of their breaths quickening in lustful anticipation of what they both hungered for next. Randall wished with all his might that this magical silence would last forever, a lifetime with Taffy right here in his arms, but her voice panted out two words that broke the magic silence  <br>\r\n<br>\r\n“N…not here.” She whispered softly.<br>\r\n<br>\r\n“I, I don’t think I can wait” he said lustfully letting the words vibrate in his chest letting her back feel every syllable. <br>\r\n<br>\r\n“I know...but just not here.” She pleaded with him never rising above a whisper, her voice full of want.<br>\r\n<br>\r\n Immediately she took his furry black paws into her own gray dainty ones and led him at a breakneck pace out the kitchen. Randall realized she was leading him to…<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1297832400,
            "id":1054807,
            "title":"Hidden Feelings Going Down the Rabbit Hole"
        },
        "1452212":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "He's stuck here like it or not, but now someones coming towards him.",
                "He loses consciousness and ends up somewhere else. "
            ],
            "content":"<div class=\"\"><div> <span>Kicking in his sleep Randall tossed and turned in his bed, as the bubbling bubbling brew coursed through his body. As a side effect from the meds Randall began having a dream that felt more real than he could ever imagine. <br>\r\n<br>\r\nHe found himself in his own body, but completely naked. Taking in his surroundings he realized he was now in a barren arctic tundra. Turning around he came face to face with a sign painted with a  picture of a gigantic purple furred spotted leopard and a single word...\"Tila's.\" The sign pointed outwards to a large inn that looked full of warmth and light.<br>\r\n<br>\r\nNot understanding any of his surroundings Randall could feel his dream-self suddenly slip away. As his vision faded to black Randall realized he had to choose whether to fight the urge to black out and remain here to explore further, or give-in and hopefully wake up somewhere else, preferably someplace less cold.<br>\r\n</span></div></div>",
            "created":1290574800,
            "id":999977,
            "title":"Randall's Dream"
        },
        "14522122":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "Yes, he manages to stay here and is greeted by Geecku.",
                "Somewhere else yet again."
            ],
            "content":"<div class=\"\"><div> <span>Again the medication takes hold of the dreaming dogs sleeping mind and soon Randall awakens this time again naked in the midst of a tropical jungle haven. Seemingly untouched by human hand the forest sprigged forth with life everywhere. Plants grew all over the place, looking healthy and strong, bursting with exotic greens and other colors the likes Randall had never seen before.Bird calls echoed through the high tree tops, and vines draped the canopies above the collie. The air around him was fresh like after a summer’s rain, and smelled of fresh fruits both sweet and tart in nature. Little did he know it but he was in the home of the hyper-sexual forest goddess of life herself Geecku.  <br>\r\n<br>\r\nAs he was enjoying the sensation of the warm balmy atmosphere of the jungle exuding onto his bare fur and privates, Randall began to feel dizzy. Oh No! He was slipping again! Not now, he liked it here! Did he manage to stay this time?<br>\r\n<br>\r\n</span></div></div>",
            "created":1290574800,
            "id":999986,
            "title":"He loses consciousness and ends up somewhere el..."
        },
        "145221221":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "Be more active, but continue enjoying the comfort of the jungle floor.",
                "Take charge on top."
            ],
            "content":"<div class=\"\"><div> <span>The lush foliage shimmers and starts to fade away around him, but this time Randall is able to keep his head together.  Rather than waking up in his own bed or some other unfamiliar locale, the nude collie continued to feel the hot jungle air on his naked body as the rest of the world settled back into place.  Once that was settled, he could barely look around and convince himself that he was actually dreaming.  Every sense, from the dirt under his paws to the scent of plant life told him that he had been transported to an Eden-like paradise.<br>\r\n<br>\r\nTo test it further, he spotted a tree with branch bowed low and heavy with large, apple-like fruits.  Stretching up onto his tip-toes, Randall plucked one and turned it over in his hand a few times before taking a small bite.  His eyes immediately widened with surprise.  Normally, whenever he dreamed about eating, it would always end up tasting rather unfortunately like the corner of his pillow.  Even in his waking hours, however, he had almost never tasted anything as sweet as what he held in his hand.  Still not sure he could believe it, he took another bite, and then another.  It was so ripe and juicy that the sweet nectar inside dribbled down his chin and onto his fluffy chest.<br>\r\n<br>\r\nBy the time he ate the fruit down to its core, the collie was in bliss.  Even if it <i>was</i> a dream and his body was still in bed with drugs coursing through his system, it was by far the most beautiful, most vivid dream he had ever had, and he intended to enjoy it to its fullest.  First, he would pluck another of those fruits, but as his fingertips brushed its colorful skin, he suddenly froze when he heard a rustling in the branches behind him.<br>\r\n<br>\r\nSlowly, without moving the rest of his body, Randall turned his head to glance over his shoulder.  He could see a single branch moving in the trees, and a large shadow that leaped out of sight the instant he caught a glimpse.  It was the only other creature he'd seen aside from the birds chirping overhead, but it suddenly dawned on him that if <i>he</i> found this place a paradise, other animals would as well.  Still, perhaps it was nothing to be worried about, and as long as he caused no harm and respected the nature around him, nothing would happen to him.  Of course, if he was dreaming, the very worst that could happen would be getting startled into waking up.  On the other hand, everything felt so very, very real...<br>\r\n<br>\r\nHe waited for what felt like several minutes, but heard and saw nothing else from the mystery creature.  Most likely, it had moved on or settled in somewhere to nap.  With a soft sigh, Randall chuckled to himself and pulled the fruit down.  Taking a bite, he turned to find a soft spot to sit when he suddenly found himself face-to-face with a grinning lizard!<br>\r\n<br>\r\n\"Hiya!\" she exclaimed while the collie tried not to choke on fruit in his mouth.  Instead, he simply staggered back a step, caught his ankle on a root, and tumbled down onto his backside.  Though his landing felt soft, it still seemed like something that should have shocked him awake.  Not that he had much time to think on it before the lizard got down on all fours and was soon hovering over him.<br>\r\n<br>\r\nShe was dazzlingly colorful, green and yellow scales marked with purple stripes, and a lovely, cheerful face framed with long blue hair.  Her figure was lean and athletic.  An acrobat's body, which exuded energy and motion even when she didn't seem to be moving much at all.  Looking deep into his eyes, he heard her say, \"Oooh, you're pretty,\" as a mischievous gleam reflected in hers.  \"And messy,\" she added, leaning in to lick some of the remnants of fruit juice from his chin.<br>\r\n<br>\r\nAs his heart pounded, Randall felt a surge of heat in his loins.  He could feel his cock swell with desire, its length sliding its way down to his knees before it grew hard enough to start curving up.  The lizard girl suddenly let out an 'ooh' of surprise and giggled when they both looked down to see what was suddenly poking her stomach.  Even Randall was surprised, having paid too much attention to his surroundings to notice the thick sausage and fat balls that had been dangling between his legs.  Already it seemed to be over a foot long with a head as thick around as his wrist, and yet it was <i>still</i> bloating and stiffening further!<br>\r\n<br>\r\nWith a delighted squeal, the lizard straddled Randall's legs and held his growing dick upright, stars in her eyes.  \"Ooooh, ~Geecku knows what yoooouuu waaaant~\" she exclaimed in a sing-song voice.  \"Soooo big and heavy!  Geecku's never seen one so big on such a pretty puppy!\"  Just the sensation of her hands trying to wrap around his massive meat and falling short sent a surge of heat and size rushing through his loins.  Geecku watched, enthralled, as it inched up and up, finally cresting at a very solid, throbbing fifteen inches just shy of reaching her lips.<br>\r\n<br>\r\nRandall was panting on the ground.  Never had he felt more powerful than when seeing his mammoth endowment being fondled so enthusiastically without even having to ask for it, and yet at the same time he was completely at her mercy.  It wasn't that he <i>couldn't</i> move, but after fantasizing so long about just this situation, the collie's mind was reeling at actually getting to experience it.  Especially when she started sloppily, feverishly kissing the head of his monster.  Her long, nimble lizard tongue slithered out and slid down his length, making him moan and writhe under Geecku while her saliva and his precum gradually got the mighty shaft slick enough to stroke with her hands.<br>\r\n<br>\r\n\"Oohhhh...\"  His fingers dug into the soft earth beneath him as his body squirmed in ecstasy.  This feeling was even better than he'd imagined!  Like the pleasure center of his brain was wired to every single cell of his dick, making it a wonder that he didn't simply explode from an overload of sensation with every cock-worshiping touch of her lips and fingers.  \"You're... Geecku?  I'm... Rrrandall... very... hah... pleased to meet you...!\"  No reason not to be a gentleman, after all, especially to the woman giving his newly powerful penis its first test drive.<br>\r\n<br>\r\nGeecku giggled, running her lips down the sensitive, bulging underside of his dick, then back up again to wrap her lips around as much of the thick head as she could before pulling back.  \"Hehee, Nice ta meetcha, randy puppy!\"  While she spoke, her tail came around and tickled his bloated balls, each of which felt like it was going to explode.  But whereas this had been meant in a violently literal way after taking the formula, now it was pure pleasure.  \"Mmm, Geecku wants this stuffed in her baaaaad.  Is randy puppy just gonna lie there?\"  Her tone was lightly teasing, but also a challenge to Randall, who took a deep breath and grinned up at her.</span></div></div>",
            "created":1290834000,
            "id":1002924,
            "title":"Jungle Fever"
        },
        "145221222":{
            "author_id":"director714",
            "author_name":"wowee",
            "choices":[
                "He was still there! Randal's going to be the big man on campus.",
                "No! He's slipped into another dream again! (What was in that stuff?)"
            ],
            "content":"<div class=\"\"><div> <span>Recovering from the dizzy spell, Randal found himself on a high hilltop overlooking what looked to be a small town. Randal peered closer and realized it was a college campus. Judging even further, he could tell it was apparently the same one Miles had attended, this assumption going off what Miles had told him about his college days. Miles had often reminisced melancholies of his days as a college student to Randal, but Miles was always sure to end up on one topic by the end of the night: the college girls.  Miles went on and on about the beauty of his co-eds, and Randal would always become enthralled in such stories about the lovely women. The perky Traci, the popular Vixy, the country girl Ann, and the rising star Hope; along with many other women Miles had described somehow Randal knew they would be in that campus below him waiting for him and him alone.  <br>\r\n<br>\r\nRandal’s body seemed driven by his libido as he made his way downhill towards the center of campus. Blood rushed to his head as he ran down the hill at a breakneck pace. A ringing started up in his ears as he felt the all too familiar feeling of slipping from a dream. This was too cruel now. He’d been cock blocked by many women before but never by his own dreams! It was too much for the dog to take, he was going to do everything in his power to stay in this dream right here. Randal stopped, took a deep breath closed his eyes and concentrated. When he opened them…<br>\r\n<br>\r\n</span></div></div>",
            "created":1290574800,
            "id":999999,
            "title":"College Campus Collie"
        },
        "1452212221":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "An incredibly buxom redhead (Ann)",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When he opened his eyes he was delighted to see that he was still on the campus and even more delighted to see the numerous beautiful women on the campus with him. Both excited and horny Randal walked up to the first girl he saw...</span></div></span></div>",
            "created":1418061300,
            "id":1899510,
            "title":"He was still there! Randal's going to be th..."
        },
        "1453":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "He grows them naturally",
                "He gets special breast implants",
                "An extremely fat farm member has some of their fat put into Randal's chest"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Rannie get his lovely boobs?</span></div></span></div>",
            "created":1269579600,
            "id":857104,
            "title":"Breast expansion"
        },
        "15":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Shin Aryoko",
                "Tobias \"Toby\" Wainwright",
                "Davin Preacher",
                "Kayin Ravenhurst"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps instead you'd prefer one of Miles' college friends? Or perhaps Grace's handsome husband Kayin?</span></div></span></div>",
            "created":1220072400,
            "id":630076,
            "title":"Other"
        },
        "153":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, you've chosen the attractive popular guy Davin? Good choice! Let's see how much more attractive we can make him!</span></div></span></div>",
            "created":1220158800,
            "id":576813,
            "title":"Davin"
        },
        "1531":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Forcefeeding",
                "Overeating",
                "Special motive"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How/why is he gaining?</span></div></span></div>",
            "created":1282626000,
            "id":942629,
            "title":"Weight gain"
        },
        "15313":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Fat is what's in and he needs to keep his girls impressed",
                "Sport change--from football to sumo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's his reason for gaining?</span></div></span></div>",
            "created":1282626000,
            "id":942630,
            "title":"Special motive"
        },
        "153131":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Take it nice and slow",
                "Get huge, ASAP!"
            ],
            "content":"<div class=\"\"><div> <span>Davin... Quarterback, Captain, Legend... and by legend I mean his Jock culture was replaced by the newer kind, the Larkson culture. <br>\r\n<br>\r\nWhat was once seen as a tragic accident in the attempt to use nano-zells to naturally improve the physical body, an overweight dragon-prime scientist named Richard Larkson has grown massive and make his original body more rotund than before. At first, it seem to be the completely opposite of what was hoped for until Richard discovered that his muscle strength has increased 6 times. With some modifications, Richard tries to commercialized the new body enhancement by testing it on a willing football team, The Raging Grunts, which is often considered one of the worst teams in all of Prism. From the ten games that were played, judges along with the spectators have often mistaken the Grunts as a derailed freight train crashing into the opposing teams. The new enhancement was so powerful, that anyone who uses it have to be in an entirely new league.<br>\r\n<br>\r\nWith great power comes even greater popularity as the hulking jock's giant bellies lured girls as giant boobs lured men. The only way for Davin to keep his girls from deviating away from him is to do the same!</span></div></div>",
            "created":1282712400,
            "id":944245,
            "title":"Fat is what's in and he needs to keep his g..."
        },
        "1532":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Air",
                "Helium",
                "Water"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What would you like him to be inflated with?</span></div></span></div>",
            "created":1220158800,
            "id":576820,
            "title":"Pumped and Popular"
        },
        "15322":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Miles",
                "Angel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will inflate Davin?</span></div></span></div>",
            "created":1220158800,
            "id":576823,
            "title":"Helium"
        },
        "1533":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Butt expansion",
                "Fruitification",
                "Last two options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices for the hot raccoon.</span></div></span></div>",
            "created":1239771600,
            "id":676605,
            "title":"Other"
        },
        "15333":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "Muscle Expansion",
                "Genital Expansion (penis and/or balls)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Even thou his the perfect jock with a great body and 3 girls to please, he still wants more!</span></div></span></div>",
            "created":1342155600,
            "id":1377975,
            "title":"Last two options - Expanding his own vanity"
        },
        "153331":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "Muscle expansion",
                "Muscle penis and ball expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why have one when you can both.</span></div></span></div>",
            "created":1383194100,
            "id":1686593,
            "title":"Why choose"
        },
        "1533312":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "Magic or Science",
                "special substance"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What gives Davin his newer upgraded appearance?</span></div></span></div>",
            "created":1387082580,
            "id":1707808,
            "title":"Muscle penis and ball expansion"
        },
        "15333122":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "liquid",
                "pill"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Davin get his hands on a new substance while at Pariso as well as most of the men working or visiting there. What form does it take?</span></div></span></div>",
            "created":1387083180,
            "id":1707812,
            "title":"special substance"
        },
        "153331222":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "The Pill takes immediate effect",
                "it takes some time"
            ],
            "content":"<div class=\"\"><div> <span>Davin enters his quarters at Pariso and on the table he finds a box with a card that says to Davin. He comes up to the the table and opens the box and finds a singular pill. He notices a glass of water next to the box. He decides \"what the hell' and takes the pill then down the water.</span></div></div>",
            "created":1388550780,
            "id":1718622,
            "title":"pill"
        },
        "153332":{
            "author_id":"dragos12",
            "author_name":"finalsword",
            "choices":[
                "Nanozells",
                "medication"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of Davin's best features gets an upgrade, but does he do it?</span></div></span></div>",
            "created":1383194280,
            "id":1686594,
            "title":"Gets a Boost"
        },
        "154":{
            "author_id":"strfxace",
            "author_name":"Metalmonster",
            "choices":[
                "Kayin Ravenhurst",
                "Sage Freehaven",
                "More Characters"
            ],
            "content":"<div class=\"\"><div> <span>Since the character list is rather short, so from here you can either choose Kayin, or pick from others... That you would have to add, of course.<br>\r\n<br>\r\nSo do you choose Kayin, or maybe you would like to pick Sage Freehaven, Tila's business partner/boytoy, (Hey, he's an official character, after all,) or someone else entirely?</span></div></div>",
            "created":1296536400,
            "id":1045921,
            "title":"Kayin, or More?"
        }
    },
    "info":{
        "author_id":"theswedishelf",
        "author_name":"TheSwedishElf",
        "brief_description":"A little treat for those who want to see the men of Las Lindas expanded.",
        "created":1220086620,
        "description":"<td align=\"left\" class=\"norm\">This is the only expansion story for the male characters of the furry webcomic Las Lindas. There are four characters that will be focused on, though more may be added later on: <br>\r\n<br>\r\n- Minos: Mora's on-and-off boyfriend, and the object of Rachael's affection. A bull, very tall and muscular, does most of the farmwork. He is also one of the Crests, like Ambar, Geecku, Grace and Kate, and is therefore several hundred years old, and has collected more wisdom and experience in life than anyone else at the farm can imagine. Lately, he's been showing alot more interest in Rachael and seems to be getting tired of the way Mora treats him.<br>\r\n<br>\r\n- Idward Focks: Mora's ex-boyfriend who still obsesses over her. An arctic fox, rather short, skilled at writing romantic novels. He also love Dungeons and Dragons, and frequently plays it with Taffy, who seems to have become very interested in him. Overall very nerdish and creative, so much that Sarah wants him to be her teacher. His one big flaw, however, is that he's a relentless stalker, and is oblivious to Taffy's feelings for him due to his unhealthy obsession with Mora, whom he dated for about three days just over two years ago.<br>\r\n<br>\r\n- Miles Lionheart: Taffy's ex-boyfriend. A cat, very arrogant, narcissistic, unmotivated, and a shameless lecher. Despite his massive faults, he has been shown to be intelligent when it comes to machinery.<br>\r\n<br>\r\n- Randal Hawthorne: Mora's adopted brother who takes care of the farm's orchards. A border collie, he's a true gentleman, and incredibly girlish. He's the subject of almost as many sexual orientation debates and jokes as James from Pokemon. He loves cooking, but tends to make everything way too spicy, and is secretly in love with all four of the girls on the farm.<br>\r\n<br>\r\nHere's what expansion types the stories will focus on:<br>\r\n<br>\r\n* Weight Gain<br>\r\n* Inflation<br>\r\n* Butt Expansion<br>\r\n* Fruitification<br>\r\n* Muscle Growth<br>\r\n* Penis Expansion<br>\r\n<br>\r\nAnd here are some rules for this story.<br>\r\n<br>\r\n1. Feel free to mix expansion types within one storyline, but try to keep the main focus on the type that was originally chosen.<br>\r\n<br>\r\n2. No insanely fast or half-assed growth.<br>\r\n<br>\r\n3. USE PROPER SPELLING AND GRAMMAR SKILLS. I cannot stress this rule enough!<br>\r\n<br>\r\n4. Females getting expanded within a male's ongoing story are technically allowed, but options for female characters to be expanded on their own will be deleted.</td>",
        "id":1468200,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1564309560,
        "modified":1564309560,
        "pretty_title":"Las Lindas Male Expansion"
    }
}