{
    "chapters":{
        "1":{
            "author_id":"acme",
            "author_name":"Acme",
            "choices":[
                "Fenwick Potts (oxen)",
                "Krista Layland (Archaeologist)"
            ],
            "content":"<div class=\"\"><div> <span>Kaliko's feral eyes took in the carnage of his fallen friend's body, whilst his senses screamed around the sewer system like an occult Geiger-counter; nothing.  This place was clean, well, maybe not in the traditional sense of the word, he mused, moving his feet out of the stream and onto the maintenance walk-way toward John's corpse.<br>\r\n<br>\r\nHe stooped, and, if he had been alive, John may well have been amused to note the fleeting look of sorrow shadow the RatMan's face, before, once again, the Demon Hunter shoved all fancies aside and looked for clues.<br>\r\n<br>\r\nClues were funny things, Kaliko thought as he methodically emptied John's pockets of all identifying paraphernalia.  You never really knew they were clues until they were finished being clues.  Take the soft, green, glow on the brick work where the Dragon Demon had tried to come through; was it simply evidence of phosphorus life in these inhospitable depths, or was it some mystical, occultish, weird thing that would have his internal detective nodding wisely later on?  Who knew?  Not, him.  Anyway, it was time to leave John to Kaliko's eager, hungry, brothers; quite a few rats had sent out word there was a banquet in the Main Junction Sewer at the top of the Tottenham Court Road.  Kaliko needed his own sustenance, but had a tough choice of where to go.  <br>\r\n<br>\r\nFenwick Potts, might have some new leads for him on the timing and where-abouts of the next portal opening for Dragon Demon; but, Krista Layland, the Archaeologist, might have come up with the goods on 'Buddah's Party Bowl', the mystical holy grail of the east, which the bearer of could issue in an age of peace... or, an age of destruction.</span></div></div>",
            "created":1199553540,
            "id":484022,
            "title":"No more John"
        },
        "11":{
            "author_id":"acme",
            "author_name":"Acme",
            "choices":[
                "Krista Layland (Archaeologist)",
                "Rabbit  Girl"
            ],
            "content":"<div class=\"\"><div> <span>Kaliko went into Fenwick's \"home\" alone.  It was a strange place, full of used up bits of London.  Here lived the Ox Fheldren; a human hybrid of Buddha's Chinese calendar animals.  There were nine other's out there, somewhere, and he needed to find them all as soon as he could get his hands on Buddah's Party Bowl.  Without it, he doubted there would be much of a world left for the <i>real</i> humans...<br>\r\n<br>\r\nHis rat-like eyes worked best in the dark, and easily picked out a route among the organised chaos of one of the worlds leading Demonologists.  Kaliko treated his friends renowned status as \"cheating\" - Potts was half-demon, like Kaliko; but Kaliko didn't go around being the worlds leading authority on Rats, did he?  All his thoughts were brought back to his purpose here when his eyes fell on the delicate, and heavily detailed, map of the Dragon Demon's Lair, unrolled on Fenwick's desk.<br>\r\n<br>\r\n\"Don't bother trying to read it, Kal - it won't make much sense,\" rang out the rough, short tones of his fellow Demon Hunter, associate, and, if Kaliko had been inclined to feeling anything much more than a permanent need to feed and urinate, his best-friend.<br>\r\n<br>\r\nKaliko grunted and pushed the scroll away, turning instead to face the half-bread who seemed to fill the room with his bulk.  He wasn't as tall as Kaliko, but he was broad.  Not broad like a fat man, but broad like a brute; a Desperate Dan, or a Bluto.  The tiny sliver-plated spoon he stirred his tea with looked like a dolls, and he a giant who should posses a harp and a goose.<br>\r\n<br>\r\n\"Any idea where the next portal opening is?\"  he asked, without formality.<br>\r\n<br>\r\n\"Bit of a funny one, this...\"  Potts moved across and picked up the scroll with surprising agility, \"Ah, here we are!  Moon in the Seventh Sector, Pig in the Rice Fields... yes!  Here it is.  There are two possible portals, and they are moving very closely; <i>he</i> must be stepping his game up now we're on the hunt for the Party Bowl, before the conjunct of the Zodiac...\"<br>\r\n<br>\r\n\"Any time soon would be great, Fen.\"  Kaliko mentally nudged his friend, who had grown quiet and seemed to have forgotten his sentence.<br>\r\n<br>\r\n\"Mmm, sorry; just thinking.  They are so on top of each other, that you'll have to take a stab at which one to try and head off first:  One at the Museum, where that Archaeologist  of yours works, and the other's heading toward the Docks where Rabbit is...\"<br>\r\n<br>\r\nFenwick Potts turned around when Kaliko didn't reply.  He sighed and shook his head,  there was no-one there; the RatMan had some hunting to do.</span></div></div>",
            "created":1199630520,
            "id":484025,
            "title":"Fenwick Potts (oxen)"
        },
        "111":{
            "author_id":"acme",
            "author_name":"Acme",
            "choices":[
                "Help the guard",
                "Escape through the window"
            ],
            "content":"<div class=\"\"><div> <span>Krista Layland worked far later into the evening that she had intended to.  By the time she was ready to clear away all the exhibit cleaning trays, soft bristle brushes, and ambient temperature storage devices, associated with the cataloging project, everyone else had gone home; leaving her and Grahame, the Museum night watchman, alone on the premises.<br>\r\n<br>\r\nIt was, therefore, quite a jolt to come nose to nose with Mr Jones, the International Arts Dealer (<i>my arse</i>, she added silently), who had introduced himself to the department last week.  His youthful expression seemed to twitch, as he examined her, and she reasserted her 'personal space' by taking a step backwards.<br>\r\n<br>\r\n\"Got any further with that ancient text, Miss Layland?\"  Kalikos quick, soft tones, spat out.<br>\r\n<br>\r\n\"Oh, and 'hello, to you too,' Mr Jones.\"  <br>\r\n<br>\r\nShe made her way around to the safety of her desk; something about the... <i>man</i>? gave her the creeps.  His eyes were so black as to give the impression of sucking the life out of a room or, at least, the light from it.<br>\r\n<br>\r\n\"Yes.  Hello.  Have you got any further with that ancient text, Miss Layland?\"<br>\r\n<br>\r\nSmiling, she shook her head at his social skills and shook her sleeping laptop awake too.  He came to stand around the back of her chair, and she shuddered with the oppressive sense of him looming over her.  Odd, really; she supposed he <i>should</i> be  handsome with his light, long frame, jet black hair, and alabaster skin, but it just didn't sit well on him.  She scrolled through her desktop and located some files, as she considered him more.  It was almost as if... if you squinted your eyes, turned around really quickly, and tried to focus past him, you might just discover that he wasn't quite human.<br>\r\n<br>\r\n\"Is that it?\"<br>\r\n<br>\r\nHis voice dragged her back to reality and she moved the cursor back up the page until its little arrow rested on the image of a badly aged piece of script; middle east or, far eastern in origin; it was hard to tell with the age of the artifact and the patina of dirt which had amassed.<br>\r\n<br>\r\n\"Yes; this is it - well, based on your rather hazy details surrounding its specific use and origin.\"  She hoped he understood the reprimand in her voice.<br>\r\n<br>\r\n\"Well?\"  he asked, softly.<br>\r\n<br>\r\n\"Well, what?\"<br>\r\n<br>\r\n\"Well, where is it?\"  he smiled, for the first time she had seen it, and it was all wrong; like he was.<br>\r\n<br>\r\n\"Its actually here, in this Museum.  Lord knows how it managed to ellude classification, but not anymore!\"  she smiled, triumphantly, and waved a fresh catalogue of exhibits at him.  <br>\r\n<br>\r\nShe didn't expect his response.  With lightning reflexes he pinched the catalogue out of her grasp and his eyes flicked over it with more twitches that before.  Then he spoke, with a quiet urgency which chilled her to the bone:<br>\r\n<br>\r\n\"And this is now <i>public</i>?\"<br>\r\n<br>\r\n\"Yes,\" she said, not understanding but catching the smell of fear in the air.<br>\r\n<br>\r\nWith death knell timing, the tinkle of broken glass echoed up from the deserted corridor beyond Krista's office, and a strangled scream surged into their ears, freezing them to the spot for what seemed like minutes.<br>\r\n<br>\r\n\"Come with me, now.\"  Kaliko stated, catching hold of her arm and pulling her toward the window.<br>\r\n<br>\r\n\"No!  We can't just leave him...\"</span></div></div>",
            "created":1199638200,
            "id":484087,
            "title":"Krista Layland (Archaeologist)"
        },
        "1111":{
            "author_id":"acme",
            "author_name":"Acme",
            "content":"<div class=\"\"><div> <span>Krista broke free of Kaliko's grip and raced out into the corridor;  the sounds of agony were still issuing from somewhere up ahead, and she now she could hear the swift footfall of Mr Jones joining her.  He would have left him, she realised, as her feet found the familiar pace her endless work-outs around Hyde Park had added to her stunning figure.  No one human, who had heard that cry would have left a man to his fate.<br>\r\n<br>\r\nThen she knew why.<br>\r\n<br>\r\nHer sneakers squeaked to a halt on the highly polished Museum floor.  There, right ahead of her, was the writhing, not-quite-dead-yet, form of Grahame.  Only the uniform identified him as his head was little more than mangled pulp from which some dark mass was emerging.  Something blacker that Mr Jones' eyes; something blacker than the nightmares of her soul, and that something, was bored of its toy and was now looking straight at her.  Not with eyes, for she couldn't see any in its moving darkness; but with intent, and she felt her limbs leaden with a fear she could never have imagined.<br>\r\n<br>\r\nA new flurry of activity caught her attention as Kaliko whipped past her and, to her disgust, made straight for the oozing body of the night watchman.  He seemed to be saying a series of words over him, and moving his quick little hands in a baffling series of strange gestures.  As he made to pick up the body and hurl it at the midnight-evil entity, she came to her senses and willed her limbs to move.<br>\r\n<br>\r\n\"Don't do it!\"  Kaliko cried, aware of her intent to intefere, \"I have to stop it and this mans dying pulse can rid us of it.\"<br>\r\n<br>\r\nHow could she?  How repugnant was the thought of dear old Grahame being <i>fed</i> to this monstrous form, and defiled by this inhuman animal in the process.  Ignoring his obvious strength advantage, Krista propelled her self at the corpse laden form of Kaliko and thundered into him with a resounding, thwack.  He crumpled under the guards weight and her strange trajectory took her beyond the men; but not out of the reach of the monster which was still growing in darkness and mass.<br>\r\n<br>\r\nIf it were sentient, then it was clever.  It moved rapidly toward its biggest threat, Kaliko, and, with an earsplitting scream from the attacked, it ripped at his legs with unseen claws.  Before she could realise the peril of her recent choices, Krista watched helplessly, as the one man who seemed to understand the evil force, was taken into a black maw and spat out lifeless.<br>\r\n<br>\r\nSlowly, the creature turned its attention to her...<br>\r\n<br>\r\n</span></div></div>",
            "created":1199640180,
            "id":484112,
            "title":"Help the guard"
        },
        "1112":{
            "author_id":"acme",
            "author_name":"Acme",
            "choices":[
                "Goat Man",
                "Rabbit Girl"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, yes we can!\"  <br>\r\n<br>\r\nKaliko tightened his grip on Krista's arm before she could protest and hoisted her out the window.<br>\r\n<br>\r\n\"Where do you think that Guard was?\"  he questioned, although his eyes seemed to be focused on some kind of internal map, and she was pretty sure he would know more regarding the whereabouts of Grahame's attacker, than the man himself.  Not waiting for a reply he went on:<br>\r\n<br>\r\n\"Just stay here, or die - it really is as simple as that.\"  <br>\r\n<br>\r\nAnd then he was up, back through the window and she listened as his footfall fell quickly out of earshot.<br>\r\n<br>\r\nKrista thought about going back through the window, but her internal flight, or flight response had <i>definitely</i> chosen the 'flight' option, now that the air around her was eerily absent of any screams... or any other noise, for that matter.<br>\r\n<br>\r\nShe began to feel a little bit silly.  Here she was a fit healthy, young, attractive, and intelligent young woman; who was currently crouching in fear beneath her office window.  She steeled herself against unknown attacks, and bravely stood and looked in through the window she had never jumped out of in the previous five years of working here.  Her office looked normal, matching the background noise of London traffic, which was normal too.<br>\r\n<br>\r\nTutting at herself she re-entered the window and trod the path along the familiar, friendly corridors of the Museum.  Not quite an idiot, she refrained from the urge to call out for Grahame, or Mr Jones, and made her way toward the new, strange sounds of grunting, grinding and some kind of physical exertion around the next corner.<br>\r\n<br>\r\nHorrified, she watched as Kaliko Jones threw the still bleeding corpse of Grahame into a moving mass of darkness, which seemed to engulf a great proportion of the high vaulted room.  With a physical crackle of energy the oppressive monstrosity dissipated and the body of her colleague landed unceremoniously on the freshly polished floor.<br>\r\n<br>\r\nKaliko caught his breath, straightened his appearance, an pocketed one of the catalogues from the Museum for later reading.  It may have looked as though he hadn't noticed Krista, but he casually walked over to the spot where her legs had given way, and crouch down beside her.<br>\r\n<br>\r\n\"I'm sure this will be difficult to explain to the authorities, but I can't hang around.  I've got dragons to slay.\"  <br>\r\n<br>\r\nHis voice seemed so controlled and measured, for all that she had just witnessed his involvement in.<br>\r\n<br>\r\n\"I have to go and see a man about a potion, or a girl about a sword - want to come with me?\"<br>\r\n<br>\r\nFor the second time in less than an hour, Krista Layland didn't think twice.  She took his hand and let him gently guide her to her feet.<br>\r\n<br>\r\n\"Where to?\"  she asked.</span></div></div>",
            "created":1199638320,
            "id":484163,
            "title":"Escape through the window"
        },
        "11121":{
            "author_id":"acme",
            "author_name":"Acme",
            "content":"<div class=\"\"><div> <span>The tension seemed to build in Kaliko as he tried his best to pick a way through the streets which wouldn't draw too much attention to his bedraggled state.<br>\r\n<br>\r\nWas it silly to waste time getting a potion, which may or may not be needed, when really he should be chasing one final dragon?  He didn't like second guessing himself.  It had always led to trouble in the past.  Now, he looked at the woman jogging alongside him, and wondered if those 'hormone' things, Fenwick had warned him about, weren't playing tricks some where in the human part of him.<br>\r\n<br>\r\nShe glanced at him, and he broke his gaze.  He'd made the decision to go and see the Goat Man, and now it was made he would see it through; that was that.<br>\r\n<br>\r\nThe came down a row of pre-war terraced housing, the sounds and scents of West Indian lifestyles spilled out of open windows.  At the bottom of the street stood \"Goat Man's Caribbean Curry House\".  It had been made by knocking two terraced houses together, and its bright yellow lit sign flooded the youths hanging around eating chips on the forecourt.  No one bothered Kaliko, they had seen the crazy man before, and besides; everyone knew he was a friend of the Goat Man, and <i>no one</i> messed about with those kind of friends.<br>\r\n<br>\r\nA prune faced old woman looked up from the newspaper cradled in her apron, and on bowed, ricket legs, shuffled her pink fluffy slippers, in the back room.  Before reappearing and beckoning them through the beaded curtain into the rooms beyond.<br>\r\n<br>\r\n\"Kaliko; how are you doing?\"  a baritone voice, boomed at them.<br>\r\n<br>\r\n\"Not so bad, Doctor; not so bad.\"<br>\r\n<br>\r\n\"That's a pretty lady you got there,\" the coffee voiced man purred, and to Krista's surprise put out his hand to her.  To her even greater surprise, she took it, and found herself twirled like Ginger Rogers, into a swaying dance with the elderly, but dashing, owner of the voice.<br>\r\n<br>\r\n\"No fun.  No games.  No time.\"  Kaliko's voice chimed, as Krista giggled.<br>\r\n<br>\r\nBowing and kissing her hand, the Goat Man gestured for them to sit on a huge, overstuffed sofa and waited for Kaliko to speak.<br>\r\n<br>\r\n\"The Balm, we need the All Heal Balm.\"<br>\r\n<br>\r\n\"Ah,\"  the Goat man rubbed at his pepper streaked curly beard,  \"I got some; not much, mind, but I got some.  He stood, went to a chemist's dresser and searched around a deep draw for some minutes.  \"Tell Fenwick he still owes me for the B'asma water, and he can pay for this at the same time.\"<br>\r\n<br>\r\n\"Will do.\"  Kaliko agreed, and plucked the tiny clay pot from the fingers of the Goat Man.<br>\r\n<br>\r\n\"You staying for food?\"  he questioned, his face more serious than Krista had so far seen it.  \"We got some of what you like, in the back, still fresh?\"<br>\r\n<br>\r\nA spark of red glowed like a fanned ember in Kaliko's eyes, but then died as he reasserted himself.<br>\r\n<br>\r\n\"We've detoured enough,\"  he declared, and standing, he and Krista went back to the streets of London, heading toward the Museum.<br>\r\n<br>\r\nIt was as they neared the corner of the familiar Victorian building, that they sensed something wrong.  Perhaps, this was what Kaliko felt all the time, but it was a new, strange, and horrible sensation for Krista.<br>\r\n<br>\r\nThe shadows seemed too real, too deep, too solid.  Whereas the bricks and mortar of the building didn't.<br>\r\n<br>\r\n\"Are we too late?\"  she asked, hesitantly.<br>\r\n<br>\r\n\"I don't know.\"  Kaliko answered honestly, and then led them inside, toward the basement where the catalogue had shown the artifact to be.<br>\r\n<br>\r\nThere was somebody else in there.  Movement could be heard at the back of the room and then Krista tripped, and time began to move too quickly.  Kaliko sprinted forward past the rows of book shelves, filing cabinets, and storage boxes that cluttered the basement.  Krista looked down, to see what she had tripped over, and found herself staring at a very real Dragon's tail.  She knew it was a Dragon's, because shortly after looking up the length of it she saw it looking back.  There wasn't even time to make one last thought, before she toasted in the white heat of its roaring flame.<br>\r\n<br>\r\nKaliko was vaguely aware of the rule which states, 'If you are going to go around falling over, you deserve what you get.'  But, was more concerned with other things.  A dragon might normally be considered to be something to be immediately concerned about, but Kaliko knew something far more evil, destructive, and deadly had just found its way onto Planet Earth.  Standing right in front of him, cradling a dirty, looking, wooden slat was a little, bald headed man, with emerald eyes, and long, white, wispy beard.<br>\r\n<br>\r\nHe smiled a transcendental smile at Kaliko, and with great comic timing, showed the world what could be done if Buddha's Party Bowl got into the wrong hands.<br>\r\n<br>\r\n\"Finder's Keepers!\"  his voice sing-songed, and then Kaliko found out just <i>how</i> quick, quick had been for John Harrington.</span></div></div>",
            "created":1199638380,
            "id":484089,
            "title":"Goat Man"
        },
        "11122":{
            "author_id":"acme",
            "author_name":"Acme",
            "choices":[
                "Back to the Museum",
                "Goat Man"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go and see Lexie Mixma, I need to borrow her Sword of Sunshine, before I go back to the museum.\"  Kaliko decided, turned on his heel and left it up to Krista to decide what she wanted to do.<br>\r\n<br>\r\n\"Back?\"  she questioned, but followed too.  <br>\r\n<br>\r\n\"With Grahame dead,\" her voice broke, slightly. \"There could be police, and what if that thing comes back?\"  <br>\r\n<br>\r\n\"It won't come back.\"  Kaliko announced, blankly, as they stepped out onto the main road and hit the hustle and bustle of evening London. <br>\r\n<br>\r\nThey joined the queue for a bus to the Isle of Dogs, and neither felt inclined to speak, until they had been traveling for some minutes, snared in either, slow moving traffic, or in bus stop breaks.<br>\r\n<br>\r\n\"Want some food?\"  Kaliko asked.<br>\r\n<br>\r\nKrista hadn't realised just how much her body wanted her to say yes; so she did, and was surprised by Kaliko, reaching into his long black great-coat, and handing her a chocolate bar.<br>\r\n<br>\r\n\"Thank you.\"<br>\r\n<br>\r\nHe shrugged, and continued to sit there as though he might leap up at any moment. <br>\r\n<br>\r\n\"Do you want some?\"  she asked.<br>\r\n<br>\r\n\"No.  I eat differently.\"<br>\r\n<br>\r\n\"Then why did you have it?\"  she laughed.<br>\r\n<br>\r\n\"I found it on the body of my friend; it seemed a waste to throw it away.\"<br>\r\n<br>\r\nHer palate dried instantly; the melting chocolate was like mud in her mouth.  She may not have known him long, but she got the impression Kaliko Jones wouldn't know what a joke was if you hit him with it.  Krista reached into her pocket and removed a small pack of tissues and, as surreptitiously as possible, spat the unwanted chocolate into it, remaining quiet for the rest of the journey.<br>\r\n<br>\r\nThey, and a handful of others, left the bus and found themselves in a much quieter part of town.  Soon the click of heels and the sounds of chatter disappeared.  They were moving closer to the Thames now; Krista knew this because the smell of churned up river bank and rot, began to permeate every breath and step forward, and the buildings seemed to huddle tighter together, as if to escape the tidal flows of the estuary beyond.<br>\r\n<br>\r\nThey came to a stop outside of a door, with peeling paint and tarnished brass finishings.  Kaliko appeared to be sniffing the air again, beady eyes alert for <i>something</i>.  <br>\r\n<br>\r\n\"I think the air is going to rip.\" He announced, before pushing open the door and quickly jogging down a long, industrial looking corridor.  Krista kept up easily.<br>\r\n<br>\r\n\"What can I do?\"  she decided to ask, rather than the million other questions which demanded an answer.<br>\r\n<br>\r\n\"Find something for dying, and then meet me in the Boiler Room.\"  He paused, and his gaze pierced her with his honesty.  \"Don't turn up if you can't find anything.  It might not end up very nicely.\"<br>\r\n<br>\r\nWith that he was off and she remained stood for a few elastic seconds, carrying the weight of his words along with the image of the night watchman.  She heard a mewling coming from an open recess and saw a broken kitty fending off a plump and determined rat. <br>\r\n<br>\r\n\"Oh, no you don't!\" she felt hot tears stinging her throat, threatening to blind her.<br>\r\n<br>\r\nRipping her jacket as she removed it, she leaped, covering the fat rat.  The startled cat wasn't stupid, having used a fair few lives already, it saw the opportunity the mad woman had given it and ran.  Krista bundled the jacket, wrapping and tying its arms to entomb the beast in coffin of cotton.  Then she ran toward the sound of screaming, fighting and terror, which she knew must be the Boiler Room.<br>\r\n<br>\r\nThe sight that met her was very different from the one back at the Museum.  She watched from the doorway as Kaliko, in all his demonic glory, fought a far more ominous looking foe.  However, this time he was not alone: A small woman, was darting in and out of the mele, and landing some formidable blows on to the common enemy.  Somehow, this entity was less <i>dark mass</i>, and more <i>Dragon</i>.<br>\r\n<br>\r\nShe watched as its blackness coiled, before striking, how the air seemed to become less real where it had been.  Krista watched the woman spin, twist, jump, and buck like those Martial Arts film all her old boyfriends had made her sit through; but Kaliko Jones?  Nothing she had ever seen moved like him.  He was just too <i>wrong</i> - no human could make those moves; not even in a Jon Woo film.  Unbelievable as it was, she watched the fight unfold, before the angry nudges of the wrapped up rat forced her to recognise that the Dragon was winning.<br>\r\n<br>\r\n\"Jones!\"  she yelled, above the noise of fighting, and threw the impromptu sack at him.<br>\r\n<br>\r\nWas that a flicker of horror she saw on his feral face, as he realised the form of the sacrifice needed?  Well, if it was, the sentiment didn't remain long as he held out the package and the woman deftly stabbed the straw through it like a butter-knife, and Kaliko aimed it into the engorged throat of their deadly adversary.<br>\r\n<br>\r\nWith a rent of air, a twist of muscle, and a split of the universe, the Dragon was gone.  Leaving on human, and two not-quites, stood panting in an empty Boiler Room.<br>\r\n<br>\r\n\"Take it.\"  The woman proffered the sword hilt to Kaliko, who took it with a small bow.<br>\r\n<br>\r\n\"Where will you go, Lexi?\"  he asked.<br>\r\n<br>\r\n\"To our brothers and sisters in the New World - where the storm will hit next.  You must contain it here.\"<br>\r\n<br>\r\nWith all that was going to be said by these two creatures said.  The RatMan left the Rabit Girl and followed Krista back out into the, somehow, fresher Dockland's air.<br>\r\n<br>\r\n\"Where next?\"  she asked; assuming her presence was now with him.<br>\r\n<br>\r\n\"We could try the Museum with out possessing the Balm and get a head start on the magic needed to fight the real threat, they are coming for Buddah's Party Bowl - \"<br>\r\n<br>\r\n\" - You mean the artifact we just catalogued?\"  she interrupted.<br>\r\n<br>\r\n\"Yes; or we could go and see the Goat Man; he's a witch doctor at the Caribbean Curry House.  He has a balm which will heal any wound on a human; but, we may not have time to prepare for the fight.\"<br>\r\n<br>\r\n\"Well, you haven't been wrong so far, so why not let your intuition guide you?\"<br>\r\n<br>\r\n\"Okay,\"  Kaliko's face twitched into a seldom used smile. \"Let's go.\"</span></div></div>",
            "created":1199638560,
            "id":484092,
            "title":"Rabbit Girl"
        },
        "111221":{
            "author_id":"acme",
            "author_name":"Acme",
            "content":"<div class=\"\"><div> <span>Maybe it was because their very lives, and the immediate destiny of Earth was in their hands, but Krista thought the journey back to the museum seemed to take very little time.  It was as they neared the corner of the familiar Victorian building, that they sensed something wrong. Perhaps, this was what Kaliko felt all the time, but it was a new, strange, and horrible sensation for Krista.<br>\r\n<br>\r\nThe shadows seemed too real, too deep, too solid. Whereas the bricks and mortar of the building didn't.<br>\r\n<br>\r\n\"Are we too late?\" she asked, hesitantly.<br>\r\n<br>\r\n\"I don't know.\" Kaliko answered honestly, and then led them inside, toward the basement where the catalogue had shown the artifact to be.<br>\r\n<br>\r\nThere was somebody else in there. Movement could be heard at the back of the room and then Krista nearly tripped but, having become slightly equipped for the unexpected, she carried the trip forward into a roll and time began to move more slowly. Kaliko sprinted forward past the rows of book shelves, filing cabinets, and storage boxes that cluttered the basement. Krista peeped out from behind a loaded book trolley, to see what had tripped her over, and found herself staring at a very real Dragon's tail.  Although virtually solid, it still seemed like it was trying to understand the world around it, and develop at the same time.  It looked about the place with milky, blind eyes, and clicked it disproportionately large claws against the floor, which cracked against its weight.<br>\r\n<br>\r\nKaliko was vaguely aware that something was looming in the background, but was more concerned with other things. A dragon might normally be considered to be something to be immediately concerned about, but Kaliko knew something far more evil, destructive, and deadly had just found its way onto Planet Earth. Standing right in front of him, cradling a dirty, looking, wooden slat was a little, bald headed man, with emerald eyes, and long, white, wispy beard.<br>\r\n<br>\r\nHe smiled a transcendental smile at Kaliko and, with he must have assumed was great comic timing, tried to show the world what could be done if Buddha's Party Bowl got into the wrong hands.<br>\r\n<br>\r\n\"Finder's Keepers!\" his voice sing-songed, and the blind Dragon turned toward the noise, whilst simultaneously letting rip a fountain of white hot flame.  Kaliko's rat-like sense of preservation had him scurrying safely for cover, as the Dragon Fheldren flared with a lack of understanding, before turning to a heap of ash, along with the prized antiquity that had been Buddha's Party Bowl.<br>\r\n<br>\r\nSurprised as he was, Kaliko soon became aware of the pressing presence of a very real, and very angry dragon, which had discovered some interesting movement coming from behind a trolley load of books; Krista.<br>\r\n<br>\r\nLike a ricocheted bullet, Kaliko sprang into the air and landed at the other side of the Dragon.  Krista watched the quizzical look of incomprehension flit across its bestial face before its head fell off.<br>\r\n<br>\r\nUnlike the previous adversaries, this one had managed to get to grip with corporeal life; as gallons of Dragon blood swamped the basement, and rippled in eddies around its gigantic form.<br>\r\n<br>\r\n\"That may take more explaining than your friend's corpse.\"  Kaliko deadpanned, and re-sheathed the Sword of Sunshine.  \"Want to come and meet the Goat Man?\"<br>\r\n<br>\r\n\"Why not?\"  Krista answered, wringing out her blood soaked sweater.<br>\r\n<br>\r\nKaliko extended a delicate pale skinned hand, his stomach cramping as she returned the touch.  Damn human side was starting to get in the way of things...</span></div></div>",
            "created":1199642700,
            "id":484156,
            "title":"Back to the Museum"
        },
        "111222":{
            "author_id":"acme",
            "author_name":"Acme",
            "content":"<div class=\"\"><div> <span>The tension seemed to build in Kaliko as he tried his best to pick a way through the streets which wouldn't draw too much attention to his bedraggled state.<br>\r\n<br>\r\nWas it silly to waste time getting a potion, which may or may not be needed, when really he should be chasing one final dragon?  He didn't like second guessing himself.  It had always led to trouble in the past.  Now, he looked at the woman jogging alongside him, and wondered if those 'hormone' things, Fenwick had warned him about, weren't playing tricks some where in the human part of him.<br>\r\n<br>\r\nShe glanced at him, and he broke his gaze.  He'd made the decision to go and see the Goat Man, and now it was made he would see it through; that was that.<br>\r\n<br>\r\nThe came down a row of pre-war terraced housing, the sounds and scents of West Indian lifestyles spilled out of open windows.  At the bottom of the street stood \"Goat Man's Caribbean Curry House\".  It had been made by knocking two terraced houses together, and its bright yellow lit sign flooded the youths hanging around eating chips on the forecourt.  No one bothered Kaliko, they had seen the crazy man before, and besides; everyone knew he was a friend of the Goat Man, and <i>no one</i> messed about with those kind of friends.<br>\r\n<br>\r\nA prune faced old woman looked up from the newspaper cradled in her apron, and on bowed, ricket legs, shuffled her pink fluffy slippers, in the back room.  Before reappearing and beckoning them through the beaded curtain into the rooms beyond.<br>\r\n<br>\r\n\"Kaliko; how are you doing?\"  a baritone voice, boomed at them.<br>\r\n<br>\r\n\"Not so bad, Doctor; not so bad.\"<br>\r\n<br>\r\n\"That's a pretty lady you got there,\" the coffee voiced man purred, and to Krista's surprise put out his hand to her.  To her even greater surprise, she took it, and found herself twirled like Ginger Rogers, into a swaying dance with the elderly, but dashing, owner of the voice.<br>\r\n<br>\r\n\"No fun.  No games.  No time.\"  Kaliko's voice chimed, as Krista giggled.<br>\r\n<br>\r\nBowing and kissing her hand, the Goat Man gestured for them to sit on a huge, overstuffed sofa and waited for Kaliko to speak.<br>\r\n<br>\r\n\"The Balm, we need the All Heal Balm.\"<br>\r\n<br>\r\n\"Ah,\"  the Goat man rubbed at his pepper streaked curly beard,  \"I got some; not much, mind, but I got some.  He stood, went to a chemist's dresser and searched around a deep draw for some minutes.  \"Tell Fenwick he still owes me for the B'asma water, and he can pay for this at the same time.\"<br>\r\n<br>\r\n\"Will do.\"  Kaliko agreed, and plucked the tiny clay pot from the fingers of the Goat Man.<br>\r\n<br>\r\n\"You staying for food?\"  he questioned, his face more serious than Krista had so far seen it.  \"We got some of what you like, in the back, still fresh?\"<br>\r\n<br>\r\nA spark of red glowed like a fanned ember in Kaliko's eyes, but then died as he reasserted himself.<br>\r\n<br>\r\n\"We've detoured enough,\"  he declared, and standing, he and Krista went back to the streets of London, heading toward the Museum.<br>\r\n<br>\r\nIt was as they neared the corner of the familiar Victorian building, that they sensed something wrong.  Perhaps, this was what Kaliko felt all the time, but it was a new, strange, and horrible sensation for Krista.<br>\r\n<br>\r\nThe shadows seemed too real, too deep, too solid.  Whereas the bricks and mortar of the building didn't.<br>\r\n<br>\r\n\"Are we too late?\"  she asked, hesitantly.<br>\r\n<br>\r\n\"I don't know.\"  Kaliko answered honestly, and then led them inside, toward the basement where the catalogue had shown the artifact to be.<br>\r\n<br>\r\nThere was somebody else in there.  Movement could be heard at the back of the room and then Krista tripped, and time began to move too quickly.  Kaliko sprinted forward past the rows of book shelves, filing cabinets, and storage boxes that cluttered the basement.  Krista looked down, to see what she had tripped over, and found herself staring at a very real Dragon's tail.  She knew it was a Dragon's, because shortly after looking up the length of it she saw it looking back.  There wasn't even time to make one last thought, before she toasted in the white heat of its roaring flame.<br>\r\n<br>\r\nKaliko was vaguely aware of the rule which states, 'If you are going to go around falling over, you deserve what you get.'  But, was more concerned with other things.  A dragon might normally be considered to be something to be immediately concerned about, but Kaliko knew something far more evil, destructive, and deadly had just found its way onto Planet Earth.  Standing right in front of him, cradling a dirty, looking, wooden slat was a little, bald headed man, with emerald eyes, and long, white, wispy beard.<br>\r\n<br>\r\nHe smiled a transcendental smile at Kaliko, and with great comic timing, showed the world what could be done if Buddha's Party Bowl got into the wrong hands.<br>\r\n<br>\r\n\"Finder's Keepers!\"  his voice sing-songed, and then Kaliko found out just <i>how</i> quick, quick had been for John Harrington.</span></div></div>",
            "created":1199640720,
            "id":484120,
            "title":"Goat Man"
        },
        "112":{
            "author_id":"acme",
            "author_name":"Acme",
            "content":"<div class=\"\"><div> <span>Knowing he needed the Sword of Sunshine to beat the Dragon Fhalren in obtaining Buddha's Party Bowl, Kaliko made his way to the Docks.<br>\r\n<br>\r\nHe joined the queue for a bus to the Isle of Dogs, remaining quiet and thoughtful for the forty-five minute journey.<br>\r\n<br>\r\nKaliko, and a handful of others, left the bus and found himself in a much quieter part of town.  Soon the click of heels and the sounds of chatter disappeared.  He was moving closer to the Thames now, because the smell of churned up river bank and rot, began to permeate every breath and step forward, and the buildings seemed to huddle tighter together, as if to escape the tidal flows of the estuary beyond.<br>\r\n<br>\r\nStopping outside of a door, with peeling paint and tarnished brass finishings.  Kaliko sniffed the air again, beady eyes alert for <i>something</i>.  He hated the way it felt as if would rip with the weight of another dimension pressing down on it.  He pushed open the door and entered an industrial corridor.<br>\r\n<br>\r\nFor the first time, his thoughts flitted over the usefulness of John Harrington.  He missed his companionship right now; he needed to be in two places at once and, as he couldn't physically to that, he would have to try and improvise the best he could.  Whatever he was going to do, he would have to do it quickly because he could already hear the sounds of of screaming, fighting and terror, which he knew must be emanating from Lexie Mixma in the Boiler Room.<br>\r\n<br>\r\nWith that he was off, speeding past an open recess where a plump, determined rat was about to attack a helpless cat; he sure hoped it was a good omen.  Without pause to think he ploughed into the fray of fighting between Lexie, and a rapidly solidifying Dragon Demon.<br>\r\n<br>\r\nLexie may have been a small woman, but she was darting in and out of the mele, and landing some formidable blows on to the common enemy.  For all their combined efforts, this entity was less <i>dark mass</i>, and more <i>Dragon</i>.<br>\r\n<br>\r\nHe watched as its blackness coiled, before striking, how the air seemed to become less real where it had been.  Lexie spun, twisted, jumped, and bucked like the warrior she was. He matched her moves and added 'Rat'; bending and striking at impossible angles.  <br>\r\n<br>\r\n\"Kal!\"  Lexie yelled, above the noise of fighting, \"We're not going to win like this.\"<br>\r\n<br>\r\nWas that a flicker of horror she saw on his feral face, as he realised the form of the sacrifice needed?  Well, if it was, the sentiment didn't remain long as he thrust out his chest and Lexie deftly stabbed the sword through it like a butter-knife.<br>\r\n<br>\r\nWith one last effort and the fading beats of his heart Kaliko finally began to be able to answer John Harrington's question:  \"How quick, is quick?\"<br>\r\n<br>\r\nWith a rent of air, a twist of muscle, and a split of the universe, the Dragon was gone.  Leaving one dead RatMan and a Rabbit Girl with a sword. </span></div></div>",
            "created":1199639940,
            "id":484110,
            "title":"Rabbit  Girl"
        },
        "12":{
            "author_id":"acme",
            "author_name":"Acme",
            "choices":[
                "Help the guard",
                "Escape through the window"
            ],
            "content":"<div class=\"\"><div> <span>Krista Layland worked far later into the evening that she had intended to.  By the time she was ready to clear away all the exhibit cleaning trays, soft bristle brushes, and ambient temperature storage devices, associated with the cataloging project, everyone else had gone home; leaving her and Grahame, the Museum night watchman, alone on the premises.<br>\r\n<br>\r\nIt was, therefore, quite a jolt to come nose to nose with Mr Jones, the International Arts Dealer (<i>my arse</i>, she added silently), who had introduced himself to the department last week.  His youthful expression seemed to twitch, as he examined her, and she reasserted her 'personal space' by taking a step backwards.<br>\r\n<br>\r\n\"Got any further with that ancient text, Miss Layland?\"  Kalikos quick, soft tones, spat out.<br>\r\n<br>\r\n\"Oh, and 'hello, to you too,' Mr Jones.\"  <br>\r\n<br>\r\nShe made her way around to the safety of her desk; something about the... <i>man</i>? gave her the creeps.  His eyes were so black as to give the impression of sucking the life out of a room or, at least, the light from it.<br>\r\n<br>\r\n\"Yes.  Hello.  Have you got any further with that ancient text, Miss Layland?\"<br>\r\n<br>\r\nSmiling, she shook her head at his social skills and shook her sleeping laptop awake too.  He came to stand around the back of her chair, and she shuddered with the oppressive sense of him looming over her.  Odd, really; she supposed he <i>should</i> be  handsome with his light, long frame, jet black hair, and alabaster skin, but it just didn't sit well on him.  She scrolled through her desktop and located some files, as she considered him more.  It was almost as if... if you squinted your eyes, turned around really quickly, and tried to focus past him, you might just discover that he wasn't quite human.<br>\r\n<br>\r\n\"Is that it?\"<br>\r\n<br>\r\nHis voice dragged her back to reality and she moved the cursor back up the page until its little arrow rested on the image of a badly aged piece of script; middle east or, far eastern in origin; it was hard to tell with the age of the artifact and the patina of dirt which had amassed.<br>\r\n<br>\r\n\"Yes; this is it - well, based on your rather hazy details surrounding its specific use and origin.\"  She hoped he understood the reprimand in her voice.<br>\r\n<br>\r\n\"Well?\"  he asked, softly.<br>\r\n<br>\r\n\"Well, what?\"<br>\r\n<br>\r\n\"Well, where is it?\"  he smiled, for the first time she had seen it, and it was all wrong; like he was.<br>\r\n<br>\r\n\"Its actually here, in this Museum.  Lord knows how it managed to ellude classification, but not anymore!\"  she smiled, triumphantly, and waved a fresh catalogue of exhibits at him.  <br>\r\n<br>\r\nShe didn't expect his response.  With lightning reflexes he pinched the catalogue out of her grasp and his eyes flicked over it with more twitches that before.  Then he spoke, with a quiet urgency which chilled her to the bone:<br>\r\n<br>\r\n\"And this is now <i>public</i>?\"<br>\r\n<br>\r\n\"Yes,\" she said, not understanding but catching the smell of fear in the air.<br>\r\n<br>\r\nWith death knell timing, the tinkle of broken glass echoed up from the deserted corridor beyond Krista's office, and a strangled scream surged into their ears, freezing them to the spot for what seemed like minutes.<br>\r\n<br>\r\n\"Come with me, now.\"  Kaliko stated, catching hold of her arm and pulling her toward the window.<br>\r\n<br>\r\n\"No!  We can't just leave him...\"</span></div></div>",
            "created":1199509200,
            "id":483711,
            "title":"Krista Layland (Archaeologist)"
        },
        "121":{
            "author_id":"acme",
            "author_name":"Acme",
            "content":"<div class=\"\"><div> <span>Krista broke free of Kaliko's grip and raced out into the corridor;  the sounds of agony were still issuing from somewhere up ahead, and she now she could hear the swift footfall of Mr Jones joining her.  He would have left him, she realised, as her feet found the familiar pace her endless work-outs around Hyde Park had added to her stunning figure.  No one human, who had heard that cry would have left a man to his fate.<br>\r\n<br>\r\nThen she knew why.<br>\r\n<br>\r\nHer sneakers squeaked to a halt on the highly polished Museum floor.  There, right ahead of her, was the writhing, not-quite-dead-yet, form of Grahame.  Only the uniform identified him as his head was little more than mangled pulp from which some dark mass was emerging.  Something blacker that Mr Jones' eyes; something blacker than the nightmares of her soul, and that something, was bored of its toy and was now looking straight at her.  Not with eyes, for she couldn't see any in its moving darkness; but with intent, and she felt her limbs leaden with a fear she could never have imagined.<br>\r\n<br>\r\nA new flurry of activity caught her attention as Kaliko whipped past her and, to her disgust, made straight for the oozing body of the night watchman.  He seemed to be saying a series of words over him, and moving his quick little hands in a baffling series of strange gestures.  As he made to pick up the body and hurl it at the midnight-evil entity, she came to her senses and willed her limbs to move.<br>\r\n<br>\r\n\"Don't do it!\"  Kaliko cried, aware of her intent to intefere, \"I have to stop it and this mans dying pulse can rid us of it.\"<br>\r\n<br>\r\nHow could she?  How repugnant was the thought of dear old Grahame being <i>fed</i> to this monstrous form, and defiled by this inhuman animal in the process.  Ignoring his obvious strength advantage, Krista propelled her self at the corpse laden form of Kaliko and thundered into him with a resounding, thwack.  He crumpled under the guards weight and her strange trajectory took her beyond the men; but not out of the reach of the monster which was still growing in darkness and mass.<br>\r\n<br>\r\nIf it were sentient, then it was clever.  It moved rapidly toward its biggest threat, Kaliko, and, with an earsplitting scream from the attacked, it ripped at his legs with unseen claws.  Before she could realise the peril of her recent choices, Krista watched helplessly, as the one man who seemed to understand the evil force, was taken into a black maw and spat out lifeless.<br>\r\n<br>\r\nSlowly, the creature turned its attention to her...<br>\r\n<br>\r\n</span></div></div>",
            "created":1199509200,
            "id":483721,
            "title":"Help the guard"
        },
        "122":{
            "author_id":"acme",
            "author_name":"Acme",
            "choices":[
                "Goat Man",
                "Rabbit Girl"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, yes we can!\"  <br>\r\n<br>\r\nKaliko tightened his grip on Krista's arm before she could protest and hoisted her out the window.<br>\r\n<br>\r\n\"Where do you think that Guard was?\"  he questioned, although his eyes seemed to be focused on some kind of internal map, and she was pretty sure he would know more regarding the whereabouts of Grahame's attacker, than the man himself.  Not waiting for a reply he went on:<br>\r\n<br>\r\n\"Just stay here, or die - it really is as simple as that.\"  <br>\r\n<br>\r\nAnd then he was up, back through the window and she listened as his footfall fell quickly out of earshot.<br>\r\n<br>\r\nKrista thought about going back through the window, but her internal flight, or flight response had <i>definitely</i> chosen the 'flight' option, now that the air around her was eerily absent of any screams... or any other noise, for that matter.<br>\r\n<br>\r\nShe began to feel a little bit silly.  Here she was a fit healthy, young, attractive, and intelligent young woman; who was currently crouching in fear beneath her office window.  She steeled herself against unknown attacks, and bravely stood and looked in through the window she had never jumped out of in the previous five years of working here.  Her office looked normal, matching the background noise of London traffic, which was normal too.<br>\r\n<br>\r\nTutting at herself she re-entered the window and trod the path along the familiar, friendly corridors of the Museum.  Not quite an idiot, she refrained from the urge to call out for Grahame, or Mr Jones, and made her way toward the new, strange sounds of grunting, grinding and some kind of physical exertion around the next corner.<br>\r\n<br>\r\nHorrified, she watched as Kaliko Jones threw the still bleeding corpse of Grahame into a moving mass of darkness, which seemed to engulf a great proportion of the high vaulted room.  With a physical crackle of energy the oppressive monstrosity dissipated and the body of her colleague landed unceremoniously on the freshly polished floor.<br>\r\n<br>\r\nKaliko caught his breath, straightened his appearance, an pocketed one of the catalogues from the Museum for later reading.  It may have looked as though he hadn't noticed Krista, but he casually walked over to the spot where her legs had given way, and crouch down beside her.<br>\r\n<br>\r\n\"I'm sure this will be difficult to explain to the authorities, but I can't hang around.  I've got dragons to slay.\"  <br>\r\n<br>\r\nHis voice seemed so controlled and measured, for all that she had just witnessed his involvement in.<br>\r\n<br>\r\n\"I have to go and see a man about a potion, or a girl about a sword - want to come with me?\"<br>\r\n<br>\r\nFor the second time in less than an hour, Krista Layland didn't think twice.  She took his hand and let him gently guide her to her feet.<br>\r\n<br>\r\n\"Where to?\"  she asked.</span></div></div>",
            "created":1199561760,
            "id":484167,
            "title":"Escape through the window"
        },
        "1221":{
            "author_id":"acme",
            "author_name":"Acme",
            "content":"<div class=\"\"><div> <span>The tension seemed to build in Kaliko as he tried his best to pick a way through the streets which wouldn't draw too much attention to his bedraggled state.<br>\r\n<br>\r\nWas it silly to waste time getting a potion, which may or may not be needed, when really he should be chasing one final dragon?  He didn't like second guessing himself.  It had always led to trouble in the past.  Now, he looked at the woman jogging alongside him, and wondered if those 'hormone' things, Fenwick had warned him about, weren't playing tricks some where in the human part of him.<br>\r\n<br>\r\nShe glanced at him, and he broke his gaze.  He'd made the decision to go and see the Goat Man, and now it was made he would see it through; that was that.<br>\r\n<br>\r\nThe came down a row of pre-war terraced housing, the sounds and scents of West Indian lifestyles spilled out of open windows.  At the bottom of the street stood \"Goat Man's Caribbean Curry House\".  It had been made by knocking two terraced houses together, and its bright yellow lit sign flooded the youths hanging around eating chips on the forecourt.  No one bothered Kaliko, they had seen the crazy man before, and besides; everyone knew he was a friend of the Goat Man, and <i>no one</i> messed about with those kind of friends.<br>\r\n<br>\r\nA prune faced old woman looked up from the newspaper cradled in her apron, and on bowed, ricket legs, shuffled her pink fluffy slippers, in the back room.  Before reappearing and beckoning them through the beaded curtain into the rooms beyond.<br>\r\n<br>\r\n\"Kaliko; how are you doing?\"  a baritone voice, boomed at them.<br>\r\n<br>\r\n\"Not so bad, Doctor; not so bad.\"<br>\r\n<br>\r\n\"That's a pretty lady you got there,\" the coffee voiced man purred, and to Krista's surprise put out his hand to her.  To her even greater surprise, she took it, and found herself twirled like Ginger Rogers, into a swaying dance with the elderly, but dashing, owner of the voice.<br>\r\n<br>\r\n\"No fun.  No games.  No time.\"  Kaliko's voice chimed, as Krista giggled.<br>\r\n<br>\r\nBowing and kissing her hand, the Goat Man gestured for them to sit on a huge, overstuffed sofa and waited for Kaliko to speak.<br>\r\n<br>\r\n\"The Balm, we need the All Heal Balm.\"<br>\r\n<br>\r\n\"Ah,\"  the Goat man rubbed at his pepper streaked curly beard,  \"I got some; not much, mind, but I got some.  He stood, went to a chemist's dresser and searched around a deep draw for some minutes.  \"Tell Fenwick he still owes me for the B'asma water, and he can pay for this at the same time.\"<br>\r\n<br>\r\n\"Will do.\"  Kaliko agreed, and plucked the tiny clay pot from the fingers of the Goat Man.<br>\r\n<br>\r\n\"You staying for food?\"  he questioned, his face more serious than Krista had so far seen it.  \"We got some of what you like, in the back, still fresh?\"<br>\r\n<br>\r\nA spark of red glowed like a fanned ember in Kaliko's eyes, but then died as he reasserted himself.<br>\r\n<br>\r\n\"We've detoured enough,\"  he declared, and standing, he and Krista went back to the streets of London, heading toward the Museum.<br>\r\n<br>\r\nIt was as they neared the corner of the familiar Victorian building, that they sensed something wrong.  Perhaps, this was what Kaliko felt all the time, but it was a new, strange, and horrible sensation for Krista.<br>\r\n<br>\r\nThe shadows seemed too real, too deep, too solid.  Whereas the bricks and mortar of the building didn't.<br>\r\n<br>\r\n\"Are we too late?\"  she asked, hesitantly.<br>\r\n<br>\r\n\"I don't know.\"  Kaliko answered honestly, and then led them inside, toward the basement where the catalogue had shown the artifact to be.<br>\r\n<br>\r\nThere was somebody else in there.  Movement could be heard at the back of the room and then Krista tripped, and time began to move too quickly.  Kaliko sprinted forward past the rows of book shelves, filing cabinets, and storage boxes that cluttered the basement.  Krista looked down, to see what she had tripped over, and found herself staring at a very real Dragon's tail.  She knew it was a Dragon's, because shortly after looking up the length of it she saw it looking back.  There wasn't even time to make one last thought, before she toasted in the white heat of its roaring flame.<br>\r\n<br>\r\nKaliko was vaguely aware of the rule which states, 'If you are going to go around falling over, you deserve what you get.'  But, was more concerned with other things.  A dragon might normally be considered to be something to be immediately concerned about, but Kaliko knew something far more evil, destructive, and deadly had just found its way onto Planet Earth.  Standing right in front of him, cradling a dirty, looking, wooden slat was a little, bald headed man, with emerald eyes, and long, white, wispy beard.<br>\r\n<br>\r\nHe smiled a transcendental smile at Kaliko, and with great comic timing, showed the world what could be done if Buddha's Party Bowl got into the wrong hands.<br>\r\n<br>\r\n\"Finder's Keepers!\"  his voice sing-songed, and then Kaliko found out just <i>how</i> quick, quick had been for John Harrington.</span></div></div>",
            "created":1199638020,
            "id":484086,
            "title":"Goat Man"
        },
        "1222":{
            "author_id":"acme",
            "author_name":"Acme",
            "choices":[
                "Goat Man",
                "Back to the Museum"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go and see Lexie Mixma, I need to borrow her Sword of Sunshine, before I go back to the museum.\"  Kaliko decided, turned on his heel and left it up to Krista to decide what she wanted to do.<br>\r\n<br>\r\n\"Back?\"  she questioned, but followed too.  <br>\r\n<br>\r\n\"With Grahame dead,\" her voice broke, slightly. \"There could be police, and what if that thing comes back?\"  <br>\r\n<br>\r\n\"It won't come back.\"  Kaliko announced, blankly, as they stepped out onto the main road and hit the hustle and bustle of evening London. <br>\r\n<br>\r\nThey joined the queue for a bus to the Isle of Dogs, and neither felt inclined to speak, until they had been traveling for some minutes, snared in either, slow moving traffic, or in bus stop breaks.<br>\r\n<br>\r\n\"Want some food?\"  Kaliko asked.<br>\r\n<br>\r\nKrista hadn't realised just how much her body wanted her to say yes; so she did, and was surprised by Kaliko, reaching into his long black great-coat, and handing her a chocolate bar.<br>\r\n<br>\r\n\"Thank you.\"<br>\r\n<br>\r\nHe shrugged, and continued to sit there as though he might leap up at any moment. <br>\r\n<br>\r\n\"Do you want some?\"  she asked.<br>\r\n<br>\r\n\"No.  I eat differently.\"<br>\r\n<br>\r\n\"Then why did you have it?\"  she laughed.<br>\r\n<br>\r\n\"I found it on the body of my friend; it seemed a waste to throw it away.\"<br>\r\n<br>\r\nHer palate dried instantly; the melting chocolate was like mud in her mouth.  She may not have known him long, but she got the impression Kaliko Jones wouldn't know what a joke was if you hit him with it.  Krista reached into her pocket and removed a small pack of tissues and, as surreptitiously as possible, spat the unwanted chocolate into it, remaining quiet for the rest of the journey.<br>\r\n<br>\r\nThey, and a handful of others, left the bus and found themselves in a much quieter part of town.  Soon the click of heels and the sounds of chatter disappeared.  They were moving closer to the Thames now; Krista knew this because the smell of churned up river bank and rot, began to permeate every breath and step forward, and the buildings seemed to huddle tighter together, as if to escape the tidal flows of the estuary beyond.<br>\r\n<br>\r\nThey came to a stop outside of a door, with peeling paint and tarnished brass finishings.  Kaliko appeared to be sniffing the air again, beady eyes alert for <i>something</i>.  <br>\r\n<br>\r\n\"I think the air is going to rip.\" He announced, before pushing open the door and quickly jogging down a long, industrial looking corridor.  Krista kept up easily.<br>\r\n<br>\r\n\"What can I do?\"  she decided to ask, rather than the million other questions which demanded an answer.<br>\r\n<br>\r\n\"Find something for dying, and then meet me in the Boiler Room.\"  He paused, and his gaze pierced her with his honesty.  \"Don't turn up if you can't find anything.  It might not end up very nicely.\"<br>\r\n<br>\r\nWith that he was off and she remained stood for a few elastic seconds, carrying the weight of his words along with the image of the night watchman.  She heard a mewling coming from an open recess and saw a broken kitty fending off a plump and determined rat. <br>\r\n<br>\r\n\"Oh, no you don't!\" she felt hot tears stinging her throat, threatening to blind her.<br>\r\n<br>\r\nRipping her jacket as she removed it, she leaped, covering the fat rat.  The startled cat wasn't stupid, having used a fair few lives already, it saw the opportunity the mad woman had given it and ran.  Krista bundled the jacket, wrapping and tying its arms to entomb the beast in coffin of cotton.  Then she ran toward the sound of screaming, fighting and terror, which she knew must be the Boiler Room.<br>\r\n<br>\r\nThe sight that met her was very different from the one back at the Museum.  She watched from the doorway as Kaliko, in all his demonic glory, fought a far more ominous looking foe.  However, this time he was not alone: A small woman, was darting in and out of the mele, and landing some formidable blows on to the common enemy.  Somehow, this entity was less <i>dark mass</i>, and more <i>Dragon</i>.<br>\r\n<br>\r\nShe watched as its blackness coiled, before striking, how the air seemed to become less real where it had been.  Krista watched the woman spin, twist, jump, and buck like those Martial Arts film all her old boyfriends had made her sit through; but Kaliko Jones?  Nothing she had ever seen moved like him.  He was just too <i>wrong</i> - no human could make those moves; not even in a Jon Woo film.  Unbelievable as it was, she watched the fight unfold, before the angry nudges of the wrapped up rat forced her to recognise that the Dragon was winning.<br>\r\n<br>\r\n\"Jones!\"  she yelled, above the noise of fighting, and threw the impromptu sack at him.<br>\r\n<br>\r\nWas that a flicker of horror she saw on his feral face, as he realised the form of the sacrifice needed?  Well, if it was, the sentiment didn't remain long as he held out the package and the woman deftly stabbed the sword through it like a butter-knife, and Kaliko aimed it into the engorged throat of their deadly adversary.<br>\r\n<br>\r\nWith a rent of air, a twist of muscle, and a split of the universe, the Dragon was gone.  Leaving one human, and two not-quites, stood panting in an empty Boiler Room.<br>\r\n<br>\r\n\"Take it.\"  The woman proffered the sword hilt to Kaliko, who took it with a small bow.<br>\r\n<br>\r\n\"Where will you go, Lexi?\"  he asked.<br>\r\n<br>\r\n\"To our brothers and sisters in the New World - where the storm will hit next.  You must contain it here.\"<br>\r\n<br>\r\nWith all that was going to be said by these two creatures said.  The RatMan left the Rabit Girl and followed Krista back out into the, somehow, fresher Dockland's air.<br>\r\n<br>\r\n\"Where next?\"  she asked; assuming her presence was now with him.<br>\r\n<br>\r\n\"We could try the Museum with out possessing the Balm and get a head start on the magic needed to fight the real threat, they are coming for Buddah's Party Bowl - \"<br>\r\n<br>\r\n\" - You mean the artifact we just catalogued?\"  she interrupted.<br>\r\n<br>\r\n\"Yes; or we could go and see the Goat Man; he's a witch doctor at the Caribbean Curry House.  He has a balm which will heal any wound on a human; but, we may not have time to prepare for the fight.\"<br>\r\n<br>\r\n\"Well, you haven't been wrong so far, so why not let your intuition guide you?\"<br>\r\n<br>\r\n\"Okay,\"  Kaliko's face twitched into a seldom used smile. \"Let's go.\"</span></div></div>",
            "created":1199634600,
            "id":484115,
            "title":"Rabbit Girl"
        },
        "12221":{
            "author_id":"acme",
            "author_name":"Acme",
            "content":"<div class=\"\"><div> <span>The tension seemed to build in Kaliko as he tried his best to pick a way through the streets which wouldn't draw too much attention to his bedraggled state.<br>\r\n<br>\r\nWas it silly to waste time getting a potion, which may or may not be needed, when really he should be chasing one final dragon?  He didn't like second guessing himself.  It had always led to trouble in the past.  Now, he looked at the woman jogging alongside him, and wondered if those 'hormone' things, Fenwick had warned him about, weren't playing tricks some where in the human part of him.<br>\r\n<br>\r\nShe glanced at him, and he broke his gaze.  He'd made the decision to go and see the Goat Man, and now it was made he would see it through; that was that.<br>\r\n<br>\r\nThe came down a row of pre-war terraced housing, the sounds and scents of West Indian lifestyles spilled out of open windows.  At the bottom of the street stood \"Goat Man's Caribbean Curry House\".  It had been made by knocking two terraced houses together, and its bright yellow lit sign flooded the youths hanging around eating chips on the forecourt.  No one bothered Kaliko, they had seen the crazy man before, and besides; everyone knew he was a friend of the Goat Man, and <i>no one</i> messed about with those kind of friends.<br>\r\n<br>\r\nA prune faced old woman looked up from the newspaper cradled in her apron, and on bowed, ricket legs, shuffled her pink fluffy slippers, in the back room.  Before reappearing and beckoning them through the beaded curtain into the rooms beyond.<br>\r\n<br>\r\n\"Kaliko; how are you doing?\"  a baritone voice, boomed at them.<br>\r\n<br>\r\n\"Not so bad, Doctor; not so bad.\"<br>\r\n<br>\r\n\"That's a pretty lady you got there,\" the coffee voiced man purred, and to Krista's surprise put out his hand to her.  To her even greater surprise, she took it, and found herself twirled like Ginger Rogers, into a swaying dance with the elderly, but dashing, owner of the voice.<br>\r\n<br>\r\n\"No fun.  No games.  No time.\"  Kaliko's voice chimed, as Krista giggled.<br>\r\n<br>\r\nBowing and kissing her hand, the Goat Man gestured for them to sit on a huge, overstuffed sofa and waited for Kaliko to speak.<br>\r\n<br>\r\n\"The Balm, we need the All Heal Balm.\"<br>\r\n<br>\r\n\"Ah,\"  the Goat man rubbed at his pepper streaked curly beard,  \"I got some; not much, mind, but I got some.  He stood, went to a chemist's dresser and searched around a deep draw for some minutes.  \"Tell Fenwick he still owes me for the B'asma water, and he can pay for this at the same time.\"<br>\r\n<br>\r\n\"Will do.\"  Kaliko agreed, and plucked the tiny clay pot from the fingers of the Goat Man.<br>\r\n<br>\r\n\"You staying for food?\"  he questioned, his face more serious than Krista had so far seen it.  \"We got some of what you like, in the back, still fresh?\"<br>\r\n<br>\r\nA spark of red glowed like a fanned ember in Kaliko's eyes, but then died as he reasserted himself.<br>\r\n<br>\r\n\"We've detoured enough,\"  he declared, and standing, he and Krista went back to the streets of London, heading toward the Museum.<br>\r\n<br>\r\nIt was as they neared the corner of the familiar Victorian building, that they sensed something wrong.  Perhaps, this was what Kaliko felt all the time, but it was a new, strange, and horrible sensation for Krista.<br>\r\n<br>\r\nThe shadows seemed too real, too deep, too solid.  Whereas the bricks and mortar of the building didn't.<br>\r\n<br>\r\n\"Are we too late?\"  she asked, hesitantly.<br>\r\n<br>\r\n\"I don't know.\"  Kaliko answered honestly, and then led them inside, toward the basement where the catalogue had shown the artifact to be.<br>\r\n<br>\r\nThere was somebody else in there.  Movement could be heard at the back of the room and then Krista tripped, and time began to move too quickly.  Kaliko sprinted forward past the rows of book shelves, filing cabinets, and storage boxes that cluttered the basement.  Krista looked down, to see what she had tripped over, and found herself staring at a very real Dragon's tail.  She knew it was a Dragon's, because shortly after looking up the length of it she saw it looking back.  There wasn't even time to make one last thought, before she toasted in the white heat of its roaring flame.<br>\r\n<br>\r\nKaliko was vaguely aware of the rule which states, 'If you are going to go around falling over, you deserve what you get.'  But, was more concerned with other things.  A dragon might normally be considered to be something to be immediately concerned about, but Kaliko knew something far more evil, destructive, and deadly had just found its way onto Planet Earth.  Standing right in front of him, cradling a dirty, looking, wooden slat was a little, bald headed man, with emerald eyes, and long, white, wispy beard.<br>\r\n<br>\r\nHe smiled a transcendental smile at Kaliko, and with great comic timing, showed the world what could be done if Buddha's Party Bowl got into the wrong hands.<br>\r\n<br>\r\n\"Finder's Keepers!\"  his voice sing-songed, and then Kaliko found out just <i>how</i> quick, quick had been for John Harrington.</span></div></div>",
            "created":1199637600,
            "id":484084,
            "title":"Goat Man"
        },
        "12222":{
            "author_id":"acme",
            "author_name":"Acme",
            "content":"<div class=\"\"><div> <span>Maybe it was because their very lives, and the immediate destiny of Earth was in their hands, but Krista thought the journey back to the museum seemed to take very little time.  It was as they neared the corner of the familiar Victorian building, that they sensed something wrong. Perhaps, this was what Kaliko felt all the time, but it was a new, strange, and horrible sensation for Krista.<br>\r\n<br>\r\nThe shadows seemed too real, too deep, too solid. Whereas the bricks and mortar of the building didn't.<br>\r\n<br>\r\n\"Are we too late?\" she asked, hesitantly.<br>\r\n<br>\r\n\"I don't know.\" Kaliko answered honestly, and then led them inside, toward the basement where the catalogue had shown the artifact to be.<br>\r\n<br>\r\nThere was somebody else in there. Movement could be heard at the back of the room and then Krista nearly tripped but, having become slightly equipped for the unexpected, she carried the trip forward into a roll and time began to move more slowly. Kaliko sprinted forward past the rows of book shelves, filing cabinets, and storage boxes that cluttered the basement. Krista peeped out from behind a loaded book trolley, to see what had tripped her over, and found herself staring at a very real Dragon's tail.  Although virtually solid, it still seemed like it was trying to understand the world around it, and develop at the same time.  It looked about the place with milky, blind eyes, and clicked it disproportionately large claws against the floor, which cracked against its weight.<br>\r\n<br>\r\nKaliko was vaguely aware that something was looming in the background, but was more concerned with other things. A dragon might normally be considered to be something to be immediately concerned about, but Kaliko knew something far more evil, destructive, and deadly had just found its way onto Planet Earth. Standing right in front of him, cradling a dirty, looking, wooden slat was a little, bald headed man, with emerald eyes, and long, white, wispy beard.<br>\r\n<br>\r\nHe smiled a transcendental smile at Kaliko and, with he must have assumed was great comic timing, tried to show the world what could be done if Buddha's Party Bowl got into the wrong hands.<br>\r\n<br>\r\n\"Finder's Keepers!\" his voice sing-songed, and the blind Dragon turned toward the noise, whilst simultaneously letting rip a fountain of white hot flame.  Kaliko's rat-like sense of preservation had him scurrying safely for cover, as the Dragon Fheldren flared with a lack of understanding, before turning to a heap of ash, along with the prized antiquity that had been Buddha's Party Bowl.<br>\r\n<br>\r\nSurprised as he was, Kaliko soon became aware of the pressing presence of a very real, and very angry dragon, which had discovered some interesting movement coming from behind a trolley load of books; Krista.<br>\r\n<br>\r\nLike a ricocheted bullet, Kaliko sprang into the air and landed at the other side of the Dragon.  Krista watched the quizzical look of incomprehension flit across its bestial face before its head fell off.<br>\r\n<br>\r\nUnlike the previous adversaries, this one had managed to get to grip with corporeal life; as gallons of Dragon blood swamped the basement, and rippled in eddies around its gigantic form.<br>\r\n<br>\r\n\"That may take more explaining than your friend's corpse.\"  Kaliko deadpanned, and re-sheathed the Sword of Sunshine.  \"Want to come and meet the Goat Man?\"<br>\r\n<br>\r\n\"Why not?\"  Krista answered, wringing out her blood soaked sweater.<br>\r\n<br>\r\nKaliko extended a delicate pale skinned hand, his stomach cramping as she returned the touch.  Damn human side was starting to get in the way of things...</span></div></div>",
            "created":1199642220,
            "id":484151,
            "title":"Back to the Museum"
        }
    },
    "info":{
        "author_id":"acme",
        "author_name":"Acme",
        "brief_description":"Completed choose your own adventure with London's RatMan Demon Hunter",
        "created":1199550900,
        "description":"<td align=\"left\" class=\"norm\">Kaliko Jones was not quite human - not quite dead, either.  Kaliko Jones was a Fhaldren.  <br>\r\n<br>\r\nGiven any wintry day in England, Kaliko would have blended in subtly with the pale faced youths in any of the city's local gangs.  He stood tall, yet stooped.  Was thin, yet muscular.  Wore that blank, yet frosty teen-ager leer, so very well.<br>\r\n<br>\r\nAt six-foot and two-inches, he dominated the sky-line of John Harrington (a measly five-foot-six) his only companion and very human.  Very fleshy too.  It was John's flesh that was causing the trouble recently;  sticky, red, flesh, that protruded in sore, ragged, blooms all over his abdomen.<br>\r\n<br>\r\n\"I won't make it to the hospital,\"  John wheezed through clenched teeth, \"Just leave me here and get the Demon before he opens the seal for the others.\"<br>\r\n<br>\r\nKaliko looked around at 'here'; a grime filled, London backstreet, that smelled of rotting food and debris.  <br>\r\n<br>\r\n\"No,\"  he decided. <br>\r\n<br>\r\n\"But, I'm going to die, anyway.  I'll just slow you down.  Think of the others - you won't be able to beat them all.\"<br>\r\n<br>\r\n\"I know.  That's why I have to take you with me.  You may as well be a useful corpse.\"<br>\r\n<br>\r\nJohn couldn't help but snort a laugh at Kaliko's response knowing that arguing would be futile.  He was reminded not to hold his intestines in with his bare hands as they would stick like 'crazy glue', and then they were off.  Into the sewers that followed the embankment and, possibly, into hell itself.<br>\r\n<br>\r\n\"Will it be painless?\"  John whispered, as he leaned on a sewer support while Kaliko sniffed the air and then snapped his head around to face a different opening in the warren of brick-built stink.<br>\r\n<br>\r\n\"Not really.\"<br>\r\n<br>\r\n\"Yes, but it will be over quickly, won't it?\"<br>\r\n<br>\r\n\"I don't know.\"  Kaliko ducked under John's arm and half-dragged, half-pulled his companion down the dim tunnel ahead.  John didn't even try to help himself walk.  His legs were numb with cold and relatively useless now.  Instead, he wanted to take in all that was left of his life.  It was a desperate attempt to will the soul he was about to lose to capture some essence of the John Harrington that would stop 'being'.<br>\r\n<br>\r\nHe stared at Kaliko Jones and noted, not for the first time, how very feral his darting black eyes were.  How little specks of red, glinted in them like tiny fires.  His nose would twitch and is head jerk slightly to follow its scented directions.  He rarely exposed his teeth, but when he did, John noted they were small and sharp, and his tongue was small, red and vaguely furred.  Elven ears completed the overall impression of 'Rat'; and that was what he was, really.  One of the Fheldren; a human hybrid of Buddha's Chinese calendar animals.<br>\r\n<br>\r\nJohn had only met Kaliko Jones (Rat) and Fenwick Potts (Oxen), but he was aware that nine others were out in the world, secretly saving it from Dragon Demons (the progeny of the twelth zodiacal sign that had gone all zen on Buddha's ass).<br>\r\n<br>\r\nHe was broken from his reverie by Kaliko tossing him down into the shallow stream of rancid water.  He didn't protest - the wind and fight for life were both knocked out of him.  Looking along the tunnel he watched the rat/man follow some invisible magic that made him re-coil from the touch of certain bricks in front of him.  Then Kaliko turned and ran heavily back towards the prone companion as a bolt of blinding light expanded out behind him, forcing his eyes to close before rough hands grabbed him upright again.<br>\r\n<br>\r\n\"Time to save the world, John.\"  Kaliko's voice rang over the echo of the explosions around them.  <br>\r\n<br>\r\nA smell of sulphur and an unearthly roar erupted from all around him and then he was flying.  Kaliko had thrown him toward the gaping maw of the Demon and now knew he'd find out for sure, just how quickly was quick. <br>\r\n<br>\r\n<div align=\"center\"> <img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/star.png\" alt=\"*Star*\" title=\"Star\" border=\"0\" width=\"15\" height=\"15\"> <img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/star.png\" alt=\"*Star*\" title=\"Star\" border=\"0\" width=\"15\" height=\"15\"> <img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/star.png\" alt=\"*Star*\" title=\"Star\" border=\"0\" width=\"15\" height=\"15\"> <img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/star.png\" alt=\"*Star*\" title=\"Star\" border=\"0\" width=\"15\" height=\"15\"> <img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/star.png\" alt=\"*Star*\" title=\"Star\" border=\"0\" width=\"15\" height=\"15\"> <img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/star.png\" alt=\"*Star*\" title=\"Star\" border=\"0\" width=\"15\" height=\"15\"> </div><br>\r\n<br>\r\n</td>",
        "id":1370735,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1381363620,
        "modified":1381363620,
        "pretty_title":"Kaliko Jones and the Zodiac Demons"
    }
}