{
    "chapters":{
        "1":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Millhiore F. (Firianno) Biscotti",
                "Éclair Martinozzi ",
                "Riccotta Elmar",
                "Brioche d'Arquien",
                "Other characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now choose your character to create a nice storyline.</span></div></span></div>",
            "created":1323579600,
            "id":1237847,
            "title":"Here's the heavy start!"
        },
        "11":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Heading towards the kitchen, time to make some eclairs!",
                "An interupption? Ricotta's got some news to share...",
                "Free Choice!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hm, there's something that's been on my mind lately Millhi.\" said Cinque.  Currently the two were simply reading in the castles grand library, enjoying each others company.  The dog-eared princess surprisingly had some rare free time this afternoon and suggested that Cinque read up on the land of Fronaldo.  As he was summoned from his home-world of Earth only a few weeks ago, he still had a novice's knowledge of this amazing world, where war is settle with fun competitions rather than dangerous conflict.  Heck it was even impossible to die in these wars as well, due to the magic that surrounds each country. This was perfect for a teen like Cinque, who was a master of anything relating to gymnastics.  Summoned by Millehiore as the warrior of Biscotti, he had fought in many battles and brought much prosperity to the kingdom of Biscotti as well.  As money is rewarded to the victor of these struggles, Cinque's wins were seen as a blessing in the previously struggling country.  In his hands, the boy held a rather big book, filled with the different foods of Biscotti and the history behind each of them.  Flipping through each of the smooth pages, a query had emerged from his mind.<br>\r\n<br>\r\n\"What is it Cinque?\" answered the princess affectionately called 'Millhi' by the boy.  Sitting across from him on one of the many couches of the grand library, she was also reading while the summoned here learned more about her precious land.  The pink-haired girl was wearing her normal pink and white dress, one that complimented both her hair color as well as her lithe figure.  During their time together in the library, she was reading a short romance novel, as the very idea of love would cause her heart to speed up, especially when it came to Cinque.  While they hadn't known each other for long, the two had great chemistry together, and were nearly inseparable as well.  While they weren't exactly official yet, the pair would be 'touchy-feely' at times.  <br>\r\n<br>\r\n\"Do you people have eclairs here?  I've looked through this book and I haven't seen it mentioned yet.\"  Tilting her head slightly, the girl was confused at what he was asking.<br>\r\n<br>\r\n\"Eclair? Do you mean Eclair the knight?\" said the princess, referring to Eclair, the head of the castle guard.  A temperamental girl, her skill showed no equal, well until Cinque was summoned.  The two were evenly matched and would spar often; sometimes a bit too much for Millhi's liking.  <br>\r\n<br>\r\n\"No no. I mean the food. The pastry called an eclair.\" explained Cinque.  Still confused, the dog-girl went over to where he was sitting, and took a seat somewhat close to him.  She took the book from him and turned to the table of contents.  Scanning the few pages, the word 'eclair' failed to show up.  <br>\r\n<br>\r\n\"Well there's nothing in the book about it. And this pretty much includes all the kinds of foods we make here.\"  Cinque still wasn't satisfied by such an answer.  <br>\r\n<br>\r\n\"Wait, then what is Eclair named after if you guys don't have the food here?\" Scooting closer to him, the girl tried to recall the origin of that name.    <br>\r\n<br>\r\n\"If I remember right, it's based off of a famous warrior in ancient times.  Though there's not much else to go on though. What does this food look like? Oh and how does it taste?\" Now she was getting curious.  She always did love the eccentric 'things' that came from Cinque's home-world. Actually noticing that the girl was quite close, he tried to move back, but she moved an equal distance towards him.  <br>\r\n<br>\r\n\"An eclair is a pastry that's made of dough. It's then fried, and injected with a type of creamy filling.  To finish it, you place a layer of chocolate frosting on the top of it.  I've had it a few times, and it tastes very sweet, and the chocolate only accents that taste.\" explained Cinque as he found himself on the edge of the couch, Millhi still quite close.  By his description, her eye gleamed with interested. She wanted to have one of these so-called eclairs!<br>\r\n<br>\r\n\"Oh! That sounds wonderful! Do you think we can make them here?\" asked Millhi, grabbing onto Cinque hands in excitement.  Her ears were twitching and her tail was waging very rapidly.  Though Cinque was clearly flustered at this point.<br>\r\n<br>\r\n\"Well, if you guys have the right ingredients theoretically its possible.  Though you might need an oven for that.\" <br>\r\n<br>\r\n\"Mhm, we do have a few since we need to make so much food for our troops. Let's go over to the kitchen then.\" said Millhi as she rose from her seat.  Cinque followed suit, though he had a little help from the girl 'helping' him up.  Exchanging a small smile, the two headed over to the rather large doors of the library and into the many vast hallways of the castle.  They were perhaps walking a little too close to each other, but that didn't seem to matter that much. <br>\r\n<br>\r\n   </span></div></div>",
            "created":1323591900,
            "id":1237900,
            "title":"Information, want and more"
        },
        "111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Cinque and Millhi wait, and try out the new Eclair",
                "They are joined by Rico and Eclair",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>The estatic canine princess and her hero arrived into the kitchen, the cooking staff working diligently and with an air of pleasantness.<br>\r\n<br>\r\n“Ah Princess! Lord Hero!” Beamed the head chef, a plump housewife with brown dog ears and a tail. The other chefs smiled too. “Hello Princess! Lord Hero!”<br>\r\n<br>\r\nMillhi smiled in return. “Hello everyone! I was wondering if I could ask you a request if that is possible?”<br>\r\n<br>\r\nThe head chef nodded. “But of course princess! What would you like to ask?”<br>\r\n<br>\r\nThe pinkette princess turned towards the blonde boy. “Cinque?” The blonde nodded and stepped forward.<br>\r\n<br>\r\n“Well you see, Millhi and I were wondering if you could make eclairs?” One young baker, covered head to toe in flour, popped up behind the plump woman.<br>\r\n<br>\r\n“An Éclair? Like Lady Éclair of the Knights?” Cinque shook his head.<br>\r\n<br>\r\n“No. From where I come from an Éclair is a unique desert. You start with dough then you fry it then you,” as Cinque sounded off on the ingredients, the chefs and bakers nodded, listening to his words. “Do I need to repeat anything?”<br>\r\n<br>\r\nThe head chef shook her head. “We got it Lord Hero. We’ll be more than happy to try and make these ‘Éclairs’ for her majesty. And besides, there’s nothing more exciting than baking something new!” The staff behind her sounded off their agreement. <br>\r\n<br>\r\n“Thank you all so much!” Smiled Millhi. “I can’t wait to see the newly baked Eclairs!”<br>\r\n<br>\r\n“Alright everyone, let’s get to work!” Said the head chef.<br>\r\n<br>\r\n“Alright Miss Brulee!” Sounded off the staff. Millhi took Cinque by the hand as they walked out of the kitchen.<br>\r\n<br>\r\n“Alright then, let’s wait.”</span></div></div>",
            "created":1343168640,
            "id":1388270,
            "title":"Heading towards the kitchen, time to make some ..."
        },
        "1111":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "One of the cooking staff arrives",
                "It's the actual Eclair!"
            ],
            "content":"<div class=\"\"><div> <span>The pink haired princess gracefully thanked her cooking staff for their efforts in creating the pastry. As they needed to wait patiently to receive the fruits of the worker's labor, Millhiore led her hero to one of the many gardens that the castle possessed. It was actually her favorite one as there were many beautiful flowers to admire and it was rather peaceful. Reaching the stone doors, the princess exerted a bit of force to open them, which created a rather serene view. Cinque was awed to such a sight. There were flowers of all colors and of different types and were strewn around in arrangements that could only be described as art.  A calm wind passed from the closed area making the air quite refreshing in addition to the natural scents of the flowers. <br>\r\n<br>\r\n\"Princess! This is quite amazing. I didn't know such a place existed here.\" exclaimed Cinque, happy that his princess would share such a place with him. The girl flashed him a warm smile, her dog ears twitching and her pink tail swaying in happiness. She grabbed his arm and lead him towards a nearby stone bench. Both of them sat down, close to one another once again. This time however, the princess was practically touching sides with her hero. <br>\r\n<br>\r\n\"I like to come here from time to time, when things get a bit stressful.\" she said. As the princess to the Biscotti kingdom, she had many responsibilities and the pink haired girl always made sure that everyone is happy. Thanks to that, she was revered by all of the people in her land.  Cinque felt sympathy for his princess; indeed to have such duties at a young age was admirable. Cinque closed his eyes, taking a deep breath of the fresh air and let his mind wander. His stresses about returning home slowly dissipated and were replaced with those of his princess, The had instantly connected within days of knowing each other and the blond felt a strange feeling in his chest whenever the two were close to one another. The feeling building up in his chest once more, he tried to ignore it, but it was very persistent. Trying to figure out what this meant, he felt Millhiore place her head upon her shoulder. A small blush growing on his face, he saw that her eyes were closed and her breathing was calm. The strange feeling only seemed to intensify.  Before he could react, a noise was heard in front of them and the door was opened.<br>\r\n<br>\r\n\"Princess! I knew I would find you in here!\" A very bouncy and hyperactive girl bounced into the small garden, her small brown tail wagging with happiness and eagerness. It was Ricotta, or Rico as she was called by all of her friends. The girl had long brown hair that flowed on to her shoulders , a yellow buttoned up shirt worn under an oversized lab coat and a pink skirt around her waist.  The small girl's dog ears fidgeted with delight as she ran over to the two. In her surprise entrance, both of them had separated much to the disappointment of the energetic pink haired princess. Rico sat right next to Cinque and snuggled into his side. The hero of Biscotti smiled and rubbed her head gently. The princess couldn't help but to fee; somewhat upset about the scene in front of her. Perhaps it was a simple pang of jealousy?<br>\r\n<br>\r\n\"So what brings you here Rico?\" asked Cinque. Rico stood back up and took out some blueprints that she had on her person. In a flash she presented them to both of her friends, but they lacked the technical know-how to fully grasp it. Seeing their reactions she began to explain what her plan was.<br>\r\n<br>\r\n\"You know when Cinque let me use the thing he called a 'cell-phone?' Well using that I was able to make something really awesome. I also incorporated some magic so it would be balanced in its efficiency. It's a device that can mass reproduce any item! How useful is that dear princess?\"<br>\r\n<br>\r\n\"Wow! Now we wouldn't have to worry about our war supplies or other related things.\" said the princess, happy that some of the problems that the kingdom faced could be solved. Cinque was quite impressed that Rico could come up with such an invention, shw was leagues ahead of any scientist on Earth. <br>\r\n<br>\r\n\"Yup, now all I need is a few materials, luckily I made a list.\" Rico then retrieved a piece of paper from her person and handed it to the other girl. It was a list of the mentioned materials and their costs. As the princess looked over it, the door was opened once more.<br>\r\n  </span></div></div>",
            "created":1343884500,
            "id":1395869,
            "title":"Garden of whatnow?"
        },
        "11111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "They headed towards the kitchen without much trouble",
                "Here comes a familiar face! Who could it be..."
            ],
            "content":"<div class=\"\"><div> <span>“Princess? Sir Hero?” Asked a female voice from behind the door, waving her hand to try and get attention. The trio noticed and the pinkette princess chuckled a little.<br>\r\n<br>\r\n“Yes we’re present. What is it?” Asked Millhiore. The female peeked her heard out, revealing a chef’s hat ontop of a mop of light blue hair.<br>\r\n<br>\r\n“Um, the cooking staff is almost finished baking the éclair, and we were wondering if you and Sir Hero inspect it to see if it is up to your standards,” Millhi nodded, turning towards Rico and Cinque.<br>\r\n<br>\r\n“So then, shall we see the new éclairs then?” The two nodded back in reply. “Mm-Hmm!”<br>\r\n<br>\r\nAnd trio followed the chef out of the garden and back into the castle,  treading through the corridors. Rico was having a bounce to her step. <br>\r\n<br>\r\n“You seem rather excited Rico,” pointed out Cinque.<br>\r\n<br>\r\n“It’s just that the idea of tasting something from your world is just too grand Cinque!” Beamed the petite dog-girl. Cinque smiled back and patted her head. The brunette’s tail was starting to wag quite a bit. <br>\r\n<br>\r\n“Well I’m glad, I hope you and Millhi get to enjoy it!” Millhiore nodded back too. <br>\r\n<br>\r\n“Me too Cinque!”<br>\r\n<br>\r\nAnd as they rounded the corner…</span></div></div>",
            "created":1345572840,
            "id":1409672,
            "title":"One of the cooking staff arrives"
        },
        "111112":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "The moment has come, the eclairs are delicious!",
                "They arrive and someone else is eating the eclairs!"
            ],
            "content":"<div class=\"\"><div> <span>Turning the corner, the four individuals nearly ran into Eclair, the green headed Captain of the Guard. Dressed in her combat attire, the trio assumed that she was head out to the training yard to work on her skills.<br>\r\n<br>\r\n\"Oh hello Eclair, how are you this afternoon.\" said Milhiore with a sweet voice and smile to match. The others greeted similarly as the icy-hot girl blushed when she saw Cinque, never quite getting over their accidental kiss a few weeks back.  The chef went back to the kitchen to let the four chat without any interruption.  <br>\r\n<br>\r\n\"I'm doing fine princess, I'm headed out to train a few of my bright power skills. I've been slacking a bit since the last festival, I hope you don't mind.\" During the last festival, the girl clashed blades with the ruler of Galette, Leon Michille. While she managed to break her weapon using her bright power skills, her body was greatly fatigued and she had been resting ever since. The princess shook her head as she petted Eclair on hers. <br>\r\n<br>\r\n\"Its fine Eclair, after your splendid display of bravery and strength, you deserve to rest.\" smiling back, Eclair nodded, her tail happily wagging back and forth for such praise. <br>\r\n<br>\r\n\"Be sure to spar with me sometime soon! I want to make sure I'm keeping up with you.\" Cinque said in an enthusiastic voice.  He was always eager to test his abilities, hoping to make his princess proud of him as her hero. <br>\r\n<br>\r\n\"Oh, before you leave, would you like to taste eclairs with us?\" Turning her head and her ears twitching in a bewildered fashion, the girl began to think that they wanted to taste her! Seeing the confusion on her face, Cinque began to explain that back in his world an eclair was a dessert. More specifically that it was fried dough frosted with chocolate and injected with a cream filling.  The description of the dessert did cause Eclair to become interested and she decided to head along with the trio. Training could always wait a bit. Becoming impatient, Rico grabbed the wrists of Cinque and the princess and started in the direction of the kitchen, with Eclair following the three in silent laughter.</span></div></div>",
            "created":1357177140,
            "id":1500593,
            "title":"A Heroine in Green"
        },
        "1111121":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "They all try out one...",
                "The girls love it! Their taste buds explode!"
            ],
            "content":"<div class=\"\"><div> <span>\"Here! Here they are!\" Rico chirped, practically skipping on her feet and displaying the tray of treats with wide open arms. Upon the rolling cart was a wide fancy silver plate, and filling up the plate was the pastry who the dog-girl spent much of the morning crafting. Milhiore claspd her hands together and beamed while Cinque followed in after, Eclair not far after him.<br>\r\n<br>\r\n\"Oh Rico they look delicious! Even their aroma is heavenly!\" Beamed the Princess, her tail wagging back and forth. The green-haired knight took a small sniff of the hair, her ears perking up and small tail joining with the princess on the wagging.<br>\r\n<br>\r\n\"Yeah...it does smell good...\"<br>\r\n<br>\r\n\"Well Sir Hero?\" Asked the peppy scientist. \"Did I make it good? Is it up to par? Is it like your world's? Is it good? Is it-\"<br>\r\n<br>\r\n\"Easy there!\" Cinque waved his arms in front of him as Rico was firing off questions in rapid fire. \"I'm sure it is! Let's try it out first though okay?\"<br>\r\n<br>\r\n\"Mmhmmm!\" The kitchen had a spare table and some chairs as Cinque pulled out a chair for the pinkette.<br>\r\n<br>\r\n\"Milady.\" He said with a courtly bow.<br>\r\n<br>\r\n\"Such manners, my hero,\" Smiled back Milhiore, taking her seat. Eclair joined on in, sitting across from the princess with a tongue-in-cheek face as she saw Cinque rub Milhiore's ears. Rico brought up the tray of the chocolate covered treats.<br>\r\n<br>\r\n\"Shall we?\" Asked Rico as she gave each person an eclair.</span></div></div>",
            "created":1366253820,
            "id":1573962,
            "title":"The moment has come, the eclairs are delicious!"
        },
        "11111212":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "That night, a chat with Milhe",
                "Perhaps seconds are in order?"
            ],
            "content":"<div class=\"\"><div> <span>One by one, each of the dog girls bit into the chocolatey treat, the cream flowing into their mouths as they felt their taste buds ascend into a higher plain of existence. Cinque watched his friends, bewildered at such a reaction. Sure he has had eclairs many times back on Earth, but he had never seen such a reaction, even from Becky or Nanami. Milhe looked towards Cinque, her ears twitching and her tail wagging in a rapid manner.<br>\r\n<br>\r\n\"Cinque! It tastes delicious!\" she shouted, her eyes shining with enthusiasm. The other two girls reacted in the same manner and began to eat the rest of the treats off of the plate. Milhe, seeing that she was losing in this 'race' began to pick up the pace as well. Ten minutes had passed and the girls had devoured the treats and Cinque wasn't even able to taste one of them.<br>\r\n<br>\r\n\"So, I guess you all enjoyed them?\" he asked, slightly shocked at seeing such an amusing event play before his eyes.<br>\r\n<br>\r\n\"They were decent. Though how much sugar were in these? They can't be too healthy to eat.\" mumbled Eclair, gently rubbing her toned stomach. She had always taken care of her body since becoming the head of the knights, but she was always such a sucker for sweet things. The green haired dog girl was also quite amused that the treats were named after her. Rico was even more excited and wanted to see just how she could implement the food in her experiments. <br>\r\n<br>\r\n\"Cinque, you didn't get to have one. I'm really sorry.\" said the pink haired princess, frowning that she and her friends had failed to leave some for the hero. Smiling, he gently pat her head, which caused the other two girls to narrow their eyes to the scene.<br>\r\n<br>\r\n\"Hey, its fine, its the first time you guys got to enjoy them and seeing you all happy is good enough for me.\" <br>\r\n<br>\r\n\"Hero! You're supposed to give us all the same attention! Otherwise its not fair!\" exclaimed Rico, the petite girl rushing up to Cinque and jumping up and down in anger. Eclair merely pouted, not wanting to reveal her true feelings on the matter. Ciqnue nervously laughed as he tried to get Rico from hitting him with her tiny fists. </span></div></div>",
            "created":1367129580,
            "id":1579989,
            "title":"Pat Pat"
        },
        "111112122":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "The four begin working!",
                "The four realize they may need more help! Where to turn to..."
            ],
            "content":"<div class=\"\"><div> <span>“Well…how about you make seconds? That way I can have some too. I mean, if you loved it that much it must taste incredibly good!” Said Cinque as he had his hand on Rico’s head, the girl hopelessly trying to hit at him with her swinging arms but to no avail.<br>\r\n<br>\r\n“That sounds wonderful!” Milhe clasped her hands together and looked at Rico. “Rico, let’s go make more of these wonderful Eclairs! Better yet, let’s bake enough for the whole castle staff!”<br>\r\n<br>\r\n“Waaah!” Rico gasped in surprise. “R-Really? That much?” Suddenly she felt the feeling of overwhelming-ness take over. How can she ever bake that much!<br>\r\n<br>\r\n“Of course! It’s a crime that we should hog this all to ourselves!” Milhe beamed. “In fact, I would like to help if I can!”<br>\r\n<br>\r\nÉclair and Rico gasped. “P-Princess there’s no need to trouble yourself with cooking!” Éclair said. “If anything, let me help Rico in your stead!”<br>\r\n<br>\r\n“Mind if I help too?” Cinque raised a hand. “I wouldn’t mind learning a thing or two on baking.”<br>\r\n<br>\r\n“Owaaah~” Rico placed both of her hands on her cute cheeks. “I’m being overwhelmed here! But to make it for nearly a hundred of the staff…we might be up all night!”<br>\r\n<br>\r\n“With a little magic and the power of friendship, anything can be possible!” giggled Milhe. “Now, Cinque, Éclair, lets go find some aprons and get to work!” She pumped her fist into the air. “For the glor of the éclair!”<br>\r\n<br>\r\n“For the glory…of the éclair?” Éclair and Cinque said at ounce in a very awkward tone.<br>\r\n<br>\r\n“So!” Milhe turned upon Rico. “Where are the aprons and where do we start!”</span></div></div>",
            "created":1392774720,
            "id":1748109,
            "title":"Perhaps seconds are in order?"
        },
        "1111121221":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Free Choice",
                "Free Choice"
            ],
            "content":"<div class=\"\"><div> <span>The four began their work, making sure to tie aprons around their waists and washing the stations and their hands. Before they even started, Rico had to go over the details in baking, how to make the flour, how to create the creme, chocolate glaze and all of the instructions needed as well.  With everything said, the four began to work, finding it easy to split up the work. Cinque and Milhe would work on the dough, Eclair would work on the chocolate glaze and Rico would work on the creme. Heading over to Milhe, Cinque got a good look at the pink haired girl, finding even an apron to make her look rather adorable. <br>\r\n<br>\r\n\"So ready to get started?\" he said with that bright smile of his. She gave an eager nod and began. They first started with stirring up the batter, making sure to put in the right measurements and such. <br>\r\n<br>\r\n\"This is going well huh Cinque?\" said Milhe as he watched as he stirred the bowl in a rigorous manner. With a smile, she lightly tapped his face with a bit of flour. Feeling the touch, he looked up to see Milhe giving a soft laugh. Touching his cheek, he saw the bit of flour that got on his fingers.<br>\r\n<br>\r\n\"Milhe?\" With that, she lightly tapped him once more, letting out a giggle this time. Placing down the bowl, he took a bit of flour and tapped her back. The second he touched her face, he felt just how 'soft' the dog eared princess was. <br>\r\n<br>\r\n\"Stop flirting and get back to work!\" yelled out Eclair, her face red with anger from seeing such a 'cute' exchange. The two let out a laugh and went back to work, not even fazed by Eclair's accusations. With a frown, she went back to her own work. Rico saw the whole situation and let out a small giggle, she really was hoping that Milhe and Cinque confess their feelings for one another. All four continued on with their work until all the parts were ready. Handing the dough to Rico, she shaped and rolled it into equal parts, placing that bit into the oven. <br>\r\n<br>\r\n\"Good job so far, but we probably need to pick up the pace.\" explained Rico as she observed the dough baking in the oven.<br>\r\n<br>\r\n\"Well I don't want to involve the kitchen staff, I do want them to rest and give them the treat.\" said Milhe, trying to think of a possible solution. <br>\r\n<br>\r\n\"What if we try to use magic?\" suggest Cinque, recalling the possibility of magic being used to create food from Rico earlier that day. </span></div></div>",
            "created":1401723540,
            "id":1805982,
            "title":"Tip Taps Tip"
        },
        "11111212211":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Let's split the batch in half. Half for us, half for the staff.",
                "Ummm, can I have them? Pretty please?"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh? That sounds wonderful!\" Milhe exclaimed. \"If we are going to make the treats for the staff we do need to make a lot, and I fear we may run out of daylight!\"<br>\r\n<br>\r\n\"Sound good everyone?\" Asked Cinque as he turned towards his fellow two cooks.<br>\r\n<br>\r\n\"Works for me. I need to get back to drills at some point anyway.\" Eclair shrugged.<br>\r\n<br>\r\n\"Leave it to me!\" Rico chirped. \"I know the just the spell to speed things up!\" She held out her hands and aimed it towards some kitchen utensils and chanted some words, and her hands glowed orange.<br>\r\n<br>\r\nThe kitchen utensils and tools glowed after, and they began to float and move, much to everyone's surprise!<br>\r\n<br>\r\n\"Sentience Magic? Where did you find time to learn that Rico?\" Asked Milhe turning towards her short dog-eared friend.<br>\r\n<br>\r\n\"Archives! Now, Cinque, can you add in that vanilla to the cream for the next batch?\" She asked. \"I'm too short to reach it.\"<br>\r\n<br>\r\n\"Already half-done!\" He leapt up and open a cabinet door, inspecting several different bottles containing vanilla. Since there's going to be a lot of mouths to feed...the bigger one can work! He grabbed that and leapt back down.<br>\r\n<br>\r\n\"Improving leg strength?\" Asked Eclair towards her fellow blond champion of Biscotti. <br>\r\n<br>\r\n\"Yep! Keeping in tip-top shape for whenever the next war comes around!\" Cinque flexed off his muscles a bit.<br>\r\n<br>\r\n\"Okay, so, with this batch do we add them to the batch for the servants or-\" He was cut off by the sound of a growling stomach, mainly one coming from Milhe, making the princess' cheeks as pink as her hair.<br>\r\n<br>\r\n\"O-Oh dear...Well...\"</span></div></div>",
            "created":1401867000,
            "id":1806946,
            "title":"Free Choice"
        },
        "111112122112":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Free Choice",
                "Free Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Hm, since this one is a batch we made ourselves, it doesn't hurt if we let Milhe have it. We are making more after all.\" said Cinque as he stared at the dog eared princess who still sported a rather red blush on her normally pale face. Rico and Eclair looked at her as well, finding her to be rather cute right now. A quick idea formed in Rico's crafty mind. Taking the now finished eclairs and placing them on a platter, she put them in Cinque's arms.<br>\r\n<br>\r\n\"Eclair and I will take care of things here. Take Milhe into one of the dining rooms and take care of her.\" said Rico with a wink as she pushed the two out of the room. As Eclair watched the whole thing, another frown formed on her face. <br>\r\n<br>\r\n\"I really do dislike how you're always pushing them together. You shouldn't force things like this.\" <br>\r\n<br>\r\n\"What? They like each other, I'm doing them a favor. Anyways let's get back to work. Help me out with the magic.\" said Rico, her hands glowing with an orange light as she commanded the bowls and utensils to move around, mixing the necessary ingredients. Eclair helped out by taking out more bowls and setting up the materials to be used.  With this pace, they would probably be done in an hour or so. Meanwhile, Cinque led Milhe to one of the numerous dining halls in the castle, this one being a bit more private than the others. Approaching the door, Milhe unlocked it, leading to a single room with a very long dining table, a few cabinets and numerous chairs. Walking forward, Cinque placed the eclairs on the tabled while Milhe closed the door behind them and locking it. She wanted privacy after all. Walking over, she sat down right next to Cinque, the light blush still on her face. <br>\r\n<br>\r\n\"Well, I guess we're alone now.\" she said, her voice rather low. Cinque nodded, feeling his own face grow red. Still, he had a rather interesting idea. Taking an eclair, he slowly presented it to her mouth.<br>\r\n<br>\r\n\"Here, open up.\" he said with a bright smile. She nodded and let him feed her, taking a bite out of the sweet treat. Just like before, they came out perfectly, tasting like absolute wonder. <br>\r\n<br>\r\n\"Is it good?' he asked as she ate the rest of the treat in one bite. She nodded vigorously, feeling a rather warm sensation emanating from her core. <br>\r\n<br>\r\n\"Yes, it really is.\" With a nod, he continued, feeding her eclair after sweet eclair. <br>\r\n<br>\r\n\"Ah, you have a bit on your cheek, Hold on, let me go get a napkin.\" said Cinque as he was about to sit up.  The creme was right near her lips so it would be easy to remove with a cloth.  However, Milhe grabbed his hand, her face once again dyed in a reddish color. <br>\r\n<br>\r\n\"N-Not that way, there's another way you can do it.\" she said in a rather shaky voice.  He looked at her, seeing her red face made his mind finally make the connection.<br>\r\n<br>\r\n\"Are you sure?\" Milhe gave him a soft nod. With this, he took in a breath and came closer the girl, holding her by the shoulders. Slowly, he inched his face closer to hers and kissed the corner of her lips, tasting the sweet frosting. He gently pulled back to find her with a soft smile and warm face. <br>\r\n<br>\r\n\"Should we continue?\" asked Milhe as she pointed to the rest of the eclairs on the platter. <br>\r\n<br>\r\n\"Of course.\"</span></div></div>",
            "created":1401895320,
            "id":1807020,
            "title":"One and One"
        },
        "1111121221121":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Free Choice",
                "Free Choice"
            ],
            "content":"<div class=\"\"><div> <span>Cinque brought a chair right next to the pink haired princess of Biscotti and took another eclair.<br>\r\n<br>\r\n\"Say 'Ahhhh'.\" He smiled lightly, holding the treat up, aimed for her mouth. <br>\r\n<br>\r\n\"Ahhhh.\" And Cinque slowly started to ease it in her, giving her time to chew and swallow, hearing her cute \"Ahhhh\"s again with each time he fed her an eclair. And whenever he saw a speck of cream near her lips, he would draw near and give her a kiss, cleaning her. The girl would blush deeply, her face being redder and redder as he continued to feed her. He noticed her tail behind her wagging constantly.<br>\r\n<br>\r\n\"Ummm, Cinque?\" Asked Milhe as she finished swallowing Eclair Five. She turned her head around, looking towards the sofa. \"Wanna move this over to the couch? You can shuffle the table over if you like.\"<br>\r\n<br>\r\n\"Sure, what you got in mind?\" HE asked as he stood up and helped Cinque to her feet. He noticed a slight curve in her dress as she sat down at the sofa. The blond moved some chairs aside and dragged the table over more closer to the sofa.<br>\r\n<br>\r\n\"Well, while you feed me, can I...rest my head on your lap?\" Asked the princess nervously.<br>\r\n<br>\r\nHead...resting on lap!? Steam came out of Cinque's ears at the prospect of it all. This truly was the beginning of something beautiful!<br>\r\n<br>\r\n\"I uhhh..yeah I'd like that!\" He rubbed the back of his head as he sat down. Biscotti's champion felt the girl lie down, resting her head on his legs and looking up.<br>\r\n<br>\r\n\"Okay,\" smiled the boy as he ruffled behind her ears, making the girl moan slightly and even...move her leg!?<br>\r\n<br>\r\n\"You are such a puppy-girl.\" He chuckled as he began to place the Eclair up to her mouth, and Milhe took it without object, eating and moaning as she felt her ears getting some loving and the texture and creamy filling of the treat.<br>\r\n<br>\r\nAnd she had many many more to go.</span></div></div>",
            "created":1401954240,
            "id":1807420,
            "title":"Free Choice"
        },
        "15":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Yukikaze Panettone ",
                "Leonmitchelli Galette des Rois",
                "Noir Vinocacao ",
                "Jaune Clafoutis",
                "Even more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More characters for your enjoyment</span></div></span></div>",
            "created":1323579600,
            "id":1237850,
            "title":"Other characters"
        },
        "153":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "We follow our Genoise down to Vannette, Noir is feeling a bit hungry?",
                "We now go to Leon, who is taking a bath in the river...",
                "Readers choice?"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n<br>\r\n<br>\r\n <br>\r\n <br>\r\n<br>\r\n<br>\r\n<br>\r\n\"Hurray! It's almost completed!\" Cheered a perky dog girl within the confines of Firianno Castle. Riccota \"Rico\" Elmar, the head scientist of the Biscotti Regime has finally created her unique elixer.<br>\r\n<br>\r\nA week ago, she was approached to by Princess Millhiore due to a concern with the health of the Biscotti troops. It turns out that many of them are becoming more and more tired through out the various war games with Galette and it's not just a matter of physical conditioning but rather of exhaustion. Wherever the heroes are not fighting at, the fighting could sometime rage on for hours on end, and even with peak physical condition the Biscotti soldiers cannot seem to catch up to the Galette troops. As it turns out thanks to an observation by Imperial Guard Captain Eclair Martinozzi, the Galette troops have been drinking some kind of substance. After the war game(Biscotti won but barely) the higher delegates of both city-states met in regards to whether or not this new substance some of the Galette troops are illegal or performance enhancing. As it was revealed, it was simply an energy drink and not a perfomance enhancing drug of any kind, as Leonmitchelli Galette Des Rois, the cat-people's monarch, allowed the Princess and Hero Cinque Izumi to inspect the facility that churns out the energy drinks. And so Millhi has asked Rico to craft a caffine drink of some kind to give the Biscotti soldiers a boost.<br>\r\n<br>\r\n\"Only a little more...\" She said, inspecting her machine as it was churning and twirling the liquid within and drank some water from a nearby mug.<br>\r\n<br>\r\nAnd as the giant blender chimed, signaling it's completion, Rico's tail stood on end and wagged. It was done! She took a mug and placed it under a faucet attached to the machine and allowed some of the substance to pour out. She took a sip...<br>\r\n<br>\r\nAnd blanched.<br>\r\n<br>\r\n\"Eeek! Too sour!\" She blanched. She gave a sigh. \"I suppose I was too optimistic in thinking I'd get it right on the first try...maybe I need to add more sugar...\" The brunette dog-girl thought outloud. She looked back at the pitcher which contained the leftover substance. \"Eh, might as well scratch this.\" She took the pitcher and and poured it out of her window...<br>\r\n<br>\r\nAnd down into the stream below. She 'eeped' when she relaized she poured out the juice into the river.<br>\r\n<br>\r\n\"Hopefully no one saw that...\" Rico mused. \"Well,\" she bounced, grin back on her face. \"Back to the drawing board!\" She began to tinker with her experiments and materials again.<br>\r\n<br>\r\nDown below, the light blue liquid began to merge in with the water as the stream flowed right into Galette lands...<br>\r\n<br>\r\n-X-<br>\r\n<br>\r\n\"I'm going to grab some water,\" mused a short girl in monotone as she treaded near the river, canteen in hand. Noir Vinocacao was traveling with her fellow Genoise members, Jaune Clafouti and Vert Farberton down to Vannette City for a meeting with the Prince Gaul on some new development in which they are in the dark about.<br>\r\n<br>\r\nThe dark haired girl took the canteen, took the pure river water, and took a swig slightly. She smacked her lips noticing how the water had a unique taste that she couldn't describe.<br>\r\n<br>\r\n\"Better head back...\" She droned as she stepped away from the river and headed back to her fellow Genoise members.</span></div></div>",
            "created":1347387300,
            "id":1425224,
            "title":"Noir Vinocacao "
        },
        "155":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Vert Far Breton ",
                "Rebecca Anderson ",
                "Nanami Takatsuki"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last Batch</span></div></span></div>",
            "created":1323581460,
            "id":1237851,
            "title":"Even more"
        },
        "1553":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Nanami Takatsuki",
                "Couvert Eschenbach Pastillage",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We aren't even close to all the girls in the series.</span></div></span></div>",
            "created":1600508340,
            "id":2905846,
            "title":"More Girls"
        }
    },
    "info":{
        "author_id":"okamialpha",
        "author_name":"okamialpha",
        "brief_description":"A weight gain interactive about the Dog Days anime. Feel free to add!",
        "created":1323581100,
        "description":"<td align=\"left\" class=\"norm\">Welcome to the Dog Days interactive! Here we serve all the weight gain dreams that you could ever wish for.  For starters lets set some rules.  <br>\r\n<br>\r\nFemale Weight gain only. (Other writers here are very biased against female wg, so only returning the favor)<br>\r\nNo slob<br>\r\nNo extreme, sudden weight gain<br>\r\nPairings are fine, but have a warning if you're going to include anything of the 'smut' variety.  <br>\r\nAlso please if you add, make nice and coherent chapters.  We want quality here.</td>",
        "id":1832130,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600508340,
        "modified":1600508340,
        "pretty_title":"Dog Days Female Weight Gain Interactive"
    }
}