{
    "chapters":{
        "1":{
            "author_id":"johnluvfeet",
            "author_name":"johnluvfeet",
            "choices":[
                "Josh wakes and  decides to play more with his body.",
                "He decides  in the am to play with his  family and make them do things to him.  ",
                "the next day he starts to control  his family and removes  their heads  for fun.",
                "Josh  makes  his body drive him to the mall for some malicious  fun.",
                "Josh  creates  clones  of his  family  for his family to play with."
            ],
            "content":"<div class=\"\"><div> <span>Josh awoke  one night  horny,  he had a dream  that he was making out with himself,  weird  he  knows,  but Josh  being bisexual  loved his own body.  Well as he  thought  about this dream  he  suddenly felt  movement  next to him in bed,  He turned  to see his own body laying in his same pjs  next to him.  His body  acted like it was  still sleeping   but  it's  eyes  were open, no emotion.  Josh decided to try something,  Lift your arms\"  he said,   and  his  cloned  body did so,  Josh's cock was already  fully erected,  Josh then wanted  to  play wit his  clone  body,  he told it to  rub him  with it's  feet  as Josh loved  feet and his own feet.  Josh  was in heaven and orgasmed quickly,  and  his body kepted  going until told to stop.  Josh  then has  his body  suck him off too  but  he  went on and had the night of his life.   Once  tired Josh  fell asleep in the arms if his clone body and  then had  more dreams,  now these  dreams  were not only on jhis own body  but  his  family's  now too.  Josh is in for some fun.  </span></div></div>",
            "created":1350245040,
            "id":1446730,
            "title":"The  beginning"
        },
        "12":{
            "choices":[
                "Crystal calls a friend (girl)",
                "Mom walks in",
                "Josh calls a friend (girl)",
                "Josh calls a friend (guy)"
            ],
            "content":"<div class=\"\"><div> <span>  Josh has never had sex before, today was the perfect day. He made a list in his mind of who he wanted and what he wanted them to do. This was anybody's sexual fantasy, to get whatever they want. Josh decided the first person he sees is getting it, as he walked into the family he peaked around the corner to see who it was. Crystal, he's never thought about family either but having this new ability anyone is fair game to him in his mind. He walks over to her and with the single touch she's now under his control and doesn't know it. \"Josh what the fuck are you doing!\" She said as he pushed her down on her back. He got up and undressed himself, then took off her cloths. \"Oh my god why can't I stop this!\" Crystals lips quivered in a look of disgust and humiliation as her brother inserted himself into her. Josh was already making weird expressions on his face because he was thoroughly enjoying his sister. \"Josh...\" Crystal sentence muffled into Joshs mouth when he shoved his tongue in her mouth. Being able to do anything he learned her sexual fantasies and he was about to use them.<br>\r\n  Josh rolled her on top and sat straight up, lightly brushed his lips against her breasts making his way to her neck. Crystal didn't like this but was starting to grow curious and turned on. She put her arms around him but was still resistant. Josh gently bit the side of her neck and made his way back down kissing her breast. Crystal gave in and put her weight on him. Josh started pumping and Crystal started grinding, they were both so focused on pleasuring themselves they didn't pace themselves and soon they erupted in extacy. Disappointed that the moment was over Josh thought of something, he moved her face to his and starting making out. Soon he started to thrust in her again and made them cum again. Josh didn't stop, he kept making him and his sister cum, hers started to slide its way down his cock covering it completely. Then it wasn't long till Crystal felt herself filled up by Joshs cum, the gathered their breath and laid down next to each other.</span></div></div>",
            "created":1377798720,
            "id":1653638,
            "title":"He decides  in the am to play with his  family ..."
        },
        "124":{
            "author_id":"laura3",
            "author_name":"L3",
            "choices":[
                "I told Charlie to just come straight up to my room.",
                "I was ready for my cousin.",
                "More Ideas"
            ],
            "content":"<div class=\"\"><div> <span>After I got back to my room I called up my cousin Charlie, we grew up together and as time went on Charlie told me that he likes boys, so I thought \" I have never been with a boy before and I wondered what sucking a boys cock would feel like\"  so I asked Charlie if he wanted to come over and play with me .<br>\r\n<br>\r\n\" Wow cousin, I would love to come and play with you, what did you have in mind ?\"  I only answered \" We will play truth or Dare, but only with us.. the XXX rated version \".<br>\r\n<br>\r\nCharlie said that he would be right over....</span></div></div>",
            "created":1584620340,
            "id":2803669,
            "title":"Josh calls a friend (guy)"
        },
        "13":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Josh Swaps Their Heads Around, Giving Crystal His Dad's Head and So On",
                "Josh Removes Their Minds, So That They're As Mindless As His Clone",
                "Josh Makes His Dad Gay and Turns His Mom and Sister Into Lesbians",
                "Josh Makes His Family Not Only Okay With Gays, But Also Okay With Incest",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>The next morning, Josh woke up, thinking that having sex with his clone was just a weird (but fantastic) dream.  But upon seeing the person lying in bed with him, he saw that it wasn't a dream after all.  He really <i>had</i> dreamt up a clone version of himself!  Now he began to think about other ways he could use these new-found powers of his.<br>\r\n<br>\r\nHe already had fun with himself, so to speak, so why not do something with his family?<br>\r\n<br>\r\nSmiling, he headed down to breakfast.  As usual, his family was sitting around the kitchen table.  There was his 19-year old sister Crystal (blond hair, C-cup breasts, and thin), his 45-year old mom Jennifer (light brown hair, C-cup breasts, and slightly overweight), and his 47-year old dad John (brown-slightly-graying hair and a little overweight, mostly in his gut).  All of them were conservative types and were somewhat religious (they didn't attend church every week, but they still considered themselves to be denominational).<br>\r\n<br>\r\nJosh was secretly bisexual.  He never wanted his family to find out, as they weren't all that supportive of gay people.  But with his new-found power, maybe he could do something about that.  He didn't know how he knew, but he knew that he could make anything he wanted come true.<br>\r\n<br>\r\n\"Morning, sweetie.  You want anything?\" his mom asked him, the moment he entered the kitchen.<br>\r\n<br>\r\n\"Actually, yeah,\" Josh answered, then began to fantasize in his mind what he wanted to happen.</span></div></div>",
            "created":1401150120,
            "id":1802875,
            "title":"Josh Starts Controlling/Changing His Family"
        },
        "133":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Keep Their Memories the Same ... They Freak Out at Their New Homosexual Feelings",
                "Change Their Memories So They Believe That It's Normal For Them to Be Homosexual",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Josh decided to turn his dad gay and turn his mom and sister into lesbians.  After all, if they were homosexual, then they certainly wouldn't have a problem with Josh being bisexual, right?<br>\r\n<br>\r\nBut should he keep their memories the same or not?  It might be kind of fun (in a mean kind of way) to see them trying to cope with being gay when they're so against it.  On the other hand, it might be nice to have a family that he could better relate to, if he changed their memories to make them think that they've always been gay.<br>\r\n<br>\r\nWhat should Josh do?</span></div></div>",
            "created":1401151200,
            "id":1802880,
            "title":"Josh Makes His Family Homosexual"
        },
        "1333":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Keep Their Memories the Same ... They Freak Out at Their New Bisexual Feelings",
                "Change Their Memories So They Believe That It's Normal For Them to Be Bisexual",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Then again, if Josh <i>really</i> wanted his family to relate to him, why not make them bisexual like him?  Yeah, that sounded like a better idea.  But should he keep their memories as they are, or make them believe that they've always been bisexual?</span></div></div>",
            "created":1401151500,
            "id":1802885,
            "title":"Why Not Make His Family Bisexual Instead?"
        },
        "135":{
            "author_id":"ananymph",
            "author_name":"Yea",
            "choices":[
                "Reader's choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else?</span></div></span></div>",
            "created":1584614760,
            "id":2803639,
            "title":"Something Else"
        },
        "15":{
            "choices":[
                "Explain what happened to Crystal and Jennifer, then have the real deal",
                "Josh waits for his dad to be done for his turn",
                "Josh grabs his clone and his dads",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Josh lines up each member in the family as your real family walks into the living room. \"They can cook, they can clean, but what they'll do to you is whats amazing.\" Josh said, his family looks at him confused and slightly grossed out. Crystal walks straight to her room while mom and dad stay to have a talk with their son. \"son\" the dad said, \"At your age I know sex is on your mind a lot, but inside the family is an area that shouldn't be crossed.\" Silence fell on the room, Joshs mom and dad left to go to their room, Josh was shocked he surely thought they would like this. He thinks to himself maybe he is the only one that has these thoughts. When night came Jennifer and Crystal left to go, Josh was sitting in the living room still thinking about earlier when he realized his sister and mom clone were gone. Josh walks to his dads room and peeps open the door, he sees his sisters clone sitting on the floor against the bed getting her mouth humped by his dad. He lets out his cum in her mouth and pulls out to let the rest on her lips, he backs away and Josh sees his moms clone kiss the cum off of Crystals clone. Millions of thoughts ran through Joshs head about what he'll do but his main thoughts were he's not alone, and theres going to be a lot more fun going on in this house.</span></div></div>",
            "created":1358871300,
            "id":1514140,
            "title":"Josh  creates  clones  of his  family  for his ..."
        },
        "153":{
            "author_id":"hdude999",
            "author_name":"hdude999",
            "choices":[
                "He is excited and wants to join.",
                "He is unhappy and about to lecture Josh.",
                "One of the clones does something."
            ],
            "content":"<div class=\"\"><div> <span>\"Huh,\" thought Josh. \"Dad said this wasn't okay but now he's using the clones? Mom is off somewhere and so is sister...\"<br>\r\nHe went downstairs and found his father-clone sitting in a chair, next to his own clone.<br>\r\n\"I am so hot,\" Josh thought. Then he whistled. His clones and his father's clone looked up.<br>\r\n\"Do you want to fuck?\"<br>\r\nThey were clones he created for his own purposes, from his own dreams. Of course they did. He lead them directly outside his father's door. As he listened to his father call his clone-wife and clone-daughter cunts, whores, bitches and worse, he slowly helped his clone strip his father's clone.<br>\r\nHe bent down to his dad-clone and asked \"do you want to be called those words?\"<br>\r\nThe father-clone nodded.<br>\r\nJosh looked up at his clone. They nodded agreement. With their cocks hard, they each took one hole. His clone thrust his cock into the father-clones mouth.<br>\r\n\"Oh yeah dad, you slut-- you whore made for my dick only,\" Josh said loud enough that his father could hear. <br>\r\n\"I need your cock Josh,\" his father clone said, as the clone pulled out and thrust back in again.<br>\r\n\"You are made for me to use you,\" Josh said at the same time as his clone. The clone grabbed him and they kissed, their tongues playing lightly over each other.<br>\r\nThe father-clone screamed they should be fucking him more and harder. <br>\r\n<br>\r\nJust then, Josh's actual father emerged from his room.</span></div></div>",
            "created":1506490200,
            "id":2392450,
            "title":"Josh grabs his clone and his dads"
        }
    },
    "info":{
        "author_id":"johnluvfeet",
        "author_name":"johnluvfeet",
        "brief_description":"You are  an average  horny 18yo, your name is Josh and your wildest  fantasy comes true.",
        "created":1350244560,
        "description":"<td align=\"left\" class=\"norm\">Josh an 18yo boy  who lives  at home wakes  up in the middle  of the night  feeling very horny.  Josh doesn't  realize it yet but he now has the  power to control  anything he wants  or  create  anything.  He has the ultimate power to just think  of what he wants. It can be anything.<br>\r\n<br>\r\nCharaters:<br>\r\n<br>\r\nyou - Josh  18<br>\r\nJennifer - 45 Mom<br>\r\nJohn - 47 Dad<br>\r\nCrystal -  19 older  sister<br>\r\n<br>\r\n<br>\r\nfeel free to create new characters<br>\r\n<br>\r\nAnything goes  folks,   incest,  sex,  foot worship,  even  gory weird scenes  in good taste (like  fantasy  dismemberment where limbs remain alive for  sexual fun)  I don't  really  care,  have fun and  be imaginative!!!   <br>\r\n</td>",
        "id":1897851,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1584620340,
        "modified":1584620340,
        "pretty_title":"Fantasy Control"
    }
}