{
    "chapters":{
        "1":{
            "author_id":"brosus",
            "author_name":"Brosus",
            "choices":[
                "President Matsudo's Ambition",
                "Kaede and her Michievious Daughter",
                "This is (Not?) a Toilet!",
                "Eating Ghost, Surviving her Tummy",
                "Assorted endless possibilities!"
            ],
            "content":"<div class=\"\"><div> <span>A picture can say a thousand words. A game can say tens of thousands. In my opinion, each of Ochiko Terada's works contain a potential epic if you take it down your own imaginary path - why not share that with the world?<br>\r\n<br>\r\nWARNING! This interactive allows everything: sex, crushing, futa, farting, scat... if it's in one of OT's pics or games, you can add it in here. Keep characters the same gender they were in the art/first mentioned chapter, though.<br>\r\nThe only rules are that the posts must be quality and legible. I'll edit to some degree, but if it's a mess it may just get thrown out, sorry.<br>\r\n<br>\r\nWhen you're writing a chapter, please tag in the first part of the title if there will be graphic content: (V) for violence (T) for toilet/scat/fart (F) futa or male.<br>\r\n<br>\r\nTo prevent a ton of choice chapters, here's how it'll start organizationally:<br>\r\n<br>\r\nChoice 1: President Matsudo's Ambition, Ochiko's game where a schoolboy is shrunk and toyed with by a crazy scientist girl of questionable hygiene and her trap friend, where you'll choose who you play as.(I encourage you download the game if you haven't, but you can find playthroughs easily.)<br>\r\nChoice 2: Adventures of Kaede and her Mischievious Daughter who teleports people and cities into her mother's privates and underwear (Warning, image gallery for context with scat and graphic content: <a rel=\"nofollow\" href=\"http://g.e-hentai.org/g/672114/59fe019f1f/\" target=\"_blank\">http://g.e-hentai.org/g/672114/59fe019f1...</a> )<br>\r\nChoice 3: This is (Not?) a Toilet! This covers any of the art from the 'not a toilet' series. I won't link them here, but there's a broad spectrum... and it'll mostly be toilet based, obviously.<br>\r\nChoice 4: Eating Ghost, a personal preference, this is about a ghost lady that eats special treats (tinies) that survive as they go through their body... allowing for internal interaction, or if you want to be really creative, you could even try eating a sweet the opposite way it's intended... I'd like to see descriptions of the insides and how tinies survive - do they stay and live off filth, try to escape in burps or through the back? Who knows! (Graphic link: <a rel=\"nofollow\" href=\"https://e-hentai.org/g/978219/b481f35bbc/\" target=\"_blank\">https://e-hentai.org/g/978219/b481f35bbc...</a> )<br>\r\nChoice 5: any art or art sets or games left out of the mains ones! Personally I intend to bring in the 'old loli' at some point. Make sure to always leave room open for more adds!<br>\r\n<br>\r\nAny more info to be added here. GOOD ADDS GET A REQUEST CHAPTER FROM ME, EITHER ON HERE AS A FOLLOW UP TO THEIR POST, TO ANOTHER OCHIKO ART, OR A POST TO THEIR STORY!<br>\r\nFeel free to message me with requests~ Those who add the most may have their stories linked here...</span></div></div>",
            "created":1546837200,
            "id":2600470,
            "title":"Ochiko's Neverending Universe~"
        },
        "11":{
            "author_id":"brosus",
            "author_name":"Brosus",
            "choices":[
                "Sadochai Taiyou, abused Kouhai",
                "President Matsudo, the evil scientist",
                "Kotoko-chan (the trap)",
                "A new prospective member to the club...",
                "Some kid the president already used the shrinker on!"
            ],
            "content":"<div class=\"\"><div> <span>In President Matsudo's Ambition, typically things start off with Sadochai Taiyou, who then searches the lab, and his adventure continues from there. If you want that, then choose the oh so original choice one.<br>\r\n<br>\r\nIf you want to take control, use the serum to shrink and control who you want - or maybe you were hiding a growing serum AFTER all - choose to be President Matsudo herself.<br>\r\n<br>\r\nKotoko-Chan is a wild card. Maybe he wants to steal the serum and take control, breaking free of being Matsudo's plaything... or maybe when Sadochai is too late Matsudo uses 'him' instead. Want to find out?<br>\r\n<br>\r\nYou could be a random schoolgoer looking to join a club, weirded out by the frantic waving everyone but the president gives you as she thrusts a contract - or a cocktail - in your face.<br>\r\n<br>\r\nOr you could be in a petri dish waiting to be abused by any of the members walking by. Since only Matsudo knows about you, hopefully Kotoko-Chan doesn't brush by with 'her' skirt, sending you flying up it, or onto Matsudo's chair... or who knows what Sadochai's carelessness could do to you. Well you probably complained about the president's obvious smell, so you probably deserved it anyway.</span></div></div>",
            "created":1546837200,
            "id":2600484,
            "title":"President Matsudo's Ambition"
        },
        "111":{
            "author_id":"brosus",
            "author_name":"Brosus",
            "choices":[
                "Follow the call of the president. (Normal)",
                "Examine some devices, drink a strange liquid. (Unaware)",
                "Go talk to Kotoko about her... costume? (Fuck the system. Pres may be mad.)"
            ],
            "content":"<div class=\"\"><div> <span>Entering the room with a sigh, you have a bad feeling about today. Sure you get to see your cute senpai you have a crush on and... is that another girl? No. It's Kotoko in drag.<br>\r\nThis is the problem you have with this club. If you weren't so into the President, you'd have no problem ditching this 'club' where the members were basically guinea pigs, but... something made you stick around. Maybe senpai would finally notice you. Like that would happen. At least some of her experiments let you get indirect kisses through beakers, and she wasn't very careful about panty shots...<br>\r\n<br>\r\n\"Hey! Kouhai! Come over here, I need you for an experiment.\"<br>\r\nYou sigh. You're basically just an object to her anyway. What's the point, you could do anything in this room and it would have the same effect.</span></div></div>",
            "created":1546837200,
            "id":2600485,
            "title":"Sadochai Taiyou, abused Kouhai"
        },
        "1112":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "choices":[
                "Catch a ride on Matsudo's loafers",
                "Climb up on a chair to get her attention... or a glimpse of her underwear",
                "Find a better vantage point"
            ],
            "content":"<div class=\"\"><div> <span>Matsudo Nako's body reflects off some plastic vials, along with the computer she's seated at. Translucent bubbles rise within one such container, emphasizing the curve of the club president's backside. That doesn't do much to help the fact that her back's turned to you, as she fiddles with a computer.<br>\r\n<br>\r\n\"You comin', Sodachi?\" Her tone's low and distant, even though the room's not very large. Metallic <i>dings</i> cross the uniform grey walls, as she taps her hand across a ray gun. You shiver at the sharp noise. Kotoko is deep in his book - <i>The Other Sex</i> - and doesn't bother looking at you, giving naught but a little wave. Like he's in his own little world. If only you could be as carefree...<br>\r\n<br>\r\nShe keeps tapping the weapon. \"I said I need your body for somethin'.\"<br>\r\n<br>\r\nYou put your hand on a test tube. \"I-in a minute, Senpai!\"<br>\r\n<br>\r\nThe president sniffs, playing with her glasses. \"Damn coward. Make it quick, whatever you're doing.\"<br>\r\n<br>\r\nTaking the beaker out, you look at its mouth. There's a small print of moisture from Matsudo's lips. Matsudo's cute, pearly lips, which rise in a perfect smile whenever she has a bright idea, perfectly complementing her cute button nose. The heavenly pillows whose soft touch always been right out of your grasp... Is that because you've been a \"coward\", as she said?<br>\r\n<br>\r\nIf you're going to act as guinea pig today (or if you're going to finally stand up to her) you'll need a bit of courage. Possibly liquid courage. Your blue eyes dart left and right. Nobody's watching. Your head's burning. Quickly, you nip a taste of Senpai's lip prints. It tastes of bitter coffee and breath mints. Your eyes shut as you imagine you're stealing a kiss from the stunning, studious president herself. In your dream, her eyes are trembling behind those cute, round Coke-bottle glasses, entirely engulfed in your bold embrace.<br>\r\n<br>\r\nThrowing yourself deep into the fantasy, your quivering hands send liquid from the vial down your throat.<br>\r\n<br>\r\n<b>Ulp.</b><br>\r\n<br>\r\nYour heart skips.<br>\r\n<br>\r\nYou stumble, trying to put the vial back as if nothing happened. It clangs with other similar mixtures. <i>Fwoosh.</i> Translucent juice dribbles down over your clothes, soaking them. You groan, trying to wring traces of your rebellious sips out from your tie.<br>\r\n<br>\r\n\"Hoi, Soda-boy! Wazzat you?\" Senpai's seat makes a terrifying <i>squeak</i> as it scoots backwards.<br>\r\n<br>\r\nThat head rush quickly gives way to a sinking sensation of shame. She'll see you. What if that was an important, experimental potion? How can the president trust you after this? Part of you wishes you could hide from her, diminish out of view...<br>\r\n<br>\r\nThe lightness in your head soon becomes dizziness. The approach of President Matsudo's loafers echoes in your ears - <i>thump.</i><br>\r\n<br>\r\nYou're ready to throw up. As you blink, glimpses of bookshelves and chairs float in and out of view.<br>\r\n<br>\r\n<i>Thump.</i><br>\r\n<br>\r\n<i>The Senpai cometh.</i> You try to move, but your limbs feel too light; they stumble all over the checkered floor tiles, sending you falling. You find yourself curled up in a pathetic ball on the floor.<br>\r\n<br>\r\n<i>Thud.</i><br>\r\n<br>\r\nThat last step rings in your ear. Why hasn't she said anything yet? Normally, if a club member messed up one of her experiments, she'd be scolding them by now. From down here, with your head to the floor, the table legs seem to stretch high into the sky, a veritable climb upwards.<br>\r\n<br>\r\n<i>BOOM.</i><br>\r\n<br>\r\nAn earthquake? No; that's just vibrations from her harsh stomps. She only ever stomps like this when you're in deep trouble... But her expression looks as neutral and uncaring as usual, without a hint of anger. You see traces of confusion, deep in her faraway, chocolate-brown eyes. And Kotoko hasn't turned his head at all - even if these footsteps are so harsh, you can hear a groan of pain from the floorboards around. As Matsudo lifts her leg again, minuscule dust clumps lift from the floor, and hear the noise of her leg cutting through the air. And a flash of white...<br>\r\n<br>\r\n<i>THWOOOM~</i><br>\r\n<br>\r\nWhen the shaking subsides, you can clearly glimpse your club president's pure panties above you. You feel blood rushing to your head as the soft fabrics fill your eyes. So shameless - it's as if she doesn't consider you a man. In fact, has she ever ever acted as if you were a human, and not merely some lab rat? Her long, scrawny thighs rise anew, and you realize:<br>\r\n<br>\r\nSenpai isn't looking down.<br>\r\n<br>\r\nSenpai hasn't noticed you at all.<br>\r\n<br>\r\nIt isn't the floor-bound vantage point making the table legs (and Matsudo's legs) appear titanic... They really <i>are</i> humongous compared to you.<br>\r\n<br>\r\nYou've been shrunken by the vial's liquid.<br>\r\n<br>\r\n<i>THWWOOOOOMP~</i><br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://imgur.com/a/QMceuKC\" target=\"_blank\">https://imgur.com/a/QMceuKC</a><br>\r\n<br>\r\n\"Waaargh!\" Your involuntary shout lands on deaf ears, lost like a wind in the breeze, as the great quakes and winds from your Senpai's simple footstep end.<br>\r\n<br>\r\nAnd beside you, the brown, spotless loafer drags itself across the ground. The sheer scale of the shoe is breathtaking - not to mention that a behemoth shoe can twist with such grace. Scanning the room with a few loose steps, Matsudo thoughtlessly kicks landslides of loose dirt over your minuscule grey uniform. Even the imperceptible motes of filth are making you choke. You swear, if you ever get back to normal, to do a better job of cleaning. But when you think about it, this is probably the detritus and loose hairs that fell from Senpai when she was working late shifts in this lab. So it's not all bad...<br>\r\n<br>\r\n\"Yo, Kotoko - wasn't that Sodachi around here?\" The scientist's bitter, commanding voice reverberates across the room,<br>\r\n<br>\r\n\"Huh?\" Seems he wasn't there to witness your downsizing. \"Uh, I think so?\" You can barely spot him amid the great desks; just the bottom of his regulation female dress.<br>\r\n<br>\r\nThe regulation dress...<br>\r\n<br>\r\nYou look back up. Matsudo's pure black skirt flutters slightly over her legs. What were once thin and bony are now rivals to skyscrapers! But comparatively, they're far softer, glistening slightly from the faraway ceiling lights. Said lights make a glow surround her distant, dark hair clumps, almost resembling a faraway mountain's alpenglow; or a halo on a painting of a Christian saint. Maybe welcoming you to the pearly gates...<br>\r\n<br>\r\nShe sighs. \"He probably chickened out and left home.\"<br>\r\n<br>\r\nYou shout from below in protest: \"S-senpai! You know I'd never leave you, even if you treat me worse than garbage!\" But she still doesn't take notice.<br>\r\n<br>\r\nKotoko's soles kick in the distance. \"Maybe he drank an invisibility potion?\"<br>\r\n<br>\r\n\"Hmmh... Did I make any invisibility potions here?\" She taps her fingers amid the vials. As she leans in, the creasing ravines of pure white panty fabric cross her backside - clearly tracing the shape of her cute cheeks. It's literally all you can see when you look into the sky. It seems she hasn't noticed (or cared) about the massive wedgie across her. In fact, if you lean in the right way, there's the faintest outline of a bulging camel toe... Like distant, untouched paradise, a heaven of white fluff and pale flesh 85 meters from the ground.<br>\r\n<br>\r\nThe short (at normal height) pigtails fly as she shakes her head. \"Heck. It's been too long since I used those beakers. Last time I used 'em, I was pulling an all-nighter with loads of caffeine. I can't remember what I dumped in there...\" She sniffs it. \"Maybe nitro glycerin? Well, if we hear an explosion outside the room, we'll know it's Sodachi.\"<br>\r\n<br>\r\n\"Hm-hm.\" Kotoko doesn't seem to really be listening anymore; he casually accepts the fact that you might explode. And Matsudo, too, begins stepping over mountainous chairs to reach her computer desk.<br>\r\n<br>\r\nHow can either of the club members regard you with such little care? As if it isn't humbling enough, being at the feet of a 150-meter titaness. Any normal man would scream at such an insult.<br>\r\n<br>\r\nBut you are no ordinary man. As you regard the shifting plains of your Senpai's panties, a revelation dawns on you. This is an angle of her backside that she'd never willingly show you, or anybody. You have a rare chance to peek at her from any corner, sigh unseen. You can hear everything they said about you. Maybe - you dare think - approach her, touch her, and hold her, the way you'd always longed to. She won't be able to feel it, as tiny as your hands are, and as supple as the ravines of her flesh are.<br>\r\n<br>\r\nThe taboo sensation rushes over you. Sure, it might be a bit sketchy; but nobody would dare call you a coward after this. And anyway - isn't it the sworn duty of the Science Club to explore new boundaries? To view the world in a way nobody else would? To boldly come where no man has come before?<br>\r\n<br>\r\nBut then again, at your minuscule scale, the smallest twitch from her body can absolutely pulverize you. By the glazed, frustrated expression in her chocolate irises, it doesn't seem like she'll take much of an effort to watch where she steps - or sits. And as much as you admire her assets, you aren't up for idea of becoming fine red paste beneath them.<br>\r\n<br>\r\n\"Hmph, science waits for no man.\" Matsudo tapped her loafers beside you as she went back to her studies.<br>\r\n<br>\r\nYou considered your options going forward. To get Senpai to notice you - or not?<br>\r\n<br>\r\nAnd to think, all this, for just a covert smack of her lips...</span></div></div>",
            "created":1549170000,
            "id":2612278,
            "title":"At Matsudo-Senpai's Unaware Loafers"
        },
        "11122":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "choices":[
                "The front of the seat",
                "The back of the seat"
            ],
            "content":"<div class=\"\"><div> <span>The mighty seats that dotted the school lab's grey landscape would make it easier for your super-scale Senpai to spot you. And if President Matsudo saw you in this diminutive state, you're sure she'd want you to stretch your legs and experiment with your new body...  Or scold you for messing with her scientific concoctions. Or mistake you for a bug, and snuff you mercilessly beneath her towering loafers. All the more reason to stay off the ground, where every step from a normal human could mean death.<br>\r\n<br>\r\nAs another shrunken explorer once said: \"Gentlemen... to adventure!\"<br>\r\n<br>\r\nYou scale the side of the chair, putting one hand before another. It's easier than you'd thought; despite not being among the best climbers of your gym class, you progress up the metal pole at a comfortable pace. Did that elixir grant you superior climbing skills?<br>\r\n<br>\r\nYou know, of course, that when you get to the top, the unreachable canopy of her otherworldly panties will lie a little less out-of-grasp. A sense of sickness rises in your stomach - like you were breaking your president's trust, glimpsing something forbidden. But when you gaze at her moving in the distance; the gargantuan frame of her thin limbs sloping out with each stroke of the keyboard; the mass of wrinkles spreading across her blazer and skirt to accommodate their careful motions; you're just prompted to climb faster.<br>\r\n<br>\r\n\"Tch...\" Matsudo's tongue clicks in frustration, amid keypresses filling the dull air. \"Nothin' adds up. I type in 'February 6', so why does it come onscreen as 'June 2'? We'll never time travel to Princess Calamity's era at this rate.\"<br>\r\n<br>\r\nThe words echo across your spine, making you scoot down. Seems El Presidente's moved right into another experiment. She paces around, the continual \"thunk\" of her shoes pushing you down further. To think; any one of those were strong and heavy enough to flatten you, along with scores of other ants. If she were really this tall compared to you - in the range of 560 feet - she'd have no trouble crushing whole streets with every step. Eventually, you match the rhythm of her city-crossing steps, using the vibrations to bounce up.<br>\r\n<br>\r\nKotoko idly shifts forward. \"Uh, if I'm the only other club member here, will I be a test subject? For your shrinking ray gun, I mean...\" Even his brief, thoughtless scoot sends you off-balance, gripping the chair leg for support. It's a long drop down to the floor tiles.<br>\r\n<br>\r\nSo that's what the device would do... You sniffle. Are the fates conspiring to downsize you, no matter what you do? As if you weren't short enough to begin with...<br>\r\n<br>\r\nThe president turns his way - the creases in her skirt drifting waves in a vast ocean of navy blue. Between her right thumb and index dangles the invention in question. \"Thanks, but I'd hafta reconfigure this baby for that. It's attuned to only work with Sodachi's DNA.\"<br>\r\n<br>\r\nYou regain your balance with a hard grasp. Burning fills your cheeks. Did Senpai - did she make the device JUST for you? Your arms feel lighter.<br>\r\n<br>\r\n\"Huh?\" Kotoko's feminine features light up in confusion. \"Why him, specifically?\"<br>\r\n<br>\r\nYou brace yourself for it. The words President Matsudo never dared speak before you. Maybe, \"Because I think my Kouhai's cute!\", or \"Because my Kouhai belongs with me forever!\", or even \"Because I want to tease my Kouhai when he can't fight back!\"<br>\r\n<br>\r\nShe pulls her glasses up, and taps her brain. \"Sodachi lives alone. If something goes wrong, and he disappears... Nobody will look for him.\"<br>\r\n<br>\r\nA gasp catches in your throat. Your eyes feel sore. Even your fellow student is speechless. Senpai... That stings.<br>\r\n<br>\r\nFinally, you make it to the top of the chair. Two shallow, symmetrical craters greet you. It's an otherwise-imperceptible imprint of Matsudo's glorious ass, carved by many tireless hours of her studies and tests. When you catch your breath, the air has a faint trace of the nerd's familiar musk. Considering the president's legendary neglect of hygiene, and her tendency to eat meals at these desks, it makes sense that she'd leave a smell behind; though it isn't overpowering or unpleasant. Just a little remnant of your Senpai's labors.<br>\r\n<br>\r\nThe view below is stupefying. Did you really scale all that mass of metal? It's like looking down from the Statue of Liberty! A sense of accomplishment rushes over you, along with vertigo.  You pat yourself on the back. If only Matsudo could see you now, hair fluttering dramatically in the wind.<br>\r\n<br>\r\n...Wait, wind in the clubroom?<br>\r\n<br>\r\nNo; it's your Senpai's gigantic legs, passively generating a breeze as they pace around. At your scale, her thighs look sturdier and thicker than your apartment building. The way they flutter ahead, traveling yards in each side, flesh slightly rubbing against itself - it's breathtaking, watching great structures fall and rise again and again. You blush, turning your head away quickly from the lewd monoliths. But still, the omnipresent sounds of her footsteps and breaths incite your imagination. If she were really this big, it's easy to picture her carelessly trampling buildings... Or walking right through them, her slender legs destroying everything against their flesh. And she'd probably make a big show of plowing through your building, flashing a smug smile the entire time...<br>\r\n<br>\r\n*SNAP*<br>\r\n<br>\r\nThe noise jolts you to back to reality.<br>\r\n<br>\r\nMatsudo's nasal voice, closer and more booking than ever, rings through your bones: \"Ah! Of course! If I change the locale setting variables... Heh, I'll get the machine up'n runnin' in no time!\"<br>\r\n<br>\r\nWith a crack of her knuckles, she takes a seat to type it in.<br>\r\n<br>\r\n*Your* seat.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://imgur.com/a/v8xAkP0\" target=\"_blank\">https://imgur.com/a/v8xAkP0</a><br>\r\n<br>\r\nYour mind feels both frozen and fast-running at the same time. Her killer ass hangs above, a guillotine ready to smash you to a pulp with its entrancing wrinkles. The sudden twist of her rear end creates another draft - one so strong, it knocks you to your spine. Your vision seems to white out; but you quickly realize, it's the pale surface of her panty fabrics engulfing your view from above! The monumental cheeks peek out slightly from the undergarments, descending with a whistle. And you're standing right in the imprint they made, falling over yourself as you try to get to your legs.<br>\r\n<br>\r\nIn the chaos, you notice: Senpai's underpants have traveled fairly high up her hips. She has a wedgie large enough to engulf your whole body; and that camel toe from earlier is downright puffy, barely hiding any details of her mighty vulva's shape. Body heat washes over you as she gets closer, ready to land upon the chair and start working. The air feels thicker by her mere presence. You're hopelessly caught in the shadow of the oncoming pelvis. Your shouts, bidding her not to sit, drown into the web of white folds. As the lights shift around to accommodate her frame, the curves become even more terrifying.<br>\r\n<br>\r\nWith a \"HIIII~!\", you dash for safety towards...</span></div></div>",
            "created":1549429200,
            "id":2613900,
            "title":"Seat Scaling"
        },
        "111221":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "choices":[
                "Wait for her to get up",
                "Squirm like the wind"
            ],
            "content":"<div class=\"\"><div> <span>Your shoes pound on the rough chair's surface, dashing to the front. With any luck, you'd be able to slide between her oncoming thighs. The edge of the shadow nears... But the Matsudo meteor approaches faster. With escape in sight, and heat rising to your skull, you dive forward, arms spread out, hoping the gods of gravity will be kind to you on your descent.<br>\r\n<br>\r\n<i>Thud.</i><br>\r\n<br>\r\nAnd you undershoot spectacularly. You're left lying stomach-first on the chair, with no way to dodge the mass crashing on you.<br>\r\n<br>\r\n<i>SLAMMMmmmmmm~</i><br>\r\n<br>\r\nIt all happens in a shallow, warm breath.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://imgur.com/a/q7n57Cd\" target=\"_blank\">https://imgur.com/a/q7n57Cd</a><br>\r\n<br>\r\nSenpai's overpowering weight shifts onto you, squeezing your torso against her computer chair. Thick flesh and clothes compress your lungs, making it hard to even gasp, let alone shout. The crash rings in your ears, and your fingers twitch from the continuous vibration.<br>\r\n<br>\r\nSomehow, you're still alive, after the shaking dies down. On the plus side: thanks to your dive, you weren't crushed beneath that ass. However: the bulging outline of her pussy lips - which looked so inviting from afar - is now pinning you flat!<br>\r\n<br>\r\nWhy did your first touch of her intimate regions have to be like this...?<br>\r\n<br>\r\nBut then again, it's really soft. You blush, stammering for a moment, as you try to pull yourself together. Not the time to think about Senpai - lovely, smart Senpai - with a mountain of vagina pressing all over you, this could be a matter of life and death.<br>\r\n<br>\r\nA booming, womanly sigh rings out onto your body. \"Now, just copy-paste this variable here...\"<br>\r\n<br>\r\nPresident Matsudo types away at the terminal. Despite her usual cool demeanor, she's obviously excited by her recent breakthrough: heavy breaths above press and unpress you in a staccato rhythm. She shifts slightly in her seat; not enough for a normal human to take notice, but it fully engulfs your arms beneath the slit. Were it not for the cotton barricade, you'd be entirely consumed by the crotch, like an insect in a sticky Venus Fly Trap. In fact - when you push the panties, your fingers are fine enough to pierce through its worn threads.<br>\r\n<br>\r\nWith the deepest breath your compressed respiratory system can hold (inhaling a hefty whiff of warm, sickly-sweet air), you push up against the gigantic crotch's crushing weight. Minuscule fibers tickle your palms. The slight moisture from Matsudo's perspiration - built up on her clothes over at least one school day, probably more - makes it hard for your hands to stay put - both from the friction, and how the slimy texture makes your joints buckle. And when you actually can get a firm grasp, it's no use; your hands just sink right in, pushing into her womanhood without it budging. Your theory that the potion increased your strength... may need some revision.<br>\r\n<br>\r\nA satisfied hum rings atop you. \"There! Hey, I could refactor this into an interface, or maybe an abstract class.\" And with that spark of brilliance, your Senpai leans in closer to the screen, shifting the gravitational forces.<br>\r\n<br>\r\nThe folds of her camel toe roll lazily upon you, squeezing you firmly into their plushness. A relative 52 thousand tons of pressure weigh down on you. Despite the president's scrawny physique, you can barely move in this state. You have to twist your back uncomfortably to glimpse at the behemoth pussy resting upon you. Still, the subconscious motions - the way her fingers fly over the keyboard, the small snorts from her nose, even a few rumbles from her stomach - traverse through her frame to you, reminding you of your place. Pinned beneath your love's warm vagina.<br>\r\n<br>\r\nMaybe it's not so bad...<br>\r\n<br>\r\nNo, what are you saying? The intense body heat is starting to mess with your head. And the odors around; the heavy air is so sweet, so enticing...<br>\r\n<br>\r\nYou can barely scream. Matsudo's mere presence is causing you to suffer from oxygen deprivation; not just from the odor floating from her sex, but from the crushing force on your lungs. Memories of her float by on the wind; the first time you borrowed her mechanical pencil, your first firecracker-based experiment with her, the time she helped you cheat on that test...<br>\r\n<br>\r\nIt's getting worse. The pain on your ribs is hard to bear. Her subconscious twitches and breaths only grind you harder, as if they're determined to slowly break your spirit into shreds.<br>\r\n<br>\r\nYou focus on the distant sound of keyboard taps. The tiny traces of her voice. They'll keep you sane, through this pain.<br>\r\n<br>\r\nWith the each of the clock's ticks the moisture's growing around her legs. Normally, you'd be disgusted. But in this case, it's Senpai's bodily juices, so it's not the worst thing in the world. Maybe, if you tried wiggling now, you'd be able to flee her vaginal muscles' grasp.<br>\r\n<br>\r\nBut if you squirmed too much, she might look down. And what would the President do when she discovers her subordinate not only drank her experimental potion without permission; but tried to brush up all cozy against her precious petals? Or she may have worse experiments for you yet. And anyway, how long could she stay seated at that computer? She'd need to move sometime.<br>\r\n<br>\r\nBiting your lip, you decide to...</span></div></div>",
            "created":1549515600,
            "id":2614280,
            "title":"President's Panty Press"
        },
        "1112211":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "content":"<div class=\"\"><div> <span>Weighing your options, you decide to allow Senpai's groin to have its way with you. Your energy's draining from the roasting atmosphere on the seat. And anyway, you can't budge an inch under the sheer weight; tens of thousands of tons of pussy slouching over you from every corner. You'll just have to lie on your stomach, think happy thoughts, and bear it.<br>\r\n<br>\r\nYou pause. Is \"bear it\" is the right word? After all, this <i>is</i> the closest you've ever been to Matsudo's naughty bits. It's not like you have to move much, as you soak in the touch of her tender organ. Sensing her panty's fibers covering your tangled hair, a thin trace of moisture atop them, brings a covert smile to your lips.<br>\r\n<br>\r\nMaking yourself as comfortable as you can, you stretch out, letting the droning hum of machine terminals, keyboard taps, and your beloved Senpai's breath to take your ears. You'll probably have a mere few minutes of quality time with her panties. Better enjoy these little moments with her, no matter how they come to you - even if they crash on top of you all at once.<br>\r\n<br>\r\n***<br>\r\n<br>\r\n<i> Those little moments...<br>\r\n<br>\r\n\"Hey... Sodachi, right?\" Matsudo stands there, arms crossed. Her eyes are a deep brown, and her pigtails flap in the wind. She pulls you close with a bold tug of your necktie.<br>\r\n<br>\r\nYour face goes red. Has she found out? You've always been sneaking glances at her out of the corner of your eye. Ever an absent-minded professor, she often seems to act like she's the only one in the room. When she leans to reach a dropped eraser, or rests her legs on the desk, it's easy to grab a glimpse of her underwear. But it's not only that. It's the way she chews at her pencil; how her body scoots around when working on a tough problem; and the way she rests her chin on her hand when listening to someone... Her mind's always working in a different direction. It enthralls you. But now, those happy peeks might end - she's staring you down, seemingly knowingly.<br>\r\n<br>\r\n\"Wh-what? Senpai...\" You bow again and again. The thought of getting this close to her is heart-pounding, terrifying - she can see right through you. But the thought of losing her is worse.<br>\r\n<br>\r\nMatsudo just looks through her nose, her eyes thin and knowing. She has a sign-up sheet in her hand. Her lips slip apart as words flutter out from them...</i><br>\r\n<br>\r\n***<br>\r\n<br>\r\n\"Nhm, another bug...\" Matsudo's typing stops. \"You're really pissing me off - get squashed, bug.\"<br>\r\n<br>\r\nAn insignifigant shift in her hips jolts you up, along with her voice. The white landscape shifts forward, the force of a steamroller plowing you beneath sweaty cloth. Something must've made you zone out for a second. The colour rushing from your cheeks, your mind encountering a blue screen of death. You try to cry out, but the words choke up in your compressed throat, dying into a pathetic whisper.<br>\r\n<br>\r\nShe's not looking down - simply staring indifferently at the screen. The keystrokes above become louder. A tiny sigh slithers through your mouth, and you feel ready to fall apart. That was a <i>software</i> bug the intellectual giantess was grinding beneath her proverbial heel.<br>\r\n<br>\r\nIt's getting harder to keep your eyes open - not that you need to, when you can feel every tiny flex from the sinews and muscles pressing from above. The passive twitches rock your world.<br>\r\n<br>\r\nFor instance: on every exhale she releases, the president compresses your chest and lungs against the seat, trash in a compactor. Trying your best to keep hold of your limited oxygen, you time your shallow breaths around her. They synchronize with the hurricanes flowing in and out of your president's nose. Each time you gulp the air back in, Senpai's warmth blasts into your nostrils and mouth, dousing you in her feminine pheromones. The heat and odor were overbearing when Matsudo Mountain first descended; now, they make your nose hairs tingle and burn.<br>\r\n<br>\r\nA clock ticks somewhere in the room, a reminder of time's passage. When you try to twist your neck in its direction, your joints scream like sirens. The unrelenting pressure from above shows no signs of dying out; you're caught between a rock and a soft, silky place.<br>\r\n<br>\r\n***<br>\r\n<br>\r\n<i>Your whole body's floating. Everything feels soft and tingly. The clock's frozen in place. As you gaze deep into Matsudo's round, nerdy glasses, you can see everything. Her quiet, analytical eyes. Your own timid face, awfully short in her presence. The lab's desks and monitors, and the meadows outside, distorted to look larger, more vibrant, and more inviting. She takes you in her arms. The vial drops carelessly to the tiled floor, shattering into hundreds of reflective shards. You can't breathe. Sweat rushes across your hair. Your palms clam up. Your pulse races. A beautiful, intelligent scientist, and her loyal Kouhai, sharing an intimate moment.<br>\r\n<br>\r\nShe breaks the silence: \"Oh, shoot. My potion caused an allergic reaction.\" Casually, the young scientist pulls a large syringe from her blazer's pocket. \"Hold still, you'll probably live...\"<br>\r\n<br>\r\nHold still... In her awe-inspiring presence, that's the only thing you can do. That's the only thing the clocks can do.<br>\r\n<br>\r\nHold still.</i><br>\r\n<br>\r\n***<br>\r\n<br>\r\nIn an effortless motion, Matsudo scratches her gut. More warmth assaults you as her uniform white shirt lifts back, revealing a once-scrawny, now immense stomach. The slender fingers lay right above you, their shadows twisting around and curling over her soft, receding stomach flesh. Her rolling skin molds you beneath it. Even this unsanitary, subconscious move becomes a delicate, rehearsed dance from your perspective. You reach up, fingers outstretched, frail and tiny against a single one of Senpai's slender digits. You can still get her attention... Or a last, delicate touch of her hand...?<br>\r\n<br>\r\nYou're not sure what you want anymore. The monolithic hand rises out of your vision, into the realm beyond the desktop.<br>\r\n<br>\r\nThe air is heavy. Scent of raw fish brings sensations of lightness to your head. Your throat is dry, and your gut aches from the pussy's throbbing pressure. It's like the lewd lips are trying to slowly consume you whole, trap you within them, breath by breath. Her body heat has only grown with time, capturing you in a squishy sauna of sweat and cloth.<br>\r\n<br>\r\nTo see the president in a sauna, revealing her slender form in a skimpy swimsuit, heat fogging up her glasses...<br>\r\n<br>\r\nWater. That's what you need. You're thirsty from the blistering heat; this dizziness making everything spread out larger is the result of dehydration. A brief sip of something...<br>\r\n<br>\r\nThe perspiration's built up around Matsudo's panties. Imperceptible at normal size, pebble-sized beads start at the fabric's frayed hem, like morning dew on grass. Across the smooth Mound of Venus, the liquid grows from de, to puddles, to a swampland. The juices are most intense right at the gates of her vagina - a greyish stain soaked in a clear outline of her monstrous vulva. It's so wet, you can feel it traversing your cheek. Thirst dries your lips.<br>\r\n<br>\r\n...No! Absolutely not! Though you can barely move, you shake your head intensely at the idea. Your dignity hasn't descended that low.<br>\r\n<br>\r\nStill, your lips are so parched. The waters cascade around your tiny frame with her idle motions. Every drop echoes in your ears. The humidity in the air caresses your tongue. It tastes of Senpai. If it's Senpai, is it that bad?<br>\r\n<br>\r\nShutting your eyes, and swallowing, you stick your tongue out - and lap a loose do from the surface. The salty taste of Matsudo's sweat trickles down your throat. Your body melts in relief - and in a flash of sobriety, shame takes its place. You want to bury yourself in a hole and cry. In a sense, underneath the crotch's unworldly weight, you're already buried hopelessly deep.<br>\r\n<br>\r\n***<br>\r\n<br>\r\n<i>And you can see yourself, blonde hair, bright eyes, wandering into the room. You approach the vial and spot the lip mark. You try to shoot out to yourself to stop; but the other Sodachi takes a sip. And... nothing. Everything stays normal. You approach Matsudo, and profess your love. She takes you in her hands, and you sink deep into her being - a single speck in a pure field, a drop into a pond.<br>\r\n<br>\r\nAre these memories? Premonitions? Fantasies, as your brain breaks apart, oxygen failing? Are you seeking some greater meaning behind a senseless and pathetic death - unnoticed beneath your crush's sex?<br>\r\n<br>\r\nIt stretches on forever - the length of her legs below, dangling by the edge of the chair...</i><br>\r\n<br>\r\nIs Kotoko still there? You hadn't heard him walk out - or really heard anything over Senpai's diligent bodily functions. It's not just hard to see him, amid the musty air; it's hard to picture anything existing beyond the realm of Senpai's pussy. Time, too, has lost meaning. You may have been here for hours, or minutes. It blends together in an intoxicating, dank microcosm.<br>\r\n<br>\r\nYour pressure-numbed joints reach up one last time aching from the Goliath app them...<br>\r\n<br>\r\n.......<br>\r\n<br>\r\nDistant clicks and hums bless your ears. You're suffocating because of this. It's your fault - the choice to wait here, the choice to climb up, the choice to drink the potion, the choice to join this club...<br>\r\n<br>\r\n.....<br>\r\n<br>\r\nNo regrets touch your body in your last moments. You're with Senpai.<br>\r\n<br>\r\n....<br>\r\n<br>\r\nSenpai is around you, smothering you.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nYou'll never leave her.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nYou're a crumb lost in her valleys and peaks.<br>\r\n<br>\r\n...<br>\r\n<br>\r\n...<br>\r\n<br>\r\nYou're glad you met her.<br>\r\n<br>\r\n...<br>\r\n<br>\r\n<i>Sodachi Taiyou...<br>\r\nUnable to escape the smothering of Matsudo's pussy...<br>\r\nFound himself slowly extinguished underneath it.<br>\r\nHeat, thirst, pressure, and air deprivation left him lifeless...<br>\r\nbut without a scratch or bruise on his smiling face.<br>\r\n<br>\r\n<br>\r\nClick.</i><br>\r\n<br>\r\nMatsudo stretched, chuckling softly. \"Finally. Thought I'd never get solve that bug.\"</span></div></div>",
            "created":1549861200,
            "id":2616348,
            "title":"Smothered in her Warmth"
        },
        "1112212":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "choices":[
                "Up",
                "Down"
            ],
            "content":"<div class=\"\"><div> <span>The harsh pressure from her groin weighs too much - your shrunken joints are already screaming in a chorus of agony. Too much longer, and you'll <i>pop</i> into a little trace, lost underneath the mass of love. It doesn't matter if senpai notices you or not; this is a life-and-death situation!<br>\r\n<br>\r\nYou struggle with all your might, as little as you have in your state. The sheer weight Matsudo's warm pussy exerts on you makes it hard to breathe. Curling an aching leg up, you kick weakly. Your foot sinks into the fabric, deep inside the fabric's endlessly-repeating folds - irregularities in the lips they veil. Perspiration builds up around your ankle, stuck in the pure surface.<br>\r\n<br>\r\n\"Ngh...\" That's Senpai's voice. Even if it doesn't free you, you could gain her attention by struggling.<br>\r\n<br>\r\nYou hold your breath, and kick again. Your right shoe falls off, tugged underneath the president. Pressure still crushes your limbs. You try moving your arms forward, but it's like swimming through warm molasses. No; molasses doesn't have the breathing cycle, rocking up and down over you, and squeezing you into the seat's unforgiving imprint.<br>\r\n<br>\r\nAre you really going to die here - beneath Senpai's womanhood? You never even got a chance to hold her hand, or have her flirt with you, or bear her children... Will your life end pathetically, a stain on her otherwise-spotless panties?<br>\r\n<br>\r\nWith a valiant \"HIIIII~!\", you spring forward, pushing your limbs back at once, muscling your way through the crushing agony. Thoughts of Senpai pulse through your head. You gasp continuous breaths, ignoring the musky, raw taste lingering in the air around her grin.<br>\r\n<br>\r\nA push.<br>\r\n<br>\r\nThe off-white microcosm starts to twitch, terraforming in the sky.<br>\r\n<br>\r\nAnother, harder push.<br>\r\n<br>\r\nYou can feel pressure releasing from your torso, the cotton mass drifting aside. It's working!<br>\r\n<br>\r\nOne more, with everything you've got---<br>\r\n<br>\r\n<i>Sssslip.</i><br>\r\n<br>\r\nThe hefty feeling lingers, then lifts off your body. A cool sensation drifts across your back. When you breathe the thin air, your lungs can take it all in. And though your feet, your spine, and your everything still aches... with wobbly legs, you can stand, looking o over the edge of the chair.<br>\r\n<br>\r\nYou did it! When everything seemed lost to the dark cave, you overcame the odds, and escaped from Matsudo's panty prison!<br>\r\n<br>\r\nYou turn to the panties, taking a step away for safety. \"Pheew...\" They're absolutely massive from this angle. Like a soft, flexible tower, teaching to the skies above. The imprint of her vagina is thick enough to carry a shadow over you; pearly gates large enough to eat a man whole. To think - you're the only boy in this school who's actually touched Matsudo from below... And you lived to tell the tale!<br>\r\n<br>\r\n\"Nph...\"<br>\r\n<br>\r\nSuddenly, tremors ring out - harsher and wilder than any earthquake you've ever bore witness to. It knocks you to your backside, and rocks the chair rapidly.<br>\r\n<br>\r\nA low, ominous groan rises from Matsudo's mouth: \"It itches...\"<br>\r\n<br>\r\nIt seems like your squirming irritated the gigantic President Matsudo.<br>\r\n<br>\r\nWith that, you gaze up to see the skirt's segments folding onto themselves, one by one. To your left, the pale expanse of her leg lifts slightly from the seat, drops of sticky sweat falling from it. It drags across the seat's surface, daring right towards the source of the itch - you.<br>\r\n<br>\r\nWith a gulp, you turn the other way, and run back. That's when you see; her other thigh is rushing towards you just as fast. The panties fold inwards as both pillars rush together.<br>\r\n<br>\r\nYou run forward, towards the seat's edge - but your legs can't keep up with Matsudo's. Each smooth, shapely limb is 85 meters long - almost the size of a blue whale. It'd only takes her a single step to traverse a city block. There's no chance you can traverse that stretch in such a short time.<br>\r\n<br>\r\n<i>THUD.</i><br>\r\n<br>\r\nThe gap between her thighs disappears - they collide together, flesh against flesh. Darkness engulfs your entire form. Your arms sink into the silky surface on either side, hopelessly pushed in. The force grinds into you, tearing away all traces of the outside world. Then, it stops.<br>\r\n<br>\r\nYou take a breath, and register what just happened: she closed her legs.<br>\r\n<br>\r\nYou're sandwiched in a tiny crevice between Senpai's thighs - the proverbial \"Absolute Territory\", were her socks higher.<br>\r\n<br>\r\nGoosebumps roll up your back. Compared to her panties, the musk is less intense; but the pressure isn't any more forgiving, and it's coming from EVERY side of you. The touch of her skin is nearly as intimate as that of her undies; maybe even more so, since you've actually made contact with a part of Matsudo's body, unfiltered by any cotton barrier.<br>\r\n<br>\r\n\"...Still itches...\" The president's sighs and grumbles, and the accompanying clocks, come out muffled by layers of muscular tissue. Muscles that, at her command, flex and transform, brushing against each other. You're directly at the center of the rubbing motion, twisted deeper into the soft, leathery skin. Trying to move from one slender leg only slams you into another, and mangles your leg. For a split-second at the apex of each rub, you can hear her pulse behind it; before you becomes a blur again, pulled into the rhythmic motions.<br>\r\n<br>\r\nTo Kotoko, it would look like Matsudo was merely fidgeting in her seat. At your teensy scale? The waves are wilder and more sickening than they'd be on a trek across the Pacific Ocean by rowboat!<br>\r\n<br>\r\nThe continual, thundering thigh lifts and falls drones into you. Senpai seems to have paid attention to shaving her legs; the surfaces are marble-smooth, even as you clutch to them for support. They don't have as firm a grip on you as the Impenetrable Wall Of Panty. This means you find your minuscule form tossed around easily with each twitch, boring deeper into her dermis.<br>\r\n<br>\r\nHowever - this also grants you greater control of yourself. You line your back up against her left thigh (or is that right? You've been twisted so much, and the skin lets no light in...). Gritting your teeth, you push your feet against the opposing pillar of pale skin. It absorbs your blow, like it was made of some kind of spongy material. Your limbs sink in. The next twitch from Matsudo bends them like twigs. Were it not for those extra hardening qualities in that vial she made, you'd be relegated to a wheelchair for the rest of your days. Even in this state, the pain is too much to bear.<br>\r\n<br>\r\nStanding still isn't an option. Some kami has seen fit to give you the gift of locomotion once more - and you'd be dumb to squander it. You could try squirming out from above, and climbing atop one of her gigantic legs - though the journey looks arduous. And with her cool, aloud attitude, who knows how the president would react - especially now that she knows <i>something</i> was itching her groin? Alternatively, you might wiggle downwards, tunneling under the statuesque limbs. But then you'd risk getting crushed beneath them.<br>\r\n<br>\r\n...Come to think of it, which way IS up? The all-encapsulating darkness gives you very little trip work with. And somewhere in her thighs' assault, your head spun a few times. You've really lost sense of direction...<br>\r\n<br>\r\n...Until a stray drop of sweat slides down Matsudo's thigh, splashing your hair. You shake it, trying to dry off. Okay; your head's facing up. Where do you squirm?</span></div></div>",
            "created":1550279700,
            "id":2618253,
            "title":"Troubled waters, but they're only thigh-high (V)"
        },
        "11122121":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "content":"<div class=\"\"><div> <span>You climb the great pair of grinding thighs. On your perilous accent, the thin light between the spongy cliffsides acts as your North Star. The soft flesh sinks around your grasping digits, heaps of it squeezed like dough. However, with every tremble of Matsudo's leg, you find yourself sliding off, shaken deeper into the crevice of her natural curves. It's wilder and harder to keep hold of than a bronco at a rodeo! Both limbs thrash with such abandon, such unbridled energy, the chair distorts and shifts.<br>\r\n<br>\r\n\"Still itches...\" Senpai's voice is distant as the horizon, calm as a leaf landing in a koi pond, and balanced as a tightrope walker, meters in the sky. Meanwhile, it's chaos below, where you're stuck! It's a wonder you can hear her over the roar of skin scratching together. She's not even making an effort to annihilate that tiny itch - that insignificant, blonde-haired, panting itch - and it's shaking you halfway to death!<br>\r\n<br>\r\nThe echo of her voice in your ears, however dim, fills your shrunken form with newfound courage. With a gulp of air - accidentally sucking in some of Senpai's sour sweat - you leap back up, bracing yourself to her left thigh. Your uniform jacket and shirt brushes against the steep slope as you scale it.<br>\r\n<br>\r\nBrisk jerks from her twisting calves keep threatening to knock you of them. The higher you scale, the more each knead and rub shakes you. It doesn't help that the fall is dizzying; even when lying horizontally, the sheer size of those legs are something to behold. If she were this big compared to you at standard height, they'd be able to wrap around your apartment building easily. And it'd just take her squeezing her glutes together to smash that steel structure...<br>\r\n<br>\r\nAt the same time, despite your perilous position in the center of the pressure, the gigantic limbs seem slender and soft. All that time sitting at computers has taken its toll: rather than hard walls of toned flesh, you find yourself compressed and squeezed between delicate, pale skin. With the continual motion, a faint, fishy odor begins to permeate the air. The scent drifts further as your climb continues, away from the sweaty spot where the two surfaces meet. It reminds you how, despite the rocking and rattling you're forced to endure, this really is a sensitive spot on Senpai. Maybe an erogenous zone? She's pushing you for into it, consciously or not. You'd love to run your hand across this thigh at normal size, caressing it, enjoying its softness as it welcomes your hand...<br>\r\n<br>\r\nA soft light awakens you from daydreaming. Your tiny, blue eyes blink, trying to adjust to it. The fluorescent bulbs burn on the ceiling, looming over each desk. They shine equally on everyone in the room, large or minuscule. The warmth surrounding you dissipates gradually into the stagnant classroom air.<br>\r\n<br>\r\nOne final jolt from the great leg cliff, and a wiggle from your hips, tosses you up. With the sweat built over the thigh's side, you might have enough friction. It rushes against your sides...<br>\r\n<br>\r\n<i>Fwip.</i><br>\r\n<br>\r\nFreedom! Sweat falls off the nape of your neck. The weightless feeling of flight lasts for two and a half seconds, before you smack atop her right thigh.<br>\r\n<br>\r\nYou did it - you  escaped the club president's gluteus canyon!<br>\r\n<br>\r\nThe ground stops moving. Senpai must have finally relieved her little itch. When dizziness from the constant motion subsides, you notice her skirt fabric rising near you, the pleats forming miniature coves. They start to stretch lower, sinking down.<br>\r\n<br>\r\n<i>*Sigh*</i><br>\r\n<br>\r\nMatsudo's relief makes her return to a relaxed poise - spreading her legs maybe a twinge wider than appropriate. The tension soaks off her, as it does with you. Residual pangs still torment your chest and arms, having been thoroughly ground - but you find yourself breathing easy, too, in the refreshing stillness. For a second, the two of you simply remain like that. A towering, calculating Senpai, and her mousier-than-usual Kouhai, with the same sense of serenity.<br>\r\n<br>\r\nYou wish it could be longer.<br>\r\n<br>\r\nHer voice echoes: \"Might be enterin' data for a while. Better get comfy.\"<br>\r\n<br>\r\nJust as suddenly as it stopped, the ground shifts beneath your feet. The pale platform you're resting on slides across the chair, to the center. Your nearly-flattened hands spring out, and your knees wobble, trying to keep still amid the new quakes. They're far less severe, and end quickly. But there's a loud noise to the side. Skirt fabrics fall back in retreat. Her left leg's lifting up, with all the spectacle of a whale surfacing for water. The lights above are blotted by the oncoming fleshy mass.<br>\r\n<br>\r\nAnd it's approaching at a lightning pace, whizzing loudly - falling right towards you.<br>\r\n<br>\r\n\"Senpai!\" You scream, watching it fall. \"I'm down here! Please -\"<br>\r\n<br>\r\n<i>Squish.</i><br>\r\n<br>\r\nHer gaze remains on the computer screen.<br>\r\n<br>\r\nEverything becomes a dark blur.<br>\r\n<br>\r\nA whole world of weight drops on you all at once. You can barely hold on for a second, like Atlas supporting the sky - before both your arms collapse. Your body is thoroughly pulped, bones and muscles squeezed together. A smidgen of consciousness remains in your mind, letting you fully process the situation... before Matsudo twitches. Everything bursts. Without a thought, she smears you into an indiscernible red mark upon her skin.<br>\r\n<br>\r\nMatsudo itches gently at her legs, having finished crossing them. \"Theeere we go. I'll put in a few more data points for today...\" She itches behind her glasses.<br>\r\n<br>\r\nSodachi Taiyou...<br>\r\nHaving successfully climbed his senpai's legs...<br>\r\n...Was nevertheless crushed underneath them, as they folded.<br>\r\n<br>\r\nIn the end, his efforts did nothing to undo his fate:<br>\r\nlost as a stain on Matsudo's otherwise-spotless thighs...<br>\r\nUntil her next shower.</span></div></div>",
            "created":1550627700,
            "id":2620133,
            "title":"Getting a Leg Up (V)"
        },
        "111222":{
            "author_id":"notontime",
            "author_name":"NotOnTime",
            "choices":[
                "Wriggle around so she notices you! (reserved)",
                "Escape however best you can!"
            ],
            "content":"<div class=\"\"><div> <span>You didn't have any more time to waste. You had to run to the back of the chair, bolt there as fast as you could before your gigantic senpai squashed your tiny body like a bug. Her glorious panty-clad ass was coming down quick, the white fabric sky growing darker as its shadow fell on top of you. If you could just make it to the back of her chair in time you'd be in the safe zone, but it wasn't meant to be. Your tiny legs could only carry you so far, and even after hauling ass as fast as you could you only managed to move your position a few centimeters. At the last moment you spun around, to see your senpai's heavenly butt about to crush you. This was it-!!<br>\r\n<br>\r\n----<br>\r\n<br>\r\nMatsudo's skirt fluttered as she sat, drifting naturally over the edge of the chair. She was usually the kind of girl to tuck her skirt under her bum when she sat down, unless she was preoccupied with her experiments. Totally engrossed with entering the new data into the computer, her eyes were locked on the screen.<br>\r\n<br>\r\n\"Okay if I enter the variables right here...\"<br>\r\n<br>\r\nHer fingers clacked away on the keyboard. A few more seconds went by and she clicked her tongue again, disgruntled that her calculations had still yet to bear fruit. Why wasn't it working for her? She was going to keep at it until she figured it out.<br>\r\n<br>\r\n----<br>\r\n<br>\r\nSLAAMMM!!<br>\r\n<br>\r\nThe sound of your senpai simply sitting was an earsplitting affair. It was as if an entire skyscraper had toppled over, shaking the very foundation you had been standing on. You gritted your teeth, waiting for your sad, sudden, and pointless death, but by some miracle you had survived. The giant crushing force of you upperclassman's ass was flattening you into the chair, but you were still very much alive<br>\r\n<br>\r\n\"I... lived? I made it! I... ... ack! Senpai...! Your ass...! It's so heavy!\"<br>\r\n<br>\r\nThe whole weight of her backside was bearing down on you. Not just that, but the upper body it was supporting too. You had been incredibly lucky, instead of being crushed into a fine red paste you managed to find yourself nestled in the small crevice between her two cheeks. It was the only spot that wasn't pressing flat into the chair, and offered you a tiny bit of breathing room. If she had sat even an inch from where she landed, you'd have been dead for sure. That said, the space between her massive globes was cramped as hell and the ever-present weight of her buttocks was barely pressing down on you to a non-lethal degree. It was hard to move your arms and legs and your chest definitely couldn't budge. Your back was to the chair meaning the front side of your face was being smothered by the weight of her ass.<br>\r\n<br>\r\nYou couldn't believe how big it was. It was a hard thing to wrap your head around, now that it was right on top of you. Matsudo-senpai had always had a small slender frame, she wasn't exactly well endowed or curvaceous, but she still had a wiggle to when she walked. Sometimes you would sneak a peak at her skirt, watch how it danced as she trotted properly down the school hallways. Daydreaming of how her bum looked under that skirt, you had no idea it would ever become this gargantuan. Her ass was huge and daunting, dwarfing your tiny body under it's volume. Just by it pressing against you, you felt a sense of how large and solid the rest of it really was. It felt like if you put your hand against the outer wall a building and pushed, the utter size of it was immovable. Her ass could easily have crushed the entire school with these proportions and leave it as a pile of dust when it rose back up.<br>\r\n<br>\r\nMagnificent size aside, your female friends weight wasn't the only thing right now that was smothering you. A hot sultry blanket of smells were emanating from her ass crack, covering you in her scent and her warmth. It was amazing, the smell of her panties was so rich with feminine musk and pheromones that it made your head spin. You could smell the strong tangy odor of her crotch, the puffy mound that was just inches away from you let out a sweet sensual scent and it was driving your hormones wild. At the same time her ass and its dripping sweat were almost completely overwhelming their own fragrance. Your tiny lungs filled with the hot stuffy smell that came from between her butt cheeks. It was thick and heavy, concentrated with the earthy odors that had gathered inside her crack all day. The president was a clean girl, but to keep her butt from secreting sweat or other smells throughout the day was an impossible task.<br>\r\n<br>\r\nThe plentiful aroma soaked into your body, making you feel muggy and slow. Just the heat dripping inside her cheeks was exhausting you, and your sweat started to absorb into the giant panties and mix with hers. You were thrilled to smell such a private stench, to experience an intimate odor of hers without her knowing, but after a minute that thrill went away. The smell had begun to get to be too much for you and it wasn't going away, in fact it was getting hotter and stuffier as time went on. You were starting to drown in the heavy alluring musk of her ass, if this kept on for too long the lack of oxygen would be dangerous.<br>\r\n<br>\r\nThis was bad. It was either you found a way to escape from under her giant butt soon, or you might suffocate. Struggling wouldn't do you any good, her ass was too heavy to push away, even if you had a hundred copies of yourself. That, and exerting too much force would only waste the little air you had. Your only choice would be to wait this out, maybe she was only going to sit down for a few minutes...<br>\r\n<br>\r\n...<br>\r\n<br>\r\nA few minutes turned into twenty, and the president's gigantic ass was still sitting in its spot. Sure, she would shift and move around every now and then (causing you a great deal of crushing pain) but never once did her ass lift from the chair. She was still stuck the computer, typing away and working diligently on her calculations. It could be hours before she got up, time you didn't have. You were drenched in sweat at this point, gasping sharp breaths that were laced with her potent smells. It wasn't looking good, but it was about to get a whole lot worse.<br>\r\n<br>\r\nIt came suddenly. A harsh booming noise groaned up above, from somewhere deep within the schoolgirl's body. It was fierce and bellowing, so much so that it was hard to distinguish. The muffled roars echoed on for several seconds, sounding akin to ship's hull moaning against the ocean's waves. You had to brace yourself as the shockwaves came down to Matusdo senpai's ass, the vibrations were so large that they rumbled into the seat like an earthquake. The chair trembled beneath your stuffy prison, causing your body to shake directly against the sweltering panties. The frightening noise trailed off, leaving you to guess what had happened. Your answer came with senpai's mutterings.<br>\r\n<br>\r\n\"Ugh, I think something I ate's not sitting well with me...\"<br>\r\n<br>\r\nHer words echoed through her body almost as loudly as the previous noise did. You heard what she said, slightly muffled, but audible enough to get the terrifying message.<br>\r\n<br>\r\n\"No way... She couldn't actually have to...! There's no way! Senpai may be a bit odd but she's still a girl, she wouldn't actually do that right in the middle of the lab, would she?\"<br>\r\n<br>\r\nTo your horror the groans grew louder, rumbling through the seat a second time. A massive load of pressurized air was gurgling through the giantesses' intestines, making its way lower and lower until... it would eventually come out as a fart. Her gargantuan body, the one that overpowered you by just sitting down, was preparing a release of monstrous proportions. If Senpai casually let a fart rip out her ass right now it would surely mean the death of you. The smell alone would be on a whole other level compared to the grueling fumes you were currently choking on. Even besides that, the impact was probably enough to kill you outright.<br>\r\n<br>\r\n\"Why...\" you whined.<br>\r\n<br>\r\nYou knew why though. A memory flashed through your mind, of earlier that day. You had given your beloved senpai some chocolates as a treat, something you had hoped to make her smile. It was only until after she ate them with her usual demeanor that you saw the printing on the wrapper. The expiry date was for a week ago... and several years before that! The age-old chocolate must have been the cause of her body's discomfort, making her stomach churn and bubble angrily. Your gift had backfired in the worst way possible, with you on the literal tail end of it!<br>\r\n<br>\r\nThere was nothing you could do to stop what was about to happen. Her body was going to expel all this built-up pressure whether you liked it or not. Senpai's rumbling ass was now a force of nature, a great storm coming to tear you apart. Her cheeks had you pinned and you could barely move, escape was practically impossible at this point. You had to do something though! Before it was too late!</span></div></div>",
            "created":1555577340,
            "id":2646187,
            "title":"Heavier Than She Looks"
        },
        "1112221":{
            "author_id":"notontime",
            "author_name":"NotOnTime",
            "content":"<div class=\"\"><div> <span>You knew that if you tried to squirm your way free it would get you nowhere. Even if you could somehow pry this girl's insanely heavy ass cheeks off of the seat and slip your way through her butt crack to freedom, there was no way you could make it in time. Matsudo-senpai normally had a pretty modest butt, but at this level it was too massive to even dream about escaping from. The ticking time bomb that was her fart would decimate you before you managed to crawl more than a few inches of space underneath her beautiful curved rear.<br>\r\n<br>\r\nThat left you with only one option. If you couldn't stop her bodily functions and you couldn't escape, you had to get her to move. Surely if you punched and kicked with all your strength, she would notice a faint tickle coming from under her ass, right? Then she would get up and realize she had been sitting on you all this time. Most likely she would be mad at you for ending up in such a predicament, but that didn't matter right now, this was an emergency! If you were lucky, maybe you'd even get to see her face as she lets her fart accidentally slip out, the rare sight of your crush blushing in embarrassment from letting out such a disgusting smell. You wanted to see that expression, but first you had to get her to move.<br>\r\n<br>\r\nYou flailed wildly, using what little space you had to punch at her panty-clad ass cheeks. It was hard enough to move your arms, the low ceiling of butt flesh didn't allow much room to wind up. Kicking was also difficult, your legs were practically pinned to the seat, so all you could do were pathetic little jabs with your feet. You were dripping wet, soaked in a mixture of sweat and humid ass moisture. The wafting smells made your head feel heavy, but you couldn't stop yourself. Again and again you pounded at her giant buttocks, slamming your limbs as hard as you could against the doughy wall. Your chest ached from the lack of clean air, but regardless you screamed as loud as you could.<br>\r\n<br>\r\n\"SENPAI! I'M DOWN HERE! HELP ME, PLEASE!!\" your tiny voice called out.<br>\r\n<br>\r\nYou had hoped that maybe through the thick layers of fat and flesh she would hear you, or at least feel your voice vibrating at little. Tired, you stopped your assault, letting you arms and legs rest as you waited for her response. The seconds ticked by agonizingly slow... but there was nothing. Senpai's ass wouldn't budge, and she wasn't getting up. The truth was she didn't feel anything from your desperate attack, her monolithic ass was so huge that your minuscule flails hadn't even registered as an annoyance. Your heart sank into your chest as you realized this, you were completely screwed.<br>\r\n<br>\r\nAnother resounding groan bellowed from above you. The sound was far louder now than it had ever been before, her ass was nearly ready to let it out. You could feel how close it was, gurgling inside the giant beast that was sitting on you. Your heartbeat pounded faster and faster and you started to hyperventilate. Her stuffy female scent stuck to the back of your throat as you panicked. There was nothing left that you could do to save yourself. Huge rumbles shook from inside the girl, pounding your eardrums. At long last you felt it, her muscles tensing up as the fart reached her backdoor. Her gorgeous anus, hidden between her ass cheeks had started to pucker...<br>\r\n<br>\r\nThe President felt a bubble of pressure stirring inside her rectum. The discomfort she had felt in her guts earlier, whatever if was, was ready to come out in the form of gas. Nonchalantly she pushed with her butt muscles, treating the whole ordeal as nothing but a minor distraction to her work.<br>\r\n<br>\r\n\"Nnggh...\"<br>\r\n<br>\r\nThe force and heat of her fart was disastrous. You felt like you were lying directly underneath a rocket ship as it started to take off, face to face with the blaring explosion. The sound hit you like a wall, bearing down on your tiny form and crushing it. On the outside the president's fart was a normal trumpeting bout of flatulence, but to you the sound was so huge, so astronomically big that it broke your eardrums immediately. Mighty bursts of air pummeled through her mountainous cheeks, decimating you underneath. It seemed like you were unfortunately close to the epicenter of the blast, in a spot directly under her sputtering butthole. The hot murky fumes billowing downwards turned the seat into a superheated nightmare, a fiery miasma of atrocious stream.<br>\r\n<br>\r\nYou coughed violently in the midst of the fart storm, hacking up thick rancid air only to have more forced inside your lungs. Your eyes watered as you wretched, you spit out wads of foul moisture while the girl above casually emptied the pressure from her bowels. The smell was ungodly awful, it had been fermenting inside her massive digestive system for hours and now reeked of raw shit. The stifling gaseous stench invaded every one of your orifices, treating your respiratory system to the hot burning taste of her colon. No matter how much you coughed it wasn't enough, your body would never be clean again from the awful stain of her farts. The potent smell poisoned you from within, clogging your lungs all the way until you couldn't breathe anymore.<br>\r\n<br>\r\nThe grueling fart eventually trailed off, leaving Matsudo senpai's ass surrounded by a cloud of its own wafting stink. For the next several minutes the underside of her panties were hell on Earth, a foul murky hot zone of leftover gases. Your body was trapped in a remaining pocket of shit fumes, unable to move and unable to suck in any oxygen. Slowly you felt your consciousness start to fade and the world becoming darker around you. The pain of being blasted at such a close range had made you body go numb, your bones had shattered from the force of her fart, broken like tiny twigs inside of you. Despite all this, you felt oddly calm.<br>\r\n<br>\r\nMaybe it was the stench of her fart affecting your brain or maybe you had finally lost it. You were slowly dying as a result of senpai's fart, but you felt at peace. You would have never thought such a thing to be possible, that your existence would end just because a girl passed gas, but it was actually happening. It was pathetic, miserable even. Your sad excuse of a life was being extinguished because of something like this. You wondered what kind of face senpai made when she farted, if it was cute or if she blushed a little. Just thinking about her made you feel not so bad, at the very least if you were going to die from a fart, you'd want it to be hers...<br>\r\n<br>\r\nEven with the muggy heat dripping around you, you started to feel cold.<br>\r\n<br>\r\n\"At least it was from one of hers...\" you thought again<br>\r\n<br>\r\n\"Sen... ...<br>\r\n<br>\r\n...pai...\"<br>\r\n<br>\r\n<br>\r\n...<br>\r\n<br>\r\nPresident Matsudo sat in her chair unsuspecting, when she caught a whiff of her own deed. She wrinkled her nose at the leftover gas, making an unpleasant face.<br>\r\n<br>\r\n\"Ugh, it stinks\" she said.<br>\r\n<br>\r\n<br>\r\n<i>Sodachi Taiyou...<br>\r\nenclosed and trapped within the meat...<br>\r\nof President Matsudo's gigantic ass,<br>\r\nhad his bones and innards violently ravaged...<br>\r\nwhen she released a massive fart on top of him.<br>\r\n<br>\r\nAs a result of the internal injuries, the shock, and on top to that...<br>\r\nthe resulting atmosphere of atrocious and noxious gases...<br>\r\nhe suffocated, dying of asphyxiation.</i><br>\r\n<br>\r\n[Based off: <a rel=\"nofollow\" href=\"https://giantessbooru.com/_images/a0e0dae2a79a6a8d9b1113b864522bd2/185060.jpg\" target=\"_blank\">https://giantessbooru.com/_images/a0e0da...</a> Hopefully the link still works!] </span></div></div>",
            "created":1555748880,
            "id":2647153,
            "title":"Gas Chamber"
        },
        "12":{
            "author_id":"brosus",
            "author_name":"Brosus",
            "choices":[
                "Take control of Kaede, being tortured by cities!",
                "Take control of the daughter, teleporting cities!",
                "Be one of the cities... teleported directly inside Kaede's colon after a meal.",
                "Other city teleportation choices",
                "The daughter unintentionally teleports their city, so she's stuck on mom too!"
            ],
            "content":"<div class=\"\"><div> <span>(Adventures of Kaede and her Mischievious Daughter who teleports people and cities into her mother's privates and underwear (Warning, image gallery for context with scat and graphic content: <a rel=\"nofollow\" href=\"http://g.e-hentai.org/g/672114/59fe019f1...\" target=\"_blank\">http://g.e-hentai.org/g/672114/59fe019f1...</a> ) )<br>\r\n<br>\r\nLately Kaede has had a lot of dirt to clean up in the house, annoying grains in her slippers, weirdly getting turned on as she exercised, and an especially itchy anus. She considered seeing a doctor, but none of them seemed connected, and they couldn't afford one anyway, so she learned to just deal with it. Maybe it was part of growing old.<br>\r\n<br>\r\nHer daughter knew full well - she had found out on the playground she could someone tiny little cities anywere she wanted. Sure, stomping them herself was fun, but watching them be destroyed by her unaware mom was way more hilarious. <br>\r\n<br>\r\nMeanwhile, cities from around the globe mysteriously disappear...</span></div></div>",
            "created":1546837200,
            "id":2600488,
            "title":"Kaede and her Michievious Daughter"
        },
        "121":{
            "author_id":"notontime",
            "author_name":"NotOnTime",
            "choices":[
                "Sakura tries something on a different scale...",
                "Kaede starts feels an itch somewhere else...",
                "Writer's Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"It itches? Back there feels... itchy.\" she thought.<br>\r\n<br>\r\nKaede Shimomura was taking her little daughter to school that morning. Just as she had gone to put on her shoes she noticed a peculiar feeling. Underneath her underwear, inside her delicates down below, she felt an itching sensation. As inappropriate as it was, the disturbance was centered directly at her... backdoor.<br>\r\n<br>\r\nAs she bent over to put on her first shoe Kaede glanced around her shoulder. Underneath the apron she was wearing was her sky blue dress. It rested cleanly over her generous backside, and it didn't seem to be bunching up or anything. Her ample buttocks had spread apart once she bent over, the fabric sliding smoothly between them. Nothing seemed to be wrong. Kaede knew she had a large set of child-bearing hips, and occasionally she would bump into things with it, but there wasn't anything behind her that she could have accidentally touched. She made a frowning face. Even though it looked fine, there was something tickling her back there for sure.<br>\r\n<br>\r\nHer daughter Sakura, meanwhile, was watching the whole thing play out. She knew exactly what was bothering her mother and she was the reason behind it. See, Sakura had the uncanny ability to teleport things and resize them, no matter how big. This morning she decided to add something extra special to Kaede's motherly panties, just for the sake of it. Keeping a curious poker face, Sakura watched her mom, thinking about her huge behind as it bent over, wondering how it must seem to them...<br>\r\n<br>\r\n----<br>\r\n<br>\r\nTheir world had been broken up into jagged islands, separated almost by the continents themselves. The terrain was laid out sporadically, about a dozen flat landscapes that could be identified by their distinct mountains and multitude of lakes were now floating in the air, as if by magic. The distance between these islands was immense, some multiple lengths of the planet apart, hardly possible to make contact with again. It was a catastrophe unlike the world had ever scene. <br>\r\n<br>\r\nBut that wasn't the worst of it. No, the real danger was what happened to be surrounding the former planet. The islands were floating over a giant chasm, a massive curved pit. Calling it massive was putting it lightly, this huge pit was so big it was barely at the scale most humans could comprehend. The dooming circle had an enormous circumference, nearly comparable to the distance between the Earth and the Moon. Its outer edge was made up of round lumps and huge crevices, growing smaller and closer together as the trailed down to the large center. In the middle of the pit it was dark and desolate but the folded lines of material pinched together in what only could be a giant hole. None of the microbe-sized people would have believed it, but was true: their world was suspended over a giant asshole.  <br>\r\n<br>\r\nThanks to Sakura's little prank, an entire planet was broken up and trapped inside her curvaceous mother's ass crack. The civilians started to panic from the sudden change of atmosphere. Their midday blue sky was gone, and instead replaced with a dark, brown-tinted night. The change was instantaneous and could be felt across their entire world. Almost just as quickly came the odor. A noxious heavy stench blanketed the floating islands of land, covering their towns and cities. It was misty and smelled like old waste, strong enough to make people buckle over and some outright collapse. The steamy scent was so thick that it rolled over the countries like a giant smelly fog, reducing visibility.<br>\r\n<br>\r\nWith the smell came the abrupt rise in temperature. Suddenly everything became a roaring furnace of heat, where just being outdoors felt like walking in the middle of the desert. Sweltering waves permeated through every city, roasting its tiny residents. The sheer warmth emanating from Kaede's asshole was boiling the little islands inside her panties, as if they were inside an giant damp oven. Moisture stuck to every tiny glass surface and tall tower, collecting from the intense humidity. The smell reeked of sweat and lingering fecal matter, the awful stench of the grown woman's asshole had spread across the entire shrunken world without her even knowing.<br>\r\n<br>\r\nThe sight of her giant mature asshole was incredible. It was big enough to swallow the floating islands with ease, if it ever opened to expel waste it would mean the end of all life. Each wrinkle was colossal, the puffy bands of folded skin were bigger than any of the hovering masses of land. A few unfortunate continents had ended up wedged between the wrinkles, doomed to even more intense heat and rotten smell. Crops died out, and people choked to death on the horrible stench spreading from the hot grueling anal wrinkles. They had no idea that the awful walls of nature that were destroying their lives were actually the tiny ass crevices of a giant woman.  <br>\r\n<br>\r\nEven further beyond the wrinkles expanded far and wide, dwarfing the tiny fractions of land. The bands of skin became fat and puffy, rounding into massive walls of flesh that stood looming overhead the microscopic population. A wispy mess of ass hair stretched above the sky, curving in a multitude of directions. The unkempt hair, normally considered thin, was thick and sturdy enough that a just single strand could slice through a floating island like it was butter. The giant continent would be blown to dust and the people left to fall into the abyss below.<br>\r\n<br>\r\nEventually Kaede's body became aware of the small earthen land masses that were wedged into her sensitive anal folds. The minuscule islands were itching her skin, and making her asshole tickle. In response the giant anus twitched, only a small amount, but cataclysmic to the millions of people living alongside it. The huge hulking wrinkles slammed inwards, crashing into any islands that were unfortunate enough to be near the outer edge. The floating fractions of land were utterly annihilated by her folds, shattered into bits just from a single contraction of Kaede's hole. Tall mountains and skyscrapers rained down into her orifice like grains of sand, indistinguishable from the actual dirt and grime that had collected in her crevices. With just a single twitch her asshole had just wiped out half of the floating islands, and she was completely unaware of it.<br>\r\n<br>\r\nAs the plump wrinkles started to retract again, a booming guttural sound rumbled underneath them. Deep inside Kaede's motherly ass a huge payload of poisonous gas had collected within her large intestine. The hot murky fart had reached the other side of her backdoor and was almost ready to come out. Loud organic groans shook the floating islands like an earthquake, causing them to wobble and teeter. From all around them the circle of fleshy walls rose upwards, looming higher and higher as the asshole bulged outwards. The fat wrinkles became engorged and tight as they held back the swirling disaster of female gas. There was nothing the tiny people could do but panic, no way to stop the woman's gastronomic phenomenon from happening.<br>\r\n<br>\r\nThe few hundred thousand kilometers-wide anus widened and released the apocalyptic fart that was stored inside Kaede's large intestine. Her asshole roared violently, making a loud thunderous sound as the hot gas was expelled from her titanic body. The tiny people didn't even have a moment to smell the repulsive eggy scent, the fart had destroyed them in an instant. All the remaining islands were caught up in the stream of gas as it gushed out, in less than a second the giant fart had blown them into little flecks of dust. Just from the shockwaves of this massive woman's fart, an entire civilization had been eradicated. The microscopic pieces scattered as the rest of her gas burst forth, shooting a vast amount of yellow coloured air from deep inside her bowels.<br>\r\n<br>\r\nAfter only a few noisy seconds the fart ended. The vulgar sound being produced by the humongous anus trailed down into silence and the hole closed back up. The remains of the small islands were nowhere to been seen, they had been completely vaporized. Only the raunchy stench of the woman's fart was left over, making her asshole and panties smell terrible. The billions of lives that had just been obliterated went completely unnoticed by the woman, with one bodily function she had ended their existence.<br>\r\n<br>\r\n----<br>\r\n<br>\r\nPPPPPSSSSSSSSSSHHHH!!<br>\r\n<br>\r\nA small fart slipped out of Kaede's butthole. It wasn't particularly loud, but it felt hot and stinky under her dress. She hoped her daughter hadn't heard it, that would have been embarrassing. The gross release didn't last too long, before Kaede knew it, it was over. She let out a sigh of relief, relieving a little bit of pressure made her body feel good.<br>\r\n<br>\r\nAs the grown woman finished putting on her shoes she noticed that itching in her backdoor had gone away. Whatever it was, a stray bit of lint or whatever, the fart had seemed to clear it out. Her round butt wobbled as she stood up and began to walk forward, free from the ticklish feeling that had been bugging her. As she opened the front door to leave she called to her daughter, making sure Sakura was right behind her.<br>\r\n<br>\r\nThe little girl put on her shoes and followed suit. As she left, she caught the wafting scent her mom had left behind. It was faint, but it was definitely the smell of Kaede's gas. Sakura smirked to herself, knowing what must have happened to the tiny broken up planet she placed in her mom's huge butt. That smell meant their complete destruction, nothing could survive a blast from a booty that big. She caught up with her mom and walked to school, content with just imagining the catastrophe she had caused.<br>\r\n<br>\r\n<br>\r\n[Based off: <a rel=\"nofollow\" href=\"https://e-hentai.org/s/2f9ea9eb02/794992-112\" target=\"_blank\">https://e-hentai.org/s/2f9ea9eb02/794992...</a>  Hopefully the link still works!]  <br>\r\n<br>\r\n</span></div></div>",
            "created":1549429200,
            "id":2613926,
            "title":"\"It itches...?\""
        },
        "13":{
            "author_id":"brosus",
            "author_name":"Brosus",
            "choices":[
                "I actually don't have 1... can someone send me it?",
                "This is not a Toilet 2!",
                "This is not a Toilet 3!",
                "This is the PRINCESS'S toilet!",
                "Colossal Auntie's Arrival!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, first of all... 'not' a toilet 1, 2, 3, Princess, or... COLOSSAL AUNTIE'S ARRIVAL?</span></div></span></div>",
            "created":1546837200,
            "id":2600490,
            "title":"This is (Not?) a Toilet!"
        },
        "132":{
            "author_id":"brosus",
            "author_name":"Brosus",
            "choices":[
                "Magical Girl Must Release 'Magic'",
                "Pingeon Droppings!",
                "Kinky Shrunken City~"
            ],
            "content":"<div class=\"\"><div> <span>Scene 1: <a rel=\"nofollow\" href=\"https://e-hentai.org/s/18a335fa01/621320-2\" target=\"_blank\">https://e-hentai.org/s/18a335fa01/621320...</a> Giant penguin appears, is defeated, the city is saved... but to transform back, the magical girl must release her magical power. Which means she has to blast that poor city with her farts...Then grows too big and has to let it all out as poop! Uh-oh... Only for the brave of heart.<br>\r\n<br>\r\nScene 2: <a rel=\"nofollow\" href=\"https://e-hentai.org/s/e739872b7d/621320-13\" target=\"_blank\">https://e-hentai.org/s/e739872b7d/621320...</a> Revenge of the pingeon droppings! A big alien pigeon girl... 'releases her libido' on a tiny earth... to great effect. <br>\r\n<br>\r\nScene 3: <a rel=\"nofollow\" href=\"https://e-hentai.org/s/8d3faf5411/621320-17\" target=\"_blank\">https://e-hentai.org/s/8d3faf5411/621320...</a> A magician finds forbidden shrinking magic, and tries it out, crushing with feet and fingers. And then nipples. Good if you want to go wild destroying a town naked as a giantess. She eventually gushes, and to destroy of evidence, shrinks small enough to swallow the city.<br>\r\n<br>\r\n(There's some of Ochiko's own writings to go with these, but let's one-up him, yeah?)</span></div></div>",
            "created":1546837200,
            "id":2600497,
            "title":"This is not a Toilet 2!"
        },
        "1321":{
            "author_id":"questathana",
            "author_name":"Questathana",
            "choices":[
                "Adaption",
                "Origin Story (Prequel)",
                "Weekly Growth (Prequel)"
            ],
            "content":"<div class=\"\"><div> <span>Before the story has the protagonist growing too big and pooping, it mentions the magical girl forming a contract with the toilet spirit and doing the growing on a weekly basis. We could adapt the same story that happens or do a prequel of sorts. <br>\r\n<br>\r\nThe prequel could either start with an origin story or go straight to the weekly events of her growth. It could even go in its own direction and not have the excessive growth occur. <br>\r\n<br>\r\nWhich option will it be?</span></div></div>",
            "created":1552431480,
            "id":2629558,
            "title":"Adaption or Prequel?"
        },
        "15":{
            "author_id":"brosus",
            "author_name":"Brosus",
            "choices":[
                "Tiny Humanity Has Declined",
                "'Old Loli' series",
                "Madoka Magica",
                "New Game!",
                "Continued choices"
            ],
            "content":"<div class=\"\"><div> <span>The only rule here is leave a path for the next person. Even one-off pictures are okay, though it's best if you link them so people know what you're talking about. Take the stories as far down the rabbit hole as you want!<br>\r\n<br>\r\nChoice 1: Tiny Humanity Was Declined comics/pictures: <a rel=\"nofollow\" href=\"https://nhentai.net/g/156691/\" target=\"_blank\">https://nhentai.net/g/156691/</a> feel like taking a bath with her? Or maybe a ride in her panties: <a rel=\"nofollow\" href=\"https://gs-uploader.jinja-modoki.com/upld-view-document.php?file=/documents/ydnkm/watashi-tensou_eng.jpg&amp;dl=yNw8z6WW82A&amp;t=1547487526&amp;c=1547487457&amp;r=1f\" target=\"_blank\">https://gs-uploader.jinja-modoki.com/upl...</a> Or her armpit? A whole city could be destroyed if she got sweaty... <a rel=\"nofollow\" href=\"https://gs-uploader.jinja-modoki.com/upld-view-document.php?file=/documents/ydnkm/watashitaihyou_eng.jpg\" target=\"_blank\">https://gs-uploader.jinja-modoki.com/upl...</a><br>\r\n<br>\r\nChoice 2: 'Old Loli' comic. Feel like spending some time with a legal loli, perhaps a bath? She can change her age too, you know... <a rel=\"nofollow\" href=\"https://nhentai.net/g/142024/\" target=\"_blank\">https://nhentai.net/g/142024/</a><br>\r\n<br>\r\nChoice 3: Madoka Magica! He's done a ton of these, but here's the most recent comic. Perfect if you like destroying whole cities or planets... <a rel=\"nofollow\" href=\"https://nhentai.net/g/147243/\" target=\"_blank\">https://nhentai.net/g/147243/</a><br>\r\n<br>\r\nChoice 4: New Game! characters, he's done a ton of these, so just link what one you plan to write about. A particular favorite: <a rel=\"nofollow\" href=\"https://gs-uploader.jinja-modoki.com/upld-view-document.php?file=/documents/ydnkm/aoba-kui_eng.jpg\" target=\"_blank\">https://gs-uploader.jinja-modoki.com/upl...</a><br>\r\n<br>\r\nChoice 5: continue the chain.</span></div></div>",
            "created":1547442000,
            "id":2603389,
            "title":"Assorted endless possibilities!"
        },
        "151":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "choices":[
                "Watashi, the sarcastic mediator",
                "Her quiet, spacey Assistant",
                "More Options..."
            ],
            "content":"<div class=\"\"><div> <span>In a dreamlike future, humans are gently drifting into extinction. Taking their place is a \"New Humanity\": the inventive, but easily-distracted fairies. If something takes these fey folks' fancy, all sorts of things can happen. Time travel, inventions that can do anything, teleportation, the birth of strange creatures...<br>\r\n<br>\r\nAnd of course, size changing.<br>\r\n<br>\r\nMany Ochiko images star the pink-haired protagonist, Watashi (or just \"me\"). Pragmatic, snarky, but reasonable, she applied as a mediator for the UN, expecting a quiet desk job. Now, she finds herself subject to the fairies' chaotic games and plans. They could grow her to towering heights, shrink her down to their scale, or shrink cities around her. The little creatures will do anything for Watashi's delicious sweets; they can test her and answer her wishes in ways she'd never expect. And if, by some magic, even smaller humans pop up... it's a mediator's duty to make first contact.<br>\r\n<br>\r\nWatashi's followed by a blond boy in a flashy Hawaiian shirt, only known as \"Assistant\". Equally close to the magical creatures, he's polite, nearly mute, and sometimes in a world of his own. But if it comes to helping his boss, or capturing strange phenomena on his camera, he's earnest and bold. Some of Ochiko's images shrink Assistant with Watashi, or have him play with her when she shrinks. A story following the boy could go in either direction, and beyond. With fairies, anything is a go - as long as there's fun for them!<br>\r\n<br>\r\nWe might take the POV of a tiny civilization from one of Ochiko Terada's stories. We can also go with the fairies themselves, as they cause mischief for everyone. It might follow the amnesiac boy from Ochiko Terada's game, teleported to the fairy world and watching from afar as Watashi unconsciously destroys tiny cities. Perhaps other show characters, who weren't in Ochiko's works, will pop in for a visit - the obsessive Y, the stalwart P-ko, or the sophisticated White Rose Society.<br>\r\n<br>\r\nWho will you follow into the future?</span></div></div>",
            "created":1551326460,
            "id":2624098,
            "title":"Tiny Humanity Has Declined"
        },
        "1511":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "choices":[
                "...In a wide, green area",
                "...And something small was itching on her body",
                "...And the fairies had a new invention"
            ],
            "content":"<div class=\"\"><div> <span>We begin in the strange little town of Camphorwood.<br>\r\n<br>\r\nBeams of light shone through the wooden windowfame. The sun set on the household. Watashi's shadow drifted across the musty pages in her hands. She frowned, green eyes tightening. The mediator shifted the documents into the light, where their yellowing hire was plainer.<br>\r\n<br>\r\n\"Two thousand, something, and twenty-three... What's done can't be undone. Who'd have thought this would happen? I never got a chance to tell him ---\"<br>\r\n<br>\r\nWatashi scratched her rose-coloured hair. She ran a finger on the gigantic rip in the page, and flipped to the next one. \"The great destroyer. Everything will fall under...\" Sections were missing again. The next page had naught but a blurry image, resembling Bigfoot. A gasp caught in her mouth.<br>\r\n<br>\r\nWhen Y handed her documents from old ruins to analyze, the woman hadn't expected this... drama. These documents regarded giant monsters waking the Earth long ago. With the right analysis, this historic finding could unveil new truths about the past. They may have to reconsider the theory that humans naturally declined due to low birth rates - this showed signs of a major extinction event. It'd kickstart the Human Monument Project anew.<br>\r\n<br>\r\nHolding her breath in anticipation, she turned the page, and read the next words: \"This is a work of fiction. Any resemblance to real persons, living or dead, is purely coincidental.\"<br>\r\n<br>\r\nOh. Well, mystery solved.<br>\r\n<br>\r\nWatashi softly smiled. It was getting late, and cold winds approached. She lit the fireplace, and tossed the writing into the flames. It made a satisfying crackle as it burned. Her shoulders sunk into the seat. Nice of Y to give fuel for the fire.<br>\r\n<br>\r\nAs she crumpled and tossed another ball of the document, something small jumped to grab it in a blur.<br>\r\n<br>\r\n<span style=\"font-family:comic sans ms, cursive\">\"Interception!\"</span> The green-capped fairy smiled, looking at the paper ball in his hand.<br>\r\n<br>\r\nAnother short fairy with purple clothes admired the fire, seemingly entranced by the flames. <span style=\"font-family:comic sans ms, cursive\">\"Burning books?\"</span><br>\r\n<br>\r\n<span style=\"font-family:comic sans ms, cursive\">\"Heretical texts?\"</span> One in simple red clothes asked a friend beside her.<br>\r\n<br>\r\n<span style=\"font-family:comic sans ms, cursive\">\"Fahrenheit 451?\"</span> This cheerful fellow, in a captain's hat, picked up a cookbook eagerly.<br>\r\n<br>\r\nWith a sigh, Watashi leaned down to her visitors, pulling the book away. She'd given up on giving them names after last time, so she just called: \"Wait, wait, captain. I wouldn't do that. These are photocopies.\"<br>\r\n<br>\r\n<span style=\"font-family:comic sans ms, cursive\">\"Then...\"</span> the formally-dressed fairy asked,<span style=\"font-family:comic sans ms, cursive\"> \"are you destroying digital piracy?\"</span><br>\r\n<br>\r\nThe red one nodded. <span style=\"font-family:comic sans ms, cursive\">\"Protecting Intellectual Property Law. You wouldn't download a candy.\"</span><br>\r\n<br>\r\n<span style=\"font-family:comic sans ms, cursive\">\"Human, will you protect me? Am I an intellectual property?\"</span> The purple guy tilted his head.<br>\r\n<br>\r\n<span style=\"font-family:comic sans ms, cursive\">\"Maybe you're an idiotic property?\"</span> The green fairy smiled.<br>\r\n<br>\r\nWatashi waved her hands, only barely following their train of thought. \"The author's not here anymore. Any copyrights probably expired. All I wanted was a little heat.\"<br>\r\n<br>\r\nCollectively, the fairies' arms dropped, and stormclouds formed atop their drooping heads. <span style=\"font-family:comic sans ms, cursive\">\"Oh...\" </span>Despite their continual grins, they were obviously depressed at this revelation. The woman wasn't sure what disappointed them more: the death of the writer, or the death of their copyright.<br>\r\n<br>\r\nLeaving her chair, and carefully stepping over the miniature people, Watashi went to preparing sweets. If these guys weren't happy, someone from the UN might shout at her again. Thankfully, they were easily distracted. Her hands rolled about cookie dough, patting it together, before reaching for a rolling-pin. She looked to the sunset, with a wistful gaze, trying to change the subject. \"But it would be nice to speak with one of them...\"<br>\r\n<br>\r\n<span style=\"font-family:comic sans ms, cursive\">\"Who?\"</span> The fairies crowded her, clinging on her dress, climbing the folds in the apron.<br>\r\n<br>\r\nWatashi relaxed her shoulders, trying to think. \"A writer from that time.\" With either sleeve rolled up, bunching at her elbows, she went deeper into the relaxing rhythms of cooking. \"I'm not nostalgic, but it'd make this kind of job a lot easier if I could see into the past. You'd be able to tell what information was real, and what the writers embellished.\" She looked down. The number of fairies had grown when she wasn't looking . Folding her hands to her knees, she asked: \"Aren't there things you want to learn about times before, that aren't in books?\"<br>\r\n<br>\r\nThe green fairy waved his arms enthusiastically. <span style=\"font-family:comic sans ms, cursive\">\"Oh! Who shot JFK?\"</span><br>\r\n<br>\r\n<span style=\"font-family:comic sans ms, cursive\">\"No,\"</span> the captain-hat fairy explained with a stubby finger up, <span style=\"font-family:comic sans ms, cursive\">\"like how people peed before toilets.\"</span><br>\r\n<br>\r\nWatashi grinned. \"For instance, I wish I knew what inspired them to write about these great beasts.\" She added in a mental note, <i>and scold them. They really led us on a wild goose chase with their phony evidence.</i> Her pleasant gaze didn't change an inch.<br>\r\n<br>\r\nThe purple fairy crossed his arms, and viewed his head, deep in thought. <span style=\"font-family:comic sans ms, cursive\">\"But fairies can't just slip into the past...\"</span> He shook his head. <span style=\"font-family:comic sans ms, cursive\">\"Too many EM waves, so it's a no-go. You humans wouldn't have a problem, though.\"</span><br>\r\n<br>\r\n\"Right...\" An insincere laugh exited her soft lips. <i>So that's the ONLY thing preventing them from time travel?</i> Small talk with small people. It didn't really matter that the conversation had moved in this direction. If it kept these guys busy and happy, it was worth it. As she rolled, she noticed something soft moving inside the flour. She plucked the red-clothed fairy out. Watashi dangled her by the collar. \"Hey! Do you want to be food?\"<br>\r\n<br>\r\n<span style=\"font-family:comic sans ms, cursive\">\"Is that bad?\"</span> The tiny thing smiled back, head tilted. As Watashi blew the white powder off her clothes, she spread her arms out, pretending she was flying.<br>\r\n<br>\r\nBy the time the moon rose, the cookies were ready. The fairies surrounded it eagerly. Watashi, too exhausted to change into pajamas, simply flopped onto the bed. Cooking was her favorite hobby - but when she had to babysit in the meantime, it was exhausting.<br>\r\n<br>\r\nBetween shutting eyes, she saw the fairies gazing at her, expectantly. Probably waiting for the \"go\" sign to dig into their treats. She turned her head to the side, pinkish hair flipping on the bed. \"Sure, do as you please...\"<br>\r\n<br>\r\nWith that, she drifted into a deep slumber.<br>\r\n<br>\r\nLeft alone in the night, the fairies did as they pleased, just as she told them to.<br>\r\n<br>\r\nAnd Watashi's would find her wish interpreted in a way she never expected.<br>\r\n<br>\r\nShe woke up...</span></div></div>",
            "created":1551326700,
            "id":2624099,
            "title":"Me, Myself, and Watashi"
        },
        "15111":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "choices":[
                "Continue walking and investigating",
                "Take a seat to think about her circumstances"
            ],
            "content":"<div class=\"\"><div> <span>Morning. Brilliant sunlight attacked the mediator's sleep-covered eyes. Her first thought was: \"the blinds must need replacing again.\"<br>\r\n<br>\r\nBut as Watashi yawned, stretching out, she found the room itself had vanished. Gone overnight. Just a bed in a green field. Not only that, the area she woke up in wasn't anywhere in Camphorwood; she couldn't see landmarks of ruined buildings, or the great forest. Merely a few small bumps, rising from the misty ground. She lowered her legs from the bedside. Her shoes landed in a cold puddle - leading the woman to draw them back quickly in surprise. On her bed, Watashi took the footwear off, and held it to the side of her mustard-yellow dress. With a small gap of the thin air, she tested the water with the tips of her toes. It was refreshing on her warm skin, soaking the surface.<br>\r\n<br>\r\nShe stepped out of bed, waking forward, exploring the land.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nThe sprawling coastal city flew into chaos. Waves battered the shore, washing beachgoers up. They grew larger with each booming footstep, soon flooding the bustling streets.<br>\r\n<br>\r\nFrom out of the blue yonder, a behemoth with draping pink hair wandered ahead. Radars had spotted her earlier; but images of a simmering woman in the sea were nothing compared to this. In the distance, she looked angelic: with bright features; a relaxed, open posture; and a quiet, intrigued gaze. Her womanly figure stood silhouetted against the clouds. Each flutter of her saffron dress in the ocean winds stirred flocks of birds. It gave a supernatural aura about her idle twitches and careful steps. But the tremors formed by her simply stretching her bare feet out in the seas were anything but heavenly. Without a thought, they sunk fleets of trading and fishing ships to the seafloor, with naught but a splash.<br>\r\n<br>\r\nThousands fled for shelter. Proud skyscrapers fell in her shadow. As she neared land, the goliath woman's unreachable, glazed-over eyes disappeared. Her heavy bosom hid her field of vision. Soon, the citizens' view was also blotted out by her soles, stretching leagues with her stride. Waterfalls dripped from each dangling phalange as they rise from the sea, each a Leviathan in its own right.<br>\r\n<br>\r\nThe region, with a million souls screaming as one, was underneath her notice.<br>\r\n<br>\r\nA black dog barked once, at the top of the mountain.<br>\r\n<br>\r\n---<br>\r\n<br>\r\n:The last thing I remember is falling asleep. I woke up in a mysterious field, wearing my work clothes. There's water on the floor.\" Watashi's eyes shut. Her finger gravitated to her chin. \"Logically showing, I'll walk around a while, wake up in bed, and go 'it was all a dream!' with a dumb smile.\" Scanning the surrounding green spots, she rubbed her head. \"But there were fairies in the room. If it's fairies making up this dream, there's bound to be some secret to it.\"<br>\r\n<br>\r\nThe visitor had reached land. But even still, it felt marshy. The soil receded easily against her bare foot, cracks forming in the mud beneath her toes. It was wet and sandy. She wondered: \"is this a memory about the beach?\"<br>\r\n<br>\r\n---<br>\r\n<br>\r\nThe turmoil in the streets below only grew furiouser. Riots broke out as her quaking soles landed. When she was traversing the foggy sea, it was hard to estimate the height of the misty, ethereal figure. Now, with her dripping feet on land, their difference in scale was frighteningly clear. Her dizzying scale grew clearer the closer she got; even the tallest buildings didn't make it anywhere close to her ankles. It was a challenge to see above the pleats of her dress, which she held up daintily while trying upon the woods.<br>\r\n<br>\r\nCracks jutting out from her footprint consumed houses on the outskirts, swallowing them into the ground. Structures spared from that fate drowned in saltwater floods, cascading from her skin. Weaker office buildings collapsed simply from the tremors - mixed with the moister atmosphere brought by her soft soles. The streets congested with cars, buses, and crowds, wrestling one another to escape Watashi's looming, curvy shadow.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nThe wide-eyed explorer took another step, holding her dress up next to her shoes - careful not to get it must. She called out with a voice doing in lenity: \"Fairies! You can come out now.\" She sighed quietly. It was worth a try.<br>\r\n<br>\r\nWith a hum, she dragged her toes through the murky soil. They drew straight lines. \"Maybe this is some sort of 'Happy Place' my mind's escaping to? The pebbles feel softer and finer than anything...\"<br>\r\n<br>\r\n---<br>\r\n<br>\r\nHer voice was speaking a clear language they understood - but at its increased decibel, it was an echoing declaration that brought them to their knees.<br>\r\n<br>\r\nWith barely a flick of her heel, this gigantic mediator plowed through acres of farmland, using only her toes. The mighty bulldozers of flesh lifted, proudly dangling through the humid air. Sediments of dirt larger than a grown man clumped between their dexterous segments. When the destructive digit twitched, these clumps descended in a rockslide of detritus and compressed soil. The filthy avalanche crushed cars and trains fleeing the metropolis.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nNo answer. No landmarks in sight. Nothing. In every which way, just unending green and blue. Watashi turned on her heel, glancing in a circle. Her index and ring finger tightened around the shoes.<br>\r\n<br>\r\n\"Maybe it's like before, where there's an invisible wall somewhere...\" She leaned forward, and took a step. A powdery patch scrunched under her right foot. \"Oh.\" Internally, this sensation wasn't a surprise. It felt as if she'd read the script to this dream earlier. \"Did I step in moss?\"<br>\r\n<br>\r\n---<br>\r\n<br>\r\n<i>Whooooosh...</i><br>\r\n<br>\r\nThe citizens still remaining, huddled together, stared at the dirty sole eclipsing their sun. It happened too quickly for any military or police to react; and yet, three million lifetimes flashed before them. In a single fell swoop, the mighty foot descended. Buildings across the sky buckled and collapsed into the uncaring, fleshy ceiling. They popped like grapes, glass spewing from the sides. Everyone on the streets panicked, spoke their last words, made peace with their duties, or bowed down in worship, as they were buried underneath layers of soft, somewhat-salty skin.<br>\r\n<br>\r\n<i>KA-THUUUD</i><br>\r\n<br>\r\nEach of the terrifying toes obliterated a different residential area. Upper-class neighborhoods and slums were indistinguishable beneath the inadvertent destroyer. They broke equally to thin dirt sediments under massive wrinkles.<br>\r\n<br>\r\nThe sources of the city's power, bustling industrial zones, terrifying structures at the very height of human progress... Those were below Watashi's all-encompassing heel. They offered no resistance before splintering off into scrap metal.<br>\r\n<br>\r\nThe mediator had a fairly low arch; but it was tall enough to fit wide swaths of stores and restaurants. Shoppers got a close-up view of the slopes of skin above, emanating a musty, smothering air. It wasn't to last, through. The Earth couldn't support the weight resting atop it. Cracks branched out from the rest of her magnificent sole, swallowing and trapping any unlucky person they crossed. With a harsh roar, the once-solid ground became putty, as her heel sunk in deeper. The structures downtown met with the same inevitable fate, as they joined the mile-wide footprint.<br>\r\n<br>\r\n<i>Rumble...</i> Her step echoed across the empty sea.<br>\r\n<br>\r\nThe sounds of tearing concrete ended.<br>\r\n<br>\r\nThe screams ended.<br>\r\n<br>\r\nAll that remained was the low heartbeat of a confused girl.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nWatashi peeked down in confusion. The mist still covered everything - and it was getting thicker, as of her body heat added to it. She dug her toes in the earth, squeezing dirt between them, trying to identify it by touch. Dusty pellets broke off between the joints, clinging desperately to her flesh. She lifted her foot up from the ground, and examined the curious mixture. \"The fairies must've left a powder candy lying around. Whatever it was, I guess I broke it. Well, if nobody saw...\" She looked left and right, then brushed her foot against her calf, rubbing the evidence away.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nSurrounding cities witnessed the scene in shocked silence. The dizzying perspective from below the mega-scale Watashi made it hard to tell what happened; until, with a great rumble, her sole raised from the soil. What lay on the underside made them sick.<br>\r\n<br>\r\nA whole city. A whole city, caked under her sole. Flattened chunks of skyscrapers dripped off the ball. Rubble caught between her toes. It was surreal, dizzying - the way the ruins danced through the clouds.<br>\r\n<br>\r\nHer hand descended from the sky, like the hand of God, fingers wrapping around her sole's dirtied wrinkles. To someone her size, Watashi's giant feet would look delicate, even dainty. The behemoth had slender toes that wiggled constantly, curiously exploring the world; a perfectly round heel, with a slightly rosy tint from field work; and straight, cleanly-cut nails that had a gentle luster in the sun. By the confused expression in her brows, and the show motion of her feet, it was evident that the pink-haired mountain wasn't aiming for human settlements. She had the poise of a gentle woman at a tea party. That just added salt to the wound: their lives were snuffed by something so elegant and graceful.<br>\r\n<br>\r\nAs her finger brushed across the canyons and hills of her foot, debris avalanched off.  It was as if this monolith was showing off the ruins to them; showing humanity exactly what they were.<br>\r\n<br>\r\nTo neighboring cities, this was a great center of commerce and trade.<br>\r\n<br>\r\nTo the inhabitants, it was a proud, safe haven, all they'd known.<br>\r\n<br>\r\nTo Watashi, it was itchy dirt that stuck to her skin. Itchy dirt that she rubbed off on her leg.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nWith a last rub, it was gone - but she was no closer to finding an answer. Watashi decided to...<br>\r\n<br>\r\n(Inspired by <a rel=\"nofollow\" href=\"https://gs-uploader.jinja-modoki.com/upld-view-document.php?file=/documents/ydnkm/watashiwatashi_eng.jpg\" target=\"_blank\">https://gs-uploader.jinja-modoki.com/upl...</a> )</span></div></div>",
            "created":1551328140,
            "id":2624103,
            "title":"City Meets Watashi's Feet"
        },
        "151111":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "choices":[
                "Yes - Watashi turns around and takes a closer look",
                "No - Watashi keeps stomping ahead",
                "No - and the device makes Watashi grow even bigger"
            ],
            "content":"<div class=\"\"><div> <span>\"Empty. It's empty, no matter where I look.\" Watashi turned on her heels, peeking over the surrounding landscape. It twisted rubble of the ruined buildings into her soles, leaving behind a pair of perfect, circular craters.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nThe mediator gazed in the distance, standing on the tips of her toes. Rubble slid off her heels in massive avalanches. Grey clumps that were once buildings landed below, mangled beyond belief. Though they made resounding crashes as they descended to the earth, it was far too small for the destructive visitor to take note. Scant numbers of survivors thrashed between the segments of her digits, suffocated in their mass as she absently curled them up.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nShe held a hand to her forehead, to block the sweltering sun. In the strange mists, she spotted a string of mountains in the distance. \"I don't know what those symbolize to my subconscious...\" She thought, \"...but I suppose it's my job to research it. That's how dreams go.\"<br>\r\n<br>\r\nHer sky-bearing shoulders shrugged, and she rubbed her temples. \"I should keep a marker of where I've been.\" She clutched her pink slippers in hand. Loosening her grip, Watashi dropped the shoes to the ground, watching them settle. \"There. Please wait for me here, Mr. Lefty and Mrs. Righty.\" She chuckled dryly to herself - and went on her way, exploring the surrounding area.<br>\r\n<br>\r\n---<br>\r\n<br>\r\n\"No... NO!\"<br>\r\n<br>\r\n\"LOOK DOWN!\"<br>\r\n<br>\r\nThousands screamed as the monolithic woman casually loosened her grasp. The two massive shoes whirred through the air, getting closer and closer. Military forces unleashed a barrage of gun and cannon fire on them. When the clouds cleared, the army hadn't damaged anything- not the smooth surface, dirtied sole, or the rubbery insoles. The citizens had nowhere to run as the girl's clothing crashed on them with the force of a meteor.<br>\r\n<br>\r\n<i>thuUD.</i><br>\r\n<br>\r\n\"Mr. Lefty\" landed flat.<br>\r\n<br>\r\n<i>thooOMB.</i><br>\r\n<br>\r\n\"Mrs. Righty\" landed upside-down.<br>\r\n<br>\r\nThe left slipper absolutely crushed the inhabitants underneath the sole. Skyscrapers cracked beneath its weight, shattering into thousands of pieces. Roads of fleeing cars flattened without the slightest resistance. The pressure even dug into underground shelters, breaking through layers of concrete and soil. When the dust clouds settled, the entire district was a stain on Watashi's dainty, discarded shoe.<br>\r\n<br>\r\nThe population underneath her right slipper weren't much luckier. A pale insole with murky, oily prints replaced their sky. The shoe's sides dug into the ground floor the force of impact, creating impassible walls. The barricades blocked off all escape routes, all communication devices, and all clean air. Since the mega mediator slept in them overnight, the musty odor and warmth from her soles still lingered. The fragrance wafted off every corner of the shoe, which surrounded them like a dome. It slowly brought on coughing fits, forcing the populace to cover their noses. Throughout Watashi's slumber, the leather insole had absorbed sweat from her heel and the foot's ball. Now, the fluids dripped down across buildings, puddles intermittently flooding homes. No weapons could piece though the material. Rubber that once kept a woman's right foot safe and comfortable was entrapping a whole community in her essence.<br>\r\n<br>\r\nThe whole region shook from thundering footsteps on the distance...<br>\r\n<br>\r\n<i>THUD<br>\r\n<br>\r\nThud<br>\r\n<br>\r\nThud...</i><br>\r\n<br>\r\n---<br>\r\n<br>\r\nWatashi held her dress in her hands, treading across the flat landscape. Her knees cut the heavy fog along the fields, occasionally giving her a peek of cleanly-cut grass. She stumbled a little over the bumps and Knolls (is this the word). One uneven surface made her trip, jumping and waving her lime-sleeved arms for balance. \"W-woah. Careful.\"<br>\r\n<br>\r\n---<br>\r\n<br>\r\nWhen reports of a Brobdingnagian woman traveled across the land, people launched into panic. They set up cameras to watch her, had scientists predict her movements, ordered mass evacuations.<br>\r\n<br>\r\nBut one city ignored that. They'd built around a mountain chain - which protected them time a time again from invaders. Everyone was sure that the rocky barricades would protect them from the rampaging behemoth.<br>\r\n<br>\r\nThen she tripped on their mountain.<br>\r\n<br>\r\n<i>STOMP STOMP STOMP</i><br>\r\n<br>\r\nIn just a few leaps, trying to regain her balance, Watashi had already buried entire buildings into the soil. The residents scattered a the base had no time to prepare; each foot covered half the city. Her entire weight crashed on them. Skyscrapers didn't just break beneath her sweaty flesh; they shattered apart from the slam, as if a nuclear bomb detonated in the middle of town. Those outside the slender foot's shadow found immense tremors shaking their structures walls apart.<br>\r\n<br>\r\nThe only ones safe were the rich residents and tourists, who had rows of mansions decorating the mountain. They found themselves sighing in relief. It was unfortunate that their proud society lay in ruins before their eyes, entombed in a young woman's footprint - but they could live another day.<br>\r\n<br>\r\nBut sonic booms pierced the air. Multitudes of folds in her dress sifted, giant curtains draping her generous rear. Thousands of fine hairs, each longer than a highway wider than a human being, cascaded over her shoulder - revealing a pair of curious, confused peepers.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nThe immense mediator looked behind, at the lump that tripped her up. It had a bit of vegetation on it that looked different from the others. \"Even if this is a dream... It's strange. Did the fairies want me to notice this?\" She slowly, experimentally dragged her large and second toes around a mound's surface. Cool morning dew spread through her dangling digits, giving a refreshing sensation. Her prints took in the rough, but brittle texture. When she lifted her knee back, the green surface peeled off easily - revealing grey stone beneath.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nPanic broke out as she brushed her massive ped along the mountain's face.<br>\r\n<br>\r\nLandslides erupted from her wiggling phalanges, grinding forests and homes alike in its wake. Hundreds lept in cars, trying to outrace the lumbering wall of peachy skin. Without any effort, that barrier overtook them. Its moist perspiration, bone-crushing compression, and supple surface that bent over slopes, meant that everything stuck to the digit's filthy underside. Whole roads fit firmly into Watashi's canyon-sized toe prints. To an onlooker from below, it would resemble a monstrous sphere stripping the cliffs bare.<br>\r\n<br>\r\nThe mountain was ground helplessly into muck beneath her skin. People who enjoyed a view from up high, watching antlike people bustling below... they were no better than insects themselves, compared to the monolith of a mediator.<br>\r\n<br>\r\n---<br>\r\n<br>\r\n\"Huh. I worried myself over moss on a rock...\" Watashi wiggled her toes loosely, freeing the dirt clumps caught between them. Against the sun's rays - clearer than usual, with nary a cloud blocking them - the coolness was a bit relaxing.<br>\r\n<br>\r\nThe shortest path to the mountains had her crossing a field with more discolored, mossy patches; then a gentle river. Holding a finger to her mouth in contemplation, the mediator scanned for alternate paths; before releasing a sigh. \"I don't want to get my feet too dirty, or hurt plant life... But there's just too much of this mold to walk around.\" She held a leg out, peering down to the grey splotches with indifference. \"Please don't hate me for this, mold stuff.\"<br>\r\n<br>\r\n---<br>\r\n<br>\r\nOne after another, cities fell to the oncoming titan's feet.<br>\r\n<br>\r\nThe first city had rallied armies and militias together to fire at Watashi. Honor and valor lit their eyes, though her sole extinguished the sky. They stayed in position after the others had left - and would stay there forever, pancaked with their arms into a girl's footprint.<br>\r\n<br>\r\nBOOM.<br>\r\n<br>\r\nIn the second metropolis, people who'd seen satellite images of the wandering behemoth hailed her as a goddess. They'd formed a cult, who prostrated themselves as her towing silhouette conquered the horizon. Seeing the foot descending with a meteor's force, hundreds prayed to the oncoming wonder. Her distant eyes blessed them with a bored gaze, not even recognizing them as human. They watched each of her quiet fidgets and flexes in awe, entranced with the grace and scale of their long-haired idol. Without pause, her sole accepted them as sacrifices; they united with the soft skin from the heavens.<br>\r\n<br>\r\nTHUD.<br>\r\n<br>\r\nA third megapolis, home to a major airport, was overrun with absconders. Thousands rioted to get a seat on outgoing planes. After a lengthy briefings, bloodshed, and bribes, the first flights set off. Destination: anywhere else. As they took to the skies, radars suddenly flared up. They were barely off the ground, and already on a crash course for a dirt-caked, wrinkled ceiling. The city was too late. The airplanes, the routing crowds, all joined the others in Watashi's foot gunk.<br>\r\n<br>\r\nPOUND.<br>\r\n<br>\r\nShe trod upon another, the fleshy folds engulfing skyscrapers. She scrunched her dainty digits together, dragging stores and restaurants from their foundations - soon mashing a whole commercial district into the ball of her foot.<br>\r\n<br>\r\n\"Hmm, I wonder if anyone else is here... It's sort of lonely. Peaceful, though. And the cool pebbles refresh my soul... or sole.\" She spread her toes out, indulging in the massaging sensation. Great structures shattered on impact against each mountain of skin.<br>\r\n<br>\r\nFinally, Watashi reached the lake - or rather, the sea. She dipped in, holding her dress above the water.<br>\r\n<br>\r\nAmid the ruins of footprints she left, few survivors remained. From there, government workers - not unlike the mediator herself - mounted an experimental weapon. They had no time to test; the beam fired just as she entered the water, hitting her firm rear.<br>\r\n<br>\r\nBut did the traveler notice?</span></div></div>",
            "created":1554253500,
            "id":2638915,
            "title":"Curiosity Crushed the Cities"
        },
        "1511113":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "choices":[
                "Watashi takes a break, and lies down",
                "Watashi keeps exploring",
                "Watashi awakens from her \"dream\""
            ],
            "content":"<div class=\"\"><div> <span>\"I'm not properly clothed for wading through water.\" Watashi shut her eyes at the clear river's cool temperature, battering her bare skin. She shut her green eyes, and held her arms out. \"If this is a dream, then maybe I'll try conjuring a bathing suit, or making the river shallow. Fairies, can you do that?\"<br>\r\n<br>\r\nA tiny sting hit her leg, making her slap it. \"Of all creatures, why would the fairies put a mosquito here?\"<br>\r\n<br>\r\n---<br>\r\n<br>\r\nThe weapon's beam struck the humongous explorer directly in the back of her knee. Voltage surged from that spot, electric bursts spreading on the towering leg. It reached her dress and apron, traversing the fine materials. Lastly, it caught in brilliant sparks across her waist-length hair. Shadows upon the ruined cities shifted; her thigh muscle flexed subconsciously from the jolt.<br>\r\n<br>\r\nThat shadow stretched out over the plains and valleys of uprooted homes. It coated the ruins of the woman's careless stroll, and beyond, to millions watching in horror and panic. Her shoulders passed the clouds, followed by her ample bosom, full hips, and peachy knees. The workers at the coast who built the gun had little time to wallow in regret: the mediator's growing heel collided with their buildings. A harsh impact instantly pulverized them into the expanding, supple skin. Survivors witness the delicate woman's weight cracking the ground, breaking off a chunk of ground from the shore, and sending it sinking to the seafloor.<br>\r\n<br>\r\nIf their first plan didn't work, the government had their navy in place to intercept the wandering behemoth. But as she stretched out, feeling the water, her slender toes flexed into the sea. Even if were standing still, the tidal waves generated by the immense pads would overtake their armada. But with an innocent smile, Watashi flexed the mile-long pillars into the refreshing liquid, overturning them with the undulations.<br>\r\n<br>\r\nWith less than a twitch, the mediator's height - already enough to devastate a continent - multiplied tenfold. She opened her eyelids; and soon, her mouth followed, gaping in amazement. She kicked a foot into the water. The resulting blasts of pressure washed up on beaches halfway around the world. Its power sliced the steel hulls of larger boats, and tore smaller ships into sprays of metal rain.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nQuietly, the woman held her finger to her mouth, observing the much more manageable waters below. They were essentially a puddle, brushing just midway up her talus. Wetness dripped from her kick, making circular ripples in it. \"Huh... It actually worked. The river dried up.\"<br>\r\n<br>\r\nThat wasn't all. The skies were darker, filled with stars. It gradated to an azure hue at lower heights. The strange mists had descended to the ground, forming miniature whirlpools that tickled her bare ankles. But amid that, the mountain chain still stood. She continued, keeping her eyes on the target, hoping it'd give her some clarity.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nAcross the sea, the government jumped to work. They put every other operation on hold to build up defenses. Satellite images and translated news reports gave them enough information to work with. On the front lines, a well-oiled air force patrolled the furthest reaches of their country's maritime boarders. They swore the giant visitor's innocent steps would not soil their land. With the high altitude and size of the air crafts, she was bound to see one, and realize what was happening.<br>\r\n<br>\r\nThen they saw one of Watashi's toenails in front of them.<br>\r\n<br>\r\nIt wasn't on the radars patrolling of the seas below.<br>\r\n<br>\r\nIt wasn't pictures sent from overseas allies on the ground.<br>\r\n<br>\r\nTheir planes, miles in the sky, were level with her nail.<br>\r\n<br>\r\nHer toes were standing relaxed, partly submerged in the ocean. Despite being cut flat, there were clearly clumps of destroyed buildings in the space underneath them. A skyscraper wouldn't be tall enough to pierce the keratin convex.<br>\r\n<br>\r\nThey could prepare for a giantess. They couldn't prepare for a 2000km tall giantess. If she lay down, she'd be longer and wider than Japan.<br>\r\n<br>\r\nMost pilots turned immediately, knowing that an idle twitch meant the end of their lives. But one brave helicopter pilot unloaded her arsenal onto the vast surface. A dazzling explosion brushed the hard cells. When the smoke cleared, the mediator's toenails remained unscathed, unchipped, and towering as ever.<br>\r\n<br>\r\nShe continued her journey. The helicopter and fleeing planes exploded instantly upon contact with her moving flesh. The splash from her steps created tides large enough to consume the fleet. In fact sheer force in her legs made bits of the seafloor rise to the surface, and reawakened underwater volcano chains the world over. It doomed many in distant nations.<br>\r\n<br>\r\nAnd this country before her didn't have very high hopes, either.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nThe pink-haired explorer made landfall, relaxing her digits into the swampy green spot. She still held her dress up, baring her legs - to make sure none of the muck below stained it. Even a few steps out of the water, the thin grass splashed and slid around her heels. A bath. She'd need a bath after this.<br>\r\n<br>\r\nBut first, the mountain range. Maybe it'd give her a clue to this mysterious dreamscape...<br>\r\n<br>\r\nShe blinked. Her shoulders slumped. Her voice dripped with sarcasm: \"My, my. It's glorious.\"<br>\r\n<br>\r\nThe \"mountains\" were right there, barely brushing halfway up her toes.<br>\r\n<br>\r\nWatashi lifted her foot delicately. \"Is this some sort of illusion?\" To test, she prodded the small lumps. The meager touch flattened them instantly.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nMisty clouds circled her toes as they crushed the landscape below.<br>\r\n<br>\r\nFive cities disappeared underneath 10,000 square miles of pedeal flesh. The modern structures at the height of development cracked and splintered like toothpicks with a mere touch. As if the mountains were liquid, her sole sunk into them. Loosened from her unconscious crush, and flew in the air. With an immense splash, they enveloped other nearby metropolises in a filthy tomb.<br>\r\n<br>\r\nDue to the Earth's curvature, the living landscape's expression was imperceptible. The highest point in perspective was her knee, twisting slightly as it lifted to the heavens.<br>\r\n<br>\r\n...Only to descend in yet another cacophony of quaking and filth. A million cries drowned helplessly beneath the humid wrinkles.<br>\r\n<br>\r\nWhen she raised her leg, nothing but a five-digited canyon remained. The imprint was visible from space. The sides were higher than any man-made structure. Every trace of contract by civilization or nature vanished beneath it. It was all trash, compacted to hard rubble by incomparable pressure.<br>\r\n<br>\r\nHighrises, towns, roads, and valleys stuck to her dermis, abducted from the Earth. In avalanches, the flattened structures slipped from her stratosphere-piercing heel, and down to her looming, thin digits. Flash floods from the residual saltwater traversed the countryside. Others experienced showers of lint-smothered houses; the crumbling settlements caused mass destruction on their own. A single step destroyed all hope for rebuilding their homes. In fact, people doubted the land would ever be inhabitable again.<br>\r\n<br>\r\nFrom sea to sea, her monumental foot stood as a beacon. Her round heel glimmered with wetness, sweat drops sweeping through torn landscapes. The arch was almost untainted by the country - clean, delicate, and rosy with warmth. Dirt plainly marked the curves of her metatarsals, showing exactly where it dug deepest into the landmass. And when each of her flexible joints dangled, phalanges folding and unfolding, scores of debris cascaded from the organic folds of her prints. Debris that could be them, or people they knew. Visible waves of warmth rose from both the sky-dominating skin, and the crater it left.<br>\r\n<br>\r\nWith naught but a step, Watashi had shaken every soul in the world.<br>\r\n<br>\r\n---<br>\r\n<br>\r\n\"Great. The fairies have really outdone themselves.\" The woman began pacing, in search of people. \"Where do I go from here? I can't see my shoes. It's nothing but green and blue...\"<br>\r\n<br>\r\n---<br>\r\nAs the explorer paced, more land fell to the meteor strikes of steps. Her dainty footprints wiped the largest cities and mountains clean off the map. The gentle sway of her hair in the wind made a booming noise, like a bomb dropping from above. And the swing of her ankle, alone, generated winds that tore trees from their roots.<br>\r\n<br>\r\nUnderground safety bunkers were evenly scrunched, her skin piercing their ceilings. Trains, planes, and cars trying to leave were broken helplessly. Nuclear weapons did nothing but wipe some of the ruins off her soles. Whole states and provinces screamed as one - a quiet buzz to the mediator, who snuffed them underfoot.<br>\r\n<br>\r\nWithout noticing, her pace led her across seas, to new continents. Nobody escaped the quaking stomps. Skies filled with peach, and within seconds, the falling behemoths pulverized every trace of a living organism.<br>\r\n<br>\r\nBOOM. Immense Western metropolises were dust on her sole.<br>\r\n<br>\r\nBOOM. Northern settlements were cool tickles on a girl's heel.<br>\r\n<br>\r\nBOOM. Centers of culture were gone forever.<br>\r\n<br>\r\nBOOM. Vast deserts and ancient structures decorated the side of her arch.<br>\r\n<br>\r\nBOOM. Sprawling Eastern capitals became toejam.<br>\r\n<br>\r\nBOOM. Southern archipelagos sunk to the seafloor.<br>\r\n<br>\r\nNo place was out of her curious legs' reach. No site was too sacred for her innocent touch to defile. Nothing the humans did meant anything. They could only pray not to swallowed by growing cracks from her crush; stuck beneath mountainous rock slides, or washed up in influxes of saltwater... But to disappear quickly with the billions against her supple sole.<br>\r\n<br>\r\nIn a matter of minutes, a young woman had effortlessly rendered beautiful Earth into a map of her shapely footprints.</span></div></div>",
            "created":1555709760,
            "id":2646940,
            "title":"Continental Drifter"
        },
        "15111133":{
            "author_id":"tfwnogiantgf",
            "author_name":"TFWNoGiantGF",
            "content":"<div class=\"\"><div> <span>Watashi's quick international voyage shook every Alan, Becky, and Carl across the inhabited continents. But there remained one spot of land still unmolested by her footprints.<br>\r\n<br>\r\nThe titan gazed north - and a patch of land caught her attention. \"Oh? The grass is white up there. Is this turning into a winter dream?\"<br>\r\n<br>\r\nIn only four earth-shattering stomps, the mediator has set foot on the Arctic. Conditions would normally be inhospitable for human life. But thanks to her thick dermis, and the square-cube law, the titan only felt a little chilly. In fact, the natural breast radiating from her melted glaciers and increased sea levels.<br>\r\n<br>\r\nHowever, her height did little to help a simple fact: the icy reaches were still incredibly slippery. Her leg swung ahead a little too quickly - and lost balance. She fell backwards, pupils pointed to the stars.<br>\r\n<br>\r\nIt felt oddly familiar. As if, some time ago, she'd slipped on a loose banana peel...<br>\r\n<br>\r\n---<br>\r\n<br>\r\n<i>Pomf.</i><br>\r\n<br>\r\nWatashi's shoulders fell into her bed. Her long hair spread on the covers, dripping down the bedside. She rubbed her temples, stirred by the bright sunlight from the window. It made her head retreat into the soft pillow.<br>\r\n<br>\r\n\"Morning...\" She blinked, and held a hand out. The dream world of green and blue plains disappeared before her eyes. Reality lay in its place. But still, her legs and backside ached, as if she'd exercised. Sleepwalking, perhaps?<br>\r\n<br>\r\nThat seemed unlikely. Her cooking utensils and books were where she'd left them. Nothing had changed in the room since the mediator climbed into the Sandman's spell. Nothing, that was, except the snoring fairies. Left alone, without their boxes, the little guys multiplied overnight. She sighed. From experience, that meant they'd been up to something. Something \"fun\".<br>\r\n<br>\r\nThe green fairy perked up, and gave an inquisitive gaze. <span style=\"font-family:comic sans ms, cursive\">\"Learn new things?\"</span><br>\r\n<br>\r\nAnother peeked over. <span style=\"font-family:comic sans ms, cursive\">\"Learn old things?\"</span><br>\r\n<br>\r\nThe one in purple turned his head. <span style=\"font-family:comic sans ms, cursive\">\"Meet and greet the heretical author?\"</span> He held up a ripped piece of paper from the story she read last evening.<br>\r\n<br>\r\nHalf-asleep words rolled from their host's mouth. \"Wh...whah? But I never even left the house...\" She tapped her head, examining the ancient text again - stories about a massive monster, and the end of everything. <i>What did these guys put in my food?</i> Slipping from the sheets, trying to get another look at the old sheet, she paused. Her bare foot touched the ground.<br>\r\n<br>\r\nHer slippers were missing. She brushed the base of her sole, to find strange dirt across it. Soft green and brown, with hard clumps of grey. It broke off against her index finger from every crease and curve.<br>\r\n<br>\r\nWith an eager grin, the captain trod over, waving his hands towards the litter. <span style=\"font-family:comic sans ms, cursive\">\"Oh, you brought souvenirs?\"</span><br>\r\n<br>\r\n\"Souvenirs?\" That comment made Watashi stare closer. Amid the lumps, she made out long, thin shapes, resembling toothpicks. And if she squinted closely, that bit of green between her small toe and heel almost looked like a tiny Statue of Liberty... Or The Motherland Beacons?<br>\r\n<br>\r\nAnd when she brought her ear closer, there was almost a tiny buzzing from it... As if it were a radio tower broadcasting a distress signal...<br>\r\n<br>\r\nThe red fairy pulled the captain back, shivering. <span style=\"font-family:comic sans ms, cursive\">\"Stop! The souvenirs have EM waves!\"</span><br>\r\n<br>\r\n\"Electromagnetic waves? Down there?\"<br>\r\n<br>\r\nHer companions froze. They couldn't stay around with that interference! Instantly, they scattered, packing up their belongings and jumping out.<br>\r\n<br>\r\n<span style=\"font-family:comic sans ms, cursive\">\"Geronimo!\"</span><br>\r\n<br>\r\n<span style=\"font-family:comic sans ms, cursive\">\"Hasta la vista!\"</span><br>\r\n<br>\r\n<span style=\"font-family:comic sans ms, cursive\">\"See you next mission!\"</span><br>\r\n<br>\r\nThe apron-clad woman rushed to the window after them. \"Wait! What was that about?...\"<br>\r\n<br>\r\nShe stopped.<br>\r\n<br>\r\nHer jaw dropped.<br>\r\n<br>\r\nShe pinched herself.<br>\r\n<br>\r\nWith bulging eyes, the worker stared at a massive structure out the window. \"That... Wasn't a dream, was it?\"<br>\r\n<br>\r\nThe torn paper fluttered to her toes. She looked at the paper's torn spots. \"Not <i>my</i> dream, at least...\"<br>\r\n<br>\r\nA black dog barked from the mountain.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nY heard a knock at the door. She stuffed her yaoi into a drawer, buttoned her shirt and pants back up, and hastily wiped lubricant from her hands. \"Come in, honored guest!\"<br>\r\n<br>\r\nThrough the doorway, Watashi stepped in. She had copies of the old papers on her hands. \"I've come to return these. Couldn't find anything for the Human Monument Project.\"<br>\r\n<br>\r\n\"Ah, that's too bad.\" Y shrugged, faking surprise. \"I just gave those to you because my boss told me to. Didn't think they'd be worth much.\"<br>\r\n<br>\r\nWith a scratch of her head, the mediator stepped in closer, handing the papers to her. \"There's one thing that concerns me, though. These are exact photocopies, right?\"<br>\r\n<br>\r\n\"Of course. My copiers are the best in Camphorwood.\" Running a hand through her silver hair, the discoverer beamed.<br>\r\n<br>\r\nWatashi pointed to the torn part of a paper, tilting her neck slightly. \"Strange. A photocopier can't duplicate rips.\" She leaned in closer, smiling. \"Which means <i>someone</i> must have ripped them <i>after</i> copying them.\"<br>\r\n<br>\r\nHer companion crossed her arms. \"Mistakes happen. Anyway, if there's nothing else...\" She cut herself off. The mediator was rummaging through her waste bin.<br>\r\n<br>\r\nBefore anyone could stop her, the visitor found the other side of the ripped pages. She started reading them. \"The great destroyer was a woman with pink hair... A giantess appeared from the sky to trample everything...  This story is a work of fiction; however, it was inspired by real accounts of the extinction event, when a goddess visited Earth...\" She laughed dryly at an illustration depicting a terrifying silhouette in a long dress, and buildings collapsing below it. \"I don't think my feet are that big...\"<br>\r\n<br>\r\nTwitching, the host looked aside, fiddling with her collar. \"I-I just... I didn't want you to... You'd think it was a joke!\" Somehow, this smarty-pants found out - even when she'd tried to hide it. She was coworkers with someone who the fairies had sent to the past and grown to giga heights. Someone who'd inadvertently triggered humanity's decline. What could she say?<br>\r\n<br>\r\nWith a shrug, Watashi dumped the rest of the papers into the bin. She wiped her hands. \"There. It's never turned out well when people call me a 'goddess' or 'Queen'. I'm a mediator, and I shouldn't overstep my authority.\" With a wide smile, she opened the door. \"Let's keep it a secret between friends, okay? If this got out, the fairies might get ideas.\"<br>\r\n<br>\r\nThose were her time-tested tactics. \"Hide the truth. Manipulate information. Intimidate.\" Against that, Y couldn't do much but sink into her seat. \"Right... Not like I was going to publish manga about it or anything. The secret's safe with me.\"<br>\r\n<br>\r\nWith a standard farewell, and an uncomfortable handshake, the workers parted ways. But as the silver-haired woman took her manga back out, she couldn't help but wonder: how had her companion figured the truth out? What led her to question the papers...?<br>\r\n<br>\r\nOutside the window, the pink-haired traveler looked at two titanic landmarks, miles into the sky. Moss and scratches caked the sides. As she'd asked them to, Mr. Lefty and Mrs. Righty kept track of where she'd trod.<br>\r\n<br>\r\nHer discarded shoes loomed over Camphorwood.</span></div></div>",
            "created":1555713420,
            "id":2646962,
            "title":"Scattering Seeds for the Future"
        },
        "153":{
            "author_id":"questathana",
            "author_name":"Questathana",
            "choices":[
                "Ultimate Size (Goddesses)",
                "Gigantization Magic Exist Too!! (Futa)",
                "Other Madoka Cast"
            ],
            "content":"<div class=\"\"><div> <span>After the events of the Madoka Magica show and movie, Homura and Madoka now have godlike power. Homura constantly takes out her feelings out on everything from entire cities to planets. Madoka is the more gentle of the two, but she still often plays around with Homura and causes an untold amount of devastation. They can grow to as big as they want, bring back what they destroy and might even have some hidden powers up their sleeves. Their only real challenge is each other.<br>\r\n<br>\r\nThis is the scenario in Ochiko's latest hentai. However, he also made one that involved Homura, Madoka and even Mami becoming insanely big futas and causing destruction.<br>\r\n<br>\r\nYou can pick the first, the futa or a new scenario involving other Madoka characters besides just the main two. </span></div></div>",
            "created":1547787600,
            "id":2604535,
            "title":"Madoka Magica"
        },
        "1531":{
            "author_id":"questathana",
            "author_name":"Questathana",
            "choices":[
                "Original Story 1",
                "Original Story 2",
                "Related More Closely to Ochiko"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Original story with the characters or related more closely to Ochiko's art?</span></div></span></div>",
            "created":1562975520,
            "id":2685889,
            "title":"Ultimate Size (Goddesses)"
        },
        "15311":{
            "author_id":"questathana",
            "author_name":"Questathana",
            "choices":[
                "Homura takes a sip",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Note: This contains spoilers for Puella Magi Madoka Magica and Puella Magi Madoka Magica: The Movie.<br>\r\n<br>\r\nIt was late at night and Homura Akemi was alone for the day. She was testing her power with seeing what she could do, after she recently acquired goddess powers she stole from Madoka Kaname. Homura could grow out wings and cause her soul gem to float with her mind, but she wondered what other powers she had now. She was in her room thinking with her mouth rather dry and acting a bit sleepy. She looked at her purple eyes in the mirror while she brushed her black hair. She wished she had remembered to bring coffee to her room and just like that, a cup of the substance spawned in her hand. She then dropped it out of surprise and made a mess on her floor. Homura wished she had not made that mess and just like that it was gone. She proceeded to think up a new cup of coffee to spawn in her hand, this time without dropping it.<br>\r\n<br>\r\n She drank her coffee and thought up many powers she could possess such as teleportation and transformation. They all seemed to work with Homura teleporting to the next room and transforming herself briefly to have the appearance of Madoka. Homura did everything she could think of for a little while and after going back into her demon clothing, she thought of the possibility of Madoka herself having similar powers. For all Homura knew, she obtained omnipotence and Madoka would be the second candidate for that sort of ability, due to Homura having acquired her vast power from Madoka. Homura finished up what she was doing and quickly went on her way to Madoka’s house. Homura gazed into Madoka’s pink eyes as she was somehow still awake. She then proceeded to knock on her favorite person’s window. Madoka had heard the sound and opened her window only to surprisingly find Homura waiting there.<br>\r\n\t<br>\r\n“Homura-chan what are you doing here? You know I like to see you, but I kind of use this time for sleeping…” Madoka said confused as she played with her pink hair.<br>\r\n\t<br>\r\n“I know Madoka and I would only disturb you at this time if it was something very important. I just discovered something and I saw you were awake, so I decided to share the details now. For some reason, after I brought you back to this world and ‘borrowed’ some of your power, I might have gained omnipotence. There is a good chance that you could have acquired a similar ability.”<br>\r\n\t<br>\r\n“Omni… po… tence? Isn’t that the power Kyubey said I would have after I made my wish?”<br>\r\n<br>\r\n<br>\r\n\t“I think you are mistaken. Omnipotence literally means power to do anything imaginable. Kyubey might have described it because the power you got might seem like that compared to what you had before. However, I believe your power now won’t just seem unlimited, but will let you do anything you can think of.”<br>\r\n<br>\r\n<br>\r\n\t“So you are saying if I wanted to make a plushie of you, I could just do it by thinking…” Madoka said, as she soon found what she thought of cradled in her hands. “Woah, you are saying this could not have any limits? What about something crazy like making a tiny universe?” Madoka asked, but before long she found one encased in a small glass ball sitting on top of the Homura plushie like an accessory and Madoka was mesmerized. <br>\r\n<br>\r\n<br>\r\n\tHomura was also pretty surprised to see something so great appear out of practically thin air just like that. She then teleported next to Madoka and said “That… was truly amazing Madoka… Any plans for your new, micro universe? Wait my powers also give me insights to this universe and beyond I think, so I will use some of it.” Homura thought for a minute and then said “Our power does seem to do everything and is unlimited, but there is kind of a catch. The immense energy of our power comes from other universes, for instance making your toy that looked like me. Doing so probably involved random pieces of matter and energy from other universes, and that could have included killing life.”<br>\r\n\t<br>\r\n“Oh god, I did such a thing?!” Madoka asked as she broke down crying. <br>\r\n\t<br>\r\nHomura tried to think of something to say to calm down this goddess as she said “It’s not your fault Madoka. You didn’t know. Wait… I thought of an idea. We can use our powers draining energy and matter of universes filled with evil essence. We could be improving our lives, and everything else by getting rid of evil at the same time. The more we drain the more we get in return. There has to always be a balance, so draining evil will cause more evil to form. We would just be punishing evil that has been around for a while. So how about we have fun and help our friends out while also giving some divine punishment. Seems like a win-win situation to me. <br>\r\n\t<br>\r\nMadoka soon stopped crying and said. “Well, I guess that would be a good use of our powers.” She proceeded to reorder her plushie into matter and energy creating a universe of good essence. She then returned that one and the other one she took to be among the other universes in the multiverse. This pink haired girl decided to change into her magical girl outfit and move to sit on the couch in the living room with her best friend as she found that to be the most comfortable. She then took a universe filled with evil essences from the multiverse and said “I’m kind of curious. How do you think a universe would taste?”<br>\r\n<br>\r\n<br>\r\n----<br>\r\n<br>\r\nVincent Aarons was a ruthless and violent person like many among his world. He would only work with others if it was a life or death matter. He would steal, kill, rape and other horrible acts to get his way and do what he wanted. Most people he met acted similarly, so he was prepared to fend off others and view any of his connections with extreme concision. Besides his continuous fear of death, Vincent was mostly pretty happy. He then heard a treaty emergency that was calling everyone to the center of every center. Treaty emergencies were the only time's people truly worked together. They were extremely rare as the usually occurred during events like huge, environmental disasters that threatened everyone in a large area.  <br>\r\n<br>\r\nOnce Aarons reached the location with a bit of nervousness and his hands on his brown hair, he was told that a possible apocalyptic disaster was occurring. There was some kind of vortex that recently appeared and was sucking in whole galaxies into it. It appeared insanely far away but was moving at such a fast speed that before long it would probably suck in Vincent’s whole galaxy. It was doubtful that any of the life inside would be able to survive the journey. The people calling the emergency said that everyone should try to research and help in any way to possibly prevent this demise. Lots of people did not believe them but were soon convinced when they looked out in the super, advanced telescopes placed in that area. Not everyone studied science and those that studied astronomy were few, so not many people could help.<br>\r\n<br>\r\nDue to Vincent having almost no knowledge of science, he was one of the people sent out to look to find scientists who might have missed the emergency in order to get them to help. This was a pretty pointless task as it was incredibly unlikely to find more information and put a stop to this event before their lives would be taken. However, it did not stop most from giving up as they still kept hope with them. Vincent went out and found a few scientists after a little while. During this, it was the first time in his life that he was truly terrified. He looked up out of his green eyes and could see clusters of stars disappearing as if they were being sucked out of existence. He headed back to the treaty emergency camp and after arriving, watched the scientists discuss what to do for this crisis. After a long time, they seemed to have come up with nothing and all seemed hopeless as most of the observable universe was gone. Then a miracle happened with the vortex seeming to disappear. Everyone cheered for this victory, but it did not last for long. <br>\r\n<br>\r\nSuddenly drops of water as big as countries came landing on all kinds of planets and this one was next. The water drops destroyed large parts of the landmasses and caused huge earthquakes and colossal tsunamis that devastated the continents. Vincent was trying to stay balanced by the tremors he felt, but it did not last long as a wave of water swept him down. It was too much for anyone to be able to swim in, so he started to drown. As he drowned, his life flashed before his eyes. He could remember all the cruel deeds he did to others and how he never wanted those acts to be done for him. During all this, he had no regrets. Then he died along with the rest of his universe. <br>\r\n<br>\r\n----<br>\r\n<br>\r\nMadoka had drank almost an entire universe inside a glass with a straw. It tasted rather unique and sweet. She wondered if she should make more universes like these and give them to her friends or sell them for fun. She then rinsed it off in the kitchen with some room temperature water. During all this, she had little consideration for the lives she snuffed out. To her they were evil and she was simply passing divine judgement on them. Homura watched all this and could not keep her eyes off this. She was getting turned on as her nipples with her nipples getting a bit erect. as she imagined the perspective of that universe and the one she loved dominating it. Madoka did not notice this. However, she did notice that the universe in a glass with a straw she handed to Homura remained full. She commented on this with “Your universe drink... He he, it’s funny saying something like that, but well your drink is full. Are you not thirsty or is something wrong?”<br>\r\n<br>\r\n\t“Sorry I was just distracted.”<br>\r\n<br>\r\n\t“Then drink up, heh heh.”<br>\r\n\t<br>\r\n</span></div></div>",
            "created":1562975580,
            "id":2685891,
            "title":"Puella Magi Madoka Magica: Accession "
        },
        "153111":{
            "author_id":"questathana",
            "author_name":"Questathana",
            "choices":[
                "Interacting With the Other Magical Girls (Reserved)",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>“Sure thing. Thanks for the meal…” Homura said as she nervously took a sip. <br>\r\n<br>\r\n----<br>\r\n<br>\r\nMaximilian Kevin was one kindist individuals in his world. He helped his world fight the Dark Force. The Dark Force was what his side called the Great Empire. The Great Empire was a group of people that took up over half the universe. They enslaved species that were not humanoid, monteried all the civilians and had strict laws. They claimed to stand for ideas like order and for people they called “pure”. Max worked was the head of rebels that called themselves the Light Force. They would fight back by committing actions such as stealing supplies, destroying equipment and freeing prisoners. Maximilian and his peers were strong believers in peace and would avoid violent methods unless it was the only way to save a lot of people.<br>\r\n<br>\r\nMr. Kevin came to his office one day to find a disturbing report. It seemed his entire universe had shrunk to an extremely small size and was transported into some unknown location. He was incredibly surprised by this report and checked it many times to make sure it was correct. Only recently was this universe mapped out and explored by the different species he knew.  Neither his friends nor enemies could have that sort of technology or even see past the universe. Plus it made no sense for them to do that, as they would be putting themselves in the same predicament with the rest of everything he knew.  The multiverse was just a theory, but this report was so far proving it to be true.<br>\r\n<br>\r\nHe had theories of what was happening to his universe being caused by some other being in a different universe.  He thought that the universe was shrunk to stop it from expanding, was to be put out of sight or his biggest fear, that it was turned tiny to be some kind of toy for someone. Even though he was not the religious type, in the back of his mind he had the thought that this was not caused by technology, but by some sort of god. He didn’t want to withhold this information because he let go of secrets when he created the Light Force. Even though this truth was a horrible one, he felt it had to be told. <br>\r\n<br>\r\nMaximilian Kevin told this report to everyone on his side, while he believed the Dark Force probably found the information already and was keeping it a secret. The people either did not believe the report, tried to pretend it did not exist or was fearful as if it were the end times. The last of those people listed either thought they were being affected by another universe of advanced technology or it was a divine entity. The latter theory was much more popular as many converted to religions or started their own based on this event. The gods that the people prayed to with their best abilities varied with age, gender and appearance. However, they all have one fact in common and that was the plan they had for the entire universe.<br>\r\n<br>\r\nThe news only got worse once Max found out that an object almost as big as the universe made contact with it. The object had crushed many of the galaxies when it entered that space. The most frightening part was that the object looked like and was made of the same materials as a common, plastic straw. This made it pretty obvious what would happen as more galaxies were being sucked through the vortex of the straw. It was like a colossal black hole. Mr. Kevin fell into a deep depression as he barely even wanted to move after hearing this information. <br>\r\n<br>\r\nHe only had a tiny bit of hope that this creature would only eliminate the Dark Force and leave the Light Force alone. Soon that hope was gone as the straw sucked up planets belonging to the Light Force the same way it sucked up the others. After this, Max burst into tears as he knew he and everyone else he knew would soon be dead. A large portion of the remaining inhabitants of the universe remained blissfully unaware of their fate. Before everyone knew it, the tremors had started. <br>\r\n<br>\r\nThe tremors got more and more intense as everyone started to panic. They tried to escape in spaceships or by hiding in bunkers, but it would not increase their chance of survival. Everything was soon being ripped apart no matter where anyone was in the universe. Maxillian and some others had managed to stay alive. This would change as they headed for a vast pink surface of a tongue. The enzymes proceeded to break up everything remaining for it to be easily absorbed, just like it would with any food. What was left over was sent down the throat to be digested. By this point, Maxillian Kevin was long dead and not even his soul was saved.<br>\r\n<br>\r\n----<br>\r\n<br>\r\nHomura drank the entire universe leaving nothing left. She even made sure to use her powers so it would not even have any drops remaining. She did not want there to be any hassle for Madoka, so she did this all without hesitation. Homura realized that she probably devoured plenty of innocent individuals, but she did not care. She knew this was what Madoka wanted and that was all that mattered. <br>\r\n<br>\r\n----<br>\r\n<br>\r\nSources:<br>\r\n<br>\r\nCastro, Joseph. “How Do Enzymes Work?” LiveScience, Purch, 26 Apr. 2014, www.livescience.com/45145-how-do-enzymes-work.html.<br>\r\n<br>\r\nNow feel free to message me ideas of what will happen next with Madoka or Homura interacting with the other magical girls. It can be anything giantess or femdom related. Kyoko is for cruel interactions, Mami is for gentle interactions, Nagisa is for playful interactions and Sayaka is for gentle interactions on “good” people and cruel interactions on “evil” people. You can also use original characters or any other characters from the franchise. <br>\r\n</span></div></div>",
            "created":1562975700,
            "id":2685892,
            "title":"Homura takes a sip"
        },
        "1533":{
            "author_id":"questathana",
            "author_name":"Questathana",
            "choices":[
                "One Giantess",
                "Pair of Giantesses",
                "The Whole Cast are Giantesses! (What about Nagisa?)"
            ],
            "content":"<div class=\"\"><div> <span>The giant Madoka Madoka characters can be everything from colossal futas to world destroying goddesses. However, the real question is who are these characters. Let's somewhat simplify this while still giving lots of options. You can decide between having one character as a giantess, a pair as a giantess or the entire Madoka cast as giantesses.<br>\r\n<br>\r\nThe first two options can be anything from the main cast, spin off characters to original characters made right here or elsewhere on the internet. Option three will have the least variety as it must include the whole cast.<br>\r\n<br>\r\nHowever, option three can include Nagisa or not as she sometimes is part of the main cast.</span></div></div>",
            "created":1547787600,
            "id":2604538,
            "title":"There are more than two characters!"
        },
        "15333":{
            "author_id":"questathana",
            "author_name":"Questathana",
            "choices":[
                "Holy Quintet",
                "Final Team"
            ],
            "content":"<div class=\"\"><div> <span>Nagisa Momoe first appeared as the witch Charlotte, but then reappeared as a magical girl with control over her witch powers. Our happy Nagisa likes to blow bubbles, make jokes and eat cheese.<br>\r\n<br>\r\nShe has always had a close relationship with Mami. Whether it be eating her or bonding with her with her nickname of Bebe. Nagisa's relationship with Mami is not clear if it is a sisterly bond, a mother daughter bond or a best friend bond. It could even develop into dating, despite the three year gap in age. <br>\r\n<br>\r\nThe first option is the Holy Quintet of the original five magical girls, while the second one is the final team that includes Nagisa. </span></div></div>",
            "created":1552430760,
            "id":2629554,
            "title":"Nagisa's Fate"
        },
        "155":{
            "author_id":"pokefan2",
            "author_name":"Ponymon",
            "choices":[
                "Giga Hasaha",
                "Gigantic Friends",
                "Continued Choices"
            ],
            "content":"<div class=\"\"><div> <span>Choice 1: Giga Hasaha pictures: An innocent fox Yokai from the Summon Night series explores the tiny world beneath her and causes all: <a rel=\"nofollow\" href=\"https://gs-uploader.jinja-modoki.com/upld-view-document.php?file=/documents/ochiko/gigahasaha2.jpg\" target=\"_blank\">https://gs-uploader.jinja-modoki.com/upl...</a> kinds: <a rel=\"nofollow\" href=\"https://gs-uploader.jinja-modoki.com/upld-view-document.php?file=/documents/ochiko/hasaha2.jpg\" target=\"_blank\">https://gs-uploader.jinja-modoki.com/upl...</a> of chaos... <a rel=\"nofollow\" href=\"https://gs-uploader.jinja-modoki.com/upld-view-document.php?file=/documents/ochiko/gigahasaha3.jpg\" target=\"_blank\">https://gs-uploader.jinja-modoki.com/upl...</a><br>\r\n<br>\r\nChoice 2: 'Gigantic Friends' comic. Based off the Japanese media franchise 'Kemono Friend', a girl and her anthromorphized animal friends explore a new tiny world and wreak havoc on its inhabitants... <a rel=\"nofollow\" href=\"https://hitomi.la/reader/1162816.html#1-\" target=\"_blank\">https://hitomi.la/reader/1162816.html#1-...</a><br>\r\n<br>\r\nChoice 3: continue the chain</span></div></div>",
            "created":1549861200,
            "id":2616438,
            "title":"Various endless possibilities!"
        }
    },
    "info":{
        "author_id":"brosus",
        "author_name":"Brosus",
        "brief_description":"Enter the world of one of many of Ochiko Terada's games and artpieces - hope you survive.",
        "created":1546906620,
        "description":"<td align=\"left\" class=\"norm\">A picture can say a thousand words. A game can say tens of thousands. In my opinion, each of Ochiko Terada's works contain a potential epic if you take it down your own imaginary path - why not share that with the world?<br>\r\n<br>\r\nWARNING! This interactive allows everything: sex, crushing, futa, farting, scat... if it's in one of OT's pics or games, you can add it in here. Keep characters the same gender they were in the art/first mentioned chapter, though.<br>\r\nThe only rules are that the posts must be quality and legible. I'll edit to some degree, but if it's a mess it may just get thrown out, sorry.<br>\r\n<br>\r\nWhen you're writing a chapter, please tag in the first part of the title if there will be graphic content: (V) for violence (T) for toilet/scat/fart (F) futa or male.<br>\r\n<br>\r\nTo prevent a ton of choice chapters, here's how it'll start organizationally:<br>\r\n<br>\r\nChoice 1: President Matsudo's Ambition, Ochiko's game where a schoolboy is shrunk and toyed with by a crazy scientist girl of questionable hygiene and her trap friend, where you'll choose who you play as.(I encourage you download the game if you haven't, but you can find playthroughs easily.)<br>\r\nChoice 2: Adventures of Kaede and her Mischievious Daughter who teleports people and cities into her mother's privates and underwear (Warning, image gallery for context with scat and graphic content: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://g.e-hentai.org/g/672114/59fe019f1f/\" target=\"_blank\">http://g.e-hentai.org/g/672114/59fe019f1f/</a> )<br>\r\nChoice 3: This is (Not?) a Toilet! This covers any of the art from the 'not a toilet' series. I won't link them here, but there's a broad spectrum... and it'll mostly be toilet based, obviously.<br>\r\nChoice 4: a personal preference, this is about a ghost lady that eats special treats (tinies) that survive as they go through their body... allowing for internal interaction, or if you want to be really creative, you could even try eating a sweet the opposite way it's intended... I'd like to see descriptions of the insides and how tinies survive - do they stay and live off filth, try to escape in burps or through the back? Who knows! (Graphic link: <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://e-hentai.org/g/978219/b481f35bbc/\" target=\"_blank\">https://e-hentai.org/g/978219/b481f35bbc/</a> )<br>\r\nChoice 5: any art or art sets or games left out of the mains ones! Personally I intend to bring in the 'old loli' at some point. Make sure to always leave room open for more adds!<br>\r\n<br>\r\nAny more info to be added here. GOOD ADDS GET A REQUEST CHAPTER FROM ME, EITHER ON HERE AS A FOLLOW UP TO THEIR POST, TO ANOTHER OCHIKO ART, OR A POST TO THEIR STORY!<br>\r\nFeel free to message me with requests~ Those who add the most may have their stories linked here...</td>",
        "id":2179268,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1562975700,
        "modified":1562975700,
        "pretty_title":"Shrunk in the Worlds of Ochiko Terada"
    }
}