{
    "chapters":{
        "1":{
            "author_id":"bigtoeworship",
            "author_name":"Johnnie",
            "choices":[
                "Daniella Monet",
                "Debby Ryan",
                "Miranda Cosgrove",
                "Jennette Mccurdy",
                "Emily Osment"
            ],
            "content":"<div class=\"\"><div> <span>You Are At A Awards Program For Teen Celebrities..You Venture To Meet The Girls. You Look To See The Hottest Ones..You Notice A Sign That Says Autograph room You Walk Into It...Its Dark And Can barely See As You Walk To Go Back Out You here A Giggle And Struck By A Ray That Makes You Laugh Then Become Uncouncious ...You Wake Up Lightheaded ..Where Am I  You Ask Only To Hear A Giigle The Same One And Hear What Appears To be Thunder But I s ACtually A Pair Of Barefet Approaching You Stay In SHock To Find The Feet Stop In Front Of You While The Toes Wiggle You Look Up To See A Giantess...</span></div></div>",
            "created":1339090140,
            "id":1354650,
            "title":"Property Of A Goddess"
        },
        "12":{
            "author_id":"bigtoeworship",
            "author_name":"Johnnie",
            "choices":[
                "Ewww Disgusting Ant",
                "Notices A Boy"
            ],
            "content":"<div class=\"\"><div> <span>You Look Up To See A Giant Debby Ryan! You Shout To Get Her Attention But She Is Looking In Her Mirror!!..You Notice She Has Beautiful Toes And You Have A Fetish You Approach Her Big Toe And Rub And Lick..You Lose It And Rub Ur D#%$ All Over Her Massive Toe! Suddenly Her Feet Shift To Look Like There In A Stance You Look Up To See Debby Looking Down Glaring..She Says..</span></div></div>",
            "created":1342463400,
            "id":1380067,
            "title":"Debby Ryan"
        },
        "121":{
            "author_id":"bigtoeworship",
            "author_name":"Johnnie",
            "choices":[
                "BIG TOE!!!!",
                "Sole!"
            ],
            "content":"<div class=\"\"><div> <span>Eww How Did A Ant Get In My Dressing Room..She Stares Down And Your In Fear Not Knowing Whats Gonna Happen.<br>\r\nWell Cant Let It Run Around..With That Debby Raises Her Right Barefoot High Even Wiggling Her Toes!..Ok Little Ant You Gonna Love Being Crushed Under My Massive Barefoot Youll Feel Your Body Break Under The Wieght And Youll Love Feeling The Softness!  Ive Crushed Thousands Of Ants Like You And Youll Be No Different  HAhah Bye Bye Little Ant..Debby Lowers Her Giant Barefoot And It Gets Closer But..Slowly Really Slowly...Debby Stops And Pulls Her Foot Away! Wait Not Many Ants Get Crushed By Feet This Amazing..Lets See Ill let You Choose...Ummm Oh My Giant Sexy Big Toe!!...Or The Sweet Sole Of My Barefoot Choose Wisely!! <a rel=\"nofollow\" href=\"http://pics.wikifeet.com/Debby-Ryan-Feet-411417.jpg\" target=\"_blank\">http://pics.wikifeet.com/Debby-Ryan-Feet...</a></span></div></div>",
            "created":1342465260,
            "id":1380081,
            "title":"Ewww Disgusting Ant"
        },
        "1211":{
            "author_id":"bigtoeworship",
            "author_name":"Johnnie",
            "content":"<div class=\"\"><div> <span>You Think To Yourself..\"Shes Gonna Sqiush Me Anyway..I Guess I Should Make It Enjoyable\"...You Run To Her Big Toe. Ok You Want My Big Toe Huh Debby Says..She Lifts Her Giant Foot Again..She Wispers In A Soft Sweet Voice Your Gonna Love This..Then Before She Begins To Bring The Pain..She Says Something..Btw I Know Your A Person..I Was The One Who Shrunk You ..You Get Mad And Scream Aww That Wont Help!..She Demands You get Naked And You Follow..Well Hear I Come..SHe Brings The Toe Down And...CRRRUUSHHH!!<br>\r\nShe Then Twist To Break Any Bones Or Organs...Then Lifts Her Foot..Now My Turn She Then SLams Her Whole Giant Baresole Down...You Were Nothing But A Stain To Her Giant Sexy Barefeet..</span></div></div>",
            "created":1342465740,
            "id":1380087,
            "title":"BIG TOE!!!!"
        }
    },
    "info":{
        "author_id":"bigtoeworship",
        "author_name":"Johnnie",
        "brief_description":"Must Survive Being Shrunk By A Hot Teen Celeb",
        "created":1339089540,
        "description":"<td align=\"left\" class=\"norm\">You Are Shrunk By A Teen Celebrity And Must Survive At All Cost..<br>\r\n*No Male Giants<br>\r\n*Character Can Die :)<br>\r\n*No Shrunken Girl<br>\r\nFeet;YES  Vaginal:Yes Anything;LOL</td>",
        "id":1872303,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1342465740,
        "modified":1342465740,
        "pretty_title":"Shrunken By Teen Celebrities"
    }
}