{
    "chapters":{
        "1":{
            "author_id":"crazedfoxmr.n",
            "author_name":"Thornton",
            "choices":[
                "Transformation",
                "Giant/Feet",
                "Anthro",
                "Various Plots",
                "Anything else you can think of?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, what's your first Oder of business?</span></div></span></div>",
            "created":1405054800,
            "id":1826172,
            "title":"Jumping point."
        },
        "11":{
            "author_id":"keyblade",
            "author_name":"Dr. Shrink",
            "choices":[
                "Shrink",
                "Growth",
                "Into object",
                "Into person",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of transformation takes place?</span></div></span></div>",
            "created":1413003600,
            "id":1870175,
            "title":"Transformation"
        },
        "112":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Spunky the bull terrier's growth transformation story.",
                "Odie's growth transformation story.",
                "You choose."
            ],
            "content":"<div class=\"\"><div> <span>Okay how about a growth transformation story or two?<br>\r\n<br>\r\nSpunky the bull terrier from Rocko's modern life has a growth transformation and chooses to use new found size for either good or evil.<br>\r\n<br>\r\nOdie from the Garfield comics has a growth transformation and of course both hilarity and wackiness ensues.</span></div></div>",
            "created":1413694800,
            "id":1874393,
            "title":"Growth"
        },
        "115":{
            "choices":[
                "Weight Gain",
                "Muscle Gain",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's take a look at our other options. What kind of transformation do you choose?</span></div></span></div>",
            "created":1458321060,
            "id":2119396,
            "title":"More transformation ideas"
        },
        "1151":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Weight Gain Tussle.",
                "Bunny Hugged.",
                "Your Choice."
            ],
            "content":"<div class=\"\"><div> <span>Okay here's some weight gain transformation stories for you to choose from or you can choose option #3 and come up with your own weight gain transformation story.<br>\r\n<br>\r\nWeight Gain Tussle: In this story the Easter bunny from the Yogi the Easter bear special one day purchases a special weight gain tonic which of course transforms him into a sumo wrestling superhero.<br>\r\n<br>\r\nBunny Hugged: In this story once again featuring the Easter Bunny from the Yogi the Easter Bear special, this time the Easter bunny decides to sign up for the cartoon wrestling league by bulking himself up to that of Andre the giant's size.<br>\r\n<br>\r\n </span></div></div>",
            "created":1458608220,
            "id":2120915,
            "title":"Weight Gain"
        },
        "11513":{
            "choices":[
                "Totally agree with you. Say hello to Mountain-Man.",
                "another storyline"
            ],
            "content":"<div class=\"\"><div> <span>How about this? One day a man named Reuben Simmons was working on making a serum to make super soldiers for the U.S. military, so he uses himself as a test subject. At first nothing happens, but over time the serum bestows him with an advanced healing that causes him to gain weight like no tomorrow among other superhuman abilities. So does the superhero weight gain idea appeal to you superhero fans?</span></div></div>",
            "created":1458612720,
            "id":2120948,
            "title":"Your Choice."
        },
        "12":{
            "author_id":"whitebearboy",
            "author_name":"tallwriter",
            "choices":[
                "Adult Male",
                "Adult Female",
                "Male Child",
                "Female Child",
                "Someone else's plot"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of giant?</span></div></span></div>",
            "created":1410238800,
            "id":1854752,
            "title":"Giant/Feet"
        },
        "123":{
            "author_id":"whitebearboy",
            "author_name":"tallwriter",
            "choices":[
                "6 monthes to 1 year old",
                "1-5 years old",
                "6-11 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old is this young titan?</span></div></span></div>",
            "created":1410238800,
            "id":1854769,
            "title":"Giant Male Child"
        },
        "1232":{
            "author_id":"whitebearboy",
            "author_name":"tallwriter",
            "choices":[
                "Chris the 3-year-old titan",
                "More choices",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Here is my sample character; you can use him or make up your own 1-5-year-old giant.<br>\r\n<br>\r\nChris: A lovable 3-year-old boy who one day finds himself growing to mind-blowing heights and developing incredible powers! As he grows, he may also develope other fantastical features, such as becoming a furry or developing muscles that look out of place on a child. Chris is only partially potty trained, so he wears a blue pull-up. He also wears a blue shirt with super hero logos on it. His clothes grow with him, but his shirt may get streched or torn if her grows big muscles. Chris is mostly gentle, but he may get up to mischief with his new size.</span></div></div>",
            "created":1410238800,
            "id":1854788,
            "title":"1-5 years old"
        },
        "12321":{
            "author_id":"whitebearboy",
            "author_name":"tallwriter",
            "choices":[
                "900 feet tall",
                "Bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One day, Chris was playing in his yard, when a glowing purple meteorite the size of a basketball landed in the yard. When Chris went up and touched it, the glow was absorbed into his body, and he began shooting up to</span></div></span></div>",
            "created":1410238800,
            "id":1854813,
            "title":"Chris the 3-year-old titan"
        },
        "123212":{
            "author_id":"whitebearboy",
            "author_name":"tallwriter",
            "choices":[
                "1500 feet tall",
                "1 mile tall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are more size choices:</span></div></span></div>",
            "created":1410238800,
            "id":1854814,
            "title":"Bigger"
        },
        "124":{
            "author_id":"whitebearboy",
            "author_name":"tallwriter",
            "choices":[
                "6 monthes to one year old",
                "1-5 years old",
                "6-11 years old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old is this massive young girl?<br>\r\n<br>\r\n(Note: If you add, the giant girl must be in the appropriate age catagory!)</span></div></span></div>",
            "created":1410238800,
            "id":1854761,
            "title":"Giant Female Child"
        },
        "1242":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Jenny gets jumbo sized",
                "Amy's Adventures in Ascending sizes ",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>1-5 year old character options <br>\r\n<br>\r\nJenny - Toddler age barely able to walk so mostly crawls -<br>\r\nBlond hair, Blue eyes, can speak English but not very well and limited vocabulary <br>\r\n<br>\r\n<br>\r\n<br>\r\nAmy - Age 5 - <br>\r\nRed hair , Green Eyes, <br>\r\nShort for her age. Wants to be taller. Upon seeing some giant/giantess stuff in cartoons she fancies the idea of becoming not only taller but a giant. Her big brother and big sister remind her that things like that will never or can't happen. Her big bro takes it a step further by saying things like \"once a shrimp always a shrimp shortstuff \"<br>\r\n</span></div></div>",
            "created":1460956440,
            "id":2135043,
            "title":"1-5 years old"
        },
        "13":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Continue this story line.",
                "Different story line.",
                "Different story line.",
                "Different story line.",
                "Different story line."
            ],
            "content":"<div class=\"\"><div> <span>My name is Spaz Jackrabbit, Jazz Jackrabbit's younger brother and this is my story line about me gaining weight the healthy way.<br>\r\n<br>\r\nOne day I decided to try eating what most sumo wrestlers themselves usually eat, in this case Chankonabe, while skipping breakfast to slow down my metabolism as well.<br>\r\n<br>\r\nAfter eating at least 5-10 bowls of this stuff, it was time to weigh myself and see if that sumo diet really worked.<br>\r\n<br>\r\nHaving already made to my bathroom, I stepped onto the floor scale until it broke due to my massive weight. <br>\r\n<br>\r\nI decided to have a look at myself in my bathroom mirror and upon seeing my image I couldn't believe how big and fat I was.<br>\r\n<br>\r\n\"Holy smokes, I'd say I look like a sumo wrestler in a healthy way.\" I said to myself.<br>\r\n<br>\r\nWhat happens next?<br>\r\n</span></div></div>",
            "created":1405141200,
            "id":1826392,
            "title":"Anthro"
        },
        "132":{
            "choices":[
                "continue",
                "new story line",
                "new story line"
            ],
            "content":"<div class=\"\"><div> <span>The world that Blazzarro lives in is a mix between a Japanese and Western culture in a highly science fiction setting. Besides training characters in this world have to battle against beings from different dimensions and manage everyday life. Blazzatto's goal is to someday become the king of the ring, but many challenges will try to thwart it. As the story goes on Blazzarro will start getting larger like a sumo wrestler.</span></div></div>",
            "created":1430024400,
            "id":1969919,
            "title":"Legendary Sumo Dragon Blazarro"
        },
        "1321":{
            "choices":[
                "Blazaro finds the sumo stable only to discover his uncle owns the place",
                "Blazaro bumps into a dragon essential while looking for the sumo academy",
                "A strange portal opens in the middle of the park and creatures appear"
            ],
            "content":"<div class=\"\"><div> <span>It was another day in the country of Jurecan. The birds were chirping and people were relaxing in the national park eating rice cakes, reading a comic, or watching the newest anime-like cartoon. There was one dragon in particular who was enjoying the sights.  He had traveled to Bokuta on foot, carrying all his belongings with him. The name of this dragon is Blazaro. Standing at a height of 8' 5\" Blazaro was tall for a dragon with most of his kind being 6 inches smaller on average. Now Blazaro is a blue and silver dragon with massive muscles that make any woman fawn.<br>\r\n<br>\r\n\"Today is the day I become a sumo wrestler.  Soon the crowds will cheer as they hear my mighty footsteps.\" The young dragon declared as he raised his fist in the air.<br>\r\n<br>\r\nEvers since Blazaro was a hatchling he had been fascinated by the men and women who call themselves sumo wrestlers. While his father was a professional wrestler it was his uncle who introduced him to the ancient sport. His uncle told him that only those who are in top shape can hope to endure the rigorous training. Now at age 20 Blazaro was ready to make it to the very top of the sumo world. </span></div></div>",
            "created":1430965740,
            "id":1974596,
            "title":"A Dragon's Journey"
        },
        "13213":{
            "choices":[
                "Eleflora takes Blazaro on a tour of the academy",
                "Blazaro has to register for the entry exam"
            ],
            "content":"<div class=\"\"><div> <span>Blazaro halted for a brief moment. An energy spike formed. It soon evolved into a mysterious portal. Creatures that resembled people emerged and started vaporizing the park. There was no way Blazaro was going to let these invaders destroy Bokuta. Blazaro throws all his belongings high into the sky. He along with a few of the citizens start fighting off the creatures. After defeating the creatures Blazro flies into the air to catch his belongings before they hit the ground. Blazaro successly catches his belongings and descends to the ground. The crowd cheered at his amazing athleticism.<br>\r\n<br>\r\n\"That was impressive. Not only did you help us with our problem, but you caught your belongings with such grace.\" A dragoness said with awe.<br>\r\n<br>\r\n\"Oh, that? That was nothing. I couldn't fight while carrying a heavy Compressor Bag. Pardon me Ms. but do you know where I can find the sumo academy?\"<br>\r\n<br>\r\n\"So you aspiring to be a sumo wrestler eh? My father happens to own the place. Follow me and I'll show you where it is.\"<br>\r\n<br>\r\n\"Thank you Ms...\"<br>\r\n<br>\r\n\"Eleflora Misamist.\" the dragoness replied.<br>\r\n<br>\r\n\"Folks call me Blazaro Silverhue.\"<br>\r\n<br>\r\n\"It's nice to meet you Mr. Silverhue.\"<br>\r\n<br>\r\n\"Same to you Ms. Misamist.\"</span></div></div>",
            "created":1432179720,
            "id":1980746,
            "title":"Creatures from Another World!"
        },
        "132132":{
            "choices":[
                "A creature that he fought earlier is causing trouble",
                "He stumbles across Sensei Shikaron Misamist"
            ],
            "content":"<div class=\"\"><div> <span>Eleflora shows Blazaro where the academy was. Once they arrive Blazaro is taken aback by the campuses large size. He noticed a few higher ranking wrestlers practing, while the lower ranked wrestlers were hauling ingredients. The sign by the entrance read Shikaron's Sumo academy.<br>\r\n<br>\r\n\"Sweet! Now to enroll.\" Blazaro said.<br>\r\n<br>\r\nBefore Blazaro could revel in his thoughts one of the higher ranking wrestlers calls out to him. \"You do realize that you have to pass the entry exam first, right? Sensei Shikaron doesn't let anyone enroll. Only the best can hope to become a sumo wrestler.\"<br>\r\n<br>\r\nBlazaro turns around and notices a panda who looked like he weighed 600 lbs. or more standing behind him.<br>\r\n<br>\r\n\"Greetings Jericho,\" Eleflora said. \"We were just on our way to register for the exam.\"<br>\r\n<br>\r\n\"Is that so? You better hurry along then. There's only three spots left for female wrestlers and two for male wrestlers. See ya later.\"<br>\r\n<br>\r\nJericho returns to his practicing while Blazaro looks on. \"I have to take am exam? Shouldn't beating up dimensional monsters be enough?\"<br>\r\n<br>\r\n\"Unfortunately, that isn't the case. Dimensional rifts rarely open in Bokuta. You'll have to take the exam like everyone else. Let's hurry before the spits for tomorrow's exam is filled.\"<br>\r\n<br>\r\nBlazaro and Eleflora rush to the admission's office. Upon arriving they notice that no one else is there, except a goose who's reading a comic.<br>\r\n<br>\r\n\"You're just in time. Sign your name on the form and turn it in. Your exam will test your prowess in the ring. You'll test your skills against a yokuzuna or a high ranking pupil. Sensei Shikaron will explain the criteria tomorrow.\"<br>\r\n<br>\r\nBlazaro fills out the form and turns it in. \"That should do it. I guess I'll be staying with my uncle tonight. He should have a spare bedroom. Here I thought I would sleep in an academy dorm.\"<br>\r\n<br>\r\n\"My father won't allow you to live on campus until you pass the exam. See you tomorrow Blazaro.\"<br>\r\n<br>\r\nBlazaro waves Eleflora goodbye and walks towards his uncle's house. As he is walking...</span></div></div>",
            "created":1473663240,
            "id":2209278,
            "title":"Blazaro has to register for the entry exam"
        },
        "1322":{
            "choices":[
                "Let's  visit  Oz",
                "new story ",
                "new story"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's  visit  the world of Oz but with a new twist  as the heroine meets three wizard's during her travels, but not is all what it seems.</span></div></span></div>",
            "created":1431741960,
            "id":1978465,
            "title":"The Wonderful  Witch of Oz"
        },
        "13221":{
            "choices":[
                "The Wizard of the East",
                "A flying gorilla guard"
            ],
            "content":"<div class=\"\"><div> <span>Several years have passed in the land of Oz since the first queen passed. Oz a highly technological and magical realm where humans, anthros, and other fantasy sci-fi creatures interact on a regular basis. Our story begins in a small town in Kansas. There a young woman named Oswalda Zimmer l, aka Oz, was conning an unsuspecting woman. The year was August 21st, 2015.<br>\r\n<br>\r\n\"Step right up ma'am and register to Oz's cleaning service.\"<br>\r\n<br>\r\n\"A cleaning service. My husband was looking for one. He travels a lot and what ever I touch stops working or breaks. The other day our new vacuum cleaner exploded all over the place.\"<br>\r\n<br>\r\n\"With my cleaning service all your troubles will disappear. \"<br>\r\n<br>\r\nThe woman was about to purchase the phony cleaning service until a disgruntled man showed up.<br>\r\n<br>\r\n\"Don't trust that conartist. I ordered a new grill from her site and all I got was a broken stove. \" <br>\r\n<br>\r\n\" Sorry, but you get what you paid for.\" Oswalda responded.<br>\r\n<br>\r\n\" I paid good money you conniving witch. My wife is a lawyer and you should be thrown in the slammer for fraud Oz.\"<br>\r\n<br>\r\nOswalda makes a run for it, but before she could get away she was sucked up by a tornado. As she screamed she saw a strange distortion. It seemed like she was being pulled into the clouds. Oswalda then passes out. The tornado spits her out in a lake in Oz. Oswalda woke up and tried swimming to shore, but she was pulled under by the nymphs of the lake.<br>\r\n<br>\r\n\"Someone help! *Gurgle*\"<br>\r\n<br>\r\nAs Oswalda was struggling for her life a bear was heading to the lake to go spear fishing. The bear stopped in his tracks when he saw Oswalda drowning.<br>\r\n<br>\r\n\"Have to save that poor girl. Don't worry I'll save you!\" The bear  shouted as he tightened his bathing suit before jumping into the lake.<br>\r\n<br>\r\nThe bear swims out to Oswalda and rescues her from the nymphs. He then performs CPR on Oswalda. When Oswalda awakens she is shocked to see an anthropomorphic bear standing over her.<br>\r\n<br>\r\n\"What in the world are you? You speak like a person, but you're a bear. \" <br>\r\n<br>\r\n\"Of course I speak. All anthros can speak. Where did you come from? You're not from Oz I reckon.\"<br>\r\n<br>\r\n\" Oz? You mean the story? Wait my name is Oz!\"<br>\r\n<br>\r\n\"You must be talking about the ancient history of Oz. One hundred years have passed since someone from another world came to Oz. Also what did you mean that your name is Oz? Only the wizard mentioned in the texts who saved Oz from the wicked witches was named Oz.\"<br>\r\n<br>\r\n\"What I mean is that my name is Oswalda Zimmer. My initials form my nickname.\"<br>\r\n<br>\r\n\" Intriguing, a new prophecy speaks of a witch from another world who destined to save our world. \" Said a a man dressed in a green cybernetic suit with a white jacket. <br>\r\n<br>\r\n\" Who are you?\"<br>\r\n<br>\r\n\"I am one of the wizard's who watches over Oz. I am Maverick Westley.\"<br>\r\n<br>\r\n\" You're the Wizard of the West!\" Oswalda exclaimed.<br>\r\n<br>\r\n\"That is true. My cousins look after the South and East of Oz. Only the ruler of Oz loops after the Northern region of Oz. Unfortunately my aunt died without an heir.\"<br>\r\n<br>\r\n\" What his lordship says is true. I am Theodore Bearsevelt by the way.\"<br>\r\n<br>\r\n\"It's nice to meet you but I have to find a way home.\"<br>\r\n<br>\r\n\" Sorry,  but it's impossible right now. Maybe my cousin Elvis Easley can help.\"<br>\r\n<br>\r\n\" Really? \" <br>\r\n<br>\r\n\" Yeah he's in the Emerald City. I can take you on my B.R.O.O.M.\"<br>\r\n<br>\r\n\" Broom? Don't witches ride those?\"<br>\r\n<br>\r\n\" Not a broom. It's a B.R.O.O.M. It's the latest  hover cycle created by Oz Tech. Sorry Theo, but I don't have room for three.\"<br>\r\n<br>\r\n\" It's ok my lord. I drove my Zipcar here anyway. I have to prepare for winter. Once winter comes I'll be ready to hibernate. I tried staying awake last winter,  but utilities are too expensive. \"<br>\r\n<br>\r\n\" I wish you luck my friend. \" <br>\r\n<br>\r\nWith that Oswalda and Maverick take off for Emerald City. As soon as they arrive they are greeted by...</span></div></div>",
            "created":1440556320,
            "id":2025632,
            "title":"The New World of Oz"
        },
        "14":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Samurai pizza cats and king size canary crossover.",
                "Make your own story.",
                "Make your own story.",
                "Make your own story.",
                "Make your own story."
            ],
            "content":"<div class=\"\"><div> <span>Okay how about a crossover between the samurai pizza cats and king size canary as the male samurai pizza cats and male New York pizza cats enter the world of MGM'S classic cartoon king size canary  as the pizza cats and stars of this classic cartoon experience firsthand turning into giant animals while hilarity ensues.</span></div></div>",
            "created":1412744400,
            "id":1868730,
            "title":"Various Plots"
        },
        "15":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Babies.",
                "Mundane lives.",
                "Sci-Fi/ fantasy.",
                "Cameos and crossovers.",
                "Even more please."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1413694800,
            "id":1874360,
            "title":"More."
        },
        "151":{
            "author_id":"whitebearboy",
            "author_name":"tallwriter",
            "choices":[
                "Becoming giants",
                "Developing super-powers",
                "Your choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What should the babies be doing?</span></div></span></div>",
            "created":1413781200,
            "id":1874876,
            "title":"Babies."
        },
        "1511":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "A male human",
                "A female human",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of growing child is it exactly?</span></div></span></div>",
            "created":1414040400,
            "id":1876515,
            "title":"Becoming giants"
        },
        "154":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Muppet Babies cameo and crossover featuring salty dog and Elizabeth.",
                "Tiny toon adventures/Doug cameo and crossover featuring pork chop and stinky.",
                "You choose the cameo and crossover fellow reader."
            ],
            "content":"<div class=\"\"><div> <span>Okay here's two count em two crossovers.<br>\r\n<br>\r\nThe first cameo appearance and crossover is Muppet babies and one of my characters Salty dog and his girlfriend Elizabeth the pink poodle that makes a cameo and crosses over into the episode good clean fun as the piggy dough girl and doggy dough girl go one on one with Baby Gonzo A.K.A. captain cookbook and Baby salty dog A.K.A. Mega Mutt.<br>\r\n<br>\r\nThe second cameo appearance and crossover this time is Tiny Toon adventures and Nickelodeon's Doug featuring both pork chop the bull terrier dog and stinky the cat in the episode you asked for it as both characters appear in all three segments mainly the last one being re titled duck dog and cat out of luck featuring King Kong as all four characters besides Plucky duck will be giant sized and duke it out all across the city of Acme Acres destroy all monsters style.</span></div></div>",
            "created":1413694800,
            "id":1874385,
            "title":"Cameos and crossovers."
        },
        "1543":{
            "author_id":"hurttoto",
            "author_name":"^HURTTOTO^",
            "choices":[
                "Continue",
                "Nope nope",
                "Your choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ITS FREEE!!!!!!!<br>\r\nThat's the last words any of them hear before <br>\r\n<br>\r\nGiant robloxian with troll face appears</span></div></span></div>",
            "created":1491282900,
            "id":2299400,
            "title":"You choose the cameo and crossover fellow reader."
        },
        "15431":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Continue.",
                "Your Choice."
            ],
            "content":"<div class=\"\"><div> <span>As the characters from the first crossover story had no choice but to team up with the characters from the second crossover story as they gathered together in Acme Acres to figure out how to beat the giant robloxian at his own game.<br>\r\n<br>\r\n\"Okay since we're all here in Acme Acres here's how we're going to beat that mysterious looking being. Myself, Stinky the cat, Captain Cookbook, Mega Mutt, Duck Kong, and King Kong are going to take on that mysterious looking being, meanwhile you two dough girls if needed can help us guys out.\" Porkchop explained.<br>\r\n<br>\r\nAfter Porkchop was done explaining his plan he and the rest of the guys stood at the ready as they each stared down their enemy while the girls themselves looked on from the sidelines.<br>\r\n<br>\r\n\"All right you guys are you ready?\" Porkchop asked.<br>\r\n<br>\r\n\"I'm ready to rumble\" Stinky the cat answered.<br>\r\n<br>\r\n\"I'm ready for battle.\" Captain Cookbook answered.<br>\r\n<br>\r\n\"I'm gonna enjoy beating this guy down.\" Mega Mutt answered.<br>\r\n<br>\r\n\"Do lead the way oh fearless leader.\" Duck Kong answered.<br>\r\n<br>\r\n\"Ooh yeah this ape's prepared for battle.\" King Kong answered.<br>\r\n<br>\r\n\"All right let's get em boys.\" Porkchop said as he started stomping towards the enemy.<br>\r\n<br>\r\nImmediately the boys followed their leader into battle as they started stomping towards their intended target and began using professional wrestling moves straight out of professional wrestling itself.<br>\r\n<br>\r\n</span></div></div>",
            "created":1491355680,
            "id":2299741,
            "title":"Continue"
        },
        "155":{
            "author_id":"yejdbdinsknsk8",
            "author_name":"Yejdbdinsknsk8",
            "choices":[
                "Swapping Butts with a woman",
                "Generic Body Swap Story",
                "Next..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about these choices?</span></div></span></div>",
            "created":1581797460,
            "id":2787731,
            "title":"Even more please."
        },
        "1551":{
            "author_id":"yejdbdinsknsk8",
            "author_name":"Yejdbdinsknsk8",
            "choices":[
                "You’re Sis,Lulu,18,She loves to fart in your face,Lesbian,average butt",
                "You’re Mom(Frannie),41,Yoga instructors,Amazing Yoga Butt a man would kill for ",
                "The Remote activated and swapped your butt with someone out the window "
            ],
            "content":"<div class=\"\"><div> <span>You’re name is Ray Rumpson:age 22 you’ve always had a fetish for woman’s butts and you always wanted one of your own,today you stumbled across a Remote in ur attic that can swap body parts,you wish was about to come true,you swapped Butts with?</span></div></div>",
            "created":1581799860,
            "id":2787752,
            "title":"Swapping Butts with a woman(please add)"
        },
        "15513":{
            "author_id":"yejdbdinsknsk8",
            "author_name":"Yejdbdinsknsk8",
            "choices":[
                "A Stray Cat",
                "A Female Officers Head(Butt/Head swap)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who or what was it?</span></div></span></div>",
            "created":1581800040,
            "id":2787755,
            "title":"The Remote activated and swapped your butt with..."
        },
        "1553":{
            "author_id":"marioman200",
            "author_name":"mariofan",
            "choices":[
                "An army of the lower halves of women coming into your house?",
                "A group of headless milfs entering your room to make love to you?",
                "Yet even more choices!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe one of these?</span></div></span></div>",
            "created":1582076460,
            "id":2789371,
            "title":"Next..."
        }
    },
    "info":{
        "author_id":"crazedfoxmr.n",
        "author_name":"Thornton",
        "brief_description":"This time, you'll have barely any limits on what you can write in here.",
        "created":1405125960,
        "description":"<td align=\"left\" class=\"norm\">Hello and welcome to the interactive. Since that my other interactive has many rules ye is focused on having good, solid stories, this one is the opposite. Here there is only one rule or two:<br>\r\nAlways, before you make a story line, add an option for someone else to make one. This story is for every one, so we need to have room for every one.<br>\r\nNo sex, but you can have sexual references. Just, please, don't, say the actual words.<br>\r\nCursing is allowed, and, if you must, string it out, but only if the character is that ticked.<br>\r\nTo err may be human, but still, watch your grammar.<br>\r\nHave fun.<br>\r\n If you have any questions, contact me.<br>\r\nIf you choose to break any of the rules, the chapter will be deleted or edited depending on the case.<br>\r\n<br>\r\nAnyway, anything goes here besides that. Transformations of any kind, killing (as long as its in your story line, be nice people, don't kill others characters.), giants, anthropomorphic beings, foot tickling, you can think, you can write it.<br>\r\n<br>\r\nSo, I'll leave you to it. Don't let it blow up in your face, and, good luck!</td>",
        "id":2000080,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1582076460,
        "modified":1582076460,
        "pretty_title":"Go nuts!"
    }
}