{
    "chapters":{
        "1":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Character Profiles"
            ],
            "content":"<div class=\"\"><div> <span>My name is Brian Hawkins; I’m 13 years old and I live with my parents and my 7-year-old sister Mackenzie.  I have a small group of friends; my next-door neighbor Eric plus our mutual friends Carrie Sullivan and her twin brother Collin.  The four of us have known each other since Kindergarten and were damn near inseparable.<br>\r\n<br>\r\nWhy am I telling you this?  Because something happened to me just before I was to start 8th grade; something I can’t quite explain. I was out in the woods behind my house, playing hide and seek with Mackenzie when I suddenly blacked out.  When I regained consciousness, I thought that only a short time had passed.  I returned home, after not finding Mackenzie, to discover that 6 years had in fact passed and everyone had thought I was dead.<br>\r\n<br>\r\nWhat comes next is the story of how I attempt to rebuild my life.</span></div></div>",
            "created":1578546000,
            "id":2771663,
            "title":"How it Begins"
        },
        "11":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Waking Up",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span><b>March 16th, 2013</b><br>\r\nIt was a nice sunny Saturday afternoon; I was home with my sister while our parents were at work.  I was sitting in my room playing Dead Space 3 when Mackenzie came running in.  I swear if it wasn’t for her ponytail, Mackenzie could have easily passed for a boy.  At 7 years old, she wore almost exclusively boy's clothing; I only saw her wear dresses on special occasions.  She and her best friend Emily, who was my friend Eric’s little sister, were the definition of tomboys.<br>\r\n<br>\r\nWalking in front of the TV, looking at me, Mackenzie said, “Come on Brian, let’s go outside and play hide and seek.”<br>\r\n<br>\r\nNormally I would have jumped at the chance to go outside; but for some reason, I couldn’t shake the feeling that I shouldn’t go outside today.  Pausing the game, I looked at Mackenzie and said, “I don’t know, Mac; I’m not really feeling it.”<br>\r\n<br>\r\n“Come on!” grabbing my arm, Mackenzie said, “It’s finally stopped raining, and mom says I can’t go in the woods without you.”<br>\r\n<br>\r\nI knew enough to realize that Mackenzie wasn’t going to let this go.  With a sigh, I turned off the console and said, “Okay fine; we’ll go play some hide and seek in the woods.”<br>\r\n<br>\r\n“Yay!”<br>\r\n<br>\r\nI went to follow Mackenzie as she ran down the stairs, only to stop in my tracks when I heard my cell phone ringing.  Going over to my desk, I saw that it was Eric calling me.  He’d spent the summer with his aunt and uncle; his parents and Emily had flown out to get him yesterday.  Answering the phone, I said, “Hey man, what’s up?”<br>\r\n<br>\r\n“Not much; we’re just waiting for our connecting flight, should be home in a few hours.” Taking a breath, Eric said, “Are you going to be free tonight?  There’s something kind of important I need to tell you.”<br>\r\n<br>\r\n“Sure, I don’t have any plans.” Pausing, I said, “What’s so important that you can’t tell me over the phone?”<br>\r\n<br>\r\n“I’d rather tell you in person.”<br>\r\n<br>\r\n“Okay.” Pausing, I said, “I’m heading outside to play hide and seek with Mackenzie, but I’ll be free tonight.”<br>\r\n<br>\r\n“Thanks, you’re the best.”<br>\r\n<br>\r\n<div align=\"center\">*************************</div><br>\r\n<br>\r\nAbout an hour had passed since Mackenzie and I started playing hide and seek.  We were taking turns being the seeker; it was currently Mackenzie’s turn to search for me.  She had just started counting and I was running to find a hiding spot.<br>\r\n<br>\r\nAfter a few moments of searching, I found a small rock outcropping I could hide behind.  I sat behind the outcropping for a few moments, listening as Mackenzie tried her best to find me.<br>\r\n<br>\r\nI was watching some birds fly around overhead when I was suddenly overcome by an unbearably loud noise.  I tried covering my ears in an attempt to drown it out, but it didn’t work.  I started feeling a little light-headed; the next thing I knew, I blacked out.</span></div></div>",
            "created":1578546000,
            "id":2771664,
            "title":"Continue"
        },
        "111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Reaction",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>I must’ve been unconscious for a few hours; because when I finally woke up, I noticed the sun was just about to set.  I knew there were coyotes in the woods, so I decided it was probably best to head home.<br>\r\n<br>\r\nI’d spent a lot of time in the woods over the years, so I was able to make my way back to the house as the daylight faded.  It wasn’t long before I got back to the house; walking up to the back door, I found that it was locked.<br>\r\n<br>\r\nAs I made my way around to the front of the house, I noticed Mom walking down the stairs carrying a hamper full of laundry.  Coming around the front of the house, I was surprised to find the front door closed and the porch light off.  Having left my house key on my desk, I knocked on the door to get my mom’s attention.<br>\r\n<br>\r\nA minute went by before I saw my mom walking out of the laundry room.  She looked out the side window and the expression on her face was as if she’d seen a ghost.  Opening the door, she stepped out on the porch and knelt down in front of me.  “B-Brian?  Is that you?”<br>\r\n<br>\r\nI had to admit I wasn’t expecting this; in fact, I had been fairly certain mom was going to yell at me.  Looking at her, confused, I said, “Of course it’s me, mom.”<br>\r\n<br>\r\nMom pulled me in for a hug; squeezing me hard enough that I had trouble breathing.  Looking at me, she said, “This can’t be real, I-I must be dreaming.”<br>\r\n<br>\r\nBreaking away from Mom, I looked at her and said, “What’s going on, Mom?”<br>\r\n<br>\r\nPlacing a hand on my face, Mom said, “How is it possible that you haven’t aged?”<br>\r\n<br>\r\nBefore I could ask what was going on, I was interrupted by Mackenzie’s voice coming from upstairs.  “Mom, when’s dinner going to be ready?”<br>\r\n<br>\r\nIf Mom’s behavior wasn’t confusing enough, I was certainly confused when I saw an older Mackenzie come around the corner.  I could tell it was her from her face; but other than that, there was nothing of the 7-year-old I saw a few hours earlier.  Her dark blonde hair was now brown and down past her shoulders, she was at least a foot taller than before, plus she had breasts and a figure to boot.  My 7-year-old sister, as impossible as it seemed, was now a teenage girl.  Looking at her, I said, “Mackenzie?”<br>\r\n<br>\r\nMackenzie took one look at me before turning her attention back to her phone.  That was until, a fraction of a second later, she realized who she was looking at.  Dropping her phone on the floor, she looked at me and said, “Brian?”<br>\r\n<br>\r\nBefore I knew what was happening, Mackenzie ran down the stairs and hugged me.  I did my best to break away from the hug; disturbed by the thought of Mackenzie’s breasts.  Taking a step back, I looked at Mom and Mackenzie.  “Can someone please explain to me what’s going on here?” gesturing to Mackenzie, I said, “I’m gone for a few hours and suddenly Mackenzie’s a teenager?”<br>\r\n<br>\r\n“A few hours?” looking at me, Mom said, “Brian, you’ve been missing for over 6 years.”</span></div></div>",
            "created":1578546000,
            "id":2771666,
            "title":"Waking Up"
        },
        "1111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Back Home",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>I had to sit down after that bombshell.  Walking into the family room, Mackenzie and Mom coming in after me, I sat down on the couch.  “What do you mean I’ve been missing for 6 years?” turning to Mackenzie, sitting next to me on the couch, I said, “The last thing I remember was playing hide and seek with you.”<br>\r\n<br>\r\n“That’s the last time anyone saw you.” Pausing, Mackenzie said, “After I couldn’t find you, I ran back to the house to call Mom and Dad.  They called the police and we started looking everywhere for you.”<br>\r\n<br>\r\n“We spent weeks looking for you, but never found any trace of where you might’ve ended up.” Looking at me, Mom said, “Everyone started to speculate that perhaps a wild animal had gotten you.”<br>\r\n<br>\r\nAs I tried to process everything that I’d been told, I turned to Mackenzie and said, “Wait, if it’s been 6 years; then you...”<br>\r\n<br>\r\n“I turned 13 last month.” Sighing, Mackenzie looked at me and said, “It seems we’re the same age now.”<br>\r\n<br>\r\nI tried to process the fact that my formerly 7-year-old sister and I were basically the same age now.  It was only then that I realized that neither mom nor Mackenzie had mentioned dad.  Looking around, I saw no sign of him anywhere.  “Where’s Dad?”<br>\r\n<br>\r\nMom and Mackenzie shared a pained look with each other.  Turning to me, Mom said, “I’m sorry Brian, but your father passed away 3 years ago.”<br>\r\n<br>\r\n“What?”<br>\r\n<br>\r\n“He was diagnosed with cancer a few months after you disappeared.” Looking at me, Mackenzie said, “The doctors gave him 6 months, but he held on for almost 3 years.  I guess he held out hope that you’d come back.” <br>\r\n<br>\r\nI couldn't believe what I was hearing.  Only a few hours had gone by for me; but for everyone else, it had been over 6 years.  Not only was my kid sister now the same age as me, but my dad was dead as well.  Getting up, I said, “I-I need to get some air.”<br>\r\n<br>\r\nI’m not sure it was a good idea for me to leave, but Mom and Mackenzie didn’t stop me.  I walked out the front door and started walking towards the park at the end of the street.  I was walking in front of Eric’s house when I suddenly heard a car horn followed by screeching brakes. “Watch where you’re going, kid; I almost hit you.”<br>\r\n<br>\r\nTurning in the direction of the voice, I saw a young woman in her late teens staring at me from the driver’s seat.  Looking at her, I said, “I’m sorry.”<br>\r\n<br>\r\nI had expected the woman to simply acknowledge me and continue pulling into Eric’s driveway, but she didn’t do so.  Instead, she backed out into the street and parked along the curb.  I watched as she stepped out of the car; revealing herself to be a rather attractive woman – wearing a moderately revealing dress and boots.  As she walked towards me, I realized there was something familiar about her but I couldn’t quite place it.<br>\r\n<br>\r\nStopping right in front of me, she looked me over and said, “Brian?”<br>\r\n<br>\r\nClearly this woman knew me from 6 years earlier, but I couldn’t quite place her.  She was pulling into Eric’s driveway, so he probably knew her.  It was only then that I realized there weren’t any lights on inside the house.  Looking at her, I said, “Yeah.”<br>\r\n<br>\r\nFor the 3rd time in less than 30 minutes, I suddenly found myself being hugged.  After a moment the woman looked at me and said, “How is this possible?”<br>\r\n<br>\r\nIgnoring her question, I looked at her and said, “Do I know you?”<br>\r\n<br>\r\n“Oh right, I guess some explanation is in order.” Looking at me, moving a stray hair from her eyes, the woman said, “You used to know me as Eric.”<br>\r\n<br>\r\n“What?” stunned, I looked at her and said, “But you’re a girl.”<br>\r\n<br>\r\n“Do you remember, right before you disappeared, how I said there was something I needed to tell you?” gesturing to her body, the woman said, “Well <i>this</i> is what I needed to tell you.”<br>\r\n<br>\r\nEverything became too much for me to handle at that point; I promptly fainted and fell to the ground.</span></div></div>",
            "created":1578546000,
            "id":2771669,
            "title":"Brian's Reaction"
        },
        "11111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>When I regained consciousness again, I half expected to discover another 6 years had passed.  Thankfully that wasn’t the case; as I found myself back in the family room with Mackenzie, Mom and ‘Eric’ standing over me.  No one was looking at me, so they didn’t realize I was awake yet.<br>\r\n<br>\r\n“How is it possible that he hasn’t aged a day in 6 years?”<br>\r\n<br>\r\n“I have no idea, Erica.” Sighing, Mom said, “I’m still trying to wrap my head around the fact that he’s alive.”<br>\r\n<br>\r\nIn an attempt to get their attention, I said, “Why does my head hurt so much?”<br>\r\n<br>\r\nAll three of them turned to look at me; with Mom saying, “You fainted in front of Erica’s house; she brought you back here.”  <br>\r\nTurning to Mackenzie, Mom said, “Go get your brother an ice pack; while I get him something for the headache.”<br>\r\n<br>\r\nOnce Mom and Mackenzie left the room, I managed to sit up and look at Eric...rather Erica.  Now that I knew who she was, I could still see some of Eric in her.  Other than that, she was entirely female now – her breasts were slightly larger than Mom and Mackenzie’s, she appeared to have a pretty decent figure as well.<br>\r\n<br>\r\nSitting down next to me, she said, “I guess you probably have some questions.”<br>\r\n<br>\r\n“You could say that.” Looking at her, I said, “When did this happen?”<br>\r\n<br>\r\n“You remember how I spent the summer before 8th grade out in California with my Mom’s sister?”<br>\r\n<br>\r\n“Yeah.”<br>\r\n<br>\r\n“I was there to have my hormone treatments.” Looking at me, Erica said, “I had planned to come out to you when I came home, but that was until I found out you were missing.”<br>\r\n<br>\r\nI had no idea that Erica was trans; she certainly did a good job of passing herself off as a boy.  Looking at her, I said, “How did the kids at school take it?”<br>\r\n<br>\r\n“A few of them bullied me, but most were understanding.” Chuckling, Erica said, “I can’t tell you how many boys started flirting with me after my boobs came in.”<br>\r\n<br>\r\nErica then proceeded to explain how, in high school, she joined the cheer squad and discovered a passion for fashion design.  Her parents had scheduled her final surgery for the week after she graduated High School; after which she started attending the local college in the fashion program.   Looking at her, I said, “How did Carrie and Collin take it when you came out?”<br>\r\n<br>\r\n\"They both took it pretty well; Carrie liked having another girl in the group, while Collin protected me from the bullies.\"<br>\r\n<br>\r\n“How do you think they’ll react when they find out I’m alive?”<br>\r\n<br>\r\nMom and Mackenzie walked back into the room at that point; as they handed me an ice pack and pills, Erica said, “I called them while you were still unconscious; they should be here in about 10 minutes.”<br>\r\n<br>\r\n<div align=\"center\">******************************</div><br>\r\n<br>\r\nEveryone thought it best that I hide in the bathroom when Carrie and Collin got here; I guess they figured it would be easier that way.  The downstairs bathroom was down the hall from the door, so I could hear when they came in.  The first voice I heard was <br>\r\nCollin’s, although it was deeper than I remembered.  “What’s going on, Erica?  Why’d you tell us to come here?”<br>\r\n<br>\r\n“There’s been a development in Brian’s disappearance.”<br>\r\n<br>\r\n“What?” shocked, Carrie said, “Did they finally find his body or something?”<br>\r\n<br>\r\n“Not exactly.” Pausing, Erica said, “But it’s something big.”<br>\r\n<br>\r\nI realized that it was my cue to come out of the bathroom.  I opened the door and walked into the family room; seeing a taller Collin standing next to a very pregnant Carrie.  Neither of them saw me standing in the doorway, so I said, “Hey guys.”</span></div></div>",
            "created":1578546000,
            "id":2771670,
            "title":"Back Home"
        },
        "111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Playing Catch Up",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>I wasn’t surprised by the looks I was getting from Carrie and Collin; to be honest, I was given them similar looks as well.  The Carrie I knew was kind of bookish and socially awkward; if she hadn’t hung out with Collin, Erica and me, I don’t think she would have had any friends.  So to see that she was suddenly pregnant came as a shock to me.<br>\r\n<br>\r\nCollin was different as well; the last time I saw him he’d been somewhat chubby, not fat but definitely on the chubby side.  He was now almost 6 feet tall and thin; a far cry from what he used to be.<br>\r\n<br>\r\nBoth of them walked over and looked at me, which was no mean feat since they were now taller than me.  Collin took one look at me before turning to my Mom.  “This is some kind of joke, right?”<br>\r\n<br>\r\n“I assure you, Collin; this isn’t a joke.” Gesturing to me, Mom said, “As strange as it sounds, that really is Brian.”<br>\r\n<br>\r\n“How’s that even possible?” gesturing to me, Collin said, “He’s been missing for 6 years but he doesn’t look like he’s aged at all.”<br>\r\n<br>\r\n“You’re asking the same questions that we’ve already asked.” Looking at me, Erica said, “For now why can’t we just be glad that our friend is back?”<br>\r\n<br>\r\n“How do we know it’s really him?”<br>\r\n<br>\r\nLooking at Carrie, I realized she needed some more convincing that I was who I said I was.  “When we were in 7th grade, you kissed me in the boy’s locker room after school.”<br>\r\n<br>\r\nCarrie brought a hand up to her mouth and started hyperventilating. Collin and Erica had to grab her to make sure she didn’t fall.  Once she regained the ability to speak, Carrie took one look at Collin and said, “That’s definitely Brian.” Blushing, she said, “I never told anyone about that kiss.”<br>\r\n<br>\r\nThat was enough for Collin; he came over and hugged me, saying, “It’s great to have you back, kiddo.”<br>\r\n<br>\r\nI was a little confused about the kiddo remark, but I didn’t dwell on it.  As Carrie placed a hand on my shoulder, I was just glad to have my friends back; even if they were now 6 years older than I was.  “You guys feel like catching me up on everything I’ve missed the last 6 years?”<br>\r\n<br>\r\n“Sure, why not.” Smiling, Carrie said, “I’m sure you’ve got plenty of questions for us.”<br>\r\n<br>\r\nMackenzie and Mom quietly excused themselves while the four of us made our way to the couch.  “I sure do.”  As I sat down next to Carrie, I looked at her and said, “For starters, how about you tell me how you got pregnant?”</span></div></div>",
            "created":1578546000,
            "id":2771712,
            "title":"A Reunion 6 Years In the Making"
        },
        "1111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Upstairs",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>“How did I get pregnant?” looking at me, Carrie said, “You always did like to dive right in, didn’t you little buddy.”<br>\r\n<br>\r\n“Well, it is a pretty big change, Carrie.”<br>\r\n<br>\r\n“I suppose that’s fair.” Taking a breath, Carrie said, “I went to a New Year’s party at a friend’s place.  Everything was going great until I woke up in bed with my clothes in a pile on the floor.  Next thing I know, I’m wondering when I was going to get my next period.”<br>\r\n<br>\r\nI was shocked to hear that.  “I’m sorry.” Putting my hand on hers, I said, “I wish I could have been there for you.”<br>\r\n<br>\r\n“I had Erica and Collin to help me through this.” Chuckling, she said, “Now I’m not even scared about it; I’m just looking forward to seeing this little boy or girl.”<br>\r\n<br>\r\nI was starting to feel a little overwhelmed by all this.  For me, only a few hours had passed, but for everyone else, it had been 6 years.  My best friend had gotten a sex change and another friend was pregnant.  That left Collin and why he’d changed.  Turning my attention to him, I said, “You used to be on the chubby side, man; what happened?”<br>\r\n<br>\r\n“Nothing as drastic as Carrie’s story, I’m afraid.” Taking a breath, Collin said, “I fell in love, and wanted to make myself better for her?”<br>\r\n<br>\r\n“Really?” pausing, I said, “Can I meet her?\"<br>\r\n<br>\r\n“There’s no need.” Walking over to Collin, Erica kissed him and said, “You already have.”<br>\r\n<br>\r\nA lot certainly had changed in just 6 years, and that was just with my friends.  Looking at me, Carrie said, “Are we all caught up, kiddo?”<br>\r\n<br>\r\n<i>Again with the kiddo.</i>  “I’ve probably missed so many video games and movies.” Looking around, I said, “Perhaps you guys can help me catch up with that?”<br>\r\n<br>\r\nThe moment I said that I swear I noticed a look of hesitation on Carrie and Collin’s faces.  “I’m sure we can work something out, Brian; but you’ve got to remember that we’re in college now.”  Looking at me, Collin said, “We can’t just drop everything and play video games like when we were your age.”<br>\r\n<br>\r\nI was saddened to hear that; because I remembered Collin would always find an excuse to play video games.  Turning to Erica, I said, “How about you?”<br>\r\n<br>\r\n“I’m taking a light course load this semester, but I’ve got an internship at a local fashion house.” Seeing the dejected look on my face, she said, “But I promise I’ll make time to hang out with you; like old times.”<br>\r\n<br>\r\nThis was the first moment I realized how much things had really changed.  My friends were no longer the people I remembered; they’d grown up while I still remained the same age.  Before I could say anything, Mom walked into the room and said, “I think that’s enough for one evening; I’m sure Brian is exhausted.”<br>\r\n<br>\r\nThat was the cue for everyone to leave; as they all stood up and walked towards the door.  I followed them to the door and said my goodbyes.  After they said their goodbyes, the three of them left.  I watched as Collin and Erica kissed before going their separate ways; Erica went to her house while Collin left with Carrie.<br>\r\n<br>\r\nI stood in the doorway for a few minutes; until Mackenzie came up next to me and said, “How’d it go?”<br>\r\n<br>\r\n“It was weird.” Looking at her, I said, “They’re not the same people I remember.”<br>\r\n<br>\r\n“Six years is a long time, Brian.” Sighing, Mackenzie said, “Even I’m not the same person I was 6 years ago.”<br>\r\n<br>\r\n“You’re telling me.”<br>\r\n<br>\r\n“Come on, let’s go to bed.” Looking at me, Mackenzie said, “You’ve got a <i>long</i> day tomorrow.”</span></div></div>",
            "created":1578546000,
            "id":2771751,
            "title":"Playing Catch Up"
        },
        "11111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>6 years had passed, so I guess I shouldn’t have been surprised to find that most of my stuff had either been donated or put into storage.  Mom reassured me that my collection of video games and movies had been kept, along with most of my books and posters.<br>\r\n<br>\r\nI wasn’t upset by the fact that most of my clothes had been donated.  That was, however, until I realized I had to wear a pair of Mackenzie’s pajamas to bed.  I was sitting on her bed watching as she rummaged through her dresser to find the least embarrassing pajamas she had.  This gave me a chance to look around her room.<br>\r\n<br>\r\nThe first thing I noticed was that her little league trophies were gone from her shelf; replaced with about a half a dozen cheerleading competition ribbons.  There was a photo of Mackenzie wearing her cheer outfit inside a school gym – I had to admit that she looked pretty good.<br>\r\n<br>\r\nAfter that came the typical items you’d find in a teenage girl’s room; an assortment of makeup on her dresser, a closet full of dresses and pants, and a wall covered in posters of boys.  I noticed two framed photos on her nightstand; one was of the two of us, taken a few months before I disappeared, while the other was of her and another girl on the front porch wearing dresses.<br>\r\n<br>\r\nLooking closer, I thought the other girl looked familiar.  Turning to Mackenzie, gesturing to the photo, I said, “Is that other girl Emily?”<br>\r\n<br>\r\n“Huh?” seeing what I was pointing at, Mackenzie said, “Yeah, that’s Emily and me last year; right before our Spring Formal.”<br>\r\n<br>\r\nTurning my attention back to the photo, I couldn’t shake the feeling that Emily looked rather attractive in the photo.  I tried to get that thought out of my head; after all, the last time I saw her, Emily was a 7-year-old girl.  Try as I might, I couldn’t shake the feeling that she was definitely an attractive girl now.  Walking back to the bed, I sat down and said, “How’s it coming finding me a pair of pajamas?”<br>\r\n<br>\r\nMackenzie turned around and handed me a pair of pink pajama pants and a pink top.  Seeing the horrified expression on my face, she said, “Hey it’s either this or you wear one of my nighties.”<br>\r\n<br>\r\nIt was bad enough I had to borrow pajamas from my sister, I didn’t want to resort to wearing one of her nighties.  Grabbing the pajamas, I looked at her and said, “Not a word of this to anyone, okay?”<br>\r\n<br>\r\n“Okay.”</span></div></div>",
            "created":1578632400,
            "id":2771995,
            "title":"Upstairs"
        },
        "111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Next Morning",
                "During the Night",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>I walked out of the bathroom a few minutes later wearing the pajamas Mackenzie had loaned me.  I guess I should’ve expected her to chuckle when she saw me.  “You look really cute in pink, Brian.”<br>\r\n<br>\r\n“It certainly beats the alternative, Mac.” Sighing, I said, “Thankfully this is just for tonight.”<br>\r\n<br>\r\nMom had assured me that tomorrow we’d go get my stuff out of storage, but first, we’d have to go to the police.  That was sure to be an interesting experience; convincing them that I was really who I claimed to be.  No doubt they’d have questions as to why I hadn’t aged a day.<br>\r\n<br>\r\nJust then Mom came upstairs; seeing us standing there, she said, “Kids, it’s time for bed; brush your teeth.” Looking at me, she said, “Brian, there’s an unopened toothbrush in the closet.”<br>\r\n<br>\r\nMackenzie and I obliged and walked back into the bathroom.  We brushed our teeth in silence for a moment until Mackenzie looked at me and said, “Just ask your question already.”<br>\r\n<br>\r\n“What are you talking about?”<br>\r\n<br>\r\n“I’ve seen you looking at me; so just ask your question already.”<br>\r\n<br>\r\nMackenzie was right; I had been looking at her, but not in a perverted way.  I couldn’t wrap my head around the fact that the teenage girl standing next to me was the same 7-year-old tomboy I’d seen only a few hours ago.  “Okay, fine.” Taking a breath, I said, “You used to be such a tomboy; now your room is full of makeup, dresses, and pictures of boys.  What happened?”<br>\r\n<br>\r\n“Mom and Dad became more protective of me after you disappeared; they didn’t let me out of their sight for months.” Sighing, Mackenzie said, “I didn’t really think much of it; because, frankly, I thought I deserved it.”<br>\r\n<br>\r\n“What?” confused, I said, “Why would you think that?”<br>\r\n<br>\r\n“Because I’m the whole reason you were out there in the woods, Brian.” Looking at me, Mackenzie said, “If I hadn’t been so pushy, you wouldn’t have disappeared.”<br>\r\n<br>\r\nI could tell Mackenzie was having a hard time with everything.  I took one look at her and said, “You can’t blame yourself for what happened to me, Mac.” Pausing, I said, “Who’s to say I wouldn’t have disappeared from my bedroom or something?”<br>\r\n<br>\r\n“That’s what I’ve been trying to tell myself.” Sighing, Mackenzie said, “But regardless, here you are; we’re both the same age now.”<br>\r\n<br>\r\nIn an attempt to steer the subject back to where it was supposed to be, I said, “So how did Mom and Dad being protective of you make you no longer a tomboy?”<br>\r\n<br>\r\n“I needed something to do; especially since the house was the only place Mom and Dad weren’t watching me like a hawk.” <br>\r\nLeaning against the counter, Mackenzie said, “Eventually Mom decided to buy me a Barbie doll and some accessories.  From there I moved to Disney Princess and cute singers.  Once I started Junior High, I got introduced to cheerleading; my athletic background made me a natural.  I guess you can say the rest is history.”<br>\r\n<br>\r\nI finished brushing my teeth a moment later.  Putting my toothbrush down, I turned to Mackenzie and said, “Whatever the reason, I’m glad to see that you’re happy.”<br>\r\n<br>\r\n“Believe me; it took a long time for me to come to terms with you disappearing.” Hugging me, Mackenzie said, “I’m just really glad you’re back.”<br>\r\n<br>\r\n“I’m glad I’m back too.” Hugging Mackenzie, I said, “Don’t worry, I’m not going to leave you again.”<br>\r\n<br>\r\n“You better not!” chuckling, Mackenzie looked at me and said, “God forbid you were to disappear again and come back when I’m in my twenties.”</span></div></div>",
            "created":1578632400,
            "id":2772016,
            "title":"A Bathroom Chat"
        },
        "1111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Talking with the Police (Locked)",
                "At the Storage Unit",
                "Later On",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>I woke up the next morning to find Mom sitting at the edge of my bed.  Sitting up, I looked at her and said, “What’s up, mom?”<br>\r\n<br>\r\n“I lost count of how many times I came in here last night; just so I could make sure that you were still here.”<br>\r\n<br>\r\n“I’m not going to disappear again, Mom.”<br>\r\n<br>\r\n“I certainly hope so,” moving closer to grab my hand, she said, “I just got you back, I’m not sure I can stand to lose you again.”<br>\r\n<br>\r\nI caught a glimpse of Mackenzie standing in my doorway; she had a look of relief on her face, clearly, she was also worried that I’d disappear again.  Getting out of bed, I said, “So what exactly is on the agenda for today?”<br>\r\n<br>\r\n“First we’re going to the police to tell them you’re back.”  Looking at me, Mom said, “After all that’s finished, then we can go get your stuff out of storage.”<br>\r\n<br>\r\nWalking into the room, Mackenzie said, “Don’t forget I have plans with Emily and Cameron this afternoon.”<br>\r\n<br>\r\n“Don’t worry honey, we’ll be back in plenty of time for that.”<br>\r\n<br>\r\nTurning my attention to Mackenzie, I said, “Whose Cameron?”<br>\r\n<br>\r\n“He’s a friend of Emily and me; he moved here about a year after you disappeared.” Looking at me, Mackenzie said, “I think you’d like him; he loves video games probably more than you did...I mean do.”<br>\r\n<br>\r\n“What kind of plans are we talking about here?”<br>\r\n<br>\r\n“They have plans to see the new Angry Birds movie.”<br>\r\n<br>\r\n“Angry Birds?” confused, I said, “They made a movie about that?”<br>\r\n<br>\r\n“Oh right, I forgot the first one came out after you disappeared.” Looking at Mackenzie, Mom said, “Why don’t you let your brother tag along; it’ll give him a chance to get out of the house.”<br>\r\n<br>\r\nI could tell Mackenzie wasn’t exactly sold on the idea; but she turned to me and said, “I know you haven’t seen the first one, but you can come along if you want.”<br>\r\n<br>\r\n“Sure, I guess I can come along.” </span></div></div>",
            "created":1578632400,
            "id":2772050,
            "title":"The Next Morning"
        },
        "11111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Meeting Mackenzie's Friends",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Six years had passed since my disappearance, so I guess I should have expected things in town to change.  I just wasn’t expecting things to change as much as they had.  A formerly empty lot down the road had been turned into an apartment complex and the movie theater had gotten bigger.<br>\r\n<br>\r\nAs we entered the downtown area, I turned to look at Mackenzie; only to find her making a weird face.  “What are you doing, Mac?”<br>\r\n<br>\r\n“Duh, I’m taking a selfie.”<br>\r\n<br>\r\n“Watch your tone, young lady.” From the front seat, Mom said, “Brian doesn’t know what selfies are.”<br>\r\n<br>\r\n“Oh, right; they became popular after you disappeared.” Looking at me, Mackenzie said, “Basically you just use your phone to take a photo of yourself.”<br>\r\n<br>\r\nMackenzie leaned over so I could look at the photos on her phone; most of them were either selfies of herself or photos with her, Emily or who I figured was Cameron.  One thing I noticed about a few of the photos was that Mackenzie looked like she had a dog snout or anime eyes.  Looking at her, I said, “What’s with all those weird pictures?”<br>\r\n<br>\r\n“They’re called Snapchat filters; they’re used to add funny things to the photos.”  Mackenzie leaned over and took a photo of the two of us.  Handing me the phone, she said, “Here, have a look.”<br>\r\n<br>\r\nTaking the phone, I saw a photo of the two of us where our faces had been swapped.  I was still coming to terms with Mackenzie being a teenager, so it was a little disturbing to see my face on her body.  “That’s what you do with your phone all day?” Looking at her, I said, “Seems kind of childish to me.”<br>\r\n<br>\r\n“Whatever.” Taking her phone back, scoffing, Mackenzie, “Give it some time; you’ll probably be doing it too.”<br>\r\n<br>\r\nAs Mom continued driving, I found myself wondering what happened to my little sister.  She’d gone from being a happy and energetic kid to a seemingly sullen teenager.  I hoped that would improve now that I was back.<br>\r\n<br>\r\n<div align=\"center\">***************************</div><br>\r\n<br>\r\n\"I beg your pardon?\"<br>\r\n<br>\r\nDetective Bradshaw, of the Missing Persons Unit, had been assigned to my case a few weeks after I’d vanished.  Naturally, my Mom went straight to him after we arrived at the Station.  As you’d expect, he had trouble believing what we were telling him.<br>\r\n<br>\r\n“I’m telling the truth, Detective; I was playing hide and seek with my little sister.  Suddenly there was this weird noise and I blacked out.” Pausing, I said, “I went home as soon as I woke up; only to find that six years had gone by for everyone but me.  But I'm here now, so you can take me off your list.\"<br>\r\n<br>\r\n“Let me telling you something, whoever you are.” Looking at me from behind his desk, Bradshaw said, “I’ve been doing this for 15 years; every time a missing person came through those doors they had a detailed description of their abductors.   <br>\r\nNone of them - not a single one - walked in looking like not a day had passed since they went missing. So you'll pardon me if I'm the tiniest bit skeptical.\"<br>\r\n<br>\r\nIt was frustrating that he didn’t believe me, but I could understand Det. Bradshaw’s skepticism.  Sighing, I said, “I wish there was a way to prove I’m telling the truth.\"<br>\r\n<br>\r\n\"You do,\" sitting on a couch behind me, Mackenzie said, “You’ve been walking around with it this whole time.”<br>\r\n<br>\r\nConfused, I looked at Mackenzie said, “Huh?  What are you talking about?”<br>\r\n<br>\r\n“The Police have your prints and DNA on file; Detective Bradshaw thought it would be useful if we ever found you.”<br>\r\n<br>\r\nI turned to look at Det. Bradshaw, who sighed and said, “Fine, I’ll take your prints and you can spit into a test tube.” Pausing, he said, “That’ll tell us, once and for all, who you really are.<br>\r\n<br>\r\n<div align=\"center\">***************************</div><br>\r\n<br>\r\nWe waited with Det. Bradshaw for almost an hour before another officer delivered a file to his desk.  We all watched as he studied them for a few minutes; without saying a word.  Getting impatient, Mom said, “Well?”<br>\r\n<br>\r\n“I can’t understand it, but the prints and DNA are a 100% perfect match.” Looking at me, he said, “I don't know why you aren't any older than when you turned up missing, but the science says you're Brian Hawkins.\"<br>\r\n<br>\r\n<i>I could’ve told you that.</i>  Looking at him, I said, “So what do we do now?\"<br>\r\n<br>\r\n“Now you do what I did when I found my wife in bed with another man.” Sighing, he said, “You turn around and hope you never have to come back here.”<br>\r\n<br>\r\n“That’s it?” looking at me, Mackenzie said, “Aren’t you curious to know why he hasn’t aged a day?”<br>\r\n<br>\r\n“I am very curious, Ms. Hawkins.” Taking a breath, Det. Bradshaw said, “But where your brother was, and how he came back, aren’t for me to investigate.  As far as I’m concerned, you’ve been found.”</span></div></div>",
            "created":1578632400,
            "id":2772079,
            "title":"Going to the Police"
        },
        "111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Drive to the Movie",
                "At the Movie",
                "Sometime Later",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>After leaving the Police Station, Mom took us to the mall.  Mom must’ve spent close to $300 on clothes for me; but I guess that’s par for the course when you’ve been missing for 6 years.  The next stop after that was the storage unit to get all my things.  Let me tell you something; it’s pretty humbling to find that all your worldly possessions can fit inside a 3x5 unit with room to spare.<br>\r\n<br>\r\nWe got back to the house just after 2:00, pulling into the driveway to find two people sitting on the front steps.  As we got closer, I realized one of them was Emily and the other was the boy in Mackenzie’s pictures.  Parking the car, Mom looked at me and said, “We don’t have to do this now if you don’t want to.”<br>\r\n<br>\r\n“I’m fine; let’s just get it over with.”<br>\r\n<br>\r\nWe all got out of the car at the same time, but Mackenzie and Mom stayed back while I walked up to the steps.  Emily was the first to approach me; walking up to me, she placed her hand on my face.  “I can’t believe this is real.”<br>\r\n<br>\r\nWith a smile, I looked at her and said, “Hi Emily.”<br>\r\n<br>\r\nI had, of course, seen photos of her from Mackenzie’s room, but they didn’t prepare me for the real thing.  The Emily I knew 6 years ago could have easily passed herself off as a boy, but that was no longer the case now.  She was a little taller than Mackenzie now, only about 3 inches shorter than me; her brown hair had gotten darker.  Her breasts were a little on the small size, but that would likely change.  It felt wrong to think of her that way, but I couldn’t help but find her attractive now.<br>\r\n<br>\r\nBefore I could even prepare myself, she wrapped her arms around me and gave me a big hug.  As I returned the hug, between tears of joy, Emily said, “I didn’t believe it when Erica told me you were back.”<br>\r\n<br>\r\n“Well, as you can tell, I’m really back.”<br>\r\n<br>\r\nEmily and I had an almost sibling-like relationship before I disappeared; so I’d imagine she was pretty upset when it happened.  Breaking the hug, Emily wiped tears from her eyes and looked at me.  “But how haven’t you aged at all?” with a bewildered look, Emily said, “I mean we’re practically the same age now.”<br>\r\n<br>\r\n“I’m as confused as you are, believe me.”<br>\r\n<br>\r\nHugging me again, Emily said, “Don’t ever leave again, Brian.”<br>\r\n<br>\r\n“I’ll try not to.”<br>\r\n<br>\r\nAt that point, Mom and Mackenzie came over to join us; followed by the still unidentified boy.  While Emily started talking with Mom and Mackenzie, the boy walked over to me and said, “I’m Cameron Hardy; it’s nice to meet you.”<br>\r\n<br>\r\nShaking his hand, I said, “It’s nice to meet you too, Cameron.”<br>\r\n<br>\r\nWe all stood outside the house for a few minutes until Mom said, “Why don’t we bring Brian’s things up to his room; then I’ll bring drive you guys to the movie.”<br>\r\n<br>\r\n“Actually, Ms. Hawkins, my folks said they would drive.” Looking at me, Emily said, “I think they want to see Brian in person.”<br>\r\n<br>\r\n“Okay then, that’s fine with me.”</span></div></div>",
            "created":1578718800,
            "id":2772417,
            "title":"Meeting Mackenzie's Friends"
        },
        "1111111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "After the Movie",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Mrs. Sommers, Emily’s mom, came over to get us for the movie around 5:30.  After saying goodbye to Mom, I followed the others to the waiting car.  Mackenzie and Emily were sitting in the backseat, doing whatever on their phones, while I sat in the middle row with Cameron.  Mackenzie had been right about one thing – Cameron and I wouldn’t have a problem getting along.  We’d already made plans to hang out at his house tomorrow to play video games.<br>\r\n<br>\r\nAs Mrs. Darrow drove to the movie theater, she said, “Naturally Erica told us that you were back, Brian.” Looking at me through the rearview mirror, she said, “When she told us the rest, I knew I had to see you for myself.  I’m positively amazed.”<br>\r\n<br>\r\n“Believe me, Mrs. S, it’s pretty amazing from my end too.” Chuckling, I said, “When I went to sleep Toys R Us was still open.”<br>\r\n“How are things at home?”<br>\r\n<br>\r\n“Mom and Mackenzie are glad I’m back; they both kept waking up to check on me last night.” Sighing, I said, “I still can’t believe my dad’s gone.”<br>\r\n<br>\r\n“He held on for as long as he could.” Coming to a stoplight, Mrs. Sommers looked at me and said, “I’m sure he’d be overjoyed to know you’re back.”<br>\r\n<br>\r\n“I’m sure he would.”<br>\r\n<br>\r\n\"What's next for you then? I’d imagine you'll need to see about calling off the search.\"<br>\r\n<br>\r\n<br>\r\n\"That’s the first thing we did this morning; although it took some doing to convince the detective I was who I said I was.” Sighing, I said, “Mom said the next thing she’s going to do is get me back into school.”<br>\r\n<br>\r\n“That must be weird for you; with Erica and the others in college.”<br>\r\n<br>\r\n“You could say that.” Taking a breath, I said, “I guess I’ll just have to settle with starting the 8th grade.” <br>\r\n<br>\r\n“What’s important is that you’re alive and well.” Turning into the parking lot, Mrs. Sommers said, “Sadly that’s not true for a lot of missing children.”<br>\r\n<br>\r\nMrs. Sommers had a point; my family had it rough while I was...wherever I’d been for 6 years.  Dad died waiting for me to come home, and Mackenzie...I couldn’t help but wonder if part of her had died as well in those six years.</span></div></div>",
            "created":1578718800,
            "id":2772464,
            "title":"The Drive to the Movie"
        },
        "11111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "After the Movie",
                "During the NightDuring",
                "The Next Day",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>We got to the movie theater a short time later.  After thanking Mrs. Sommers for the ride, we all went inside.<br>\r\n<br>\r\nWhile Mackenzie and Cameron went to get the tickets, Emily and I went to get the concessions.  As we waited for our turn in line, I turned to Emily and said, \"Can I ask you a question, Em?\"<br>\r\n<br>\r\n\"Sure.\" Looking at me, she said, \"What's on your mind?\"<br>\r\n<br>\r\n\"How did my disappearance affect Mac?\" Sighing, I said, \"I'm sure she's glad I'm back, but she seems rather cold and distant.\"<br>\r\n<br>\r\n\"She didn't take it well, Brian.\" Sighing, Emily said, \"She blamed herself for what happened even though everyone told her it wasn't her fault.\"<br>\r\n<br>\r\n\"There has to be more to it then that.\"<br>\r\n<br>\r\n\"Put yourself in her position; how would you feel if she disappeared and you thought it was your fault.\"<br>\r\n<br>\r\n\"I guess I wouldn't take it very well.\"<br>\r\n<br>\r\n\"I'm sure part of it is just being a teenager; I mean there are days when I'm the last person you want to be around.\" Looking at me, Emily said, \"But a lot of it is that she's spent the last 6 years blaming herself; it's become second nature for her to be cold and distant.\"<br>\r\n<br>\r\n\"What do you think I should do?\"<br>\r\n<br>\r\nIt was our turn in line for snacks.  As we walked over, Emily said, \"I'd just give her time, Brian; let her get used to having you back in her life.\"<br>\r\n<br>\r\n\"Thanks Em.\"</span></div></div>",
            "created":1578805200,
            "id":2772699,
            "title":"At the theater"
        },
        "111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "During the Night",
                "The Next Day",
                "Something Else",
                "Something Else",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>The movie ended shortly after 8:00 and, despite not having seen the first one, Brian had to admit he enjoyed it.  As the four of them walked out of the theater, and into the mall, Cameron said, “You guys want to hit up the arcade for a little while?”<br>\r\n<br>\r\n“Sure, I wouldn’t mind doing that.” Turning to Emily and Mackenzie, Brian said, “You guys want to join us?”<br>\r\n<br>\r\nBoth Emily and Mackenzie were standing nearby doing something on their phones.  Brian couldn’t figure out why everyone was so focused on their phones compared to six years earlier.  Looking up at Brian, with a half-hearted smile, Mackenzie said, “Fine, I guess.”<br>\r\n<br>\r\nAs Mackenzie went to catch up with Cameron, Emily walked over to Brian and said, “Stop worrying, Brian.”<br>\r\n<br>\r\n“Huh?” confused, I turned to Emily and said, “What are you talking about?”<br>\r\n<br>\r\n“I know you’ve been gone for 6 years, but I still know you pretty well.” Chuckling, Emily said, “I can tell when something is worrying you.”<br>\r\n<br>\r\n“She’s my little sister, Em; I don’t like seeing her like this.” Sighing, I said, “Especially when there’s a chance I’m the reason for it.”<br>\r\n<br>\r\n“Oh God, not you too.” Sighing, Emily said, “Look, like I told Mackenzie 6 years ago, it’s not your fault that you disappeared.”<br>\r\n<br>\r\nI didn’t even know how I disappeared; so I didn’t exactly buy into Emily’s assertion that it wasn’t somehow my fault.  I was about to tell her that when a little kid, who wasn’t paying attention to where he was going, ran into Emily; causing her to hit me and the two of us to fall to the ground.<br>\r\n<br>\r\nAs I lay on the ground with Emily on top of me, I started to get an unexpected feeling – as if my close, physical contact with Emily was causing something to happen inside me.  Deep down I suspected I knew what was happening, but I didn’t want to admit it on a conscious level.  <i>Was I attracted to Emily?</i><br>\r\n<br>\r\nI began to suspect that Emily was dealing with a similar issue because, as she climbed off of me, she started to blush.  Before either of us could say anything, the parents of the young boy came over to express their sincere apologies.  Getting to my feet, helping Emily to her feet as well, I said, “No problem, we’re okay.”<br>\r\n<br>\r\nCameron and Mackenzie came back our way, having finally noticed we weren’t following them.  Looking at the two of us, with the embarrassed looks on our faces, Mackenzie said, “Are you two alright?”<br>\r\n<br>\r\n“Yeah, we’re fine.” Blushing, Emily said, “Some kid just knocked me into Brian; we’re fine.”<br>\r\n<br>\r\nSatisfied with the answer, Mackenize turned to walk away.  I stood there for a moment, watching Emily walk off after her.  <i>How could I be attracted to Emily?</i></span></div></div>",
            "created":1579064400,
            "id":2774219,
            "title":"After the Movie"
        },
        "1111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Next Morning",
                "Something Else",
                "Something Else",
                "Something Else",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>If I thought my confusion surrounding Emily was going to end when I went to bed, I was sorely mistaken.  The first dream I had that night, after falling asleep, had me hanging out by Erica’s pool – with Emily and Mackenzie nearby.  But it wasn’t them as they were now; it was them as they’d been before I disappeared.<br>\r\n<br>\r\n<i>What’s this all about?</i>  I watched as the two of them were playing around in the pool; jumping in and climbing back out again.  The dream continued on from there, as I watched them continue doing that for what seemed like an eternity.  <i>This isn’t one of my more entertaining dreams, I can tell you that right now.</i><br>\r\n<br>\r\nEventually, things started to get weird; as Emily started to get all fuzzy, while Mackenzie stayed the same.  I watched as fuzzy Emily jumped back into the water and swam to the steps in the shallow end.  <i>Kid can hold her breath.</i>  I watched as she climbed out of the pool; suddenly appearing as her 13-year-old self wearing a rather skimpy two-piece bathing suit.  <i>What the hell?</i><br>\r\n<br>\r\n13-year-old Emily walked around the pool, ignoring 7-year-old Mackenzie until she was standing right in front of me.  Looking at me, a smile on her face, she said, “How do I look, Brian?”<br>\r\n<br>\r\nDream me responded by saying, “You look amazing, Emily.”<br>\r\n<br>\r\nThat must’ve been what 13-year-old Emily wanted to hear because she leaned down to give me a kiss...only for that to be the moment I woke up.  As I lay in bed, looking up the ceiling, I became aware of two things; I was covered in sweat and I had an erection.  <i>What the hell is going on here!?</i></span></div></div>",
            "created":1579150800,
            "id":2774464,
            "title":"During the Night"
        },
        "11111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Leaving for Cameron's",
                "Something Else",
                "Something Else",
                "Something Else",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>I was thankful that the rest of the night passed by without any disturbing dreams.  When I woke up the next morning, the first thing I did was to go find Mom.  I soon found her in the kitchen, looking over the newspaper.  “Mom, something happened last night that I need to talk with you about.”<br>\r\n<br>\r\n“Okay, honey.” Putting the paper down, Mom looked at me and said, “What’s on your mind?”<br>\r\n<br>\r\nI proceeded to explain what happened after the movie; how I felt strange around Emily for the rest of the evening.  After I told her about the dream I had, I said, “I think there might be something wrong with me, Mom.”<br>\r\n<br>\r\n“There’s nothing wrong with you, Brian.” Smiling, Mom said, “It sounds to me like you’ve got a little crush on Emily.”<br>\r\n<br>\r\nDeep down I knew Mom was right, but I had trouble admitting it.  Looking at her, I said, “That’s disgusting, Mom! I can’t have a crush on Emily!”<br>\r\n<br>\r\n“Why not?” looking at me, Mom said, “She’s a lovely young lady.”<br>\r\n<br>\r\n“I know, but...I-I can’t have a crush on her.” Sitting down, I said, “Six years may have passed for you guys, but for me, it’s only been a few days since I saw Emily as a 7-year-old girl.”<br>\r\n<br>\r\n“I think you’re thinking about this too much; Emily isn’t that 7-year-old girl anymore.” Sighing, Mom said, “Through some cosmic fluke you two are the same age now.  It’s perfectly fine for you to have feelings for her.”<br>\r\n<br>\r\n“What do you think I should do?”<br>\r\n<br>\r\n“I would talk to Emily and see if she feels the same about you.” Looking at me, Mom said, “If she does feel the same way, then you go from there; but if she doesn’t, you can try to put your feelings for her aside.”<br>\r\n<br>\r\nBefore I could respond, I was interrupted by Mackenzie walking into the kitchen.  “Morning.”<br>\r\n<br>\r\n“Morning, Mac.”<br>\r\n<br>\r\nAs I watched Mackenzie pour herself a bowl of cereal, I wondered how she would feel knowing that I had feelings for her best friend.</span></div></div>",
            "created":1579150800,
            "id":2774496,
            "title":"The Next Morning"
        },
        "111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "At Cameron's",
                "Later On",
                "Something Else",
                "Something Else",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Almost 2 hours had passed since my little chat with Mom; I was in my room getting ready to go to Cameron’s house to play some video games.  I was in the middle of putting my shoes on when Mac walked into the room.  “Cameron just texted me; said he’s looking forward to you coming over, and that I should give you his number for when you have a phone.”<br>\r\n<br>\r\nTaking the paper with Cameron’s number on it, I looked at her and got the sense that something was bothering her.  “Is something on your mind, Mac?”<br>\r\n<br>\r\n“Yeah, there is.” Looking at me, Mac said, “Why are you hanging out with my friend without me?”<br>\r\n<br>\r\n“Seriously?” confused, I said, “You were the one that suggested I hang out with him.”<br>\r\n<br>\r\n“Now I’m not sure I like that idea.” Sighing, her face starting to turn red, Mac said, “Cameron and Emily are my only friends; now I have to share them with you?”<br>\r\n<br>\r\nI was taken aback by Mac’s remarks.  Looking at her, I said, “Mac…I…”<br>\r\n<br>\r\n“Do you think it was easy for me to make friends after you disappeared?” looking at me, she said, “<i>Everybody</i> knew that you were gone because of me! Everybody!”<br>\r\n<br>\r\nI wanted to tell her that no one blamed her, but it was clear she wouldn’t listen.  Looking at her, I said, “Mac, that’s not true; no one blames you.”<br>\r\n<br>\r\n“Oh please, I could see it in their eyes.  They knew I didn’t deserve anyone, especially after Dad died.” Collapsing on my bed, Mac said, “Mom tried to help, but she didn’t really understand.”<br>\r\n<br>\r\n“Mac, I think you’re overreacting a little.”<br>\r\n<br>\r\nThe look on Mac’s face turned from sadness to rage.  Staring at me, she said, “Imagine how I felt when you came back, and you’re all ‘Hi, you want to be my friend?’” tears starting to flow, Mac said, “I need all the friends I’ve got; go make your own friends if it’s so damn easy for you.”<br>\r\n<br>\r\nI stood silently at the foot of my bed while Mac composed herself.  I tried to console her but she shoved my hand aside.  As she got up and left my room, I found myself thinking – if me hanging out with Cameron did <i>that</i> To her, I worried about how she’d react when I told her about my feelings for Emily.”</span></div></div>",
            "created":1579150800,
            "id":2774533,
            "title":"A Talk With Mac"
        },
        "1111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Hanging Out With Cameron",
                "Sometime Later",
                "Something Else",
                "Something Else",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>I decided it was probably best that I do not talk to Mom about my conversation with Mackenzie.  I didn’t want to make a big deal out of something that was, in all likelihood, a one-time occurrence.  So while Mackenzie went over to Emily’s house to hang out by the pool, Mom drove me a few miles away to Cameron’s house.<br>\r\n<br>\r\nAs we drove past the Middle School, Mom said, “I have an appointment with the school district on Monday; to see if I can get you back into school.”  Turning to me, as we came to a stoplight, Mom said, “I suppose the three of us will have to sit down and figure out a plan for when people ask where you’ve been or why you haven’t aged.”<br>\r\n<br>\r\nI was hesitant to ask this, based on my earlier conversation with Mac, but I felt I had to anyway.  “Do you think they’ll have a problem putting me in as many classes as possible with Mac and the others?” sighing, I said, “Being back in school will be hard enough; I’d rather do it with people I know.”<br>\r\n<br>\r\n“I don’t see why that will be a problem.” Turning onto a quiet street, Mom said, “I’m sure your sister and the others will be more than happy to help you adjust.”<br>\r\n<br>\r\n<i>I kind of doubt that.</i> “I hope so, Mom.”<br>\r\n<br>\r\nAs we came to a stop in front of what I could only assume was Cameron’s house, Mom said, “I spoke with Cameron’s mother last night; she understands that you may not want to discuss what happened, but be prepared if she asks you a few questions.”<br>\r\n<br>\r\n“Okay.” Getting out of the car, I said, “Thanks, Mom.”<br>\r\n<br>\r\nI walked up the walk and knocked on the door.  It wasn’t long before an attractive looking woman in her mid-30s answered the door.  “Hello Brian, I’m Cameron’s mother.” Opening the door, she said, “Come on inside.”<br>\r\n<br>\r\nAfter waving goodbye to Mom, I walked inside the house.  Looking at Mrs. Hardy, I said, “Thank you for letting me come over, ma’am.”<br>\r\n<br>\r\n“What kind of person would I be if I said no?” with a sincere smile, Mrs. Hardy said, “Cameron’s upstairs in his room; you can head on up if you’d like, it’s down the hall on the right.”<br>\r\n<br>\r\n“Thank you.”<br>\r\n<br>\r\nI made my way upstairs as Mrs. Hardy went down the hall.  Arriving outside Cameron’s room, I peeked inside to find him playing a game with some headphones on.  While I went to get his attention, I saw that his room was full of action figures, movie posters and a bookshelf full of comics.  <i>Mac was right, Cameron and I definitely share the same interests.</i><br>\r\n<br>\r\nWalking up behind him, I tapped Cameron on the shoulder; leading to him jumping in shock.  Turning to look at me, he said, “Oh hey, Brian; I didn’t know you were here yet.”<br>\r\n<br>\r\n“Sorry if I startled you.”<br>\r\n<br>\r\n“It’s alright.” Chuckling, Cameron said, “Come on, I’ll show you how to play this game.”</span></div></div>",
            "created":1579150800,
            "id":2774613,
            "title":"Going to Cameron's House"
        },
        "11111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Back Home",
                "Something Else",
                "Something Else",
                "Something Else",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Cameron and I ended up playing video games until well past noon; if Mrs. Hardy had a problem with it, she didn’t let on.  The two of us were taking a lunch break, eating some sandwiches on Cameron’s floor.<br>\r\n<br>\r\n“I hope you don’t take offense to this, but it’s been bugging me since we met yesterday.” Looking at Cameron, I said, “Emily and Mackenzie are both rather attractive girls; and you, no offense, seem kind of nerdy.”<br>\r\n<br>\r\n“You’re wondering why I’m friends with them?”<br>\r\n<br>\r\n“I guess I am, yeah.”<br>\r\n<br>\r\n“I used to ask myself that same question; especially after I moved to town and started hanging out with them.” Sighing, Cameron said, “Honestly, I think the only reason they started hanging out with me was that I reminded them of you.”<br>\r\n<br>\r\n“That didn’t bother you?”<br>\r\n<br>\r\n“It did at first.” Taking a bite of his sandwich, Cameron said, “I thought they were just pretending to be my friends.”<br>\r\n<br>\r\nThat didn’t sound at all like the Mac and Emily I knew.  Looking at Cameron, I said, “What changed?”<br>\r\n<br>\r\n“I had my 8th birthday about 2 months after I moved here; I invited my entire 2nd-grade class.” Taking a breath, Cameron said, <br>\r\n“Out of 15 people, Mackenzie and Emily were the only ones who came.  That’s when I knew they genuinely wanted to be my friends.”<br>\r\n<br>\r\nAt that moment I decided to bring up my earlier conversation with Mac.  When I was finished, I looked at Cameron and said, “Am I in the wrong here?  Should I try to find my own friends and not latch on to Mac’s?”<br>\r\n<br>\r\n“I think Mac’s being a tad unreasonable here; although I’d never say that to her face.” Sighing, Cameron said, “Your friends from 6 years ago are all in college; and, no offense, you really have nothing in common with kids your own age.”<br>\r\n<br>\r\n“So you don’t see a problem with me hanging out with you and Emily?”<br>\r\n<br>\r\n“No, I don’t.” with a chuckle, Cameron said, “Honestly, I’m just glad there’s finally another boy in the group.  I’d go crazy if they made me listen to another One Direction album.”<br>\r\n<br>\r\n“I guess I should take just things slowly; I mean, I’ve been back for 2 days and I’ve already disrupted Mac’s life.”<br>\r\n<br>\r\n“That’s what I would suggest.” Grabbing his controller, Cameron said, “I would also suggest talking with Emily; see how she feels about you hanging out with us.”<br>\r\n<br>\r\n<i>I’m not sure that’s such a good idea at this point.</i>  “I suppose I could do that too.” Grabbing my controller, I said, “So what are we going to play now?”</span></div></div>",
            "created":1579150800,
            "id":2774640,
            "title":"Hanging Out With Cameron"
        },
        "111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "At Home",
                "The Next Day",
                "Something Else",
                "Something Else",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Mom came to pick me up from Cameron’s around 4:00.  I quickly said goodbye to Cameron and his mom before getting in the car.  As Mom drove down the street, she turned to me and said, “I have to make a quick stop at the grocery store.” Pausing, Mom said, <br>\r\n“I suppose I need to get used to buying for more than two people again.”<br>\r\n<br>\r\n“That’s okay with me.” Looking at her, I said, “Would it be alright if we had cheeseburgers for dinner tonight?”<br>\r\n<br>\r\n“I don’t see why not.”<br>\r\n<br>\r\n<div align=\"center\">************************</div><br>\r\n<br>\r\nThe ride to the grocery store went by without any issues; although, for some reason, the grocery store was busier than I’d expected.  Mom and I were waiting in line for the meat counter, when I heard a voice behind us say, “Ms. Hawkins?”<br>\r\n<br>\r\nMom and I turned around to find Detective Bradshaw standing behind us, a basket full of food in his arms.  “Detective Bradshaw, how nice to see you again.”<br>\r\n<br>\r\n“How is everyone adjusting at home?” glancing at me, he said, “I imagine it’s been particularly tough for you.”<br>\r\n<br>\r\n“Actually it hasn’t been as tough as I thought it would be.” Chuckling, I said, “I mean, sure, it was quite an adjustment to find my best friends were all in college.  But other than that, I haven’t really had any issues.”<br>\r\n<br>\r\nWhile Mom waited in line, Detective Bradshaw pulled me aside.  Looking at me, a serious look on his face, he said, “How are things with your sister?”<br>\r\n<br>\r\n“Things could be better.” Sighing, I said, “She snapped at me this morning because I was going to hang out with a friend of hers.”<br>\r\n<br>\r\n“She’s had a rough few years, Brian; first with your disappearance and then your dad dying.” Placing a reassuring hand on my shoulder, he said, “I suggest you give her space; let her adjust to having you back.”<br>\r\n<br>\r\nMom walked over at that point.  Looking at us, she said, “What are you two talking about?”<br>\r\n<br>\r\n“We were talking about sports.” Casting a quick glance at me, Bradshaw looked at Mom and said, “I hope it’s not out of line or anything; but I remember you saying, a few years ago, that Brian enjoyed baseball.  I happen to have some tickets to a Minor League game this weekend; would it be alright if I took him?”<br>\r\n<br>\r\n“Sure, I don’t see why not.” Looking at me, Mom said, “Does that sound okay to you?”<br>\r\n<br>\r\nFrankly, it was a little weird; I barely knew Bradshaw.  But I hadn’t been to a baseball game in years, so who was I to pass up the opportunity.  With a smile, I nodded and said, “Sure, I’d love to.”<br>\r\n<br>\r\n“Great.” Chuckling, Bradshaw said, “The game’s at noon, so I’ll come to pick you up around 10:30.”</span></div></div>",
            "created":1579150800,
            "id":2774666,
            "title":"Grocery Shopping"
        },
        "1111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "The Next Day",
                "Something Else",
                "Something Else",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Soon after arriving at home, I went upstairs while Mom carried the groceries inside.  I had just walked into my room, and was about to lie down on the bed when Mac walked into the room.  I took one look at her and feared she was going to yell at me again.  Closing the door, she walked over and sat next to me, “I’m sorry about this morning, Brian; I-I was totally out of line.”<br>\r\n<br>\r\n“You weren’t totally out of line, Mac.” Looking at her, I said, “My being back has affected everyone; I can understand why you responded the way you did.”<br>\r\n<br>\r\n“It’s just; Emily and Cameron are my only friends, I guess I didn’t want to share them with you.” Looking at me, Mac said, “But that’s not true; I want them to be your friends too.”<br>\r\n<br>\r\n“Are you sure?”<br>\r\n<br>\r\n“Yeah, I’m sure.” Chuckling, Mac said, “Emily always thought of you as a big brother, and Cameron has a lot of your interests.  If you to hang out with them, who am I to stop you.”<br>\r\n<br>\r\nI briefly considered telling Mac about my nascent feelings for Emily, but quickly decided now wasn’t the best time.  So instead, I decided to ask about something I noticed last night.  “Is there something going on between you and Cameron?”<br>\r\n<br>\r\nI swear I noticed the faintest hint of Mac blushing.  Looking at me, she said, “What do you mean?”<br>\r\n<br>\r\n“Just some things I noticed last night; how you made an effort to be close to him, how you blushed whenever you bumped into each other.”  Taking a breath, I said, “There’s also the fact that I’m pretty sure he’s got feelings for you.”<br>\r\n<br>\r\n“He does!” Mac’s face turned beet red, clearly, she said that louder than she’d wanted.  Lowering her voice, Mac said, “How can you tell?”<br>\r\n<br>\r\nThat was all the confirmation I needed; there was something definitely brewing between Mac and Cameron.  Looking at her, I said, “He kept asking me about you today; what stuff you liked or didn’t like, your favorite foods, etc.”<br>\r\n<br>\r\n“Wh-What did you tell him?”<br>\r\n<br>\r\n“I told him my information was a little out of date; since I’m still getting to know the 13-year-old you.” Smiling, I said, “But I told him to just be himself, and something will happen.”<br>\r\n<br>\r\nA smile formed on Mac’s face when I stopped talking; the biggest one I’d seen since I came back.  Hugging me, she said, “Thanks, Brian.”</span></div></div>",
            "created":1579237200,
            "id":2774851,
            "title":"At Home"
        },
        "11111111111111111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "The Next Day",
                "Something Else",
                "Something Else",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Mac and I spent the next hour playing watching TV; until Mom called us down for dinner.  As we walked into the kitchen, Mom took one look at us and said, “I’m glad to see you’re both getting along now.”<br>\r\n<br>\r\nMac and I looked at each other, confused looks on both our faces.  Turning to Mom, I said, “What are you talking about, Mom?”<br>\r\n<br>\r\n“I know things have been strange since you came back, Brian.” Placing some plates on the table, Mom said, “Your sister has to get used to having you back; just as you have to adjust to missing the last six years.”<br>\r\n<br>\r\n“I guess that’s true, Mom.” Sitting down, next to me, Mac said, “But things are fine between us.”<br>\r\n<br>\r\n“Oh really?” raising an eyebrow, Mom said, “I heard you two fighting this morning.”<br>\r\n<br>\r\nMac and I both went pale when we heard that.  Looking at Mom, Mac said, “Y-You heard us?”<br>\r\n<br>\r\n“I heard <i>you</i>, Mackenzie.” Plopping some fries on the plates, Mom said, “I thought you put all that nonsense behind you years ago.  No one has ever blamed you for what happened to your brother.”<br>\r\n<br>\r\n“Then why wouldn’t you guys let me do <i>anything</i> without your supervision?”<br>\r\n<br>\r\n“We weren’t punishing you if that’s what you think.” Sighing, Mom said, “I suppose, in hindsight, that we went overboard; but your father and I were just trying to protect you.”<br>\r\n<br>\r\nTurning to look at Mac, I saw that she was on the verge of tears.  Trying to be supportive, I placed a hand on her shoulder and said, “If it makes you feel better, Mac, I’ll try to find my own friends; so you don’t have to share yours with me.”<br>\r\n<br>\r\nLooking at me, tears in her eyes, Mac said, “Y-You can hang out with them if you want too.”<br>\r\n<br>\r\n“Thanks, Mac.”<br>\r\n<br>\r\nAs she went back to the stove, for the burgers, Mom said, “Emily’s mother gave me the number for a child psychiatrist; one that helped Erica come to terms with being transgender.” Looking at us, Mom said, “If you want, I can call on Monday to make an appointment for each of you.”<br>\r\n<br>\r\nI wasn’t sure about Mac, but I felt counseling would be helpful for me – after all, I missed the last 6 years.  I’d need <i>a lot</i> of therapy to help come to terms with that fact.  Looking at Mom, I said, “I’d like that, Mom.”</span></div></div>",
            "created":1579755600,
            "id":2777472,
            "title":"Before Dinner"
        },
        "11111112":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Unknown to all until later, the local police station was abuzz with frantic activity. One police officer came in with a guy in handcuffs. \"Caught a guy shoplifting.\" flatly, he said.<br>\r\n<br>\r\n\"Let him off with a warning.\" Serious, the police captain said. \"We need all hands on this case.\"<br>\r\n<br>\r\nThe police officer was taken back. \"Sir...?\"<br>\r\n<br>\r\nThe police captain, Jaune Hawk, was a tall middle-aged man with the build of a professional weight lifter. He had crew-cut black hair and brown eyes. \"I said let him off with a warning!\" Sternly, he barked. \"We have no time for petty shit right now!\"<br>\r\n<br>\r\nThe police officer, Gary Grant was a twenty-some rookie cop with short brown hair and blue eyes. He was a no-nonsense police officer and saw Jaune as the same. After the man was let off with a stern warning, Gary walked back to Jaune. \"What happened that has you so rattled, sir?\" Worried, he demanded. \"It has to be big to let a criminal go.\"<br>\r\n<br>\r\n\"That man you brought in is a known kleptomaniac.\" Frowning, Jaune replied. \"He needs therapy, not prison time.\" He then motioned Gary to follow him. \"At approximately three AM, a loud disturbance was reported in the suburbs. It shook windows and set off car alarms.\"<br>\r\n<br>\r\n\"What was it?\" Curious, Gary asked.<br>\r\n<br>\r\nJaune shook his head. \"We don't know.\" Serious, he replied. \"What we do know is that two people who were reported missing six years ago suddenly reappeared.\"<br>\r\n<br>\r\n\"You mean we found their bodies...\" Wincing, Gary said.<br>\r\n<br>\r\nAgain, Jaune shook his head. \"No, they showed up alive... and have not aged a day since their disappearance.\" Darkly, he said. \"We found three smoldering impact sites in the woods on the edge of the suburbs, about a hundred yards from each other, which means...\"<br>\r\n<br>\r\n\"There might be another missing person who just reappeared.\" Rattled, Gary finished.<br>\r\n<br>\r\nJaune nodded. \"This is why we need all hands on deck.\" Serious, he said. \"Once is happenstance, two is a coincidence but three is a pattern.\"<br>\r\n<br>\r\n\"What do you need me to do, chief?\" Shaken, Gary asked.<br>\r\n<br>\r\nJaune pointed to a map of the area. \"I need you and your partner, Hank Franks to go door to door in this neighborhood and find that missing person.\" He then whispered. \"We need to get a lid on this before we have a panic on our hands and we find ourselves hip-deep in a government cover-up quagmire.\"</span></div></div>",
            "created":1578632400,
            "id":2771947,
            "title":"Developments Downtown (By Scifiwizard)"
        },
        "111111121":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "I am admitted into the hospital.",
                "I am released.",
                "continue.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>Back at home, my headache was not getting any better. In fact, it was getting worse, almost to the point of wanting to throw up. \"Mom... I really don't feel well.\" Misery in my voice, I said.<br>\r\n<br>\r\nMom turned to me, pale. \"I'm taking you to the emergency room.\" Firmly, she said. \"I'm not taking the risk of losing you twice.\"<br>\r\n<br>\r\nWith that said, Mackenzie and I were piled into the car with Carrie, Collin and Erica tagging along in another car. My sister sat with me in the back seat, holding a damp cold cloth against my head at mom's request as she rushed us to the hospital. \"It's going to be okay, Brian.\" Trying to comfort me, Mackenzie said. \"You likely have a stress headache due to all this craziness.\"<br>\r\n<br>\r\nI did not answer. It was beginning to hurt to even think. Upon reaching the hospital, Mackenzie and our friends ushered me to a seat. Mom hurried to the reception desk and told the nurse the crazy story of how I just appeared after being missing for six years. To all of our surprise, the nurse looked at me wide eyed then turned to her phone. \"A third missing person has arrived.\" Firmly, she said. \"His mother just brought him in with the same symptoms.\"<br>\r\n<br>\r\n\"Wait, what?!\" Surprised, mom asked. \"Third person?!\"<br>\r\n<br>\r\nThe nurse nodded. \"Your son is the third person to come in here with the same story and same cruel pounding headache.\" Serious, she said. \"We will take him in immediately.\"<br>\r\n<br>\r\nWith that, a hospital band was placed around my wrist and I was rushed into an emergency room where a team of doctors began to run several tests on me at once. To say i was scared and confused would be an understatement. \"Mom...\"<br>\r\n<br>\r\n\"I'm right here, sweetie.\" Taking my hand, mom said. \"I won't let anyone hurt you.\"<br>\r\n<br>\r\n\"He's showing the same vitals as the other two.\" Whispering, one doctor said to another. \"There is no way it can be a coincidence, it has to be some kind of pattern.\"<br>\r\n<br>\r\n\"What is wrong with my son?\" Worried, mom demanded.<br>\r\n<br>\r\nThe doctor in charge sighed. He was of average height and build with short black hair and green eyes. \"I'm Dr. Watts, chief physician.\" Serious, he said. \"We are running some tests on him now so please be patient.\"<br>\r\n<br>\r\n\"I heard those doctors say my vitals are the same as the other two.\" Wincing, I said. \"What does that mean?\"<br>\r\n<br>\r\n\"We need to wait for the test results to be certain.\" Serious, Dr. Watts said. \"Until I am, i cannot compare him to other patients.\"<br>\r\n<br>\r\nWith that, Dr Watts walked away while other doctors continued to run seemingly endless teats on me...\"<br>\r\n</span></div></div>",
            "created":1579150800,
            "id":2774669,
            "title":"Rushed to the ER"
        },
        "1111111211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "is becoming female.",
                "is not fully human.",
                "continue.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>After a nearly endless run of tests, the emergency room Dr Watts approached mom and I with a serious look on his face. \"Mrs. Hawkins, your son is in remarkably perfect health.\" Concerned, he explained. \"In fact, all old injuries from his past records are completely healed. He has not a single scar anywhere from his bad fall back when he was ten years old. It is as if he were never injured in his entire life.\"<br>\r\n<br>\r\nMom's jaw dropped as did mine. I did have a bad fall when I was ten years old. The family and I were rock climbing up a beginner's slope when I lost my footing and my safety rope broke. I fell over twenty feet to the rocky ground. Two broken ribs and a broken arm.... They did eventually heal but I did get a collection of scares from the deep cuts I suffered from. I looked at my arm and, sure enough, the scars were no longer there. \"What does this mean, doctor?\" Wincing, I asked.<br>\r\n<br>\r\n\"Honestly, we are all way over our heads on this one.\" Serious, Dr. Watts said. He turned to mom. \"We are admitting your son for further tests and observation. There are many questions we cannot answer, among them is why he has not aged a second from the day he had vanished.\"<br>\r\n<br>\r\n\"What are more tests going to tell you?\" Worried, mom demanded.<br>\r\n<br>\r\nDr Watts shook his head. \"You do not understand.\" Serious, he said. \"We have called in the brightest minds in the medical field from all over the world. Among the obvious perfect health and having not aged, your son...\"<br>\r\n</span></div></div>",
            "created":1580619600,
            "id":2781705,
            "title":"I am admitted into the hospital."
        },
        "11111112112":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "I agree.",
                "I ask to go home.",
                "continue.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>\"What do you mean my son is not fully human?\" Startled and disturbed, mom demanded.<br>\r\n<br>\r\n\"You son is more than human.\" Calmly, Dr. Watts said. \"In fact, I would dare say he is beyond human.\" He smiled slightly. \"What is more curious is that there are two other people who had just reappeared after vanishing six years ago who are showing the same test results.\"<br>\r\n<br>\r\n\"What are you trying to tell us?' Worried, i asked. \"I just want this headache to go away so I can go home and pick up the pieces of my life.\"<br>\r\n<br>\r\nDr. Watts took a seat. \"Although your body does not show it, your muscles are so dense they are  equal to an Olympian weight lifter.\" Serious, he explained. \"Your lungs are showing high levels of efficiency I have never seen before, your eyesight is off the charts as is your hearing...\" He sighed. \"In many ways, I envy you, Mr. Hawkins.\"<br>\r\n<br>\r\n\"If he is such great shape, why was he admitted to he hospital?\" Worried, Mackenzie demanded.<br>\r\n<br>\r\n\"First, his headaches are directly linked to his bodily changes.\" Serious, Dr. Watts replied. \"This may only be the beginning and we have no idea what other ill effects it may have upon him.\" He turned to me. \"Mr. Hawkins, we have experts from all around the world coming to help you.\"<br>\r\n<br>\r\n\"Help me with what?\" Confused, I asked.<br>\r\n<br>\r\n\"To find the answers you need.\" Calmly, Dr. Watts said. \"What had happened to you six years ago, where you had vanished to, what is happening to your body now and most importantly why you have not aged a day.\" He paused to allow his words to sink in before adding, \"The other two are just as curious to know what had happened... will you let us help you?\"<br>\r\n<br>\r\nI turned to mom, uncertain. She seemed just as worried and uncertain as I was...<br>\r\n </span></div></div>",
            "created":1581483600,
            "id":2786273,
            "title":"More than human."
        }
    },
    "info":{
        "author_id":"homerj1987",
        "author_name":"Homer J Simpson",
        "brief_description":"Imagine waking up to find that 6 years have passed in the blink of an eye",
        "created":1578615120,
        "description":"<td align=\"left\" class=\"norm\">13-year-old Brian Hawkins was playing hide and seek with his sister in the woods; when suddenly he blacks out.  When he regains consciousness he returns home to find out that while only a few hours passed for him, over 6 years have passed for everyone else.  Now he must adjust to a world where his friends are all in college, and his 7-year-old sister is the same age as him.<br>\r\n<br>\r\nRules:<br>\r\n1. Use proper grammar<br>\r\n2. Be creative with storylines but keep close to the original idea.<br>\r\n3. Use the 1st person perspective (I, I'm, I'll, etc) - keep it in Brian's POV<br>\r\n4. I reserve the right to edit, and/or/ remove chapters.</td>",
        "id":2209857,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1581503820,
        "pretty_title":"If I Could Turn Back Time"
    }
}