{
    "chapters":{
        "1":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Shawn a boy, or a girl?</span></div></span></div>",
            "created":1592785980,
            "id":2854698,
            "title":"First things first."
        },
        "11":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Scenario 1",
                "Scenario 2",
                "Scenario 3",
                "Scenario 4",
                "Scenario 5"
            ],
            "content":"<div class=\"\"><div> <span>Being in a relationship can be difficult at times, but it can be even more difficult when your wife is a witch. Shawn was on the train home, when he got a text from his wife Alex. <br>\r\n<br>\r\n\"Hi baby, are you almost home?\" She asked.<br>\r\n<br>\r\n\"Should be, just 2 stops away. How did meeting go?\" He asked.<br>\r\n<br>\r\n\"Well, we got what needed to be done, but can we have some fun tonight? I could really use it.\" She asked.<br>\r\n<br>\r\nShawn thought about it for a second, he didn't want to go all out as he to had a stressful week, but he knew hers was worse. \"We can, but I want Chinese tonight for dinner.\" he texted back,<br>\r\n<br>\r\n\"<img loading=\"lazy\" style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/heart.png\" alt=\"*Heart*\" class=\"emoteZ\" title=\"Heart\" border=\"0\" width=\"15\" height=\"15\"> your the best sweetie. If your a good boy maybe I will let you be on top tonight.\" she texted back. Shawn knew that was a lie. In this relationship, Alex was the dominate one for sure, as she had the world altering powers. Still, he loved her, and she would never do anything to harm him.<br>\r\n<br>\r\nAfter 15 minutes, Shawn arrived to their apartment, and walked in. \"I'm home babe.\" He said. </span></div></div>",
            "created":1592794260,
            "id":2854746,
            "title":"Boy "
        },
        "111":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Scenario 1",
                "Scenario 2",
                "Scenario 3"
            ],
            "content":"<div class=\"\"><div> <span>\"Welcome home sweetie!\" She said, as she walked up to kiss him. \"I'm so glad were both home. You have no fucking idea how stressful today was.\"<br>\r\n<br>\r\n\"Same, its nice though we finally get our anniversary off. What did you want to do?\" He asked. <br>\r\n<br>\r\nShe looked at him, and gave him a smile. \"I know its a lot to ask, but......can I go full range for the next few days. We haven't had a lot of fun, plus we have barely spend any time together.\" she said. He knew what that meant, but it was their anniversary, and you didn't really have time to get her a gift. <br>\r\n<br>\r\n\"Okay, just can we just take a couple of hours to relax first?\" he asked.<br>\r\n<br>\r\n\"Of course, but I am making you a girl now first.\" She asked.<br>\r\n<br>\r\n\"Wait give me a se.....\" he stopped talking, as a bright flash engulfed the room. When he regained his sight, he saw he had shrunken. \"to change my clothes\" he finished his sentence with a new female voice. He saw his male clothes now were to big for him, and he had two large lumps on his chest. He, or she in this case now, looked up to Alex, \"Just go easy please.\" she asked. <br>\r\n<br>\r\n\"When have I hurt you?\" she said, as she walked behind Shawn. She grabbed her new boobs, and started to grope them. \"There so big and pretty.\"She said she took her shirt off. Your pants fell down, leaving you naked. \"Don't worry my little cutie, we are going to have fun.\" she said. <br>\r\n<br>\r\nMinutes later, they both bed having sex. Alex started to play with Shawn's new pussy. Shawn continued to moan in excitement. \"More.\" she moaned out. <br>\r\n<br>\r\n\"Okay, now this I want to try out.\" Alex said. She stood up, and covered her vagina. Within seconds, it as replaced with a penis. She inserted it right into Shawn's vagina, and started to hump. She moaned more and more, and it lead into the night.</span></div></div>",
            "created":1592795940,
            "id":2854751,
            "title":"Scenario 1"
        },
        "1111":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Scenario 1",
                "Scenario 2",
                "Scenario 3"
            ],
            "content":"<div class=\"\"><div> <span>Shawn started to stir, as morning hit. She got up, as the blanket fell off revealing her breasts. \"Shit, that was fun. I never expected her to give herself a dick.\" she thought to herself. She looked over, and saw she was not in bed. She could smell breakfast being made, so she got up and grabbed a robe. <br>\r\n<br>\r\n\"Morning babe! I made an omelet for you.\" Alex told her. She sat down at table, as she gave her the food. Alex at next to Shawn, and put her arm around her. \"I might have gotten a little ruff. Want me to feed you?\" She asked. Shawn shook her head, and Alex did so. <br>\r\n<br>\r\n\"It's fine. I......I....kinda....\" Shawn had trouble admitting it.<br>\r\n<br>\r\n\"You liked it, didn't you?\" she asked. Shawn blushed, but he got a kiss on the cheek. \"Don't worry. I would never judge you for that. You don't just me for may fetishes.\"<br>\r\n<br>\r\n\"I love you.\" Shawn said, and they kissed. <br>\r\n<br>\r\n\"I love you too, but you stink. Wanna take a bath together?\" she asked. Shawn said yes, but said we don't have a bath big enough. \"Oh baby, do I have something to show you.\" she said. After she finished eating, they both walked to the bathroom, only to find it turned into a bathhouse. <br>\r\n<br>\r\n\"How did....nevermind.\" Shawn said, as she just learned to accept things like things like this. They both stripped, and walked into the huge bath. Alex helped Shawn wash herself, and wash her hair as well. During this, Shawn noticed something, \"Are your boobs bigger?\" <br>\r\n<br>\r\n\"Well, I felt kinda bad for not giving you time to chill. So, I did this. It's only fair since your are as big.\" she said. <br>\r\n<br>\r\nAfter half an hour,both dried off, and walked to their bedroom. Alex helped her dress in just a shirt and shorts. \"Something simple for now. Since you were a good girl I'll wear that dress you like.\" After getting dressed, Alex asked if she could get some help from Shawn on something.</span></div></div>",
            "created":1592797740,
            "id":2854764,
            "title":"Scenario 1"
        },
        "12":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Scenario 1",
                "Scenario 2",
                "Scenario 3",
                "Scenario 4",
                "Scenario 5"
            ],
            "content":"<div class=\"\"><div> <span>\"Babe, I'm home.\" Shawn said as she entered the apartment. Taking her shoes off, she didn't hear anything \"Alex? You home?\" she said again. Walking down the hall to the bedroom, there was a bright flash. \"Welcome home sweetie!\"Alex yelled out. She tackled her down to the ground, and kissed her. <br>\r\n<br>\r\n\"Flashy entrance there. Guess you must have gotten bored without me.\" Shawn told her, as Alex helped her out.<br>\r\n<br>\r\n\"Well yeah. You leave me for two weeks and I get super bored.\" She said, starting to pout. <br>\r\n<br>\r\n\"I know, I'm sorry that I took that last minute business trip, but they did give me the full two weeks off I requested. We get to spend our anniversary together at least.\" Shawn said.<br>\r\n<br>\r\nAlex started to hug her again, but Shawn could tell she was still upset. She did feel bad, as Alex had an important witch show that happened last week that she had to miss. She really wanted her to be there, but she understood why she couldn't.<br>\r\n<br>\r\n\"Babe, if I do the usual thing, will you forgive me?\" Shawn asked her wife. Alex's eyes light up, and she looked directly at Shawn. <br>\r\n<br>\r\n\"You mean it? I do have some new things I need to test on humans.\" She asked her. Shawn said yes, as she really wanted to make it up to her. She was the love of her life after all.<br>\r\n<br>\r\n\"Your the best sweetie!\" Alex said, as she hugged her again. Shawn wasn't the biggest on being her test subjects, but Alex can't really use this stuff on random people. Plus she knew Alex takes extra precautions when it comes to using her.<br>\r\n<br>\r\n\"So uh, what do did you have in mind?\" Shawn asked somewhat nervously. </span></div></div>",
            "created":1592791260,
            "id":2854732,
            "title":"Girl"
        },
        "121":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "3",
                "4",
                "5"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Good question. Oh, I know!\" Alex said. She put her hand under Shawn's shirt, and pressed her hand against her stomach. \"Pick a number between 3 and 5 babe.\"</span></div></span></div>",
            "created":1592791440,
            "id":2854734,
            "title":"Scenario 1"
        },
        "122":{
            "author_id":"chenix",
            "author_name":"Cool Guy",
            "choices":[
                "Scenario 1",
                "Scenario 2",
                "Scenario 3"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't sorry sweetie, I'll start with something new.\" She said. They both walked to the living room, and she had Shawn stand in the middle. Alex then got behind her, and pressed her back against her. She lifted her right hand, and snapped her fingers. A white circle was created on top of them, and then slowly moved it ways down. Within seconds, Shawn started to shrink. She stood around 5'10\", and she got down to just 5'. <br>\r\n<br>\r\n\"It's a spell that shrinks me.\" She asked, as her arms no longer made it to the end of her sleeves. She also tried to hold up her pants.<br>\r\n<br>\r\n\"Well, not entirely.\" Alex said, as Shawn turned around. Shawn looked up, and saw that Alex had grown to over 6 feet tall. \"It takes the height of one person, and gives it to another. How does it feel?\" She asked. <br>\r\n<br>\r\n\"This is.....surreal. I don't know about been shit short though.\" She said. Alex giggled, and bent down to whisper in her ear.<br>\r\n<br>\r\n\"You know, I have seen or porn history baby. Come one lets have some fun. I promise to not go ruff on you.\" she said, as she stroked Shawn's hair. She looked up, and they started to make out.</span></div></div>",
            "created":1592792700,
            "id":2854739,
            "title":"Scenario 2"
        }
    },
    "info":{
        "author_id":"chenix",
        "author_name":"Cool Guy",
        "brief_description":"The life and times of having a witch for a wife.",
        "created":1592785920,
        "description":"<td align=\"left\" class=\"norm\">Life is quite interesting for 25 year old Shawn. He/she had a good paying job, their own apartment, and is in love with their Wife 24 year old Alex. The thing is that she is a witch, and likes to use Shawn as a test dummy for her spells. What crazy things will happen from this?<br>\r\n<br>\r\nMain things I would like this story to have.<br>\r\nTG<br>\r\nAR<br>\r\nAP<br>\r\nBody changes<br>\r\nAnd anything else you can think of. Keep options open for other scenarios, but other then that have fun.</td>",
        "id":2224979,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1592797740,
        "modified":1592797740,
        "pretty_title":"Your Wife the witch"
    }
}