{
    "chapters":{
        "1":{
            "author_id":"jaappi",
            "author_name":"Peepster",
            "choices":[
                "Joeys and chandles apartment",
                "Rachers and Monicas apartment",
                "Rosses apartment",
                "Phoebes apartment ",
                "Some other places"
            ],
            "content":"<div class=\"\"><div> <span>You open ur eyes, u feel wierd and dizzy and you cant see very good or even remember who you are. U notice how small you are, furnitures are big as houses . You start to get your vision good and notice that ur only 5 inches long. But whos apartment is it?</span></div></div>",
            "created":1281450360,
            "id":933518,
            "title":"Shrunken"
        },
        "12":{
            "author_id":"juansese",
            "author_name":"juan",
            "choices":[
                "someone comes",
                "You meet a tribe of little people"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You realize you were in the apartment of Rachel and Monica. Everything looked great and then begin to investigate the site. So...</span></div></span></div>",
            "created":1473279120,
            "id":2207346,
            "title":"Rachers and Monicas apartment"
        },
        "121":{
            "author_id":"xkiba4lifex",
            "author_name":"Lover Of All Giantesses",
            "choices":[
                "Monica",
                "Rachel",
                "Both girls "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who Enters?</span></div></span></div>",
            "created":1542627000,
            "id":2579520,
            "title":"Who?"
        },
        "1211":{
            "author_id":"xkiba4lifex",
            "author_name":"Lover Of All Giantesses",
            "choices":[
                "Get her attention",
                "Play with her feet",
                "A Bit more Sexual playing"
            ],
            "content":"<div class=\"\"><div> <span>Looking around the giant apartment, you were simply amazed. You've never seen something so big, the biggest rooms you've been in would only be a dollhouse compared to this apartment. Everything looked so massive, you could only imagine what the giants who lived here would look like.<br>\r\n<br>\r\nFun enough, you wouldn't have to wait for long actually, as the door swung open as soon as you thought that. You watch as a giantess entered the room, walking in as you marvelled at her size, not being able to stand to see it, you fall straight on your ass.<br>\r\n<br>\r\nThe giant had long black hair, a beautiful face and a slender frame. Not to mention she was incredibly beautiful, she looked so wholesome and looked like the kind of girl you would try to hit on.<br>\r\n<br>\r\nShe was wearing casual clothes, obviously not intending company. Thats not to say she looked bad, just... casual. The giantess walked in, looking through the mail in her hands. Since she wasn't looking down at the floor, you soon realised that you were in danger. Moving fast you tried to get to anywhere you can to avoid her giant stomping feet. They come closer and closer as you see her giant frame over you. She brought her foot down and you just narrowly dodged it, seeing the wall of flesh that was this beautiful girls foot. She walked past you and into the dining area, placing the mail onto the giant table. She then sat down at it as she began opening.<br>\r\n<br>\r\nLooking in the distance you see her sitting as this was your chance. Wanting to try to get her attention when she's stationary and sitting rather then getting her attention when she's close to stomping you into the apartment floor.<br>\r\n<br>\r\nMoving across the giant apartment you became amazed. How did she move over this so fast? Are you really that small? Its just a few steps for her but for you it was at least a full time run.\u2028Even more reason to get this girls attention.<br>\r\n<br>\r\nAfter a while you arrived under the table. Staring up at her you couldn't see what she was doing, nor did you really care. You just want her to look down. Since climbing her is incredibly dangerous and you don't want to risk it, your best idea is getting her attention down below. Which means your gonna have to go to the giant feet that almost snuffed you out before.<br>\r\n<br>\r\nWalking under the table, you arrive just in front of her giant feet, her giant.... sexy feet.<br>\r\n<br>\r\nYou've never considered that you had a foot fetish, but looking at these killers you just might. Your calling them killers because you know for a fact that they can easily kill you without the girl even noticing. You need to be careful from now on.\u2028\u2028Although looking at those feet, you might not want to get found out right now. Maybe you can have a little fun with them before you get her attention.\u2028\u2028As long as she doesn't know, its no problem. Right?</span></div></div>",
            "created":1542627060,
            "id":2579522,
            "title":"Enter Monica Gellar"
        },
        "12111":{
            "author_id":"bobjones98",
            "author_name":"bob jones",
            "choices":[
                "By yelling",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do you get her attention</span></div></span></div>",
            "created":1569778500,
            "id":2725287,
            "title":"Get her attention"
        },
        "121112":{
            "author_id":"bobjones98",
            "author_name":"bob jones",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about by biting her?</span></div></span></div>",
            "created":1570105200,
            "id":2727309,
            "title":"Other"
        },
        "1211121":{
            "author_id":"kemaox",
            "author_name":"otonman",
            "choices":[
                "She does ",
                "She doesn’t "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You climbed the her skin as you bite her but as you did that does she feel you?</span></div></span></div>",
            "created":1570560960,
            "id":2730079,
            "title":"Yes"
        },
        "1213":{
            "author_id":"bobjones98",
            "author_name":"bob jones",
            "choices":[
                "The gym",
                "The shopping mall",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Both the occupants of the apartment you were in, Rachel and Monica return to their home.<br>\r\nWhere did they just come from?</span></div></span></div>",
            "created":1570105320,
            "id":2727311,
            "title":"Both girls "
        },
        "122":{
            "author_id":"juansese",
            "author_name":"juan",
            "choices":[
                "Rachel ",
                "Monica"
            ],
            "content":"<div class=\"\"><div> <span>Your investigated by the department and then you meet a tribe of little people watching you. your you came to talk to them and you welcomed the department. they will tell about his tribe and they explain that the department had two giant women who were beautiful and very dangerous because the confounded with bugs and killed. as they spoke there was a tremor and the door of a room opened. A giant shadow stood over them. Was...</span></div></div>",
            "created":1474675140,
            "id":2213731,
            "title":"You meet a tribe of little people"
        },
        "14":{
            "author_id":"kemaox",
            "author_name":"otonman",
            "choices":[
                "She's by herself",
                "Joey",
                "rachel",
                "Monica",
                "Ross"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else is with Phoebe </span></div></span></div>",
            "created":1568165880,
            "id":2716412,
            "title":"Phoebes apartment "
        },
        "141":{
            "author_id":"kemaox",
            "author_name":"otonman",
            "choices":[
                "You go for it",
                "No your going to try to get her attention someway",
                "something happens"
            ],
            "content":"<div class=\"\"><div> <span>You were looking around as you were somehow smaller. All of a sudden you heard a loud crash and bang on the floor it felt like an earthquake but it wasn't It was Phoebe and she was naked it seemed that she just got out of the shower or something. You put your hand to your hand in a thinking motion of how to get the blond attention if you could. before you could process your next thought  Phoebe foot was comming right down towards you. You moved away before her foot could hit you but something about her foot attractive you.  Do you want to Risk going towards her feet as you saw she was now relaxing and her dark blue polished toes were teasing you and sort of mocking you?</span></div></div>",
            "created":1568166360,
            "id":2716417,
            "title":"She's by herself"
        }
    },
    "info":{
        "author_id":"jaappi",
        "author_name":"Peepster",
        "brief_description":"You find urself shrunken in one of the FRIENDS apartment's.",
        "created":1281379500,
        "description":"<td align=\"left\" class=\"norm\">You can be urself or one of the FRIENDS characters. U will shrink in one of the characters appartments.<br>\r\nIn This story everything goes. But do not kill characters. This story is based somewhere on 4-5 seasons.<br>\r\n<br>\r\ncharacters:<br>\r\n<br>\r\nRoss Geller: Geekish 28 years old male with black hair, likes to research bug's.<br>\r\nMonica Geller: Rosses little sister 26. Black hair and is very dominant control freak.<br>\r\nPhoebe buffay: 28 blonde female. Can be very wierd and believes in magics, spirits and stuff like that.<br>\r\nJoey Tribbiani: Stupid, childish but good looking black haired guy 27 whos also italian. He likes to play with toys.<br>\r\nChandler Bing: (Most likely gay) Brown haired guy 29 who jokes pretty much all the time.<br>\r\nRachel Greene: Sometimes little stupid , spoiled blonde but still pretty nice person usually. She is 26 years old and Monicas best friend, and also fashion freak.<br>\r\n<br>\r\n</td>",
        "id":1697692,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1570560960,
        "modified":1570560960,
        "pretty_title":"F.R.I.E.N.D.S Shrinking story"
    }
}