{
    "chapters":{
        "1":{
            "author_id":"sinzdarkcorner",
            "author_name":"Sinz",
            "choices":[
                "In Comes a Sibling",
                "In Comes Katelyn",
                "Dad comes in",
                "Dog pushes the door open",
                "A needy cat enters"
            ],
            "content":"<div class=\"\"><div> <span>Your stomach churns from being as your parents haven't yet started making dinner and it's already 7:48 PM. You've waited patiently but you've waited long enough now, after all, your stomach is hurting now and you're probably not the only one as your youngest brother, seven years old Harry and 4 expecting to turn 5 sister, Jane, are acting more antsy than usual. You can't blame them for that, but those kids were really getting annoying and on your nerves as they nag your mom, Katelyn, over and over and over again for dinner. Your mother groans as she had already felt too tired from work to cook, and your dad Quinton is away in the bathroom to buy some time away from them in the shower. At this moment your mom finally gives in to Harry's and Jane's demands for first and tells them all to go sit on the couch, watch TV, and wait for Chinese food. It was the first thing to that came to her mind and she happens to know a local Chinese restaurant that does deliveries until 11PM, this was the quickest, easiest solution she could come up with.<br>\r\n<br>\r\nEveryone was hungry, so a big order of food is on the way and Katelyn was also nice enough to add fortune cookies to the big order, \"I better not hear any complaints about this and an easy bed time tonight because of this.\" She lectured to Harry and Jane, Jane did a simple, \"Uh huh\" in response while Harry was already zoning out on the TV and not really listening, he sure loves his cartoons. On the bright side, at least the dogs and cats have their food bowls filled, so that's many children less that Katelyn has to deal with, and her oldest daughter, Lisa, your big sister 20 going on 21 still lives at home too, although she has been a big help for your mom when she needs her, and even bought Katelyn a bottle of Kahlua and Malibu Rum recently to show her appreciation of Lisa's help and also as a present for her 21st birthday coming up next week. Katelyn has everything planned out for her kids this month, except for one thing, Jane's present for her 5th birthday that is four days from tonight, it's hard to please a little girl who is picky.<br>\r\n<br>\r\nTo pass the time and avoid your other sister, Jess, the 16 year old menace of your life, you take time to yourself away in your room to play some video games and wait until dinner gets here, now that there's <i>finally</i> a dinner plan for tonight.<br>\r\n<br>\r\nAround 8:05 you hear a knock on the front door which made both your dogs, Juno, the girl Husky Labrador mix and Brutus, the boy St. Bernard Pit Bull mix, start  barking loudly letting everyone in the house know that someone is here. Given their breeds, they were definitely loud dogs, and Juno is almost in heat too so the volume of her barks were way louder than she usually is. Your dad, Quinton was out of the shower by this time so he helped Katelyn pull the massive dogs away from the door before opening it to take the Chinese food that had finally arrived. Your mom and dad begin to set up the dinner table before they start getting everyone's attention to get some dinner. Quinton went to Jane and Harry on the couch while your mom walks upstairs to call out to you and your two sisters in the bedrooms. \"Jess, Francis, Lisa, Chinese food is here, come get it before we eat it all!\"<br>\r\n<br>\r\nAfter hearing your mom's call from across the hallway, you were a little slow to respond as you had to hit a save point in your game before turning the game system and tv off. As you were doing this, you already hear several foot steps moving down the hallway, safe to assume those were your sisters, Jess and Lisa. That's one bad time with Jess avoided in the hallway, though you normally don't mind Lisa's company either, she's not such a hellion. You get up and get out of your room through the hallway and down the stairs through the living to get to the dining room where you see the dinner table with opened cartons of Chinese food in them from stir fried rice and chicken, to egg rolls, orange chicken, Chow Mien, and a small box of fortune cookies. All of the food smells delicious and even all three of the cats wanted in on the food, especially the fattest cat, Hamilton, who only makes the effort to jump up onto table if there's food on it, though that Tabby is normally easy to push off the table, Star and Luca on the other hand were a lot faster, Luca managed to grab an orange chicken and run off in a white dash while Star was trying to grab food off of Jess's plate that she had already dished up, but Jess wasn't having it, even if she's Star's favorite person.<br>\r\n<br>\r\nYou grab a plate for yourself and begin serving yourself with the Chinese food and take a seat next to Lisa who is already digging in with Juno sitting between the both of you, tail wagging and staring at you and Lisa as you both eat. Harry and Jane already begun to open up their fortune cookies before eating their dinner and tossed their fortune aside without reading them, they just want to eat the cookie, but Katelyn grabs the fortunes, reads them silently for a moment with a little amused smile from whatever their fortunes said and puts the fortunes in her pocket. Lisa was the first to finish her food and checks out her fortune and reads aloud, \"A good friendship is often more important than a passionate romance.\" She looks at it in silence for a moment after reading, \"I'll take passion any day.\" She says with a little cackle in laughter now and crumbles it up, this gave Jess a smart ass remark, \"That's because you're a total slut, Lisa and you don't have any friends.\"<br>\r\n<br>\r\nLisa glares at Jess for a moment irritated by her comment, \"Keep talking like that and you won't have any friends either.\"<br>\r\n<br>\r\n\"Whatever.\" Jess shrugs her off and continues eating her meal, she is second to finish and now starts reading her fortune from the cookie, \"A golden egg of opportunity falls into your lap this month. Pfft, opportunity is everywhere for me, but I'm not sure what I'd do with a golden egg other than eat it.\"<br>\r\n<br>\r\n\"Always thinking with your stomach.\" You add, though she didn't seem to look your way in response, she probably didn't care as she was thinking about her fortune. <br>\r\n<br>\r\n\"There's nothing wrong with having an appetite.\" Says Quinton as he now checks his fortune to read, \"Change is happening in your life, so go with the flow! I like the sound of that.\" It takes a few minutes until someone else finishes their food so they would read their fortune, and next is your mom, \"All the troubles you have will pass away very quickly.\" Katelyn couldn't help but laugh in regards to this fortune, \"Not with five of my kids and animals in the house to feed!\"<br>\r\n<br>\r\n\"You never know, Lisa is turning 21 and has a job.\" Quinton says matter of factly but your mom just gives him a look like she doesn't believe that, \"No, she's turning 21 which means she'll be drinking more.\"<br>\r\n<br>\r\n\"At least I'm a social and friendly person when I drink.\" Lisa butts in, and of course Jess has a thought of her own to blurt out, \"And slutty.\" Lisa says nothing again and looks at Jess annoyed now.<br>\r\n<br>\r\n\"Stop calling your sister a slut, Jess.\" Says Katelyn as she gets up out of her seat to put her plate away in the sink, Jess of course doesn't take your mom's scold seriously and shrugs it off as she also gets up to leave and go back to her room. The two youngest siblings left already, probably to watch more tv before Quinton and Katelyn can tell them it's bed time. <br>\r\n<br>\r\n\"So what's your fortune say, Francis?\" Lisa says to you, she was always interested in these sort of things. You weren't finished with dinner yet but you didn't mind sharing with Lisa, so you grab the last fortune cookie which oddly enough has a red paper in it instead of the usual white papers with yellow text on it, \"The world is always bigger from a smaller perspective, always. Huh, that one makes no sense.'<br>\r\n<br>\r\n\"They don't always do, especially since you're pretty tall already.\"<br>\r\n<br>\r\n\"Right? Oh well, maybe the next time we get Chinese, the fortune will be right next time.\" At that moment you start to feel a bit drowsy and yawn, \"Well anyways, that was a good dinner, I'll see you tomorrow, goodnight.\"<br>\r\n<br>\r\n\"Goodnight Mr. Size perspective.\" Lisa said as she puts her plate away and heads off to her room. You do the same with your plate before before going to your room to get some sleep and fell asleep rather quickly tonight.<br>\r\n<br>\r\nThe next morning it took you a while to wake up, luckily it's summer so you don't have to worry about getting up for school, however as you slowly start to wake up you feel a weight on you, as if your blanket had gotten thicker over night. You pull on your blanket to get it down past your face but for some reason your blanket would just endlessly keep going as you pulled on it for a couple minutes and by the time you finally see light past the blanket, you could have sworn you were still asleep because your whole bedroom was suddenly huge, but at a better realization you soon figured out that it was <i>you</i> who changed, by several feet shorter down to just about 3 inches tall! \"How could this have happened! What happened to me? I'm- I'm so small!\" You had little time to think as you heard footsteps from the other side of the closed door, someone might be coming! That's usually happens whenever you sleep in late, you needed to act fast, and the fastest idea was to hide under your massive blanket and wait and see if that door opens!</span></div></div>",
            "created":1566385560,
            "id":2705559,
            "title":"Fortune Doesn't Smile"
        },
        "11":{
            "author_id":"sinzdarkcorner",
            "author_name":"Sinz",
            "choices":[
                "Lisa, checking up",
                "Jess, being a pest",
                "Harry",
                "Jane",
                "False Alarm, they were just walking pass"
            ],
            "content":"<div class=\"\"><div> <span>Knowing your luck, your mom or dad are always sending your siblings to wake you up when they need you for something, like chores, or to not waste the day sleeping, though you do have your moments when people let you sleep in, hopefully that's the case today because you can't afford to be seen like this right now, tiny, naked, and very vulnerable to anything now. You take a deep breath and close your eyes, hoping no one comes in through your bedroom door as it was your only line of defense right now.<br>\r\n<br>\r\nTheir footsteps are getting louder, if any of your siblings comes in, it could mean trouble for you, or quite possibly salvation. You needed a plan, but is there even any time for that?<br>\r\n<br>\r\nDoes a sibling enter the room, or are you safe for now?</span></div></div>",
            "created":1566385800,
            "id":2705560,
            "title":"Sibling Footsteps"
        },
        "14":{
            "author_id":"sinzdarkcorner",
            "author_name":"Sinz",
            "choices":[
                "Juno, female Husky Lab",
                "Brutus, male St Bernard Pit Bull",
                "Both of them!"
            ],
            "content":"<div class=\"\"><div> <span>You could hear the heavy rapid sniffing that could only belong to one of your dogs, only question is, is it Juno or Brutus? Your door must have been left cracked open because now you can hear it creak as the sniffing sounds get louder.<br>\r\n<br>\r\nWhich dog is entering the room? Will you even have time to react? Can they be trusted when you're at this size? All these thoughts don't make the situation any easier and you could feel your heart beating faster. You dare take a peek through the blanket to see who has entered your room.<br>\r\n<br>\r\nWhich dog is it?</span></div></div>",
            "created":1566386220,
            "id":2705564,
            "title":"Dog pushes the door open"
        },
        "15":{
            "author_id":"sinzdarkcorner",
            "author_name":"Sinz",
            "choices":[
                "Star, mean playful cat",
                "Luca, the outdoor hunter",
                "Hamilton, fat and lazy"
            ],
            "content":"<div class=\"\"><div> <span>You couldn't hear much, but footsteps were lightly pressing on the carpet, that had to be a cat, and now the thought occurred to you, was the door left open last night? You leave it open sometimes in case a cat or dog wants to come in, but now is really not the time for something like that, not now in your predicament! Then you hear a familiar meow call out in your room, that tone in pitch, it belongs to-</span></div></div>",
            "created":1566387240,
            "id":2705567,
            "title":"Meow"
        }
    },
    "info":{
        "author_id":"sinzdarkcorner",
        "author_name":"BadBanana",
        "brief_description":"Chinese takeout never got more real when you're shrunk by a fortune cookie's magic fortune",
        "created":1566379440,
        "description":"<td align=\"left\" class=\"norm\">On a lazy day for dinner, your family orders takeout from a Chinese place and ordered the fortune cookies for dessert as well. The fortunes for your family all were normal and tacky, but your fortune, \"The world is always bigger from a smaller perspective, always.\" For some reason your fortune becomes very real, and after that night your life is changed forever when you wake up at 3 inches in your bed. Getting back to your original size is probably impossible and now you must live out your life by the help of your gargantuan family, or fight for your survival from them and any other possible threat to your very existence.<br>\r\n<br>\r\nCharacters:<br>\r\n<br>\r\nFAMILY <br>\r\nThe Siblings<br>\r\nFrancis - You, 17 years old, the first son and second oldest sibling from your family.<br>\r\n<br>\r\nLisa - Your big sister, 20 years old going on 21, what a time to be alive for her, especially when she's nearly ready to start drinking legally. You two get along well, but she can be pretty annoying to you after a few shots.<br>\r\n<br>\r\nJess - Little sister, 16 years old, she likes making fun of her siblings and now that you're shrunk she might be a hazard to your life.<br>\r\n<br>\r\nHarry - 7 year old little brother, he was never the brightest, but he is very energetic for his age and has a hard time listening to people when he's in his own thoughts.<br>\r\n<br>\r\nJane - 4 year old sister going on 5, she is still young and doesn't understand the concepts of a lot of things, that and she still has a habit of putting objects in her mouth, lucky for you, she just lost a tooth, her right fang is out.<br>\r\n<br>\r\nYour Parents<br>\r\nKatelyn - Mom at 38 but she's still got a good body for her age and she may b chubby, but she's still got it where it counts on her body. She loves her kids and does everything she can for her children, but after you shrank she isn't too sure what to do for you, but she will still make an effort until she gives up, who knows what will happen and what she thinks will be best for you.<br>\r\n<br>\r\nQuinton - Dad, 42, he looks young for 42 and still has his dark hair and facial to show it, and still has the good build of a middle aged man thanks to his good exercise and healthy diet, just hope that you don't become part of the diet since Quinton has a big flaw of being careless and he isn't used to you being so small, accidents happen.<br>\r\n<br>\r\nFAMILY PETS<br>\r\nYou have two dogs and three cats (Oh no!)<br>\r\n<br>\r\nDogs<br>\r\nJuno - Named after a Greek goddess in mythology. Juno is a Husky Labrador mix. She likes Lisa and Katelyn most and is okay with Quinton, she is also a nanny dog for Jane.<br>\r\n<br>\r\nBrutus - Brutus is a bigger dog than Juno, he is a St Bernard Pit Bull mix, big dumb oaf and really clumsy and loves picking on smaller animals but he only means to play. He is best friends with everyone in the house.<br>\r\n<br>\r\nCats<br>\r\nStar - Star is a Calico cat and a great hunter who likes to play with her prey and also happens to favor Jess most. This cat and Jess make an intimidating team against you and it's only a matter of time before that cat welcomes you to her stomach.<br>\r\n<br>\r\nHamilton - Hamilton is a fat lazy Tabby cat, surprisingly this is a cat that you may be safe around. He hardly gives Chase to something unless he's on the prowl which is still hardly ever, though he loves to eat whatever is tossed in his food bowl and scarfs anything down from his food bowl with barely any chewing. He's a real fluff ball that everyone loves to cuddle with and often sleeps on furniture or in someone's bed at night.<br>\r\n<br>\r\nLuca - Luca is a fluffy white cat and also a hunter like Star, however he goes outside often but knows where home is and loves his humans. If he's smart enough he may recognize you, or not, whatever the case you had better hope he doesn't see you as food either.<br>\r\n<br>\r\n---------------------------------------------------------------------------------------<br>\r\nThat's all I have on characters for now but feel free to add more, now for the rules, yes, there are rules in this story, but pretty simple.<br>\r\n---------------------------------------------------------------------------------------<br>\r\n- This story can go in many directions, given by the rating of the story, you should know that any interaction goes, but please keep all scat, shit, poop, whatever you call it down to a very bare minimum, along with pee and farts, I was never really a fan of that. If you're going to include that, leave a warning in all caps for scat, piss, or fart before starting the chapter.<br>\r\n<br>\r\n- All types of Vore is allowed<br>\r\n<br>\r\n- Sex is allowed<br>\r\n<br>\r\n- Death is allowed but try to make another option prior of the chapter of the character surviving in some way but don't make it a ridiculous plot that makes no sense.<br>\r\n<br>\r\n-Do not make a chain of chapters that are just options that constantly ask for this or that, yes or no, and \"other\" I've seen that too much from other stories and it is redundant and draws away from the story. I will delete all chain options if they start building up without leading into a chapter.<br>\r\n<br>\r\n- Notice how I have been saying \"Chapters\", give detailed paragraphs in a chapter with grammar and punctuation, use these \"\" signs when someone is talking, don't use ** this isn't that kind of roleplay adventure. Short chapters are OK, just don't make them too brief, at the very least have 3 paragraphs. I will delete chapters that had little effort put into grammar and descriptions.<br>\r\n<br>\r\n- Tell the story in 1st, 2nd, or third person if your chapter, I don't really care about that, we get interactive chapters mixed up all the time when it comes to that sort of thing so just type in whatever point of view you're comfortable with.<br>\r\n<br>\r\n- If your character dies that's the end, he's dead by crushing, digestion, a drop, anything that can kill someone.<br>\r\n<br>\r\n---------------------------------------------------------------------------------------<br>\r\n<br>\r\nThat's everything for now, enjoy the story and help build it up.</td>",
        "id":2198723,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1566387240,
        "modified":1566387240,
        "pretty_title":"Shrunk By A Fortune"
    }
}