{
    "chapters":{
        "1":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "Real world",
                "Fantasy world"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What story do you want?</span></div></span></div>",
            "created":1361250000,
            "id":1535313,
            "title":"What story do you want?"
        },
        "11":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "Jessica Alba",
                "Annasophia Robb",
                "Bella thorne",
                "emma watson",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who do you wnat in your story?</span></div></span></div>",
            "created":1361509200,
            "id":1537389,
            "title":"Real world"
        },
        "112":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "You started to shrink",
                "Annasophia enters",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You has always wanted to meet the beautiful actress Annasophia Robb, and today it could finally be your Chance. You had been picked to be the one who will meet her face to face. Now you was sitting in a room waiting for Annasophia to arrive.<br>\r\nThe room you was waiting in was actually Annasophia's private living room. The security guy who leaded you here was gone for about 15 minutes ago.<br>\r\n<br>\r\nWhen you started getting restless something happened.</span></div></div>",
            "created":1361595600,
            "id":1538017,
            "title":"Annasophia Robb"
        },
        "1123":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Her neighbour walked in",
                "Another fan walked in",
                "One of her staff walked in"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happened?</span></div></span></div>",
            "created":1449378000,
            "id":2071231,
            "title":"Something else"
        },
        "115":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Ariel Winter",
                "Sarah Hyland",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else?                   </span></div></span></div>",
            "created":1448082000,
            "id":2065084,
            "title":"Other"
        },
        "1153":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Maisie Williams",
                "Millie Bobby Brown",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>..........</span></div></span></div>",
            "created":1513558200,
            "id":2429419,
            "title":"Other"
        },
        "11532":{
            "author_id":"eldiablo2064",
            "author_name":"El Diablo e blanco",
            "choices":[
                "Get to it already!",
                "Other..."
            ],
            "content":"<div class=\"\"><div> <span>You awoke in a place that was foreign to you. As you stood up and took in you surroundings, you noticed that you were trapped inside of a Tupperware container that sat atop a desk in the corner of what appeared to be a teenage girls bedroom.  As you take note of this the ground begins to shake and the bedroom door opens. Standing behind the door was the beautiful teen actress Millie Bobby Brown (best known for her role as 11 in the Netflix series Stranger Things. As she entered she approached the desk and once there, looked down upon you. \"Well I'm glad to see your finally awake, I wouldn't want you to miss what I have planned\". You, upon hearing this decide to address a few concerns. \"Can you please tell me, how did I get here? Let alone at this size,\" Millie just giggles in a cute girlish manner. \" well it's actually quite simple.\" \"I brought you here myself\" she replied. \"Well what about my size?\" \"Well that is quite simple as well... I shrunk you!\" This newest devolpment created more questions than it gave answers. You stood there with your jaw dropped thinking of what move to make next, but all you could bring yourself to say was\"h..how?\" With this remark Millie plucked you out of your container with her thumb and fore finger and raised you into the air. \"In the industry, you meet a lot of people, and sometimes, it just so happens that some of those people can shrink other people.\" You started questioning everything that the papratizi had ever told you about Hollywood.(then again, you can't really trust the paparazzi to begin with.) \"well then why did you shrink me? I'm just a nobody compared to you\".\"exactly!\" She replied. \"As a \"nobody\"! No one will even care that your gone!\" You then started to question her objectives even further. \"Define gone) you say with a slight hint of fear in your voice. \"Let me tell you a story\" she replied \"once there was a man who could shrink people who happened to owe me a favor, but when he refused to help me out, I used his own abilities against him...\" \"What then?\" You nervously croak. \"Then, I swallowed him whole and digested him until he was nothing more fat on my sexy thighs and supple breasts.\" You stared horrified. \"After that, I found a new favorite snack...Tines! She laughed as she saw the fear on your face intensify. \"The way they squirm, the flavor, their desperation to cling on to life, it's all so... Delicious.\"  \"Now then, how should we do this?\"</span></div></div>",
            "created":1513972500,
            "id":2431477,
            "title":"Millie Bobby Brown"
        },
        "115321":{
            "author_id":"eldiablo2064",
            "author_name":"El Diablo e blanco",
            "choices":[
                "I sad \"ALMOST\" too cute to eat...",
                "Other..."
            ],
            "content":"<div class=\"\"><div> <span>She then proceeded to open her gigantic maw right before you and lick you all over. Her tongue grazed every part of your body. \"Mmmm... You'll make a great snack\" she says before continuing to lick you, more vigorously now. \"Please don't eat me! I don't wanna die!\"you pleaded \"you know that's what they all say, right?\" She says as she tilts her head back, parts her lips, and holds you over the moist cavern that is her mouth. \"Bye bye little one\" she coos before releasing her grip and letting you fall directly into her gaping maw. You land on her soft, massive tongue, which grabs you and begins to feel you all over. You are pushed up against the roof of her mouth and forced to swallow her saliva mouthful by mouthful. You hear a pleasurable moan arise from the deapths of her throat. As you hear this you realize that she is wrapping her tongue around your member who must have been aroused by these events. As the licking intensifies, you can't help yourself and you burst your load all over the inside of your moth. With this, she spits you out into the palm of her hand. She swallows and traces the bulge in her throat all the way down. \"That was really yummy\" she said seductivley. \"You are very cute, almost too cute to eat...\"</span></div></div>",
            "created":1513982880,
            "id":2431519,
            "title":"Get to it already!"
        },
        "1153211":{
            "author_id":"eldiablo2064",
            "author_name":"El Diablo e blanco",
            "choices":[
                "She feels bad and gets you out",
                "You are digested"
            ],
            "content":"<div class=\"\"><div> <span>\"I would keep you, but I've already had the appetizer, and I think that I'm ready for the meal.\" With this, she holds out her palm and wraps her lips around you, sucking you back into her mouth. This time you found yourself stuck in a pool of saliva that was gathering in the back of the mouth. You tried to reach the uvula but before you could reach it A loud *GULP* could be heard. you were push downward through a long, fleshy pink tunnel that squeezed you tightly as you descended. Finally you fell and splashed into a large pool of burning liquid. \"Enjoy your stay, cause it won't be long\" you heard her say from above as you sat there and excepted your fate.</span></div></div>",
            "created":1513983540,
            "id":2431525,
            "title":"I sad \"ALMOST\" too cute to eat..."
        },
        "11532112":{
            "author_id":"eldiablo2064",
            "author_name":"El Diablo e blanco",
            "content":"<div class=\"\"><div> <span>The next day Millie inspects her body in the mirror.  She notes that her breasts have gone up a few sizes and that the curve of her hips is much more noticeable. She then chuckles as she thinks about the tiny shh devoured the day prior. \"As far as they go, that really was a good snack.\"</span></div></div>",
            "created":1513983840,
            "id":2431528,
            "title":"You are digested"
        },
        "12":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "The Legend Of Zelda",
                "Resident Evil",
                "W.I.T.C.H.",
                "Teen Titans",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what world would you like to be in?</span></div></span></div>",
            "created":1361250000,
            "id":1535315,
            "title":"Fantasy world"
        },
        "121":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "Zelda/Tetra",
                "Midna",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is the main character?</span></div></span></div>",
            "created":1361250000,
            "id":1535316,
            "title":"The Legend Of Zelda"
        },
        "1211":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "Zelda",
                "Tetra"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What form should Zelda have?</span></div></span></div>",
            "created":1361250000,
            "id":1535324,
            "title":"Zelda/Tetra"
        },
        "12112":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "They arrive at an island",
                "The ship stopps at the middle of the sea"
            ],
            "content":"<div class=\"\"><div> <span>Our story takes place after the defeat of Ganondorf in the windwaker game.<br>\r\n<br>\r\nTetra and Link was out on the open sea with their crew and their ship.<br>\r\n<br>\r\nLink was just waking up after a good sleep. He walks up on deck to find Tetra. He knew that Tetra was some kind of busy trying to find some sort of treasure, but the strange thing was that she did not want to tell anybody what it exactly was.<br>\r\n<br>\r\n<br>\r\nLink found Tetra at the ship's rudder. She was standing cross armed next to the crew member steering the ship.<br>\r\n<br>\r\n\"So where are we headed?\" Link asks.<br>\r\n\"I have already told you, you see it when we come there\" She said like she had said before.<br>\r\nLink was hoping that they soon was at the right place because they had being sailing for quite a long time now.</span></div></div>",
            "created":1361250000,
            "id":1535332,
            "title":"Tetra"
        },
        "121121":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "\"Going in to the jungle\"",
                "\"Following the beach\""
            ],
            "content":"<div class=\"\"><div> <span>The ship had finally stopped.<br>\r\nLink goes up on deck to see where they had stopped.<br>\r\nHe saw that they had stopped right in front of a large island. End of the island there was a beach and behind there was a jungle and over again there were mountains.<br>\r\n<br>\r\n\"You are coming with me Link\" Tetra said as she walked towards the lifeboat. Link joined Tetra in the boat and he started do lower the boat in the water. The crew members was left to guard the ship.<br>\r\nLink started to row the small boat towards the beach.<br>\r\n<br>\r\nWhen they got their feet on the beach Tetra moved closer to the jungle entrance while Link drew the boat onto the sand.<br>\r\nTetra waves Link over to her. Link moves closer to Tetra as she says: We are</span></div></div>",
            "created":1361250000,
            "id":1535350,
            "title":"They arrive at an island"
        },
        "1211211":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "A trap!",
                "Nothing happens"
            ],
            "content":"<div class=\"\"><div> <span>As they entered the jungle Tetra was walking first while reading a treasure map. Link was right behind here and was looking out for any threats that could be in the jungle.<br>\r\nStrange enough they walked through the jungle without any encounters with any animal nor monsters.<br>\r\n<br>\r\nThey had walked for a little while when Link was unaware of where he was walking and suddenly dumps into Tetra's back. \"Hey watch it!\" Tetra says. \"Look up\" She says as She points up at a small stone temple on the top of a hill. \"This is the right place\" Tetra says with an exited voice. Tetra started to run up the hill towards the temple with Link following right behind her.<br>\r\nAs they approach the entrance witch had no doors, Tetra started walking slowly inside carefully watching for traps.<br>\r\nLink was walking straight inside not aware for traps. He suddenly hears a click under his foot as he stops. \"Oops\"<br>\r\n<br>\r\nWhat happens?</span></div></div>",
            "created":1361509200,
            "id":1537388,
            "title":"\"Going in to the jungle\""
        },
        "12112111":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "Tetra shrink Link",
                "Link is teleported"
            ],
            "content":"<div class=\"\"><div> <span>Fast the stone on the floor Link was standing on was drooped down and Link started falling. Tetra quickly grabbed Link's arm and held him while he was dangling in the hole on the ground. Even if Tetra was a girl she managed to pull Link up to safety. \"Be care full Link\" she says as she tried to regain her breath. \"Thanks\" Link says as he stands up.<br>\r\n<br>\r\nIn the end of the room there was a table. Link and Tetra was walking over to it. When they was right in front of the table there was something on it. It was a green gem of some kind.<br>\r\nTetra picked up the gem from the table. \"Yes finally it is mine\" She says with an more evil voice than normal. \"What is it exactly\" Link asks. \"Oh.. I will show you exactly what this is\" Tetra says whit the same evil voice.</span></div></div>",
            "created":1361595600,
            "id":1538022,
            "title":"A trap!"
        },
        "121121112":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "Tetra is comming",
                "Something happens"
            ],
            "content":"<div class=\"\"><div> <span>Tetra holds the gem in front of Link. Everything is getting blurry and Link pass out.<br>\r\n<br>\r\nWhen Link wakes up he quickly get up on hes feet. Something was very strange. He was not in the temple anymore but he was in his own house. Tetra was nowhere to be found either. How could this be possible? Link is not sure if everything was a dream or not. He started to walk out of his house and find out what was going on.<br>\r\nRight outside his house he saw his sister Aryll. He walked over to her. Aryll looked at Link as he approached her. \"Link? are you home from the adventure with the pirates already?\" Aryll asks Link. At that moment Link realized that it was not a dream bu he had somehow been teleported, but why?</span></div></div>",
            "created":1361595600,
            "id":1538090,
            "title":"Link is teleported"
        },
        "1211211121":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "They do not fall",
                "Link looses his sister's hand"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly they hear something in the water a bit away from the island. What they saw was a giant Tetra rising up from the water. She started to walk to the island.<br>\r\nLink was not sure what was going on but he pulled his sister hand and started to run to the bridge in the middle of the island.<br>\r\n<br>\r\nSuddenly Link hear the ground shake as Tetra was moving on the island. He saw behind him that Tetra was already standing right over his house. Tetra slowly lifted her feet over his house and smashed his house like it was nothing. He now knew that he has to get away from her.<br>\r\nLink decided that they had to hide on the top of the mountain in the Forest of Fairies. Tetra was big but she was not big enough to get on top of the mountain.<br>\r\n<br>\r\nLink and Aryll was running up the road to the mountain. They could see that houses and people was being crushed by Tetra when she stepped on them. They now only had to run as fast as they could over the bridge and they would probably be in safety for now.<br>\r\n<br>\r\nWhen they was on the middle of the bridge Link suddenly sees Tetra right under the bridge looking up and them while smiling. Tetra rises her hand and crushes the bridge on the side of the forest. The bridge start falling. Link quickly throws his grappling hook and hits a branch.</span></div></div>",
            "created":1361595600,
            "id":1538108,
            "title":"Tetra is comming"
        },
        "12112111211":{
            "choices":[
                "Aryll gave herself to Tetra",
                "They both backed away from Tetra"
            ],
            "content":"<div class=\"\"><div> <span>While still holding onto his sister, Link swung to the other side. Both of them made a pretty rough landing. However, they knew they weren't safe yet. Tetra was going to climb up, so they needed to hide. They ran into the dense forest as Tetra's hand got to the top. Tetra climbed to the top and looked for her toys. This was the most fun she ever had.<br>\r\n<br>\r\nLink and Aryll ran through the forest, hearing loud noises behind them. Before they knew it, Tetra stepped over them and was now in front of them. They turned to run the other way, only to find that a tree had fallen and blocked the exit. They were cornered and Tetra knew it.<br>\r\n<br>\r\n\"Just give up and come to me. I won't hurt you as much if you step forward.\" Tetra said, giggling. Link and Aryll weren't sure what to do.</span></div></div>",
            "created":1496725200,
            "id":2332004,
            "title":"Cornered"
        },
        "121121112111":{
            "choices":[
                "Link was still in front of her, not wanting to get closer",
                "Link had disappeared somewhere in the forest"
            ],
            "content":"<div class=\"\"><div> <span>Aryll couldn't see any way out of the situation. She decided if she was going to die, she might as well be willing. She hugged Link once more and stepped towards the giantess. Link couldn't believe what he was seeing. Tetra smiled and let Aryll walk on her hand. Aryll was lifted up to the giant face.<br>\r\n<br>\r\n\"Good choice. Might I ask why you are going willingly?\" Tetra asked.<br>\r\n<br>\r\n\"Well, there was only one option, and you said you would hurt us less if we went willingly.\" Aryll said. Tetra nodded.<br>\r\n<br>\r\n\"Close your eyes. It will all be over soon.\" Tetra said. Aryll did as she was told. Tetra slid her onto her tongue and closed her mouth. Being careful, Tetra swallowed Aryll and rubbed her belly. \"You tasted really good, don't worry, your brother will join you soon.\" Tetra looked up, expecting a scared Link.</span></div></div>",
            "created":1496810880,
            "id":2332360,
            "title":"Aryll goes Willing"
        },
        "12112111212":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "Link is shrunk by Tetra",
                "Tetra start to grow"
            ],
            "content":"<div class=\"\"><div> <span>Link tried to grab his sister's hand but it was to late. Link saw that his sister was falling down toward Tetra. Link was tossed into the stone wall. He looked down and saw his sister in Tetras hand. Did Tetra save her? Link started to climb uå and get on his feet. He then looked down at Tetra and his sister. Tetra then suddenly out of nowhere crushed Aryll in her hand. Link screamed \"NOO!\" Tetra looked up at Link again as she said \"I'm gonna get you.\"<br>\r\nLink ran into the forest to hide from Tetra. He had no other options. Link sat down on his knees. He could not understand why Tetra was doing this things.<br>\r\n<br>\r\nSuddenly Link hears someone breathing right behind him. He get up and turn around to see Tetra in her normal size. \"Tetra\" Link says confused. \"I said I'm gonna get you\" she says.</span></div></div>",
            "created":1361595600,
            "id":1538128,
            "title":"Link looses his sister's hand"
        },
        "121121112121":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "Tetra want to eat Link",
                "Tetra want to play with Link"
            ],
            "content":"<div class=\"\"><div> <span>Link rises his sword over his head and strikes his sword right towards Tetra. Link feel the sword hit but it is not Tetra it hits, the sword hit the ground. \"Huh?\" Link looks up.<br>\r\nRight in front of him where two gigantic feet. He looked more up and he could see a titanic Tetra watching down at him. He had been Shrunk by Tetra down to an inch tall.<br>\r\n<br>\r\nTetra bend down and pick him up with her thumb and forefinger. \"How do you like being so tiny Link\" she asks him with a play full voice. \"Let me go\" Link yells. \"I don't think so, you see i am going to have some fun with you.\" Tetra said whit a grin on her face. \"I don't think you need that gear nor clothes you are wearing\" She says as she starts to undress Link. She tossed all of his equipments and clothes away. Link was now completely naked in Tetras hand. Link was completely helpless now.</span></div></div>",
            "created":1361595600,
            "id":1538132,
            "title":"Link is shrunk by Tetra"
        },
        "1211211121211":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "Link is swallowed",
                "Tetra play some more with Link"
            ],
            "content":"<div class=\"\"><div> <span>Tetra slowly started to raise Link over her head. She tilted her head back. \"Wha.. What are you doing Links screams as Tetra was licking her lips.\" Tetra answered \"I am going to swallow you whole!\" As that was said she started to slowly open her mouth and lower Link towards her waiting mouth.<br>\r\n<br>\r\nLink Started kick her tongue and yell at her to let him go but Tetra did not listen and released him so he landed with a splash on her saliva covered tongue.</span></div></div>",
            "created":1361595600,
            "id":1538137,
            "title":"Tetra want to eat Link"
        },
        "12112111212111":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "Link is trapped inside her stomach",
                "Link find a way to get out"
            ],
            "content":"<div class=\"\"><div> <span>Tetra started to move Link to the back of her throat and tilt her head slowly back. Link was screaming at her to not eat him while he slides down towards her throat. Tetra did not swallow him yet. She held her head tilted back so saliva filled up in her throat. Link was stuck in her throat and he could fell the saliva dripping down on him as it was filling up around his naked body.<br>\r\n<br>\r\nTetra placed her hand on her throat and then let out a loud gulp as she swallowed Link whole. She traced his small body down her throat until she felt Link fall into her stomach.<br>\r\nTetra pats her belly and tells Link what a tasty treat he was.</span></div></div>",
            "created":1361595600,
            "id":1538138,
            "title":"Link is swallowed"
        },
        "1211211122":{
            "choices":[
                "Didn't find anyone",
                "Found someone"
            ],
            "content":"<div class=\"\"><div> <span>The whole place started to rumble. Link and Aryll ran outside and looked up. Link couldn't believe what he saw. Tetra was looking down at them. However, the sky wasn't normal either. Link quickly looked at the landscape behind Tetra. He could see giant walls and a giant ceiling, all made out of wood. Could it have been possible that Tetra shrunk the whole island? Link didn't want to believe it, but he couldn't deny that Tetra was gigantic in front of him.<br>\r\n<br>\r\n\"How do you like your new size? This will be your new home, until I get bored with the two of you.\" Tetra said. Aryll ran to the beach. Although the water was still there, the whole place was inside a giant bowl.<br>\r\n<br>\r\n\"Did you shrink our island?\" Aryll asked. Link ran up to her and held her close. Tetra laughed.<br>\r\n<br>\r\n\"Of course not silly. Everyone would notice the change. I just used the jewel I found to make a replica. It scanned Link's memories and made a copy based on them. I did go to Outset to capture you Aryll. You were too cute to pass up. How about we play a game?\" Link was worried, however, he didn't see any way out of this. Right now, Tetra was much stronger than Gannon, and possibly the Triforce.<br>\r\n<br>\r\n\"What game?\" Link asked.<br>\r\n<br>\r\n\"Hide and seek. I will leave for ten minutes. Both of you will run around on your island and try to find somewhere to hide. You can hide anywhere as long as you don't leave the bowl. If I find one of you, I shall use you however I like. Start hiding.\" Tetra said and got up. When she stood up, she looked to be as tall as the tower of gods. As soon as she was gone, Aryll and Link decided to hide in separate locations.<br>\r\n<br>\r\nLink told Aryll to hide in the space under their house. There was a good chance Tetra didn't know about it since it was based off of Link's memories, not hers. Aryll crawled in and stayed quiet. Link ran all the way up to the forest. He ran and hid in the Great fairy's fountain. Link thought it would be a good spot since it wasn't an obvious spot. When he got in, there wasn't any life forms inside. Maybe the jewel couldn't copy life forms, that would explain why Tetra had to go get Aryll. Tetra came back, ready to find her toys. She studied the island carefully, making sure to not miss a spot. After about 5 minutes, Tetra . . .</span></div></div>",
            "created":1496790120,
            "id":2332219,
            "title":"Hide and seek with the giant pirate"
        },
        "1211212":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "She immediately grows ",
                "She waits for the perfect moment"
            ],
            "content":"<div class=\"\"><div> <span>The two walked alongside the path of this new undiscovered island Link looked confusingly at the young leader of pirates <br>\r\n<br>\r\n\"Er why did you bring me here Tetra?\" He asked curiously she grinned mischievously <br>\r\n<br>\r\n\"Oh you'll see Link in just a bit....uh oh\" As she saw a group of Bogokins(A smaller version of Moblins in the Zelda games) wandering around a few of them saw the two and predictably they made a direct beeline but in vain as Link's magical sword made short work of the creatures Tetra looked highly impressed <br>\r\n<br>\r\n\"Very good Link! You're my hero!\" \"And soon to be my lunch!\" She thought savagely but fortunately the hero heard every word <br>\r\n<br>\r\n\"Huh? What was that Tetra?\" He asked curiously wondering if he heard right she grinned even more sheepishly <br>\r\n<br>\r\n\"Whoops! Looks like he's on to me! Oh well he's still make the perfect snack.....\" As she really didn't care if Link knew she had somehow developed the ability to change size and was incredibly hungry for heroes.....</span></div></div>",
            "created":1497404400,
            "id":2335441,
            "title":"\"Following the beach\""
        },
        "1212":{
            "choices":[
                "Link shrunk down",
                "Midna grew much bigger",
                "Midna was giant and still in her imp form"
            ],
            "content":"<div class=\"\"><div> <span>It had been two months since Gannon had been defeated. During that time, Link searched for a way to see Midna again. He looked everywhere and researched anything he could. However, attempts seemed futile. He was just about to lose hope when the great fairy appeared before him.<br>\r\n<br>\r\n\"Do you wish to see your friend again?\" Link nodded. \"With my power, I can make her return. However, things won't be the same as before. Do you still wish to proceed?\" She asked. Link nodded, he really wanted to be with Midna. \"Very well. I wish you good luck.\" She said and made a bright light appear. When Link became conscious again, he heard a familiar voice.<br>\r\n<br>\r\n\"Well it's about time you woke up.\" Within a second, Link recognized it as Midna. He sat up and looked around to find her. However, when he saw her, there was a problem.</span></div></div>",
            "created":1496753160,
            "id":2332007,
            "title":"Midna returning to the light world"
        },
        "12121":{
            "choices":[
                "Licked him between his legs",
                "Sat down and tickled him"
            ],
            "content":"<div class=\"\"><div> <span>He saw that they were in his house, but Midna was much larger than him. He was currently on the table in his underwear. Midna giggled at the embarrassed Link. She smiled at him, knowing what she wanted to do, something Link could never guess.<br>\r\n<br>\r\n\"How does it feel to see me again? I bet you missed me riding on your back.\" She said. Midna walked over and picked him up. \"The great fairy explained everything to me. I promise that you will be with me forever. How about we have some fun? Your new size is very interesting to me.\" She said. Link nodded and waited for instructions. Midna . . .</span></div></div>",
            "created":1497555480,
            "id":2336580,
            "title":"In Midna's giant hand"
        },
        "1213":{
            "author_id":"swiftgale",
            "author_name":"The Swift Gale",
            "choices":[
                "Malon/ Impa",
                "Saria/ Nabooru"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about one of the oot girls?</span></div></span></div>",
            "created":1447563600,
            "id":2062524,
            "title":"Other"
        },
        "12131":{
            "choices":[
                "Malon",
                "Impa"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it Malon or Impa?</span></div></span></div>",
            "created":1496790240,
            "id":2332221,
            "title":"The farmer or the sheikah"
        },
        "12132":{
            "choices":[
                "Saria",
                "Nabooru"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it Saria or Nabooru?</span></div></span></div>",
            "created":1496787480,
            "id":2332195,
            "title":"The Kokiri or the Gerudo"
        },
        "121321":{
            "choices":[
                "Saria started to grow",
                "Link turned into an adult and shrunk"
            ],
            "content":"<div class=\"\"><div> <span>After Link had defeated Gannon, Zelda told him to return to his own time and experience the years he missed. When he did, Navi flew away, leaving him feeling a little lonely. He returned to the Kokiri forest. He was greeted by all of his friends, including Saria. Things went back to the way they were before he left on that journey.<br>\r\n<br>\r\nIt had been one year since he returned. Link was in his bed one beautiful night, thinking about his friends. He missed them, especially Navi. He was just glad everyone was safe. Suddenly, he felt a hand on his shoulder. He rolled over to see Saria smiling at him. She told him to get out of bed and follow her. Link did as he was told, stretching his arms out. She took him all the way to the sacred meadow. He made sure to defend her on the way from the deku scrubs.<br>\r\n<br>\r\nSaria had Link sit on the stump. He wasn't sure what she was planning, but he was excited.<br>\r\n<br>\r\n\"Do you remember, . . . . One year ago . . . I taught you my song. You told me what I did in the future. I knew this place would be important for both of us one day.\" She said. Link loved to think about those memories. \"You left me though. I want to make sure you stay with me this time.\" Link was a little confused. Then, without warning, Saria pulled out her Ocarina. She played a mysterious song, one that Link never heard before. Suddenly . . .</span></div></div>",
            "created":1496788620,
            "id":2332206,
            "title":"Old friends together"
        },
        "123":{
            "author_id":"kronwolf",
            "author_name":"kronwolf",
            "choices":[
                "You wake up shrunk",
                "You are teleported to Meridian",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>It was late and dark outside when you was home. You was just about to go to sleep when there was a knock on the door. You go to the door but there was nobody to be seen.<br>\r\nYou was about to close the door when you notice a small blue round shaped stone on the ground. You pick it up and closed the door as you take it to you living room.<br>\r\n<br>\r\nYou take a closer look at it as it suddenly shines from it and you feel strange and you pass out.</span></div></div>",
            "created":1361595600,
            "id":1538010,
            "title":"W.I.T.C.H."
        },
        "124":{
            "choices":[
                "Starfire",
                "Raven",
                "Both Starfire and Raven"
            ],
            "content":"<div class=\"\"><div> <span>You were a nice person with a lot of friends. You got really good grades and were involved in a lot of activities. One night, you were walking in the streets, happy as can be. Suddenly, someone rammed into you, causing both of you to fall down. You open your eyes to see a woman wearing black. She was carrying a bag of money. When you saw that, you tried to stop her. The two of you started to get into a really big fight, until a bright light appeared.<br>\r\n<br>\r\nWhen you woke up, your head was dizzy. You looked around to see that you were in a bedroom. However, something was off, everything was huge. You were in a bottle on a table. As you tried to figure out what happened, you suddenly heard a scream coming from the other room.<br>\r\n<br>\r\n\"Mm, she was tasty! I wonder how the other snack is doing.\" You heard a voice said. You recognized it pretty well. The door opened revealing . . .</span></div></div>",
            "created":1496853240,
            "id":2332545,
            "title":"Civilians shouldn't stop crimes"
        },
        "1241":{
            "choices":[
                "Licking you",
                "Sucking on your head",
                "Chasing you around the room"
            ],
            "content":"<div class=\"\"><div> <span>She leaned against the opening when she saw you were awake. She smiled and licked her lips. Her eyes showed mischievous thoughts.<br>\r\n<br>\r\n\"So you're awake then? Perfect, I was hoping you would. I want to have fun with you.\" She started to slowly move closer. You looked at her belly to see something was pushing on it, from the inside.<br>\r\n<br>\r\n\"I know what you did, and what you are going to do. You ate her, and now you're going to devour me.\" You said. She stopped and laughed.<br>\r\n<br>\r\n\"Well I guess you aren't as dumb as you look. Yes, she's in my belly. Before I eat you, I want to have fun. I'm going to tease you, and make you think about your fate. If you play along, maybe you'll have fun too.\" She got closer to your bottle until she was next to it. She lowered herself until you were at mouth level. Starfire opened her mouth and put it to the glass. You were forced to watch her lick the walls. Soon, the tongue would be on you, and you would be going down into that dark cave.<br>\r\n<br>\r\n\"Just end it already!\" You demanded, you didn't want to be here, you just wanted her to finish it. She laughed and stood up. She pulled to bottle to her belly.<br>\r\n<br>\r\n\"Oh, is this where you want to be? Eager to dive in, aren't we? Don't worry, you'll get access, but I get to do whatever I want to you first. It's good though to see you wanting to be my meal.\" She pulled you out and dangled you. \"Are you ready? I'm going to tease you. I'll start by . . . </span></div></div>",
            "created":1497971640,
            "id":2339427,
            "title":"Refusing to end it quickly"
        },
        "125":{
            "author_id":"kan101",
            "author_name":"Neo Space",
            "choices":[
                "Winx Club....",
                "Ben 10.....",
                "Other......"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about........</span></div></span></div>",
            "created":1361336400,
            "id":1535897,
            "title":"Other"
        },
        "1253":{
            "author_id":"kan101",
            "author_name":"Neo Space",
            "choices":[
                "one of the Sly Cooper games(Carmelita Fox or Neyla)",
                "Devil May Cry(Trish,Lady, or Kat)",
                "No other...."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok how bout.</span></div></span></div>",
            "created":1361682000,
            "id":1538952,
            "title":"Other......"
        },
        "12533":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yuna (FFX)",
                "Rikku (FFX)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else?        </span></div></span></div>",
            "created":1448082000,
            "id":2065088,
            "title":"No other...."
        }
    },
    "info":{
        "author_id":"kronwolf",
        "author_name":"kronwolf",
        "brief_description":"Giantess vore story for vore and giantess fan",
        "created":1361293560,
        "description":"<td align=\"left\" class=\"norm\">Giantess vore story for vore and giantess fan<br>\r\n<br>\r\nThis is my very first official story<br>\r\n<br>\r\n<br>\r\nNot allowed:<br>\r\n<br>\r\nHard vore<br>\r\nGiant male<br>\r\nGay<br>\r\nToilet stuff<br>\r\n<br>\r\nThis is a giantess vore story so keep it that way.<br>\r\n<br>\r\n<br>\r\nPlease feel free to add</td>",
        "id":1920263,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1513983840,
        "modified":1513983840,
        "pretty_title":"Giantess Vore"
    }
}