{
    "chapters":{
        "1":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "The Berry Shop Stories"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Here are some things. These will be largely empty for the time being until we get more out.<br>\r\n<br>\r\n- The Berry Shop Stories<br>\r\n<br>\r\n- N/A<br>\r\n<br>\r\n- N/A<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n(There will likely be more stories available at a distant time).</div></font></span></span></div></div>",
            "created":1554181200,
            "id":2639036,
            "title":"The Most Boring Part of Any Interactive"
        },
        "11":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "\"Stalker\""
            ],
            "content":"<div class=\"\"><div> <span><span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          <br>\r\n\"Stalker\"<br>\r\nA story about a Charizard and his roommate, Umbreon.<br>\r\n<i>Contains: Cock Vore, Oral Vore, Male/Male.</i><br>\r\n<br>\r\n(In progress).<br>\r\n<br>\r\nN/A<br>\r\n<br>\r\n</div></font></span></span></div></div>",
            "created":1554181200,
            "id":2639038,
            "title":"The Berry Shop"
        },
        "111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Continue."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Initial by Twines</i></div><br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          What had happened was Charizard had seen Umbreon being harassed at a Pokémon Café. He had taken Umbreon’s side in hopes that a petty confrontation could settle without much disturbance. Once, just once he intervened, and there lay a long-lasting friendship for years. Umbreon had settled close to Charizard, deeming him as his best friend, and, frankly, only one. The only one around, anyway. The rest of his friends seemed to have faded out of his memory. Umbreon’s old friends, not from grief, or anger, but simply a memory of when he was an Eevee. Charizard and Umbreon had been sharing a room for some time now, at least a year.<br>\r\n          Charizard however didn’t find himself in the same boat. Umbreon was his only friend, his first and ever. His compulsive unnerving from not being around Umbreon edged him want to be there whenever Umbreon needed something. Charizard would be right behind him, and above, a towering dragon with his large frame and threatening posture. When he entered the room, it was made apparent that Charizard would seriously maim you if you as much as pinched Umbreon. Whether or not he was the reason for Umbreon not making too many friends was never up for debate. His little friend always looked to be talking with someone, given that someone would likely be glancing at Charizard every once in a while, because sure enough Charizard would be doing the same.<br>\r\n          Despite Umbreon’s best efforts, he could not seem to anger Charizard unless it was entirely indirect. Part of Umbreon believed that even if he bit Charizard’s tail that the dragon, instead of turning around and flaming the dark-type, would try to ram into the Pokémon sitting across the room. The only thing about Charizard that made Umbreon feel off was if someone had been particularly rude to him, for some reason they would not be seen again. It wasn’t as if Umbreon really wanted to see them again anyway, but just that it was awkward to stumble upon Charizard shortly after, when the dragon was obviously trying to hide something. Namely a bulge.<br>\r\n<br>\r\n          Umbreon was sure a looker. Charizard craved for anything from that dark-type. A nudge… a brush against his flesh… a gentle grope— or a rub… a swipe of Umbreon’s tongue… he longed to feel his little friend. At times where Umbreon and Charizard had separate places to be, Umbreon at the Berry Center or Charizard at his own job, Charizard’s brain was always on the Pokémon he had helped so long ago. Else, Charizard would be off in the distance, eyes twitching with lust, the rising pit of pleasure rising from his gut, the wondrous sensation he imagined it would be to finally get Umbreon’s red-faced, half-groggy returned stare while laying on soft sheets of their shared room. He always wondered if Umbreon felt the same way— he’d not asked— but he hoped from the slight rosiness from Umbreon’s cheeks when he was near that his presence did turn something on in the Umbreon.<br>\r\n          Charizard was lucky enough to get his massive body in the room Umbreon slept without making noise, save for the flickering of his tail. He loved to tease himself by placing his tapered penis close to Umbreon’s face or rear when either were visible without covers. Charizard would grow hungry though, and go out, finding something to eat… or someone if he was really turned on that night… yet, his balls did ache more often than he wanted too. Charizard could always empty them, but filling them? <br>\r\n          Umbreon woke up one morning with a slight twitch to his nose, Charizard’s gut dropped when he realized it was his own pre, but the moonlight Pokémon never noticed because of early-morning drowsiness, and proceeded to wash up in the shower. Days after it became an issue. Charizard unintentionally left more and more on the Umbreon every night, causing the dark-type to scratch his body more often than usual. Charizard wondered if Umbreon ever thought of it. Did Umbreon just shrug it off as it just being Charizard’s scent rubbing off on him? It’s been happening for the past two weeks, up to now.<br>\r\n<br>\r\n          The duo were walking together into their home. They had gotten to split the rent by a one in a million chance, and it was the best thing to happen to both of them in the past year. The house was only a block away, and Charizard had been on edge that whole two mile trek from Umbreon’s workplace and the house, dreading over Umbreon’s possible reactions to his request— Charizard’s request to mate. He planned on asking Umbreon when they were settled inside… but his nervous sweating didn’t help at all when Umbreon was occasionally glancing up at him.</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554267600,
            "id":2639041,
            "title":"\"Stalker\""
        },
        "1111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Charizard is Worried.",
                "Charizard is Optimistic."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          While Umbreon was known to be quite oblivious to those around him, Charizard's nervousness did not go unnoticed by him. It was quite clear he had something on his mind, but he dare not ask. He never was the one to coax others to express their bottled up emotion, even if it was his closest friend, though Umbreon had to admit, Charizard's nervousness was definitely beginning to take a toll on him. Nothing like a nervous, sweating, fire dragon eight times your size to leave one feeling uneasy regardless of how close of friends they were. <br>\r\n          Umbreon let loose a long yawn as he stretched, the cool feeling of the wooden flooring greeting his sore paws with a welcoming chill after the long walk, before heading off towards the bedroom the two mons shared. He leaped into the massive bed with a <i>fwumph</i>, purring aloud as he felt himself sink into the cool blankets—a small pleasure in life he would never get tired of. <br>\r\n          As Umbreon let the soft blankets embrace him, he began to ponder over the journey back home with Charizard. What could he possibly have on his mind that had him so nervous? He did not dwell on it for long though as he was reminded of something quite important he felt he needed to address. <br>\r\n          \"Hey Charizard I forgot to mention we have a new co-worker up at the Berry Center! I hope you don't mind but I invited them to come over this evening so we could get to know each other!\" He yelled so as to be sure Charizard heard, one ear cocked as he waited for a reply.</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554267600,
            "id":2639043,
            "title":"Umbreon's Perspective"
        },
        "11111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "They Wait for Umbreon",
                "Charizard Comforts Flare"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Charizard's heart dropped— he had not gained the courage to ask Umbreon while walking home, and now— this? <br>\r\n          \"That's, nice,\" Charizard choked. He spun around slowly in the kitchen, his eyes darting at the cabinets and drawers and such without pause. What was he going to do? His eye twitched slightly until he closed them and looked down. Charizard then shook his head in small, rapid successions to clear his thoughts.<br>\r\n          <i>I've got to think of something</i>, Charizard thought. <i>I mean, how bad could it be? I'm just trying to get in with Umbreon... but then who's the new co-worker?</i> It was typical of Umbreon to bring in new people to meet every so often. Charizard cocked his head in annoyance. <i>Oh come on! Why tonight?!</i><br>\r\n          Mustering up the courage he'd not had the whole day, Charizard called back to Umbreon. \"What's their name? What kind of Pokémon are they?\" Charizard rubbed his head and began to breathe slowly to calm himself.</div></font></span><br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Bree sat up, a new set of tasks at hand now that he remembered he would be having company over later in the day. <br>\r\n          \"His real name is Tai, but I've been calling him Flare as he's not very fond of his birth name—\" he spoke as he made his way to the large walk in shower before turning on the water, raising his voice so his roommate could hear him over the spray of running water. \"He's a Flareon who started working with us about a week or two ago. His main job is to collect weeds and burn them so we can use the ashes for compost,\" Umbreon proceeded filling Charizard in about his new fellow employee as he groomed himself under the running water.<br>\r\n          \"He is incredibly shy, as well as new to the area, so he does not know a whole lot of other Pokémon, so try not to scare him to bad if you answer the door,\" he joked as he continued to clean himself.</div></font></span><br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          “Flare?” Charizard repeated under his breath. “<i>A fire-type… unique name… a Flareon— another Eevee Pokémon…</i>” Charizard racked his brain thinking about what to do. This had been <i>the</i> night, this was <i>his</i> night, he wanted <i>Umbreon</i> for <i>himself</i>. He clenched his claws. <br>\r\n          Charizard was angry, yet his heart dropped, who was he angry at? Umbreon? How could he— how dare he— be angry at his friend? The dragon swept into the living room and slowed himself to a stop at the couch. <br>\r\n          It was a large enough couch for both an Umbreon and a Charizard to sit together. More like two Charizards, but that’s besides the point. Now it would be for a third Pokémon for that night. Charizard placed his claw along the line of the soft couch and traced the edge until his claw drifted into the air. He gagged internally, then inhaled one last time, very slowly. <br>\r\n          “I’ll try not to,” Charizard finally called back. <br>\r\n          “Well that was a bit long for a response, wasn’t it?” Umbreon called. The sprinkling of the shower against both the Pokémon’s fur and the shower walls reached out to Charizard. The dragon twitched again.<br>\r\n          “Was looking outside,” he lied. Charizard did decide to approach the window though. He craned his neck to peek outside. <br>\r\n<br>\r\n          Minutes later, wouldn’t you know it— Umbreon’s new co-worker ‘Flare’ was timidly padding up the sidewalk. The faint orange fur contrast with the growing darkness outside, Flare had approached the door before Charizard had time to think of what to say. <br>\r\n          Luck was on his side though, and Umbreon was too far away in another room to hear everything. Charizard quickly dashed away from the window and stood behind the door.  For Umbreon’s sake, he needed to be collected for this new ‘friend’.<br>\r\n          A knock on the door signaled for Charizard to grasp the handle and allow entrance. As the door was side open, Charizard was able to take in the appearance of the Flareon. Flare flinched at the near immediate reaction to his presence at the house, and his face almost seemed shocked to find a large, orange dragon instead of a small, black Umbreon.<br>\r\n<br>\r\n          Flare opened his mouth to speak…</div></font></span><br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          But nothing came out, instead Flare just stood there, eyes wide, frozen in place, not sure what to say. Flare, unlike the Umbreon he had been working with for the past week or so, found it difficult to interact with others aside from the occasional greeting when he happened to run across guests that insisted they pick their own berries instead of letting staff do it. The Umbreon made it seem so <i>easy</i>. Maybe that's way he did not find it hard to talk to him. <br>\r\n          \"H-h-hello!\" Flare blurted out due to his nervousness, only making things even more awkward for him. <i>Oh my god it would have helped if Bree would have mentioned he had a Charizard as a roommate of all things!</i> He internally screamed. <i>He knows good and well I don't do good around new mon! Maybe he gave me the wrong address!? I know he's oblivious but damn!</i><br>\r\n          \"Are—are you... is this where Bree lives?\" Flare stuttered. trying desperately to form words into a coherent sentence. Already he could feel the blood rushing from his body as he began to get cold feet. He could feel his world getting smaller with every passing second he stood before this giant among Pokémon as he tried to maintain eye contact, but finding himself unable to. <i>Damn it! Why did I have to be born with such a timid nature!</i><br>\r\n          Deep down he truly wished he was just given the wrong address. He was not sure he could handle this prolonged feeling of awkwardness for very long as he stiffened up.</div></font></span><br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          “Umbreon’s here, yes,” Charizard stated. The Flareon stared at the dragon's feet, unable to look him directly in the eye. “You're Flare, right?”<br>\r\n          “Y— yeah.”<br>\r\n          “So you're the coworker he was talking about,” Charizard said with discovery, Flare became tense again.<br>\r\n          <i>He was talking about me? What did he say? What does his roommate know?</i> Flare worried, not budging from his spot in front of the door. “You live with him?” Flare managed only those words.<br>\r\n          “Mmm-hmm. Yep. And you?”<br>\r\n          “M— me what?” The Flareon kept looking down, his stomach turning with every second in front of this huge dragon. A chill went down his spine, <i>Me what—? Me what! What'd I do? Did I do something wrong?</i> “Oh, sorry!”<br>\r\n          Charizard paused. “Sorry for what?”<br>\r\n          “Sorry for disturbing you!” Flare spun around and shyly started for the sidewalk. <i>I can't do this right now, I'll just… say I found the wrong address!</i> He then pictured in his head the following conversation that next day about why he wasn't there.<br>\r\n<br>\r\n          Charizard immediately gawked—he took a quick look back inside, his heart dropping past his gut by now—he'd already spooked Flare off! <br>\r\n          “Wait—!” Charizard called, slightly panicked. Flare jumped and his ears flattened. “You're alright, no worries! Come back, I can grab Umbreon for you,” he offered, letting the door open.<br>\r\n          Flare moaned quietly to himself, <i>Awhhw! No… now what is Bree gonna think?</i> The Pokémon turned back around to see Charizard’s tail slip back into the house. He looked back out to the street, <i>Can I still…?</i> He frowned, the door was still open. <i>I've gotta close that though! Awh…</i><br>\r\n          Flare entered and eventually closed the door behind him. He took in the look of the living room, the small dip of Umbreon’s spot on the couch compared to Charizard’s much more craterous one. Meanwhile, Charizard stood before the entrance into the bedroom. <br>\r\n          “Flare’s here,” Charizard called “and I didn't scare him off,\" the dragon looked back at Flare.</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554267600,
            "id":2639058,
            "title":"Not According to Plan"
        },
        "111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Charizard Waits. (Plan to CV Flare, LONG scene)",
                "Charizard Follows Flare Into the Room. (Change of plans again)"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          The two could hear Umbreon chuckling to himself from across the house as his voice echoed of the bathroom walls. <br>\r\n          \"That's good to hear! I may have forgot to mention that my roommate was a Charizard— my bad Flare!\" he shouted, a nervous laugh soon followed as well as the sound of him shaking his coat.<br>\r\n          <i>I fucking knew it! Of course he would forget to mention something like that...</i> Flare sighed. \"You would forget to give me an address if I didn't ask for it...\" he muttered to himself, his shyness eclipsed momentarily by slight agitation, but he still managed to keep his composure and laugh it off as to not come off sounding offensive. He would how ever have a few choice words for the Umbreon next time they meet up at work.<br>\r\n          \"I should be done in a moment! Can't have myself  leaving puddles all over the place,\" the Umbreon spoke aloud before the silence was broken by the loud whirl of an air drier kicking off. <br>\r\n          <i>I hope you come out looking like a poof...</i> Flare thought to him self before he nervously looked up at the Charizard, still finding it hard to bring himself to look him in the eye for longer then a couple of seconds. <br>\r\n<br>\r\n          <i>Come on Flare— just say something for god's sake!</i> \"S-so...uhh— do you go by any other n-name? Or is Ch-Charizard what you p-prefer?\" <i>God this stutter is going to be the death of me!</i> Flare took a deep breath before speaking again. \"I-I'm sorry, I'm not good in s-social situations,\" Flare tried to mask his feeling with a nervous smile as he waited for a response from the rather intimidating Charizard while still struggling to make proper eye contact with him.</div></font></span><br>\r\n<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          “Charizard <i>is</i> my name,” Charizard stated blankly. Flare was still for a second to process that.<br>\r\n          “I— I see,” the flareon whispered. Flare was not able to keep eye contact, that he could tell. Charizard stared at Flare’s back from above. “I— my name is Flare.”<br>\r\n<br>\r\n          “I see,” the dragon copied. “Can you see me from looking down so much?” Flare only shook more, much to Charizard’s annoyance. “You know, maybe if you could see other Pokémon’s faces you wouldn’t have to be shaking like that in front of me.”<br>\r\n<br>\r\n          Flare clenched his eyelids shut, <i>Why’d you go and bring that up?</i>, he complained. “Maybe,” he whispered. The Flareon knew that what Charizard said had some factor into his timidity, but it was hard, <i>so</i> hard! To his luck Umbreon seemed to have gotten out of the shower at this point. Charizard watched Flare as he slowly crept past him… if only he knew how awkward it was. “Bree you in here?”<br>\r\n<br>\r\n          As Flare disappeared into the other room, almost hitting his head on the wall, Charizard looked intently at the Pokémon. Surprisingly, Flare was cute. His tail fluff, his adorable ears, his drooping tail… his little butt… Charizard exhaled with difficulty. He was arousing himself without meaning to. Maybe if he got Flare to leave before the night ended, he could finally have some fun time with Umbreon.<br>\r\n          It then struck him. He had two Eeveelutions in the bedroom ahead. One of them was a worthless fire type, while the other was his best friend. Charizard’s eye twitched and he started to become more and more turned on. The flesh hidden by a slowly widening slit wasn’t easy to hide at all when he was horny. He hatched an idea, a sick idea, but possibly one he could pull off. It required the best of circumstances. Charizard sat on the couch while the two Pokémon in the other room talked. He smirked. <br>\r\n          If Flare is still here by the time Umbreon is asleep… Charizard will make use of such a possible cum load. Charizard lolled his tongue out, his rod having extended to a foot. <br>\r\n          Though, Umbreon wouldn’t just ignore this friend going missing— Flare's nice and is another evolution in their line—what could he do to fix that? Well... maybe he didn't have to make Flare into a load of cum. <i>That's a bit risky... Could I have some fun with both of them maybe?</i> Charizard thought lustily.<br>\r\n          His eyes widened and he quickly realized his open boner was not going to be a good first impression, so he waddled behind the wall for a second. </div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554267600,
            "id":2639760,
            "title":"They Wait for Umbreon"
        },
        "1111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Continue."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          \"Wow,\" Flare muttered as he stepped into the bedroom. \"That is a huge bed...\" Flare had to look up to see the top. It must have been at least a foot or two above his head, and would require him to leap to make it up there. The frame of the bed itself looked like a small, but sturdy wall with a thick comforter, sheets, and a plush, black blanket that matched the wood frame, cascading over the top of it. <i>That's not so... surprising, his roommate is a Charizard after all,</i> he thought as he began to scan the room for the Umbreon he saw walk by earlier. <br>\r\n          \"Um... Bree?  Where did—\"<br>\r\n          \"I'm up here,\" Came a voice from above. A soft gentle glow emanated from the Umbreon's forehead, giving away the spot he had chosen to relax. He had been there the whole time Flare had stepped in, his head hanging over the corner of the bed, watching Flare with his matching yellow eyes. \"You seem surprised?\"<br>\r\n          Flare just stared at him. A tinge of agitation gnawing at him. He really wanted to give Bree a piece of his mind for not giving him a proper heads up, and putting him through what he would personally consider hell, but as he looked deep into those yellow eyes he felt that anger fade. How could this Umbreon he only met a little over a week ago have such a calming effect on him? <i>How do you do it?</i>Already he could feel his nerves loosen... finding the voice he struggled so hard to find. <br>\r\n          \"Does— does it not bother you having a bed you have to jump onto to get in?\"<br>\r\n          \"Why don't you jump up here, and you tell me?\" Bree spoke as he patted a spot down along side him.<br>\r\n          \"Umm... okay?\" <i>Did he just invite me to join him in bed? No— he's just being...</i>Bree. The Umbreon who he watched converse with a Loppuny on the first day of the job, completely oblivious to her flirtatious antics! <i>I still can't believe he was so confused about why that Loppuny was so upset with him!</i> This was just another one of those moments. Flare reared his hind legs as he prepped for the leap, then with a \"Hmph!\" he sprang up onto the bed. <br>\r\n<br>\r\n          As soon as Flare's paws made contact with the plush surface, he felt the bedding beneath him sink significantly; far more then he expected in fact. \"What the—!\" Was all he could manage to say before landing with the grace of a newborn Ducklett. Everything went dark as he sank deep into the mattress. All sound muffled except for Bree's laughter which rang throughout the room after watching his new friend face plant into the bed, only his fluff visible beyond the horizon of covers that enveloped his body upon impact.<br>\r\n          \"You gotta just <i>plop</i> yourself on the bed, otherwise you're gonna sink in real deep!\" Bree chuckled as he watched Flare remain motionless. \"Soft huh?\" Bree smirked while skillfully making his way over to where Flare laid, before plopping himself down along side him, lifting him a little out of the bed.<br>\r\n<br>\r\n          Flare could feel Bree's body touching ever so slightly against his fluffy mane, a blush of embarrassment burning beneath his bright red fur. He was not used to being so close to another, but he maintained his composure some how, enjoying as the bed hugged around him. <i>This— this feels incredible!</i> <br>\r\n          \"What on earth is this bed made of!?\"<br>\r\n          \"Altaria down—fairly expensive stuff, but it's fire proof and ungodly soft!\" Bree said with glee as shimmied in place a little, sinking him self deeper into the bed. Flare found himself being pulled closer by gravity, but he did not fight it. He felt far too comfortable to even bother. He could feel the warmth of the Umbreon as his body made contact with his.<br>\r\n          <i>I don't get it— how can I be okay with this? It's almost like I've known him for years!?</i> His thoughts were interrupted by the Umbreon's soothing voice as he spoke with out his normal excited tone.<br>\r\n          \"Hey— you really shouldn't allow what others think get to you... you know?\" <br>\r\n          Flare just laid there... listening what his new friend had to say.<br>\r\n          \"You can't please everyone in this world... no matter what you do. Dwelling on how others think of you will only make things far worse,\" Bree's usual excitement was beginning to bleed through his speech again \"throw caution to the wind and be yourself! Let your personality do the talking for you!\" His voice started to die down again. <br>\r\n          \"It will be hard at first, but over time you will find it easier to be yourself around others. Take it slow and in small strides,\" the Umbreon gave flare a gentle smile.<br>\r\n          Flare could feel his body temperature rising rapidly; A totally new feeling of embarrassment washed over him, one he'd not been expecting.<br>\r\n          <i>What am I feeling? Am I seriously falling in love with Bree!?</i> Flare began to shift a little. He could feel his groin aching; His member started peeking from his sheath and pressing tightly against the plush mattress bellow. <i>No, no, no! This cannot be happening! I can't let him notice me like this—</i> <br>\r\n<br>\r\n          \"Flare? Are you ok­?\" Bree was cut off as Flare stood up suddenly, tail lowered to hide his shame.<br>\r\n          \"I'm sorry Bree—I forgot—there's something I must go take care of!\" Flare did not even give Bree a chance to respond before leaping off the bed, heading towards the living room where the exit was located.<br>\r\n          \"Wait! Flare!?\" Bree cried out, very confused by what was happening.</div></font></span><br>\r\n<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Charizard had managed to calm his lusts down by walking to the kitchen, opening the fridge, and just standing there. The cool air immediately caused him to sneer and gain some composure. His plan was set: either wait for Flare to leave or Umbreon to sleep. <br>\r\n<br>\r\n          <i>“... you o.k.—?”</i><br>\r\n          <i>“I’m sorry Bree—,”</i> the dragon cocked his head around the fridge door <i>“... something I must go take care of!”</i> Charizard raised a brow, there was some shuffling in the other room.<br>\r\n          <i>“Wait! Flare!?”</i> Umbreon’s confused voice traveled to the kitchen where Charizard was. The dragon's face turned serious for a second as he walked towards the bedroom door—<br>\r\n<br>\r\n          <i><b>Fwump!</b></i><br>\r\n<br>\r\n          “<i>Bwah!</i>” Flare squeaked, he had run face first into Charizard’s legs. The dragon sharply inhaled in surprise but no harm had come to him, meanwhile Flare had his paws over the top of his head, moaning. The Flareon’s momentary plight of nervousness was overcome by a bruise forming on the top of his head. “Awh!”<br>\r\n          Umbreon had left the bedroom to find a disgruntled Charizard looking at him for help, standing over a bamboozled Flareon. <br>\r\n          “Flare, are you alright!” Umbreon rushed over to Flare while Charizard sat down on the carpeted floor in front of the startled fire-type. “What happened?”<br>\r\n          “He er—ran into my leg I think and uh—now he’s kind of just there on the floor now,” Charizard explained rather bemusedly. Umbreon glanced up at his roommate, only to go back to tending Flare. Umbreon brushed his side against Flare’s and sat next to him while in front of Charizard’s spread legs.<br>\r\n<br>\r\n          “Calm down Flare,” Umbreon cooed. Charizard was taken aback slightly by his cooing. “You're fine, you're fine,” he nudged Flare’s shoulder. Flare has done this before. Instead of dealing with his problems upfront, sometimes Umbreon would see Flare in the back room with his tail down and about had his whole head in an empty planter box. Comical as it was, Umbreon pitied him. This was generally the result of a rude customer, but what set him off this time? Normally there was something plausible, but... he was being <i>nice</i> to Flare.<br>\r\n          “<i>Ow,</i>” Flare complained again. Umbreon managed to make him stand, soon leading the startled Flareon to the couch. <br>\r\n          “Charizard, can you go get him something?” Umbreon asked. Charizard nodded, stood up, and walked to the kitchen again. With Flare situated on the couch, Umbreon felt the need to comfort him more. <i>Why did Flare bolt?</i> Umbreon wondered. <br>\r\n          The sound of the Charizard’s thumping suddenly made him think. <i>Oh. He's worried about Charizard. So it wasn't me then, thankfully.</i><br>\r\n<br>\r\n<br>\r\n          Charizard didn't get anything from the kitchen yet, opting to just stand and listen. He peeked his head out from around the corner and glared at Flare. Umbreon <i>cooed</i> for him! For that <i>wimpy</i> Flareon! Charizard clenched his claws. “You never cooed for me!” Charizard whispered crossly. He watched as Umbreon comforted Flare openly, becoming jealous by the second.</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554354000,
            "id":2639791,
            "title":"Two Eeveelutions, One Room"
        },
        "11111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "On the Other Hand..."
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Tsuki</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          \"Jeez you hit your head pretty hard,\" Bree mumbled staring at the knot that had formed just above Flare's brow. \"Leave it to you to hit the one part of Charizard's leg that wasn't padded!\" He said with a lighthearted laugh as he continued to rub Flare's shoulder. Already he could feel Flare starting to relax a little. \"Who would have thought a knock on the head was all you needed— it's a good thing they let me take some of the berries home as a part of my pay!\" He joked in a attempt to lighten the mood. <br>\r\n          \"Yea— ha ha... I guess you're right—<i>shhhaa</i>!\" Flare hissed as he felt the tender lump that had formed. \"What berry was it again for something like this— Persim?\" Thankfully the whole ordeal preoccupied his mind long enough that he no longer felt the presence of his cock peaking out from his sheath. <i>Thank god nobody noticed.</i> The thought of that awkward situation made his current predicament so much easier to cope with.<br>\r\n          \"Close... but you would need to hit your head a lot harder then that before you would need one of those— unless you're seeing stars. You aren't seeing stars are you?\" The Umbreon asked quizzically as he looked into Flares eye's for a moment. \"How many rings do you see on my face?\"<br>\r\n          \"N-no— I'm not seeing stars or anything like that,\" Flare spoke as he winced again, this time using the sore spot as a way to distract himself from the Umbreon's gaze, before having his paw lightly swatted away. <br>\r\n          \"Stop poking it—and the berry you would want is the Oran berry— Persim is to treat confusion. You could also use Lum berry as a cure all, but unless you want the boss lady to chew you out, I don't recommend that...\" Bree shivered a little as he recalled the day he got caught using Lums as a go to for everyone's problem. He didn't know they were so hard to grow, single-handedly causing a shortage of said berry for about a month on his first week of the job. <br>\r\n<br>\r\n          \"Hey Chariz— oh! Did not see you sneak up on me there...\" Bree spoke as he reached for the ripe Oran berry he brought back before promptly thanking him then he used one of his paws to score a triangular shaped mark into the rind roughly the size of the bump on Flare's head, then peeling it away and sticking it between the Flareon's eyes like it were a post-it.<br>\r\n          \"Uhh.. what was—\" Flare was cut off as the Umbreon handed him the rest of the berry.<br>\r\n          \"Eat this—and leave that berry rind on that bump—it will help speed up the healing process,\" Bree spoke before jumping off the couch.<br>\r\n          Flare crossed his eyes at the dark blue patch that had been placed on his head; giving it a few pokes. <i>Wow— it really does help... bet it's going to stain though...</i> he thought, the prospect of going to work tomorrow with a purple stain on his head already starting to bug him. Already he can imagine the stares coming from the customers...and the questions... great. His train of thought was broken as Bree began to speak to him again.<br>\r\n          \"Hey Flare... I know you are not going to be fond of the idea, but why don't you stay here for the night? The bed is big enough for like, two Charizards, so there is plenty of room, and it's getting pretty late,\" Bree said as he looked towards the window. Already the sun began to fall, as twilight approached.<br>\r\n          Flare tensed up, his embarrassment visible. Sleeping in the same bed with Bree and Charizard— <i>oh god</i>, Flare looked back behind him to see if the Charizard was still there. Thankfully he did not seem to be paying any mind to them.<br>\r\n          \"That-that's okay... I can walk home!\"<br>\r\n          \"Nonsense!\" The Umbreon interrupted him as he already began to head towards the bedroom. \"Besides— you know you love that bed!\" He laughed as he rounded the corner.<br>\r\n          \"W-well...\" but Flare could not think of anything. He looked back at the front door then to the window. It was getting pretty dark. He couldn't believe how fast time flies. He thought about just leaving, but what would Bree think if he just left. The neighboring forest he had to cross to get home also was not the safest place to be at night, and the twilight would play tricks with his eyes... \"Damn it...\" he muttered as he ate his berry slowly. That bed is pretty nice though...<br>\r\n<br>\r\n          As time past and the sun disappeared behind the distant mountains neighboring the little village Flare decided to bite the bullet. He would have to stay. It was to dark for him to see clearly at night and unlike most his age— he was not keen on being alone in the dark. Traversing the woods at night was not something he was particularly fond of, Bree looks to have already headed to bed and asking Charizard for help was out of the question...<br>\r\n          With a sigh, Flare leaped of the couch and proceeded to make his way to the bedroom once more. Thankfully it seemed Charizard was nowhere to be seen. Perhaps he was off wondering around in one of the other rooms. As he made his way to the edge of the bed, he could already he Bree's soft breathing, presumably already fully asleep. <br>\r\n          Taking Bree's advice from earlier, Flare crouched a few times as he prepared to leap back onto the bed again but this time he was ready. With a \"Hmph\" he made the jump, but this time he just allowed himself to be embraced by the bed as he landed with a '<i>Fwamph</i>' His heart sunk a little as he almost landed on the Umbreon, his body freezing up as he felt Bree's limp body roll towards him... but he remained asleep, not even fazed. <i>I guess he just as clueless in sleep as he is awake,</i> Flare thought. It took him a moment relax, especially with the Umbreon's body so close to him. He could feel his blush coming back, once again his shaft emerging from its confines against the covers, but this time he just let it be. He did not plan to move, instead he just sat there in the darkness. The dim glow of the Umbreon's gently pulsing rings slowly lul him into a deep...deep sleep. </span></font></div><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554354000,
            "id":2639908,
            "title":"They Talked Inside the Bedroom."
        },
        "111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Twines</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          Charizard stood in another room. Namely, the living room. After reluctantly handing the berry over to Umbreon, Charizard took to standing behind the couch and pretending to watch the sun set, but had really kept his eyes on Flare. Oh how jealous Charizard was! He flexed his claws every so often when he heard Umbreon soothing Flare, but when he invited Flare to stay that night, Charizard’s plan had changed for the better. There was no chance at all that unless Flare left, he'd be a load.<br>\r\n          Charizard had ultimately been forgotten between the two Eevees, almost as if he wasn't there the whole night! However, when Umbreon invited Flare to sleep on his bed, on their bed for only them, Charizard was particularly angered.<br>\r\n          Charizard stood at the door frame to the room. The lights were all off, except for his tail, but dark enough so that Umbreon’s glowing rings could be seen from the room. An Umbreon’s glow was a treasured gift, at least in circumstances where their affection is showing, and those were for the best of friends… but Flare?<br>\r\n          Umbreon, as simply put, was the heaviest sleeper Charizard had ever witnessed. That damn fire-type, however, decided to sleep right next to him. Charizard slowly paced around the bed multiple times in an attempt to figure out a way to snatch Flare up from the bed. With the blankets being fireproof, his tail made for an excellent viewing source. Umbreon had his back to Flare, who himself was on his back—<br>\r\n          Charizard’s jaw dropped when he saw Flare… and his open arousal. The dragon's face became red with anger and jealousy. <i>This fucking Flareon!!</i> He yelled in his mind, eyes wide with intent. It took all of his restraint to not jump on the lowly fire-type and hammer him for being so close to Umbreon with the boner he sported. Charizard backed up.<br>\r\n           He huffed, rather more loudly than he wanted to. Flare flinched and opened his eyes to the ceiling. Charizard’s gut dropped and he quickly tried to hide his anger with a face. Flare was awake, <i>Shoot</i>, he thought, <i>great. Just great.</i> Flare groaned softly and sat up, trying to figure out what was with the orange glow in the room, unlike Umbreon’s yellow. Suddenly, it occurred to Charizard, why would he have to grab Flare? He's shy, but that didn't stop him from getting comfortable with Umbreon.<br>\r\n<br>\r\n          “Hey…? Charizard,” Flare whispered groggily. His eyes widened “Oh my, I'm sorry— do you— do you have enough room? I could move…”<br>\r\n          “Oh… er—” Charizard paused. For a moment he thought, then in his best innocent voice, he said “I'm o.k., Flare. I just, I fell asleep on the couch watching the sun and, well… I realized that I didn't have the best first impression with you…” Flare’s ears perked slightly “I'm also super sorry about you hurting your head, I— I was terribly worried and felt really bad about it.”<br>\r\n          “Oh...?” Flare tilted his head. He was slowly becoming more and more interested. “It wasn't your fault, Charizard. I'm— I'm just really horrible with new people— I— you're fine, it's not you, it's me,” Flare drooped his ears, his stomach feeling more and more tense.<br>\r\n          Charizard smiled. “Oh thank you! I was so worried, I didn't want to scare you at all!” Flare looked up at Charizard again. “I was thinking maybe we could get to know each other? I saved a dessert for Umbreon but it's a lot. I mean, I could eat it in a couple bites but Umbreon probably wouldn't mind that you be treated to it.”<br>\r\n          Flare’s stomach growled. He hadn't eaten since earlier that day, and felt slightly tense at the offer. <i>He's being so nice… maybe Umbreon’s right. I should try a little more</i>, Flare thought. Some seconds of decision making pass before Flare says “O.k..”<br>\r\n          “Great!” Charizard smiled widely. Flare made a slow motion to get up, trying not to disturb Umbreon, but when he rolled over he felt his dick push into the bed. His tail pressed hard against the sheets in embarrassment, and his cheeks flourished. <br>\r\n          <i>Oh my god I was hard!</i> Flare panicked. He turned his head to see Charizard but the dragon had already left the room. He gave a sigh of relief, he had some time to hide his— <i>oh no, I was on my back! Charizard had to have seen me!</i>He nervously pressed his paws into the soft cushions, kneading them for a moment of contemplation. <br>\r\n          Charizard <i>did</i> have a dessert for Umbreon, and there was no way in hell he was going to give it to Flare without doing something malicious. He made his way to the fridge and grabbed out a berry mousse in a small, plastic covering. Small to him, anyway. Removing the lid, he found a small plate and placed it gently in the middle; If he weren't so focused on what he wanted to do with Flare he'd have been proud of the neat dessert.<br>\r\n          Charizard then walked into the living room and softly sat down on the couch with the plate placed ever so high to his stomach. His short legs stuck out into the air, but he twisted so that he was completely flat out and right with the couch. Flare had come out, the room lit with only Charizard’s tail, and he padded around the couch. Jumping up, he awkwardly settled himself at Charizard’s feet. <i>He got real… comfortable… it seems</i>, Flare thought, his eyes lit up when he saw the dessert.<br>\r\n<br>\r\n          “I uh, I want to apologize again, I know how intimidating I am and I feel quite ashamed about it sometimes,” Charizard lied, trying to keep his meek demeanor. Flare flicked his bushy tail.<br>\r\n          “Aha, yeah,” Flare agreed nervously. “But at least you—you try to be nice,” he thought back to meeting Charizard at the door, but couldn't remember anything other than staring at the dragon's feet and worrying. Flare was looking at the dessert, but kept trying to keep his eyes on Charizard, whose face was full of timidity, unlike before. Flare suddenly felt… relieved. He didn't make a move for the dessert yet though, he wanted to be polite and wait.<br>\r\n          “I don't know. I work the same job like you, sort of, but I burn more than weeds, I don't really talk to too many other people than Umbreon… either,” he added “I'm thankful you know what I'm talking about, right?” This play on Flare was exactly what he wanted to happen. <br>\r\n          Although red flags had gone up in Flare’s head when he arrived, he slowly became adjusted. “Yeah… “ Flare admitted. Charizard sighed deeply.<br>\r\n          \"Umbreon is a great friend, right?”<br>\r\n          “Right,”<br>\r\n          “He really works for it, huh? I mean, he's so nice,” Charizard had gotten a question stuck in his head “I don't think I'd be a good partner though… if you know what I mean…”<br>\r\n          Flare stopped paying attention to the dessert on Charizard’s stomach and his face turned red, even more than it could have been from his red fur. “Oh… oh! I— yeah I get it,” Flare stammered “he is very nice to me too.”<br>\r\n          \"How nice?” Charizard teased Flare with every passing moment the mousse was in his claws. Flare bit his lip. <br>\r\n          <i>Charizard is so much different than I thought he'd be! He's just as nice as Umbreon! But he's making me feel so— flustered!</i> “W— well… “ Charizard raised a brow and smiled. “He helps me talk to customers sometimes when I can't… he took me out to eat once,” the dragon's smile disappeared as a glimpse of anger for a brief moment but returned when Flare looked back up “and he's… “<br>\r\n          \"He's what?” Charizard never felt so ridiculously self-effacing.<br>\r\n          Flare hesitated. “I mean, I like him, kinda…”<br>\r\n          \"Kinda?”<br>\r\n          “A— a lot, actually…”<br>\r\n          “A lot a lot?” Flare was obviously too shy to admit it, and Charizard was disgruntled at his inability to speak like a normal Pokémon. “If you want to tell me about, I won't tell! Promise.”<br>\r\n<br>\r\n          The Flareon shifted in place. <i>Why not, I'll tell him.</i> “Umbreon is hot, and I don't—I've never felt aroused like that before—and I don't know… if he feels the same way… I think I—oh…” suddenly he lost his sense of courage when Charizard kept looking intently at him. Charizard forced his hardest smile yet, keeping an angry quiver from exposing his true feelings.<br>\r\n          \"I feel that way too… wanna know something?” Believing this would be the temporary break he needed to compose himself, Flare nodded. “I've got a soft spot for Eevees… I know it might seem weird to you but I do,” <i>only for Umbreon</i>, he corrected his thoughts “and Umbreon is something special,” Charizard gazed to the open space in the living room.<br>\r\n</span></font></div><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554354000,
            "id":2639975,
            "title":"The Dragon's Not Having It"
        },
        "1111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Twines</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          Flare was not so much caught off guard from Charizard liking Umbreon, but him too? <i>Does Charizard… like—me?</i> Flare blushed. “I'm alright with that,” Flare’s tip began to poke out again, and like the cycle continuing, he began to become overwhelmed with shyness. <i>Awhw! Not again…</i> Flare panicked, <i>wait, no. No. I'm going to push through this, I'm not going to run away like a weirdo again!</i> Flare scolded himself. Charizard was looking at the wall. The mousse was still on Charizard’s stomach, tempting as ever, and Flareon began to drool. He had ignored his hunger up until now. <br>\r\n          “I think you're nice… too, Ch—Charizard,\"<br>\r\n          Charizard’s ears flicked. And he looked between his legs at Flare. “Aww, thanks!” Charizard returned, slightly surprised… <i>but prey normally fall for pretty words all the time</i>. <br>\r\n          <i>Now… how to get that dessert…</i> Flare, with the confidence he barely mustered, slowly stood, his paws pressing into the couch, and then he placed a paw on Charizard’s leg. Charizard looked at Flare with positivity, Umbreon sometimes crawled onto Charizard for the heat he provided, which Charizard’s expression encouraged the Flareon to continue. Flare places his next step next to Charizard’s crotch for support, then above, and farther, until his tail brushed between Charizard’s legs and tickled his parts. Flare’s paws sunk into the dragon’s belly and somewhat made him wobbly, until he adjusted himself to be comfortable. Flare was right atop the mousse now, with Charizard beaming at his confidence. Flare was feeling a mixture of pent arousal and nervosity, and hopefully from the dragon's natural body heat he wouldn't notice the erection coming from him.<br>\r\n           The dragon still had one claw under the plate, and one claw free. Flare chuckled nervously “I uh… may I have some?” Charizard nodded. Flare’s eyes seemed to twinkle with delight and his mouth descended onto the soft pillar. The mousse was sweet, like a berry, soft like whip cream, and it was about as big as his head, and definitely more than a single bite, more like twenty, would be needed to get at least half of it in. <i>He was going to give this to Umbreon?! What a lucky roommate!</i> Charizard was silent as he watched Flare eat the mousse, raising his claw to above Flare’s back, his slit opening with extraordinary pace, the hot flesh coming out from the unintentional arousal of Flare.<br>\r\n<br>\r\n          “Like it?” Charizard asked. Flare nodded, finishing his bite and swallowing. Charizard edged his claws right behind Flare’s neck.<br>\r\n          \"Yeah! I've never had this— berry stuff before. At least, not the cream and— and stuff,” Flare smiled and took another bite. Charizard raised the plate slightly higher to where his claws below gave him the best grip on the plate, then waited for Flare to open his mouth for another bite. Flare swallowed another bite, then went for another—<br>\r\n<br>\r\n           Simultaneously, Charizard seized Flare’s upper body in a lock and shoved the dessert in his face. Instinctively Flare gagged and squirmed, eyes clenched shut in surprise. Charizard squeezed onto Flare’s body and forced him into the soft belly below, and then went further to cram the food down Flare’s throat. The poor fire-type tried to resist the sudden forces but his head was bent back and the soft dessert felt like it had become much more dense and thick than he could handle. Tears of shock were forced out of Flare’s eyes and he kept trying to resist whatever Charizard was doing.<br>\r\n           Charizard grimaced and smiled at the same time, if at all that were possible, and his shaft had reached its full potential, a foot. A long, girthy, fleshy, musky twelve inches of cock. The couch creaked slightly from the struggling, but Flare was unsuccessful in pushing off of the dragon's belly because of Charizard’s mighty strength in comparison. <br>\r\n           Flare’s choked down the dessert, his stomach bulging slightly, which he also found it harder to breathe. His tail thrashed and he couldn't do much other than tear up and take it. Once the dessert was smashed across Flare’s muzzle, fur and face, and splattered on Charizard’s chest, Charizard dropped the plate to the carpeted floor. Flare winced and, having much of his strength drained, gasped for breath, his stomach was a little expanded around his gut, which he felt was hurting him with every movement of his muscles, but more so from Charizard and his grip. Charizard then grasped Flare by the muzzle, and leaned in. <br>\r\n          “You like the dessert? You don't like me? You like Umbreon? <i>My</i> Umbreon?! My roommate, and you dare lay next to him with an <i>open boner</i>?!” Charizard growled, clenching his teeth and snarling in a quiet voice. He was taking out all of today’s aggression on this wimpy, whiney Flareon.</span></font></div><br>\r\n<br>\r\n<br>\r\n<i><div align=\"center\">Tsuki</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          Flare could not believe what he was hearing! This anger was seething from Charizard's voice as he spoke. It sent chill of fear that pulled at his very soul and made him feel sick. <i>I-I didn't know!</i> Was all Flare could think. He wanted to scream, beg his apologies! How could he have known this Charizard had such feeling for Bree! It's not like he was an Espeon— he can't read minds! He couldn't even read other's body language. He now truly knew that Charizard did not like him, but this level of hatred was something he could have never imagined!<br>\r\n          Flare wanted to scream, but he could do nothing of the sort as long as Charizard kept his grip tight and him pressed firmly against his gut. Already the mousse that had been forced down his throat threatened to make its way back up, but the thick creamy desert remained down, far to thick for him to simply heave up. What was left on his face, nose, and the back of his throat only further inducing the feeling of drowning as Flare desperately gasped for air. All he could do was look up at the Charizard, his eyes wide with fresh tears streaming down his face, silently pleading with Charizard for him to stop what he was doing and let him go! The Charizard would never have to worry about seeing him again! He just wanted to go home! Unfortunately the face of mercy was not what he saw staring back at him.<br>\r\n          Flare managed a panicked squeak as he felt a great warmth brushing against hind quarters—prodding against his rear. <i>No-no-no-no-no! Please not this!</i> He thought as he remembered what the Charizard said about Eevees. Flare's struggles picked up as he frantically tried to get away, but he was far to weak to do anything! <i>Why! Why is this happening to me!</i> Flare looked up again at the Charizard, his vision now blurred by not only his tears, but the mousse that was smeared across his face. <br>\r\n          \"P-please!—I'll leave a-and n-never come back! J-just let—let me go! I-I'm s—sorry!\"  Flare begged between raspy breaths, not having the strength or the air to manage anything near loud enough for anyone but Charizard to hear.</span></font></div><br>\r\n<br>\r\n<br>\r\n<i><div align=\"center\">Twines</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          Charizard violently squeezed Flareon, who winced and allowed his mouth to widen from pain. Without an answer, Charizard began to lick the mousse off of Flare’s face. Flare’s tears and messy face began to clear up with every lick. Flare shuddered and clenched his teeth, trying to deal with all of the torture. The dragon continued to hump and rub against Flare’s entrance, his tip beginning to make his entrance soft. The Flareon sniffled.<br>\r\n          “P— ple— ase, y— you— you're hurting m— m— me…”<br>\r\n          Charizard continued to grope Flare’s plushy hips while slobbering his muzzle. He pressed his tongue to the Flareon’s neck and trailed along up to his forehead with excruciatingly slow speed. Flare sobbed with his tongue hanging out while Charizard’s flesh throbbed, harshly colliding against his rear. <br>\r\n          “Plea—ea— ase! Stop it, s— stop—! It hurts! Ghu huh humph—” <i>Why is he doing this? I thought we were becoming friends! Flare’s</i> pitiful sobbing became a bunch of unintelligible mumbles. Gradually Charizard opened his mouth, twisting his tongue around Flare’s snout. If Flare’s eyes could go wider, they might as well have been from a Xatu. <i>Ohmigod! Nono! No no no! He's gonna eat me!! No, he can't! Where— where's Umbreon?! Umbreon! Help! Please!</i><br>\r\n          Charizard thrust his large hips, penetrating Flare’s stretched ass. Just as Flare felt this, he tried to scream. But Charizard clamped down on Flare’s mouth. All Flare could see was the top of Charizard’s snout, and his very much needed scream of horror was muffled by the dragon’s own mouth. Charizard moaned furiously as his hard flesh violated the poor Flareon, sliding in and out with relatively noticeable resistance. Instinctively Flare clenched his muscles and tensed up. The tapered rod was, at the same time, the most pain and most pleasure Flare had ever felt in his life. <br>\r\n          Suddenly Charizard loosened his clamp on Flare’s snout, but shot his tongue into the Flareon’s resisting mouth. The expression held in Flare’s face was one Charizard had never seen before, was Flare… enjoying this? Who knew? Flare squirmed more violently when Charizard was penetrating him from two sides, but really couldn’t move because of the restraint. Charizard thrusted and pushed down on Flare’s soft rear.</span></font></div><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554354000,
            "id":2640002,
            "title":"So He Followed Through With His Plan."
        },
        "11111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          <i>This- this can't really be happening! It's all just— just a nightmare!</i> Flare's thoughts raced, trying so hard to rationalize the situation—but this pain he felt was very real no matter how hard he tried to wish it away. How did everything go wrong so fast? He was finally starting to open up—to break away from his own fears—with Charizard. He thought they could be friends—and Charizard made him feel welcomed when he started opening up to him! <br>\r\n          Was it that the Charizard put on nothing more then just an act to catch him off guard? Did he truly despise him so much that he saw him as nothing more then a quick fuck and a meal? What did he do to deserve this? Now here he was, being pinned to the gut of this enraged Charizard who just moments ago was making amends, feeling his large cock stretching his body to the limit, making him feel like he was being split in half! No matter how hard he tried to scream he couldn't—not as long as the Charizard had his maw clamped around his snout, his tongue thoroughly lodged down the dog's throat, and all while being forced to inhale his rancid breath as the dragon panted with each thrust.<br>\r\n          Flare gagged on Charizard's tongue—the dragon's thrusts lamming what little air he could manage out of him. Flare's body convulsed involuntarily around the massive cock, coaxing pleasured moans from the mighty dragon as he felt his cock throb deep within him, coating his inner walls with his pre as it lubed his insides to allow for the cock to go even deeper. The sound of the Charizard's cock slipping in and out of his Flare's ass with a disgusting <i>squelches</i> and <i>slurps</i> echoed loudly throughout the house. He couldn't believe Umbreon could sleep through it! To make matters worse—Flare could feel his body starting to betray him. <br>\r\n          Through all the pain, a subtle feeling of pleasure began to emerge in Flare as the Charizard's over-sized cock slammed at his prostate, despite the feeling of Charizard's red hot rod violently jostling about his insides—and as much as it hurt, Flare could still feel his own cock slipping free from his sheath, smearing his own pre and making a mess against the Charizard's soft belly...<br>\r\n          If it were not for the fact he feared for his very life, Flare thought he might have been able to enjoy him self properly. However all he could think about were the ravenous gut that he was pinned against, and very real possibility of that maw silencing him, opening up and embracing him any moment now. <br>\r\n          <i>P-please— I-it can't e-e-end l-like this! I- just want t-to go home!</i> Flare prayed as he felt the Charizard become increasingly more violent and rough with him. He had a feeling it would not be much longer now and felt like he would break any moment. The small Pokémon did not want to think about what would happen when the Charizard climaxed, not completely sure his little body could contain what this massive beast would force upon him... and <i>in</i> him more or less.</div></font></span><br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          <i>I can’t—believe—it!</i> Flare’s thoughts were interrupted by the violent thrusts. His tight cock pressed into Charizard’s soft, orange belly, creating a space that could only be described as dense, hot, and slick. The senses of a putrid tongue penetrating into his throat, the excessive groping of his rear, and the massive cock ravaging his ass were all making Flare groan in pain and moan in ecstasy. <i>Why am I—I can’t be enjoying this!</i> His tail and neck fur were tattered and matted with saliva, pre, and what was left of the dessert. His balls quaked, tensing up while his cock pulsed. <i>I… I can’t— no!</i> <br>\r\n          Flareon let out a muffled cry of induced pleasure as he unloaded into the makeshift hole that was both of their bodies. The white ooze stained his fur and excreted out the sides where their bodies no longer touched.<br>\r\n<br>\r\n          Despite the orgasmic scenario, Charizard still found difficulty getting himself to cum. He did not like this Flareon any more so than other victims he had previously, and the fact this one was closer to Umbreon did not change that. At the mention of Umbreon in his mind, Charizard withdrew his tongue from the gaping fire-type, who automatically allowed his head to drop into Charizard’s chest, heaving and whimpering from exerting so much energy in one load. Charizard slowly withdrew from Flare’s used ass as the Eeveelution lay down without a word, which, the thick rod that filled a hole, a new hole, had been removed, and now left the Flareon feeling empty, regardless of how much had been crammed into him in that short time.<br>\r\n          There was so little energy left in Flare that he could only sob and wait for Charizard to do… something. <i>Is he still going to… eat me…? Please… I get it now, I’m sorry for disturbing you and Umbreon</i>, Flare thought, unable to form any sort of language, <i>I think he just wanted to… teach me a lesson. I don't think he wants to—</i> There was a warmth, a warmth coming from behind, and not from below, encompassing his feet. <i>What is— wait what is that? Is he— humping my feet again?</i><br>\r\n          Charizard raised his head up to the ceiling, the widest grin he had was the toothiest to Flare, who could barely see past the dragon's shoulders without a problem. Flare could not fight, he could not get up, he could not go back to bed, he could not sleep with Umbreon, he could only squirm to look at his feet. His face turned as pale as a Gallade.<br>\r\n          The tapered penis was swallowing up his back paws. <br>\r\n          <i>\"N—NO! No!</i>\" He cried, jerking his head to face Charizard again. “P—pl—ease!” Flare could feel the slick tube sliding along his paws, the muscles throbbing and squeezing. Charizard only looked back down to stare Flare in his crying, beaten, violated face, and have him forced to see his lustful and predatory gaze. <br>\r\n          “Shh… enjoy it,” he gave Flare another lick to the face. “Umbreon’s gonna enjoy you as a load of my own seed more so than he would have if he had yours,” he chuckled “you wouldn’t have gotten that far, of course, but~!” Charizard had to suppress a moan. “<i>Nhgh!</i>”</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554526800,
            "id":2640732,
            "title":"Charizard's Hate, Charizard's Lust."
        },
        "111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          \"W-why are y-you doing t-this!\" Flare uttered, his voice sore, tears staining his face. A sudden tug forced a surprised gasp from him as he felt the fur on his belly lift slightly, dragging through his own shame—his own small stain on Charizard's belly—while the crushing grip of the Charizard's cock was squeezing his paws painfully tight, saturating them in his vile pre. Already Flare's nose cringed at the smell of the musky scent that wafted across his nose, making him want to gag a little. <br>\r\n          \"Please— I- I just want to go home!\" Flare begged, but the Charizard grin just grew wider as he gave his face another long, seemingly arduous lick, making sure to give him a detailed view of his gullet has it gaped before him—another hot humid gust of acrid breath ruffling his fur as the Charizard exhaled.<br>\r\n          \"Why would I do that?\" The Charizard chuckled as he wrapped a claw beneath the trembling Flareon's head, forcing him to crane his neck up to look him in the eyes. \"After all—I still haven't even cum yet,\" Charizard moved his claw from Flare's head down to the back of his shoulders as he smashed Flare down against his belly once more and gave a single hard thrust as his entire body clenched, a pleasured grunt escaping his maw. The sound of Flare's panicked reaction to being pulled in deeper drove him wild. Oh how he loved this feeling of power over this <i>pitiful</i> excuse of a Pokémon! <br>\r\n          \"P-please—  I-I'll do anything— j-just- let me go!\" Flare pleaded as he attempted to free his hind legs, but his struggles were weak, the muscles in hindquarters having basically given out on him from the abuse his rear had received. Charizard seemed to enjoy what little token struggle Flare could manage though as he attempted to free himself. A pleasured moan bellowed from deep within the dragon's throat.<br>\r\n          \"How does it feel little Flare...? To be so useless that you couldn't even make a decent cock sleeve for a superior creature? Hmm?\" The Charizard spoke with no care and no compassion for his prey's plight. One could say he even relished the fear judging by the look on his face. He wanted Flare to beg. Charizard <i>wanted</i> him to realize just how <i>fucking pathetic</i> he was.<br>\r\n          \"I—I..\" Flare couldn't even speak. His voice was caught in his throat as he choked back his tears. How could someone be so cruel? All his life he's had to live with these fears—this feeling of never amounting to much, it was partly why he was so shy. All he wanted was to avoid the judgmental views of others. That terrible feeling of being a burden to all he met, he didn't wish to be like this! He wanted to change! But just as he finally found the courage to do so—to open up to somebody—he gets <i>this!?</i> What he thought was a token of apology shoved down his throat, and his virginity violently taken from him! Flare couldn't even begin to put these feelings into words. Meanwhile Charizard's words were literally making him feel as if his very soul was being ripped in half. <br>\r\n          \"H—how,\" Flare sniffled \"h-how c-can you b—be so cruel!\" Flare was near incomprehensible at this point.<br>\r\n          \"How can you be so weak?\" Charizard retorted as he gave another little thrust, forcing Flareon's shocked cry to be eclipsed by a loud and audible spurt as pre squelched out from around Flare's legs, further lubing him for his trip down the Charizard's voracious cock. <br>\r\n          \"Hehe, at least this way you will get what you wanted~ this is the only chance you have of getting inside of Bree after all!\" <br>\r\n          Flare cried as he felt himself sink deeper into the painfully tight and musky confines of the Charizard's throbbing cock. He could feel it's tip starting to lift his fluffy tail by now as it pulled him deeper, squirts of pre-cum splattering against his sore ass. <br>\r\n          \"I-I- I don't w-want t-to die!\" He begged with a raspy voice through streams of tears as he extended his paws out in front of him, trying desperately to hook his sharp claws into the Charizard's belly as a last ditch effort to slow himself from sinking deeper.</div></font></span><br>\r\n<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Flare sobbed, he was in so terrible a turmoil that his body kept convulsing with abuse, his lithe body autonomously writhing on the cum stained belly as his legs were yanked into Charizard’s mighty cock. The slickened tunnel was tight on Flare’s thighs, as if itself were groping him separate to Charizard’s claws. The cum soaked into his fur when the strong muscle pulsed with pleasure. Each glob was a dense, warm substance that spread evenly along the small Flareon. Flare squirmed as his plush rear was swallowed up, his face red with fear and shame and pain and everything imaginably conceivable. <br>\r\n          <i>Umbreon, please help me!</i> Flare placed his paws under his stomach and curled up, trying to ease himself of the guttural pains that came with the dessert and rape. Flare couldn't keep himself from being tugged and lost his grip. His stomach was a soft bulge that hurt at the touch, to which he cried and cradled, weeping at the his own white cum stain, the last of his to stain his own fur before… <br>\r\n          <i>Eep!</i> He felt it. He felt the sloshy, hot embrace of the cum pool at his back paws. Charizard’s balls were not seen, as they were internal, and at this it could only make his destination more 'at home.' It was less of a cum pool, but more like a reservoir that had less air compared to… what he would imagine it'd be… and the encasing was Charizard’s musky crotch. Flare couldn't even look at Charizard, he couldn't stand his body’s condition, he could not bare to witness himself wallowing into a white mesh… so instead he closed his eyes… and continued to cry like a newborn Eevee. <br>\r\n<br>\r\n          Charizard grinned, his cock was pulling Flare along and had gotten to Flare’s rounded stomach. In spite of the pleasure he was receiving from his cock snack, he gently pressed against Flare’s extremely soft belly, which he would have enjoyed to grope had their friendship blossomed a different way. It elicited a squeak from Flare, but Charizard did not want a bad image in his head, so helping the Flareon’s journey down was necessary. <br>\r\n          “Pathetic,” Charizard chuckled, admittedly Flare looked cute still throughout the ordeal “just pathetic.”</div></font></span><br>\r\n<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Flare cried as he felt the Charizard wrap his large claws around his swollen belly, carefully pressing him further down his cock. He felt like he would throw up any moment but unfortunately even his body lacked the strength to do so, aside from the occasional burp which gave him only brief moments of relief from the excruciating pain as well as reminding him of the berry mousse, a more welcoming flavor than the tongue by far, though still nauseating. He briefly thought about the mousse he had, thinking that if he some how ever made it out of this alive that he would <i>never</i> be able to look at one again. This thought was quickly drowned out by much greater concerns, such as the moist feeling of Charizard's tapered cock suckling against the ends of both his paws—pressed against his body—as it inched further up his painfully engorged belly. <br>\r\n          \"You know if you struggled more, you might just get me to cum you out,\" the Charizard whispered into his ears. Of course he knew all too well Flare was in so much pain that to move or struggle would be devastating, but he loved giving him a false sense of hope, no matter how small, and the little whine he got as a reply was something that forced a grin. Charizard moaned—his toes curling as he felt Flare's body sink further. Flare's once fluffy coat kept tickling his urethra in the most delightful way as the Flareon's body was yanked deeper into his prison. <br>\r\n          \"At least now you will finally have a purpose in life,\" Charizard cooed, shuddering as Flare's body convulsed within the tight confines of his cock. Every twitch—every little movement—he could even feel Flare's pulse and the vibration caused by his persistent whining. \"You're gonna have to try harder then that,\" Charizard smirked, pushing Flare a little deeper much to the the canine's discomfort.\"<br>\r\n          \"<i>B-bree! Breeeeeeee!</i>\" Flare cried, his words forming only a pained whine as he tried to wake up the only one who could possibly save him—unfortunately he could not manage anything louder then he already has. It hurt so much to breathe—with every breath already requiring monumental effort. \"P-please—I-it hurts so...\" He couldn't even finish his sentence before he started to cry again.  Charizard's cock was now a little over half way past Flare's bloated belly, his paws pinned inside the cock with it.<br>\r\n          \"Oh—Bree can't save you now, you are already beyond the point of no return!\" Charizard smirked wickedly. \"I can already feel your tiny paws tickling me as you enter my balls—<i>Oh!!</i> It wont be long now!\" He laughed, rubbing more pre along Flare's body.<br>\r\n          <i>He was right</i>, Flare thought. Flare could feel more and more of his body slipping from the tight grasp of Charizard's cock into the slightly more spacious chamber where soon he would be deposited. The hot touch of the dragons potent seed was slowly enveloping his paws even faster as the cock finally made it past the widest part of his belly! This really was it—this is how he would die...</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554526800,
            "id":2640740,
            "title":"The Fire-Type's Wand."
        },
        "1111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Charizard's Next Step"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Flare was enveloped by the flesh up to his shoulders, his white fluff around his neck a matted mess while his eyes stayed clenched shut. Charizard was raving on the couch, finally moving on from stroking Flare, and he was now using his claws to jerk his ravenous cock. He could feel a spot inside of him that was filling up, and though he wished he had his own balls to touch, he settled with rubbing his crotch area.<br>\r\n          “You don't want to see the world one last time? Or you'd rather like to be my cum, huh, <i>Tai?</i>” Flare’s eyes shot wide open at the mention of his name and he attempted to look up at Charizard from his awkward angle. “Catch your attention? Yeah, I know your name. But since I've captured you, per say, I think I'm gonna rename you… oh let's see, how about Sloshy?” Charizard laughed, catching himself before getting too loud. It was supposed to be a surprise for Umbreon, after all. Flare stuttered a protest, but cramped in pain again, then his own mane got caught in his face as Charizard continued to slurp him down.<br>\r\n          “Last words, Sloshy?” Charizard looked Flare straight in the eyes as the defeated Flareon tried to choke out another word. “Who am I kidding? Cum doesn't talk,” he gently pressed two claws to close Flare’s mouth.<br>\r\n          <i>Mmph! No! No!! Mphft!! I can't—breathe!</i> Flare tried to squeal, but in fact he could only breathe once inside. <i>Bree… Bree!</i> Charizard’s dick wrapped around Flare’s snout, he let go of his grip on the Flareon, and like that, Flare was only left as a large bump in the dragon’s shaft. Charizard released a small plume of fire, drooling with ecstasy.</div></font></span><br>\r\n<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Flare found his own voice to be muffled as his ears and fur were folded over his eyes, despairing from the outside world for good within the musky depths of his cruel captor. The throbbing pulse of the Charizard's cock and the disgusting suckling sound of precum slurping around his head deafening him—squeezing him so painfully tight, he thought he would soon black out from lack of air. Flare's body trembling from the fear, and the unknown that awaited him bellow. Never thinking this is how he would end, at the hands of a cold-hearted predator that simply did not like him, or care for him in any way what so ever. Even now he could feel the Charizard's claws on the other side of the fleshy walls out side his prison, teasing him, the sound of the Charizard thoroughly enjoying himself as he moaned and thrust his hips at the air, unable to contain this feeling of pure bliss this hapless Flareon's weak struggles brought him. <br>\r\n          \"Ooooooh... it won't... be long...now.. Sloshy...\" Charizard moaned through his teeth, small wisps of flame kissing the edge of his lips as he took slow, heavy breaths. He wanted to savor this moment for as long as he could. Nothing felt better then putting this useless excuse of an Eeveelution where it belonged, especially one that dare get between him and his Bree. A grin spread across his lips—oh how he wish Flare could see the merciless look plastered on his face as he gripped the widest part of his throbbing shaft with both claws, giving it a nice firm massage. Flare's muffled cries as his bloated body was pressed upon were music to his ears! The pained struggles, though small, still sent shivers of delight as the Charizard sprawled out along the entire length of the massive couch. <br>\r\n          After he felt like Flare had enough, he allowed his cock to hang over the edge of the couch, letting the mass of his own girth and Flare's bob freely it the air. His cock stiffened every time it drooped down and causing it to bounce in a steady tempo while he laid back and enjoyed the feeling of gravity, with Flare being pulled deeper each time—emptying slowly into the tight confines of his musky prison. Charizard could only imagine the motion-sick feeling Flare had to be experiencing right about now. <br>\r\n          Small ropes of clear pre, some with little red tufts of fur drooled from the tip of Charizard's tapered cock. He did will to catch any of the strings of pre that were flung about, using his wing membrane to catch them so they did not hit the carpet. He would have to make sure he didn't miss any stray ropes later though before morning came he thought before continuing his fun . He laid back onto the couch, a blissful look on his face while he let his body to the rest of the hard work.<br>\r\n          \"If you thank we're having fun now, wait till you reach the end!-\" Charizard teased Flare's bulge as it started to sink behind the confines of his slit with his claws giving it a few more playful squeezes. \"I hope you put up more of a fight when you finally get down there— the least you can do before I put you out of your misery.\" The Charizard taunted, electing one last muffled \"<i>Mmph!</i>\" from Flare before feeling the Flareon deposit fully into his balls.<br>\r\n          \"It's time for the real fun to begin!\" Charizard chimed as he placed a paw down on the squirming bulge Flare had made giving it a good playful squeezes. Unlike the tight confines of his cock, Flare now had a little more room to move—and Charizard had a feeling Flare's spirit wasn't over and done with, and Charizard would enjoy the wimps last moments to the fullest...<br>\r\n          The pain Flare felt as Charizard squeezed his body from the outside was nothing more the excruciating, and to make matters worse he could not fight against it or curl up in an attempt to ease the pain. He felt like he would burst any moment, and in that brief second he thought that's what Charizard was going for. <br>\r\n          \"P-please... i-it hurts—! Please s-top!\" Flare squealed, not sure if he could manage anything loud enough to be heard through pulsing flesh. He could taste his own tears on the edges of his mouth as well as Charizard's pre. He could vaguely hear the Charizard speaking to him over all the sounds of his inner workings as he was being pulled deeper. <br>\r\n          Flare could feel his lower body emptying in to the hellishly hot chamber bellow him—a faint tingle dripping over his little paws that were already submerged in the vile cum bath bellow. He whimpered as he felt his aching cock, still fully erect much to his discomfort due to all the unwanted attention it was receiving, springing free from his belly as the sensitive tip slipped past the tight muscular ring of flesh, and tracing down the fleshy walls of his soon to be slimy tomb, and to make matters worse, his world began to spin as wave after wave of painful contractions, all whilst feeling he was being thrown around as if he was on some hellish carnival ride. <br>\r\n          \"<i>Hnngmm—!</i>\" Was the only sound he manage through clenched teeth as he felt that tight ring crushing against his sensitive belly, and as soon as he felt his once fluffy tail was relieved of the pressure of being pinned to his back side, his lower body folded over under the tremendous strain to his abdomen, desperately trying somewhat to alleviate the pain—the tips of his paws feebly kicking against the fleshy walls as he tried to maintain a fetal position. Flare could tell the Charizard was enjoying himself from the outside. Every time his lower legs kicked against the fleshy walls, a pleasured moan could be heard as well as the Charizard's touch as he played with himself. Flare couldn't comprehend how someone could be so utterly heartless towards him—how he could be treated so horribly for no reason? He wouldn't wish these feeling on his worst enemy, but this Charizard... not only did he hate him... he was thriving on his suffering! He was nothing more than a toy to the beast, teasing him to no end and loving every second of it.</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554613200,
            "id":2641690,
            "title":"Lesser Heart and Ruth."
        },
        "11111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "A Flareon Contained (I told you, it's a long scene).",
                "A Flareon With Spirit."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          \"Aaaaaaaaa<i>hmph!</i>\" Flare cries as the widest part of his soft belly was pressed through the tight ring, but his cries were silenced as a crushing force clenched tight around his head! He couldn't breath—Charizard's grip was clenching tight around his neck. Flare let out a choked gasp, his eyes would have been wide as saucers if not for the clenching walls preventing them from opening! He kicked frantically as panic set in. The grip was only growing stronger! He swore he would be crushed at any moment, but the Charizard had other plans as he felt the grip around his neck finally loosen, only to placed further up around his snout. <br>\r\n          Flare briefly heard the Charizard taunt him before giving him one last tight squeeze, the walls squelching around him loudly as he was forced down with great speed as he felt the fleshy tube seal around snout before depositing completely within the confine of the Charizard's sweltering balls. Flare eyes—finally being free from the crushing force—shot open as he gasped for breath, almost choking on the foul musk and thick seed that glazed over his body upon entry before breaking down in tears. <br>\r\n          <i>It's so dark... so... dark</i>, he thought. Helpless and alone as he felt the walls clenching, kneading the Charizard's cum deep into his thick, matted fur. Flare still could not believe this was happening as he remained unmoving as his reality caved in around him like the fleshy walls. He was speechless, the anxiety he felt slowly build as he dwelled more and more on what would come. Flare was going to die soon, his existence snuffed out, and used as nothing more then another load for this sadistic monster that consumed him! <br>\r\n<br>\r\n          He was still so young, and had so much to still look forward to... he would never get to feel the caring warmth of love... to experience the joy of making love with someone he loves. The more he thought about such things, the deeper he sank into despair, and it was not long before he started to hyperventilate as he felt the hot walls literally closing around him!<br>\r\n          \"Well, when I say it's time for fun... I meant for myself of course,\" he heard the Charizard say. Those words rung clear in Flare's mind as the feeling of pure dread washed over him. The Charizard couldn't just let him die in peace. Hadn't he been through enough already? <br>\r\n          Flare curled tight, hugging his lower body as he wallowed in fear, crying. The Charizard had other plans though and soon he felt the Charizard fondling him as he did on the way down, coaxing him to struggle for this monster's own amusement.<br>\r\n          \"J-just l-leave me alone!\" Flare screamed, his voice cracking under the strain... to his surprise though, the Charizard seemed to listen.<br>\r\n          \"I bet it's pretty dark in there...\" the Charizard's voice sounded almost like there was a hint of concern in it, but Flare knew better. <br>\r\n          \"Why do y-you care!\" Flare wept,  his sorrow was turning to anger as the Charizard spoke to him. He never felt so much hatred for another creature in his entire life. Already he could feel the flood gates opening and his rage building—tingling from within his throat. The Charizard had began to speak but Flare had enough and cut him off with a \"<i>Fuck you! You...you...</i>!\" Flare couldn't think clearly as he found him self at a loss of words. Instead he just buried his head between his paws, his body trembling uncontrollable.<br>\r\n          \"Haha! That's good!\" the Charizard chuckled as he gave his bulge a firm grab, electing a startled yelp form Flare. \"I was beginning to wonder if you were even capable of showing anger, though its not like it will do you any good now,\" he smirked.<br>\r\n          \"Tell me Sloshy... do you feel tingly yet? Charizard spoke with an ominous tone to his voice. He felt Flare freeze up upon utter those words.<br>\r\n<br>\r\n          Flare hadn't noticed until the Charizard had brought it up, but he could indeed feel a slight tingling sensation where his paws had been submerged. It had not been a strong sensation, but he knew that as time went on that would begin to change. The anger he once felt began to fade again—his attitude reverting back to the scared Flareon he always had been after realizing what this meant. <br>\r\n          \"No-no-no-no-no... \" Flare muttered as panic befell him once more, trying to do what ever he could to crawl back and away from the small pool of semen. Of course, this had been pointless. There was absolutely no room to do such, and instead he found himself stretching his legs out so to use the fleshy walls to hoist himself out of the liquid.           Unfortunately for Flare, he only found himself sliding back down into the potent seed below, only spreading more of the smelly substance over more of his body. Charizard was clearly enjoying his pathetic attempts to delay the inevitable though as Flare could hear him moaning as he stretched the walls around him as he attempted to get away from the Charizard's seed. He even felt the dragon fondling him again from the outside, causing him to slip around and at one point being flipped over completely, momentarily submerging his whole head in cum.<br>\r\n<br>\r\n          Flare began to panic more as he choked violently on the Charizard's cum, desperate to catch his breath again while trying his hardest to wipe the sticky gunk from his eyes with his forelegs! The tingling he had felt just moments ago now intensifying to the point that it felt like his skin was crawling! <br>\r\n          \"Please! I-I am— I am s-sorry about what I- I said!\" He begged; the worry in his voice becoming more clear, much to the Charizard's delight. \"Please j-just let m-me go! I'll— I'll do d-do what ever you want, just-<i>Aaah!</i>\" Flare cried out as he felt his captor's weight bare down on him!<br>\r\n          \"You fucking coward... you don't even deserve to be called a fire type, much less be a fucking Flareon!\" The Charizard snapped back. \"I've seen new born Eevee's with more spine then you!\"<br>\r\n          Charizard's words cut Flare deep as the anger in the Charizard's outburst sent shivers throughout his body.<br>\r\n          \"P-please...hic I— I n-never even w-w-wanted t-to sniff t-to be a F-Flareon in the f-first place!\" Flare sobbed, trying his hardest to form words. \"I-I was f-forced into hic e-e-evolving by hic b-by my father!\" <br>\r\n          Flare felt the Charizard shift, easing off some of the weight that he had put on the Flareon. Did he just strike a chord with him? Flare waited for him to say something... anything that might hint at such. Instead—the Charizard's choice of words that followed only confused him.<br>\r\n<br>\r\n          \"You never did answer me earlier... about the darkness...\"<br>\r\n          \"H-huh? W-what do—\" what came next made Flare's heart sink like a stone. He felt the Charizard shift a little before he saw a faint glow in the darkness—an orange glow that grew in intensity until the darkness that once blanketed him began to lift, revealing the horrors that were once hidden to him!<br>\r\n          Charizard wore a wicked smile on his face as he rolled over onto his back, his wings surrounding his body as he brought his tail flame into contact with his bulge using one claw while casually stroking his cock with the other. What followed had to be the most wonderful sound to grace his ears as Flare let out the most terrified scream he has heard yet—a burst of life coming from his captive as his bulge began to frantically thrash about with new found energy! Charizard groaned as he craned his neck back over the armrest of the couch, his tongue lulling from his mouth as a newfound wave of pure ecstasy rushed through him!<br>\r\n          \"Yesss… just like that... <i>umph</i> Sloshy... nhgh,\" Charizard groaned as he arched his back a little from the pleasure, his toes popping as they curled from the feeling of his prey's struggles.</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554699600,
            "id":2641888,
            "title":"Charizard's Next Step"
        },
        "111111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "The final step..."
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Tsuki</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">           Flare had not been ready for what the Charizard had in store for him. This monster had revealed everything he once could not see, using the bright light his tail flame produced to illuminate the flesh prison. Flare could see in great detail as the walls pulsed around him—oozing fresh seed as they worked into his once fluffy coat. This monster—he wanted him to witness first hand the horrors of being digested, watching as his body broke down to fuel the beast's next climax! At the moment there was nothing to see, but Flare knew that would change as time passed and the thought of that scared him more than anything. This was too much for him, and just like that, he felt his adrenaline levels spike! All the pain he had felt... the numbness that was his entire lower body... it was all but eclipsed by terror as he violently kicked at the walls. Watching as they conformed around, and absorbed his blows!<br>\r\n          \"Please! Just let me out!\" Flare begged through his tear-filled eyes, but no matter what he did—no matter how hard he kicked and screamed—the Charizard just grunted, playing with him once more by pressing down on him hard, and forcing him into the ever growing puddle that Flare bathed in!<br>\r\n          \"Keep up the good fight Sloshy! Maybe there is still hope for you yet!\" Charizard grunted as he gave his prey a firm squeeze. Of course, he knew Flare would not have what it takes to actually make him cum. This was not his first time around the block, toying with his prey, but he loved the effort all the same. He enjoyed the torment—giving his prey a false since of hope. It made the thrill all the more enjoyable! <br>\r\n          \"The process is slow Sloshy... you still have a chance before it's too late...\" Charizard spoke with a smug tone of voice. If Flare could see the Charizard's face, he would have seen him grinning like crazy.<br>\r\n          \"Stop calling me that!\" Flare screamed, or at least tried to as best he could with his voice still sore, periodically filled with cum, and from Charizard's tongue having violated his throat. He continued to thrash about, doing what ever he could to try and fend off the Charizard's teasing prods as he tried  to submerge him into the rising cum. Flare even tried using his claws to attempt to scratch his way through, but no matter how hard he tried or how fast he swiped, his claws never took hold! The walls just absorbed the blows, and the seed allowed for his claws to glide right over! He could not get any kind of hold! His frustration was once again turning to worry as his voice turned into more of a panicked whine, as he tried so hard to fight for his freedom. Flare knew the Charizard was fucking with him, but the Charizard was clearly getting off to this. Maybe he could still get away if he could only make him cum!  <br>\r\n<br>\r\n          \"In about an hour or two it wont <i>matter</i> now will it!\" Charizard emphasized his statement with a forceful press of his claw, electing a pained yelp from Flare. He had Flare pinned and he made it obvious just how little he cared as he pressed firmly on his struggling form, moaning as he smothered him into his cum. Charizard began licking his lips in anticipation for the real fun as he felt Flare's panic intensify under his grasp—his muffled begging making him spurt a few drops of precum onto his belly as he stroked his cock more, before finally letting up on the poor Flareon. He could hear as he gasped, finally getting some air after being forced under the cum pool. Charizard just grinned, enjoying the thought of making this bitch choke on his seed. <br>\r\n          \"As much as I want to feel you break under my grasp. I want to savor this moment,\" Charizard huffed. \"Any minute now, that tingling is gonna start to hurt... it's nothing compared to stomach acid, but its not pleasant either, and I'm gonna enjoy feeling you fall apart slowly, and there is absolutely nothing you can do about it...\" Charizard smiled. He knew his words were getting to Flare. He could already feel the Flareon quaking in fear again—a faint sniffling coming from him that only grew louder as his words sank deep. It took a moment but Flare finally broke the silence. If it were not for the stillness of the night, he would not have understood him.<br>\r\n          \"P—please... show s—some mercy...\" Flare's voice was weak and pitiful as he stared with blurry eyes down at the tingling pool he had been submerged in, still shocked by what he sees. Not only had the tingling feeling start to gradually grow stronger, he felt his skin start to itch. Not only that, but a large amount of his fur had began to float to the surface of the come pool. He wanted to close his eyes—to pretend none of this was really happening—but he could not. No matter how hard he tried, his own morbid curiosity would not allow him to look away.<br>\r\n           Flare snapped from his daze as he felt the Charizard thrust his hips, resulting in a startled cry from the Flareon as the cum splashed over him! Reality set in once again as he felt his world collapsing! He needed to get out! Flare frantically kicked at the walls once more, a look of horror plastered on his face a he clawed desperately at the entrance to his prison, trying desperately to pry open the fleshy tunnel! <br>\r\n          \"P—please Charizard! I—I don't—not like this! I—I just w—want to go home!\" <i>W—why!... Why c—can't—I</i>, Flare froze up as he looked at his paws. They trembled uncontrollably , but that not what caught his attention. His claws—the ones he tried to tear his way out with just moments ago—they were no longer there! They were gone! He tried to feel them, but it was as if he never <i>had</i> them! It was after this realization that his attention was brought to his legs and that itchy sensation he had felt creeping up his waist! \"No...no-no- Ch— Charizard! Please! I-can't... I d—don't want sniff t—to die—like this! Please!\" <br>\r\n          Flare began to thrash about, the thick seed churning around him... churning! It was burning just like Charizard said! This can't be it! This could not really be happening! He was gonna die! His life snuffed out like he were nothing! Why was this happening to him! He never did anything to deserve this! <br>\r\n          \"Well Sloshy...I would, but... I simply have no mercy to give to such a useless Pokémon... enjoy your final moments on this earth... it's not like anyone will notice your absence,\" Charizard grunted.<br>\r\n          If Flare hadn't lost control of his emotions by this point, he did now. Flare cried out, ignoring the pain in his throat as he unleashed a powerful, rage—fueled flamethrower at the tight confines of the Charizard. Of course such action proved futile as Charizard just chuckled before pressing down on his glowing bulge, snuffing out the flame entirely as Flare was plunged beneath cum once more.<br>\r\n          \"You should not have done that Sloshy—that might have worked on a grass-type, but not me!\" Charizard spoke, craning his neck closer to his Flare who desperately fought to free himself from beneath the rising seed. \"That little stunt of yours did nothing more then tickle a little. Though I have to admit—it did feel pretty nice, but all you managed to do was speed up the process...\" he said, finally allowing Flare to breach the surface once more.<br>\r\n          Charizard had been right, Flare felt the temperature around him dramatically increase—the walls baring down upon him with great force, threatening to dunk him bellow the now churning seed once again! Flare let out a pained whine as he tried to fight against the force. His back was starting to burn and his legs felt as if they would give out any moment! The tingling he felt early had now spread to every part of his body and in just moments his ears starting to feel the burning effects of the volatile seed!<br>\r\n<br>\r\n          Without thinking, Flare reached up and tried to wipe the cum that clung to his face, but when he felt his paw give way, being replaced by a dull pain—he froze, staring wide eyed in horror by the feeling. The feeling was numb—the feeling of his paw—Flare watched as the shape of it slowly melted, then he heard a disgusting <i>plop</i> and just like that, he could no longer feel the end of his paw, just a dull throbbing where his paw used to be. Flare just sat there, staring ahead with a shocked look plastered across his face. He dare not look down... he knew what he would see, but when he suddenly saw the other paw give out right before his eyes, he could not help but follow its decent—the sound of the glob splashing into the cum pool bellow with another sickening splat echoing within his mind. <br>\r\n          Flare sat there, staring in horror as he had watched as a part of him seemingly break down before his eyes and dispersed across the surface of the churning seed, his red fur blending in slowly with the milky substance. He wanted to scream, but he found himself shaky, unable to process fully what he had witnessed—then burst into tears again as reality set in... it was to late for him now. He was as good as dead, and nothing could save him. He had reached the point of no return...</span></font></div><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554872400,
            "id":2643013,
            "title":"A Flareon Contained"
        },
        "1111111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Charizard dives right in.",
                "Charizard makes sure to cover up the struggles."
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Tsuki</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          The walls began to churn around him once more, snapping him from his stupor as he kicked out his legs and stretched out what was left of his arms to fend of the fleshy walls that threatened to close in! <br>\r\n\"S—stop! P—please I—<i>aamph</i>!!\" Flare's cries were cut short as he felt his legs collapse beneath the cum pool! His legs could no longer support the weight of the walls that were closing in around him, and soon found him self plunging below the churning seed, taking a mouthful of the disgusting sperm in the process.<br>\r\n          Charizard let out a low rumble leave his throat as he felt a part of the Flareon's body give out within him. The sound of Flare's pleas being cut short mid sentence made him shiver from the pleasure as he felt Flare panic within him! Already he could feel himself edging ever closer to an orgasm, but he quickly caught himself before he lost to his primal desires. He had to save himself for Bree, no matter how much he desperately wanted to paint the walls with this Flareon. Charizard took a deep breath, trying to drown out these wonderful feelings of Flare thrashing about inside him, trying to stay above the surface—the occasional cries of the panicking Flareon making it to his ears when he manage to surface above the cum pool. Charizard found himself bouncing his hips as he thrusted lightly into his claw—Flare's desperate pleas quickly bringing him close. This would be the hardest part—snuffing out the bitch without blowing his load. <br>\r\n          \"Any last words before I end you? \" Charizard huffed, his body starting to become tense as he edged dangerously close to climax. Flare screamed, but all he could manage was a choked gasp as he desperately tried to cry out, but every time he broke the surface, he found himself being pulled back down—his wails silenced beneath the waves of cum. The walls were beginning to squeeze around him; relentless, waves of force threatening to crush him.<br>\r\n          Charizard could feel his balls—the internal muscles that made them up—clenching tight around the wiggling Flareon to the point that he could see the bulge he made.<br>\r\n          \"It's time,\" Charizard cut himself off with a moan \"for you to serve a purpose, meat...\"<br>\r\n          Charizard placed a claw firmly on Flare. He relished Flare's dying pleas for help before giving one last firm grab. Charizard's eyes widened as he felt a rush of pleasure surge through him upon feeling Flare's fragile form collapse within his grasp. <br>\r\n          \"<i>Hngh</i>!\" He clenched the base of his cock as hard as he could—his balls contracting as they tried to expel cum. Charizard's entire body went rigid—his toe claws digging into the couch as he bit his tongue trying to hold himself back—wave after painful wave of the most unimaginable climax he has ever felt, made only so by the prospect of gifting Umbreon this load! He moved fast as he clenched the base of his throbbing cock with his other claw, desperate not to let any of his newly made seed from escaping as he road out his climax. <br>\r\n          <i>I need to think of something else</i>, Charizard thought as he stared at the wall in front of him. He had to use every ounce of his will, to force himself to zone out completely. He just kept staring at the wall, thinking about nothing but the wall—every little detail of it from the texture, to the odd shade of color it took under the orange glow from his tail flame. It took time, but eventually he felt his spasms fade until finally he had reached that point where he felt safe to release his death grip. A puff of flame burst from between his lips as he released the breath he had been holding, careful to cover its light with his wings as he sighed with relief.<br>\r\n<br>\r\n          \"<i>Hmmf</i>… that was too close...\" he said with a great sigh as he felt a little bit of the fresh cum that he just made dribbling onto his belly. It had a nice, faint orange tent to it. The deed had been done... Flare was no longer here—as a Pokémon—snuffed out to be used for a greater cause... Charizard grinned as he looked at the small amount of cum that had managed to escape and grinned. He could not fight the urge to give it a lick, pleasantly surprised by its unique flavor.<br>\r\n          \"Shame... I almost regret not eating you Flare... almost...\" the dragon grinned before cleaning himself of the small mess Flare had made, making sure not to leave any traces lift. He was proud... successfully managing to contain most of his Flareon—infused seed. <i>Eeveelutions always make the best loads</i>, now it was time. Charizard would make his move tonight and express these feelings for Bree that he'd held for far too long... but how? Charizard looked back towards the bedroom. He could hear Bree's heavy breathing, snoring softly as if nothing happened...<br>\r\n          \"Damn, Umbreon... how does one become such a heavy sleeper?\" Charizard muttered beneath his breath as he thought about how he would go about it.</span></font></div><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1554872400,
            "id":2643028,
            "title":"Making A Load"
        },
        "11111111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Charizard keeps going..."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Charizard breathed heavily in an attempt to calm himself even further. The thick slosh Flare made is taking a toll on his sex, which for the life of him he could not make flaccid or even stop leaking. Not like he wanted it to stop, anyways, but the thought still counts. His cock pulsed for every time he had tried to move, his internal cum-sac was filled to the brim, ready for release.<br>\r\n          “Oh Umbreon~!” Charizard shuddered. Already he felt like bursting again once he started imagining himself and Umbreon in the room, his claws trailing along the dark-type’s small hips, his body pressing Umbreon into the sheets while he tasted the small Pokémon’s fur like he’s always wanted to, Umbreon weakly looking up to smile back at Charizard’s own lusty grin—“<i>Gah!</i>” Charizard winced and leaned forward to stand, bracing once more to stop himself from ejaculating. There was no time, he had to go now, or the night would be ruined.<br>\r\n          He stood up, wobbling slightly. Charizard drooled at the good time he was about to have, the good time he <i>deserved</i>, the good time <i>Umbreon</i> deserved! He stumbled into the doorway of the room, his tail once again interfering with Umbreon’s natural glow like when he lured out Flare earlier. He shook with an overwhelming wave of euphoria and wanting. Umbreon was still asleep.<br>\r\n          He tumbled over, barely keeping himself composed as he clenched the sheets at the foot of the bed. Then with effort he raised himself onto the soft, fireproof bedding and managed to loom over the sleeping Umbreon. His cock was standing out—the thick, hard base to the tapered, leaking tip—the throbbing, all out and hovering over Bree. Umbreon was on his back, paws in the air and his body partially hidden in the sheets, and his mouth slightly open, and the whole prompted a peace so calm that Charizard held back an ‘<i>aw</i>.’<br>\r\n          <i>Agh—you sexy little thing! Presenting even when you're asleep, just another reason why I love you!</i> Charizard moaned while examining the rest of Umbreon. Flare was hard when Charizard arrived, but Umbreon seemed in need of a bit of encouragement. <i>I've been waiting for so long!</i> Charizard’s grin twitched.<br>\r\n<br>\r\n          Umbreon flinched from the sudden force. Groaning, he tried to stretch—but two massive claws held his upper body in place. He huffed and opened his eyes to see Charizard. For a moment he floundered about the different reasons Charizard had woken him up, but an unnaturally strong heat and accompanying smell caught his attention. <br>\r\n          “Charizard?” Umbreon could not look down to see what it was, but more pressing question—now that he noticed—why was Charizard pinning him down into the bed?<br>\r\n          “Oh, Umbreon!” Charizard’s stupor made Umbreon snap his attention to the dragon. “You're so—cute! And I,” he was really trying to speak “I uh—for a long time I've been wanting to—well—it's all down there, and I like you and I thought, well…” Umbreon gave Charizard a quizzical but interested look. Charizard’s gigantic body was covering up whatever you could see of Umbreon, who was both comforted and intimidated by the warm embrace.<br>\r\n          “Why are you so—what are you do<i>ing!</i>?” Umbreon squeaked. His eyes widened when he felt something prod against his rear. Umbreon shifted uncomfortably. “Charizard? What's this?”<br>\r\n          “I hope I don't disappoint, for you,” the dragon lowered his head and licked Umbreon across the forehead. Bree's eyes were swirls for a brief moment before shaking his head out of the dazing swipe.<br>\r\n          “Hey are you alright?”<br>\r\n          “<i>Umbreon!</i>” Charizard boomed, Bree inhaled sharply when the dragon dove his arms under his body and wrapped him in a tight hug. “<i>Oh</i>! You're such a turn-on! I love you so much! You're so hot and adorable and I just can't keep hiding it,” Charizard squeezed Umbreon again, whose confused mumbles were drowned out by the orange mass. <br>\r\n          “Ch<i>mmph!</i> Wht'r <i>ygrrmhh!</i>” Umbreon pushed and strained to get Charizard off to no avail. The prodding became a pushing, and there was a discernible slickness that spread between his cheeks. Umbreon paused, wide-eyed. <i>He—he's—is that his...? That's his dick—that's definitely his dick! Charizard?!</i><br>\r\n          “You make me feel so amazing!” Charizard gasped. “And <i>you</i> feel so—squishy~!” With little effort, he began humping at Bree’s entrance while making sure the Umbreon stayed in place, although the dark-type's legs were awkwardly spread.</div></font></span><br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          The heavy weight of Charizard's body pressed him deep into both the dragon's plush belly and the soft embrace of the bed. The Umbreon couldn't properly fight back against the dripping appendage that was now prying at the entrance of his ass, eager to make entry.<br>\r\n          \"Char<i>mmph</i>! <i>Waimph!</i>\" Bree tried to object, but his words were thoroughly muffled beneath Charizard's gut! His mind was reeling about the things Charizard was saying, about how he made him feel good, and how he found him cute. Bree had never thought about the possibility of Charizard being gay in the first place, but here he was, pinning him into the bed, professing his love, all while preparing to fuck him!<br>\r\n          Bree was not sure how he felt about the predicament he was currently in. He had always had a thing for guys, he even had a few fantasies regarding his long time friend,  but this was so sudden—so direct! He was not sure what to make of it! He should be happy, but he had just woken up and Charizard seemed to be a whole different Pokémon as he professed his love for him! He was not used to this side of him at all, nonetheless feeling Charizard's touch—the warmth of the dragon's entire body baring down upon him as his cock tickled at his back door, and the overpowering musk wafting around his nose. Bree could not help but start to feel his own excitement build—his own secret fantasies he had for his roommate starting to become a reality—his emotions were conflicted as he continued to fight against the hulking mass on top of him.<br>\r\n          \"Just relax Umbreon... there's no need to fight it...\" Charizard whispered as he gave Bree another affectionate lick against his chin, the only part of his body that was not buried beneath the dragon. He could see Bree's face straining as he tried to fight back, but he knew he secretly wanted this—a blush spread across Umbreon's face—it was a mission to get Bree to open up to him like he did. <br>\r\n          Charizard could feel the soft fur of the dark-type's plush butt resisting, not permitting access to what he desired, but he would not be denied. He has waited so long for this, and there was no going back now. Charizard proceeded to tease Bree's rear, being sure he was properly lubricated before he started. Unlike Flare, he loved Bree; Charizard did not wish to harm to the precious being beneath him. He wanted to be sure he was ready before he proceeded further, having gone no more than a inch or two within the Umbreon's tight ring—though he had to admit, it took every ounce of his will not to ravage that ass. The dragon's patience was rewarded as Bree's struggles slowed, and the familiar push of Eeveelution cock grew beneath him—its prodding a welcoming sign for Charizard to proceed further.</div></font></span><br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          <i>This—he's so huge!</i> Bree hyperventilated as Charizard moved his claws down to grope at his sides. <i>Is he really going to stick that in me? </i> Bree shuddered in pleasure when his own cock was smothered by Charizard’s gentle belly. Umbreon struggled to move his trapped paws. “Ch<i>mrzmph</i>!” Bree squirmed as Charizard started the action they both were waiting for.<br>\r\n          Charizard granted himself entrance, gradually thrusting into the tight, lubricated ring, the second hole he's made use of in one night. Umbreon’s mouth gaped open and stars were in his eyes, while Charizard was smiling with hearts in his. Umbreon hadn’t taken someone as big as Charizard before, and already he could feel new muscles and places in his rear he hadn’t felt before. <br>\r\n          “Ah! Umbreon!” Charizard gasped. Between Charizard and Umbreon was the Eeveelution’s stiffened erection, much like Flare during his time with the dragon. Charizard knew full well that Umbreon would have one, he knew how much Umbreon would want this to happen, and it was only a matter of time.<br>\r\n          “Ga<i>hmph! ThpmMH!</i>” Umbreon winced when Charizard pushed into his prostate. <i>That’s way too big!</i> Umbreon wanted to cry out. <i>If he’s going to go faster he’d better be careful!</i> He whimpered as he felt a limit being tapped, a limit he’s not reached before, one where he momentarily sobered from the lust in fear of stretching too painfully. Charizard’s hard dick was only softened by the surreal amount of pre that he generated, and Umbreon’s fleshy insides. How long had he been waiting to do this?<br>\r\n          Charizard gasped internally when he heard Bree whimper, the final sign that this was as far as he was comfortable with, which surprisingly meant his whole foot of cock. Umbreon breathed in shaky successions as Charizard pulled out. The dragon tensed up while trying not to ram his cock back up Bree’s tempting ass. He thrust slightly faster, a slick friction between the love, and a heated sensation in his cum sac.<br>\r\n          Umbreon, while under the cover of the overpowering dragon and the soft grace of the bed, managed to stop struggling entirely and fitted himself into the only position Charizard was allowing—spread legs and two folded paws. He did not have the dexterity of a claw or a flexible tail to move Charizard—he was simply stuck with his gigantic roommate atop him as the dragon set the pace.</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1555045200,
            "id":2643798,
            "title":"Charizard and His Umbreon"
        },
        "111111111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "... haste makes waste."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          \"Gaah-ahh!\" Umbreon cried out. His body squeezed around Charizard's cock as it pressed all the right spots within him. Bree's body was slowly growing accustomed to the dragon's mighty girth! <i>I—this—he feels so—</i>\"<i>Mmph!</i>\" Bree cried out in bliss from beneath the massive belly as his roommate hammered away at his delicate prostate. <i>I—I don't know—how much more of this I can take!</i> Bree thought, gritting his teeth, trying his best to keep his composure. He did not want to cum too soon after all. <br>\r\n          Charizard's cock felt so big inside of him! Bree could feel every little detail—every massive throb it made as his meeker body fully embraced Charizard's pulsing flesh. He could feel as more and more pre was pumped deep within his ass—the feeling of its heat filling him with the most indescribable sensation of warmth as it coated his inner walls. Bree could feel his own cock throbbing from the excitement. Charizard's warm belly was mushing against his smaller cock like it were a mold made just for him—Umbreon's own pre slathering over the smooth surface, and creating a cream that felt just as good as any other tight orifice. <br>\r\n          Bree's breathing grew ragged from the treatment. Though he could not move, he could still feel his hips thrusting forward in uncontrollable outbursts as his excitement grew with each passing second—his body instinctively wanting to bury his cock deep within the tight folds of the Charizard's constantly jiggling belly—its heat milking Bree's cock for everything he had, but Bree would not give in so easily to its wonderful embrace just yet. Instead he passed himself as best he could—ignoring the beautiful sounds of their love making.<br>\r\n          <i>Ohhh! He's really getting into this!</i> Charizard thought as he looked down at his new found lover, his tongue hanging from mouth as he stared down at Bree—only a little of the yellow from the moonlight Pokémon's eyes visible as he stared off ahead, his mind lost to wonder lust. Charizard could feel as Umbreon's body finally began to accept his rampaging coc. Umbreon's body still remained wonderfully tight even after, feeling every little detail of Bree's heavenly insides clench around his cock as if to never let him go. He could feel Bree's throbbing beneath his belly—lubing his chest much like Flare did when he ravaged him too.<br>\r\n          \"Your pleasure—is my pleasure...\" Charizard huffed into one of the Umbreon's ears—knowing the Eeveelution's body was reacting to his words as light whispers began to leave Bree's lips once his pleasure had built to unstable levels. Umbreon made the cutest expressions as he desperately tried to hold out longer, but Charizard knew he would not last like he could. <br>\r\n          Charizard made sure not to smother the poor thing to death as he took great effort in allowing the Umbreon's head to gasp for the breath he needed when their love making intensified. It had been over ten minutes now and neither one of them have cum yet, but both Pokémon were reaching their limits fast as both increased their efforts, seeing who would last the longest—neither one of them ever wanting this moment to end as they enjoyed each other's embrace.<br>\r\n          \"M—my god Umbreon! You h-have no idea how long I have waited—<i>mmph</i>—for this!\" Charizard said between strained breaths as he professed his feeling for dark-type beneath him. <br>\r\n          \"I love you, Umbreon!\"</div></font></span><br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Umbreon couldn't take it anymore, the moment Charizard finally said it, his cock erupted with shot after shot of white stain against Charizard and his sensual belly. Even though Bree was not large, and not even a fire type, Charizard still felt the power of Umbreon’s arousal spraying between their bodies. The dark-type howled out in pleasure, much to Charizard’s limits, as when the dragon saw his tiny partner so drowned in his lusts, his own cock buried inside, he finally came. <br>\r\n          All of Flare, or what had been of him, seemingly exploded from Charizard’s inner workings, making his dick bulge and pump the thick slosh right into Bree's hole. Umbreon squealed suddenly from the rush of overwhelming cum, his gut ensuing pleasure and pain before he tried to hold it in. Charizard wanted to unleash everything. Immediately he felt the weight of Flare deposit through his dick.<br>\r\n          Bree winced and started to gag, before it was evident that Charizard was pumping too much and he was about to gag up cum through his mouth. With all of the willpower Charizard could muster, he pulled out while still brandishing ropes and ropes of sloppy seed. The dragon humped against the moonlight Pokémon as he finished out his massive orgasm, to which each lump of hot musk coated Umbreon’s stomach almost as a fit.<br>\r\n          Umbreon released a moan of relief as he felt so much pressure escape through his backdoor, leaking onto the bed. However, he was interrupted by gigantic globs of seed splashing into his face, and legs, and paws, and belly—his whole body, save for his back. He clenched his eyes shut and pressed his paws, slippery as they may be, against Charizard’s never-ending spew of slosh. <i>There's so much!! Holy shit!</i> Umbreon thought through the torrents.<br>\r\n          Charizard felt his rampage coming to a close as the last of his seed slapped against Umbreon’s pinned form. He shut his eyes for a brief moment as lust overcame him, flopping to his side and letting his cock rest wherever it pleased, which meant Umbreon’s face. The dragon huffed, his chest rising and falling with every deep intake of air. For the first time, he'd actually felt sleepy after such an orgasm... for his first time, he fainted beside Umbreon, leaving the dark-type to wallow in the pool of cum left both inside him, and on him.</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1555045200,
            "id":2643803,
            "title":"Charizard and His Umbreon (Pt.2)"
        },
        "1111111111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Charizard!!"
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Tsuki</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          Umbreon remained still, his heart pounding within his chest as his body and mind continued to feel the effects of the afterglow. <i>Did that—did that really just happen?</i> Bree thought as he stared ahead at the ceiling with a smile on his face, watching as the shadows danced along the gentle orange glow of Charizard's tail flame. The words Charizard spoke still rang clear in his mind. <i>I love you... Umbreon.</i><br>\r\n           Bree shifted a little under Charizard's cock, which still laid across his face—its slick flesh gliding across his maw as it slowly retracted back into hiding. He could still feel the intoxicating effects of its musk lingering on the end of his noise, only just now noticing the similarities between its smell and the funny smell he has woken up to in the past. \"God... how did I never make the connection before...\" Bree muttered under his breath. It's not like he was unfamiliar with the smell of musk—maybe he was just too tired to notice such things in the mornings, after all, he was not a morning kind of guy by any means. <br>\r\n           Letting loose a heavy sigh—Bree placed two paws over his enlarged belly, closing his eyes once again whilst he traced his digits over his cum-soaked fur. He felt such a wonderful feeling of fulfillment within him, unlike other times he'd had sex. Even now he could feel the heat radiating from Charizard's massive load, still just as hot as it was when Charizard came in, and onto him. <i>This is going to be a nightmare to clean...</i> Bree thought, but he did not mind, to him it was worth it. It was not long after closing his eyes did the Umbreon realize something—something that sent a chill down his spine—he had a guest over... didn't he?<br>\r\n<br>\r\n          The scene that ensued would have been comical if anybody had been around to see it. A cum-drenched Umbreon flailing in state of panic as he tried to flip upright onto his feet, only to flop around like a Magikarp out of water, but the water being the seed he splashed around. Bree ended up falling face first once or twice, unable to gain proper traction due to all the seed he had been covered in, but once he finally did he proceeded to look across the bed eagerly. Bree held his breath in his lungs as he looked, praying that some how, some way, Flare managed to sleep through their fun.<br>\r\n          <i>How the hell could I forget!</i> Umbreon was borderline screaming on the inside! How would he even begin explaining himself to Flare? Bree paced around the massive bed trying not to disturb anyone and leaving little splotches of cum where ever he stepped. <i>Wait... where did?</i> Bree looked over at where Charizard collapsed. For a brief moment his heart sank as he thought about the possibility that Flare had been smothered beneath the his roommate, but he quickly pushed the thought away. Surely he would have made some sort of ruckus if that was the case. Upon further inspection, it appeared Flare was nowhere to be found. <br>\r\n          <i>Oh thank god!</i> Bree sighed as his panic began to subside, but he was not out of the woods yet. If Flare wasn't in his room, then where in the world was he? Surely he did not up in leave at this time of night?<br>\r\n          Not wanting to look for Flare covered in cum, Bree jumped off the edge of the bed heading straight for the bathroom, quickly shutting the door and turning on the lights, before heading into the walk-in shower and hitting a button. The silence was broken by the sound of rushing water hitting tile, and the viscous fluid began to slip from the Umbreon's fur, pooling around the drain.<br>\r\n          \"What is—!\" Bree spotted something he hadn't noticed until now. <i>Is that... red hair?</i> Bree stared at the fur trap on the drain. Mixed among the black strands of hair were larger strands of red and cream colored fur. Bree looked down at his body—sure enough, there was red hairs plastered all over his body within the seed.<br>\r\n          <i>Did I happen to roll over where Flare was laying? Surely he does not shed this much... </i><br>\r\n          Thirty minutes passed by as Bree diligently removed the absurd amount of seed from his fur, astonished by the ever growing build up of fur in the trap, even clogging the drain a few times in the process. The sheer amount of shedding easily dwarfed a weeks worth of the usual amount, and by the time the Umbreon had finished, very little of his own fur could be seen among the soggy mess.<br>\r\n          It was obvious at this point that something was off, and a sense of unease began linger into the Umbreon's mind. The amount of fur was worrisome—it would be hard to imagine such a large amount having fallen off without noticeable change in Flare's overall appearance. Bree decided best to just shake himself dry, not wanting to make to much noise this late in the night. His fur was short after all— the drier was more of a convenience than a necessity.<br>\r\n           With the stealth of a natural born hunter, Bree made his way through the house in search of Flare, his steps unheard as he moved about like a ghost, his rings not aglow. The light from Charizard's tail flame was all he needed to provide the light for his natural night vision. The cum tracks he had made had traces of Flare's fur in them just as he suspected, but he did not jump onto the bed yet, fearing what he might see. First he would check the other rooms of the house—maybe this was all just some sort of misunderstanding. Maybe Flare had some allergic reaction to the bed fabric or something, causing a bunch of his fur to fall out. Maybe he left in the night to avoid the embarrassment.<br>\r\n          Bree's normal, oblivious demeanor faded as he searched, eyes on the lookout for anything that may tell of Flare's whereabouts, but other then a little bit of fur here and there, nothing seemed to be out of place. This was a problem how ever. If Flare was losing his fur, would it not be all over the place?<br>\r\n           Bree had began to grow increasingly worried as he made his way into the living room where the house entrance was located. Nothing, there were no signs of hair loss anywhere—not even by the only exit. Bree's thoughts began to race, he had a bad feeling about all of this, and as much as much as he hated himself for thinking it—his mind wandered to Charizard.<br>\r\n          Both Flare and Charizard were awake when he went to sleep. He had been aware of Charizard's predatory nature, and on a few occasions noticed him trying to hide it, but it was a rare occurrence, and he had been friends with the dragon for years. The dragon had been nothing but kind to him. He had no reason to report it to authorities, and even if he wanted to, he would not have had the heart to do so. But this whole thing was starting to scare him now. What if Charizard really did something to Flare, would Charizard really eat a friend of his? Someone as innocent and shy as Flare?<br>\r\n<br>\r\n          Bree felt sick just thinking about it—or maybe it was the seed that filled his belly. Whether it was due to his anxiousness, the feeling of being to full, or both, Bree started to feel as if something was about to come up, so he quickly made his way to the bathroom, back into the walk-in shower. <br>\r\n          This once wonderful feeling of fullness did not feel so great now that the throws of passion were not apart of the equation. The jostling from the thick, heavy cum making him more nauseous as he picked up speed. He barely made it to the bathroom before the contents of his stomach abruptly forced its way up. Bree's body locked up as he felt all control go out the window, his stomach contracting, working hard to force the thick viscous seed out of his body. Bree clenched his eyes as he heaved over the drain, his eyes watering as his body strained itself. <br>\r\n          The cum was far too thick to simply be expelled from his body—instead the cum just poured  to the floor from his mouth, the thick strands hanging from his maw as the Umbreon finally got the chance to take a breath. Bree just sat there a moment, taking time to collect himself again. If it were not for the unpleasant straining and the slight amount of bile that was mixed with the seed, he might have found the taste enjoyable.<br>\r\n          <i>I still can't believe just how pent up Charizard—</i> Bree paused. He noticed something... the unpleasant feeling of fur within his mouth. Bree made a weird face as he seemed to lick at the air trying to spit out the hair, and after a few seconds he spat down at his feet.<br>\r\n          \"W—what is... this?\" Bree muttered, his voice shaky as he stared at what he spit up. A cold shiver went down his spine as he looked at the floor speechless. The cum that spluttered at his feet took on a distinctive red color. At first he thought he was staring at blood—perhaps Charizard had ruptured something inside him during their fun, but a closer inspection revealed this to not be the case. \"Fur!? W-Why would!?—\"  the realization hit Bree hard and fast as he slowly made his way to the bed, hesitating for a moment before leaping atop the mattress—his rings bright as he surveyed the mess Charizard had made. <br>\r\n          The once beautiful comforter was seemingly stained beyond hope of ever being cleaned, the white seed tinted red from the fur, that could not be have belonged to anyone else but Flare. \"H-how... how could he— \" Bree felt his stomach turning again. What was left of Flare was currently settling within his belly—and Charizard had put him there!</span></font></div><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1555089780,
            "id":2643941,
            "title":"The Moonlight's Terror"
        },
        "11111111111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "This isn't like you, Charizard..."
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Tsuki</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          For the first time since they met, Bree felt an unbridled anger, a seething <i>rage</i> towards the one he had felt love for just moments ago. For the first time in years, a deep growl emanated deep from within. \"Why...\" <br>\r\n          Bree's voice was quiet at first, far too silent to wake the exhausted fire dragon who proceeded to snore, completely unaware that he had been caught red-handed. <br>\r\n          \"Charizard!\" Bree shouted as tears filled his eyes... but the dragon remained deep asleep, oblivious to his partner—that is until the slumbering dragon received a well placed headbutt right between the eyes.<br>\r\n           In hindsight, a headbutt directly to the face may not have been the brightest idea, but the overwhelming emotions had clouded Bree's judgment for the worst, and before he had known what had happen, he found himself on the receiving end of a skull bash—Bree's relatively light body thrown from the bed with ease as he soared across the room, colliding against the wall with a loud thud before crumpling to the floor. Bree clenched his eyes both in pain, and from feeling the very room rattle around him from the roar that shook the house's foundation.<br>\r\n          \"What the hell! Ow!\" Charizard stopped mid-sentence as he saw his Umbreon laying on the other side of the room struggling to stand. All the anger in his voice quickly turning to worry in a instant. \"Umbreon!\" Charizard was on his feet in an instant, fearing that he'd injured his partner. He did not give it a second thought as to why Bree attacked him in the first place, all that mattered was Bree's well-being.<br>\r\n          \"Umbreon are you okay?\" Charizard's voice was gentle—something few have heard as he helped the Umbreon to his paws, his touch delicate as to not make matters worse. Fortunately there wasn't anything serious looking from what he could tell, but something was off. Bree seemed tense, actively avoiding direct eye contact as he helped him to his feet, and even then he could feel Bree trembling within his grasp as he helped to steady him. The twinkle of his flame refracting off a fallen tear drop caught his eye. \"Bree?\"<br>\r\n          \"How could you,\" Charizard felt his heart stop cold as he heard Bree utter those words, his voice was serious. This was unlike him, Charizard hadn't heard him growl before—ever! This was coming from the usually care free, cheerful Umbreon. Deep down Charizard knew why, but a part of him prayed it was something else, like throwing him into the wall on accident.<br>\r\n          \"Bree what are you—\"<br>\r\n          \"Don't play dumb with me Charizard! Where's Flare!\" Bree barked. Umbreon had looked up at Charizard with his bright yellow eyes glaring back with an unfathomable hatred, which Charizard took a second glance in disbelief. Tears were brimming from the corners of the moonlight Pokémon's eyes.<br>\r\n          <i>How did he figure it out? What gave it away? But I made sure not to leave any evidence! Maybe I can still...</i> \"Bree just relax... I walked him home last!\" Charizard felt the clack of his jaws rattle his skull, seeing stars for a brief moment the weight of the tiny Umbreon's thick skull slamming into his jaw, catching him completely off guard and sending him stumbling back against the bed! Charizard, in a attempt to catch himself, used an arm as a brace as he feel against the soft comforter. He felt his claw land in something cold—something very slimy. Charizard reactively pulled his claw away in disgust.<br>\r\n          \"Ugh!\" He froze in his tracks. <i>Oh shit...</i> Charizard stared at his claw—his eyes as wide a saucers as he looked at the mess. His claws were drenched in cum, but that was not all it was. Long red hairs covered it, much like tar and feathers. He could hardly even see the orange of his own skin past the cum and fur! <i>What!? I didn't give Flare enough time to digest!</i> Charizard felt his world beginning to fall apart around him! He had been caught all because he was too eager to fuck Bree! <i>No! How could I be so careless!</i><br>\r\n          \"I— I can explain!\" Charizard felt himself beginning to panic! His heart racing as he quickly tried to come up with something—anything! But nothing was coming to him. How could he possibly explain this to Bree! Deep down, he was tearing himself apart. The more he thought about it, the more he hated himself. He had just confessed his true feelings for Bree, and he accepted them! Now here he was—trying to come up with an excuse as to why he had killed Flare, when in reality he did so out of nothing more then jealousy and hatred! Even now as he thought about it, his other victims did something to deserve it, such as threatening him or Bree, neither of which Flare was guilty of! <br>\r\n          \"Please do! Please explain your reasoning for—<i>churning</i> Flare! You <i>killed</i> him, Charizard! While you're at it—how could you—y-y-you use!—\" Bree choked on his words as he held back the sadness that was eating away within him bit by bit \"you put that in me! You shoved F—Flare right u—up m... I can't—you!\" As much anger as he felt towards the dragon, he would be lying if he said he did not still have some feeling for Charizard. The words he shouted at the dragon cutting him almost as deep as the betrayal of his trust. So many emotions, these feelings he felt... the words he spoke... they did not feel natural. <i>Why Charizard—why did you have to do this to me! And of all nights, why on this night!</i><br>\r\n<br>\r\n          Charizard found himself at a loss for words again. His pride, his love, being crushed under these feelings of guilt from watching his precious Bree fight to hold back tears. Charizard could feel his own eyes starting to swell, Bree's words echoing in his head along with the sight of the Umbreon's emotional turmoil making him feel like a complete piece of shit. <i>How could I've done this to Bree?!</i><br>\r\n          \"Bree, I'm sorry, I just... I don't know what I...\" Charizard sighed. \"I was... so...\"<br>\r\n          \"What about Flare! What about how he felt! How terrified he must have been! I assure you the emotions you and I feel now pale in comparison to the fear you put him through!\"</span></font></div><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1555096620,
            "id":2643991,
            "title":"Disbelief"
        },
        "111111111111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Off into the darkness."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Charizard could only look down. He didn't dare to speak against Bree with his shame too great. He knew how Flare felt— and he relished every moment of it. But he couldn't say any of that as it would only make matters much worse for him. <br>\r\n          \"He wasn't just—just some punk Charizard! What could he have possibly done to deserve what you did to him!\" Charizard shuddered from the weight of those words—the emotional wounds they tore open cut deep into his heard. Bree might have thought what Flare experienced was true hell, but Charizard was willing to bet Bree's words were hurting him more than anything he could have done to Flare.<br>\r\n          \"I... I...\" Charizard felt a swelling in his throat, preventing him from speaking. Beads of sweat crawling down his head, and the room felt blistering, even for the fire-type.<br>\r\n          \"Answer me Chariz—\"<br>\r\n          \"I was <i>jealous!</i>\" Charizard blurted. Bree flinched by the sudden outburst from Charizard. \"Watching you two talk—watching Flare brush against you and—you <i>cooing</i> for him, it was too much for me!\" Bree stood there in shock as Charizard let out this rant, letting his thoughts spill out freely as he confided his feelings to Bree.<br>\r\n          \"Watching someone so... timid, opening up to you as if he knew you for years! You weren't seeing it Umbreon, but he fell for you! I couldn't stand it! Tonight I was going to finally tell you that I loved you, but out of all the nights you chose to invite someone—\" Charizard paused, gritting his teeth, clenching his claws \"when... I saw him laying next to you, you were buried within his fur, and Flare was just laying there with this look of content on his little face, splayed out for the world to see his shame!\" Charizard could feel his anger building once more, the memory of Flare sleeping with Bree with a hard-on like they were lovers still fresh in his mind. <br>\r\n          Bree took notice of this change in tone real quick. Without warrant, the dragon wouldn't just get pent-up like this. Bree's rage was slowly fading... something was... off. He felt uncomfortable around his best friend. Bree slowly found himself questioning if he truly knew Charizard.<br>\r\n          \"Charizard I—\"Bree was abruptly cut off.<br>\r\n          \"It should have been me in there! And you just let him cuddle up next to you like that!\" Charizard made crude gestures with his claws, swinging them rather threateningly. \"Might as well been fucking you!\"<br>\r\n          By this point Charizard's mouth was beginning to smoke and  flicker, embers dancing from his lips as he spoke of Flare. Bree began to feel weak as he tried to hold back his tears. He could not believe what he was hearing. Charizard was speaking as if Flare's life meant nothing. As if he truly had no remorse for what he did to the poor Flareon! <br>\r\n<br>\r\n          \"Charizard please—you're scaring me!\" Bree spoke out of worry, hoping the dragon would calm down, but Charizard seemed to be blinded by emotions, continuing to speak ill of Flare, seemingly unaware of Bree's discomfort.<br>\r\n          \"I did Flare a favor! He wouldn't have even gotten the <i>courage</i>—no, his prissy little ass wouldn't have even <i>tried</i> to say he liked you! Oho, but I did, me! My roommate, not his!\"<br>\r\n          Bree wanted to yell, but he found himself unable to do so despite his best efforts! Instead he proceeded to back away slowly as what little anger he had was gone completely, replaced by fear. He no longer felt as if he were standing in front of a dear friend, but instead a whole another  Pokémon entirely. This was not the Charizard he knew and loved... this was a monster.<br>\r\n          \"How... how can you be so heartless...\" Bree muttered as he backed away from the angry Charizard he thought he knew, but after tonight's turn of event, it seemed he was wrong for thinking so. Charizard stopped shouting, turning his previously shaking tension into a brief reprise. Bree did not even wait for an answer before turning away from Charizard and heading into the living room, making his way towards the door. He could not stay here any longer—not with how things were. He need to leave... he did not know where to, but staying here was out of the question. It was not safe being here.<br>\r\n          \"Umbreon!\" Charizard cried out seeing Bree heading towards the door. Bree froze up upon hearing his name spoken. He looked back at Charizard, but it was not out of curiosity to hear what he would have to say. He had to keep an eye on the dragon. Of everything that has happened, trusting the dragon was out of the question, and his concern for his own well-being was all that mattered now.<br>\r\n          Charizard on the other hand saw that look of fear in Bree's eyes. It was a familiar look—it was the same expression he's seen many of times from a Pokémon in fear of its life—a Pokémon that was ready to run. Charizards body stiffened. He did not want to make any sudden movements. Bree couldn't leave—didn't he see that he loved him!?<br>\r\n          \"Umbreon please... let's just talk about this...I'm sorry...\" Charizard spoke with a hint of nervousness in his voice. His eyes locked on to the Umbreon who continued to stare him down with those widened, yellow eyes. The room was dead quiet as the two watched each other, waiting for the other to say something. <br>\r\n          All remained quiet until a faint squeak broke the silence. Charizard saw Bree go stiff upon hearing the sound, and he knew why. Charizards eyes bolted to the source of the noise that he recognized to be the door knob to the house. Bree had slowly turned the knob about halfway during their stand off using his weak psychic abilities.<br>\r\n          <i>Shit this isn't good! He's planning to run!</i> Charizard thought. \"Umbreon... please... I'm sorry! I can fix this... please...\" Charizards eyes shifted back to the doorknob as he saw it turn a little further. He choked back an unexpected sob. Was he crying without realizing?<br>\r\n<br>\r\n<br>\r\n          Charizard could see the terror in the Umbreon's eyes. It was like Bree didn't even recognize him. The door knob turned a little bit further, but Charizard could not remain still no longer after seeing this.<br>\r\n<br>\r\n<br>\r\n          \"Bree wait!\" Charizard took a step forward—as soon as he did, the door flung wide open and Bree was halfway out the door into the cover of night! \"No—stop!\"</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1555123260,
            "id":2644110,
            "title":"Not Oblivious, Not Anymore"
        },
        "1111111111111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Umbreon... can't leave me.",
                "I... I can fix this."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Charizard made a panicked sprint for the door, knocking over multiple objects with his outstretched wings. As he pressed his claw against the wall, he stuck his neck out to look around outside. While a Charizard has problems seeing in the dark like many other Pokémon, the house was hardly lit and his eyes were already adjusted. To the front of him, he saw the faint yellow brightness of Umbreon’s rings dashing into the street. <i>He's running to the forest! I'll never find him there!</i> The dragon jumped out of the doorway and, with much adrenaline rushing through his body, took off with a massive gust of wind behind him, making the curtains flutter from the sheer force of his wings flapping. <br>\r\n          Bree managed to cross the road's white line—he looked back—Charizard was barreling down the entrance. The moonlight Pokémon’s eyes were wide with shock and he gave a sharp yelp, increasing his pace and passing over the sidewalk. A quick flash of orange soared over his head and he skidded to a halt, Charizard landed in front of him, reaching with his claws to grab. Umbreon had turned tail and scrambled in the opposite direction, nearly losing his grip on the pavement. Charizard clenched the open air, gasping and, scrambling as well, he jumped into the air adjacent to Bree.<br>\r\n          Just as Charizard closed the distance, another swipe failed when Umbreon preemptively dashed right, trying to circle around back to the forest. Charizard shot a claw out and yanked back on the dark-type’s back leg, forcing a pained cry from the Eeveelution as he was dragged back. Charizard dropped out of the air and tumbled with Umbreon in tow, then they both fumbled until they lay on the grass. <br>\r\n          Charizard’s whole claw was pressed forcefully onto Bree’s mouth while trying to hold him down. Umbreon wasn't struggling, but instead clenching his eyes shut as hard as he can, biting on the dragon's claw, to which it hurt but Charizard stayed resilient.<br>\r\n          Tears began streaming down Umbreon’s face, and whilst Charizard had him pinned to the grass of their lawn, he already knew he had hurt Bree, bad. Charizard lifted Umbreon and squeezed him to his chest, hurriedly rushing inside and closing the door before dropping the hurt Pokémon onto their bed, on his back. <br>\r\n          Umbreon screamed the moment the dragon withdrew his arms from him, his paws pressed against his face as he writhed on the Altaria down. Charizard snapped back and flinched as he looked on at Bree. The moonlight Pokémon couldn't put together any coherent thoughts, focusing on his leg so much that it hardly mattered that the dragon who splooged his friend was cowering over his actions. <br>\r\n          Charizard shuddered as he witnessed Umbreon’s stretched leg. It looked like if Umbreon woke up and stretched his body, only to not let one let un-stretch. <br>\r\n<br>\r\n          He ran to the kitchen where Umbreon kept the berries, the words from Umbreon earlier ringing in his head, <i>Lum berry, Lum berry! Fuck, what's a Lum berry look like!</i> Charizard grabbed as many berries as he could, recognizing only the Oran and Persim berries, but holding a bunch in his claws.<br>\r\n          He returned to the room where Umbreon was sobbing, half screaming, and threw the berries onto the bed. One by one he tried to get Bree to eat them… but each time he'd bat at Charizard’s claws in fear of being strangled again. Charizard huffed, worried. <br>\r\n          “Which one is the Lum berry!” Charizard asked, trying to be heard over the slowly fading whines of Umbreon. The moonlight Pokémon cried again.<br>\r\n          “T—the green—one—!” Charizard cut him off by stuffing a plump, green berry inside of Umbreon's mouth, but he spat it back out, jerking away and curling up on his left side “g—get away f—from me—<i>chkh</i>—!! My l—leg—<i>aahh!</i>”<br>\r\n          Charizard backed up. His heart felt torn out of him, he felt so distant that the floor might as well be a void for him to fall through. Umbreon’s faint sobbing seemed to echo in his ears as he staggered away. He rubbed his head with his claw.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<i>I did this</i>, Charizard thought, <i>what do I do! His leg is so fucked! That’s gonna take so long to recover… and I can’t even imagine what he thinks of me now—I did so much for Umbreon! I’ve done so much and he—he didn’t even want to… to talk about it…</i></div></font></span></span></div></div>",
            "created":1555125000,
            "id":2644115,
            "title":"Chasing Umbreon"
        },
        "11111111111111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "If It Were A Choice..."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Bree erupted in a blood curdling cry as he tried craning his head away from the Charizard trying to force feed him berries, only to end up agitating his leg further during each attempt. <br>\r\n          \"Aaaah—God—Why!!! I-it— it hurts s-so much—grah!\" Bree tried to contain his cries, but the pain was just too much to bare. It was as if the entirety of his right leg was ingulfed in a hellfire! Every little twitch, even those caused by the searing pain itself, sending nerve wrecking pain all along his right leg and rear muscles. Bree's mind was racing, his breath grew ragged, and his heart was pounding. With the adrenaline easing off, the pain only got worse as time went on with no signs of letting up. <br>\r\n          <i>Why is this happening! Why is any of this happening!</i> Charizard panicked. <br>\r\n          \"Aaaaaahhh!!!“ Bree bit into one of his paws, perhaps as a vain attempt to take his attention from his leg pain, while allowing the other to just clench various places along his teary face. \"W-why—h-how could y-y-you do this t-to me!\" Bree whined, having trouble speaking as he gasped for breath between words. <br>\r\n          Charizard's face  was full of worry—having to witness the one he loved not only suffer, but also being helpless to do any thing about it. He couldn't even get Bree to eat the berries! What else could he possibly do besides force them down! <br>\r\n          \"P-please Bree—stop moving! I need you to—\"<br>\r\n          \"Haven't you done enough already—why couldn't you just let me go—ahh!\" Bree howled before biting back into his paw, fighting through the pain.<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n          Charizard’s eye twitched. Bree’s cries were drowned out by the blood rushing in the dragon’s ears.<br>\r\n          <i>Does… Umbreon still love me?</i> The thought echoed in his head like he were shouting it into a canyon, does he…<br>\r\n          “Please, don't hurt m—me Ch—” the orange dragon jumped up next to Bree, eliciting a shocked jerk from Umbreon, who gasped sharply and fell back onto the bed with a pained cry. “Ah! Don't—don't touch me!” Charizard pressed Umbreon into the Altaria down, one claw on each of the dark-type’s shoulders, forcing Bree to look up at him. This position was much like when they fucked just some time ago, yet this time Charizard was with solemn gaze, and he was crouched, not attempting to bruise him or irritate his stretched leg.<br>\r\n<br>\r\n          <i><b>. . .</b></i><br>\r\n<br>\r\n          “Umbreon…” Charizard whispered, the moonlight Pokémon shuddered as the dragon’s breath washed over his fur, and his strained leg kept causing the utmost of discomfort “do you still… please say you still love me. I'm so sorry about hurting you, I didn't mean for that to—happen so suddenly!” <br>\r\n          Bree was shaking uncontrollably, but he tried to speak between his repressed cries. Bree opened his mouth to say something, but he couldn't lie to Charizard, he couldn't say that he did, it just wasn't true! Charizard had chased him and dragged him back to where he churned Flare, what would this monster do to him? What would his long-time, hidden beast of a dragon do to him now that he was so vulnerable, pinned to his back a third time this night and incapable of affection for Charizard?<br>\r\n<br>\r\n          “Umbreon…” Charizard croaked, he'd been holding back his own tears the whole night until now. Weeping of his own, held, until Bree wasn't responding, until Bree kept his mouth shut, until Bree wasn't able to look him in the eyes and say it back to him. Charizard pursed his lips and pressed his head against Umbreon’s furred chest, beginning to sob. “Umbreon… you love me, right? Don't say you hate me!” <br>\r\n          The dragon tried to think of their many years together, attempting to come up with something positive… Bree smiling, Bree conversing with him at the Café, his small partner cradling next to his body as they slept together in this very bed… it was a blur. Charizard held tight to Bree’s body as he let out massive, conceded sobs, his body quaking with every throb of his heart.<br>\r\n<br>\r\n          It had began to affect Bree as well. This was not his friend, but a monster. A monster crying over his lost friend, wailing his apologies for murdering an innocent Flareon, sobbing his excuses of how he never truly hid his activities when he took care of other Pokémon who threatened his Umbreon… Bree was biting his tongue, fearful of this predator, and torn from having a good friend ripped from his heart, two of which in the same night.<br>\r\n          “You can't—you can't leave me, Umbreon!” Charizard sniffled. Umbreon frowned and looked away.<br>\r\n<br>\r\n          “I can't b—be with you, Charizard. I don't even—even know who you are—anymore…”<br>\r\n<br>\r\n<br>\r\n          <i><b>. . .</b></i><br>\r\n<br>\r\n<br>\r\n          “Charizard…?” The dragon was still. Shockingly still, staring into space as he loomed over the Umbreon he pinned.<br>\r\n<br>\r\n<br>\r\n          <i><b>. . .</b></i><br>\r\n<br>\r\n<br>\r\n          “Charizard? Charizard!! What are you d—doing!” Umbreon tensed up even tighter, his tail between his legs. The dragon’s mouth was open. Bree could see the widening, fleshy gullet that revealed itself after Charizard’s massive tongue gave him a moist grope along his forehead, leaving it drenched in saliva. Immediately Umbreon had flashes of the situation—he saw Charizard letting go of him and leaving his disabled self on he mattress, he imagined Charizard at the Poké Center, profusely apologizing, Bree visioned Charizard about to kiss him in a theatrical attempt to make up…<br>\r\n<br>\r\n<i><b>Homph!</b></i><br>\r\n<br>\r\n          Charizard clamped his mouth over Umbreon’s head. Their world was still for a moment, Umbreon shivering, looking wide-eyed down the dark tunnel as Charizard froze up.           Suddenly Charizard began to suck on Bree’s head, massaging his tongue around his snout and head and ears, tasting every square inch of the Umbreon’s face, tasting faint remnants of his own cum despite the dark-type having washed most of it away.<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n          \"C-ch—cha—zar!\" Bree could not seem to grasp his words as the room around him was eclipsed by a prison of fangs—his natural light revealing in vivid detail the contours of the fleshy tunnel glistening ahead, ready to accept him. The smell had been beyond foul, what one could expect from Charizard who primarily ate meat, and the grisly sound, and feeling of the dragons tongue as it slathered across his face left him feeling completely helpless.<br>\r\n          <i>Is—is this—he is r-really!?</i> The Umbreon had been brought back to the reality of his situation when the pressure around him grew tight, mashing him firmly within soft, slimy flesh of dragon tongue. A feeble yelp escaped Bree as his body stiffened upon feeling rows sharp teeth grazing along his ears and neck, threatening to bare down upon him at any given moment. <i>N—no... he—he wouldn't—he can't!</i> The throat before him closed, the gulp caused him to flinch as he watch the excess saliva that had pool up drain before his eye, the throat widening once again, allowing for a clear view of his destination. <br>\r\n          Bree snapped out of his fear induced paralysis as he felt his weight shift. Charizard had lifted him higher, tilting his head up to allow for Bree to slip deeper towards the sweltering hot abyss that awaited him, and for a brief moment, Bree managed to found his voice.</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1560051660,
            "id":2670585,
            "title":"He Can't Leave"
        },
        "111111111111111111111111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "But in his head..."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          \"No! Charizard—please! I—I'm sorry! Let's just—\"<br>\r\n          Bree felt the tongue he rested against lift him effortlessly, pressing him firmly to the roof of the maw before he slipped deeper towards the dragons  greedy gullet!<br>\r\n          \"No—wait—!\" <i>Gluck!</i> \"<i>Mmph</i>!\"<br>\r\n          Bree watched the throat converge suddenly seizing ahold of him, tugging him into its hot, moist, and putrid embrace. Just the sound of popping saliva thundering in his ear as the gullet closed in around his head was enough to make him want to scream.<br>\r\n          <i>Charizards eating me! He is actually eating me!</i> Bree's heart pounded hard and fast within his chest as he began to scramble frantically. In a vain attempt to pull free he tried using the dragons teeth as a foot hold with his front paws, but no matter how hard he tried, he could not bring forth the strength need to break free!<br>\r\n<br>\r\n          In this moment, Bree's lower half dangled helplessly from Charizard's maw, his right leg fairly motionless whiles the left frantically tried to gain footing on what ever it could. Charizard just kept his eyes forward staring off blankly as he slowly raised a claw, gently grasping Bree's sides, pushing him further into his maw until both of Bree's legs hung from the corner of his jaws, with the base of his tail outwards of Charizard's mouth.<br>\r\n          Charizard let his tongue wonder across Bree's soft fur, feeling Bree quaking in his jaws as he did so. Bree tried to beg, but the little Pokémon could only do so much to protest with the tight throat walls clenching his mouth shut. Charizard drowned out the sounds Bree made, paying no mind to the Umbreon's plight.<br>\r\n          Bree could only whine as he felt the dragon's tongue glaze over his soft belly, agonizingly slow. The tongue continued to explore farther much to Bree's discomfort, and soon felt the moist, warm touch of flesh prodding at his sheath, beginning to cradle his balls with the contours of the eager tongue.<br>\r\n          Bree instinctively tried to fight against the unwanted touch, only to lock up and cry out as pain shot through him! Bree went limp—there was nothing he could do to fight back! He couldn't move his right leg without excruciating pain, and no amount of fear could over ride that! Instead he wallowed in self pity as the Charizard proceeded to tease his most intimate of areas, thoroughly coating him in copious amounts of the foul saliva. The warm touch of Charizard's tongue was getting to him. Bree squirmed as he felt the tip of the dragons tongue slide back, only to snake its way into his sheath, prodding at his head at first, before tracing around the sensitive organ. <br>\r\n<br>\r\n          <i>No—please—s-stop this!</i> Bree was disgusted. He was being eaten, he was going to die! But that tongue, it felt unbelievable! Already he could feel the blood rushing to his groin, slowly engorging his cock. <br>\r\n          <i>No—I-can't, not now!</i> To Bree the pleasurable tongue to cock contact was too great and his body soon began to act on its own accord, grinding against the raspy surface of Charizard's intrusive organ. He could feel the blood rushing to his head, clouding his judgment for the better, as well as all other feelings as he began to rut against the slick appendage. The Umbreon's pleas rung silent, replaced by a pained whimper as Bree erratically thrashed against the tongue, grinding himself against it to the best of his ability, unable to hold back his desires any longer.</div></font></span><br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Charizard leaned his head back, eyes hazy with a blank stare. The glow from Umbreon’s body had been cut off from the room with each swallow, yet the last two circles on his hips bucked with every hump against the dragon's broad tongue. Bree cringed for the pain, moaned from the pleasure, and shuddered from the reality that Charizard, his protective friend, was dooming him to a fleshy tomb. <br>\r\n          <i>He can't do this to me! Why is he violating—me—nnghh!</i> Bree’s following orgasmic howl was silenced when Charizard took another gulp, forcing his mouth to close within the tight confines of the dragon’s throat. Although his balls felt empty from their earlier activities, Bree could not help but feel a surge of muscles in his lower body working to pump out another load. He whimpered and clenched his teeth together as the pain and pleasure collided, forcing a powerful shot of his white cum against Charizard’s tongue. <i>No! No! It feels so good but I can’t—please stop this Charizard!</i><br>\r\n          The dragon worked his muscles to be able to swallow an Umbreon whole. Taking his claws off of his slowly softening rod, Charizard placed them onto Bree’s rear. He groped and squeezed while shoving the dark-type deeper into his confines, pleasuring himself just a little more before the prey disappears. Bree’s back legs—his normal, frantic one, and his stretched, restrained one—stuck out of Charizard’s mouth awkwardly since the dragon did not want much suffering to come to this meal. He snatched up the healthy leg and crammed it into his mouth as it could still fold, but he gently grasped the hurt leg and guided it into his throat.<br>\r\n<br>\r\n          <i>Not my legs too—ow! I can't see either!</i> Bree’s eyes were clenched shut because of the tight muscle that restrained his facial movements, leaving him cramped and with his paws stuck to his chest as he slid down the fleshy tunnel. With his tail swallowed, and his stretched leg being pressed and squished despite Charizard’s efforts, Umbreon wanted to wail. Who does he call for help now? Instinctively his gut said Charizard—but that's the problem! His supposed-to-be savior was sending him down into his plump belly instead!</div></font></span><br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          From the outside, one could see the frantic struggles a hapless Pokémon fighting for its life as it that slipped slowly down Charizards gullet, his prey's tiny paws struggling in vain to alleviate the crushing walls that rippled along its body as he inched ever so slow to the ravenous belly just below it. In the darkness of the room, Bree's glowing rings could be seen through Charizard's bulging throat, the skin almost skin tight flesh providing a clear and vivid image of his body as well as every little twitch he made in an attempt to best to fight back against the peristaltic contraction that brought him closer to his inevitable fate as mere food.<br>\r\n          Charizard's heartbeat rang throughout Bree's ears, an underlying thrumming to a cacophony of splurts and squelches of saliva and flesh embracing him tightly. Try as he might, he could not drown out the sounds with his own cries, and thoughts, nor could he ignore them. He wanted to scream—beg for it to end, but the throat kept his maw clamped tight, leaving him to dwell on his fate while his mind ran rampant with confusion, anxiety, and fear. Even now the hellish sounds bombarding him were only made worse as the blood rushed to his head, seemingly amplifying, and dispersing any rational thoughts that may cross his mind. <br>\r\n          To make matters worse, Bree's hind legs stiffened up as his now overly sensitive cock slipped beyond the yawning abyss of Charizard's throat, those tight muscles enveloping his twitching cock in a painfully tight embrace, racking his body with such overwhelming pleasure that it hurt. Despite this, Bree's body refused to obey his will and he found his hips bucking from the mere contact of his throbbing cock being crammed between his soft belly and rippling muscles of Charizard's throat. Fresh tears formed as Bree gritted his teeth, his whine bleeding through clench lips, bracing for even more pain to come once his legs begin to slip down with him...but it did not come, not yet at least.<br>\r\n          <i>W-what? What is he—!</i> Bree felt a tight grip just below his head, preventing him from slipping further, but this is not what caught his attention. Just beyond Charizard's gullet, Bree felt as his aching balls were caressed—cupped nicely within the crease of that powerful tongue, not only that but said powerful tongue now prodded at his backdoor, eager to get in. <i>No! Please—not there!</i> \"<i>Mmmph!</i>\" <br>\r\n          Bree locked up, his entire body going rigid upon feeling Charizard's thick, slimy, and incredibly hot tongue breach through his feeble defense. <i>I—I can't fight it!</i><br>\r\n<br>\r\n          It all felt so surreal. No less than an hour ago, Charizard was plowing his ass, making him feel pleasure no other Pokémon had given him... a wondrous feeling of dragon meat sliding within him, rubbing him in all of the right places, stretching him in all the right ways. Even now he could recollect the warmth he felt, every throb, and every twitch as Charizard's cock came within him... now as his tongue does the same, all he can feel is disgust. All the sensations he felt as it thoroughly tasted every part of him, something he once would have imagined as heavenly, now made him sick to his stomach.</div></font></span><br>\r\n<div align=\"right\"><i>Original</i></div></span></div></div>",
            "created":1560566400,
            "id":2673418,
            "title":"He Would Never Let Him Go"
        },
        "11111111111111111111112":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "At the Poké Center."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Charizard’s eyes widened as Umbreon tried to move, only for the dark-type to yelp in horror when a muscle in his pulled leg seemed to cause troubling pain. His paws and uninjured left leg were curled up while he crawled sideways towards the head of the mattress, smudging his fur in cum again. Charizard grabbed more berries. <i>Maybe, I can get him to calm down… by confusing him… that might—no, sleep. I need him to sleep</i>, Charizard gasped as a thought came to him. <i>I can fix this!</i> Umbreon did not move too much from his placement on the bed, still in reach of Charizard, and the dragon gently pulled him back.<br>\r\n          \"Aghh! No! No no! <i>Gh</i>—let go of m—me!” Charizard gulped as the words made his heart sink, but the rising hope in his gut pushed through when he got his claws around Umbreon’s head. He pried open Bree’s jaw despite his crying protests and shoved a whole berry into his mouth, which caused the black-furred Pokémon to gag, but ultimately swallow it down. Charizard did not know what berries were in his claws, as he left out the only three he recognized so that what he's doing might just work.<br>\r\n          Umbreon choked down multiple berries—most of them being much larger than what he could tolerate in a gulp—so many that his belly had bulged about an inch. This caused multiple effects being applied to his body. He was sick and numb and sleepy and confused, but felt absolutely cured of all burns and poisons, at least. As he lay there in Charizard’s grasp, he slowly lost consciousness, watching the outline of Charizard’s worried face double, then triple, and then start rotating.<br>\r\n          He was still fearful, but of what, it seemed to fade out of his head. Bree’s eyes squinted to focus on the orange mass cradling him while he tried to figure out why his right leg felt weird and out of place. Charizard hugged Umbreon, watching the disoriented, tiny Pokémon close his eyes and droop limply in his arms.<br>\r\n<br>\r\n          <i>I've got to get him to a Poké Center.</i><br>\r\n<br>\r\n<div align=\"center\"><b>———</b></div><br>\r\n<br>\r\n          Charizard stood on the sidewalk in front of their neighbor’s house. He opened his eyes to see the blue sky and the quaint, white door just short of the porch. He flexed his claws over and over before stepping forward along the path, reaching the shade of the small platform. The dragon reached forward.<br>\r\n          <i>Knock, knock.</i><br>\r\n          “<i>One moment!</i>” Called a voice from the inside… Charizard gave a sigh of relief. <i>Shuffling, scurrying, thumping,</i> until finally the door clicked. A friendly-looking Dragonite, eyes beaming, met Charizard as the tall entrance opened. “Hello.”<br>\r\n          “Hey.”<br>\r\n          “How are you?”<br>\r\n          “I'm good, Dragonite,\" their neighbor, despite being a Dragonite, was the runt of his family. The two dragons stood face to face, equal in height.<br>\r\n          “That's nice, hey I heard a ton of noise last night, what was that?”<br>\r\n          “Umbreon got hurt, had to take him to the Poké Center.”<br>\r\n          “Shoot! Why don't you come in, what happened?” Dragonite stepped aside, motioning for Charizard to come inside. Charizard walked in, folding his wings slightly to not hit anything. With the door closed, Dragonite made space for the two of them in his spacious room.<br>\r\n<br>\r\n          <b>…</b><br>\r\n<br>\r\n          “He woke up a few times, mumbling about who attacked them, the nurses were astonished from the berries. I, regrettably now, thought that berries would help him, but I had Umbreon eat so many that they didn't digest properly and different berries took effect at different times,” Dragonite was wide-eyed as his guest told the story “they were almost home too…” Charizard explained. Dragonite raised a brow and put his claw to his chin. The two Pokémon were sat in two opposite chairs, the light of day bursting from the sliding glass door that lead to Dragonite’s backyard.<br>\r\n          “A dragon-type you say. Do you know what Pokémon it was?” The bright-orange dragon leaned forward when Charizard frowned. “No, it couldn't have been another Charizard? Not after—wait—did Bree think you attacked him and Flare?” The orange dragon nodded, Dragonite gasped. “No! Was that what he was mumbling?”<br>\r\n          “At least, Bree kept saying it was me,” Charizard huffed. Dragonite tilted his head.<br>\r\n          “What, didn't you attack him—it was a him right—I mean… that's how Flare got… Charizard?” The orange dragon stood up. “No, do you think it was me? I wasn't—I wasn't home, I was out! No no no,” Dragonite stood as well, waving his massive claws in a dismissive motion “I would never hurt you or Bree.”<br>\r\n          “A Dragonite. I hurt them with a fire attack. Let me see your back!” Charizard barked. <br>\r\n          “Fine, fine! Geez if you wanted to come in here and accuse me you shoulda just said so at the door!” The exasperated Dragonite turned around. “There! You gonna apologize now?” Suddenly, Charizard surged forward, rushing into Dragonite’s turned posture. “Agh! Hey!”<br>\r\n          <i>Haven't had a Dragonite before</i>, Charizard smirked.<br>\r\n<br>\r\n          <b>…</b><br>\r\n<br>\r\n          <i>Rumble…</i><br>\r\n          “I should have done this shit before I—” Charizard groaned, leaning over the counter in his bathroom, a tuft of red fur in one claw and a bag in the other “I shouldn't do that too often. Probably should've churned ‘em instead.”<br>\r\n          A roar erupted from his body. “<i>Let me out, Charizard!</i>” <br>\r\n          “Son of… don't make me do it again,” the orange dragon moaned, readying up a curled claw to knock the Dragonite on his head.  His gut jerked, causing Charizard to cringe. “Damn it!” He slammed his fist onto the indent of his stomach, but his eyesight went hazy and he bent over, dropping the bag with Flare’s fur. His body convulsed, as he rushed over to the walk-in shower. With teary eyes, his body betrayed him, forcing up a large mass onto the tiled floor of the shower.<br>\r\n          Charizard rubbed his eyes, angrily and sickly. Heaving, he inspected the unconscious, slick yellow Pokémon on the floor. “Fuck you then, churning it is. It'll save me time anyways…” the faucet turned on to spray the both of them with water, Charizard kept his tail up and away from the sprinkle that rinsed off the Dragonite.<br>\r\n          “You're not gonna enjoy this,” Charizard sat against the wall, his cock sliding out of its spot as he aligned it with the Dragonite’s snout “<i>I</i>—won't get to enjoy this either, <i>I've</i> got to make this <i>quick</i>…”<br>\r\n<br>\r\n          “for Bree.”<br>\r\n<br>\r\n<div align=\"center\"><b>———</b></div><br>\r\n<br>\r\n          <i>Beep. Beep. Beep.</i><br>\r\n          <i>Whirrr...</i><br>\r\n          His nose twitched. Umbreon opened his eyes to see the familiar red and white trims of the walls. His paws were folded in front of him as he lay on his back. Bree looked down to see a thin blanket covering his body up to his chest, and the soft lights of the outside.<br>\r\n          “Hmm, ...” Umbreon carefully stretched and sat up. An orange body in the room made him gasp and press back into the metal of the small bed. “Charizard! You scared me,” Charizard slowly stood up and made his way next to Umbreon.<br>\r\n          “Sorry! I was hoping you'd wake up eventually, I was so worried,” Charizard cautiously opened his arms to hug Bree.<br>\r\n          “Why am I here?” Charizard paused before the dazed Eeveelution, sighing and looking away. “What, was I hurt? I'm the one in the bed—did something happen?” <br>\r\n          <i>Wait… how much does he remember?</i> Charizard thought, <i>It only happened last night, and it's quite late out today—</i><br>\r\n<br>\r\n          “Charizard?”<br>\r\n          <i>I can still follow through with this—</i> “Yes.”</div></font></span><br>\r\n<div align=\"right\"><i>Alternative</i></div></span></div></div>",
            "created":1555126920,
            "id":2644124,
            "title":"With All of His Effort..."
        },
        "111111111111111111111121":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Alternative Ending by Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          “What happened?”<br>\r\n          “You and Flare were… Flare insisted that he go home and—I don't know why you and him just left by yourselves—”<br>\r\n          “What are you talking about? Me and Flare left… the house?”<br>\r\n          “Yeah,” Charizard looked taken aback “Umbreon, are you alright? Do you remember anything from last night?” Bree was silent. He shook his head and rubbed his face with his paws before answering, Charizard placed a claw on the bed, on Umbreon’s right leg. Bree twitched again, forcefully blinking a couple times as if in thought.<br>\r\n<br>\r\n          “I think… I went to sleep… woke up to you over me, you were really hot—being the fire-type you are but like you had stood in front of the heater…” Umbreon squinted, the feeling of being drenched coming back. In his dreams he had felt awfully wet. Charizard looked at the moonlight Pokémon intently. “You… did we… <i>do</i> it?” Bree's emphasis on <i>do</i> made him start to blush.<br>\r\n          “I told you that I loved you, do you… remember?” Umbreon’s face turned a bright rose.<br>\r\n          “Oh my god, I remember that,” Bree’s tail curled between his legs “I remember being wet… that… and fur. Red fur, and lots of…” his eyes widened “what happened to Flare?” Charizard frowned. Bree shook his head. “Is Flare… o.k.?”<br>\r\n          “I don't want to describe it, Umbreon, but he's dead,” Charizard huffed, looking down “I'm sorry I wasn't there in time—”<br>\r\n          “What! He's dead!? How!” Umbreon’s fur was on end, Charizard was about to speak but the dark-type cut him off. “How did it happen?”<br>\r\n          “Dragonite, Umbreon. Our fucking neighbor tried to shove y—he got Flare and tried to get you too!”<br>\r\n<br>\r\n          “Dragonite?” Bree sharply gasped, but it seemed to explain the blurry figure that was— “I don't… believe he'd do that…”<br>\r\n          “I heard you yelping and I got up, went outside to see that bastard holding you to the ground,” Umbreon frowned and pictured the plump, bright-orange dragon above him, a brief flash of a large figure pressing his shoulders “you were wet, that's because I found out he'd used water pulse on you. But he did something right in front of me, to you, that I made sure he paid for.”<br>\r\n          “What? What happened?” Bree had leaned in on the bed, both appalled and shocked, but worried and wanting to goad Charizard to tell.<br>\r\n          “I don't really want to tell you, Umbreon. You don't want to know—he already damn near pulled off your leg anyways, I don't want to make it worse for you,” the dark-type drooped his ears in disappointment.<br>\r\n          “W—well, fine, what did he do to Flare?” Charizard’s frown became depressed and he turned his head away. Bree’s eyes welled up with tears, but he placed a paw on his roommate’s claw. “Charizard… I'm not as afraid to hear the truth as you may think.”<br>\r\n<br>\r\n          “Dragonite… he had gotten ahold of Flare somehow… he got you both with his water pulse, and Flare apparently seemed like the perfect opportunity, he bragged about how you took two to get confused,” Umbreon tilted his head.<br>\r\n          “You talked to him?”<br>\r\n          “This morning. I'll get to that in a second, Umbreon,” they both were quiet as the dragon recomposed himself “he… ate Flare with his cock, blasting you with a really long, continuous water pulse, standing right over you and aiming at the street to keep you down, trapping you, silencing you from shouting for me—the fucker—and he took his time too. I think we're both shocked to hear our that this was our neighbor, but I was angry. He toyed with Flare, right in the middle of the street! I'm surprised no one but me came out. When he couldn't keep you down any longer, you made a break for it, running back home, but he caught up and yanked your leg, which is why I had to get you here to the Center,” he gestured towards Bree’s leg, and to the credit of the Chanseys, it was healed, but a brief stretch from Umbreon revealed the soreness. <br>\r\n<br>\r\n          “He pinned you to the ground of our front yard, and the nasty fucker was so excited over the whole ordeal he didn't realize Flare wasn't fully churned. I burst open the door to see him unloading on you, Flare’s red fur and Dragonite’s cum all over you and on the grass. I flew at him with my strongest fire attack, Groudon would be proud of how strong that fire was. <br>\r\n          He ran off in pain while I carried you inside… you were so fucked by that cowardly dragon that you didn't even know who was attacking you by that point. Your brain must've assumed <i>I</i> was because from between home and here you kept mumbling I attacked you. I don't blame you for that, but I did mess up,” Umbreon was out of tears to cry, and almost at a loss for words.<br>\r\n          “What do you mean? You didn't hurt me, you brought me here! Were the nurses accusing you?!”<br>\r\n          “No, no, they could tell you were confused and just all-around screwed. I washed you off but you were still confused and terrified. I didn't realize Dragonite had severely hurt you until I—I had done something stupid and forced you to eat a ton of berries, I didn't know what was what but I thought it could help, but it just… I made it worse because you were pretty much having an effect meltdown. Saw your leg and... carried you here. I stayed in here until I got too angry.”<br>\r\n<br>\r\n          “That's not your fault, I never labelled them. I think, I think you had asked me which was was a… a Pecha berry right?”<br>\r\n          “Lum. Pecha is for freezing and you weren't frozen,” Charizard corrected him “you know, the yellow one?” <br>\r\n          “Pecha’s a pink, <i>heart</i>-shaped berry. For <i>poison</i>,” Charizard huffed as Bree shook his head “I've got to re-teach you your berries, dummy,” Umbreon shut his eyes and gave a deep, heartfelt sigh.<br>\r\n          “Whatever,” Charizard leaned forward and hugged Bree, who could only put his paws up and press into the dragon’s skin as he did so.<br>\r\n          “What about Dragonite?” Charizard let go of Umbreon and sat back where he was.<br>\r\n          “... You can't tell anyone about this, what I'm about to tell you, Umbreon. Please promise me,” he asked, tightening his grip on Bree’s leg softly. Umbreon nodded. <br>\r\n<br>\r\n          “I went to his house. He opened the door for me, but as soon as he saw my face he started laughing. If I wasn't so bent on figuring out why he did this, I would have killed him on the spot… mockingly, he let me in and began to talk immediately about how he saw you and Flare alone at night. Told me <i>everything</i>.He hadn't gotten any tail for a whole month so the lonely prick went out and tried to grab you both, but when you and Flare rejected his random-ass request he got angry.<br>\r\n          Told me about his water pulse and how he'd used it so much—it was a TM by the way—that he'd made his throat too sore to do it for a bit. Dumbass said it right to my face. He was planning on taking you back to his house and keeping you there. Oh, I'd gotten so…” Charizard shuddered “I just attacked him then and there. Fought him right in his own house. But… Umbreon, this is what I need you to be silent for… what I did with him—”<br>\r\n          “<i>With</i> him?”<br>\r\n          “Yes… I decided to make Dragonite go out the same way he took out Flare—”<br>\r\n          “Serves him right!” Charizard paused hearing Umbreon cut him off.<br>\r\n          “Wait, you—you're not…?” Charizard uncomfortably jostled—a half Dragonite-sized load was brewing in his sac. If he didn't relieve himself a little at home, the bulge beneath his hidden cock would've made him harder than last night.<br>\r\n          “Of course I'm not mad at you! You had good reason to!” Charizard was overcome with a surge of relief, one like being told you weren't in trouble, one like you were told that you had found a cure and were being congratulated for your efforts, one that said that someone still loved you. The dragon grabbed Bree and gave him the warmest embrace that he had never been able to give to another Pokémon before.<br>\r\n          “Thank you, Umbreon!”<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><b>———</b></div><br>\r\n<br>\r\n<br>\r\n          The next day, Charizard and Bree returned home after working, having readied themselves for each other. Charizard was ready for the moonlight Pokémon with another mousse he'd bought from the Poké Mart, while Umbreon took some time to appreciate this newfound love, hopping onto their clean bed, compliment from the dragon while away from the Center, and waiting. <br>\r\n          His dragon savior returned to find Bree in an unexpected, presenting position, tail in the air, beckoning him forward. Charizard placed his gift down before diving into their room, groping the Eeveelution's rear before getting onto the bed himself, girth sticking out and ready to pleasure his little lover.<br>\r\n          \"You know, it's a blessing you have opposable claws.\"<br>\r\n          \"Oh~? Why's that?\" Charizard gave a firm stroke along Bree's side.<br>\r\n          \"I'd never be able to make the bed!\"<br>\r\n<br>\r\n          To this day, even though it takes the dragon a while to ready himself, it seemed to Bree that Charizard always had the largest, tastiest loads he'd ever experienced from another Pokémon.</div></font></span><br>\r\n<div align=\"right\"><i>Alternative</i></div></span></div></div>",
            "created":1555129740,
            "id":2644131,
            "title":"Someone Lost, Someone Recovered."
        },
        "111111111111112":{
            "author_id":"spyro123",
            "author_name":"Tsuki",
            "choices":[
                "Off to the neighboring forest by a secluded lake. "
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Tsuki</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          With his cock clenched tight in one claw while fondling his prey with the other, Charizard allowed his thoughts to flow free, using Flare's suffering to fuel his lust addled mind. He had to admit, Flare was doing a damn fine job with those struggles of his, and all he needed was a little motivation. Charizard took a mental note about using his tail flame in such a way for future fun.  A sudden swift, well-placed kick caused the dragon to gasp, his eyes shooting wide as he bit his tongue in order to silence himself.  <br>\r\n          \"What the hell—Hnngh!\" Charizard started to mutter to himself just before he keeled over, a familiar feeling of pleasure rocketed throughout his body. <i>Is he—hitting my prostate—with his kicks?!</i> Flare must have taken notice to his captor's reaction, because soon after the thought crossed his mind, another swift kick, though not as well-placed, struck the dragon again, sending another surge of spine tingling delight up his body. <i>God damn it feels so good!</i><br>\r\n          \"Hey... settle down in there!\" Charizard spoke under his breath, his voice just loud enough that he was sure Flare would hear, and to punctuate his frustration, he mashed down on Flare's body in order to get the point across. Flare of course did not listen, to busy trying to fight for his life, and the pressure of the Charizard's inner walls squeezing him tightly by no means helped calm him. Instead, Flare's pleas only grew much louder as he panicked to get free from this hellish sack. <br>\r\n          \"Mmph… shit...hngk...This isn't good...\" Charizard spoke under his breath as he sat up on the couch, his heart beating fast and his claw clenched tight around his cock. Flare was by no mean his first prey to be consumed by his cock, but who would have known this little shit would manage to find a way to bring him so much pleasure! Under any other circumstance this would have been a good thing, but Charizard was finding it hard to contain his composure! He need to go somewhere, and fast! Bree may be a heavy sleeper, but he was not gonna risk finding out if he could sleep through one of his climatic roars! <br>\r\n          Taking a decorative pillow that had fallen to the floor a little while earlier, Charizard bit down onto it as a means to muffle his grunts. He needed to get out of the house, fast! Thankfully, the sudden shift of position seemed to have thrown Flare off, but who knew how long it would be before he find the sweet spot again. Already Charizard could feel the little bastard flailing around in a panic, trying to get another reaction out of him. <br>\r\n<br>\r\n          Charizard carefully got up from the couch, and to the utmost best of his ability, made his way to the door, careful to make as little noise as possible. Fortunately he did not need to go far to reach the front door. As he delicately turned the knob he cringed as the handle screeched mid turn— a sound he knew all to well would not wake Bree, but with tensions so high, it almost seemed deafening!  Once he had the handle turned, he proceeded to open the door, making sure as to not let the handle go in the process; he did not want to have to turn it again unless he had to.<br>\r\n          <i>Almost home free!</i> \"Mmmph!\" Charizard gasped into the pillow lodged in his mouth. It seems Flare found his barings again, but by this point the dragon had just started shutting the door to the house, quickly letting go of the door knob as if he were ripping of a bandage to latch it shut. \"You cheeky little—I bet you think you're clever don't you!\" Flare only respond with another flurry of swift kicks, screaming to be let go.<br>\r\n          \"Oh don't you worry, once I get somewhere nice and quiet, we are gonna have a little more fun...\" Charizard grinned, feeling Flare's panic rise. He knew the perfect place. Gently setting the saliva drenched pillow off to the side to be washed later, he flared out his wings and prepared to take flight. With a mighty kick of his legs, Charizard vaulted off into the night sky with unprecedented speed, heading off towards the center of the woods where nobody would bother him and his unruly little toy.</span></font></div>   <br>\r\n<div align=\"right\"><i>Alternative</i></div></span></div></div>",
            "created":1554786000,
            "id":2642805,
            "title":"A Flareon With Spirit."
        },
        "1111111111111121":{
            "author_id":"spyro123",
            "author_name":"Tsuki",
            "choices":[
                "Charizard can't hold out any longer. Flare makes it out, but is still trapped.",
                "Charizard feeling hungry! Self fellatio with a bonus! ",
                "Charizard has plans for the lubed up Flare! Butt stuff!"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Tsuki</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Charizard made haste towards what he liked to refer as his 'home away from home', a nice secluded cavern by the waters edge within the neighboring forest. The foliage that circled the lake perimeter grew lush and vibrant, providing an effective screen from civilization as well as dampening all sounds from the outside world that lay beyond them. It was an ideal  place to go about having his fun away from the prying eyes of others, and any sound that may be heard would likely go ignored out of fear the wilderness presented for those who were not prepared to face it.<br>\r\n          A cool, damp musk welcomed the rowdy fire dragon standing before the small cavern. While not much for humid environments, the cave provided a perfect balance for the Charizard, and its earthy aroma was a welcoming change from that of home, but right now was not the time to enjoy such simple pleasures, in fact he had something much better to look forward to in the coming moments. Charizard proceeded further into the cave, the light of his flame illuminating the rock wall around him. He only had to take a couple of steps to reach his destination—a thick mat of assorted plant matter he had built up, replaced, and all around maintained over the course of a couple of years.<br>\r\n          <i>Damn—little guy's persistent!</i> Charizard thought as he stepped onto the slightly damp bedding, plopping down, and making himself comfortable before guiding his tail back around front, careful not to expose it too long to the bedding—a mistake he has done multiple times now. Thankfully the moist atmosphere kept the grass just damp enough that setting the bedding ablaze accidentally was fairly difficult, but fresh green grass still burned, and the black smoke it made was not something he found enjoyable in the small confines of the tiny cave. With a sigh, Charizard readjusted a bit before glancing back down between his legs. Ever sense knocking Flare around and taking off to the sky, Flare has been mindlessly struggling, desperately trying to find that sweet spot again, but now it seemed the little guy was gonna need a helping hand in order to get the results they both wanted. Luckily for Flare, Charizard was more then happy to steer him in the right direction again. <br>\r\n          \"Hey, listen for a—\" <br>\r\n          Flare did not listen, instead he continued to aimlessly struggle, getting nowhere. Angry, Charizard cupped his claw around the frantic bulge, pressing down hard and pinning Flare in place before raising his voice. \"I said listen!\"<br>\r\n<br>\r\n          Flare cried out as he felt the dragon smother him against the sack walls. He could feel the anger in Charizards voice, and despite wanting nothing more than to get out, he found himself freezing in place in fear of angering the dragon further. Everything was silent, only the sloshing cum that covered Flare and the sound of his little heart beating wildly in his chest could be heard. <i>Did—did he just tell me to listen!? What could he possibly have to say to me! Why can't he just—just leave me alone!</i> Flare began to struggle once again, but Charizard quickly put a stop to that with a simple squeeze, making Flare think twice about resisting further. He was completely at the mercy of Charizard. As much as he would have liked to resist he simply could not do so... He had no other choices but to listen, and to expect the worse.<br>\r\n          \"Listen... If you want any chance of getting out of this alive you better listen closely...\"<br>\r\n          <i>W-what?</i> Flare fell still. <i>Did he... is he really...?</i> For a moment, a feeling of hope washed over him—but that moment was short lived as doubt began to take its place. <i>No, he's bluffing, he has to be! Why would he—this is just another trick! Another way to fuck with me!</i> His tearful eyes swelled up again. \"Why should I believe you!\"<br>\r\n          Flare didn't get a response from the dragon, only silence. He was not sure if maybe Charizard couldn't understand his horse voice, still very sore from his tongue assault from earlier, or if he  just didn't care...that is until he felt a gentle prod to his side, just bellow the glow from the dragons tail flame. <br>\r\n          \"Do you feel that... I want you to kick directly opposite from where I am pressing.\"<br>\r\n          <i>Is he...showing me where to kick?!</i> Flare waited for the dragon to let up so he could move again.<br>\r\n          \"You only have one chance as I am sure you know... do not waste it...\" Charizard smirked.<br>\r\n          \"Who knows—Maybe if you           do a good enough job, I'll even let you go.\" Charizard knew what Flare wanted to hear, and he got just the reaction he wanted.<br>\r\n          \"R-r-really?!\" Flare stuttered, still trying to keep himself from crying. \"W-wh-what's-t-the catch!?\"<br>\r\n          \"What's the—what the hell do you mean!\" Charizard would have laughed if not for the fact he was getting impatient. \"Do you want me to turn you to cum! You better hurry, you don't have all night!\" Charizard gave one last firm push before pulling his claw away, taking a hold of his cock once again while using his free claw to guide his tail back to the spot he had just pressed, giving Flare some light to work with. \"I'd say you have about an hour before you reach the point of no return... and you wouldn't want to come out missing limbs would you?\"<br>\r\n          \"You better make up your mind fast though. If I go soft, you can kiss your chance goodbye... What you did earlier was good, but I doubt you're that good.\"<br>\r\n<br>\r\n          Flare's heart sank from the prospect of such a fate. What choice did he really have. Even if it was a lie, his fate would be sealed if he did nothing. Without further question, Flare quickly rolled over,  his back against the dim light, and his legs cocked,  ready to unleash hell against the walls around him. With a new sense of urgency provided by Charizard's last words, Flare began kicking with all he had, knowing full well his life was on the line... it only took a few kicks before they both got the reaction they both seeked.<br>\r\n          \"Yes—just like—show me just how bad you want out!\" Charizard huffed, stroking his cock slowly to Flare's frantic struggles, even giving the little guy a few firm gropes to incite more fear to fuel the fire. Just because he steered him in the right direction did not mean he was going to make it easy for him after all... not like it will matter in the end anyways. <br>\r\n          <i>Oh man, he's really going at it!</i> Charizard felt his heart rate rising from the excitement, and the thought of Flare giving it his all for a chance at making it out of this alive only made it more thrilling. Charizard closed his eyes, steadily putting more weight down onto his prey, his tongue hanging from the side of his mouth as he savored the moment, imagining the fear on Flare's face grow more pronounced as he became more desperate with each passing second. \"Mmmmm—come on now—don't tell me that's all you've got in you!\" Charizard taunted, making sure Flare could hear him. Sure enough Flare grew increasingly more worried, crying out as he exerted more energy pleasuring Charizard.<br>\r\n<br>\r\n          No matter how hard Flare tired, Charizard only seemed to become more rough in his treatment, grinding down upon his small body, making it increasingly more difficult for him to fight back! With every passing second, Flare could feel the temperature of his prison rising, the heat becoming more unbearable even for a fire type such as himself. It only grew worse, but he could not afforded to give up, not as long as he still had a chance!<br>\r\n          <i>This—Flareon~!</i> The feeling of Flare's paws stretching him from within, doing what ever took to keep him from being crushed—the trembling of his frail body buckling under his grasp as he kneaded the bulge—it's been too long sense he's experienced such pleasure having something inside him fighting for their life! Charizard found himself thrusting his hips, as he crushed Flare tighter against the back to allow for more stimulation. His mind slowly clouded—only the thoughts of what to do with Flare as he came out filled his head. <br>\r\n          Maybe a little snack was in order. Already Charizard's mouth began to water. The idea of sucking Flare out tempting with each passing second. Just picturing the look on the Flareon's face as he came out, only to be stuffed down his throat excited him. Then another idea came to him, and the best part is that Flare will already be lubed up. <br>\r\n<br>\r\n          <i>It has been a long time sense I've had that kind of fun</i>, Charizard thought while he began to trace the rim of his ass with one of his talons, already lubing the soft flesh with the cum that started leaking profusely from his cock as he pondered the option of stuffing Flare into it. What better way is their to take someone out then to utterly humiliate them.<br>\r\n          Flare began to hyperventilate, putting everything he had into his kicks while fighting of the crushing force of the fleshy walls around him. Ever second that passed, Charizard steadily grew heaver, making it harder for him to breath. He watched helplessly as the cum levels rose higher, and higher! He could hear Charizard moans of overwhelming bless over the sounds of the churning cum that sloshed around him, his thrust growing increasingly more violent each time! Flare whined as the pool of seed reached up to his eyes, the fear of drowning in cum becoming increasingly more apparent by the second! He needed to keep fighting!<br>\r\n          <i>Oh please Arceus don't let this be it—please I beg of you!</i> Flare closed his eye, taking one last breath before going completely under!<br>\r\n          \"Th-that's it—a-almost—there!\" Charizard spoke between clenched teeth as he held for as long as he could. He could feel his sack clenching around Flare as he felt the Eeveelution's tiny body prying at the exit of his sack, ready to be expelled back into the world!</div></font></span><br>\r\n<div align=\"right\"><i>Alternative</i></div></span></div></div>",
            "created":1556486400,
            "id":2651815,
            "title":"Charizard's Secret Lake Den "
        },
        "11112":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Twines</div></i> <br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          Charizard raised a brow.<br>\r\n          “Huh?” Charizard called back.<br>\r\n          “Someone from work!”<br>\r\n          The dragon gave a small huff of disapproval. <i>Could've at least told me,</i> Charizard complained, <i>I mean shit, that's the second time this month.</i> Although, unbeknownst to Umbreon, Charizard did become friends with the last one… but there was one time where Umbreon invited a rather rude and insulting Gallade, the dragon gladly took care of <i>that</i> one with his co—<br>\r\n          “His real name is Tai, but I've been calling him Flare as he's not very fond of his birth name,” Umbreon called, interrupting Charizard’s thinking. <br>\r\n          “Really? Why's that?”<br>\r\n          “You know, I don't remember, maybe we could ask him when he gets here,” Umbreon stepped into the open shower, turning on the faucet to allow a calming spray of water to fall, then raising his voice, he continued. “He's a Flareon who started working with us about a week or two ago. Flare’s main job is to collect weeds and burn them so we can use the ashes for compost.”<br>\r\n          “Oh, you could have just gotten me for that,” Charizard teased, walking into the living room and plopping down on their couch. The sofa was large enough to fit at least two Charizards, but instead had only one of those indents and a much smaller dip from Umbreon. <br>\r\n          “Ha ha, well you know that your flames are too powerful for that! He is incredibly shy, as well as new to the area, so he does not know a whole lot of other Pokémon. Try not to scare him too bad if you answer the door,” he shot jokingly.<br>\r\n          “Got it!”<br>\r\n<br>\r\n          Charizard relaxed and spread out on the couch, only slightly disappointed that he might not have a go with Umbreon tonight like he wanted… but minutes of listening to running water and staring at the blank screen of the t.v. made the dragon drift into a peaceful calmness. It <i>was</i> a real bummer though. He sighed. This <i>should have</i> been his night. <i>Whatever makes Umbreon happy…</i> Charizard reasoned. <br>\r\n          <i>Knock, knock.</i><br>\r\n          The dragon perked his head up.<br>\r\n          “Must be Flare,” Charizard stood up “Flare’s here!”<br>\r\n          “Well, let him in!”<br>\r\n          Charizard headed for the door. When he grabbed the handle with his claw, he looked down expectantly. The fading light of day pierced the growing darkness of the room. Immediately he recognized the red fur of a small Pokemon, and the look of surprise which followed. Standing below the massive dragon was a Flareon whose hair looked to be on end and his mouth slightly agape. A distinct light yellow fluff was around the fire-type’s neck.<br>\r\n          “Hello, you must be Flare,” Charizard smiled warmly. The Flareon kept staring silently at him. “Umbreon told me you were coming over, figured I’d greet you at the door.”<br>\r\n          “O—oh, he <i>does</i> live here, t—then, aha…”<br>\r\n          “Hmm?”<br>\r\n          “Ah—I f—figured he’d given me the wrong… a—address, b—but it seems he <i>didn’t</i> ,” Flare nervously answered. His poofy, dipstick tail was stuck and still. <br>\r\n          “Would you like to come in?”<br>\r\n          Flare hesitated, shoulders tense. “S—sure,” Charizard stepped to the side and allowed passage for the Eeveelution. The Flareon waited another few seconds before crawling in. <br>\r\n<br>\r\n          <i>A Charizard? That’s a Charizard! Bree didn’t tell me about someone else being here!</i> Flare crept past Charizard while looking down, <i>why didn’t he tell me! Damn it Bree! He probably ‘forgot’ of course!</i> The light pouring in from the outside vanished as the door closed, replaced by Charizard’s naturally lit tail. One of Flare’s ears perked when he heard the faint drizzle of the shower, then he stopped. The floor was carpeted.<br>\r\n          “Yeah—” Flare jerked suddenly. Charizard flinched. <br>\r\n          “S—sorry! I—I’m just, I wasn’t expecting s—some—someone else, that’s all…”<br>\r\n          The dragon tentatively stepped forward. “Didn’t Bree tell you I’d be here?” Flare shook his head. “Of course he didn’t,” Charizard in turn shook his head as well. <i>Now what do I do… this Flareon’s all shook by me already. Bree was right about him being so timid, and it’s sort of depressing.</i><br>\r\n          “Where is he, the shower?”<br>\r\n          “Yes.”<br>\r\n          “Oh…” Flare’s ears dropped while his tail seemed to fall. Charizard made sure not to make too sudden of movement, as he didn't want to make Flare uncomfortable, and swept back over to the couch. The dragon was sure that maybe if he looked casual that Umbreon’s friend could relax in turn. While sitting down, Charizard looked back at Flare.<br>\r\n          “Wanna wait for Bree with me?” The dragon offered. Flare raised a brow, and a crooked paw, then he quickly glanced at the open door frame to where the shower noises came from. The Flareon mumbled something under his breath while exhaling exasperatedly.<br>\r\n          “... s—sure,” Flare slowly moved towards the massive couch. <br>\r\n          <i>I swear, if I didn't know he was so fucking nervous I'd tell him to see a Poké-center for all that shaking,</i> Charizard huffed internally, <i>… he does look cute though</i>. Flare hopped up onto the other side of the couch. <br>\r\n          Umbreon’s voice sounded from the shower “I'm almost done, I'll be out in a second!”<br>\r\n          <i>I hope you come out looking like a poof</i>, Flare thought maliciously. He settled himself on the soft surface but remained tense, and though Charizard wasn't watching he managed to sit still. </span></font></div><br>\r\n<div align=\"right\"><i>Alternative</i></div><br>\r\n<br>\r\n</span></div></div>",
            "created":1554786000,
            "id":2642525,
            "title":"Change Of Plan"
        },
        "111121":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Mention Flare's arousal to Bree.",
                "Give Flare a wink.",
                "Make sure to sit between the Eeveelutions."
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Twines</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          <i>Tap, tap.</i><br>\r\n          <i>Whiirrr. Exhale.</i><br>\r\n          <i>Shake, shake, splatter.</i><br>\r\n          “So how did you meet Umbreon?” Charizard turned his head to Flare, who had been staring preemptively at the dragon with wide eyes. The moment they locked eye contact Flare snapped his head to look in front of him and down.<br>\r\n          “W—well, we work in the same place,” Flare nodded “and I help with burning weeds… then we send it to Bree’s station and… somehow they make the compost—I don't know how they do—that—that uh, I don't get it.”<br>\r\n          “I think they smash the berries together and put them in the ground right?”<br>\r\n          “I don't know.”<br>\r\n          “Ever sold a berry?” Flare’s ears flattened against his head and he kneaded the sofa. “No, wait, you just burn weeds. I've seen that berry place and it's real big, even for me. Do you ever have any troubles doing it all by yourself?” Flare twitched slightly.<br>\r\n          “How'd you know I was the only one?”<br>\r\n          “Umbreon told me.”<br>\r\n          “Oh,” Flare gave a relieved sigh. “Why do you call him Umbreon?”<br>\r\n          “Hmm?”<br>\r\n          “Bree… that's what people call him, that's his name. You call him by his Pokémon name.”<br>\r\n          “Am I wrong?” Charizard raised his head. “I think it's dumb. My name is not Char the Charizard, or Ember the Charizard, just what I'm supposed to be called, just Charizard. And besides, he doesn't care.”<br>\r\n          “I—I get it.” <i>oh, he's a name purist… a name purist Charizard?</i> Flare thought. “W—well I hope you don't mind me referring to him by Bree.”<br>\r\n          “Oho, don't worry, I know what you're thinking,” Charizard immediately shook his head in understanding “I'm not one of <i>those</i> Pokémon who'd berate you for your name, because <i>that's</i> just stupid,” the Flareon released another, yet less reserved, sigh of relief.<br>\r\n          “So your name’s just…”<br>\r\n          “Charizard, yes.”<br>\r\n          “R—right, I got it,” Flare’s lips quivered into a small smile, which most definitely grew when his eyes met Umbreon’s as the dark-type rounded the couch. “Hey, Bree!”<br>\r\n          \"Hey Flare,” Bree beamed. Flare’s tail was puffed up and his eyes seemed to lose their bags. “So, how are you?”<br>\r\n          “Good, it's just a bit dark,” the Flareon replied “do you guys have a light or…?”<br>\r\n          “Well, me and Charizard make our own light, so we never bothered with light bulbs,” he paused. “Well, except for the bathroom.”<br>\r\n          “Why just the bathroom?”<br>\r\n          “Other than the fact it was already installed, it's much easier to clean your fur—and skin,” Bree glanced at Charizard “with a light that doesn't constantly move.”<br>\r\n          “I like it,” Charizard chimed in, he gave the two of them a comforting smirk. Flare looked back at Umbreon in realization.<br>\r\n          “By the way, I d—didn't know you lived with a Chariz—a Charizard,” Flare casted a lighthearted look of disgruntlement at Bree. The Umbreon glanced between the two Pokémon sitting on the couch, an expression of confusion written on his face.<br>\r\n          “You forgot to tell him,” Charizard whispered, though it was obviously loud enough for Flare to hear. Umbreon scoffed.<br>\r\n          “Whoops, hehe,” his face was contorted with amusement and embarrassment. <br>\r\n<br>\r\n          “<i>You'd forget to give me an address if I didn't ask for it,</i>” Flare mumbled. Umbreon glanced back at Flare.<br>\r\n          “I heard that!” Umbreon snickered. Flare reeled back, a pink blush spreading immediately his face. The Flareon stuttered a small apology before Bree interrupted him. “You're not wrong though, ha! It's fine.”<br>\r\n          “Oh—o.k..”<br>\r\n          “Flare,” Charizard’s voice caught their attention. With the firm statement of his name, Flare tensed up. “Unless you're set on going home in the dark, I suggest you spend the night here,” the dragon switched his gaze towards Umbreon for confirmation. <br>\r\n          “Good idea!” Umbreon smiled and hopped up onto the couch beside Flare, who found himself scooting over to make room.<br>\r\n          “Ahha… about that—I—I uh,” Bree gave Flare a concerned look. The Flareon’s blush became much more profound when the Umbreon showed care for him. <i>Oh man! They're right, I can't just walk out there by myself, that's scary as hell! And… Umbreon’s so… nice,</i> “I wouldn't mind staying the night with you…” he made eye contact with the dark-type “… a—and Charizard, too!” He quickly looked at the intimidating dragon. Flare became stiff and shuffled his hips, a heat rising from between him and the couch, concealing.<br>\r\n          “Of course!” Umbreon hopped down despite only being up there for Flare to respond. “I don't know how long we’ll all be staying up, I'd like to be awake ‘cause it's Saturday night, so we've got some movies if you wanna watch them with us Flare,” Bree made his way towards the remarkably unnoticeable television sat across from the couch and rectangular table. Using his teeth, he pulled open a small drawer, revealing a niche stash of tiny, plastic movie covers. <br>\r\n          Flare attempted desperately to keep himself sat in his spot. He could not deny how much he was aroused. <i>How am I hard? Why am I… Bree is so… good-looking, and… I can't be falling in love?</i> Squirming, Flare tried to concentrate on something other than Bree. He took deep breaths as his eyes moved across the room… there's the door, the floor, Bree, then—Flare flinched. Charizard was looking at him again. <i>Why does he keep looking at me? Oh my gosh… he's not looking as my ass right? Is he… checking me out?</i> Flare’s ears fell again as he gave Charizard a nervous smile. <i>Charizard’s being really creepy, what is he thinking?</i> His smile became a shaky frown.<br>\r\n          <i>Can't Umbreon tell how much Flare is blushing? Oblivious as ever, I guess. It's a wonder, Flare’s dick is out and Umbreon’s not even able to tell</i>, the dragon briefly checked on Bree as the moonlight Pokémon rummaged through their disks. <i>It's been fifteen minutes and his new friend has a boner for him… I swear you're so lucky to have me, Umbreon, else you'd be raped by bigger boys</i>.<br>\r\n           Charizard turned his attention back to the uncomfortably aroused Flareon sitting on the couch. </span></font></div><br>\r\n<div align=\"right\"><i>Alternative</i></div></span></div></div>",
            "created":1555349760,
            "id":2645076,
            "title":"Spotting A Happy Fire-Type"
        },
        "1111211":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "With Flare gone, Charizard can finally..."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          Charizard gave Flare a grin. A grin that caused the Flareon to feel all types of shock ranging from fear to shame and realization. Flare bit his lips. Charizard flicked his eyes at Flare’s rear.<br>\r\n          <i>Shit! Does he know? How does he know! I thought I wasn’t so open… why is he smiling like that!?</i> Flare shook his head quickly and quietly in fast succession as if begging Charizard not to tell, his mouth repeatedly forming a silent ‘no!’ The smile turned into an understanding smirk as the dragon opened his mouth to speak. <i>It’s over, all over! They're gonna kick me out, Bree’s gonna think I'm weird, Charizard’s gonna… gonna… oh! Please don't tell Bree!</i><br>\r\n          “Hey, Umbreon, what movie are we going to watch?” Charizard asked, hoping to segue into how he’ll tell Bree. <br>\r\n          “I don’t know. We can do a movie about berries… maybe.”<br>\r\n          “How about a romance movie?” Umbreon frowned, tilting his head.<br>\r\n          “Romance? You’ve never asked for one of… that’s an odd choice… pretty off the wall there,” Umbreon turned around to see Charizard with a grin too wide to stay in place. “What’s with the grin?”<br>\r\n          “Well, it looks like someone likes you, Umbreon,” Charizard flicked his head towards the blushing red-furred Pokémon. <br>\r\n          “Sshh—what? No, no no what are you talking about? I—I—” Flare’s tail pressed into the couch, hard “I ah—hehe wait a second—” Umbreon frowned confusedly, staring at Flare while attempting to figure out what Chariard meant… then he spotted the smallest glimpse of red flesh poking out from under Flare. Umbreon’s eyes widened and his face bore a slight blush of its own.<br>\r\n          <i>Took him long enough!</i> Charizard thought, exasperated. Flare clenched his eyes shut and wrapped his paws around his head, shaking it left and right.<br>\r\n          “I'm sorry, I'm sorry!” Flare whimpered. “It—it was the couch I swear!” Umbreon tilted his head and watched Flare rile himself up. <br>\r\n          “Charizard… you think Flare likes me?” He raised a brow at the dragon, who was snickering at the poor Flareon’s predicament. The redness of his face was replaced by the previous dark-fur. “Why’d you have to go and make him all flustered, you dummy!” Charizard stopped giggling and looked down, frowning. Umbreon released a disapproving exhale before hopping up next to Flare, who tried to scoot away, yet unable to hide his slowly retreating cock. Flare’s embarrassment was getting the better of him, luckily.<br>\r\n<br>\r\n          Flare’s chest rose and fell with every quickened breath he took. What was Umbreon going to say? Get out? Weirdo? Creep? The moonlight Pokémon was crouched next to him, face to face. Flare couldn't look the dark-type in the eyes as he said “Flare are you o.k.?”<br>\r\n          <i>Am I o.k.?!</i> Flare kneaded his paws into the couch. He nodded his head in a short, dismissive notion, ears flattened. <i>O.k. enough for you to chase me out? Hit me?</i> Charizard settled with staring at Flare and his arousal.<br>\r\n          “If you're o.k., then…” the Flareon’s heart was pounding, he was biting his lip “I'm glad you feel that way.”<br>\r\n          “Huh?” Flare opened his eyes and saw Bree, staring back with a small smile. Charizard snapped his attention at Umbreon and Flare. He witnessed the dark-type place a paw over the other Eeveelution’s. “Y—you’re not…?”<br>\r\n          “You're our guest, and I'm happy to make you happy,” Charizard made a noise in his throat that sounded like a panicked squeak. He gulped. Umbreon was returning the gesture! “Flare…? Flare uh… are you…?” Umbreon slowly stood up. <br>\r\n<br>\r\n<br>\r\n          “Charizard I think he fainted.”<br>\r\n<br>\r\n<br>\r\n          <i><b>…</b></i><br>\r\n<br>\r\n<br>\r\n          “You're sure you have to leave? You're good with walking in the dark?” Umbreon frowned as he stood in front of the now awoken Flareon.<br>\r\n          “Yeah, I uh—uh yeah I forgot that I've got to do some—something, at home,” Flare stuttered, tail between his legs as his fur grew cold from the outside. <i>I can't keep myself calm here… I've got to go home… Bree is just too… I like him too much!</i> Umbreon sighed.<br>\r\n          “Well, that's a shame. I was really hoping you could stay tonight, especially after Charizard suggested,” Bree turned to Charizard, who stood just behind the door. “It’s rare he does that.”<br>\r\n          “Sorry… uh—goodnight!” Flare whispered. Turning tail, the fire-type walked back down to the sidewalk. Bree sighed, closing the door and walking back to the couch. Charizard, while he wasn’t meaning to make Flare scamper off, knew that he didn’t make Umbreon any more excited this way by doing that to Flare. In his defence, that was one timid Flareon.</div></font></span><br>\r\n<div align=\"right\"><i>Alternative</i></div><br>\r\n</span></div></div>",
            "created":1555549980,
            "id":2646068,
            "title":"Teasing the Eeveelutions"
        },
        "11112111":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Tending to Flare"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><i>Twines</i></div><br>\r\n<br>\r\n<br>\r\n<span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\"><div align=\"justify\">          “I’m kinda tired, Charizard,” Bree said, tail drooped and moseying towards the kitchen, instead of the couch, which was what Charizard was thinking he would do. <br>\r\n          “What, aren’t we still gonna watch a movie?” Charizard asked, setting himself beside Bree. “I mean, we could still—oh hey, I’ve got something for you!” The dragon rushed past Umbreon to the fridge.<br>\r\n          “Huh?” Charizard was beaming. Flare was gone, he had Umbreon all to himself! And now it was time for him to finally tell Bree how much he loved him! That was his plan, after all!<br>\r\n          “I didn't know whether to take this out with Flare around because… well you know how Flareons burn their food right? Didn't know if a cold dessert counts—”<br>\r\n          “Dessert?” Umbreon’s demeanor perked again. His pace was a upbeat as he entered the kitchen. His roommate got him a gift? The last time Charizard got him a gift was because he had accidentally stepped on his tail, before that he'd broken the washer. Multiple times, Bree was slightly disheartened, his friend was always apologizing profusely even when he had done nothing worthy of hate.  Though, it did get quite annoying at times when Charizard forgot where his tail fire rested. <i>What'd he do this time?</i><br>\r\n          “Here! Go to the couch and I'll bring it to you!” Charizard shook with giddiness. He didn't confess to Bree when they walked home together, but he can do it now! Bree left the kitchen, and although he did crane his neck in a vain attempt to peek at what the dragon was doing, the fire-type just about reached the top cabinets and definitely blocked whatever was on the counter. “You ready?”<br>\r\n          “Yes.”<br>\r\n          “Close your eyes!”<br>\r\n          “O.k.…?”<br>\r\n          Charizard held his breath as he cradled the berry mousse he had bought from the Poké Mart that day. He cautiously made his way towards the carpeted room, planning on setting the gift in front of Bree. The Umbreon sat in the softly illuminated room, his rings glowing, eyes closed, while Charizard, as quietly as a plump dragon can be, tiptoed his way in front of the t.v.. The massive fire-type gently placed the plated dessert onto the small table.<br>\r\n          “Aaand, you can open—”<br>\r\n<br>\r\n<br>\r\n          <i><b>Ahh!</b></i> <br>\r\n<br>\r\n<br>\r\n          Bree jumped, Charizard glanced outside. The startled Umbreon shot open his eyes to see Charizard passing to the window.<br>\r\n          “Was that Flare?”<br>\r\n          “Sounded like it, I'll g—” Charizard and Bree were cut off by another shrill cry. <br>\r\n          “He's still out front! What's happening?” Bree jumped off the couch, heading towards the window as Charizard opened the door. The dark-type stood on his hind legs, placing his paws on the ledge, and looked outside. A third squeal was cut short suddenly, and Bree’s ears flattened. “Charizard,” Bree realized the dragon was already rushing outside.<br>\r\n          As he neared the street, Charizard noticed immediately that their neighbor, an abnormally small Dragonite as he found out they were the runt, making them stand eye to eye, was crouched over. Charizard carefully examined the chubby flying-type’s back. The normally bubbly, cheery Dragonite looked tense. His massive bright-orange tail blocked the view of where he was huddled on the sidewalk. Charizard raised a brow, he swore he heard a tiny Flareon’s scream of horror just moments ago, right outside. Bree was inside the house, likely about to come out and see what was wrong.<br>\r\n          A weak moan came from the direction sweating Dragonite, it was different from his neighbor’s voice. Meek, small, in pain. Charizard puffed out his chest, Dragonite rose, head down and holding something in his arms. The ground around him was damp, a darker gray as if it were splashed. His neighbor knew water-type moves, he had demonstrated them on a hot day once when there was an extremely awkward block party about a year ago.<br>\r\n<br>\r\n          “Hey!” Charizard called from a couple of meters away. Dragonite gasped, tail straightened out, jerking his head to look at Charizard. “Dragonite, did you hear—” Charizard saw a cream-colored, wet tuft of fur flop against his neighbor’s shoulder. “Hey!!” The orange fire-type repeated in a growl. “What's that in your arms!”<br>\r\n          The color drained from Dragonite’s face. “I found a—a,” he sputtered “it fainted and I was gonna—”<br>\r\n          “What did you do!”<br>\r\n          “What? I didn't do anything! I—”<br>\r\n          “Liar! You're the only one out here!” Charizard snarled, approaching the chubby dragon threateningly. Dragonite instinctively turned around to defend himself, revealing a dazed, drenched, red and cream furred Flareon limp in his arms. Bree stood behind Charizard, having made his way outside finally. Charizard’s eyes turned into darts and his frown became a menacing snarl. “What—!”<br>\r\n<br>\r\n          Dragonite dashed towards his house, Flare squeezed to his chest. Charizard took off with a mighty gust of his wings, a faint yelp came from behind as Bree had been blown back slightly. The angry dragon zoomed diagonally towards the fleeing kidnapper. Charizard summoned a blazing heat from his chest that rose to his mouth so fast it had only taken Dragonite three steps up towards his house. Decisively, Charizard spewed a concentrated blast that then dispersed into five discernable ‘arms,' stretching out across the wide frame of the running dragon. The intense flame slapped the culprit in the back. <br>\r\n          Dragonite threw his arms out and Flare went tumbling across the grass, while his captor fell on his stomach, shouting in pain. The thump of his belly on the pavement boomed. Dragonite let out a shocked roar, writing and twisting to feel his singed back. There was a visible scorch that spread along down his broad back and the roots of his lesser wings. Flare groaned, his lithe body sprawled out on his side.<br>\r\n          Bree had scrambled to his feet and ran as fast as he could to Charizard’s side, but when the dragon flew at Dragonite he had trouble keeping up, especially with the flashing light of Charizard’s fire making him skid to a halt. However, Bree’s eyes widened when he witnessed Flare tumbling.<br>\r\n<br>\r\n          “Flare!” As Bree called out the drenched Eeveelution’s name, he saw Charizard looming over the downed, singed, straining dragon. He stopped in his tracks. Charizard was giving Dragonite a sinister grimace. In the back of his mind, Umbreon was apprehensive, because even though he knew Charizard was quite aggressive, he wouldn’t… “Charizard?”<br>\r\n          The gigantic fire-type turned craned his neck to glance back at Umbreon. “Yeah?”<br>\r\n          “What happened?”<br>\r\n          “This—coward tried to take Flare! Our neighbor! What the hell?” Charizard stomped on the flying-type’s tail, to which the burnt Pokemon let out a cry of pain. Bree winced, he then focused his attention back on the poor Flareon. He walked around the duo of dragons and headed straight towards the pitiful red lump on the grass.<br>\r\n<br>\r\n          “Flare?” Bree checked over the wet Pokemon and prodded his side. Flare stirred, releasing a sickly moan.<br>\r\n          “My h—head h—hurtsss…” he whined “<i>owowoww!</i>” Bree frowned. <br>\r\n<br>\r\n<br>\r\n          Charizard roared at Dragonite. “You f—you!” The dragon was blistering with anger. He yanked on Dragonite’s legs and dragged him around. <br>\r\n          “<i>Ahahh! AAHhh!</i> My back! <i>AhhAAhA</i>!!” Dragonite yelled as he was dragged, his belly rubbing along the ground. He could hardly make out the outline of the two Eeveelutions on his property. Charizard strained to pull the flying-type into his house, forcing him up the platform and through the door. Gathering the strength he could muster, he jumped onto the Dragonite and conked him across the skull. Charizard raised a brow, waiting… <br>\r\n          <i>Snore.</i><br>\r\n          He’d knocked him out. “I’ll deal with <i>you</i> later,” Charizard growled silently, straightening himself and closing the door. The fire-type waddled over to Bree and Flare.</div></font></span><br>\r\n<div align=\"right\"><i>Alternative</i></div></span></div></div>",
            "created":1555551480,
            "id":2646077,
            "title":"Tell Bree... "
        },
        "1111212":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Bedtime"
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Twines</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">           With them making eye contact, Charizard flicked his eyes at Flare’s rear, grabbing the Pokémon’s attention. The Flareon tensed up even more, shaking slightly as Charizard returned to Flare’ s slowly realizing, shocked expression. <i>Why is he… looking at my ass? Does he know? How does he know!</i> The cheesiest of grins spread across Charizard’s face, revealing a set of teeth as he turned his head and winked at Flare. <br>\r\n          If a blush could change someone’s fur color permanently, Charizard had just witnessed it. Flare’s eyes were widened, his tail puffed out, paws forced together, and his fur sharpened, all while his red face became rosier. Charizard flicked his head at Bree as the moonlight Pokémon rummaged through the disks. Flare’s jaw dropped. He had been read like a book, and this dragon didn't make a scene about it, opting to help instead! Flare threw his head into his paws and clenched his eyes shut, squirming his hips to conceal his obvious arousal.<br>\r\n          “What movie do you think we should watch?” Bree asked, his upper body still bent over in the box. <br>\r\n          “I don't know,” Charizard put a claw on his chin. “Any ideas, Flare?”<br>\r\n          “A—anything’s fine!” Flare squeaked, Bree’s ear perked up. Charizard rose from the couch, walked over to the crouched moonlight Pokémon, and plopped down next to him, eliciting a flinch from the dark-type as the plump dragon shook the floor. Bree looked over Charizard’s belly for a brief moment.<br>\r\n          “How about this one?” Charizard reached inside the box and pulled out a cover. He looked back at Flare to see him still pressing his face into his paws. Bree raised a brow and looked back at Flare too.<br>\r\n          “Are you sure? I don't know if he'd like it…”<br>\r\n          “He said <i>anything</i>,” Charizard opened the case and carefully took out the CD.<br>\r\n          “It's a bit late for us to be watching a movie like this,” Bree looked back at Charizard as he placed the disk inside of a player.<br>\r\n          “Oh he'll be fine, besides, he'd probably fall asleep before it ends.”<br>\r\n          “If you're sure…”<br>\r\n          “Positive.”<br>\r\n          “Alright then,” Bree concluded. The moonlight Pokémon made his way back to the couch, hopping up and settling down next to his guest. He prodded Flare. <br>\r\n          “Yes?” The Flareon attempted to look composed. His cream-colored tufts of fur were as puffed out as possible, naturally, like most Flareons when their body temperatures are too hot from the weather… or too much stimulation.<br>\r\n          “Wanna know what we’re watching?”<br>\r\n          “W—what are we watching?”<br>\r\n          “By the Broken Lake,” Flare froze up. “You know, a horror movie.”<br>\r\n<br>\r\n<br>\r\n          “A… h—horror m—movie?”<br>\r\n<br>\r\n          <b>…</b><br>\r\n<br>\r\n          <i>No! No! Don’t go that way!<br>\r\n                    What? Why?<br>\r\n          Behind you!<br>\r\n                     What is that!!<br>\r\n          Run run run!<br>\r\n                              Gah—ahah! It’s got me—help!!<br>\r\n                    It’s got Combusken! We have to help him!<br>\r\n          Wait—no you can’t—<br>\r\n                              AhHH!! Ahghhg… <br>\r\n          Stop! Combusken’s dead—no, stop, Linoone!<br>\r\n                    But I’ve got to—gh—help! Ghgrk—!<br>\r\n          Linoone! No!<br>\r\n                    R—run—grhkk… <br>\r\n          Shit! Shit, shit, shit! … </i><br>\r\n          Flare pressed himself further into Bree’s side. The shaking Flareon’s fur was on edge as he stared wide-eyed at the screen, seemingly unable to look away. The Umbreon he clung to gave him a sense of safety, he was his pillow, his stuffed teddy bear… like the one he had at home whenever he was stressed.<br>\r\n          Charizard was content with the movie, however he had to constantly worry about where his tail was as the lighting reflected off the t.v. at times. Bree was stuck between a hot dragon and an overly warm Flareon, so he was constantly shifting his hips to pry himself from the both of them, but to no avail as Flare kept pressing him back into Charizard.<br>\r\n          <i>There’s the safehouse! Wait… what is that? Grk! Get away from me—no, no!<br>\r\n          AHHH!!!</i><br>\r\n          “Bwahh!” Flare squealed, shoving his face into Bree’s shoulder. Umbreon winced as Flare nudged him into Charizard’s massive hip. Flare quivered as Bree huffed from the two abnormally heated fire Pokémon.<br>\r\n          “<i>Ghuh</i>, you guys are too toasty…” Bree sighed. Flare kept his eyes clenched shut as Charizard shifted. <br>\r\n          “Sorry, can’t help it,” Charizard smiled half-heartedly. Bree shot him a pitiful glance.<br>\r\n          <i>My—my head! I—my arms! <br>\r\n          Please—please no don’t do it! No! AhhHH!</i><br>\r\n          Flare seized Umbreon and released a weak moan before going limp. The Umbreon also gave a small groan before going limp as well, leaving Charizard staring at the two with a bewildered face. The screen went dark as bold lettering signalled the ending of the movie, Charizard tapped his claws together nervously. There were two fluffy Eeveelutions knocked out and laying against him, one who was completely still and the other whose body rose and fell with heavy breaths.<br>\r\n<br>\r\n          “Huh,” the dragon stated. He cautiously rose from the seat, leaving the two slumped over into the padding of the couch. “I better make that bed then,” Charizard walked over to the t.v. and removed the disk, turned the screen off, then headed back into his and Bree’s room. <br>\r\n          The massive mattress inside of this bedroom took up nearly half the room to accomodate for his draconic size, and it had to be fireproof because of his tail flame, so it was made out of a rare material. As he grasped the blankets, he felt the Altaria down, the soft padding that made the bed and kept it burn-free. The bed was his domain while the bathroom was Bree’s, although the shower still needed to be Charizard-friendly—but that was perfectly fine with the Umbreon he lived with.<br>\r\n          Bree couldn't make the bed with his quite limited paws, so Charizard took up the job with his opposable claws. Sometimes it's a pain—he's made the bed nice and clean only to fling the sheets across the room when his wings stretched. Although he's able to get his claws around the bed, it's never been as flat as when it was made the first time, unlike the psychic who installed it in the first place.<br>\r\n          “So much for the mousse, Umbreon’s too tired for that,” Charizard sighed, resting on the made bed. “Might as well go to sleep then,” he got up and headed for the living room. <br>\r\n<br>\r\n          <b>…</b><br>\r\n<br>\r\n          Bree could feel the gigantic heat source leave him, allowing him to slide onto the couch with a smaller heat-ball resting on his body. The cream fluff covered most of Bree’s drowsy vision along with his half-lidded gaze. The light emanating from the screen vanished, leaving the shadows of his bioluminescence and Charizard’s tail to light up the room instead. He figured Charizard thought they were asleep, because only minutes go by and he could hear the familiar shuffling of a dragon attempting to fix the blankets.<br>\r\nFlare stirred, fluttering his eyes open to see the Umbreon he had stuck himself to. He squinted, then let out a tiny gasp, his earlier red blush returning just as fast as the movie had made it go away. His arms were around Bree, and they were laying at an angle which prompted Flare’s jaws to drop as he froze up. <br>\r\n          <i>Did he faint from the movie too? No, he’s too brave for that, please tell me he’s just asleep!</i> Flare shuffled and wiggled his way from off of Umbreon, only to slip and clench his eyes shut as the impact jolted Umbreon awake. Bree lazily allowed his attention to shift towards the now stuttering Flareon. “I—I uh it—I was just—I don’t know er—”<br>\r\n          “<i>Shh…</i>” Bree whispered groggily. Flare paused. “I’m tired, let’s just go to sleep now… I think you should lay on the bed,” Umbreon slumped his head back down into the soft, cushioned embrace of the couch. Flare hesitated before slowly pushing himself up to sit, shaking his fur and making his tufts puff out again, he could feel the blood rushing to his crotch as he gazed at Umbreon. The dark-type was huffing, tongue out, and was overly drowsy for someone so calm.<br>\r\n          “Bree? Are you sick?”<br>\r\n          “No, you and Charizard are just really, <i>really</i> hot,” Bree mumbled, face planted into the sofa while his front paws spread outwards. Flare twitched.<br>\r\n          <i>Hot? Did he really just call me and Charizard hot?</i> Flare chuckled nervously. “W—what are you talking about? I’m not as hot as…” he gulped. <i>I’m not as hot as you!</i><br>\r\n          “Charizard, I know. He’s a <i>fire dragon</i>. I sat between two very warm Pokemon for an hour or something and I’m just <i>really</i> tired now,” Bree turned on his side. “You know I think I’m just gonna… sleep here…” <br>\r\n<br>\r\n           Flare chuckled more. <i>Ahaha, of course, I’m a fire-type, that’s what he meant!</i> He pressed his paws into the couch. “A—alright I’ll… where’s your bed again?” He stared at Bree. “Bree?”<br>\r\n          <i>Snore…</i> <br>\r\n          <i>Oh</i>, Flare looked away. <i>Wow he wasn’t kidding.</i> The Flareon hopped off of the couch and walked around. He made his way behind and found the entrance to the bedroom, a given as he saw the flickering light of Charizard’s orange flame. <i>That must be the bedroom.</i> He peeked his head into the room and looked around. When his vision landed on a massive foot, he jumped. “Gah!”<br>\r\n          Charizard inhaled sharply and stepped back, having almost stepped on the miniscule Eeveelution. “Ack! Sorry! Didn't see you,” he put a claw to his chest in surprise.</span></font></div><br>\r\n<div align=\"right\"><i>Alternative</i></div></span></div></div>",
            "created":1556200620,
            "id":2650137,
            "title":"Flustered Flare"
        },
        "11112121":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Make Flare feel good.",
                "Tease him again... continue without pause."
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Twines</div></i><br>\r\n<br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">           “T—that's o.k., happens all the time at work,” Flare sighed. The dragon frowned.<br>\r\n          “Aww. That probably doesn't… how often do you get stepped on?”<br>\r\n          “Four times,” Charizard stepped around Flare.<br>\r\n          “Ah, that's not so—”<br>\r\n          “since yesterday.”<br>\r\n          “Oh…”<br>\r\n<br>\r\n          “... Well I was about to tell you two that the bed’s been made,” Charizard smiled proudly, pointing at the mattress.<br>\r\n          “Cool! That’s a… that’s a…” Flare’s jaw slowly dropped in awe “that’s the bed? It’s so <i>big</i>!” <i>That is the largest bed I’ve ever seen in my life! Holy shit is it gigantic!! And this is for me to sleep on?!</i> <br>\r\n          “Made of Altaria down, fireproof stuff for me. Apparently it’s also hyper fluffy, which makes Umbreon love it a lot… I think he likes it way too much. Always blushes when he gets in for some reason, never figured out why,” Charizard added. Flare tilted his head. “When you jump up, brace a bit or something, or you’ll sink into it like Umbreon the first time.”<br>\r\n          “Sink? Is <i>that</i> how fluffy it is?”<br>\r\n          “Yeah, or…” Charizard looked between the bed and Flare. “You’re our guest. I don’t want you to have to exert yourself too much. You mind?” Charizard had kneeled beside Flare. The Flareon’s head couldn’t tilt any farther in question to what Charizard might be hinting at. The dragon’s arms were stretched out, slowly wrapping around Flare. The Eeveelution gulped and kept still as Charizard picked him up by the sides and cradled him, he looked away at the bed in an attempt to hide his blush.<br>\r\n          <i>He just—like that he picked me up? Charizard’s so… gentle,</i> the dragon released Flare onto the bed after placing him softly against the sheets. Flare sunk slightly into the covers as he tried to stand on his legs. “Oh my, this is—heavenly!” Flare held back a squeal of joy. <i>I’ve never felt a bed so soft, so cool in temperature!</i><br>\r\n          “Glad you like it! Get comfortable, o.k.?” Flare nodded and jumped over to the pillows, rolling over and immediately diving under the blanket. There was only one medium-sized cover that lay over the sheet to the mattress. Charizard giggled. “I’m gonna ask Umbreon something.”<br>\r\n          “Oh, he fell asleep on the couch,” Flare mentioned, making the dragon stop at the door.<br>\r\n          “Really?”<br>\r\n          “Yeah,” Flare curled up beneath the delightful cloth, already lulling to sleep. <i>This whole bed, just for me! Wow! They’re so nice! Bree’s idea for me to stay turned out to be a good deal! Shame that Charizard’s tail can’t stay in here at least—</i><b><i>fwomp!</i></b> Flare’s eyes shot open as he bounced slightly. He glanced over to see the gigantic fire-type getting into the bed. The Eeveelution was still, blinking. <i>C—Charizard’s gonna—is he sleeping with me?! What?! I don’t—he’s too scary!</i><br>\r\n          Flare shuffled uncomfortably, seemingly unable to move from the middle of the bed as Charizard settled himself under the sheets. <i>I can’t let him think I hate him or anything! B—but I don’t—even know him…</i> Flare plunged his face between his paws and into the mattress. <i>I think this will do.</i><br>\r\n          <i>He’s nervous. Damn it, I did it again. I thought Flare was perfectly fine around me after I winked… thought he would get the jist of him liking Umbreon. Whatever, I’m going to sleep, Flare can be as timid as he wants as long as he doesn’t throw a fit about me,</i> Charizard sighed and rolled over to face Flare, who was curled up in a poofy ball underneath his bed’s blanket. <i>How is this Flareon as cute as Umbreon? I think I really do have a thing for Eeveelutions.</i><br>\r\n          <i>I think he's looking at me! Darn it! It's gonna be so hard to sleep with this dragon looking at me all night!</i> Flare wiggled his nose and closed his eyes, releasing a yawn. <i>Does Charizard sleep with his tail under or over the covers?</i> Suddenly preoccupied with this question, Flare attempted to ignore the massive fire-type as sleep overtook his mind, the bed comforting him while he drifted off…<br>\r\n          <i><b>Snore… snore.</b></i><br>\r\n          Flare opened his eyes again. <i>Is Charizard… sleeping already? Oh my gosh, he snores… guess I won't be sleeping tonight like I thought.</i><br>\r\n<br>\r\n<b><i>…</i></b><br>\r\n<br>\r\n          Flare stirred, again. For the tenth time. Moving from the middle of the bed might make even the unconscious Charizard think he's got the whole thing, although Flare wasn't making any sense. Charizard’s open mouth released large, elongated snores as Flare stared at him. The Flareon watched the dragon as it slept—it could wake up at any time, obviously!<br>\r\n          <i>That's a big mouth</i>, Flare thought. With himself in the middle of the bed, Charizard’s long neck had nowhere else to stretch but closer to him. Face to face, mouth to face, with waves of the dragon’s hot breath washing over Flare and his head tuft, which was puffed up from the heat. The little light there was in the room only made the maw glisten slightly, but just enough for Flare to peer down the cavernous tunnel. <i>He could probably swallow me in one gulp!</i> He wiggled a bit. <i>I bet he could… if he wanted to.</i><br>\r\n          He edged closer to the soft, fleshy opening. Charizard’s mouth hung open for some time, allowing the smaller fire-type to inspect that big tongue, the perfectly round mouth, his deep red throat. Flare shuddered as his arousal peaked, the small sheath that hid between his folded legs revealing his hidden lust. His balls ached as he envisioned the embrace of Charizard’s grand maw, a bulge slowly travelling down that long neck… reaching a pleasant destination, protected by a friendly beast, safe and snug and tight and—<br>\r\n          Charizard yawned. Flare’s eyes twinkled when the mouth opened wide, granting him a better view of the voracious space. He leaned forward to tease himself, there was enough space for sure to keep himself occupied. The dragon’s mouth began to close with excruciatingly, tantalizingly slow speed while Flare exhaled shakily, his red face just inches away from Charizard’s snout. Flare gaped at the wonderful sight—<br>\r\n          His gaping stopped as the maw he'd been looking at closed on his small snout. The Flareon froze, completely still as he locked eyes with the orange jaws of Charizard. <i>Ohmygod ohmygod! I got too close!</i> Flare kept his head in place as he grew increasingly aroused. <i>How is he still sleeping from this! Maybe I can move if he yawns again, or snores, or… oh man! I really hope he doesn't wake up!</i><br>\r\n<br>\r\n          It took all of Charizard’s willpower to hold back a chuckle as he looked at Flare through slitted eyes. <i>He likes my mouth, hehe. Who knew Umbreon’s friend likes the idea of being eaten?</i> Two miniscule paws gently placed themselves around his snout, followed by a pitiful press to free the owner’s face. The Flareon’s eyes were giant, reflective saucers that revealed his flustered predicament due to his terrible restraint.<br>\r\n          Charizard gave a tiny smile before ‘yawning’ again. Flare quickly moved his head backwards and began to wipe off the bits of saliva from Charizard’s mouth. The dragon carefully edged closer to Flare and his unaware head… he opened his mouth more, and more, until he descended upon Flare’s entire head. Charizard heard, and felt, a shocked squeal, muffled from within his mouth. He squeezed Flare’s face, pressing his tongue against his forehead before letting go and giving a brief chuckle. Flare, his entire head drenched in saliva now, locked eyes with Charizard, jaw dropped and face flushed with a deep red, paws still and held out in front of him, frozen.</span></font></div><br>\r\n<div align=\"right\"><i>Alternative</i></div></span></div></div>",
            "created":1556287920,
            "id":2650558,
            "title":"A bed big enough for a Charizard and a Flareon"
        },
        "111121211":{
            "author_id":"kidinmazk",
            "author_name":"Twines",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span><i><div align=\"center\">Twines</div></i><br>\r\n<br>\r\n<div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          “I saw you looking,” Charizard smirked. Flare snapped out of the trance, shrinking back into the bed. He shook his head in short, stammering motions, stuttering to explain himself. “Don't worry, I wouldn't tell,” he told Flare to calm him. The Flareon stopped moving and sputtering out hardly legible excuses as Charizard leaned forward and licked his head again.<br>\r\n          “<i>Ahh… hahh…</i>” Flare raised his paws and brushed them against his head in a vain attempt to wipe off the saliva. <br>\r\n          “I didn't know you liked my mouth,” Charizard widened his maw, extraneously so Flare could get a better view than with a yawn “do you like being prey?” Flare gazed into the fleshy abyss that Charizard opened.<br>\r\n          “I don't—wait a moment, I—I—!”<br>\r\n          “I'm not gonna force you,” Charizard closed his maw, much to Flare’s disappointment “if you're worried I'm gonna bite then say so.”<br>\r\n          “No…”<br>\r\n          “You're not worried?”<br>\r\n          “I…” Flare threw his paws over his clenched eyes. What was even happening! Charizard just slobbered all over his head and now he's offering to do something? <i>I don't know you!</i> “J—just uh—I…” maybe he could just go back to sleep? How could he tell Charizard that he was uncomfortable? What was he even offering? <i>Why</i> was he offering?<br>\r\n          “I know it probably seems sudden, but you don't have to worry about that, tiny Flareon,” Charizard whispered in his ear. Flare didn't move. “You like it, and I want to make you feel alright with being here… because you know that I know about Umbreon,” Flare’s ear perked up. “He's asleep, not hearing us. Could sleep through a hurricane, that Umbreon. You like Umbreon, right?”<br>\r\n          Flare shifted again. Having trouble finding the adequate words to describe it, he shook his head meekly. However, it wasn't too convincing as Charizard huffed slightly. Now suddenly shaken by possibly having upset Charizard, Flare nodded hastily, fur on end.<br>\r\n          “Me too,” the dragon smiled “I like him. But he doesn't get it, I don't think. You're cute too, you know,” he caressed Flare’s dry fur. Flare squirmed and looked at Charizard’s claw on his body. “I was gonna tell Umbreon how much I loved him tonight… but he invited you instead. I was going to have a lot of fun with that dark-type.”<br>\r\n          Flare’s ears flattened against his head as Charizard pressed harder into his fur while simultaneously dragging him closer. The dragon’s eyes were full of intent, a stare Flare recognized like with other Pokémon at work. The Flareon craned his neck to look at the pillows, and away from Charizard’s slitted eyelids which Flare dawned as an invitation. The dragon worked to get Flare within a hugging embrace. <br>\r\n          “Uh… hah…” Flare mumbled, trying to force words out. His cock was still hard as he was grasped by the orange dragon and lifted, his body slumped halfway upon Charizard’s body and the bed. <br>\r\n          “Why don't you let me… help you with that,” Charizard reached around Flare’s rear and pulled the rest of his body up onto his stomach, Flare’s cream-colored tail was puffed out between his curled legs. The fire dragon rubbed his claws against Flare’s hips, working to tease the small ball of fluff that he cradled as he calmly dug into its fur.<br>\r\n          <i>Why is he doing this?</i> The trembling Flare couldn’t lift a muscle in retaliation. <i>He can’t be trying to… to… he's reaching for my dick…</i>, Flare remained still within Charizard’s warm embrace. The dragon sat upwards, stroking Flare’s fur, teasing the small sheath he felt when he reached under the Flareon’s tail, which Flare used to cover his member. <br>\r\n          Charizard squeezed Flare’s growing flesh, attempting to coax it into its full length. Flare wiggled in defense to Charizard’s continuous groping. <i>This is so weird! No one's ever done this to me… before</i>. It wasn't hard to get a couple of weird stares when at work, especially from the bigger customers, but it's only now that Flare realizes what those looks meant. Flare whimpers as his cock withdraws from his sheath, twitching when Charizard massages his rear and dick at the same time, he shut his eyes and brought his paws down to his chest, folding them and lowering his face. Flare’s back was pinned to Charizard’s fat belly, a soft embrace that cushioned to save Flare from Charizard and his constant pressing.<br>\r\n          “What do you think?” Charizard whispered, his neck craned so that his snout met Flare’s ear.<br>\r\n          “Er… I'm not sure—”<br>\r\n          “What would you say to Bree?”<br>\r\n          “W—what?”<br>\r\n          “Would you say yes?”<br>\r\n          “...” Flare hesitated, his stomach filled with butterflies. “But you're not B—Bree, s—so I wouldn't know…” Charizard clenched tight onto Flare’s rear, eliciting a meek yelp.<br>\r\n          “I can show you how to make Bree like you, like you love him. Want to… learn?” Charizard’s breath was putrid across Flare’s fur, reaching every square inch of the quivering Flareon’s belly and face. “I know how to make him pay attention, and get you to demonstrate for him, your lust for him, how much you want him, and in return, his love,” he began to squeeze the drooling cock in rhythm, and to Flare’s dismay another squeak of pleasure escaped his lips.<br>\r\n          “Is it that you want to get inside him…” Charizard edged his other claw closer to Flare’s entrance, edging the tiny hole to tease “or him inside you?”<br>\r\n          “<i>Ngngh!</i>” Flare moaned, slowly humping against Charizard’s clenching claw, finding himself at the mercy of a dragon’s touch. “I—you’re being so—so—”<br>\r\n          “Good? Say it.”<br>\r\n          “Yes!” Flare cried, leaning his head back and clenching his eyes shut. Charizard smiled. Flare huffed and groaned to Charizard’s jerking and teasing, the dragon adjusting to sit up in the bed. Charizard opened his mouth wide, his cavernous mouth widening for Flare once more.<br>\r\n          “Now, open your eyes,” Flare took a moment before finding his bearings, then he opened his eyes to see Charizard’s maw in grand display above him. His jaw dropped, stars in his eyes as the mouth descended onto his head. The hot tongue lapped at Flare’s soaked face before the rest of Charizard’s jaw trapped his head. Flare’s body was flooded with pleasure, his neck and head surrounded by soft, slippery flesh that squeezed and squished against it. Charizard suckled on Flare’s entire head while the Flareon’s hips thrusted uncontrollably into the dragon’s welcoming claws.</span></font></div><br>\r\n<div align=\"right\"><i>Alternative</i></div></span></div></div>",
            "created":1558533780,
            "id":2662565,
            "title":"Making A Flareon Feel Good"
        }
    },
    "info":{
        "author_id":"kidinmazk",
        "author_name":"Twines",
        "brief_description":"Male on male Pokémon :P",
        "created":1554266400,
        "description":"<td align=\"left\" class=\"norm\"><div align=\"justify\"><font class=\"size4\" style=\"\"><span style=\"font-family:times new roman, serif\">          <b>This is being developed into a Quest game.</b><br>\r\n<br>\r\nMore stories will come eventually.<br>\r\n<br>\r\n          In each story will be marked an initial outline: this outline will be the original pieces of the story, and other choices will be extraneous parts we've decided to add for the sake of it being an interactive rather than a glorified single addition. It will be stated at the bottom-right whether or not it is an \"Original\" or \"Alternative\" addition.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n          And before you think of adding please note. While we are not attempting to rob you of ideas, additions made will likely be deleted. Most of the time it's a bother to read \"there are plenty of interactives for you to add to,\" but it's true. There are hundreds of interactives that you could add to that need it more than this one, (because this one has a plan), and there's something for about everyone on this site, whether it be rated-E fantasy and happiness or XGC Porn, there's little doubt you won't find another place. </span></font></div><br>\r\n</td>",
        "id":2187088,
        "image_url":"https://www.Writing.Com/main/images/action/display_cover/id/100861.jpg",
        "last_full_update":1564345620,
        "modified":1564345620,
        "pretty_title":"Tsuki and Twines' Pokemon"
    }
}