{
    "chapters":{
        "1":{
            "author_id":"adam4445",
            "author_name":"adam4445",
            "choices":[
                "you start to shrink (reserved)",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Today started like any other monday morning.  today was a teacher training day so you had the day off school ahh a day in bed you pulled the covers over and went back to sleep.<br>\r\n next thing your bedroom door swung open there stood your mum right you get out of bed you needn't think you are staying home on your own today in bed you are coming to work with me now get your ass in gear and get ready im running late.<br>\r\n you groaned but actually you didn't mind the chemical company your mum worked at was pretty cool and her office had some really sexy women you had a bit of a fetish for the Secretary look on women with there tight skirts and high heels and there was no shortage of them. <br>\r\nyou often fantasized about being under one of there desks with them  not knowing your there mmmmmm your mind wonders thinking of that image in your head .<br>\r\nyou get up and dressed in a black jumper and your favorite black jeans  and head down stairs your mum is all dressed in a tight black knee length skirt and a tight white silk blouse drinking a coffee she always looked smart and a lot of your friends said she was a real MILF.<br>\r\nyou grabbed so toast and a cup of tea and then you where on the way to work with your mum she worked and a large chemical research facility on the outskirts of town about ten mins drive away .<br>\r\nyou mum looked over to you right i want you to behave today i have a busy day and cant be keeping an eye out for you all day and don't forget you are going to your dads tonight you can get bus from work can i trust you to sort your self out today ?<br>\r\n god yes mum im not a kid you know im 13 years old just chill would you with that your mum just gave you that look that only mums can do.<br>\r\nyou pulled in to the car park and headed inside with her you walked into her office with her there where lots of sexy women sat at there desks you mind wandered as you saw them and wished you could be small and under the desk of one of them. <br>\r\nHELLO SAMMY said a voice form behind as you turned round you saw Donna  <a rel=\"nofollow\" href=\"http://2.bp.blogspot.com/-yy81IvGNerU/UTyhEv-wxrI/AAAAAAAAAD8/Yqu4hHdyrc0/s1600/women+in+formal+dress+for+office+%2814%29.jpg\" target=\"_blank\">http://2.bp.blogspot.com/-yy81IvGNerU/UT...</a> one of the girls from the office she looked beautiful she you had a huge crush on her you blushed and she just smiled at you nice to see you again .<br>\r\n you would do anything to be close to her small  and exploring her with out her knowing i think she know you had a bit of a crush.<br>\r\nim just heading down to the labs do you want to come along and have a look around she said you looked at your mum she just said behave and don't touch anything with this you followed dona down the corridor you walked just behind Donna she had all the curves in all the right places and you looked at her ass as she walked omg i wish i was in there feeling feeling her skin rubbing against me Donna looked round and saw you looking at her ass you blushed ahem!  eyes forward please she said with a smile  you came along side her as she entered a door the said research and development   she turned to you and said OK Hun stay close and no touching stuff ok  you looked at her and nodded and you entered the door in to the lab.<br>\r\nAs you entered you saw lots of little side rooms full of equipment and people walking around with white coats it all looked really high tech Donna tuned to you ok hun just wait here i need to go speak a couple of people don't touch anything with this she went into one of the rooms.<br>\r\nmmm don't wander of you thought.... yeah right that's going to happen you chuckled to yourself you looked around and saw a room that had a big DO NOT ENTER  enter authorized personnel only protective wear must be worn at all times you noticed that the door wasn't shut properly  you looked around no one was watching you so you quickly slipped in the door, <br>\r\n you entered it was all dark you looked to your left and saw a light switch  you put the light on in front of  you was huge storage room with  rows and rows of different shaped bottles with colored liquids on big shelves  with some  barrels at the end you wander in and interiged by all the different things.<br>\r\nSuddenly you hear a voice just out side who left this open ?  a woman's voice said   shit you had to hide you looked around and saw there was a gap under the shelving rack just big enough for you to crawl under you lay down on the floor and shuffled under it was really tight but you just made it under as you heard someone enter you held your breath as you saw someone come in from where you where all you could see was a pair of ladies black heels coming towards where you were they came closer  they stopped right in front of you the tip of the  shoe was only a few centimeters from your head you stayed as quiet as you could you  felt fear and excitement both at same time you were turned  on being so close to a woman's feet with out here knowing you  where there HELLO ANY ONE IN HERE ? she called  with that she turned and started to head back towards the door you breath a little sigh of relief she got to the door and switched off the light the left the room and shut the big metal door you where plunged into darkens. <br>\r\nOK i better get out of here before someone else comes in. you start to try and feel your way out form under the shelves as you do you get stuck you try and pull your self free as you do you suddenly hear a loud crashing noise you must have knocked the shelves trying to get out smash smash smash you hear bottles smashing all around you you cant see anything it total darkness you you stand up and reach out your hands then more smash smash smash bottles crashing suddenly you start to smell something horrible the smell is getting stronger you start to cough the you feel your eyes burning and your skin feels like it is on fire you find it hard to breath you fall to your knees on the floor your head starts to spin and you black out.<br>\r\nyou wake up with a banging head ache you are not sure how long you have been out<br>\r\n suddenly light flood into the room as the door is opens as your eyes adjust you see Donna stood in the door with her hands on her hips omg what have you done i have only left you for a short while and look at the mess you have made i told you not to touch anything .<br>\r\nYou held you head down and looked like you where about to burst into tears shhhhhhh don't worry dona said come here, you walked towards she put her arm around you look accidents happen lets get this mess cleaned up and we will keep it our little secret OK if you promise not to touch anything else lol Donna knew she should have been watching you and she would probably get into trouble if people found out. you felt really strange and your skin was still tingling but you where grateful not To be in trouble Donna went off and came back with a broom d pan and you quickly clears up all the broken glass .<br>\r\nDonna looked at you , are you ok ? you look a bit pale you looked at her yeah just feel bit strange  OK Hun let me take you to the to the break room you can sit and have a drink she took your hand and led you away as you got to the break room it was empty just lots of empty tables with a couple vending machines at one end you sat down and Donna went and got you a coke you felt really strange but didn't wan tto make a fuss Donna came back gave you your drink she put her paper work on the table and sat opposite you.<br>\r\nwow she was stunning. after a few mins she said you feeling bit better yes you said  smiling at her OK Hun look i have to nip out for a sec i wont be long i will leave you hear and be right back OK . with hat she stood up leaving her paper work on the table and walked away you watched her she had a beautiful ass and you watched it as she walked out of the room<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1453381500,
            "id":2092141,
            "title":"the day it all changed"
        },
        "11":{
            "author_id":"adam4445",
            "author_name":"adam4445",
            "choices":[
                "try and get donnas attention",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>You watched Donna leave you couldn't help but stare at her ass as she walked god she was sexy in that tight black skirt she was wearing black tights and black high heels with a sexy tight white silk blouse top you would give anything to be shrunken and close to her sigh if only ....<br>\r\n<br>\r\n  you move round the table and sit on her chair the black foam cushion was still warm you could still smell her perfume You close your eyes and fantasize about being small and her not seeing you being trapped in her panties you where gettign so turned on.<br>\r\nsuddenly you felt light headed and your skin was tingling all over then your whole world started spinning wooooooaaaaaa whats going on you opened your eyes you appear to be on a soft black floor strange then everything came in to focus you looked up and you could see the underneath of a huge table whats going on you spun round on the spot and tried to get your bearings where you are  OMG you where on Donnas chair  you where  stood there in the middle of her chair a mere half an inch tall. Your mind raced how had this happened how can you get back to normal. you remembered the chemical spillage in the store room could that have done this . you where filled with fear and you have to admit a little excitement. Ok you thought to yourself you have always wanted this now is your chance your mum works for chemical research place im sure there is a antidote dont stress all you need to do is get to your mum and get some help im sure she can sort this mmmm you thought now how do i get to mum.... BOOM BOOM BOOM ...  the ground started shacking you had been so lost in thought you had not seen someone enter the staff room a huge shadow loomed over you you looked up there was Donna towering above you the height of a skyscraper you could see her skirt stretch up as far as the eye could see with the curve of her ass.. wow your jaw dropped you could never have imagined this view you stood there staring at this amazing giantess... suddenly she knocked the seat and you fell flat on your back donna was getting ready to sit down you jump to your feet and wave your arms around look down you yell at the top of your voice but at your size she couldn't hear you <br>\r\njust then she glanced down yess she will see me but unfortunate the cushion was black and you where wearing black so she couldn't see you you could see her ass getting closer you run as fast as you can towards the rear of the seat  you just make it as the mammoth ass sits down she moves her self back in to the chair and your pushed by this huge black wall that was her ass into the back off the chair you are engulfed and pinned against the back of the chair  you try and move but her ass is holding you flat against the back of the chair you could feel the warmth of her coming through the skirt wall this is not how you imagined it would be being shrunk you felt totally helpless.<br>\r\nyou had to try and get her attention somehow but at the moment you could even move <br>\r\n<br>\r\ndonna looked around the room as she got comfortable where has Sammy gone i wonder i hope he is staying out of trouble little did she know that she had pinned Sammy against the chair and how close he actually was oh well she thought im sure he will turn up with that she started looking through the paper work that was on the desk..<br>\r\n<br>\r\n<br>\r\n<br>\r\nto be continued </span></div></div>",
            "created":1453733820,
            "id":2094094,
            "title":"you start to shrink "
        },
        "111":{
            "author_id":"adam4445",
            "author_name":"adam4445",
            "choices":[
                "continue (reserved)",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>you are trapped pinned up against the back of the chair then Donna leaned forward slightly and the light flooded in from abouve you looked up and saw the top of her skirt rising above you  now is your chance you thought you have to try and climb up and get her attention you grab the fabric of her skirt it was soft and at your size it was easy to grab the little folds in it you slowly pull your self upwards (this was so strange you where  climbing up the back of a skirt of a beautiful giantess woman never in your wildest dreams could you have imagined this actually happening).<br>\r\n Donna fidgeted a little you held on loosing your footing slightly, just a little further you could see the top of her skirt you grab the top and pull your self up phew you made it.<br>\r\nYou look up and see the long climb ahead that was Donna's white silk  blouse, Donna was still leaning forwards you where right in the middle of the back of her skirt there was a gap between the top of the skirt and her blouse  you peer over the edge of the skirt top and saw the top of her tights(pantyhose below  and the dark drop the went down between her ass cheeks you where tired from the climb but you knew you had a long way to go yet you knew you would have to hurry before Donna moved again if you had any chance of rescue.<br>\r\nyou throw your leg over the edged of the skirt and perch on the edge and lean over to try and grab her blouse you reach forward as far as you can you cant quiet reach you throw your other leg over and reach forward just then Donna moves you slip and fall in between the gap you as you plunge into the darkness you frantically try and grab something you hand catches the top of her tights and you cling on you are in the middle of her butt cheeks they are curving either side of you and you can feel the inside of the silk lining of her skirt behind you and the warmth and heat coming from below.<br>\r\nJust then your whole world is plunged into darkens as Donna sits back upright closing the gap you where pressed tightly in between  her amble butt cheek and her tight skirt your arms where hanging  over the edge of her tights you where well and truly stuck.<br>\r\n<br>\r\nDONNA had finished her paper work at the desk and was starting to gather hit bits up to leave the rest room she had waited for sammy for a while now and he had not come back she needed to get back to the office and she alos needed to go to the toilet as well she figured Sammy had probably gone back to his mums office litteldid she know that he was infact trapped in between her skirt ans butt cheeks, she picked everything up and stood up and headed towards the ladies room <br>\r\n<br>\r\nyou world shifted as Donna stood up you had a weird sensation of vertigo as she got to her feet,  as she stood up the pressure increased as the skirt stretched over her ample ass pushing you tighter against the out side of her tights and against the silk lining of her skirt <br>\r\nYou where scared of falling but also in some strange way a little tuned on being so close to this sexy giantesses ass as Donna walked you rocked up and down by the rocking of her ass cheeks like some sort of weird fairground rude  the pressure was intense  and you struggled to get your breath how where you going to get out of this.<br>\r\nyou could hear the muffled sound of her heels clicking on the hard floor you where being rocked violently  up and down you were starting to get hot wedged so tightly. then you heard what sounded like a door open and close you felt movement from behind you  the all of a suddenly the pressure released and light flooded in as she unzipped her skirt and it dropped down you looked below and you could see what looked like a huge toilet  you help on for dear life the wooosh you where hurtled downwards as Donna lowered her tights and panties you managed to cling on she sat down on the loo as she sat down you were thrown onto something warm and soft you looked around and you saw two huge legs either sided of you, you had been thrown onto the inside of her pantyhose and where lying on your back on a pair of black silk panties they where warm and had a sexy musty aroma you lay there for a moment looking straight up all you could see was the under side of her bosom way above you <br>\r\nyou where really aroused lying here on the goddesses panties you had always fantasized about this and for this moment you just enjoyed the moment.<br>\r\nyou could see her moving above you reaching over to get some toilet roll this snapped you out of your fantasy you had to get her attention it was now or never so you rolled onto your front and unsteady stood up she is bound to look down when she pulls up her panties you thought so you ran towards the front it was like trying to run on a really springy trampoline just as you reached the front Donna stood up you where thrown over by the sudden movement you turned over and saw the most amazing site way above you was a huge gaping pussy but form your size it was the size of a small building you screamed at the top of your vice LOOK DOWN IM HERE you frantically waved your arms then her face came into view for a moment you thought she could actually see you but alas no you where in all black in her black panties and you blended in well and you where only half an inch in height you where to small to see she reached down and grabbed ether sided  and you where violently  thrust upwards you where not ready for this and you where thrown to the edge closer and closer you  got to the huge wet pussy you tried one more time to move as you did you lost your balance and fell off the edge on the inside leg of her panties you fell down and down the wind rushing against your face you braced your self for the imminent impact the to your surprise you landed on something  soft you realized you had landed on her pantyhose waiting below you where lying face down looking thorough the black tights at the floor below the once again you felt your world fly upwards the floor disappearing into the distance at rocket speed suddenly your back came into contact with some this warm and silky you felt your pushed harder and harder as the tights where pulled tightly up around Donnas hips you tried to move but you where pinned tightly in between the tights and her panties your view was slightly distorted but you could see through the tights at the floor miles bellow then you saw two huge hands approach and Donna smoothed the tights around you as she adjusted her self then you could see the arms reach down and grab her skirt you saw it approach it came up over you surrounding you in darkens you felt donas legs squeeze either side of you the top of the tights pushing together like a vice as she slipped the tight skirt , rubbing tightly against you as it conformed to her curves, wraped around her thighs as she smoothed it out, you could feel her smoothing it out as she rubbed it over you.  and did up the zip, the pressure released slightly after a moment and you where left looking straight down what like like a long hot  dark tunnel the tights securing you solidly in position against the out side of her panties you could smell the hot sweet aroma of her coming  from behind you,  you where totally trapped unable to move then your world started to move as Donna flushed the toilet and headed out of the toilet <br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1453895520,
            "id":2095134,
            "title":"try and get donnas attention"
        },
        "1111":{
            "author_id":"adam4445",
            "author_name":"adam4445",
            "choices":[
                "continue",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>you whole world starts to shift as Donna walks back to the office form where you are trapped you can see the ground moving bellow you omg  how did this happen you panic you try and move but you are pined tightly by her tights all you can do is watch as your world is rocked back and forward </span></div></div>",
            "created":1474845000,
            "id":2214641,
            "title":"trapped (reserverd work in progress)"
        }
    },
    "info":{
        "author_id":"adam4445",
        "author_name":"adam4445",
        "brief_description":"you are13 year Sammy you have always had fantasy about being small transform into objects ",
        "created":1453218900,
        "description":"<td align=\"left\" class=\"norm\">this is a story of Sammy you are a rather shy you have always had a fantasy about being small or being able to transform into objects and being totally un- noticed and unable to be killed by women you spend lots of time reading giantess story's and wishing it could be you.<br>\r\nyou often used to sit and watch women on the bus or train and look at their shoes especially if they when in skirts and wish you could be in there shoe or up their skirt but you know this was only a fantasy now matter how much you wished it or was it ??? .<br>\r\n<br>\r\nCHARACTERS <br>\r\n<br>\r\nSAMMY <br>\r\n13 year old our little hero shy with a vivid imagination and loves anything to do with shrinking and being unseen by women <br>\r\n<br>\r\nKATHY <br>\r\nSammy mum she is in her mid 30s she is a secretary for a chemical company she is very beautiful and always dresses in skin tight  skirts and blouses to show here ample curves  and also a real keep fit fanatic she had been single for a few years she was a bit of a MILF <br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"https://glossceiling.files.wordpress.com/2014/08/pencil.jpg\" target=\"_blank\">https://glossceiling.files.wordpress.com/2014/08/pencil.jpg</a><br>\r\n<br>\r\nMANDY <br>\r\nsammys 19 year old sister she worked at the local restaurant as a waitress she was very pretty whith blonde hair and a big sexy round ass sammy knew it was wrong but he often fantasized about seeing her naked <br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"https://glossceiling.files.wordpress.com/2014/08/floral4.jpg\" target=\"_blank\">https://glossceiling.files.wordpress.com/2014/08/floral4.jpg</a><br>\r\n<br>\r\nRUTH <br>\r\nthis was Sammy overweight auntie she was a large lady in her 40s that always dressed in clothes the where much to small for her she was pretty Sammy often fantasied about her she worked at the local hotel as a maid <br>\r\n<br>\r\nDONNA <br>\r\nA beautiful secretary in her 30s that works with your mum <br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://2.bp.blogspot.com/-yy81IvGNerU/UTyhEv-wxrI/AAAAAAAAAD8/Yqu4hHdyrc0/s1600/women%20in%20formal%20dress%20for%20office%20%2814%29.jpg\" target=\"_blank\">http://2.bp.blogspot.com/-yy81IvGNerU/UTyhEv-wxrI/AAAAAAAAAD8/Yqu4hHdyrc0/s1600/...</a><br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nno male on male <br>\r\n<br>\r\nno vore <br>\r\n<br>\r\nSammy cant be killed <br>\r\n<br>\r\n<br>\r\n<br>\r\n please no one line chapters <br>\r\n<br>\r\nThis is my first full story and would love your feedback 😊 either leave a review or email me many thanks <br>\r\n <br>\r\n<br>\r\n<br>\r\n</td>",
        "id":2072365,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1474845000,
        "modified":1474845000,
        "pretty_title":"the shrunken adventures of Sammy "
    }
}