{
    "chapters":{
        "1":{
            "author_id":"bibobobobonnor",
            "author_name":"bibo",
            "choices":[
                "It's nothing.",
                "It's the wind blowing and taking you with it.",
                "Ants have come to investigate the bread and sandwich meat next to the mustard.",
                "A squirrel has come to investigate the campsite",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>Jack drove himself up to his little hideaway and proceeded to unpack his things, tent, sleeping bag, marshmallows, really all your cliche camping itinerary, and went about setting up his site.<br>\r\n<br>\r\nThe area he picked was what one might call a glade or clearing, there were trees and bushes skirting the edges, a reasonably flat, albeit bumpy patch of dirt, leaves and patches of grass. There were medium to large sized rocks, ant hills, squirrels, a stream a short walk away, it truly was his happy place.<br>\r\n<br>\r\nAfter setting up his tent and forming a rock circle for the fire pit, he began to feel a little woozy, so drank some water, but the spell came back in waves for the next hour, until, while preparing some dinner for himself, he collapsed.<br>\r\n<br>\r\nNot sure how long he'd been out, he came to, headache thankfully gone, but he had no idea where he was. As far as he could tell he stood in a field of sand skirted at the edges by tall green shrubbery.<br>\r\n<br>\r\nLooking further into the shrubbery, trying to get a better idea where he was and where he'd from, he caught sight of a  large, circular yellow object, and upon moving towards and past this object he realized it was part of a larger structure with words on it. He tried to read it out.<br>\r\nM - U -S - T- A - R - D<br>\r\n<br>\r\nFuck, you'd been shrunk, and a lot, this bottle had to be almost 50 times taller than you.<br>\r\n<br>\r\nJust then you hear movement behind you.</span></div></div>",
            "created":1593740280,
            "id":2860606,
            "title":"A happy little glade."
        },
        "11":{
            "author_id":"bibobobobonnor",
            "author_name":"bibo",
            "choices":[
                "Nothing",
                "Falls down a hole (rodent or insect)",
                "Runs into trouble with a hostile or poisonous plant",
                "An animal takes interest in him"
            ],
            "content":"<div class=\"\"><div> <span>You'd probably just been hearing things, not to mention you're more than a little paranoid given your newfound size. Given this wasn't in your plans and virtually nowhere is safe anymore, you thought it best to seek refuge in your car until somebody can finds it and brings it and you back to civilization.<br>\r\n<br>\r\nThis plan in mind Jack heads out on the long trek towards his vehicle and possible salvation. Along the way he runs into.</span></div></div>",
            "created":1593740520,
            "id":2860608,
            "title":"It's nothing."
        },
        "12":{
            "author_id":"bibobobobonnor",
            "author_name":"bibo",
            "choices":[
                "Hide near the sandwich",
                "Search the surrounding camp and wilderness",
                "Wait for the wind to subside",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Your mass at this size has you much more susceptible to the gentle breeze which was forecast. This gentle breeze could now be compared to gusting winds.<br>\r\n<br>\r\nYou aren't necessarily blown over or away, but the onslaught is difficult to bear, forcing you to find some form of cover in the area.<br>\r\n<br>\r\nThere's always the option to hide near the sandwich and condiments that would provide a wind barrier, but might begin to attract wildlife, hungry wildlife that won't discriminate between you and the sandwich<br>\r\n<br>\r\nYou could find a more suitable location and set up a shelter in the vast forests of grass, dirt and monumental trees.<br>\r\n<br>\r\nYou could drop down and wait for the wind to subside.<br>\r\n<br>\r\nWhat do you choose?</span></div></div>",
            "created":1593741120,
            "id":2860612,
            "title":"It's the wind blowing and taking you with it."
        },
        "13":{
            "author_id":"bibobobobonnor",
            "author_name":"bibo",
            "choices":[
                "Head for the treeline.",
                "Head for your fire-pit, it could provide shelter.",
                "Too late, the ants were scavenging for food and you qualify."
            ],
            "content":"<div class=\"\"><div> <span>A swarm of ants have invaded from a nearby ant hill, a sea of glossy black arms, legs and exoskeleton coming right in your direction. <br>\r\n<br>\r\nIt is with considerable effort, glad for your experience in high school track, that you weren't immediately trampled by the stampede.<br>\r\n<br>\r\nWith the large number of insects swarming the area for food, you feel it's best that you aren't present, so you must search for safer grounds elsewhere, but where.</span></div></div>",
            "created":1593741420,
            "id":2860613,
            "title":"Ants have come to investigate the bread and san..."
        },
        "14":{
            "author_id":"bibobobobonnor",
            "author_name":"bibo",
            "choices":[
                "Make a run for it",
                "Stay where you are",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>It was like Godzilla with fur. It was comparable in size to the now building sized bottle of mustard, but the added advantage of arms and legs and an extreme dexterity that was very unnerving at your size.<br>\r\n<br>\r\nYou had the unfortunate knowledge that other than being crazy for nuts and berries, these small creatures also dined on insects and other small creatures, a category you now fell under.<br>\r\n<br>\r\nThe squirrel hasn't spotted you yet, you do have the option of running for cover, staying where you are or coming up with some other last ditch attempt to save your small feeble life. You hadn't meant this trip to feel like the purge.</span></div></div>",
            "created":1593741840,
            "id":2860615,
            "title":"A squirrel has come to investigate the campsite"
        }
    },
    "info":{
        "author_id":"bibobobobonnor",
        "author_name":"bibo",
        "brief_description":"Jack is shrunken on what was supposed to be a relaxing camping trip.",
        "created":1593738960,
        "description":"<td align=\"left\" class=\"norm\">Jack sets out on a sunny Friday afternoon, planning to spend his weekend relaxing in the solitude of the woods near his house, hiking, reading and enjoying the sights, sounds and smells of nature. Unfortunately, it would seem that Jack pissed off some deity or spirit or magical being along the way, because soon after his arrival, he finds himself with a new stature of roughly 1/8th of an inch in height. Jack will soon realize that the relaxation and solitude he had been seeking is only reserved for those who exceed a certain size, and for the rest it is a constant struggle between life and swift death, and he is now far below that threshold.<br>\r\n<br>\r\nRules:<br>\r\n- He can die, it's expected, just don't do it quickly with absolutely no build up.<br>\r\n- No one line chapters if you can help it, aside from choice chapters or transitions<br>\r\n- Humans can appear on occasion, but this is more an interactive focused on the dangers of being shrunk in the animal world.<br>\r\n<br>\r\nEnjoy and add.</td>",
        "id":2225914,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1593741840,
        "modified":1593741840,
        "pretty_title":"Shrunken Camper "
    }
}