{
    "chapters":{
        "1":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "You walk to Jess' house, alone.",
                "You all walk to Jess' house.",
                "Go window shopping.",
                "Training."
            ],
            "content":"<div class=\"\"><div> <span>I opened my eyes to see my old body jumping up and down in front of me, filled with joy. I looked down at my current one to see a pair of breasts and smooth, hairless legs topped off by short black shorts. Stuttering, I looked up at Cassie, who was now whispering something to Jess in my old body. She turned and walked over to where I stood.<br>\r\n<br>\r\nCassie: Hey, \"Jess\"!<br>\r\n<i>She laughed.</i><br>\r\nMe: Hey...<br>\r\nCassie: So how does it feel? You know. Being a girl and all?<br>\r\nMe: um.<br>\r\nJess: Don't worry Dan. You'll get used to it. I love your body by the way! I might want to stay here.<br>\r\nMe: Jess!! What?<br>\r\nJess: I'm just messing with you!<br>\r\nCassie: Maybe.<br>\r\n<i>They giggled to themselves.</i><br>\r\nMe: OK. What now?<br>\r\nCassie: Now we leave this alley.<br>\r\n<i>We began to walk out.</i><br>\r\nJess: Wait!<br>\r\n<br>\r\nJess turned to me and pushed my shoulders back, making my/her breasts more obvious underneath her yellow-striped top. I felt even more uncomfortable but knew I had to play the part to avoid messing up Jess' life. She squeezed my butt with my/her stronger hands, making me squeal, and flashed an evil smile.<br>\r\n<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://babescene.com/babe/image/medium/babescene.com_sheh79.jpg\" target=\"_blank\">http://babescene.com/babe/image/medium/b...</a></span></div></div>",
            "created":1333429200,
            "id":1308479,
            "title":"The Switch"
        },
        "11":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "Continuation...",
                "I change my mind."
            ],
            "content":"<div class=\"\"><div> <span>Jess: Dan, I should be back home now. My parents are coming back in an hour or so, and they'll probably start calling the home phone.<br>\r\nMe: Now? How am I going to be able to fool your parents?<br>\r\nJess: You'll do fine.<br>\r\nMe: I guess they wouldn't really suspect something like this has happened anyway...<br>\r\nCassie: Do you remember where her house is? I mean <i>your</i> house?<br>\r\nMe: Uh, yeah. It's just two blocks to the west of here. Jess, please don't do anything embarrassing!<br>\r\nJess: Calm down. I've got everything under control.<br>\r\nCassie: Ha! Literally! Don't worry about us. We'll just walk around a bit more.<br>\r\nMe: Fine. See ya.<br>\r\nCassie: Bye <i>Jess</i>!<br>\r\n<br>\r\n<i>Jess!</i> I shivered.<br>\r\n<br>\r\nI spun around one last time to see that they had already left. Sighing, I crossed my arms snugly underneath my boobs (I would deal with <i>those</i> later) and rubbed my naked legs together in the light breeze. It was getting really cold, just standing around like this. I really felt vulnerable, so I pushed Jess' dirty blonde hair behind my ear and walked \"home\".<br>\r\n<br>\r\nAs soon as I saw the front door, I paused for a moment to take it all in. Then, with a new level of determination, I retrieved the house key from Jess' purse and unlocked the door. Because I had been to her house before, I knew where to find her room. I threw the purse onto her desk and collapsed onto the lavender sheets of her bed. <a rel=\"nofollow\" href=\"http://babescene.com/babe/or3l1s/\" target=\"_blank\">http://babescene.com/babe/or3l1s/</a><br>\r\n<br>\r\nMy growing urge to inspect my new body kept me from focusing on the ceiling much longer. I stood up from the bed and walked myself into the bathroom.</span></div></div>",
            "created":1333515600,
            "id":1309138,
            "title":"You walk to Jess' house, alone."
        },
        "111":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "More",
                "Bottom",
                "Clothes"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://goo.gl/OQmP2\" target=\"_blank\">http://goo.gl/OQmP2</a><br>\r\nMy reflection took my breath away. I kept on thinking that I was looking at Jess through a window. I lifted my dainty hand up to meet my reflection, only to touch the smooth glass. After a quick instinctive look over my shoulder, I leaned forward and kissed my reflection. That was weird. I just kissed my sister's best friend -well kind of. Normally I would contain my attraction for people Jess' age, but I guess I was now in the world of 13-year-olds once again.<br>\r\n<br>\r\n\"It's just me.\", I whispered to the face in the mirror.<br>\r\n<br>\r\nI moved my wavy hair out of my face and inspected my torso. I couldn't relate to anything in that area. I nervously removed the yellow-striped top. Jess' breasts were still hidden underneath a tight grey tanktop and purple bombshell bra. Jess was very mature for her age.<br>\r\n<br>\r\nThen I began to panic.<br>\r\n<br>\r\n<i>The plump, heaving breasts! The curvy thin body and the empty crotch! The long girly hair!</i><br>\r\n<br>\r\nWait. This was my body. That meant I had total control. That meant that this was my life, my room, and my clothes.<br>\r\n<br>\r\nWith a smile, I tore off the grey tanktop and stared at my boobs, eating them with my eyes. I could feel my crotch becoming damper, but I would save that for later. Those boobs were all mine. <a rel=\"nofollow\" href=\"http://babescene.com/babe/image/large/babescene.com_x8naz9.jpg\" target=\"_blank\">http://babescene.com/babe/image/large/ba...</a><br>\r\n<br>\r\nI struggled a bit, trying to remove Jess' purple bra. Finally they were exposed, and I was awestruck. I squeezed one carefully with my hand and felt a wave of pleasure spreading throughout Jess' body. <i>Thank you Jess!</i></span></div></div>",
            "created":1333774800,
            "id":1310703,
            "title":"Continuation..."
        },
        "1111":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "Clothes",
                "Jess' room and her possessions.",
                "Something Else..."
            ],
            "content":"<div class=\"\"><div> <span>It felt so strange to be so horny in a girl's body. I felt I wanted something. Something ...fulfilling.<br>\r\n<br>\r\nOnce again, I squeezed one of my boobs, making Jess' entire body tingle with excitement. <i>Ooh Jess!</i><br>\r\nI could hear the higher tones of my breathing and was reminded of my currently feminine state.<br>\r\nNothing was a secret anymore.<br>\r\n<br>\r\nI smiled into my reflection, staring deeply into Jess' hazel eyes<br>\r\n\"Hi, I'm Jess!\" I said in the girliest possible way. I let out a 'natural' laugh, trying to imitate Jess to the best of my ability.<br>\r\nI then puckered my lips and leaned toward my reflection. \"Hey there sexy. Want to stick your dick into my vagina? It's good and wet!\"<br>\r\n<br>\r\nI then turned my attention to my... my... vagina. Without hesitation, I let my dainty little fingers slide carefully into Jess' sensitive pussy. The sensation overwhelmed me, and I stumbled backwards, dazed and giggling. <i>Oh my God! I should've switched with Jess a long time ago!</i> I bit my bottom lip shyly as I lightly prodded the soft tissue with my finger, stroking the opening. I felt a shiver run up my spine. Nothing could have prepared me for those feelings I felt then. I decided to embrace my induction into life as a girl by sliding my fingers into Jess' pussy once again. I had to steady myself against the counter for a few moments as I was getting started. A few minutes in, I was breathing hard. My chest was tempting me with its rhythmic movements, wishing for me to embrace and to take pride in my womanhood. It felt wonderful. I felt so... so.. feminine! Then I orgasmed, causing my toes to curl on the cold tiled floor, and all my muscles relaxed at once. I shivered as my fluids released, leaving me satisfied and shaking with pleasure.<br>\r\n<br>\r\nI looked in the mirror one last time. Now I saw someone else in Jess' reflection. It was me, and I didn't have any desire to leave her body any time soon!</span></div></div>",
            "created":1333947600,
            "id":1312041,
            "title":"More"
        },
        "11111":{
            "choices":[
                "Phone rings",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>You walk into Jess'es closet and begin searching finding dresses, shoes and what not to make <b>your</b> body look fantastic. You spend several minutes feverishly finding what you would would want to try out, in a giddy fury almost stopping at a near mountain of clothes on her bed and changing. First and foremost, the red dress. <a rel=\"nofollow\" href=\"http://cdnd.lystit.com/photos/2012/02/10/style-stalker-red-teen-dream-dress-product-1-2876057-074409723_large_flex.jpeg\" target=\"_blank\">http://cdnd.lystit.com/photos/2012/02/10...</a> Your smile reflects your jubilant mood, you never felt so right before in your life. Boys tend to stick with the same, t-shirt, jeans getup. But now there are options, you can be tomboyish or you can be drop dead sexy. You strip the dress, deciding to accessorize, trying a necklace laying around and a collared shirt with skinny jeans and a sweater/ <a rel=\"nofollow\" href=\"http://4.bp.blogspot.com/-GxOneZ81Pcg/T5steJm7E0I/AAAAAAAADE8/h9ChL0kkMKQ/s1600/photo+3+\" target=\"_blank\">http://4.bp.blogspot.com/-GxOneZ81Pcg/T5...</a>(28).png Oh how Jess was such a fool to give this up. </span></div></div>",
            "created":1344402000,
            "id":1400719,
            "title":"Clothes"
        },
        "111111":{
            "author_id":"pompombella",
            "author_name":"SarahandAshley",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was Jess and she wanted to come over for some reason ...</span></div></span></div>",
            "created":1377579600,
            "id":1652764,
            "title":"Sexy invitation?"
        },
        "1111111":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "Hell yeah! Agree to do it.",
                "Maybe wait a.little bit..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When she arrives, she wants to have sex with you.</span></div></span></div>",
            "created":1434862800,
            "id":1996256,
            "title":"continue"
        },
        "11111111":{
            "author_id":"dlockwood",
            "author_name":"Dlockwood",
            "choices":[
                "Keep going ",
                "Ask to switch back "
            ],
            "content":"<div class=\"\"><div> <span>Jess came over in you body. You felt the female hormones kick in. You wanted him[her] . She hoped on top of you and started putting her dick inside of you. You loved it but then she chummed inside you. You realized that you might now get pregnant and have to rais a kid.</span></div></div>",
            "created":1487134800,
            "id":2277758,
            "title":"Hell yeah! Agree to do it."
        },
        "111111111":{
            "choices":[
                "Hi with it?",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>You think there is fuck all I can do now and you feel Jess is still hard and your so close to having an orgasm.<br>\r\n<br>\r\nYou feel Jess start to pull out so you wrap your legs around her to pull her closer and you both continue your activity till you final have an orgasm.<br>\r\n<br>\r\nAs you do you felt the muscles inside your vagina grip the penis inside you and you felt Jess shoot inside you again and the pulsing of it felt nice.<br>\r\n<br>\r\nYou then both collapsed into each other and smiled, laughed and then kissed.<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1487134800,
            "id":2277829,
            "title":"Keep going "
        },
        "1111111112":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>parents walk in</span></div></span></div>",
            "created":1523558340,
            "id":2478896,
            "title":"Something else?"
        },
        "11111111122":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>her older brother walks in?</span></div></span></div>",
            "created":1536648180,
            "id":2546140,
            "title":"no"
        },
        "111111111222":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jess's boyfriend walks in?</span></div></span></div>",
            "created":1536910020,
            "id":2547542,
            "title":"no"
        },
        "1111111112222":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jess's Brother?</span></div></span></div>",
            "created":1536987060,
            "id":2547920,
            "title":"no"
        },
        "11111111122222":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jess's girlfriend</span></div></span></div>",
            "created":1537089120,
            "id":2548461,
            "title":"no"
        },
        "111111111222221":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "A year later on your 15th birthday or Jessica's birthday should I say",
                "The following Monday at school "
            ],
            "content":"<div class=\"\"><div> <span>Jess laid on top of you in your body as you both recovered from the activity you just did.<br>\r\n<br>\r\nYou hear a scream \"Jess what the hell\" you see a girl and then she ran out crying. <br>\r\n<br>\r\nYou look at Jess \"who was that?\" she smiled and said my girlfriend sorry ex girlfriend now. <br>\r\n<br>\r\nOr your ex girlfriend should I say and happy birthday by the way. <br>\r\n<br>\r\nWhat? Your 14 today and you've just lost your virginity... She kissed you and then got of you and got redressed. <br>\r\n<br>\r\nWhere from here? </span></div></div>",
            "created":1546773360,
            "id":2599520,
            "title":"yes"
        },
        "1111111112222211":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "You have a three month old daughter ",
                "You are on your period "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A year later its your 15th birthday but it isn't a happy one...<br>\r\n<br>\r\nWhy? </span></div></span></div>",
            "created":1563288180,
            "id":2687608,
            "title":"A year later on your 15th birthday or Jessica..."
        },
        "11111111122222111":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>You see last year when me and Jess had sex on her 14th birthday and I was in her body and she took her own virginity.<br>\r\n<br>\r\nWell I got pregnant and 9 months later Amelia was born to give her full name it's Amelia Danielle Christiansen I gave her her father's last name. <br>\r\n<br>\r\nMe and Dan or Jessica as she was are parents now and we are just friends although I guess we are family now as we have a daughter together.</span></div></div>",
            "created":1563288720,
            "id":2687610,
            "title":"You have a three month old daughter "
        },
        "11111112":{
            "choices":[
                "Go with it?",
                "Pull her hand out and talk to her?"
            ],
            "content":"<div class=\"\"><div> <span>Maybe not right now Jess don't think I'm ready for that at this moment.<br>\r\n<br>\r\nYou turned around and picked up the fees off the floor and the put it back in the closet but as your back was turned Jess walked up behind you and quickly put her hand down the front of your jeans and into your panties.<br>\r\n<br>\r\nThe all of a sudden all the feeling that you felt before came rushing back and you subconsciously started m9ving with her hand.<br>\r\n<br>\r\nWhat did you do?</span></div></div>",
            "created":1485061200,
            "id":2267711,
            "title":"Maybe wait a.little bit..."
        },
        "111111122":{
            "author_id":"petergriffi923",
            "author_name":"Petergriffin923",
            "choices":[
                "Ok fine. Just make it quick",
                "No we just swapped bodies earlier and I'm not ready to have sex "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jess why did you think it was a good idea to touch me like that. <br>\r\n<br>\r\nJess- I'm sorry Dan but your testosterone is driving me crazy. I need to fuck someone soon, dan can you please help me out?</span></div></span></div>",
            "created":1499058000,
            "id":2346370,
            "title":"Pull her hand out and talk to her?"
        },
        "1111111222":{
            "choices":[
                "Yes ok, but no sex i'm not ready for that yet",
                "No, why don't you go fuck my best friend Adam"
            ],
            "content":"<div class=\"\"><div> <span>Well could you do something to help me and your old body then, like what? well could you do something maybe suck your old dick that may help we from been so randy and then if you do i'll go down on you and i'll help you too.<br>\r\n<br>\r\nwhat do you say....</span></div></div>",
            "created":1501045200,
            "id":2359561,
            "title":"No we just swapped bodies earlier and I'm n..."
        },
        "11111112221":{
            "author_id":"literrexs",
            "author_name":"Literrexs",
            "choices":[
                "Does it end now?",
                "Jess totally gets what she deserves"
            ],
            "content":"<div class=\"\"><div> <span>“Okay dan or should I say Jess” she smirked at me.<br>\r\n<br>\r\nI just smiled but was very nervous so I feel that she could tell easily.<br>\r\n<br>\r\nI was much shorter then I use to be but when I got on my knees my legs made up for my height cause I was just the right height.<br>\r\n<br>\r\nI looked at her crotch then up to her face, “do you need me to undo your pants as well?”<br>\r\n<br>\r\nShe jumped and said my bad then undid the button and zipper and it all came down before me, my cock leaping out before me. <br>\r\n<br>\r\nI never really thought I was big just average but I must concede from this vantage point I was down right menacing. Long, thick and veiny. <br>\r\n<br>\r\nThere was a shine on the tip and I new damn well what it was. God I should kick myself for agreeing to this. <br>\r\n<br>\r\nI slowly moved forward with my tongue out cringing at the inevitable. <br>\r\n<br>\r\nUpon contact my tongue tasted something very different to what I expected. It was definitely a rough taste but my taste buds registered something sweet as well. Do women develop different tastes for things are is it just her? Does cock and jizz taste good when your a guy? I’m ahead myself though I haven’t even tasted cock yet.<br>\r\n<br>\r\nI slowly started opening my mouth more and taking the head in. She just moaned out like I was giving her the best back massage after a 10 mile walk carrying a boulder. I suppose she’s carrying two boulders really. They look gigantic to me in this body. <br>\r\n<br>\r\nI was only about halfway down and I don’t think I could take anymore. I was going back and forth using my lips to try and cover more ground slowly building a pace. She then started laughing.<br>\r\n<br>\r\nI stopped and with my hand now at the base I pulled off and asked, “what’s so funny?”<br>\r\n<br>\r\n“Oh yea I should probably let you know now. I have the amulet right now. I’m never switching back with you.” She looked down right predatory at me right now.<br>\r\n<br>\r\n“What? You agreed!!!!” I stammered.<br>\r\n<br>\r\n“No, I just said what you needed to hear to let me do this. Jessica, which is your name now and always will be.... I’ve always been into girls since as far back as I could remember. I really liked your sis but she’s my friend I couldn’t do that nor do I think she would let me. No, you see I’m gonna take you instead.” She was smiling, towering over me in complete control.<br>\r\n<br>\r\n“The hell you are!” I yelled.<br>\r\n<br>\r\nGoing to get up I was stopped with one simple word uttered from her, “freeze.”<br>\r\n<br>\r\nI was motionless. <br>\r\n<br>\r\n“Now here’s how it goes, this amulet let’s me change things. You are now Jessica and have always been. You remember everything about Jessica’s life.” All these life events flashed before me, it was making me dizzy.<br>\r\n<br>\r\n“You’ve always had a thing for me you best friends brother Dan. We’ve grown fond of each other as we’ve gotten older and matured. Now that your 14 it’s technically legal in this state for us to fool around... with consent of course, which you’ve been waiting years to give me.”<br>\r\n<br>\r\nI was staring at the boy I had fallen in love with back when I was 10 and he was 12. He wouldn’t even give me the time of day back then, but now I’ve grown into this womanly body which will only mature better over time like a fine wine that my man will enjoy for all time. I hope. Butterflies were messing with my stomach as I held his cock and looked up into his eyes.<br>\r\n<br>\r\n“Now Jess we can’t let my sis know about us until we’re much older.” He said down to me.<br>\r\n<br>\r\n“I like totally agree. She would freak if she new her friend was messing with her brother. I swear dan complete silence on my end.” I was smiling the brightest smile I could at him. God I loved him and his scent everything really.<br>\r\n<br>\r\n“If she asks we were switching back when I came over and then we talked and realized we had a lot in common. That will make her think we’re just being friends later on when we spend time together, okay?”<br>\r\n<br>\r\n“Makes sense.” I chirped.<br>\r\n<br>\r\n“Well let’s get back to it. Also you’ve been practicing sucking cock with bananas and cucumbers for the last year so you can suck cock better.” He laughed a little. I didn’t understand why he was laughing. <br>\r\n<br>\r\nI just looked back at his cock for a moment to line up right then started going to town on his 7 1/2 inch cock. Bobbing up and down putting my nose into his pubes as I looked back up to make as much eye contact as possible. <br>\r\n<br>\r\nHe was really moaning now and I could feel him stretching back to try to get temporary relief from bj overload. I wonder if anyone’s done this for him before. Am I his first? He’s mine. My heart fluttered at that thought. I’m such a lucky girl getting this hottie for my first experience. I’m glad I’ve been practicing for like a year.<br>\r\n<br>\r\nThis went on the sucking and cuddling of his balls with one hand and the squeezing of his tight butt with the other for like 15 minutes before he erupted into my mouth he pulled it out and shot at least half all over my smiling eager face. I don’t care if some got in my hair or shirt I was just happy to please my secret boyfriend. I can’t wait for the day I get to let it be known that I’m the luckiest lady on earth. <br>\r\n<br>\r\n“Thanks babe.” He blurted our as he panted catching his breath.<br>\r\n<br>\r\n“No, thank you that was a lot from my big man.” I smiled as I slowly squeezed his shaft with my right hand and scooped jizz with my left and put in my mouth.<br>\r\n<br>\r\n</span></div></div>",
            "created":1553068560,
            "id":2632560,
            "title":"Yes ok, but no sex i'm not ready for that yet"
        },
        "111111122212":{
            "author_id":"literrexs",
            "author_name":"Literrexs",
            "choices":[
                "Sleep",
                "Vaginal",
                "Anal"
            ],
            "content":"<div class=\"\"><div> <span>He put his hands under my arms and lifted me to my feet. He’s so handsome and strong. I was walked back till I touched the bed then he shoved me. I fell back onto my soft comforter.<br>\r\n<br>\r\n“Let me show you how much I appreciate you baby.” He said getting to his knees.<br>\r\n<br>\r\nHe pullled my pants down and I was exposed to this big man. I would be lying if I said I wasn’t a little embarrassed I mean he’s so handsome and I’m so average for a girl. <br>\r\n<br>\r\nMy body didn’t seem to turn him off though. He grabbed my hips and pulled me to the edge of the bed I’m so tiny compared to this man. he just muff dived straight into my clit and I saw stars. I was moving my butt so that my pussy was rubbing up and down on this tough chiseld and somewhat rough chin. He must have to shave daily but I like the stubble it adds to the friction that is currently sending me to heaven.<br>\r\n<br>\r\nI was moaning and grunting, “ fuck! oh fuck! Danny baby oh god fuck! Fuck! Fuuuuuccccckkkkkk!!!!!!!!!!!!!!!!!” I screamed and orgasmed which led to another and another and one more that was just a bit to much. I had to start pulling back and was pushing his forehead but he just wrapped his arms around my legs pulled me toward him and held me there as he kept going.<br>\r\n<br>\r\n“Oh shit!!!! Fuck! Fuck! Dannnnnnyyyyyy! Fucking Christ!!!! Oh! My! Gooooooddddddd! Fuck me! Fuck me!!!! I’m your slut baby!!!!! I’m your dirty sluuuuuttttttttttt!!!!!!!! I slammed my head back and started throwning fists into the the bed at my sides. He then thankfully but also sadly stopped. And I was panting and damn there crying. really! I swear!!!<br>\r\n<br>\r\n“Oh god baby.” I slurred as he climbed next to me. “There’s no way my bj made you feel as good as what you did to me.” I was oozing from what felt like everywhere sweat and juices were pouring from me. I was melting like a Salvador Dali painting.<br>\r\n<br>\r\n“Well there’s something I’ve always wanted to try if you wanna hell.” He said holding me from behind.</span></div></div>",
            "created":1553069880,
            "id":2632566,
            "title":"Jess totally gets what she deserves"
        },
        "1111111222122":{
            "author_id":"literrexs",
            "author_name":"Literrexs",
            "choices":[
                "Dreams of a lost soul",
                "Girly and happy dreams",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>“I suppose I could help, what do you have in mind?” I said this innocently but I had an idea of what he wanted.<br>\r\n<br>\r\nHe moved back and pulled my shoulder so I was on my back and he put his hand on the front of my neck. <br>\r\n<br>\r\nI wasn’t scared if anything I was excited, waiting just waiting for him to say it.<br>\r\n<br>\r\n“I want you to be my first.” He said and looked me dead in the eyes.<br>\r\n<br>\r\nI was beet red I’m sure and extremely turned on. I just looked into his eager and hungry eyes. “Give me what you got, I’m all yours baby.” I practically moaned. <br>\r\n<br>\r\nHe slowly climbed between my legs and spread them. Keeping his hand on my throat and full eye contact, I love his control. <br>\r\n<br>\r\nHe easily had the tip between my lips and I shuddered with delight. You know for his first time he seems pretty good at handling a woman, I thought. But it’s not a thought I dwelled on because he slowly started inching his way in.<br>\r\n<br>\r\nHe was halfway in and I had my legs wrapped around his tight butt. That’s when it happened.<br>\r\n<br>\r\nThump! Was what I swear I heard and for sure felt as he dropped all the way in. It hurt for a second but his in and outs created a pleasurable hum afterwards. I was in the throws of ecstasy as he choked me and made out with me. Constantly pounding I was writhing on my mans cock. The bed pushing me back up to meet his thrusts as he pulled out just to come back in. <br>\r\n<br>\r\nThis was becoming maddening I had lost control swear and moaning all mixing as one as we became one person.<br>\r\n<br>\r\n15 minutes into this I had orgasmed so many times I had lost count as my eyes rolled back with each thrust then came back to gaze upon my man as he pulled out just to repeat and repeat. <br>\r\n<br>\r\nHe was really starting to grunt and said, “get ready.” I’m inexperienced I didn’t know what he meant, but I’d find out now. He pulled out and yanked me to the end of the bed my butt slamming the carpet of my bedroom my head hanging on the edge laying back onto my bed.<br>\r\n<br>\r\nHe proceeded to yank his beautiful cum covered cock before me and I just hummed with a smile and my mouth and tongue out for him. He shot rope after rope of hot jizz into my mouth and on my face.<br>\r\n<br>\r\nI was happy and content licking his cock up and down the shaft and taking fingerfulls of his seed for my hungry mouth. <br>\r\n<br>\r\nWhen he and I were cleaned up he said he had to go and I just waved him off as I fell into a deep and heavy sleep. <br>\r\n<br>\r\nWhat would come to me in my dreams I wondered as it all went black.</span></div></div>",
            "created":1553728560,
            "id":2635827,
            "title":"Vaginal"
        },
        "11111112221221":{
            "author_id":"literrexs",
            "author_name":"Literrexs",
            "choices":[
                "Sure come on over moms cool with it",
                "I don’t feel up for it",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>I woke up in a bed and sat up. Looking around I realized this is dans room. I went to lift the covers when I realized these weren’t my hands. They were rough and big. Hair on the arms, I thought what the hell. <br>\r\n<br>\r\nI pulled the covers off and turned putting my feet on the ground. I’m wearing boxers and wait a sec I recognize these muscles. I just had them all over me. How could I ever forget haha.<br>\r\n<br>\r\nWhen I stood up to look for a mirror the room vanished and I was in a cell looking through bars. I went to the bars out my hands on them and could see a door that opened revealing... myself. <br>\r\n<br>\r\nWeird seeing yourself from outside of your body. <br>\r\n<br>\r\nMy body started acting on its own accord trying to pry open and slam against the bars I felt humiliation for some odd reason.<br>\r\n<br>\r\nMy actually body came to the bars and started laughing and pointing at me.<br>\r\n<br>\r\n“You never knew did you? That you would end up being the girl! The slut to me hahaha! Remember those times you used to pick on me and Cass! Well now I own you and your destiny! You are mine forevermore!” She kept laughing then poof she was gone.<br>\r\n<br>\r\nI heard a child whimpering behind me. I had control of this body now and turned around to see a child crouched and crying in the corner.<br>\r\n<br>\r\nI walked up to this little boy and put my hands on his shoulder.<br>\r\n<br>\r\n“Hey calm down everything’s alright. I’m here for you.”<br>\r\n<br>\r\nThe child immediately jumped and his head turned to me. I’d seen his face I know it. Cassie’s house had picture of he family and this was a young dan. <br>\r\n<br>\r\nHe looked at me then said, “ no your not. Your not here anymore and you never will be.”<br>\r\n<br>\r\nI jumped up from bed in a cold sweat. <br>\r\n<br>\r\n“What the hell?” I said with my heart beat racing. Maybe I should see a therapist. <br>\r\n<br>\r\nI sat onto the edge of the bed and my body felt roughed up but pretty good haha. I’m so happy and content right now.<br>\r\n<br>\r\nI looked and saw my phone on the night stand, upon checking it I saw my mom had texted she’d be home late. Kinda of a bummer seeing as it was 8 so she’d be home real late but I suppose that’s the price you pay when your father walks out. Your mother works tirelessly to pay the bills. <br>\r\n<br>\r\nI saw another text from Cassie. <br>\r\n<br>\r\n“Hey girl, I’m glad your back to normal my brother is being weird as usual lol.”<br>\r\n<br>\r\nI smiled thinking that if only she knew the side of him I knew she’d prbably think he was great.<br>\r\n<br>\r\nI texted back, “nothing much just slept like crazy long. Will b up all night. You?”<br>\r\n<br>\r\nMoments later a text shot up.<br>\r\n<br>\r\n“Want me to come spend the night I got nothing better to do and we could like chit chat and stuff.”<br>\r\n<br>\r\nI thought for a moment then hit up my mom she didn’t seem to mind. So I went to text her back.</span></div></div>",
            "created":1553733780,
            "id":2635856,
            "title":"Dreams of a lost soul"
        },
        "11113":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you decide to shower</span></div></span></div>",
            "created":1540119660,
            "id":2566654,
            "title":"Something Else..."
        },
        "1113":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "putting on something new",
                "go onto something completely new",
                "someone comes in"
            ],
            "content":"<div class=\"\"><div> <span>After that I decided to go to her wardrobe and look in it to see Loads of clothes from dresses to other girly objects.<br>\r\nTaking one of the dresses and putting it one. It was easy for some reason. I stared at myself in the mirror and twirl and felt at the dress before selecting something new. Some nice clothing. <br>\r\ntaking of the dress and putting on the new clothing and making sexy poses at myself in the mirror <br>\r\nthen</span></div></div>",
            "created":1343624400,
            "id":1393324,
            "title":"Clothes"
        },
        "11131":{
            "choices":[
                "Jess's parents come in",
                "I bump into Cassie and Jess"
            ],
            "content":"<div class=\"\"><div> <span>The dresses worked fine for amusing myself, staring in the mirror and twirling the hemline like a fashion model, but I couldn't go out on the town wearing this. Walking on the streets with bare legs and an open bottom that threatened to fly up at the slightest wind - I was comfortable but not <i>that</i> comfortable.<br>\r\n<br>\r\nBut I wanted to take a risk. Jess and Cassie put me in this body because they wanted to prove how uncomfortable girls are when guys whistle at them. Well, I was going to show them that I could take all that. I would dress and look and act sexy, and while I'd turn down any guy who tried to pick me up, I'd rest knowing A) I had proven these girls wrong after they thought they beat me and B) I had Jess's body to myself; it was mine at the end of the day, every day, for the next month.<br>\r\n<br>\r\nSo I took out a white halter top and low rise jeans, enough to leave Jess's tan midriff and arms open to leering eyes, and put on the first bra that looked tight and was darker than the shirt. Somehow I worked the straps into place without a problem. \"It's like I know how to do it...\" I muttered, then remembered: \"Oh yeah. Jess's body has done it every day. Muscle memory, duh.\" With the shirt on, I adjusted the straps to peek out slightly. The whole dress-up felt like a game. I pushed Jess's hair over my shoulder and rolled her eyes up, puckering my lips and striking a ditzy peace sign. \"Here I come world!\" I said and went for the front door.</span></div></div>",
            "created":1343797200,
            "id":1395091,
            "title":"Clothes to Knock Them Dead"
        },
        "111312":{
            "choices":[
                "She's mad",
                "She laughs "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You walk down the street, feeling  confident that you would prove those two wrong. However, as you turn a corner, you bump into them!<br>\r\nWhat is Jess's reaction to seeing her body dressed this that?</span></div></span></div>",
            "created":1464152400,
            "id":2153807,
            "title":"I bump into Cassie and Jess"
        },
        "112":{
            "author_id":"swordfish56",
            "author_name":"jademaster56",
            "choices":[
                "A plan to get back at Jess",
                "\"Jess\" is hungry, it will have to wait.",
                "other ideas?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Very well, what do you believe should happen next then?</span></div></span></div>",
            "created":1475643600,
            "id":2219307,
            "title":"other ways the story could go?"
        },
        "1121":{
            "author_id":"swordfish56",
            "author_name":"jademaster56",
            "choices":[
                "Begin to fatten up",
                "Become lazy",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How should Dan get back at Jess?</span></div></span></div>",
            "created":1475643600,
            "id":2219308,
            "title":"A plan to get back at Jess"
        },
        "11211":{
            "author_id":"swordfish56",
            "author_name":"jademaster56",
            "choices":[
                "In the bathroom",
                "The plan starts in the kitchen"
            ],
            "content":"<div class=\"\"><div> <span>I shook myself of the urge to explore. At least, for the moment anyway. How dare Jess switch us without a real plan to switch back! I began to think of a way that I could get back at her. I would have to force her to switch us back, but how? After a few minutes of contemplation, I found the perfect solution! Many girls were concerned for their figures, and the surprisingly mature body I currently inhabited was most likely no exception. So maybe I could fatten this body up, and blackmail Jess along the way. It was genius, as I vaguely remembered Jess's parents were both chefs, and well off. There would be no shortage of food to eat. As I could no longer stand it, I went into the bathroom to explore, plan already in mind on how to get my body back.</span></div></div>",
            "created":1475643600,
            "id":2219328,
            "title":"Begin to fatten up"
        },
        "112112":{
            "author_id":"swordfish56",
            "author_name":"jademaster56",
            "choices":[
                "In the shower the next morning...",
                "a week later..."
            ],
            "content":"<div class=\"\"><div> <span>After a slight exploration session. ( I would wait until a shower tonight to <i>really</i> explore.) I made my way down to the kitchen. It was a modern setup, with a large pantry in the back and any kitchen device you could imagine in the front. I went directly to the pantry. While in there, I found cookies, chips, and a large slab of bacon and hamburger. As my goal was to fatten Jess's body up, this seemed like a logical start. I took my selections, ( some of which I had to stand on a stool to get at.) I rooted around the front of the kitchen and finally found what I was looking for. A deep fat fryer. After fiddling with the settings, I added some oil and put the first round of meat in. The smell was incredible. A symphony of smell escaped the fryer, and I found myself nearly salivating at the thought of my creations. Soon thereafter, I put the finished meal on a series of plates, and chowed down. The experience was... cathartic. After the initial nausea, ( combatted by the thought of a fatter Jess and a sooner switch.) I put myself through it. At the end, my shirt was covered in a film of grease, and was beginning to rise along my poor, round tummy. After that, a wave of tiredness enveloped me and ended up with me falling asleep almost instantly when I collapsed on Jess, no my, bed. My last thoughts on how fat little Jess would be very soon.</span></div></div>",
            "created":1475643600,
            "id":2219467,
            "title":"The plan starts in the kitchen"
        },
        "1121122":{
            "author_id":"swordfish56",
            "author_name":"jademaster56",
            "choices":[
                "Jess calls...",
                "Jess shows up at the house"
            ],
            "content":"<div class=\"\"><div> <span>After about a week, promising results had started to show up. After a solid week of eating anything I pleased and playing on Jess's phone for a week, I had made a decent dent in the young Jess's physical appearance. My stomach had lost the muscle Jess had worked hard to build, and replaced it with a thick layer of blubber. I could barely sit up at times and running around was quite difficult. My belly was secondary to my mind than my fatter breasts, which unfortunately were beginning to sag a bit. Poking them, squeezing them, and jiggling them was quite a pleasant experience, if a bit dirty. My thighs had fattened up considerably, jiggling with the slightest movement I made. In fact, the gap that had been between jess's legs was gone now, replaced with soft tissue. My ass also had expanded, wrecking quite a few pairs of pants and sticking out in a bit of a shelf behind me. No doubt about it, Jess was going to have to swap with me in order to save her body. Titillated, I ran into the bathroom and stripped completely naked. I began to take pictures of myself and attached a message to the rather suggestive pictures which read, \"<i>If you want to get your body back in decent shape, come to my house to switch. Go alone. See you later.</i> Satisfied with the message, I decided to eat another plate of burgers and play with my ass and thighs while I waited for Jess to call back. This was going to be good.</span></div></div>",
            "created":1476075600,
            "id":2221820,
            "title":"a week later..."
        },
        "11212":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "Change into something more comfortable...",
                "Do things your way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do you start off being lazy?</span></div></span></div>",
            "created":1475643600,
            "id":2219309,
            "title":"Become lazy"
        },
        "112121":{
            "author_id":"swordfish56",
            "author_name":"jademaster56",
            "choices":[
                "Parents call",
                "Get some more food and a movie"
            ],
            "content":"<div class=\"\"><div> <span>A sudden tiredness permeated through my body. I nearly fell over, feeling my new, um, <i>assets</i> jiggling like mad. As I slowly picked myself back up, it became clear that I was not doing anything else that evening. It was a strange, nearly supernatural feeling. I was only just able to crawl down to the kitchen for an early dinner. Thanks to my recent blurry vision, I desperately grasped at whatever I was able to from their surprisingly large pantry. I came up with two bags of chips, two cans of coke, and a tray of cookies.Not the most healthy dinner, but then again, I thought, why is that such a bad thing right now? I staggered to Jess's room and pathetically flopped down upon the bed. I started on the chips, some missing my mouth and landing on Jess's, no <i>my</i> tits. The same thing occurred with the cookies (apparently the swap seemed to bring out an appetite, I though a bit hazily.) until finally, in a desperate thirst, I grabbed one of the cans of coke and tried to just sip it. However, my eyesight blurred yet again and some of the can's contents landed on my shirt and chest again. At that point, a warm feeling began to flow through my body, making it hard to concentrate. I finished both of the cokes, the last of the sweet liquid going down my throat, when I accidentally let loose a loud, deep belch. I had never heard such a thin, young woman let out such a noise. Then, a long, loud fart escaped from Jess's (Goddamit, <i>my</i>) bigger ass. I spent the next five minutes attempting to quiet myself, feeling my dirtied chest and exploring my soft, yielding rear end. After I had quieted down, I passed out, a wet feeling soon spreading from below.</span></div></div>",
            "created":1475643600,
            "id":2219366,
            "title":"Change into something more comfortable..."
        },
        "1121211":{
            "author_id":"swordfish56",
            "author_name":"jademaster56",
            "choices":[
                "watch a movie",
                "call a friend"
            ],
            "content":"<div class=\"\"><div> <span>As I awoke, my head felt far better, and my vision cleared completely. The moments I had felt asleep were... heavenly. I tried to remember what had brought it on, when I had the misfortune of looking down. My shirt was a mess. Cookie crumbs and chip pieces were splattered across the bed, and across the upper half of my body. Said part was also covered in an oil sheen, a parting gift from the chips. I the confusion, my breasts had escaped the thin confines of my bra, which a quickly ( and pleasurably) stuffed back in among the cool stains of the coke. I looked down to see my full, stuffed belly and my thoroughly soiled jeans. No doubt about it, it would take awhile to unpack this night from my memories;. Just then, the phone rang. Thank god Jess had a phone in her room or it would have been a tough sell to get out of the bed. After I had brushed some crumbs off, I reached over to the bedside table and answered the call. \"Hello?' I tried to keep the sleep out of my voice. \"Hey sweetie, it's mom. You'll never guess where we and your brother are right now.!\" I froze. I knew I had to say somersetting that wouldn't arouse suspicions. \"no, where are you guys?\" \"Your brother got a call that he was accepted into Firerock academy! Not only is it an elite school in academics, but it is also a great school in video games and science. I'm a bit surprised you didn't notice your brother wasn't at the house. Is everything OK?\" \"Yes! Everything's fine! So when are you coming back? Well, your brother will be out here to acclimate to the school, and we'll be with him for as long as he needs to adjust. But we will call twice a day and will send someone to watch you in a few days. We're really sorry about not telling you. It happened so quickly. As always, eat anything you want, and you can use the emergency money in the broom closet if there's any trouble.\" The words seemed to fly past my head. I was, for the moment, completely alone. And it was an awesome feeling.\" OK, thanks... mom. I'll keep that in mind. Love you. Goodbye.\" \"Goodbye, sweetie!\" came the cherry response at the end of the phone. I set down the phone, and almost screamed with joy. No rules! No parents! I could do what I wanted! But first, I had to get out of these disgusting clothes. I took them off, admiring my stuffed body as I did so, and put on a loose shirt and some sweatpants. I tried on a bra, but I couldn't get the straps and I just went without for the convenience. As I mulled over my options, I could either put on a movie and get more food, or have a someone over for some fun in this body.</span></div></div>",
            "created":1475643600,
            "id":2219464,
            "title":"Parents call"
        },
        "112122":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "Pajama pants",
                "Pajama set"
            ],
            "content":"<div class=\"\"><div> <span>You started to go up to Jess room and search around her drawers to find something to change into and get out these pair of jeans and want to feel a little more comfortable. Do you change into a pair of pajama pants or a pajama set with a matching top and bottom...?</span></div></div>",
            "created":1475643600,
            "id":2219403,
            "title":"Do things your way"
        },
        "12":{
            "author_id":"nixon5",
            "author_name":"nixon5",
            "choices":[
                "No, we'll explain you everything what you've to know",
                "Ok, let's find somebody to swap Cassie with"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nTo see my usual male body from the eyes of my sister's best friend body and as a girl, is very strange but also exciting. My former male body is looking good in these flip-flops, jeans and the black tank top. I don't know before that my male body has such a nice biceps and my pecs and abs are so visibly in this outfit. The hard football practice is obviously profitable. <br>\r\n<br>\r\nBut in comparison to my former male body, my girly body is very different. I'm shorter than before, I've really tiny feet, my legs ar long and smoothy, there's nothing between my legs, my hips are wider, my ass is is more accented, I've a girly waist and a couple of breasts instead of my former male pecs and I've no biceps. In sum I feel really weaker than before. I'm Jess now!<br>\r\n<br>\r\nJess has obviously the same thoughts because she's inspecting her former girly body.<br>\r\n<br>\r\nShe breaks the silence: \"I think, you've to go to your new home because your new parents will be back soon and they'll be very disappointed if they see that you're not babysitting your new younger brother, <i>Jess</i>.\"<br>\r\n<br>\r\nCassie nodds agreeing: \"Yeah, you've to go. You remember where Jess' house is?\"<br>\r\n<br>\r\n\"Yeah, I know it but please come with me. I don't know how to act like Jess. I need your help to understand my new girly life, pleeeeeease!\"<br>\r\n<br>\r\nJess in my former male body and Cassie discuss some seconds. They are agree. I hear my former male voice asking:<br>\r\n<br>\r\n\"What do you like to know?\"<br>\r\n<br>\r\n\"Hmm, everything. I wasn't a girl yet. In the best case Cassie swaps with somebody too. Then she's able to help me. What do you think?\"</span></div></div>",
            "created":1337490000,
            "id":1340961,
            "title":"You all walk to Jess' house."
        },
        "122":{
            "choices":[
                "Cassie reluctantly agrees to become Jess' little brother.",
                "Cassie refuses and says they have to pick somebody else.",
                "Cassie thinks up a totally different, alternate plan."
            ],
            "content":"<div class=\"\"><div> <span>“You know, that's actually a pretty good point,” says Jess from inside my old body. “I mean, sure I love being a bigger, older, stronger guy now. But I don't exactly want you ruining my life accidentally. And right now, you don't know anything about how to be a girl, much less anything about the particular details of <u>my</u> life.”<br>\r\n<br>\r\n“See, that's what I'm saying,” you reply, trying not to be too distracted by Jess' new, hunky, muscular body. Whew! It seems the hormones in her – check that – in <u>your</u> body right now are on overdrive. Who knew the body of your sister's best friend had such a crush on you?<br>\r\n<br>\r\n“Wait a minute,” interrupts Cassie. “Don't I get a say in any of this? Sure, I'm happy to use my amulet to switch the two of you around, but I never said I wanted to get switched with somebody too.”<br>\r\n<br>\r\n“You have to Cassie,” says Jess. “Dan is going to need advice on how to be a girl and how to live my life. As my BFF, you're the logical choice. Besides, Dan and I already switched. If we can do it, so can you. Come on!”<br>\r\n<br>\r\n“Well,” says Cassie, clearly stalling. “Who's going to agree to switch with me? And who would be close enough to Dan to help guide him the next month in how to be Jess?”<br>\r\n<br>\r\n“Well,” you say back to Cassie. “The two of you just told me I was supposed to be home babysitting my younger brother right now …”<br>\r\n<br>\r\n“No!” says Cassie.<br>\r\n<br>\r\n“It's a great idea actually,” Jess says. “If you become my baby brother, you'll be at home all day long and able to help guide the new Jess in her life for the next month.”<br>\r\n<br>\r\n“I don't want to be your little brother!” Cassie says. <br>\r\n<br>\r\n“But it's perfect,” Jess continues. “While I'm Dan, I can help keep the new Cassie out of trouble. It just makes perfect sense for us both to switch with one another's siblings. Come on, Cassie. I became a guy, Dan became a girl, now it's your turn to become a boy.”</span></div></div>",
            "created":1357102800,
            "id":1500412,
            "title":"Who should Cassie swap with?"
        },
        "1221":{
            "author_id":"kaiensekai",
            "author_name":"Kaien",
            "choices":[
                "Continue with Cassie and Dan",
                "Jess finally catches Kyle",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Fine I'll switch with Kyle...\" Cassie moans. <br>\r\n<br>\r\nThe three of you get to Jess' House. \"Hi kids.\" Jess' Mom said to us smiling she was extremely beautiful you wish you could have swapped with her instead of Jess. <br>\r\n<br>\r\nJess nudges you.<br>\r\n<br>\r\n\"Hi Mom have you seen Kyle?\" you asked.<br>\r\n<br>\r\n\"I think he's playing in backyard why?\" Jess' Mom asked.<br>\r\n<br>\r\n\"We just need to talk to him for a bit.\" You said.<br>\r\n<br>\r\n\"Alright but no arguing ok?\" Mom said.<br>\r\n<br>\r\n\"Alright I won't.\" You said.<br>\r\n<br>\r\nAs the three of you walked to the backyard you were excited to see Cassie go through what you are but as a boy. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://studio193.typepad.com/photos/uncategorized/2008/02/12/4x6_4571.jpg\" target=\"_blank\">http://studio193.typepad.com/photos/unca...</a><br>\r\n<br>\r\nKyle was playing on swings. Jess knew that Kyle had a big crush on Cassie.<br>\r\n<br>\r\n\"Hi Kyle!\" Jess said.<br>\r\n\"Oh hi Dan!\" Kyle smiled.<br>\r\n\"Can you come over here please?\" You asked.<br>\r\n\"Alright.\" Kyle ran over to the three of you.<br>\r\n\"What is big sis?\" he asked.<br>\r\n\"I think it would be better if we talked in your room Jess.\" Cassie said thinking what might happen if they switch out in the open.<br>\r\nThe two of you agreed and went up to Jess' room.<br>\r\n<br>\r\n\"So is it?\" Kyle said impatiently.<br>\r\n\"Do you remember that necklace you saw me looking at yesterday?\" Jess asks.<br>\r\n\"Huh I saw Jess one not you!\" Kyle said.<br>\r\n\"You see Kyle that necklace actually switch bodies between two people as long as they agree.\" Jess says.<br>\r\nKyle eyes open wide. \"Wait that means that Jess your a boy now!\" Jess covers his mouth as he yells. <br>\r\n\"Yes Kyle I'm a boy.\" Jess said.<br>\r\n\"That's awesome I want to do it!\" He said excited.<br>\r\n\"That's actually why we came to Kyle we wondering if you would want to swap with Cassie?\" you smiled.<br>\r\nKyle eyes light up like fireworks.<br>\r\n\"Yeah I want to Cassie that would be awesome!\" he said.<br>\r\n<br>\r\nCassie moans and necklace glows putting Kyle's Soul in Cassie's body and Cassie's in Kyle's body. They both wake up.<br>\r\nKyle looks in Jess' full size mirror seeing it's true he's in Cassie's body since he felt like a giant compared to his old body<br>\r\n<a rel=\"nofollow\" href=\"http://babescene.com/babe/image/large/babescene.com_34ltye.jpg\" target=\"_blank\">http://babescene.com/babe/image/large/ba...</a><br>\r\nHe looked at Cassie long red hair, then the rest of his new body seeing two large boobs, in a gray t-shirt, a plead mini skirt, long grey and black stripped socks.<br>\r\n\"Oh my God it worked! This is awesome! I'm so much taller and so hot!\" Kyle said groping Cassie's boobs.<br>\r\nCassie's mouth was just stunned to see Kyle's reaction to having her body.<br>\r\n\"I'm sorry KYLE! But I'm never going to ever switch back!\" he said to Cassie and ran out the door in Cassie's body.<br>\r\n\"Get back here!\" Jess said chasing after Kyle.<br>\r\nYou smirked \"Hi there little brother.\"<br>\r\n\"Shut it Dan!\" she shouted.<br>\r\n\"Serves you right it's karma for you two did to me trapping me in Jess' body for a whole month.\" You smirked.</span></div></div>",
            "created":1365397200,
            "id":1567695,
            "title":"A bad idea..."
        },
        "1222":{
            "choices":[
                "Jess's mom- perfect to help Dan out",
                "Jess's dad-still can help Dan out and gets a view from the opposite gender",
                "Jess's younger brother"
            ],
            "content":"<div class=\"\"><div> <span>You all keep walking and thinking of somebody for Cassie to switch with. Many people are brought to mind. Your younger brothers, your parents, your grandparents; everyone. Cassie tries to think of the best person out of all of the choices given and she picks...</span></div></div>",
            "created":1385010000,
            "id":1697533,
            "title":"Cassie refuses and says they have to pick someb..."
        },
        "13":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Clothes shopping.",
                "Further discussion.",
                "Buying make-up.",
                "Getting some 'male' attention.",
                "'Girl talk'."
            ],
            "content":"<div class=\"\"><div> <span>\"Stop touching me!\" I shouted to Jess, noticing the distinct shrill sounding voice I now had. \"If you think whistling is bad...then groping is 10 times worse!\" I told her, slapping my former hands away from me. Jess just thought it was so funny.<br>\r\n<br>\r\n\"Oh but you look so cute in my body!\" she 'giggled', the girly laugh sounding 'gay' in my body.<br>\r\n<br>\r\n\"Might want to get yourself a new laugh there...DAN!\" I sneered.<br>\r\n<br>\r\nMy sister immediately looked at her friend (in my body) and frowned a little. \"He's right Jess, as much fun as you're having, I don't want people thinking my brother is gay. You've got to act more manly if you're going to stay in his body for a month\" she explained.<br>\r\n<br>\r\nAs they were having their little 'girl talk', I looked down at the unfamilar body I now inhabited., I had to admit it was cute. I ran my slender hands over my breasts and admired the shorts that made it quite obvious I now had nothing between my legs except 'girl parts'. I then wiggled my toes in Jess's flats and bent down to feel my smooth legs. I didn't notice that she and Cassie were watching me the whole time.<br>\r\n<br>\r\n\"You know what Cassie, I think he likes being a girl!\" Jess laughed in my voice, sounding a little more 'manly' this time.<br>\r\n<br>\r\n\"Up yours!\" I sighed in my female voice.<br>\r\n<br>\r\n\"Oooh, bad girl!\" Cassie grinned.<br>\r\n<br>\r\nJess then raised her arms, gesturing for us to keep quiet. \"Okay okay, time for window shopping!\" she smiled. \"And...I'll even act the part of the guy, pretending that I hate it and lagging behind you two!\" she laughed. \"And Dan...you've got to act like me now, and I simply...LOVE...window shopping\" she winked from my body.<br>\r\n<br>\r\n\"Great!\" I sighed again, as Cassie set off walking. I followed, and then Jess followed me, admiring her own ass from behind. To make me feel even more uncomfortable...she whistled at me and laughed. \"I can see why they whistle at us now\" she said.<br>\r\n</span></div></div>",
            "created":1333429200,
            "id":1308495,
            "title":"Go window shopping."
        },
        "131":{
            "author_id":"darkental",
            "author_name":"Dark123",
            "choices":[
                "Go for a swimsuit",
                "See lingenire"
            ],
            "content":"<div class=\"\"><div> <span>Cassie starts gossiping with Jess as I wonder what these 2 had in mind for me regarding clothing.<br>\r\n<br>\r\nA moment later they say. What do you want to buy? A swimsuit or lingerine?<br>\r\n<br>\r\nMy mind explodes at the idea. For one part both are things I would rather not wear but seeing them on this new body sounds great</span></div></div>",
            "created":1589560620,
            "id":2835967,
            "title":"Clothes shopping."
        },
        "133":{
            "author_id":"farthaha",
            "author_name":"farthaha",
            "choices":[
                "You decide to tell them that you are feeling sick and would like to go home.",
                "You continue to walk around the mall with them. "
            ],
            "content":"<div class=\"\"><div> <span>Following your sister, you enter a make-up store a few metres away from you. She is just browsing for a bit before Jess interrupts the peace once again.\"Oh my gosh! I know I'm supposed to be acting like the guy here but I can't help but think about how cute that pink nail polish would look on you right now!\", she exclaimed to you, again acting too much too girly for your liking.<br>\r\n<br>\r\n\"I agree! Come on 'Jess'! Just try it, there's a free sample right here.\", she says to you while moving to pick the sample up.\"I think she's just shy Cassie! Let's give her a little 'motivation'.\", says the real Jess trying to make you feel uncomfortable by calling you a 'she'.  You look at your nails, they may be long but you like the fact that they have no harsh colours on them. You made a firm stand but they eventually forced you to apply the nail varnish, giggling as you agreed to their terms. <br>\r\n<br>\r\nYou sat down on a nearby chair, they took your shoes off and you looked down feeling strange again that these tiny feet are yours. Cassie starts to apply the polish onto your toes as Jess stands idly by trying to act uninterested. You watch as each toe is painted a bright pink colour, once she is done with both feet she stands up, admires her handiwork and says,\"That colour really does suit you, girlfriend!\". You sigh and put your shoes back on not wanting to see them in their current state any longer.</span></div></div>",
            "created":1361854800,
            "id":1540063,
            "title":"Buying make-up."
        },
        "134":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Going shopping.",
                "Jess starts teasing.",
                "Heading home...to Jess's house."
            ],
            "content":"<div class=\"\"><div> <span>As I walked around with Cassie, I could feel lots of pairs of eyes on me, and they all belonged to boys the same age as myself, just younger...or just older. <i>\"Uncomfortable!\"</i> was the word that passed through my head. Then my own voice suddenly whispered into my ear as Jess crept up on me. \"You should see all the guys checking you out\" she laughed. \"I don't have to see them, I can feel them\" I sighed in her voice.<br>\r\n<br>\r\n\"Well get used to it, because you'll get that 24/7 when you're outdoors\" she laughed in her deep voice.<br>\r\n<br>\r\n\"Great!\" you grumbled, as you adjusted your bra strap. \"Why can't some of them check you out instead sis?\" I then said to Cassie, who just laughed at me. <br>\r\n<br>\r\n\"I guess I'm not as hot as you are!\" she answered.<br>\r\n<br>\r\n\"Okay hey...you want to hear something weird?\" Jess then chimed up against from my body. \"I still find guys attractive, and as soon as I checked out that cute guy over there...I got an instant boner\" she giggled.<br>\r\n<br>\r\n\"Eww, wrong!\" I grimaced in disgust.<br>\r\n<br>\r\nCassie just laughed and shrugged. \"Maybe its because you only just swapped. Give it a few days and your hormones will probably start to alter your perception of people. Meaning...JESS...you'll probably start fancying girls and women, and bro...as uncomfortable as it might sound...you'll find boys sexy!\" she winked and giggled.<br>\r\n<br>\r\n\"No way!\" I stated, gesturing with one of my manicured hands.<br>\r\n<br>\r\n\"See...that hand gesture was totally girly\" Cassie just laughed at me.<br>\r\n<br>\r\n\"Whatever!\" I grumbled, as I tried to ignore the leering boys that were all around me.<br>\r\n</span></div></div>",
            "created":1333602000,
            "id":1309700,
            "title":"Getting some 'male' attention."
        },
        "1342":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Heading into a nearby store.",
                "Going straight home...to Jess's house.",
                "A Week Later..."
            ],
            "content":"<div class=\"\"><div> <span>\"Go on Dan, just give a couple of boys a wink and a wiggle of that sexy ass of mine\" Jess began teasing me, as I tried ignoring her. \"You know they'll really appreciate a bit of attention from such a hot chick!\" she then winked. And my sister, Cassie, wasn't really helping me. She remained silent and actually found it quite amusing that Jess and I had swapped bodies and that she was enjoying it so much.<br>\r\n<br>\r\n\"I'm not doing anything you tell me to Jess!\" I snapped in anger at my sister's friend, who was currently in my older, male body.<br>\r\n<br>\r\n\"Well that's a shame, because I'm going to start flirting with some girls!\" Jess grinned.<br>\r\n<br>\r\nI just rolled my pretty new eyes and let out a deep sigh, not sure of how to converse with such a tormenting little bitch. \"Look, you can go find youself a girl if you want, even have sex with her, and I'm sure you'll enjoy it. But I'm just not read for that yet, I may have your body but I certainly don't have your attraction to boys\" I told her quietly, making sure that nobody who walked past heard me.<br>\r\n<br>\r\n\"Well, you'd better get used to liking boys, because I'm not swapping back with you until you've at least kissed one\" Jess informed me. \"And that Amulet thingie we used requires both people to agree to the swap unless I'm much mistaken\" she laughed in my deep voice. \"I have no intention of doing so yet!\" she said.<br>\r\n<br>\r\n\"You keep us swapped and I promise you...\" I began to threaten Jess, who simply stood there in my body looking quite imtimidating.<br>\r\n<br>\r\n\"Yeah...you'll promise me what...LITTLE GIRL?\" she cut me off.<br>\r\n<br>\r\nIt was at this moment that Cassie interjected. \"Come on Jess, give him a break\" she told Jess, who simple smiled and shrugged from my body. \"Not until he kisses a boy...and likes it!\" she replied bluntly. \"At least he's got plenty of time, we're staying swapped for a month at least\" she then laughed.<br>\r\n<br>\r\nI just sighed and walked away from them both.<br>\r\n</span></div></div>",
            "created":1333947600,
            "id":1312153,
            "title":"Jess starts teasing."
        },
        "13421":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Trying on some dresses.",
                "Bolting from the store."
            ],
            "content":"<div class=\"\"><div> <span>I managed to slip away from Cassie and Jess and duck into a girl's clothing store. I watched them walking past and stayed out of sight, it was infuriating to see Jess still laughing in my older, male body. \"Little bitch!\" I grumbled in my feminine voice. I then just leaned against a wall and let out a deep sigh, while looking down at the body I would calling my own for at least the next 30 days. I knew I would have to adjust, but the term \"having to man up a little\" didn't seem fitting somehow. I was running my hands along my ponytailed hair when I suddenly heard a woman's voice to the left of where I was stood.<br>\r\n<br>\r\n\"Need any help there sweetie?\" a female store employee, in her mid 30's asked me.<br>\r\n<br>\r\n\"Er...no, I'm fine...thanks\" I answered nervously.<br>\r\n<br>\r\nThe woman smiled and introduced herself. \"Well, I'm Carol, I work here\" she said. \"Incase you're interested we do have some delightful new dresses just arrived, they're for girls like yourself, ages 10 - 15. I'm sure you would love a nice dress so you can impress the boys right?\" she chirped.<br>\r\n<br>\r\n\"Um...that's not the first thing on my to-do list actually\" I frowned at her.<br>\r\n<br>\r\n\"Well, how about you just try a couple on honey? I just know you'll look so pretty in one of them in particular\" the woman persisted.<br>\r\n<br>\r\nPeering out of the shop door, I saw Cassie and Jess stood not far away still looking for me, so I didn't want to venture back out of the store just yet. But I didn't want this silly store employee yammering on at me either. I just looked at the woman...and sighed again.<br>\r\n<br>\r\n\"Is that a yes?\" she smiled, clasping her hands together.<br>\r\n</span></div></div>",
            "created":1334120400,
            "id":1313285,
            "title":"Heading into a nearby store."
        },
        "134211":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Jess just won't relent.",
                "Cassie buys the pink dress and heels."
            ],
            "content":"<div class=\"\"><div> <span>\"Fine, I'll try on some dresses lady!\" I sighed, and then I followed mumbling to myself. <i>\"If it will get you off my back\"</i> I thought. I shadowed the woman to the changing rooms and then waited as she collected from dresses from the racks nearby, a shoulder-strap blue dress, an off-the-shoulder black dress, a halter-strap red dress and a short, low-cut pink top. And to my horror she also had a pair of black patent pumps in her hands, with 3-inch heels.<br>\r\n<br>\r\n\"There you go honey, have fun!\" Carol said, piling the dresses in my arms and putting the pumps on top. \"Those shoes will go with any dress\" she then winked at me, and I just feigned a smile in return. \"Great...thanks!\" I mumbled.<br>\r\n<br>\r\nI then took another glance towards the store entrance before disappearing into the changing room. Whereas it would have taken any other girl no time at all to get changed, I was mesmerized by the female body I was now in. I inspected my perky boobs as I undressed, but I kept my panties on, not wanting to go too far, remembering how old Jess's body was. I then slipped into the blue dress and sighed before slipping my feet into the high heels that Carol had so kindly provided. \"How do they walk in these things all the time?\" I grumbled, struggling to maintain my balance.<br>\r\n<br>\r\nUpon exiting the changing room, Carol, the store employee was all smiles. \"Oh honey, that looks gorgeous on you, you're so pretty!\" she gushed, making me blush. I then went back into the changing room and tried on the black and the red dresses, and modeled those for her too. Then once I was wearing the form-fitting pink dress, I exited the changing room a fourth time and stopped dead in my tracks. Jess and Cassie were standing beside Carol, grinning at me.<br>\r\n<br>\r\n\"Oh now don't you look adorable!\" Jess teased from my body.<br>\r\n<br>\r\n\"That dress is so you!\" my sister then giggled.<br>\r\n<br>\r\n<i>\"Shit!\"</i> I thought, closing my eyes for a moment. This day just kept getting better.<br>\r\n</span></div></div>",
            "created":1334293200,
            "id":1314901,
            "title":"Trying on some dresses."
        },
        "1342111":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Ignoring them.",
                "Heading home...to my new home."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, are you two friends of this young lady?\" Carol asked Jess and Cassie, and the former quickly turned to respond. \"Oy yes, very much so, GOOD...friends\" Jess said, as she glanced across at me, a grin painted on my old face. \"You know, I don't know why you don't wear heels like that all the time \"Jess\", they do wonder for your legs!\" she teased as she walked around me, tugging at the pink dress I wore and looking down at my feet.<br>\r\n<br>\r\n\"Well...I've never been in a position to wear dresses before now have I...DAN!\" I responded with a scowl.<br>\r\n<br>\r\n\"But you are now!\" Jess winked at me. \"I think...that we should buy that dress for you, and those heels too, what do ya say Cassie?\" she then asked my sister, who seemed to be as amused by the whole situation as Jess was, almost.<br>\r\n<br>\r\n\"Oh now isn't that thoughtful?\" Carol smiled at me warmly.<br>\r\n<br>\r\n\"Uh...yeah, isn't it?\" I replied, forcing a laugh. Then I rolled my eyes in annoyance when she wasn't looking.<br>\r\n<br>\r\nBefore I knew what had happened, Jess (using my money) had bought me the dress, and my sister had bought me the heels. \"Gee...thanks!\" I muttered sarcastically. I then went back into the changing room to grab the other dresses and to get changed. I should have known better.<br>\r\n<br>\r\n\"Oh...Jess,\" Cassie suddenly called out to me, causing me to sigh, \"I think you should keep that outfit on\" she giggled.<br>\r\n<br>\r\n\"Oh I agree, the boys will be falling over themselves to ask you out\" Jess then weighed in.<br>\r\n<br>\r\nCarol, not knowing the true situation, just looked at me. \"I do think you'll get quite a few admiring stares in that dress honey\" she winked at me. \"Even the other girls will probably be jealous of you\" she added with a wink.<br>\r\n<br>\r\n\"That's what I'm afraid of\" I mumbled to myself. \"Thank you for your help\" I told Carol, trying to sound happy, as I handed the other dresses back to her. \"Oh no problem honey, I'm here to help people\" she replied, patting me on the shoulder before walking away. \"Have a nice day now!\" was the last thing she said. That left me standing there, feeling very 'exposed' in my new pink dress and glossy black heels, with Cassie and Jess standing there grinning like two Cheshire cats.<br>\r\n</span></div></div>",
            "created":1334552400,
            "id":1316626,
            "title":"Jess just won't relent."
        },
        "13421111":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Leaving the mall.",
                "Hiding in another store."
            ],
            "content":"<div class=\"\"><div> <span>\"Whatever!\" I grumbled at them both, as I rolled my eyes and walked past, still trying to get used to walking the heels that were now on my feet. Once out of the store I just set off going in a random direction, followed by my sister and Jess (who were now technically siblings) whispering and giggling behind me. On top of that, every boy between the ages of 13 and 18 were giving me admiring stares and leers, I actually felt like a piece of meat at that point.<br>\r\n<br>\r\n\"Don't try to walk too fast 'Jess', you might twist your ankle\" my own voice called out to me, causing me to turn and scowl at Jess. \"Oh now don't give me the 'bad girl' look, I know it too well and it won't work on me\" she told me.<br>\r\n<br>\r\n\"Okay, what'll it take to get me out of your body and back into mine?\" I asked her bluntly, looking up into my own face.<br>\r\n<br>\r\nJess give me one of my own, smarmiest smiles in response. \"I told you, we're not swapping back until you've kissed a boy...and liked it. And I'm not going to swap us back anyway yet even if you do kiss a boy\" she explained, as she reveled in the power she was holding over me.<br>\r\n<br>\r\n\"Then why should I do it?\" I grumbled, resting my hands on my hips.<br>\r\n<br>\r\n\"You don't have to\" Jess shrugged from inside my older, male body, grinning again. \"But just imagine spending the rest of your life in my body. Would you like that...girly girl?\" she tormented me further, causing me to get more angry by the second. \"Aww...is the little girl gonna cry?\" Jess then laughed, as she feigned a pout at me. That was about as much as I was prepared to take off her. And I did what any other 'girl' would have done at that moment.<br>\r\n<br>\r\nWith my new dress allowing freedom of movement, I quickly lifted up my left leg...and my knee connected firmly with my former crotch, causing Jess to double over in agony and drop to the floor. \"Still like being a guy?\" I then asked her, before turning around and walking off, my heels clicking on the floor as I went.<br>\r\n<br>\r\nCassie stayed behind to help Jess, not quite believing what I had just done.<br>\r\n<br>\r\nI knew that my actions would no doubt have consequences once Jess had recovered. But it felt worth it.<br>\r\n</span></div></div>",
            "created":1334984400,
            "id":1320070,
            "title":"Ignoring them."
        },
        "134211111":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Into the house.",
                "Heading somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>I decided to head out of the mall as fast as possible, leaving Jess and Cassie behind. Shaking my head, I heard the clicking of my heels on the ground as I walked, reminding me of the situation in which I found myself. I was heading for the bus stop, already trying to think up an apology for Jess when suddenly I was distracted by a car horn behind me. I looked to my left as a little blue car pulled up beside me. I immediately recognized the car as belonging to Jess's mother, Cassandra.<br>\r\n<br>\r\n\"Oh shit!\" I muttered under my breath, before walking over to the car.<br>\r\n<br>\r\n\"Honey! I thought you were spending the day with Cassie\" she said to me, after winding down the car window.<br>\r\n<br>\r\n\"Um...yeah,\" I answered nervously. \"I was with Cassie, we did some...er...shopping\" I continued, gesturing down to my new dress and shoes. But Dan was there too and was being a jerk, making trouble, so I left\" I said, referring to Jess in my body.<br>\r\n<br>\r\nCassandra just sighed. \"Well, what can you expect from a boy sweetheart? They ARE trouble! And I really do love the dress\" she then said, smiling broadly. One of her eyebrows then arched as I just stood there. \"Well, you getting in or not?\" Cassandra eventually asked, gesturing inside the car.<br>\r\n<br>\r\n\"Um...sure!\" I replied nervously.<br>\r\n<br>\r\nI then looked back in the direction of the mall and saw Cassie and an angry Jess just exiting the building. \"Uh oh!\" I exclaimed, before scurrying around to the passenger side door of the car and clambering inside. \"Hit the gas Mrs...er...mom!\" I then said, correcting myself as I quickly put on my seatbelt.<br>\r\n<br>\r\nMy new mom just laughed a little, then checked the traffic before slowly driving away, relieving me no end. I glanced into the rearview mirror and saw my sister and former body standing there side by side, and I just knew I had only postponed another encounter with them. The journey home to Jess's house was fairly swift, and Cassandra kept asking me things that only Jess would have known. I just had to make some stuff up and hope she didn't pick me up on it.<br>\r\n<br>\r\n\"Here we are honey, home sweet home!\" Cassandra chirped, as she pulled into the driveway.<br>\r\n<br>\r\n\"Great!\" I nodded, letting out a barely audible sigh.<br>\r\n</span></div></div>",
            "created":1336626000,
            "id":1333689,
            "title":"Leaving the mall."
        },
        "1342111111":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Settling in.",
                "Trouble is near."
            ],
            "content":"<div class=\"\"><div> <span>I did think of fleeing some place else, since this was obviously where Jess and Cassie would be headed to find me, but I for the life of me couldn't think of anywhere to go, or think of an excuse to give to Cassandra. Instead I just let out a sigh and stepped out of the car, slamming the door shut behind me. I took another look down at myself and ran my feminine hands over my perky boobs before walking into the house, the heels of my pumps clicking on the driveway as I went.<br>\r\n<br>\r\n\"I really do love that dress sweetheart, it looks perfect on you!\" Cassandra again complimented me, causing me to blush a little.<br>\r\n<br>\r\n\"Er...yeah, thanks...mom!\" I responded nervously.<br>\r\n<br>\r\nShe then unlocked the front door and held it open for me to enter the house. I smiled at her as I walked past, and then I took a look around at what would now be my home for goodness knows how long. \"I'll be up in my room mom\" I mumbled to Cassandra, as I headed for the stairs.<br>\r\n<br>\r\n\"Okay sweetie, I'll be fixing us something to eat\" Cassandra responded, heading to the kitchen after hanging up her jacket.<br>\r\n<br>\r\n\"Alright!\" I said, and then I disappeared upstairs to Jess's bedroom...which was now my own.<br>\r\n<br>\r\nOnce inside, Iooked around, and the first thing that hit me was how a girl who obviously enjoyed being a boy so much...could have such a 'girly' room. It was mostly decorated in pink, and several posters of boy bands decorated the walls. Even the lamp shades had frills on them. \"Oh jeez!\" I sighed in my feminine voice, standing there with my hands on my hips. I then wandered over to the window to have a look outside.<br>\r\n</span></div></div>",
            "created":1337058000,
            "id":1338229,
            "title":"Into the house."
        },
        "13421111111":{
            "author_id":"nixon5",
            "author_name":"nixon5",
            "choices":[
                "test the bikini on your new body",
                "read Jess' diary and find out some of her deepest secrets"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nOk, this room is really strange in my eyes as an original boy but as a girl it seems to be a normal girly room. Let's find out something about my new room, my new body and my new identity as Jess.<br>\r\n<br>\r\nJess is a very properly person. There's no mess in her room as in my former room. She must be a big fan of John Grisham because there are all of his novels on her bookcase. <br>\r\n<br>\r\nFurthermore she likes One Tree Hill as my sister Cassie. Jess has every dvd box of this series and I recognize that there are also posters of one of the actors of One Tree Hill in Jess' room. In opposite to my sister who loves Chad Michael Murray as Lucas Scott, Jess has obviously a crush on James Lafferty as Nathan Scott. Ok, he's not looking bad shirtless on these posters. <br>\r\n<br>\r\nIn my new wandrobe I find a lot of different outfits. As a boy i love my sneakers, sport socks, jeans, t-shirts and caps but in this wandrobe are a lot of different stuff: flip-flops, high heels, sneakers, tight jeans, mini-skirts, girly tops and more. I've no ideas how to combine these things as a girl. <br>\r\n<br>\r\nBut there are finally two fascinating things in my new room:<br>\r\n<br>\r\n- a bikini, as a boy I'm habituated to wear some swimming trunks<br>\r\n<br>\r\nand<br>\r\n<br>\r\n- Jess' diary<br>\r\n</span></div></div>",
            "created":1337144400,
            "id":1338552,
            "title":"Settling in."
        },
        "134211111111":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "...a pebble hit the window.",
                "...'my' phone started ringing."
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, I always wondered what it would be like to wear one of these things\" I mumbled to myself, holding the two skimpy pieces of Jess' bikini in my dainty hands. \"And now I have the body for it\" I smirked, feeling good about my current situation for the first time. The thought of a pissed-off Jess in my body with a bruised groin disappeared from my head as I slipped out of the pink dress and inspected my new, 13-year old body for a while before putting on the bikini.<br>\r\n<br>\r\nSince it was a black &amp; white, my black patent pumps went well with it, and so I kept them on, despite my difficulty walking in them. \"Hey...not bad!\" I muttered, as I admired Jess' reflection in the mirror. I grabbed hold of my ample butt cheeks and gave them a squeeze.<br>\r\n<br>\r\nSuddenly I spun around as the bedroom door opened, and Cassandra was stood there with a puzzled look on her face, and holding a drink of hot chocolate in her hands. \"Um...why are you wearing a bikini in the house honey? And here's your hot chocolate\" she smiled.<br>\r\n<br>\r\n\"Oh...hi...mom, I was just, you know...seeing if it still fit\" I replied.<br>\r\n<br>\r\n\"Of course it fits, you're just like your mother sweetie, good genetics\" Cassandra winked, as she admired her 'daughter'.<br>\r\n<br>\r\n\"I'll let you know when the meal is ready okay sweetheart, just make sure you don't wear that bikini at the table\" Cassandra then joked.<br>\r\n<br>\r\n\"Gotcha mom!\" I nodded, rolling my eyes and smiling back.<br>\r\n<br>\r\nOnce she was out of the room, I turned my attention back to the pretty reflection in the mirror. Spinning quite expertly on my heels, I inspected every part of the body I would be calling mine probably for the forseeable future. And suddenly...that fact didn't seem too horrible. Reluctantly, I stripped out of the bikini, felt myself up a little more, and then got dressed in one of Jess' white tank tops and a short black skirt. <a rel=\"nofollow\" href=\"http://babescene.com/babe/pjg3iz/\" target=\"_blank\">http://babescene.com/babe/pjg3iz/</a><br>\r\n<br>\r\nI grabbed my hot chocolate and then just as I was about to head downstairs...</span></div></div>",
            "created":1337576400,
            "id":1341700,
            "title":"test the bikini on your new body"
        },
        "1342111111112":{
            "author_id":"nixon5",
            "author_name":"nixon5",
            "choices":[
                "Cassie is coming to your new home",
                "go to your former home"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nSuddenly I hear a cellphone ringing. It's the sound of Justin Bieber's song \"Baby\". <i>OMG who's crazy enough to install Justin Bieber as his ringtone?! </i> After a few seconds I become clear that this is Jess' cellphone and it's not unusual that a girl has chosen a Justin Bieber song as her ringtone. In fact it's now \"my\" cellphone and \"my\" ringtone.<br>\r\n<br>\r\nCassie is calling:<br>\r\n<br>\r\n\"Hey big bro, how are you doing in your new body?\"<br>\r\n<br>\r\nI think my little sister has a bad conscience: \"Everything is new for me and sometimes it's a little bit crazy to accept being a girl but sometimes it's also really cool. How are you?\"<br>\r\n<br>\r\n\"You're so right, it's very strange to know that my big brother is actually in the body of my best friend and vice versa. Jess is really happy in your former male body but it's not the same feeling with her as a boy.\"<br>\r\n<br>\r\n\"Ok but I'm wondering how are you?\"<br>\r\n<br>\r\n\"Honestly, I'm a little bit jealous, big bro. This body swap was Jess' greatest wish. And both of you are able to accept the new situation. So, I wish to swap with somebody else too.\"<br>\r\n<br>\r\n\"Ok, let's talk. Do you want to come along or should I come <i>home</i>?\" </span></div></div>",
            "created":1337576400,
            "id":1341729,
            "title":"...'my' phone started ringing."
        },
        "13421111111121":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "She arrives and wants to swap with you!",
                "She arrives and wants to teach you how to be more like Jess."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I'm coming over there. I have some special plans.\" Cassie responded.<br>\r\n<br>\r\nI hung up.</span></div></span></div>",
            "created":1338008400,
            "id":1345387,
            "title":"Cassie is coming to your new home"
        },
        "134211111111211":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "She wakes up.",
                "She doesn't!"
            ],
            "content":"<div class=\"\"><div> <span>Cassie: Ok, 'Jess', I've always wanted to be you. You're so much prettier than me.<br>\r\nMe: Don't you want to talk to the real Jess about that, Cassie?<br>\r\nCassie: No. You're as Jess as it gets, and I want your body.<br>\r\nMe: But it's not mine...<br>\r\nCassie: Prove it.<br>\r\n<br>\r\nI looked down at my body as hair fell in front of my eyes, obscuring the view. I looked back up at Cassie. What was she saying? Cassie was even better looking than Jess.<br>\r\n<br>\r\nMe: Ok Cassie. Let's do this!<br>\r\n<br>\r\nI gave my sister (best friend?) a hug. She lifted up her amulet again, and just as before, everything faded into white.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://babescene.com/babe/image/large/babescene.com_34ltye.jpg\" target=\"_blank\">http://babescene.com/babe/image/large/ba...</a><br>\r\n<br>\r\nI woke up first this time and walked up to Jess' mirror. I was definitely Cassie.<br>\r\nHer long red hair amazed me, as it was now growing from my own head. I didn't get the red hair gene. Cassie's breasts were bigger and more developed than Jess'. They looked like they were aching to be held, as they could barely contain themselves in the tight grey t-shirt I was wearing. How could a thirteen-year-old look -and feel- this old?<br>\r\n<br>\r\nI turned my attention to my sister who was lying in a heap on the floor in Jess' body. Brushing my hair back behind my ears, I knelt down beside her and rubbed her back, trying to wake her.<br>\r\n<br>\r\nMe (in a whisper): ...'Jess'? um...Cassie! Wake up.</span></div></div>",
            "created":1338267600,
            "id":1347453,
            "title":"She arrives and wants to swap with you!"
        },
        "1342111111112111":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Dinner with 'Jess' and Cassandra.",
                "Heading outside together."
            ],
            "content":"<div class=\"\"><div> <span>\"Cassie!\" I said again, gently slapping 'Jess'' face. And eventually, my sister started to stir. She took a few moments to open her eyes, and when she did...they went wide in shock and complete delight. She was looked up into her own face...now my face. \"OMG!! It worked!!\" she screeched in Jess' voice, sitting up. She then started massaging her smaller breasts and her new body. \"Finally...its all mine!\" she then giggled.<br>\r\n<br>\r\nFrankly, I couldn't understand why Cassie would give up her own, sexier body in exchange for Jess' body. But I liked to see my sister happy. \"So big bro...I bet you like having my body huh? Those bigger, perky boobs and all?\" she winked at me.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://goo.gl/5qosR\" target=\"_blank\">http://goo.gl/5qosR</a><br>\r\n<br>\r\n\"Um...actually...yes I do!\" I admitted.<br>\r\n<br>\r\n\"See, I knew you would, and this way we're all happy. Jess loves being in your body, I love being in hers and you like having mine\" she rattled on, as she then got to her feet, still roaming her hands over her new curves.<br>\r\n<br>\r\nI hesitantly touched my new breasts in front of their former owner, only for her to giggle at me. \"No need to be shy in front of me bro, they're your boobs now!\" she again winked, making me feel more at ease.</span></div></div>",
            "created":1338267600,
            "id":1347508,
            "title":"She wakes up."
        },
        "13421111111121112":{
            "choices":[
                "Jess tricks Cassie into swapping with her, making you and your sister each other",
                "Cassie refuses and Jess is stuck as you (Dan)"
            ],
            "content":"<div class=\"\"><div> <span>You and your \"best friend\" Cassie (in Jess's body) walk outside, giggling femininely together as your hips rock side to side with each step. Outside of your temporarily new house up until 5 minutes ago, you and Cassie come across a boy down the street who is acting kind of girly. Getting closer you become aware of who he is and become startled. It's your old body Dan, who is actually your former sister's best friend Jess. She shouts at your sister in her body, unaware \"Hey! Douche bag! You ever kick me between the legs again and I'll...!! Well, it doesn't matter! The boyishness wore off for some reason.\" You said \"huh?\" in your sister's voice. \"Dan\" looks at you and says \"Remember? I took a birth control pill by mistake and now I don't feel 'right' anymore?\" You replied \"uh, yeah.\" Your sister in Jess's body giggled a little bit, while you adjusted your bra strap. The new Dan looks kind of awkwardly at this and says \"something's up here, isn't it? Anyway, Dan I hate being a boy now! So we can swap back if you want to so badly. I don't give a crap if you kiss a boy or not\"<br>\r\nJess's body busted out laughing and said \"I'm not Dan anymore. Me and Dan swapped bodies!\" Jess then said \"So who're you?\" You then got her attention and pointed at yourself. \"Oh my God!\" She screeched in your male voice. \"You guys are brother and sister! Well.. sister and best friend at least! Isn't this like incest or something?\" You replied \"No, it's more like what you guys said before. This is now my body, so it shouldn't be like that at all.\" Your sister as Jess nodded her head in agreement. <br>\r\n<br>\r\nJess, as you, then said \"Well Dan, do you want to swap back now? I'll be Cassie and you can be yourself.\" You said \"Uh... I guess.\" You are reluctant so you think about it really hard because now that you're in Cassie's body, you really love being her. She's beautiful, and just being her feels sexy. You feel confident, and admittingly, being feminine seems to agree with you.<br>\r\n<br>\r\nCassie held the amulet out to you guys and said \"Here it goes!\" There was no white flash at all. Cassie asked \"Did it work?\" Jess replied \"NO! Why didn't it work?\" You then said \"Maybe it's because I... eh... didn't want to switch back?\" Jess stomped the ground and snarled \"Typical! I actually want to be a girl again and nobody will let me!\"<br>\r\nShe then looked at her former body and said \"'Jess' aren't you curious of what it's like to be your brother?\" </span></div></div>",
            "created":1338267600,
            "id":1348153,
            "title":"Dan is Cassie, Cassie is Jess, and Jess is Dan"
        },
        "134211111111211121":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "A conversation",
                "At home"
            ],
            "content":"<div class=\"\"><div> <span>Before I could blink, there was yet another blinding flash of light. I looked down at my current body -still Cassie! I then looked back up at my old body. \"Um... Jess?\"<br>\r\n<i>He</i> laughed. \"No, 'Cassie', little sister dear, it's me ..also Cassie\" She was grinning from ear to ear. I don't think I've ever seen her so happy in my life! \"Come, let's go home, Cassie. We have some important things to do!\" Jess, back in her own body, gave my sister a mischievous look as Cassie pulled me in the direction of our house.<br>\r\n<a rel=\"nofollow\" href=\"http://www.flickr.com/photos/che-burashka/3808147242/sizes/l/in/photostream/\" target=\"_blank\">http://www.flickr.com/photos/che-burashk...</a><br>\r\n\"Cassie! What are you doing?\" I whispered aggressively.<br>\r\n\"Call me Dan now, Cassie. This is gonna be so fun!\"<br>\r\n\"We have to go ba--\"<br>\r\n'Dan' grabbed my breasts and slid his fingers down into my bra, softly rubbing my hardening nipples. \"Ohmygod....\" I was speechless.<br>\r\n\"Have you changed your mind, Cassie?\" <a rel=\"nofollow\" href=\"http://gifsoup.com/view/644470/sarah-shahi-boobie-touch-o.gif\" target=\"_blank\">http://gifsoup.com/view/644470/sarah-sha...</a><br>\r\nI let out a nervous laugh. \"Wow...\"<br>\r\n\"Embrace the new you, <i>sister</i>.\"</span></div></div>",
            "created":1359262800,
            "id":1518416,
            "title":"Jess tricks Cassie into swapping with her, maki..."
        },
        "134211111111211122":{
            "author_id":"junkyjones",
            "author_name":"JunkyJones",
            "choices":[
                "You pull away. This is too weird.",
                "Sarah takes things further."
            ],
            "content":"<div class=\"\"><div> <span>Cassie considers \"Dan's\" plea, but as she runs her hands over her smooth skin, and through her soft hair, and down her curves. She knows she wants to be this way forever. And on top of that, Cassie has never had an interest in being a boy, much less her own brother. She would never give up her new body.<br>\r\n<br>\r\nJess could see Cassie's decision on what used to be her face.<br>\r\nShe begins looks around desperately, in a very non-masculine panic. <br>\r\n\"I can't be trapped as a boy! This isn't fair!\" Jess says pouting.<br>\r\n<br>\r\nMeanwhile, you had been completely absorbed in your inspection of \"your\" body. You had never been very confident as a male. You had decent looks, but now, you knew you looked great. You just feel so sexy. You realized your thoughts would now be considered narcissistic. Giggling happily to yourself, you noticed your friend from school, Sarah, walking down the road. Sarah was just another girl, she had always been kind to you. She wasn't stunning, but certainly more developed than Jess.<br>\r\n<br>\r\nSuddenly \"Dan\" grabs the amulet and runs head on into Sarah.<br>\r\nThere is a familiar flash.<br>\r\n<br>\r\nYou feel disoriented but as you come to you, a glimpse of your bust reveals you are still in Cassie's body and a quick confirmation with \"Jess\" reveals she is still in her body.<br>\r\nSarah's body begins to giggle and move excitedly as she runs her fingers over her long legs and bountiful breasts while \"Dan\" looks very confused.<br>\r\nYou explain to 'Dan', \"The amulet switched your bodies, you're now me, I mean Dan\"<br>\r\nSarah: So, I'm Dan? And you were Dan?<br>\r\nYou: Yeah Sarah. I know this is all very strange...<br>\r\nSarah looked strangely excited.<br>\r\n'He\" then says, \"You are your sister? And I'm you. Interesting...\"<br>\r\n<br>\r\nExcitedly, Jess proclaims, \"I'm getting out of here before i wind up as a boy again. I'm keeping this body. Now I'm older AND a girl.\" she says hugging herself. I realized only moments later that she had taken the amulet with her!<br>\r\n<br>\r\nThen Jess's mother calls out for Jess to come home for dinner. <br>\r\nCassie looks at you for approval to leave.<br>\r\nYou give her an understanding nod as she hurries to her new home.<br>\r\n<br>\r\nOnly you and your \"brother\" are left.<br>\r\nSarah looks at you strangely and grabs your hand pulling you to a bench.<br>\r\nYou try to ask what she's up to but she won't say anything.<br>\r\nShe sits you down and plops down close to you.<br>\r\nThen, your \"brother\" rests his hand on your upper thigh.<br>\r\nYou try to pull away but she holds you in place as she moves her hand slowly up your skirt.<br>\r\nYou feel a warmth emanating from your vagina and a tingle throughout your body.<br>\r\n</span></div></div>",
            "created":1338872400,
            "id":1353375,
            "title":"Cassie refuses and Jess is stuck as you (Dan)"
        },
        "134211111112":{
            "author_id":"fs123",
            "author_name":"fred",
            "choices":[
                "Jess and Cassie planned the swap; it's permanent",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You read the diary and discover...</span></div></span></div>",
            "created":1337144400,
            "id":1338583,
            "title":"What's in the diary?"
        },
        "1342111111121":{
            "author_id":"nixon5",
            "author_name":"nixon5",
            "choices":[
                "Jess' little brother Luke",
                "Cassie"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nJess' diary is hidden under her bed which is twice as big than my former bed in my former male room. <i>That's not fair!</i><br>\r\n<br>\r\nFortunately it's not closed with a special lock. Despite Jess has a little brother, named Luke, she has obviously no fear that her secrets will be discovered. But wait a moment: Why Jess has swapped with me and not with her little brother if her wish to be a boy is the only reason for our swap?! Indeed I'm not the smartest student but this question seems to be so clear that I've to find immediately an answer and I suppose to find this answer in Jess' diary. Moreover I'm Jess now, therefore it's my diary!<br>\r\n<br>\r\nI sit on the ground as I like it normally in my male body and start reading Jess' cursive handwriting:<br>\r\n<br>\r\n<i>Dear Diary</i><br>\r\n<br>\r\n<i>Today I was in school and failed a test in science. It's very difficult to focus when I've always my big crush in front of me everywhere I go. I don't tell my parents about my bad mark because in this case I've to find a good explanation for this and I don't want to say: \"Take it easy, mom and dad, I've a crush on one of my friends and therefore I've some problems to concentrate in school.\"</i><br>\r\n<br>\r\n<i>Then I was as usual in cheerleading practice. Ok I'm a good swimmer and I love to swim but you know that I joined the cheerleading team to be near of my crush. It was much easier if he was a swimmer but he's a football player. So, I've to be a cheerleader to see him every day.</i> <br>\r\n<br>\r\n<i>At the end of practice I've reflected if I should adress him for the first time and as him for a date but as I found my decision and enough courage to do it, he was already gone with his best friend to the locker room. </i><br>\r\n<br>\r\n<i>I've consulted Cassie to find a solution and she told me about a strange amulet which some strange guy has given her. This thing should be able to swap two persons bodies. Should I really swap bodies with my crush? Maybe he'll read my diary and know everything about my feelings or should I swap bodies with his best friend to tell him that \"Jess\" has a crush on him and see his reaction? </i><br>\r\n<br>\r\n<br>\r\nI've to read this chapture in Jess' diary twice and I'm really shocked. She swapped with me but I've to find out if the reason is that I'm her secret crush or my best friend Nate is her secret crush and she needs my body to talk with him. I've to ask somebody...<br>\r\n<br>\r\n</span></div></div>",
            "created":1337230800,
            "id":1339276,
            "title":"Jess and Cassie planned the swap"
        },
        "13421111111212":{
            "author_id":"petergriffi923",
            "author_name":"Petergriffin923",
            "choices":[
                "Ask Cassie who Jess has a crush on",
                "Avoid asking the question till later"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Call Cassie and invite her over</span></div></span></div>",
            "created":1391662800,
            "id":1740296,
            "title":"Cassie"
        },
        "13421111112":{
            "author_id":"nixon5",
            "author_name":"nixon5",
            "choices":[
                "Nate has a crush on Jess",
                "Nate is Jess' secret boyfriend"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nIn a first moment I don't recognize people on the street. They are all strangers for me. I know from my sister that Jess is sometimes babysitting her neighbours son, a 8-years-old boy, who likes to become a football qauterback. His name is Josh.<br>\r\n<br>\r\nI remember that once Jess came along with Josh to a football game of my team. I really like to play football because I love sports but above all I enjoy to spend time with my best friend Nate, who's the quaterback of our team. So it's cool to connect two of the most important things in my life: doing some sports and spend time with my best friend. <br>\r\n<br>\r\nBut now, everything is turned around. I'm in Jess' body. I'm a girl and if I'd tell something to Nate, he won't believe my story. Ok, I've to admit, that the story of my body swap sounds really weird, also in my ears. <br>\r\n<br>\r\nDuring I'm thinking about my situation, a shock flash my girly body because I recognize suddenly a person on the street: Nate! He's walking in to the direction of my new home!<br>\r\n<br>\r\nWhat's the reason of his visit?<br>\r\n<br>\r\n</span></div></div>",
            "created":1337144400,
            "id":1338549,
            "title":"Trouble is near."
        },
        "134211112":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "She offers a way out.",
                "Browsing the shop."
            ],
            "content":"<div class=\"\"><div> <span>As I rushed through the mall, as fast as my new, shorter legs and my precarious heels would allow, I saw another, small shop and I ducked inside. <i>\"Ooh she's going to be mad!\"</i> I thought to myself, picturing Jess in my body doubled up in agony. I then looked around at the shop I was now inside. It wasn't overly huge, but just big enough, and cluttered enough that I couldn't be seen from outside the shop. I soon realized that it was a shop that sold antiques and trinkets of all kinds.<br>\r\n<br>\r\nAs I was walking around, a voice behind me suddenly caused me to 'squeal'. \"Damn...you scared me!\" I said to the middle-aged woman of dark complexion who obviously owned the quaint little shop.<br>\r\n<br>\r\n\"I'm sorry young lady!\" the woman smiled warmly, her voice tinged with a strong Romanian accent. \"Or should I say...young man?\" she grinned, causing my jaw to fall open in shock.<br>\r\n<br>\r\n\"But...how...how could you know?\" I asked her.<br>\r\n<br>\r\nThe woman smiled, then introduced herself. \"My name is Olga, and I'm both a gypsy and a witch. I can sense when a soul does not belong in a particular body\" she explained to me, catching my full attention. \"And a male soul in a female body...or vice-versa...is a lot easier to sense\" she said. \"So tell me, what are you doing in that girl's body?\" she then asked me, causing me to roll my new eyes and let out a sigh.<br>\r\n<br>\r\nI went on to explain to whole situation to Olga, and she smiled. \"Ahh, it would seem that this 'friend' of yours, Jess, is one of those people who take to their new bodies a little too well\" the woman laughed.<br>\r\n<br>\r\n\"Tell me about me, that's why I'm hiding in here\" I stated. \"Well, that...and I've kneed her in the crotch!\" I shrugged.<br>\r\n<br>\r\n\"Just as any girl would do to a boy who is tormenting her\" Olga winked.<br>\r\n<br>\r\n\"Yeah well, there'll be consequences\" I sighed. \"And Cassie is the one who has the amulet that we used to swap bodies. In fact Jess has probably took it off her so that I can't have access to it\" I added.<br>\r\n<br>\r\nOlga thought for a moment, then spoke again. \"I only know of two amulets that can switch people's souls. One is the Amulet of Kynareth, and the other if the Sartha'al Amulet, which I happen to have in my own possession, despite several attempts by foolish individual to steal it from me\"<br>\r\n<br>\r\n\"So...Cassie has the Amulet of Kynareth?\" I inquired, crossing my arms under my perky breasts.<br>\r\n<br>\r\n\"Perhaps!\" Olga mumbled, before asking me for a description of the amulet. Once she had heard it, she grinned and nodded. \"Yes, that is the Amulet of Kynareth\" she then said.<br>\r\n<br>\r\n\"Well, some creepy looking guy gave it to my sister a few weeks ago. I don't know who he was, where he'd come from, or why he gave it away\" I explained. \"I only know that its because of that stupid amulet that I'm stuck in Jess's body\" I grumbled, gesturing down to myself.<br>\r\n<br>\r\nOlga again smiled.<br>\r\n</span></div></div>",
            "created":1335330000,
            "id":1322483,
            "title":"Hiding in another store."
        },
        "1342111121":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Staying as I am.",
                "Back to normal."
            ],
            "content":"<div class=\"\"><div> <span>\"If you are able to lure your friends into my humble little store, I could use my power of the arcane arts to put your soul back where it belongs, and if you like...I could perhaps teach Jess a lesson in the process\" Olga suggested with a cheeky smile, looking at me.<br>\r\n<br>\r\n\"You mean...swap her with someone else?\" I replied, my voice tinged with curiosity.<br>\r\n<br>\r\n\"Hmm, perhaps, just for a short time\" Olga winked.<br>\r\n<br>\r\nI smiled at the thought of Jess being 'toyed' with. \"That sounds like fun!\" I stated. \"Mind you, \"I then stated, as I glanced down at my femininely-attired body. \"though I wouldn't admit it to Jess or Cassie, it does feel nice being a girl\" I mumbled to her. \"I just wish I wasn't so young\" I added.<br>\r\n<br>\r\n\"Oh I believe I can help you there\" Olga smirked again, as she held up one of her hands and a swirling mass of bluish energy began forming in her palm. She then clenched her fist, mumbled a few words in latin and threw the energy at me. The energy seemed to envelop my new body entirely, and I felt a strange...but pleasant tingling sensation overcome me as I kept looking down at myself. After a while, the energy dissipated, and I was left standing there, looking the same...yet different.<br>\r\n<br>\r\n\"Wow!\" I gasped, cupping my larger breasts in my hands. I then looked further down my body and gasped at the sight of my slightly longer legs, still as smooth and shapely as Jess's always were, but even more so. Even my ass seemed to have expanded slightly, and I reached around to grab it. \"What did you do?\" I asked Olga in my more mature tone of voice.<br>\r\n<br>\r\nOlga smiled, admiring her handiwork. \"You were 16 years old before...yes? Well...I have made you 16 again, merely by adding three years of age onto your friend's body\" she said. \"You are now a very voluptuous young woman\" she complimented me, causing me to blush.<br>\r\n<br>\r\n\"You know, I think this will make Jess jealous\" I giggled, running my manicured hands over my new, accentuated curves.<br>\r\n<br>\r\n\"If you wish, I can leave you like that,\" Olga said. \"Or I can return your friend's body to normal and switch your souls back to your rightful bodies?\" she asked me.<br>\r\n<br>\r\nI gave it some careful thought.<br>\r\n</span></div></div>",
            "created":1335934800,
            "id":1327787,
            "title":"She offers a way out."
        },
        "13421111211":{
            "author_id":"acejr",
            "author_name":"Ace",
            "choices":[
                "Cassie calms the 2 of you down.",
                "Cassie says we should go home."
            ],
            "content":"<div class=\"\"><div> <span>\"Thanks, but no thanks,\" I replied, \"I'm going to stay like this for a little, some revenge you could say. Do you have a phone number I can use to conact you with?\"<br>\r\n<br>\r\n\"No,\" she relied. \"But I do have this. Break it when you want to speak with me.\" She then handed me something that looked like a minature Party Popper.<br>\r\n<br>\r\n\"All right then. I'll see you soon.\" I sai as I turned around and began to walk out.<br>\r\n<br>\r\n\"Good luck, stranded soul!\" And that was the last thing I heard before I got out of the store. Jass and Cassie were still looking for me when I had found them.<br>\r\n<br>\r\n\"Looking for me?\" I said somewhat trampily. Both oftheir faces gawked in awe, before Jess broke the silence.<br>\r\n<br>\r\n\"How the hell did you do that?\"<br>\r\n<br>\r\n\"I've enlisted some help, to get me through this little endevour.\" I replied<br>\r\n<br>\r\n\"Who. Is. It?\" Jess was clearly agrivated, but it felt good not to be on the recieving end. <br>\r\n<br>\r\n\"Why would I tell you?\" I responded in a snarky fashion. </span></div></div>",
            "created":1336712400,
            "id":1334646,
            "title":"Staying as I am."
        },
        "134211112112":{
            "author_id":"acejr",
            "author_name":"Ace",
            "choices":[
                "Go home",
                "Stops elsewear"
            ],
            "content":"<div class=\"\"><div> <span>\"Uh... I think, We've had enough. Come on Jess. Let's go back to our home, we need to talk.\" Cassie grabbed your old arm.<br>\r\n<br>\r\n\"...fine.\" Jess said quietly. The two wlked in the opposite direction.<br>\r\n<br>\r\n\"Good bye Dan!\" I yelled as they walked off. \"I should probably head home too. I should, but I nver said I will!\"</span></div></div>",
            "created":1336712400,
            "id":1334648,
            "title":"Cassie says we should go home."
        },
        "1342111121122":{
            "author_id":"acejr",
            "author_name":"Ace",
            "choices":[
                "Salon (I had a plan)",
                "Clothing store (might ass well get comfterble"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So where did I go you ask?</span></div></span></div>",
            "created":1336712400,
            "id":1334650,
            "title":"Stops elsewear"
        },
        "13421111212":{
            "author_id":"nixon5",
            "author_name":"nixon5",
            "choices":[
                "Revenge",
                "Change back and make Jess 16"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nHmm you've to think very seriously about your options. If you stay this way as the 16-year-version of your sister's best friend, there will be some problems confronting you: how do you explain Jess' parents the age progression of her daughter? Where do you go to school? And what's your reaction as a 16-years old girl if you're looking at your former male body?<br>\r\n<br>\r\nThe most important argument in your mind is built by the thought that you've the chance to change back in your former male self. You're a boy in a girl's body. Ok, it's a really hot girly body but you're a boy becoming a man. But you're also convinced that you'll immediately fall in love when Jess in her original body becomes 16.<br>\r\n<br>\r\nOlga interrupts your thoughts: \"What's your decision, my young friend?\"<br>\r\n<br>\r\n\"Well, it's very difficult but I think I'd like to be normal.\"<br>\r\n<br>\r\nOlga nodds: \"No problem. Do you like to stay a girl or what next?\"<br>\r\n<br>\r\n\"Next I'll try to find my former male self and my little sister to bring them to you. Then please change me back to my former male body.\"<br>\r\n<br>\r\n\"Ok, so you wish for another transformation on your sister and her best friend's bodies?\"<br>\r\n<br>\r\nYou're thinking about your new options. It's a really nice offer to have revenge on both of them but there's also the possibility to wish Jess' body to 16 years old and to date Jess. Otherwise you've to think about the best kind of revenge.<br>\r\n<br>\r\n<br>\r\nWhich option do you choose?</span></div></div>",
            "created":1335934800,
            "id":1327877,
            "title":"Back to normal."
        },
        "134211112121":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Make them pregnant",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will you do to them?</span></div></span></div>",
            "created":1433134800,
            "id":1986492,
            "title":"Revenge"
        },
        "1342111121212":{
            "choices":[
                "Yes",
                "No, any it mother ideas?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She can make both of them guys</span></div></span></div>",
            "created":1466744400,
            "id":2169801,
            "title":"Other"
        },
        "1342112":{
            "choices":[
                "Leave the store, wearing the dress",
                "Try to change again"
            ],
            "content":"<div class=\"\"><div> <span>Just as you begin to say, \"no one will ever see me in this,\" Cassie and Carol begin snapping photos of you and posts them on a social networking site. <a rel=\"nofollow\" href=\"http://data.whicdn.com/images/24213041/dress-girl-high-heels-pink-Favim.com-319260_large.jpg\" target=\"_blank\">http://data.whicdn.com/images/24213041/d...</a><br>\r\n<a rel=\"nofollow\" href=\"http://thumbs.dreamstime.com/thumblarge_259/120818423044tzi5.jpg\" target=\"_blank\">http://thumbs.dreamstime.com/thumblarge_...</a><br>\r\n<a rel=\"nofollow\" href=\"http://us.123rf.com/400wm/400/400/bluestock/bluestock1112/bluestock111200011/11594880-beautyful-woman-legs-with-pink-dress-and-heels-over-white.jpg\" target=\"_blank\">http://us.123rf.com/400wm/400/400/bluest...</a><br>\r\nNow you're exposed for all the world. The thought makes you sick as anyone can see Jessica, err you anytime they want. It's strange how you feel so protective of Jessica's body now that you're inhabiting it. <br>\r\n\"Now you <b>HAVE</b> to wear it \"Jess\". Everyone has already seen you in it and the critics agree.\"<br>\r\nShe shows you several comments already posted and you have you shun your eyes. <br>\r\n\"Cassie, why?\"<br>\r\n\"Cause. I want my best friend to look gorgeous.\"<br>\r\n</span></div></div>",
            "created":1355374800,
            "id":1487158,
            "title":"Pink Dress and Heels"
        },
        "134212":{
            "author_id":"acejr",
            "author_name":"Ace",
            "choices":[
                "\"I guess I got a little carried away...\"",
                "\"And what re you gonna about?\""
            ],
            "content":"<div class=\"\"><div> <span>\"No thanks. I've got somewhere to be right now.\" I replied, trying to sound in charcater.<br>\r\n<br>\r\n\"Come back again, when you have more time!\" The woman said as I walked out of the store as quickly as possible. Jess and Cassie were looking me when I got out, nd Cassie saw me out of the corner of her eye.<br>\r\n<br>\r\n\"I found him.\" She had a paniced look on her face, but Jess looked like a mix of anger and annoyance.<br>\r\n<br>\r\n\"Dont run off with my body like that!\" She blurted.<br>\r\n<br>\r\n\"Dont act like an in-control-asshole in my body!\" I made my side of the argument blunt and too the point. Jess stared at me, opened my old mouth, took in some air, and said.</span></div></div>",
            "created":1336798800,
            "id":1335416,
            "title":"Bolting from the store."
        },
        "13423":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "Go somewhere else.",
                "Keep jogging."
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://goo.gl/5jLmq\" target=\"_blank\">http://goo.gl/5jLmq</a><br>\r\n<br>\r\nThe cool, gentle breeze tossed my fine hair back and forth, lightly patting my shoulders. There is some something particularly liberating about running. I had decided to get moving that day to get rid of some of my jitters, left over from the previous week's strange events. Normally I wouldn't have been able to run as far as I did, but my current body was built for it. After a couple miles, I knew that I had to take a break from my trance. I found a bench in the corner of the park and sat down. <i>Wow Jess! I had no idea you could be so good at running!</i>. I felt proud of myself, having been able to accomplish something from my dreams. I rubbed my hands up and down my smooth, hairless thighs, as I took a peek down my shirt. I could see little beads of sweat collecting on Jess' breasts and running down to disappear into my white sports bra. I was suddenly interrupted by some whistling coming from about 20 feet in front of me. I whipped my head up to see the origin of the noise -a guy in his mid twenties. Not knowing what to make of it, I just stared at him until he walked off into the distance. <i>I guess they were right.</i> I bent down to tie my size 9 purple jogging shoes (As a boy, I wore size 11 mens) and hopped back up onto my feet. I brushed Jess' beautiful hair behind my ears, adjusted her bra, and started jogging again.<br>\r\n<br>\r\nThe entire time after that, I couldn't stop thinking about that guy. Something was interesting about him, but I couldn't quite place it.</span></div></div>",
            "created":1339995600,
            "id":1362614,
            "title":"A Week Later..."
        },
        "134231":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "Into town.",
                "Cassie and \"Dan\"s' house."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where did I go?</span></div></span></div>",
            "created":1339995600,
            "id":1362615,
            "title":"Go somewhere else."
        },
        "1342311":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "...my sister Cassie.",
                "Jess' other best friend."
            ],
            "content":"<div class=\"\"><div> <span>Although restricted by the bra I was wearing, my wonderful, perky new breasts bounced delightfully as I jogged along the street, heading for the center of town. It was all I could do to contain my 'arousement' at the feeling. In the week I had been 'stuck' in Jess' body, I had really become accustomed to being a 13-year old girl. I definitely liked all the attention I had been getting, even though most of it was from boys. After running for a while longer, I slowed to a walk, wiping the sweat of my brow.<br>\r\n<br>\r\nStopping in front of a store front window for a moment, I took a second to admire my reflection...or rather Jess' reflection. I checked nobody around me was looking and then ran my hands gently over my boobs, before running them down my stomach and briefly in between my legs. \"That still feels so good\" I giggled in my girly new voice. Every time I felt in between my new legs, a rush of excitement shot through me, making me weak at the knees.<br>\r\n<br>\r\n\"Hey Jess!!\" a voice behind me suddenly exclaimed as I was about to set off jogging again.<br>\r\n<br>\r\nSpinning around, I saw that it was...<br>\r\n</span></div></div>",
            "created":1340082000,
            "id":1363194,
            "title":"Into town."
        },
        "13423112":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "In the house.",
                "On the way..."
            ],
            "content":"<div class=\"\"><div> <span>It was Jess' childhood friend, Alex. Wow, she is hot. I struggled to keep myself from getting aroused, but remembered that I really had nothing to worry about. I gave in to my thoughts. Now I felt like something was definitely missing, but it somehow felt right, in its own strange new way. I felt like a girl for sure, and I kind of liked the idea that I could be horny as hell without anyone noticing.<br>\r\n<br>\r\nAlex: Hey Jess!!! (She gave me a long hug)<br>\r\nMe (playing the part): Hey ..Alex!! What's up, dood? <i>I laughed.</i><br>\r\nAlex: I'm just shopping around. It looks like you've been jogging!<br>\r\nMe: Yeah. I think about five miles, actually.<br>\r\nAlex: What?! Lucky bitch! I wish I had your body!<br>\r\nMe: Yeah, well, thanks. (smiling)<br>\r\nAlex: So I was wondering... Would you want to come over to my house? You could borrow some of my clean clothes. It's just about a block in that direction (she points), but you know that.<br>\r\nMe (having nothing else to do): Um.. sure!<br>\r\nAlex: Great! You wouldn't mind going swimming, too, would you?<br>\r\nMe: Oh no. And you have a bathing suit I can borrow?<br>\r\nAlex: Yeah. Don't worry about it. We'll just have to see if it fits you. (She was a little bigger than Jess was and quite curvy <a rel=\"nofollow\" href=\"http://goo.gl/0IGpc\" target=\"_blank\">http://goo.gl/0IGpc</a>).<br>\r\nMe: Sounds good! Lemme just text my mom.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nMe: Ok, so she says it's alright. I just have to be back home in about three hours for a dinner party.<br>\r\nAlex: Got it! Let's go!<br>\r\n<br>\r\nShe wrapped her arm around my waist and began to skip towards her house. I just followed suit.</span></div></div>",
            "created":1340254800,
            "id":1363894,
            "title":"Jess' other best friend."
        },
        "134231121":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "Outside",
                "Wait. Further Planning..."
            ],
            "content":"<div class=\"\"><div> <span>Alex (handing me a bikini): I hope it fits!<br>\r\nMe (looking down at the fabric I then held in my hand): Yeah.<br>\r\n<br>\r\nI turned around and walked down the hallway into the bathroom, closing and locking the door behind me. I pulled all of Jess' clothes off my body, leaving me standing naked. I picked up the bikini once again and stroked the smooth, stretchy material. I pulled the bottom up Jess' legs until it rested comfortably on my crotch. I then grabbed the top and held it firmly on my chest with both of my hands, feeling my breasts compress against my skinny body. <i>It fits!</i> Something thrilled me about the fact that I could play the part of somebody else for a while, and I wasn't too worried. Jess was someone I had known for the majority of my life, and this experience had just gotten me so much closer to her. We had been talking a lot about each others lives together over the past week and have become good friends (my sister even seems a little jealous). I glanced at the mirror which caused me to sweat with excitement. Jess was like a puppet, and I was in full control. I smiled at Jess in the mirror, and she flashed her typical smile back at me. It was at this point when I realized how far I could take this whole stunt. I could not only <i>act</i> like Jess, but I could <i>BE</i> Jess. I wanted her reality, her memories so badly. I needed to \"fit\" in her body. I hurriedly finished tying the top around my torso and headed outside to meet Alex at her pool.<br>\r\n<a rel=\"nofollow\" href=\"http://babescene.com/babe/image/medium/babescene.com_ks1k9n.jpg\" target=\"_blank\">http://babescene.com/babe/image/medium/b...</a></span></div></div>",
            "created":1341205200,
            "id":1370895,
            "title":"In the house."
        },
        "1342311211":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "Jump in!",
                "Afterwards..."
            ],
            "content":"<div class=\"\"><div> <span>Alex: Jess?! That looks so loose on you!<br>\r\n<br>\r\nI guess I had gotten a bit distracted with my storytelling...<br>\r\n<br>\r\nMe (unable to think of a good response): Huh? Oh! (I laughed) Oops...<br>\r\nAlex (walking up to me): Here.<br>\r\n<br>\r\nAlex spun me around and tightened the bikini top further. She turned me back around and gave Jess' boobs a quick squeeze, unintentionally making me a bit horny.<br>\r\n<br>\r\nMe: Hey!<br>\r\nAlex (jumping into the pool): Catch me if you can!</span></div></div>",
            "created":1341464400,
            "id":1372238,
            "title":"Outside"
        },
        "13423112112":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "Back inside the house",
                "Leave / Say goodbye to Alex"
            ],
            "content":"<div class=\"\"><div> <span>We actually ended up talking in the Jacuzzi. I just followed Alex's lead, giving responses that I imagined a typical girl would say. It was nice, and I began to relax a bit more.<br>\r\n<br>\r\nAlex: I don't know about you, but I want to get out soon.<br>\r\nMe: Me too actually.<br>\r\n<br>\r\nAlex stepped past me and out of the Jacuzzi, and the water that clung to her skin dripped down over me. I was proud of myself that I hadn't raised any suspicion. I was just like any other girl out there. I also stepped out of the Jacuzzi, and Alex handed me a towel. I gently dried Jess' body, hesitating before the more sensitive spots.<br>\r\n<br>\r\nAlex: Wait here, Jess. I'll go grab a t-shirt.<br>\r\n<br>\r\nI waited. She came out carrying a delicate white thing, which she kindly handed to me. I threw it on, and the wet bikini made itself obvious.<br>\r\n<a rel=\"nofollow\" href=\"http://babescene.com/babe/image/large/babescene.com_ouvua0.jpg\" target=\"_blank\">http://babescene.com/babe/image/large/ba...</a><br>\r\nWow, I <i>really</i> felt like a girl. From what I could see from my POV, I looked more than just feminine. I looked hot. I tugged down on the front of the t-shirt, feeling Jess' breasts bounce back up resistantly. I imagined what Jess looked like before I had become her. Now I felt like I owned that image.<br>\r\n<br>\r\nI wonder what my sister would've thought if she had seen me at the moment. Jess would've surely been proud of me.</span></div></div>",
            "created":1341464400,
            "id":1372241,
            "title":"Afterwards..."
        },
        "134231121121":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Telling Alex the truth.",
                "Keeping it to myself."
            ],
            "content":"<div class=\"\"><div> <span>Once me and Alex were cozy back inside the house, sat in the living room watching MTV, she surprised me with a question. \"So...when are you going to find yourself a boyfriend?\" Alex asked me, causing my head to spin towards her in surprise.<br>\r\n<br>\r\n\"Er...I don't know!\" I shrugged, feeling a little nervous.<br>\r\n<br>\r\n\"You must be the only girl in school without someone you know, apart from the nerds!\" Alex then said, laughing at me.<br>\r\n<br>\r\n\"I'll get there...eventually!\" I mumbled. My mind then went back to the body swap between me and Jess. Me kissing a boy was the condition Jess had attached, before she would agree to swap back with me. The question now repeating in my head was 'did I want to swap back?' I was beginning to feel 'at home' in Jess's body, it just felt right me being a teenage girl with her whole life ahead of her. And Jess hadn't exactly been pestering me for her body back, I surmised that she was as happy in my older, stronger body then I was in hers.<br>\r\n<br>\r\n\"What are you think about Jess?\" Alex asked, snapping me out of my trance.<br>\r\n<br>\r\n\"Oh...nothing!\" I smiled at her. \"Stuff!\" I then muttered.<br>\r\n<br>\r\n\"What stuff?\" Alex then questioned me.<br>\r\n<br>\r\n\"Just think about Dan, that's all\" I shrugged my slender shoulders.<br>\r\n<br>\r\n\"Cassie's older brother?\" Alex frowned. \"Why?\"<br>\r\n<br>\r\n\"I don't know\" I answered.<br>\r\n<br>\r\nAlex just laughed at me. \"Dan's okay, but I'm sure you can get someone closer to our own age\" she then said, making me smile. I pondered whether to tell Alex the truth, about me and Jess switching bodies and lives. But would she believe me? I had no way of knowing. Maybe it would be best if I played it safe.<br>\r\n</span></div></div>",
            "created":1342587600,
            "id":1381526,
            "title":"Back inside the house"
        },
        "1342311211211":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "She starts believing.",
                "Alex is having none of it."
            ],
            "content":"<div class=\"\"><div> <span>\"Okay Alex, I need you to listen to me okay, and do NOT laugh when I say this\" I told Jess's friend, using Jess's own voice.<br>\r\n<br>\r\n\"What are you talking about?\" Alex laughed.<br>\r\n<br>\r\n\"Okay, um...I'm not Jess!\" I came right out and told her. But her laughing only got louder.<br>\r\n<br>\r\n\"What do you mean you're not Jess? Like...why are you acting weird?\" Alex said, unable to keep a straight face. I just studied her for a moment, and I tried to decide whether to continue trying to persuade her who I really was. Eventually I decided to press on.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://img.ehowcdn.com/article-new/ds-photo/getty/article/163/14/78033140_XS.jpg\" target=\"_blank\">http://img.ehowcdn.com/article-new/ds-ph...</a><br>\r\n<br>\r\n\"I'm Dan, I'm just in Jess's body!\" I told her, knowing full well how she would react to that bizarre sounding statement. \"I KNOW it sounds stupid ak, but can you just..like...humor me\" I then said, unconsciously beginning to talk like a teenage girl. \"Jess used some kind of trinket to swap bodies with me, I'm stuck in here and she says I have to kiss a boy before she'll swap us back\" I explained further.<br>\r\n<br>\r\nAlex's skeptical stare remained intact the whole time.<br>\r\n<br>\r\nI let out a frustrated sigh, but nonetheless persevered in my attempt to persuade her just who I was.</span></div></div>",
            "created":1346648400,
            "id":1419870,
            "title":"Telling Alex the truth."
        },
        "13423112112112":{
            "author_id":"saracen1187",
            "author_name":"Switcher",
            "choices":[
                "Going with the flow.",
                "Going against the grain."
            ],
            "content":"<div class=\"\"><div> <span>Yeah right, like...nice try Jess!\" Alex suddenly burst out laughing, causing me to groan in annoyance. \"Like...body swapping is not possible okay, only in Disney films, and they are like...so lame\" she giggled, making me think that trying to persuade her who I was...was just a big waste of time.<br>\r\n<br>\r\n\"I'm telling you the truth!\" I tried one last time, but that just caused Alex to roll her eyes and laugh some more.<br>\r\n<br>\r\n\"Whatever!\" Alex said, idly raising a hand.<br>\r\n<br>\r\n\"Alex...\" I began saying, but she cut me off.<br>\r\n<br>\r\n\"Okay anyway, back to the real world, what do wanna do today? We so have to find you a boyfriend, you must be the only girl in school without one\" she said to me, eliciting more than just a little wince from me. The last thing I wanted was a boyfriend at that moment in time.<br>\r\n<br>\r\n\"I don't want a boyfriend\" I stated firmly.<br>\r\n<br>\r\n\"Er...yes you do, unless you're a lesbo!\" Alex responded in her usual chirpy tone.<br>\r\n<br>\r\nI just sighed deeply...<br>\r\n</span></div></div>",
            "created":1347339600,
            "id":1425139,
            "title":"Alex is having none of it."
        },
        "1342311211212":{
            "choices":[
                "Give in and kiss her",
                "Resist"
            ],
            "content":"<div class=\"\"><div> <span>I liked Alex. In just one afternoon we had bonded more than I thought I'd bond with any girl while in Jess's body, and even though I knew Alex talked to me with the assumption she was talking with Jess, I didn't mind. I felt comfortable and, to be honest, I identified with Jess enough to feel we were one in the same at this point.<br>\r\n<br>\r\nBut there were some things I couldn't tell anyone no matter how close. Switching lives with Jess was one of them. I wasn't sure Alex would appreciate knowing she'd given an older boy one of her bikinis and sat with him in a jacuzzi, thinking he was her female friend, asking her about boyfriends. The shock alone would take a few hours to get over if at all. If she ran her mouth around the real Jess there was a chance Jess might want to switch back, she might be jealous I was getting cozy with her best friends and running my mouth about our secret transformations. I didn't want to go back, not so soon. There was still so much to discover about my younger, female life.<br>\r\n<br>\r\n\"Maybe I will.\" I shrugged weakly. \"I'm trying not to think about it, I... I have to focus on school, exercise, I mean we're young! You think about that?\"<br>\r\n<br>\r\n\"That's why you should find someone!\" Alex leaned close and poked my nose. \"We're young and beautiful!\"<br>\r\n<br>\r\nI was surprised to find the gesture made me gulp nervously, and my stomach buzzed at her touch. <i>I'm still attracted to her!</i> I thought with horror. Everything had gone so nicely till that moment - being Jess was second nature and I hadn't thought of myself as a boy until I considered telling Alex... Dammit! It clicked. Reminding myself about the switch also reminded me I wasn't really a girl, and that meant reminding me I still was attracted to girls... And feeling Alex's breath on my neck, seeing down her shirt, between the cups of her bikini top, I was <i>very</i> attracted to her.<br>\r\n<br>\r\nI fought hard. I didn't want to give in. I muttered \"Y-Yeah\" and wanted badly to get up and leave but I had no reason. I should find an excuse, at least look away. Her lips couldn't get more enticing...</span></div></div>",
            "created":1343797200,
            "id":1395103,
            "title":"Playing it Safe"
        },
        "134232":{
            "author_id":"zazeal",
            "author_name":"Zazeal",
            "choices":[
                "Jess' POV",
                "Someone else's POV"
            ],
            "content":"<div class=\"\"><div> <span><i>Note: I might have ended up making this a little too realistic. A very very dark twist. Turn back if that’s not your thing.<br>\r\n<br>\r\n<br>\r\nOh. How could I not realise it? All of these changes, even my sexual orientation being reversed, no doubt that I’m falling in love with him. With each waking second, another part of me falls into oblivion.<br>\r\n<br>\r\nAaahh, it’s happening again. It’s surging through my mind. This isn’t good, it’s getting worse with each passing day. Nononono, it's happening again, it’s all slipping away.<br>\r\n<br>\r\nJess refuses to let me swap back, and I have my doubts she’ll let me swap back, even if I did satisfy her. I know her. I’ve known her for years. I just didn’t want to think that a person like this could actually exist. She acts like it’s some sort of joke, but I’ve felt the terrible throbbing pain coursing through my skin. In fact, it never stopped, it’s still bleeding and causing me misery.<br>\r\n<br>\r\nOf course, she’s happy to be away from it, but I sense something more. She’s too attached to that body and she’ll do anything to keep what she wants. Either I could die after the fake persona takes over this body or I could end it all while I’m still me. Luckily, I have a gun with me to intimidate rapists, I’ll just end it all here.</i><br>\r\n<br>\r\nJess was walking along as always when she saw an area cordoned off by police officers carrying away a corpse in a body bag. She suspected nothing as she enjoyed the new body and the sensations it gave her. <i>I really don’t want to give this back, this body is amazing.</i><br>\r\n</span></div></div>",
            "created":1469941200,
            "id":2189183,
            "title":"Tragedy Strikes"
        },
        "1343":{
            "author_id":"gang_bang69",
            "author_name":"I_Like_Swapping",
            "choices":[
                "Jess (In Dan’s body)",
                "Dan (In Jess’ Body)",
                "A different solution"
            ],
            "content":"<div class=\"\"><div> <span>“Alright, we’ve had our fun for today. I think it’s time to go home to your new home.” Cassie said to me.<br>\r\n<br>\r\n“Yeah, agreed.” I remarked, happy that this experience at the mall was finally over. “But can we go back to our house first please?”<br>\r\n<br>\r\n“Nope! You’re living arrangement has been altered for the next month, so I think you better get used to it!” She teased.<br>\r\n<br>\r\nWe headed over my car. “I can’t wait to finally drive!” Jess squealed, Cassie along with her. She pulled my car keys out of the pocket of the jeans she was now wearing.<br>\r\n<br>\r\n“You don’t know how to drive.” I told her, and held out my smaller and manicured hand. “Give me the keys.”<br>\r\n<br>\r\nCassie and Jess burst out laughing. <br>\r\n<br>\r\n“What?” I asked them.<br>\r\n<br>\r\n“Dan please, you’re a thirteen year old girl!” Cassie said.<br>\r\n<br>\r\n“Yeah there’s no way you’re gonna get away with driving a car.” Jess added.<br>\r\n<br>\r\n“And Jess will?” I questioned. “She doesn’t know how to drive, she could get us hurt!” I told them.<br>\r\n<br>\r\n“Dan, just let me do it.” Jess told me. “Plus, I’m sixteen now!” She said and reached into my wallet and pulled out my driver’s license. She held it up to her new face and smiled to show the match.<br>\r\n<br>\r\n“I’m not going anywhere until Jess gives me the keys.” I demanded and held my hand out again.<br>\r\n<br>\r\nWho drives home?</span></div></div>",
            "created":1562749620,
            "id":2684716,
            "title":"Heading home...to Jess's house."
        },
        "14":{
            "author_id":"nixon5",
            "author_name":"nixon5",
            "choices":[
                "Jess' point of view in her first experience as a boy",
                "Dan's point of view in his first experience as a girl"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nOk, now I've to pretend to be Jess. Nobody will trust me if I'd try to explain my body swap with her. And I hope that she won't do something crazy in my former male body.<br>\r\n<br>\r\nI've to think about my new life. Jess, Cassie and me are going to the same high school. She's in the swimming team and member of the cheerleading team. She has acutally no boyfriend and I don't know if she has a crush on somebody in our school or somewhere else. She lives with her mom and her younger brother in a house near my former home. Her parents are divorced since she was 5 years old. As I know it from Cassie, Jess is a good student. Maybe this swap will be my personal advantage because I'm normally an average teenager wich less interest for school stuff. <br>\r\n<br>\r\n\"Are you dreaming?\", Jess interrupted my thoughts.<br>\r\n<br>\r\n\"Not really. But I've thought what's about to be you and how I've to pretend to be you.\"<br>\r\n<br>\r\nJess has an evil smile on my former male face: \"Good <i>girl</i>! You've to start pretending me during my cheerlading practice which begins in 30 minutes. I think you've to go now. I'll go shopping with Cassie.\"<br>\r\n<br>\r\nI shake my head: \"You've no time for shopping. You forget that simultaneos to the cheerlading practice is always my football practice? Now, you're a football player. So you've to go too.\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1337403600,
            "id":1340543,
            "title":"Training."
        }
    },
    "info":{
        "author_id":"124235a",
        "author_name":"124235",
        "brief_description":"I swap bodies with my sister's best friend.",
        "created":1333443900,
        "description":"<td align=\"left\" class=\"norm\">KEEP ANY ADDITIONS AS REALISTIC AS POSSIBLE.<br>\r\n<br>\r\n----------------------------------------------------------<br>\r\n<br>\r\nMy name is Dan (16).<br>\r\nMy sister's name is Cassie (13).<br>\r\nHer friend's name is Jess (13).<br>\r\n<br>\r\n----------------------------------------------------------<br>\r\n<br>\r\nOne sunny day, I was walking around town with my sister, Cassie, who had brought her friend, Jess, with her. We were talking about how girls interpreted boys' sexual desires. We talked about the rudeness of a man whistling at them.<br>\r\n<br>\r\nCassie: I hate it when they do that. It feels so... so violating!<br>\r\nMe: Is it that bad?<br>\r\nJess: Are you kidding?? You are so lucky! You don't have to deal with any of this crap!<br>\r\nMe: I'm sure they don't mean it in that way...<br>\r\nCassie: Dan! It's still really creepy!<br>\r\nJess: Man! If I were a boy...<br>\r\nCassie: I wish you c- Waitasec!<br>\r\nMe: What, Cassie?<br>\r\nCassie: What if you and Jess swapped bodies?<br>\r\nJess: You mean with that amulet-thing that guy gave you a while ago?<br>\r\nMe: ...<br>\r\nCassie: Yeah! Why not? You could live each other's lives for like a month or so to see what the \"other side\" experiences every day.<br>\r\nJess: That sounds like so much fun! I've always been curious about what being a boy was like!<br>\r\nMe: And what about my opinion?<br>\r\nJess: Who cares about your opinion! Let's do this!<br>\r\nMe: Cassie!<br>\r\nCassie: C'mon, Dan. It's only one month of your entire life.<br>\r\n<i>I stared at Jess' body.</i><br>\r\nMe: Well...<br>\r\nJess: Awesome! Let's do this!<br>\r\nCassie: Let's go into that alley to do it.<br>\r\n<br>\r\nI followed the girls into the nearby alley. Cassie held her necklace up to the sun and closed her eyes. Then everything faded to white.</td>",
        "id":1859026,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1589560620,
        "modified":1589560620,
        "pretty_title":"Switching Lives"
    }
}