{
    "chapters":{
        "1":{
            "author_id":"jedi42",
            "author_name":"Ishoam",
            "choices":[
                "human",
                "Covenant"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First of all choose your species.</span></div></span></div>",
            "created":1303269300,
            "id":1091140,
            "title":"The Intro"
        },
        "11":{
            "author_id":"jedi42",
            "author_name":"Ishoam",
            "choices":[
                "Launch fighters bring wepons online",
                "Hail them",
                "signal Comand"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are Admiral Johns and you were in command of the Cruiser UNSC Seattle. Your ship was orbiing Taltia,when a Covenant Frigate came out of slipspace What do you do?</span></div></span></div>",
            "created":1303270080,
            "id":1091149,
            "title":"human"
        },
        "111":{
            "author_id":"jedi42",
            "author_name":"Ishoam",
            "choices":[
                "Boarding Party",
                "The Ship Explodes"
            ],
            "content":"<div class=\"\"><div> <span>\"Megan status.\" (Megan is the ships A.I.) \"Standard orbit achieved.\" Megan said. \"Prep pods for launch bring wepos online.\" You ordered. \"Expecting trouble captin?\" she questioned. \"Taltia may be ours again ut I don't think the covenant understand that yet.\" You anwsered. Moments later a covenant frigate cantme out of slipspace. \"See what I ment.\" you said sarcasticaly. \"Order all guns to fire at the eemy, charge the MAC gun and launch the Longsword fighters.\" you ordered. \"Aye aye captin.\" Megan then began to carry out her orders. The ship was ready to fire at the lone covenant frigate within moments. \"Fire.\" You ordered. 2 seconds after you spoke all guns on the UNSC Seatle were firing at the frigate including the MAC gun. The frigate's ship was in critical condition after the slavo was finished. \"What's the status of the ship Meg?\" \"The damage to the enemy is devastating, they've lost weapons,comms, and life support they won't last much longer.\" \"how many are alive?\" \"57, out of 300 soldiers, and crew members.\" \"Prepare a boarding party to capture whatever elites are alive, and kill the grunts,jackals, and drones. The party will consist of spartans 028,184, and 8 UNSC marines.\" You ordered. </span></div></div>",
            "created":1306653540,
            "id":1115199,
            "title":"One Less Ship to Worry About"
        },
        "1111":{
            "author_id":"jedi42",
            "author_name":"Ishoam",
            "choices":[
                "The battle between the Seattle and the covenant cruiser.",
                "Jump to Slipspace"
            ],
            "content":"<div class=\"\"><div> <span>When the Boarding pelican entered the hanger of the frigate it was errily quiet. \"OK I'm point.\" said 028 (Kris). 184 (Kyle) and the marines followed suit and exited the pelican,assault rifles,magnus,and DMRs in hand. The strike team met no resistance until they got to the bridge. The hallways until then were filled with corpses of dead covenant soldiers. \"Take the Elites alive kill everything else.\"Kyle ordered to the marines. The team snuck into the large circular room and quiletly assinated anything shorter than 6 feet tall. The remaining covenant now consisting of only Elites went about their normal duties trying to get the ship under control, when they too were either hit with the butt ofa rifle or got a pressure point pinched by a spartan. The marines had to carry back the 7 Elites they captured, since they had no other way of retriving them. They were almost at the hanger when the ship shook violently. \"'28,184 I need you two and your squad back here ASAP a cruiser just came out of slipspace it's scutttling the ship get away as fast as you can.\" You ordered to the squad. The team then despriatly ran for the hanger. The shiip was already in critical condition, if it took many more hits it would be destroyed. The team arrived at the extraction point, boarded and quickly took off for the Seattle. The pelican was under heavy fire on the trip back to the ship, the space banshes would've killed them if it wern't for the longsword fighters assisting them. They landed in the seattle's main hangerbay with some POWs to \"question\".</span></div></div>",
            "created":1306911600,
            "id":1117439,
            "title":"Boarding Party"
        },
        "11111":{
            "author_id":"jedi42",
            "author_name":"Ishoam",
            "choices":[
                "The Battle Part 2(Actiony)"
            ],
            "content":"<div class=\"\"><div> <span>\"Captin I'm reading a covenant cruiser coing out of slipspace, in about 90 seconds they'll be over us. Megan said. \"Bring the ship back up to combat alert alpha I want everyone at their stations.\"<br>\r\n\"Everyone sir?\"<br>\r\n\"Everyone.\"<br>\r\nAlarms were going off all over the ship, Men scrambling on the bridge to ready the ships' Defenses. \"Attention all combat personnel we are re-engaging the enemy please report to your action stations. 5th platoon secure airlocks on decks 2-10. 14th platoon randevous with 22nd tactical at starboard bulkheads.Shoot all Covenant on sight. This is not a drill I repeat this is not a drill. Good luck.\" Megan announced over the intercom. On the floor of the main assembly area for soldiers scorpions, and warthogs. Sergant Jordan was breifing his men on the upcoming battle. \"You heard the lady move like you have some purpose.\" he ordered. They filed into line shoulder to shoulder in two rows the sgt. Walking in the middle. \"Men here is where we show those alein SOBs they could not have picked a worse enemy than the human race. So keep your eyes down range fingers on your triggers and we all make it out in one piece. Am I right marines? AM I RIGHT MARINES!?\" he shouted. \"Sir yes sir!\" the marines said in unison marching out to secure the airlocks for boarding parties.<br>\r\n\"Captin they're firing plasma rounds iminte.\" Megan said to you as the ship then shook when the plasma hit the hull.</span></div></div>",
            "created":1308658560,
            "id":1130980,
            "title":"The Battle part 1"
        },
        "12":{
            "author_id":"ashl3yfox",
            "author_name":"AshleyTheFox",
            "choices":[
                "Begin the battle",
                "After the battle ",
                "Lord hood contacts you ",
                "You find a Survivor of the first halo ring(ODST sgt kurt tremors)",
                "The arbiter contacts you"
            ],
            "content":"<div class=\"\"><div> <span>you are sangheili(elites)ship mistress ashsune daleam of the expearemental covenant battleship/supercarrier/flagship equiped with both human ship parts as well as an orbital M.A.C. gun in the center of your ship,and forerunner ship parts,the name of your ship is ETERNAL CORRUPTION. you command the fleet of corruption and are with the elite seperatists.your crew address you by the nickname a human spartan had given you and that nickname is ashley.you also prefer that as it seems to be more honorable than your covenant name.you have just located a covenant fleet and have already engaged when a flood infected human frigate had joined the fight.yor fleet consists of 14 human frigates,8 human destroyers,6 human halcyon class battle cruisers(the kind that look like the pillar of auttum),6 human prowlers(stealth ships),6 human phenox class cruisers ,14 covenant corvetes,14 covenant frigates,10 covenant ccs battle cruisers, 6 covenant  super carriers,8 covenant battleships,16 covenant light cruisers, and the pride of your fleet,the ETERNAL CORRUPTION,your human/covenantforerunner hybrid flagship that ressembles a humongous covenant super carrier</span></div></div>",
            "created":1359628680,
            "id":1520904,
            "title":"Covenant"
        },
        "124":{
            "author_id":"ashl3yfox",
            "author_name":"AshleyTheFox",
            "choices":[
                "earth is being attacked by covenant loyalists",
                "your fleet arrives without incident",
                "lord hood contacts you in route"
            ],
            "content":"<div class=\"\"><div> <span>\"melissa.\" you growl. \"yes ship mistress?\" the ships A.I. asked. \"i told you to call me ashley,and as for my request scan the field for potential prisioners and destroy the parisite captured ship.\"you say. \"yes ashley.\"melissa replied. \"ashley,i get destroying the flood ship but what is the point in searching for prisiners on dead ships?\"2nd in command said. \"gek i beleive in intel,prisoners can tell us information that can help us and the humans in this wretched war,thus i beleive in taking them alive to question them,and then letting you shoot them.\"you say smiling with your 4 mandibales. \"ashley one human cryotube was discovered in the parasite ship wreckage human i.d. registers it to...no that cant be right,ashley the ship i.d. says it belongs to the pillar of auttum.\"melissa said. this caused the entire briidge crew to stop and look at you for orders.\"bring this human before me now!\"you yell out. \"yes mam it will be done.\"gek says.   30 minutes later.     you begin to wander around the human bridge impaceintly noting that it still has the scortch mark from when you and gek had sparred.suddenly the human bridge doors opened and gek came out carring a very fiesty human in black clad armor minus his helment.\"let go of me you split lipped bastard!\"the human yelled before being thrown in front of you.after he recovers he looks up at you and stares before saying\"whoa a female elite,heh your kinda cute for an alien sheila,but after what ive seen id settle for any kinda girl in the universe.\"he says.\"sorry but your not my type\"you reply.\"damn,rejected by an alien babe,so which one of you dyes first.\"he asked. \"relax nimrod were on your side.\"you say.\"WHAT!!\"he yells \"your joking right,i mean h-wait how long have i been frozen?\" he asked.\"2 monthes,i think im still trying to figure out the human calender\"you say.\"hey so what happened while i was out?\"he asked.he then sat silent as you told him the story of everything that has happened from master chief escaping the halo debris field to the fight fo delta halo and the the covenant civil war.\"whoa i must have really been asleep to miss all that.\"he said.\"by the way my names sgt kurt tremors.\" \"i am ship mistress ashune daleam of the eternal corruption,in human rank ibelieve i am an admiral, by the way call me ashley.\"you say \"hey ashley this is going to sound crazy but can i join you on this ship?\"he asked shocking you and several elites \"sure but i will have to clear this with lord hood first.\"you reply   10 minutes later    \"ok hood said he'd give you another sqaud with a spartan to command and that he wants me to bring you to earth for a promotion ceremony and to honor me for finding a surviver of the first halo\"you say \"a whole new squad and a spartan awesome,plus i get to fight elite back up,right?\"he asked \"yes\"you reply \"ye haw!!\"he yells.\"gek,set a course for earth and ready the fleet for imeadiate slipspace departure.\"you say \"as you wish ashley\"gek replies.2 minutes after you gave the order your whole fleet of 109 ships had jumped along with you to earth.</span></div></div>",
            "created":1359632040,
            "id":1520940,
            "title":"you find a surrviver of the first halo ring(ODS..."
        },
        "1241":{
            "author_id":"ashl3yfox",
            "author_name":"AshleyTheFox",
            "choices":[
                "the boarding party(gek's pov)",
                "stay with ashley",
                "skip the battle."
            ],
            "content":"<div class=\"\"><div> <span>as the fleet finaly arrived at earth you discover that it is under attack by covenant loyalists.\"gek prepare a squad to board and nuetrilize the crew of that cruiser.\"you order. \"ashley,what purpose will this serve us and the human fleet?\"gek asked. \"i want them shooting each other gek,and to do that i need you to hijack a cruiser and fire on its own fleet,understood?\"you ask  \"it will be done ashley\"he say before departing.</span></div></div>",
            "created":1359665700,
            "id":1521164,
            "title":"earth is being attacked by covenant loyalists"
        },
        "12412":{
            "author_id":"ashl3yfox",
            "author_name":"AshleyTheFox",
            "choices":[
                "ashley wakes up after the battle in an infirmery",
                "lord hoods point of view(the battle for earth)"
            ],
            "content":"<div class=\"\"><div> <span>\"ENGINES BACK FULL!!\"you yell. \"engines back full aye ashley''one of your bridge crew replys.\"ashley we have a hull breach on deck six!\"he says.  \"a-ashley,the parasite has been detected on several enemy cruisers!\"he replied in fear \"recall the boarding party and get me lord hood,NOW!\" you command. \"ashley now is not the best time for small talk.\" \"lord hood the parasite has infected some of those warships.\"you say while letting kurt treat your gashed head,reminding you to never stand in a combat situation again. \"ashley do you mind if i come aboard your ship to command this battle?\"hood asked.  \"no come as you please my friend.\" 23 minutes later lord hood and gek had arrived.     \"ashley give me a sit rep.\" \"with ple-\"was all you could say before an explosion knocked you off your feet...and into geks arms.blushing you quickly look up to see him blushing even harder.you get up to your feet and try to get to your command chair but once again fall and hit your head on the nav computer,this time lord hood catches you.\"are you ok ashley?\". hood asked you. \"uugh.........\"is all you say before passing out in his arms.</span></div></div>",
            "created":1359694080,
            "id":1521494,
            "title":"stay with ashley"
        },
        "124121":{
            "author_id":"ashl3yfox",
            "author_name":"AshleyTheFox",
            "choices":[
                "the party",
                "something happens"
            ],
            "content":"<div class=\"\"><div> <span>\"ugh where am i?\"you ask only to be gently pushed down by gek.\"easy ashley you took serious damage in the aftermath of the fight.\"he said.\"and w-what of the fleet?\"you ask while trying to get up only to fall.\"ashley!\"gek yelled grabbing you falling to the floor landing on top of you.\"g-gek,i-i,help m-\"is all your able to say before he kisses you(or what serves as a sanghilei kiss).feeling this you kiss him back and after  2 minutes you both get up off the floor and see lord hood starring at both of you.\"ah young love,i remember my first kiss,but there are places for that sort of thing yo know.\"he says.\"lord hood,i-i-i-\"  \"ill pretend this never happened if you both come to the celebration of the new year for your and receive the medals youve both earned for helping decimate those flood and covenant ships.\"he said \"sure thing,only i can not walk without assistance.\"you say. \"that was where gek stepped in front of you and said\"ill be your escort if that is ok with you.\" to which you say\"thank you old friend\"</span></div></div>",
            "created":1359712020,
            "id":1521632,
            "title":"ashley wakes up after the battle in an infirmery"
        },
        "1241211":{
            "author_id":"ashl3yfox",
            "author_name":"AshleyTheFox",
            "choices":[
                "a forerunner shield world",
                "an abandened prison ship near the debris field of the first halo ring"
            ],
            "content":"<div class=\"\"><div> <span>as you and gek stand on the human stage recieving your medals,you cant help but stare at gek.you try as hard as you can to distract yourself,but fail each time as you continue to stare at him.finally after what seems like an eternity gek is called up to receive his medal.but when they ask him to give a speech,he calls you up to the spot light he does the most unexpected thing youve ever seen him do,and thats saying something you spent your whole life growing up with him,you know him,and this scared you for you knew what he was going to ask.\"ashley you and i have been through a lot together and i was wondering if you would as the humans say marry me?\"gek said.a lot of the people gasped at this.\"oh gek...i-i dont know what to say.\"you said.\"how about yes?\"he replies \"yes,yes gek of course ill marry you!\"you finally say now in tears.after you said this there were a lot of people including lord hood who stood and aplauded their approval. 2 weeks later you have finally become geks wife and both of you have returned to the eternal corruption to once again lead your fleet.however lord hood had lied about giving you a squad of odsts and one spartan,instead he had given you a batallion of odsts,9 spartans designated as fireteam gamma,10,000 unsc weapons for each ship in your fleet plus 5,000 vehicles as well,along with those he had given you forerunner weapons from the 3rd halo ring that his science team recovered and had no use for.the forerunner weapons included light rifles,bolt shots,binary rifles,scatter shots,suppressers.and inceneration cannons.but it appears that lord hood had a light rifle painted just for you because one was wrapped and the card said\"wish you years of happiness. lord hood.\". upon opening it you discovered a pink light rifle with red hearts outlined in flames painted on.\"thank you lord hood,myy old friend.\"you say. with your new rifle on your back you step onto the bridge,receive a quick kiss from gek ,and begin your mission to investigate...........</span></div></div>",
            "created":1359807840,
            "id":1522468,
            "title":"the party"
        }
    },
    "info":{
        "author_id":"jedi42",
        "author_name":"Ishoam",
        "brief_description":"You command either a UNSC or Covenant ship both equiped with significent forces ",
        "created":1300869840,
        "description":"<td align=\"left\" class=\"norm\">this a story set in the halo universe keydecisions are made. your choice could kill millllions of innocient people or save an entire planet<br>\r\n<br>\r\nRules:<br>\r\nBe creative<br>\r\nminamum 4 sentance chapters unless it's a choice chapter<br>\r\nBe descriptive in all writing<br>\r\nhave fun and enjoy the story (this is my first one)<br>\r\nfor each chapter you add to my story I will add 2 to yours</td>",
        "id":1761870,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1359807840,
        "modified":1359807840,
        "pretty_title":"Halo, Behind The Scenes"
    }
}