{
    "chapters":{
        "1":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Clover",
                "Alex",
                "Sam",
                "Mandy",
                "Britney"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Witch one of the girls you wanna expand?</span></div></span></div>",
            "created":1260853200,
            "id":805910,
            "title":"Choose a girl"
        },
        "11":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Belly",
                "Breasts",
                "Body",
                "Muscels"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of expansion?</span></div></span></div>",
            "created":1260853200,
            "id":805911,
            "title":"Clover"
        },
        "111":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Inflation",
                "Preggo",
                "Weight Gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How shall it happen?</span></div></span></div>",
            "created":1260853200,
            "id":805918,
            "title":"Belly"
        },
        "1111":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Air",
                "Helium",
                "Water"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of inflation</span></div></span></div>",
            "created":1260853200,
            "id":805959,
            "title":"Inflation"
        },
        "11111":{
            "author_id":"thatkidron98",
            "author_name":"ronnyboy",
            "choices":[
                "She goes left and falls through the vent",
                "she goes right and continues sneaking through to Airhead's office"
            ],
            "content":"<div class=\"\"><div> <span>Clover was on a mission by herself, as Sam and Alex had recently come down with some sort of sickness. thus, it was up to Clover to stop the bad guy, someone calling themself \"Airhead\", and to do so she was currently sneaking into his base. \"Man, I gotta stop this person before he pops anymore women!\" she whispered, recalling how the briefing mentioned not only inflated women, but popped women. Worst off, they caused lots of property damage to Beverely Hills by inflating women really really massive then making them explode, destroying a lot of things.<br>\r\n<br>\r\nAs Clover kept sneaking, she came to a fork in the road...</span></div></div>",
            "created":1482728400,
            "id":2254446,
            "title":"Air"
        },
        "111111":{
            "author_id":"thatkidron98",
            "author_name":"ronnyboy",
            "choices":[
                "She begins expanding out of control",
                "Airhead finds her"
            ],
            "content":"<div class=\"\"><div> <span>Clover turned left and continued sneaking through the vent, at least until it collapsed and she went down with it. \"Woah!\" she yelped, smashing into a room full of boxes, and inside the boxes were little pills, a lot of which wound up falling into her mouth. She coughed and choked on them before swallowing, gasping for air.<br>\r\n<br>\r\n\"Ugh\" she moaned, clutching her tummy, which was rumbling violently all of the sudden...</span></div></div>",
            "created":1482728400,
            "id":2254447,
            "title":"She goes left and falls through the vent"
        },
        "1111111":{
            "author_id":"thatkidron98",
            "author_name":"ronnyboy",
            "choices":[
                "She keeps growing and breaks down the room",
                "She stops swelling after filling the room"
            ],
            "content":"<div class=\"\"><div> <span>\"What's that noise?\" Clover asked, her stomach beginning to swell out already, stretching her spy suit. \"Oh no!\" she cried, trying in vain to push her belly back as it began pushing boxes outward. \"S-Stop!\" she screamed, her suit already feeling tight. \"I-I'm growing humongo! S-So f-fast!\" she moaned, suit loudly stretching and tearing. Her belly was already the size of a car, and she was still growing faster. \"Oh boy!\"</span></div></div>",
            "created":1482728400,
            "id":2254462,
            "title":"She begins expanding out of control"
        },
        "11111112":{
            "author_id":"thatkidron98",
            "author_name":"ronnyboy",
            "choices":[
                "Airhead finds her",
                "She somehow swallows more pills"
            ],
            "content":"<div class=\"\"><div> <span>Clover screamed as she swelled bigger and bigger, boxes being shoved to the side as she rapidly blew outward. \"Stop!\" she yelled, feeling her belly stretched and grow, wider and fatter. She groaned as she felt herself press up against the walls, her belly already approaching the side of the entire room. \"St-Stop\" she yelled again, her belly gently pressing against the ceiling as the growth finally came to a stop. \"Uughh...\" she moaned, praying nobody had heard her...</span></div></div>",
            "created":1486443600,
            "id":2274560,
            "title":"She stops swelling after filling the room"
        },
        "111111122":{
            "author_id":"thatkidron98",
            "author_name":"ronnyboy",
            "choices":[
                "She stops growing after breaking down the whole factory",
                "Her belly bumps into Airhead's growth ray..."
            ],
            "content":"<div class=\"\"><div> <span>\"Ugh... Oh no!\" she yells, seeing a bunch of pills on her belly wobbling before falling down, into her mouth as she screams, feeling her belly surge and rumble as it billows outward, breaking the entire room down and swelling throughout the factory, growing bigger, and bigger, and even bigger!! She blushed as she felt people and guards get pinned underneath her ginormous gut as she felt her belly flesh filling room after room!</span></div></div>",
            "created":1487745960,
            "id":2280650,
            "title":"She somehow swallows more pills"
        },
        "11113":{
            "author_id":"hashiwana",
            "author_name":"SomeOtherUsername",
            "choices":[
                "in her mouth",
                "in her butt"
            ],
            "content":"<div class=\"\"><div> <span>Clover came home after a particularly exhausting mission and marched straight to the restroom. She stripped off her red jumpsuit and entered the shower. After cleaning herself she thought about the possibility of inflating herself. She admired her fit figure in the bathroom mirror before she unscrewed the shower head and put it...</span></div></div>",
            "created":1591554600,
            "id":2847502,
            "title":"Water"
        },
        "1112":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "It was Sam and Alex",
                "It was Britney",
                "It was Mandy"
            ],
            "content":"<div class=\"\"><div> <span>It was a sunny day at Beverlly Hills as Clover woke up with a soft yawn and streched in her bed. Sinse there weren't any missions, the three spies decided to take a break and just have a good life while they could. So while Sam and Alex were shopping Clover could just lay around the house and sleep. Slowly getting up the blond girl walked out of her room and heard the door bell ring \"Huh?\" Clover blinked as she opened the door to see that no one was there, except for a package standing infront of her. Blinking, Clover brought the box insied \"Stranger, I don't remember ordering anything\", she then opened the box and insied found a wierd looking device that seemed a mix between an Ipod and a remote control, on the side of the device Clover saw a label saying \"MP3\", the girl then grinned \"Wow...Strange new MP3, maybe it's a free gift from someone\" After that she pressed a green button witch she assumed was the start button. As she did that, the device turned around emiting a strange glow witch then scanned Clover from head to toes, and then turned off \"The hell was that?\" Clover looked at the device, she was abiut to press the button again, when she felt her stomach hurt alot. Placing her hand she felt her stomach bulge abit, after that she froze and gently moved her hands to make sure she wasn't mistaken. Her stomach did indeed bulge and it was slowly....Growing! Screaming her head off Clover dropped the device and looked down to see her once flat belly slowly growing and expanding, lifting up her nightgown and makeing the girl arch her back. Grunting and panting Clover rubbed her growing belly and then gasped when she felt a kick \"N-No...No way! I....I'm pregnant?! But...But how?!\" Just then it hit her, looking at the device she growled and with all her power kicked it across the corridor. Meanwhile her belly kept growing till it reached the size of her having twins, panting Cloverb rubbed her bare streched skin and she looked in the mirror \"This...This can't be happening! I can't be pregnant now! I didn't even have a boyfriend!\" Just then she heard a knock on the door \"Hold on! Just a minute!\" Clover answered as she waddled towards her room, and then returned in a bathrobe witch barely covered her expanded belly, after that she looked to see who it was.</span></div></div>",
            "created":1260853200,
            "id":805969,
            "title":"New gadget"
        },
        "11123":{
            "author_id":"warhammer10000",
            "author_name":"prego",
            "choices":[
                "Normal and there no school and WHOOP told them no mission.",
                "Really Pregnant and there is school and WHOOP told then no mission."
            ],
            "content":"<div class=\"\"><div> <span>It was Mandy and she was wearing a cheap trench coat, large hat and sunglasses.  I open the door and mandy ran in like she was on fire and she closes all the curtains.  Didn't even notice me like she ever does, she took off that ugly coat and my mouth was on the floor.  Mandy wearing a small top and she was pregnant too.  She look she was pregnant with 8 babies and ready to pop like a balloon.  <br>\r\n<br>\r\n\"Okay Clover don't do any pregnant jokes or I will suffercake you with my belly ok!\"  Mandy turn around to see my pregnant belly and she was happy.  <br>\r\n<br>\r\n\"Atleast I didn't get that free MP3 player.  You got one too huh?\"<br>\r\n<br>\r\nI nodded.<br>\r\n<br>\r\n\"Let get your mom to help us Mandy?\"<br>\r\n<br>\r\n\"Can't\"<br>\r\n<br>\r\n\"Why???\"<br>\r\n<br>\r\n\"She got MP3 player too and I try to help her and compare to me, I look I was normal.\"<br>\r\n<br>\r\nI had a image of Mandy mom ready to give birth to a whale or two.  Mandy sit on the couch, giggling like a school girl to a boy she like as she rubbing her belly, then she turn on the tv.<br>\r\n<br>\r\nIt was the new and the female reporter look like she swallowed a beanbag chair telling there was a outbreak of a tainted MP3 player that make woman pregnant with unknown number of babies.  Some bystanders were expose to the MP3 and they grow too and me with them said the reporter.  The pregnant victims are also acting strange like some woman are nasty and evil turn nice and sweet.  On very rare cases they can make the victim more pregnant by unknown reasons.  Then the report turn back to the station.  Then there was a knock on the door and it was Sam and Alex and they are....</span></div></div>",
            "created":1306040400,
            "id":1110913,
            "title":"It was Mandy, Clover wasn't alone in this."
        },
        "111232":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Suddenly Clover began to grow more",
                "Sam wants to learn more bout the MP3"
            ],
            "content":"<div class=\"\"><div> <span>In the door, Clover saw Alex and Sam who looked like they each swallowed a bigbag chair, both girls stared at Clover who stared back at them, eventually Sam was the one who broke the silence \"You too Clover?\" She asked as the blond rubbed her belly \"yeah, Mandy too\" She said pointing at the girl sitting on the couch, rubbing her belly slowly and defenatly was enjoying herself. The two blinked as they waddled inside \"Erm....Hey there Mandy...\"Alex said as she waved to the black haired girl who in return gave a sweet smile \"Hey there Alex, Sam!\" She said sweetly which made the trio blink rapidly as they looked at her blinking rapidly \"Ooookaaaay...Sooo..mmm...What are we gonna do about this?\" Clover asked as she pointed at everyone's bellies, Sam shrugged \"No clue, I tried to contact WHOOP, but no response.\" She said as Alex piped in \"Don't forget we still have school\" The trio swallowed hard as Clover looked at her belly \"Oh gawds, I'm gonna be called a fricking blimp\" She said with a whimper, when suddenly Mandy hugged from behind rubbing her belly slowly \"Oh don't be silly, I think you look fine Clover~\" She murred, making Clover blush deep red. Just then...</span></div></div>",
            "created":1306213200,
            "id":1112072,
            "title":"Really Pregnant and there is school and WHOOP t..."
        },
        "1112321":{
            "author_id":"warhammer10000",
            "author_name":"prego",
            "choices":[
                "Maternity workout to help the pregnant problems",
                "Normal gym workout"
            ],
            "content":"<div class=\"\"><div> <span>Clover pregnant belly started to expand and behind her Mandy using her new power to make her more pregnant and she wanted her belly for herself.  Mandy was using both of her hand rubbing Clover belly and wanting more to love her personal toy.  Alex and Sam was shock to see Clover belly was growing out of her bathrobe and the robe rip apart and she was naken she wanted to cover herself but with what?  For a moment she stop growing and she was bigger than Mandy.<br>\r\n<br>\r\n\"If any of you going to say anything about my pregnancy I will get up and I kill you.\"<br>\r\n<br>\r\nAlex and Sam look at each other swallowed really hard and they turn to Mandy.  But she was still rubbing Clover belly and she was enjoying it like catnip.  Mandy purring like a kitten, Alex and Sam was creeping them out alot.  Clover didn't care because she was enjoying it too.  Mandy get her cell phone and phone her famous fasion store.  Told the adress and they be there in a few minutes.  All three spies look at each other.<br>\r\n<br>\r\n\"I call a friend who does fasion with this MP3 crysis her business gone though the roof, no joke.  She will get us new clothes so we go to school.\"<br>\r\n<br>\r\nAll three friends don't know what worse can't call WHOOP, being really pregnant with how many babies.  Or the scarrest of all, Mandy being nice.<br>\r\n<br>\r\n<br>\r\n9:10 At School (Can't remember the name sorry)<br>\r\n<br>\r\nMost of the school was empty of guys because the girl didn't feel right of them acting wierd.  So the school board give the guys a few day off so they figual this whole pregnant thing out.  The hallway was full of pregnant girls and a few guys.  Then the front door open and walk in Alex, Sam, Clover and Mandy walk in in perfect form like a marching band do.  The fellow student lokk at them in shock and all.  Alex, Sam, Clover and Mandy look like they were fasion model.  So they went to Gym class and they gone to the woman locker room to change.  They came out in there custom fit Maternity gym clothes.  They took a while because Clover was getting rub by everyone in the locker room.  The female gym coach told them they doing....</span></div></div>",
            "created":1307768400,
            "id":1123923,
            "title":"Huge pregnant school trouble and belly rubbing fun"
        },
        "11123211":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Follow with Sam's idea",
                "Screw that, let's stay huge preggos instead"
            ],
            "content":"<div class=\"\"><div> <span>Special maternity work outs to help all the huge girls and some boys. AMong them were some light sit ups, belly rubs and some other activities. While everyone was working out, Clover blushed as she had Mandy really close to her.<br>\r\n<br>\r\n\"Heheh..Mandy, can you please gimme some space?\" The blond asked, then blushed getting Mandy flashing those big puppy eyes.<br>\r\n<br>\r\n\"Awwww....But I wanna pway with my huge balloon girl\" She whined adorably as she snuggled against Clovers belly, making the girl give a sigh of surrender.<br>\r\n<br>\r\nMeanwhile Sam was in deep thought, as she studied the MP3 player while Alex was busy giving herself a good belly massage.<br>\r\n<br>\r\n\"Sooo...Any ideas about this toy, Sammy?\" Alex asked, giggling at how huge and nice her belly felt.<br>\r\n<br>\r\nSam shook her head, as she then opened the device finding a strange chip inside, rubbing her belly in thought she then grinned.<br>\r\n<br>\r\n\"If I'm lucky, maybe we can try and follow up the signal from this device to see who's behind this~\"<br>\r\n<br>\r\nAs she said that, both Mandy and Clover waddled over. Looking at each other, they were thinking on their next course of actions</span></div></div>",
            "created":1491996480,
            "id":2303797,
            "title":"Maternity workout to help the pregnant problems"
        },
        "111232111":{
            "author_id":"warhammer10000",
            "author_name":"prego",
            "choices":[
                "I design the clothes for this exploration",
                "We should finish school first and do this afterwards."
            ],
            "content":"<div class=\"\"><div> <span>\"Please Sam don't take our pregnancy away.\"  Mandy showing Sam the same big puppy eyes that brought down Clover.<br>\r\n<br>\r\n\"Mandy.  This is a good idea.  What if we don't do this, we might give birth and I don't want to experience childbirth and telling my mom she a grandmother.  Do you want to experience childbirth Mandy?\"  Mandy thought of this and look at Clover pregnant belly and in her mind she married Clover and both holding hands while having their kids together.  Then the image became clear she was grinning in a pleasure thought and it creep out the three friends and thinking what weird or sick twisted things in her head.  Clover have a idea.<br>\r\n<br>\r\n\"Think about it Mandy.  If we find out who did this to us in the first place.  We could turn us back, but if we find a way to prevent our childbirth.  Then our belly could become bigger and bigger.\"  Clover whisper in Mandy face.  Many thought of Clover was she was in love.  If Clover have a bigger pregnancy she is more in love.<br>\r\n<br>\r\n\"Okay lets do this.  On one condition.\"<br>\r\n<br>\r\nAll three knew Mandy to realize she always have a condition.<br>\r\n<br>\r\n\"What that Mandy?\"  Alex said while she was rubbing her pregnant belly with both her hands.<br>\r\n<br>\r\n\"It that...\"</span></div></div>",
            "created":1505528880,
            "id":2386444,
            "title":"Following Sam's idea but Mandy have other plans."
        },
        "1112321111":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Follow Sam and Alex",
                "Follow Clover and Mandy."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm the one who'll get to design the clothes for this mission!\" Mandy exclaimed, flashing the widest grin.\"AND! Clover will be my model for this!\"<br>\r\n<br>\r\nBoth Sam and Alex looked at each other, but then gave an approving nod, making Mandy squee and snuggle Clovers belly in delight. The rest of the day went normal, well for the most part aside from some other students either getting bigger or swelling out. One the school day was over, Sam and Alex waddled to Sam's place to figure out more about the strange signal, while Mandy dragged Clover to do some shopping.</span></div></div>",
            "created":1506186540,
            "id":2390142,
            "title":"I design the clothes for this exploration"
        },
        "1113":{
            "choices":[
                "Recent break up",
                "Passion Patties again",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will she gain?</span></div></span></div>",
            "created":1363410000,
            "id":1551225,
            "title":"Weight Gain"
        },
        "112":{
            "author_id":"cobra55",
            "author_name":"h",
            "choices":[
                "C",
                "D",
                "Bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How big do they get?<br>\r\n</span></div></span></div>",
            "created":1292648400,
            "id":1017472,
            "title":"Breasts"
        },
        "1123":{
            "author_id":"cynderfan",
            "author_name":"Fan of Spyro",
            "choices":[
                "E",
                "F",
                "Bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok so how about a little bigger?</span></div></span></div>",
            "created":1485666000,
            "id":2270701,
            "title":"Bigger"
        },
        "11233":{
            "author_id":"yejdbdinsknsk8",
            "author_name":"Yejdbdinsknsk8",
            "choices":[
                "Yes "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about butt expansion?</span></div></span></div>",
            "created":1587670560,
            "id":2823308,
            "title":"Butt expansion"
        },
        "113":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Inflation",
                "Weight Gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will her body expand</span></div></span></div>",
            "created":1260853200,
            "id":805963,
            "title":"Body"
        },
        "1131":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Body",
                "Breast ",
                "Belly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of body part of clover to inflation?</span></div></span></div>",
            "created":1292994000,
            "id":1020102,
            "title":"Inflation"
        },
        "11311":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of body expansion for clover?</span></div></span></div>",
            "created":1292994000,
            "id":1020106,
            "title":"Body"
        },
        "113112":{
            "author_id":"yamatomasta",
            "author_name":"yamatomasta",
            "choices":[
                "Ass",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about ass expansion?</span></div></span></div>",
            "created":1444107600,
            "id":2044424,
            "title":"More"
        },
        "1131121":{
            "author_id":"yejdbdinsknsk8",
            "author_name":"Yejdbdinsknsk8",
            "choices":[
                "A Malfunction Of One Of Jerry's new Inventions",
                "While Fighting A Expansion-Based Villain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How Did Clover Get Such a Huge and Sexy Ass?</span></div></span></div>",
            "created":1595030460,
            "id":2870681,
            "title":"Ass"
        },
        "1132":{
            "author_id":"demongod18",
            "author_name":"DemonGod18",
            "choices":[
                "Passion Patties Alternate Ending",
                "Force feeding",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she gain?</span></div></span></div>",
            "created":1505359080,
            "id":2385300,
            "title":"Weight Gain"
        },
        "11323":{
            "author_id":"bou53leau",
            "author_name":"P'titloup",
            "choices":[
                "The bracelet",
                "The machine",
                "other scenario"
            ],
            "content":"<div class=\"\"><div> <span>Clover is located on WOOPS premises, where the agency stores various obsolete or failed gadgets and inventions, and where it should not be. If she was there, it was to find something that could make her quickly lose the excess weight she had obtained recently. Finally, she got her hands on two things that could solve her problem;<br>\r\n<br>\r\nThe first was a bracelet to lighten the body and absorb the fat consumed, just to a certain limit. But it draws the energy for its functioning directly from that of the body of its wearer, which in the long term stimulates more than necessary the appetite of the wearer.<br>\r\n<br>\r\nThe second was a machine, too large and too heavy to be transported and exfiltrated. This machine allows its user to develop his musculature or body measurements by repositioning the fat in his body. But in the long run, the body eventually returns to its original shape.<br>\r\n<br>\r\n<br>\r\nWhat will Clover choose, the bracelet or the machine?</span></div></div>",
            "created":1582759980,
            "id":2793453,
            "title":"Weight Gain #2"
        },
        "12":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Belly",
                "Breasts",
                "Body",
                "Muscels"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of expansion</span></div></span></div>",
            "created":1260853200,
            "id":805912,
            "title":"Alex"
        },
        "121":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Inflation",
                "Preggo",
                "Weight Gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will her belly expand?</span></div></span></div>",
            "created":1260853200,
            "id":805920,
            "title":"Belly"
        },
        "1211":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Air",
                "Helium",
                "Water"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of inflation</span></div></span></div>",
            "created":1260853200,
            "id":805957,
            "title":"Inflation"
        },
        "12113":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "in her mouth",
                "up her butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alex was relaxing by the pool one day and thought what it would feel like to have a belly full of water. So she went over to the hose and put it...</span></div></span></div>",
            "created":1315717200,
            "id":1185499,
            "title":"Water"
        },
        "121131":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "her belly became to big to stand",
                "her belly burst"
            ],
            "content":"<div class=\"\"><div> <span>Her mouth. She opened the valve half way and let the water flow through her throught down to her belly. She can feel the water filling her belly and soon pressing out word. She really liked it and opened the valve all the way. She felt the cool water rushing through her anf expanding her belly bigger and bigger and bigger. She wanted more water flowing into her belly. So she went and found another hose, put it in her mouth and turned it on all the away. She felt her belly grow faster than before. Soon...</span></div></div>",
            "created":1315717200,
            "id":1185504,
            "title":"in her mouth"
        },
        "1211312":{
            "choices":[
                "Respawn",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her belly grew to the point were it couldn't hold anymore and then there was a boom with blood, guts and water all over the floor. She is now dead. Do you wish to respawn her?</span></div></span></div>",
            "created":1315717200,
            "id":1185620,
            "title":"her belly burst"
        },
        "12113121":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "She grabes another hose",
                "Her belly bursts"
            ],
            "content":"<div class=\"\"><div> <span>Alex then woke up from her dream and realized it was a dream. She then thought she would really try to inflate her belly with water. So she went and put 2 hoses in her mouth and turn them on high. She felt the jeting water filling her belly with water. It started to push outward at a fast rate. Her belly started to get really heavy and she started to lean forward due to the weight. </span></div></div>",
            "created":1315717200,
            "id":1185641,
            "title":"Respawn"
        },
        "121131211":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "She bursts"
            ],
            "content":"<div class=\"\"><div> <span>Then Alex grabs another hose and puts it in her mouth. She turns it on high and her belly starts to grow faster. Soon her belly starts to slow more slowly by the second. Then her belly stops growing and she felt a lot of pain in her belly and shut the water of right before she was at popping point.<br>\r\n<br>\r\n\"That was close.\" Alex said. 'But what am I going to with all of this water in my belly.\"<br>\r\n<br>\r\nBy now, her belly was as big as her bed. She thought for a second and then put one of the hoses back in her mouth and then opened the valve to half way. Her belly grew untill it was at its limit. Instead of bursting, her belly continued growing. She started to fell a very sharp pain in her belly like she was going to burst at any second. Instead of bursting, her breast started to grow. Her breast grew until her bakini top reached its limits.</span></div></div>",
            "created":1315717200,
            "id":1185652,
            "title":"She grabes another hose"
        },
        "1211312111":{
            "choices":[
                "She uses a gadget to get the other hose into her mouth",
                "She uses a gadget to get two more hoses into her mouth"
            ],
            "content":"<div class=\"\"><div> <span>She heard three snaps and felt a small pain on her back. Alex bra snapped and she was feeling to much pleasure in her to care. She liked the feel of having water in her so much that she increased the flow of water to the maximum the hose could possibly dish out.<br>\r\n<br>\r\n\"OMG! this f*cking feels amazing!\" she wanted to say aloud. Having not been satisfied still she put another hose in her mouth and cranked it half way. Her body was filling faster and she looked mega pregnant. Her weight was so that she had to collapse on the ground. Pleasure took out the pain immediately. She slid her hand on to the knob of the second hose and cranked it to maximum. She was in more and more pleasure as she was expanding.</span></div></div>",
            "created":1315803600,
            "id":1186169,
            "title":"She bursts"
        },
        "12113121112":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "They put 4 hoses in their mouths",
                "Put 6 hoses in Alex and hope she becomes a blimp"
            ],
            "content":"<div class=\"\"><div> <span>Then Alex got a gadget that allowed her to put 2 more hoses into her mouth. She turned the hoses on high and was again in pleasure of the expansion. She then she thought that she shouldn't keep all the pleasure of water inflation to herself so she called Sam and Clover to come out and try expanding there bodies with water as well. They came out and put a hose in their mouths and turn the water on. At that time, Alex turned the water off of her hoses and watched Sam and Clover expand from the water.</span></div></div>",
            "created":1320382800,
            "id":1218095,
            "title":"She uses a gadget to get two more hoses into he..."
        },
        "121131211121":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "They go to a bigger, more wide open area",
                "The girls get called onto a mission"
            ],
            "content":"<div class=\"\"><div> <span>Sam and Clover thought that they don't want Alex to have all the fun being big and all. So they took the hoses out of her mouth before Alex got an idea for their clothes.<br>\r\n<br>\r\n\"How about we change into our spy clothes so we don't have to worry about clothes.\" Alex said.<br>\r\n<br>\r\n\"Don't they have limits?\" Clover asked.<br>\r\n<br>\r\n\"No they are elastic and can stretch with out bodies.\" Sam said.<br>\r\n<br>\r\nThey changed into their spy clothes before continue on. Sam and Clover left Alex out for now so they can become as big as her. They put 4 hoses into their mouths and turned them on high. They filled their bodies up until they were as big as Alex. Then Alex put 4 hoses into her mouth and turned the water on.</span></div></div>",
            "created":1403845200,
            "id":1818376,
            "title":"They put 4 hoses in their mouths"
        },
        "121131211122":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "Alex doubles in size",
                "Alex bursts"
            ],
            "content":"<div class=\"\"><div> <span>Sam and Clover turned their hoses off and put them into Alex's mouth and turned them back on. Then they put 4 more hoses into Alex's mouth and turned them on. Her belly started to expand again and she put her hands on her belly. Alex had to sit down because her belly was getting very heavy from all of the water in it and flowing into it. The 6 hoses weren't open all the way and so Sam and Clover turned them on all the way. Soon the rest of Alex's body started to expand. It took 30 minutes for Alex to be filled with 5000 galloons of water. She now looks like a full grown elephant. But it took 2 hours before Alex became the blimp Sam and Clover want her to be. But they didn't stop their.</span></div></div>",
            "created":1324011600,
            "id":1241099,
            "title":"Put 6 hoses in Alex and hope she becomes a blimp"
        },
        "1211312111221":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "Fill herself up with more water",
                "Fill Clover up with more water"
            ],
            "content":"<div class=\"\"><div> <span>Sam and Clover dettached the water pump from their pool and put the hose up Alexs butt. Alex's bakini started to get tight on her fast expanding body. By now Alexs arms and legs had shrink back into her body and she looked like a giant waterballoon with a head, hands and feet. Sam and Clover turned to pump off and shut the hoses off and removed them from Alex.<br>\r\n<br>\r\n\"Wow Alex, you are REALLY big.\" Clover said.<br>\r\n<br>\r\n\"Yeah and you look like you could burst at any second if we continued inflating you.\" Sam said.<br>\r\n<br>\r\n\"Really girls. Now, how do we make me smaller?\" Alex asked.<br>\r\n<br>\r\nThey thought for a second until Sam came up with and idea.</span></div></div>",
            "created":1325134800,
            "id":1248811,
            "title":"Alex doubles in size"
        },
        "12113121112211":{
            "author_id":"cynderfan",
            "author_name":"Fan of Spyro",
            "choices":[
                "The girls grow to the same size",
                "They grow so that each of the girls' boobs fill the room they're in four times"
            ],
            "content":"<div class=\"\"><div> <span>Eight hoses in all three of the girls' mouths and two in each of their butts Sam and Clover turned all the water to maximum. They each grew so fast that by the time they were done they were far too big to move. Laying on their bellies - each big enough to hold three oversized adult elephants and have ample room to spare - they just stared at each other happily.<br>\r\n<br>\r\n\"So wait...\" Alex started. \"How does this make me smaller? If anything I'm far too big to see either of you without anything in the way.\"<br>\r\n<br>\r\n\"It doesn't, Alex.\" Sam said. \"We just wanted to see ourselves too big to see clearly.\"<br>\r\n<br>\r\n\"It also feels amazing being so big. I don't want to reverse it, just make myself bigger.\" Clover added. \"At least big enough to meet your size.\"<br>\r\n<br>\r\n\"Cheers for our size and to more growing!\"</span></div></div>",
            "created":1392699600,
            "id":1747873,
            "title":"Everyone fills with more water"
        },
        "121131211122111":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "The girls expand to their limits",
                "They fill their bodies to their limits and pop one by one"
            ],
            "content":"<div class=\"\"><div> <span>Then Sam and Clover wanted to grow bigger so that they are all the same size. They turned the water on to their hoses and felt the water filling their bellies up again. They wanted to become as big as Alex to make her feel a bit better.<br>\r\n<br>\r\nWhen they were all the same size, Sam and Clover turned the water off.<br>\r\n<br>\r\n\"How do you like us now?\" Sam asked Alex.<br>\r\n<br>\r\n\"Not much better. I'm still a giant blimp balloon girl.\" Alex said.<br>\r\n<br>\r\n\"Well we tried to make you feel better by risking our lives by becoming the same size as you.\" Clover said.<br>\r\n<br>\r\n\"I thought of something Clover.\"<br>\r\n<br>\r\n\"What is it Sam?\"<br>\r\n<br>\r\n\"How about me and you become bigger than Alex so she feels smaller.\"<br>\r\n<br>\r\n\"Lets do it.\"<br>\r\n<br>\r\nThey put their 8 hoses back into their mouths and started the water. They slowly continued to expand bigger and bigger. Sam and Clover continue to expand bigger until they were about 20 feet bigger around than Alex. They turned the water off and looked at Alex.<br>\r\n<br>\r\n\"Feel any small now we are bigger than you Alex?\" Sam asked.<br>\r\n<br>\r\n\"A little bit but now you 2 are having more fun at your size.\" Alex said.<br>\r\n<br>\r\n\"Well, fill yourself up bigger and join us.\" Clover said.<br>\r\n<br>\r\nAlex put her 8 hoses back into her mouth and opened the valves. She kept them on until she was the same size as Sam and Clover.</span></div></div>",
            "created":1394946000,
            "id":1761600,
            "title":"The girls grow to the same size"
        },
        "1211312111221111":{
            "author_id":"cynderfan",
            "author_name":"Fan of Spyro",
            "choices":[
                "The girls grow to their true limits",
                "The girls expand just beyond their true limits"
            ],
            "content":"<div class=\"\"><div> <span>\"Eh you know I'm happy being big. Hell I'm even willing to say I want to max on size. Who's with me?\" Alex said.<br>\r\n<br>\r\n\"We're both in with ya, Alex.\" Clover said.<br>\r\n<br>\r\nThe girls turned the hoses back on and they filled some more. Busting through the walls they wedge between some of the other buildings. After they felt they couldn't take any more they stopped filling.<br>\r\n<br>\r\n\"Well this is... Interesting now how do you think we'll be able to hold any more?\" Sam asked. \"I mean look at us we're filled to our limits.\"<br>\r\n<br>\r\n\"Limits? Well maybe our heads' limits but are you sure we're at our true limits?\" Clover asked.<br>\r\n<br>\r\n\"She's got a point, Sam. Maybe our limits are larger than we imagine them to be.\"<br>\r\n<br>\r\n\"Maybe...\"</span></div></div>",
            "created":1394946000,
            "id":1761636,
            "title":"Only limited"
        },
        "12113121112211111":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "The water came gushing out",
                "They drink a lake dry and burst"
            ],
            "content":"<div class=\"\"><div> <span>\"We could keep going to our true limits.\" Clover said.<br>\r\n<br>\r\nThe girls put the hoses back into their mouths and started the water. They continued to expand and ended up destroying the buildings around them. Clover then felt her body reach her true limits. She turned her water off and took her hose out.<br>\r\n<br>\r\n\"That's one down, one redhead to go.\" Alex thought to herself.<br>\r\n<br>\r\n\"If that's her true limits, I wonder if mined and Alex's true limits are.\" Sam thought.<br>\r\n<br>\r\nThey kept going until Alex was at hers. Alex turned her water off and took her hose out. Alex and Clover looked at Sam and watched her grow.<br>\r\n<br>\r\n\"You can do it Sammie!\" Clover said.<br>\r\n<br>\r\n\"Yeah, you can do it Sammie!\" Alex said.<br>\r\n<br>\r\nSam looked at her 2 roommates and smiled at them. Soon, she could feel her body getting closer to its true limits. She didn't want to stop for she wants to be massive. She figured that since she is the leader of the 3, she has to be the biggest of them.<br>\r\n<br>\r\n\"Just hold on a little more Sam, your almost there.\" Sam thought to herself.<br>\r\n<br>\r\nJust when she had reached her limits, Sam turned her water off. She looked down at her friends and noticed how much bigger she is compared to them. She guessed she had to be at least twice as big as Alex and nearly 3 times bigger than Clover.<br>\r\n<br>\r\n\"How do you feel Sam?\" Clover asked her.<br>\r\n<br>\r\n\"I feel like a giant water balloon that's ready to explode.\" Sam said.<br>\r\n<br>\r\n\"Want us to try and become as big as you?\" Alex asked.<br>\r\n<br>\r\n\"I wouldn't if I were you. Both of you are big enough, my size is too big and the water I have is to much to handle.\"<br>\r\n<br>\r\nThe girls looked around them and saw that they had destroyed to much of the city so they decided to go to a large field. Due to her large size, Sam was the only one who couldn't walk, or waddle in their current state, to the field. Clover and Alex did their best to roll her to the field.<br>\r\n<br>\r\nOnce there...</span></div></div>",
            "created":1401253200,
            "id":1803880,
            "title":"The girls grow to their true limits"
        },
        "1212":{
            "choices":[
                "one of the others somehow gets inside her",
                "pills",
                "randomly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how will she be impregnated?</span></div></span></div>",
            "created":1310014800,
            "id":1142386,
            "title":"Preggo"
        },
        "12121":{
            "author_id":"drakong",
            "author_name":"Drakang",
            "choices":[
                "Accident with some gadget",
                "A villain put them here or they got stuck inside after beating it."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How did this happen ?</span></div></span></div>",
            "created":1414472400,
            "id":1878676,
            "title":"one of the others somehow gets inside her"
        },
        "121211":{
            "author_id":"drakong",
            "author_name":"Drakang",
            "choices":[
                "Alex as she try fo find a solution/help.",
                "Sam and Clover try to find a solution on their own."
            ],
            "content":"<div class=\"\"><div> <span>Sam, Alex and Clover where exploring the Whoop building for gadget that could be useful for their next mission until they stumbled across something that looked like an old teleporter.<br>\r\n\"Oh... look a teleporter do you think it still work ?\" said Alex<br>\r\n\"It look old\" said Clover<br>\r\n\"Well if it's here that's probably that it doesn't work\" said Sam<br>\r\n\"If think it's plugged in there some light what if I pushed button\" said Alex when she pushed the button<br>\r\n\"No don't...\" said Sam as she vanished with Clover<br>\r\nPanicked Alex try to find out that they were shrunk and in her womb and there was a risk that her womb will accept them as her babies and unshrink them.<br>\r\nWho do you follow ?</span></div></div>",
            "created":1414472400,
            "id":1878681,
            "title":"Accident with some gadget"
        },
        "121212":{
            "author_id":"drakong",
            "author_name":"Drakang",
            "choices":[
                "A villain put them inside Alex",
                "They got stuck in her womb after beating a villain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one is it ?</span></div></span></div>",
            "created":1414472400,
            "id":1878677,
            "title":"A villain put them here or they got stuck insid..."
        },
        "1212121":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Brainwashes Alex to think she's been super preggers and lives a normal life",
                "Make Alex perma preg, so her friends can't escape."
            ],
            "content":"<div class=\"\"><div> <span>Alex grunted a she struggled against the binds, as she was strapped to a table and nekid, with her legs spread wide open. Of all the ways to be captured, it had to involve the dumbest one which was Alex getting knocked out by a large mallet, and when she woke up she found herself nekid and displayed in a large room with a massive screen before her eyes, and a pair of doors under them.<br>\r\n<br>\r\nThen, the screen came to life and Alex saw Dr.Bittersweet grinning maniacally to the black spy as Alex scolwed back.<br>\r\n<br>\r\n\"Bittersweet, I should have known...\" Alex growled, while wondering where her friends were and why weren't they saving her butt.<br>\r\n<br>\r\n\"Aaah, I see you have woken up, good. Very good even, means we can begin my little experiment, I'm guessing you are wondering WHY your friends haven't come to your aid yet.\" Bittersweet murmured, trying to control herself so not to sound insane.<br>\r\n<br>\r\nJust then, the door opened and Alex gasped as she saw two big bellied females drag Sam and Clover, who were also tied up and nekkid, which made ALex flush red.<br>\r\n<br>\r\n\"W-W-What are you gonna do with us?!\" Alex asked, as she kept struggling, while Bittersweet let out a loud mad laughter.<br>\r\n<br>\r\n\"Oh, you're about to see my dear~\" She murmured softly, as she nodded to one of her minions who brought Clover forward.<br>\r\n<br>\r\nAt first, Alex didn't understand what was going on, but as soon as Clovers head was shoved in her womanhood, Alex let out a deep pleasure filled moan. A part of her wanted to fight this, but another one was trying to shut off the voice of panic, as her friend went in deeper, Alex gave another howl of pleasure as she watch her belly rize and grow before her very own eyes, as Sam eyed this with shock, while Bittersweet looked quite pleased. When Clover vanished inside Alexe's womanhood, the black spy looked at her huge belly, her tongue out as she panted heavily. Every part of her body felt hawt and  very good by this experience, as she couldn't even think straight. Bittersweet then snapped her fingers, as Sam was next to go inside as Alex began once more to howl and cry from pleasure.</span></div></div>",
            "created":1414472400,
            "id":1878689,
            "title":"A villain put them inside Alex"
        },
        "12121212":{
            "author_id":"drakong",
            "author_name":"Drakang",
            "choices":[
                "Alex managed to escape.",
                "Britney arrive to help."
            ],
            "content":"<div class=\"\"><div> <span>\"And now for the final touch the perma-preg serum\" Said Bittersweet<br>\r\n\"Such a shame you won't be around to enjoy your huge belly\" said Bittersweet as she rubbed Alex belly \"Because of you I now have to find a better hideout and I don't think you strong enough too escape, so bye\" She then set the time on a bomb before running away with her goons...</span></div></div>",
            "created":1414818000,
            "id":1880200,
            "title":"Make Alex perma preg, so her friends can't ..."
        },
        "121212122":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Alex actually wants to stay like this.",
                "Find an antidote for her"
            ],
            "content":"<div class=\"\"><div> <span>\"O-Oh no..T-This is over..I...I..I'm done for!\" Alex exclaimed as she watched the timer on the bomb tick off.<br>\r\n<br>\r\nThen, she felt both her friends kick and move inside her, which made the girl blush but gave her some comfort knowing she won't be alone when the bomb goes off. But then, the top of the dome shattered as she saw Britney descend down, making Alex smile knowing that she wasn't gonna die. Upon seeing Alex, Britney went wide eyed as she pointed at the girls massive belly.<br>\r\n<br>\r\n\"EXPLAIN LATER! BOMB! NOT MUCH TIME!\" Alex reminded Britney, who snapped back to her thoughts and rushed to disarm the bomb.<br>\r\n<br>\r\nWhen the bomb was dealt with, Britney helped Alex out of her binds, her eyes still glued to the girls massive belly. Getting up from the table, Alex meeped as she nearly fell back and quickly had to arch her back to accommodate for newly added weight.Blushing deep red, she gently patted her belly as she saw that Britney was waiting for an explanation.<br>\r\n<br>\r\n\"Umm..W-Well..umm...I..I'm kinda..p-perm..p..preg with..-Sam and Clover...\" She explained, stammering as she knew how just insane that whole thing sounded.<br>\r\n<br>\r\nThen again, when ever did these girls have a normal day happen. Britney slowly nodded her head, as she placed her ear to Alex's belly, as the black girl blushed feeling a strange amount of delight in Britney so close to her belly, and actually being this huge and swollen. It was hard to explain, but it felt simply perfect to the black spy.<br>\r\n<br>\r\n\"S-So, what are we gonna do?\" Britney asked, while her hands gently caressed Alex's belly.</span></div></div>",
            "created":1414990800,
            "id":1880940,
            "title":"Britney arrive to help."
        },
        "122":{
            "choices":[
                "Breast milk",
                "Water",
                "An unknown liquid"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How should her breasts expand?</span></div></span></div>",
            "created":1297659600,
            "id":1054166,
            "title":"Breasts"
        },
        "1221":{
            "choices":[
                "Puberty kicks in.",
                "A new Woohp gadget malfunctions.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does this happen?</span></div></span></div>",
            "created":1339390800,
            "id":1357674,
            "title":"Before we start..."
        },
        "12213":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "On the job expansion.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is she expanded during a mission?</span></div></span></div>",
            "created":1403067600,
            "id":1814090,
            "title":"Something else."
        },
        "122131":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Hucow...",
                "Hucow...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The team runs into a Villain that loves Hucows.<br>\r\n<br>\r\nA Hucow: <a rel=\"nofollow\" href=\"http://i33.fastpic.ru/big/2017/0515/d9/471cb66eb9163be127ac0963ccc5d6d9.jpg\" target=\"_blank\">http://i33.fastpic.ru/big/2017/0515/d9/4...</a></span></div></span></div>",
            "created":1543549140,
            "id":2583766,
            "title":"On the job expansion."
        },
        "123":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Inflation",
                "Weight Gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will her body expand</span></div></span></div>",
            "created":1260853200,
            "id":805962,
            "title":"Body"
        },
        "1231":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Body",
                "Belly",
                "Breast"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick an body part that you want to inflation on Alex.</span></div></span></div>",
            "created":1292994000,
            "id":1020105,
            "title":"Inflation"
        },
        "12311":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry Alex",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here a Blueberry expansion for Alex. Or choose a another body expansion for Alex.</span></div></span></div>",
            "created":1292994000,
            "id":1020109,
            "title":"Body"
        },
        "123112":{
            "author_id":"thatkidron98",
            "author_name":"ronnyboy",
            "choices":[
                "Air",
                "Water"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe she becomes a hot air balloon? Or a waterballoon?</span></div></span></div>",
            "created":1486443960,
            "id":2274566,
            "title":"More"
        },
        "12313":{
            "author_id":"yejdbdinsknsk8",
            "author_name":"Yejdbdinsknsk8",
            "choices":[
                "Ass Expansion Please!",
                "Breast Expansion if you must..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do You want A Breast Expansion or a Ass Expansion For Alex?</span></div></span></div>",
            "created":1595030940,
            "id":2870685,
            "title":"Breast or Ass?"
        },
        "13":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Belly",
                "Breasts",
                "Body",
                "Muscels"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of expansion?</span></div></span></div>",
            "created":1260853200,
            "id":805914,
            "title":"Sam"
        },
        "131":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Inflation",
                "Preggo",
                "Weight Gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will her belly expand?</span></div></span></div>",
            "created":1260853200,
            "id":805921,
            "title":"Belly"
        },
        "1311":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Air",
                "Helium",
                "Water"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of inflation</span></div></span></div>",
            "created":1260853200,
            "id":805956,
            "title":"Inflation"
        },
        "13112":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "Her butt started to grow",
                "She bursts"
            ],
            "content":"<div class=\"\"><div> <span>Sam was relaxing on the couch watching tv when the doorbell rang. She went to the door and no one was there. But there were 4 helium tanks instead. She brought them in and thought of what to do with them. Then Sam desided to inflate her self with them. She put the hose of the first tank in her mouth and open the valve half way. The helium flow through her throut and into her belly. It took 5 minutes before the helium started to expand her belly. She then opened it to full and the helium rushed through her. She felt very light and started to floot. Her breasts started to inflate when she hit the celling. She tried to rap her arms around her belly but it was to big.</span></div></div>",
            "created":1316235600,
            "id":1189260,
            "title":"Helium"
        },
        "131122":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "content":"<div class=\"\"><div> <span>Sam was enjoying her inflation experience untill she started to hear her body begin to creak. She tried to get the hose out of her mouth but her breasts were to big for her to reach her mouth. Then Alex walked into the room and saw Sam inflating herself and was about to burst.<br>\r\n<br>\r\n\"What happened to you, Sammy?\" Alex asked.<br>\r\n<br>\r\n\"These helium tanks were at the door and I wanted to inflate my self with them. But I am getting to big to use them all. Help me Alex.\" Sam said.<br>\r\n<br>\r\nAlex thought and decided to put another hose in Sams mouth and opened the valve al the way. Sam started to expand faster and faster. Then she reached her limit.<br>\r\n<br>\r\nBAAAAAAAANNNNNNNNGGGGGG!!!!!!!!!!<br>\r\n<br>\r\nSam had finaly burst from being over inflated.</span></div></div>",
            "created":1316926800,
            "id":1194957,
            "title":"She bursts"
        },
        "1312":{
            "author_id":"yamatomasta",
            "author_name":"yamatomasta",
            "choices":[
                "Victim of a new villain",
                "Accident with a WHOOP device"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does it happen?</span></div></span></div>",
            "created":1327035600,
            "id":1262295,
            "title":"Preggo"
        },
        "132":{
            "author_id":"stardustmaster",
            "author_name":"dragonblaster10000",
            "choices":[
                "Breast milk",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does this happen?</span></div></span></div>",
            "created":1497198420,
            "id":2334315,
            "title":"Breasts"
        },
        "1321":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Evil villain...",
                "WHOOP Experiment...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why does this happen to sam?</span></div></span></div>",
            "created":1543548420,
            "id":2583763,
            "title":"Breast milk"
        },
        "133":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Inflation",
                "Weight Gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will her body expand</span></div></span></div>",
            "created":1260853200,
            "id":805961,
            "title":"Body"
        },
        "1331":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Body",
                "Belly",
                "Breast"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a body part that you want to inflation on Sam.</span></div></span></div>",
            "created":1292994000,
            "id":1020104,
            "title":"Inflation"
        },
        "13311":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry sam",
                "More body expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here a blueberry expansion for Sam. Or choose a next body expansion.</span></div></span></div>",
            "created":1292994000,
            "id":1020108,
            "title":"Body"
        },
        "133112":{
            "author_id":"yejdbdinsknsk8",
            "author_name":"Yejdbdinsknsk8",
            "choices":[
                "Yes please",
                "Next!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How About Ass Expansion,Lets see Sam With A Big Ass</span></div></span></div>",
            "created":1595030760,
            "id":2870683,
            "title":"Ass Expansion"
        },
        "1332":{
            "author_id":"benz02",
            "author_name":"HedgeOvrlrd",
            "choices":[
                "  It was, and they whisk her away to some strange island",
                " It's a cute boy Sam had never met",
                " It's a cute boy Sam had never met"
            ],
            "content":"<div class=\"\"><div> <span>It was another warm day in LA and Sam of the Beverly Hill's Totally Spies was in her apartment, lounging on the couch and watching some daytime drama while she snacked on potato chips.<br>\r\n<br>\r\nThe brainy spy's slothful actions weren't voluntary however, but a part of a special mission. <br>\r\n<br>\r\nJerry had informed her, Alex, and Clover that some strange white vans had been going all over the nation, kidnapping larger women.<br>\r\n<br>\r\nThe spies' mission was to figure out who they were and what they were up to. So far, whenever they tried to tail a one of the vans, they literally disapeared somehow.<br>\r\n<br>\r\nApparently, the only way they could catch them would be if one of them became a bigger woman. They drew straws to find out who would fatten up, and Sam drew the longest straw.<br>\r\n<br>\r\nSo after two months of intensive snacking, gorging, and forced naps, Sam had grown to a whopping 194 lbs.<br>\r\n<br>\r\nShe had a spare tire gut and chubby cheeks. Her breasts and but had grown, but only in proportion to the rest of her body, making her look like a big, pudgier version of herself.<br>\r\n<br>\r\nFinally, while she reached a meaty hand into the nearly empty bag of chips, her doorbell rang.<br>\r\n<br>\r\nGetting ready in case it was the kidnappers, Sam waddled to the door, when she opened it was...</span></div></div>",
            "created":1294462800,
            "id":1031322,
            "title":"Pudgy: Sam's big mission"
        },
        "14":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Belly",
                "Breasts",
                "Body",
                "Muscels"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of expansion?</span></div></span></div>",
            "created":1260853200,
            "id":805916,
            "title":"Mandy"
        },
        "141":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Inflation",
                "Preggo",
                "Weight Gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will her belly expand?</span></div></span></div>",
            "created":1260853200,
            "id":805922,
            "title":"Belly"
        },
        "1411":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Air",
                "Helium",
                "Water"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of inflation</span></div></span></div>",
            "created":1260853200,
            "id":805955,
            "title":"Inflation"
        },
        "1412":{
            "author_id":"yamatomasta",
            "author_name":"yamatomasta",
            "choices":[
                "Victim of a Supervillian's rampage",
                "Victim of WHOOP tech",
                "Her own choice (But how?)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will it be done to her?</span></div></span></div>",
            "created":1327035600,
            "id":1262569,
            "title":"Preggo"
        },
        "14122":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Decides to make herself bigger",
                "Chooses setting \"Preggo forever\""
            ],
            "content":"<div class=\"\"><div> <span>Mandy grumbeled, as she paced back and forth around her room. She was waiting for almost four weeks, for her new gadget to arrive, which was a new phone model, which would make her popular once again. But so far, it didn't come.<br>\r\n<br>\r\n\"Ugh, I swear I'll sue the postal service one of these days...\" She growled to herself, just when she heard the doorbell ring. Quickly rushing towards it, she opened the door an saw a package waiting for her. Letting out a squeel, Mandy quickly tore it open and pulled out what seemed your average smartphone. Grinning to herself, the spoiled girl quickly turned it on and then blinked a the weird setting it had. Scratching her head, she then pushed a random button when suddenly what she considered the front camera, fired a lazer beam right into her middle.<br>\r\n<br>\r\nMeeping, Mandy dropped the device as she looked down \"What kind of phone does that?!\"\" She exclaimed, and then gasped and froze as she suddenly saw her stomach starting to balloon and push out slowly.<br>\r\n<br>\r\n\"I'm getting fat?!\" She yelled, as she tried to push it back in, but gasped at it felt much more firmer. When her stomach stopped at the size of triplets, with Many having to arch her back, she picked up the phone an saw what it said \"Preggo transformation complete.\" Then bellow it said \"Bigger\" and \"Preggo forever.\"</span></div></div>",
            "created":1394686800,
            "id":1759733,
            "title":"Victim of WHOOP tech"
        },
        "142":{
            "choices":[
                "Side effect of a new gadget from WOOHP,",
                "A delivery from a bad guy.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Mandy get bigger boobs?</span></div></span></div>",
            "created":1333170000,
            "id":1306524,
            "title":"Mandy's bigger boobs."
        },
        "143":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Inflation",
                "Weight Gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will her body expand</span></div></span></div>",
            "created":1260853200,
            "id":805960,
            "title":"Body"
        },
        "1431":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Belly",
                "Body",
                "Breast"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a body part that you want to inflation for mandy?</span></div></span></div>",
            "created":1292994000,
            "id":1020103,
            "title":"Inflation"
        },
        "14312":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whick kind of body expansion for mandy?</span></div></span></div>",
            "created":1292994000,
            "id":1020107,
            "title":"Body"
        },
        "143122":{
            "author_id":"thatkidron98",
            "author_name":"ronnyboy",
            "choices":[
                "Air",
                "Water"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Air or water inflation?</span></div></span></div>",
            "created":1485406800,
            "id":2269514,
            "title":"More"
        },
        "1431221":{
            "author_id":"thatkidron98",
            "author_name":"ronnyboy",
            "choices":[
                "Gadget ",
                "Air Tank"
            ],
            "content":"<div class=\"\"><div> <span>Mandy snuck into the girls penthouse. She was searching around, trying to find some secrets to expose to the high school. \"Like, oh my gosh.\" she said disgustedly. \"This place is sooo gross.\". She snuck into Sam's room, pushing open her closet. \"Even her clothes are totally bland!\". Looking some more, Mandy found a...</span></div></div>",
            "created":1485406800,
            "id":2269517,
            "title":"Air"
        },
        "14312211":{
            "author_id":"thatkidron98",
            "author_name":"ronnyboy",
            "choices":[
                "Mandy Inflates Immediately",
                "Mandy Inflates Slowly"
            ],
            "content":"<div class=\"\"><div> <span>\"What's this?\" Mandy asks as she picks up some sort of round silver sphere. She shakes it around, and nothing happens with it, causing her to roll her eyes. \"Of course Sam would hoard stupid junk.\" she says, throwing it on the ground, causing it to glow before releasing a cloud of light.</span></div></div>",
            "created":1485406800,
            "id":2269519,
            "title":"Gadget "
        },
        "143122111":{
            "author_id":"thatkidron98",
            "author_name":"ronnyboy",
            "choices":[
                "She Stops Inflating",
                "She Keeps Inflating"
            ],
            "content":"<div class=\"\"><div> <span>\"Gah!\" Mandy yells, looking around. \"What did that stupid thing do?!\". She slowly hears a hissing noise, biting her lower lip as she groans. \"Ugh, why do I feel so strange?\" she says, looking down at her midsection, which is rapidly puffing out, causing her shirt to ride up. \"Oh no! M-My figure!\" she yells as her body rapidly swells out to the size of a car, her clothes tightening as she groans.</span></div></div>",
            "created":1485406800,
            "id":2269520,
            "title":"Mandy Inflates Immediately"
        },
        "15":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Belly",
                "Breasts",
                "Body",
                "Muscels"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of expansion?</span></div></span></div>",
            "created":1260853200,
            "id":805915,
            "title":"Britney"
        },
        "151":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Inflation",
                "Preggo",
                "Weight Gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will her belly expand?</span></div></span></div>",
            "created":1260853200,
            "id":805919,
            "title":"Belly"
        },
        "1511":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Air",
                "Helium",
                "Water"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of inflation</span></div></span></div>",
            "created":1260853200,
            "id":805954,
            "title":"Inflation"
        },
        "1512":{
            "author_id":"yamatomasta",
            "author_name":"yamatomasta",
            "choices":[
                "Victim of a worldwide pregnancy epidemic",
                "Accident with nearby WHOOP tech",
                "New popularity scam involving pregnancy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How would it start?</span></div></span></div>",
            "created":1327035600,
            "id":1262292,
            "title":"Preggo"
        },
        "15123":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Decides to visit this new parlor",
                "Call Sam or ALex about this"
            ],
            "content":"<div class=\"\"><div> <span>Britney gave a soft yawn as she rolled on her bed, looking pretty damn bored out of her mind. Lately, there haven't been many missions for her, so the blue spy girl didn't find much to do with her free time. That is until her laptop beeped showing she had an incoming message.<br>\r\n<br>\r\nBlinking, she hurried to it and saw it was from Clover &lt;Well, least my friends haven't forgotten me.&gt; She though with a soft smile, as she turned on the webcam and froze. Before her, she did see Clover, but the blond also sported a massive girth as she was chowing down on a bucket of ice-cream which also seemed to have had pickles in it.<br>\r\n<br>\r\n\"Mmmm..Hey there Britney! Long time no see girl~\" Clover exclaimed, as she licked her lips and then patted her belly gently, while Britney finally snapped out of her frozen shock.<br>\r\n<br>\r\n\"C-Clover?! W...What happened to you?! D-Did you get addicted to passion patties again?!\" Britney asked, as Clover giggled shaking her head<br>\r\n<br>\r\n\"No silly! Haven't you heard, it's a new fad! Being huge and pregged up to the brim!\" She declared, as Britney's eyes went to the size of dinner plates, as Clovers belly gave some powerfull kicks.<br>\r\n<br>\r\n\"H-How long....\" SHe wanted to ask, but Clover quickly cut her off<br>\r\n<br>\r\n\"15th Months, and going girl~\" She said rather proud of herself, as Britney's jaw dropped hard.<br>\r\n<br>\r\n\"FIFTEEN!?\" She yelled, which got her a nod from Clover<br>\r\n<br>\r\n\"You should really try it. It feels amazing being this huge and growing. Here, let me send you the adress for this place, trust me you'll love it~\" The blond spy said with a cute wink, as she tapped a few key's and then the adress popped up beside her webcam image.</span></div></div>",
            "created":1394686800,
            "id":1759735,
            "title":"New popularity scam involving pregnancy"
        },
        "152":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Half human, half-cow, as cowgirl britney.",
                "Ray beam gun.",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of breast expansion for Britney?</span></div></span></div>",
            "created":1292994000,
            "id":1020110,
            "title":"Breasts"
        },
        "153":{
            "author_id":"hamio",
            "author_name":"Hamio",
            "choices":[
                "Inflation",
                "Weight Gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will her body expand</span></div></span></div>",
            "created":1260853200,
            "id":805958,
            "title":"Body"
        },
        "1531":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry",
                "Water",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of body inflation for britney?</span></div></span></div>",
            "created":1292994000,
            "id":1020042,
            "title":"Inflation"
        },
        "1532":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating",
                "Force Feed",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of weight gain for Britney?</span></div></span></div>",
            "created":1295586000,
            "id":1039557,
            "title":"Weight Gain"
        }
    },
    "info":{
        "author_id":"hamio",
        "author_name":"Hamio",
        "brief_description":"Have the girls from the show expanded",
        "created":1260881040,
        "description":"<td align=\"left\" class=\"norm\">Have thr girls expanded.<br>\r\nRules are:<br>\r\n1. Popping is alowed only to end the story<br>\r\n2. No gore.<br>\r\n3. Not to much dirty stuff.<br>\r\n4. Only female expansion.</td>",
        "id":1626993,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595030940,
        "modified":1595030940,
        "pretty_title":"Totally Spies expansion"
    }
}