{
    "chapters":{
        "1":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm bored\" A voice  says.<br>\r\n<br>\r\n\"You're always bored\" Another replies with a sigh.<br>\r\n<br>\r\n\"But today, I'm bored more than usual!\" the first voice insist.<br>\r\n<br>\r\n\"Whatever, keep whining I'm going to take a nap.\" And with that, the owner of the second voice got up and left.<br>\r\n<br>\r\n\"Sigh...\"<br>\r\n<br>\r\nA Figure was sitting near the edge of one of the \"holes\" leading to the human realm. It watched as far below, the ground moved showing the same landscape over and over. <br>\r\n<br>\r\nBeing a god of size wasn't as fun as it sound. You had to watch over the lands, making sure that people grew accordingly to their age and shrink just the right amount when the time came. It was the god of size's job to keep watch on everything that grew on a single human being during all of his life. Body size, hair length, even fingernails, the gods had to keep watch over all of it. The young gods would start by looking after only one human. But as you grew used to the job, you could watch over more and more humans. Of course if you did, you would get rewarded, but once you get the hang of it, it is as easy as looking out for one that it is for fifty.<br>\r\n<br>\r\nAnd so, after an eternity of watching people grow and shrink over and over, one of the god began to find life boring. Having exhausted all his ideas of fun within the god realm long ago, time was going on really slowly. What a curse immortality was, really. <br>\r\n<br>\r\nFlipping through an old worn book, the figure read through all sort of names, body parts and size scribbled all over the pages. Only a few pages were still blank and that is why the figure had asked for a new note which was right at its feet on the side of the hole as well.<br>\r\n<br>\r\nTaking a look a the brand new note, The figure suddenly grinned largely before slowly pushing the note down the hole watching it fall round and round toward the suburb landscape below.<br>\r\n<br>\r\n\"Now maybe things will get a little interesting!\" The voice said before getting up and leaving as well.</span></div></div>",
            "created":1361422800,
            "id":1536474,
            "title":"Prologue"
        },
        "11":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Scribble down something in the note",
                "Looked through your window",
                "Decided to go cool off by the pool",
                "Watch a live event on TV",
                "Throw the note on your desk on go take a shower"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Nick, a Young 20 years old male living a life far from his tastes.<br>\r\n<br>\r\nYour mother died in a car accident when you were 5 and you lived a long time alone with your father until he decided to get re-married to a much younger woman the him. Unfortunately, Jen, the woman he chose as his new wife was almost the biggest bitch you knew of if you hadn't already given that title to her daughter Stacy, your step-sister.<br>\r\n<br>\r\nFrom what you've heard, Jen got pregnant at thirteen  from a guy who disappeared soon after. Having to raise a child alone, Jen decided to use her good looks to her advantage by clinging to men and living off them for a while before switching to another. She didn't want her daughter to feel poverty and managed to spoil her a great amount, never once saying no to her demands.<br>\r\n<br>\r\nNow at 33 years old, Stacy being 20, she had found a good money cow to milk by marrying your father who was a rich business man who had a lot of money but decided to live in a simple way. <br>\r\n<br>\r\nWhy had your father decided to marry such a slut? Well mainly for two reasons. The first one was because he was dying and had wanted to help a family he thought could use his help. He had talked whit Jen when he met her and after she had told him her story, undoubtedly embellishing some of it, he wanted her and her daughter to come live with you and him. At least that way he knew she wouldn't have to beg for money in the future (Not that she ever did but he didn't know that).<br>\r\n<br>\r\nThe second reason was because she was fucking hot. And since he was dying, he told himself what the heck and found the bombshell of his dreams to have the best sex he could while he could.<br>\r\n<br>\r\nYou didn't approve of your father's choice, although you understood it. But now that your father was dead, Jen and Stacy who were so docile around your father, were by no means charming to you. In fact, according to your father's will, if you wanted to inherit your part of inheritance, you had to live at your father's house until you were 21. Otherwise, your money would go to Jen and you would get nothing.<br>\r\n<br>\r\nThat's why you had to put up with both woman doing their best to annoy and torment you. They wanted you to give up and let them have the money while you moved on somewhere else. But there was no way you would give up on such a large amount of money. Even if you had to keep up with Jen and Stacy,s bitching for one more year.<br>\r\n<br>\r\nWhile Jen was the more mature of the two, she was still bitchy as hell. At 5'6\", she had a beautiful face, deep blue eyes and black hair that went down to her shoulder. She also had a stunning hourglass body with a heavy set of breast being somewhere around F's, a slim waist and wide hips with firm thighs and toned legs. You knew she also did yoga and other workout to keep looking the way she did. She always try to boss you around, giving you chores to do while Stacy would watch you and taunt you. Speaking of Stacy, she was the worst one around in your opinion. Not only was, she bitchy, she was also a bratty spoiled slut who was used to get everything when she wanted it. She had inherit her mother's body with few changes like blond hair and E cup breasts. She also had a good tan and always dressed in the most skimpy of outfits to show her looks. She delighted from nagging you and was quite good at it. While you managed to get back at her sometimes without her mother noticing, she was more than happy to \"Borrow\" your car or blackmail you about any small thing she could find out about you.<br>\r\n<br>\r\nNow that was the life you were used to by now, having to put up with two sexy bitches who seemed to get turned on by watching you squirm Under their taunting. But, life could be worse and all you had to do was hold on for one more year.<br>\r\n<br>\r\nOne day, you were mowing the lawn as your stepmother asked you. It was a really hot summer day with the sun almost at his zenith and you couldn't wait to be done to get back to the air conditioned inside and take a small rest from your efforts this morning. You were almost done when you noticed a curious object laying in the grass. Turning off the mower, you bended down to pick it up. <br>\r\n<br>\r\nIt was a black note book with the letters \"Size Note\" written simply on its cover. Flipping through  the pages, you noticed that all of them are blank except on the back of the cover where a set of rules seems to be listed. <br>\r\n<br>\r\n\"Shrinking or growing people?\" You say to yourself \"That's ridiculous. Some people really have nothing to do to think of something like this!\" It must some high school stuff where you write names of people you would want revenge on or something like this.<br>\r\n<br>\r\nNonetheless, you pocket it and finish your work. After putting the mower back in the garage, you go up to your room and lay down on your bed, still sweaty and trying to cool off.<br>\r\n<br>\r\nFeeling the note book in your back pocket, you take it to your face and watch it in deep thought. Looking to your side, you see your working desk with your pencil holder on top of it. You look back to the note book before you...<br>\r\n</span></div></div>",
            "created":1363150800,
            "id":1549098,
            "title":"The Size Note"
        },
        "111":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "4 feet",
                "8 feet",
                "Let's get crazy... 2 inches"
            ],
            "content":"<div class=\"\"><div> <span>Siting at your desk, you start to think about whose name to write in the book. Even though it wasn't that much important since it was probably just an ordinary notebook, if it could help you to blow off some steam, you could always put it to good use.<br>\r\n<br>\r\nAllowing yourself to slip deep inside your thought, you start to imagine what it would be like to shrink yourself to a tiny size. Reminding yourself of the rules written Under the cover page, you ponder about hypothetical scenarios where you would be as small an ant walking through your house, exploring areas you already knew but with a new perspective. You also saw yourself as a giant, walking through tiny cities and landscape, just like Gulliver's travel.<br>\r\n<br>\r\nAh come on you think, just get on with it.. Stupid thing is probably fake anyway.<br>\r\n<br>\r\nYou pick a pen up and write your name followed by...</span></div></div>",
            "created":1363410000,
            "id":1551077,
            "title":"You write your own name"
        },
        "1111":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "...You manage to free yourself and grab the note",
                "... Finishes writing your new size (6 inches)",
                "... Jen suddenly walks in"
            ],
            "content":"<div class=\"\"><div> <span>You scoff as you finish writing your name followed by the size of 4 feet. Yeah, no way this thing works anyway, but still, you felt a little excited non the less. That feeling exploded though as a few second later the desk you were easily overlooking instantly became bigger! As you look around, you realized it wasn't just the desk but your whole looked bigger.<br>\r\n<br>\r\nJumping up from your chair, trembling, you look around with an incredulous smile on your face, touching everything like you were seeing for the first time. Jumping on your now queen sized bed you laugh at how awesome the situation is.<br>\r\n<br>\r\n\"This is incredible! I feel like a child again!\" You say.<br>\r\n<br>\r\nGetting an idea, you get up and start to run outside your room to the bathroom, you stumble in your overgrown pants, but get up holding them up and continue still amazed from everything being so large.<br>\r\n<br>\r\nAs you reach the bathroom, you notice that your are now to small to see yourself in the mirror and have to climb and hold yourself over the sink. Almost expecting to see a younger face in the mirror, you laugh seeing your diminished form looking back at you. That's when your hear a voice you didn't want to hear right now.<br>\r\n<br>\r\n\"Hey Nick, where are you? I need something from you!\" You hear Stacy's loud voice coming from out of the bathroom.<br>\r\n<br>\r\nYou loose your grip and fall to the floor getting tangled in your trousers. When you finally manage to get back up, you get out of the bathroom and run as quick as you can toward your room. As you get to the door, though, you stumble once more and fall on your stomach. Grunting, you open your eyes only to see a large pair of feet standing in front of you. Looking up, following the long shapely legs, up to a face half hidden by a magnificent bosom, you see a blond hair head looking down, surprised while holding up the size note as if she was reading it.<br>\r\n<br>\r\nEyes bulging in disbelief, Stacy, clad in her yellow bikini, talks first.<br>\r\n<br>\r\n\"Nick, is that you?!\"<br>\r\n<br>\r\nFeeling a chill down your spine you get up holding your pants and stand to your full height. But your feeling of uneasiness doesn't disappear as you find yourself barely tall enough for the top of your head to reach your stepsister's enormous chest. Hearing a small scoff, you look past her breasts and see her starting to grin as understanding fills her head.<br>\r\n<br>\r\nYou look aside and quickly reach for the note. Only to have it taken out of reach at the last second by your grinning stepsister. You keep trying to jump while holding your pants up but you only manage to amuse your amazonian in perspective stepsister.<br>\r\n<br>\r\n\"How could you keep something so awesome from us Nick? Where you afraid we would be mean? Where did you get this?\" She asks you while you struggle to get the note back.<br>\r\n<br>\r\n\"Give it back Stacy, this thing is mine I found it!\"<br>\r\n<br>\r\nWith no warning, Stacy suddenly grabs your collar and pulls you inside your room, making you stumble once again and you hold yourself stable against your bed. You turn around just in time Stacy sexily walking toward you and stopping putting one hand on her hips and the other holding the note to her face reading. <br>\r\n<br>\r\n\"The human whose name get written in the note along with a size will get his size changed to the one written in the note... This looks promising should we try it?\"<br>\r\n<br>\r\nYou feel a jolt in your body and you charge in panic. But Stacy merely hold the note higher as you collide with her while reaching up uselessly. You hear laughing above and pressure being applied on the top of your head.<br>\r\n<br>\r\nAnd suddenly her weight shift making you fall on your back while Stacy follow suit and straddles you.The tip of her bikini top grazing your nose as you look up and see her looking down with a mocking grin. You try to push her up but she is to heavy for you to move with your diminished muscles in your position.<br>\r\n<br>\r\n\"Hahaha, you're such a wimp Nick! Why don't you submit to me? I could be good to you.\" She finishes softly in your ear as she slowly lower her torso on your face suddenly burying your face in her cleavage. Meanwhile, her free hand found it's way through your trouser before beginning to fondle your genitals.<br>\r\n<br>\r\nYou quickly became aroused by the action but still tried to free yourself. That action once again bared no fruits, but make Stacy sigh.<br>\r\n<br>\r\n\"Sigh, I guess you're still too big to stop thinking about resisting me. Let's change that shall we?\" She says lifting back her chest from your face before putting the note down over your head.<br>\r\n<br>\r\n\"How does 6 inches sound? You'll be like a ken doll!\" Stacy laugh.<br>\r\n<br>\r\nStacy writes down your name and... </span></div></div>",
            "created":1509685200,
            "id":2410414,
            "title":"Bullied"
        },
        "11111":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Shrink Stacy down...",
                "Escape through the window..."
            ],
            "content":"<div class=\"\"><div> <span>You feel the pressure that Stacy is applying on your chest to hold you down on the ground while she write something in the note just above your head, out of sight for you. Would she really do it? would she really shrink you to 6 inches and torment you?<br>\r\n<br>\r\nYou don't want to know, and you don't plan on finding out either. With the last of your strength you slam your forehead under her chin. You're not the type that usually resort to violence. However, this was a time of emergency. As expected, Stacy groaned in pain and rolled to the side, holding her face with both hands. Not skipping a beat, you grab the size note and the pen and bolt out of the room, heading back to the bathroom quickly closing and locking the door behind you. Soon enough, you hear loud banging and rattling as Stacy, who caught up with you, try to open the locked door.<br>\r\n<br>\r\n\"Open this door you fuckin' little asshole! I'm going to fuckin' kill you! I'll crush you under my foot like the stinkin' little bug you are! You hear me!\" You hear her yell on the other side. Quite frankly, it didn't make you want to open that door any time soon.<br>\r\n<br>\r\nAs the bathroom was filled with the noise of your stepsister's banging and yelling, you look down in the note and notice that your name is written in it with the number 6 beside. However, you guess, since there was no units written, the note didn't work. Quickly, you write down the word \"feet\" beside and wait for ten seconds, hoping that Stacy wouldn't be able to burst in while you did.<br>\r\n<br>\r\nLuckily, she does not and you find yourself back to a normal height. But with Stacy still out for blood on the other side of the door, you didn't think you could just walk out the door. So you weighted your options.<br>\r\n<br>\r\nYou could...</span></div></div>",
            "created":1510117200,
            "id":2412491,
            "title":"Necessary evil"
        },
        "11112":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "In her gigantic cleavage...",
                "In her panties..."
            ],
            "content":"<div class=\"\"><div> <span>You try to resist, but you're pinned way to firmly to the ground by Stacy's superior strength to get away in time. You struggle even more, hoping that a last ditch effort will save you and for a moment there you actually feel Stacy having a hard time holding you to the ground, but you stop as you feel Stacy getting up.<br>\r\n<br>\r\nShe doesn't stand though, she keeps straddling your small frame between her powerful thighs and you can see her throw the note on your bed before looking down at you grinning. <br>\r\n<br>\r\n\"Well get ready little bro, you're about to get a lot smaller!\" She says.<br>\r\n<br>\r\n\"Please Stacy, stop this! This has gone far enough!\" You plead, but you only make her laugh.<br>\r\n<br>\r\n\"Oh sorry little Nick, but it's already too late. You should find yourself 6 inches tall right about...\" She starts.<br>\r\n<br>\r\nAnd then the world shifts. You don't feel Stacy's thighs holding you anymore. Instead, the only thing you can feel is your gigantic shirt covering your body like a comforter and the hard floor beneath you. Still looking up, you can Stacy's now gigantic body looming over you as she is still in her straddling position from moments before. Her sexy frame is now the most intimidating thing you ever saw, and her wide eyes filled with delight make your blood run cold.<br>\r\n<br>\r\n\"...Now!\" Stacy loud voice finishes over your tiny form.<br>\r\n<br>\r\n\"Oh my god look at you! you're so cute!\" She says standing up and holding her hands on her hips. You get up as well, but you still have to crane your neck to see her face over the bulge of her breast. Shaking in fear in front of this sexy titan, you turn around and run.<br>\r\n<br>\r\n\"Oh you're still quite fast aren't you?\" You hear Stacy laughing voice coming from somewhere above you. In a matter of second, a hand appears right in your path and slams into you before you can feel the huge and hot fingers curl around you and lift your body high up in the air. You try to kick your legs, but it does little to stop your ascension toward Stacy's face.<br>\r\n<br>\r\nWhen you're face to face with your gigantic grinning stepsister, you loose it!<br>\r\n<br>\r\n\"Restore me to normal you big cunt! I'm not your fucking toy! Stop looking at me and just re--\" You don't get to finish as Stacy suddenly shoved you face first... <br>\r\n<br>\r\n</span></div></div>",
            "created":1510117200,
            "id":2412494,
            "title":"Stacy's toy"
        },
        "1112":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Mess with Jen and Stacy at your current size",
                "Shrink yourself to normal and shrink Jen and Stacy",
                "Go outside and mess with the whole city"
            ],
            "content":"<div class=\"\"><div> <span>You finish writing and instantly get up, moving around nervous. You don't know why you're nervous though. Deep down you know nothing is going to happen. Just like when you scratch a lottery ticket and seeing 2 logos and you are 1 short. You know that you are not going to find one, but you are still excited about the small percentage of what would happen if you were lucky.<br>\r\n<br>\r\nWell, today's your lucky day, because 10 seconds after having written your name, you instantly find yourself looking down at the room from a much higher perspective. You noticed that in your instantaneous growth, you hit the ceiling a made a small in dent in the shape of the top of your head in the Sheetrock. Still, you can't help but smile as you bend your knees a little and rub your head. You've really grown to 8 feet! you probably were one of the tallest people on earth right now! <br>\r\n<br>\r\nLooking back at the note you grin. That thing worked, and it would work again. you chuckle as you think of everything you could do with this. At your size, you could mess with Jen and Stacy and show them who was the boss of the house now. Or you could shrink them to barbie size and keep them as toys, to make them pay of all the abuse they made you go through!<br>\r\n<br>\r\nOr you could just leave, those two bitches didn't deserve your time. You could go outside and mess with people size or become a giant and do whatever yo want! The possibility were just do large and new, you felt a rush of excitement go through your body.<br>\r\n</span></div></div>",
            "created":1512622800,
            "id":2425058,
            "title":"Empowerement"
        },
        "11121":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Jen tries to break free",
                "Jen leans eyeing your huge member in excitement"
            ],
            "content":"<div class=\"\"><div> <span>Chuckling, you take the note and hide it under your bed, before turning and proceed to get out of the room. That makes you laugh as you squeeze your large frame through the opening. You couldn't help but grin as you thought about the face that your stepsister and stepmother would make when they will see you. Slowly trekking through the hallway, your mobility being reduce by your awkward bending posture as you didn't want to dig trenches in the ceiling just by walking.<br>\r\n<br>\r\nFinally getting to the stairs you slowly descend and look around the living room searching for a prey. <br>\r\n<br>\r\nYou spot Jen leaning on the counter with her back to you, eating an apple and flipping pages of a magazine. You try to sneak behind her, but you don't manage to muffle your loud footsteps enough and she address you without even turning.<br>\r\n<br>\r\n\"If you're done with the lawn, then you can move on to trim the hedge. I told you already.\" She says with her condescending tone still turning her page and taking another bite of her apple.<br>\r\n<br>\r\n\"Well, right now, I don't feel like trimming the edge at all. I'm kind of in a playful mood. What do you say Jen, wanna play with me?\" You taunt suggestively. Your stepmother was so hot that you couldn't help yourself. With her small (too small) jeans shorts and her with top tied beneath her huge rack, she made this hot day even hotter. You thought that you would get a reaction, but she seems used to the taunting and you can hear her scoff as she began turning around.<br>\r\n<br>\r\n\"Yeah right big boy, you would need two of you if you wanted to keep up...with... me... OH MY GOD!\" Jen finishes screaming and dropping the apple, her mouth opened in awe at your big naked form.<br>\r\n<br>\r\n\"You think I might be enough to satisfy you right now?\" you grin as suddenly grab her waist and pull her to you.</span></div></div>",
            "created":1512622800,
            "id":2425063,
            "title":"Surprise!"
        },
        "111211":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Holding the opened size note and a pen",
                "Holding each others in fright"
            ],
            "content":"<div class=\"\"><div> <span>As you hold Jen's small (to you) frame against your body, you feel her trying to put a fight against your superior strength. She pushes against your chest and tries to break free, but you hold her tight chuckling. <br>\r\n<br>\r\n\"What's wrong Jen, you are so proud of that body of yours, I would have thought that you would like having it touched!\" You chuckle in her ear as you forcefully fondle one of her big breast, still large enough to fill your grown hand.<br>\r\n<br>\r\nSuddenly, a searing pain erupt in your forearm as Jen dug her nails deep in your skin and scratched you. You shove her to the ground before inspecting your wounded arm. <br>\r\n<br>\r\nGrowling in anger, you look back at her, eyes wide with fear, pupils dilated and breathing hard as she crawls away from you.<br>\r\n<br>\r\nYou stomp in her direction and force yourself unto her as you straddle her form and hold her arms to the ground.<br>\r\n<br>\r\n\"You're going to pay for this you bitch!\" You yell in her crying face before you see her eyes dart to the side and widen.<br>\r\n<br>\r\n\"Stacy! Help me!\" She screams before you look in the same direction and see Stacy in her yellow bikini looking at the scene in bewilderment. As her mother screams for help, you see her regain focus and charge you by jumping on your back and punching you. You can barely feel her weak punches on your sides and back as Stacy is not strong enough to put much strength behind her punch. But one lucky hit hits you in the jaw and you feel dizzy for a moment.<br>\r\n<br>\r\nAt the same time, Jen managed to hit you squarely in the groin with her free legs and you instantly roll over to the side in pain from the hurtful combo. Stacy quickly helps her mother to her feet and the both of them try to bolt between you and the staircase toward the front door, but you hold out your arm and block their passage as you swipe blindly trying to grab one of them without success. Dodging your flailing arm, Jen and Stacy have no choice but to run up the stairs. Soon enough, everything is calm in the house and you get up, the pain lessening as time passes.<br>\r\n<br>\r\n\"You can run but you can't hide!\" You yell before awkwardly climbing the stairs.<br>\r\n<br>\r\nArriving upstairs, you stop and listen. At first, all you can hear is silence, but then, you can hear quick, muffled breathing coming from your room, the closest to the stairs.<br>\r\n<br>\r\nWalking inside the room, you can almost hear them trembling under your bed as you grin and pick one end of your bed and lift it revealing the two frightened women...</span></div></div>",
            "created":1512622800,
            "id":2425068,
            "title":"You can run but you can't hide"
        },
        "111212":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "You tell her",
                "You lie"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my god, you're so... big!\" She says as she overcomes her surprise and eye your huge cock hungrily. Just following her gaze makes gets you excited and your member stiffen a little, a fact not missed to the sexy woman in its proximity.<br>\r\n<br>\r\n\"It seems like someone is happy to see me isn't?\" She says caressing your hardening member with her fingers until you are rock hard.<br>\r\n<br>\r\n\"Say big boy, how about we go upstairs and you show me if you know how to use that thing?\" she says seductively.<br>\r\n<br>\r\nGulping you thought for a moment. That wasn't the reaction you thought you would get. But, what Jen was offering, was an offer you couldn't refuse. lifting her up, you carried bridal style to her room and laid her down once more. Softly breaking free of your hold, Jen walked toward the opened door.<br>\r\n<br>\r\n\"Just let me get this thing closed so we can have a little intimacy.\" She says in a husky tone before closing the door and turning back to you, walking slowly, hips swaying and untying her with top, freeing her large breast which held firm against gravity. You gulp once more as she drops her top to the side and comes back in your embrace and use her tits to slowly envelop your penis. <br>\r\n<br>\r\nYou groan in delight as and slowly lay down on the bed, feet still on the ground as Jen is still standing between your two legs and rug your erect member masterfully with her big breasts. From time to time, you feel a jolt of electricity going through your spine as she swiftly lick your cap. <br>\r\n<br>\r\nYou don't know how much time passes as you are in heaven, but you have a hand through your hair when Jen climb on top you and proceed to slowly crawl to your face before she look at you hungrily.<br>\r\n<br>\r\n\"Eat me.\" She simply says before straddling your face and bringing her glistening pussy to your mouth.<br>\r\n<br>\r\nYou hold her hips as you get to work and start lick her clit. You hear her moan and you know you making good work. When you feel she has reached a good level, you lift her up and bring her to your waiting member and slowly bring her down on top of it. Slowly, you penetrate and she is so tight that you make her spasm instantly.<br>\r\n<br>\r\n\"Oh my go! OH MY GOD YEAH HMMM! YEAH! This is incredible!\" She moans. <br>\r\n<br>\r\nThe feeling is amazing and the world starts to fade away as you put all your attention on this incredible feeling.<br>\r\n<br>\r\n\"Oh God yesss! How did you become so huge Nick?\" She says through her moaning.</span></div></div>",
            "created":1512622800,
            "id":2425072,
            "title":"Big Sex"
        },
        "11123":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Megan your new test subject ",
                "Shrinking bullies ",
                "Go somewhere else ",
                "Go somewhere else # 2"
            ],
            "content":"<div class=\"\"><div> <span>You decided to mess with stuff outside.<br>\r\nYou go outside taking the note along with you.<br>\r\n<br>\r\n<br>\r\nYou decide what to do with the Size Note<br>\r\nwhen you see a neighbor,<br>\r\nA little short blond haired 4 year old<br>\r\nyou’ve babysat getting picked on again for being<br>\r\nshort.<br>\r\n<br>\r\n<br>\r\nYou return yourself to normal then debate what<br>\r\nto do next.<br>\r\nYou could try and test the limits of the note<br>\r\nand save 4 year old Megan from the bullies<br>\r\nor you could do something else?</span></div></div>",
            "created":1559106000,
            "id":2665747,
            "title":"Go outside and mess with the whole city"
        },
        "111231":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Megan grows according to plan",
                "Plan is a bust! Megan goes thru a series of close growth spurts ",
                "Something else goes awry",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Ultimately you felt bad for Megan<br>\r\nand you knew she hated being short.<br>\r\n<br>\r\n<br>\r\nYou wrote her name but with specific instructions<br>\r\nand such to test the Size Note<br>\r\n<br>\r\n“Megan Ann Smith”<br>\r\n<br>\r\nYou weren’t insensitive or a perv so you<br>\r\nwrote in to have her Skirt, and panties grow<br>\r\nwith her.<br>\r\n<br>\r\nNext you tried timing it<br>\r\n<br>\r\nYou wrote 8 foot<br>\r\n<br>\r\nThen you tried a list <br>\r\n10 foot  in 30 minutes from now<br>\r\n12 foot in  1 hour from now<br>\r\n14 foot in 23 hours from now<br>\r\n20 foot in 24 hours from now<br>\r\n60 foot in 25 hours from now<br>\r\n80 foot in 26 hours from now<br>\r\n120 foot in 27 hours from now<br>\r\n150 foot in 27 1/2 hours from now<br>\r\n200 foot in 28 hours from now<br>\r\n300 foot in 28 1/2 hours from now<br>\r\n500 foot in 29 hours from now<br>\r\n800 foot in 30 hours from now<br>\r\n<br>\r\n<br>\r\nYou finished for now the hope being this<br>\r\nwent as planned freaking out her parents<br>\r\nand hopefully you’d see her gradually becoming<br>\r\na giantess tomorrow.<br>\r\n<br>\r\n<br>\r\nSomewhere the god of size was intrigued<br>\r\nby this plan.<br>\r\n<br>\r\n<br>\r\nSuddenly the 1st one starts as you watch<br>\r\nMegan Shoot up to 8 feet tall.<br>\r\nMegan’s shirt, shoes and socks burst off<br>\r\nbut the skirt and panties stay perfectly sized<br>\r\nfor her. This gives you hope for the test.<br>\r\n<br>\r\n<br>\r\nThe bullies are stunned by this then runaway.<br>\r\nMegan is thrilled.</span></div></div>",
            "created":1559106000,
            "id":2665752,
            "title":"Megan your new test subject "
        },
        "1113":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Try to climb on your desk",
                "Get help from Jen or Stacy (Shiver)",
                "Try to call a size god to help you"
            ],
            "content":"<div class=\"\"><div> <span>As you finish writing the size, there is suddenly butterfly in your stomach. You're feeling nervous about if the note worked or not. If it worked, you were probably an idiot for writing such a small height. Laughing it off nervously, you got up and started walking in your room. It didn't take long, however, before you were suddenly blinded and trapped by heavy fabric that appeared all around you.<br>\r\n<br>\r\nRealizing that you were now naked and that it was not mere fabric, but your now gigantic clothes that enveloped you, you started to panic. Finally finding the exit from you fabric prison, freeze in amazement at the sight in front of you.<br>\r\n<br>\r\nEverything in your room had instantly blown up to titanic proportions. Your bed looked like a football stadium in the distance while your desk was now similar to a large building... on top of which laid the sizenote.<br>\r\n<br>\r\nYou felt a chill running down your spine as you imagined yourself being stuck at this size for the rest of your (short) life!<br>\r\n<br>\r\nCursing, you quickly thought about your options:</span></div></div>",
            "created":1509598800,
            "id":2410351,
            "title":"Let's get crazy... 2 inches"
        },
        "11131":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "You are interrupted by someone walking in your room",
                "You manage to use the pen, slowly but surely"
            ],
            "content":"<div class=\"\"><div> <span>Your mind was going a hundred miles per hours as the immensity of your surrounding reminded you of your helplessness in your now giant world. Panicking, your thoughts went to the first logical solution to your tiny predicament. The note could do this, the note could undo it. Running toward the desk you knew you had only one choice. Nothing gave you direct access to the top of your desk without a giant divide between. Nothing except your lamp's cord which ran down along the side of the structure of your desk and reached the floor. <br>\r\n<br>\r\nComing to an halt in front of this thick, makeshift rope, you catch your breath as you look up and shudder. This was a long way up... but still you had no choice. Beside, you were in shape, you knew you could do it! Quickly exhaling once and twice, you grabbed the cord with a rush of adrenaline and, looking up, began your ascension. It was easier than you thought. The rubbery surface prevented you from slipping and the thickness of the cord made you able to hold it tightly with your arms and knees. <br>\r\n<br>\r\nYou had a little moment of fear as you came across the lamp's switch, and instinctively looked down to see your progress. You felt faint and hugged the chord even more tightly as you saw the height you would fall if your body failed you. You didn't know i you could survive the fall, but you would have a few broken bones for sure.<br>\r\n<br>\r\nMentally slapping yourself, you looked up once again and passed the switch to resume your climb. After a few minute of effort, your arms and leg trembling as the toll of the ascension began to be felt, you finally managed to lift yourself on top of the desk!<br>\r\n<br>\r\nQuickly crawling away, from the edge, you rolled on your back and breathed deeply as you tried to calm your trembling body from it's stressed muscle, as the soreness finally weighted in as the adrenaline flow lessened. After a few minutes of cooling down, you decided to get up and do what you came to do before coming to a stop. Walking to the front of the desk, you couldn't help but admire the scenery. As you stood up there, you didn't feel as tiny as before. Granted it didn't feel being normal, but the feeling of accomplishment doubled with the sight made you relish the moment.<br>\r\n<br>\r\nTurning around, you locate the gigantic note laying open a few yards away. You lightly jog towards and stop as you reach the huge white pages of the note. You gaze at the now gigantic pen and wonder how you are going to use it at your size.</span></div></div>",
            "created":1512536400,
            "id":2424968,
            "title":"The climb"
        },
        "11132":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Jen looks up at the tiny voice she heard",
                "Jen didn't hear anything and continue reading unaware"
            ],
            "content":"<div class=\"\"><div> <span>You were panicking. Seeing everything so huge, dwarfing you made you feel so helpless, you went to the first logical solution your tiny mind could fathom at the moment. The note was not reachable by your tiny means. So you had to get help from somebody who could reach it. Someone who would undoubtedly be a very sexy and gigantic woman to you. Your stepmother Jen or your stepsister Stacy. Your mind flashed a warning that getting help from one of those two was probably a very bad idea, but you quickly crushed that thought. Surely, they weren't evil to the point of abusing you and your tiny stature?<br>\r\n<br>\r\nWithout giving it more thought, you bolted out of the room. Well, said like that it sounded fast, but it actually took you many minutes only to reach the open door of your bedroom. As you peaked in the hallway, you tried to locate the giantess if one was in the house. Hearing footsteps down on the ground floor, you began running toward the stairs where you saw your gigantic step mother moving about downstairs. You shouted her name but she didn't hear you, your voice probably not strong enough to cover her own footsteps.<br>\r\n<br>\r\nWaiting for her to stop moving, you finally get your chance when she sits on the sofa to read a magazine. The sofa was located exactly beneath the railing that framed the open side of the hallway next to the stairs. You ran to the location above Jen and screamed her name even louder than last time. <br>\r\n<br>\r\n\"JEN LOOK UP!!\" You scream to the limit of your voice. </span></div></div>",
            "created":1512622800,
            "id":2424972,
            "title":"Jen downstairs"
        },
        "11133":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                " A young brown hair man",
                "A young redhead woman"
            ],
            "content":"<div class=\"\"><div> <span>Quickly calming yourself, you regain a semblance of calm in face of this crazy situation. Ok, you were now 2 inches tall after having written it down in the strange notebook. So the rules written inside the cover were, for a matter of fact, true. Now, you do remember that the rules didn't just mention about changing the size of things, but also about \"size gods\" who seems to be being familiar with the note who could help the user.<br>\r\n<br>\r\nWell you had nothing to loose you thought before you called out:<br>\r\n<br>\r\n\"Could I get help from a size god please?\"<br>\r\n<br>\r\nBut after waiting a few moments, your are answered only by your silent bedroom staying so.<br>\r\n<br>\r\n\"IS THERE A SIZE GOD WHO CAN HELP ME PLEASE?\" You ask louder thinking that maybe you weren't heard the first time.<br>\r\n<br>\r\nBut still, your calls remained unanswered. Sighing you hung your head down rubbing the bridge of nose thinking. Alright so the note didn't exactly specified that you could call out to a size god. You tried to remember the exact rules, but couldn't quite remember. But if you couldn't get help from a size god right away, it didn't made much sense to stay put.<br>\r\n<br>\r\nMaybe there was a rule that could help you out, but to know that, you would have to climb your desk. Slowly walking around the building that was your desk, you identified only one way up, the electric cord of your bedside lamp. After weighing the pros and con of the situation, you decided that there no other choice for the moment, so you started climbing. <br>\r\n<br>\r\nThe climb was hard, but not as tough as you thought earlier and after a few minutes, you reached the half point. As you passed the middle point, you heard a voice coming from above.<br>\r\n<br>\r\n\"Wow! You're quite gutsy to climb that despite being shrunk only minutes earlier!\" The voice said.<br>\r\n<br>\r\nYou look up, heart beating hard, and see a person your size comfortably leaning over the edge and grinning down at you. The figure was in fact...</span></div></div>",
            "created":1512622800,
            "id":2425024,
            "title":"Unexpected meeting"
        },
        "112":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Jen, 500 feet tall",
                "Jen, 2 inches tall",
                "Jeff, 2 inches tall"
            ],
            "content":"<div class=\"\"><div> <span>Siting at your desk, you start to think about whose name to write in the book. Even though it wasn't that much important since it was probably just an ordinary notebook, if it could help you to blow off some steam, you could always put it to good use.<br>\r\n<br>\r\nAllowing yourself to slip deep inside your thought, you start to imagine what it would be like to shrink yourself to a tiny size. Reminding yourself of the rules written Under the cover page, you ponder about hypothetical scenarios where you would be as small an ant walking through your house, exploring areas you already knew but with a new perspective. You also saw yourself as a giant, walking through tiny cities and landscape, just like Gulliver's travel.<br>\r\n<br>\r\nYou are still daydreaming when you hear faint shouting coming from you window. Looking to your side down on the street, you can see Jen, wearing a white tied up flannel shirt showing a lot of her impressive cleavage and midriff, a really short pair of shorts and sandals, yelling at one of your neighbors you recognize as Jeff, a single middle aged industrial worker. <br>\r\n<br>\r\nWearing only a red t-shirt and black bermudas, it seems like Jeff was walking his dog, a golden retriever, when the dog decided to take a dump right in front of your house. Of course, Jen didn't take it well and was telling Jeff how people like him shouldn't be allowed to own animals and whatever reason she found good enough to spit at him.<br>\r\n<br>\r\nSince he was kind of a timid man, Jeff could only stay muted in front of this flaring beauty. Deciding to go back to your daydreaming, you sit back in the chair while listening to the continuous flow of insults spewed by Jen a few meter outside. <br>\r\n<br>\r\nHowever, now your dreams were haunted by the form of Jen. No longer were you alone in your house. Your tiny form was now running from the huge feet of Jen looking down at you with a huge grin over the swell of her breasts. Shaking your head, you found yourself in a city. But no more were you the giant, in your place stood Jen, hands on her hips, admiring the tiny world at her feet.<br>\r\n<br>\r\nOpening your eyes, you looked once again through the window to find your step mother still yelling at Jeff ( <i>don't she ever run out of juice?</i>) who looked tinier and tinier by the second in front of her.<br>\r\n<br>\r\nWith a humorless chuckle, you take the note book and write the name of:</span></div></div>",
            "created":1447909200,
            "id":2064289,
            "title":"Observing Jen"
        },
        "1121":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "You find the size note",
                "You don't find it",
                "You hear booming footsteps coming closer"
            ],
            "content":"<div class=\"\"><div> <span>You finished writing Jen's name and chuckle. Jen a giantess. Now that would be a sight to behold. It would probably suit her very much, being power hungry like she was. Closing the note and getting up, you decided to go Watch some TV downstairs. Your trek through the house wasn't long however since, before you could reach the stairs something huge crashed through the house making you tumble down the stairs and knock you out from hitting your head at the bottom.<br>\r\n<br>\r\nEverything is hazy. You keep slipping though consciousness and unconsciousness, getting glimpse of a wrecked house and hearing a mix of scream, sirens and loud laughing.<br>\r\n<br>\r\nFinally, you wake up being shaken by a pair of hands.<br>\r\n<br>\r\n\"Nick Wake up!\" <br>\r\n<br>\r\nOpening your eyes, you see your step sister kneeling beside you shaking you awake.<br>\r\n<br>\r\n\"Ugh... Alright Stacy stop shaking me I'm already awake!\" You grumble, a killing headache throbbing in your head.<br>\r\n<br>\r\nLooking around you noticed the poor state of the house. The front part was completely  wrecked and the second story had caved in. Luckily, the part you and Stacy were standing in was still standing.<br>\r\n<br>\r\n\"What the fuck is happening Nick?! One moment I'm sunbathing in the back yard, and the other, mom turns into a giantess out of nowhere and goes into town.\"<br>\r\n<br>\r\nYou look at Stacy, still dressed in her yellow bikini with a look that seemed to fit between excitement and fear.<br>\r\n\"What?\" You asked still groggy and confused.<br>\r\n<br>\r\nTaking out her cell phone, Stacy finds a live Stream of Jen wrecking havoc in the town. The helicopter circling high around her head giving you a view of a naked sexy giantess thrashing buildings and crushing people in the streets below. The news title was \"A 500' woman destroying town!\". Suddenly, a shot exploded at her right ankle. The military had arrived! Putting her hands on her hips and laughing, she began playing with the army akin to action figures at her height. Bending down, she picked a few soldiers in the palm of her hand, brought them near her mouth, and whispered something that was unheard by the camera. Giggling, she slowly brought her hand to her hips and began massaging her wet pussy with the hand still holding the poor soldiers while groping her left breast with the other. The live feed was turning into a porn movie when another shot struck her on her stomach. Looking more exasperated than angry or hurt, she walked toward where the shot had come from and picked up a tank with one hand alone and proceeded to throw it and catch it while looking around absentmindedly. She suddenly spotted the news helicopter, giving you the impression that she was looking straight at you, and smiled before throwing the tank toward it. The news feed instantly stop replace by static and noise. <br>\r\n<br>\r\nTaking that moment to think, you couldn't believe what you saw! 500 feet tall. The image of the notebook passed through your head. Running to where you room would have collapsed to, you begin to search through the debris with Stacy, who followed you, looking at you confused.  <br>\r\n<br>\r\n</span></div></div>",
            "created":1447909200,
            "id":2064303,
            "title":"Giantess Jen"
        },
        "11211":{
            "author_id":"rforrose",
            "author_name":"RForRose",
            "choices":[
                "Jen",
                "Stacy"
            ],
            "content":"<div class=\"\"><div> <span>After searching for several minutes, you find the Size Note hidden among the debris. Snatching it up, you bold downstairs and begin searching for a pen or pencil while Stacy questions you.<br>\r\n<br>\r\n\"What the hell are you doing Nick? This is no time for your silly Journal. We need to figure out what to do about mom!\" she exclaims.<br>\r\n<br>\r\n\"I'm already doing something about it.\" you say back as you find a pen in a drawer. Grabbing it, you open the book the begin to writing.<br>\r\n<br>\r\n\"What do you mean you're doing something? All you're doing is writing in that silly Diary!\"<br>\r\n<br>\r\n\"It's not a Diary!\" you shout back. \"It's called a Size Note. It allows you to change someone's size by writing in it.\"<br>\r\n<br>\r\n\"You made Mom 500ft tall?\" She questions. You know what she's thinking. She either wants to make Jen bigger or make herself bigger. You're left with an interesting scenario. You can either alter Jen's size and stop her rampage, or alter Stacy's size to get her off your back. Quickly thinking, you write down...</span></div></div>",
            "created":1478062800,
            "id":2231588,
            "title":"A Book Among Wreckage"
        },
        "112111":{
            "author_id":"rforrose",
            "author_name":"RForRose",
            "choices":[
                "1,000ft",
                "Her Original Height."
            ],
            "content":"<div class=\"\"><div> <span>You quickly scribble down Jen's name. Stacy goes to grab the book but you slide it out of the way. You prepare to write a size to shrink Jen down to, but a thought crosses your mind. Jen was already amazing at 500 feet, but what if you made her bigger. As you mull it over, Stacy tries to knock you down so she can take the book, but you dodge and she falls to the ground. Finally deciding, you scribble down Jen's new size as...</span></div></div>",
            "created":1478062800,
            "id":2231682,
            "title":"Jen's Size"
        },
        "1121111":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "She uses them for sexual pleasure",
                "She's quite hungry and decides to eat her fill."
            ],
            "content":"<div class=\"\"><div> <span>As you mulled down what to do, you look down in the note at Jen's name already written awaiting a size input. You bite your lips. Even though Jen was a terrible person, you kind of wanted to see where this could go. Not giving yourself more time to think it over as Stacy tried to take the note out of your hands once more, you write down 1000 ft.<br>\r\n<br>\r\nAfter a few seconds, you can definitely hear and feel a distant booming no doubt announcing the arrival of Jen's size increase.<br>\r\n<br>\r\n<br>\r\n-------<br>\r\n<br>\r\n<br>\r\nJen was actually feeling a little annoyed at the moment. At first, she had fun with the little foot soldiers crushing their little army and vehicles into nothing, but when the jets fighters had arrived, she felt like she was dealing with resilient wasps. They flew around her too quickly for her to destroy them all, save a few she had hit with a lucky strikes, and their damn missiles hurt. Well... hurt as much as a wasp's sting did anyway, but still, it was annoying. To add fuel to the fire, those bugs had started tangling her in steel wires and she broke them easily at first, but she was beginning to get uncomfortable. <br>\r\n<br>\r\nIt happened then. As quickly as her first growth, she instantly could see further, everything becoming half as big as it was before. In moments, she could no longer feel the wires anymore, quickly breaking through all of them, and no missiles left more than a flicker feeling on her skin. Her growth had cause her feet to destroy yet untouched city blocks and brought a smug grin to her face.<br>\r\n<br>\r\n\"Well, whatever's causing this seems not about to stop isn't it?\" She asked the city lightly laughing at her new power and luck, the army now as intimidating as inoffensive ants <br>\r\n<br>\r\n\"Now, I was quite gentle with you until now...\" She started, getting on her knees. \"But now, I'm feeling kind of playful. And I am told that I can be a little mean when I'm playful. So... sorry in advance!\" She finishes giving the onlookers on the street beneath a cute puppy look with a pout before grinning lowering herself in the masses below.<br>\r\n<br>\r\n<br>\r\nPeople in the streets where trying to run away from the giantess oncoming body, but most weren't that lucky. With her powerful hands, she dug trenches in the streets like it was sand and trapped about two hundred people in a square island of asphalt. <br>\r\n<br>\r\nThe terrified people screamed at the gigantic bimbo grinning at them like they were her toys, and some tried their luck at climbing down in the trenches. Seeing a few of her toys trying to escape, Jen just passed a finger around the trenches, crushing or permanently disabling most of the escapees.<br>\r\n<br>\r\n\"Huh huh, don't try to escape me, I didn't give you the right to go away.\" She simply said, giggling, effectively stopping any escape attempt for the moment.<br>\r\n<br>\r\n\"Now what should I do with you all?\" She starts pondering putting on a sexy thinking pose. </span></div></div>",
            "created":1509944400,
            "id":2412044,
            "title":"Unstoppable"
        },
        "1121112":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "She manage to get back home",
                "The army find her"
            ],
            "content":"<div class=\"\"><div> <span>While dodging Stacy's assault, you quickly wrote down Jen's original size in the note. Whatever the reasons, you could not allow the massacre to go on!<br>\r\n<br>\r\nLooking at you with an angry stare, Stacy speaks.<br>\r\n<br>\r\n\"Why did you do that? Mom was a goddess! You should have let her stayed that way.\"<br>\r\n<br>\r\n\"Yeah right!\" Is your only answer as you finally feel the tremors stop.<br>\r\n<br>\r\n-------<br>\r\n<br>\r\nDown in the city, Jen is not amused. She felt like a fucking goddess! But now... she felt like a god damn worm. Naked in the huge crater made by her own feet moments earlier, she quickly realize that she isn't the apex predator anymore. Climbing out of her hole, she runs a few corner and manage to mix in the panicking throng of people in the streets luckily too scared for their life to recognize her now normal naked form.<br>\r\n<br>\r\nAs she crouch down in a small alleyway, she start to catch her breath and shake from anger. She hopes that she will have at least enough time to flee before the army realized that she had disappeared and came looking for her.<br>\r\n<br>\r\nAs she crouched there pondering, she heard a voice.<br>\r\n<br>\r\n\"Are you alright miss?\" She heard a man's voice.<br>\r\n<br>\r\nQuickly thinking she started sobbing playing the lady in distress. That guy was probably the kind playing hero when he fell on occasions like this one. Slowly, she grabbed a metal pipe laying on the ground without alerting the approaching man and continued sobbing.<br>\r\n<br>\r\nShe suddenly felt a soft hand on her shoulder.<br>\r\n<br>\r\n\"Do you need help? I coul--\" He didn't have time to finish his sentence as he was hit by the metal pipe held firmly by Jen. The man instantly fell to the ground, knocked out cold, and Jen lost no time disrobing him. She didn't fancy men clothing, but this would have to do if she wanted to escape.<br>\r\n<br>\r\nWhen she was all dressed, she finally exited the alleyway firmly putting the guy's cap on her head obscuring her eyes.<br>\r\n<br>\r\nMixing with the throng of people once again, she ran, planning to escape the city on foot and getting back to her home. Luckily, she didn't live that far, but still, by foot like this, it was a 2 hours run at least.</span></div></div>",
            "created":1509944400,
            "id":2412057,
            "title":"Incognito"
        },
        "112112":{
            "author_id":"rforrose",
            "author_name":"RForRose",
            "choices":[
                "You Decide To Grow Stacy To 500ft.",
                "You Decide To Shrink Stacy To 2in."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After writing down Stacy's name, you quickly think of what to write for her size. You could shrink her down, or make her bigger. Both would get her off your back.</span></div></span></div>",
            "created":1478062800,
            "id":2231677,
            "title":"Stacy's Size"
        },
        "1121121":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "\"I wrongly judged you Nick!\" She says with a smile",
                "\"That was stupid of you maggot!\" She laughs with an evil grin"
            ],
            "content":"<div class=\"\"><div> <span>Still wondering if you should shrink or grow your step sister, you were suddenly brought out of your reverie by Stacy's soft hand caressing your forearm. Looking at her with a raised eyebrow, she gave you an innocent look and started answering your silent question.<br>\r\n<br>\r\n\"Listen there Nick, I know we haven't always seen eye to eye you and and me, but, if you could grow me to mom's size, I would be eternally grateful.\" She finished, her tone getting smoky. <br>\r\n<br>\r\nYou looked at her still unsure. While holding your forearm, he was squirming like what she thought a cute child would look begging, but in her sexy yellow bikini, it was more alluring than anything else.<br>\r\n<br>\r\nYou know, you could not fully trust Stacy, but still you wanted to see where this could go with two of the sexiest women you knew of walking around 500 ft tall.<br>\r\n<br>\r\nWhile you were weighing down options, Stacy had come closer and took you by surprise by pressing her large breast in your chest, softly caressing your groin while whispering in your left ear.<br>\r\n<br>\r\n\"Come on lil' bro... I'll make it worth your while\" She sexily whispered in your ear before backing off.<br>\r\n<br>\r\nArousal clouding your judgment, you gulp and slowly write down 500 ft beside Stacy's name under her watchful stare.<br>\r\n<br>\r\nWhen your done, she clap rapidly while laughing and hopping giddily in the air. <br>\r\n<br>\r\n\"Thanks Nick! You're the best!\" She says and she flashes you the most beautiful and earnest smile you've ever seen from her.<br>\r\n<br>\r\n\"Here...\" She says as she crouches and lay the back of her hand flat on the ground. \"Climb on before I grow!\"<br>\r\n<br>\r\nWith a few seconds left, you quickly oblige and stand awkwardly on her small hand. Three uncomfortable seconds and a loud crash later. you find yourself on the biggest human palm you've ever seen. Following her arm connecting to her gargantuan naked ... huh... torso, you look up to see her blue eyes looking at you in amazement. You suddenly fall on your butt from the sheer craziness of the situation which brings a smile to Stacy's gigantic lips.<br>\r\n<br>\r\nSlowly, she begins to stand up, and you feel like your on a real fast elevator,  making you dizzy from the sudden increase in altitude. <br>\r\n<br>\r\n\"Oh my god Nick! This is incredible! Everything is so tiny, it looks like I'm in a toy city or something!\" She says her voice hoarse from excitement, as you feel as small tremor in her body.<br>\r\n<br>\r\nRushing to the limit of her palm, you look down and immediately fall to the ground from vertigo. When you trust yourself enough, you crawl to the edge and take a peek. She is right, you think, everything now is a play set for this giantess and her sexy mother. Speaking of which...<br>\r\n<br>\r\n\"Oh! Hey look over there, there's mom!\" Stacy's loud voice booms behind you.<br>\r\n<br>\r\nLooking in the distance, you indeed spot Jen still playing in the city. You also notice that Stacy's \"over there\" is in fact a few miles distancing the two gigantic beauties. But, after walking a short distance, not minding the chaos and destruction she left behind, Stacy finally reaches Jen who looks at her with bewilderment. <br>\r\n<br>\r\n\"Stacy?! You too?!\" She softly asks still holding a squirming soldier pressed on her nipple. <br>\r\n<br>\r\n\"Yeah mom! When you became a giantess, I felt so excited, I knew I had to become one too. So I asked Nick to grow me too!\" Stacy's says excitedly.<br>\r\n<br>\r\n\"Wait what?! Nick?\" Jen answers.<br>\r\n<br>\r\n\" Yeah!\" Stacy says extending her hand, showing you to her mom. \"He found this note that can grow and shrink people after ten seconds when he writes their names in it. he grew you first, and grew me when I asked him.\"<br>\r\n<br>\r\nUnder the watchful stare of the raven hair giantess, you squirm around, wondering how she is going to react.<br>\r\n<br>\r\n\"Well...\" Starts Jen.</span></div></div>",
            "created":1510030800,
            "id":2412077,
            "title":"Doubling the chaos"
        },
        "1121122":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "You reach the city and figure a plan to shrink and retrieve Jen",
                "Unknown to you, Stacy managed to rip a piece of the note while holding on it"
            ],
            "content":"<div class=\"\"><div> <span>\"Come on! What are you waiting for you idiot! Can't you see I'm waiting here! Just grow me already!\" Stacy barks at you while you ponder on what size to write to shut her up.<br>\r\n<br>\r\nUnimpressed by her rant, you give her a deadpan look before making up your mind. You had enough of that bitch hollering at you and since you had to deal with the more pressing issue of her giant mother destroying the city, you decided to do something you wished for a long time.<br>\r\n<br>\r\nYon scribble down the size of two inches beside Stacy's name and close the note.<br>\r\n<br>\r\n\"What did you write? How tall are you making me?\" Asked Stacy excited.<br>\r\n<br>\r\n\"Are you ready to rule over a city?\" You ask back.<br>\r\n<br>\r\n\"Oh my god! Yeah!\" She squeal happily.<br>\r\n<br>\r\n\"Well you won't\" You finish chuckling and manage to make her stop dead frozen looking at you with wide eyes.<br>\r\n<br>\r\nThat is, until she suddenly disappear leaving behind her yellow bikini top and bottom laying on the floor. You couldn't help yourself but look in disbelief. Even though you knew it would work, it was still the first time you saw it happen in person. Seeing something move below among the bikini pieces,  you got closer and spotted a miniature version of Stacy frozen in fear while looking at your giant form.  Even this tiny, you still noticed how hot Stacy was, and now being naked, you felt yourself getting a little harder. <br>\r\n<br>\r\nAfter a while of watching each other, Stacy seemed to find her voice once again.<br>\r\n<br>\r\n\"What the fuck did you do to me you fucking bastard! Chang me back this instant! Do it now, NOW!\" She bellowed at you.<br>\r\n<br>\r\nYou couldn't believe how she could sound so loud with such a tiny voice. But tired of her bitching, you decided to put her in her place.<br>\r\n<br>\r\n\"Shut your mouth!\" You say loudly, knowing that your voice must be much stronger to her than for you. And it effectively managed to shut Stacy up.<br>\r\n<br>\r\n\"From now on, you don't get to decide anything unless I ask you to, got it?\" You tell her looking menacing. As she keeps silent you nod approvingly.<br>\r\n<br>\r\n\"Good, now come here!\" You say reaching for her tiny form with two fingers. Seeing your immense fingers closing in on her, she starts to run away in the other direction screaming, but with her little leg, she could never hope to outrun you. You quickly catch and bring her to your face.<br>\r\n<br>\r\nBeating on your thumb with her fists, you smile as her biggest effort are reduced to nothing in front of your superior size. <br>\r\n<br>\r\n\"Don't waste your energy little Stacy, I barely feel you.\" You say chuckling, making her stop and look at you shivering.<br>\r\n<br>\r\n\"You know...\" You start moving her in the palm of your hand. \"Even at this size, you have quite a big rack.\" you say rubbing her big tits with your thumb. She holds out her arms up, trying to stop you from groping her, but once again, you prove yourself too strong for her to do anything.<br>\r\n<br>\r\n\"Stop it Nick! Please!\" She screams. Hearing her plead, you feel something inside of you, but you stop nonetheless.<br>\r\n<br>\r\nFeeling a tremor in the ground, you are reminded of your giant stepmother still wreaking havoc somewhere out there. <br>\r\n<br>\r\n\"Well, Stacy, I've got to go put a stop to your giant bitch of a mother. So for now, you will be a good girl and stay here.\" You say dropping her on the kitchen islet.<br>\r\n<br>\r\nYou turn around and are about to walk off, but you feel something small landing on the size note you hold in your left hand. Looking, you see that Stacy had jumped and held tightly to the note edge.<br>\r\n<br>\r\n\"Well, that was a very nice and daring try.\" You admit. \"But I told you to stay here!\" You say, giving the note one good shake, effectively shaking off Stacy who fell back on the islet. With that you step back while Stacy is still shaken and walk off for good this time heading toward the epicenter of the current earthquake. Now your challenge was not only to shrink Jen, since you could do it from right here, you had to shrink her and retrieve her before the army did.</span></div></div>",
            "created":1510030800,
            "id":2412282,
            "title":"One down, one to go"
        },
        "11212":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Follow Nick's POV",
                "Follow Stacy's POV"
            ],
            "content":"<div class=\"\"><div> <span>What craziness was this!<br>\r\n<br>\r\nThe day had started as normal as it could be and Stacy had been sunbathing for an hour or so, perfecting her tan in the backyard at the poolside. She could hear Nick mowing the grass and after some time hear him get inside. However, a few minutes later, a loud crashing sound was heard as her mother suddenly became a giantess and had crushed a part of the house with her left foot. <br>\r\n<br>\r\nStacy couldn't believe her eyes. There stood her mother, 500 feet tall giant, naked and confused. <br>\r\n<br>\r\n\"What the...\" Boomed the loud voice of Jen.<br>\r\n<br>\r\nLooking around, the giantess placed her hands over her mouth in awe. Soon enough though, a small grin began to form on her lips.<br>\r\n<br>\r\n\"I'm a giantess... I'm a fucking giantess!\" Jen said excitedly.<br>\r\n<br>\r\nSeemingly noticing something out of view for Stacy, Jen put her hands on her hips before walking off with a sexy stride.<br>\r\n<br>\r\n\"Well lookie what we have here...\"<br>\r\n<br>\r\nThat was the last Stacy had seen from her mother before she went to town.<br>\r\n<br>\r\nTaking a few moments to catch her breath Stacy tried to calm down. She could hear police sirens in the distance and people screaming. She was still shaking when she felt something between her legs. She was becoming wet. That's when it hit her. She wasn't shaking from fear, she was shaking from excitement. Running Inside the house, she found Nick laying on the floor near the remains of the stairs. Maybe he knew what had happened.<br>\r\n<br>\r\nShaking him awake, however didn't seem to be much useful since he looked as confused as her while still being dazed.<br>\r\n<br>\r\n\"What the fuck is happening Nick?! One moment I'm sunbathing in the back yard, and the other, mom turns into a giantess out of nowhere and goes into town.\"<br>\r\n<br>\r\n\"What?\" he asked groggily.<br>\r\n<br>\r\n\"<i>Ughh! What a useless guy!</i>\" She thought.<br>\r\n<br>\r\nTaking out her cell phone she had been holding while sunbathing, she  quickly manages to find a live Stream from a news channel featuring her mom. Watching that much power from a person she knew and loved, was making her more excited and a little bit jealous. Why couldn't she be with her mother right now, having fun with those puny people running from her mightiness. <br>\r\n<br>\r\nSuddenly, Nick bolted out of the room and began searching through the wreckage that was the front of the house. He seemed to be looking for something. Stacy Watch him from rummaging though rubbles to take out some random note book before throwing it away and finding another one, throwing it away also and keep doing that.<br>\r\n<br>\r\nLooking at her side, she noticed something beneath the rubble and lean forward to free it from Under it. It was a simple black note book with the title \"Size Note\" written on its cover. Her eyes shot opened however when she saw what was written inside.<br>\r\n<br>\r\nA list of rules all about changing the size of a person using this note. And on the first page, her mother's name with 500 feet tall written beside. <br>\r\n<br>\r\nShe couldn't believe it!<br>\r\n<br>\r\nShe couldn't believe it and yet, she had witnessed it with her own 2 eyes. This book had the power to grow and shrink people!<br>\r\n<br>\r\nShe held that power in her hands. She could become what her mother had been! A towering giantess playing in a tiny city full of inhabitants afraid of her tiniest movement. She could be more than her mother was. Unstoppable!<br>\r\n<br>\r\n\"Stacy!\"<br>\r\n<br>\r\nLooking back up, Stacy could see that Nick had spotted her with the note book in her hands and was now advancing toward her.<br>\r\n<br>\r\n\"That's mine give it back!!\" He shout angrily.<br>\r\n<br>\r\n\"Fuck you!\" She answers while he tries to yank it from her hand.<br>\r\n<br>\r\nWithout warning, Stacy landed a kick to his groin and Nick doubled over taken over by pain.<br>\r\n<br>\r\nTaking this opportunity to run to the living room, Stacy quickly take hold of a pen before writing her own name in the note book. The size which followed was the same as her mom: 500'!<br>\r\n<br>\r\nWhile counting up to ten her limbs shaking with excitement, she saw Nick painfully walking in and accelerating when he sees her. However, this time, Stacy is grinning and walking toward him which makes him stop wondering what she's thinking.<br>\r\n<br>\r\nShe quickly hold her body against his pressing her firm breasts tightly against his chest. She grab the back of his head and pull it in her cleavage before whispering in his ear:<br>\r\n<br>\r\n\"9... 10!\" With a sexy grin.<br>\r\n<br>\r\nRealizing his mistake, Nick try to brake free, but she managed to hold him over her cleavage just long enough.<br>\r\n<br>\r\nCRASH!!<br>\r\n<br>\r\nStacy instantly became 500' tall! Her bikini had disappeared, probably staying the same size it had been, and she was now standing naked over what look like a miniature town. Now the houses didn't even reach her big toe! When she looked in her right hand she could spot the tiny tiny note book that didn't grow with her. She would have to keep it out of others hands. Finally she felt something move beneath her left hand still pressed against her breasts. Slowly rotating her hands so that whatever was there wouldn't fall, she recognized the tiny figure of her step-brother on all four trying to stabilize from the jiggling flesh. Seems like he had remained in the same spot when she grew meaning he was now stuck on her gigantic bosom. Looking up suddenly, Nick let out a smell yelp, which must have been much louder to him, and made Stacy grin at his puny form.<br>\r\n <br>\r\nGiggling loudly she looked at the rest of the world before exclaiming:<br>\r\n<br>\r\n\"This will be so fucking fun!\"<br>\r\n<br>\r\nSomewhere, a figured smile before taking flight.</span></div></div>",
            "created":1447909200,
            "id":2064344,
            "title":"But she does..."
        },
        "1122":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Jeff helps tiny Jen",
                "Jeff have fun with his new tiny sexy neighbor!",
                "Jeff abandons Jen right here"
            ],
            "content":"<div class=\"\"><div> <span>You pitied the poor Jeff being yelled at by that crazy bitch. However, you couldn't help but find it funny that he seemed to be shrinking in front of your step mother. <br>\r\n<br>\r\n\"There if it helps you a little Jeff\", you say while scribbling down Jen's name in the note book followed by the size of 2 inches tall.<br>\r\n<br>\r\nWith that, you close the note book and go downstairs to Watch TV.<br>\r\n<br>\r\n<br>\r\nOutside however, the situation is not as simple. Jeff who had almost his eyes closed from the assault of his sexy neighbor almost missed the fact that everything suddenly stopped. Looking around he couldn't see where the woman that was previously screaming at him had went. After a few second he was almost tempted to go when He saw his dog sniffing something in front of him. It was Jen's clothes discarded and laying on the ground where she was standing moments ago. And that when he heard a tiny scream.<br>\r\n<br>\r\nJen was poking Jeff hard in the chest when suddenly she only hit air. Instantly, she found herself naked and covered by a pile of fabric. Panicking, she quickly tried moving around to free herself from the prison she found herself in. When she finally managed to get out, she couldn't grasp what was happening to her. However, the reality quickly became obvious to her when she noticed how gigantic her surrounding had become! From the fence to the flowers, everything dwarfed her. Even the blades of grass freshly mowed where about her height! Out of a sudden, hearing a loud sniffing sound, she turned around and came face to nose with a huge fury beast! Letting out a scream She turned and run when she heard a louder voice still!<br>\r\n<br>\r\n\"Stay!\" Said Jeff to his dog. <br>\r\n<br>\r\nMaking sure the dog wouldn't move, he he crouched down to get a better view at the small form standing atop the clothes. To his surprise, it was none other than Jen now reduce to the small size of 2 inches tall and naked!<br>\r\n<br>\r\n\"What the...\" Said Jeff to no one in particular.<br>\r\n<br>\r\nScreaming yet again and covering herself from the giant in front of her, Jen tried to run away from the towering figure.<br>\r\n<br>\r\nAnd then, without warning, he reached and Grabbed her in his fist. <br>\r\n<br>\r\nThe experience was terrifying for tiny Jen, The colossal man that Jeff had become second ago bent down to grab her. Even with her biggest struggle, she was unable to make him move. He seemed to be holding her without any effort and yet she was unable to free herself from his iron grip. He finally brought the tiny woman to his face.<br>\r\n<br>\r\nLooking at the huge face watching her intently, she felt scared and angry. God What had she done to deserve this? She was perfect in every sense of the word, she should be the one holding his pathetic life in her hand! <br>\r\n<br>\r\nLooking at his blue eyes, she noticed the dumbfounded face he had. He seemed confused. <br>\r\n<br>\r\n\"So he wasn't the one who caused this\" she thought, maybe she could still twist him around her finger . Well now it was the other way around but still, she could use him to find a way to become normal once again!<br>\r\n<br>\r\nTaking best scared look, which wasn't really hard right now, She cried out at him.<br>\r\n<br>\r\n\"Jeff! Please help me! What happened? I'm scared please do something!\"</span></div></div>",
            "created":1447995600,
            "id":2064370,
            "title":"Role reversal"
        },
        "1123":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "She brings him inside to play",
                "She punishes him for the dog's poop",
                "She searches for the origin of his shrinking"
            ],
            "content":"<div class=\"\"><div> <span>You pitied the poor Jeff being yelled at by that crazy bitch. However, you couldn't help but find it funny that he seemed to be shrinking in front of your step mother. <br>\r\n<br>\r\nGetting back to your desk, you write Jeff's name in the the notebook followed by the size : \"2 inches tall\" before closing the notebook.<br>\r\n<br>\r\n\"That's probably where he'll end up if he don't get away soon\" you laugh not believing the powers of the Size Note.<br>\r\n<br>\r\nWith that, you push your chair under the desk and you go Watch some TV downstairs. <br>\r\n<br>\r\n<br>\r\nJen was still bitching about the turd in front of her house when the magic came to work. She was poking Jeff hard in the chest adding a new insult every time she did. But on the last one, her finger didn't connect. Jeff had simply disappeared from sight. His dog now free from his restraint quickly ran away from her dominant figure and disappeared around the next street corner.<br>\r\n<br>\r\n\"What just happened?\" Jen asked herself.<br>\r\n<br>\r\nLooking around, she couldn't find any traces of Jeff. But, looking at the ground, she noticed the clothes that he was wearing  were laying there in a pile in front of her just where Jeff was standing. She looked around in confusion searching for an explanation on how the man had managed to disappear like that.<br>\r\n<br>\r\nHowever, unknown to her, you had just thrown Jeff's life around by shrinking him to the tiny size of 2 inches tall. Standing naked and confused under the pile that were his giant clothes, Jeff thought that the day could not be any worse. He was wrong and he understood right away when he managed to get out. In a matter of seconds, the sexy woman yelling at him had just turned from annoying and a little scary, to enormous and terrifying! Towering in front of him was a 200 feet tall version of Jen, his sexy neighbor. Quickly looking around he noticed that she wasn't the one who had grew, he was the one who had shrunk! The white wooden fence around her property seemed like the walls of a huge castle and in front of him stood the biggest and scariest human being he had ever seen.<br>\r\n<br>\r\nFrom the white sandals, he could only lift his gaze following her long and gigantic legs to her firm and sexy butt in tight denim shorts that made any man wishes to grab it with both hands. Still looking up above her slim midriff and the huge form that was her breast barely contained by her white top tightly tied beneath her bosom, he could not see her face.<br>\r\n<br>\r\nJen, for her part, unaware of the sight she was for the tiny man, was looking around confused. How in the hell did he managed to disappear like this leaving only his clothes behind. Was he vaporized? Her eyes were suddenly drown to the pile of clothes as she saw something move from the corner of her eyes. A tiny figure stood on the pile of clothing. Leaning forward, she got a better view of the shape and she gaped at Jeff's tiny form gaping back at her from his 2 inches tall stature.<br>\r\n<br>\r\n\"Oh my god!\" She gasped in disbelief as she got on all for the get a even better view. \"Jeff... is this.. how can this be?!\" She whispers.<br>\r\n<br>\r\nFrom Jeff side however, things were far more intimidating! While he took a look at his surroundings and his giantess neighbor, he had locked eyes with her and froze. Slowly, he saw her bent forward, her breasts pressing heavily against the fabric of her shirt creating a huge cleavage, and look directly at him, letting out a gasp. Her electrifying blue eyes paralyzing him in place. And then she got on all four like a giant feline. He felt like a mountain was falling right before him while he stood frozen in awe.<br>\r\n<br>\r\nJen was still trying to wrap her head around the situation when she saw the tiny man's dick starting to bulge as he was involuntarily aroused from her huge powerful form. And that caused her to grin... A real man to toy with as she pleased!<br>\r\n<br>\r\nJeff, spotting her grin was now terrorized and turned around and try to put as much distance as he could between him and the huge bitch. Hearing a loud giggle however, he knew that his attempts where pitiful in the eyes of Jen.<br>\r\n<br>\r\n\"Oh no you don't\" She simply said before placing her hand right in his path, making the tiny man collide with her palm and falling on his butt. She let out a small laugh before she simply snatched him from the ground to slowly bring him to her face.<br>\r\n<br>\r\nHolding him between two fingers, Jen couldn't believe what she was seeing. A man, a real live man pinched between her thumb and forefinger wriggling uselessly against the small pressure she was exerting. <br>\r\n<br>\r\nOh the possibilities...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1447909200,
            "id":2064366,
            "title":"Unfairness"
        },
        "11232":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Stay with Jen",
                "Go back to Nick"
            ],
            "content":"<div class=\"\"><div> <span>Holding him between two fingers, Jen couldn't believe what she was seeing. A man, a real live man pinched between her thumb and forefinger wriggling uselessly against the small pressure she was exerting. <br>\r\n<br>\r\n\"Well well well! How does the saying goes? We sow what we reap?\" Jen taunt the little man.<br>\r\n<br>\r\nBeing held firm in front of her beautiful face, Jeff finally broke down.<br>\r\n<br>\r\n\"What I reap?! My dog only took a little dump in front of your house! Not even in your yard and now, I don't know why, but I'm shrunk!! I'm scared shitless please you have to help me!\" He cried.<br>\r\n<br>\r\nBut to his chagrin, Jen's grin only got wider. <br>\r\n<br>\r\n\"Help you? Why? Now that things are the way they should be! And what was that you said about a small dump?\" She asked while walking on the sidewalk.<br>\r\n<br>\r\nJeff didn't understood what she meant until she bent down once again and held him over the now enormous pile of shit that was his dog poop.<br>\r\n<br>\r\n\"It's not that small now is it?\" She says laughing and bringing him closer to the poop. <br>\r\n<br>\r\n\"NO IT'S NOT! IT'S NOT!!\" Screamed tiny Jeff only heard by Jen holding him firmly.<br>\r\n<br>\r\nAnd without warning, she put his head in the turd and wiped him against it just like she would have put salsa on a nacho.<br>\r\n<br>\r\n\"Maybe now you will remember to not let your dog poop in front of other people home hmm?\"<br>\r\n<br>\r\nUnable to cope with the smell and the taste filling his mouth, Jeff threw up right away, his vomit falling on the shit he was being rubbed against.<br>\r\n<br>\r\nWhen she was done with the torture, Jen stood straight back up and look at the tiny man full of shit.<br>\r\n<br>\r\n\"Oh god you smell!\" She says faking a gasp and dropping him to the ground.<br>\r\n<br>\r\nJeff landed very painfully on his back. He probably had the majority of his bone broken from the fall. Wheezing, he look up one last time to see Jen sexily waving at him, blowing him a kiss before bringing her foot above him and pressing down. He didn't even have the strength to scream and passed away in silence.<br>\r\n<br>\r\nWiping her sandals on the sidewalk, Jen smiled at the tiny red spot left on the concrete. She let go of a breath she didn't know she had been holding. Excitement rushing through her body. But now that it was over, she regret the she didn't make it last longer. She had probably witnessed a freak event of nature, one that she wouldn't see ever again and she had ended it in less than 2 minutes. However, there was no use fretting over it. She could only hope that luck will be on her side and that she would witness something of the sort again. She grabbed Jeff clothes and brought them inside.</span></div></div>",
            "created":1509598800,
            "id":2410331,
            "title":"A small dump is a huge matter"
        },
        "113":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "\"Well I don't know about that!\" And write something down...",
                "\"Yeah right that's ridiculous!\" And hands you then note back...",
                "\"Humph whatever...\" And just set it by her side..."
            ],
            "content":"<div class=\"\"><div> <span>You didn't know why, but the notebook looked so mysterious to you. You couldn't help but look at it. After a small moment though you realize that it's still pretty hot outside and having just finished mowing the lawn, you thought that you could have a small dip in your pool to cool off a little. Taking of your sweaty clothes and putting on your swim trunks and a towel, you take a good look at the notebook before grabbing it with a pen inside and making your way to the backyard.<br>\r\n<br>\r\nOpening the door, you feel the warm ray of the sun hitting your body as you walk toward the pool. Unsurprisingly, you see that Stacy has taken her usual spot on a floating long chair in he middle of the pool. Wearing large sunglasses and a yellow bikini to small for her, which seemed to be the first requirement to any piece of clothing that she owned, you couldn't help but stare at her sexy form absorbing the heat from the high sun to perfect her already perfect tan. Her oiled skin was glistening in the hot early afternoon and you felt yourself get a little hard just from looking at her unmoving form. She was a bitch, but damn was she hot! <br>\r\n<br>\r\n\"Like what you see bro?\" Asked suddenly the still unmoving Stacy, taking you out of your daydream. \"I already told you, if you become my personal slave, I could agree to let you have a small something in return.\" She adds, her hand lazily caressing the top of her breast.<br>\r\n<br>\r\nThat was Stacy all over. More than often have you heard her say that sentence and not only to you. She and her mother had a huge dominating complex and knew how to twist men around their fingers. You however, had learned to stay immune to their spell other than taking a quick peek now and then just like you had done a moment ago.<br>\r\n<br>\r\n\"I was just wondering if you would spend the whole summer on that chair. Do you want me to bring you covers to spend the night?\" You answer nonchalantly.<br>\r\n<br>\r\n\"No thanks, but if you want to serve me so much, why don't you fetch a drink for your mistress?\" She says.<br>\r\n<br>\r\n\"Whatever\" You grumble and you hear her giggle in response.<br>\r\n<br>\r\nThe both of you falling silent once again and you dip your feet in the cool water sighing in appreciation. Taking the note out you inspect it once again reading the rules and imagining what power that book could contain if it's power were true. Looking back at Stacy, you see her raising her glasses over her head fixing the book you hold with curiosity.<br>\r\n<br>\r\n\"What's that? Didn't know you had a diary.\" She starts with a small mocking tone.<br>\r\n<br>\r\nYou huffed.<br>\r\n<br>\r\n\"As if. That's some kind of notebook that claims to have magic powers I found on the lawn. Probably made by a kid with too much imagination who dropped it on it's way to school.\" You answer nonchalantly.<br>\r\n<br>\r\n\"You believe in magic... you?\" She giggles<br>\r\n<br>\r\n\"I don't. If there was some hocus pocus stuff that existed, believe me, I would learn all about it to get out of here already.\" You scoff.<br>\r\n<br>\r\n\"Let me see.\" Stacy asked reaching in your direction. While she bent slightly over, her heavy set of breasts pushed firmly against her tight bikini top forming nice cleavage and your eyes were drawn to it involuntarily. Quickly catching yourself, you try to hide your lapse of attention by reaching over yourself and handing her out the notebook and pen. As you do however, she gives you a small grin letting you know that she caught you staring. Damn she was quick. You speak up to change the unspoken subject.<br>\r\n<br>\r\n\"Don't see why you would be interested. There's nothing interesting in this.\" You say, but Stacy is already reading the rules.<br>\r\n<br>\r\nWhen she is done, she looks up and say...</span></div></div>",
            "created":1450674000,
            "id":2077762,
            "title":"Stacy at the pool"
        },
        "1131":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Pulled on her bikini bottom ...",
                "She separated her breasts...",
                "She pushed the ground and got up..."
            ],
            "content":"<div class=\"\"><div> <span>\"What do you mean?\" You ask.<br>\r\n<br>\r\n\"I think the concept is quite interesting don't you think? To control one's size and all that!\" She answer giggling.<br>\r\n<br>\r\n\"Who's believing in magic now huh?\" You snort.<br>\r\n<br>\r\n\"I never said I believed in magic, you idiot.\" She says getting on the defensive. \"I just said it was interesting that's all.\"<br>\r\n<br>\r\n\"Well whatever, give it back.\" You say not liking being called an idiot.<br>\r\n<br>\r\nAt that she reels back and smile widely holding the note to her chest.<br>\r\n<br>\r\n\"Why? Afraid I might use this to shrink you?\" She asks, giving you a grin grabbing this opportunity to taunt you.<br>\r\n<br>\r\n\"Yeah right.\" You say nonchalantly reaching over to grab it from her. You didn't care about the book, you just didn't wanted to give Stacy the satisfaction of taking something else from you.<br>\r\n<br>\r\nBut during your short conversation she had floated a little too far away and was just out of your reach.  You didn't want to embarrass yourself by falling over, so you just sat back sighing at this small failure. This gave Stacy a boost in confidence though. You couldn't believe how every small gesture was a competition between the two of you.<br>\r\n<br>\r\n\"Aww. Nick doesn't want to get shrunk by big meanie Stacy?\" She laughed while opening the book once more to an empty page. You only watched her trying to look bored.<br>\r\n<br>\r\n\"Well too bad, looks like Nick is going to see what it feels to be one inch tall.\" She adds giggling still while writing something down in the note. You began to do circling motion with your hands to tell her to get on with it. But she just slaps the note close and continues her rant.<br>\r\n<br>\r\n\"You would be so cute so tiny and helpless, standing shivering in my palm in front of my great and magnificent form.\" She says while petting and invisible figure in her open palm. <br>\r\n<br>\r\n\"I bet I could just take you and.... What the fuck!\"<br>\r\n<br>\r\n___________________________________________________<br>\r\n<br>\r\nYour thoughts echoed the huge voice you heard. What the fuck! One moment you were listening to Stacy, being a bitch, and the next you sat naked in the middle of a round enclosure that looked made out of fabric. Then, from somewhere around, you heard a loud voice call your name and a splash.<br>\r\n<br>\r\nIt didn't take long to put two and two together, but your mind still rejected the concept. You charged at the walls climbed the soft surface until you could see something else than your oversized swimming trunks. As soon as you did though you wished you hadn't, because you came face to face with your stepsister. Well not face to face per say since you were on the pool edge, and it was the part of the pool which was shallow. You were met by the biggest belly button you had ever seen. The sexy toned stomach stood like a glistening pillar that seemed to hold  two huge spheres hundreds of feet in the air tightly held against the structure by a small, compared to the girl, bikini top. And above your stepsister's now gigantic breasts, her face could be seen with an expression of shock in her eyes as she held a hand to her mouth and stared at you without saying anything.<br>\r\n<br>\r\nYou gulped in fear int front of the titaness. She dwarfed you out of reason and she did it only with her upper body. That fucking book was real. You had to thread lightly because as of now, your fate heavily depended of Stacy's good will, and you weren't sure that it even existed in the first place.<br>\r\n<br>\r\n\"Stacy...\" You try. But you don't speak loud enough and she only stare at you in response still shocked.<br>\r\n<br>\r\n\"STACY!\" You try louder and she seems to click back to reality.<br>\r\n<br>\r\n\"Oh my god...\" She whispers. \"Oh my god, oh m god, oh my god!\" She says still shaken.<br>\r\n<br>\r\n\"Stacy, please, you have to undo this!\" You speak up loud enough. <br>\r\n<br>\r\n\"Yes! Uh no! Uh yes of course! Wait, huh...\" She answer nervous trying to do all at once. \"Oh my god!\" <br>\r\n<br>\r\n\"Calm down! Just get the note and grow me back!\" You try to sound lucid and focus on one thing, but you have an hurricane of emotion inside you threatening to break out. <br>\r\n<br>\r\nStaring at you, she seems to calm down. As she still looks at you in disbelief, a small smile ever so slightly appears on her mouth. <br>\r\n<br>\r\n\"Oh my god... you are so tiny...\" She whispers bending over with a finger extended. From your point of view however, it looked like a huge building was falling atop of you and your body moved by reflex making you tumble back down in your swimming trunks. As you laid back on the hot cement, you saw Stacy's huge digit finally reach your position and poke you slightly before poking you harder with more assurance. Groaning, you can only look up at the giantess smiling at your puny form pressed under her finger.<br>\r\n<br>\r\n\"You are tiny... so tiny... One inch tall in fact!\" Her smile grew wider as she quickly looked at the note she held in her other hand before bringing her gaze back to you.<br>\r\n<br>\r\n\"Stacy, grow me now!\" You ask frightened and frustrated by the situation. You had read the rules of the book too. You know it was possible! But your blood only froze in your veins when you saw her gigantic lips slowly curl on one side of her mouth giving you a sexy smug grin as she realized the position you both found yourself in. <br>\r\n<br>\r\n\"And why would I do that Nick?\" She says reeling her hand back in her setting it on her hip, treating you to a sexy pose.<br>\r\n<br>\r\n\"You can't be serious?\" You say, shaking.<br>\r\n<br>\r\n\"Oh this is serious all right.\" She answers while climbing out of the pool on all four until all you could see was her face with her blond hair cascading on one side and her mammoth breast looming menacingly near your position, threatening to spill and crush you under their enormous weight.<br>\r\n<br>\r\n\"This book is incredible! I can't believe that I now own a one inch tall man because of it!\" She adds in wonder.<br>\r\n<br>\r\n\"You don't own me Stacy!\" You yell at her.<br>\r\n<br>\r\nShe only grins at you before, to your surprise, she blows at you, knocking you off your feet by the sudden and strong gust of wind. You hear her laugh loudly above you before you are grabbed roughly between her thumb and forefinger. You lose your sense of direction as she rolls on her back holding you in front of her face still grinning at you. <br>\r\n<br>\r\n\"I can't believe I'm saying this Nick, but the little war we had is over now. You lost. And as winner, I get to keep the spoils. So like it or not, you are now mine!\" She says still laughing.<br>\r\n<br>\r\n\"I'm not going to be your slave Stacy!\" You yell defiantly, moving roughly against her two incredibly strong fingers.<br>\r\n<br>\r\n\"Oh, don't worry, you're not going to be my slave Nick!\" She says in a sweet tone as if consoling you.<br>\r\n<br>\r\n\"I'm not?\" you ask, an unreasonable spark of hope lighting in your heart.<br>\r\n<br>\r\n\"No, you're much too small to serve me. That's why you are going to be my toy!\" She finished, laughing once more and extinguishing what little hope you had. Then calming herself, she shoots you an hungry look. Biting her bottom lips, she slowly move your body southward while with her other hand she...<br>\r\n<br>\r\n  <br>\r\n<br>\r\n<br>\r\n <br>\r\n<br>\r\n</span></div></div>",
            "created":1477458000,
            "id":2228754,
            "title":"Poolside feud"
        },
        "114":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Playboy Channel",
                "Sports Channel",
                "Screw TV, let's use this somewhere else..."
            ],
            "content":"<div class=\"\"><div> <span>Taking the note with you you get down to the living room. Sitting on the sofa, you grab the TV remote and turn it on. You flip through the channels before you stop on the local news channel. The news reporter, a blond man wearing a suit, is talking about report of an incoming heat wave that should last until the end of the week. The camera then switch to the weather girl linking the forecasts with the reports from before. <br>\r\n<br>\r\nYou can't help but notice that she is sweet on the eyes. She is a beautiful brunette with green eyes wearing a red summer dress. She has nice long pir of legs and looked like she was a B-Cup. Feeling naughty, you open the size note and read the rules over once more.<br>\r\n<br>\r\n\"Can't hurt to try\" You say to yourself, before writing the name of the weather girl in the note. But before writing anything else, you write the word \"Breasts\" and C-cup.<br>\r\n<br>\r\nWaiting a little you get up in amazement when you see her bust instantly filling her top and the girl, confused trying to hide what was not visible before. The camera goes back to the main reporter who improvise to cover up the incident but you don't care, you are now watching the note book in your hands. Grinning, you open it once more and write the name of the male reporter this time with the mention \"3 feet\" beside. You also quickly add \"10 minutes\" before closing the book and looking intently at the screen. True enough, you notice the reporter slowly shrinking in size, his clothes becoming baggy around him. At first, he tries to remain professional, but the weirdness of the situation quickly send him panicking. The feed suddenly changes to commercial when the guy hits four feet and you know that they're must be freaking out over there.<br>\r\n<br>\r\nYou laugh as you see this and you get more and more excited!<br>\r\n<br>\r\nOpening the menu, you stroll through the list of channels you are subscribed to. <br>\r\n<br>\r\nGrinning you find the next channel to mess with...</span></div></div>",
            "created":1450674000,
            "id":2077802,
            "title":"Testing the note"
        },
        "1141":{
            "author_id":"dudo",
            "author_name":"CuriousChloride",
            "choices":[
                "Playboy Channel",
                "Another erotic channel",
                "Internet"
            ],
            "content":"<div class=\"\"><div> <span>Playboy Channel catch your interest. The woman looks gorgeous. It is a hard decision to choose from all these babes. But you also knew, you should try out some other channels and sources like the internet. You have to choose from all these possibilities.</span></div></div>",
            "created":1533445200,
            "id":2529421,
            "title":"Playboy Channel"
        },
        "11413":{
            "author_id":"dudo",
            "author_name":"CuriousChloride",
            "choices":[
                "Gracie Lewis",
                "Another Woman"
            ],
            "content":"<div class=\"\"><div> <span>You jump above the couch and walks towards the table with laptop lying on top. You open it up and start searching through a few websites which had thousands of pictures of nice women. After a while, one of the women catches your eyes and you click on the profile. There was also the ability to watch the live stream if she is online. Her name was ...</span></div></div>",
            "created":1533445200,
            "id":2529425,
            "title":"Internet"
        },
        "114131":{
            "author_id":"dudo",
            "author_name":"CuriousChloride",
            "choices":[
                "100ft",
                "Another size."
            ],
            "content":"<div class=\"\"><div> <span>Picture: <a rel=\"nofollow\" href=\"https://imgur.com/a/6b2Y67j\" target=\"_blank\">https://imgur.com/a/6b2Y67j</a><br>\r\n<br>\r\nYou watch her moving around in the room. You thought about what you can do now with her. Her body was perfect, no more changes are needed. Also, you don't want to ruin her body with a joke like growing her breast to giant size. Giant size doesn't go off your head. The camera now goes to another perspective, showing her sitting on the couch. The camera must lie on the ground to get this view because you could see her white shoe soles near and the rest of the body in distance like you were standing shrunken in front of her. You thought to make her bigger because you have seen that she looks not bad at all if she would be big. Also, her outfit was beautiful and her hairstyle looks nice. But before you write down her name in the book you checked her position. You had luck the studio from where she is filming is in a city nearby your hometown.<br>\r\n<br>\r\nSize?</span></div></div>",
            "created":1533445200,
            "id":2529445,
            "title":"Gracie Lewis"
        },
        "1141312":{
            "author_id":"dudo",
            "author_name":"CuriousChloride",
            "choices":[
                "50 Miles",
                "Another size"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why not make her a \"BIG\" girl. </span></div></span></div>",
            "created":1533445200,
            "id":2529447,
            "title":"Another size."
        },
        "1143":{
            "author_id":"dudo",
            "author_name":"CuriousChloride",
            "choices":[
                "Jen ",
                "Your girlfriend which is coming ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You get your shoes on and get out of the door. You walk around in the neighborhood looking for your next target. After a few minutes, you had chosen your target.</span></div></span></div>",
            "created":1513573200,
            "id":2429700,
            "title":"Screw TV, let's use this somewhere else..."
        },
        "11431":{
            "author_id":"dudo",
            "author_name":"CuriousChloride",
            "choices":[
                "Run in this direction",
                "You run in the opposite direction "
            ],
            "content":"<div class=\"\"><div> <span>You look toward the garage where Jen is getting off her car, shutting the the door. You still can't believe how sexy she looks with her black sunglasses, black high heels opened at her toes and tight dress on. As you pass her on her way to the door of the house, you notice her giving you a sexy smirk. You made your mind in a flash as you swiftly sit down on one of the chairs which stand outside with a table. You write down Jen's name followed by 500ft with clothes, in the book and wait to see what will happen. For a moment, you are distracted by a noise and you turn  to look toward the road and suddenly hear a loud explosion behind you. <br>\r\nHowever, a heavy smoke suddenly envelop your body and is now preventing you to see anything around you. You dash to the other side of the street hoping to see anything from the loud explosion that came from your house, but as you run , you bump into a stopped car you don't see it because the smoke was so tight. You hear a booming voice saying :\"Wow Ummm ok that's awesome\". Then you hear a woman scream and a loud crashing sound and a loud giggle from above. Then, the loud crashing sound is repeated again and again, like someone is walking and it goes fast in the distance. You...<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1513573200,
            "id":2429704,
            "title":"Jen "
        },
        "114312":{
            "author_id":"dudo",
            "author_name":"CuriousChloride",
            "choices":[
                "to let her on this size",
                "upgrade to 1000ft"
            ],
            "content":"<div class=\"\"><div> <span>You came out of the smoke. The smoke was mostly gone and you see what have you done. Yours and the house nearby yours get crushed. In the distance you can see massive high heel shoe prints on the road with some crushed cars and some people run there. And there she was. Jen your hot giantess stepmother who is crushing the city under her heels. So sexy. You deciede...</span></div></div>",
            "created":1513573200,
            "id":2429706,
            "title":"You run in the oppsite direction "
        },
        "1143122":{
            "author_id":"dudo",
            "author_name":"CuriousChloride",
            "choices":[
                "she crush him",
                "she eat him"
            ],
            "content":"<div class=\"\"><div> <span>You stand there and wanted more. She must be bigger. You opened the note and let her grow to 1000ft. And she started to rampage. After a few steps, she stands there and lifts her shoe up and stomped down and say \"Try to run? I don't think so. You die *stomp* and you *stomp* and ohhh a little ambulance *stomp and wiped it out like a cigarette*\" and giggles again.  You grab your handy and search for a live stream. You found and it was directly under her. She began:\"Now I have something for you. You camera film this.*she hovers her shoe above him so he filmed the complete sole* Now look this I wear hot high heels and my sole looks so godly with crushed cars, people, and building part or doesn't it?\". The cameraman stands still while other people run away. You started to fab by this beautiful picture. Then..</span></div></div>",
            "created":1513573200,
            "id":2429711,
            "title":"upgrade to 1000ft"
        },
        "11431221":{
            "author_id":"dudo",
            "author_name":"CuriousChloride",
            "choices":[
                "... you grow her to 2000ft",
                "something other happend"
            ],
            "content":"<div class=\"\"><div> <span>\"I hope you have enjoyed it,\" she said and her shoe came down, the screen goes black and she had crushed him. She starts laughing and say:\"What can I do now, What I can do ohhh..\" her stomach groans \"Yes mmhhmmm\". She grabs a bus and licks her lips. The people start screaming inside the bus. She said:\"Yummy\" and bite the back of the bus off and start shacking the bus. People fall out and scream. She swallowed them and followed the with her hand on the outside down to her belly and rubs it. You try not to cum on that because it was the cruelest and at the same time the hottest what you have ever seen. Then...</span></div></div>",
            "created":1513573200,
            "id":2429718,
            "title":"she crush him"
        },
        "114312211":{
            "author_id":"dudo",
            "author_name":"CuriousChloride",
            "choices":[
                "start crushing the trains",
                "Grab one train"
            ],
            "content":"<div class=\"\"><div> <span>She grows to 2000ft. \"Ohhh yes too good,\" she said;\" I am still hungry, she lifts her shoe and step to the train station. She crushes in the rails at sides so that the trains cant escape. She demolishes the Roof from the station and starts to crush the running crowd in there with her finger. While this she said. \" You like that or not? A giant sexy woman who crush you with her fingers like ants\". You who answered, \"Yes my goddess\" why lying in the grass no people around you and enjoying the show. She than...</span></div></div>",
            "created":1513573200,
            "id":2429722,
            "title":"... you grow her to 2000ft"
        },
        "115":{
            "author_id":"alphaknight",
            "author_name":"AlphaKnight",
            "choices":[
                "Jen your stepmother",
                "Stacy your stepsister",
                "Someone else entirely"
            ],
            "content":"<div class=\"\"><div> <span>You were about to go and grab a pencil in the small pot on your desk when you got a whiff of your sweat soaked t-shirt. Getting a shiver down your spine just from the smell, you decided to forget the notebook for the moment and hit a quick shower.<br>\r\n<br>\r\nRapidly taking off your clothes, you grab a towel and go in the washroom unknowingly leaving behind the most important object you ever possessed. Not that you were aware of that fact yet though.<br>\r\n<br>\r\nYour room stayed quiet for about 5-6 minutes before your door opened letting someone you didn't intend inside. <br>\r\n<br>\r\n\"Nick are you in here?\" Asked the person.<br>\r\n<br>\r\nHearing no answer the person came further in realizing you weren't there. <br>\r\n<br>\r\nThat person was...</span></div></div>",
            "created":1476421200,
            "id":2223423,
            "title":"Unattended possessions"
        },
        "1151":{
            "author_id":"ayan0904",
            "author_name":"My son is gone",
            "choices":[
                "1 inch",
                "17ft",
                "36ft"
            ],
            "content":"<div class=\"\"><div> <span>“Whats this? ‘Size Note’? The things this boy buys I swear” Jen said holding the book.<br>\r\n<br>\r\nShe flipped through and read the rules, she thought it was complete utter trash but was interested in the idea. Being able to control the size of anyone you wish, being as small as a pin or as big as a house. Jen decided to try it out just for fun, she took a pen and wrote her name down.<br>\r\n<br>\r\nShe put “9ft tall, keep clothes on” next to her name and almost instantly she shot up, the feeling of the growth was incredible to her, she had to lean over to fit in the house. <br>\r\n<br>\r\nJen was astounded, she couldn’t believe it worked. She bent over and wrote more names. She wrote Stacy’s names and added “...</span></div></div>",
            "created":1559624400,
            "id":2668967,
            "title":"Jen your stepmother"
        },
        "1153":{
            "author_id":"jonanderml",
            "author_name":"Mayora",
            "choices":[
                "Nick's girlfriend",
                "A friend",
                "A neighbour"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then who was?</span></div></span></div>",
            "created":1580187600,
            "id":2779589,
            "title":"Someone else entirely"
        },
        "11533":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Forgotten babysitting gig! A Girl Too big for babysitting!",
                "Junior Girl Scout from across the street! Scout-Zilla is born! ",
                "Some one else",
                "Someone else ",
                "Reader’s choice "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A Neighbor has entered and found the size<br>\r\nnote but who?</span></div></span></div>",
            "created":1580360400,
            "id":2780455,
            "title":"A neighbour"
        }
    },
    "info":{
        "author_id":"alphaknight",
        "author_name":"AlphaKnight",
        "brief_description":"You find the size note of a bored size god. ",
        "created":1361418540,
        "description":"<td align=\"left\" class=\"norm\">Your name is Nick. You are a Young man at 20 of age living a cinderella kind of life with your mean step mother and step sister in a quiet neighborhood where nothing out of ordinary ever happen.  <br>\r\n<br>\r\nBut one day, a god of size who is as bored as you drops his size note, a note book used to alter the size of mortal.<br>\r\n<br>\r\nInside it's cover, a set of rules are written:<br>\r\n<br>\r\n<font class=\"size5\" style=\"\"><b>How to use:</b></font><br>\r\n<br>\r\n1. The human whose name get written in the note along with a size will get his size changed to the one written in the note.<br>\r\n<br>\r\n2. This note will not take effect unless the writer has the person's face in their mind when writing his/her name. Therefore, people sharing the same name will not be affected.<br>\r\n<br>\r\n3. If the duration of the size change is written within the next 10 seconds of writing the person's name and size, it will happen.<br>\r\n<br>\r\n4. If a size is not specified beside a name 19 days after the name is written, then the size can not be entered anymore.<br>\r\n<br>\r\n5. If a human uses the note, a god of size usually appears in front of him/her within 39 days after he/she uses the note.<br>\r\n<br>\r\n6.Gods of size, the original owners of the Size Note, do not do, in principle, anything which will help or prevent the size changes in the note.<br>\r\n<br>\r\n7. A god of size has no obligation to completely explain how to use the note or rules which will apply to the human who owns it unless asked.<br>\r\n<br>\r\n8. The human who becomes the owner of the Size Note can ask a god of size to shrink or grow the note to an appropriate size for the owner. However, that demand can only be asked 5 times for a single person. <br>\r\n<br>\r\n9. Before writing a size, the owner of the note may choose to enter a body part of the targetted person before writing a size in accordance to the part chosen.<br>\r\n<br>\r\n10. If the targeted person does not possess the specified body part, the note has no effect. <br>\r\n<br>\r\n11. The clothing of the targeted person won't change size with the person unless specified to do so in the note.<br>\r\n<br>\r\n<br>\r\nIt's writing time!</td>",
        "id":1920530,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1588077000,
        "modified":1588077000,
        "pretty_title":"Size Note"
    }
}