{
    "chapters":{
        "0":{
            "author_id":"shadowxxender",
            "author_name":"Sophie",
            "choices":[
                ".",
                "On a chair in your homeroom with Jade about to sit on you.",
                "In the Girls Locker Room.",
                "Falling into the food in the cafeteria",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up unable to remember anything, the whole room is spinning and you almost fall down, but when you come to you realize that your around an inch tall!! But where are you and what crazy situation are you in? ( You cannot die ) </span></div></span></div>",
            "created":1446872400,
            "id":2057811,
            "title":"Waking up . . . but where are you?"
        },
        "05":{
            "author_id":"shadowxxender",
            "author_name":"Sophie",
            "choices":[
                "In The Nurse's office",
                "Somewhere outside.",
                "At your Girlfriends House",
                "In The Pool before the girls have their practice.",
                "More Options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you stuck in one of these scenarios? </span></div></span></div>",
            "created":1446872400,
            "id":2057812,
            "title":"More Choices"
        },
        "1":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Run and find one of your mates",
                "Run and find your girlfriend, Jade",
                "Run and find a teacher",
                "Run and find anyone",
                "Run out of school"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up a little dazed. When you come to your senses you realize that everything is bigger than you as you are only 1 inch tall. You get up and think of a plan. You need to find someone to help you out. Who do you go to?</span></div></span></div>",
            "created":1134709200,
            "id":290205,
            "title":"Recess"
        },
        "11":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Nina",
                "Stacey",
                "Kim",
                "Amy",
                "A different mate"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1134709200,
            "id":290206,
            "title":"Which mate?"
        },
        "111":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Library",
                "Dining Hall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You pick the gorgeous Nina. Nina is medium size with big breasts. Where will she be?</span></div></span></div>",
            "created":1134709200,
            "id":290212,
            "title":"Nina"
        },
        "112":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Library",
                "Dining Hall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You pick good old Stacey. Stacey is small, quite chubby but has lovely breast. Where will she be? </span></div></span></div>",
            "created":1134709200,
            "id":290213,
            "title":"Stacey"
        },
        "113":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Library",
                "Dining Hall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You picked kind-hearted Kim. She is medium size, quite chubby and has big breasts. Where will she be? </span></div></span></div>",
            "created":1134709200,
            "id":290214,
            "title":"Kim"
        },
        "1132":{
            "choices":[
                "Backpack",
                "Shoes"
            ],
            "content":"<div class=\"\"><div> <span>You find one of your Friends, Kim. In the cafeteria. Kim is Asian with black hair and purple highlights. Shes wearing a grey t-shirt with some pink logo, blue shorts and black low top converse tennies. She seems to be having a conversation with her other friends at the table while eating her lunch. You then quickly run over to Kim and begin screaming and shouting out her name! Unfortunatly she doesnt hear you. Shoot. Now you gotta find some other way of getting her attention. In order to do that you must get closer to her. Taking a deep breath you then quickly run over to Kim's...</span></div></div>",
            "created":1138683600,
            "id":299147,
            "title":"Giant Kim"
        },
        "11322":{
            "author_id":"cm8000",
            "author_name":"masterchief",
            "choices":[
                "Gym class",
                "Out the school door ((It was a half-day))"
            ],
            "content":"<div class=\"\"><div> <span>You ran up to Kim's huge shoe and grabbed onto it. You then started working your way up it. Meanwhile Kim has just finished her lunch and heads over to the waste bin to throw away her remaining scraps. You hang onto one of the shoelaces tightly as Kim walks out of the caffeteria with her friends and to</span></div></div>",
            "created":1145163600,
            "id":313248,
            "title":"Riding kim's shoe"
        },
        "113222":{
            "choices":[
                "Try and hit kims feet",
                "Climb up the couch"
            ],
            "content":"<div class=\"\"><div> <span>Kim then heads out of your school and says bye to her friends. She then started walking home! You barely managed to hang onto the shoelaces of kims sneaker as you're taken on a 15 minute ride to her house! suddenly you hear a door open followed by the sound of kims backpack being thrown onto the floor. Kim then plops down onto the sofa and kicks off her shoes. You landed on the soft white carpet unharmed. \"Thank god thats all over!\" you say to yourself! Now that kim is sitting down and watching cartoons on tv, this would be a good time to get her attention! You could either climb up the couch and try to get closer. Or you could pound on kims smelly socks and hope she notices you down on the floor! </span></div></div>",
            "created":1172984400,
            "id":386728,
            "title":"kims house"
        },
        "1132222":{
            "choices":[
                "Neck",
                "Ass"
            ],
            "content":"<div class=\"\"><div> <span>You climb up the back of the couch, the tiny fibres are good handholds, until you finally reach the top, out of breath.<br>\r\n<br>\r\nYou look down, and see the back on Kims head. You look lower, and see a gap between her neck and top. And even lower, you see a gap between her pants and ass. You will have to jump, but to where?</span></div></div>",
            "created":1179378000,
            "id":408755,
            "title":"The couch"
        },
        "11322221":{
            "author_id":"cm8000",
            "author_name":"masterchief",
            "choices":[
                "Inside of kims shirt",
                "Inside of a bag of chips kims eating"
            ],
            "content":"<div class=\"\"><div> <span>You jumped for the neckband of kims shirt and grabbed hold of the shirts fibers. Kim has her hair put up in a ponytail today so you didnt have to worry about getting lost in that forest of thick hair. You then carefully start to make your way across the shirts neckband. If you can just make it close to her ear then maybe she'll hear you better. You can hear the occassional chuckle and laugh coming from Kim as she watches her favorite program. However at your current size it sounds like thunder! Kim then unexpectedly leans over to grab the remote to the TV. You scream as you lose your footing and end up falling..</span></div></div>",
            "created":1179378000,
            "id":408795,
            "title":"Didnt go as planned"
        },
        "113222212":{
            "choices":[
                "Kim eats you",
                "You miss her mouth"
            ],
            "content":"<div class=\"\"><div> <span>You landed with a crunch inside of a bag of potato chips! Suddenly you see a huge hand lowering inside of the bag! You try to avoid it but it collects a handfull of chips like a huge crane, including you! Kim then brings you out of the bag and prepares to eat the contents by the handfull! You scream and wave your arms as kim begins to open her mouth. Then,</span></div></div>",
            "created":1188882000,
            "id":442159,
            "title":"Chips"
        },
        "1132222121":{
            "author_id":"cm8000",
            "author_name":"masterchief",
            "content":"<div class=\"\"><div> <span>Like a selfish pig, Kim shoves the handful of broken chips into her mouth. Including you! Kim smiles as she starts to chew the contents up within her mouth! The defeaning sound of the chips breaking is the last thing you hear before you wind up beneath her huge molars which come down. Your body does not break apart into pieces yet, but its enough to crush the living life out of you. Everything then goes black and silent for you..<br>\r\n<br>\r\nKims molars come down again, this time shattering your bones and your organs. Realizing the piece of \"chip\" is a little stubborn to break apart, Kim chomps down a little harder. This time your body yields and is chewed to pieces. Kim continues to chew the contents in her mouth to mush before finally swallowing. Kim then chases it down with a drink of coke before letting out a gassy belch.<br>\r\n<br>\r\nWeeks pass by and nobody hears from you again. Your parents tell the police the last place you were seen was at your school. They authorities question all the students in your class, including kim. But they have no idea what became of you. Nobody will ever know that you died by getting eaten alive by Kimberly Cheung, the girl you went to school with.</span></div></div>",
            "created":1265605200,
            "id":832566,
            "title":"Eaten by Kim"
        },
        "1132222122":{
            "choices":[
                "Kim brushes you off",
                "Kim looks down"
            ],
            "content":"<div class=\"\"><div> <span>You feel Kim's hot breath rush down your body and you realize you are doomed. You can see Kim's uvula hanging over that deep dark pit that is her throat. You also see nasty remnants of chewed chips scattered across her tongue and on her terrifying deadly molars! You begin to cry and wonder why your life must end like this. Then before you know it Kim shoved the handfull of chips into her mouth. However, much to your suprise, you fell out of Kim's hand with bits of broken chip pieces! You then landed on a very soft surface, Kim's breasts! You struggle to catch your breath, realizing how close you came to being eaten! You cringe as you hear Kim's teeth crushing the contents to a mushy pulp before swallowing with a nice gulp. That could of easily just been you. Feeling the crumbs on her body, kim suddenly,</span></div></div>",
            "created":1202187600,
            "id":494651,
            "title":"Nearly eaten"
        },
        "11322221222":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "A human and knows it's you.",
                "A bug/crumb."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does she see you as?</span></div></span></div>",
            "created":1371704400,
            "id":1614403,
            "title":"Kim looks down"
        },
        "113222212222":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "A bug (Uh, Oh).",
                "A crumb (UH, OH!)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one is it?</span></div></span></div>",
            "created":1371704400,
            "id":1614404,
            "title":"A bug/crumb."
        },
        "1132222122221":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Hands",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"EEK!\" Kim shrieks, \"a bug!! I'll crush you good!\" <br>\r\n<br>\r\nHow?</span></div></span></div>",
            "created":1387342800,
            "id":1710026,
            "title":"A bug (Uh, Oh)."
        },
        "11322221222212":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Bare feet",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1387342800,
            "id":1710028,
            "title":"other"
        },
        "113222212222122":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of her books? </span></div></span></div>",
            "created":1398056400,
            "id":1784205,
            "title":"Other"
        },
        "1132222122221222":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about sitting on you</span></div></span></div>",
            "created":1419829200,
            "id":1908985,
            "title":"No"
        },
        "11322221222212221":{
            "author_id":"stupidbug",
            "author_name":"StupidBug",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>          Kim notices you and decides your a really weird and don't beln here so grabes and pushes you under her ass crushing and killing you in seconds..... Kim always had a big ass</span></div></span></div>",
            "created":1516605000,
            "id":2443709,
            "title":"The heavy death"
        },
        "114":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Library",
                "Dining Hall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You pick hyperactive Amy. Amy is tall with small breasts. Where will she be?</span></div></span></div>",
            "created":1134709200,
            "id":290215,
            "title":"Amy"
        },
        "1141":{
            "author_id":"gottagetfeast",
            "author_name":"Guyferri ",
            "choices":[
                "Get her attention",
                "Get revenge",
                "Get a ride"
            ],
            "content":"<div class=\"\"><div> <span>Not to sure how you shrunk this small and your head still aching you wonder under the classroom door and out into the hall way.knowing the best bet to get help on school would to seek out one of your friends you Entering the libery.the liberty is full of kids sitting down reading away in there books.there you spot your old freind Amy.she was stuck reading her manga.she always had weird fetishes and was never shy about showing you usually one look was enough for you until you looked away in embarrassment.<br>\r\n<br>\r\nAmy was always a little hyperactive mostly talking about her anime once you saw her phone and it was loaded up with anime butts/boobs hard to forget that.Amy is a tall,white,short brown haired girl with hazelnut eyes wearing a glasses,blue striped panties,black sneakers with knee socks,a blue skirt and a graphic tee with some Japanese words and a anime guy with a sword on it.amy totally focused on her manga drool pooling out of her mouth.<br>\r\n<br>\r\nWalking up to her table you begin to climb up her desk.arriving at the top you look at the barren desk bare except for Amy's elbows and drool puddle.her eyes glued to her phone as she browses her manga and anime.looking Amy's always teased you leaning on you and when you get floastered she'll call you a pervert and laugh.not always the nicest girl you wonder what she might do if she fought you but at your size you may have no other choice.making your choice you<br>\r\n<br>\r\nGet her attention (mean or not she's a freind and you need help)<br>\r\nOr<br>\r\nGet revenge (not to smart but after all these years it may be just what you need)<br>\r\nOr<br>\r\nGet a ride (secretly climb to her shoulder and scan for more options when she gets up to walk around)</span></div></div>",
            "created":1494824400,
            "id":2320045,
            "title":"Library"
        },
        "11412":{
            "author_id":"gottagetfeast",
            "author_name":"Guyferri ",
            "choices":[
                "Front side",
                "Back side"
            ],
            "content":"<div class=\"\"><div> <span>         Not to smart but this girl has it coming teasing you for the past year and a half always making you awkward all the time.you decide Siena's she made you feel awkward you would in turn her.moving closer towards her walking around the puddle of saliva forming below her.looking up she's still entrants in her phone it's a long jump down but the skirt should catch you.Getting the nearer up and after about 10 minutes you taking a deep breath and jump down fraling downward you fall onto her skirt acting like trampoline you bounce luckily your not big enough for to notice or it's becouse she's lost in her phone.<br>\r\n<br>\r\n          Since she has very small breast climbing up would be futile.Carefully going towards the end of her skirt you climb down underneath her skirt where a giant blue and white striped panty wall faces you.suddenly In the time of you watching her under wear she begins to move.ruuning up you cling onto the bottom of her panties dangling dangerously as she moves out of the libery.looking down you can see her legs moveing along.carefully moving along you cling along to the inside of her under pants.taking a break you lay on the bottom of her panties catching your breath directly beneath her.<br>\r\n<br>\r\n           Suddenly Amy sits down right on top of you crushing you.its hot and heavy struggling to move beneath her weight.amy in the middle of her history class begins to feel your movements getting itchy she grinds her butt into her seat rubbing you beneath her.the other students starting to watch she stops blushing.after her movements you are able to wiggle free only question is where to go to do the most damage.do you go<br>\r\n<br>\r\nBackside (gross but bothers her)<br>\r\nOr<br>\r\nFront side (could get smashed but gets good results)</span></div></div>",
            "created":1494910800,
            "id":2320573,
            "title":"Finger piramid of evil contemplation "
        },
        "1142":{
            "author_id":"gottagetfeast",
            "author_name":"Guyferri ",
            "choices":[
                "Hide behind her gateraid",
                "Make yourself seen by her",
                "Run and jump to her shirt and continue the climb"
            ],
            "content":"<div class=\"\"><div> <span>                Not to sure how you shrunk this small and your head still aching you wonder under the classroom door and out into the hall way.knowing the best bet to get help on school would to seek out one of your friends you Entering the cafeteria.As you go into the cafeteria you are left speechless watching the students march around the room stomping around getting there lunch and finding somewhere to sit.ducking under the table by the door to try  and not to be stepped on.while hiding you scan the room for your mates.sudden spotting your freind Amy.<br>\r\n<br>\r\n                Amy was always a little hyperactive mostly talking about anime once you saw her phone and it was loaded up with anime butts/boobs hard to forget that.Amy is a tall,white,brown haired girl with hazelnut eyes wearing a  glasses,a blue skirt and a graphic tee with a anime tittle/character on it.carefully running from table to table you try to avoid the random shoes slamming down at you.getting some close calls you make it to Amy's table.looking upward you spot Amy's blue striped panties shocked you look back down.<br>\r\n<br>\r\n                Finally making it to your freind you plan your next move.Amy wasn't always the kindest teasing you at any excuse making you feel awkward at any operrrtunity not even saying her weird fetishes too many to count scared one of hers might be size you wonder if getting her attention would be wise.if nothing else it would be a good ride to another part of the school like the science lab or other place.although she is still a freind and may just be a big(get it) help.leaping onto her black sneakers and making your way up her socks you ponder your next move.<br>\r\n<br>\r\n                Climbing onward you continue all the way to her stomach area of her shirt.looking up you see Amy's glasses you can make out her phones glare looks like she's looking at some sort of erotic manga.shrugging it off you make it to her breast luckily her breast haven't developed fully making it an easy climb up. Just as you make it to her shoulder you begin to feel a shack comping up \"ah aahhh aaahhhhh chhoooo\" Amy sneezes rocketing you off onto the table landing on her tray wiping her nose on her sleeve you process you choices quickly<br>\r\n<br>\r\nHide behind her gateraid bottle (you don't know if she's your best bet yet)<br>\r\nOr<br>\r\nMake your self seen by yelling up ( she may be your one chance)<br>\r\nOr<br>\r\nRun and jump back to her shirt And continue climbing (even if you don't trust her enough she can still be useful)<br>\r\n<br>\r\n</span></div></div>",
            "created":1494738000,
            "id":2319598,
            "title":"Dining Hall"
        },
        "11421":{
            "author_id":"gottagetfeast",
            "author_name":"Guyferri ",
            "choices":[
                "Thrust forward",
                "Thrust downward"
            ],
            "content":"<div class=\"\"><div> <span>              Not wanting to be seen yet you run behind her blue gateraid.wiping her nose on her sleeve Amy looks back down to eat her lunch.Grabing her sandwich and chowing down you watch as a mountain slide of food slides down her face landing on the table in a mess.chewing she places her sandwich back on her plate.chewing her food up properly the best food ever for that kind of reaction you think as she closes her eye throwing up her arms to her check packed with food.swallowing it the food slides down her through it a *gulp* wiping the food from her mouth she gives a breath of relief.reaching for her drink she picks it up and unscrews the cap.<br>\r\n<br>\r\n              Your hiding place being drank you run to the next thing you think you could hide behind.the only thing in sight being her bit into sandwich.hiding in her bite mark you stay low by the rim of the sandwich.finishing sipping her drink she takes a deep breath slaming her dink down wiping liquid from her face.(she's must be a messy eater or something) you think to your self.seeing her hand reach back down to her sandwich you try to move but are stuck to the sauce inside the sandwich.being picked up in the sandwich you struggle as you watch her mouth come dangerously close.her mouth full of chewed up food and spit you feel her hot breath on you as you come deadly close to her mouth.<br>\r\n<br>\r\n               Knowing you have to escape or you would be eaten you by reflex<br>\r\n<br>\r\nThrust your body forward (hopefully it's enough to rocket out of the sandwich)<br>\r\nOr<br>\r\nTry to grap onto the bread and rocket your self down ward(your to close you may just go into her mouth if you go forward.)</span></div></div>",
            "created":1494738000,
            "id":2319642,
            "title":"Hide behind her gateraid"
        },
        "114211":{
            "author_id":"reader1231",
            "author_name":"no",
            "choices":[
                "you end up in her bladder",
                "you end up in her but"
            ],
            "content":"<div class=\"\"><div> <span>you Thrust yourself forward and out of the sandwich. unfortunately you were a bit too close to her mouth when doing this and shoot yourself directly into her gaping mouth landing on her tunk.<br>\r\n<br>\r\nshe puts the sandwich into her mouth and begins chewing.  all the while rolling food and you cross in mouth tasty and in joint. after a couple  seconds I'm simply enjoying the flavor. she swallows it all with a big gulp and you do have sliding down her pink dark moist throat it's closing around you. you are squeezed  down until you reach an open pit which is full of a moist foul-smelling liquid. it doesn't take you yams realize you're in her stomach you quickly try beating on the walls to try and get out to no avail. Though you do notice Something on that as well it seems like the fluid in her stomach is having no effect on you which does give you an idea however unsavory you'll have to get out on the other end. <br>\r\n</span></div></div>",
            "created":1580523720,
            "id":2781013,
            "title":"Thrust forward"
        },
        "114212":{
            "author_id":"gottagetfeast",
            "author_name":"Guyferri ",
            "content":"<div class=\"\"><div> <span>           Grasping the bread you rocket down but sadly your still stuck to the souce dangling from the sandwich held on the only the souce.noticing this Amy lift the sandwich upward not noticing you opening her mouth she lays her tongue  out to catch the sauce as it falls.looking down you watch as you fall slowly onto her tongue her hot breath you feel as you land on her tongue.the rest of the spice falls of you as soon as the souce stops falling her tongue recalls into her mouth.you are swayed in her mouth for a bit until suddenly you begin to slide into her thought.Tring to grab onto anything to save your skin luckily you grasp onto one of the bumbs on her tongue.legs in her thought you struggle to stay afloat.<br>\r\n <br>\r\n            Chocking on her food Amy spits you up although unluckily onto her front teeth still in her mouth as she closes her mouth shut.wondering what was in her mouth she fiddles her tongue around her thought.feeling you unknowing she begins to lick you to try and figure it out.feeling awkward as her giant you fur licks your entire body.suddenly you feel her tongue begin to focus on a certain point ... your privates as she licks you can't help but to feel great guilty pressure.After about 30 seconds you explode Amy's mouth opening for about a split. Second \"mmm salty!\" Unable to move spent you slide exousted down her through.<br>\r\n<br>\r\n             As you slide down her thought You can her her organs at work.rushing blood sounded like a river her beating heart sounded like a drum and falling into her stomach sounded like ... FAlLiNG INTO HER STOMACH!?! falling down into her stomach acid you land on a slice of sandwich.which was being eating away as you drift there.smeeling horrible in her stomach you pinch your nose in her dank moist cavernous stomach.after hours adrift the stomach acid safely finally gets to you as you become apart of Amy.<br>\r\n<br>\r\n            Not knowing she has just eatin her freind Amy wipes her face up finishing her food.tossing her remains away in the trash can walking off to her next class.during  her class she raises her hand to go to the bath room.your ramains are compacted and squeezed out Amy ass.amy mean while looks at her phone looking at anime/manga on her phone.finaly ploped out into the toilet with a splash Amy wipes up flushes and washes her hands heading back to class.<br>\r\n<br>\r\nThe end   (You've met a foul end) ..sorry</span></div></div>",
            "created":1494824400,
            "id":2319663,
            "title":"Thrust downward"
        },
        "11422":{
            "author_id":"gottagetfeast",
            "author_name":"Guyferri ",
            "choices":[
                "Agree ",
                "Disagree "
            ],
            "content":"<div class=\"\"><div> <span>            Throwing up your arms you yell out to her jumping repeatedly as you struggle try to grab her attention. clearing her nose Amy returns to her lunch when to her surprise she spots you.Confused she wipes her eyes seeing your still there she bend over to get a better look at you.suddenly her face is down against the table her eyes fixated on you a little nervous you wait a little grossed out as drool begins to spill out of her mouth.begining to giggle Amy get a strange look on her face looking at you menicingly from above opening her phone she pops open a page on her internet slamming the screen in front of you.it was a picture of some giantess anime girl and a micro guy as you swiped the page you watch the pair in a variety of poses In one she stomped on him,the secound she ate him the third she sat on him the final she pressed her breast on him.shocked by this image you begin to shack as you look up at the giantess girl in front of you.<br>\r\n<br>\r\n              Amy still drooling over her thoughts snaps back to reality.\"So as you can see I've been dreaming of this for a while and as a freind would you please help me fufill my fantasy please.\"placing her hand together she begs you.surprised by her actions you are worried about your health asking about your well being.amy opening her eyes \"well only do the gentle stuff at first please it'll be fine no harm I promise\"she response sweetly.<br>\r\n<br>\r\nAgree (even though it's weird she's still your freind and this may be her only chance to plus she may go crazy if you reuse) <br>\r\n<br>\r\nOr <br>\r\n<br>\r\nDisagree (this is all to weird she may be a freind but it's way to much,plus you have to find a way to grow big again)</span></div></div>",
            "created":1494738000,
            "id":2319628,
            "title":"Make yourself seen by her"
        },
        "114221":{
            "author_id":"gottagetfeast",
            "author_name":"Guyferri ",
            "choices":[
                "Click",
                "Don't click"
            ],
            "content":"<div class=\"\"><div> <span>Nodding in agreement Amy lowers her hand and picks you up and places you into her purse.wispering to you \"we can play later when I get home for more privacy\"winks as she closes her purse.gettibg up Amy moves to her next class.the purse rumbles as she moves the junk shifting hitting you and she moves across the hall.obly able to see thanks to the beam of light from the top sliver of her purse you can just barely move out of the way of big items heading your way.as she stops and drops her purse on the ground you are able to collect yourself.looking around her purse you can make out her phone,anime figure,makeup,and tampons.listening up you can make out she's in math.<br>\r\n<br>\r\nAfter about 20 minutes you begin to ponder if you made the right choice.thinking back you feel lucky she's at least a gentle giantess and most likely just wants to do some weird fantasy for a little bit then help.board your tempted to go on her phone.knowibg going through it would be a preach of privacy.boared you click on and have a look see the wall paper was a giant girl in the city.playing an app game for ten minutes you get boards and accidentally double tap the home button pulling up her previously used apps google,an app game, and her photos.noticingbspmething strange in photos you click on it.<br>\r\n<br>\r\nThere seems to be more giantess pics but it's all blurred behind an album called do not enter.knowing your already breaching privacy you wonder if you should click on the album or leave it be.   <br>\r\n<br>\r\nClick it(could be important information about her)<br>\r\n<br>\r\nDon't click it (none of your business and its rude)<br>\r\n</span></div></div>",
            "created":1496890260,
            "id":2332826,
            "title":"What are friends for"
        },
        "1142211":{
            "author_id":"gottagetfeast",
            "author_name":"Guyferri ",
            "choices":[
                "Group activity",
                "Survive challenge"
            ],
            "content":"<div class=\"\"><div> <span>As you tap open the folder and skim through the pictures you are horrified by what you see.its a album of gintess's eating,crushing,smushing,sitting,stomping,teasing,killing,and master bating with tinies.falling back in fear you feel your heart beating as you hear \"hold up I have to grab something from my purse.quickly turning off the phone you hid behind the tampon box.<br>\r\n<br>\r\nAs a giant hand appears from the hole in the purse lowering and grabs the phone.scared you wonder how to escape the purses containment.As Amy turns her phone on you can feel her stop \"hmm\" she says heading into the girls bathroom opening a stall and sitting down she opens her purse on her lap.looking up you can see a angry Amy looking down at you \"curious lil dude(or lady on preference ) don't you know the story of Icarus getting to close to the sun\"scared you walk slowly back tripping on her lipstick left tipped over on the purses floor.shivering you stand staring blankly at an angry goddess.\"hasn't any one ever told you not to go looking through a girls private things tsk tsk tsk ... I'll just have to teach you a lessen\"Amy says looking around her purse for ideas.<br>\r\n<br>\r\nAfter a spilt second Amy's face lights up \" I got it\" Amy shouts \"I'll give you a choice sense I'm such a ... fair giantess ruler\" speacking up you ask what it was her choice Amy smirks \"either we can play a game together where I and you compete for your life or you could play survivor solo without me interfering and all you do is survive for a period of time in a dangerous situation\"Amy explains.gulping you ask what happens if you won the game.laughing Amy looks down wiping eyes in laughing so hard \"you could go free duh\"Amy says smug.<br>\r\n<br>\r\nAsking what the games were Amy response \"what's the fun in that now choice then ill explains the game rules now.Make your choice\"Amy asks with a toothy grin a little spit spilling down her chin in excitement <br>\r\n<br>\r\nYou choose<br>\r\n<br>\r\nGroup (no telling how long you may have to survive and she may want it to be interesting making it hopefully more possible then ignoring the game doing something's else while you survive and hopefully not die)<br>\r\n<br>\r\nSurvive (maybe a fight between you and a giantess isn't the smartest s choice and a survival challenger may be a better chance to well survive)</span></div></div>",
            "created":1496891760,
            "id":2332840,
            "title":"A cruel world"
        },
        "115":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Katie",
                "Another one"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Could you rely on Katie?</span></div></span></div>",
            "created":1134709200,
            "id":290207,
            "title":"Katie?"
        },
        "1151":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Library",
                "Dining Hall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You pick the lovely Katie. Katie is pretty small and has big breasts. Where will she be?</span></div></span></div>",
            "created":1134709200,
            "id":290211,
            "title":"Katie"
        },
        "1152":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Sarah",
                "Lyndsey"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of these two?</span></div></span></div>",
            "created":1134709200,
            "id":290208,
            "title":"Choose"
        },
        "11521":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Library",
                "Dining Hall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to go for the feisty red head Sarah. Sarah is quite big and has nice breasts. Now where can you find her?</span></div></span></div>",
            "created":1134709200,
            "id":290209,
            "title":"Sarah"
        },
        "11522":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Library",
                "Dining Hall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You pick the pretty petite Lyndsey. Lyndsey is fit but with small breasts. Where can you find her?</span></div></span></div>",
            "created":1134709200,
            "id":290210,
            "title":"Lyndsey"
        },
        "12":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Library",
                "Dining Hall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your girlfriend is medium sized and has big breasts. Where can you find her?</span></div></span></div>",
            "created":1134709200,
            "id":290219,
            "title":"Jade"
        },
        "121":{
            "author_name":"gui",
            "choices":[
                "Climb in your shoes",
                "Climb on the table"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I come in to the library, looking for Jade, but everithing is so big and large. I m a one inch tall and need to talk with Jade. How get her to see me:</span></div></span></div>",
            "created":1136437200,
            "id":293894,
            "title":"My Nigthmare"
        },
        "1211":{
            "choices":[
                "Throw something up at Jade's foot.",
                "Suddenly Jade begins lowering her foot back into the flipflop."
            ],
            "content":"<div class=\"\"><div> <span>You have to get Jade's attention somehow. You can see her slipping her huge barefeet in and out of her blue old navy flip-flops as she studys for some history project coming up. You try screaming and shouting but Jade has headphones on unfortunatly. You then decide to take the more dangerous route and climb into one of Jade's unoccupied flip-flops! It looks like a huge blue plain that stretches about 50 feet across. You then start think of a way that you can get Jade to spot you down here. Reaching into your pockets you then get an idea</span></div></div>",
            "created":1138683600,
            "id":299145,
            "title":"At Jade's huge feet"
        },
        "12112":{
            "content":"<div class=\"\"><div> <span>You reach into your pocket only to pull out some lint, a dollar bill, and a couple of movie tickets from when you and your friend went to the theater last week. So much for that brilliant idea you had you think!<br>\r\n<br>\r\nSuddenly an enourmous black shadow casts over you. Slowly looking up you see the bottom of Jade's foot getting closer to you!<br>\r\n<br>\r\n\"Nooo!!!\" You scream out loud. You quickly turn around and try to outrun the oncoming foot. However you dont get too far before one of Jade's monstrous toes collide into you from behind, knocking you face first onto the dirty surface of Jade's flip-flop. You then start to feel an intense pressure all over your body as Jade's massive feet are now pinning you against the surface of her blue flip-flop! You try to move but cant move a single muscle in your body now. Suddenly Jade gets the urge to use the bathroom and proceeds to stand up.<br>\r\n<br>\r\n\"Jade!!!\" You scream out her name one last time before Jade steps down with her full weight.....<br>\r\n<br>\r\nAfter Jade relieves herself she returns to the table to continue studying for the test. When Jade slips her feet out of her sandals again, all that remains of you is a little red stain on the sole. Sadly Jade had no clue that she had just crushed her own boyfriend inside of her flip-flops!</span></div></div>",
            "created":1149310800,
            "id":322397,
            "title":"A painful end"
        },
        "1212":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Jade",
                "Nina"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You start to climb your way up the table leg. You can only see Jade. As you approach the top, you see another person. You realize that it is Nina. Suddenly one of them spots you. Which one?</span></div></span></div>",
            "created":1136437200,
            "id":293933,
            "title":"Up onto the table you go"
        },
        "12121":{
            "author_name":"Edward Pick",
            "choices":[
                "You slip into Jade's navel",
                "You climb back up onto Jade's breasts"
            ],
            "content":"<div class=\"\"><div> <span>Jade spots you on the table. She looks perplexed.<br>\r\n<br>\r\n\"What the fuck? Is that you?\" she asked.<br>\r\n<br>\r\n\"Jade! Oh, god! I'm so glad to see you!\" you answer. Jade looks around and holds out her hand. \"Jump on!\"<br>\r\n<br>\r\nYou jump onto Jade's hand. She carries you to a desolate part of the large school library. She sets you down on one of the tables.<br>\r\n<br>\r\n\"How did this happen?\" Jade asks. You shrug. \"Just happened. I'm not really sure.\"<br>\r\n<br>\r\nJade looks around, worried someone might come over and harm you. She picks you up again and holds you up to her face. You look at her. Her face is about the size of a movie screen, to a normal person, compared to you.<br>\r\n<br>\r\n\"Now you be a good boy, k?\" <br>\r\n<br>\r\nYou nod. Next thing you know. You feel yourself falling. You land on something fleshy. You collect your senses and find out you are resting on one of her massive breasts. You start to slide down between the two massive, fleshy mounds and eventually are wedged between them. They hop and jiggle as Jade walks. <br>\r\n<br>\r\nThis is paradise, you think to yourself.<br>\r\n<br>\r\nThe bell rings. It's lunch. Jade walks through the hallway to the lunchroom. The lockers slamming shut sound like amplified thunder claps. The chatting of your fellow schoolmates assaults your ears. You press your head against one of Jade's breast to muffle the noises. <br>\r\n<br>\r\nFinally, you reach the lunchroom. The sound of lockers is gone. The voices of other people has calmed a bit. You give a sigh of relief. Suddenly, in one of Jade's strides, you feel yourself slipping. You grip onto her flesh, but another bounce sends you plummeting. Luckily, Jade was wearing a tight-fitting shirt that day. Your fall is slowed and then stops altogether. <br>\r\n<br>\r\n</span></div></div>",
            "created":1145077200,
            "id":313160,
            "title":"Into the Cleave of it"
        },
        "121211":{
            "author_name":"Edward Pick",
            "choices":[
                "No, I'm not eating my boyfriend! I won't!",
                "That's it! He's going down... literally!"
            ],
            "content":"<div class=\"\"><div> <span>It seems hopeless to try to climb back up. Better down than up. You climb down further and are pressed firmly against Jade's soft tummy by the shirt. An idea hits you. You climb down further and grope around like a blind man. Your hand suddenly misses flesh. You slide down further and fall into a depression. You are now inside Jade's belly button. It is very deep and provides an excellent space for you to stay sheltered.<br>\r\n<br>\r\n\"Well, nothing else to do. Guess I'll just kick back and relax!\"<br>\r\n<br>\r\nYou yawn and lie down. Suddenly, you leap to your feet... rather your knees (you cannot stand up inside her navel). A sound echoed throughout Jade's navel. It was her stomach. Another two followed. <br>\r\n<br>\r\nOn, the outside, Jade was trying to muffle the noises coming from her abdomen. <br>\r\n<br>\r\nGod, why didn't I have breakfast, she thought to herself.<br>\r\n<br>\r\nJade picks up a tray. She moves down in the line. Through the glass window, overlooking the food choices, Jade decided what to have... or rather, what not to have. <br>\r\n<br>\r\n\"Sloppy Joe's or Meatball Sub?\" She asked the lunch attendant, \"Is that it?\"<br>\r\n<br>\r\nThe lunch attendant nodded. Jade retreated.<br>\r\n<br>\r\n\"I-I... I'll pass... for today,\" said Jade. She furtively rubbed her stomach as she re-entered the lunchroom. She sat down at her table with her friends. Jade spoke little. Her activities included twisting her dirty-blonde hair around her finger, biting her lip, and muffling her hunger growls (which no one even noticed).<br>\r\n<br>\r\nDING! The PA system was activated. The school's principal's booming voice filled the lunchroom.<br>\r\n<br>\r\n\"Due to recent weather issues, students will be dismissed earlier than the ordinary dismissal time. Students, please head to your lockers and collect your belongings and exit the school immediately.\"<br>\r\n<br>\r\nDING! <br>\r\n<br>\r\nLockers slammed and students whooped and screamed at the dismissal. Jade, too, looked up. Now she wouldn't have to sit through Biology (which meant missing the fetal pig dissection)! And since it was Friday, the weekend was still to come. However, Jade did not leave immediately. <br>\r\n<br>\r\nShe returned to the library, again in the remote section she brought you before. She reached in between her breasts again. Nothing. Jade froze. She checked everywhere for you. Finally, she felt something move inside her navel. She lifted her shirt. Her round tummy hung out.<br>\r\n<br>\r\nYou suddenly feel yourself slipping. <br>\r\n<br>\r\n\"What the hell?\"<br>\r\n<br>\r\nYou slip out of Jade's belly button.<br>\r\n<br>\r\n\"AAAAAAAAAGH!\" <br>\r\n<br>\r\nYou land on the smooth, wooden surface of a table. Your right shoulder aches badly (considering the you landed on it). You then look straight. Jade's navel is right in front of you. <br>\r\n<br>\r\n\"Oh God!\" Jade exclaims. You look up and see her attractive face looking down upon you.<br>\r\n<br>\r\n\"Thank God you're still here!\" she said, \"I thought I might've dropped you somewhere!\"<br>\r\n<br>\r\n\"Almost did. Thank God you were wearing that shirt!\" you say.<br>\r\n<br>\r\nJade smiles. Then she grows serious again. <br>\r\n<br>\r\n\"So, what are we gonna do? How are we gonna return to your normal size? Can you even return to your normal size?\" she asks. You search for an answer. All seems hopeless.<br>\r\n<br>\r\n\"Jade, I doubt I'm gonna be able to return to your normal size. I'm fucked up like this for life, it looks like,\" you reply.<br>\r\n<br>\r\nJade looks sympathetically at you. <br>\r\n<br>\r\n\"Look, only you can know about this. Don't go for help or anything.\"<br>\r\n<br>\r\n\"Don't you think it'll be kinda fishy when you don't show up for classes or return home? What do we tell them?\" Jade asked.<br>\r\n<br>\r\nYou purse your lips. \"We'll just have to roll with this. When something comes up we'll figure out something to get over it.\"<br>\r\n<br>\r\nJade still looked unsure, but she agreed. She picked you up and returned you (to her belly button). Jade opened up her umbrella and walked outside. The rain beat down like a barrage of rocks. You covered your ears to prevent yourself from going deaf. Over the din, Jade heard her stomach growl. She was very hungry, but fought off her hunger. She trudged down the streets, almost filled with water.<br>\r\n<br>\r\nAfter, what seemed an eternity, Jade arrived at her house. She walked in the door and threw down her umbrella. Her coat (which she had stashed in her locker just in case) didn't even keep the rain from drenching her. She went up to her room and set you down on her bed. She said she had to go change. You asked if you could go along with her, but she declined.<br>\r\n<br>\r\nAs she walked out of the room, her stomach growled again. She started wondering what you would taste like. Then she remembered, this was her boyfriend she was talking about. She set the idea aside. <br>\r\n<br>\r\nJade changed into dryer clothes and returned to her room. You were still there on the bed. She looked at you. Her stomach, again, complained. Jade shook the idea from her head. Hunger was so great in her, she forgot about the food in her fridge.<br>\r\n<br>\r\nNo. I'm not gonna eat him, she thought. She looked at you again. <br>\r\n<br>\r\nOh, but he looks so good!, Jade thought.<br>\r\n<br>\r\nJade decided to take her thoughts away from the thought of eating you by occupying herself. She decided to chat with her friends online. Jade picked you up and set you on her shoulder. However, as she chatted with her friends, her stomach growled and, in the reflection of the computer screen, saw you. She couldn't bare it. The fulcrum of her decision was on the verge of shifting violently. But in which way? Jade made her decision.</span></div></div>",
            "created":1145077200,
            "id":313174,
            "title":"Friend or Food?"
        },
        "1212112":{
            "author_name":"Edward Pick",
            "choices":[
                "Let you out?",
                "Keep you inside her stomach?"
            ],
            "content":"<div class=\"\"><div> <span>Jade turns around and looks to her right. She looks at you hungrily as you sit there, perched on her shoulder. <br>\r\n<br>\r\nI don't care! I'm way too hungry!, Jade thinks to herself.<br>\r\n<br>\r\nJade looks at you. You return her gaze. However, something is odd about her grin. It seems more malicious than cute.<br>\r\n<br>\r\n\"Jade? You feelin' OK?\" you ask.<br>\r\n<br>\r\n\"I will in a second,\" she replies.<br>\r\n<br>\r\nBefore you know what happened you feel yourself lifted into the air. Jade holds you above her head and opens her mouth wide. <br>\r\n<br>\r\n\"Jade, what the fuck are you doing?\" you scream.<br>\r\n<br>\r\nJade giggles. You feel her fingers release their grip on you. You scream, but the scream is cut off as you land with a \"PLOP!\" on Jade's wet tongue. She closes her mouth and smiles. On the inside, you are facing a living horror. Jade's mammoth tongue presses you to the top of her mouth, nearly suffocating you. You are swished around and nearly drowned in her saliva. Your arms and legs flail out spasmodically, but to no avail. You are a prisoner of Jade's mouth... Then an eerie thought hits you.<br>\r\n<br>\r\nThis is only the beginning, you think to yourself.<br>\r\n<br>\r\nAdrenaline rushes through you. You try to perform thrusts to escape, but Jade's mouth is shut, preventing your only escape. The tongue returns. You try to avoid its grasp by pulling yourself away using the soft flesh inside Jade's mouth. Your attempt at salvation is useless. Jade's tongue wrenches you off the bottom of her mouth. This time it refrains from pressing you to the top of Jade's mouth. Your heart sinks as you feel yourself being pushed to the back of Jade's mouth. You look behind you. <br>\r\n<br>\r\n\"OH SHIT!\"<br>\r\n<br>\r\nBehind you is Jade's gaping maw. In the dankness, you see Jade's thick, pink uvula swaying. Further down, you see her throat, undulating crazily.<br>\r\n<br>\r\n\"GULP!\"<br>\r\n<br>\r\nJade tilts her head back and swallows. She giggles. You start to descend down her esophagus. Screams try to escape you, but you are dumbstruck. Suddenly, the tube becomes wider and you slip out. Another \"PLOP!\" and you realize that you are sitting on the supple flesh of Jade's stomach. Jade looks down as she observes the small bulge in her belly.<br>\r\n<br>\r\n\"MMMMMMMMM. You were tasty,\" she said, \"Too bad I can't try you again.<br>\r\n<br>\r\nYou look up in half-horror, half-anger.<br>\r\n<br>\r\n\"Jade! Jade! What the fuck! Let me out!\" you scream.<br>\r\n<br>\r\nYou pound on her stomach walls, but this only results in little bumps appearing on her tummy.<br>\r\n<br>\r\n\"Jade! Jade! JAAAAAAAAAAAAAAADE! Please let me out! Please!\"<br>\r\n<br>\r\nThis plea for help gets through to Jade. She starts to feel slightly guilty. Will she...</span></div></div>",
            "created":1145250000,
            "id":313412,
            "title":"Journey to the Depths of Jade's Stomach"
        },
        "12121121":{
            "choices":[
                "No I might Swallow him Again",
                "It'll keep me from being Hungry"
            ],
            "content":"<div class=\"\"><div> <span>She coughed You out from her Mouth, You we're shivering with Fear from what she has done. Jade began to cry loud and You tried to calm her down, I'm so Sorry, the Sound of her Crying Made You feel Terrible, \"Jade, Don't Worrie I forgive You, Being in Your Mouth is a Pleasant Experience and I enjoy It, Can I go Back inside without You Swallowing ?\"</span></div></div>",
            "created":1463288400,
            "id":2148327,
            "title":"Let you out?"
        },
        "12121122":{
            "choices":[
                "The normal way",
                "The other way"
            ],
            "content":"<div class=\"\"><div> <span>\"Jade, come on! Let me out! Please! Come on, let me out! I'm your boyfriend for god's sake!\" Jake pleaded.<br>\r\n<br>\r\nJade thought about this. He is my boyfriend... she thought. Oh, but he was oh so good! Oh, what should I do?! After awhile of deep thought, she makes her decision. \"No way am I gonna let you out! You were way too delicious to just give up!\"<br>\r\n<br>\r\n\"Oh come on, Jade! PLEASE?!!!!!!!!!!!!!\"<br>\r\n<br>\r\n\"Never!\" Jade shouted defiantly. With that, she let out an awfully loud belch. After awhile, she finally said, \"I'll let you out, butnot the way you wanna get out...\" Jade grinned.<br>\r\n<br>\r\n\"You dont mean...\"<br>\r\n<br>\r\n\"Yes, you're on a one-way ticket to my ass, jake! I don't think you'll like the way you'll come out!\"<br>\r\n<br>\r\n\"So, ,you're gonna...gulp...digest me?!!\" Jake exclaimed worriedly.<br>\r\n<br>\r\n\"Thats right, jake!\" Jade giggled. \"Oh, but you're not enough to satisfy me, I'm still hungry...you'll have some friends soon jake...hee hee!\"<br>\r\n<br>\r\nJade went into the kitchen and fixed herself a sandwich complete with ham, lettuce, tomato, and mayo. She finished it in one bite she was so hungry.<br>\r\n<br>\r\nJake heard a gulping sound from above, and soon after, bits and pieces of chewed up food started raining down on him. He was just barely able to avoid the food. \"Mmmmmm...that'll definately go with my \"snack\"\" Jake heard jade say as she belched again.<br>\r\n<br>\r\nSoon after, stomach acid started spewing from the walls of jade's stomach. Oh no! she wasn't kidding, she's really gonna digest me! Jake thought. He was soon up to his waist in acid. He expected to be burning up by now, like the food around him, which was turning all to mush. But he didn't feel the slightest pain. When he shrunk, he must have become immune to acid like this. He sighed in relief. Jade's belly soon started to twist and churn, whipping jake and the rest of her food around like frantically. All I have to do is wait now... He thought.<br>\r\n<br>\r\n[On the outside] \"Mmmmm, that was a damn good meal! Especially you, Jake! I just wish more of my boyfriends would shrink down so i could eat them! Goodbye, my 'sweat' jake!\" Jade stated, feeling him and her sandwich being churned up inside her belly as she let out another belch.<br>\r\n<br>\r\nWhich way will Jake exit Jade?</span></div></div>",
            "created":1147150800,
            "id":317768,
            "title":"Trapped in my girlfriend's belly! Well, some g"
        },
        "121211221":{
            "author_name":"Edward Pick",
            "choices":[
                "Jade decides to spare Jake",
                "JADE WANT EAT!"
            ],
            "content":"<div class=\"\"><div> <span>(Someone mixed up \"other\" with \"normal\" so I'll assume this one as \"other.\")<br>\r\n<br>\r\nJake sat and pondered a way to escape from the stomach of his girlfriend. Inside her belly, time whizzed by like a fired bullet. Before Jake knew it, grvity was shifted horizontally. Inside Jade's belly, Jake sloshed. <br>\r\n<br>\r\n\"Nighty-night, Jake!\" Jade joked. She patted her bloated tummy, unconscious of the fact that she still patting the confines of a \"live\" being. Soon, Jade's stomach became the receiver of her snores. This was Jake's chance. Slowly, he creeped his way towards the entrance of her esophagus. Once inside the opening, he scaled the slightly-inclined, fleshy tube. The job was tough work, but in several minutes, Jake could feel a draft. <br>\r\n<br>\r\nSucess, he thought to himself. Now, all he had to do was climb out of Jade's mouth. This was the most treacherous job. For if he woke her, he would go right back down her throat. Slowly, slowly, he creeped over her tongue and between her teeth, for her mouth was open. Finally, Jake was outside of Jade's digestive system. However, his troubles were not yet over. Behind him, he heard a whirring. Jake turned around to see a grotesque-looking fly. The fly suddenly swooped in on Jake. With his fists, he batted it away. Yet, it circled round and swooped in again.<br>\r\n<br>\r\n\"Fucker! Get the fuck out of here!\" Jake screamed. Suddenly, the fly disappeared. Over it was a massive hand. Jake was releived. But then his fear grew again. He turned around to see Jade, looking straight down at him. His scream had woken her up. He stepped back. Everything was silent. Then came a monstrous gurgle... from deep inside Jade's stomach...</span></div></div>",
            "created":1151643600,
            "id":327696,
            "title":"The Maw"
        },
        "1212112212":{
            "choices":[
                "She vomits Jake up",
                "She takes a drink of water to try and settle her stomach"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, what have we here? I can see that you have escaped the confounds of my stomach!\" Jade giggled. She grabbed him and raised him up to her face. \"I am hungry, Jake. I think you will make a fine midnight 'snack'!\"<br>\r\n<br>\r\nBefore he knew it, Jake was being dangled over Jade's mouth. \"Please, don't do this, Jade!\" Jake pleaded. \"Why should I listen to you?! You may be my boyfriend, and I may believe in hearing out my lover's wishes, but at the moment I am much, much bigger than you are! AND I'm hungry! So SAY HELLO TO MY STOMACH, JAKE!!!\" Jade exclaimed.<br>\r\n<br>\r\nShe then let go of Jake. He landed with a plop on Jade's humongous, pink tongue. Her tongue suddenly flipped Jake towards the back of her mouth. Please! Please let me escape this! I may be immune to her digestive juices, but I haven't any wishes to be shit out of her ass!!! Jake pleaded silently. But, as usual, he was less fortunate. There was a sudden sucking sound, and Jake was pulled into Jade's throat.<br>\r\n<br>\r\nHe soon found himself back in the the huge, pink, undulating chamber that was Jade's stomach. She then belched loudly. \"Mmm! You were still very delicious, Jake! I bid you farewell!!!\" Jade giggled, slightly shaking her stomach. \"Well, it seems there's no other way out but out her ass, except of course if she throws up...\" Jake said to himself.<br>\r\n<br>\r\nSuddenly, Jake had an idea. He made his way up to Jade's stomach walls, making a squelching sound with each step, and started banging on them with his tiny fists. \"Hey, stop it Jake!\" Jade exclaimed. She had felt him. She started to feel sick to her stomach.</span></div></div>",
            "created":1152162000,
            "id":328957,
            "title":"Back to the stomach...damn fly..."
        },
        "12121122121":{
            "author_id":"solidwarrior",
            "author_name":"Solid",
            "choices":[
                "Vomits him out",
                "swallow "
            ],
            "content":"<div class=\"\"><div> <span>suddenly Jade's stomach began feel disturbed Jake began to feel the compression and he feels himself going up,meanwhile Jade hold her hand on her chest feeling him going up and when Jake finally reached her mouth his movement suddenly stopped, Jade's mouth was full with liquid with Jake sinking inside of it.<br>\r\n<br>\r\nshe then:<br>\r\n </span></div></div>",
            "created":1235278800,
            "id":651026,
            "title":"She vomits Jake up"
        },
        "121211221212":{
            "author_id":"dan212",
            "author_name":"dan",
            "choices":[
                "trapped in the stomach",
                "finding another way out"
            ],
            "content":"<div class=\"\"><div> <span>as jade held her hand over her mouth jake was swiming in the vomit comtaned in her mouth, as more vomit joined jake in jades mouth he was running out of breathing room and knew he would soon drown if jade did not let go and vomit due to his strugles<br>\r\nwhist jake was in jades mouth she was thinking about what to do as she did not want to get out of bed to vomit so with pure force of will she slowly stoped her gaging and the with a giant gulp swalowed all of the vomit and jake back into her cavernous stomach.<br>\r\njake knew he was in trouble as jades gags stopped and then he was shocked when she manged to swallow the mouthfull for vomit with him in it</span></div></div>",
            "created":1481864400,
            "id":2250770,
            "title":"swallow : a force of will"
        },
        "12121122122":{
            "author_name":"Edward Pick",
            "content":"<div class=\"\"><div> <span>Jade grabbed for a bottle of water on her dresser.<br>\r\n<br>\r\n<br>\r\n\"This time, I'm making sure you don't escape!\" Jade said. She tilted her head back and slugged her water bottle dry.<br>\r\n<br>\r\n<br>\r\nUnfortunately for Jake, things were about to go from bad to worse. The water flowed down Jade's esophagus into her awaiting stomach. Jake, sitting on a mound of flesh, felt a drop of water on his head. A split second later, a torrent of water gushed down from above. Luckily, for Jake, he was a strong swimmer. He broke the surface of the water. Jade's stomach was now full of water, like an in-ground pool. On the outside, Jade's belly sloshed around like a water balloon. She patted it lightly and felt the water shift under it. She pulled her nightshirt over her engorged middle. Jake must be gone now, she figured. With a shock that sent gurgles up from her tummy, Jade landed back in her bed and continued sleeping.<br>\r\n<br>\r\n<br>\r\nJake, swimming for the surface of the water, now that gravity had shifted, was nearly out of breath.<br>\r\n<br>\r\n<br>\r\nAlmost there! He thought as he neared the surface. With a whoosh that sent water droplets every which way, Jade emerged from the pool of water. He looked around. Nothing. He fumbled in his pocket for several moments. Finally, he pulled out a box of matches he had saved from last night, when he and his friends had set fireworks off at a vacation spot across the bay. Jake lit one of these, which surprisingly stayed dry, and looked around. Just undulating pink walls and a pool of water. Suddenly, Jake felt a change - A surge throughout his entire body. It stopped... Then started again. Jake, then, realized what was going on. He saw the water level dropping inside Jade's stomach. He also noted that he was growing. Water! That's what it was! Like a sponge absorbing water, Jake grew with water. However he shrunk, it was related to how hydrated he was. <br>\r\n<br>\r\n<br>\r\nOn the outside, Jade felt a disturbance. She sat bolt upright in her bed. She threw her covers off and was shocked to see her belly start to swell. She let out a frightened yelp. A second later, her shirt rolled up, exposing her basketball sized stomach. Still, it continued to grow. <br>\r\n<br>\r\n<br>\r\n\"What the hell is going on?!\" She shrieked.<br>\r\n<br>\r\n<br>\r\nSuddenly, it stopped. Jade's tummy now was the size of a medicine ball. She stared at it with a shocked expression. Inside, Jake was cramped and half his original size. He shifted around, but was very limited when it came to movement. Jake's body, in contact with Jade's stomach walls, stimulated her stomach to start producing hydrochloric acids. Jake didn't find this a problem at first, but after several minutes he felt a tingling sensation all over. The tingling became a burning. The burning, an indescribable pain. A horrific  fact came to Jake. Now that he was reverting to his normal size, normal limitations also reverted. Jake clawed at Jade's stomach walls, but this only increased the production of stomach acids. The air around Jake became bitter and burdened Jake's breathing. The match fell out of his hands and was doused in Jade's stomach acids. With a last breath, Jake surrendered and slowly continued to digest. <br>\r\n<br>\r\n<br>\r\nOn the outside, Jade's belly had swelled up to the size of an inflatable, rubber exercise ball. At this point it stopped. Silence followed, only to be broken by a symphony of gurgles.<br>\r\n<br>\r\n<br>\r\nJade never figured out what had happened inside her stomach. Remains proved that she had actually digested Jake. Jake's parents set up a search, but after two years, he was never found. Jade, filled with guilt, never confessed to them either. She claimed the last she saw of him was \"at a pool.\" As for Jade's belly, it remained incredibly bloated for the rest of the night. That morning, she \"passed it all out.\" Her stomach never returned to normal, being stretched so intensely. She now looks as though she has swallowed a basketball. However, her new boyfriend, Rick, doesn't mind.</span></div></div>",
            "created":1153630800,
            "id":333834,
            "title":"Hydration, Inflation, Digestion!"
        },
        "121211222":{
            "choices":[
                "She flushes jake away along with her excrement.",
                "She notices a small body on the toilet tissue after wiping."
            ],
            "content":"<div class=\"\"><div> <span>With a sudden wrench, jake was pulled backwards and forced throught a tight fleshy gap. \"No! No this is not happening!\" Jake was squeezed down a hot, wet, stinking tube. He felt as if he was being dragged through a tight sleeping bag.<br>\r\n<br>\r\nAfter about half an hour jake was very dizzy. His body ached with the exertion of being forced this way. Stinking food surrounded him. By now though it was just a sloppy mush. <br>\r\n<br>\r\nThen he was forced again through a tight hole. But by now he was so exhausted he passed out. <br>\r\n<br>\r\n***<br>\r\n<br>\r\nMeanwhile Jade had finished speaking to her friends and had gone to sleep. <br>\r\n<br>\r\nWhen she woke up she was hit by a sudden barrage of guilt. WHAT THE HELL HAVE I DONE!?! I killed some-one...not just someone, my boy friend! These feelings continued as she went to the toilet. Lowering her underwear she sat on the loo. She let out a long wet stinking fart. Then, after exerting some force, began to take a very large dump. After abou 5 minutes she got up and wiped her butt.</span></div></div>",
            "created":1148619600,
            "id":320868,
            "title":"Jake's final passage"
        },
        "1212112222":{
            "choices":[
                "Jade cleans up jake and goes back to her bedroom.",
                "Jade cleans up Jake and swollows him again!!"
            ],
            "content":"<div class=\"\"><div> <span>Jade stood up and took a piece of toilet paper. She wiped her ass, then was about to throw the tissue in the toilet wen she sees a figure mixed in with the skid marks. \"Jake?\" She let out a gasp. Surely he couldn't have survived? She took the papr to the sink, filled it with tepid warm water, then gently with her nail, pried Jake's body off and into the water. His body floated on the surface and Jade threw the paper away. <br>\r\n<br>\r\n\"Can you hear me jake?\"<br>\r\n<br>\r\n***<br>\r\n<br>\r\nJake woke up with an awful stench in his nostrils and mouth. It was like he had been force fed pure effluent. With a reflex action he began to swim. He suddenly screamed. Was he in the loo, and Jade about to flush him away? Before he could worry for too long however he noticed Jade's face looking down at him sympathetically. He felt sick. He screamed with terror then puked up. \"It alright Jake don't worry. Im not gunna hurt you.\" Jade reached down into the bowl and took a hold of him with her thumb and fore-finger. He screamed again. </span></div></div>",
            "created":1148619600,
            "id":320869,
            "title":"End of the line"
        },
        "12121122221":{
            "choices":[
                "She sees him",
                "She doesnt see him and flushes"
            ],
            "content":"<div class=\"\"><div> <span>Jade gets completely naked and lays down on her bed putting Jake on her belly. He trembles at her growling tummy. Jade tells Jake to walk on her all the way to her face. He does exactly that and Jade rolls her tongue out and tells him to walk into her mouth. He stops and knows she will just swallow him again, but if he doesnt she will do it anyway. So Jake takes 1 step onto her tongue and is pulled into her mouth. Jade plays with him briefly then \"GULP\", she feels him wiggle all the way down her throat and in her belly, she LOVES the feeling of it. Jade has a big cup of water to wash him down. She takes a nap and when she wakes up she feels no movement in her belly. so she goes to the bathroom.</span></div></div>",
            "created":1152507600,
            "id":329841,
            "title":"Swallowed Again"
        },
        "121211222212":{
            "author_id":"leviepollard",
            "author_name":"Write/reader",
            "choices":[
                "Flushed",
                "Still inside of Jade"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But was he in the toilet, or still inside her, (maybe just sleeping, or some other reason she couldn't feel him.)</span></div></span></div>",
            "created":1505021220,
            "id":2383424,
            "title":"She doesnt see him and flushes"
        },
        "12121122222":{
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Jade brings him up to her face. \"I am so sorry! I didn't mean to do that! I was just so hungry!!\" Jade exclaimed worriedly. \"Don't worry, I seem to be immune to the acid, so i'm fine! No hard feelings!\" Jake replied.<br>\r\n<br>\r\n\"Good! Here, let me clean you off.\" Jade took a cloth from nearby and cleaned Jake off. She then gave him a gentle kiss. Suddenly, her stomach gave a loud growl. Oh no! I'm having the desire to eat him again! He was so delicious, but he's my boyfriend! Oh man, why did he have to be so good?! Jade thought.<br>\r\n<br>\r\nOh great, here we go again... Jake thought. <br>\r\n<br>\r\n\"Jake, I am just way to hungry to just give you up, i hope you don't mind...\" Jade said. \"No, not at all...I mean, i'm immune to the stomach acid after all, so what could it be any harm?!\" Jake replied.<br>\r\n<br>\r\n\"Very well, then...\" Jade stated. She then tossed him into her mouth. She held him there for a few moments, savoring his flavor. She then quickly swallowed him. \"Mmmmmmmmm\" She moaned.<br>\r\n<br>\r\nJake soon fell into her familliar stomach. She then belched loudly, and went about her business. \"I'm not going to eat anything until you are out of there, so you will be in there awhile, jake.\" Jake could here jade say as she patted her belly.</span></div></div>",
            "created":1148965200,
            "id":321556,
            "title":"Eaten again!"
        },
        "121211222221":{
            "choices":[
                "Jade pushes Jake back up into her anus.",
                "Jade put Jake down the front of her underwear"
            ],
            "content":"<div class=\"\"><div> <span>Jake really wished he'd now tried to actually TRY and convince Jade from swollowing him again. Her stomach smelt foul! He couldn't begin to describe how bad it was, last time the shock must've lessened his reaction to the smell, but now it was putrid.<br>\r\n<br>\r\nJake, while being thrown around in the fleshy, undulating room, began vomitting. After a while of this it seemed his body could take it no longer, and once more he blacked out.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nAfter waking up, he realised where he was. He was finding it stupidly hard to breathe, and felt as if he was being compacted on all sides. He knew what was happening. The smell was more foul than that of the Jade's stomach. It was pure shit! <br>\r\n<br>\r\nEvery so often Jake's body would be retched forward slightly along with the hot, steaming mass around him.<br>\r\nHe closed his eyes. This wasn't happening! He waited here for what seemed like a lifetime until the constant falling sensation of Jade walking stopped as she sat down. <br>\r\n<br>\r\nJake heard a large rumble ahead of him which must've been Jade farting. Then, without warning, he his body was heaved forwards until he heard a splash. After a couple of moments he began moving again until he felt himself falling at an alarming rate. <br>\r\n<br>\r\nWith a splash, him and the excrement surrounding him hit the toilet water. Jake sturggled to break free. After a couple of seconds he heaved out his legs and swam up to take a breath. However, just as he took in some fresh air, he was hosed down with a yellow, foul tasting liquid. It was horrid! Once the spray stopped he looked up and saw Jade's buttocks, gaping wide anus, and dripping labia. She stood up, wiped herself and threw the used paper in just behind him. Then, hold her nose, she looked into the toilet bowl and saw Jake tredding water at the front. <br>\r\n<br>\r\nAfter taking a piece of toilet paper in her hands, she picked him up with it and dried his body. <br>\r\n<br>\r\nJade dumped him in her hand. \"Wow Jake, you know I could feel you in my stomach right until i went to bed! I Kept expecting to fart you out or something. My my Jake that was so wonderful!\"<br>\r\n\"Please don't do that again, it was horrid, i can't do it anymore. I bearly survived this time. I almost couldnt breathe! Luckily you had gas. OH MY GOD! Can you hear me? 'lucky that you had some gas so that i could breath!' Don't ever make me do that again. I stink!!\"<br>\r\n\"I'm sorry Jake, but i don't know if i can resist. I will try not to swollow you for a while so you can rest though.\" Here, this is where you'll be safe.</span></div></div>",
            "created":1149051600,
            "id":321786,
            "title":"Inside again"
        },
        "1212112222211":{
            "choices":[
                "In Jade's underwear",
                "In Jade's hand"
            ],
            "content":"<div class=\"\"><div> <span>\"You'll be safe inside here\" Jade said, grinning. \"Wait, Jade, no!!!\" Jake cried, but it was too late. Jade was already pulling down her underwear and lowering him to her ass. \"I am sorry Jake, but I don't know where else to put you...\" Jade said apologetically.<br>\r\n<br>\r\nJade shoved him back up her ass, moaning slightly as she did. \"I'll keep you here for the time being...\" She said afterword. This is just great! I'm stuck in my girlfriend's ass!! I would find this erotic, but it wreaks horribly in here!!! Jake thought. A short while later, sleep got the best of Jake, and he fell asleep.<br>\r\n<br>\r\nA few hours later...<br>\r\n<br>\r\nJake slowly opened his eyes, hoping that was all a dream. Unfortunately for him, he was still resting in her foul anus. Luckily, there wasn't any shit behind him. Suddenly, a foul wind passed by him. It was so putrid that he had to cover his nose. She must be passing gas... Jake thought.<br>\r\n<br>\r\n[meanwhile, on the outside] Man, am I hungry...should I eat him now, or save him for later? Jade thought as her stomach rumbled.<br>\r\n<br>\r\n[back in the ass] Suddenly, Jake felt himself begin to move. \"Oh great! She said she was gonna probably eat me again!!! I really hope she isn't!\" Jake exclaimed as his feet started to move through her anus.<br>\r\n<br>\r\nWhere does he end up?</span></div></div>",
            "created":1149051600,
            "id":321834,
            "title":"Back in the ass"
        },
        "12121122222111":{
            "choices":[
                "Does he give in and get sent down to her stomach?",
                "or does he try and escape?"
            ],
            "content":"<div class=\"\"><div> <span>As Jake slid out of Jade's ass, he realized that it was still dark. He felt his surroundings. It was soft. I must be in her underwear... Jake thought. He moved around her underwear 'til he was facing her giant pussy lips. They were wet. \"She must be horny.\" Jake whispered to himself.<br>\r\n<br>\r\nHe moved up to them and placed his hand on them. They shifted and his hand got stuck inside her pussy. He heard moaning from outside. Suddenly, a giant hand came down and started rubbing her enourmous clit. Jake suddenly got sucked into her pussy. Inside her, it was soft and moist.<br>\r\n<br>\r\nSuddenly, two fingers appeared and started moving in and out of her. Jake was suddenly rock hard. He couldn't resist, and he started pleasuring himself along with his gf.<br>\r\n<br>\r\nSuddenly, just when he was about to cum, Jade pulled her fingers out of her pussy, and the walls around him contracted as her juices washed over him. He suddenly shot out of her and back into her underwear along with her cum.<br>\r\n<br>\r\nShe then reached back into her underwear and pulled him out and up to her face. \"THAT WAS AMAZING, JAKE!!!\" She exclaimed. She suddenly had an evil look in her eyes. She licked her lips and started bringing him up to her mouth. \"Wait, Jade, please, not again!!!\" Jake begged. Jade wasn't listening to him, however, and tossed him into her mouth. He started moving around her mouth as she savored his flavor. He then started moving to the back of her mouth. He could see her gaping maw, ready to send him to her hungry, rumbling stomach. \"NOOOOOOOOO!!!\"</span></div></div>",
            "created":1149051600,
            "id":321843,
            "title":"Pleasuring my girlfriend"
        },
        "121211222221112":{
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Adrenaline shot through Jake's body, and he shot forward, trying to escape her mouth as best he could. But it was hopeless, for her lips were tightly shut, keeping him prisoner inside her gigantic mouth.<br>\r\n<br>\r\n\"JAKE, IF YOU STRUGGLE, YOU WON'T BE THE ONLY THING THAT WILL END UP IN MY STOMACH!\" Jade warned. \"I WAS GOING TO SWALLOW YOU ONLY, SO YOU WOULDN'T HAVE SUCH AN AWEFUL EXPERIANCE DOWN THERE...AND I KEPT MY PROMISE TOO. EVER SINCE I SWALLOWED YOU THE LAST TIME, I HAVEN'T EATEN A THING!\"<br>\r\n<br>\r\n\"Then what about the shit?\" Jake asked suspiciously. \"THAT WAS FROM PASSED MEALS. I REALLY DID KEEP MY PROMISE...\" Jade promised. \"BUT, IF YOU KEEP TRYING TO ESCAPE, YOU WILL HAVE TO ENDURE MY DIGESTIVE PROCESS, FOR I AM MIGHTY HUNGRY, JAKE!\" Jade giggled as she started moving Jake to the back of her mouth once again. \"I don't care! I will NOT allow you to swallow me again!\" Jake cried, thrusting himself forward once again.<br>\r\n<br>\r\n\"I WARNED YOU JAKE, BUT YOU WOULDN'T LISTEN! SO LIKE I SAID, I WILL BE HAVING MORE THAN JUST YOU FOR LUNCH!\" Jade giggled. She quickly moved him to the back of her mouth and swallowed. He was soon back in her now empty stomach. She kept her promise...I am such an idiot! If only I had listened! Now I have to travel her digestive system alongh with her lunch, instead of it just being me! Jake thought, mentally kicking himself in the side for his mistake.<br>\r\n<br>\r\n<br>\r\nSoon, Jake was getting rained upon by bits and pieces of what looked like chewed-up burger and french fries, along with Mountain Dew. \"Well, at least she's a Dew drinker...\" Jake said to himself, chuckling a bit. Soon after, her stomach acids started pouring in, and her stomach started churning him and her food. He just sat and watched as more food rained in, and the food around him started to dissolve. Luckily for him he was still immune to the acid.<br>\r\n<br>\r\n[note from SoBe - don't make him not immune to the acid] </span></div></div>",
            "created":1149138000,
            "id":321986,
            "title":"Lunchtime"
        },
        "1212112222211121":{
            "choices":[
                "inside her lower intestine, but not quite to her anus?",
                "or inside her not so full bladder"
            ],
            "content":"<div class=\"\"><div> <span>\"I tried to warn you, Jake...\" Jade said as she belched rather loudly. \"...But you didn't listen!\" <br>\r\n<br>\r\nShe patted her belly in satisfaction. She belched again. \"I hope you 'enjoy' your stay inside my stomach!\" She giggled. \"Come on, Jade! This isn't funny at all!\" Jake exclaimed angrily. \"I'm sorry Jake, but you were just too delicious to give up! Plus, I warned you that I might not be able to resist eating you again!\" Jade replied.<br>\r\n<br>\r\n\"You tasted even better in my juices anyway!\" Jade exclaimed. Her stomach gurgled as its contents, including Jake, continued to be whipped around. Everything around Jake was dissolving into a mush. \"I'll see you when you get out, hee hee!\" Jade giggled.<br>\r\n<br>\r\nSuddenly, she felt herself getting wet. Jake felt himself fall backwards as the mush around him shifted. She must have laid down... Jake thought. Meanwhile, Jade reached her hand down her pants and started rubbing herself. Jake heard her moan with pleasure as she continued to masturbate. She must be pleasuring herself! Well, I guess this isn't a total loss! Jake thought excitedly. He continued to listen, getting horny in the process. He started to masturbate along with her.<br>\r\n<br>\r\nJade inserted a finger inside her wet pussy, and a jolt of pleasure surged through her body. She moaned uncontrollably. She started sliding her finger, then fingers, in and out of her pussy. She soon could feel an orgasm coming on.<br>\r\n<br>\r\nJust as Jake was about to cum, everything around him started to rock and shake violently, accompanied by Jade's screams of pleasure, for a few moments, then it settled again. Wow! thought Jake.<br>\r\n<br>\r\nSuddenly, he started to get sucked through a tight ring at the bottom of her stomach. \"No, not now!\" Jake cried as he got pulled the rest of the way through the ring. Her small intestine now started to propel him along. Because of the fumes, he passed out.<br>\r\n<br>\r\nWhere does he wake up?</span></div></div>",
            "created":1150174800,
            "id":324136,
            "title":"Inside of a horny girlfriend"
        },
        "12121122222111211":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Jake woke up in a hot, steamy, smelly place. A horrible stench was coming from in front of him. \"This just keeps getting worse and worse!\" You say, knowing perfectly well what lay ahead of you. Suddenly, something soft and equally smelly bumped into you from behind. \"Oh no! I'm getting packed into her shit!\" You shout as you are sandwitched into between the shit.<br>\r\n<br>\r\nSuddenly, you start to propel forward. You feel yourself free fall, then you hear yourself splash into the toilet water. You are just barely able to push out of the shit.<br>\r\n<br>\r\nDoes Jade see you?</span></div></div>",
            "created":1150952400,
            "id":325918,
            "title":"In the ass"
        },
        "12121122222111212":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>When you wake up, you are floating in a small sack partially filled with a yellowish liquid. I must have been absorbed into her blood stream and sent to her bladder. You think. It doesn't seem to be filled quite yet! Guess I'll have to wait it out.<br>\r\n<br>\r\nA couple of long hours, the bladder is just about filled to the top. Suddenly, the urine starts to descend at an alarming rate. \"She was be peeing now.\" You say to yourself. Suddenly, you get shot out of Jade's pussy and splash down in the toilet bowl.<br>\r\n<br>\r\nDoes she look to see if you're there?</span></div></div>",
            "created":1162875600,
            "id":357685,
            "title":"first guy in history to be pissed out"
        },
        "121211222221112121":{
            "choices":[
                "she flushes",
                "she picks you up and cleans you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>well You lie in the lie the toilet water Jade looks if you came out</span></div></span></div>",
            "created":1162962000,
            "id":357776,
            "title":"wats next"
        },
        "1212112222211121212":{
            "choices":[
                "Eat him now",
                "Save him for lunch (take him to school and eat him there)"
            ],
            "content":"<div class=\"\"><div> <span>Jade looks down in the toilet bowl, and she sees you! She reaches in and picks you up. \"So, i see, um, you came out of \"another place\"...did you, um, enjoy it...\" Jade stuttered, blushing slightly.<br>\r\n<br>\r\n\"Um...yeah, sort of...anyway, didn't it hurt you to pee me out, considering that solid things usually don't come out of there?\" Jake asked.<br>\r\n<br>\r\n\"No, not really...\" Jade replied. Suddenly, her stomach started to growl. Oh no! I don't wanna eat him now, but yet i am so hungry! Should i save him for lunch tomorrow? Or eat him now? Jade thought as her stomach gave a loud rumble.<br>\r\n<br>\r\nWhat will she do?</span></div></div>",
            "created":1163134800,
            "id":358343,
            "title":"Out at last"
        },
        "12121122222111212122":{
            "choices":[
                "Yes",
                "too late, you're goin down...literally"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, you were being picked up and placed in a jar. \"Hey, what the hell are you doing?!\" You shout from the jar. \"I'm gonna take you to school tomorrow, and I don't want you to escape!\" Jade replied. That being said, she placed the jar you were in on a shelf in her room.<br>\r\n<br>\r\nHours passed, and you finally felt the jar being lifted off the shelf. Jade dumped you into her hand and placed you in her backpack. \"See you at lunch!\" Jade giggled, grinning. \"Oh god...\" you mutter as she zips her bag up.<br>\r\n<br>\r\nLater, at school...<br>\r\n<br>\r\nSuddenly, the bag began to unzip. A hand reached down into it and pulled you out. It was Jade. \"Well Jake, time for lunch!\" She said.<br>\r\n<br>\r\nWhen Jade got to the cafeteria, Jade dropped you onto a tray and got in line. After getting her lunch, she started for a table. As she was making her way to one of the lunch tables her rival, Jenny, bumped her shoulder into Jade. This caused you to go flying.<br>\r\n<br>\r\nYou landed in a vast, thick mountain of a white substance of some sort. There was a brown pool of what appeared to be gravy near where you landed. You looked out to see Jade's humongous figure walking away. You then looked behind you to see Jenny. It then dawned on you: you were in her mashed potatos!<br>\r\n<br>\r\nSuddenly, her fork came down and scooped you and some of the mashed potatos up. You were slowly making your way to her gaping mouth. Will you call for help?</span></div></div>",
            "created":1163566800,
            "id":359270,
            "title":"School Lunch"
        },
        "121211222221112121222":{
            "choices":[
                "try to excape",
                "give in and go the natural way"
            ],
            "content":"<div class=\"\"><div> <span>It dawned on you that there was no escaping this. Jenny shoved you and the mashed potatoes into her mouth. You just barely jumped onto the middle of her tongue as she started to chew. You were just barely able to hang on.<br>\r\n<br>\r\nSuddenly a big gob of mashed potatoes slammed into you. She was swallowing! You tried to resist, but it was no use. You were soon sent plummeting down to her awaiting stomach.</span></div></div>",
            "created":1164517200,
            "id":361689,
            "title":"eaten by your girlfriend's rival"
        },
        "1212112222211121212222":{
            "choices":[
                "She \"let's you out\" and notices you....",
                "Something else,,,"
            ],
            "content":"<div class=\"\"><div> <span>The throat muscles come to a halt and you are deposited into the stomach... Of your girlfriend's RIVAL. Although, this stomach seems more comforting than Jade's. It's bigger, and doesn't have the stench! In fact, it kind of smells GOOD in here, like roses, almost.<br>\r\n\"*Hic* Mmmm... hehe, Those were some good potatoes, *Burp*\" Jenny giggled, unknowing of the little man in her stomach.<br>\r\nYou lay in the stomach and take a relaxing nap... and wake up in the large intestine. Oh boy...</span></div></div>",
            "created":1228539600,
            "id":616157,
            "title":"Yet another stomach!"
        },
        "12121122222111212122221":{
            "choices":[
                "She decides to hold you hostage",
                "She decides to eat you, you were yummy"
            ],
            "content":"<div class=\"\"><div> <span>A few hours later, you come to the end, and you're encased in Jenny's shit! Oh no!<br>\r\n<br>\r\nJenny feels pressure in her lower bowels and heads to the bathroom. She pulls down her pants, sits down on the toilet, and starts to pee. Then, with a fart, she begins to push.<br>\r\n<br>\r\nYou suddenly begin to travel downward, and soon are in the toilet. You break free from the shit and move out of the way as another log plummets from her lovely yet terrifying ass. You begin to shout. \"Hey! Down here! In the toilet!!\"<br>\r\n<br>\r\nShe wipes herself and gets up. She peers down into the toilet and sees you. \"Oh! What do we have here? AS little man!! How the hell did you survive my tummy?\" She suddenly recognizes you. \"Jake!\" She suddenly grins. This can't be good...</span></div></div>",
            "created":1234414800,
            "id":646148,
            "title":"Escape and noticed"
        },
        "121211222221112121222212":{
            "choices":[
                "Swallow",
                "She's just messing with him"
            ],
            "content":"<div class=\"\"><div> <span>Jake shivers. The look on Jenny's face could only mean one thing: trouble. \"Um...I...I don't really know to be honest,\" he said shakily. He was shaking, partially because he was nervous, but also because he was still in the cold toilet water. Jenny smiled down at him. \"Awe, come here! You must be freezing,\" said Jenny as she plucked him from the toilet and flushed it. Jake breathed a sigh of relief, as that could have been him going down the tubes.<br>\r\n<br>\r\nJenny carried Jake to her room and shut the door. She gently laid him on her soft bed and sprawled out next to him. She smiled half-innocently at Jake and grabbed him once again. Carrying him upward a bit, she put him on her flat tummy and laid back, looking at him. Jake could hear her stomach rumbling hungrily below him. He gulped at the sound of it. \"So...\" said Jenny. \"How did you get this small?\"<br>\r\n<br>\r\n\"I'm not sure actually,\" replied Jake. \"I remember dozing off yesterday, and when I woke up I was already shrunk,\"<br>\r\n<br>\r\n\"Mmhmm,\" as she continued to look at him. That's when Jake noticed that she wasn't looking. She was STARING, and she was licking her lips, too. \"Um...why you looking at me like that?\" asked Jake nervously.<br>\r\n<br>\r\n\"Mmmm, no reason, it's just that you're so damn cute...\" she said. \"...That I could just eat you up,\" She grinned and picked him up. Further and further up she carried him until he was level with her face...with her mouth. She licked her lips again and then they parted wide. \"Wait! What are you doing!?!?!?\" he shouted. \"Didn't you hear me? I said I could just eat you up, heehee,\" she giggled. She then opened her mouth wide and dangled him over it.<br>\r\n<br>\r\n\"No, wait!! Please don't do this!!\" he pleaded. Ignoring him, she dropped him, and he landed with a splat on her tongue. \"MMMMM!\" she moaned. \"You are yummy!!\"<br>\r\n<br>\r\nJake's world was turned upside down as she swished him all around her mouth, savoring him. After awhile of this, she grew tired, and her tummy rumbled, begging for food.<br>\r\n<br>\r\nDoes she swallow? Or is she just messing with him?</span></div></div>",
            "created":1271912400,
            "id":871708,
            "title":"She decides to eat you, you were yummy"
        },
        "1212112222211121212222122":{
            "author_id":"spongebob1234",
            "author_name":"Trisha",
            "choices":[
                "my clit.\"",
                "my feet.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She spit him out into her hand.  \"Ha!  You fell for it.  Stupid.  I always knew you were stupid.  No, see, I have a better use for you.  First you're going to massage....</span></div></span></div>",
            "created":1318136400,
            "id":1203135,
            "title":"She's just messing with him"
        },
        "121212":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "You don't want to be a chew toy for some animal... You want back to normal!",
                "Growing back can wait... You want to have fun with Giantess Jade while you can!"
            ],
            "content":"<div class=\"\"><div> <span>You grabbed onto the tight fibers of your girlfriend's shirt and began pulling yourself back up to Jade's boobs. By the time you finally got back, you see her massive hand reaching into her shirt to pluck you back out. Taking you between her thumb and index finger, Jade lifts you up and sets you gently onto the palm of her hand. She noticed that you were covered in sweat.<br>\r\n<br>\r\n\"Hey, are you alright? Was it really that sweaty in my cleavage? I'm sorry...\"<br>\r\n<br>\r\n\"Oh, no Jade! It wasn't you... Actually, it was like heaven in there... I'm sweaty because the jiggling kinda shook me loose, and I had to climb your shirt to get back up... I really did like it, though!\"<br>\r\n<br>\r\nYour titanic girlfriend simply blushed and giggled. Then she smiled at you and said...<br>\r\n<br>\r\n\"Well, I'm glad that I could make my little boyfriend happy... You really are such a pervert, though...\"<br>\r\n<br>\r\nYou both laugh a bit, and then you respond.<br>\r\n<br>\r\n\"Hey Jade, I'm just a normal teenage boy! You're the one who put me there in the first place... What boy in their right mind wouldn't get excited by that! Most guys would kill to be in that position! I'm just lucky enough to have a girlfriend who would be so nice about it...\"<br>\r\n<br>\r\n\"Yeah, well... You may be a pervert, but you my little pervert...\"<br>\r\n<br>\r\n\"Whatever you say, Goddess Jade!\"<br>\r\n<br>\r\n\"Oh boy... You are just too much... Don't you know that flattery gets you nowhere?\"<br>\r\n<br>\r\n\"Yeah, but it does make me seem that much more lovable...\"<br>\r\n<br>\r\n\"Whatever... So what do you want to do now? I'm always willing to try to find a way to fix you, but this might be a once in a lifetime opportunity. Are you sure that you don't want to have a little fun with your giantess girlfriend before we do that?  Judging by how you liked my boobs earlier, I'm sure you would enjoy the rest of me just as much...\" <br>\r\n<br>\r\nJade finished that last sentence with a rather seductive wink. You were torn. You really wanted to turn back to normal as soon as possible, but you also wanted to know what it would be like to have a giantess girlfriend for a while. You knew that Jade would never hurt you, so that worry was gone... Still, there were always so many unknowns at your size. A stray cat could eat you right off the streets for Pete's sake! You eventually come to a decision.<br>\r\n<br>\r\nWhat is the decision? Will you play it safe and try to grow back ASAP, or will you have some fun with your new size first?</span></div></div>",
            "created":1297918800,
            "id":1055777,
            "title":"What to do with you..."
        },
        "1212122":{
            "choices":[
                "Lick You into her Mouth",
                "Kiss Hum"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jade Blushed and said \"Thank You\" excitedly, which echoed through You like a large amount of Thunder, She Opens up her Mouth and pants like a dog out of breath, Saliva started to poor out out her Mouth, she decide to...</span></div></span></div>",
            "created":1463115600,
            "id":2147644,
            "title":"Growing back can wait... You want to have fun w..."
        },
        "12121221":{
            "choices":[
                "Yes Please ",
                "I like it just the way it is "
            ],
            "content":"<div class=\"\"><div> <span>Her Hot tongue came at You like a wave through the Ocean, and Now You we're Wet. You look out of Jade's Mouth and Noticed how much You loved it in there. She Began to say with You in there,<br>\r\n\"Want to make it Interesting ?\"<br>\r\nYou reply with...<br>\r\n</span></div></div>",
            "created":1463115600,
            "id":2147646,
            "title":"Lick You into her Mouth"
        },
        "121212211":{
            "author_id":"vorelover3678",
            "author_name":"RioSkyron",
            "choices":[
                "She tosses you around her mouth like crazy",
                "she swallows you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she end up doing so?</span></div></span></div>",
            "created":1477458000,
            "id":2228878,
            "title":"Yes Please "
        },
        "121212212":{
            "author_id":"wr1ter98",
            "author_name":"writer98",
            "choices":[
                "She brings you lower (pussy)",
                "She brings you lower (ass)",
                "Something not involving her body"
            ],
            "content":"<div class=\"\"><div> <span>Jade continues playing with you in her mouth for a few minutes. She then leans her head forward and opens her mouth, allowing you to slide onto her waiting hand.<br>\r\n<br>\r\n“So how was that?” Jade asks.<br>\r\n<br>\r\n“Better than I expected,” you admit, “I had no idea it’d be as nice as it was.”<br>\r\n<br>\r\n“I’m pretty anal about keeping clean. Anyway, if you’re up for it, I have another idea to try.”<br>\r\n<br>\r\nYou stand up and stretch, which is difficult, given that you’re completely covered in her saliva.<br>\r\n<br>\r\n“Yeah, sure.”</span></div></div>",
            "created":1554984660,
            "id":2643448,
            "title":"New experiences"
        },
        "12121222":{
            "choices":[
                "Enjoyed the Taste of her Boyfriend",
                "Became Hungry"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jayd Licked her lips with her Humongous Tongue and the Cherry lipstick made it more attractive, a Simple kiss almost sucked You right into her Mouth, She...</span></div></span></div>",
            "created":1463115600,
            "id":2147648,
            "title":"Kiss Hum"
        },
        "12122":{
            "author_name":"jakov",
            "choices":[
                "Do you give her those wishes now?",
                "Do you try to calm down and figure everything out?"
            ],
            "content":"<div class=\"\"><div> <span>She thinks you are a big(relatively) gross bug and brushes you away, luckily you get knocked against Jade's skirt. You don't know what your thinking but you run around and climb up into her skirt. You moan with lust as you see it. The outline of her pussy-lips through her panties. You lean up against her panties, and rest comfortably between the lips. The musky scent is overwhelming. <br>\r\nThen the conversation going on catches you attention. The two girls are talking about you. Jade says she just wishes you would make your move a little faster. She was horny and didn't think want to be in a relationship that didn't have any fun after that long. </span></div></div>",
            "created":1138510800,
            "id":298874,
            "title":"Jaded Jade"
        },
        "121221":{
            "choices":[
                "You live within her womb.",
                "You slip out with the gush of orgasm."
            ],
            "content":"<div class=\"\"><div> <span>You climb into her huge lips kissing, licking and rubbing as you go.  She is soon panting and excuses herself to go to the bathroom.  Your girlfriend barely makes it and collapses inside the stall frantically fingering herself in the process shoving you deep inside.</span></div></div>",
            "created":1159419600,
            "id":349283,
            "title":"Giving her what she wants."
        },
        "122":{
            "choices":[
                "I finally can eat you",
                "How did you get so small?",
                "Now your the perfect size for a toy"
            ],
            "content":"<div class=\"\"><div> <span>Jade had pink short hair and green eyes. She is currently wearing a blue dress and yellow shoes. You saw the table she was sitting at and climbed up. In front of her, she had a hamburger with ketchup, mustard and pickles. She also had some fries and a small glass of lemonade. You yell to get her attention. She looks at you with a surprised look.<br>\r\n\"Is it really you?\" You nod your head. She brings you closer and hugs you lightly. She the pulls you up to her face and says</span></div></div>",
            "created":1464411600,
            "id":2155396,
            "title":"Dining Hall"
        },
        "1221":{
            "author_id":"donnieb",
            "author_name":"Donnie B",
            "choices":[
                "You fall out",
                "She takes you out and licks you off",
                "She shares her burger with a friend"
            ],
            "content":"<div class=\"\"><div> <span>Jade chuckles and slyly smiles, like a teenage girl indulging in a guilty pleasure. You look confused and scared. Your eyes staring at her with blank expressions. Was the girl you had made out with countless times, exploring her mouth your tongue, really considering eating you? \"J-Jade... I-I don't understand...\" you try and speak, but your mouth goes dry. Clearing your throat, you try again, but before you can say anything she just laughs. \"Oh come on silly, you and I both know how good you are... *she bites her lip looking over your muscle-toned form*... and how could I resist such a deviously delicious addition?~\" she says in a curious manner. \"Addition? What do you mean?\" you ask frightened, her eyes twinkling with a hint of excitement and crazy. Jade simply smiles again, showing her wide mouth as her lips part a little, her pink tongue poking out with saliva beginning to drip down her lip. \"Bye now! I can finally eat you, hehe,\" she giggles as she plops you down into the burger. Jade laughs as she watches you squirm about, trying to regain your footing, but falling countlessly into the condiments coating yourself. Then just as quick as she had picked you up to hug you, you find yourself hugged now by the top bun as Jade squishes it down to make sure you're nice and cozy inside the warm, juicy burger. Jade slurps the saliva off of her lips eagerly eyeing her updated meal. Carefully she picks you up... \"Is this it?\", you think, \"All I am now is food to her?, will she really go through with it?\" Questions race across your mind, however, based on her quick decisions earlier leading up to now, you can only admit what you think: the truth. Jade begins to open her mouth, squeezing the burger. Strands of saliva glint from the light in the room, making her mouth seem bigger and more terrifying. Her eyes are wide and pinched with joy, and her white porcelain like teeth tower before you. You stare aimlessly into Jade's wet cave while her tongue wiggles playfully. Waiting, globs of ketchup and mustard fall onto her plate, as you feel the weight pulling you. In the corner of your eye you see Jade's friend, who also happens to be your best friend from grade school. Could she help you?... You remain, paralyzed with fear, dying for the next moment to end it all...</span></div></div>",
            "created":1563328680,
            "id":2687907,
            "title":"I finally can eat you"
        },
        "12213":{
            "author_id":"donnieb",
            "author_name":"Donnie B",
            "choices":[
                "Digestion and full tour?"
            ],
            "content":"<div class=\"\"><div> <span>\"Hi Jade, hehe\" the all too familiar giggle resonates inside my ears. Luckily for me, however, my giantess girlfriend relinquishes her bite; saliva strands pulling off of the bun and making a clear crisp line as the light from the Dining Hall floods back in to greet my survival... For now that is. Bright green shimmering eyes now stare ahead, before turning to recognize the voice, \"Sarah!\", Jade exclaims, dropping her meal and giving Sarah a small kiss on the cheek. Sarah, a more conservative light brunette with natural gold streaks of straw colored hair interlaced, and bright silvery-blue eyes comes into view. I look and see my old friend looks absolutely flushed Jade's sudden greeting, but nevertheless smiles her wide toothy grin.<br>\r\n<br>\r\nOne of the great things about Sarah is that she never seemed to change. Sure she was more matured, a bigger bust and lovely curved body, covered by the tight black cut-off top and short-shorts she is wearing, are evidence of that growth. But she still had the same all-encompassing smile, and as wide as can be... As I recall, Sarah was the only girl in 6th grade that could outbeat anyone in the \"chubby-bunny\" game and fit her fist in her mouth! I, of course, had a huge crush on Sarah earlier on, and told Jade when we became an item, but all of us remained friends despite this fact. The large, lightly pink and parted mouth that Sarah has only seemed deeper and more out-of-depth as I am now shrunk. A wide strong tongue lept out as Sarah again smiled, laughing, and sat down next to Jade.<br>\r\n<br>\r\n\"How's it going?... I heard your hot boyfriend would be around, shame I can't seem to find him.\" Jade mulled over what was said quickly, then after brushing aside her pink hair and glancing down at her burger replied, \"Yeah, too bad. We could have tag teamed him to make him blush. I'm sure he enjoys both of our company thoroughly.\" Sarah blushes more and simply replies, \"I think he'd be more keen of you taking bites out of him than I. Besides, I couldn't do that to him, it wouldn't seem right.\" Both girls turn to face eachother and laugh wholeheartedly, \"Ha, you're right!\" answers Jade. After a few more small seconds Sarah speaks up with a hungry moan, having smelt the burger that Jade seemed to neglect upon her arrival, \"Oh god that burger smells sooooo goood.\" In a moment, Jade lit up with an idea, \"You think so? Heh. Didn't get any lunch today?\" Sarah, \"I ate what I had, but you know how girls are, we LOVE food, hehe. Ugh, I can practically taste it, those sweet one inch pickles too!\"... Inside the large sandwich, the words being spoken outside awake a new fear as I squirm around, slipping further toward the middle. I know Jade was kind with friends amd had given away her lunch multiple times to those who needed/wanted it. Then, the words I was dreading came to pass, but not nearly how I imagined... \"You want to share the juicy giant with me? I couldn't possibly eat the whole thing alone~\"<br>\r\n<br>\r\nHesitant at first, Sarah stuttered, \"Are you sure?\" \"Of course!\", chuckled my girlfriend in light manner with a devious undertone...<br>\r\n<br>\r\nAnd yet again, what I thought was going to happen was disrupted as Sarah now took hold, gripping firmly, pushing me into the cheese and condiments with more hunger fueled passion than Jade. I found it harder to move, let alone breath, while I could feel myself approaching the new maw. Sarah didn't waste time, but moaned as her front incisors cut into the sandwich, tearing off a wide bite and largely opening my point of reference to now see outside. My eyes tumbled left to right with frightened fleeting focal points: Sarah and her happy open chewing maw, and my smiling girlfriend. \"Mmm~ this is so amazing. You really are the best Jade\" Next, I watched anxious, Jade gripping my prison from Sarah's greasy hands and sizing me up, \"I know, and now that I get to bite, it'll make for a hot scene. I can only imagine how you know who would take it, hehe\" \"Your boyfriend?!\" asked Sarah emphatically, finishing with a sly, sexy smile and returned kiss on the cheek, \"I'm sure he would be enthralled at the thought, maybe even a little jealous to see us together like this...\"<br>\r\n<br>\r\nShe couldn't be more wrong! I thought angrily, staring up now at my girlfriend who is carelessly biting down on the sides of Sarah's first plunge. In watching her do so, I noticed Jade wink at me, her sharp teeth parting to reveal her long wet and coated tongue, covered in food. My body turns white and I shudder. Jade in all manner of wanting to make the ordeal worse, pushing me in with her tongue and letting her saliva drip down on me, and consequently on Sarah's next bite. She went as far as to wink at Sarah in succession. Even hungry as she is, I could not see Sarah wanting to eat the now defiled piece I inhabit, but notheless I flail my peeking arms in an attempt to prevent it. Oblivious to my attempt or my presence in general, Sarah, locking eyes with Jade, lowers her maw tongue first, blanketing me with the warm and soaked pink smelly muscle, before pulling back in with the burger and inserting me deep toward the back of her throat. It's at this point I feel a sense of disgust toward Sarah's grade school fame, but it's too late.<br>\r\n<br>\r\nWithin the dark and slippery confines of Sarah's mouth, I can feel her jaw expand and her large smile form as she bites down deliberately. Chewing for only a few seconds, my body is tossed around and coated completely in mush, ungrateful to Sarah as she likes to chew with an open mouth, illuminating her boulder-like teeth right before I am doomed to be crushed and then saved by her working tongue. Unscathed except for a disgraced personal feeling of violation, mistrust and humiliation, Sarah reels back the pink monster with the chewed food (containing me) piled high and gulps, sending me sliding down her gaping throat.. <br>\r\n<br>\r\nThe process that seemed to take a millenia to finish, was simply moments for the large girls who jubiantly engrossed themselves in eating and finishing the burger, raining food down on my body as I sat atop the digesting juices. Slowly, I stay awaiting my fate as nothing more than food and a shared meal between friends, both for which I care deeply.</span></div></div>",
            "created":1582674000,
            "id":2792879,
            "title":"A Meal Between Friends!"
        },
        "13":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Mrs Hands (Drama)",
                "Mrs Newsome (Maths)",
                "Mrs Pitcher (French)",
                "Miss Schouler (Science)",
                "Mrs Osbourne (History)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which teacher?</span></div></span></div>",
            "created":1134709200,
            "id":290218,
            "title":"Which teacher?"
        },
        "131":{
            "choices":[
                "He climbs up Mrs. Hands chair.",
                "He tries to climb up onto Mrs. Hands desk."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sneaking around the corner, I see Mrs. Hands. Her black skirt flows just right above her knees. I don't want the many girls to find me. So I'll hide where noone will ever find me.</span></div></span></div>",
            "created":1163394000,
            "id":358828,
            "title":"A dark place to hide."
        },
        "1312":{
            "choices":[
                "The front bit",
                "The back bit"
            ],
            "content":"<div class=\"\"><div> <span>As you attempt to climb up the cold metal chair leg to get a leg up onto the desk, you're suddenly grabbed up by a massive hand the size of a building. After being swooped up into the air, you look up to see Mrs. Hand's enormous, but pretty face. She's a brunette, with long, flowing locks of curly hair and matching hazel eyes. <br>\r\n<br>\r\n\"My, what do we have here?\" her voice booms, her plump red lips being the subject of your fixation. \"Is that.... oh my! How did you end up like this?\".<br>\r\n<br>\r\n\"No idea\" you honestly reply, the teacher's jiggling, balloon-like funbags being a slight distraction.<br>\r\n<br>\r\nMrs. Hand's suddenly looks mischievous. \"Well, since you're here...\" She lowers you onto the desk, and promptly locks the classroom door. You wonder what on earth she is doing. \"...Let's have some fun\" she finishes.<br>\r\n<br>\r\nWith that, she pulls down her black skirt to reveal... a thong?! No wonder drama was mysteriously popular among the lads. Without warning, she scoops you up again and lowers you into.....</span></div></div>",
            "created":1259470800,
            "id":799027,
            "title":"He tries to climb up onto Mrs. Hands desk."
        },
        "13121":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "a jungle of hair",
                "soft waxed flesh"
            ],
            "content":"<div class=\"\"><div> <span>Ms Hands puts you in the front part, you can smell something funny as you are slipped into her panties<br>\r\n<br>\r\n\"Oh yes, I forgot to tell you i suffer a bit of incontinence, I hope you are OK with that\" she teases as you notice the yellow spot there.<br>\r\n<br>\r\nWhat you are Now being drowned into is...</span></div></div>",
            "created":1398142800,
            "id":1784893,
            "title":"The front bit"
        },
        "13122":{
            "choices":[
                "Walk up the passage"
            ],
            "content":"<div class=\"\"><div> <span>She whips off the thong and proceeds to lay on her front, her massive mammaries providing a cushion for her from the floor.<br>\r\n<br>\r\n\"In you go...\" she whispers, as she rests you on her left bum cheek. A long finger pushes you down into her asshole, and keeps on going until you're right in. Her moans turn you on, and you're very keen to do some exploration.</span></div></div>",
            "created":1259470800,
            "id":799029,
            "title":"The back bit"
        },
        "133":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "she picks her shoe and notices you",
                "she fails catching her shoe again and her huge feet squishes you",
                "she picks her shoe and you get in in the process"
            ],
            "content":"<div class=\"\"><div> <span>Ms Pitcher was a stunning buxom french woman who had a kinky habit of shoeplaying in class, she also used to be a winemaker so her feet were both wide and long, she was dingling her heels as usual when you find her, also her sexy stench was overwhelming for you at this state.<br>\r\n<br>\r\nSuddenly, her overwhelming shoe felt down and you have to jump aside to avoid being crushed by the incoming trasatlantic.</span></div></div>",
            "created":1398142800,
            "id":1784888,
            "title":"Mrs Pitcher (French)"
        },
        "1331":{
            "author_id":"bobbyjones13",
            "author_name":"BobbyJones13",
            "choices":[
                "Crush you with her shoe or barefoot",
                "Put under her ass or in her panties"
            ],
            "content":"<div class=\"\"><div> <span>You see her pick up her shoe and look directly at you. She was wearing a red pair of high heels, that she wore alot, therefor they had a very ripe stench. She says, \"here's your new home.\" You wondered what does she mean, until she drops you in her shoe.<br>\r\n<br>\r\nThe stench is bad, but it turns you on. Than she puts her shoes on with you inside them. You get pushed in between her big toe and the second toe.<br>\r\n<br>\r\n30 mins later<br>\r\n<br>\r\nYou are now a little impliminted into her insole. You tried to hold off the humongous erection, but you could bare it no longer. You pushed yourself into her toe crease and started to jerk off. <br>\r\n<br>\r\n<br>\r\nShe notices that you busted in her shoe and started to walk (she had been sitting down the whole time with her foot floated in the air). You feel a huge pressure on your head. Your head is underneath her toes. The rest of your body is trapped under the arch of her foot. Instinctively you begin to lick the damp toe.<br>\r\n<br>\r\nShe takes her shoe off and decides to..</span></div></div>",
            "created":1505692800,
            "id":2387380,
            "title":"she picks her shoe and notices you"
        },
        "13311":{
            "author_id":"uglybull",
            "author_name":"Comrade Banana",
            "content":"<div class=\"\"><div> <span>“You’re a weird little pervert,” she says. She dumps you out of her shoe and onto the floor, and you land on your back. Before you can get up, she brings her massive bare foot right over you, not touching you, but making it impossible for you to stand up. You instinctively reach out to try to push her foot up and away, but it’s not going anywhere.<br>\r\n<br>\r\n“How cute, you think you stand a chance against me?” She says as she feels your pathetic attempt to push her foot. “Since you love my foot so much, I’ll slowly splatter you on it.”<br>\r\n<br>\r\nWhile her foot excites you, you don’t want to die. You push with all your might, but she slowly lowers her bare foot, pushing your arms back. She keeps slowly lowering it until you can feel the ball of her foot lightly pressing on your chest. She moves her foot across you, the ball of her foot caressing your body and face. Feeling her sole was amazing, and you let out a groan... but your paradise didn’t last. <br>\r\n<br>\r\nShe repositioned the ball of her foot on your chest and began slowly pressing. You feel a great amount of pressure, and soon becomes painful. You let out a scream as you feel your leg bones shatter into dust. Finally, you feel your ribs snap one by one as you lose consciousness. You die a flattened bloody stain on the ball of her foot.</span></div></div>",
            "created":1583658300,
            "id":2798162,
            "title":"Crush you with her shoe or barefoot"
        },
        "13312":{
            "author_id":"alextheking999",
            "author_name":"Alextheking",
            "choices":[
                "under her ass",
                "in her panties"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where does she put him ?</span></div></span></div>",
            "created":1530609960,
            "id":2514392,
            "title":"Put under her ass or in her panties"
        },
        "133122":{
            "author_id":"godofwrite21",
            "author_name":"Imagery ",
            "choices":[
                "Slipped though her thighs out of her panties",
                "Get pushed into her vagina"
            ],
            "content":"<div class=\"\"><div> <span>As miss pitcher picked me up, she pulled her panty strapped away from her body, and dropped me down into it, putting me face to face her vagina, amazingly it was well kept and clean, and the lubes were so soft and fluffy it was as if I was touching a cloud. Then the moment was ruined as she then started to feel her way around her panties rubbing me against her vagina. The moisture covered my body making me slippery and slick, it gave me the chance to either...</span></div></div>",
            "created":1571351820,
            "id":2734555,
            "title":"in her panties"
        },
        "1332":{
            "author_id":"demon12345",
            "author_name":"Alexthelover",
            "choices":[
                "live ",
                "die"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do you live or do you die </span></div></span></div>",
            "created":1500670380,
            "id":2357261,
            "title":"she fails catching her shoe again and her huge ..."
        },
        "134":{
            "choices":[
                "In Her Cleavage",
                "In Her Panties",
                "In Her Navel"
            ],
            "content":"<div class=\"\"><div> <span>Before you can even think of what teacher to go too, the entire hallway begins to shake and you see a shadow over you and a rather large shadow that had to be at least 65 times bigger than you at your current state and then a large foot the size of a bus in a black high-heeled shoe appears in front of you. You look up and see that one of the teachers had indeed come forward. This teacher was Ms. Pepper Schouler, the science teacher. At 27, she was the youngest teacher in the school. However, she was also the biggest. Not only was the red-haired and freckle-faced young woman very tall, she was morbidly obese. You'd say she had to weigh at least 500lbs given that her purple tank-top, her white jacket and her large white skirt looked panted on her fat body. She had large D-cup breasts and a big belly but the largest part of her was her enormous butt that looked big enough to crack open a coconut.<br>\r\n<br>\r\nYou were in luck. Ms. Schouler was the science teacher. She was the perfect teacher for you to run into at your current size. Maybe by some miracle the whale-sized science teacher who was now even huger than usual compared to you could find some way to turn you back to normal size. She might even know what caused you to shrink in the first place. You needed some way to get the obese redhead goddess to notice you. Hopefully <i>without getting stepped on</i>! You scream and jump out of the way as Ms. Schouler continues to walk and her movements threaten to squish you like a pancake. You run like heck as her high heels keep coming down and then you see her left foot crash down to your side. Right before you can get squished by her right foot, you jump and grab onto her nylon stockings as you start to climb up. Up ahead you see a pair of bright blue panties that were practically tattooed on her large body. However, as you keep climbing Ms. Schouler, you slip slightly and yell.\" You're forced to grab hold of the teacher's obese thigh.<br>\r\n<br>\r\nMs. Schouler grunts because she feels this. \"What was that?\" she asks. \"A mosquito? No, mosquitos usually only bite me in the butt.\" Ms. Schouler's chubby hand reaches down and before you can react, she plucks you as you yell in her grip and struggle. Before long you are face to face with a green eye that looked as big as an elephant to you, if not bigger.\" The eye widens before Ms. Schouler holds you in front of her fat double-chinned face. However, instead of being shocked, she smiles brightly in amazement. \"Incredible,\" she says. \"It worked.\" \"What?!\" you think to yourself. \"Still,\" says Ms. Schouler. \"He isn't as small as I would've preferred but at least it's something. Oh, I better put you somewhere before someone sees you. I'll take you out after the school day. But where? Got it!\"<br>\r\n<br>\r\nWithout warning, Ms. Schouler shoves you....</span></div></div>",
            "created":1444107600,
            "id":2044536,
            "title":"Big Science"
        },
        "1341":{
            "author_id":"althomas",
            "author_name":"Allove",
            "choices":[
                "Ignore him and keep him in her bra",
                "Put him under her fat butt"
            ],
            "content":"<div class=\"\"><div> <span>Mrs. Schouler unzipped her jacket alittle looking around to make sure no one was looking. She grabbed my hand dangling me over her huge breasts. \"Hope you live,\" she says as she drops me. I hit hard indenting her skin, but coming back up in the air to bounce on her left boob again. Mrs. Schouler incased me in darkness by pulling up her zipper. She continued walking like nothing happened. <br>\r\n<br>\r\nAs Mrs. Schouler walked her boobs shook badly. Even with a bra all that fat shook bouncing me around. The movement pulled me into her cleavage with no way to stop myself. I prepared for a drop, but instead just got caught. Her boobs didnt stop though. As she continued her boobs seperated for a moment to then slam back into me. When they were seperate i slid further and further down to eventually land under her right boob. Her tight, but sagging bra held me onto her underboob. Her sweat that acumulated covered my face, and as i stayed there new sweat continued to trickle down. All through this her boobs still shook till eventually sat at her teachers desk.</span></div></div>",
            "created":1515740820,
            "id":2439727,
            "title":"In Her Cleavage"
        },
        "135":{
            "choices":[
                "She eats you",
                "Keeps you",
                "Does something else."
            ],
            "content":"<div class=\"\"><div> <span>Mrs. Osbourne was the first person to come to mind. She was in her 40's with dirty blonde, and a few freckles. You were right next to her room and your were just like, what the hay? You crawl under the door and you see her eating lunch at her desk. You approach her desk as you watch her. She was like a goddess compared to you. You climbed onto the desk while she was biting into her PBJ sandwich. She put it down and released a small burp. She then spotted you.<br>\r\n<br>\r\n\"Oh hey John,\" Said Ms. Osbourne<br>\r\n<br>\r\n\"Uhh, hi Mrs Osbourne.\" You say in return.<br>\r\n<br>\r\n\"Thanks for dropping by at my lunch hour.\" Said Mrs. Osborune </span></div></div>",
            "created":1277442000,
            "id":906498,
            "title":"Mrs Osbourne (History)"
        },
        "1351":{
            "choices":[
                "Chews You",
                "Swallows You Whole"
            ],
            "content":"<div class=\"\"><div> <span>Mrs Osbourne picks you with two fingers by the back of your shirt and dangles you over her mouth.<br>\r\n\"Mrs Osbourne please i came to you for help!\" You say.<br>\r\n\"Well thats fortunate for me then isnt it because im still hungry!\" Mrs Osbourne replies.<br>\r\nShe slowly lowers you into her mouth and closes her jaws.<br>\r\nShe....</span></div></div>",
            "created":1282539600,
            "id":941936,
            "title":"She eats you"
        },
        "13512":{
            "author_id":"skees",
            "author_name":"ItsMe",
            "content":"<div class=\"\"><div> <span>          She drops you in her mouth and begins to slosh you around. You licked you all over with a nice \"mmmmmmm\", before lifting her tongue. You slid on your gut, head first, down the tongue as the teacher swallowed you. The trip down the throat ended with a soft thud. You were on chewed up remains of her sandwich, already being digested. <br>\r\n          You splash your hands in the direction of the stomach walls and pound. Mrs. Osbourne only replied in a little burp, which reminded you how much air you don't have. The sandwich started to disappear from under you, and at your size, you won't last long against the acids. So this is how it ends. In your history teachers belly.</span></div></div>",
            "created":1399266000,
            "id":1792264,
            "title":"Swallows You Whole"
        },
        "1353":{
            "author_id":"kamikage",
            "author_name":"kamikage",
            "choices":[
                "Hell Yeah!",
                "No Thanks."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She has good to the bathroom and wishes for you to entertain her by being in toilet as she poop and pees. She may even invite female students and teachers to join her so you can entertain them as well.</span></div></span></div>",
            "created":1282539600,
            "id":941946,
            "title":"The beginning of your life as a Toilet Slave/Toy?!"
        },
        "13531":{
            "choices":[
                "You stay with Osbourne",
                "Someone else comes"
            ],
            "content":"<div class=\"\"><div> <span>Ms. Osbourne soon took you to the empty ladies room. She walked into the stall, closing the door and locking it. She pulled down her pants and underwear as she turned around and landed on the toilet. She placed you in between her legs as she sat up. You didn't know what do do as you saw her pee shoot out. She was looking at you waiting for you to do something. You then started doing the robot as she started to take a dump. She giggled at your little attempt with a smile. She then got up and bent over for toilet paper, with her butt sticking directly at you. She then made a massive fart that made you fall backward, nearly falling into the toilet. She wiped her butt and threw it in the toilet. She picked you up and flushed the toilet. Then... </span></div></div>",
            "created":1282798800,
            "id":944691,
            "title":"Hell Yeah!"
        },
        "14":{
            "author_name":"judyx",
            "choices":[
                "she steps on you stocking footed",
                "she barely misses you",
                "you somehow survive in her sock fibers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>being bug size now hasnt occured to you of your new dangers as you enter the girlslocker room for help. thats when a giant blonde stocking footed girl aproaches you thinking you are a nasty bug.</span></div></span></div>",
            "created":1136178000,
            "id":293389,
            "title":"discovered"
        },
        "141":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "content":"<div class=\"\"><div> <span>You can't believe how fast she is. Within not even two seconds she covered the space you would have needed a day for. An instant later her houseblocksized stockinged foot came down about 165ft in front of you. You felt the tremble as it impacted. You couldn't believe how big she was. You couldn't even see her face because an instant later a huge shadow fell over you. You could see some dirt which she had carried around on her way to you. An instant later You where lying on the floor with intensive pain everywhere. You couldn't see properly but saw enough to recognize her foot still hanging over you. You wanted to scream but you could just let out a painful moan. You where glad you couldn't see your body. \"you are a real sissybug, you know that\" you didn't know and you barely heard her. \"Most of you guys at least squirm after the first tap\" <br>\r\n<br>\r\nShe just tapped on you. Then you where again hit by a Jumbojet. Your body was completly bruised, but you where still alive. She did it again.  \"Are you dead already?\" then you heard a thunder and realised it was the door. \"Kathie are you again torturing bugs\" No response. You saw another black shadow loom over you and then slowly come closer. It was a shoesole. \"Kill them instantly\" That was the last thing you heard.</span></div></div>",
            "created":1153630800,
            "id":333859,
            "title":"dead"
        },
        "142":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Leave the Locker Room ",
                "Try and Contact a Coach ",
                "Sneak Into a Locker"
            ],
            "content":"<div class=\"\"><div> <span>The giant stocking clad foot comes down upon you as you quickly parry to the left and dodge the foot. The blonde girl thinks she got you and squished her foot into the floor as you run away from the potential danger.<br>\r\n<br>\r\n Looking back over your shoulder you run towards the benches in the center of the room. You look off to see three options. You can leave the locker roo, Go to the coaches office, or Climb into a locker. The only question is, what will you do?</span></div></div>",
            "created":1448168400,
            "id":2065670,
            "title":"she barely misses you"
        },
        "1422":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "Her pants",
                "Her desk",
                "Her chair"
            ],
            "content":"<div class=\"\"><div> <span>Coach Wiggins was very muscular, ginger woman in her thirties. With bountiful breasts and a well toned, but juicy ass, most of the males students were in love with her, but with her strict attitude, it makes them wary of her. She was in charge of gym classes and the majority of the school's sport teams. However, she may be your only hope. Running over to the door leading to her office, you slide under it and look around. You see her at her desk, going over various papers and lifting a dumbbell at the same time. She was currently wearing her hair in a ponytail; a white midriff tee, holding her big breast and showing off her six pack abs; black yoga pants, that was hugging her curve nicely; and some white running shoes. After a careful inspection from your view, you decide, for you to grab her attention, you'll have to climb...</span></div></div>",
            "created":1481864400,
            "id":2250848,
            "title":"Coach Wiggins"
        },
        "14221":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Ear",
                "Vagina"
            ],
            "content":"<div class=\"\"><div> <span>You loom up at the titanic woman, slowly tapping her sneaker against the floor, and you decide to start your journey up the giantess. You walk up to the sneaker and hop up when it hits the ground, pulling yourself up the shoe. You go up the tongue, and latch yourself onto her tight yoga pants. You start pulling your body up the giant leg, holding on for dear life. You crawled for what seemed to be miles of black fabric as you looked up, seeing the knee only a few feet away.<br>\r\n<br>\r\n You pull yourself onto the knee, hiking further up the thigh of the giant. You look at her bulging biceps flex as she lifts the dumbbell in her hand to her shoulder and back down. You decide that to get her attention you need to make contact with her</span></div></div>",
            "created":1491454800,
            "id":2300909,
            "title":"Trek up the Yoga Pants"
        },
        "14223":{
            "author_id":"jordanw69",
            "author_name":"Jwheels",
            "choices":[
                "That Coach Wiggins has noticed you on her chair",
                "Coach Wiggins hasn't noticed you yet and is removing her pants and panites"
            ],
            "content":"<div class=\"\"><div> <span>You decided that the best way to contact Coach Wiggins was by climibing her chair. You make the trek over twoards her desk jogging across the floor within 20 minutes you reach her desk you slide under her desk and see her monolithic feet you decide to rest for a little bit after jogging that long of a distance across the room. As your taking your brake Coach Wiggins stands up and leaves the room to teach another class, you think to yourself \"just great now I gotta wait longer for help oh well though it gives me more places to climb on to her chair now that she'll be out of the room for at least an hour\" you begin your way over to the chair and start climbing it after about 50 minutes of strenous climbing you finally reach the top of the cushion, you walk along the chair heading towards the middle after about 10 more minutes of walking you finally reach the middle and turn around to admire your progress so far as your looking out you have a clear view of the office now. Your eyes dart over towards the door as you see the handle start to turn the door opens up and Coach Wiggins steps in closes the door and locks it muttering to her self finally my free period with that she starts to make her way over to the chair when she reaches the chair she beins to sit down and you start panicking and start running towards the back of the chair you look over your shoulder one last time to see how far away the huge ass is from making contact with the chair only to notice that its descent has stopped you look up to see why and notice....</span></div></div>",
            "created":1530088740,
            "id":2512466,
            "title":"Her chair"
        },
        "15":{
            "author_id":"doddy",
            "author_name":"Doddy",
            "choices":[
                "Angela",
                "Rachel",
                "Leah",
                "Charlotte",
                "Nicole"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You make a run for it. As you get so close to the door a huge foot comes down in front of you. \"Well look who it is!\". You recognize that voice. It is the bully...</span></div></span></div>",
            "created":1134709200,
            "id":290221,
            "title":"You can't escape"
        },
        "151":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "home",
                "to class",
                "unknown"
            ],
            "content":"<div class=\"\"><div> <span>          You look up and see Angela, a girl who bullied you the whole school year. You didn't know much about her, decides that she hates you. Angela bent down and picked you up and said \"oh you'll make a great pet for me\". She then put you in her cleavage and upon squeezing you between her giant breasts she also tightens her bra, creating no way of escape. After that she heads..... </span></div></div>",
            "created":1362805200,
            "id":1547055,
            "title":"Your New Mistress"
        },
        "153":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "choices":[
                "Sneaks",
                "Heels"
            ],
            "content":"<div class=\"\"><div> <span>Leah was a tall girl and three years older than you which made her 18. In fact she was a lot taller than you as you where normal hight. With high heels on, she was about 6.6ft. That was the time when she was dangerous. It was almost as if the shoes had a magical effect on her. The respect she received because she was bigger than everyone else made her act like a princess. <br>\r\n<br>\r\nShe was no bombshell, but she was a really cute girl with very long legs and long black hair which made her blue eyes look like crystals. Almost every guy who who looked in her piercing blue eyes almost instantly wanted to fulfill her every wish. Her clothes where hot and sometimes didn't left much space for fantasies.<br>\r\n<br>\r\n<br>\r\nThe few man who didn't adored her and most of the girls where just shit for her and that was how she treated them. She showed everyone that she was superior as often as there are chances and a lot of girls and guys had to receive medical attention after she was finished with them. <br>\r\n<br>\r\nIn flat shoes she was almost a different person. She wasn't that aggressive anymore and was much more chilled. <br>\r\n<br>\r\nShe was wearing</span></div></div>",
            "created":1153630800,
            "id":333853,
            "title":"Leah"
        },
        "1531":{
            "author_id":"cm8000",
            "author_name":"masterchief",
            "choices":[
                "Try to climb onto Leah's foot",
                "Try screaming and getting her attention"
            ],
            "content":"<div class=\"\"><div> <span>You were standing right in front of Leah's cruise ship sized sneaker. You recognize these shoes all too well as Leah wears them to school almost everyday when shes dressing casual. They are the baby blue converse brand sneakers. Leah does have pretty big feet and wears a size 13 or 14. Alot of people in your school make fun of her footwear and call them the \"Clown Shoes\" Tho they usually end up with bloody noses or broken arms. Even the 6'2ft 220lb High school jock Michael Morrison ended up with a broken nose after Leah socked him right in the face for making fun of her feet! Leah is definatly one mean girl without a doubt, And she might be the only one who can help you now! Quickly coming up with a plan you...</span></div></div>",
            "created":1153630800,
            "id":333921,
            "title":"Leah's giant kicks"
        },
        "15311":{
            "choices":[
                "At home",
                "In the girls locker room"
            ],
            "content":"<div class=\"\"><div> <span>You noticed leah's shoelace dangling low enough for you to grab ahold of. You then jumped up and pulled yourself up the dirty white lace. You can see up Leah's pant leg and notice she is wearing blue,white and black striped socks. Suddenly, Leah begins to walk. You hang on tight and bury your face into the shoelace, too terrified to look around at these deadly speeds!<br>\r\n<br>\r\nAfter a few minutes the ride stops. You slowly look around and see that Leah has just arrived,</span></div></div>",
            "created":1220677200,
            "id":579048,
            "title":"Riding her shoe"
        },
        "153112":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "she spreads her legs and begs you to fuck her",
                "She gives you the rear and rides you for anal"
            ],
            "content":"<div class=\"\"><div> <span>Leah went to the girls locker room and removed everycloth of her except her panties, her body featured muscles but her shape was still delicate and feminine, her log legs feathured thick calves and log sized thights, her round butt was a lump sphere under an hourglass back with wide shoulders whose supported slim but sculpted arms ending in pretty small veiny hands (still, those hands were pretty piercing).<br>\r\n<br>\r\nThen one girl rammed toward her and a battle started, Leah grappled the daredevil girl and put her in a bearhug making her cry as her small body was squirming into Leah's huge tits, then Leah used her signature atomic drop making the cunt of her rival to swollen and finally she used her sneakers to torture her by forcing her victim to smell her worn out inshoe, the poor girl cum as she was tortured and then she was ripped of every cloth she was wearing (except her panties)  and putted into a wedgie right in a high pole position...<br>\r\n<br>\r\nThen she noticed you...<br>\r\n<br>\r\n\"what?\"<br>\r\n<br>\r\nyou were mutted at her, but she kept her perking curiosity on your little body \"so... small... did i told you how much i fucking love small men?\" she said as she was tickling your scrotum \"please make me yours... oh and don't dare to say no, if you do that i will crush you\" She said and slipped her panties away</span></div></div>",
            "created":1398142800,
            "id":1784973,
            "title":"In the girls locker room"
        },
        "155":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "Nicole puts you on her nose",
                "Nicole takes off her diapers and pisses on you",
                "Nicole steps on you with her barefeet"
            ],
            "content":"<div class=\"\"><div> <span>Nicole, an 8 year old spoiled brat who is a mixure between a \"princess\" and a slimeball. This contrasts in weird ways: she still wears diapers but uses the toilet in case of a deliver of product number 2, she goes shoeless anywhere, anytime, ANY SEASON so her socks (if she wears any) reveals her arched soles in many dirty ways and she doesn't had a bath in months. She loves mudpies, sticking things in her nose and farting but she also likes flowers (even for breakfast... which is pretty weird), dolls, dresses, and painting her nails (both fingers and toes).<br>\r\n<br>\r\nAt your size, her filthy scent seems increased in an exponential way making you cry as your nostrils are filled with her toejam escense.<br>\r\n<br>\r\n\"is a weird bug down there, wanna play with me?\"<br>\r\n<br>\r\nyou shake your head as you keep holding your nose, that makes her angry and picks you \"nobody says no to me\"</span></div></div>",
            "created":1398142800,
            "id":1784955,
            "title":"Nicole"
        }
    },
    "info":{
        "author_id":"doddy",
        "author_name":"Doddy",
        "brief_description":"You are shrunk at school and girls want a piece of him. Please Add.",
        "created":1134766920,
        "description":"<td align=\"left\" class=\"norm\">There are so many beautiful girls but you can't let them see you like this. They might want you for a snack. Avoid female bullies, normal girls, girlfriends, girl mates and girl teachers.<br>\r\n<br>\r\nNo gay stuff please.<br>\r\n<br>\r\nEnjoy the story.</td>",
        "id":1046621,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1583658300,
        "modified":1583658300,
        "pretty_title":"School GTS's"
    }
}