{
    "chapters":{
        "1":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "The next morning...",
                "Later that evening..."
            ],
            "content":"<div class=\"\"><div> <span>It was Friday night, and your family had just finished a meal of Chinese takeout. Your sister takes out the fortune cookies and throws them onto the table. You pick up the one that belongs to you and unwrap it, and Sara does the same. After she reads off her fortune, you find that both of your are the same!<br>\r\nSara laughs, \"It's like Freaky Friday! Maybe if we read them of at the same time, we'll swap bodies!\"<br>\r\nYou jokingly comply as you both read off the fortune.<br>\r\nNothing happens as expected.<br>\r\nBut...</span></div></div>",
            "created":1327899600,
            "id":1268318,
            "title":"Intro"
        },
        "11":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "Inspect your body further.",
                "Try on some clothes."
            ],
            "content":"<div class=\"\"><div> <span>You slept well last night -better than you usually do, so your eyes open with ease.<br>\r\nTo your surprise, the image you observe focuses to become your sister's room. <i>How did I get in here?? Was I moved during the night? Wouldn't that have woken me up? Why would I have been moved? And where the hell is Sara if I'm right here?</i><br>\r\nThen you notice your hair. It's hanging down in front of your eyes. You thought your hair was pretty long but not like this! You quickly lift your head, which reveals even more hair.<br>\r\n\"What the f...\"<br>\r\nThen you see your feet -your narrow feet. And you're wearing Sara's pink pajama bottoms! Then you notice something underneath your shirt (you don't sleep with a shirt on!). At first, it looks you've put on a bit of weight, but no. You lift your chest to reveal a tight stomach underneath it.<br>\r\n<i>I... I'm Sara? No... How is this possible??</i><br>\r\nYou check the time: 7:00am -way too early for you to be getting up.<br>\r\nThe you see yourself in the mirror across from the bed.<br>\r\n<a rel=\"nofollow\" href=\"http://images.sodahead.com/polls/001334593/girl-29836778897_xlarge.jpeg\" target=\"_blank\">http://images.sodahead.com/polls/0013345...</a><br>\r\n<i>Wow! I am Sara!!</i><br>\r\nYou lightly touch your left breast with your hand, and a funny tingling sensation runs through your spine. You run your fingers over the strap around your shoulder, getting the female hormones going. This is a shock to you at first. You stumble back onto the bed, as the tickling sensation grows stronger through your body. You suddenly feel more ...feminine. Your new higher voice breathes lightly, moving your dirty blonde hair out of your mouth.<br>\r\nYou stand up again, this time moving the strap gently around your skinny shoulder and finally get rid of the top. You've seen your sister topless on several occasions before, but this is a completely different experience.<br>\r\nThen the bra comes off. You stare at your ...boobs.<br>\r\n<i>Will I live the rest of my life as Sara?</i></span></div></div>",
            "created":1327899600,
            "id":1268333,
            "title":"The next morning..."
        },
        "111":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "Your period will start",
                "You need to try out for cheer leading",
                "You have a date with a boy"
            ],
            "content":"<div class=\"\"><div> <span>You notice your now flat crotch in the mirror and realize that you really are a girl now. You wonder how that feels, and you start to put your hands down your panties. But suddenly the door bursts open. You sister, now in your body yells, \"Hey. Keep you hands to yourself\"<br>\r\n<br>\r\nYou blush at being caught, but as you pull you hand up you say, \"Well, technically speaking, I am keeping my hands to myself.\"<br>\r\n<br>\r\nHe gets angry, \"You know what I mean!\"<br>\r\n<br>\r\nYou feel yourself blush, \"Yes, and I am sorry.\" You have to look up to talk to him. \"Now what. I might be curious, but I don't want to be a girl. How did this happen?\"<br>\r\n<br>\r\nHe frowned, \"It has to have been the fortune cookies, and the way we said we wanted it to be true. Maybe we could wish ourselves back!\"<br>\r\n<br>\r\nThe two of you try everything, but nothing happens. You keep trying until you hear your mom say, \"Come on you two! Get ready for school!\"<br>\r\n<br>\r\nYou look at your 'brother', \"Now what? I don't want to go to school as you!\"<br>\r\n<br>\r\nHe growled, \"Well, I don't want to go to school as a gross boy either, but until we figure out how to undo this, we have no choice.\" He walked over to the closet and the dresser and picked out some things, laying them neatly on the bed. \"There, that is what I was going to wear today, so don't embarrass me.\"<br>\r\n<br>\r\nYou look at what is laid out, \"Bra? Panties? A skirt! Are you kidding me?\"<br>\r\n<br>\r\nHe steps close over me, \"Look SARA, this is how I would have dressed, so as long as you are in my body, this is how YOU will dress. Bra's, panties, and skirts are normal for a girl, and you are a GIRL. Got it SARA?\"<br>\r\n<br>\r\nYou feel weak and vulnerable in his presence, \"Okay, okay. Just get out for now.\"<br>\r\n<br>\r\nYou get ready, dressing in what she laid out. As you are dressed and walk around, you find a skirt is actually pretty comfortable. You figure out how to brush you hair out, being glad that Sara kept straight hair, even if it was long.<br>\r\n<br>\r\nWhen you get out, your 'brother' says, \"Oh, by the way. There is something you should know. Today is the day that…\"</span></div></div>",
            "created":1397855640,
            "id":1781890,
            "title":"Inspect your body further."
        },
        "1111":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "Yes. You are going to teach your sister a lesson",
                "No. You decide to listen to your sister",
                "You tell him yes, and if he treats you good, you will be his girlfriend"
            ],
            "content":"<div class=\"\"><div> <span>When you get out, your 'brother' says, \"Oh, by the way. There is something you should know. Today is the day that your period is due to start.” He holds out something wrapped in rose colored plastic and a note. “While you were getting dressed, I wrote you some instructions on what to do and stocked you purse. You should put this pad in your panties now though.”<br>\r\n<br>\r\nYou turn pale, then numbly take the pad and note. Looking at the pad, you say, “This can’t be happening! Do I really HAVE to wear this thing?”<br>\r\n<br>\r\nHe smiles, “No, not as long as you don’t mind blood soaking your panties and running down your legs for the world to see.” He waits for your reaction, then says, “I will wait out here in case you have any questions.”<br>\r\n<br>\r\nYou locked yourself in the bathroom. Placing the pad in your panties was not hard, but pulling it into place felt very strange. You came out blushing, “If you are lying about this, I will kill you.”<br>\r\n<br>\r\nHe chuckled, “Before the morning is out, you will be wishing that I had been lying. But even with you, I would never lie about something like this.”<br>\r\n<br>\r\nWhat she said was true. Later that morning you found yourself getting more and more uncomfortable until you had full-blown cramps! This went on for too long, but later, when you had to use the bathroom again, you were shocked to see that the pad you had been wearing was indeed bloody! After you got over the dizzy feeling from almost fainting, you read the instructions your ‘brother’ had given you more carefully. You followed them closely now!<br>\r\n<br>\r\nIf it had not been for getting to experience your sister’s period, your day did not go that bad. It was kind of fun gossiping with your sister’s friends. There were a couple that were in your class that you thought might be worth dating, and this gave you a way to learn what they liked and what turned them off.<br>\r\n<br>\r\nThe only awkward time was when a boy, Ryan, came up to you, and after an agonizing amount of time, awkwardly said, “Um, Sara. I was wondering if I could take you to the dance on Friday?”<br>\r\n<br>\r\nYou almost said no right away. But realizing that this was Monday, how would Sara feel when she was back in her own body? You shyly said, “I have to think about it Ryan. Can I give you my answer at lunch tomorrow?” He gladly said yes, happy that you were even considering it!<br>\r\n<br>\r\nAfter school, you rushed with your ‘brother’ to the restaurant. All the old woman would say was, “You will stay this way until you both learn to respect the other, unless you both choose to stay where you are.”<br>\r\n<br>\r\nAs you walked back, you look at ‘John’, since you will be calling him that for a while. You think of how you learned two things already. One of course is that you would NEVER make fun of a girl’s period again! Least of all your sister. Two, these breasts are very annoying, and more so when boys seem to talk to them instead of looking at ‘you’.<br>\r\n<br>\r\nOn the way, you tell him about Ryan. He looks at you, “You told him no, right?”<br>\r\n<br>\r\nYou look up at him, “No. I told him I would give him an answer tomorrow. I wasn’t sure if you would like going to the dance with him or not.”<br>\r\n<br>\r\nHe sighed, “Do you know what my friends will say if I date that dork? Tell him no tomorrow!”<br>\r\n<br>\r\nYou get angry, “Why don’t you give the guy a chance? He might be a really nice guy you know!” The two of you get into a big argument about it that lasts until you go to bed!<br>\r\n<br>\r\nThe next day, you learned a little more about makeup. You forgot about Ryan until he came up to you at lunch. What do you tell him?</span></div></div>",
            "created":1424374200,
            "id":1936858,
            "title":"Your period will start"
        },
        "112":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "Leave Sara's room.",
                "Tingling Sensation"
            ],
            "content":"<div class=\"\"><div> <span>You decide it might be a good idea to put on some clothes and get out of Sara's room.<br>\r\n<a rel=\"nofollow\" href=\"http://us.acidcow.com/pics/20100205/sexy_self_shot_mirror_pics_97.jpg\" target=\"_blank\">http://us.acidcow.com/pics/20100205/sexy...</a><br>\r\nYou slip a new pair of panties over your vagina. This gives you a jolt.<br>\r\n<i>I don't know if my brain has adapted to these changes yet...</i><br>\r\nYou let out a short moan before you catch yourself.<br>\r\n<i>It really seems like I'm all girl.</i> Those words don't go together very fluidly in you head. You're your sister after all!<br>\r\nYou look for some good pants, and struggle to squeeze a pair around your new curves. Finally you manage.<br>\r\n<a rel=\"nofollow\" href=\"http://3.bp.blogspot.com/-cSk3nVGlZwE/TuKHnDZWlpI/AAAAAAAAAVs/sY-q6IRLv8A/s1600/AEjeans.jpg\" target=\"_blank\">http://3.bp.blogspot.com/-cSk3nVGlZwE/Tu...</a><br>\r\nThey're so tight around your crotch and provide an even stronger reminder of what you once had there.<br>\r\nYou throw a top over your breasts. It doesn't seem right. You feel a tingling sensation in your crotch.<br>\r\n<a rel=\"nofollow\" href=\"http://collegelifestyles.org/wp-content/uploads/2011/08/cute-top-203x300.jpg\" target=\"_blank\">http://collegelifestyles.org/wp-content/...</a></span></div></div>",
            "created":1327899600,
            "id":1268339,
            "title":"Try on some clothes."
        },
        "1121":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "You hear a knock on the door!",
                "Work on imitation."
            ],
            "content":"<div class=\"\"><div> <span>You peek your head outside the door. Both your parents are away at an event, so you have the entire house to yourself until your sister wakes up in your old body.<br>\r\nYou tiptoe quietly over to your old room, trying not to wake your sister, and open the door slowly. Your chest is squeezed lightly against the doorframe.<br>\r\nYour ...brother is snoring. It shocks you to see yourself, and it ever so slightly distances you from your past. You turn your curvy body around and walk into the bathroom. You stare at yourself in the mirror. <i>There is no evidence that could ever prove that I am not really Sara. As far as everybody as knows, I have always been Sara.</i><br>\r\nYou stare at yourself intently in the eyes. Your eyes.<br>\r\nYou smile with your sister's mouth, and lift your padded bra up, making a sexy face. <i>I could pull this off!</i><br>\r\n<a rel=\"nofollow\" href=\"http://cdn.mommyish.com/files/2011/12/shutterstock_279737.jpg\" target=\"_blank\">http://cdn.mommyish.com/files/2011/12/sh...</a></span></div></div>",
            "created":1328245200,
            "id":1270655,
            "title":"Leave Sara's room."
        },
        "11211":{
            "author_id":"saracen1187",
            "author_name":"Triss Merigold",
            "choices":[
                "More exploring in the bathroom.",
                "Exiting the bathroom."
            ],
            "content":"<div class=\"\"><div> <span>\"Sis...are in there?\" a familiar voice suddenly said at the door, following a knock. Your head jerked to one side and your long hair briefly flew into your face...before falling back down around your shoulders again. <i>\"Sis?\"</i> you thought to yourself, as you recognized the voice as your own. <i>\"Does Sara think she's me or something?\"</i> you mumbled, as your hands worked their way down over your breasts.<br>\r\n<br>\r\n\"Er...yeah, I'm in here!\" you called in out in your little sister's voice.<br>\r\n<br>\r\n\"Well hurry it up, I need a pee!\" your former body called out, before disappearing back into your 'former' room.<br>\r\n<br>\r\n\"This might be easier than I first thought\" you suddenly grinned as your eyes looked down again, admiring the cute, feminine body you now inhabited. You then also looked back into the mirror and ran your slender fingers over your smooth face. The grinning face looking back at you would have told anybody who saw you that you were ecstatic about the body swap with your sister.</span></div></div>",
            "created":1328850000,
            "id":1274079,
            "title":"You hear a knock on the door!"
        },
        "112112":{
            "author_name":"Wixelt",
            "choices":[
                "Keep a Grip on Yourself",
                "Kiss Steven"
            ],
            "content":"<div class=\"\"><div> <span>\"All Right I'm out\" You yell as you leave the bathroom and head back to your...  new room.<br>\r\n<br>\r\n\"Thanks Sis\" Sara in your Body yells as... he, rushes past you. Seeing your own body awake without you in it makes you realise that you may be stuck like this forever.<br>\r\n<br>\r\n\"Oh, and Sara?\"<br>\r\n<br>\r\n\"Yeah?\"<br>\r\n<br>\r\n\"I can see your boyfreind walking up to the door out of my window\"<br>\r\n<br>\r\nYour heart stops. You had completely forgotten that Sara's Boyfreind, Steven was supposed to be taking her to the beach today. You should have rememebered since there was travel bag at the end of your bed when you woke up, and you were looking right at it. Sadly you were concentrating on other things.<br>\r\nYou quickly grab the bag and make your way down stairs. But heres the thing, you didn't choose to do that, Sara's body did it on it's own. Probably a panic reaction to being caught off guard, you suppose, but part of you isn't so sure.<br>\r\n<br>\r\nSteven knocks at the door, you hesitate, maybe you should tell him, but he'd probably just think you'd had a bad night and were trying find an excuse to sleep in (Sara tended to do that a lot with Steven, he didn't mind though).<br>\r\n<br>\r\nAs you hesitate you feel yourself drifting slightly and suddenly realise that your hand was reaching for the door. You consider pulling it back, but your hand was already turning the handle, so it would seem wierd of you to stop half way through and shut the door again.<br>\r\n<br>\r\n\"Hey Sara, ready for a fun day at the beach?\"<br>\r\n<br>\r\n\"You bet\" You can't really say no now, it would seem rude. And you can feel a small part of you which is begging you to go, the small part which told you to go downstairs because you love Steven because he's your boyfreind. The Small part which has been slowly growing since you opened the door and looked into Stevens eyes. \"Lets Go\"<br>\r\n<br>\r\nAs you walk along you and Steven start talking about various things that you have seen (Lucky for you, you and Sara like alot of the same things) such as what's been on TV and movies that you've seen, the things that you've heard Sara and Steven talk about before.<br>\r\n<br>\r\nAs you approach the beach, you turn to look at Steven, who has his arm around you and for a moment you start to think he looks really hot, but you suddenly realise and brush the thought to the back of your mind, where it makes that small part of you grow slightly larger again.<br>\r\n<br>\r\nYou go to a cubicle to get changed. As you put on your sister's bikini, you realise how revealing it is (You've seen it before, but you've never seen your sister wear it), and for a second your mind drifts and you start to think you look sexy and will look perfect next to Steven. You realise what your thinking and brush it away again, but this is a very large thought, and it causes the small part of you to grow massivly, causing a cacade of feminine thoughts to engulf your mind. Do you manage to keep a grip on yourself, or do you rush out of the cubicle and plant a passionate kiss on Steven's Lips.<br>\r\n<br>\r\n</span></div></div>",
            "created":1337835600,
            "id":1344359,
            "title":"Exiting the bathroom."
        },
        "1121121":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "boards ",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You realize what you are thinking and blush it out of you mind.<br>\r\nyou finish changing you get out of the cubical to see Steven holding.....</span></div></span></div>",
            "created":1343624400,
            "id":1393596,
            "title":"Keep a Grip on Yourself"
        },
        "1121122":{
            "choices":[
                "Later that night at Home",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>The feminine thoughts force your lips to pucker and forward intercepting Steven's. Within a millisecond your male self is disgusted with yourself, but your sister's hormones are wanting, aching for more. You laugh it off, trying to change the subject after the kiss, trying to ignore the feelings now present inside yourself and trying to avoid eye contact with Steven. </span></div></div>",
            "created":1344477540,
            "id":1400720,
            "title":"Kiss Steven"
        },
        "11211221":{
            "choices":[
                "your parents",
                "your girlfriend"
            ],
            "content":"<div class=\"\"><div> <span>Later that night, you relax Sara's bed, wearing nothing but her bra and panties, while listening to some music on her eye pod. You fiddle with the strap of your bra. A few hours into it, you hear a car arriving outside. When you look outside you see...</span></div></div>",
            "created":1536608340,
            "id":2545882,
            "title":"Later that night at Home"
        },
        "112112212":{
            "choices":[
                "It is you",
                "Im not gay"
            ],
            "content":"<div class=\"\"><div> <span>Your run down stairs, hoping to get to your girlfriend, Dawn, before Sara did. When you got there, you were too late, you saw Sara and Dawn making out.<br>\r\n<br>\r\n\"STOP!\", John demanded, causing them to break apart.<br>\r\n<br>\r\n\"Wow, whats up Sis.\", Sara said.<br>\r\n<br>\r\n\"Cut the crap Sara and stop kissing my girlfriend.\", John said.<br>\r\n<br>\r\n\"What?\", Dawn said.<br>\r\n<br>\r\n\"It's nothing sweetie, you know how kids can be sometimes.\", Sara said, holding Dawn close to him.<br>\r\n<br>\r\n\"It is something, Sara stole my body.\", John said. Knowing Dawn wouldnt believe him he pulled her away from Sara and planted a kiss on her lips, kissing her the same way he would in his own body.<br>\r\n<br>\r\nWhen you let her go she said</span></div></div>",
            "created":1536907260,
            "id":2547531,
            "title":"your girlfriend"
        },
        "1121122122":{
            "choices":[
                "follow",
                "go to our room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Sorry kid, your cute, but I don't swing that way.\" Dawn said pushing you away, then grabs Sarah's hand and leads her upstairs to your room.<br>\r\n<br>\r\nYou then</span></div></span></div>",
            "created":1536985380,
            "id":2547901,
            "title":"Im not gay"
        },
        "11211221221":{
            "choices":[
                "Touch yourself",
                "throw up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>By the time you got to your room, the door was locked, sitting outside the door, you begin to hear moaning causing you to</span></div></span></div>",
            "created":1537163700,
            "id":2548745,
            "title":"follow"
        },
        "12":{
            "author_id":"saracen1187",
            "author_name":"Triss Merigold",
            "choices":[
                "Continue your 'exploration'.",
                "Phone Rebecca and apologize.",
                "Head downstairs to the kitchen.",
                "Trying on some clothes.",
                "Pretend to be your sister."
            ],
            "content":"<div class=\"\"><div> <span>\"So much for these stupid fortune cookies!\" Sara scoffed, before throwing the empty shell on the table and getting to her feet. \"Catch ya later bro!\" she then laughed, before disappearing upstairs to her bedroom. \"Yeah, I guess it is crap!\" you just muttered, as you swept the empty cookie shells off the table and into the nearby trash can.<br>\r\n<br>\r\nThe next few hours passed without notice as the two of you went about your normal routines, but just as you were opening the fridge door to find something to eat...a sudden dizziness hit you. The world seemed to spin and before you knew it...you were no longer in the kitchen. \"What the...?\" you thought to yourself as you suddenly heard a girl's voice talking into your ear.<br>\r\n<br>\r\n<i>\"Sara...you there? Hello??\"</i> the voice said.<br>\r\n<br>\r\nYou looked around and recognized your sister's bedroom, and you also recognized the voice you were hearing as your sister's best friend Rebecca. As soon as all your senses fully returned you realized you were holding your sister's pink mobile phone to your ear. Looking down...you gasped in shock, you were wearing your sister's clothes, her light blue tank top, her skinny jeans and her favorite flats. What was werird was...they all fit you perfectly, you moved one of hands onto your flat crotch...and instantly noticed your dick was gone.<br>\r\n<br>\r\n<i>\"Sara this isn't funny, what are you doing?\"</i> Rebecca's voice then said on the phone.<br>\r\n<br>\r\n\"I gotta go!\" you just said in reply...before hanging up on Becky.<br>\r\n<br>\r\nYou threw the phone down on the bed and moved both of your hands onto your chest...feeling your perky little boobs. \"Oh god...I'm in Sara's body!\" you whispered in shock, before catching sight of yourself in your sister's full-length mirror.<br>\r\n<br>\r\nNo sooner had you said that...you heard a rather familiar surprised 'yell' coming from the kitchen downstairs.<br>\r\n<br>\r\n\"Oh boy!\" you then sighed, smiling a little as you felt up your cute new body.<br>\r\n</span></div></div>",
            "created":1328936400,
            "id":1274723,
            "title":"Later that evening..."
        },
        "122":{
            "author_id":"3azizzo",
            "author_name":"Abdulaziz",
            "choices":[
                "talk your sister"
            ],
            "content":"<div class=\"\"><div> <span>“I am sorry, Rebecca” You Said<br>\r\n“No Problem, it’s your body, but no do that again around others even me” Rebecca Said<br>\r\n“Thank You” You Said<br>\r\n“You’re welcome, my bestfriend” rebecca said<br>\r\ncall end<br>\r\n<br>\r\n‘her bestfriend’s better than of mine’ you think</span></div></div>",
            "created":1522566720,
            "id":2473136,
            "title":"Phone Rebecca and apologize."
        },
        "124":{
            "author_id":"saracen1187",
            "author_name":"Triss Merigold",
            "choices":[
                "...there was a knock on the door.",
                "...you decided to go downstairs.",
                "...your sister (in your body) barged in."
            ],
            "content":"<div class=\"\"><div> <span>A grin instantly appeared on your pretty new face as you thought of your sister's vast wardrobe of clothes, and you spun around to face the wardrobe itself, a tall, mahogany structure...filled to bursting thanks to your sister's love of shopping with her friends. You rushed over to it and opened the doors...a wonderous sight greeted you. Every one of the dresses, blouses, skirts pairs of jeans/pants in the wardrobe...now belonged to you. And even better, the 13 or so pairs of shoes all jumbled in a pile in the bottom of the wardrobe.<br>\r\n<br>\r\n\"This is so cool!\" you mumbled to youself in your sister's voice, as you used her hands to part the coat hangars on the rack, studying each item of clothing grater detail. You eventually selected a little black party dress that your sister had last worn at the weekend, and digging through your new collection of shoes, you selected Sara's favorite black stiletto heeled pumps.<br>\r\n<br>\r\nIt didn't take you long to strip out of Sara's clothes, in fact you spent longer checking out your sister's naked body in the mirror before slipping into the black dress and pulling the zip up in back. \"Oh yeah...sexy!\" you 'giggled', as more and more of Sara's mannerisms overtook you.<br>\r\n<br>\r\nStill grinning with glee, you then slipped your slender feet into the high heels you had picked out, and you spent a moment or two pacing the bedroom, getting used to walking in them. You had to admit they felt amazing.<br>\r\n<br>\r\nSuddenly....</span></div></div>",
            "created":1329195600,
            "id":1277366,
            "title":"Trying on some clothes."
        },
        "1243":{
            "author_id":"saracen1187",
            "author_name":"Triss Merigold",
            "choices":[
                "Out into the world.",
                "Advising each other.",
                "'Experimentation'."
            ],
            "content":"<div class=\"\"><div> <span>You were still feeling your perky little breasts when your sister - in your body - practically fell into the bedroom, startling you a little. \"What the hell??\" she exclaimed, seeing you dressed in her 'party clothes'. \"We...we actually...swapped bodies!\" she then stuttered in disbelief. She stood there, looking you over for a while, and you could tell she was a little freaked out. But then again...you were too.<br>\r\n<br>\r\nLooking down at Sara's new crotch, you saw the distinctive bulge in her pants that you had got so many times before. She soon caught you staring and she became very self-conscious all of a sudden. \"Yeah...I got a hard-on...okay!\" Sara sneered in your voice.<br>\r\n<br>\r\n\"Understandable!\" you shrugged your sister's slender shoulders, \"its your first time in a male body\" you then giggled.<br>\r\n<br>\r\n\"But...I can't believe this actually happened, I'll never doubt anything ever again, even crappy disney films!\" Sara laughed, as she rubbed her erect penis through her pants.<br>\r\n<br>\r\n\"Well, I have to admit, it feels good being a girl!\" you told her, as your slender hands caressed your curves.<br>\r\n<br>\r\nThen suddenly...both of you looked at the other. \"What if we don't swap back?\" you said in unison, concern etched on your faces. But taking another look down at the cute little body you now had...you weren't all that bothered if the swap was permanent. But Sara...you thought..would think differently. \"I'm sure we'll swap back after we've walked the perverbial mile in each other's shoes\" you muttered in feigned reassurance.<br>\r\n<br>\r\n\"That'll be easier for me than you I think\" Sara laughed in her deep voice, gesturing to your high heeled feet.<br>\r\n<br>\r\n\"Yeah...no shit!\" you laughed.<br>\r\n</span></div></div>",
            "created":1329886800,
            "id":1282019,
            "title":"...your sister (in your body) barged in."
        },
        "12433":{
            "choices":[
                "Go to dinner (it's very awkward)",
                "fiend being sick and hide in your own rooms for the night"
            ],
            "content":"<div class=\"\"><div> <span>You were looking at your sister's body in the mirror, admiring your new curves, when you put your hands on your hips and cocked them to the side, giving a sly seductive smile. This was something you never even thought to do as yourself. Unbeknownst to you, Sara, as you began to follow your backside with her new eyes, down to your butt, where they froze. It kind of was noticed, but not really so much that you and her had traits of one another's personalities. You didn't know whether it was because of the hormones, or because of a partial body swap or what. You were leaning on the chemical make ups of your brains. You then notice the silence and ask her \"Is something wrong?\" Her light, soft, feminine voice coming from your ever so slightly puffy female lips. Your sister walked up behind you, and wrapped her arms around you. You could see in the mirror that she was looking at your breasts, and resting her newer, more masculine hands on your soft stomach. She began to rub very gently, and you felt a pleasurable tingle travel up your spine. You see his right knee emerge between your smooth, hairless legs, and feel your former male member rubbing up against the crack of your rear end.<br>\r\n<br>\r\nSuddenly, one her hands move up to your breasts, and you gasp \"John!-- I mean Sara!\" <br>\r\nSara, as you, then shushed you and moved one of his new hands down to between your legs, and began caressing your womanhood. You could feel your labia swell up, as well as your new clit, and you became very quiet.<br>\r\n<br>\r\nYou turn around in your new brother's arms, and face him. He looks down at you, practically gazing into your soul, and you look back up into his eyes, getting lost in the deep pools of blue, so intensely staring back. His gaze shifts to your parted lips, and he opens his mouth and moves in. You feel his lips gently and moistly touching yours, and soon to follow the slip of his tongue into your new mouth. Before things get serious, you both here your mom call out \"Sara, John! It's time for dinner!\"<br>\r\n<br>\r\nYou both are taken aback by this, in both shock and disbelief at what you had just done. You push the new John off of you, and jump back a pace. He does the same.</span></div></div>",
            "created":1337749200,
            "id":1343953,
            "title":"It All Starts With a Kiss"
        },
        "124331":{
            "author_id":"magicbannana",
            "author_name":"datguy",
            "choices":[
                "accdintly tell her",
                "you tell here you dont want to talk about it"
            ],
            "content":"<div class=\"\"><div> <span>\"Why?\" You asked with a scared look. \"I'm sorry\" sara replied. \"We'll talk about later\" you say. \"Dinner is ready\" mom yelled. \"We will talk about this after dinner\" you say. You both walked down to the kitchen. And started eating the spagetti. \"Anything intresting happen today\" mom asked. \"Not really\" you say. \"Your hiding somthing\" she says to you. </span></div></div>",
            "created":1365300600,
            "id":1566739,
            "title":"Go to dinner (it's very awkward)"
        },
        "1243311":{
            "author_id":"pompombella",
            "author_name":"SarahandAshley",
            "choices":[
                "She's very supportive about your relationship.",
                "She's pissed and grounds you both!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After admitting to your mother that you almost kissed your 'brother'...</span></div></span></div>",
            "created":1413098040,
            "id":1870289,
            "title":"Accidently told her."
        },
        "12433111":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "You decide to have sex",
                "This is already disturbing enough as it is..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She's very supportive of the relationship, and she has no objections of you two having sex.</span></div></span></div>",
            "created":1474961940,
            "id":2215334,
            "title":"She's very supportive about your relationship."
        },
        "125":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "Run into your \"brother\" in the living room.",
                "Something distracts you."
            ],
            "content":"<div class=\"\"><div> <span>You decided to have a go at imitating Sara.<br>\r\nYou readjusted the bra straps and straightened out your blouse. You walked over to what was now your bedroom mirror and stare intently into your new eyes.<br>\r\nIf you were going to act like Sara, you were going to have to get used to your new form. You tried to adapt your brain to the situation. <i>I've been this way my whole life!</i><br>\r\nYour breasts heaved as you inhaled deeply, calming yourself down. Becoming more comfortable with the new you, you smiled subtly, as you continued to stare at yourself in the mirror.<br>\r\n\"Hi! My name is Sara!\" you said with a smile.<br>\r\nYou closed your eyelids, feeling the long eyelashes on your cheeks, and deeply inhaled once again. You let out a long feminine sigh.<br>\r\n<a rel=\"nofollow\" href=\"http://babescene.com/babe/image/large/babescene.com_qyadm0.jpg\" target=\"_blank\">http://babescene.com/babe/image/large/ba...</a><br>\r\nYou opened your eyes to the new Sara.<br>\r\nConcealing your mixture of confusion and excitement, you pushed your long dirty blonde hair back behind your shoulders and shook your head.<br>\r\nYou adjusted the necklace resting between your breasts with your delicate fingers and headed downstairs, shoulders pushed back.</span></div></div>",
            "created":1330059600,
            "id":1283123,
            "title":"Pretend to be your sister."
        },
        "1251":{
            "author_id":"saracen1187",
            "author_name":"Triss Merigold",
            "choices":[
                "Venturing outside.",
                "Staying in the kitchen.",
                "More discussion with your 'brother'."
            ],
            "content":"<div class=\"\"><div> <span>\"What the hell has happened?\" your former body (now your brother) yelled at you when you walked into the living room. Acting startled...you managed to keep a straight face. \"What are you talking about?\" you responded, casually pouring yourself a hot cup of coffee. <a rel=\"nofollow\" href=\"http://img004.lazygirls.info/people/mckayla_maroney/mckayla_maroney_cleavage_in_instagram_pic_2EJj5g6.sized.jpg\" target=\"_blank\">http://img004.lazygirls.info/people/mcka...</a><br>\r\n<br>\r\n\"I...we've swapped bodies!\" your sister then said, as her new hands roamed her unfamiliar body...stopping at her bulging crotch.<br>\r\n<br>\r\n\"Er...yeah...right, nice try bro!\" you scoffed, rolling your pretty new eyes. \"We were only joking earlier you know, nothing can make two people swap bodies, especially not fortune cookies\" you then giggled. You then started walking past your rather distraught sister, but she quickly grabbed you by the arm and span you around.<br>\r\n<br>\r\n\"What are you doing John?\" your former voice, now controlled by your sister, said.<br>\r\n<br>\r\n\"Bro...lay off, the joke's already old\" you insisted, trying to act as much like Sara as you possible could. \"I've got stuff to do and I'm sure you have okay, so get lost\" you then told her abruptly, very much like she had done to you many times.<br>\r\n<br>\r\nInstead of harping on at you, your sister stopped...and looked down at herself, once more feeling her crotch.<br>\r\n<br>\r\nMeanwhile you headed into the kitchen, a beaming smile on your new face, and you had another feel at your developing breasts as you wiggled your dainty toes inside your flats. You were already loving being your sister, and you knew that you were going to have even more fun by pretending to be her. The fun was only just beginning.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://babescene.com/babe/image/large/babescene.com_j1gfdr.jpg\" target=\"_blank\">http://babescene.com/babe/image/large/ba...</a></span></div></div>",
            "created":1330059600,
            "id":1283471,
            "title":"Run into your \"brother\" in the living r..."
        },
        "12511":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "Inspect your breasts.",
                "Continue to change,"
            ],
            "content":"<div class=\"\"><div> <span>You really did have stuff to do.<br>\r\nSara was on the swim team and would always practice a couple days a week in your pool.<br>\r\nYou walked past her to go get \"your\" swimsuit from your room.<br>\r\nOnce there, you began to open drawers, looking for \"your\" swimwear. Finally you see it, and your heart nearly skips a beat. You try to give yourself mental support.<br>\r\n<i>This is a completely normal thing to do -especially for a girl like me.</i><br>\r\nYou pulled the bikini top and bottom carefully out of the drawer. You realized how real the situation was when you held up the top over your breasts. It fit perfectly.<br>\r\nYou began to take off your blouse. <i>I can do this. I am Sara after all.</i> It fell to the floor, drawing your attention to the padded bra you were wearing underneath it.<br>\r\nTwo lumps of real flesh filled this bra. You wore a dull expression while unhooking the bra that was squeezing your torso, still trying to act like Sara (you wanted to practice it to yourself, too).</span></div></div>",
            "created":1330146000,
            "id":1283753,
            "title":"Venturing outside."
        },
        "125112":{
            "author_id":"124235a",
            "author_name":"124235",
            "choices":[
                "It feels goood!",
                "Ask Sara to join you."
            ],
            "content":"<div class=\"\"><div> <span>Trying desperately to ignore the swollen mounds on your chest, you leaned forward to remove your leggings. They slid down your clean-shaven legs, rubbing against your sensitive new skin. You carefully removed your panties, as well. Nothing was going to stop you. No one could ever prove you wrong.<br>\r\nNow standing, naked, in front of Sara's mirror, you couldn't help but stare at this beautiful new body of yours. You had never been skinny as a boy, and it seemed as though becoming your sister was the only way out. You stroke your flat stomach, feeling your belly button and moving your hand up below your breasts, pushing them upwards. You relaxed your big round eyes and puckered your lips.<br>\r\n\"I'm sorry Sara for keeping you out, but I love being you! Hey babe.\"<br>\r\nYou spin around, moving your curvaceous hips and twirling your arms in the air.<br>\r\nYou pulled the blue bikini bottom up between your skinny legs and tightened it up against your crotch. This caused you to let out a quick moan (before you caught yourself).<br>\r\nYou also tied the top around your breasts and rested your hands upon them, further admiring yourself in the mirror.<br>\r\nYou head downstairs, allowing for your breasts to jiggle with your every step.<br>\r\n\"John, I'm going swimming.\"<br>\r\nSara (in your old body) just stared at your feet with heavy eyes.<br>\r\n\"John? Are you alright?\" you asked, enjoying every moment you had with your feminine form.<br>\r\n\"Yeah...\"<br>\r\nYou slid open the back doors and feel the sun and your long hair on your shoulders.<br>\r\nThe water was warm, so you stepped in.<br>\r\n<a rel=\"nofollow\" href=\"http://babescene.com/babe/image/medium/babescene.com_b73kg4.jpg\" target=\"_blank\">http://babescene.com/babe/image/medium/b...</a></span></div></div>",
            "created":1330146000,
            "id":1283762,
            "title":"Continue to change."
        },
        "1251121":{
            "author_id":"saracen1187",
            "author_name":"Triss Merigold",
            "choices":[
                "Bathing siblings.",
                "Skip to later, you parents are home."
            ],
            "content":"<div class=\"\"><div> <span>As your bikini got wet, it clung to your new flesh, and you could feel your new feminine nipples getting hard. Looking down...you saw them clearly evident in your bikini top, and you let out a giggle as you rubbed your smooth legs together under the water. This was pretty much what heaven felt like as far as you were concerned, wearing your sister's cute body. You just tipped your head back and closed your eyes, knowing that people were probably looking at you bathing as they walked past. You were enjoying the attention...<br>\r\n<br>\r\n\"Um...Sara!\" your old voice suddenly said, causing you to lift your head and open your pretty new eyes. \"Hey bro, what's up?\" you greeted your confused sibling with a grin on your face.<br>\r\n<br>\r\n\"Is it weird to think that I used...to be you!\" she suddenly said.<br>\r\n<br>\r\n\"Er...yeah!\" you emphasized. \"I'm me, and you're you...silly!\" you then laughed. \"Now why don't you come and have a soak, or go and lie down if you aren't feeling well\" you then advised \"her\".<br>\r\n<br>\r\n\"Okay, let me get my bikini...er...I mean my trunks!\" Sara mumbled in your voice.<br>\r\n<br>\r\nAs your sister turned brother then disappeared back into the house to get changed, a broader, cheeky gin appeared on your face. You brushed your long hair behind your ears and continued to enjoy the feeling of being a sexy teenage girl. As far as you're concerned, you've always been one.<br>\r\n</span></div></div>",
            "created":1330318800,
            "id":1285198,
            "title":"It feels goood!"
        },
        "12511211":{
            "choices":[
                "Enough is enough. Tell her it's all a joke and you're really John.",
                "Back to the fortune cookies! Make a wish that 'John' regains all his memories."
            ],
            "content":"<div class=\"\"><div> <span>You enjoyed the sensation of cool water on your smooth, sensitive new skin. Sara's body is lithe and graceful, far more flexible and coordinated than your clunky old male body. You easily glide through the water, with Sara's reflexes instinctively making all the right motions for the various swim strokes. <br>\r\n<br>\r\n“Being on the girls swim team will be easier than I thought,” you whisper to yourself.<br>\r\n<br>\r\nJust then, you spot Sara, in your old body, stepping out wearing nothing but a pair of your black swim trunks. She looks skittish and nervous, the way she's clutching a towel over her bare chest where her breasts used to be. She's a fifteen-year old boy now, although her body language is still that of a thirteen-year old girl. She takes a few small, hesitant steps towards the pool.<br>\r\n<br>\r\n“What's the matter, bro?” you tease. “Come on in, John! The water's fine.”<br>\r\n<br>\r\nStill looking intensely uncomfortable, Sara finally puts down the towel and awkwardly clambers into the pool with a clumsy splash. <br>\r\n<br>\r\n“Listen Sara, we've got to talk about something,” she says, swimming up to you.<br>\r\n<br>\r\n“Sure, John,” you tell her. “You can share anything with me. What's troubling you?”<br>\r\n<br>\r\nShe looks around the pool nervously, to assure herself no one else is around to overhear your conversation.<br>\r\n<br>\r\n“Are … Are you sure you're Sara?” she asks, with a quavering tremor in your old voice. <br>\r\n<br>\r\n“I've told you like three times already!” you say with a feminine giggle. “I'm me and you're you. I'm Sara and you're John. What's going on anyhow?”<br>\r\n<br>\r\n“It's that business with the fortune cookies,” she says. “You remember that?”<br>\r\n<br>\r\n“That was just a dumb game,” you tell her. “People only switch bodies in lame movies.”<br>\r\n<br>\r\n“Well, maybe nothing happened to you,” Sara says. “And I guess that's good. But … well, you have to swear you won't tell anyone about this.”<br>\r\n<br>\r\n“I swear,” you solemnly say.<br>\r\n<br>\r\n“I think I used to be you,” she says. “I know I'm supposed to be John. I have his body. I'm a guy and you're a girl. And if you say nothing happened … then … I don't know, Sara. I think I got somehow cursed so that your personality leaked into me. Because I don't know anything about being John. I only remember being Sara. It's like I'm a girl trapped in a boy's body. I just want to be a girl again … but I know I never was a girl. I've always been John, and only just now lost my memories or something. Please Sara, you've got to understand! You're me too, only you still have the right body at least.”<br>\r\n<br>\r\nYou look at your confused, blubbering sister making a ridiculous scene in your old body. <br>\r\n<br>\r\nWhat to do, you think. What to do?</span></div></div>",
            "created":1357162500,
            "id":1500415,
            "title":"The Truth ... or Not?"
        },
        "125112111":{
            "author_id":"xyxx",
            "author_name":"XYXX",
            "choices":[
                "She reluctantly agrees to be you for just a little while.",
                "She demands you look for a way to swap back right now."
            ],
            "content":"<div class=\"\"><div> <span>You frowned at the crying boy in front of you. Sara was making you look bad.<br>\r\n<br>\r\nNo, you told yourself, John was making himself look bad.<br>\r\n<br>\r\n...No, that was Sara alright. And she wasn't going to accept otherwise. You finally began to feel some guilt for trying to steal her identity.<br>\r\n<br>\r\n\"Awww, you're no fun, sis,\" you reluctantly said.<br>\r\n<br>\r\nSara whipped your old head upward and stared at you with a mix of a dozen emotions. \"John?!\"<br>\r\n<br>\r\n\"Yep, I'm John... or at least I used to be,\" you said.<br>\r\n<br>\r\n\"So... you were just pretending to be me?\" Sara asked, beginning to sound angry.  \"You... you jerk! Why would you even do that!?\" She threw her arms down in frustration, splashing water on your face.<br>\r\n<br>\r\n\"Because... because it's fun,\" you said, avoiding eye contact.<br>\r\n<br>\r\n\"What?\" Sara said in a tone of utter disbelief. \"But... you're supposed to be a boy! Are you telling me you're enjoying being a girl?\"<br>\r\n<br>\r\n\"Well... yes! I-I mean, at least for a while, you know?\" you said with a weak smile. \"Come on, Sara, don't you think this is cool at all? I mean, doesn't it make you curious about what it's like being me? How about we try living as each other, just for a few days?\"<br>\r\n<br>\r\nThe truth, of course, was that you hoped to stay as Sara for a lot longer than a few days, but she obviously wouldn't react well to that.<br>\r\n<br>\r\nWith a grimace, Sara looked down at her new male body, clutching her arm in another bit of jarringly feminine body language. You anxiously waited for her to say something.</span></div></div>",
            "created":1359848520,
            "id":1522762,
            "title":"Drop the act"
        },
        "1251121112":{
            "author_id":"zazeal",
            "author_name":"Zazeal",
            "choices":[
                "Her sister likes it",
                "Her sister dislikes it"
            ],
            "content":"<div class=\"\"><div> <span>“No. We need to find a way to turn back right now,” he demanded.<br>\r\n<br>\r\n“No… Please don’t… I don’t want to be a boy,” she slowly backed away mortified. Her sister was shocked that she wanted to be a girl so badly.<br>\r\n<br>\r\n“Do you really want to be a girl that badly…?” her sister asked<br>\r\n<br>\r\n“Y…Yeah… I always thought that there was something wrong with my life, but I only realised after I swapped how truly happy I am now. I don’t want you to be miserable though, if only there was a way for us to both be what we want to be” she replied.<br>\r\n<br>\r\n“Fine… I won’t force you to turn back right away, but I don’t want to be stuck like this forever,” her sister said.<br>\r\n<br>\r\n“Thanks,” she sighed.<br>\r\n<br>\r\n“What would everyone think, if they knew you wanted to be a girl?” her sister teased.<br>\r\n<br>\r\n“That would be really embarrassing, if I was a boy,” she blushed and her sister laughed.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1469692080,
            "id":2187283,
            "title":"She demands you look for a way to swap back rig..."
        },
        "125112112":{
            "author_id":"steelspoder",
            "author_name":"LOST ANIME SWVENGE ",
            "choices":[
                "sonic into cream tg",
                "continue "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You call up take out for china food then Sara's mind matchs her body </span></div></span></div>",
            "created":1483785300,
            "id":2260269,
            "title":"Back to the fortune cookies! Make a wish that &..."
        }
    },
    "info":{
        "author_id":"124235a",
        "author_name":"124235",
        "brief_description":"A boy swaps bodies with his little sister!",
        "created":1327916940,
        "description":"<td align=\"left\" class=\"norm\">Just follow my lead, and keep it as realistic as possible. No sloppy writing.<br>\r\n<br>\r\nYou are a boy named John (15).<br>\r\n<br>\r\nYour sister's name is Sara (13).</td>",
        "id":1844553,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1537163700,
        "modified":1537163700,
        "pretty_title":"Sibling Swap -- PLEASE ADD!!"
    }
}