{
    "chapters":{
        "1":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "\"Let's invite one of our friends!\"",
                "Before Laura can say anything they hear the doorbell",
                "\"Let's take off our socks!\"",
                "Something else(More realistic scenarios go there)",
                "Something unexpected happens!(Fantasy and supernatural scenarios go there)"
            ],
            "content":"<div class=\"\"><div> <span>Karen and Laura were both in living room as their parents were busily packing things to bags. For the first time they decided to let the two stay at home without leaving babysitter or anyone else to take care of them. Karen was lying on the sofa, and doing something on her phone, while Laura was playing video games on a console that was connected to the TV. The sisters weren't wearing their shoes since there was no need to do so at home.<br>\r\n<br>\r\nAfter a while Mr. and Mrs. Waters were ready to go, so they approached their kids to say goodbye.<br>\r\n\"Don't burn down the house while we are gone!\"Said their father jokingly<br>\r\n\"And remember that dinner is in the fridge!\"Added their mother<br>\r\n\"Okay thanks!\"Said the sisters<br>\r\nThen after saying goodbye for the last time, Mr. and Mrs. Waters went outside. In a moment the sisters could hear the sound of car leaving the driveway.<br>\r\nThe two went back to what were they doing before, however after a while Laura seemingly got bored of the videogame.<br>\r\n\"Maybe we should do something?\"She asked her older sister<br>\r\n\"Huh? Well, I'm not really bored here. Do something by yourself.\"Said Karen<br>\r\n\"Oh, come on sis! We should use the occasion that we have absolute freedom for two days!\"Said Laura<br>\r\n\"Doing what?\"Asked Karen<br>\r\nLaura thought for a moment...</span></div></div>",
            "created":1397192400,
            "id":1776826,
            "title":"A free weekend!"
        },
        "11":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Jasmine(14 years old. Karen's classmate)",
                "Yuki(12 years old. Exchange student from Japan, Laura's classmate)",
                "Chloe(16 years old. Daughter of the neighbours)",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Let's invite friends!\"Said Laura<br>\r\n\"Fine, but who do you have in mind?\"Said Karen getting up from the sofa<br>\r\n\"What about...\"Started Laura<br>\r\n<br>\r\nWho will they invite?<br>\r\n</span></div></span></div>",
            "created":1397235480,
            "id":1776875,
            "title":"Inviting friends"
        },
        "111":{
            "author_id":"rancallie",
            "author_name":"Rancallie",
            "choices":[
                "Jasmine suggests more making out after Laura is sent to the store for real.",
                "Karen and Laura turn on Jasmine and tickle her into a frenzy."
            ],
            "content":"<div class=\"\"><div> <span>   \"Jasmine,\" declared Karen, knowing that she was the only one of her friends that Laura actually liked.<br>\r\n   \"OK,\" Laura agreed.  \"She's fun.  She always lets me wear her bracelets.\"<br>\r\n   \"Well, don't bug her too much, I want to keep her as a friend.\"<br>\r\n   Before Laura could form one of her famous scowls, Karen started tickling her, tickling her to the floor then stealing her socks.<br>\r\n   Spluttering, \"Hey!\" Laura chased Karen to her older sister's bedroom, but the door shut and was locked, Karen calling Jasmine while calmly sitting on her bed.<br>\r\n   \"Want to come over Jaz?  Our parents are finally gone.  And Laura wants you to come, too.\"<br>\r\n   \"Sure.  Can I stay overnight?<br>\r\n   \"Uh, yeah, I guess.  Mom and Dad know you.\"<br>\r\n   \"Be right there!\"<br>\r\n   Jasmine had brown eyes, a great tan and chestnut hair she she always wore up, exposing her smooth neck.  She and Karen were the same size in every aspect and often exchanged dresses, swimsuits and shoes as if the two were family.  She knocked on the door and Laura pulled her inside.<br>\r\n   \"Where's Karen?\" asked Jasmine.  <br>\r\n   \"In her room.  She won't let me in.\"<br>\r\n   \"She's just messing with you.\"  Jasmine thought for a second.  \"We ought to teach her a lesson, huh.  Remember what we did to her at my mom's party?  Let's tickle her to death.  Want to?\"<br>\r\n   \"I want to, bad.  She has it coming.\"<br>\r\n   \"Alright.  I'll tell her you ran off to the store and when she comes out of the room we'll both tackle her and tickle her senseless.  Let me tickle her feet.\"<br>\r\n   \"You've got it, Jaz.\"<br>\r\n   Jasmine executed her part of the plan convincingly and when a miffed Karen threw the door open the two giggly conspirators pounced, rushing Karen onto the bed.  They both tickled her upper body to weaken her, then Jasmine peeled her friend's socks off, knowing exactly how to to tickle her into delirium.<br>\r\n   \"Get off my feet!\" shrieked Karen, unable to rise up due to Laura effectively straddling her torso.  The older sister squealed and shouted and swore.<br>\r\n   Teasing the toes, Jasmine simply laughed and delighted in the torment she was administering.<br>\r\n   \"Jahahahahahahahazzz!  Please!  I'll do anything, anything you want!  Stohohohohohohohohohohop!!!\"<br>\r\n   \"Make out with me while Laura takes a picture?\"<br>\r\n   \"What the-\"<br>\r\n   \"Is that a no?\"<br>\r\n   \"Yes, yes, yes, yes, yes!!!  Pleeeeeeeeeease!  Stop!  Stop!  \"I'll...........do it!!!<br>\r\n   The deed was done, with surprising enthusiasm, and a video taken on Laura's smartphone.\"<br>\r\n   Afterwards...</span></div></div>",
            "created":1599449160,
            "id":2898732,
            "title":"Jasmine(14 years old. Karen's classmate)"
        },
        "112":{
            "author_id":"yoshiissick",
            "author_name":"Zygansky",
            "choices":[
                "drawing",
                "Karen gets bored",
                "Karen invites Greg"
            ],
            "content":"<div class=\"\"><div> <span>\"I'd like Yuki to come over. She has this funny accent, you know. And she knows so much about the Mangas. And she can draw so well. Maybe she can show us how to...\" Lauren blurted. She was very excited about their new exchange student. Coming not only from a different country but seeming to come from a different planet, Yuki's abilities and habits were very different to those known to Lauren and her older sister.<br>\r\n<br>\r\nKaren was not too happy about this proposal. Having even two girls younger than her bored her. She had to keep an eye on her younger sister, but expanding her 'babysitting' did not sound promising. How about Greg, she pondered silently. A cute boy, tall for his age, and not as boring and annoying as the other boys. Should she propose to invite him? Lauren would reject it, only because their dad had told them firmly to expect a spanking never to forget if he found out that a boy had entered the house in the parent's absence.<br>\r\n'Okay' Karen sighed. Yuki would keep Lauren busy, probably in Lauren's room. Then she would have time to skype with Greg.<br>\r\n<br>\r\nHalf an hour later Yuki rang the door bell, equipped with a pink rucksack with a smiling and blinking cat dangling from it. As requested by Lauren she carried her drawing equipent, along with a Japanese fude. Lauren hugged Yuki and excited they disappeared into the younger sister's room, almost ignoring Karen. Yuki shyly waved hello and followed Lauren.<br>\r\n<br>\r\n1 - drawing<br>\r\n2 - Karen gets bored<br>\r\n3 - Karen invites Greg</span></div></div>",
            "created":1482583440,
            "id":2253919,
            "title":"Yuki(12 years old. Exchange student from Japan,..."
        },
        "12":{
            "author_id":"noahnicanor",
            "author_name":"Vick",
            "choices":[
                "No one was there",
                "It was their aunt",
                "Friends",
                "The oldest sibling",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>They froze a moment when they heard the doorbell rang, Laura looks at Karen confused and says \"who could that be?\" <br>\r\n\"I dont know\" says Karen, \"mom and dad does not want us answering the door when they are not here, so just ignore it.\"<br>\r\nLaura stands up \"we should at least check, could be mom and dad forgot something?<br>\r\n\"I dont think so\" Karen says \"but just to check, lets go\" <br>\r\n<br>\r\nBoth of the girls walked down the little hallway to the front door, Karen looks threw the window next to the door.</span></div></div>",
            "created":1505850720,
            "id":2388232,
            "title":"Before Laura can say anything they hear the doo..."
        },
        "121":{
            "author_id":"king1221",
            "author_name":"King1221",
            "choices":[
                "Karen was gone for a long time",
                "Laura look threw Karen's phone",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"No one's there\" says Karen \"must of left.\" <br>\r\nSo the girls walked back to the living room only to hear something was at the back door in the kitchen. \"What was that?\" Asked Laura.<br>\r\n\"How am I supposed to know?\" Says Karen \"it may just be nothing.\" But Karen went to checked anyways just in case. <br>\r\n<br>\r\nLaura went and sit on the couch, notices Karen left her phone on the arm rest. </span></div></div>",
            "created":1528392900,
            "id":2504021,
            "title":"No one was there"
        },
        "1211":{
            "author_id":"king1221",
            "author_name":"King1221",
            "choices":[
                "Had their feet tied up ",
                "Hogtie ",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Laura picked up Karen's phone and being noisy looked at the screen. Was nothing interesting, a article about something in Africa. <br>\r\nShe put the phone back down and waited for a few more minutes. \"Karen is taking a long time, maybe she's getting a snack in the kitchen?\" <br>\r\nLaura got up and walked over to the kitchen \"Karen what are you up t...\" She stopped at the doorway to the kitchen when she saw Karen laying on the floor. She was laying on her stomach with her hands behind her back tied up with rope, strips of black duct tape was over her mouth. <br>\r\n\"Karen what is going on?\" Laura said as she walk in the kitchen.<br>\r\nBut as she walked in, Laura caught something at the corner of her eye. She turned and saw a woman was standing at the other said of the wall. She had redish brown hair tied in a ponytail, black sunglasses over her eyes that matches her black shirt, pants and boots.<br>\r\n\"Not a word, not even a peep, and no one gets hurt.\" The woman said as she grab a hold of Laura's left arm. Not wanting to upset the stranger, Laura kept quiet. <br>\r\nLaura was turned around and her arms was pulled back behind her. She felt her wrists being tied together.<br>\r\nShaking a little, Laura said softly \"why are you doing this?\"<br>\r\nThe woman replayed \"I needed a place to hide out from the police, I thought this house was empty since there was no car and no one answered the front door.\" The woman finished tying Laura's hands. <br>\r\nKaren moaned a little threw the tape gag and strained against the ropes binding her wrists a little as the woman helped her to her feet. The sisters was guided to the living room where they were then...</span></div></div>",
            "created":1530381720,
            "id":2513517,
            "title":"Karen was gone for a long time"
        },
        "122":{
            "choices":[
                "Aunt Christie attacked. The game is a free for all tickle war",
                "She explained tickle hide and seek"
            ],
            "content":"<div class=\"\"><div> <span>“It’s Aunt Christie!” Karen exclaimed. They opened the door and let her in. <br>\r\n“Hey girls!” Aunt Christie said. “I heard your parents were leaving so I thought it would be a good time to come see you two”<br>\r\n“Yes, we were just deciding on what we wanted to do” Laura said. “Maybe you can help us?”<br>\r\n“I’d love to help but first let me change out of my work clothes and in to something a little more comfortable. Maybe you two should do the same.” So Aunt Christie, who was not a typical aunt, she was only 18 years old, significantly younger than her sister, Karen and Laura’s Mom, and had straight blonde hair and a great body,  took her bag to the bathroom and changed out of her waitress attire and into short black tight booty shorts, a red tank top that showed her deep belly button, and left her cute small feet with black painted toenails bare. <br>\r\nMeanwhile, Karen left her white shirt and jean shorts on, feeling comfortable enough and Laura put on some shorts and a t shirt  instead of jeans and a sweatshirt. But both girls left their socks on, which was sure to change soon enough<br>\r\nAfter all the girls had changed, they met back in the living room and decided on what to do next. <br>\r\n“I was thinking we could play a new game I thought of on the way over here” said Christie. <br>\r\n“Yeah we’d love to play your game!” Karen exclaimed. <br>\r\n“How does it work?” Laura asked. <br>\r\n“Well it’s actually really simple, but first you need to take your socks off” Christie said hoping to see her neices’ cute little feet before her secret tickle game began. <br>\r\nThe girls were hesitant but after Christie reassured them that everything would be okay they took their socks off revealing pedicures feet with red toe nails for Karen and sky blue for Laura. <br>\r\nThen...</span></div></div>",
            "created":1530402900,
            "id":2513592,
            "title":"It was their aunt"
        },
        "1221":{
            "choices":[
                "The girls took Aunt Christie’s top off and tickled her",
                "Karen called Aunt Christie’s boyfriend, who loves to tickle"
            ],
            "content":"<div class=\"\"><div> <span>“So basically, all you have to do is... Laura help me tickle your big sister” Christie ordered as she tackled Karen to the ground. <br>\r\n“Come sit on her back so she can’t go anywhere. I’ll take care of  her feet” Aunt Christie said<br>\r\nSo Laura sat on her facedown sisters back, pinning her arms to her sides with her knees and began her tickling. She started by squeezing her big sisters sides causing Karen to shriek. <br>\r\n“AAAEHEHE NO LAURA”<br>\r\n“Sorry sis” Lura said as she slid her hands up Karen’s shirt and began tracing her nails up and down Karen’s sides, increasing the ticklish sensations. <br>\r\nMeanwhile, at Karen’s feet, Aunt Christie was sitting on her ankles, pinning her her beteeen the floor and her butt, leaving both of her hands free to tickle the feet in front of her. <br>\r\n“AHHH NOT MY FEEEHEHEHEEEET THIS ISNT FAAAAHAHHAIRRR” Karen protested. <br>\r\n“Of course it’s fair sweetie. All is fair in love and war, and well, this IS a tickle war” Aunt Christie taunted before tracing the tiny wrinkles on her niece’s cute little feet. She then backed off slightly and began dragging a single finger up and down each foot, starting at the tip of one toe and scratching it all the way down the arch to the heel. <br>\r\n“AAAHAHAHA NOOHHOHOOHO” Karen giggled. The new method of tickling was not as intense but just as effective in making her laugh. Then Christie decided that Karen had recovered enough and began tickling  her most ticklish spot: her red painted toes!<br>\r\n“Oooh I have an idea. How about we tickle those toes of yours?!?!” Aunt Christie rhetorically asked. <br>\r\nNot waiting for a rely for Karen, who was still suffering through Laura’s wiggling fingers in her armpits, she began scratching her torturous nails along the line of bubbly, and now squirming, toes. <br>\r\n“AAAAHHHAHAHAAAAAAAEEHEE” Karen screamed as her voice reached a new octave thanks to her ever so ticklish toes receiving such torturous attention now. “I CANT TAAAHAHAHAHAAKE ITHHAAHAAHA” <br>\r\n“Oh sure you can. Watch this” Christie said “Laura come help me tickle Karen’s feet. I want you to push down on her heels  and sit on her ankles just like I am.” So as Laura pinned her sisters feet to the ground, Aunt Christie leaned her head down and began licking Karen’s cute, and perfectly round yet not chubby big toes, while scribbling her fingernails on the underneath of the pads of her toes. <br>\r\n“NOOOOOHHHOOHHAHAHAAA PLEEEHEHEASE STOOOOHOHOOOP” Karen begged. <br>\r\nNow, Laura had left her sisters feet and was laying on top of her sister while squeezing her sides maniacally. <br>\r\nSuddenly, Laura was pinned beneath her Aunt Christie, who was not large at all but could easily handle a single girl, especially Laura — the younger and smaller of the two. <br>\r\n“I told you to hold her feet down and you disobeyed me. It’s time for you to be tickled now. Karen come he’ll me. I’m sure you’ll love to get some revenge or your sister.” <br>\r\n“Of course I do!” Karen replied enthusiastically. <br>\r\nBy this point, Aunt Christie had actually pulled Laura on top of herself and was holding Laura’s arms above her head, which caused her shirt to ride up to just below her still developing boobs, and had wrapped one of her legs around Laura’s legs and had pulled them away from each other, leaving her belly, waist and upper thighs and legs completely vulnerable. <br>\r\n“Well, here you go Karen. You tickle, I’ll hold” Christie said<br>\r\nBefore Laura could protest, Karen began spidering her fingers around Laura’s exposed tummy, taunting,<br>\r\n“I think someone has a ticklish tummy. Tickle tickle tickle” Karen taunted as she began her revenge in her little sister. <br>\r\n“AHAHAAAA NOO KAREN” Laura begged, but this only made Karen tickle harder. She was now working her manicured fingernails all over her sisters belly, in and out of her navel, and even sneaking up to her armpits on occasion to keep her sister guessing. <br>\r\n“Tickle around her boobs. That’ll get her!” Aunt Christie suggested. <br>\r\nTaking no time to consider the suggestion, Karen immediately began spidering her fingers around the sides and bottom of her sisters braless boobs. <br>\r\n“AAAHAHA NOOOI IT’S TOO MUUCHHHHAAAAAA” Laura screamed, experiencing tickling from a place she didn’t know possible. <br>\r\nFeeling slightly bad for her sister, but still not satisfied with her revenge, Karen moved temporarily to her bare upper thighs, and squeezed like her life depended on it. She found that the higher she squeezed up her sisters legs, the higher pitches her screaming became. But what Karen really wanted was to absolutely tickle her sister beautiful feet and light blue toenails to death. <br>\r\n“Hey sis, are your feet still ticklish? Never mind answering, i think I’ll just find out for myself” Karen blatantly taunted. <br>\r\n“Wait NOO they’re not I prohhahahaaAHAHAAAA” Laura was cut off but her sisters nails scratching up and down her extremely tickling feet. <br>\r\n“I think I found the jackpot. Aunt Christie would you flip her over and keep her legs together so I can tickle her feet better??” <br>\r\n“Well sure thing Karen” Aunt Christ’s replied, immediately rolling heard and Laura over and pulling Laura’s legs together. <br>\r\n“Now we have fun” Karen said before tickling in between the wildly wiggling sky blue painted toes of her little sister. Finding that the insides of her big toes were most ticklish, Karen spent most of her time there. After receiving a suggestion form Christie, Karen actually put Laura’s big toes in her mouth so she could nibble and lick the sides of her tickling big toes while using her hands focus on her long smooth soles. <br>\r\n“KAREN PLEEEHEHEASEEE I CASHHAHANT TAHAHAHAKE IT” Laura begged<br>\r\n“Oh sure you can, you didn’t stop tickling me when I asked” Karen shot back as she scratched all 1 fingers furiously up and down her sisters extraordinarily tickling feet. She then heard Laura gasping for breather and found that Christie had begun lightly tracing her fingers on the sides of Laura’s boobs, sending her into absolutely hysterical laughter, and Karen realized she had gone to far. She decided to save her little sister, despite the previous torture brought on by her, and tackled Aunt Christie off of her. <br>\r\n“You’ve tickled us both and now it’s your turned to be tickled” Karen scolded her older aunt “Laura go get rope, we’re gonna make her pay” she ordered as she began blowing raspberries on Aunt Christie’s tummy to keep her occupied while she waited for her sister to return. <br>\r\nOnce Laura had reappeared with rope, Karen made quick work of her aunt, and tied each arm to a separate leg of the couch and bound both her feet together, tying her big toes together for good measure, leaving Christie bound in a “Y” position on the floor. <br>\r\n“Girls, please don’t do this. We had so much fun and this isn’t even fair, neither of you were tied up. Aunt Christie tried to plead her case. <br>\r\n“But all is fair in love and war, you said it yourself. And this is war, right?” Karen wittingly replied. <br>\r\nAnd with that...</span></div></div>",
            "created":1530478080,
            "id":2513828,
            "title":"Aunt Christie attacked. The game is a free for ..."
        },
        "12211":{
            "choices":[
                "Continue tickling Aunt Christie",
                "Play a new game"
            ],
            "content":"<div class=\"\"><div> <span>Karen was busy tracing her nails along the exposed portion of Aunt Christie’s belly, while Laura wiggles her fingers in her armpits. Karen was thoroughly enjoying tormenting her ticklish aunt, and she increased her level enjoyment when she discovered the Christie’s belly button was something of a gold mine when it came to drawing ticklish responses. She became engrossed with wiggling her two index fingers on Christie’s sides, slowly dancing them across her smooth, tan stomach towards her deep navel, where she would eventually madly wiggle her fingers widely inside the hole, causing Christie’s soft, bubbly laughter caused by the teasing to turn to outright screaming as Karen’s fingers neared and entered her belly button. <br>\r\n“Karen, can we take her shirt off, I don’t have enough skin to tickle. I’m getting bored with her armpits.” Laura complained. <br>\r\n“Well that shouldn’t be too hard to fix.” Karen said as she slowly lifted Christie’s tank top and pulled it above her head and up to her wrists, leaving her entire upper body exposed. <br>\r\n“Girls please, that really isn’t necessary.” Aunt Christie tried to plead, but it only worsened her situation.<br>\r\n“You know Aunt Christie.” Karen said. “I really don’t want to hear you complain anymore.” She then pulled a ball gag from behind her back and shoved it into Christie’s mouth before the could protest. <br>\r\n“MMMPPHHHH” Aunt Christie screamed into her gag in protest, but Karen then gave Laura free reign of Aunt Christie’s upper body, while she went to entertain Aunt Christie feet. <br>\r\nLaura was having the time off her life tickling her gorgeous and fit aunt. She would slowly scratch her fingernails along her sides, before slowly working her way up the Christie’s armpits, where she would wildly wiggle her nimble fingers and cause Christie to laugh at the top off her lungs into her ball gag. Then, she would slowly trace her index fingers from her armpits to the edges of her boobs and gently tickle and caress them, which resulted in Aunt Christie giggling girlishly  until she had gotten used to the sensation, at which point, Laura would suddenly attack Christie’s belly, squeezing and poking around her belly button, and she even pulled down the waistband of her shorts at one point so she could squeeze deeply a soft spot right above the like of Christie’s underwear, which caused her to scream as loud as she had yet. Thank goodness for the gag. <br>\r\nMeanwhile, Karen had slowly spidered all ten fingers down Aunt Christie’s toned legs, making sure to pay attention to the insides and outsides of her thighs, which made Christie wiggle and shake her legs up and down in an attempt to escape. Karen then traced her fingers down the back of Christie’s legs until she reached her small, slender feet with bubbly black painted toes. Eager to make Christie pay, Karen quickly grabbed two feathers, one stiff, one fluffy, and slowly dusted in between each of Aunt Christie cute toes with the fluffy feather, while slowly, tortuously scratching the stiff feather along her arch. Christie was mad with laughter, and her wiggly toes, bucking legs, and and squirming upper body clearly displayed this. Karen then put her feathers aside and changed them out for an electric toothbrush, which she deviously dragged from the heel of Christie’s right foot, slowly inching it up her sole, pausing at the hall of her foot. She then held back aunt Christie’s toes with one hand and worked the toothbrush along the underside of Christie’s toes with her other hand. <br>\r\n“Hey Aunt Christie, don’t you think my tongue would be an effective tool for this? After all, you did that to me, right?” Karen taunted. Aunt Christie tried to protest but all that out would muffled screams. Karen told Laura to hold each of Aunt Christie’s feet by the big toe so that it was essentially immobile. Then, she laid down, with her head right at Christie’s feet, and slowly drug her tongue up the heel, causing Aunt Christie to shriek and squirm, but Laura held her feet still as Karen neared aunt Christie’s toes, where she inserted each toe into her mouth individually and licked around each toe while her fingers tortured the tiny, squirming toes in the other foot. At this point Aunt Christie was absolutely hysterical. She couldn’t control her laughing at all, and her body had basically given up all wiggling and bucking; she had effectively surrendered to the tickling at her feet, which proved utterly too much for her to handle. She just couldn’t take Karen’s tongue. After Karen had given each toe a turn with her tongue she then allowed Laura to help tickle the shine, slippery digits for a couple minutes, before deciding to give their ticklish aunt a break. </span></div></div>",
            "created":1531247160,
            "id":2517661,
            "title":"The girls took Aunt Christie’s top off and ti..."
        },
        "13":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Laura tickles Karen's feet using her fingers",
                "Laura tickles Karen's feet using a feather",
                "Laura tickles Karen's feet by licking them!",
                "Laura starts sniffing Karen's feet",
                "Laura does something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's take off our socks!\"Said Laura<br>\r\n\"Huh? What's so interesting about it?\"Said Karen<br>\r\n\"Well.. nothing, but don't you think we will be more comfortable?\"Said Laura<br>\r\n\"I guess you have a point, kid. Mom and dad never let us walk around house barefoot.\"Said Karen switching to a sitting position on the sofa now<br>\r\n\"Don't call me kid! You are only two years older!\"Said Laura with annoyance<br>\r\n\"Are you insecure or something? I can call you however I want.\"Said Karen<br>\r\n\"Grrr... Whatever, let's just take off our socks\"Said Laura clenching her hands into fists<br>\r\n<br>\r\nBoth sisters then started taking off their socks.After she was done, Karen wiggled her cute slim toes, as she felt fresh air on her feet. They were about size 7 and her nails were painted in blue. <br>\r\nLaura also took her socks off revealing her adorable feet as well. Unlike her sister, she wasn't painiting her nails, still her feet were really cute nonetheless.<br>\r\n<br>\r\n\"I have to say, you were right. It does feel better to be barefoot.\"Said Karen<br>\r\n\"See? I'm always right!\"Said Laura with hands on her hips in confident pose<br>\r\n\"Don't get too cocky, kid. Anyway I will continue browsing the net.\"Said Karen lying once again on the sofa, and using her phone<br>\r\nLaura was angry that her sister once again called her \"kid\", she had to teach her a lesson! At this moment she noticed Karen's feet going over one end of the sofa, completely helpless... If she quickly grabbed and immobilized them her sister wouldn't be able to defend herself from a ticklish attack! But how should she tickle her?<br>\r\n<br>\r\n</span></div></div>",
            "created":1397252940,
            "id":1776995,
            "title":"\"Let's take off our socks!\""
        },
        "131":{
            "author_id":"phillies11",
            "author_name":"Howdy",
            "choices":[
                "She keeps the attack on Laura’s feet",
                "She moves onto somewhere else",
                "Laura gets out and tickles Karen"
            ],
            "content":"<div class=\"\"><div> <span>She starts slowly sliding her fingers up and down Laura’s soft soles. She then starts adding more fingers then starts spidering her fingers all over Laura’s feet. “HAHAHAHAHAHASTHAAAAAAPPPP! IHHHHT THHHHICKLES!!” She then moves her fingers to Laura’s toes and starts getting under and in between each and every toe. ”HAAHAHAHHAAA!!” Laura curled her toes trying to stop the tickle attack on her toes. “Does that tickle?” Karen asked Laura as she kept her tickle assault going on Laura’s cute feet. “ITTT TIIIICKLES SOOOOOO MUCHHHH!!” Then...</span></div></div>",
            "created":1558757700,
            "id":2663828,
            "title":"Laura tickles Karen's feet using her fingers"
        },
        "133":{
            "author_id":"jennapiers",
            "author_name":"Beethoven",
            "choices":[
                "Karen overpowers Laura",
                "Laura somehow wins!",
                "Another lick subdues Karen."
            ],
            "content":"<div class=\"\"><div> <span>\"..................Kid, you don't have to shut up. Look, did I...hurt....your...feelings?\" Karen asked as she slowed turned only to realize Laura had somehow found rope and, even more oddly, she had bound her feet! \"Laura, what is goin-eh!\" Karen yelped and blushed. What was that wet, slimy sensation?<br>\r\n<br>\r\n\"....These actually taste good!\" Laura comments, poking her head above the sofa, grinning. <br>\r\n<br>\r\n\"Kid, why are you licking me feehehehehehehehehehehaahhaahhahahaahahahahhahah!\" Karen started to crack as Laura gave another lick.<br>\r\n<br>\r\n\"It's LAURA. Not kid, Laura! I didn't know these would taste so good, or that you were this ticklish!\" Laura admitted, getting ready to lick again. Karen lunges for her...</span></div></div>",
            "created":1399507680,
            "id":1793151,
            "title":"Oddly enough, that tasted good!"
        },
        "1332":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Laura ties Karen up",
                "Karen wriggles free and fights back"
            ],
            "content":"<div class=\"\"><div> <span>Karen lunges at her little sister and manages to grab her from behind, yanking her back and onto the sofa. After what had just happened, Karen as looking for a little payback and so, she plunged her hands into her sister's armpits and began tickling. Karen knew that wasn't Laura's most ticklish spot, but right now, she was just focused on subduing her.<br>\r\n<br>\r\n\"Hehehehehehehehehe Hey hahahaha cut ihihit ouhuhut hehahahahahaha\" Laura says twisting in Karen's grip.<br>\r\n<br>\r\n\"I don't think so, it's payback time, kid\" Karen says, digging her fingers into Laura's armpits and wiggling them hard.<br>\r\n<br>\r\n\"Eeeeeeeeeeeeeehehehehehehehe fohohor the last tihihime hahahahahahaha I'm nohohot a kid! Heheheheheheh\" Laura declares before reaching her arms backwards and tickling Karen's ribs.<br>\r\n<br>\r\n\"Gahahahaha ohohoho nohoho youhuhu dohohon't heheheheheheheh\" Karen says, still tickling Laura's armpits as she started squirming around.<br>\r\n<br>\r\nJust like that, things had turned into a tickle fight and it was a battle of endurance between the two sisters to see who would come out on top. Unfortunately for Karen, she couldn't reach Laura's feet and the latter's upper body was protected by the red hoodie she wore. In contrast to that, Karen's upper body was more exposed due to the fact she was wearing nothing more than a simple white shirt. Add on top of that that some of Karen's most ticklish spots (including her tummy, which was her second most ticklish spot after her feet) were vulnerable, and it didn't take too long for Laura to come out on top. That didn't stop Karen from putting up a fight however.<br>\r\n<br>\r\n\"Hahuhuhuhuhuh Ihihihi'm gohohonna gehehet youhuhu for this hahahahahahaha\" Karen says, tickling wherever she can get her hands on.<br>\r\n<br>\r\n\"Hahahahahahahaha whoho's the kihihid now hahahahah\" Laura gloats as she turns around to face her sister.<br>\r\n<br>\r\nLaura keeps Karen off guard by switching from tickling her ribs to moving to her armpits to her neck to her belly and back again in rapid succession, leaving Karen with no way to guess where Laura was going to tickle next. In desperation, Karen rolls over onto the floor, sending the sisters tumbling onto the ground. That backfired on her however as she had forgotten her feet had been bound by Laura. Laura climbed on top of her sister, straddling Karen, pulling her hands down to her waist and then pinning them down with her knees. Now Karen was helpless with no way off defending herself and Laura took full advantage of that, sliding her hands underneath Karen's shirt and tickling her bare belly, causing the latter to explode in laughter.<br>\r\n<br>\r\n\"AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA Y-YOUHUHU'RE HAHAHAHAHAHAHA YOUHUHU'RE GOHOHONNA PAHAHAY HAHAHAHAHAHAHA FOHOHOR THIHIS HAHAHAHAHAHA\" Karen swears, unable to get a word out without laughing her head off.<br>\r\n<br>\r\n\"We'll see about that\" Laura says, her fingers wiggling wildly over Karen's belly while Karen squirms desperately beneath her.<br>\r\n<br>\r\n\"OHOHOHO GAHAHAHAD STAHAHAHAP AHAHAHAHAHA STAHAHAHAP HAHAHAHAHAHAHAHAHAHAHAHAHA\" Karen pleads, the tummy tickling too much to take. She prayed that Laura would stop tickling there and leave her feet alone.<br>\r\n<br>\r\nUnfortunately, that wasn't the case as Laura was simply tickling Karen's tummy to tire her out so Laura would be able to tie her up. After that, Laura would be free to tickle Karen all she wanted.<br>\r\n<br>\r\n\"See what happens when you call me a kid, coochie coochie coo\" Laura taunts her older sister.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHA OKAY OHOHOKAY IHIHI'M SORRY HAHAHAHAHEHEHEHEHEHEH IHIHI'M SOHOHORREEEEEEHEHEHEY HEHEHEHEHEHEHEHEHEH\" Karen frantically apologizes, hoping it would be enough to get her sister to sop.<br>\r\n<br>\r\n\"Not sorry enough\" Laura retorts, scribbling her fingers furiously over Karen's tummy, driving the latter to tears with laughter. \"tickle tickle tickle\"<br>\r\n<br>\r\n\"AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHA\" Karen howls with laughter, screaming at the top of her lungs as she struggles and thrashes wildly, trying to get away.<br>\r\n<br>\r\nAfter a while...</span></div></div>",
            "created":1524496620,
            "id":2483421,
            "title":"Laura somehow wins!"
        },
        "1333":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "Karen finally gives up, and stops calling Laura \"kid\".",
                "Karen somehow manages to free herself! Time for revenge on the little brat!",
                "Karen still doesn't give up. Laura decides to invite her friend for help."
            ],
            "content":"<div class=\"\"><div> <span>Before Karen could do anything Laura gave another lick to her feet, making her start laughing again.<br>\r\n\"Hahahahahhahahaha stop haahahahhahaha!\"Said Karen laughing from the sensation of her sister's tongue licking her soles making her unable to try escaping<br>\r\n\"I wonder how will your toes taste like?\"Said Laura completely ignoring her sister<br>\r\n\"Don't you dare... Hahaahahahahahha! Not the tohohohes! HAahahahahaaha!\"Karen was laughing like crazy, feeling of her little sister's wet slimy tongue going between her toes was tickling her more than on the soles.<br>\r\nLaura kept doing it for about 10 minutes before giving Karen a moment to breathe.<br>\r\n\"So... are you going to call me kid again?\"She asked<br>\r\n\"You... are in real trouble now, kid... When I free myself...\"Said Karen breathing heavily<br>\r\n\"I guess you still haven't learned your lesson. Time to play more with those ticklish toes of yours!\"Said Laura interrupting her sister and at that moment she put few of Karen's toes in her mouth and started nibbling on them<br>\r\n\"Hahahaah! Nohohot the tohohoes! Stop it! Hahaahahahaha!\"Karen started laughing again<br>\r\n<br>\r\n</span></div></div>",
            "created":1400068560,
            "id":1796224,
            "title":"Karen's torture continues..."
        },
        "13332":{
            "author_id":"suasponte2005",
            "author_name":"Suasponte2005 ",
            "choices":[
                "Things get more kinky",
                "Karen invites a friend over for some more fun",
                "Karen invites a friend over but gets betrayed tying Karen up too"
            ],
            "content":"<div class=\"\"><div> <span>Karen somehow got out and tackled Laura.Karen hogtied Laura and said \"time for revenge kid\" Laura begged and said \"im sorry just please let me go\",\"never\" said Karen. Karen sniffed Lauras toes and her exhale caused Laura to giggle wiggling her cute perfect toes.Karen wiggled a finger a finger over Laura's soft wrinkle free arch causing Laura to squeal adorably with laughter,\"this is so fun\" said Karen,Laura unable to talk from the tickling.Karen sped up using both hand on both feet making Laura scream even louder.Karen then used her toes to tickle Lauras feet and then rubbed her feet against Lauras causing Laura to blush \"ill give it to you kid you have some soft feet\".Karen yet again sniffed Lauras toes giving Laura chills and then Karen licked all the from Lauras to heel to her beautiful toes making Laura beg and scrunch her toes.Karen licked all over Lauras soles for 10 minutes, Karen looked at Lauras now wet feet wiggling her toes.Laura begged saying\"please let me go now im sorry!\" Karen replied \"not yet i still havent gotten to play with these cute toes\" Laura begged and begged but was interrupted by Karen licking inbetween her toes causing her scream with laughter and then Karen put one of Lauras big toes into her mouth and sucked and licked her big toe pushing further into her mouth.With squishy pop Karen pulled Lauras drool coverd big out of her mouth and rain her finger against it causing Laura to giggle.Karen then pulled all of Lauras toes on one foot into her mouth and sucked repeating the same process as the big toe nearly engulfing Lauras entire foot while Lauras toes wiggled at the back of Karens throat.Karen suckled on Lauras foot making her squeal with laughter and in another squishy pop Lauras drool coveredfoot came out of Karens mouth. Karen then vigouously licked Lauras entire foot drenching it in saliva, Laura wiggled her toes making a squishy noise,Karen the sucked on Lauras heel making Laura squeal beg. Karen then repeated the same process on Lauras other foot and the back to other for 1 hour ,by now Laura is exhausted and Karen is aroused looking at Lauras very wet feet. Karen rubs her feet against Lauras getting her feet wet too,Karen wiggled and scrunched her now wet toes and then again sucked on Lauras tiny little toes worshipping and suckling all over Lauras soft perfect tiny feet. Lastly Karen forced Laura to worship her feet,Laura sucking on Karens adorable little toes and Karen pushed her foot even deeper into Lauras throat while Karen went all out Lauras saliva coverd feet. Karen pulled her saliva coverd foot out of Lauras mouth and wiggled her cute wet toes while having Laura lick Karens soles and suck on all of her toes ,Laura crying on the inside while she screamed with laughter from Karen tickling her wet feet with her own drool covered feet , Karen pushing her wet toes in between Lauras and scrunching her toes while sucking on her toes and Lauras at the same time.Karen licked Lauras feet and body making Laura cringe and beg and scream with laughter.Lastly Karen stuck her foot into Lauras mouth wiggled her toes pulled her foot in a squishy pop and did the same with her other soft cute foot and rubbed her wet feet all over Lauras body whilst worahipping Lauras young perfect feet. What will happen next</span></div></div>",
            "created":1536417300,
            "id":2544810,
            "title":"Karen somehow manages to free herself! Time for..."
        },
        "15":{
            "author_id":"darkblade7557",
            "author_name":"Darkblader",
            "choices":[
                "A portal opens in the living room and a kitsune comes out from it!",
                "A portal opens in the living room and a catgirl comes out from it!",
                "Laura suddenly notices that she can use magic!",
                "Karen suddenly notices that she can use magic!",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What exactly happens?</span></div></span></div>",
            "created":1397192400,
            "id":1776827,
            "title":"Something unexpected happens"
        }
    },
    "info":{
        "author_id":"darkblade7557",
        "author_name":"Darkblader",
        "brief_description":"Two sisters, Karen and Laura are left alone for the weekend. What could possibly happen?",
        "created":1397215440,
        "description":"<td align=\"left\" class=\"norm\">This item is lightly based on an item by the same name that was deleted recently because it's owner was inactive.<br>\r\n<br>\r\n<b><font class=\"size5\" style=\"\"><div align=\"center\">Rules</div></font></b><br>\r\n<br>\r\n1. Tickling is obviously allowed and encouraged!<br>\r\n2. Foot fetish is allowed and encouraged!<br>\r\n3. No sex or anything too sexual.<br>\r\n4. No tickling males(They can be ticklers, but not ticklees)<br>\r\n5. Feel free to make up your own characters to appear in the story<br>\r\n6. No short chapters<br>\r\n7. If you want to write a story with supernatural elements like magic, catgirls, genies, kitsunes and such please write it in the \"Something unexpected happens(Fantasy and supernatural scenarios go there)\" choice.<br>\r\n<br>\r\n<font class=\"size45\" style=\"\"><b>The sisters:</b></font><br>\r\n<br>\r\n<b>Karen Waters</b>: She is 14 years old. She has long brown hair. She usually wears a white shirt, and jean shorts. With white socks and sneakers on her feet. Her most ticklish spot are her feet, especially near the toes. <br>\r\n<br>\r\n<b>Laura Waters</b>: She is 12 years old. She has shoulder-length blonde hair tied in a ponytail. She wears a red hoodie and jeans. On her feet she has a pair of pink socks, and running shoes. Just like her older sister, feet are her most ticklish spot.<br>\r\n<br>\r\nI didn't describe their exact personalities to give everyone more freedom when writing!<br>\r\n<br>\r\n<font class=\"size4\" style=\"\"><b><div align=\"center\">Have fun reading and adding!</div></b></font><br>\r\n</td>",
        "id":1986206,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1599449160,
        "modified":1599449160,
        "pretty_title":"Ticklish Sisters"
    }
}