{
    "chapters":{
        "1":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "Your Mom",
                "Julie",
                "Sarah",
                "Tom or Jenny",
                "No One, It's actually your own book that you left underneath the cushion"
            ],
            "content":"<div class=\"\"><div> <span>One day, you walk into the living room to watch Tv. <br>\r\nWhen you went to jump into the chair you feel something under the cushion, you check to see what it is, <br>\r\nAnd You find a book, \"What the heck is this book doing underneath the cushion of the chair? You ask yourself. <br>\r\nJust then someone walks in and it's</span></div></div>",
            "created":1288760400,
            "id":986503,
            "title":"The Second Beginning"
        },
        "11":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "She changes you",
                "she feels you need to get closer to Julie",
                "She feels you need to get closer to Sarah",
                "she does nothing, yet....",
                "She changes herself"
            ],
            "content":"<div class=\"\"><div> <span>You notice your mom walk in. its hard not to, since she is one of the most attractive women you know. She has a perfect body, and to your disgust, alot of the guys at school comment about it. Still, she is not the most attractive woman in your family. As hard as it to believe, your aunts, Melanie and Hayley are even more attractive. You're also seen pictures of another woman with mom and her sisters, taken some time with they were in their teens, probably near Hayley's high school graduation, that is even more attractive, but you don't know who she is.<br>\r\n<br>\r\nMom smiles as she sees the book in your hands. \"Just like your uncle?\"<br>\r\n<br>\r\nYou look at her confused. \"John also found this book, when I was a little girl. Shall I show you what it is?\"<br>\r\n<br>\r\nOpening the pages, you see its completely blank. \"Blank book. Nice one mom\" you say</span></div></div>",
            "created":1289019600,
            "id":987951,
            "title":"your mom"
        },
        "111":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "turning into a girl",
                "turning into a baby",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your mom muttered something.  You started to feel weird as your body tingled.  THat was when you realized you were changing.<br>\r\n<br>\r\nYou realized you were...</span></div></span></div>",
            "created":1457408520,
            "id":2114439,
            "title":"She changes you"
        },
        "1112":{
            "choices":[
                "Puts you in her own womb?",
                "Puts you in your 16 year old sister? (It's punishment for both of you fighting)",
                "Something else "
            ],
            "content":"<div class=\"\"><div> <span>It all happened to quick to realize and the time to do realize what's going on your looking up at your mum.<br>\r\n<br>\r\nShe looks down on you picked you up and smiled then she said? I've always wanted another daughter but I want to give birth to you.<br>\r\n<br>\r\nBut I might be to old, what does she do?</span></div></div>",
            "created":1472552100,
            "id":2203647,
            "title":"turning into a baby"
        },
        "115":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Sure, and mom changes you so you can use magic",
                "Umm, no thanks",
                "You're too freaked out to respond"
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry, I forget sometimes you can't read it. You see, I'm a witch\"<br>\r\n<br>\r\n\"Yeah right' you mutter, wondering what she is up to. While she is fairly cool, mom can be weird sometimes....<br>\r\n<br>\r\n\"I see you don't believe me. Guess I'll have to demonstate\" mom chuckles. You turn around to give her an answer, but no sound comes out. Mom's normally blond hair, is brown. No way she could have colored it.<br>\r\n<br>\r\n\"Normally disbelieving children are fair game, but i don't want you to feel freaked out, Mat. Do you want to have, or at least try magic?\" mom says, grinning</span></div></div>",
            "created":1289278800,
            "id":990385,
            "title":"She changes herself"
        },
        "1151":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You agree",
                "You demand her to change you back",
                "You run off. Mom's old photo makes sense now...."
            ],
            "content":"<div class=\"\"><div> <span>\"Sure, I'd love to try it\" you say immediately. Since mom hasn't done anything to you, you know it can't be bad. Plus you want to give both Julie and Sarah a nice surprise.<br>\r\n<br>\r\n\"Sure?\" mom says, giggling. <br>\r\n<br>\r\n\"Yes. How do you give me powers anyway?\" you add.<br>\r\n<br>\r\nMom smiles. You have powers already, but I just need to make them more, umm accessable\". She then summoms something, and it hits you directly, making you feel weird.<br>\r\n<br>\r\n\"What do you mean? What did you do to me?\" you demand.<br>\r\n<br>\r\n\"I should have mentioned that only girls can work magic\" mom shrugs, trying to surpress her laughter. <br>\r\n<br>\r\n\"MOM! You should have explained that part first\" you scream, in an increasingly higher voice voice. Looking down, you see that you're almost completely changed into a girl version of yourself. A few seconds later, the transformation is complete.<br>\r\n<br>\r\n\"Okay, honey. I'll get you some new clothes, then I'll teach you whatever you want to know\" mom offers. You look at her, furious that she 'tricked' you into becoming a girl. </span></div></div>",
            "created":1289624400,
            "id":993103,
            "title":"Sure, and mom changes you so you can use magic"
        },
        "11511":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Introduce you to your sisters.",
                "Show you the flame test."
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I got this far.\" you said, rolling your eyes. \"I might as well play along.\"<br>\r\n<br>\r\nMom giggled. \"Don't worry, I'll change you back before you have to go back to school.\" she promised.<br>\r\n<br>\r\n\"It's Friday afternoon!\" you protested. \"Are you saying that you're going to keep a girl all weekend!?!\"<br>\r\n<br>\r\n\"Well, you can't expect to learn much magic in just one afternoon.\" said mom, grinning. \"Besides, you look cute this way.\"<br>\r\n<br>\r\nYou glared at mom, angry with her, but it got you nowhere so you finally sighed in surrender. \"Fine.\" you said. \"Just don't make me all girly.\"<br>\r\n<br>\r\nMom shook her head. \"Sorry, Mat.\" she said. \"You know I do not allow tomboys in this house...\"<br>\r\n<br>\r\n\"No way am I wearing a dress!\" you yelled, alarmed.<br>\r\n<br>\r\nMom sighed, patiently. \"You will have to, at least, wear a skirt.\" she said.<br>\r\n<br>\r\n\"How about a pair of skorts.\" you suggested, more calmly.<br>\r\n<br>\r\nMom shook her head. \"It's either skirts or dresses.\" she said, firmly. \"I can not play favorites.\" she then frowned. \"If you do not pick, I will have to pick for you.\"<br>\r\n<br>\r\nOf course, unknown to you, mom did not want to force you. She was hoping that she could draw out the curious side of you so that you would willingly put on a skirt and, eventually, a dress under your own free will. \"What shall it be?\"<br>\r\n<br>\r\nKnowing that your mom was serious, you let out a low sigh, tearing up. \"This is so humiliating!\" you whispered.<br>\r\n<br>\r\n\"A girl wearing a skirt or dress is far from humiliating, Mat.\" said mom, seriously. \"Do you seriously think we girls would wear something that made us feel uncomfortable?\"<br>\r\n<br>\r\n\"I guess not.\" you said, blushing. \"But I have the mind...\"<br>\r\n<br>\r\n\"The mind of a boy, yes, I know.\" said mom, interrupting. \"But this is the only way for you to try your hand at magic.\"<br>\r\n<br>\r\nYou weighed the options in your mind then, slowly, reluctantly, nodded. \"I'll wear the skirt.\" you said, finally, grudgingly. \"But that's as far as I'll go. I'm trying magic here, not the life of a girl.\"<br>\r\n<br>\r\n\"It comes with the package, Mat.\" countered mom. \"By the way, we will need a new name for you while you are a girl.\"<br>\r\n<br>\r\n\"A new name?\" you asked, looking sick. \"What for?\"<br>\r\n<br>\r\n\"Witches have to keep a low profile, Mat.\" explained mom. \"As you said, you had come this far...\"<br>\r\n<br>\r\nYou sighed, again rolling your eyes. \"Okay, what did you have in mind?\"<br>\r\n<br>\r\n\"Oh, you want me to pick?\" asked mom, grinning. \"Thank you!\"<br>\r\n<br>\r\nYou turned white with shock but before you could protest, mom asked, \"What do you think about Mary Lucy Harrison?\"<br>\r\n<br>\r\n\"Fine.\" you said, sighing again. \"It's just for the weekend, right?\"<br>\r\n<br>\r\n\"I never break my word, Mat.\" said mom, smiling. \"You will be a boy again before you go back to school.\"<br>\r\n<br>\r\nYou shrugged, knowing that there was no out of this now and asked, \"So, what do we do first?\"<br>\r\n<br>\r\nMom giggled then changed your ill fitting boy's clothing to a skirt and blouse combo. \"First, I will...\"<br>\r\n</span></div></div>",
            "created":1290574800,
            "id":1000358,
            "title":"You agree"
        },
        "1153":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "Mom wanting to comfort you",
                "Sarah wanting to play with you",
                "Julie wanting to see you"
            ],
            "content":"<div class=\"\"><div> <span>You just stand there in complete and utter shock, \"See? I wasn't lying to you Mat\" Mom says as she changes her hair back to Blonde,<br>\r\n<br>\r\n\"Y-You are a Witch\" You say backing up terrified by what she may be capable of. Mom then says, \"Do not be afraid Mat, We won't hurt you\"<br>\r\n<br>\r\nYour eyes then go wide, \"W-Who's \"We\"?\" You ask, \"Don't be alarmed, but I'm not the only one that's a witch, every girl in our family is a witch or will be\" Mom says, \"You mean you, Sarah, Julie, Grandma, Aunt Haley, Aunt Mel, Brooke, and their kids are or will be witches?\" You ask in fear,<br>\r\n\"Yes Mat That's correct\" Mom says. You run straight up to your room in fear and close the door and lock it, \"I can't believe it I can't believe it I can't Believe\" You say rocking back and forth on your bed, \"My family is a group of Witches\" Suddenly, someone knocks on the door. Who's at the Door?</span></div></div>",
            "created":1412294700,
            "id":1865541,
            "title":"You're too freaked out to respond"
        },
        "11531":{
            "author_id":"pony-mike",
            "author_name":"Pony.Mike",
            "choices":[
                "Learning to graze is an art...",
                "Suddenly horrified at the thought of becoming...",
                "Sarah adds her own chanting...",
                "Reader's choice, to twist and turn the plot..."
            ],
            "content":"<div class=\"\"><div> <span>\"Knock, knock, Mat please, it was time that you were told. I can realize this comes as a shock, it was to your father, Lord rest his soul!\" Dear mom said, as inside your room you sat on your bed and feared then your whole family.<br>\r\n<br>\r\n\"So what of Grandma, Aunt Mel, or Auntie Haley, if they are witches, do they have or are they part of a coven?\" You asked, as outside your bedroom door a mother, your mother begins to laugh.<br>\r\n<br>\r\n\"What is so funny,\" you asked? <br>\r\n<br>\r\n\"Just a thought posed by your sister Sarah this morning, she asking if with some help by Grandma, that she would wish for you to play with her today. You recall at her last birthday party, the western costume Auntie Haley gave to Sarah, and since then she has plagued me with wanting a pony to ride, all while she wears her cowboy hat leather skirt, and six gun.<br>\r\n<br>\r\nWell, this morning, Sarah came to the breakfast table dressed in her western adventure getup, and asked nicely, if I would change you to be for her today as a pony. I think considering your present state of mind, feeling a general dislike for your family, that maybe a day or two of you being an animal might curb your feeling so defiant.<br>\r\n<br>\r\nMat, let me in and we shall speak about what you feel,\" Mom said, but her words worked to intimidate your feelings of disdain.<br>\r\n<br>\r\n\"Mat, Mat, open this door!\" Mom said, as she ceased then her knocking.<br>\r\n<br>\r\nOutside, as in the hallway you can hear your mother talking, as well Sarah was speaking to mom as well.<br>\r\n<br>\r\nIn that fated moment your body begins to feel all itchy, as you start to scratching, you gain an idea, a thought, wishing you were outside the house, on the backyard lawn, and there munching, you grazing...</span></div></div>",
            "created":1554219660,
            "id":2638615,
            "title":"Mom !"
        },
        "115313":{
            "author_id":"pony-mike",
            "author_name":"Pony.Mike",
            "choices":[
                "Appreciative of friends...",
                "Sarah wants you as lustier...",
                "Readers' choice..."
            ],
            "content":"<div class=\"\"><div> <span>Chanted words make for a spellbinding, as of a curse what changes that who was born a human, to transition, becoming then an animal, an equine, a pony stallion!<br>\r\n<br>\r\n\"No, no, no..., what, oh Mom what are you doing to me?\"<br>\r\n<br>\r\nAsking while knowing, hearing then of sister Sarah chanting, doubling the spellbinding, making what Mom began to shift, enhance, and cause her brother pain.<br>\r\n<br>\r\nSarah's spell hit the gut and the hell-hot pains spiraled from there to encompass the whole of the body, arms, legs, and no changes done to the mind. She wanted her brother as alert, awake, knowing of his physical demise.<br>\r\n<br>\r\nMom was loving of her children, though more so of her daughters, and kindly toward you. As what you knew was occurring, to soon becoming profoundly undeniable, if done by Mom the duration would be short lived. Your sister wanted her brother as a pet, demeaned in the extreme. She had said often of her wish to degrade, dehumanize, as humiliate you in any way she was allowed by Mom, or with the help of other of her friends.<br>\r\n<br>\r\nJust about then the Caucasian color of your skin began to grow darker, as continued to darken, becoming a deep hue of charcoal black. As with black skin grew quickly your pelt of black Dartmoor brown body fur. The sudden sensations from becoming furry were arousing in many ways, the wildest being between your legs.<br>\r\n<br>\r\nMoaning from the feelings, seeing growth, a new maturity, as the scrotum swelled and the male member extended, it swelling of new girth, gaining many inches of new length. What was your handy maleness became in just minutes as something a pony stallion would feel pride for letting it hang or stretching it stout.<br>\r\n<br>\r\nThe only real ouch' feeling came when the tailbone protruded, as flourished, sprouting coarse feeling hairs what swished, tickled, and felt then as something quite nice.<br>\r\n<br>\r\nThen your pelvic region knew changing, thighs and buttocks became as equine their contours. A hunching of the legs became as hind legs, while heels changed to stronger hind hocks, feet grew longer, and toes merged to form new single toed hoofs. Your body changed in a flow of devilish directed power, as in the outer hallway you heard Sarah laughing of glee.<br>\r\n<br>\r\n\"Unlock the door dear, do it before your hands change into hoofs and I must damage the door to let us come inside your bedroom.\" Mom said, as Sarah continued her laughing.<br>\r\n<br>\r\nReluctantly, the twist of the hand did the unlocking of the door. As Mom opened the door, she seeing how you had changed, caused her to turn and glare an angered stare at Sarah.<br>\r\n<br>\r\n\"What is this, Sarah you enhanced my spell, and changed your brother...\"<br>\r\n<br>\r\nYou knew you were becoming an equine, as that was what Sarah wanted to have you play the part of being her pony mount. The expected changed of your body would if Mom did it, not then cause your genitals as change of more than color. What you had as extended and changed, looked wholly equine of color, contour, and length. Mom knew from what she did to Dad, when seeing how his genitals changed, conforming to his new species, he then not capable to revert back to being human anytime soon.<br>\r\n<br>\r\nA wriggling feeling as the shoulders realigned, arms became as forelegs, wrists as fetlocks, and hands changed into hoofs. While then the transitions moved upward, growing a longer neck, a mane, and began conforming of a human skull to being equine.<br>\r\n<br>\r\nAs if your skull seemed to soften, bone shifting, your jaw and teeth ached only to think more of how your lips and nose merged to form then a muzzle. As eyes moves and became huge, ears trailed higher on your head, and that perfect smile your teenage braces made, changed positions, as a gap formed to allow the use of a bit and bridle to keep the animal of you as within the control of the rider.<br>\r\n<br>\r\n\"NEIGH...,\" you whinnied as cried aloud, announcing then to Sarah, she had gained the ownership of a pony for her to ride.<br>\r\n<br>\r\n\"Sarah, for shame upon you, what is this I see here, your brother as so changed!<br>\r\n<br>\r\nI told him his degraded self was for two days, not two years, and your enhanced spellbinding, keeping him as equine his species, while growing bigger as you grow, keeping him captive for you as your private mount!\" You heard and understood Mom rebuking your sister, but Sarah laughed,, she ignoring Mom for some odd reason.<br>\r\n<br>\r\nHoovering in your upright stance the urge to become as if born an equine, and you fell forward, landing as walking on all fours, you then feeling as if you were a real animal.</span></div></div>",
            "created":1554816720,
            "id":2642514,
            "title":"Sarah Added Her Spellbinding"
        },
        "1153132":{
            "author_id":"pony-mike",
            "author_name":"Pony.Mike",
            "choices":[
                "The rush of urges come...",
                "Training times ahead",
                "Mom is upset...."
            ],
            "content":"<div class=\"\"><div> <span>\"Dan, I shall want him to mentally remain as knowing he was Dan, my brother, being as well my pony, and in time my horse.\" Sarah said, she speaking to Mom, but knowing Dan could understand what all was said.<br>\r\n<br>\r\nDan stood there seeing her smile, through with watching of Sarah, she was fiddling with what looked like a black ball held securely between her cupped hands. As Mom turned to leave Dan in his new miseries, she saw then too what Sarah held, it a whirling ball. Dan and his enhanced hearing ears heard Sarah muttering her words, she speaking to a legion of those creatures from Hell. <br>\r\n<br>\r\nMom then wrestled with Sarah to give up what she held, but she walked to and fro, as she waited, until ready for Dan to know as him and he being Sarah's to enjoy.<br>\r\n<br>\r\n\"Yes Dan, as with these my darlings let loose, they shall gift you to knowing both your inner and deepest desires, and of those common to a male equine! <br>\r\n<br>\r\nNow fly, rise up and grace him with all that makes my brother Dan a worthy stallion, as a stud. Know all that he is mine and I see for  him as my desire of him and a long life doing his sister and master's personal thrills. Yes, oh yes, a little more muscle added on his rump, and I think your work for tonight is done!\"<br>\r\n<br>\r\nAs Hellish sulfur smoke cleared the new stallion pony took one step toward his owner. Then he stopped and turned to see his entire self reflected by the full-length dressing mirror hung on the closet door. Standing there as staring is awe, looking a mature pony form, he black as the sin in his dear sister's evil heart.<br>\r\n<br>\r\nUnderstand me brother, you are an animal now, and shall be for as long as I live my life!\"<br>\r\n<br>\r\nHearing Sarah, standing like a furry statue, gawking at the bedroom closet mirror, the reflection, stood with his same color of eyes peering back at him, Dan realized his black pony self as being his new, permanent embodiment. He eyed too at his thick mane drooped over his long neck and about strong shoulders as he saw tall ears, round eyes, wide nostrils and lips of his muzzle for to graze; rather than plant a kiss.<br>\r\n<br>\r\nBending his broad neck to look and take inventory downward his eyes about fell from their sockets. His youthful torso was looking as beastly stout and very strong. Dan forgot Sarah for that moment, and stood thinking, eyeing what was his hind legs, gaining an odd sense of appreciation, knowing of how much stronger they were then of his human legs.<br>\r\n<br>\r\nThe whirling cloud of devils did more to changing his pony self, adding to his fetlocks of each leg of feathering hairs grown above each hoof, and how his long feet with short legs gave him the stocky look of a pony. <br>\r\n<br>\r\nA swish of his tail reminded Dan of how nervous he felt, worried of how his spiteful sister would treat him. He craned his neck to look back as seeing in the mirror as he sidestepped, turning his bulky self, Dan saw his tail, as felt the coarseness of the hairs draped over what felt sensitive, it puckered larger, protruded, not hidden. The whisking of the coarse tail hairs across a sensitive part of his changed anatomy, breed a small grin of sensual satisfaction what Sarah noted on his muzzle.<br>\r\n<br>\r\nThe Legion of devils had done their duties, if more in favor for Dan the doomed human, leaving him feeling enthralled of his changed self. As they knew and inspired Dan to realize, he having a fun feeling, watched with delight when seeing and feeling his sheath stirring, the larger, as black, pony stallion male member stretching to rise from out the sheath and hang into the light of day. <br>\r\n<br>\r\nSome heavy breathing worked to inspire adding length to the stoutness, arousing what a hour previous if asked Dan would have pleaded of not ever being changed to be a pony for the fur thrill of his sister Sarah.<br>\r\n<br>\r\nBlack hoofs stomped at the parquet wood floor of his bedroom, as a young stallion was feeling an urge to spread his seed. As what he liked became hard and stiffer, the sensual urges brought on new desires, preferring mares rather than girlfriends. Mom had walked away, she leaving Dan and Sarah facing each the other. Sarah noted with a disdain feeling the growing delights her \"Ponified\" transformed brother stood before her with him feeling hornier.<br>\r\n<br>\r\nSuddenly all fear and doubting was gone as Dan stood gallant, he happy, felt like a real born stud, as then stepped forward and sniffed at Sarah, mimicking what a stallion would do if near to a mare.<br>\r\n<br>\r\n\"You come with me, do as I say, or expect to feel my wrath!\" Sarah said, but Dan did not change his stance or try to house back his swinging delight.<br>\r\n<br>\r\n\"You must calm yourself and go reside in either a corral or the stable, living there with horses and other ponies as for now!\"<br>\r\n\"Remember sir be careful!\" said the man.<br>\r\n<br>\r\n\"Careful, as those here can do you of injury or worse. Your changed pony body will ache for finding a female companion. As your are of strong bones, solid muscles, a summertime seasonal coat of hair, you shall know what it is to feel a rich sexual drive of both equine and human while being a pony. The reproducing drive is what you must be mindful of most. To be a human and become a virile stallion will be a distraction the like of is now your life. <br>\r\n<br>\r\nPent up in your stall, whether by night or on a rainy, stormy day, your lions may need a release! <br>\r\n<br>\r\nIn time, as after some months of training to accept a rider, when that masculine urge arises, then I might allow you to meet and mount one mare. If you respond favorably to breeding with mares, then the mountings would increase to an additional three. So say you mount four pretty mares during a day, this could become bad, as the legion foretold, most who were born to being human, usually lose some or all human connections to their past. <br>\r\n<br>\r\nOnce lost, you can not change back! <br>\r\n<br>\r\nIf lost in part only part of you may change back, then to live as a creature in the sideshows. So I suggest you try your first outing in a lonely field, or a private barn,\" explained Sarah.<br>\r\n<br>\r\n</span></div></div>",
            "created":1554826620,
            "id":2642569,
            "title":"Sarah wants you as lustier..."
        },
        "12":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Smaller than before",
                "A child again!",
                "A Girl!",
                "Feeling Very sick",
                "In Girl's Pajamas"
            ],
            "content":"<div class=\"\"><div> <span>    It is your older Sister Julie when she was your age she went and disappeared for about a year, but came back one year later at that time however you were far too young to understand what was going on at that time. She looked at you and saw that you were holding a magic book. At that time she didn't know whether you could read it or not so she  was extremely cautious. <br>\r\n<br>\r\n \" Mat, Where did you find that book?\" Julie asked.<br>\r\n<br>\r\n \" It's just a book I found in the couch when I was about to watch some television.\" you replied to Julie. She still had yet to understand if you had read the book or not. As far as she could tell from the words you had just found the book.<br>\r\n<br>\r\n   \" Did you read any of it Mat?\" Julie said with a look of concern and worry.<br>\r\n<br>\r\n \" Like I'm gone read some girly garbage magic book! Believing in magic is for losers.\" You replied unaware that your comment offended her. <br>\r\n<br>\r\n  \" You will regret those words Mat. That's my book could you please give it back?\" Julie said.<br>\r\n<br>\r\n \" You are one of the losers believing in magic? No way it's real here you could have your stupid book back.\" You say as you toss it. Julie manages to catch the book but looks disappointed at your disrespect for the book. She then leaves to her room and your left alone for the rest of the day.  Eventually you go to your room and begin to go to sleep for the night. When you wake up the next morning however you began to notice that you were....</span></div></div>",
            "created":1472747160,
            "id":2204600,
            "title":"Julie"
        },
        "13":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "You turned into Sarah",
                "Your now a 7 year old girl",
                "You now think your Sarah and Sarah is you",
                "Something Else",
                "You think you're Sarah"
            ],
            "content":"<div class=\"\"><div> <span>\"Hi Mat\" A cute yet slightly bratty voice says. It's Sarah, <br>\r\n\"What is it Sarah?\" You ask, \"Can you play with me?\" Sarah asks, <br>\r\n\"Not right now\" You say. Suddenly, Sarah gets an idea, \"I want to do something to you\" she says, <br>\r\n\"What's that?\" You ask in confusion. she chants a spell then suddenly.</span></div></div>",
            "created":1288933200,
            "id":987704,
            "title":"Sarah"
        },
        "131":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "Tell Sarah you'll play with her",
                "Use some of your science to make Sarah forget your secret",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You notice you're starting to turn into Sarah, But you surprise her by saying, \"I don't think so Sarah\" Then you return back to your normal self, But Sarah realizes you learnt chaotic science, \"Don't tell mom\" You tell Sarah, But she gets a big grin on her face then takes off singing, \"I know a secret I know a secret\" You decide to.</span></div></div>",
            "created":1289192400,
            "id":989933,
            "title":"you turned into sarah"
        },
        "1311":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "Pretend to be Sarah",
                "Use your chaotic science to return to normal",
                "Ask Julie or mom to return you to normal"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay. okay. okay. I'll play a game with you Sarah.\" You say with a sigh, \"Okay, I think I know what to play.\" Sarah says giggling. <br>\r\nYou see you're starting to turn into Sarah again, \"It's my turn\" Sarah says then you watch as she turns into you, <br>\r\n\"Now you're going to pretend to be Sarah, and if you don't, I'll tell mommy that you've been learning to use Chaotic Science.\" The new Matt says giggling which sounds real disturbing in your voice. What do you do?</span></div></div>",
            "created":1292994000,
            "id":1020180,
            "title":"Tell Sarah You'll play with her"
        },
        "13111":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You run into Sarah's or now your bedroom, to mess up her life",
                "You go to your lab (the lab recognizes who you really are)"
            ],
            "content":"<div class=\"\"><div> <span>Sarah's bratty attitude is driving you crazy. Quickly ignoring her, or rather him, since she foolishly turned herself into a copy of you, hence removing her own powers, you say, \"Really? You forgot one thing princess. You're a <i>boy</i> now. <i>Boys</i> don't have magic. <i>You </i>have no idea how my science works, or even how to get into my lab. Go tell mom, that you tried to blackmail me, and switched us, but she won't believe you, <i>Mat</i>. After all, I'm mommy's little girl\" you say sweetly, a girlish grin on your face. \"Maybe this won't be too bad\" you think, wondering how to ruin Sarah's life before returning to yours.<br>\r\n</span></div></div>",
            "created":1292994000,
            "id":1020383,
            "title":"pretend to be Sarah"
        },
        "13112":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You made it, you drink it!",
                "Go to your room!"
            ],
            "content":"<div class=\"\"><div> <span>You shook your head, grinning at Sarah. \"You are an idiot, sis.\" you said, calmly. \"Just how do you intend to switch back to your female self now that you are a boy?\"<br>\r\n<br>\r\nSarah paused, thinking. \"I don't know.\" she said to your sigh.<br>\r\n<br>\r\n\"Boys can not work magic, Sarah.\" you reminded her. \"You just threw your powers away for some stupid prank.\"<br>\r\n<br>\r\nSarah, now realizing her mistake, began to panic. \"You... you're a girl now.\" she said. \"You have magic, you can change me back.\"<br>\r\n<br>\r\nYou shook your head. \"I don't understand how your magic works, sis.\" you said. \"Even if I did have it, it would take time to learn enough to safely change either of us back.\"<br>\r\n<br>\r\nSarah, looking like you, began to cry. Seeing you conjure a serum vial, 'he' completely panicked. \"Get that stuff away from me, who knows what it will do!\"<br>\r\n<br>\r\nYou were about to tell Sarah that it was an emergency counter effect serum that would restore Sarah to her original self<br>\r\n<br>\r\nHis scream caught mom's attention and she ran up with Julie right behind to see 'Sarah' holding a vial of what she assumed to be a potion, with a terrified 'Mat', cringing on the couch. \"Just what were you planning to do, young lady?\" she asked you, scolding. \"We were not going to reveal the family secret to your brother until tonight.\" she paused, noticing and taking the serum vial away from you. \"Did you make this potion?\"<br>\r\n<br>\r\nYou nodded, not wanting to tell her it was a serum, and mom slowly shook her head, clearly disappointed with 'Sarah'.<br>\r\n\"Young Lady...\"<br>\r\n <br>\r\n</span></div></div>",
            "created":1293080400,
            "id":1021113,
            "title":"use your chaotic science to return to normal"
        },
        "131121":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "John gave me a present, which I just drank",
                "Sarah switched us"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm really disappointed with you. Your brother wasn't supposed to find out our secret until tonight. Why couldn't you wait four hours?\" mom says. \"Young lady. You made it, you drink it!\"<br>\r\n<br>\r\nSecretly you're pleased, as long as the fact its a serum doesn't come out.\" Slowly you open the bottle and drink it. Mom looks at you, frowning, even though she is sightly unnerved how readily you drank it. \"What will that do?\"<br>\r\n<br>\r\n\"Turn me back\" you say, as you swiftly turn back to your true form. Mom looks at the two Mats. Mom looks at you both annoyed. \"What is going on? Tell me the truth, or you\" pointing to Sarah \"will be a little boy, and you will be back being 'Sarah' you won't know what hit you\"</span></div></div>",
            "created":1293080400,
            "id":1021161,
            "title":"You made it, you drink it!"
        },
        "1311211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "John arrives.",
                "After John comes and leaves."
            ],
            "content":"<div class=\"\"><div> <span>Hearing your excuse, mom paled then turned red with annoyance. \"Your uncle John gave you that?\" she asked.<br>\r\n<br>\r\nYou nodded and she placed a light hand onto your head, staring deep into your eyes. A moment later, she scowled and walked away from you and picked up the telephone, turning to Julie. \"If either of them moves, reduce them to three year olds.\" she said, angrily. \"I need to make a call.\"<br>\r\n<br>\r\nMom's words chilled you to the bone as you looked up to a stern Julie, who said nothing but watched you and your 'twin' like a hawk. Then, mom began to speak, rather scream, into the phone.<br>\r\n<br>\r\n\"How <i>dare</i> you give my son your science, John!\" she screamed, clearly angry. \"I told you on his twelfth birthday that I would not have him go through the same nightmare you did, earning the right to keep that pseudo magic!\" she paused, taking a few labored breaths. \"When did you give him the lab and the book!?... WHAT!!??!!...\"<br>\r\n<br>\r\n\"Mommy's angry.\" said Sarah, cringing, still looking like you.<br>\r\n<br>\r\n\"You think!?\" asked Julie. \"It took uncle John three years or torturous tests and trials to earn his right to keep his powers and be accepted as a pseudo witch.\" she looked at you, her face softening a little. \"This was not your fault, Mat but I seriously do not think mom will let you keep your science.\"<br>\r\n<br>\r\nYou moaned, wishing that you had said something else...<br>\r\n<br>\r\n\"I want you over in five, John, do you understand me!?!\" she raged. \"You will come and get that accursed lab and book out of my house!!\"<br>\r\n<br>\r\nShe then slammed the receiver down and turned to Julie. \"Please restore Sarah and take her to her room.\" she said, far more calmly. \"I need to have a talk with Mat.\"<br>\r\n<br>\r\nJulie nodded and magically restored Sarah to her original form before escorting her out of the room. you watched them leave, then turned back to mom, frightened. \"Am I in trouble?\" you asked.<br>\r\n<br>\r\nMom sighed. \"No, honey.\" she said. \"I don't blame you for this but you are going to be having a few very rough days.\"<br>\r\n<br>\r\nYou swallowed hard, wondering what mom meant by that.<br>\r\n</span></div></div>",
            "created":1293080400,
            "id":1021171,
            "title":"Your story backfires."
        },
        "13112111":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "the duel",
                "you're too busy to watch, since Julie/Sarah wants a duel of their own...."
            ],
            "content":"<div class=\"\"><div> <span>You're not surprised that John arrived one hour early. He looks at you appologetically. \"Sorry Mat, since you got into the crossfire. Hannah deep down loves the idea of the science, but she is afraid for you. What's the reason she's pissed off\"<br>\r\n<br>\r\nJulie and Sarah decided to watch mom's exchange turn to John. \"Did you know mom was going to be this angry?\"<br>\r\n<br>\r\n\"Yes. Before you blame me, I'll tell you something I didn't tell your mother. I was ordered to give it to Mat\" john says seriously.<br>\r\n<br>\r\n\"Why?\" you stammer.<br>\r\n<br>\r\n\"I've had the science for 29 years, 28 of them known to the witches, but they still can't figure it out how it works. Although it was briefly considered that a witch in our family should be transformed into a boy, then taught it, that idea was considered a bad one. Hayley decided that the knowledge should be passed on to one boy in our family, the one both she and me thought the most capable. That's you, Mat.\"<br>\r\n<br>\r\n\"Are you okay?\" Julie asks concerned. John laughs. \"Yes, I'm not dying, if thats what you're worried about. Least not yet\"<br>\r\n<br>\r\n\"You might be\" Julie says, looking over. You, Sarah and John look over and see mom approach looking very angry.<br>\r\n<br>\r\n\"I want that out of this house, brother, or I'll do something to you that I haven't done since I was a kid. I wonder what my sis looks like all grown up\" mom warns.<br>\r\n<br>\r\n\"Go ahead, sis\" John says. \"Bet the kids haven't seen a duel before, but you're forgetting something. You haven't beaten me in a  one on one duel in 27 years\"</span></div></div>",
            "created":1294117200,
            "id":1028691,
            "title":"The arrival and arguement"
        },
        "131121111":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You break up the fight.",
                "You freeze, seven year old 'Jane'."
            ],
            "content":"<div class=\"\"><div> <span>You and your sisters watched in both awe and terror as John summoned a pyrokinetic flame to his hand and mom conjured a magical flame to hers. The two circled each other slowly, revealing nothing in their expressions, as the duel began and they started to exchange energy blasts. John was fast with his attacks but mom effortlessly dodged them, throwing attacks of her own while defending.<br>\r\n<br>\r\n\"Mom is good.\" you whispered, seeing her fight. \"How can she move so fast on high heels?\"<br>\r\n<br>\r\nJulie smiled. \"Practice.\" she replied, quietly. \"Maybe later, I'll give you some lessons.\"<br>\r\n<br>\r\nSarah giggled at that but you ignored them, worried for mom and uncle John. <i>\"My family is tearing itself apart over my having this power.\"</i> you thought. <i>\"What am I going to do?\"</i><br>\r\n<br>\r\nUnknown to you, Hannah had learned of your power over a week ago and had throttled John at his home before dragging him before the witch court where she learned that John was ordered by them to pass his knowledge on to you.\"<br>\r\n<br>\r\n\"We are sorry we did not involve you in this decision, Mrs Cutie.\" said Hayley, the head of the witch council. \"Mom, err, the head witch, saw Mat as the most worthy to receive John's knowledge so we can study how it works and why.\"<br>\r\n<br>\r\n\"So, you decided that my son should be your little guinea pig!?\" asked mom, furious.<br>\r\n<br>\r\n\"Not a guinea pig, Hannah.\" said Natalie, appearing in the room. \"The first to be freely given the title of pseudo witch as only boys deemed worthy by me and the council shall receive the knowledge.\"<br>\r\n<br>\r\n\"However, as Mat learned his chaotic science, becoming a pseudo witch, we have been watching carefully his progress, learning how it works.\" said Hayley. \"We were all shocked and relieved to discover that it mirrors magic. the only real difference is the requirement of a high tech laboratory to train as the power is science based.\"<br>\r\n<br>\r\nReturning her mind to the present, mom locked hands with John, sharing an unseen smile. \"What do you think, sis?\" asked John, quietly. \"Win or lose?\"<br>\r\n<br>\r\nHannah grinned. \"I can't lose in front of my daughters, bro.\" she whispered.<br>\r\n<br>\r\nTo you, mom and John were struggling, sending random spells and events, technological spells, all over the room. Fortunately, Julie, being a fully trained witch, had a magical shield up, protecting herself as well as you and Sarah.<br>\r\n<br>\r\n\"This is getting intense.\" she whispered. \"If they both get angry...\"<br>\r\n<br>\r\n\"The failsafe will be triggered.\" said Sarah with a moan. \"Can you handle two fighting three year olds, Julie?\"<br>\r\n<br>\r\nJulie shook her head. \"My magic is not strong enough to override the failsafe.\" she said. \"We'd have to call either grandma or great aunt Catherine to do it and I doubt they'd be in any hurry.\"<br>\r\n<br>\r\nAs you continued to watch with your sisters, mom and John continued to talk. \"If he doesn't interfere soon, I'll have to make you my 'little' sister for a while.\" whispered mom, playfully.<br>\r\n<br>\r\n\"Well, lets hope he does.\" replied John, whispering as well. \"Otherwise, Megan will never let me live it down.\"<br>\r\n<br>\r\nThe duel, as you noticed, escalated even more as mom and John broke free from each others grasp and started to throw more powerful spells. <i>\"This is getting out of hand!\"</i> you thought, tearing up. <i>\"I have to do something!\"</i><br>\r\n</span></div></div>",
            "created":1294117200,
            "id":1029046,
            "title":"Your first test."
        },
        "1311211111":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "A 16 year old girl.",
                "A six year old girl."
            ],
            "content":"<div class=\"\"><div> <span>Making your decision, you ran out from behind Julie's magical shield before she could stop you and fired a weak lightning bolt between uncle John and mom. You were only as powerful as a witch your age, maybe a little more as you had been trained to resist and fight against magic. Still, you were no match for a fully trained witch but the situation demanded you be bold and interfere.<br>\r\n<br>\r\n\"You two are fighting like a pair of three year olds!\" you raged. \"Keep it up and you'll trigger the failsafe, making you real three year olds, and we'll all have a mess on our hands!\"<br>\r\n<br>\r\n\"This is not your place, Mat.\" scolded mom. \"Your uncle John and I...\"<br>\r\n<br>\r\n\"Are fighting over <i>my</i> powers!\" you interrupted, annoyed. \"True, John gave me the lab and the book but it was my choice to study it!\" you thought for a moment, then smiled. \"Besides, <i>if</i> I was not permitted to have this power, you would have stopped me the second you sensed the ignition of my pseudo magic.... this was test, wasn't it?\"<br>\r\n<br>\r\nMom and John smiled. \"He got it right off the bat, sis.\" said John. \"His sisters will have their hands full with him.\"<br>\r\n<br>\r\n\"Congratulations, Mat.\" said Mom, giving you a quick hug. \"Yes, this was a test to see if you would step in to prevent a rift in the family. The council has deemed you worthy to the title of pseudo witch but, don't fool yourself, more tests will come and they will be harder each time.\"<br>\r\n<br>\r\n\"Just like the tests all witches must take.\" you said, guessing correctly.<br>\r\n<br>\r\nMom nodded. \"Where John had to literally fight to become accepted by the council as a pseudo witch, they chose you to have this power.\" she said. \"Though these tests will be more harsh than those given to true witches, you will have it much easier than your uncle did.\"<br>\r\n<br>\r\n\"Well, where do we go from here?\" you asked.<br>\r\n<br>\r\nJohn grinned in a way that you knew he was going to cause you trouble. \"You passed the test but...\"<br>\r\n<br>\r\n\"But what?\" you asked, taking a step back.<br>\r\n<br>\r\n\"You still need to build some resistance to magic.\" said mom.<br>\r\n<br>\r\nBefore you could react, Julie, who had lowered her shield, hit you with a spell at mom's silent command and you immediately felt yourself changing. \"Mom!\" you screamed, alarmed. \"This is not fair!\"<br>\r\n<br>\r\n\"Had you kept your guard up, you would have sensed the attack coming, Mat.\" countered John, smiling. \"I learned that lesson the hard way too.\"<br>\r\n<br>\r\nYou looked down at yourself and realized, to your horror, that you were becoming...<br>\r\n</span></div></div>",
            "created":1296363600,
            "id":1044701,
            "title":"You passed the test but..."
        },
        "1311211112":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>You freeze in fear to even be able to try and stop the battle, \"Oh no Mat's not doing anything\" John whispers to your mom nervously, <br>\r\n<br>\r\n\"I guess Jane is making her return\" Mom says giggling then throws a pink magical blast at John, John starts getting smaller, and younger <br>\r\nbecoming seven years old and starts to turn into a little girl. her hair gets put into two cute pigtails, and her clothes becomes a pink shirt. <br>\r\na red skirt, and a pair of white knee high socks and black mary janes, <br>\r\n<br>\r\n\"So *snicker* that's *snicker* 'Aunt Jane'?\" You ask trying to contain your laughter, only to no avail, \"Yep\" Mom says smiling at the sight of her sister, \"Yay, now I have someone to play with\" Sarah says happily and runs up to Jane wanting to play with her.</span></div></div>",
            "created":1303794000,
            "id":1095134,
            "title":"You freeze, seven year old 'Jane'."
        },
        "13112111121":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Yay!",
                "Sorry, but you'll have to defeat Mat in a single duel if you want Michelle..."
            ],
            "content":"<div class=\"\"><div> <span>Looking at the new girl, you begin to wonder if it is all a setup. John is far too comfortable as 'Jane'. \"I didn't want to use my abilities against you guys\" you say.<br>\r\n<br>\r\n\"I can understand that\" Jane giggles, and you see that Sarah is getting even more excited. \"My first magic encounter was against your mom, and that resulted in Jane's birth\"<br>\r\n<br>\r\n\"Jane, can we go and play?' Sarah asks.<br>\r\n<br>\r\nJane giggles and replies....</span></div></div>",
            "created":1303880400,
            "id":1095351,
            "title":"continue"
        },
        "131121111212":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Sarah, 'Michelle' is born.",
                "You win but agree to become Michelle."
            ],
            "content":"<div class=\"\"><div> <span>Sarah gave a loud shriek and giggle before turning to you, grinning. \"You'll make a cute 'Michelle'.\" she said.<br>\r\n<br>\r\nYou grinned back. <i>\"Maybe I could make you a handsome 'Samuel'.\"</i> you thought. then you replied, \"You can try.\"<br>\r\n<br>\r\nWith that, Julie and Jane stepped aside, both grinning while Sarah took the first shot. having been trained in chaotic science, you sensed the attack coming and teleported away before it could hit you, reappearing behind a surprised Sarah. \"Hey, no fair!\" she yelled, turning around to your chuckling.<br>\r\n<br>\r\n\"Sorry, Sarah.\" said Julie, giggling. \"Mat has every right to use his science to defend himself.\"<br>\r\n<br>\r\nJane smiled as she saw Sarah's attack and your response to it. <i>\"Mat is as powerful and talented as any witch his age.\"</i> he thought. <i>\"Only, like her mother, Sarah is a prodigy when it comes to magic, they are equally matched.\"</i><br>\r\n<br>\r\nSarah launched another age bending spell, which you deflected with a telekinetic shield. Like your uncle's first duel years ago, you were staying on the defensive, not wanting to hurt your little sister.\"<br>\r\n<br>\r\n\"Getting tired yet, sis?\" you asked, wanting to call her 'princess'.<br>\r\n<br>\r\n\"Not even close, bro.\" replied Sarah. \"Just let me hit you so we can all have some fun.\"<br>\r\n<br>\r\n\"But we are having fun.\" you said, looking hurt. \"We're bonding right now, aren't we?\"<br>\r\n<br>\r\nSarah paused, then smiled. \"Yeah, I guess we are.\" she said.<br>\r\n<br>\r\n<i>\"Mat could have taken advantage of that hesitation.\"</i> thought Julie, also watching. <i>\"He didn't though, good for him.\"</i><br>\r\n<br>\r\nYou knew that it was only a matter of time before you are Sarah became too exhausted to duel any further, allowing the other to win. With each spell and counter measure was launched, both you and Sarah quickly began to grow tired. It was only your and her stubborn nature that was keeping you both going.<br>\r\n<br>\r\nWho eventually won?<br>\r\n</span></div></div>",
            "created":1304226000,
            "id":1098057,
            "title":"Your first duel."
        },
        "1311211112121":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>You grin as you see Sarah begin to stumble. Sure you're tired, but not as much as Sarah. She collapses and you walk over to your 'sleeping' sister, but you never notice her eye half open. Mom and Jane do.<br>\r\n<br>\r\n\"Sorry princess, but no 'Shelly' today\" you say, not noticing Sarah  begin to grin.<br>\r\n<br>\r\n\"Mat. You forgot one thing\" Jane calls out.<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\n\"How Jane came to be\" Jane giggles, as Sarah lifts ahand and fires a spell at you from point blank. She then faints, a smile on her face, as you begin to change.</span></div></div>",
            "created":1304226000,
            "id":1098207,
            "title":"Never underestimate an opponent"
        },
        "13112111121211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "'aunt Jane' becomes uncle John.",
                "your birthday party tonight."
            ],
            "content":"<div class=\"\"><div> <span>You watched in heavy disappointment as you shank slightly and felt your hair growing passed your shoulders. Turning to a mirror in the living room, you saw that it had already gained the honey blond color all of the girls in your family carried and moaned as you saw the rest of your body changing to female proportions. Once the physical change was complete, you moaned as your now over sized clothing shifted and changed to a princess cut pink dress with white tights, and black mary janes. You could feel that your boxers had become smaller and immediately knew that they were now panties of an unknown color and style as something appeared around your chest, creating a caged feeling, it was a training bra and you could feel it was slightly filled.<br>\r\n<br>\r\n\"Oh, man!\" you wailed, trying to ignore your new voice. \"I lost!\"<br>\r\n<br>\r\nMom smiled, eying your new look. \"Never underestimate your opponent... Michelle.\" she giggled. \"Your uncle John made that same mistake with me when we were kids and Jane was born.\" she shook her head. \"Only 'she' had an ace in the hole, the counter effect serum.\"<br>\r\n<br>\r\nYou turned to Jane, surprised. \"That's cheating.\" you said.<br>\r\n<br>\r\nJane giggled. \"The rules have changed since I first dueled.\" she said. \"Yes, <i>now</i> it is considered cheating, just as it is considered cheating for Sarah to keep an all cancellation potion on her during a friendly duel.\"<br>\r\n<br>\r\n\"The witch's version of the counter effect serum.\" explained Julie to your nod. \"It was made shortly after John was accepted as a pseudo witch.\"<br>\r\n<br>\r\n\"So what happens now?\" you asked. \"How long do I have to stay like this?\"<br>\r\n<br>\r\n\"That is up to Sarah.\" replied mom, she won the duel.<br>\r\n<br>\r\nMom walked over and shook Sarah awake. She looked around then grinned, seeing you as a girlish version of yourself. \"Yay, I win!\" she exclaimed, giggling. \"Now we can all play!\"<br>\r\n<br>\r\n\"Michelle wants to know who long you wish her to stay that way, since you won the duel.\" said mom.<br>\r\n<br>\r\nSarah looked at mom surprised. \"I get to pick how long she stays that way?\" she asked, surprised.<br>\r\n<br>\r\n\"ell, within reason, dear.\" replied mom, smiling. \"Don't forget, unlike other boys, he can change himself back when he has had enough 'fun'.\"<br>\r\n<br>\r\nSarah nodded at mom then turned to you, grinning like a snake would to a rat, or was it your imagination. \"Mat, I want you to stay as Michelle until...\"<br>\r\n</span></div></div>",
            "created":1304312400,
            "id":1098438,
            "title":"continue"
        },
        "131121111212111":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Your sisters come back in",
                "Your friends come in"
            ],
            "content":"<div class=\"\"><div> <span>Sarah giggles, insisting that you stay as you are until Jane returns to normal.<br>\r\n<br>\r\n\"Mom! Thats not fair\" you say, stomping your foot a little.<br>\r\n<br>\r\n\"You fought, knowing the risk. Now be a good girl, <i>Michelle</i>\" mom says, a grin on her face.<br>\r\n<br>\r\n\"Will you be playing, Jane?\" Sarah giggles as she thinks about what games to play.<br>\r\n<br>\r\n\"No. Your mom and I are going out\" 'Jane' says, as she begins to become older. Within a minute, she is the same age as mom. You wonder why she choose to remain female though. Both her and mom head for the door.<br>\r\n<br>\r\n\"Please. Don't leave me\" you whine. Jane turns around and grins. \"You'll have fun, Michelle\"<br>\r\n<br>\r\n\"Yeah right\" you softly mutter as they leave.<br>\r\n<br>\r\n</span></div></div>",
            "created":1304744400,
            "id":1101445,
            "title":"'aunt Jane' becomes uncle John."
        },
        "1311211112121112":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "They believe you.",
                "They laugh, Julie changes them."
            ],
            "content":"<div class=\"\"><div> <span>Just then, a tall teenage boy with crew cut black hair and hazel eyes walked in with a petite teenage girl with long auburn hair and blue eyes. You immediately recognized them as your friends, Tom and Jenny, who lived next door on either side.<br>\r\n<br>\r\nTom Rich, son Harry and Melanie Rich, looked at you then turned to Julie and Sarah. \"Who's the pretty petite?\" he asked. \"A visiting relative?\"<br>\r\n<br>\r\nJulie grinned. \"That's Mat, he lost a duel to Sarah.\" she said lightly. \"She's going to be 'Michelle' for a while.\"<br>\r\n<br>\r\nJenny giggled. \"If only it were true.\" she said. \"Mat would make a really cute girl, I'd take 'her' out shopping.\"<br>\r\n<br>\r\n\"Come one, who is she, really?\" asked Tom, unaware of his or Julie's family secret.<br>\r\n<br>\r\n\"That's Mat, silly.\" said Sarah with a giggle.<br>\r\n<br>\r\n\"All of the girls in my family... and yours are witches, Tom.\" said Julie, more seriously. she produced a flame to prove it, causing Tom and Jenny to scream. \"Boys do not have this power but a select few boys have the power of super science, Mat is one of them and he lost a friendly duel with Sarah.\"<br>\r\n<br>\r\nYou sighed. \"it's true.\" you said. \"I underestimated Sarah and it came back to bite me.\"<br>\r\n<br>\r\nTom and Jenny looked at each other, surprised then...<br>\r\n</span></div></div>",
            "created":1304830800,
            "id":1102715,
            "title":"Enter the friends."
        },
        "1311212":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "We need to talk",
                "You can choose Sarah's punishment"
            ],
            "content":"<div class=\"\"><div> <span>\"Sarah switched us\" You and Sarah say in unison. you both look at eachother angry and mom asks, <br>\r\n<br>\r\n\"Which one of you is the real Sarah?\" \"She is\" you and Sarah say in unison pointing at eachother, then Julie gets an idea, \"Mat has a crush on Jenny\" She says teasingly, <br>\r\n<br>\r\n\"I do not!\" You yell while Sarah laughs, \"Got you Sarah\" Julie says to her, <br>\r\n<br>\r\n\"Aw man\" Sarah says annoyed, \"That does it young lady\" your mom says in anger, \"I'm taking away your magic until your thirteen, after I change you back That is\" she says, then you see Sarah return to normal, \"Mat\" Mom says.</span></div></div>",
            "created":1293080400,
            "id":1021175,
            "title":"Sarah switched us"
        },
        "13113":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "We're your cousin Hank and uncle John\"",
                "We saw the whole thing happen\""
            ],
            "content":"<div class=\"\"><div> <span>\"Mom, Julie!\" you shout. Mom, and Julie come down, \"What's wrong Sarah?\" Julie, and Mom ask, \"I'm not Sarah it's me Mat Sarah used magic to turn me into her and herself into me\" you say. \"We belive you because.....</span></div></div>",
            "created":1308286800,
            "id":1128399,
            "title":"ask Julie or mom to return you to normal"
        },
        "131131":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "trick her into swapping back with you",
                "wait till your mom comes"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm your cousin Hank your Mom\" says, \"And, I'm your Uncle John\" Julie says, \"Say what!?\" you ask shocked, \"You see Mat, Dad wanted to show me what it's like to be an adult and a girl\" Hank says, \"Ok, but why did you swap with Julie uncle John?\" you ask, \"I made a deal with your mom to watch Hank so he wouldn't cause trouble\" John says, \"So what should I do about Sarah Uncle John?\" you ask</span></div></div>",
            "created":1308546000,
            "id":1130813,
            "title":"we're your cousin Hank and uncle John"
        },
        "1313":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "A 13 year old girl.",
                "Sarah's twin.",
                "A six year old girl."
            ],
            "content":"<div class=\"\"><div> <span>How did you find out!?\" you demanded, summoning a flame to your hand.<br>\r\n<br>\r\nSarah turned to you, smiling. \"Uncle John told me all about it.\" she said, simply. \"He and mom were the same age you and I are when he first discovered magic was real.\"<br>\r\n<br>\r\n\"He wants us to form a bond, just as he did with mom when they were kids.\" you mussed. \"Interesting.\"<br>\r\n<br>\r\n\"So, what will it be, big brother?\" asked Sarah, grinning. \"Agree to play with me and I keep quiet or don't and I tell mommy!\"<br>\r\n<br>\r\nYou were not sure how mom would react to you having the same science that forced uncle John into isolation with your aunt Megan, nor were you sure how grandma would react when word got to her. Sarah grinned, seeing you sweat and teasingly began to tap one Mary Jane shoe onto the hard wood floor.<br>\r\n<br>\r\n\"I'm waiting, Mat.\" she said. \"Will you be my sister, Mary or shall I tell mommy that you've been rummaging through  uncle John's trunk in the attic?\"<br>\r\n<br>\r\n\"That's a lie, Sarah!\" you snapped. \"You know mom's punishment for <i>lying</i> and she will know you're lying!\" you paused, shivering. \"Her punishment for going through uncle John's old tech is even worse...\"<br>\r\n<br>\r\nSarah sighed, still smiling. \"Okay, you got me on that one.\" she said. \"I'll just tell her you're hiding something, that's the truth, and not telling her what it is is just as bad as lying...\"<br>\r\n<br>\r\nYou began to sweat again, not knowing what to do. Finally, you sighed in surrender. \"Fine...\"<br>\r\n<br>\r\nSarah giggled then cast her spell and you allowed the transformation, hoping your skills in chaotic science were enough to change yourself back later...<br>\r\n<br>\r\n\"All done... Mary!\" giggled Sarah. \"Take a look at the new you.\"<br>\r\n<br>\r\nYou let out a low sigh then turned to a mirror and screamed to find that you had become...<br>\r\n</span></div></div>",
            "created":1289278800,
            "id":990819,
            "title":"Blackmailed!"
        },
        "13132":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You go to ballet",
                "You use your science."
            ],
            "content":"<div class=\"\"><div> <span>Sarah laughed, seeing the look on your face but paled as you laughed yourself in an evil manner. \"you forget that I  have a power of my own, sis!\" you said, summoning a flame to your hand. \"Let's see how you like a gender change!\"<br>\r\n<br>\r\n\"No you don't!\" said Sarah, producing a flame of her own. \"I'll tell mommy!\"<br>\r\n<br>\r\n\"Tell her what!?\" you asked, annoyed. \"That you had been studying magic, unrestricted!?\"<br>\r\n<br>\r\n\"You've been studying science unrestricted!\" Sarah fired back.<br>\r\n<br>\r\n\"I have a holographic 'John' teaching me.\" you countered. \"What do you have?\"<br>\r\n<br>\r\n\"You'll still get in trouble!\" said Sarah. she then stuck her tongue out at you.<br>\r\n<br>\r\n\"Not as much as you will, sis!\" you yelled back. you stuck your tongue out in return like the seven year old you were.<br>\r\n<br>\r\nUnknown to you and Sarah, mom and Julie were in the other room, desperately keeping their giggles silent as they watched you face off with your little sister.<br>\r\n<br>\r\n\"Mat has become quite talented with John's science.\" whispered mom amused. \"It's too bad John can't see his nephew in action for the first time.\"<br>\r\n<br>\r\n\"Grandma was furious when she found out Mat had it.\" said Julie, concerned. \"What do you think she will do to uncle John for giving his science to him?\"<br>\r\n<br>\r\nMom giggled. \"John got permission first.\" she assured Julie. \"Only your Grandmother was hoping to see if Mat could handle himself without it the science before allowing him to have it.\" she paused. \"Wait here, I'm going to see if Mat wants to join Sarah's ballet class today.\"<br>\r\n<br>\r\nJulie silently giggled then watched as mom entered the living room and gave a short scream, seeing two Sarah's pouting at each other with a flame in their hands.<br>\r\n<br>\r\n\"Cancel those flames this instant!\" she demanded. \"I will have no magic wars in this house!\" she turned from one 'Sarah' to the other, inwardly pleased with her daughter's self taught skills. \"One of you is the real Sarah, who is it?\"<br>\r\n<br>\r\n\"She is!\" said Sarah and you, pointing at each other.<br>\r\n<br>\r\nWatching, Julie had to hold a hand over her mouth to silence a laugh as mom shifted her weight onto one leg, looking unimpressed. \"Well, if I can not tell the two of you apart, I have no choice but to take you both to ballet class.\"<br>\r\n<br>\r\n<br>\r\nYou moaned loudly as Sarah laughed. \"Not ballet!\" you protested.<br>\r\n<br>\r\nMom turned to you smiling. \"Got you, Mat!\"<br>\r\n<br>\r\n\"What!?\" you screamed, your dress now morphing into a ballerina costume. \"Mom, please don't!\"<br>\r\n<br>\r\nSarah began to laugh louder as a ballerina costume appeared upon herself. \"You will love ballet sis!\" she said.<br>\r\n<br>\r\nMom stepped forward, smiling, wondering what you would try, then took a firm hold of your hand. \"Let's go, young lady.\" she said, dragging you along. \"I'll think up a name for you on the way.\"<br>\r\n<br>\r\nAs mom dragged you towards the front door, she winked at Julie who giggled before regressing herself to a seven year old ballerina as well and followed, 'pouting'. \"Let's see if Mat plays along or tries to fight back.\" thought mom, opening the front door. \"This should be interesting.\"<br>\r\n<br>\r\nWhat do you do?<br>\r\n</span></div></div>",
            "created":1289451600,
            "id":991936,
            "title":"Like mother, like daughter."
        },
        "131322":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Ballet class.",
                "Returning home."
            ],
            "content":"<div class=\"\"><div> <span>\"This is not fair!\" you protested. \"I am the victim here, why am I being punished!?\" you then pointed at a 'pouting' Julie. \"She had nothing to do with this at all, why punish her!?\"<br>\r\n<br>\r\n\"Going to ballet class is hardly a punishment... Mary.\" said mom, pausing by the opened front door.<br>\r\n<br>\r\nUsing a power called telekinesis, you closed the door with your mind, causing mom to jump slightly. \"Forcing a thirteen year old boy and a sixteen year old girl to look and act like a younger girl is a punishment, mom!\" you countered. \"Especially with the use of magic!\"<br>\r\n<br>\r\nMom frowned, although, inside, she was giggling. \"The more magic is used against you, the more resistant you become to it, Mat.\" she told you. \"I'm trying to help you and give you some memorable experiences.\" she paused. \"As for Julie, she can change herself back, if she really tried.\"<br>\r\n<br>\r\n\"Asking us first would have been nice!\" you fired back. \"Let's try this again, shall we?\"<br>\r\n<br>\r\nWith that said, you threw off mom's spell, returning yourself to normal. For a split second, you stood there, completely naked, causing everyone to blush as your normal clothing then appeared onto you. \"I have to work on that.\" you muttered, blushing yourself. \"Sorry.\"<br>\r\n<br>\r\nMom allowed a small grin. \"So, you have John's chaotic science.\" she said.<br>\r\n<br>\r\nYou nodded. \"He gave it to me on my twelfth birthday.\" you replied. \"He told me not to tell anyone about it but I was going to reveal my secret at my birthday party tonight.\"<br>\r\n<br>\r\nMom then smiled. \"I'm glad.\" she said. \"However, I would still like you to give ballet a try, it will bring you closer to your sisters and give you a taste of magic.\"<br>\r\n<br>\r\nYou moaned slightly. \"Do I have to?\" you asked.<br>\r\n<br>\r\nJulie giggled. \"It's not as bad as you think.\" she said. \"I was in on the joke, though I thank you for sticking up for me, only we will know who you truly are and, as you just proved, you can change yourself back when we return.\"<br>\r\n<br>\r\nYou turned to Sarah and saw her eyes, begging you, then sighed. \"Alright.\" you said, grudgingly. \"I'll go but this had better not be lame.\"<br>\r\n<br>\r\nSarah giggled as you were, once again transformed into seven year old Mary in a ballerina costume. \"You'll love it!\"<br>\r\n<br>\r\nMom then opened the door and ushered you outside. \"Let's go... girls.\" she giggled.<br>\r\n</span></div></div>",
            "created":1294635600,
            "id":1032594,
            "title":"You use your science."
        },
        "132":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You're aware you the family secret, and guess it's Sarah's doing",
                "You're aware, but think Sarah is too young",
                "You're unaware, and freak out as the change occurs"
            ],
            "content":"<div class=\"\"><div> <span>\"Not now\" you say again. School is getting tougher, both with schoolwork, and socially, and you don't need this now, and Sarah has no idea of what you're going through. You vaguely hear some words and...<br>\r\n<br>\r\n\"What's happening to me!?\" you cry, suddenly feeling strange. You eye your sister, who is grinning a cute, innocent grin.</span></div></div>",
            "created":1288933200,
            "id":987757,
            "title":"History has a way of repeating itself"
        },
        "134":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "Sarah turns mom into you",
                "Sarah gives you mom's personality",
                "Sarah is wanting to have a mother/daughter time"
            ],
            "content":"<div class=\"\"><div> <span>You start shrinking from 5'7 to 5'3 as your build becomes more feminine. Your hands and feet become dainty and feminine with pink nail polish. your butt and hips flare out, your waist caves in, while your stomach becomes more feminine. two mounds grow from your chest stopping at a D-Cup. completing the hourglass figure. Your hair grows down to your back and turns honey blonde. Your skin becomes more smoother. your lips become fuller. your whole head changes shape to become more of a heart-like shape. your nose shrinks becoming cute. Your eyes change color, as your eyebrows thin while the lashes become longer. Your shirt starts to become a pink T-Shirt. Next, your pants become a blue jean mini skirt, Your shoes become a pair of 5' pink stiletto boots. Your underwear becomes a pair of red panties. A matching red bra appears underneath your shirt. You became your mom. You then stare at Sarah shocked at her doing.</span></div></div>",
            "created":1290920400,
            "id":1003173,
            "title":"something else"
        },
        "1343":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "reluctantly accept",
                "compromise by playing pretend instead",
                "refuse/discover since you're a girl you can fight back"
            ],
            "content":"<div class=\"\"><div> <span>\"Why!?!\" you stammer, realizing you've got mom's voice as well. Sarah grins at you. \"Mommy is busy with something and won't take me shopping\"<br>\r\n<br>\r\nYou groan internally since shopping with Sarah is a nightmare. You really don't want to be the parent.<br>\r\n<br>\r\n\"Why did you have to change me into <i>mom</i>\" you demand. You're aware that most of the males in the town, including most of your school thinks your mom is hot. You don't want to go outside as her.<br>\r\n<br>\r\nWhat you, Julie and Sarah don't know is that mom is about to reveal her secret to you, Sarah (mom doesn't know that Sarah has powers yet) and your cousins by having the entire family over.<br>\r\n<br>\r\n\"Please mommy! I want to go to the mall\" Sarah whines. You gulp, since you know it will be hard to convince her to change you back. While you don't want to give in, you know she could do worse to you</span></div></div>",
            "created":1290920400,
            "id":1003235,
            "title":"Sarah is wanting to have a mother/daughter time"
        },
        "13433":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "you discover you have magic too",
                "another family member comes into the room"
            ],
            "content":"<div class=\"\"><div> <span>\"Forget it. I'm not taking you to the mall\" you say hastily. You don't care if she is some kind of witch. All you want is to teach this brat of a sister a lesson.<br>\r\n<br>\r\n\"Please mommy....\"<br>\r\n<br>\r\n\"I'm not mom! No matter what sort of spell you put on me\" you say, blinded with your anger. \"In fact, if you're so desparate that you want me to be mom, I'll be 'mom'. You're grounded for a year!\"<br>\r\n<br>\r\n\"You can't do that to me\" Sarah whines.<br>\r\n<br>\r\n\"Be careful of what you wish for, you little brat' you snarl. \"You wanted me to be mom, so I am being mom.\"<br>\r\n<br>\r\n\"Fine. I'll make you something else\" Sarah grins. You gulp, since you have a feeling that you're not going to like whatever she has in mind.</span></div></div>",
            "created":1325427480,
            "id":1250492,
            "title":"'mommy' is not happy...."
        },
        "134331":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Mom, frowning.",
                "Julie, grinning."
            ],
            "content":"<div class=\"\"><div> <span>\"Not happening!\" you suddenly raged, a flame appearing in your hand. \"You want to play with magic? Fine!\"<br>\r\n<br>\r\nWith that, you threw a spell, guessing how they worked, being a fan of fantasy games and movies. Sarah, not expecting that move from you, screamed then threw a spell right back, hoping to change you quickly. Only you knocked it away, playing as if you were a wizard in your fantasy battle game. \"You shouldn't have made me older, Sarah.\" you said with a slight grin. \"I'm now far more powerful due to my new age.\"<br>\r\n<br>\r\n\"You won't be for long!\" pouted Sarah, angry you were not playing along and began to fire spell after spell at you while throwing her usual tantrum when she doesn't get her way. \"I should have made you a baby!\"<br>\r\n<br>\r\n\"Not a bad idea, since you're acting like one right now!\" you fumed, wanting to end this quickly. \"Change me back before I change you!\"<br>\r\n<br>\r\n\"Change yourself back so I can change you!\" countered Sarah, still throwing spells. \"I want to go to the mall!\"<br>\r\n<br>\r\nBoth you and Sarah were both getting angrier with each other, ignoring the fact you were both getting tired. Only, you suddenly felt weird and stopped as Sarah did. She looked down at herself and screamed before you did the same, noticing that you were quickly shrinking. \"I got you first!\" boasted Sarah, sticking her tongue out at you.<br>\r\n<br>\r\n\"Who cares who got how first!?\" you snapped, \"We're turning into toddlers!\"<br>\r\n<br>\r\nYou're statement proved true as you and Sarah both stopped regressing around the age of three, wearing over sized clothing, though yours was worse, wearing a copy of mom's favorite outfit. \"This is all your fault!\" you and Sarah screamed in unison.<br>\r\n<br>\r\n\"Actually, its both of your faults for losing your tempers.\" said a voice, entering the room.<br>\r\n<br>\r\nYou and Sarah turned to see...<br>\r\n</span></div></div>",
            "created":1338678780,
            "id":1350704,
            "title":"'Young' girls can't use magic."
        },
        "1343312":{
            "author_id":"noteman",
            "author_name":"Noteman",
            "choices":[
                "Agree",
                "Retaliate "
            ],
            "content":"<div class=\"\"><div> <span>\"What are you two doing\", Julie giggles, \"Now look what you've done, you've turned yourselves into toddlers.\"<br>\r\n<br>\r\n\"Please change us back\", both you and Sarah say in unison. <br>\r\n<br>\r\n\"Well I guess I don't have a choice\", Julie said nodding her head. She then shoot a ray of light which made Sarah turn back into herself. However that wasn't the case for you. She actually turned you into the form that you were in last time which was your mother.<br>\r\n<br>\r\n\"Why didn't you turn me back into myself\", You said with your mother's annoyed voice. <br>\r\n<br>\r\n\"What are you talking about? I did turn you back into what you were before, and what in which you were in our mother's body\", Julie smiled.<br>\r\n<br>\r\n\"That's what you get\" Sarah joined in. <br>\r\n<br>\r\n\"Oh and I made it so that you can't use your magic\", Julie added, \"How about you take us both to the mall, cause I want some new clothes\"<br>\r\n<br>\r\n\"What?!\" Is all that you could say.</span></div></div>",
            "created":1445186580,
            "id":2048823,
            "title":"Julie, grinning."
        },
        "135":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "yes",
                "no",
                "Julie overhears the conversation"
            ],
            "content":"<div class=\"\"><div> <span>\"What happened?\" You think to yourself, \"Last I recall, I was chanting a spell on Mat, and now i'm standing where he was.\" You then look down at yourself and you get ready to scream, But you hear a familiar voice say, \"Sarah don't.\" You look to see yourself Mat?\" you ask, \"No, I'm the real Sarah\" she says, \"But that's impossible. I'm Sarah.\" you say. \"You are actually Mat but you think you're me.\" Sarah says smiling, \"Cool\" You say \"So wanna play 'Mat'?\" The real Sarah asks you.</span></div></div>",
            "created":1304226000,
            "id":1098374,
            "title":"you think you're Sarah"
        },
        "1353":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "wants to join in the fun along with mom",
                "reverses the spell",
                "calls for mom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Why'd you do that to Mat Sarah?\" Someone asks. Both you and the real Sarah jump, \"Uh, uh, uh, uh.\" Is all the real Sarah could say before Julie.</span></div></span></div>",
            "created":1304312400,
            "id":1098966,
            "title":"Julie overhears the conversation"
        },
        "13531":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "pretend",
                "dress up"
            ],
            "content":"<div class=\"\"><div> <span>\"You didn't let me finish Sarah. Why'd you do that...without me or mom?\" Julie asks as she giggles. \"I didn't know.\" The real Sarah says. \"Mom. Sarah's playing our favorite game with Mat.\" Julie says, Mom walks in \"Can i join in too, Or is it exclusively for you kids?\" \"Sure. You can play with us mommy.\" You and the real Sarah say together. Then Sarah casts the spell again and mom and Julie ask so what do we play? Sarah says.</span></div></div>",
            "created":1304398800,
            "id":1098997,
            "title":"wants to join in the fun plus mom"
        },
        "135311":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "yes",
                "no thanks"
            ],
            "content":"<div class=\"\"><div> <span>\"Pretend\" Sarah says smiling, \"Okay then\" You, mom and Julie say in unison. \"So who do we pretend we are?\" you ask. \"You three pretend to be who you really are.\" \"You mean i pretend to be Mat and 'mommy' and 'Julie' pretend to really be mommy and Julie?\" You ask, \"Yep what do you say?\" Sarah asks.</span></div></div>",
            "created":1304398800,
            "id":1099019,
            "title":"pretend"
        },
        "1353111":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "Jenny arrives",
                "uncle John aunt Mel and Hayley come in"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>sure you mommy and Julie say, yay let's get it started Sarah says. you all start playing pretend you mommy and Julie do a great job at acting just then.....</span></div></span></div>",
            "created":1306904400,
            "id":1117832,
            "title":"yes"
        },
        "15":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Julie, holding a book of her own.",
                "Sarah, wanting to play.",
                "Mom, smiling.",
                "Grandma, concerned.",
                "Tom and Jenny, curious"
            ],
            "content":"<div class=\"\"><div> <span>You looked around but saw no one. You then paused, listening but heard nothing and shrugged, turning back to the book you had found. Upon seeing what it was, however, your face turned pale. It was a large, thick book with the title, in large bold letters, Chaotic Science. Your uncle John had given it to you in private on your twelfth birthday but you did not fully understand what he meant when you first laid eyes on your book...<br>\r\n<br>\r\n\"Things happen for a reason, Mat.\" said John. \"That is why I am passing this book on to you.\"<br>\r\n<br>\r\n\"Chaotic Science?\" you asked. \"What is that?\"<br>\r\n<br>\r\n\"Something I have studied, practiced, and perfected during my interesting life.\" replied John. he then pointed a finger of warning at you. \"You must not tell <i>anyone</i> about that book, especially not your grandmother.\"<br>\r\n<br>\r\n\"Why not?\" you asked.<br>\r\n<br>\r\n\"Things happen for a reason, Mat.\" repeated John. Like your sister, Julie, vanishing for a year without a single word of explanation why, right after her thirteenth birthday...\"<br>\r\n<br>\r\nYou became alarmed, swallowing hard. You had an argument with Julie before she had varnished without a trace and secretly blamed yourself for it happening. Dozens of missing persons posters were hung by you, all over town, hoping that someone would know something. Julie did return after a year of absence and you were very relieved and happy to see her back home but she acted as if nothing had happened. She did tell you that it was not your fault and that she appreciated your efforts to 'find' her but it never went passed that. Only you could sense that something about her had changed, it had bothered you since but you could never find any proof.<br>\r\n<br>\r\n\"You... You mean I'm going to vanish too!?\" you asked.<br>\r\n<br>\r\nJohn frowned, you could tell he was holding something back and that scared you deeply. \"Study and practice this science well. Mark my words, Mat, it will, someday, save your family.\"<br>\r\n<br>\r\nWhen you first opened the book, you found instructions to a hidden door in the basement and how to open it. Beyond the door, you found a secret room that extended out, under the back yard. It was fully equipped with everything any scientist could want, including libraries of books on the subject of Chaotic Science. You could only guess then that it had all, somehow, been set up by uncle John. Fearing that you may vanish and returned changed as well, you took your uncle's instructions to heart and began to study the book of chaotic science inside the secret room.<br>\r\n<br>\r\nTime passed and you practiced the forbidden sciences, soon developing a love for them. You understood then why you could not tell your family, your mother would have forbid you to study the science any further. Also, you guessed that your grandmother would 'kill' uncle John for giving it to you. Still, you were hooked on it and you were not about to just give it up. Volunteering to do all of the family's laundry after school and on the weekends was a brilliant plan in your mind to practice your new found powers without arousing any suspicion. Unknown to you, that was the same ploy your uncle John had used when he first started.<br>\r\n<br>\r\nNow, nearly a year later, you had become quite talented and, after a few very successful experiments, highly intelligent. Only that too came with a price. School became too easy for you and a real pain to endure as you could literally teach the teacher. Fortunately, at home, you found that just being yourself kept any suspicions from rising.<br>\r\n<br>\r\nReturning your mind to the present, you looked at your book again, worried. \"How could I have been so careless to leave it out in the open!?\" you asked yourself quietly. \"Someone could have found it and my secret would have been blown!\"<br>\r\n<br>\r\nThen, a thought came to you and you became alarmed. \"Wait a minute... I wouldn't hide my book under a seat cushion!\" you whispered, louder. you then gasped. \"Someone knows!\"<br>\r\n<br>\r\nThen you heard someone clear their throat and you shot your eyes up to find...<br>\r\n</span></div></div>",
            "created":1289106000,
            "id":989074,
            "title":"Someone knows!"
        },
        "151":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You show Julie your laboratory.",
                "Mom walks in on you both.",
                "Sarah heard you talking."
            ],
            "content":"<div class=\"\"><div> <span>You shot your eyes up to find Julie, in her school uniform, holding a book of her own. \"I always wondered why you had kept yourself so distant over the past year.\" she said, seriously. \"It was almost as if you had... <i>vanished</i>.\"<br>\r\n<br>\r\nThinking back, you began to feel guilty. \"I... I guess I was a bit of a loner for a while.\" you said. \"It was not intentional. I couldn't tell anyone about this.\" you paused. \"May i assume you are the one who found my book?\"<br>\r\n<br>\r\nJulie nodded. \"I found it.\" she said. \"Which is the only reason I am showing this to you.\" she handed you her book. \"This is the reason I had to vanish for a year, the same reason you had to.\"<br>\r\n<br>\r\nYou looked at Julie shocked, then opened the book to examine it's pages. As you did, your face turned an ashen white, seeing that the two books were nearly identical with the exception that your book explained everything in technical terms while the 'magic book', as it was entitled, explained things more poetically.<br>\r\n<br>\r\n\"How... How is this possible?\" you asked, turning back to Julie. \"Did uncle John somehow mimic magic with science?\"<br>\r\n<br>\r\n\"You're close.\" replied Julie. \"Your great uncle Jack found a way to do that then passed his knowledge and power onto uncle John when he turned 12... without permission.\" she suddenly smiled. \"Uncle John perfected that science and passed it on to you, most likely on your 12th birthday.\"<br>\r\n<br>\r\n\"Just as it was passed onto him.\" you mused. \"But did uncle John ask permission?\"<br>\r\n<br>\r\nJulie shrugged. \"I don't know.\" she replied honestly. \"When I first discovered your secret, my first instinct was to tell mom but I decided not to until I talked to you about it.\"<br>\r\n<br>\r\n\"Uncle John made me promise not to tell anyone, especially not grandma.\" you said, wincing. \"I decided to tell everyone tonight, at my 13th birthday party.\"<br>\r\n<br>\r\n\"Then I'll let you tell mom yourself.\" said Julie, slightly relieved. \"I am sorry I could not tell you that I was a witch, Mat but, you see, only girls can use magic. Boys do have the potential but it lies dormant, unusable unless you are turned into a girl or...\"<br>\r\n<br>\r\n\"...Or it begins to sleepwalk, giving them the ability to throw waves of sheer will, similar to a witch's power blast.\" you finished. \"Another way is to gain chaotic science.\" you grinned. \"Uncle John outlined all of that in chapter two of the book he gave me.\"<br>\r\n<br>\r\nJulie looked at you for a moment, then giggled. \"Then, I assume you also know all of the laws a witch must follow.\"<br>\r\n<br>\r\nYou nodded. \"Chapter eight; Laws of super science and witchcraft.\"<br>\r\n<br>\r\n\"It looks like uncle John covered everything great uncle Jack did not.\" said Julie. \"do you also have a hologram teacher?\"<br>\r\n<br>\r\nAgain, you nodded. \"Hologram John.\" you replied. \"He's a little more serious than uncle John but he's still fun.\"<br>\r\n<br>\r\nJulie nodded, understanding. \"Well, until tonight, this will be our little secret.\" she told you. \"But, um... could you do one little favor for me?\"<br>\r\n<br>\r\nYou sensed a trap and rose your hand in defense. \"I don't want to be a girl.\" you warned, silently.<br>\r\n<br>\r\nJulie laughed. \"Not that, bro!\" she laughed. \"I just want to see your laboratory, that's all.\" she then paused. \"That and maybe have a practice duel with you, just to see how good you are with that science.\"<br>\r\n<br>\r\nYou smiled at the prospect of testing yourself against your older sister and nodded. \"You are on, with one condition.\"<br>\r\n<br>\r\n\"What's that?\" asked Julie, curious.<br>\r\n<br>\r\n\"Power blasts only, no spells.\" you demanded. \"I don't want mom to sense a duel and ground us both for fighting.\"<br>\r\n<br>\r\nJulie smiled, seeing your logic. \"Agreed.\" she said.<br>\r\n</span></div></div>",
            "created":1289538000,
            "id":992495,
            "title":"Our little secret."
        },
        "1511":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Sarah asks you to play.",
                "Tom and Jenny come visit.",
                "Your aunts arrive."
            ],
            "content":"<div class=\"\"><div> <span>You led Julie down to the basement where you stood in front of the wall, facing the back yard. It was your dad's work station before he had passed away. You shed a single tear, thinking of him and wished he could see you now before stating the command phrase to open the door. \"Tamami!\"<br>\r\n<br>\r\nThe shelves on the wall moved aside and the wall behind it slid down, into the floor, revealing a large, well lit chamber beyond, which you entered with Julie quickly following. Once the door closed behind you, she looked at you, curious.<br>\r\n<br>\r\n\"Tamami?\" she asked.<br>\r\n<br>\r\nYou shrugged. \"I am Mat, said backwards.\" you replied. Julie giggled to which you asked, \"Would you have guessed it?\"<br>\r\n<br>\r\nJulie shook her head. \"Never.\" she replied. then she turned to your laboratory and her jaw dropped. \"Woah!\"<br>\r\n<br>\r\nYou smiled at her reaction. \"This is where I had been spending most of my time during the past year.\" you said. \"Only, John told me that I am at the level of a pseudo witch but I still need training.\"<br>\r\n<br>\r\nLooking around, feeling as if she had been pulled into a high budget science fiction movie with countless of high tech equipment that she could only guess did what. Julie had seen uncle John's laboratory at grandma's house but this one was far more advanced. Then, she saw a full holographic image of uncle John approaching her.<br>\r\n<br>\r\n\"Good day, Julie.\" he said. \"Welcome to Mat's laboratory.\" he then turned to Mat. \"I thought you had planned not to tell your family until your birthday party this evening.\"<br>\r\n<br>\r\n\"I was practicing reveal spells in the living room and accidentally summoned Mat's book.\" explained Julie, defending you. \"Mom does not know, I confronted Mat alone and asked him to show me his laboratory.\"<br>\r\n<br>\r\nJohn turned back to Julie. \"I understand.\" he said. \"Would you like to participate in Mat's final test?\"<br>\r\n<br>\r\n\"What kind of test?\" asked Julie.<br>\r\n<br>\r\nJohn smiled. \"A duel.\"<br>\r\n<br>\r\n\"We were planning just that.\" you said. \"Julie wants to see how strong I had become.\"<br>\r\n<br>\r\nTwo round platforms rose from the floor and lit up before you and your sister took your positions, facing each other in a dueling posture. \"The rules are simple.\" said John. \"Energy blasts only, the first to knock the other off their platform will win the duel... begin!\"<br>\r\n<br>\r\nJulie started first with a powerful energy blast, not wanting to go easy on you, but you managed to dodge it and fire one of your own as she fired again. Back and forth for nearly twenty minutes, you and Julie exchanged blows with you, soon after, sweating and gasping for breath. You sister seemed relentless but you had your mom's iron will and fired one last powerful blast, hoping it would throw her off her platform. Only, to your shock, she caught your blast and threw it right back, giggling, \"Catch!\"<br>\r\n<br>\r\nYou were out of breath and on the verge of passing out but you managed to catch it and weakly throw it back before falling from your platform, no longer able to stand. Only to your surprise, Julie was there to catch you with hologram John, watching over you, smiling.<br>\r\n<br>\r\n\"Congratulations, Mat.\" said John. \"You have proven yourself powerful enough to hold your own against a witch with a year of training, I am very proud of you.\"<br>\r\n<br>\r\n\"Did I win?\" you asked.<br>\r\n<br>\r\nJulie winced slightly. \"Sorry, Mat, you lost.\" she said. \"Don't feel bad, though, I have three years of training over you.\" she then smiled. \"Despite that, you really made me work for that win, I'm impressed.\"<br>\r\n<br>\r\n\"Mat still requires training.\" said John to Julie. \"When your uncle John was trained by Jack, he gained five years of training in one year, making him very formidable against even adult witches.\" he frowned. \"However, this also caused John several porblems among the witching world.\"<br>\r\n<br>\r\n\"How so?\" asked Julie.<br>\r\n<br>\r\n\"Would you be worried if a 13 year old girl suddenly gained the power of an adult witch?\" asked John. \"Take that fear and and the fact that the witch is a boy, someone who is not supposed to have 'magic' at all.\"<br>\r\n<br>\r\nJulie shivered that the thought. \"I see your point.\" she said.<br>\r\n<br>\r\n\"John has been teaching me gender spells.\" you told Julie. \"That way, I can practice in the open after my birthday and everyone, who knows, will think it was magic.\"<br>\r\n<br>\r\n\"John's mother felt robbed and betrayed as Jack had trained him instead of her.\" said 'John'. \"Therefore, I had been programed to only train Mat to the point where he can defend himself and allow his mom to continue his training.\"<br>\r\n<br>\r\nYou turned to John, hurt. \"Does this mean...\"<br>\r\n<br>\r\n\"No, I will always be here to guide and protect you, Mat.\" said John. \"I am merely opening the door for your mother to participate in your training.\"<br>\r\n<br>\r\nYou smiled at that.<br>\r\n<br>\r\nLater on...<br>\r\n</span></div></div>",
            "created":1290315600,
            "id":998447,
            "title":"You show Julie your laboratory."
        },
        "15113":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Talking with your cousins.",
                "Uncle John arrives."
            ],
            "content":"<div class=\"\"><div> <span>You and Julie parted shortly after leaving your laboratory and went about your normal routines. You did your homework, faster than usual, to which mom insisted upon looking it over. After confirming all of the answers were correct, she turned to you, curious. \"Normally, you struggle with your homework.\" she said. \"What's different today?\"<br>\r\n<br>\r\n\"I want everything perfect today.\" you replied. \"I plan on asking Jenny out on a date tonight.\"<br>\r\n<br>\r\nMom smiled. \"So you're finally going to admit you have a crush on her.\" she said. \"It's about time.\"<br>\r\n<br>\r\nYou blushed at that, causing mom to giggle. \"I'm sure tonight will be full of surprises.\" she said.<br>\r\n<br>\r\n\"You have no idea.\" you thought, smiling back.<br>\r\n<br>\r\nJust then, the doorbell rang and mom excused herself to answer. You followed her down the stairs to the front door where you saw that aunt Hayley had arrived with her husband Paul along with aunt Mel with her husband Harry. Behind them all were your cousins. Stephanie(7), Katherine(14), and Jack(13) from Hayley's family and Kelsey(14), Gina(8), and twin brother and sister Jessica and James (both 13) from Mel's family.<br>\r\n<br>\r\n\"It's good to see you all again.\" said mom, giving her two sisters a warm hug. \"I'm glad you could come to the party.\" she paused. \"Where is John, Megan, and their kids?\"<br>\r\n<br>\r\nHayley giggled. \"John's eight year old son, Hank, got into a little mischief.\" she replied. \"Megan and her twin thirteen year old daughters, Jane and Joann, gave their 'little sister' some makeup tips.\"<br>\r\n<br>\r\nMom smiled, knowing that John's only son had either discovered a magic book or stumbled upon his father's laboratory, resulting in him becoming transformed into a young girl. Only you, visualizing the same thing, stifled a laugh, catching your mom and aunts' attention. \"They gave Hank a makeover!?\" you asked, still chuckling. \"That's funny!\"<br>\r\n<br>\r\nHayley smiled, thinking you would not be laughing after you are told the truth about magic. \"It's not nice to laugh at other people's expense, Mat.\" she warned lightly. \"I learned that myself the hard way, you could be next.\"<br>\r\n<br>\r\nYou stopped laughing, remembering that you were out gunned when it came to magic. \"You're right, aunt Hayley.\" you said, pouting slightly. \"I'm sorry.\"<br>\r\n<br>\r\n\"Mat wants to ask Jenny out at his birthday party tonight.\" said mom, still unaware. \"It's going to be an interesting night.\"<br>\r\n<br>\r\nHayley and Mel nodded in agreement, not yet knowing you had a few surprises of your own planned for the party.<br>\r\n</span></div></div>",
            "created":1302152400,
            "id":1083880,
            "title":"Your aunts arrive."
        },
        "151132":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "The host of the party. (mom)",
                "Our mom. (Natile Harrison)"
            ],
            "content":"<div class=\"\"><div> <span>Then a loud car horn was heard and all looked to see a that John was arriving in his 'concept model' car. Hayley shook her head and giggled. \"He still loves to make a dramatic entrance.\" she said. \"What a show off.\"<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://worldislandparadise.com/wp-content/uploads/2011/07/flying-car-adventures-in-summer3.jpg\" target=\"_blank\">http://worldislandparadise.com/wp-conten...</a><br>\r\n<br>\r\nUpon parking the car, Megan came out first with her two daughters, Jane and Joan. Both twins had quite a figure, just like their mother, with honey blond hair and blue eyes. They both smiled, waving at their aunts and cousins, as they dragged a reluctant little girl behind them. She was blushing brightly, wearing a pink princess dress with white stockings and black mary janes. Her face was covered with a light amount of make up and her hair was in braids. You struggled not to laugh as you saw her shaking her head, begging to return to the car.<br>\r\n<br>\r\n\"Hey, aunt Hayley.\" said Jane, pulling her new sister in front of her. \"Say hello to our new sister, Holly.\"<br>\r\n<br>\r\n\"Aw, you're so cute!\" cooed Hayley, smiling.<br>\r\n<br>\r\nHolly teared up, her lips trembling. It reminded Hayley of her brother, John when she first transformed him into a little girl. \"Please, aunt Hayley...\" she begged, \"I'm not a girl and they won't change me back.\"<br>\r\n<br>\r\n\"What did she do?\" asked Mel, smiling at her new niece.<br>\r\n<br>\r\nJoan giggled. \"Hank got a pet frog, he called Igor, from uncle Tim for his birthday last week.\" she explained. \"Well, he decided that Igor would like jumping around in my closet.\"<br>\r\n<br>\r\nJane giggled. \"Only, that's where Joan hid her magic book and Hank found it.\" she said, smiling. \"He put the frog back into his pocket and opened the book, triggering the trap.\"<br>\r\n<br>\r\nMegan smiled. \"John has been rather protective of his little girls.\" she said. \"Searching their rooms at random for boys hiding in the closet or under the bed.\" she giggled. \"Being a witch myself now, I set up a trap to change John into a girl as Joan often used her magic book to hide her diary.\"<br>\r\n<br>\r\n\"I never thought John would be <i>that</i> protective.\" mussed Hayley, surprised.<br>\r\n<br>\r\nMegan sighed. \"Witch boys are still coming to our house, begging to be trained in chaotic science.\" she explained. \"John only looks to see if the magic seal on the diary had not been tampered with, he does not read it.\" she then smiled. \"However, he needed to be reminded that girls need their privacy.\"<br>\r\n<br>\r\n\"Only Hank is learning that lesson instead.\" said mom with a wicked grin. \"Sounds familiar.\"<br>\r\n<br>\r\nYour aunts all giggled as Holly moaned. \"Aunt Melanie... Aunt Hannah?\" she asked, trying.<br>\r\n<br>\r\nMom shook her head. \"Sorry... Holly.\" she giggled. \"Being a little girl for a while won't hurt you and besides, changing you back is up to your sisters, not us.\"<br>\r\n<br>\r\nJust then John came into view. Looking at him, you smiled. He was a powerfully built man with longish brown hair and blazing hazel eyes. You were surprised to see him in a suit, rather than he usual lab coat and casual clothing. \"Happy birthday, Mat!\" he said with a slightly booming voice. \"I have a feeling this party will be remembered for quite a while.\"<br>\r\n<br>\r\nHe then turned to his sisters, hugging them all in turn before shaking hands with each of their husbands. \"It's been a while since the family has been together like this.\" he said. \"What do you say to some childhood fun tonight?\"<br>\r\n<br>\r\nYou looked at uncle John confused and concerned as your aunts all smiled. \"Only who will be watching over us kids?\" asked mom, a twinkle in her eyes. \"Someone has to stay an adult.\"<br>\r\n<br>\r\nJohn laughed, shaking the room. \"Why who else but...\"<br>\r\n</span></div></div>",
            "created":1321205280,
            "id":1222445,
            "title":"Uncle John arrives."
        },
        "1511322":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Samantha Forester.",
                "D. Thompson."
            ],
            "content":"<div class=\"\"><div> <span>\"Who else but our mom?\" he asked, smiling at Natalie who had appeared in the room. \"It will be like old times and we can show our kids how we played at their age.\"<br>\r\n<br>\r\nNatalie laughed. \"I don't mind being a little younger for a while.\" she said. \"However, I can't watch over so many youngsters alone. I'm going to need some help.\"<br>\r\n<br>\r\nWith that, she pulled a cell phone from her dress pocket and dialed a number. Who did she call...?<br>\r\n</span></div></div>",
            "created":1328219760,
            "id":1269924,
            "title":"Our mom. (Natile Harrison)"
        },
        "152":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "Mommy and baby",
                "Pretend",
                "Dollhouse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hi Mat\" Sarah says, \"Can you play a game with me?\" She asks, \"Fine okay\" you say, \"So what do you want to play?\" You ask, \"Let's play...</span></div></span></div>",
            "created":1290920400,
            "id":1003141,
            "title":"Sarah, wanting to play."
        },
        "1522":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Sarah calls for mom.",
                "Sarah tries another approach.",
                "Mom enters the room."
            ],
            "content":"<div class=\"\"><div> <span>\"Let's play pretend.\" suggested Sarah, smiling.<br>\r\n<br>\r\n\"Pretend, huh?\" you asked. \"What do you have in mind?\"<br>\r\n<br>\r\nSarah giggled. \"Let's pretend that I know your secret and you have to change yourself into my little sister for the rest of the night if you don't want me telling mommy.\"<br>\r\n<br>\r\nYou smiled at Sarah, making her suddenly nervous. \"How about we pretend that you don't remember anything about my book and go play like a good little girl.\"<br>\r\n<br>\r\nSarah pouted, then let out a low scream as she saw a small glowing ball fire at her from your hand. Only she was quick to recover and held up her own hand, causing your 'event', or technological spell, to harmlessly hit an invisible shield.<br>\r\n<br>\r\n\"Surprise, bro!\" she said, giggling. \"I am a witch, all of the girls in this family are but boys are not.\" she then laughed. \"Then again, it seems they 'can' work this chaos science.\"<br>\r\n<br>\r\nYou frowned. \"That's chaotic science.\" you said. \"Only, from where I stand, you are in more trouble than me.\"<br>\r\n<br>\r\n\"How so?\" asked Sarah, still grinning. \"Mom will be mad, knowing that you are playing around with that stuff.\"<br>\r\n<br>\r\nYou smile sis not falter. \"She will be more angry, knowing that you are teaching yourself this 'magic'.\" you said. \"As for myself, I have a holographic instructor helping me learn and grow.\"<br>\r\n<br>\r\n\"Become my little sister or I'll scream for mommy.\" demanded Sarah, growing impatient.<br>\r\n<br>\r\n\"Go ahead, holler your head off.\" you challenged. \"I'll just use a bio-electromechanical phase modification to alter my appearance to that of a little girl and blame you for it, saying you mentioned something about magic.\"<br>\r\n<br>\r\nSarah looked at you, confused. \"What?\"<br>\r\n</span></div></div>",
            "created":1291352400,
            "id":1007524,
            "title":"Who is blackmailing who?"
        },
        "154":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Just tell her its your book.",
                "Tell her the entire truth.",
                "Please don't ask me!"
            ],
            "content":"<div class=\"\"><div> <span>Grandma gave you a kind smile then glanced at the book, still in your hands, and gave you a slightly concerned look before quickly hiding it, still smiling. \"Hello, Mat.\" she said, kindly. \"How was school?\"<br>\r\n<br>\r\n\"It was okay, grandma.\" you said, trying to sound natural. \"You know, hitting the books, chatting with friends...\"<br>\r\n<br>\r\n\"I can see you're hitting the books.\" said Natalie. \"But, something tells me that you didn't get that book from school.\" she smiled patiently, wondering how you were going to react. \"Where did you get that book?\"<br>\r\n<br>\r\nYou began to panic as you knew uncle John did not want you to tell grandma that he gave you the book, at least not until your thirteenth birthday, and made it vanish while she was looking you in the eye. \"Um... what book, grandma?\" you asked, looking innocent.<br>\r\n<br>\r\nNatalie giggled on the inside. \"Nice try, Mat.\" she thought. she then caused the book to reappear in your hands, forcing a short scream to escape your lips. \"That book.\" she said.<br>\r\n<br>\r\n\"Oh, this book.\" you said, giving a low nervous laugh.<br>\r\n<br>\r\nNatalie smiled, she had seen all of the tricks and had heard all of the excuses. She had expected you to quickly replace your chaotic science book with some science fiction novel but you surprised her when you replied, \"I found it under the seat cushion?\"<br>\r\n<br>\r\n\"The seat cushion, you say?\" asked Natalie, hiding her amusement. \"That is a silly place to put a book, who do you think it belongs to?\"<br>\r\n<br>\r\nYou felt trapped, you did not want to give up your book, you had learned so much in such a short time. Still, you did not want to get anyone in trouble, especially not your uncle John. \"What am I going to do!?\" you thought.<br>\r\n<br>\r\n\"Mat?\" asked Natalie, looking more concerned. \"Are you okay? You look a little pale.\"<br>\r\n<br>\r\nWhat do you do?<br>\r\n </span></div></div>",
            "created":1289278800,
            "id":990851,
            "title":"Grandma, concerned."
        },
        "1543":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Sarah politely asks you to 'play'.",
                "Julie tries to have some 'fun'.",
                "Sarah and Julie have some 'fun'."
            ],
            "content":"<div class=\"\"><div> <span>Your eyes watered as you slowly shook your head. \"I can't tell you.\" you sobbed. \"I promised...\"<br>\r\n<br>\r\n\"You promised what to who, Mat?\" asked Natalie, calmly.<br>\r\n<br>\r\nNatalie hated to press her grandson but it was necessary to test his loyalty to the safety of his family. \"Mat...\"<br>\r\n<br>\r\nYou began to sob. \"Lying is forbidden in his house, grandma.\" you said, now shaking. \"I... I can't break a promise either, what should I do?\"<br>\r\n<br>\r\n\"Did you promise not to tell who asked you to keep this secret?\" asked Natalie, trying another approach.<br>\r\n<br>\r\nYou paused, thinking back, then shook your head. \"No, I didn't.\"<br>\r\n<br>\r\nNatalie nodded then leaned in close. \"Just between us.\" she said. \"Who asked you to keep this secret?\"<br>\r\n<br>\r\nYou swallowed hard then whispered, \"Uncle John.\"<br>\r\n<br>\r\nNatalie sighed. \"Your uncle gave you his chaotic science?\" she asked.<br>\r\n<br>\r\n\"Please don't ask me!\" you begged, sobbing. \"I told you who made me promise, I... I don't want to get anyone in trouble!\"<br>\r\n<br>\r\n\"No one is in trouble, Mat.\" said Natalie, giggling. \"You see, this was test.\"<br>\r\n<br>\r\nYou were surprised. \"A... A test?\" you asked. \"Why?\"<br>\r\n<br>\r\n\"Loyalty must be tested, Mat.\" said Natalie. \"John passed his test by asking me, the witch council, and your mother before passing his knowledge on to you.\" she paused, giggling at your shocked expression. \"Yes, your mom knows, but your two sisters don't.\"<br>\r\n<br>\r\n\"How was this a test for me?\" you asked, curious.<br>\r\n<br>\r\nNatalie smiled. \"I took your book from its original hiding place inside the coffee table and planted it under the cushion of your favorite chair for you to find.\" she explained. \"I had John make you promise not to tell anyone, especially not me, to test if you would honor your promise.\" she giggled. \"You passed.\"<br>\r\n<br>\r\nYou sighed, relieved. \"So, what happens now?\" you asked.<br>\r\n<br>\r\n\"Well, first off, in case you had not yet noticed, I am a witch.\" replied Natalie. \"So is your mother, your aunts, your girl cousins, and your sisters.\" she paused, smiling. \"Only girls can work magic, boys in witch families can not unless they are transformed into a girl around the age of thirteen.\"<br>\r\n<br>\r\nYou shivered at the thought as, like your uncle John, you were a fan of science fiction. \"I can think of a few unpleasant things they could do to me.\" you said. \"I hope they don't though.\"<br>\r\n<br>\r\nNatalie chuckled. \"Your uncle John had the very same fears when he discovered our magic book.\"<br>\r\n<br>\r\nYou looked at Natalie, confused. \"Magic book?\" you asked.<br>\r\n<br>\r\nSmiling, Natalie produced a book, just as thick as your own, and handed it to you. \"Compare this to your own book, Mat.\" she told you. \"Note that they are practically identical.\"<br>\r\n<br>\r\nYou opened the magic book and was immediately bombarded by an eerie light. Natalie knew what it was but said nothing as your chaotic science made you completely safe from its effects. As you flipped through the pages, your face turned a familiar ashen white.<br>\r\n<br>\r\n\"That was John's expression when he discovered magic.\" thought Natalie. \"Only, Mat will have it much easier, he is not a twin to a witch.\"<br>\r\n<br>\r\n\"This... This is impossible!\" you whispered, to Natalie's giggling. \"My science is a technological version of magic itself!\"<br>\r\n<br>\r\n\"Correct, Mat.\" said Natalie, producing a much smaller book. \"Now, I need you to study this.\"<br>\r\n<br>\r\n\"What is it?\" you asked.<br>\r\n<br>\r\n\"Pseudo magic is a science so advanced, it becomes magic.\" explained Natalie. \"Your chaotic science is equal to magic, therefore, you are a pseudo witch.\"<br>\r\n<br>\r\nAfter flipping through the pages of the smaller book, you turned to Natalie, serious. \"These are the laws I am expected to follow as a young pseudo witch, right?\"<br>\r\n<br>\r\nNatalie nodded. \"You are basically expected to follow the same laws as a witch as well as any rules your mother might impose upon your use of your science while in the house, at school, or where ever.\"<br>\r\n<br>\r\nJust then, mom walked in with a warm smile on her face. \"Well done, Mat.\" she said, giving you a warm hug. \"I'm very proud of you for keeping your promise without directly lying.\"<br>\r\n<br>\r\n\"You knew about my studies all along?\" you asked, looking somewhat downcast.<br>\r\n<br>\r\nMom giggled, releasing you. \"Don't take it so hard, Mat.\" she said. \"Even if John had not asked permission, I would have sensed that power within you the instants you began to harness it.\"<br>\r\n<br>\r\n\"I see.\" you said.<br>\r\n<br>\r\n\"I'm not going to take this science away form you, Mat.\" assured mom, kindly. \"But I am going to enforce the same rules  upon you as I do your sisters and I am going to expect you to follow them.\"<br>\r\n<br>\r\nYou slowly nodded. \"Yes, mom.\" you said.<br>\r\n<br>\r\nMom smiled, rubbing her hand in your hair. \"Relax!\" she giggled. \"Sarah and Julie don't know yet. I want to see their reactions to your power.\"<br>\r\n<br>\r\n\"So do I.\" replied Natalie, before she laughed. \"When are you going to 'tell' Mat and Sarah that magic is real?\"<br>\r\n<br>\r\n\"Just as soon as Julie brings Sarah back from ballet class..\" she said. she then turned to you. \"Want a few lessons?\"<br>\r\n<br>\r\nYou quickly shook your head before smiling. \"Only if Sarah asks me nicely.\" you replied. \"Otherwise, no way.\"<br>\r\n<br>\r\nMom and Natalie slowly nodded at each other then smiled at you. \"Deal.\" they said in unison.<br>\r\n<br>\r\nYou took a step back at that, not knowing what to expect. Minutes later, Julie returned with Sarah to find mom waiting for them in the living room with Natalie and Mat. \"Please come sit down.\" said mom. \"I have something very important to discuss with all of you.\"<br>\r\n<br>\r\nJulie did well to hide her smile as she knew what she wanted to talk about, as it was your thirteenth birthday. Sarah had a small grin on her face and you suspected she already knew as you could sense a power emitting from her. Once your sisters had sat down, mom explained the family secret, that all of the girls in their family were witches and that boys do not have this power, unless they are transformed into girls. She told them that boys are usually more muscular and athletic, using their uncle John's Tia Chi and athletics as an example. Only, she made no mention of the fact that you were a pseudo witch.<br>\r\n<br>\r\n\"Do not be overzealous when you use your magic against Mat.\" warned mom. \"I know from experience that doing so brings dire consequences...\"<br>\r\n<br>\r\n\"Like what?\" asked Julie, knowing well what but playing along.<br>\r\n<br>\r\n\"You will find out, if you go too far with Mat.\" said mom, serious. \"Remember my warning.\"<br>\r\n<br>\r\nHow do your sisters react?<br>\r\n</span></div></div>",
            "created":1289538000,
            "id":992459,
            "title":"Please don't ask me!"
        },
        "15433":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You pre empt, taking the girls by surprise",
                "the girls use their powers first"
            ],
            "content":"<div class=\"\"><div> <span>Both your sisters grin. Julie goes first. \"Hey, Mat. Could you do me a favor. The squad needs a new member, and I...\" <br>\r\n<br>\r\n\"No. I want to play dress up with Mat\" Sarah whines.<br>\r\n<br>\r\n'Here we go. They're already squabbling about what to turn me into. Don't they <i>care</i> that I don't want to be turned into a girl\" you think to yourself, as you watch both sisters summon flames, with Julie's significantly stronger. From John's notes, you know magic is draining, and that Sarah would only be able to cast a spell or two before going for an early nap. Julie would be more aof a problem, since you have no idea of her strength, but you figure you can win, if you take her out quickly. If it becomes a magic/science exchange, she has you outgunned.<br>\r\n<br>\r\n\"Guess what I can do, and you can't\" Sarah says, holding a pink magic spell in her hand. You guess what she has in mind, and you're furious. </span></div></div>",
            "created":1289538000,
            "id":992545,
            "title":"Sarah and Julie have some 'fun'."
        },
        "154331":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "seven years old.",
                "sixteen years old."
            ],
            "content":"<div class=\"\"><div> <span>\"That's not going to happen, Sarah!\" you said, annoyed, firing a bolt at her. \"I'm not helpless!\"<br>\r\n<br>\r\nThe bolt was a sleep wave, a harmless energy blast that carried a subliminal message to the brain to sleep. The bolt his Sarah and she immediately crumbled to the floor, fast asleep. You then turned to Julie but, as you had suspected, she was more experienced and easily dodged your attack and fired a bolt right back. It hit, leaving you unable to move as you fell to the floor like a stiff board. Julie was on top of you in the next breath.<br>\r\n<br>\r\n\"Uncle John passed his science onto you, I see.\" she said, smiling. \"I don't blame you for defending yourself against Sarah but I did nothing to warrant an attack and I can't have you going after people without reason, you must be punished.\"<br>\r\n<br>\r\nYou sat, there, unable to move or defend yourself and watched in horror as Julie took out a small bottle and poured its contents down your throat. \"What will that do to him?\" asked mom.<br>\r\n<br>\r\nJulie turned to mom and smiled. \"It's nothing permanent, mom.\" she promised. \"The potion will wear off in a few weeks but until then, he will be a girl about...\"<br>\r\n</span></div></div>",
            "created":1317345900,
            "id":1197607,
            "title":"You pre empt, but you get the surprise."
        },
        "1543311":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Science/magic pratice duels.",
                "The next day, You don't go back to being Mary"
            ],
            "content":"<div class=\"\"><div> <span>\"I thought you needed someone to help you on the cheer squad.\" said Natalie, smiling.<br>\r\n<br>\r\nJulie shook her head. \"I need <i>willing</i> help, Natalie.\" she replied, seriously. \"I can't have a cheerleader is going to whine and complain all the time, its not good for moral.\"<br>\r\n<br>\r\n\"So, I get a playmate for a while?\" asked Sarah, hopeful.<br>\r\n<br>\r\n\"I doubt 'Mary' will be in the mood to play for a while, Sarah.\" replied mom with a sigh. \"However, if she can apologize for her attack on Julie and if she accepts it, I might allow her to use the ECE serum for 'his' birthday party tonight.\"<br>\r\n<br>\r\n\"ECE serum?\" asked Sarah, lost.<br>\r\n<br>\r\n\"Emergency Counter Effect serum.\" said Julie. \"Its the equivalent to the all cancellation potion.\"<br>\r\n<br>\r\n\"Oh.\" said Sarah, still lost.<br>\r\n<br>\r\n\"It'll change me back to normal.\" you said, finally able to move again. you then turned back to Julie. \"I'm very, truly sorry I attacked you, sis. I got mad and overreacted, will you forgive me?\"<br>\r\n<br>\r\nJulie looked into your eyes and saw that your apology was sincere and slowly nodded. \"I forgive you.\" she said. \"However, you still need to learn to control yourself when yielding such power.\"<br>\r\n<br>\r\n\"I agree.\" said mom, seriously. \"Neither magic or science should be used as a toy. Sarah needs to learn this as well so Matt, starting tomorrow, you will be seven year old Mary for a week for your loss of temper.\"<br>\r\n<br>\r\nYou sighed, knowing it was pointless to argue. \"Yes, mom.\" you replied.<br>\r\n<br>\r\nMom smiled. \"It won't be so bad.\" she said. \"The experience will be good for you.\" she then turned to Sarah. \"As for you, young lady, its not nice to tease your brother with magic. You will be spending a day as a boy, starting tomorrow.\"<br>\r\n<br>\r\n\"What!?!\" screamed Sarah, in tears. \"A whole day!?!\"<br>\r\n<br>\r\nMom frowned. \"Do you want me to make it a week?\"<br>\r\n<br>\r\nSarah pouted, tears falling. \"No.\"<br>\r\n<br>\r\n\"Enough seriousness.\" said Natalie. \"Its time for Matt to enjoy his birthday.\"<br>\r\n<br>\r\nMom nodded. \"I agree.\" she said, turning to you. \"You may now change yourself back but remember, no lab for a week after this as you need to stay a girl for that time.\"<br>\r\n<br>\r\nYou nodded then ran off as mom and Natale giggled. \"This brings back wonderful memories.\" she said. \"I remember when your bother spent his first week as a girl during his retraining.\"<br>\r\n<br>\r\n\"Retraining?\" asked Julie.<br>\r\n<br>\r\nNatalie nodded. \"You see, word of John's power rattled the witch world as then only girls had real power.\" she said. \"Elvira, your great grandmother, had to act quickly to appease them.\"<br>\r\n<br>\r\nJulie nodded. \"I remember now.\" she said. \"John spent a year at witch school, learning magic, while he talked about his chaotic science. It was explained in a special class that they mirror each other.\"<br>\r\n<br>\r\nMom grinned. \"They mirror each other but they are not the same.\" she said. \"Only witch boys can work pseudo magic while only girls can work real magic, its a balance.\"<br>\r\n<br>\r\n\"So what now?\" asked Sarah, seeing you return in your male form.<br>\r\n<br>\r\nMom and Natalie looked at each other and nodded.<br>\r\n </span></div></div>",
            "created":1317921840,
            "id":1201669,
            "title":"seven years old."
        },
        "15433112":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "Swapping bodies with me",
                "Reading my memories"
            ],
            "content":"<div class=\"\"><div> <span>The next day, You wake up unchanged and head downstairs and see a male Sarah. Mom asks \"why didn't you become Mary again?\" \"I created a serum to keep me male without being changed by magic\" you say, \"You broke your promise Mat\" mom says \"yeah but I have my reasons\" you say. \"Tell me so I can help\" mom says \"you have to find out yourself\" you say, \"by\"</span></div></div>",
            "created":1325404380,
            "id":1250407,
            "title":"The next day, You don't go back to being Mary"
        },
        "154332":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Julie; You become a cheerleader.",
                "Sarah; You become a 7 year old balerina."
            ],
            "content":"<div class=\"\"><div> <span>Sarah threw her spell at you, much to Julie's annoyance, unaware that you were more than just annoyed. As the pink colored energy ball came closer, your face hardened and you rose your hand to stop it.<br>\r\n<br>\r\nSarah grinned, \"That won't save you...\"<br>\r\n<br>\r\nOnly her words died in her throat as her spell hit an invisible wall, just beyond your outreached hand. \"Sorry, siblings.\" you said, furious, lowing your hand. \"I have powers of my own!\"<br>\r\n<br>\r\nJulie and Sarah turned to you, shocked, then screamed as you summoned a pyrokinetic flame to your hand. It was not as strong as Julie's magic flame but strong enough to hold your own. You grinned at their shocked expressions then canceled your flame, turned, and walked away. As you slowly walked towards the basement stairs, you kept your senses on high alert of any magical attacks. Mom and Natalie both had shocked looks on their faces as well, knowing that it was an act made you grin more.<br>\r\n<br>\r\n\"How did you do that!?\" demanded Julie, sounding concerned. \"Only uncle John could...\" you turned to her with a sly grin on your face and she turned pale. \"Oh, crap! He didn't...!\"<br>\r\n<br>\r\n\"He did.\" you replied. \"I have nearly a full year of training.\"<br>\r\n<br>\r\nYou did not tell them that you were not as powerful as you had hoped to be. Your uncle John was a twin to a witch, creating a magical balance that made it easy for him to learn and develop his science quickly. As you had no twin sister, you had to work extra hard to grasp the fundamentals of chaotic science. However, like your mom, you had a steel determination and became just as powerful as any witch your own age. When John first started, he was as powerful as any witch with one year of training... and beyond.<br>\r\n<br>\r\nSarah seemed confused. \"Uncle John did what?\" she asked, turning between Julie and you. \"What did he do?\"<br>\r\n<br>\r\n\"Uncle John is a pseudo witch, Sarah.\" replied Julie, explaining. \"That means he has a science, equal to magic.\"<br>\r\n<br>\r\nSarah was shocked. \"Uncle John, a boy, a witch!?\"<br>\r\n<br>\r\nMom laughed. \"Yes, Sarah, my brother is a chaotic scientist.\" she said. \"The witching world had dubbed him a pseudo witch, or like a witch.\"<br>\r\n<br>\r\n\"Okay.\" said Sarah, slowly. \"So, he's like a witch.\" she shrugged, \"Why did he give this power to Mat?\"<br>\r\n<br>\r\n\"John's son, Joe, is too young, right now.\" replied Natalie with a sigh. \"That, and he's a known girl taunter.\"<br>\r\n<br>\r\n\"Joe doesn't hate girls.\" protested Sarah, lightly. \"He just likes to mess with our heads.\"<br>\r\n<br>\r\n\"Just like a certain sister in law I know.\" thought Natalie. \"Joe is not ready for that power, science or magic.\"<br>\r\n<br>\r\n\"I agree your cousin, Joe is not a girl hater.\" said mom, patiently. \"However, he takes his jokes too far and punishments from both magic and science don't seem to detour him.\"<br>\r\n<br>\r\nMom thought about John, he had married Megan Thompson and had four kids. Jessie (14) fresh out of witch school, she had long honey blond hair and green eyes. Lucy (13) with long honey blond hair and blue eyes. She just found out about magic and is eager to play with Joe. Jenna, (7) also having the same hair color and style, does not know about magic but carries a 'certain talent' that she keeps quiet... feels like a freak, making her very shy. Joe (8)  short brown hair and very strong, has a love for anything that builds his muscle mass. He taunts girls, just for fun, but does not know when to quit.<br>\r\n<br>\r\n\"The point is, John passed on his science to a boy he and the council believed deserved it.\" said Natalie, reeling mom from her thoughts. \"All of his closest aunts have girls in their family who will, no doubt, want to play with him as well, when they come visit.\"<br>\r\n<br>\r\n\"Think of this as a challenge, kids.\" said mom, smiling. \"Mat has the power to fight back but, he is still learning.\"<br>\r\n<br>\r\n\"Can we still play with him?\" asked Sarah.<br>\r\n<br>\r\nYou suddenly smiled. \"Only if you ask nicely.\" you replied. \"Also, I  have the power to change myself back... and change all of you, please do not force that.\"<br>\r\n<br>\r\nJulie nodded. \"I won't go too far with you, Mat.\" she said. \"I promise.<br>\r\n<br>\r\n\"I just want to play with you.\" said Sarah, tearing up.<br>\r\n<br>\r\n\"That's fine.\" you told her. \"I don't mind helping either of you but I will not allow you take anything too far.\"<br>\r\n<br>\r\nMom and Natalie turned to each other, smiling, they were up to mischief. \"so, Mat.\" said mom, smiling. \"Who would you like to play with first?\"<br>\r\n<br>\r\n\"A blind man in New Jersey could have seen <i>that</i> one coming.\" you thought sarcastically.<br>\r\n<br>\r\n\"The squad is really in a bind, Mat.\" said Julie, wincing. \"Could you please help your big sis out.\" she paused. \"I've been given a few lessons in chaotic science at witch school, maybe I can help you get stronger.\"<br>\r\n<br>\r\n\"I just want to have someone to play with for a few hours.\" said Sarah, competing with her older sister. \"You always told me that you wanted to be more flexible, like Uncle John, ballet will teach that.\"<br>\r\n<br>\r\nYou turned from Julie to Sarah, wondering what to do as mom and Elvira silently giggled in the background. They knew that you would fight against a magical experience so they had to trick you into one. \"At least they are leaving me with a choice.\" you thought. \"As little choice as it is...\"<br>\r\n<br>\r\nWho do you decide to help first?<br>\r\n</span></div></div>",
            "created":1289624400,
            "id":992961,
            "title":"the girls use their powers first"
        },
        "1543321":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Badly, runs off in tears.",
                "Well (is rewarded by mom.)"
            ],
            "content":"<div class=\"\"><div> <span>\"Two questions, Julie.\" you said. \"How long will I have to be a girl on your cheer squad and how old are you planning to make me for that time period?\"<br>\r\n<br>\r\n\"You would on the squad for no more than a week as my cousin, Madeline.\" replied Julie, serious. \"Also, you would be sixteen, same as me, just not my twin as too many things can go wrong if I did that.\" she paused, seeing your reluctance. \"You will be back to being 13 year old Mat the night before your birthday, I swear it.\"<br>\r\n<br>\r\n\"You already have beyond college level intelligence, Mat.\" said mom, grinning. \"Fitting in should be a breeze as long as you  keep in mind that you are a teenage girl.\"<br>\r\n<br>\r\n\"Julie just wants her squad in that stupid cheer leading competition.\" said Sarah, pouting. \"They're one cheer leader shy of entering and Julie knows that your love for dance makes you a good choice.\"<br>\r\n<br>\r\n\"Well, duh!\" replied Julie. \"I won't be asking him if I didn't think he could pull it off.\" she turned to you. \"The winner of the competition gets awarded a huge grant for their school for upgrades on uniforms, books, science labs...\"<br>\r\n<br>\r\nSarah began to pout, she knew that she could not compete with that but she still gave one last try. \"Ballet teaches more than flexibility, Mat.\" she said. \"It also teaches patience, discipline, and balance.\"<br>\r\n<br>\r\nYou sighed at your younger sister then turned to Julie. \"You know that lying is forbidden in this house, Julie.\" you said. \"Do I have your word that you will return me to my rightful age and gender on the evening on the eve of my birthday?\"<br>\r\n<br>\r\n\"You have my word I will return you to your rightful age and gender on the night of the eve of your birthday.\" replied Julie, seriously. \"I never break my word.\"<br>\r\n<br>\r\n\"Do you also promise to help me with my science when this is over?\" you asked, more calmly.<br>\r\n<br>\r\nJulie nodded. \"As promised, I and mom will help you.\" she said.<br>\r\n<br>\r\nYou sighed once more then slowly nodded. \"I'm in.\"<br>\r\n<br>\r\nJulie smiled. \"Welcome to the squad... Madeline.\" she said. \"I will transform you in the morning, before you shower, so you will have time to set up a story for your absence.\"<br>\r\n<br>\r\nHow does Sarah react?<br>\r\n</span></div></div>",
            "created":1290229200,
            "id":997527,
            "title":"Julie; You become a cheerleader."
        },
        "15433212":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You agree.",
                "You refuse."
            ],
            "content":"<div class=\"\"><div> <span>For a moment, Sarah looked as if she was about to fall into a bratty tantrum but she instead sighed, heavily, tearing up as she sat down. \"I can wait, I guess.\" she said. \"It's only a week.\"<br>\r\n<br>\r\nFeeling sorry for her, as you had your mom's heart, you walked over to Sarah and sat down next to her. \"I heard that your ballet class will be looking for new students for their annual recital next week.\" you said. \"Wouldn't it be better if I help you as one of those students?\"<br>\r\n<br>\r\nSarah looked at you, nearly crying. \"But, it takes two weeks to get ready for that recital.\" she said.<br>\r\n<br>\r\n\"I will be spending two weeks with Jule.\" you countered. \"One week as a cheer leader and one week as a rising pseudo witch, that will make you and your sister even, right?\"<br>\r\n<br>\r\nMom nodded, pleased that you were so willing to help your sisters, despite losing your manhood for nearly a month. \"I am very pleased that you are taking Mat's decision so well, Sarah.\" she said. \"As a reward, I will ask Mat to be your seven year old cousin until bed time.\"<br>\r\n<br>\r\n\"What!?\" you asked , shocked.<br>\r\n<br>\r\nMom grinned at you. \"I am not ordering you, Mat.\" she said, with a mischievous look. \"I am asking you.\"<br>\r\n<br>\r\nSarah looked at you hopefully as Julie suppressed a giggle. \"Not very sporting, mom.\" she thought. \"But very funny.\"<br>\r\n<br>\r\nYou sighed. \"Why me?\" you asked.<br>\r\n<br>\r\n\"I'll tell you what.\" said Natalie, grinning herself. \"Why don't you have a friendly duel with Sarah?\"<br>\r\n<br>\r\n\"A duel?\" you asked, nervous.<br>\r\n<br>\r\n\"That's a great idea.\" said mom. she then turned to you. \"If you win, you stay as Mat until tomorrow morning, if you lose, you become Sarah's little cousin until tomorrow.\"<br>\r\n<br>\r\nWhat do you say?<br>\r\n</span></div></div>",
            "created":1291093200,
            "id":1005412,
            "title":"Well (is rewarded by mom.)"
        },
        "154332121":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "The Duel Begins",
                "Interruption"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay. I agree.\" You say, \"But first\" Your mom says, \"I'm going to call an old friend and ask her about her son.\" She adds, after a few hours, Mom comes back with a boy your age with short black hair wearing a simple red shirt with the silhouette of a phoenix on it and a pair of blue jeans he's also wearing sneakers. \"This is Jake. My friend Tina's son they know of magic as Tina and her daughter Lily are witches aswell, and I invited Jake because he has taught himself some magic somehow.\" She adds, \"Actually Mrs. C, it's actually a special kind of chi that few males possess. It's like Chaotic Science, only it mimics magic even more so than Chaotic Science due to it actually waking the male's inner magical roots up quite a bit to where some of a Witch's spell can be used without it affecting the physical body to alter the genes.\" Jake says before adding, \"As such, I can use the chi whether I'm male or female. It just isn't pure magic. So if the battle gets way out of hand, I can interrupt a duel if it becomes too dangerous, to where even your own mother could get hurt due to the duel.\" \"Wow. I didn't even know that was possible, as it was never mentioned in Uncle John's book\" You say surprised. \"That is because Mat, It hadn't happened around the time he gave you the book. Only at that time, it was between two witches that're sisters, And the spells got so out of hand, That their mother who tried to interfere the slow it down almost ended up having her brain get damaged trying to block the blasts.\" He says. \"Well, thanks dude.\" You say before you notice Sarah is staring at Jake with eyes that you recognized as the eyes of someone who's been struck by Cupid's arrow. (News from the the author. \"The interruption option will be heading far into crossing over with Power Rangers, as the original version of this chapter went differently where Jake was named Nick and he's the Mystic Force Red Ranger. So, if you want to stay in The New Witch storyline with no crossover, just click \"The Duel Begins\" Option when it has a chapter made for that option that is. But if you want to see the essence of The New Witch's world crossing into Power Rangers, Just click the, \"Interruption\" Option. And sorry if the this chapter isn't making much sense to the logic you're probably used to from Runner's story. I just couldn't come up with a better idea for why Mat's mom wanted Jake/Nick to come over for the duel.)</span></div></div>",
            "created":1291525200,
            "id":1009185,
            "title":"You agree."
        },
        "1543321212":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Let's go.",
                "Sorry, too dangerous."
            ],
            "content":"<div class=\"\"><div> <span>Before the duel between you and Sarah could begin, Nick's cellphone went off and he immediately answered. \"Hello?\"<br>\r\n<br>\r\n\"Sorry cut your visit to mom short, Nick.\" said the voice on the other line. \"We need you to come back to Briarwood as soon as you can, Octomus and his minions are hitting the town hard, it looks bad.\"<br>\r\n<br>\r\nNick sighed. \"I can't even spend a few hours with mom anymore.\" he whispered, tearfully. then he said, \"I'm on my way!\" he placed his cellphone away then turned to mom. \"I got to go, Ms Powers.\" <br>\r\n<br>\r\n\"I understand, Nick.\" said mom with a sympathetic tone. \"Duty calls.\"<br>\r\n<br>\r\n\"Wait, what is this all about!?\" you asked concerned. \"Who is this Octomus?\"<br>\r\n<br>\r\nMom sighed and placed a hand onto your head. \"This will be faster than telling you.\" she said.<br>\r\n<br>\r\nInstantly, information flooded your mind...<br>\r\n<br>\r\nTwenty years ago, in a magic-filled dimension parallel world to your own, the forces of darkness came into power and a war called the \"Great Battle\" between good and evil began. An army of the Mbahgwie, led by a powerful warrior named Morticon, swarmed into the land with their sights set on taking over the magical realm, the human realm and beyond, but they would have to combat a legion of brave and powerful wizards. The Mystics battled valiantly against overwhelming odds until they drove the evil back from the edge of the human world. The strongest wizard of all, Leanbow, cast a spell and sent the evil warriors into the Underworld, having the Gatekeeper seal the gates for all eternity. The forces of truth successfully thwarted the dark forces' attempt to take the surface world, but they lost Leanbow, as he made sure the evil forces did not escape by sealing himself on their side of the Gate. The human world would never know of the Great Battle, nor of the sacrifices made to spare their lives from destruction. Even to this day they live in peace and tranquility, totally unaware of what is about to awaken.<br>\r\n<br>\r\nThe city of Briarwood was struck by an earthquake, which was just enough to crack the seal, allowing evil to renew its attempt to invade the human world. The sorceress Udonna, realizing that the forces of evil had returned, sought out the warriors of legend, five teens living in Briarwood, to become the Power Rangers alongside her. While one of the teens was reluctant at first, he realized his destiny and joined the others in the fight against the Master of the Underworld and his numerous minions.<br>\r\n<br>\r\nWhen Udonna loses her Ranger powers to the mysterious Koragg, it is up to Nick, Chip, Madison, Vida, and Xander to save the Earth on their own. They are assisted by Udonna's bumbling apprentice Clare, and eventually Jenji the Genie and his master Daggeron, the Solaris Knight.<br>\r\n<br>\r\nUsing their powerful magic and incredible martial arts skills, the Mystic Force Power Rangers rely on teamwork to hold back the forces of evil.<br>\r\n<br>\r\n\"To protect their families, the members of the Power Rangers sent all of their immediate families to this dimension.\" said mom releasing you. \"Here, they will remain safe as your grandmother, the head witch, and the Mystic Mother, the head witch in Nick's world, are the only two who can open the portal between the two worlds.\"<br>\r\n<br>\r\n\"This Octomus sounds like a real problem.\" you said. \"Let me come with you, my chaotic science should come in handy and give that villain a real nasty surprise.\"<br>\r\n<br>\r\nNick looked at you for a moment, then replied...<br>\r\n</span></div></div>",
            "created":1291698000,
            "id":1010256,
            "title":"To protect ones family."
        },
        "15433212121":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "in briarwood"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you sure about this Mat it's dangerous? Nick asks, i'm sure you say, mom is it ok? you ask, it's your decision Mat mom says, thanks you say, let's go you say, right Nick says.........</span></div></span></div>",
            "created":1291698000,
            "id":1010309,
            "title":"Let's go."
        },
        "154332121211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Return home.",
                "Become the Dragon Ranger."
            ],
            "content":"<div class=\"\"><div> <span>Upon arriving in Briarwood, Nick received a communique from Sensei on his wrist mounted unit. \"You must come to the shrine with your friend.\" he said. \"It is urgent.\"<br>\r\n<br>\r\n\"We're on our way, Sensei.\" replied Nick. he turned to you. \"Sensei is out leader, his appearance may surprise you.\"<br>\r\n<br>\r\n\"I deal with insanely advanced science.\" you told Nick. \"Nothing can surprise me.\"<br>\r\n<br>\r\nMinutes later, you were in the shrine with Nick where you met Sensei. You had to admit, you did not expect to find an intelligent rodent but you were not about to say it out loud.<br>\r\n<br>\r\n\"It was a mistake for you to bring Mat here, Nick.\" scolded Sensei. \"You see, Mat has a power here as well.\"<br>\r\n<br>\r\n\"Yes, his chaotic science.\" said Nick. \"I told him it was dangerous to fight the villains we face...\"<br>\r\n<br>\r\n\"It is not his chaotic science that concerns me, Nick.\" said Sensei. \"You see, long ago, there was an evil ranger, the green ranger. This ranger was brainwashed by a villain known as Rita Repulsa. The original Power Rangers Team, lead by the mighty and wise Zordon, eventually helped the green ranger break free of Rita's control and he turned good.\"<br>\r\n<br>\r\n\"Only, thanks to a new villain, Lord Zed, Tommy, a.k.a. the green ranger, lost his powers.\" said Nick. \"Later, Zordon gave Tommy a new ranger persona, the white ranger.\"<br>\r\n<br>\r\nSensei nodded. \"Correct.\" he said. \"However, Lord Zed later cloned Tommy and resurrected the green ranger. Tommy and his clone fought each other. Only, during a mission into the past, 1800s, the clone was freed from Lord Zed's control and he decided to stay there.\" Sensei paused. \"Where they were was not the past of this world but the other.\"<br>\r\n<br>\r\n\"What... What name did Tommy's clone take on when he decided to stay?\" asked Nick.<br>\r\n<br>\r\nSensei took a breath. \"Tom Green Cutie.\"<br>\r\n<br>\r\nYour eyes bugged out in shock. \"That was my great grandfather!\" you exclaimed.<br>\r\n<br>\r\nSensei nodded. \"Yes, Mat.\" he said. \"You are the next boy in line to claim the power of the original Green Ranger Only, due to the fact that we already have a green ranger, I would dub you the Dragon Ranger as you would have power over the Dragon Zord, still sleeping at the bottom of the ocean.\"<br>\r\n<br>\r\n\"That is so cool!\" said Nick, excited. \"The legendary Dragon Zord will be a great help!\"<br>\r\n<br>\r\n\"Control yourself, Nick!\" scolded Sensei. \"There is a catch to obtaining the power of the 'Dragon Ranger'.\"<br>\r\n<br>\r\n\"What is that?\" you asked.<br>\r\n<br>\r\n\"If you accept the power, you will be rapped in this world until peace is restored, which could take years.\" replied Sensei, seriously. \"If you choose to return home, you will not be able to return until peace here is restored, nor will I allow Nick to go looking for you again.\" he paused eying his pupil. \"The choice is yours.\"<br>\r\n<br>\r\nWhat do you choose?<br>\r\n</span></div></div>",
            "created":1294635600,
            "id":1032905,
            "title":"in briarwood"
        },
        "1543321212112":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>like i would let a world be in trouble i'm staying but can i tell my family bye and call a good friend? you ask, ok sensei says you tell your family bye and call your friend Jake he's 12 like Nick. he's pirate red you say he can become any ranger from the past i'm willing to help since i couldn't stop the great war but i'll help save this world, ok sensei says.......</span></div></div>",
            "created":1304744400,
            "id":1101773,
            "title":"Become the Dragon Ranger."
        },
        "154332122":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Become Sarah's twin.",
                "The extra birthday surprise."
            ],
            "content":"<div class=\"\"><div> <span>You immediately shook your head. \"I won't duel her, mom!\" you said, firmly. \"It would not be a fair match up as I have a year of training against her, what, a few weeks, at most?\"<br>\r\n<br>\r\n\"One month.\" said Sarah, slightly down cast. \"I can change you into a girl and back, fire off energy blasts, and make a few potions but that's all I know how to do right now.\"<br>\r\n<br>\r\nMom was inwardly pleased that you did not want to take advantage of your little sister's lack of experience but she still had to reward her for her good behavior. \"I see.\" she said, softly. \"How about you be Sarah's little cousin, just until we all sit down for dinner?\" she smiled. \"That way, Sarah will have a playmate for a few hours and you will be left alone the rest of the night, as Mat.\"<br>\r\n<br>\r\nYou sighed, sensing that you were not going to win. \"Fine.\" you said, rolling your eyes. \"But I should get rewarded too.\"<br>\r\n<br>\r\n\"He has a point, Hannah.\" said Natalie, serious. \"He is willing to play along and he will be facing at least a month as Mary through all of this.\"<br>\r\n<br>\r\nHannah nodded. \"You are right, Mat.\" she said. \"You do deserve a reward for being such a good sport. I will allow you to either learn what it is like to be a twin to a witch, as your uncle John was, or an extra little surprise on your birthday next week.\"<br>\r\n<br>\r\nNatalie hid her grin well, knowing what Hannah might have in mind as a 'surprise' but she was concerned about you becoming a twin to a witch as your powers were greater than Sarah's. \"Hannah may end up transforming Sarah instead if Mat choses to be her twin.\" she thought. \"I just hope she's ready to deal with a hysterical 'Seth'.\"<br>\r\n<br>\r\nWhat do you chose?<br>\r\n</span></div></div>",
            "created":1295154000,
            "id":1036553,
            "title":"You refuse."
        },
        "1543321222":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Sorry, not this time.",
                "Okay, but be careful."
            ],
            "content":"<div class=\"\"><div> <span>You moaned. \"Hologram John warned me about the twin factor.\" you said. \"No thank you., I'll take the extra surprise on my birthday and I hope its not something that will make me a girl again, I will have had my fill of it by then.\"<br>\r\n<br>\r\nMom hid her disappointment well. \"It'll be something you'll like.\" she said. \"I promise.\" then she thought, <i>\"Now I just have to think of what it could be.\"</i><br>\r\n<br>\r\n\"Okay, who's going to make me Mary until dinner?\" you asked.<br>\r\n<br>\r\n\"It would be best if I do that.\" said mom. \"We don't want any accidents.\"<br>\r\n<br>\r\n\"Please let me do it mom.\" begged Sarah. \"I promise I'll be careful and, if I mess up, he can always change himself back with his whatchamacallits.\"<br>\r\n<br>\r\nMom giggled while Natalie smiled, both shaking their heads. \"It's pseudo magic, Sarah.\" corrected mom. \"Or, as the boys call it, chaotic science.\"<br>\r\n<br>\r\n\"Whatever, can I do it, mom... please?\" asked Sarah.<br>\r\n<br>\r\nMom sighed then turned to Natalie. \"What do you think?\"<br>\r\n<br>\r\nNatalie shook her head. \"I'd advise against Sarah trying, she's too young but I can not make that decision for you.\"<br>\r\n<br>\r\nMom nodded then turned back to Sarah and said...<br>\r\n</span></div></div>",
            "created":1309496400,
            "id":1138651,
            "title":"The extra birthday surprise."
        },
        "15433212222":{
            "author_id":"batmanace00",
            "author_name":"Jack",
            "choices":[
                "continue",
                "one month later"
            ],
            "content":"<div class=\"\"><div> <span>Sure Sarah but becareful mom said, I will Sarah says. You feel yourself becoming a 7 year old girl, How do you feel Mary? mom asks. I feel ok but I'm only staying like this for one month you say, Okay and you'll get your surprise mom says. \"shall we go on through your month as Mary? or skip to when you get your surprise?\"</span></div></div>",
            "created":1316062800,
            "id":1188006,
            "title":"Okay, but be careful."
        }
    },
    "info":{
        "author_id":"batmanace00",
        "author_name":"Jack",
        "brief_description":"a continue to runners story the witch no killing.",
        "created":1288843380,
        "description":"<td align=\"left\" class=\"norm\"><a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1642255-The-Witch/\" target=\"_blank\">http://www.writing.com/main/interact/item_id/1642255-The-Witch/</a> takes place 28 years after the witch where Hannah's family is all witches except for her son Mat here are the characters. Mat you 13 years old he's just like his uncle John. Hannah your mom she's 35 she's really good looking she has a hourglass figure her hips always sway she only has high heels. Julie 16 she's a cheerleader and also only has high heels. Sarah 7 she's a brat she's really girly. Tom and Jenny Mat's friends 13 and Runner you rule.</td>",
        "id":1721850,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1554826620,
        "modified":1554826620,
        "pretty_title":"The New Witch"
    }
}