{
    "chapters":{
        "1":{
            "author_id":"giantessmeal",
            "author_name":"Giantessfan25",
            "choices":[
                "Sam",
                "Gavin",
                "Lucy",
                "Hope",
                "More characters?"
            ],
            "content":"<div class=\"\"><div> <span>In the small town of Stamford, people live peacefully. It’s a nice place where most people are friendly to on another. However, people have been noticing something new appearing in town, small green wind. The wind just showed up one day and kept appearing and disappearing at random. It had gotten to the point where people have started making rumors about it.<br>\r\n<br>\r\nAs more rumors started to pop up, citizens stayed away from the green wind, afraid of what it does. What they didn’t know was that whoever touched the wind would shrink down. However, you hadn’t heard many rumors about the wind, leaving you naive to the danger.<br>\r\n<br>\r\nWho exactly are you?<br>\r\n<br>\r\n</span></div></div>",
            "created":1548651600,
            "id":2608961,
            "title":"The mysterious green wind"
        },
        "11":{
            "author_id":"giantessmeal",
            "author_name":"Giantessfan25",
            "choices":[
                "Home",
                "School",
                "Girlfriend’s house",
                "Arcade",
                "Store"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Sam. You have short brown hair, blue eyes, and are pretty skinny. You love to explore no matter where it is. There had even been a time where you accidentally found yourself in a teacher’s lounge due to looking around. You have quite a few friends and do your best in school.<br>\r\n<br>\r\nYou live with your mother (Olivia) who’s 40 years old and has long brown hair and brown eyes. She is considered to be one of the most beautiful women in town, sometimes causing boys to stare at her beauty. She always worries about where you’ll go or what you’ll do next.<br>\r\n<br>\r\nYou also have an older brother (Bruce) who is 19 years old with black hair and blue eyes. He does well in school and has quite a few friends. However, he typically treats you as inferior. Bruce usually tells you to do things for him or tells you how much better he is than you.<br>\r\n<br>\r\nYou have a lovely girlfriend (Elizabeth) who is 17 years old and cares about you a lot. She loves to hang out with you and even likes to work or play games with you. Her favorite game is cat and mouse because she gets to chase and toy with you at the same time. However, sometimes she can be a bit too clingy. There had been one time where she held your non dominant arm for an entire history class period (the teacher didn’t mind at all and even found it amusing).<br>\r\n<br>\r\nOn the day that you encountered the wind, where did you start off at?</span></div></div>",
            "created":1548738000,
            "id":2609342,
            "title":"The adventurous one"
        },
        "115":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Saw a Thirty Something Year Old Woman Shopping Down The Aisle",
                "Heard \"Cleanup at the Eggs\" Over the Sound System",
                "Decided To Explore The Store at your New Height"
            ],
            "content":"<div class=\"\"><div> <span>Your mother had asked you to make a quick stop at the local grocery mart, a chain which was common in the part of the country you lived in to pick up some eggs for the meal she was making tonight. You were now walking through the automatic doors, looking around for the aisle which was labeled to what you desired.<br>\r\n<br>\r\n You made your way past the cash registers and through the somewhat occupied store, down several rows of assorted products that you weren't interested in, before you spotted the aisle which held your treasured eggs. You made your way past the flour and vinegar, before stopping at the wide assortment of eggs they offered here, grabbing a pack and opening it to see if there was any cracks on the eggs.<br>\r\n<br>\r\n As you looked up to head out, a green gas surrounded you, and your vision went fuzzy. You were temporarily immobilized before your sight gave altogether, along with your consciousness. You woke up on the cold tile floor of the supermarket, before a very startling realization had come upon you. You were now six inches tall, and resting next to you was a carton of spilled eggs.<br>\r\n<br>\r\n Freaking out, you sought what you remembered from the collapse and recalled the gas, which must have somehow been responsible for the event. Luckily, your clothing had gone down with you, so you were still fully clothed, though now the clothing seemed rather suited for a ken doll than your typical teenage boy.<br>\r\n<br>\r\n You looked around frantically for any kind of help, before you</span></div></div>",
            "created":1548910800,
            "id":2610844,
            "title":"Grocery Store Run"
        },
        "1153":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Checking Out The Cash Register's",
                "Seeing What The Pet Section Offered",
                "Hitching A Ride In a Purse and Hightailing it Out Of There"
            ],
            "content":"<div class=\"\"><div> <span>As you looked around at the now skyscraper sized racks of ordinary items, you realized that the world had just become an entirely new place for you. What used to be just a plain box of cheerios now was a mural painted on a wall for someone of your newfound stature. You got off your ass, made your way around the spilled eggs, and walked towards the bottom shelf.<br>\r\n<br>\r\n Pulling yourself up, you made your way to the back of the shelf, where you saw holes big enough to hang on to. You started to climb the shelf, using your well toned body to make your way further up the now building sized store furniture. You could see the end up top, so you pulled your way up, and reached the highest shelf.<br>\r\n<br>\r\n The view was amazing up there, you could see the entire store. There was giant people walking in and out, not paying any attention to what seemed to them like just another day, pulling another errand at the supermarket. You looked around, seeing all the products and sections of the store, spotting several areas which it might be interesting to check out at such a small size.<br>\r\n<br>\r\n You finished your pondering, finally deciding on</span></div></div>",
            "created":1548910800,
            "id":2610866,
            "title":"A Whole New World"
        },
        "11532":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Were Grabbed by the Hand of a Shopper",
                "Were Grabbed by the Hand of an Employee",
                "Hid Quickly"
            ],
            "content":"<div class=\"\"><div> <span>Seeing that the pet isle was no further than a couple shelves down, you started your trek to see the giant fishes. Just a goldfish must look like a shark at your size. You trot down the metal shelf, towards a sign hanging between the next one. You crawl along the string connecting the two shelves easily, before heading towards the next one, which connected your current shelf to the fish aisle.<br>\r\n<br>\r\n Pulling yourself over this string once again, you finally saw what you had hoped to. There was a goldfish which was scaled to an extreme size, and you gasped in awe at the creature. You saw a very good perspective on it's scales, observing all of the beauty in the details that anyone would have taken for granted.<br>\r\n<br>\r\n<br>\r\n Maybe this size loss wasn't such a bad thing, you thought as you stared at the beast which was nothing more than a thoughtless house pet. Suddenly, there was a noise on your aisle, and you </span></div></div>",
            "created":1548910800,
            "id":2610878,
            "title":"Giant Fishes"
        },
        "115321":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Her Home",
                "A Friend's House",
                "A Clothing Store"
            ],
            "content":"<div class=\"\"><div> <span>You turned to slip between the fish tanks, but as you started to move you felt a warm appendage wrap around your tiny body, grasping your entire body. You looked down at the tanned, beautifully manicured fingers which were pulling you off of the shelf and fought hopelessly. The woman who held you turned you around, getting a good look at your face as you looked back, seeing a beautiful young Hispanic woman in her mid twenties. She grinned, her lips growing wide as you admired her.<br>\r\n<br>\r\n She was sexy to say the least, with decent sized breasts and an ass the size of something you had never seen, then again any ass would be the biggest you had ever seen now you had fallen victim to the gas. She was wearing a white tank top with jeans that were way too tight, hugging against her like they wanted to escape their denim prison.<br>\r\n<br>\r\n \"What do we have here?\" She said deviously with a slight accent as your heart skipped a beat.<br>\r\n<br>\r\n \"I shrunk down to this size, do you think there's any way you could help?\" You asked her hopefully, yet realistic about your chances.<br>\r\n<br>\r\n \"I think I might help myself to a new little pet, it seems like nobody will miss you. I came here looking for a fish or something small, but a half foot man will do the trick. Much better at following orders if you catch my drift.\" She giggled, as you realized escape from her was vital if you wanted to live a free life.<br>\r\n<br>\r\n \"Please miss! My name is Sam and I need to be let go!\" You plead, hoping that she would show some mercy upon you.<br>\r\n<br>\r\n She soon silenced your hope, saying \"Well Sam, I'm Maria, not Miss, and I don't think you'll ever be let go. You're way too cute!\" before bringing you to her gigantic lips, and planting a wet kiss over your head, giving you a good look at the massive teeth of the predator who's hands you had fallen in to. \"Now please excuse me, I need to buy some equipment for my new pet.\" She said with a giggle, before lowering you to her purse, where she dropped you.<br>\r\n<br>\r\n You landed with a thud against the leather, the smell giving away the material to you. There were gigantic makeup kits laying around, a tube of lipstick which seemed to be your same height rolling around on the floor of the bag. You sat, contemplating your situation, deciding that maybe it wasn't as bad as it could possibly be at the moment. After all, there were worse looking people to be at the mercy of, and right now you were lucky that somebody hadn't squashed you under their sole.<br>\r\n<br>\r\n You waited patiently as you heard your new proclaimed owner purchase some kind of tank for you, along with some doll furniture before making her way back outside to her car. She set the bag on the passenger's seat, before starting the vehicle up, taking you to</span></div></div>",
            "created":1548997200,
            "id":2611317,
            "title":"Maria's New Pet"
        },
        "1153211":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "a guy coming in with Maria",
                "a woman coming with Maria",
                "Maria coming in holding...."
            ],
            "content":"<div class=\"\"><div> <span>Maria drove home quickly, she was very excited in the new pet that she has acquired. All the while you just sat in the bag trying to be optimistic about your new situation. As the car came to a park you were tumbling around the inside of the bag as Maria picked it up with ease and then preceded to grab the rest of the bags from her shopping. She went up a flight of stairs and into her apartment. She set the bag that you were in down for a moment as she went to put together your new home. And once she was done she came back to grab you and bring you to it.<br>\r\n<br>\r\nSeeing the first bit of light pour in since you were caught by Maria, you were blinded at first as her giant hand swoop you up and placed you into your new home. Gaining vision back you see that there is doll furniture spread around with some kind of hamster flooring beneath you and  there also seems to be no walls around you, just clearness. But as you walk forward you hit the wall of glass. Then you are greeted with Maria gorgeous giant face.<br>\r\n<br>\r\n<span class=\"crose\">\"So how do you like it? I thought about a hamster cage but figured you might find yourself climbing it and \"mistakenly\" escape it. So a fish tank seemed like the best and safest choice for... You know what I haven't named you yet have I? hmm...\"</span> Maria stands there bent over looking at you with a thinking face on. You knowing that you have already told her your name just come out and say<span class=\"cblue\"> \"Maria my name is already Sam...\" </span>Maria cuts you off with saying<span class=\"crose\"> \"NO No no, that is just the name that you came with. That is like if you bought a dog they all come with names but as your new owner I need to come up with a name. And I think the perfect name for you is Chip. Its an absolute adorable name for such a cutie\"</span> Maria says all happy as she lifts your tank up and places it in on her dresser. Then she says that she has to grab the rest of her groceries and tells you to make yourself at home as she also makes a phone call.<br>\r\n<br>\r\nWith her out of the room, you begin to think that this whole pet thing needs to stop now. You don't want to have your name changed and be nothing but a pet. Plus what are you really going to be doing all day just standing around this fish tank, waiting for your owner to come home. I mean your always up for a new adventure but you also want to be free to choose what adventure you go on. You then decide right then and there that you have to find a way out of this insane place. <br>\r\n<br>\r\nJust then though Maria comes back into her room, walking towards your tank. But instead of saying anything to you she just opened her drawers and toke out some pieces of cloth's. Your then reminded very quickly of why this situation is so bad. As Maria begins to undress. Your body can't help itself but get erect as you see Maria in her bra and panties. She begins to take off her bra as she looks over and see's you starring at her. Getting a smirk, followed by an angry face she walks over to your tank with something in her hand. Then suddenly your vision is covered in darkness as Maria ha just put a towel over your tank.<br>\r\n<br>\r\nConfused you hear Mari say<span class=\"crose\"> \"I will not have some perv as a pet. You will learn to respect your owner and not eye her as some hooker. And then maybe in time you will be rewarded with seeing your owner's beautiful body\"</span> Hearing this you get a little disappointed, I mean that was the only pro to being this chick's pet. But then you watch as the towel comes off and your greeted with Maria wearing jeans and a new bra. Your mood seems to get excited all over again as you see her boob's. Ignoring what was said before you think again that this won't be so bad, as a new tank top cover's her boob's right up.<br>\r\n<br>\r\nJust then you hear a knock on Maria's front door. She looks down at you and says <span class=\"crose\">\"That was quick, I'll be right back my little cutie...\"</span> Maria says as she walks out of her room and towards her front door. During this time alone you seem to be finding yourself weighing pro's and con's again of staying versus leaving. But as you were thinking about this Maria has re-entered her room and you feel humiliated as you see...</span></div></div>",
            "created":1575608400,
            "id":2756251,
            "title":"Pet life begins Now!!"
        },
        "12":{
            "author_id":"giantessmeal",
            "author_name":"Giantessfan25",
            "choices":[
                "In your home, in the basement",
                "Driving to a casino",
                "Taking a walk in front of your neighbor’s home",
                "At your job (working as a bartender)",
                "Taking a walk in the forest"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Gavin. You have short red hair with green eyes. You are extremely rich and quite spoiled, causing you to think of others as inferior to you. Though you’re not the worst person, you’re a bit rude to others and let yourself become arrogant.<br>\r\n<br>\r\nYou have made quite a few enemies over time, a couple of which even have threatened you before. One such person is your neighbor, Amelia, who thinks you’re a bad influence on people. She has threatened to harm you or steal your money a lot, yet you have always ignored her warnings.<br>\r\n<br>\r\nOn the day you encounter the wind, you were…</span></div></div>",
            "created":1550293200,
            "id":2618366,
            "title":"A spoiled corrupted person"
        },
        "13":{
            "author_id":"giantessmeal",
            "author_name":"Giantessfan25",
            "choices":[
                "Home",
                "Work(in the cafeteria)",
                "A restaurant",
                "The mall",
                "The barber shop"
            ],
            "content":"<div class=\"\"><div> <span>You are Lucy, a 40 year old woman with long brown hair and green eyes. Though you like helping others, you have a hard time speaking to people. This issue has been with you ever since elementary school. When you’re not currently shy, you like to have fun. You currently work at the public pool in the cafeteria serving food. Though you stay quiet, everyone is nice to you and you really like the job.<br>\r\n<br>\r\nDespite being shy around people, you were still able to end up with a good husband. Carlos(your husband) is 39 years old with short black hair and blue eyes. He is pretty good with speaking to others and sometimes helps you tell others what you want to say. Carlos is a pretty good cook and almost always provides dinner for the family.<br>\r\n<br>\r\nYou also have 3 children, two daughters and a son. Your oldest daughter (Lily) is 18 years old with long brown hair and blue eyes. She likes to wear small shirts that don’t cover her bellybutton. Lily tends to tease and flirt with a lot of boys, though she has never brought any into the house. She does well in class and doesn’t like to be late.<br>\r\n<br>\r\nYour second daughter (Amy) is 10 years old with ginger hair and a pony tail. Amy is usually innocent but always causes trouble every now and then. Though you have talked to her, it never stops her permanently.<br>\r\n<br>\r\nYour son (Benjamin or Ben for short) is 16 years old with short black hair and green eyes. He typically ignores what you and Carlos tell him to do. He gets good grades at school and has a few friends. Ben loves to play video games and will typically play them when he doesn’t have homework.<br>\r\n<br>\r\nWhere exactly are you on the day that you encountered the special wind?</span></div></div>",
            "created":1548824400,
            "id":2609668,
            "title":"A shy but successful woman"
        },
        "14":{
            "author_id":"giantessmeal",
            "author_name":"Giantessfan25",
            "choices":[
                "Home",
                "Restaurant",
                "Park",
                "Holly’s place",
                "The gym"
            ],
            "content":"<div class=\"\"><div> <span>You are Hope, an 18 year old girl with long ginger hair and blue eyes. You always try to help people when you can and rarely lose your temper. Whenever you’ve found yourself in a bad situation, you never lose hope and look for the positives. You are quite a fit person, having a lot of energy.<br>\r\n<br>\r\nYour mother (Luna) is 50 years old also with long ginger hair and blue eyes. Ever since her husband left her, she’s been taking care of you by herself. Luna likes to read and study things. She has also been seeing someone (though you’ve never met them and and are completely unaware to their identity).<br>\r\n<br>\r\nYour best friend (Holly) is 18 years old with short blond hair and blue eyes. She has known you ever since you were little and is always there when you need her. Holly isn’t afraid to show who she is and loves to have fun. She is pretty stubborn though, doing something once she has made up her mind and isn’t easily persuaded otherwise once she’s reached that point. She once took you to a party, not taking no for an answer.<br>\r\n<br>\r\nOn the day you encountered the wind, where were you?</span></div></div>",
            "created":1548824400,
            "id":2609751,
            "title":"The kind and athletic girl"
        },
        "142":{
            "author_id":"giantessmeal",
            "author_name":"Giantessfan25",
            "choices":[
                "Another customer",
                "George",
                "The kitchen",
                "You were suddenly picked up by another employee"
            ],
            "content":"<div class=\"\"><div> <span>You went to one of your favorite restaurants in town. They were known for great food and how nice the employees were. Though you didn’t have an official job, you always helped clean up messes when you were there.<br>\r\n<br>\r\nOn the day you were there, you had ordered a steak with something fries. As you ate your steak happily, one of the employees came by. His name was George and always liked seeing you there.<br>\r\n<br>\r\n“How is our best customer doing?” He asked, making you giggle.<br>\r\n<br>\r\n“I’m fine, but I doubt I’m your best customer. Surely, there are other who love your food.”<br>\r\n<br>\r\n“I see you in here more than anybody else. If I didn’t know any better, I would have thought you worked here.” He joked. You giggled as he left. You had been offered a job, but you just weren’t ready to get one yet. You went to the bathroom, thinking about George.<br>\r\n<br>\r\nHe was a nice guy, and had asked you on dates before. You’ve always turned him down, not knowing if you were ready for that. Though you liked making others happy, you still didn’t feel prepared to move onto the next step in your life. You went to wash your hands when you suddenly noticed some green wind.<br>\r\n<br>\r\n“What on Earth?” You said quietly, approaching it. As you reached out to it, it suddenly surrounded you, making you pass out. When you woke up, you had shrunk down along with your clothes. You ran out of the bathroom and looked around. Everything was giant, and nobody was aware of your presence. “I need to get help…now!” You said, nervous. You started to run to…</span></div></div>",
            "created":1548910800,
            "id":2610688,
            "title":"A place that smells good"
        },
        "143":{
            "author_id":"giantessmeal",
            "author_name":"Giantessfan25",
            "choices":[
                "Deciding to get your mother’s help",
                "Deciding to get help from one of the kids running around",
                "A woman with a large belly notices you and picks you up",
                "A bird suddenly grabbed you and took you to its nest"
            ],
            "content":"<div class=\"\"><div> <span>It was a peaceful day so you and your mother hand gone to the park. Your mom had started to read a book while you kicked around a ball with your friends. After you played with them for a bit, you laid down in the grass and stared up at the sky.<br>\r\n<br>\r\nLife was good and filled with a lot of positives. However, things had gotten a tab boring. Though you weren’t complaining about your life, you still wished something exciting would happen. You closed your eyes and listened to the sounds of the park.<br>\r\n<br>\r\nAs you closed them however, a mysterious green wind approached you. You had no idea it was even there or the fact that it was starting to surround you. Without realizing it, you breathed it in causing you to pass out.<br>\r\n<br>\r\nWhen you woke up, your head was a bit dizzy. You looked around to see that nobody had noticed you pass out. You looked over at your mother who was still reading her book quietly. As you took a step towards her, someone ran past you, but they were giant! Another person ran past you, almost crushing you in the process. You started to panic a little at your situation.<br>\r\n<br>\r\n“I can’t believe it, I shrunk! How small am I?” You asked yourself. In truth, you had shrunk down to 6 inches, a good size to be man-handled. You were a bit scared, but also pretty excited. Your wish had come true! Though, you sort of hoped it wouldn’t involve putting yourself in actual danger. You took a minute to think before…</span></div></div>",
            "created":1551243600,
            "id":2623816,
            "title":"A peaceful afternoon"
        },
        "1431":{
            "author_id":"giantessmeal",
            "author_name":"Giantessfan25",
            "choices":[
                "She had noticed you and realized who you were",
                "She had noticed you, but thought you were a doll and took you to lost and found",
                "She had noticed you but thought you were some sort of disgusting creature",
                "She hadn’t noticed you, so you had to keep climbing"
            ],
            "content":"<div class=\"\"><div> <span>You decided to go for your mother. She was the closest and the person you trusted the most. You ran over to her foot and looked up. She was so focused on her book, she had no idea what was going on. You suddenly realized just how tall she was though, you were like a doll to her.<br>\r\n<br>\r\nYou jumped onto her giant shoe. It smell really bad and almost made you pass out. You shook it off and started to climb. As you got to her knee though, she suddenly moved her leg onto her other one. The sudden shakes caused you to lose your grip, causing you to fall. You panicked and quickly grabbed her pants again, stopping your descent. You shuddered and looked up at your mom, who was still unaware of your situation.<br>\r\n<br>\r\n“Mom! How can you be so oblivious?” You said quietly. You continued up her leg until you got to her knee. Once you were on stable ground, you took a deep breath before continuing to her pelvis. You looked up, hoping she had spot you now that you were in a more detectable spot.</span></div></div>",
            "created":1551330000,
            "id":2624492,
            "title":"The giantess mountain climb"
        }
    },
    "info":{
        "author_id":"giantessmeal",
        "author_name":"Giantessfan25",
        "brief_description":"You soon find yourself shrunk. In a world of giants, you must now try to survive.",
        "created":1548703680,
        "description":"<td align=\"left\" class=\"norm\">Youâ\u0080\u0099re experiencing a normal day when you come across something youâ\u0080\u0099ve never seen before. When you go to investigate, you find yourself shrunk down to a measly 6 inches.<br>\r\n<br>\r\n<u><b>Rules</b></u><br>\r\nNo scat<br>\r\nNo watersports<br>\r\nNo sexual content involving characters ages 15 or below<br>\r\nTry to get at least a paragraph (unless itâ\u0080\u0099s a choice chapter)<br>\r\nOther than that, anything else is fair game<br>\r\n<br>\r\nYou are able to add your own characters if you want<br>\r\nThe story starts in 2nd person but changing it to 3rd person is allowed (just try to stick to one when it gets going so as to avoid confusion)<br>\r\n<u><b>Starting Characters</b></u><br>\r\n<br>\r\nSam (16)= Adventurous and likes to explore<br>\r\n<br>\r\nGavin (25)= Tough, not exactly nice to others causing them to turn on him<br>\r\n<br>\r\n Lucy (40)= A bit shy, making it harder for her to speak up<br>\r\n     <br>\r\n Hope (18) A kind person who tries to see the positives even when sheâ\u0080\u0099s afraid<br>\r\n<br>\r\n<br>\r\nHuge thanks to Triplestories for helping make this possible<br>\r\n</td>",
        "id":2181148,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1575659160,
        "pretty_title":"Shrinking Frenzy"
    }
}