{
    "chapters":{
        "1":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "...pants",
                "...shorts",
                "...a skirt",
                "...a dress"
            ],
            "content":"<div class=\"\"><div> <span>Three months had passed since Allison started wearing diapers, due to bladder control problems. Her mother, Linda, was making her wear them. Allison hated it. They made her feel like a baby. She was glad though that she had been careful whenever she went out in public in them. She also had to bring extra ones with her so she could change herself when necessary. As far as she knew, no one but her mother knew she was wearing diapers underneath her clothes.<br>\r\n<br>\r\nIt was a school day. Linda usually drove her there and picked her up. Lately, she had also been checking to make sure her daughter was wearing a diaper each day, which embarrassed Allison. <br>\r\n<br>\r\nAllison looked in her closet for something to wear for school. She eventually decided to put on…</span></div></div>",
            "created":1328590800,
            "id":1272226,
            "title":"The Beginning"
        },
        "11":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Allison’s pants rip",
                "Her pants fall down",
                "She gets to class",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>…pants. She had only been wearing pants since she started wearing diapers in order to ensure no one would see them. She got dressed and Linda took her to school.<br>\r\n----<br>\r\nAt school, Allison was in the hallway with her best friend Marie, on their way to their first class.</span></div></div>",
            "created":1328590800,
            "id":1272227,
            "title":"...pants"
        },
        "111":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Allison goes to get her pants sewn up",
                "She goes to the lost and found to find another pair of pants",
                "Marie lets her borrow something of hers"
            ],
            "content":"<div class=\"\"><div> <span>As they got closer to class, Marie realized she needed something.<br>\r\n<br>\r\n“Can I borrow a pen?,” she said to Allison.<br>\r\n<br>\r\n“Sure,” said Allison. She reached into her bag and took out a pen, only to drop it on the floor. When she bent down to get it, she heard a horrible ripping sound coming from the seat of her pants.<br>\r\n<br>\r\nA huge hole had formed, and her diaper was exposed. “NO!,” she thought. She picked up the pen and stood up with her back against a wall. Marie had also heard the ripping sound, so she knew what happened. She had been in front of Allison when it happened, so she didn’t see her diaper, but Allison wondered if anyone else had. “I can’t go to class like this.”</span></div></div>",
            "created":1330318800,
            "id":1285357,
            "title":"Allison’s pants rip"
        },
        "1111":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Someone knocks on the door",
                "Nothing Happens. She finishes and goes to class",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Allison didn’t bring her sweatpants to school since she didn’t have P.E. that day, so she didn’t have that to change into. She also didn’t have a jacket she could wrap around her waist. Then she thought of something.<br>\r\n<br>\r\n“Marie, do you have something I can borrow?,” she said.<br>\r\n<br>\r\n“Sorry, but no,” said Marie. “What I’m wearing is all I have. Why don’t you try the lost and found?”<br>\r\n<br>\r\n“I didn’t think of that. Thanks.”<br>\r\n<br>\r\nWhile Marie went to class, Allison, holding her bag behind her to cover the hole, went to the lost and found. She didn’t find any clothes there. Then she came up with another idea. “Sewing class,” she thought.<br>\r\n<br>\r\nAllison went there. The teacher, Mrs. Miller, was just leaving the room.<br>\r\n<br>\r\n“Mrs. Miller. Can I use one of the sewing machines?,” said Allison.<br>\r\n<br>\r\n“Why?,” said Mrs. Miller.<br>\r\n<br>\r\n“I, um, ripped my pants.”<br>\r\n<br>\r\n“Oh. Well, you can go in. I’m locking the door, so when you’re leaving, you’ll close it.”<br>\r\n<br>\r\n“I will. Thank you.”<br>\r\n<br>\r\nMrs. Miller left and Allison went inside and shut the door. She was glad to be alone in the room, but she was still worried that someone would see her. She was on the first floor, and thought that someone would walk past the windows or look through the glass on the door and see her. She took off her sneakers and checked to see if anyone was watching. Then she took off her pants and began sewing up the hole in them as quickly as she could.</span></div></div>",
            "created":1340082000,
            "id":1363096,
            "title":"Allison goes to get her pants sewn up"
        },
        "11111":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "It’s a dream.",
                "It’s not a dream."
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, someone knocked on the door, which startled Allison. She ignored it at first, not wanting to get up from her seat since she was currently sitting in her diaper. The person knocked again. She was sure the person would keep doing that until she opened the door, so as much as she hated to do it, she went to the door, after taking her bag and holding it against her diaper to cover it. She was surprised when she saw who was knocking… her friend Daisy. Allison opened the door just a little to talk to her.<br>\r\n<br>\r\n“Daisy? What are you doing here?,” said Allison.<br>\r\n<br>\r\n“I saw you come in here. I need…,” said Daisy, who stopped and noticed that Allison had no pants on and was wearing socks and no shoes. She looked past her and saw a pair of pants on a sewing machine.<br>\r\n<br>\r\n“What happened to you?,” said Daisy.<br>\r\n<br>\r\n“I ripped my pants. I came here to sew up the hole,” said Allison.<br>\r\n<br>\r\n“So that’s why you’re holding your bag so tightly. You are wearing underwear, right?”<br>\r\n<br>\r\n“Yes,” she said, annoyed.<br>\r\n<br>\r\n“Granny panties?”<br>\r\n<br>\r\n“I want to finish so I can get to class. What do you want?,” she said, wanting to change the subject.<br>\r\n<br>\r\n“Right. Sorry. I need to borrow your Spanish homework.”<br>\r\n<br>\r\n“You mean copy.”<br>\r\n<br>\r\n“Okay. Yes.”<br>\r\n<br>\r\nThey had Spanish together in second period, so Daisy wanted to get Allison’s homework now so she’d have time to copy it before then. Allison opened her bag while being careful not to expose her diaper. She took out what she thought was the homework and handed it to Daisy.<br>\r\n<br>\r\n“Thanks. See you later,” said Daisy as she left to go to class.<br>\r\n<br>\r\nAllison was about to close the door, when she saw the Spanish homework in her bag. She had given Daisy some other paper by mistake. She stepped out into the hallway, hoping she’d catch her. Daisy was already gone. Allison had forgotten that Mrs. Miller had locked the door earlier. When she went into the hall, the door shut behind her. And that’s when she remembered.<br>\r\n<br>\r\n“Oh no!,” she thought. She ran to the door and tried turning the knob, but it was no use. Her sneakers, and more importantly, her pants, were locked in the room, and she was standing in the hall in her diaper.<br>\r\n<br>\r\n“Now what? I have nothing else to wear. I have to get out of here,” she thought. Before she could do that, she heard the sound of the fire drill, which meant everyone was about to come out of the rooms.<br>\r\n<br>\r\nHer shirt wasn’t long enough to cover her diaper and she couldn’t use her bag to cover her front and back. She started to run to the nearest bathroom to hide, but it was no use. She was seen immediately by everyone, including some of her friends.<br>\r\n<br>\r\n“This can’t be happening. This has to be a dream,” she thought.</span></div></div>",
            "created":1340082000,
            "id":1363098,
            "title":"Someone knocks on the door"
        },
        "111111":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "The doorbell rings",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Allison woke up in her bed on a Saturday morning, relieved that what she had just gone through was a nightmare, but also scared because it felt so real. What wasn’t a dream was that she still had to wear diapers. She was reminded of that when she realized she needed to change hers.<br>\r\n<br>\r\nAfter doing that, she went downstairs for breakfast. She only had on a T-shirt and a diaper since she was home alone.</span></div></div>",
            "created":1340082000,
            "id":1363099,
            "title":"It’s a dream."
        },
        "1111111":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "“To go to the mall.”",
                "“To come to my house for the slumber party I’m having this weekend.”"
            ],
            "content":"<div class=\"\"><div> <span>Before she could eat, the doorbell rang. She first looked out the window to see who it was. She saw Marie. Not wanting her friend to see her diaper, she ran upstairs and put on a robe. Then she went back downstairs and let her in.<br>\r\n<br>\r\n“I thought you’d be ready by now,” said Marie.<br>\r\n<br>\r\n“Ready for what?,” said Allison.</span></div></div>",
            "created":1340082000,
            "id":1363102,
            "title":"The doorbell rings"
        },
        "11111111":{
            "choices":[
                "allison messes in her diaper on the way to the music store",
                "allison heads into the bathroom but craps in her diaper"
            ],
            "content":"<div class=\"\"><div> <span>she told marie to wait outside then allison went and put on her pants then she got her shoes on and they headed to the mall when they got there they went into game stop and started buying some games after that they went to the food court and got some burgers, onion rings and a soda from dairy queen then they went and sit at the table and started eating they talked about everything from boys and music and about how crazy school is but after they got done with eating lunch marie and allison decided to go use the bathroom before they headed to the music store once inside the restrooms they got into the stalls and they were relieved to be able to empty their bladders but as soon as they headed out the restroom and were headed to the music store allison had to go really bad but didn't want marie to see her doing it...</span></div></div>",
            "created":1340082000,
            "id":1363184,
            "title":"“To go to the mall.”"
        },
        "111111111":{
            "choices":[
                "Allison heads into the bathroom to get a fresh diaper on",
                "Allison heads into the bathroom but ends up messing her diaper too"
            ],
            "content":"<div class=\"\"><div> <span>allison messed in her diaper. She was embarrassed, doing that on the line in front of a bunch of people, but at least no one knew about it. Allison got to the bathroom and decided to get a fresh one on. she fastened the tapes and made sure that they were secured. after that she heads to the electronics store to get a brand new cd. after she goes and buys it, she heads to the gaming store and buys a brand new game for her xbox 360. but as soon as she was about to get out of the mall she had to go again. allison was about to hold it in when she ended up soaking her diaper and now it was saggy, but she didn't really care as she was gonna get changed out of it...</span></div></div>",
            "created":1344056400,
            "id":1397490,
            "title":"allison messes in her diaper on the way to the ..."
        },
        "1111111111":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "she saw a toddler girl getting her diaper changed, and got jealous",
                "she left the mall without anymore interruptions"
            ],
            "content":"<div class=\"\"><div> <span>Allison decided that she wanted a dry diaper on when she left the mall.  She headed back to the bathroom.<br>\r\n<br>\r\nOnce she got there, she found a vacant stall.  She went into it, and locked the door.  She was eager to get home, so she changed her diaper quickly.  she was thankful to be in a dry diaper once she got into one.<br>\r\n<br>\r\nThen she left the stall.  She made her way to the garbage can, and tossed her used diaper.  Then she washed her hands.<br>\r\n<br>\r\nAs she left the bathroom...</span></div></div>",
            "created":1356066000,
            "id":1492331,
            "title":"Allison heads into the bathroom to get a fresh ..."
        },
        "11111111112":{
            "choices":[
                "allison tries to hold it in but messes her diaper",
                "allison releases a mess in her diaper"
            ],
            "content":"<div class=\"\"><div> <span>as allison left the bathroom that her and marie headed out the mall door. as soon as her and allison get in the car and headed out the parking lot that allison had to go again. allison realized she didn't want marie to notice what she was doing so allison released her bladder in her diaper. allison was relieved for a moment when she felt a bowel movement heading her way. allison knew she couldn't hold it in front of marie but if she were to mess her diaper marie would notice the smell. allison had to think fast...</span></div></div>",
            "created":1356066000,
            "id":1492564,
            "title":"she left the mall without anymore interruptions"
        },
        "111111111122":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "Yes I am",
                "Yes I am, cause I'm a big baby."
            ],
            "content":"<div class=\"\"><div> <span>Allison really had to poop.  She had to go so bad that she knew she wouldn't be able to hold it till she got home.<br>\r\n<br>\r\nShe looked over at Marie.  Allison knew that there would be no way to hide it from her friend.<br>\r\n<br>\r\nShe decided it was time for the truth to come out.  They got to her car and she stopped.  Then she squatted down low.  She did this for two reasons.  The first was, it was easier to poop when squatted down low.  The other was her diaper would be exposed to Marie.<br>\r\n<br>\r\nMarie saw Allison suddenly squat.  Marie quickly went over to Allison's side of the car.  Her eyes got really wide when she saw her friend.  Allison was clearly wearing a diaper.<br>\r\n<br>\r\n\"Are you wearing a diaper?\" Marie asked trying to be polite about the matter.<br>\r\n<br>\r\nAllison made a few grunts.  She finished pooping and stood up.  Then she replied with....</span></div></div>",
            "created":1373259600,
            "id":1624962,
            "title":"allison releases a mess in her diaper"
        },
        "11111112":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "“Let’s play Truth or Dare,” said Kerry.",
                "“Let’s play Strip Poker,” said Marie."
            ],
            "content":"<div class=\"\"><div> <span>“To come to my house for the slumber party I’m having this weekend,” said Marie.<br>\r\n<br>\r\nAllison forgot that Marie had planned this days ago. She had agreed to go, but that was before she learned that Marie, a cheerleader, had also invited Kerry and Joan from her squad. The extra people made her more worried that her secret would get out. She was going to stay home instead, but her mother wouldn’t let her. Allison even tried to get Linda to let her go to Marie’s without diapers. Linda wanted her to not let her problem keep her from living her life.<br>\r\n<br>\r\n“Okay. Let me just get my things,” said Allison. <br>\r\n<br>\r\nShe went upstairs and quickly started packing clothes, a bag of diapers, her toothbrush, and other things into a bag. She normally slept in her underwear or a sleepshirt, but she packed pajamas so she could be covered. Allison put on jeans and a T-shirt and went back to Marie. They then went to her car and drove to her house, where they hung out until Kerry and Joan arrived there in the evening. Marie’s parents weren’t home, so it was just the four girls there.<br>\r\n<br>\r\nKerry and Joan weren’t really friends of Allison. They were Marie’s friends, so Allison felt awkward around them. They all changed into their sleepwear, with Allison having the most clothing on.<br>\r\n<br>\r\n“What do we do first?,” said Joan.</span></div></div>",
            "created":1342674000,
            "id":1382833,
            "title":"“To come to my house for the slumber part..."
        },
        "111111121":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Allison says yes",
                "Allison says no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“Let’s play Truth or Dare,” said Kerry.<br>\r\n<br>\r\n“That’s fine with me,” said Joan.<br>\r\n<br>\r\n“Me too,” said Marie. “What about you, Allison?”</span></div></span></div>",
            "created":1342674000,
            "id":1382835,
            "title":"“Let’s play Truth or Dare,” s..."
        },
        "1111111211":{
            "choices":[
                "allison picked truth",
                "allison picked dare"
            ],
            "content":"<div class=\"\"><div> <span>Allison said yes in a embarrassing kind of way, and the fact that she didn't know what Kerry, Joan, and Marie would think if they saw her in a diaper, but she knew it would have to come out. So Kerry went first and asked Allison truth or dare, but Allison had to think fast...</span></div></div>",
            "created":1342674000,
            "id":1382956,
            "title":"Allison says yes"
        },
        "11111112112":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "...kiss Marie",
                "...streak"
            ],
            "content":"<div class=\"\"><div> <span>\"Dare,\" said Allison, though she immediately regretted her choice. She only said it because she was afraid that if she only picked truth throughout the game, the girls would wonder what was up. By choosing dare, she was risking the possibility of doing something that might cause her diaper to be exposed. All she could do was hope that her dare wouldn't be too bad.<br>\r\n<br>\r\n\"Okay,\" said Kerry. \"I dare you to...</span></div></div>",
            "created":1342846800,
            "id":1384460,
            "title":"allison picked dare"
        },
        "111111121121":{
            "choices":[
                "marie takes off her pants and notices allison's diaper",
                "marie says no way and decides to take off her pants instead"
            ],
            "content":"<div class=\"\"><div> <span>kerry dared allison to kiss marie. allison didn't really think that was a good idea as she didn't know if she would get turned on by her and marie kissing. but allison knew she had to go thru with it. so she and marie started kissing and both marie and allison looked at each other said is it over. kerry said to marie okay truth or dare. marie picks dare and kerry wants marie and take off allison's pants while they are kisisng. allison knew she didn't want to be seen in a diaper but they were gonna found out soon enough...</span></div></div>",
            "created":1343365200,
            "id":1390735,
            "title":"...kiss Marie"
        },
        "1111111211211":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "Pulls them back up making some lie about not being able to do it [covers for her",
                "pulls them down and mocks allison",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Marie blushed and nervously walked over apologies to Allison as she grabs the waistband of her pants... They then proceed to kiss and Marie pulls down Allison's pants. As the pants come down Marie spots the diaper before anyone else... She then</span></div></span></div>",
            "created":1605360420,
            "id":2939932,
            "title":"marie takes off her pants and notices allison..."
        },
        "1111111211212":{
            "author_id":"sabrinasmiles",
            "author_name":"Sabrina Smiles",
            "choices":[
                "Allison wets her diaper",
                "Someone else wets their pants"
            ],
            "content":"<div class=\"\"><div> <span>Marie speaks up, \"That's not fair to Allison, she just got dared. How about she takes off mine?\"<br>\r\nThe others all conceded and Allison was immediately relieved. She moved in and pressed her lips to her best friends. This wasn't the first time they had kissed and it certainly wouldn't be the last, but it was always a simple peck on the lips before, a sign of close friendship, but Allison couldn't deny that she was getting turned on. Marie lowered her waistband into Allison's reach and she slowly lowered them down past her knees and over the colorful, fuzzy socks adorning Marie's toes. <br>\r\n\"Jesus. Do you too want to be alone?\" Kerry laughed. Allison and Marie split from their embrace, their cheeks red with embarrassment but smiling.  <br>\r\n<br>\r\nJust then...</span></div></div>",
            "created":1478149200,
            "id":2232104,
            "title":"Marie says no"
        },
        "11111112112121":{
            "author_id":"sabrinasmiles",
            "author_name":"Sabrina Smiles",
            "choices":[
                "She decides to tell the other girls she wears diapers",
                "She decides not to tell them "
            ],
            "content":"<div class=\"\"><div> <span>Allison feels a familiar tingle in her diaper as she start to fill it. She's certain she would have given herself away from embarrassment if the kiss hadn't already turned her cheeks crimson. <br>\r\n\"Okay Allie,\"says Marie \"it's your turn to do Joan.\"<br>\r\n\"Sorry, I like boys.\" Joked Joan and they all laughed. <br>\r\nThe game continued for awhile with no real incident and then the girls watched a movie while waiting for a pizza to arrive. Allison took this opportunity to slip away and change. Allison was starting to feel more comfortable around these girls and started to think it might not be so bad to let them know her secret. </span></div></div>",
            "created":1478149200,
            "id":2232106,
            "title":"Allison wets her diaper"
        },
        "11111112112122":{
            "author_id":"deden",
            "author_name":"Dedes",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was this from a Dare?</span></div></span></div>",
            "created":1561611600,
            "id":2679219,
            "title":"Someone else wets their pants"
        },
        "111111121121221":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "Alison",
                "Marie",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was dared to wet</span></div></span></div>",
            "created":1605361080,
            "id":2939939,
            "title":"Yes"
        },
        "111111121121222":{
            "author_id":"bedwetbraeden",
            "author_name":"Braedenthebedwetter",
            "choices":[
                "Marie",
                "Kelly",
                "Joan",
                "More than one person "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who wet their pants? </span></div></span></div>",
            "created":1584507600,
            "id":2803127,
            "title":"Not a Dare"
        },
        "1111111211212221":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "Secretly weak bladder",
                "Hadnt peed in hours",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why did she wet herself</span></div></span></div>",
            "created":1605361140,
            "id":2939940,
            "title":"Marie"
        },
        "111111121122":{
            "choices":[
                "allison said that they were panties but they don't believe her",
                "allison said they are diapers and she has a medical condition"
            ],
            "content":"<div class=\"\"><div> <span>allison started getting her clothes off by taking her shirt off first when they noticed something hanging out her pants. allison then took of her bra which made her topless. then it was the pants and allison was afraid that they would laugh at her for wearing diapers but if she had to streak in them then let the embarrassment begin. that's when all of a sudden allison took of her pants and they looked at her in shock. that's when they asked allison what she was wearing...</span></div></div>",
            "created":1342846800,
            "id":1384670,
            "title":"...streak"
        },
        "1111111211221":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "The girls lock her out of the house when she returns",
                "She returns from streaking, but is then unable to get her diapers"
            ],
            "content":"<div class=\"\"><div> <span>\"They're panties, of course. What else would they be?,\" said a nervous Allison.<br>\r\n<br>\r\n\"It looks like a diaper,\" said Joan.<br>\r\n<br>\r\n\"They're briefs. My grandmother got them for me.\" The girls didn't seem convinced and Allison could tell. She could only hope they'd forget about it while she streaked. Before she did, she needed to do something. \"I have to go to the bathroom.\" She gathered up her clothes and went upstairs. <br>\r\n<br>\r\nShe peed in her diaper and then took it off. Now she was completely naked. Worried that the girls would search her stuff while she was outside, she put her diaper with the rest of her diapers and hid them under Marie's parents' bed. Then she went back downstairs. She went to the front door, where the others were waiting for her. Allison took a deep breath. She had never streaked before, but at least it was nighttime, so she thought she was less likely to be seen. She had to run around the block once and then come back. She covered her breasts with one arm to support them and covered her crotch with her hand. Marie opened the door for her and she ran out.</span></div></div>",
            "created":1343365200,
            "id":1390702,
            "title":"allison said that they were panties but they do..."
        },
        "11111112112211":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "The girls quickly let her back in",
                "The girls leave her out there for a while",
                "The girls invite other people to the house while Alison is outside"
            ],
            "content":"<div class=\"\"><div> <span>Outside in the night, completely naked and alone, Allison ran down the block. She was glad to be out of diapers for time being, but as soon as she got back to the house, she was going to immediately put on a new one. She tried not to focus too much on that as she ran, choosing to concentrate on each house and window she passed, hoping no one was watching her or taking pictures.<br>\r\n<br>\r\nShe made a right turn when she reached the corner of the block. Lights were on in some of the houses, which made her run faster, which was not good for her bare feet. Then she went past a lawn that a fountain on it, which made her think about peeing. She was starting to feel the urge to relieve herself again, and she wasn't sure she'd make it back to the house before that happened.<br>\r\n<br>\r\nBy the time she reached the next corner, she started to slow down. She was getting more desperate, but she didn't want to pee out in public. Allison kept moving, but was startled when she heard the loud barking of a dog, to the point that she almost peed on the sidewalk. She couldn't hold it in anymore. She had to pee right now. She just needed a place to go. She looked around and saw a hydrant, but since she wasn't a dog, she wasn't going there. She chose to go in the bushes on someone's property, hoping no one living there would see her. She crouched down and finally peed. Then she used a leaf she took off a tree next to her to wipe herself.<br>\r\n<br>\r\nWith peeing off her mind for a bit, Allison made it back to the house without anymore problems. She reached the door, turned the knob, but it wouldn't open. The door was locked. She knocked on it, and then saw the girls in a window next to it, laughing at her.</span></div></div>",
            "created":1553922000,
            "id":2637508,
            "title":"The girls lock her out of the house when she re..."
        },
        "11111112112212":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "...tells Marie the truth",
                "...thinks of something else to say"
            ],
            "content":"<div class=\"\"><div> <span>Outside in the night, completely naked and alone, Allison ran down the block. She was glad to be out of diapers for the time being, but as soon as she got back to the house, she was going to immediately put on a new one. She tried not to focus too much on that as she ran, choosing to concentrate on each house and window she passed, hoping no one was watching her or taking pictures.<br>\r\n<br>\r\nShe made a right turn when she reached the corner of the block. Lights were on in some of the houses, which made her run faster, which was not good for her bare feet. Then she went past a lawn that a fountain on it, which made her think about peeing. She was starting to feel the urge to relieve herself again, and she wasn't sure she'd make it back to the house before that happened.<br>\r\n<br>\r\nBy the time she reached the next corner, she started to slow down. She was getting more desperate, but she didn't want to pee out in public. Allison kept moving, but was startled when she heard the loud barking of a dog, to the point that she almost peed on the sidewalk. She couldn't hold it in anymore. She had to pee right now. She just needed a place to go. She looked around and saw a hydrant, but since she wasn't a dog, she wasn't going there. She chose to go in the bushes on someone's property, hoping no one living there would see her. She crouched down and finally peed. Then she used a leaf she took off a tree next to her to wipe herself.<br>\r\n<br>\r\nWith peeing off her mind for a bit, Allison made it back to the house without anymore problems. Marie let her in.<br>\r\n<br>\r\n\"Did anyone see you?,\" Marie asked.<br>\r\n<br>\r\n\"I hope not,\" said Allison, while covering herself with her hands. \"I just wanna get dressed and go to bed.\"<br>\r\n<br>\r\n\"Not yet,\" said Kerry. \"We're still playing. I dared you. Now you get to do the same. I'm up for anything.\"<br>\r\n<br>\r\n\"Yes, but I still need my clothes,\" said Allison.<br>\r\n<br>\r\n\"Why?,\" said Joan. \"It's just us girls here.\"<br>\r\n<br>\r\nAllison was less embarrassed about being naked in front of the girls and more embarrassed about peeing in front of them if she didn't put on a diaper soon. She couldn't tell them that, but she couldn't think of a good lie either, so she continued to play the game.<br>\r\n<br>\r\n\"Kerry, truth or dare?,\" she said.<br>\r\n<br>\r\n\"Dare,\" said Kerry.<br>\r\n<br>\r\n\"I dare you to streak around the block, and the next one.\"<br>\r\n<br>\r\nIf Allison had to be naked for a long period of time, at least she could make someone else do the same.<br>\r\n<br>\r\n\"Fine,\" said Kerry, who had no problem stripping naked in front of the girls.<br>\r\n<br>\r\nKerry left the house, and Allison took the opportunity to go back to where she left her diapers. Unfortunately for her, Marie's parents' bedroom door was now locked.<br>\r\n<br>\r\n\"Oh no,\" she said, as she started to feel the need to pee again.<br>\r\n<br>\r\nWhile Joan was busy looking out the window, waiting for Kerry to come back, Allison called Marie upstairs.<br>\r\n<br>\r\n\"Why is this door locked?,\" she asked.<br>\r\n<br>\r\n\"My parents don't want anyone going in their room. I was supposed to lock it earlier, but I forgot. I think they have sex toys in there,\" said Marie.<br>\r\n<br>\r\n\"Really?\"<br>\r\n<br>\r\n\"Yeah. Why are you asking about it?\"<br>\r\n<br>\r\nAllison...</span></div></div>",
            "created":1557118800,
            "id":2655964,
            "title":"She returns from streaking, but is then unable ..."
        },
        "111111121122122":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Kerry refuses to give back Allison's clothes until everyone has played",
                "Allison has to go on a scavenger hunt for her clothes",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"No reason,\" said Allison. \"I was just curious.\"<br>\r\n<br>\r\n\"Oh,\" said Marie.<br>\r\n<br>\r\n\"I'm gonna go get dressed.\"<br>\r\n<br>\r\nAllison panicked as she went to the bedroom.<br>\r\n<br>\r\n<i>\"Without my diapers, I'll soak my clothes and all the girls will see. I could tell Marie the truth. She'd be sympathetic. But I'm too embarrassed to tell anyone,\"</i> she thought.<br>\r\n<br>\r\nShe got to the room and discovered her clothes were gone.<br>\r\n<br>\r\n\"No no no!,\" she said. \"Marie!\"<br>\r\n<br>\r\nMarie came running into the room.<br>\r\n<br>\r\n\"What's wrong?,\" she asked.<br>\r\n<br>\r\n\"Where are my clothes?,\" said Allison.<br>\r\n<br>\r\n\"They're not where you left them?\"<br>\r\n<br>\r\n\"No.\"<br>\r\n<br>\r\n\"Oh. While you were streaking, Kerry came up here for a couple of minutes. She must've taken them.\"<br>\r\n<br>\r\n\"She wants to keep me naked as long as possible.\"<br>\r\n<br>\r\n\"We'll make her give them back.\"<br>\r\n<br>\r\nAllison held her crotch. She needed to pee again.<br>\r\n<br>\r\n\"You know, it's kinda awkward talking to while you're naked,\" said Marie.<br>\r\n<br>\r\n\"Much more for me,\" said Allison.<br>\r\n<br>\r\n\"I'm gonna go wait for Kerry.\"<br>\r\n<br>\r\n\"I'll meet you down there.\"<br>\r\n<br>\r\nMarie left and Allison ran to the bathroom and peed in the toilet.</span></div></div>",
            "created":1564894800,
            "id":2697172,
            "title":"...thinks of something else to say"
        },
        "1111111211221221":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Kerry locks the bathroom door",
                "Allison gets another dare"
            ],
            "content":"<div class=\"\"><div> <span>Allison stayed in the bathroom naked until Kerry returned to the house. The moment she heard the front door open, she ran downstairs.<br>\r\n<br>\r\n\"Give me my clothes!,\" she said to the equally naked Kerry.<br>\r\n<br>\r\n\"After the game,\" said Kerry.<br>\r\n<br>\r\n\"Then I'll hide your clothes until you give them back,\" said Marie.<br>\r\n<br>\r\n\"Fine by me,\" said Kerry. \"I don't mind being naked, unlike Allison.\"<br>\r\n<br>\r\n\"What is your problem?,\" said Allison.<br>\r\n<br>\r\n\"Joan and I think you're hiding something.\"<br>\r\n<br>\r\n\"No I'm not.\"<br>\r\n<br>\r\n\"Then why are you in a rush to get dressed?,\" said Joan. <br>\r\n<br>\r\n\"It's just us girls here,\" said Kerry.<br>\r\n<br>\r\nAllison didn't know what to do, except exactly what Kerry wanted.<br>\r\n<br>\r\n\"Let's just continue playing.\"<br>\r\n<br>\r\n\"Good,\" said Kerry.</span></div></div>",
            "created":1572411600,
            "id":2740489,
            "title":"Kerry refuses to give back Allison's clothe..."
        },
        "11111112112212211":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "...tells her the truth",
                "...pees in a garbage can",
                "...pees out a window"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll be back,\" said Allison.<br>\r\n<br>\r\nShe went upstairs to use the bathroom, only to find the door locked.<br>\r\n<br>\r\n<i>\"Why is it locked?,\"</i> she thought.<br>\r\n<br>\r\n\"I locked the door,\" said Kerry, whose sudden appearance startled Allison, almost to the point of peeing on the floor.<br>\r\n<br>\r\n\"Why?,\" said Allison.<br>\r\n<br>\r\n\"We're in the middle of a game.\"<br>\r\n<br>\r\n\"But I need to go,\" she said.<br>\r\n<br>\r\n\"You're sounding desperate. Joan said you were in there until I got back. Didn't you use the toilet then?\"<br>\r\n<br>\r\n\"I...\"<br>\r\n<br>\r\n\"I'll make you a deal. You tell me what you're hiding and I'll get the key.\"<br>\r\n<br>\r\nAllison...<br>\r\n</span></div></div>",
            "created":1580619600,
            "id":2781796,
            "title":"Kerry locks the bathroom door"
        },
        "111111121122122113":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "...the girls came into the room and saw her",
                "...she sees a neighbor watching her from next door"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm not hiding anything,\" said Allison.<br>\r\n<br>\r\n\"Okay. Then you don't need the key,\" said Kerry as she walked away and went back downstairs.<br>\r\n<br>\r\nAllison grabbed her crotch. She was more desperate than ever.<br>\r\n<br>\r\n<i>\"I'm about to pee on the floor,\"</i> she thought.<br>\r\n<br>\r\nThen she came up with an idea and ran to Marie's room. She opened her friend's window and stuck her bare butt out of it.<br>\r\n<br>\r\n<i>\"This is crazy,\"</i> she thought. <i>\"Then again, I did just go streaking.\"</i><br>\r\n<br>\r\nAllison peed out the window. It took a while for her to get it all out.<br>\r\n<br>\r\n\"So much better,\" she said.<br>\r\n<br>\r\nAs she was about to get up...</span></div></div>",
            "created":1601403600,
            "id":2912386,
            "title":"...pees out a window"
        },
        "11111112112212212":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Allison pees in the kitchen sink",
                "Allison pees outside",
                "Allison uses the basement bathroom"
            ],
            "content":"<div class=\"\"><div> <span>So the girls kept playing. Marie and Joan had their turns. They both chose truth. It was Kerry's turn again. <br>\r\n<br>\r\nShe said to Allison, \"Truth or dare?\"<br>\r\n<br>\r\n\"Dare,\" said Allison.<br>\r\n<br>\r\nKerry lead everyone to the kitchen and took a jug of water out of the fridge.<br>\r\n<br>\r\n\"I dare you to drink this,\" she said.<br>\r\n<br>\r\n\"All of it?!,\" she said, nervously.<br>\r\n<br>\r\n\"Yes.\"<br>\r\n<br>\r\n\"Right now?\"<br>\r\n<br>\r\n\"Yes.\"<br>\r\n<br>\r\nSo she sat at a table and did it, with all the girls watching. She hadn't peed in a while, and this wasn't helping her bladder.<br>\r\n<br>\r\n\"<i>I really need to go</i>,\" she thought.<br>\r\n<br>\r\nShe was squirming in her seat, and Kerry noticed. After she finished drinking, she got up to leave. Kerry stopped her.<br>\r\n<br>\r\n\"Where are you going?,\" she said.<br>\r\n<br>\r\n\"To bed,\" said Allison. \"The game's over. We all played. I'm tired. I want my clothes back.\"<br>\r\n<br>\r\nShe was really on her way to the bathroom.<br>\r\n<br>\r\n\"It's too early for bed,\" said Kerry.<br>\r\n<br>\r\n\"Maybe for you,\" said Allison.<br>\r\n<br>\r\nAllison went upstairs to the bathroom, only to find it locked. Joan was using it.<br>\r\n<br>\r\n\"<i>No!,</i>\" she thought. \"<i>I have to go now!</i>\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1576299600,
            "id":2759631,
            "title":"Allison gets another dare"
        },
        "111111121122122121":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "...told the girls the truth",
                "...ran off, humiliated"
            ],
            "content":"<div class=\"\"><div> <span>More desperate than ever, the naked Allison held her crotch. She knocked on the bathroom door.<br>\r\n<br>\r\n\"I'll be out in a while,\" said Joan.<br>\r\n<br>\r\n\"<i>I don't have that kind of time</i>,\" thought Allison. \"<i>I'll go to the bathroom in the basement</i>.\"<br>\r\n<br>\r\nShe went back downstairs. She had to go through the kitchen to get to the basement. Kerry and Marie were still there. Kerry stopped her.<br>\r\n<br>\r\n\"You changed your mind?,\" she said.<br>\r\n<br>\r\n\"I'm going to the bathroom,\" said Allison.<br>\r\n<br>\r\n\"The toilet isn't working,\" said Marie.<br>\r\n<br>\r\n\"What?,\" said Allison.<br>\r\n<br>\r\nShe couldn't take it anymore. She had tried her best to hold it in, but she needed to pee now. Toilets weren't available to her, but the kitchen sink was. With Kerry and Marie watching, she got up on the sink and peed.<br>\r\n<br>\r\n\"What the fuck?!,\" said a shocked Marie.<br>\r\n<br>\r\n\"Look at that,\" said Kerry.<br>\r\n<br>\r\nAllison was humiliated. She peed for quite a while, and then Joan came and saw her too.<br>\r\n<br>\r\n\"What is this?,\" she said.<br>\r\n<br>\r\nOnce Allison finished, she...</span></div></div>",
            "created":1576299600,
            "id":2759654,
            "title":"Allison pees in the kitchen sink"
        },
        "1111111212":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Kerry and Joan take advantage of Allison's secret",
                "The girls are all understanding"
            ],
            "content":"<div class=\"\"><div> <span>Knowing that these games often resulted in someone having to take off their clothes, Allison did not want to be that person.<br>\r\n<br>\r\n\"No thanks. I'll just watch the rest of you play,\" she said.<br>\r\n<br>\r\n\"Are you sure?,\" said Marie.<br>\r\n<br>\r\n\"Yes.\"<br>\r\n<br>\r\nSo they played. Joan dared Marie to moon her next door neighbor, a guy from their school. Marie dared Kerry to masturbate in front of them. Joan only picked truth. Allison enjoyed watching everyone else play. The game would have gone on longer, if Marie's parents hadn't come home sooner than she expected. The girls went to Marie's bedroom and watched a DVD. At some point during it, Allison fell asleep on Marie's bed. She was lying on her back. Kerry decided to use this opportunity to pull a classic prank.<br>\r\n<br>\r\nShe put Allison's hand in a bowl of warm water, to get her to wet herself. She didn't know that Allison didn't need any help in that area. After a while, she started peeing while the others watched the movie. Then Kerry wanted to expose the pee stain, so she pulled down her pajama pants and she and the others were shocked to see that Allison was wearing a diaper.<br>\r\n<br>\r\n\"Wow,\" said a surprised Kerry.<br>\r\n<br>\r\nJoan held in her laughter to keep from waking up Allison. Marie didn't say anything. She had no idea that her best friend had been wearing diapers, and she now felt bad that she had let Kerry reveal that to them. Allison suddenly woke up and saw everyone staring at her.<br>\r\n<br>\r\n\"What's wrong?,\" she said. Then she looked down and saw her diaper on display. \"NO!,\" she screamed. She got up and tried to run away, but her pajama pants were around her ankles. She ended up tripping in them and falling to the floor. Joan laughed out loud this time.<br>\r\n<br>\r\n\"This isn't funny,\" said Marie.<br>\r\n<br>\r\n\"I'm sorry. I can't help it,\" said Joan.<br>\r\n<br>\r\nMarie helped Allison up, pulled her pants up, and put her back on the bed. Allison was too embarrassed to say anything.</span></div></div>",
            "created":1342846800,
            "id":1384839,
            "title":"Allison says no"
        },
        "11111112121":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "...in the kitchen, minus her pants",
                "...outside the house, with nothing on but her diaper"
            ],
            "content":"<div class=\"\"><div> <span>Everyone was quiet, trying to continue watching the movie, but then Marie decided to ask Allison the same question that Kerry and Joan were thinking.<br>\r\n<br>\r\n\"Why are you wearing a diaper?\"<br>\r\n<br>\r\nAllison answered her since it was out now. \"Because I have to,\" she said. \"I have a weak bladder, so my mother started making me wear diapers a few months ago. Please. You can't tell anyone about this.\"<br>\r\n<br>\r\nMarie felt sorry for her. \"I won't.\" She turned to look at Kerry and Joan. \"And you two won't either, right?\"<br>\r\n<br>\r\n\"Of course not,\" said Kerry.<br>\r\n<br>\r\n\"My lips are sealed,\" said Joan.<br>\r\n<br>\r\n\"Good,\" said Marie, unaware that Kerry and Joan were planning on having some fun at Allison's expense.<br>\r\n<br>\r\nThey finished watching the movie and then went to bed. Allison slept with Marie in her bed, while Kerry and Joan slept in sleeping bags.<br>\r\n<br>\r\nThe next morning, Allison was the first to wake up, but she was no longer in the bed. She was...</span></div></div>",
            "created":1342846800,
            "id":1384930,
            "title":"Kerry and Joan take advantage of Allison's ..."
        },
        "111111121211":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "...Kerry and Joan came into the kitchen",
                "...a guest comes to the house"
            ],
            "content":"<div class=\"\"><div> <span>...in the kitchen. She was sitting at the table. She wondered how she got there, but then she realized that the top half of her pajamas were on, but her pants weren't. She was sitting in her diaper. She had never sleepwalked, so there was only one other possibility... Kerry and Joan. She knew Marie would never do that to her, so it had to be them. She got up to go back to the bedroom, but then Marie's parents came in. She sat back down before they could see anything. They were on the opposite side of where she was sitting, and there were chairs in front of her, so she was safe.<br>\r\n<br>\r\n\"Hello, Allison,\" said Marie's mother.<br>\r\n<br>\r\n\"Hi, said Allison.<br>\r\n<br>\r\nThey were both having breakfast. The father sat across from Allison and had cereal, while the mother was making pancakes.<br>\r\n<br>\r\n\"Do you want a pancake?\"<br>\r\n<br>\r\nAllison was about to say no, but since they weren't going to be leaving anytime soon, and she was stuck there, she figured she might as well. \"Sure.\"<br>\r\n<br>\r\nAllison was going to wait for them to finish eating and leave. Then she'd go back upstairs. But then...</span></div></div>",
            "created":1342846800,
            "id":1384955,
            "title":"...in the kitchen, minus her pants"
        },
        "1111111212111":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Allison gets up and runs to the bathroom",
                "Allison holds it in long enough for Marie's parents to leave"
            ],
            "content":"<div class=\"\"><div> <span>...Kerry and Joan came into the kitchen. <br>\r\n<br>\r\n\"Good morning, everyone,\" said Joan. <br>\r\n<br>\r\nJoan sat next to Allison on her left, while Kerry sat on her right. Marie's mother made pancakes for them. Marie's father finished eating and left the kitchen. While the mother's back was turned as she was at the stove, Kerry went under the table and grabbed Allison's diaper.<br>\r\n<br>\r\n\"What are you doing?!,\" Allison whispered to her, not wanting Marie's mother to hear her.<br>\r\n<br>\r\n\"I'm taking your diaper, obviously,\" Kerry whispered back. So she did. She took it right off, leaving Allison bottomless and even more embarrassed.<br>\r\n<br>\r\n\"Why are you doing this to me?\"<br>\r\n<br>\r\n\"Because it's fun.\"<br>\r\n<br>\r\nAllison needed to pee again, but she couldn't now. Unless she got up and ran to the bathroom, she'd end up going on the chair, in front of three people. Marie's father came back to the kitchen at that point to talk to his wife. Now she had four people that would see her half naked if she tried to leave.<br>\r\n<br>\r\n</span></div></div>",
            "created":1343365200,
            "id":1390659,
            "title":"...Kerry and Joan came into the kitchen"
        },
        "11111112121112":{
            "choices":[
                "allison stays on the toilet and lets out a bowel movement",
                "allison tries to hold it in but ends up having a bowel movement in the toilet"
            ],
            "content":"<div class=\"\"><div> <span>allison held it long enough for both of marie's parents to leave the kitchen. but then marie noticed kerry was holding on to allison's diaper. marie said to kerry: what are you guys doing. kerry said: i'm just having fun. marie noticed allison had to pee so she got allison to the bathroom. and allison relieved herself at the toilet. marie grabbed the diaper out of kerry's hand and ran to the bathroom. she handed it to allison but before allison was able to get off the toilet she had a bowel movement. she knew she had to stay seated or she make a mess on the floor...</span></div></div>",
            "created":1343365200,
            "id":1390670,
            "title":"Allison holds it in long enough for Marie's..."
        },
        "111111121211121":{
            "choices":[
                "Time to wipe!",
                "There is only one square left."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison couldn't hold it in any more... She grabbed the bowl with both hands, lifted up her knees and pooed her brains out. She felt so much better after that. Then, she reached her hand for some toilet paper...</span></div></span></div>",
            "created":1378357200,
            "id":1658313,
            "title":"allison stays on the toilet and lets out a bowe..."
        },
        "111111121211122":{
            "choices":[
                "She Went to Get Her Clothes",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>     Allison tried to hold it in, but as she reached for the diaper she let out her mess into the toilet. She felt relieved at least, and wiped herself and flushed the toilet. Next she put on her diaper and left the bathroom cautiously. However Marie was on the other side making sure that Kerry and Joan did not harass Allison.<br>\r\n<br>\r\n     \"Thanks Marie.\" Allison told her as she left the bathroom.<br>\r\n<br>\r\n     \"Your welcome.\" Marie said with a smile as she left the hallway, heading back down stairs.<br>\r\n<br>\r\n     Allison started to follow her when suddenly she realized she still only had her diaper and shirt on. That was when...</span></div></div>",
            "created":1346043600,
            "id":1414439,
            "title":"Allison Tries to Hold it In"
        },
        "1111111212111221":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "marie already had them for her",
                "they were where she left them",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She turned back to retrieve her clothing, she noticed</span></div></span></div>",
            "created":1605361440,
            "id":2939944,
            "title":"She Went to Get Her Clothes"
        },
        "11111112122":{
            "choices":[
                "messed in her diaper",
                "tried to hold it but messed herself"
            ],
            "content":"<div class=\"\"><div> <span>kerry asked allison why she is wearing diapers. then allison tells kerry it's because i got a medical condition and i can't hold my bladder long enough to go to the bathroom normally. joan tells allison that she understands because there are people out there who have bladder infections and they have to wear diapers. allison looked at her diaper though and saw it was wet she knew she had to get changed into a new one but allison started having a bowel movement before she was able to get to the bathroom she...</span></div></div>",
            "created":1342846800,
            "id":1385199,
            "title":"The girls are all understanding"
        },
        "111111121221":{
            "choices":[
                "Let us baby you for the remainder of the weekend ",
                "play the game either naked or with only the diaper on"
            ],
            "content":"<div class=\"\"><div> <span>Kerry ask Allison if she would play truth or dare and Allison finally agrees. But as Allison agrees she messes her diaper and says uhhh I'll be back. As Allison walks away Kerry yells wait!! Allison looks at her \" since you decided to join the game late you have to accept 2 dares Kerry says. Allison Looks At Her With Nervousness AND agrees.. \" what are they?\" Ask Allison Kerry \" dare 1 I dare you to let either me Joan or Marie change your diaper.  Allison. Couldn't believe the dare she was dumbfounded was she going to let one of the girls change her. Dare #2 is</span></div></div>",
            "created":1436590800,
            "id":2006695,
            "title":"messed in her diaper"
        },
        "1111111212212":{
            "author_id":"dragrako",
            "author_name":"Epimetheus",
            "choices":[
                "No play naked or with nothing on but a diaper.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Can I try a different dare?\" Allison asked nervously.<br>\r\n<br>\r\nThe two girls huddled together for a few minutes before answering.</span></div></span></div>",
            "created":1436590800,
            "id":2006758,
            "title":"OR!"
        },
        "11111112122121":{
            "choices":[
                "allison chooses",
                "The girls pick"
            ],
            "content":"<div class=\"\"><div> <span>Absolutely not Kerry said now pick either naked or just a diaper ally and If you don't pick then we will and you have to face the punishment.<br>\r\nAllison ask what is the punishment? JOANNE - well not only do we get to pick the state of dress u will be in but it also means you get a spanking and get to be our either naked botch or little baby for the night.<br>\r\nAllison was shocked by her options so </span></div></div>",
            "created":1436850000,
            "id":2007923,
            "title":"No play naked or with nothing on but a diaper"
        },
        "111111121221211":{
            "choices":[
                "naked",
                "In nothing but a diaper"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison will be</span></div></span></div>",
            "created":1436850000,
            "id":2007924,
            "title":"I choose"
        },
        "1111111212212112":{
            "choices":[
                "Joanne dares Kerry to be Allison mommy for the night Allison don't care",
                "Joanne dares Marie to be Allison mommy for the night Allison don't care"
            ],
            "content":"<div class=\"\"><div> <span>ALLISON GIVES up she can't negotiate and doesn't wanna be spanked. Allison- ok I guess I'll be in the diaper cause I don't wanna be fully nude and just in case of a mess with that said Allison slowly takes off her shirt bran and shoes she was already pantless. Now Allison is sitting there covering her breast in nothing but a diaper. Kerry - Allison you actually look cute with just a diaper. Joanne looks at her and giggles and says this is your natural look. Allison just stares in embarrassment looking at nothing but her diaper. Marie says don't be scared ally and don't forget Marie still has to change Allison diaper  with that said Marie takes a diaper rips off the old one leaving Allison naked. Joanne remember the rules no pictures tonight what happens here stays here. Allison felt a little better after that but still is aware she's naked as Marie lift up Allison legs wiped her good and put a ton of baby powder. This made Allison moan a little Kerry notices and gives her a smirk Allison blushes red and covers up the best she could. Finally Marie tapes the diaper good. As new. Kerry notices Allison shakes a little. Kerry - Aw come here baby as Kerry cuddles with Allison holding her by her diaper sitting on the floor. As the game goes Allison is immune for the next couple dares but is to embarrassed to talk at the moment so Joanne goes then Allison </span></div></div>",
            "created":1439182800,
            "id":2019517,
            "title":"In nothing but a diaper"
        },
        "11111112122121122":{
            "choices":[
                "Allison needs a new diaper",
                "She needs a new diaper but they have none"
            ],
            "content":"<div class=\"\"><div> <span>Alright now I am placing a double dare. Now Marie since u were so good with Allison, I dare you to be her mom for the night. Allison says nothing and Marie accepts. Marie starts to gather necessary items for this dare and wwhile she does that it's Allison turn but before Allison speaks...</span></div></div>",
            "created":1449637200,
            "id":2072504,
            "title":"Joanne dares Marie to be Allison mommy for the ..."
        },
        "111111121221211221":{
            "choices":[
                "A nap",
                "To be fed "
            ],
            "content":"<div class=\"\"><div> <span>Allison truth or dare? Allison says truth. Joanne takes a sniff and ask did you use your diaper alli? Allison starts to blush and says yes looking down. Marie the baby needs a change Joanne coos Marie grabs allisons diaper bag and Allison is forced to lay down. Ok baby off goes the diaper.. rip Allison is in tears as she is now naked  in front of everyone. Everyone is staring at her privates and nothing could be done.Amber and Joanne can't help but giggle as Marie wipes allisons butt clean and puts on a fresh diaper. All clean now Marie says Allison sits back up puts her head down and starts to cry. Marie coos it's alright baby don't cry I think someone needs </span></div></div>",
            "created":1489899600,
            "id":2291905,
            "title":"Allison needs a new diaper"
        },
        "111111121221212":{
            "choices":[
                "diapered baby ",
                "naked bitch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright girls Marie said prepare a spanking for our </span></div></span></div>",
            "created":1436850000,
            "id":2007928,
            "title":"The girls pick"
        },
        "11111112122122":{
            "choices":[
                "Take a bath with the girls washing her ",
                "crawl with a messey diaper to the bathroom where Marie will change her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok fine baby. Joan said after further discussion the girls came up with a new dare. Allison is dared to</span></div></span></div>",
            "created":1436763600,
            "id":2007629,
            "title":"Something else."
        },
        "111111122":{
            "choices":[
                "i'm wearing panties",
                "i have a medical condition so i'm wearing diapers"
            ],
            "content":"<div class=\"\"><div> <span>let's play strip poker: marie said. allison was worried because she didn't want them to know she had a diaper on and she didn't want marie or her friends to see her in diapers. but allison knew they would find out so she thought if they only knew i had a medical condition it would make my day. that's when marie put down her cards and they are all aces which is a full house, allison put down her cards which were 3 jacks, joan put down her cards which were all sevens and kerry had a royal flush. so when that happened joan took pants off followed by marie but then allison had no choice but to take her pants off so now allison is now in a shirt and diaper and the shirt barely covered her diaper at all. that's when marie asked allison what she was wearing and allison replied...</span></div></div>",
            "created":1342674000,
            "id":1382843,
            "title":"“Let’s play Strip Poker,” sai..."
        },
        "1111111222":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "Ask to have one themselves",
                "Mock her",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison sighed and explained that she had a condition that affected her bladder and uses diapers as a precaution, but will use the toilet if she is able to... She looks at the girls worried they will mock her, the girls then</span></div></span></div>",
            "created":1605361260,
            "id":2939942,
            "title":"i have a medical condition so i'm wearing d..."
        },
        "1111112":{
            "choices":[
                "allison puts on a robe and opens the door for marie",
                "allison gets noticed by marie and she is wondering what allison is wearing"
            ],
            "content":"<div class=\"\"><div> <span>allison had to go really bad. she tried to hold but before she was able to get the diaper off in the bathroom she ended up releasing her bowels and now she was in a messy diaper. so after that she took her diaper off wiped herself good and she powdered herself put a fresh diaper and fastened the tapes and made sure they were secure. but as soon as ellison was gonna exit the bathroom her friend marie was looking thru the window and wondering if allison was there...</span></div></div>",
            "created":1344056400,
            "id":1397646,
            "title":"Other"
        },
        "11111122":{
            "choices":[
                "allison tries to hold it but ends up messing her diaper",
                "allison soaks her diaper"
            ],
            "content":"<div class=\"\"><div> <span>marie notices allison is wearing a diaper but doesn't know for a fact if it is. so allison hears the knock on the door and puts her robe on and let's marie inside. once marie was inside she goes up to allison and starts tickling her. but then allison tried to not laugh but all of a sudden after marie tickled her she had to go really bad. she didn't want to do it in front of marie or she would know...</span></div></div>",
            "created":1344056400,
            "id":1397651,
            "title":"allison gets noticed by marie and she is wonder..."
        },
        "111111221":{
            "choices":[
                "ellison gets to the bathroom but ends up messing in her diaper",
                "allison gets to the bathroom in time but marie asks her a question"
            ],
            "content":"<div class=\"\"><div> <span>allison tries to contain herself but ends up loading the poopy mess in her diaper. not only did she end up messing herself but marie noticed and now allison had to deal with a heavy load in her diaper. she had to get to the bathroom quick before marie saw her diaper. so she tried to run upstairs but it made things worse and she had to go again...</span></div></div>",
            "created":1344056400,
            "id":1397652,
            "title":"allison tries to hold it but ends up messing he..."
        },
        "1111112211":{
            "author_id":"dragrako",
            "author_name":"Epimetheus",
            "choices":[
                "Cleans up and changes into panties/a new diaper",
                "Marie knocks on the door, concerned."
            ],
            "content":"<div class=\"\"><div> <span>Allison entered the bathroom and slammed the door behind her. Unfortunately the run up the stairs and the shock of the door hitting her messy diapered ass was too much and she lost control again. Her puckered anus yawned open and an even bigger load fell into he diaper, filling it to and beyond capacity.<br>\r\n<br>\r\nThe lump in the back expanded further and further and before long the diapered sagged down nearly to her knees. Before long though the last of her days meals completely emptied out and she sighed in relief.</span></div></div>",
            "created":1437109200,
            "id":2009027,
            "title":"Allison gets to the bathroom but ends up messin..."
        },
        "111111222":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "Before Allison could answer, Marie patted Allison's diapered butt",
                "Allison tells Marie the truth."
            ],
            "content":"<div class=\"\"><div> <span>While Allison was getting tickled, she laughed a lot.  Then her eyes got wide.  She felt her bladder releasing.  It went straight into her diaper.<br>\r\n<br>\r\nMarie asked, \"What's wrong?\"<br>\r\n<br>\r\nAllison just blushed as she stood in her warm, and soaked diaper.<br>\r\n<br>\r\n\"Did you pee your pants?\"  Marie asked teasingly.  Marie looked down and frowned.<br>\r\n<br>\r\n\"Why aren't your pants wet?\" Marie asked.</span></div></div>",
            "created":1355893200,
            "id":1490864,
            "title":"allison soaks her diaper"
        },
        "1111112221":{
            "author_id":"undeadviper",
            "author_name":"UndeadViper",
            "choices":[
                "Try and act cool about it and explain",
                "Break down and tell her everything"
            ],
            "content":"<div class=\"\"><div> <span>Allison's rear squished at the touch. Marie gasped, pulling her hand back.<br>\r\n\"What was tha-\" she stopped as her nose wrinkled, detecting a growing smell.<br>\r\nAllison breathed deeply, she slowly pulled down her pants. In full view of Marie was a swollen diaper. The front bloated and stained yellow. The rear was sagging heavily, already a large brown stain was growing across were her messy load had stretched the plastic skin.<br>\r\n\"You're wearing a diaper?\" Marie gasped</span></div></div>",
            "created":1463115600,
            "id":2147502,
            "title":"Before Allison could answer, Marie patted Allis..."
        },
        "111112":{
            "choices":[
                "allison messed herself",
                "allison wet herself"
            ],
            "content":"<div class=\"\"><div> <span>allison was brought outside and everyone saw her in her diaper lara a girl in the school also saw her in her diaper and started laughing as well then mrs. miller asked her where her pants where then allison told her that she left her pants in the class room and mrs. miller says to allison and let me guess you left your shoes in the room as well so then lara asks allison why she has to wear diapers and she says that she has a medical condition and everyone stopped in their tracks and asked her if she hates being in one and she says yes of course then mrs. miller breaks up the mob around allison and gaves allison her pants and she puts them on and her shoes as well and mrs. miller said if you had a medical condition that makes it worst for you to make it to the bathroom in time don't be ashamed to tell okay but the next time you are without your pants again i will report you to the principal you understand and allison said yes but as soon as they let everyone in allison had to go bad...</span></div></div>",
            "created":1340082000,
            "id":1363225,
            "title":"It’s not a dream."
        },
        "1111121":{
            "author_id":"undeadviper",
            "author_name":"UndeadViper",
            "choices":[
                "Try and run away from everyone",
                "Look to Mrs Miller for help"
            ],
            "content":"<div class=\"\"><div> <span>Allison felt her bowels clench and cramp. With growing dread she heard her bowels gurgle.<br>\r\n\"Oh no\" she whimpered, growing an even brighter shade of red.<br>\r\n\"What was that\" asked Mrs Miller, crossing her arms across her chest.<br>\r\nAllison gulped, she desperately glanced about for the bathroom, but it was nowhere in sight. \"I errr...\"<br>\r\n\"Stop stammering!\" replied the irritated Mrs Miller. <br>\r\nher stomach gurgled again, she could feel the long, heavy log of faecal matter slowly inching along. She tightened her sphincter muscles as hard as she could-feeling the chunky log pressing up against her anus.<br>\r\nShe was trapped. If she moved, then she wouldn't be able to hold her mess in. Staying was just as bad, even now more  students.<br>\r\n\"Allison!\" snapped Mrs Miller, growing more and more impatient with every second. \"Listen to me\"<br>\r\nIt felt like slow-motion, she squatted slightly and her muscles relaxed.<br>\r\nBLLAART! Everyone's head whipped around to stare at her as the loud farting noise filled the hall. The hot log slid out her backside and dropped into the sagging seat of the diaper. <br>\r\n\"Oh my god\" whispered Lara.<br>\r\nPFFFRRT! a squirt of mushy diarrhoea followed, splattering audibly against the plastic lining.<br>\r\nAllison wanted to disappear. The warm, squishy mess was resting against her buttocks, diarrhoea droplets oozing down her skin.<br>\r\n\"Allison just messed her diaper!\" a boy gasped in shock behind her,</span></div></div>",
            "created":1463115600,
            "id":2147498,
            "title":"allison messed herself"
        },
        "1111122":{
            "choices":[
                "Allison goes to class in her soggy diaper",
                "Allison gets changed and runs to class"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison tried to hold it but ended up soaking her diaper. all of a sudden she now had a bulge in her pants and allison was afraid that it would leak but she had two choices...</span></div></span></div>",
            "created":1341982800,
            "id":1376573,
            "title":"allison wet herself"
        },
        "11111221":{
            "choices":[
                "tried to make it to the bathroom but messed in her diaper",
                "messed in her diaper and it leaks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>allison didn't have much time to get changed in the bathroom so she was gonna have to go to class, but all of a sudden she had to go and she was having a bowel movement, she tried to hold it in as long as she could but i was no use and she...</span></div></span></div>",
            "created":1342069200,
            "id":1376977,
            "title":"Allison goes to class in her soggy diaper"
        },
        "11113":{
            "choices":[
                "Allison gets herself cleaned up and put in a fresh diaper in the sewing room",
                "Allison goes to the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>allison was almost done with her sewing her pants when she felt a bowel movement before she could even hold it in and started filling her diaper and she now had to sew the rest of her pants up in a dirty diaper she started moving around as it was uncomfortable and she was worried about the mess leaking out the sides of her diaper so as she finished her pants she put them on and all of a sudden the mess of her diaper started squishing up into the front of her diaper she knew she had to get changed in the bathroom but if she was careful and made sure she did get any mess in the sewing room that she wouldn't have to worry about going and changing in the bathroom choices she had to figure out...</span></div></div>",
            "created":1340082000,
            "id":1363187,
            "title":"Other"
        },
        "111131":{
            "choices":[
                "Allison heads in the bathroom and gets in a fresh diaper",
                "Allison heads to class in her dirty diaper"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison knew if she went to the bathroom she would have to get her dirty diaper off and put it in the garbage. but she knew she wouldn't do it in the sewing room without getting caught...</span></div></span></div>",
            "created":1341982800,
            "id":1376571,
            "title":"Allison gets herself cleaned up and put in a fr..."
        },
        "1112":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "The pants would fit her perfectly",
                "The pants had something wrong with them",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After her friend left, Allison rushed to the lost and found.  She dug through the pile of lost and found things.  She eventually found a pair of pants.</span></div></span></div>",
            "created":1340686800,
            "id":1367465,
            "title":"She goes to the lost and found to find another ..."
        },
        "11122":{
            "author_id":"bedwetbraeden",
            "author_name":"Braedenthebedwetter",
            "choices":[
                "Yes",
                "No, Something Else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Were the pants too tight because of her diaper? </span></div></span></div>",
            "created":1584507600,
            "id":2803129,
            "title":"The pants had something wrong with them"
        },
        "1113":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "They were tight",
                "They were see-through",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"You can borrow pants from me,\" said Marie. \"I have another pair in my locker.\"<br>\r\n<br>\r\n\"Thank you,\" said Allison.<br>\r\n<br>\r\nAllison covered the hole with her bag and they walked to the locker room.<br>\r\n<br>\r\nWhen they got there, it was mostly empty. Marie opened her locker and took out the pants. Allison put them on, but there was one problem with them. </span></div></div>",
            "created":1331528400,
            "id":1293660,
            "title":"Marie lets her borrow something of hers"
        },
        "11131":{
            "choices":[
                "allison goes to class",
                "allison goes to class but is noticed by everyone"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>allison tried to put on marie's pants but they were tight around the waist that the bulge of the diaper was showing inside the pants but she knew she had to get thru the day without anyone noticing!</span></div></span></div>",
            "created":1338699600,
            "id":1351692,
            "title":"They were tight"
        },
        "11133":{
            "choices":[
                "too big",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The pants were...</span></div></span></div>",
            "created":1336626000,
            "id":1333740,
            "title":"Something else"
        },
        "111332":{
            "author_id":"131242743858g",
            "author_name":"edfvhnaon",
            "choices":[
                "really tight, see through, and she had to poop",
                "fine. they were perfect."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the pants were...</span></div></span></div>",
            "created":1600202580,
            "id":2903643,
            "title":"more"
        },
        "112":{
            "choices":[
                "Fall down",
                "Pantsed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do her pants fall, or does someone pants her?</span></div></span></div>",
            "created":1328590800,
            "id":1272443,
            "title":"Her pants fall down"
        },
        "1121":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "She and Marie go to class",
                "She goes to the lost and found to find a belt",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Marie needed to go to the bathroom before class, so Allison went with her so they could talk. Marie went into a stall while Allison stood near the sink. All of a sudden, Allison’s pants fell down to her ankles. <br>\r\n<br>\r\n“Oh my God!,” she almost screamed, but stopped herself in time. <br>\r\n<br>\r\nShe quickly pulled her pants back up. Then she realized that she had forgotten to put on a belt. She had noticed before that her pants had been loose, but she didn’t expect them to fall down. Other than Marie, no one else was in the bathroom so no one saw what happened. She knew it could happen again, but she didn’t know what to do.</span></div></div>",
            "created":1328590800,
            "id":1272546,
            "title":"Fall down"
        },
        "11211":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Allison must give a presentation in front of the class",
                "Allison gets through class without anything happening"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison and Marie went to class. Allison thought she'd be okay as long as she spent most of the time sitting down.</span></div></span></div>",
            "created":1334293200,
            "id":1314949,
            "title":"She and Marie go to class"
        },
        "112111":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "Marie said, \"Show us your diaper.\"",
                "Allison's shorts fell down.",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison had to give a presentation that day.  She had to do it in front of the whole class.  While giving her presentation...</span></div></span></div>",
            "created":1543554000,
            "id":2584145,
            "title":"Allison must give a presentation in front of th..."
        },
        "112112":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "She messed her diaper",
                "Marie checked Allison's diaper",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison made it through class.  Nothing out of the ordinary happened.<br>\r\n<br>\r\nAfter class...</span></div></span></div>",
            "created":1543899600,
            "id":2585820,
            "title":"Allison gets through class without anything hap..."
        },
        "11212":{
            "choices":[
                "Find a restroom.",
                "Hold it in. / Go in the diaper."
            ],
            "content":"<div class=\"\"><div> <span>Allison decided to go to the lost and found to look for a belt. There was no way she was going to risk getting exposed. She found the perfect belt, and left. At least that problem was solved. Out of nowhere she noticed she had to go to the bathroom. She thought of going to the restroom, but what if someone heard her take it off? What other choice did she have? She doesn't want to wet it either. What if it leaks? What if she has to go more? Why did her mom get her into this situation? \"Why?!\" Allison muttered under her breath, although not loud enough for anyone to hear her. She had to make a decision.</span></div></div>",
            "created":1331355600,
            "id":1292066,
            "title":"She goes to the lost and found to find a belt"
        },
        "112122":{
            "choices":[
                "She trys to hold it in.",
                "She goes in the diaper."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which is it? Hold it in, or just let it flow into her diaper.</span></div></span></div>",
            "created":1331355600,
            "id":1292068,
            "title":"Hold it in. / Go in the diaper."
        },
        "1121222":{
            "choices":[
                "sex ed",
                "health"
            ],
            "content":"<div class=\"\"><div> <span>allison ends up filling her diaper 3/4 of it's max then she knew she had to get it off after she took her wet diaper off then she wiped and powdered herself and she put the fresh one on and then she fastened the tapes and made sure she went to class and it was...</span></div></div>",
            "created":1339995600,
            "id":1362413,
            "title":"She goes in the diaper."
        },
        "1122":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Everyone saw her diaper",
                "No one saw her diaper",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, someone came up behind Allison and pulled her pants down to her ankles. She didn't even look down at first. She looked at the faces of everyone in the hall. They were all laughing at her, except for Marie. She looked back to see the person who pantsed her, but they were gone. This had been happening to a lot of people at school recently and she was the latest victim. Allison bent down to pull her pants up.</span></div></div>",
            "created":1334293200,
            "id":1314952,
            "title":"Pantsed"
        },
        "11222":{
            "choices":[
                "track and field",
                "english"
            ],
            "content":"<div class=\"\"><div> <span>no one saw her diaper as she got them up in time but she ended up messing herself and realized she had to go to the bathroom and get changed as she got into the stall she pulled out a fresh diaper and took her dirty diaper off she knew she had to make sure that she wiped and powdered herself and then she fastened the tapes on her brand new diaper then she went to class and it was...</span></div></div>",
            "created":1339995600,
            "id":1362409,
            "title":"No one saw her diaper"
        },
        "113":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "science",
                "p.e.",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison made it to her class.  She didn't have any problems on the way to class.  The class she went to was...</span></div></span></div>",
            "created":1331787600,
            "id":1295387,
            "title":"She gets to class"
        },
        "1131":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "a potion",
                "a test",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Allison got to science class.  In science class, she sat down on one of the tall work stools.<br>\r\n<br>\r\nAfter that her teacher came.  The teacher took role call.  After that he explained what they would be doing in class.<br>\r\n<br>\r\nThat day she was working on a...</span></div></div>",
            "created":1340859600,
            "id":1368345,
            "title":"science"
        },
        "1132":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Marie picks up the shorts and sees Allison’s diaper",
                "Allison picks them up",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>…P.E. Allison went into the locker room to change into her gym clothes. She was always very careful when she did that. She’d put on her gym shirt first since it was long enough to cover her diaper, as long as she didn’t bend. She put the shirt on and took off her pants. Just as she was about to put her shorts on, Marie came up behind her and startled her, causing her to drop her shorts on the floor.</span></div></div>",
            "created":1333688400,
            "id":1310346,
            "title":"p.e."
        },
        "11321":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "started laughing",
                "said that Allison looked comfy",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Marie bent down and picked up Allison's shorts.  When she did, she saw Allison's diaper.<br>\r\n<br>\r\nMarie...</span></div></span></div>",
            "created":1543467600,
            "id":2583532,
            "title":"Marie picks up the shorts and sees Allison̵..."
        },
        "11322":{
            "choices":[
                "allison tried to hold it but messed in her diaper",
                "allison held it long enough to go the the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>allison told marie that wasn't cool so she had to make sure when she bent down to make sure her diaper wasn't exposed then she put on her shorts and after awhile marie said she was sorry for earlier and said that it was a joke but hopefully we still have a good day in class so they ran around the field and after p.e. she had to head to the bathroom and had to go really bad!</span></div></div>",
            "created":1338699600,
            "id":1351126,
            "title":"Allison picks them up"
        },
        "113221":{
            "choices":[
                "They Play...",
                "The Teacher says..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And so Allison makes a huge mess in her diaper and is forced to go to P.E. where...</span></div></span></div>",
            "created":1344574800,
            "id":1401778,
            "title":"allison tried to hold it but messed in her diaper"
        },
        "1132211":{
            "choices":[
                "She Gets to the Bathroom",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>     Allison returns to PE where the teacher decided for the class to play Lightning for the last few minutes of class. Allison was forced to play Lightning with a loaded diaper, each jump she made splashing the mess in her diaper. Others seemed to notice but didn't say anything, discounting the strange lumps as just folds. After PE ended a few minutes later, she went to the locker-room to use the bathroom.</span></div></div>",
            "created":1344661200,
            "id":1402741,
            "title":"They Play..."
        },
        "11322112":{
            "choices":[
                "Everyone laughing at her",
                "Someone standing up for her"
            ],
            "content":"<div class=\"\"><div> <span>Allison was about to make it to the bathroom when she felt a breeze on her legs. She looks down and finds that her shorts have been pulled down.<br>\r\n <br>\r\n\"ha, I knew it, You where diapers\" says a girl from behind. <br>\r\n<br>\r\nAllison looks around to find this girl she has never seen before behind her. You pull your shorts up and run into a bathroom stall. <br>\r\n<br>\r\nAllison curls up into a ball and cries her eyes out then she hears...</span></div></div>",
            "created":1365915600,
            "id":1571503,
            "title":"Some Kids idea of a Joke"
        },
        "113221122":{
            "author_id":"deden",
            "author_name":"Dedes",
            "choices":[
                "Marie",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was it?</span></div></span></div>",
            "created":1561611600,
            "id":2679205,
            "title":"Someone standing up for her"
        },
        "11323":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "Marie reached out and checked Allison's diaper",
                "Marie pulled her shorts down showing a diaper",
                "something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Something else happened.  That was when...</span></div></span></div>",
            "created":1543467600,
            "id":2583678,
            "title":"Other"
        },
        "113232":{
            "author_id":"deden",
            "author_name":"Dedes",
            "choices":[
                "Marie: Its a long story",
                "Marie explains why"
            ],
            "content":"<div class=\"\"><div> <span>Allison starts blushing in embarassment.<br>\r\n<br>\r\n\"Don't be embarrassed Allison,\" said Marie, \"you wanna know why?\"<br>\r\n<br>\r\n\"Why?\" Allison asked.<br>\r\n<br>\r\nMarie pulled down her shorts revealing a slightly used diaper.<br>\r\n<br>\r\n\"Wait, you wear diapers?\" Allison asked, \"Why?\"</span></div></div>",
            "created":1561611600,
            "id":2679207,
            "title":"Marie pulled her shorts down showing a diaper"
        },
        "1132321":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "wet",
                "poopy",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Its a long story... ill explain it another time... but for now, i beleive we both need a change\" Marie said pointing Allisons ___ diaper<br>\r\n</span></div></span></div>",
            "created":1605361800,
            "id":2939946,
            "title":"Marie: Its a long story"
        },
        "1133":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "math",
                "writing",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She went to a different class.  The class was...</span></div></span></div>",
            "created":1340946000,
            "id":1369262,
            "title":"something else"
        },
        "114":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "Allison messed herself in the middle of the hallway",
                "Allison started sucking her thumb",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Something else happened.  That something else was...</span></div></span></div>",
            "created":1331874000,
            "id":1295582,
            "title":"Other"
        },
        "1141":{
            "choices":[
                "go to the bathroom and get changed",
                "go to class and make sure no one notices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>before allison knew it her bowels released filling her diaper she knew she couldn't got to class with a poopy diaper.</span></div></span></div>",
            "created":1336712400,
            "id":1334630,
            "title":"Allison messed herself in the middle of the hal..."
        },
        "11411":{
            "choices":[
                "choir class",
                "english class"
            ],
            "content":"<div class=\"\"><div> <span>she decided before she went to class to change out of her messy diaper for she didn't want anyone to notice a bulge in her pants and she knew she couldn't sit in her seat and mash the contents on herself and the classes were an hour long and it would get her unwanted attention so she went into a stall and cleaned herself up and put on a fresh diaper and after she did that she threw the dirty diaper in the garbage. she heads to class and what would it be...</span></div></div>",
            "created":1336712400,
            "id":1334633,
            "title":"go to the bathroom and get changed"
        },
        "11412":{
            "choices":[
                "allison messes herself again",
                "allison holds it long enough to go"
            ],
            "content":"<div class=\"\"><div> <span>she knew she should go to the bathroom and get changed out of her messy diaper but her friend marie grabbed her by the hand and they headed to class before allison could say anything that's when she realized she couldn't sit down without mashing the contents of her diaper on herself but the bell rang and since it was english the teacher asked them to sit down knowing she had no chance but the sit she ended up mashing some of the contents on herself but she hoped it wouldn't bring any unwanted attention towards her but after class her headed for the bathroom when she realized she was sagging and she didn't want to leak from the sides and so she walked to the bathroom and once in the bathroom she had to go really bad.</span></div></div>",
            "created":1336712400,
            "id":1334636,
            "title":"go to class and make sure no one notices"
        },
        "114121":{
            "choices":[
                "ran to science class",
                "ran to p.e."
            ],
            "content":"<div class=\"\"><div> <span>she hold on for dear life but she started filling her diaper again and before she knew it she had to get her pants off so then she saw that she diaper was really full and saggy that she had to get it off and clean herself good after she went to the bathroom on the toilet she wiped herself good and put on a fresh diaper after that she threw the diaper in the garbage and ran to class.</span></div></div>",
            "created":1336712400,
            "id":1334639,
            "title":"allison messes herself again"
        },
        "1141211":{
            "choices":[
                "The Teacher Says That They Will Be Doing An Experiment With Diapers",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>      However, the bell rang just before she could get into class and as she entered the teacher said \"Allison, you're late again. No leaving class for a week.\"<br>\r\n      Allison knew she would have to go before and after class unless she used her diaper. Unfortunately, she felt pressure coming from her gut. She figured that she might be able to hold, not that she had much of a choice since she could not leave. However that was when...</span></div></div>",
            "created":1344661200,
            "id":1402749,
            "title":"ran to science class"
        },
        "11412111":{
            "choices":[
                "The Teacher Begins Spraying the Diapers with a Spray Can",
                "The Teacher Begisn Pouring a Yellow-Colored Liquid on the Diaper (Not -Urine)"
            ],
            "content":"<div class=\"\"><div> <span>      \"Today class, we will be doing an experiment with diapers. And I would warn you all of the effects of this experiment, but I don't want to spoil it.\" the teacher said as the students in the class began smiling, some wanting to see the experiment while others knew that the experiment would help them avoid learning anything. The students all got to their feet and began walking over to the table. Allison tried staying away from the front but the people behind her pushed her to the front by accident as they tried moving up to see. Several diapers,  sat on the front table along with<br>\r\n      \"Alright class. Let's begin.\" the teacher said.</span></div></div>",
            "created":1344661200,
            "id":1402764,
            "title":"The Teacher Says That They Will Be Doing An Exp..."
        },
        "114121111":{
            "choices":[
                "The Diapers Explode",
                "The Diapers Shrink, Leaking the Liquid Out of Them"
            ],
            "content":"<div class=\"\"><div> <span>      The Teacher lifted up a spray bottle and began spraying the diapers with a strange mist. The clean diaper did not change even though it got the most spray. The medium-wet diaper in the middle inflated slightly but Allison did not see anything else happen. The most wet diaper on the end inflated about the same amount as the medium-wet diaper, but that was it.<br>\r\n<br>\r\n      \"Ok everyone, watch closely, it will take a little bit for the full effect.\" the teacher said.<br>\r\n<br>\r\n      Everyone began watching the diapers intently, waiting for anything to happen, Allison included except she had to sneeze first. After a few minutes Allison began feeling pressure again, and although she did not want to go, she knew she could not hide the pain if she held it off for too long. So she let some pressure go and let the front of diaper begin to soak as she peed into them with her classmates all standing around her. A good five minutes later, she felt the pressure begin to increase in her bowels, to the point where it was beginning to get painful. She held on as much as possible to the mess wanting to be released in her diaper. Occasionally running her hand down to her butt in an effort to keep it in. However, as more time ticked by she could not hold it in.<br>\r\n<br>\r\n      After a few minutes, she was standing uncomfortably close to her classmates with a loaded diaper that was several pounds heavier than before. The now messy and soggy diaper were now pushing against her pants, making them puff out at least half an inch or more, though she could not look down to check else she would attract attention to her.<br>\r\n<br>\r\n     \"Look now class!\" the teacher said.<br>\r\n<br>\r\n     Allison looked up and saw the diapers all puff out a little bit more. Then the wet diapers...</span></div></div>",
            "created":1344661200,
            "id":1402772,
            "title":"The Teacher Begins Spraying the Diapers with a ..."
        },
        "1141211112":{
            "choices":[
                "Just Wait and Hope Nothing Bad Happens",
                "Try and Get Out of the Room"
            ],
            "content":"<div class=\"\"><div> <span>      Allison watched as the diapers shrunk a bit and the blue liquid leaked out from the two wet diapers.<br>\r\n<br>\r\n     \"See, even a little bit of this spray caused the wet diapers to compress.\" the teacher said.<br>\r\n<br>\r\n     \"Why did you show us this?\" asked one of the rare students who actually cared.<br>\r\n<br>\r\n     \"I thought it would be fun.\" the teacher responded frankly.<br>\r\n<br>\r\n     Meanwhile, Allison began feeling her diaper expanding out even more. It was then that she realized that her diaper may have been hit by the spray. She didn't really believe such a thing could even exist, but being accidentally by it when she had a diaper on was even more unbelievable. She needed to do something, and fast. She didn't want the class seeing her pants explode with mess as her diaper first expanded and then shrunk. <br>\r\n<br>\r\n     She decides to...</span></div></div>",
            "created":1344661200,
            "id":1402792,
            "title":"The Diapers Shrink, Leaking the Liquid Out of Them"
        },
        "11412111122":{
            "choices":[
                "Shes Chooses To Spill The Blue Liquid",
                "She Chooses To Reach For The Water"
            ],
            "content":"<div class=\"\"><div> <span>     Allison looked around for some way to get out of the room. She noticed both a beaker of blue liquid near her and a glass of water a little father away. If she was able to 'accidentally' spill one of the liquids on her, then she could probably ask the teacher to go to the bathroom to clean it up. But which one? The blue liquid was closer but something bad could happen. That water was safer but farther away.</span></div></div>",
            "created":1344661200,
            "id":1402810,
            "title":"Try and Get Out of the Room"
        },
        "114121111222":{
            "choices":[
                "She Runs for the Bathroom, To Get Rid of the Diaper",
                "She Runs for the Sewing Classroom, Think to Repair Her Pants"
            ],
            "content":"<div class=\"\"><div> <span>      Allison decided to reach for the water, feeling her diaper fluctuating as the spray played chemistry with her diaper. Even now she felt the mess in her diaper beginning to be pushed out of the diaper.<br>\r\n <br>\r\n     \"Yes Allison, can you hand me that?\" the teacher asked, seeing that she was reaching for the water.<br>\r\n<br>\r\n     Allison grabbed the water and brought it closer to her, making sure to spill a little bit on herself, a little bit of water splashing on the side of her pant's leg.<br>\r\n<br>\r\n     \"Allison, go the bathroom quickly and clean that off!\" the teacher told Allison as she left the room with a fast pace.<br>\r\n<br>\r\n     However, before she left she looked back and saw the teacher pour the clear liquid onto the cloth the diapers were sitting on. The dry areas were unaffected but the wet areas began dissolving.<br>\r\n<br>\r\n     \"You see class, science is cooler than you thought it was!\" the teacher exclaimed.<br>\r\n<br>\r\n     Allison was horrified, knowing that her pant's would soon be like that cloth once the mess in her diaper were pushed out. </span></div></div>",
            "created":1344661200,
            "id":1402843,
            "title":"She Chooses To Reach For The Water"
        },
        "1141211112222":{
            "choices":[
                "She Quickly Takes Her Diaper Off To Get A New One",
                "She Decides She Needs to Sew Up Her Pants First, Leaking Her Mess"
            ],
            "content":"<div class=\"\"><div> <span>     She decided to make a run for the sewing room, and arriving there she found that the door was open slightly. She looked inside and found no one inside luckily. She moved inside and quickly pulled off her pants which already had a size-able hole on the side of the right leg. She was about to start sowing her pants back together when her diaper started leaking the mess inside. </span></div></div>",
            "created":1344661200,
            "id":1402854,
            "title":"She Runs for the Sewing Classroom, Think to Rep..."
        },
        "11412111122221":{
            "choices":[
                "allison soaks her diaper",
                "allison messes in her diaper"
            ],
            "content":"<div class=\"\"><div> <span>allison takes her diaper off and starts to wiping herself. then she powders herself and puts on a fresh diaper. after that she fastens the tapes and makes sure they are secure. she continues to sew up the hole in her pants and after she is done is puts them back on then she puts her dirty diaper and a bag for until she gets out of school. then she heads to back to her science class when she has to go again...</span></div></div>",
            "created":1344834000,
            "id":1404061,
            "title":"She Quickly Takes Her Diaper Off To Get A New One"
        },
        "114121111222211":{
            "choices":[
                "allison's diaper expands then leaks",
                "allison messes in her diaper"
            ],
            "content":"<div class=\"\"><div> <span>allison ends up releasing her bladder right before she gets into her science class. so she gets back in the classroom and her teacher asks her if she would love to volunteer for a experiment. but the teacher saw that allison was wearing a diaper. the teacher take the spray bottle opens it and asks allison to close her eyes then her science teacher poured the water in her pants. they asked the teacher why happened. but the teacher said to the class: let's see for ourselves but all of a sudden her diaper started getting saggy. she knew her diaper would leak and the class would figure it out...</span></div></div>",
            "created":1344920400,
            "id":1404212,
            "title":"allison soaks her diaper"
        },
        "114121112":{
            "author_id":"themess",
            "author_name":"Mess",
            "choices":[
                "You Stay In Class",
                "You Run Out Of The Room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You teacher grabs this yellow stuff and starts pull it on the diaper make you want to use your diaper than you start messing and wetting your diaper making you hounty </span></div></span></div>",
            "created":1367989200,
            "id":1586566,
            "title":"Oh No..."
        },
        "12":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Marie comes back in and sees her",
                "Someone else comes in and sees her",
                "Nothing happens. She goes to her next class",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>…shorts. Then she went to school.<br>\r\n---<br>\r\nDuring her third period class, Spanish, Allison raised her hand to answer a question the teacher had asked. When she did that, her shirt lifted up a bit. Her friend Marie, who was sitting next to her, noticed.<br>\r\n<br>\r\n“Allison,” whispered Marie.<br>\r\n<br>\r\n“Yes,” said Allison.<br>\r\n<br>\r\n“Your panties are showing.”<br>\r\n<br>\r\nAllison panicked. She looked down and saw that her diaper was sticking out from the top of her shorts. She quickly pulled her shirt back down. “Thank you.”<br>\r\n<br>\r\nAfter class, Allison went to the bathroom to change her diaper. Marie followed her.<br>\r\n<br>\r\n“Are you alright?,” said Marie.<br>\r\n<br>\r\n“Yes,” said Allison, surprised to see Marie.<br>\r\n<br>\r\n“Are you sure? You’ve been acting weird lately. And the way you reacted in class. I don’t think anyone but me saw them.”<br>\r\n<br>\r\n“I’m fine.”<br>\r\n<br>\r\n“Are you wearing granny panties?”<br>\r\n<br>\r\n“Um… yes.” Allison thought telling her that was less embarrassing than the truth.<br>\r\n<br>\r\n“Oh. I understand. I wouldn’t want to be seen in those either. See you later.” She left to go to her next class.<br>\r\n<br>\r\nAllison was glad that Marie thought that she had been wearing panties instead of what she really had on. She checked to make sure she was alone in the bathroom. Then she went into a stall and changed her diaper. When she was done, she went to the garbage to throw out the old one.</span></div></div>",
            "created":1328590800,
            "id":1272228,
            "title":"...shorts"
        },
        "121":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "said, \"come here baby.\"",
                "started laughing at Allison",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Allison was heading to the garbage can.  She had the diaper in her hand.  The door opened and Marie walked back into the bathroom.<br>\r\n<br>\r\nThis caused Allison to stop in fear.  Marie stopped right after the door closed.  Marie Glanced at Allison's hands and spotted the diaper.<br>\r\n<br>\r\nMarie said, \"Um... is that yours?\"<br>\r\n<br>\r\nAllison blushed and nodded.<br>\r\n<br>\r\nMarie...</span></div></div>",
            "created":1332651600,
            "id":1302267,
            "title":"Marie comes back in and sees her"
        },
        "1211":{
            "choices":[
                "Allison accepts and notice she wet herself after the scare ",
                "allison accepts  and continues the day maybe even go home with Marie "
            ],
            "content":"<div class=\"\"><div> <span>Marie was about to make a few jokes but then noticed was beginning to cry. <br>\r\n<br>\r\nAllison tries to explain about her condition but the crying makes it harder but she does eventually get the words out. After hearing this and Allison continues to cry.<br>\r\nMarie- Come here baby.<br>\r\nAllison - sniff wah. Marie went over to Allison and gave her a hug rubbing her back and saying it's ok it's ok. I'm not gonna tell anyone I understand <br>\r\nMarie gives Allison a quick peck on the cheek to calm her down and it works. Then she says. I wanna help you so when you have a little accident come find me and I'll help you so nothing goes bad ok.  <br>\r\n<br>\r\nAllison has been having a hard time changing herself and doesn't want to be walked in on again. Allison ask will u keep watch? Marie says yeah I will I'll even change ur diapee for u wittle girl.  Marie laughs she couldn't resist. Now let's get you all ready and hey maybe after school u can come over and we can get comfortable with me \"taking care of you\" marie still holding Allison Allison then </span></div></div>",
            "created":1477890000,
            "id":2231117,
            "title":"said, \"come here baby.\""
        },
        "1212":{
            "choices":[
                "allison had choir class",
                "allison had cooking class"
            ],
            "content":"<div class=\"\"><div> <span>marie started to laugh at allison at first but she saw allison start to tear up. marie told allison it's okay you have a bladder infection and it's one of many medical conditions that you have that makes it harder for you to get to the bathroom on time. marie told allison the secret is safe with me so allison threw away the diaper and went to class...</span></div></div>",
            "created":1343278800,
            "id":1389791,
            "title":"started laughing at Allison"
        },
        "1213":{
            "choices":[
                "p.e.",
                "choir",
                "english"
            ],
            "content":"<div class=\"\"><div> <span>said to allison that her secret is safe with me and because most people have medical condition like you don't be ashamed to tell me i'm your friend and if i see that it's over your shorts i will inform you okay. after that allison threw away the diaper and went to class.</span></div></div>",
            "created":1336712400,
            "id":1334643,
            "title":"something else"
        },
        "122":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "a friend",
                "a teacher",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Someone else entered the bathroom.  The person glanced at Allison's hand.  The person saw the diaper.<br>\r\n<br>\r\nThis person was...</span></div></span></div>",
            "created":1338267600,
            "id":1347741,
            "title":"Someone else comes in and sees her"
        },
        "123":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "P.E.",
                "Science",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nothing happened in the bathroom.  She threw her diaper away without anyone seeing her.  She washed her hands.<br>\r\n<br>\r\nThen, she went to her next class.  The class she went to was...</span></div></span></div>",
            "created":1338440400,
            "id":1349509,
            "title":"Nothing happens. She goes to her next class"
        },
        "124":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "she noticed the sink seemed higher than normal",
                "she had to mess really badly",
                "something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>That was when...</span></div></span></div>",
            "created":1338526800,
            "id":1349859,
            "title":"Other"
        },
        "1242":{
            "choices":[
                "allison went to class in a messy diaper",
                "allison changed out of her messy diaper and got a hall pass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>before allison could hold it in she released her bowels in her diaper and knew she had no time to change out of the diaper</span></div></span></div>",
            "created":1338613200,
            "id":1350597,
            "title":"she had to mess really badly"
        },
        "12421":{
            "choices":[
                "The diarrhea comes out of her diaper, overloading it",
                "She is able to hold in it and get back to her seat when her diaper overloads"
            ],
            "content":"<div class=\"\"><div> <span>     She walked into class with her diaper sagging in her shorts. Luckily they were a loose pair of exercise shorts that disguised her loaded diaper. However, when she sat down, the mush spread out around her diaper and forced a good portion into her groin. That was when her bladder wanted to release its pressure. She figured that she could hold it she heard her name being called.<br>\r\n    \"Allison? Can you please hand me that math book?\" asked the teacher from the other side of the room.<br>\r\n    Allison looked up sheepishly at the teacher until it occurred to her that all she needed to do was grab the book on the shelf right next to her. She turned and looked at the shelf where she remembered last seeing the math book but it was not there. Instead she saw a set of geometric shapes.<br>\r\n    \"Its on the top shelf Allison.\" the teacher told her.<br>\r\n    She figured that as long as she took it slow, nothing bad would happen. She got up on her feet and stood up on her chair, trying to reach the top shelf, however, as she did so her hand knocked the book over and it fell even farther back on the shelf. She stretched to get the book when she felt a sudden pressure against her groin. Looking down she saw that the pyramid was pinned between her body and the other geometric objects behind it.<br>\r\n    \"Allison, please hurry.\" the teacher asked her, obviously getting annoyed by her slowness.<br>\r\n    She knew she would have to bear the pain as she pushed herself harder against the edge of the pyramid while searching with her hand to find the book. She found it quickly and began pulling it out when she began loosing her balance. She stumbled for a second and dropped the book on her stomach, making her bowels contract, pushing another wave of mess towards her anus. She stepped down from the chair and turned around, wanting to get rid of the book as quickly as possible to sit back down. Her math teacher never let anyone leave math class.<br>\r\n     \"Allison, please just bring the book up here.\" the teacher asked with a little anger in his voice.<br>\r\n     She gulped and began walking up to the teacher in the front of the room as the mess began pushing its way out of her.</span></div></div>",
            "created":1344574800,
            "id":1402080,
            "title":"allison went to class in a messy diaper"
        },
        "124212":{
            "choices":[
                "allison goes and gets her skirt cleaned up",
                "allison goes to p.e. and someone notices"
            ],
            "content":"<div class=\"\"><div> <span>allison was able to hold it in. but then when she sits down she ended up loading another mess in her diaper and she ends up filling her diaper to the point of leaking. the teacher had everyone pass out the math test and after that they got started. after she was done and after math class was over she turned in her math test. she headed to the bathroom to get her messy diaper off. she ended up wiping herself, powdering herself and putting a fresh diaper on. after that she fastened the tapes and made sure they were secure. but she realized that some of the mess leaked out the top and a little of it was on her skirt. allison knew she would have to get her skirt cleaned up or someone would notice when she headed into p.e.</span></div></div>",
            "created":1344574800,
            "id":1402180,
            "title":"She is able to hold in it and get back to her s..."
        },
        "1242121":{
            "choices":[
                "saw her skirt and asked who was in the stall",
                "saw her skirt and took it to the lost and found"
            ],
            "content":"<div class=\"\"><div> <span>allison realizes she would have to step out of the stall in her diaper to get the stain of her skirt. she started getting some paper towels and getting some soap and water on one of the big pieces and leaving the other dry so she could dry her skirt off afterwards. she got the skirt cleaned up when she heard some voices from outside the bathroom and ran into the stall she realized she dropped her skirt but before she was able to go grab it before they came in they...</span></div></div>",
            "created":1344574800,
            "id":1402182,
            "title":"allison goes and gets her skirt cleaned up"
        },
        "12421211":{
            "choices":[
                "lara tells allison that she has her diapers",
                "lara tells allison she has to the rest of the day without soaking her diaper"
            ],
            "content":"<div class=\"\"><div> <span>okay allison was wearing a skirt with shorts underneath which is a little weird. but back to the story. so allison got her shorts back on. lara asks allison: is this your skirt. allison said: yes. christine says to allison: okay it looks like you were trying to get something out of your skirt. allison turned red when she realized she forgot to dry her skirt. but what was allison thinking because she didn't know it was on her shorts too. allison had to get out of the stall and lara asked her why she was wearing shorts too. allison explained that she wanted to fit in with some trends and wore a skirt over her shorts. lara decided to gave her skirt back to her but told allison: listen you shouldn't be wearing a skirt over shorts because it makes you look weird. so allison agreed and put her skirt into her bag. christine said: didn't you see that stain on the back of her shorts. lara said: yes and i got a little plan. allison headed to her next class and it was p.e. she had to go into swimming class for the day. after that she headed to the shower and that's when allison had to go. but she held it in long enough and got a diaper on her. of course she had saw the stain and decided to get it cleaned after that she dried the shorts nad put them back on. lara noticed and asked allison: how's your diaper. allison said: what. i don't know what your talking about. lara said: i saw you cleaning the stain. allison realized lara had seen her in her diaper and she had to think of something fast...</span></div></div>",
            "created":1344574800,
            "id":1402208,
            "title":"saw her skirt and asked who was in the stall"
        },
        "13":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Someone sees up her skirt",
                "She sits in gum",
                "Nothing happens",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>…a skirt. It was her first time wearing one since she started wearing diapers, so she was nervous.<br>\r\n<br>\r\nAt school, Allison walked down the hallway to her first class, when she saw her friend Marie in her cheerleader uniform. Allison had wanted to be on the squad, but she had started wearing diapers before tryouts started, and she wouldn’t be able to hide them under the skirt. <br>\r\n<br>\r\n“Allison,” said Marie. “Are you going to the game tonight?”<br>\r\n<br>\r\n“Yes,” said Allison.<br>\r\n<br>\r\n“I still wish you’d tell me why you didn’t try out.”<br>\r\n<br>\r\n“I’ve been really busy lately,” she said, not able to think of a better answer.<br>\r\n<br>\r\n“With what?”<br>\r\n<br>\r\n“Um, I’ve got to get to class. Bye.” She walked off to class.</span></div></div>",
            "created":1328590800,
            "id":1272229,
            "title":"...a skirt"
        },
        "131":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Marie Walks up to her",
                "Someone Else"
            ],
            "content":"<div class=\"\"><div> <span>She began walking quickly, hoping to get away from Marie as fast as possible, when she trips over an empty bottle, she goes tumbling over with a *Thud*. Lucky for her there were only a few kids in the hall, she quickly stands up hoping noone saw up her skirt, when..</span></div></div>",
            "created":1328590800,
            "id":1272501,
            "title":"Someone sees up her skirt"
        },
        "1311":{
            "author_id":"falguni",
            "author_name":"Humming Bird",
            "choices":[
                "Allison couldn't avoid the question ",
                "Marie understands her problem"
            ],
            "content":"<div class=\"\"><div> <span>Allison's heart almost froze as she saw Marie. Her skirt was already a bit lifted up, exposing a small portion of her horror underneath. <br>\r\n<br>\r\n\"Allison, what are you wearing? Are those a new type of undergarments?,\" Marie asked, though the diapers were clearly seen.</span></div></div>",
            "created":1334811600,
            "id":1318981,
            "title":"Marie walks up to her"
        },
        "13111":{
            "choices":[
                "\"Yes,\" and try to get out of there fast ",
                "Say nothing and cry"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She teases her a bit and says, \"Is that a diapy?\"</span></div></span></div>",
            "created":1336626000,
            "id":1333717,
            "title":"Allison couldn't avoid the question"
        },
        "13112":{
            "author_id":"cutetigress22",
            "author_name":"babygirl",
            "choices":[
                "Marie black mails her, all she does is has to be her babygirl",
                "Marie tells the whole school"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Ummmm its kinda hard to explain\" Allison tries not to have a panic attack \"Its okay i get it\" but little did Allison know....</span></div></span></div>",
            "created":1477717200,
            "id":2230237,
            "title":"Marie understands her problem"
        },
        "131122":{
            "author_id":"dragrako",
            "author_name":"Epimetheus",
            "choices":[
                "She tells the WHOLE school",
                "She decides NOT to be a bitch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She Tells the entire school, OR she keeps her secret.</span></div></span></div>",
            "created":1477717200,
            "id":2230264,
            "title":"More choices than just Marie being a Bitch"
        },
        "1311221":{
            "author_id":"trista000",
            "author_name":"Sarah10",
            "choices":[
                "Run to the bathroom and cry",
                "Call your mother and tell her what happened"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cppink\"></span><br>\r\nMaria tells all her highschool friends, that Allison is wearing diapers. So the next day when Allison goes to school, the boys  left up her skirt and point and laugh at the diapered baby!!!! And the girls point and say does baby need to changed? Allison is so embarrassed, her whole face turns red like a tomato.</span></div></div>",
            "created":1534482000,
            "id":2534760,
            "title":"She tells the WHOLE school"
        },
        "132":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Someone walks in and sees her",
                "She hears someone coming and has to hide",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Allison went to first period and sat in her seat. At the end of class, she tried to get up to leave, but couldn’t. Then she saw that she had sat in gum. She got off the seat but then had to go to the bathroom to get the remains of the gum off her skirt.<br>\r\n<br>\r\nIn the bathroom, she went into a stall, took off her skirt, and started picking out the gum. When she finished, she needed to go to the sink to clean her skirt, which meant stepping out of the stall in her diaper. She looked into the other stalls to make sure there was no one in them. Once she knew she was alone, she came out of the stall.</span></div></div>",
            "created":1328763600,
            "id":1273946,
            "title":"She sits in gum"
        },
        "1321":{
            "choices":[
                "allison exit the stall",
                "should they open the stall and force allison out"
            ],
            "content":"<div class=\"\"><div> <span>someone sees allison running into the stalls with her skirt and they ask what she doing in there allison says that she is getting her skirt on but they ask what she was wearing allison told them undies but they aren't buying it and asked if she could get out the stall for a minute!</span></div></div>",
            "created":1338786000,
            "id":1352032,
            "title":"Someone walks in and sees her"
        },
        "13211":{
            "choices":[
                "allison runs to class",
                "allison gets caught running in the hall and is escorted to class"
            ],
            "content":"<div class=\"\"><div> <span>allison exits the stall when lara and christine lift her skirt and say wow does the little baby want a diaper change she told them to knock it off but they kept picking on her until the warning bell rang and they decided to leave but allison had only one minute to get to class and fast...</span></div></div>",
            "created":1339650000,
            "id":1359597,
            "title":"allison exit the stall"
        },
        "13212":{
            "choices":[
                "allison says she's wearing diapers because of her medical condition",
                "allison says they are diapers because someone dared her but they don't buy it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>allison takes too long and lara and christine open the stall and look in shock as they see allison in a diaper they start laughing and asking her what she was wearing she had to think of something fast...</span></div></span></div>",
            "created":1340254800,
            "id":1363818,
            "title":"should they open the stall and force allison out"
        },
        "132121":{
            "author_id":"deden",
            "author_name":"Dedes",
            "choices":[
                "They Mock her",
                "They understand and feel sorry for her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do Lara and Christine respond?</span></div></span></div>",
            "created":1561525200,
            "id":2679151,
            "title":"allison says she's wearing diapers because ..."
        },
        "132122":{
            "author_id":"scribblex",
            "author_name":"scribbles",
            "choices":[
                "Allison tries to chase them",
                "Allison stays in the stall"
            ],
            "content":"<div class=\"\"><div> <span> Lara and Christine look at each other with a look of excitement.  Before Allison could do anything, Christine grabbed her not letting her hide.  Lara had taken out her cell.  Allison had no idea what to do she simply wanted to cry.   She hears someone walk in, she let's out a sigh of relief as it happens to be Marie.  She is struck by confusion as she hears Marie ask the girls if the are having fun.  Marie walks to the stall and let's out a laugh.<br>\r\n<br>\r\n\"Oh my god! Haha, I knew it!\" \"You look quite adorable in that...Ally\" Marie said<br>\r\n\"I wasn't sure at first, but now that I know, this is just too funny\" said Marie<br>\r\n<br>\r\n\"Aww, poor ally gonna cry\" teases Marie while pinching Allison's cheek.<br>\r\n<br>\r\nChristine finally lets go of Allison.  However she had just now noticed that her skirt was in Lara's hands.  As she was pushed back into the stall, the girls exited with Allison's skirt.</span></div></div>",
            "created":1357707600,
            "id":1505378,
            "title":"allison says they are diapers because someone d..."
        },
        "1322":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "\"Finders keepers,\" said Lara",
                "\"Let's take it to the lost and found,\" said Lara",
                "Allison tries to get her skirt back from them without exposing her diaper"
            ],
            "content":"<div class=\"\"><div> <span>Allison was nervous about being out in the open in her diaper, so she tried to clean her skirt as quickly as possible. She was rubbing soap on it in the sink, when she heard two girls outside, and they were coming towards the bathroom door. Allison panicked and ran back into the stall. Unfortunately, she dropped her skirt along the way.<br>\r\n<br>\r\nThe girls came into the bathroom. One of them noticed the skirt on the floor and picked it up. \"I think someone forgot their skirt,\" said the girl, Christine.<br>\r\n<br>\r\n\"So someone is walking around in their panties?,\" said the other girl, Lara, jokingly. \"I'd like to see that.\"<br>\r\n<br>\r\n\"What should we do with it?\"</span></div></div>",
            "created":1334725200,
            "id":1318224,
            "title":"She hears someone coming and has to hide"
        },
        "13221":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Window",
                "Gym clothes"
            ],
            "content":"<div class=\"\"><div> <span>\"Finders keepers,\" Said Lara giggling, and soon enough they left, Allison knows that she has no chance of getting it back, \"Oh god, what can I do?\" She thinks in a stall wearing just a diaper. Theres a tiny window in the bathroom, but she might not fit through it, plus then she will be outside, or, she could find a way to sneak out of the bathroom and get her gym clothes..</span></div></div>",
            "created":1334811600,
            "id":1319219,
            "title":"\"Finders keepers,\" said Lara"
        },
        "132211":{
            "choices":[
                "Shirt",
                "Diaper"
            ],
            "content":"<div class=\"\"><div> <span>          Allison did not want to go out into the hallway wearing nothing but her diaper for bottoms. She paced around the bathroom for a little bit before she remembered something. Her next class was math where the teacher didn't like her and where she was failing. Her teacher threatened that if she screwed up one more time, she would be forced into taking the mass assistance program which took place after school. What was even worse was that the class took place at the same time as the game, which would mean ditching Marie. There was only twelve minutes between classes and she had already wasted a couple of those minutes just standing around.<br>\r\n<br>\r\n          She stared at the small window and gulped. The back entrance to the gym locker-rooms was located in the alley out the window. The forgetful gym teacher usually left it unlocked. She could get inside, get her gym clothes, and no one would be the wiser. It seemed like a better plan than wandering the halls with a diaper on.<br>\r\n<br>\r\n          She pulled the garbage can under the window and climbed up on top of it. Allison opened the window up and looked outside. It was bright and sunny outside, but more importantly, clear of anyone. She stood up on the tips of her toes and began pulling herself out of the window. However, she felt a snagging feeling from her waist. Not wanting to lose anything, she tried lowering herself back onto the garbage can. Instead of getting onto it though, she accidentally kicked it away. Fumbling, she began falling forward as her ______ was pulled off. </span></div></div>",
            "created":1350190800,
            "id":1446377,
            "title":"Window"
        },
        "1322111":{
            "choices":[
                "Locked",
                "Unlocked"
            ],
            "content":"<div class=\"\"><div> <span>          Fumbling, she began falling forward as her shirt was pulled off. However, as she landed on the ground, she heard a tearing noise. She found herself, lying awkwardly on the ground with her legs splayed up against the wall. The ground was warm... especially since she wasn't wearing anything up top. Allison turned over and saw that not only her shirt got caught on the window, but also her bra. She got up and tried getting them back, but the window just slammed shut and pinned her clothes between the metal and the brick wall.<br>\r\n<br>\r\n          With her face reddening quickly, she realized what had just happened. She cupped her firm breasts and began wetting her diaper. She turned towards the door and began sprinting towards it. Even as she jetted urine into the diaper, she began filling it with poop. By the time she was halfway to the door, it was already filled. That was when a wet mess blasted out of her ass and into her diaper. After that came a huge log which pushed out the back of her diaper.<br>\r\n<br>\r\n          Feeling the full-onset of panic, Allison got to the door and found that it was...</span></div></div>",
            "created":1350190800,
            "id":1446388,
            "title":"Shirt"
        },
        "13221112":{
            "choices":[
                "Exercise Shorts",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>          She found it unlocked and so she ran inside. After closing the door, she found that her diaper was bulging out entire inches. In the front her diaper was soaking wet and actually leaking urine. In the back her diaper was a mess and was heavy enough to be pushing out the back of her diaper, revealing her poop crusted butt. Allison moved her hands down to her diaper and grabbed onto the sides to keep it up. She then began searching the lockers for her's.<br>\r\n<br>\r\n          After a little bit of searching, she found her locker and opened it find...</span></div></div>",
            "created":1350190800,
            "id":1446525,
            "title":"Unlocked"
        },
        "132211121":{
            "choices":[
                "allison says yes to marie and puts on a shirt",
                "allison says yes but marie asks what allison is wearing"
            ],
            "content":"<div class=\"\"><div> <span>this was good news for allison as she found exercise shorts but the bad news is she was still bare for the top of her body and she was in a messy diaper. so she got a fresh diaper out of her bag and then she took her messy diaper off. then she wiped and powdered herself and put on the fresh diaper then she fastened the tapes and made sure they were secure and she threw the dirty diaper away. she then put the exercise shorts on and that's when someone saw that allison had no top on. allison turned around and saw it was marie. marie asked allison if she wanted to put one of her shirts on. allison knew she needed to put something over her body and fast...</span></div></div>",
            "created":1350277200,
            "id":1447464,
            "title":"Exercise Shorts"
        },
        "1322111211":{
            "author_id":"deden",
            "author_name":"Dedes",
            "choices":[
                "Marie asked what happened",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Marie hands Allison a shirt<br>\r\n<br>\r\nAllison puts the shirt on and thanks Marie.</span></div></span></div>",
            "created":1561525200,
            "id":2679142,
            "title":"allison says yes to marie and puts on a shirt"
        },
        "132211122":{
            "choices":[
                "Other",
                "Nothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More Options.</span></div></span></div>",
            "created":1350190800,
            "id":1446526,
            "title":"Other"
        },
        "1322111221":{
            "choices":[
                "She Hears Someone Coming",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More Options</span></div></span></div>",
            "created":1350536400,
            "id":1448980,
            "title":"Other"
        },
        "13221112211":{
            "choices":[
                "Go in the Diaper and Find Some Clothes",
                "Toss Diaper and Go in Toilet (Naked)"
            ],
            "content":"<div class=\"\"><div> <span>          However, before she could search her locker, she heard someone coming through the door. She spun her head left and then right, trying to find a place to hide. That was when she remembered that the shower room had some cover in them. So she immediately began running to the bathroom, her loaded diaper bouncing around her ass like her breasts on her chest. She luckily able to get into the last shower stall before being seen, but she was still in a poor state.<br>\r\n<br>\r\n          Allison looked down at herself. Her medium sized boobs were still uncovered and were now firmed up by the cool air. Her diaper was bloated and it was obvious that she used the diaper since it was wet around the crotch. She looked over her shoulder and was able to see her back since she was crouching. The diaper was even worse on the backside since she had accidentally unloaded her bowels into it. In fact, it was so bloated that it was sticking out almost half a foot. It was never made to hold so much, and so it was pulling down the entire diaper with multiple pounds of force. This made things even worse since she needed both hands to keep it from falling down. Except that even with both of her hands holding it up, her butt was still half exposed.<br>\r\n<br>\r\n          After a few minutes she heard a door open and then close, she left the shower area. She glanced around quickly and found that she was once again alone. Allison could now find some clothes to put on. However, she felt more pee coming and another bowel movement. She had to choose, just go in the diaper and search for clothes faster or just toss the diaper (the only piece of clothing she had) and go in the bathroom. However, she also did not have her diaper bag because that was with her stuff in the hallway so she would not be able to change herself until she got to her things.</span></div></div>",
            "created":1350536400,
            "id":1449488,
            "title":"She Hears Someone Coming"
        },
        "132211122111":{
            "author_id":"2crazy4summer",
            "author_name":"PoolParty1234",
            "choices":[
                "A pack of girly diapers with a pink heart on the bum",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Allison decided that she needed to go. So, she decided to go in the diaper, even though it is already filled. Allison started to poop in her filled diaper and just let it all out.<br>\r\n<br>\r\n*POOOT*<br>\r\n<br>\r\nAllison's diaper started getting lower, almost completely showing her bare butt. Then Allison finished pooping. Feeling relieved. Then unexpectedly let out a little fart.<br>\r\n<br>\r\n*TOOT*<br>\r\n<br>\r\nAllison blushed in embarrassment.<br>\r\n<br>\r\nAllison: heehee. Excuse me.<br>\r\n<br>\r\nAllison said to herself. Then her diaper started to break.<br>\r\n<br>\r\n*SNAP*<br>\r\n<br>\r\nAllison's diaper broke and fell to the floor, leaving her completely naked. <br>\r\n<br>\r\nAllison: EEP!<br>\r\n<br>\r\nAllison covered her crotch with her hands. <br>\r\n<br>\r\nAllison: there has to be something to wear!<br>\r\n<br>\r\nAllison looked around. Then she found....</span></div></div>",
            "created":1463202000,
            "id":2148232,
            "title":"Go in the Diaper and Find Some Clothes"
        },
        "132212":{
            "choices":[
                "she went to class",
                "she went to get her skirt back"
            ],
            "content":"<div class=\"\"><div> <span>Allison decided to make her way to the locker room so she can get her gym clothes once she had she gym clothes on she realized she had to go really bad she headed towards the bathroom but before she could get the diaper off she let loose and soaked her whole diaper she looked in horror as she wasn't able to remove it before she was able to use the bathroom but she decided to remove the diaper in time when she needed to poop so that saved her from crapping herself so she put a new one on and threw the wet diaper away.</span></div></div>",
            "created":1336453200,
            "id":1332734,
            "title":"Gym clothes"
        },
        "13222":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Try to get to the lost and found",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's take it to the lost and found,\" said Lara.<br>\r\n<br>\r\n\"No!,\" thought Allison.<br>\r\n<br>\r\nAfter spending a few more minutes in the bathroom, they did just that. Allison had been too afraid to speak up, but now she had made things worse for herself. She was alone in the bathroom in her diaper. Her shirt wasn't long enough to cover it. She could either try to get to the lost and found without being seen and get her skirt back, or come up with another solution. </span></div></div>",
            "created":1334811600,
            "id":1319114,
            "title":"\"Let's take it to the lost and found,\" said Lara."
        },
        "132221":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "…hides in a closet",
                "…hides in a classroom"
            ],
            "content":"<div class=\"\"><div> <span>Allison knew she couldn’t stay in the bathroom all day. She would have to go to the lost and found and get her skirt back. She stepped outside the bathroom and into the hallway. No one was around. Allison slowly walked to the lost and found, hoping she wouldn’t be seen. As she got closer, she heard footsteps. Allison…</span></div></div>",
            "created":1335243600,
            "id":1321969,
            "title":"Try to get to the lost and found"
        },
        "1322212":{
            "choices":[
                "She Decides to Stay",
                "She Decides to Leave the Room"
            ],
            "content":"<div class=\"\"><div> <span>          Allison looked to the side and saw that the art room door was open. She rushed inside and hid against on the wall to the left of the doorway. She heard the footsteps getting louder, and so she climbed up onto a counter so that she could hide behind a cabinet. She squatted awkwardly to stay behind the cabinet, and was forced to pull her legs out to the side to make sure her toes did not poke out over the counter.<br>\r\n<br>\r\n          Meanwhile, the footsteps got louder and she heard them stop outside the door. She held her breath as she heard the person step into the room and walk along the front of it. She poked her head out and saw the secretary of her school  shuffling through a stack of papers on the teacher's desk with her back turned. Allison knew she had to get down to hide behind desks now. She silently slid down to the floor, but she couldn't control her bladder since she was so nervous.<br>\r\n<br>\r\n          She began jetting pee into her diaper, making it sag and get increasingly heavy. She held her breath as the secretary continued going through more papers when suddenly the art teacher came into the room. She did not notice Allison off to the side, but was instead focused on the secretary. The secretary turned to the art teacher and began talking with each other. The two kept on talking for a long time, Allison was even able to see the lone clock in the room tick away as a half-hour went by without them stopping.<br>\r\n<br>\r\n          Allison was forced to continuing squatting in her soaked diaper, all the while her bowels began needing relief. She bit her lip in distress as she hoped the two would just leave the room already. However, her conversation lasted longer than she could hold her mess in. A solid lump of poop slid into her diaper, bulging the already bloated diaper. She almost gasped that she had just shit herself, but if she made any noise, she would be in trouble. Finally the two women left the room, but there was less than five minutes left in the period, meaning the hallways would be filled with people...</span></div></div>",
            "created":1348290000,
            "id":1432771,
            "title":"…hides in a classroom"
        },
        "13222122":{
            "choices":[
                "allison says yes but lara picks on her",
                "allison says yes but asks for her skirt back"
            ],
            "content":"<div class=\"\"><div> <span>allison headed out of the room to the lost and found when she saw the art teacher in the hallway. she headed back in the classroom when the art teacher asked allison why she was wearing any clothes underneath. the art teacher told allison to get to the lost and found and get something to cover herself up with. after that allison headed to the lost and found and found her skirt. a girl behind her grabbed the skirt and asked if the skirt was hers. allison had to think of something to say and fast...</span></div></div>",
            "created":1348549200,
            "id":1434919,
            "title":"She Decides to Leave the Room"
        },
        "132221222":{
            "choices":[
                "allison refuses and decides to clean herself off",
                "allison accepts but lara has another favor to ask of her"
            ],
            "content":"<div class=\"\"><div> <span>allison said yes to lara.<br>\r\n<br>\r\nlara asked allison: are you wearing diapers.<br>\r\n<br>\r\nallison said: yes, but they are for my bladder control problems.<br>\r\n<br>\r\nlara looked at the back and laughed and said: wow does the baby need a change.<br>\r\n<br>\r\nthat's when she grabbed the skirt from lara and ran for the bathroom. allison went into a stall and locked it. then someone came in and of course it was lara.<br>\r\n<br>\r\nlisten if you unlock the stall i will change you out of your dirty diaper but you must do me a favor. lara said to allison.<br>\r\n<br>\r\nallison replied: like what.<br>\r\n<br>\r\nlara said: you have to walk to the rest of your classes with a diaper and onesie on.<br>\r\n<br>\r\nallison didn't know what to think...</span></div></div>",
            "created":1349672400,
            "id":1442918,
            "title":"allison says yes but asks for her skirt back"
        },
        "13223":{
            "author_id":"whatthe94",
            "author_name":"whatthe94",
            "choices":[
                "Willingly walk out",
                "you take too long and they barge in"
            ],
            "content":"<div class=\"\"><div> <span>Allison stood on top of the toilet and said.....<br>\r\n<br>\r\nAllison,\"Excuse me,but that's my skirt.\"<br>\r\n<br>\r\nLara,\"Oh...why is it out here?\"<br>\r\n<br>\r\nAllison,\"I sat in gum,and I was cleaning it off....I ran in hear when y'all came in and...\"<br>\r\n<br>\r\nChristine,\"Say no more.\"<br>\r\n<br>\r\nAllison,\"Great just toss it here.\"<br>\r\n<br>\r\nLara:\"Uhm....no.\"<br>\r\n<br>\r\nAllison:\"No??\"<br>\r\n<br>\r\nLara,\"Yeah if you want your skirt back you're gonna have to let us see you in your panties.\"<br>\r\n<br>\r\nAllison,\"I....am um...not wearing panties.\"<br>\r\n<br>\r\nChristine,\"Now we have to see.\"<br>\r\n<br>\r\nAllison,\"NO!!!!\"<br>\r\n<br>\r\nLara,\"You know those stalls aren't Fort Knox.....so either you come out here and let us see...or we go in there,and I promise you there will be punishment....so what's it gonna be???\"</span></div></div>",
            "created":1337662800,
            "id":1343049,
            "title":"WHAT?????"
        },
        "132231":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Allison goes to her next class, which Lara is in",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Lara and Christine were going to see her either way, so Allison willingly stepped out of the stall in her diaper. At first, the other girls stood there in shock, but then they laughed.<br>\r\n<br>\r\n“Wow!,” said Christine, while still laughing. “When you said you weren’t wearing panties, this wasn’t what I was expecting.”<br>\r\n<br>\r\n“This is much more embarrassing than being half naked,” said Lara.<br>\r\n<br>\r\n“Can I have my skirt now?,” said Allison.<br>\r\n<br>\r\n“Not yet. I want to know why you’re wearing that. Was it a dare?,” said Lara.<br>\r\n<br>\r\n“Yes,” said Allison, believing that them thinking that was better than the truth.<br>\r\n<br>\r\n“Okay, diaper girl. Here you go.” Lara handed Allison her skirt. Allison quickly put it back on in front of them and was relieved to be covered again.<br>\r\n<br>\r\n“Thank you,” said Allison, and then she left the bathroom, leaving the two friends alone to talk.<br>\r\n<br>\r\n“I’m surprised you gave back her skirt,” said Christine. “I thought we’d play monkey in the middle with it.”<br>\r\n<br>\r\n“Maybe we’ll do that later. I think she lied before,” said Lara.<br>\r\n<br>\r\n“You want to confront her?”<br>\r\n<br>\r\n“No. I think she’s in one of my classes later. Before that, there’s something I want to do.<br>\r\n<br>\r\n-----<br>\r\n<br>\r\nAllison went to her second period class, and then her third, which was PE. After that, she went to the locker room and took a shower. She felt the urge to pee once again. She clenched her legs together and tried not to think about it.<br>\r\n<br>\r\nShe soon finished showering and wrapped herself in a towel. She went to her locker and opened it. Her regular clothes and her gym clothes were in there, and so was her bag, but there was one thing missing… her bag of diapers. Someone had taken them.<br>\r\n<br>\r\nThere was a bathroom in the locker room. She quickly got dressed and ran to it to pee. As she sat on the toilet, she realized that in the few months since she started wearing diapers, this was the first time she actually wanted to wear one. It was just like the day she went to the mall with her mother, except this time she was naked under her skirt. Now she had to try and hold it in until she got home.</span></div></div>",
            "created":1338354000,
            "id":1348678,
            "title":"Willingly walk out"
        },
        "1322311":{
            "choices":[
                "allison does a favor for lara",
                "allison is worried about them seeing her in diapers"
            ],
            "content":"<div class=\"\"><div> <span>allison had to make sure no one saw under her skirt so she went to the lost and found to find out if there was a pack of diapers but there was none the nurse asked her why she was naked underneath and she said that her mom has me wearing diapers to school but my bag of diapers is missing so the nurse said say no more is this it and allison said to the nurse a big thank you but since the nurse knew about the diapers now she told allison this will be my big secret okay so the nurse put the diaper underneath allison and fastened the diaper and secured the diaper in place and told allison to get to class before she was late lara was waiting for allison to get to the class so everyone would see what she had underneath her dress but lara was shocked that allison got her diaper bag back lara thought she had just brought it to the lost and found but someone must of saw it and gave it back to her after class lara confronts allison and says that she will make sure everyone knows about you wearing diapers</span></div></div>",
            "created":1338613200,
            "id":1350531,
            "title":"Allison goes to her next class, which Lara is in"
        },
        "1322312":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Allison makes it through the classes",
                "Allison fails"
            ],
            "content":"<div class=\"\"><div> <span>Allison’s nervousness was making her want to pee more, so she did. Meanwhile, the locker room became less crowded. When she finally came out of the stall, she was greeted by Lara. Seeing her startled Allison.<br>\r\n<br>\r\n“Remember me from earlier,” said Lara.<br>\r\n<br>\r\n“Yes,” said Allison.<br>\r\n<br>\r\n“I’m Lara, by the way.”<br>\r\n<br>\r\n“I’m Allison.<br>\r\n<br>\r\n“Did you enjoy your bathroom trip?”<br>\r\n<br>\r\n“Why would you ask that?”<br>\r\n<br>\r\n“Because that’s the last time you’re going for a while, if you want to get your diapers back.”<br>\r\n<br>\r\n“You took my diapers?!”<br>\r\n<br>\r\n“You might want to lower your voice. Other girls are here.”<br>\r\n<br>\r\n“Please, give them back,” said Allison, quietly.<br>\r\n<br>\r\n“So it wasn’t a dare. You really need them?”<br>\r\n<br>\r\n“Yes.”<br>\r\n<br>\r\n“I’ll give them back to you, if you get through the next two classes without peeing.”<br>\r\n<br>\r\n“WHAT?!”<br>\r\n<br>\r\n“Yes. When I went into your locker, I looked at your program card and saw that your next class is with one of my friends. If you try to go to the bathroom, she’ll let me know. And then you and I have fifth period together, so I can watch you.”<br>\r\n<br>\r\n“And what if I can’t hold it in?”<br>\r\n<br>\r\n“Then not only will you make a mess, I’ll tell everyone you wear diapers.”<br>\r\n<br>\r\n“Why are you doing this?”<br>\r\n<br>\r\n“Because it’s fun. You should go now. You don’t want to be late for class.”<br>\r\n<br>\r\nEach class was 45 minutes, with 4 minutes between each. Allison wasn’t sure she’d last through two classes, and Lara wasn’t going to make it easy.</span></div></div>",
            "created":1338613200,
            "id":1350966,
            "title":"Other"
        },
        "13223121":{
            "choices":[
                "allison puts on a fresh diaper and puts the bag of diapers in the lockers",
                "allison gets caught with the bag of diapers"
            ],
            "content":"<div class=\"\"><div> <span>well allison had to make sure after each class to go to the bathroom so she went to the bathroom first because she had to go and then she ran to her next class and sat down in her seat she had to make sure no one saw that she was wearing nothing underneath her skirt and after that class she ran to the bathroom again and make sure she went before because if she was to get her diapers back she was to make it thru this class so she could get her diapers back after class lara told allison to meet her at the locker room so allison went to the lockers and lara gave her the bag of diapers and told her if she ever left her skirt on the floor told lara would tell everyone in school that she was wearing diapers and lara told allison to have a nice day and never to do the same mistake again!</span></div></div>",
            "created":1338699600,
            "id":1351094,
            "title":"Allison makes it through the classes"
        },
        "13223122":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Allison is laughed at as soon as she comes out of the bathroom",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Allison went to her fourth period class. She didn’t know who Lara’s friend was, so she didn’t know who to look for. She sat in her seat and tried not to focus on the fact that she needed to pee or that she had nothing on under her miniskirt. She kept her legs closed, listened to everything the teacher said, did her class work, and kept looking at her watch. Time was moving too slow for her.<br>\r\n<br>\r\nBy the time she was halfway into the class, she was feeling even worse. She couldn’t sit still, she kept crossing and uncrossing her legs, and two people had gone to the bathroom, reminding her of her problem. Then she saw Lara out in the hallway. She was walking past the room, staring at Allison, and drinking water from a bottle. Allison continued to control her bladder.<br>\r\n<br>\r\nWhen class finally ended, Allison had managed not to pee, but she still had to get through another class, and Lara would be there. She had hoped to sneak off to the bathroom before she went there, but Lara was waiting for her when she came out of the classroom.<br>\r\n<br>\r\n“I see you stayed dry,” said Lara, looking at Allison’s skirt.<br>\r\n<br>\r\nThey went to class and Allison sat in her seat. Lara then sat in the seat on her right. Lara took out her bottle of water and drank more of it in front of her. Allison did the same thing she did in the last class, trying to focus on anything but peeing. Lara wanted to make sure she focused on nothing but that.<br>\r\n<br>\r\nWhile the room was silent, Lara whispered to Allison, “Do you feel like going yet?” Allison didn’t respond. She just looked at her watch again.<br>\r\n<br>\r\nLara asked her the same question a few minutes later. Allison ignored her, so she did something else. She put her hand behind Allison’s back and tickled her. Allison kept herself from laughing, but she almost peed. She closed her legs tight, which Lara noticed. Lara moved her hand down to Allison’s right leg and tickled it. Allison couldn’t hold it in any longer. There was still a lot of time before class ended, but she had to go now, even though she knew what that meant. She asked to go to the bathroom and the teacher let her, but when she stood up, her bladder burst. She peed on her seat, which was only noticed by Lara.<br>\r\n<br>\r\n“EWWW!!,” yelled Lara, in order to draw attention to what Allison had done. “You just peed on the chair.”<br>\r\n<br>\r\nAllison held her head down and ran out of the room before she could hear the reactions of the class. She went to the bathroom and stayed there for the rest of the period. She had left her things in the class, so she would still have to go back there. She was sure Lara would be telling everyone about her diapers now. As hard as she tried to hide it, her secret was out.<br>\r\n<br>\r\nThe bell for the next period rang.</span></div></div>",
            "created":1338699600,
            "id":1351646,
            "title":"Allison fails"
        },
        "132231221":{
            "choices":[
                "allison goes to p.e.",
                "allison tries to find lara before going to p.e."
            ],
            "content":"<div class=\"\"><div> <span>so she had to go back to the classroom to get her stuff and knew everyone was gonna laugh at her but then jason told her that lara was wrong for doing what she did but jason asked if she had another pair of panties to wear but she said no not really lara said to allison what's the matter baby pee her pants oh wait i mean skirt jason told her to stop picking on allison and lara said fine but next time you won't be so lucky then jason went to the bathroom and went to the classroom and cleaned up the mess from the floor and her seat and then she went to class!</span></div></div>",
            "created":1338699600,
            "id":1351883,
            "title":"Allison is laughed at as soon as she comes out ..."
        },
        "1322312211":{
            "author_id":"falguni",
            "author_name":"Humming Bird",
            "choices":[
                "Allison decides to sneak out of class",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok, everyone, time to do our usual warm up exercises\" The p.e instructor announced to the group of students as Allison entered the class. <br>\r\n<br>\r\nOh no! Allison's heart froze. Warm up meant revealing her private in front of everyone. Allison just wished she had a diaper on! </span></div></div>",
            "created":1338872400,
            "id":1353057,
            "title":"allison goes to p.e."
        },
        "13223122111":{
            "choices":[
                "She Pees in the Hallway",
                "She Messes on the Floor"
            ],
            "content":"<div class=\"\"><div> <span>          Allison realized she needed to just get out of there, she didn't know where Lara was to get her diaper back and to get her gym shorts she would have to pass the entire class. She backed up, opened the door, and left gym. However, she was still only wearing a miniskirt that stretched mere inches past her privates and barely around her rear end. What was worse was that she began feeling the need to go and she was still in the hallway and she had no time go anywhere.<br>\r\n<br>\r\n          What Happens?</span></div></div>",
            "created":1349931600,
            "id":1444451,
            "title":"Allison decides to sneak out of class"
        },
        "132231221111":{
            "choices":[
                "Take Diaper and Punishment",
                "Try and Take the Diaper Forcibly"
            ],
            "content":"<div class=\"\"><div> <span>          She began leaking pee onto the floor, only a little at first. But Allison knew more was coming so she began running towards the nearest bathroom. However, the leak turned into a stream, which turned into spurts when she was only halfway there. Rounding a corner in the hallway, she began jetting urine onto the floor, making a huge puddle. Unfortunately, the waterfall of liquid coming out of her forced her to stop and finish peeing. It took several minutes, and Allison was so focused on the feeling of relief that she did not even remember that she was still in the middle of the hallway.<br>\r\n<br>\r\n          What snapped Allison out of it was when Lara walked up to her from the same hallway Allison had just peed down. She was smiling and holding onto Allison's diaper in her hand.<br>\r\n<br>\r\n          \"Want it back?,\" she said, still grinning.<br>\r\n<br>\r\n          Allison was going to say \"No\" in defiance but a sudden bowel movement suddenly changed her mind.<br>\r\n<br>\r\n          \"You are going to do me a favor,\" Lara told Allison.<br>\r\n<br>\r\n          Does Allison take the diaper and accept Lara's punishment?</span></div></div>",
            "created":1349931600,
            "id":1444455,
            "title":"She Pees in the Hallway"
        },
        "1322312211111":{
            "choices":[
                "allison goes to class in her messy diaper but messes in her diaper",
                "allison goes to class in her messy diaper but soaks her diaper"
            ],
            "content":"<div class=\"\"><div> <span>allison decides to take the diaper and put in on in front of lara. then all of a sudden she let loose a poopy mess in her diaper and lara looked in shock and started to laugh. after that lara told allison that she would have to wear her messy diaper in class. allison knew if she had another bowel movement then everybody would notice. so allison had to think about it and fast...</span></div></div>",
            "created":1349931600,
            "id":1444696,
            "title":"Take Diaper and Punishment"
        },
        "13223122112":{
            "choices":[
                "allison puts on a diaper",
                "allison gets her gym shorts on"
            ],
            "content":"<div class=\"\"><div> <span>allison went to get her gym shorts from her locker when lara walked in and said to her instead of putting on your gym shorts why don't you put on a diaper instead besides you didn't pass my test but i be as funny to be seen in diapers after they look under your skirt!</span></div></div>",
            "created":1338872400,
            "id":1353098,
            "title":"allison went to get her gym shorts"
        },
        "132231222":{
            "choices":[
                "allison walks outside in a shirt and diaper",
                "allison gets caught skipping class"
            ],
            "content":"<div class=\"\"><div> <span> lara told allison that if she did her a favor that she wouldn't tell anyone that she wears diapers but if allison refused then her secret was going to be exposed!<br>\r\n<br>\r\nallison asked lara: what do you want me to do<br>\r\n<br>\r\nlara said: i dare you to wear only a shirt and diaper<br>\r\n<br>\r\nallison said to lara: i can't do that!<br>\r\n<br>\r\nlara said: well i could tell everyone your little secret<br>\r\n<br>\r\nallison said: no i will do anything you want<br>\r\n<br>\r\nlara said: okay but since the bell for sixth period already rang let's walk outside</span></div></div>",
            "created":1338699600,
            "id":1351682,
            "title":"lara make allison a deal"
        },
        "1322312221":{
            "content":"<div class=\"\"><div> <span>allison decides to walk outside in just a shirt and diaper and then lara thought it be funny for her to do it as well so she told allison to go to the football field and wait for her there as soon as allison saw was lara in a shirt and diaper she was blush red! allison said to lara why are you wearing my diapers lara told allison not so loud everyone will hear you and allison told lara whispering how can you do this to me lara told allison that if she was to wear a diaper to school she was to wear one of her diapers for today since she didn't hold it in during her class then the school bell rang and lara didn't realize that she was going to be seen with a diaper on as much as allison but allison said karma's a bitch now you have to deal with people laughing at you as much as me but the boys and lara's friend christine looked shocked but christine said since she didn't get thru class without peeing in made her wear a shirt and diaper out here but christine said to lara your also in a shirt and diaper and why because i thought it be funny if we were wearing the same thing! christine said to lara why if she was to be send outside where these guys would laugh at her i mean at least don't wear diapers too! lara started darting for her car she wouldn't even think of what they were thinking of her now but christine gave allison her skirt back and she put it on and told her that you have to realize that you are not to drop your skirt on the floor again! but for lara she realized her prank backfired and she was going to be the girl that wore a shirt and diapers but for allison since the school now didn't care about allison's secret anymore as they figured she had a bladder problem and couldn't make it to the bathroom! but for lara her mom found out and she has to wear diapers to school i know right the popular girl is now a diaper girl like allison!</span></div></div>",
            "created":1338786000,
            "id":1352206,
            "title":"allison walks outside in a shirt and diaper"
        },
        "132232":{
            "choices":[
                "allison has to put her diaper on behind the shower room",
                "allison has to leave her diaper there for later on"
            ],
            "content":"<div class=\"\"><div> <span>allison takes too long and they use a key to unlock the stall and see allison in a diaper christine started laughing and saying to allison what are you wearing is that a diaper lara just looks at allison in shock and cracks a laugh as well but after that lara asks allison if she had to wear them because she had a medical condition and allison told lara yes after that lara told allison not to step foot in the bathroom and leave her skirt because lara told allison if she did that she will tell everyone that she wears diapers after lara hands allison her skirt she heads for the lockers and takes all but leaves one spare diaper from her bag in her locker then as soon as allison gets out of swimming class into the showers that she thinks somethings up she gets out of the shower and checks her locker to see her diaper bags gone but she doesn't see the spare diaper at first so she really has to go bad so as soon as she makes it to the toilet and relieves her bladder and her bowels she goes and washes her hands and checks in her locker to see a spare diaper but as soon as she was gonna put it on she saw she didn't have any privacy...</span></div></div>",
            "created":1339650000,
            "id":1359605,
            "title":"you take too long and they barge in"
        },
        "1322321":{
            "choices":[
                "allison makes it thru class without wetting her diaper",
                "allison fails to make it thru and her secret is blowned"
            ],
            "content":"<div class=\"\"><div> <span>allison has no chance as she didn't want to be naked underneath her skirt so she fastened the tapes and made sure they were secure and then lara walks in and smacks yo on the butt and says wow how did i forgot about that one allison said what do you mean did you tak my diaper bag i want it back please gave it back lara told allison not so fast besides i got a better condition if you don't soak your diaper more than once i will gave you your diapers back if you do then you will have no chance but to tell everyone that you wear diapers...</span></div></div>",
            "created":1339650000,
            "id":1359610,
            "title":"allison has to put her diaper on behind the sho..."
        },
        "1323":{
            "choices":[
                "allison exits the stall in her wet diaper",
                "they force the door open and look in shock at her wet diaper",
                "they force the door open and they see her wet diaper and tear it off"
            ],
            "content":"<div class=\"\"><div> <span>allison got out of stall to clean her skirt when lara and christine spot her and allison runs into the stall. lara sees the skirt on the ground and asks why it's on the ground. allison's face is blush red because she didn't know what to do. allison asked lara for her skirt back but lara wanted to see allison in her panties. allison said she wasn't wearing any. lara said to allison that she had to see this. but before allison got out of the stall she had to go badly but before she was able to get out of the stall her bladder released in her diaper soaking her diaper half-way. christine said to allison that lara didn't have all day. allison had to figure out what to do and fast...</span></div></div>",
            "created":1344661200,
            "id":1402430,
            "title":"Other"
        },
        "13233":{
            "choices":[
                "allison had to keep from wetting her diaper for the rest of the day",
                "allison fails"
            ],
            "content":"<div class=\"\"><div> <span>allison took too long and they forced the door open then they brought her out of the bathroom in her diaper and tore it off. allison couldn't believe it she was naked from the waist down. but then lara noticed allison had to go again. lara said to allison: why don't you go to the bathroom like a big girl instead of your diaper. that's when she ran back into the stall, sit down on the toilet and let her bladder release. off course they threw the diaper away and told allison since you wear diapers we will make you wear them for the rest of the day. but lara said to allison: on one condition...</span></div></div>",
            "created":1344661200,
            "id":1402431,
            "title":"they force the door open and they see her wet d..."
        },
        "133":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "she went to change her wet diaper",
                "she went to the cafeteria for lunch",
                "somewhere else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nothing happened in class.  The bell rang to let people know that class was over.<br>\r\n<br>\r\nShe stood up.  Then...</span></div></span></div>",
            "created":1338613200,
            "id":1350634,
            "title":"Nothing happens"
        },
        "1331":{
            "choices":[
                "allison put on some tights",
                "allison went to class normally"
            ],
            "content":"<div class=\"\"><div> <span>allison went to the bathroom to go her wet diaper off. after that she put on a fresh new diaper and she put underneath herself then she fastened the tapes and made sure it was secure. she thought about it and wondered if she should put on some tights. or just be as normal as possible for the day...</span></div></div>",
            "created":1343365200,
            "id":1390833,
            "title":"she went to change her wet diaper"
        },
        "134":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "Someone Hears it.",
                "She uses it.",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hmm....What else?</span></div></span></div>",
            "created":1328590800,
            "id":1272498,
            "title":"Other"
        },
        "1342":{
            "author_id":"epicbraester",
            "author_name":"diapermesser",
            "choices":[
                "Pee",
                "Poop",
                "Both ends, as diapers were intended for"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>For what does she use it for?</span></div></span></div>",
            "created":1555822800,
            "id":2648095,
            "title":"She uses it."
        },
        "13422":{
            "author_id":"epicbraester",
            "author_name":"diapermesser",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>Right as she is walking into the classroom, Allison feels the need to poop. Badly. Before she can even act on that knowledge, it all just comes rushing out into her diaper. the bell is about to ring and Allison is forced to sit down at her desk. Does anybody notice she pooped herself?</span></div></div>",
            "created":1555822800,
            "id":2648096,
            "title":"Poop"
        },
        "13423":{
            "author_id":"131242743858g",
            "author_name":"edfvhnaon",
            "choices":[
                "Her mom picks her up. ",
                "Her mom doesnt pick her up, and instead asks to talk to the nurse."
            ],
            "content":"<div class=\"\"><div> <span>Allison uses the diaper, and just as that happens her crush walk up to her! He see her diaper sagging and laughs at her. He records her, as she is still using the diaper! After she has finally finished, her diaper is so full that she can't walk! She gets sent to the nurse, changed, and then she calls her mom. </span></div></div>",
            "created":1600201320,
            "id":2903635,
            "title":"Oh no!"
        },
        "134232":{
            "author_id":"131242743858g",
            "author_name":"edfvhnaon",
            "choices":[
                "Her crush.",
                "Marie."
            ],
            "content":"<div class=\"\"><div> <span>Talk to the nurse. Ally hands the phone over. The nurse looks at Ally. \"your mother said to put you into daycare, so thats what we're doing.\" But instead of bringing her to a different building, she just volunteers some students to take care of her. The head caretaker is...</span></div></div>",
            "created":1600201440,
            "id":2903637,
            "title":"Her mom doesnt pick her up, and instead asks to..."
        },
        "1343":{
            "choices":[
                "She was asked what was happening by a friend...",
                "She was called up for something...",
                "Her diaper broke open..."
            ],
            "content":"<div class=\"\"><div> <span>      Allison goes to science class where she takes a seat on her science chair, making sure to keep her skirt tight around her to make sure no one had even a chance to see her diaper. However, as she did so, she felt the need to relieve herself, she had to admit that the diaper was at least useful in some situations.<br>\r\n    \"Alright class, we will be moving to the science lab for today. And please sit in your assigned seats!\" the teacher told the class as they began getting up to leave.<br>\r\n     Allison got up with the rest of her class and went into the science lab across the hall from the classroom. And because it was her science teacher who never shut up, and who never said anything that was NOT going to be on a test. Allison watched her science teacher intently and did not realize what was on her seat. She fluttered out her skirt as usual and sat down in a puddle of cold liquid. She immediately stood up and looked down at the seat, realizing that her diaper had soaked up the entire puddle of liquid. In disgust she picked up the unused stool next to her and sat down in that instead.<br>\r\n     \"Now class, because the test is next week! I have decided to give you all a pop quiz today!\" her teacher said enthusiastically as the paper began getting passed around the room.<br>\r\n     That was when Allison realized that she had forgotten to go to the bathroom before she came to school, which had been while she had needed to pee so soon. But she usually got rid of all of the previous day's meal food as well. She then raised her hand, not wanting to take a dump in her diaper, peeing was one thing, but sitting in her own crap for an hour was another thing.<br>\r\n     \"And that means no leaving the room until you are done!\" her teacher said with a very derpish face.<br>\r\n     Allison put her hand down and instead took her pop quiz and picked up a pen. She figured that she could finish before nature made its call. And that was when she saw that it was several pages long, and doubled sided. She gulped and began working hard, answering questions without even reading what they ask. However, she knew that her teacher would not accept anything less than a B+ from her since she was one of the top students-\"Never missing a minute of class!\" as he put it. This thought forced her to go back and began seriously begin considering the questions, all while trying to ignore the growing pressure in her bowels.<br>\r\n     She looked up at the clock after seemingly working for hours on it, knowing that her friendly but douchey teacher probably planned on this taking more than one day to complete considering she had only just completed the backside of page one. The clock told her that she had only been in class for a half an hour and since the second and third pages were even longer, she knew that she would never make it to the end of class. She decided that she would relieve a little bit of the load now and then deal with the rest later. She let go for a split second but a bit more came out than she expected as a mess of crap slid out from her butt and was squished under small ass. She felt even more embarrassed about them, as if it wasn't enough she was peeing in them, now she was shitting in them... and sitting in it. And unfortunately for Allison, the pressure had only temporarily gone as it returned in force, forcing even more of the mush out, pushing it up to the front of her body, rubbing against her pussy lips. She silently gasped and looked down at her skirt and saw no indication of the mess now tickling her vagina and filling her ass up.<br>\r\n     \"Oh, it appears the clock has stopped,\" the teacher began noticing the clock and checking his watch \"its actually 9:59, class ends now!\" he said as the taunting bell rang.<br>\r\n     Allison realized she only had to wait another couple minute to dodge this mess and like facepalming, except that she still had a pen in hand and an unfinished pop-quiz. She got up and felt the mush slid down into the diaper, making it sag slightly down.<br>\r\n     \"All students please proceed to the gym for the school spirit day!\" the announcer cheerfully announced.<br>\r\n     Allison knew she could just go to the bathroom quick and change her diaper when her science teacher said \"Allison, put your quiz on the table and then go!\"<br>\r\n     Allison put it down on the table and left the room, and was about to go to the bathroom when she noticed the principle walking down the hallway towards her. She immediately turned away and began walking towards the gymnasium, knowing that the principle would think she was skipping.<br>\r\n     A few minutes of walking slowly in the crowd with a load of messy poop in her diaper later. She was sitting uncomfortably crammed between her friends as her body begged to relieve itself. Finally she could resist any longer and let another lump go through, filling her diaper to the max even as she was forced to clench her cheeks together to prevent even more coming through. She knew she was in trouble now. The mush was beginning to leak through the diaper and run down the interior of her soft thighs and the mess did not seem to be letting up. Even now she even more agony as urine fought the mess to get out of her tight pussy.<br>\r\n     That was when...<br>\r\n     <br>\r\n</span></div></div>",
            "created":1344574800,
            "id":1401776,
            "title":"Other"
        },
        "13431":{
            "choices":[
                "you had an accident",
                "nothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Are you okay?\" her friend Susan asked.<br>\r\n<br>\r\nYou tell her...</span></div></span></div>",
            "created":1355547600,
            "id":1488418,
            "title":"She was asked what was happening by a friend..."
        },
        "134312":{
            "choices":[
                "She realized she was out of diapers",
                "Someone walked in"
            ],
            "content":"<div class=\"\"><div> <span>\"Nothing, I'm fine,\" Allison responds.<br>\r\n<br>\r\nWhen spirit day was over, Allison stood up to leave. Her diaper was filled front and back with soft poop, and it was sagging heavily, almost to the point of falling. She goes to the bathroom to change. That was when...</span></div></div>",
            "created":1355547600,
            "id":1488422,
            "title":"nothing"
        },
        "1343121":{
            "choices":[
                "throw away her diaper and go nude under her dress",
                "tape her diaper up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She saw that she was out of diapers. \"Now what?\" she says. She couldn't go the rest of the day like that. She decides to...</span></div></span></div>",
            "created":1355547600,
            "id":1488423,
            "title":"She realized she was out of diapers"
        },
        "13431212":{
            "choices":[
                "poop her diaper again",
                "wait it out"
            ],
            "content":"<div class=\"\"><div> <span>She reaches into her book bag and pulls out some tape. She wraps it around the waist and the leg holes as best she can. She wipes the leaks off her legs and leaves the bathroom. Her diaper is extremely heavy now, with only the tape holding back any leaks. She looked at the clock and saw that it was 12:00. Unfortunately, she still had another 3 hours before she could go home. She goes to lunch and sees that they are serving spicy wings today. \"Just what I need...\" she thought. But, hungry as she was, she didn't have any other choice.<br>\r\n<br>\r\nIn her final class of the day, she starts to feel cramps in her stomach again. She only has 20 minutes left of class. Does she...</span></div></div>",
            "created":1355547600,
            "id":1488425,
            "title":"tape her diaper up"
        },
        "134312121":{
            "choices":[
                "the door is locked",
                "someone walks in"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She can't hold it, and she releases another load of soft poop into her diaper, so much so that it begins leaking even despite the tape. When school was finally over, she goes to the bathroom to wipe off the leak. She is about to leave when...</span></div></span></div>",
            "created":1355547600,
            "id":1488427,
            "title":"poop her diaper again"
        },
        "1343121211":{
            "choices":[
                "try and break the door down",
                "wait overnight"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The janitor had already locked the bathroom door. She pulls out her cellphone to call her mom, but she can't get a signal. She bangs on the door pleading for someone to let her out, but nobody comes. She decides to...</span></div></span></div>",
            "created":1355547600,
            "id":1488428,
            "title":"the door is locked"
        },
        "13431212112":{
            "choices":[
                "she was getting a faint signal",
                "it was a Friday"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She decides she has no choice but to wait the night out. She pulled out her phone again to check the time. That's when she saw...</span></div></span></div>",
            "created":1355547600,
            "id":1488430,
            "title":"wait overnight"
        },
        "134312121122":{
            "choices":[
                "tries to open the bathroom door again",
                "Takes her diaper off"
            ],
            "content":"<div class=\"\"><div> <span>Allison sees on her phone that it is a Friday. She would have to wait all weekend for someone to get her out! And since she was supposed to be with her friends all weekend, her mother would not suspect anything was wrong until Sunday afternoon. Not to mention that her diaper was still very, very full and she had no other diapers with her. Luckily for her, she has food in her book bag from lunch, which should last her for the weekend.<br>\r\n<br>\r\nLater on that night, Allison has to poop again. She could have gone to the toilet, but since she was already in such a heavy, messy diaper, she decided there would be no point. She pushed as her diaper expanded even more, adding to the thick layer of poop. The diaper was now so heavy that she almost found it hard to stand up. And worse, she was starting to get a rash. She decided she might need to wipe herself off. She went to get some toilet paper, but saw that it was completely gone from every stall. She also discovered that the toilets were drained and wouldn't flush, so that she couldn't use them even if she wanted to. Later that night, after having some more spicy wings from lunch, she again has to pee and poop. She goes in her diaper, which is so full that it is actually difficult to fit anything else in it. Tired, she lies on the floor and goes to sleep.<br>\r\n<br>\r\nAllison woke up, reminded of her situation by a slight burning sensation on her butt. She realized she was getting diaper rash, and with the rest of Saturday and Sunday still to spend in her diaper, she knew she had to do something. So she...</span></div></div>",
            "created":1355547600,
            "id":1488436,
            "title":"it was a Friday"
        },
        "1343121211221":{
            "choices":[
                "Bad",
                "Really Bad"
            ],
            "content":"<div class=\"\"><div> <span>          Realizing that without the diaper, there would be nothing to go into, she kept it on. Much to her disgust of course. She paced the bathroom for a few hours, with nothing to do but tenderly poke and watch her own diaper grow steadily largely as she had to use increasingly more. Eventually she found that there wasn't even any more space for the crap, and so it began wedging up her vagina awkwardly and after that even pushing itself back up her asshole. Her phone said it was about noon when she tried to get through the door again.<br>\r\n<br>\r\n          Allison tried the handle and lock again, to no avail unfortunately. The door was definitely locked-up tight for whatever reason that was. Next she tried ramming it with her body, though that was pretty useless. After that Allison tried pushed on the door which only succeeded in mushing the contents her diaper. She a multiple of ways to get the door open for another hour before she started feeling hungry for lunch. Find that so, she looked into her bag to find out what she had available. Inside she found that she did have one type of food that would go bad if she did not eat it soon, and so Allison unwrapped her soft-shell taco and began eating it. She did not know why it was with her stuff, but she accepted it anyway.<br>\r\n<br>\r\n          She would come to regret that decision as the taco proved to be the straw that broke the camel's back. <br>\r\n<br>\r\nBut how bad is it?</span></div></div>",
            "created":1355634000,
            "id":1489031,
            "title":"She Tries the Door"
        },
        "13431212112211":{
            "choices":[
                "her diaper reaches bursting point",
                "the door opens"
            ],
            "content":"<div class=\"\"><div> <span>Allison pooped so badly that all of the poop lodged in her anus was pushed into the dense pile that was in her diaper, along with the contents from earlier that day. She heard a small tear, and saw that the tape on her diaper had started to rip. She reached into her book bag and wrapped more tape around the diaper to keep it from falling or leaking. The mix of poop and urine in her diaper was continuing to make her rash worse. She wanted to itch, but the tapes on her diaper kept her from reaching in. Even if she could, she didn't want to stick her hand in the deep mess contained within. Later...</span></div></div>",
            "created":1356498000,
            "id":1494699,
            "title":"Bad"
        },
        "134312121122111":{
            "author_id":"dragrako",
            "author_name":"Epimetheus",
            "choices":[
                "She has to go again and the Diaper Explodes!",
                "Someone comes in."
            ],
            "content":"<div class=\"\"><div> <span>Once she reinforced the tap around her waist and legs Allison had to poop again and while she didn't relish the thought of straining the over taxed diaper even further she couldn't hold it forever and so released her load.<br>\r\n<br>\r\nThis was a bad idea.<br>\r\n<br>\r\nAll over the bloated diaper small tears began to appear. Allison retried using the tap to cover them before they leaked but  as she continued to poo into it the more tears that began to appear. After five minutes of pooping and taping she finally finished her massive load, but she also finished her tap.<br>\r\n<br>\r\nThe diaper was truly enormous now, so full that it nearly reached her knees. Slowly as now to risk it bursting she waddles to the mirrors and examines that giant diaper covered in patches of duct tap.<br>\r\n<br>\r\nWhat happens next.</span></div></div>",
            "created":1407474000,
            "id":1838832,
            "title":"her diaper reaches bursting point"
        },
        "1343121211221111":{
            "author_id":"alucard88",
            "author_name":"Chrom8814",
            "choices":[
                "poop and make her diaper explode",
                "Or find something to break the door down and still risk her diaper exploding"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>allison begins to feel a familiar sensation in her belly she has to poop again but she's afraid that her diaper will explode if she poops again but she cannot hold it forever so she has a choice</span></div></span></div>",
            "created":1442898000,
            "id":2038135,
            "title":"She has to go again and the Diaper Explodes!"
        },
        "134312121122112":{
            "choices":[
                "a friend/family member",
                "a school faculty/staff member"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The door opens, revealing...</span></div></span></div>",
            "created":1356498000,
            "id":1494700,
            "title":"the door opens"
        },
        "1343121211221121":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "friend",
                "family member"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison saw the door open.  Then she saw someone enter.  She recognized this person.  It was a...</span></div></span></div>",
            "created":1359003600,
            "id":1516435,
            "title":"a friend/family member"
        },
        "13431212112211212":{
            "author_id":"dragrako",
            "author_name":"Epimetheus",
            "choices":[
                "Kim believes her daughter and they go home (Do NOT end the branch here)",
                "The door shuts and now BOTH of them are stuck, and in need of relief"
            ],
            "content":"<div class=\"\"><div> <span>Her mom.<br>\r\n<br>\r\n\"Allison!\" Her mother shouted in worry and anger as she saw her daughter in the sorry state she is now. Tapping up her ever expanding diaper.<br>\r\n<br>\r\n\"Mama!\" Allison shouted as she ran over and hugged her mother tightly even as she continued to fill her overly full diaper.<br>\r\n<br>\r\n\"Don't \"Mama\" me little miss! I was worried sick! Why are you in here crapping yourself like there is no tomorrow!?\" Allison's mother raged.<br>\r\n<br>\r\nAllison back away frightened, again still vigorously crapping her diaper that now hug to her knees, and tried to explain. \"I came in here to change before coming home but by the time I finished the janitor had already locked the door and left. I tried banging on the door but no one would answer!\" She explained and finally her poo was finished.<br>\r\n<br>\r\n\"Why didn't call someone to help you?\" Allison's mom, let's call her Kim for conveniences' sake, asked now much calmer and more reasonable. \"And why didn't you use the toilets instead of shitting and pissing yourself nearly the entire weekend?\"<br>\r\n<br>\r\n\"I tried to call someone but with the door shut I couldn't get a signal and the toilets are all drained and shut off for the weekend.\" Allison explained hoping her mother would believe her.</span></div></div>",
            "created":1407474000,
            "id":1838838,
            "title":"family member"
        },
        "1343121211221122":{
            "choices":[
                "a teacher",
                "the principal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it?</span></div></span></div>",
            "created":1356498000,
            "id":1494701,
            "title":"a school faculty/staff member"
        },
        "13431212112211221":{
            "author_id":"lkora",
            "author_name":"Lnear",
            "choices":[
                "Nurse",
                "Teacher"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Teacher or the school nurse.</span></div></span></div>",
            "created":1418446800,
            "id":1901922,
            "title":"a teacher/nurse"
        },
        "13431212112211222":{
            "choices":[
                "removes her diaper",
                "urinates/poops in her diaper"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The principal opens the door, finding Alison in her indescribably full diaper. \"Oh thank God!\" she says. She begins explaining, but the principal cuts her off. He grabs her by the hand and leads her to his office. Next, he...</span></div></span></div>",
            "created":1356498000,
            "id":1494703,
            "title":"the principal"
        },
        "134312121122112222":{
            "choices":[
                "a loud noise",
                "Mr. Marvin"
            ],
            "content":"<div class=\"\"><div> <span>Before Allison can resist, the principal (Mr. Marvin) undoes his fly, opens the front of her diaper, and starts peeing into it. \"What are you-\" Allison says, but he covers her mouth with his hand and continues his long piss. After a minute, he is finally done, and Allison can feel his urine on top of her poop. She is disgusted, and again tries to question Mr. Marvin. But before she can get a word in, he grabs duct tape from off of his desk and puts it over her mouth. He says, \"You've been a very naughty girl, pooping and peeing so much in just that diaper. As punishment, you're going to keep that diaper on for the next week. You'll stay in this room, locked in my closet which only I have access to. I'll come in to feed you and use you as my bathroom, and that is it. To make sure you don't make any noise or try to escape, your feet will be tied and your mouth will be taped, unless you're being fed. As I said, this diaper will remain on you, with additional diapers added as needed. I'll be sure to tell your mother and your friends that you are performing an extra credit assignment by going to a math camp for the week. Do I make myself clear?\" Allison, in tears at this point, can only nod her head yes as she is led to the principal's slightly-over-sized closet and has her feet tied to the wall. Mr. Marvin puts a new, large diaper over the heavily used one she is still wearing. He pulls the back of the old one and begins to poop inside it, causing it to finally burst and start filling the new diaper. \"Oh, and don't even think about letting anyone hear about this when you are done here, otherwise you'll see a rather large deduction in your grades.\" He leaves, and Allison is left in the dark closet in total disbelief. She feels her stomach gurgling again, and poops and pees into the new diaper, causing it to further expand and droop. Her rash has begun to burn worse, and she knew it would only continue to worsen as the week went on. Her diapers now stretched almost a foot in every direction, and standing made her legs grow tired. She sat down, squishing Mr. Marvin's poop into her butt and mixing it with her own poop. Despite the pain on her butt and all over her waist area, she laid down and fell asleep.<br>\r\n<br>\r\nShe was woken up a few hours later by...</span></div></div>",
            "created":1356498000,
            "id":1494712,
            "title":"urinates/poops in her diaper"
        },
        "1343121211221122222":{
            "choices":[
                "tell her to give him a blow/hand job",
                "hump her diaper"
            ],
            "content":"<div class=\"\"><div> <span>Mr. Marvin rushed into the room, causing Allison to sit up abruptly. He pulls her to her knees and tells her to open the front of the diaper. He goes on pooping for at least 5 minutes straight, leaving several new pounds of semi-solid poop in the diaper. He pulls up his pants, and looks at Allison, who appears to be having stomach irritations of her own. Unable to hold it, she releases a steady flow of soft poop into her diaper, with Mr. Marvin still watching. He can tell what she is doing, and is immediately turned on. Does he...</span></div></div>",
            "created":1356498000,
            "id":1494717,
            "title":"Mr. Marvin"
        },
        "13431212112211222222":{
            "choices":[
                "try to take off the diapers",
                "try to break out of the closet"
            ],
            "content":"<div class=\"\"><div> <span>He pulls his pants down, gets behind her and starts humping her diaper while she is still pooping. He can feel it flowing against his groin as he thrusts into the overly-full diaper, smashing the poop against Allison's butt. As he feels himself start to climax, he quickly pulls the back of the diaper out and cums inside of it, much to Allison's disgust. He again pees in the diaper, and seeing that it is about to leak, puts a new diaper over top of it. \"I'll be back later with some food,\" he says as he walks out of the closet. Now with three diapers on, Allison sits back down with her butt separated from the floor by more than a foot of poop and pee filled diapers. She has long lost the ability to close her legs, and can't stand up without some effort. Her rash is getting even worse, and she is getting desperate. Does she...</span></div></div>",
            "created":1356498000,
            "id":1494725,
            "title":"hump her diaper"
        },
        "134312121122112222222":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she succeed?</span></div></span></div>",
            "created":1356670800,
            "id":1496225,
            "title":"try to break out of the closet"
        },
        "1343121211221122222222":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>No matter how much Allison yanked and scratched and tore at the rope that kept her bound to the wall, she couldn't get herself free. All she could do was sit down and entertain herself by poking her ever-growing diaper. She wondered how much bigger it could get, and whether she would be able to make it to the end of the week, seeing as she was only a day into this torture.<br>\r\n<br>\r\nA few hours later, Mr. Marvin walked in with a box of Chinese. \"Well, at least he'll be feeding me decent food,\" she thought at first. Then she realized why he bought Chinese. \"Oh great,\" she thought. Mr. Marvin ripped the duct tape from her mouth. \"Ow!\" she squeaked. \"Shhh...\" Mr. Marvin shushed her, and put the food in front of her. To her surprise, he stayed in the room and ate with her. \"Now,\" he said in between bites, \"I'm sure you're probably wondering why I'm doing this to you.\"<br>\r\n<br>\r\n\"Well of course I am!\" she exclaimed. \"What kind of sick freak would do this to an 18 year old girl? I can't even stand up in this stupid diaper anymore, and you're not helping by adding to the mess that's in it!\" As she said this, she already felt the Chinese start to kick in.<br>\r\n<br>\r\n\"You see,\" he said, \"ever since I was a teenager I've fantasized about girls being in diapers. Not just being in them, but using them as well. I always imagined what it would be like to have a girl that wore and used a diaper right in front of me. That was when I saw you in the hallway on Friday. Your skirt lifted a little, and I saw your diaper. Not only did I see it, but I saw that you had used it. I knew that you would be visiting the restroom later that day, so I stood hiding and watching until you went in. Once I was sure you and no one else was in there, I locked it. Before you walked in, I took the liberty of taking away all of the toilet paper and draining the toilets to keep you from going to the bathroom normally. Unfortunately, I had some business to attend to elsewhere, so I couldn't get you out until the next day. That was when I saw just how big and heavy you had made your diaper, and I loved it. I wanted to make it bigger and bigger, until it was so impossibly big that you couldn't even stand without it sagging to the floor. That's what I'm in the process of doing right now.\"<br>\r\n<br>\r\n\"...That's, um... That's pretty messed up,\" Allison said. Her stomach was hurting quite badly now.<br>\r\n<br>\r\n\"Maybe. But it's what I'm going to do. I had school cancelled this week so that I can visit you without interruption. I've explained to your mother that you're at a math camp for extra credit. She pardoned me for the late notice and asked that these be sent to you.\" He held out a bag of diapers from home. \"However, these aren't nearly big enough to fit over your huge diaper now, so I've decided that I'll use them and then stuff them into your diaper later.\"<br>\r\n<br>\r\nAllison was visually horrified now, and was doubling over from the pain in her stomach. \"So at the end of this week, you'll let me go?\"<br>\r\n<br>\r\n\"And we'll never speak of it again. I'll make sure your math teacher gives you extra credit, and this can all be a thing of the past... if you'd like.\"<br>\r\n<br>\r\n\"Okay, fine-\" Allison said. Just then, she gasped, and pooped again in her diaper, letting out loud farts as she did so.<br>\r\n<br>\r\n\"Oh good call, I've been feeling the need for a while too.\" He stripped down in front of Allison and put on one of her diapers. It was a little snug, but it fit nonetheless. He relaxed himself and peed and pooped in the diaper. Then, he removed it and stuffed it down the front of Allison's massive diaper. As he did so, she was visually disgusted. \"I'll be back later to check your progress,\" he said as he pulled up his pants and exited the room.<br>\r\n<br>\r\nAllison was left alone with a slightly heavier diaper and new thoughts to consider. She had always been just a little bit attracted to Mr. Marvin. He looked like a character from out of a movie: dark blue eyes, slightly grey but wavy hair, and a square jaw. He had also appeared to be in pretty good shape, which was now confirmed by what she had just seen. Up to this point, she had wondered why he never married. Now she knew. She never imagined that he would be such a freak! And yet, as she continued to poke and squish her diaper, she found it to be good entertainment, almost enjoyable. She had to pee again, and felt the warm sensation spread across her crotch as it soaked into the huge pile of poop in her diaper. Was she starting to enjoy this?</span></div></div>",
            "created":1356670800,
            "id":1496240,
            "title":"No"
        },
        "13431212112211222222221":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>She was, in fact, enjoying it.<br>\r\n<br>\r\nShe got up on her knees, and at this point, the diaper was almost touching the ground. She started swinging it back and forth, feeling the immense weight of her heavy diapers pull her. She sat back down in it and felt it squish into her butt. Despite the growing pain on her crotch, she was having a bit of fun. She was keenly aware that she still had poop in her vagina, so she got back to her knees and spread her legs so that the diaper was flat on the ground. She dragged her crotch back and forth against the poop in her diaper, feeling it grind between her legs. It didn't take long before she was moaning and almost screaming in the best orgasm she had ever achieved. She peed again in her diaper not long after, and felt disgusted about what she had just done. What was she doing? She was thoroughly confused with herself and didn't know what to think. Getting off on an overly full diaper? That was disgusting! And yet, she had done it. She decided not to think about it anymore, so she laid down and went to sleep.<br>\r\n<br>\r\nThe next day, she was again awakened by Mr. Marvin. He pulled down his pants, revealing yet another dirty diaper. He took it off and stuffed it down her diaper. She needed to poop, so she just decided she might as well let go. The Chinese from the night before had still not taken its full toll, so it was a while before she had completely finished pooping. After all this, the diaper was noticeably heavier. Seeing that it was about to leak, Mr. Marvin put yet another large diaper over top of it, bring the count to four diapers, not counting the two that he had stuffed in. The diaper was approaching the length of two feet in every direction. \"Are you hungry?\" Mr. Marvin asked Allison. She responded...</span></div></div>",
            "created":1356670800,
            "id":1496258,
            "title":"Yes"
        },
        "134312121122112222222211":{
            "choices":[
                "A little",
                "A lot"
            ],
            "content":"<div class=\"\"><div> <span>\"Yes, I'm hungry,\" Allison said.<br>\r\n<br>\r\n\"Good, because I brought food for you.\" Mr. Marvin grabs a bag off of his desk, and takes out a couple of chili dogs. Allison eyes them hungrily, and Mr. Marvin says, \"There's plenty here, so take as much as you want.\" How much does Allison eat?</span></div></div>",
            "created":1356757200,
            "id":1497175,
            "title":"Yes"
        },
        "1343121211221122222222112":{
            "choices":[
                "masturbate",
                "not masturbate"
            ],
            "content":"<div class=\"\"><div> <span>Allison is very hungry, so she takes a lot.<br>\r\n<br>\r\nShe eats three chili dogs, some cheese fries, and two bags of chips, and drinks an entire large soda. \"Well, someone was certainly hungry,\" Mr. Marvin says. He is waiting anxiously for the eruption that he knows is about to take place. Within an hour, Allison is doubling over in immense pain from all that she had eaten. She feels the food as it rushes through her system. All at once, her body releases the pee and poop that was barely being contained within her. Her diaper extends another couple of inches, and Mr. Marvin is forced to put yet another large diaper on her. After doing this, he decides to pee and poop again in her diaper, making it grow even more. Neither of them can hardly believe how huge the diaper has become. When she stands (which she can only do with a large amount of effort, and only for a few seconds), her diaper drops all the way to her knees, and even a little below. Her legs can come no closer than shoulder width apart because of the massive bulk between her thighs. The room smells absolutely foul, but Mr. Marvin enjoys it. Somehow, this huge diaper is again making Allison horny. Does she...</span></div></div>",
            "created":1356757200,
            "id":1497180,
            "title":"A lot"
        },
        "13431212112211222222221121":{
            "author_id":"charizard447",
            "author_name":"Megaman x",
            "choices":[
                "Masturbate",
                "Not Masturbate"
            ],
            "content":"<div class=\"\"><div> <span>Ok apparently Mess didnt read the previous chapters, and ruined a story line by only leaving one dead end choice.  She may continue to do this with Mr Marvin if she so wishes to.  He just figured that she didnt want to even though she had began to enjoy it.</span></div></div>",
            "created":1413003600,
            "id":1870118,
            "title":"Lets try that again"
        },
        "13431212112211222222221122":{
            "author_id":"themess",
            "author_name":"Mess",
            "choices":[
                "One Week Later..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She dont do that soon she starts to get use to this and starts to like it....</span></div></span></div>",
            "created":1367989200,
            "id":1586595,
            "title":"The End"
        },
        "134312121122112222222211221":{
            "author_id":"themess",
            "author_name":"Mess",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She then was released and she never say a word of this again</span></div></span></div>",
            "created":1367989200,
            "id":1586596,
            "title":"One Week Later..."
        },
        "13431212112212":{
            "choices":[
                "Find Something to Use Instead of a Toilet",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>          Allison knew what the sudden gut-wrenching feeling in her stomach meant. She quickly tried to figure out what to do, especially since she had only the diaper left over, and it was bursting at its seams. However, she ran out of time as a log began pushing out of her anus, though it was being halted by the crap already there. The pain was intense as she was stuck in some of the most uncomfortableness she had ever known. Seemingly defying nature though, the log pushed it's way out into her diaper which began tearing the area around her butt as the liquid shit began to rush into the diaper. Allison doubled over as her ass exploded with diarrhea and as the diaper blew open in the back. Knowing it ws done for, she pulled off the rest of the diaper and was left continuing to unload onto the floor with no where else to go.<br>\r\n<br>\r\n          <i>\"I have to try something!\"</i> she thought to herself as she wanted to minimize the mess on the floor.</span></div></div>",
            "created":1355979600,
            "id":1491522,
            "title":"Really Bad"
        },
        "134312121122122":{
            "author_id":"themess",
            "author_name":"Mess",
            "choices":[
                "Ok...",
                "MOAR!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Put the diaper back on....</span></div></span></div>",
            "created":1367989200,
            "id":1586597,
            "title":"Other"
        },
        "1343121211221221":{
            "author_id":"themess",
            "author_name":"Mess",
            "choices":[
                "The Next Day..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She grabs the diaper and tapes it back on then the diaper so heavy she cant stand up so she get on her legs and sat down and fell asleep...</span></div></span></div>",
            "created":1367989200,
            "id":1586600,
            "title":"Ok..."
        },
        "13431212112212211":{
            "author_id":"dragrako",
            "author_name":"Epimetheus",
            "choices":[
                "Continue to hold in her poo and pee. (Load it up for a big one)",
                "Forget it and just let it go. (what another couple inches of bulk?)"
            ],
            "content":"<div class=\"\"><div> <span>...Allison woke up and she felt the desperate need to defecate and urinate at the same time. Remembering and smelling the horrible accident from last night she was hesitant to release her burdens.<br>\r\n<br>\r\nBut as she cramped up from the desperate need to do so she knew she probably wouldn't be able to hold out for long.<br>\r\n<br>\r\nWhat does Allison do?</span></div></div>",
            "created":1407474000,
            "id":1838834,
            "title":"The Next Day..."
        },
        "1343121211222":{
            "choices":[
                "finds",
                "does not find"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison tries to remove her diaper, but finds it difficult to remove the tape that she had wrapped around it earlier. She couldn't find the end of it, and she couldn't rip it. She looks in her book bag for scissors, which she...</span></div></span></div>",
            "created":1356498000,
            "id":1494694,
            "title":"Takes her diaper off"
        },
        "13431212112222":{
            "choices":[
                "her diaper broke",
                "someone opened the door"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She cannot find any scissors, and so she is left in her increasingly heavy and unbelievably filled diaper as the pain from her rash continues to get worse. That was when...</span></div></span></div>",
            "created":1356498000,
            "id":1494696,
            "title":"does not find"
        },
        "13433":{
            "choices":[
                "stay focused on spirit week",
                "stay focused on spirit week but messes in her diaper"
            ],
            "content":"<div class=\"\"><div> <span>allison had to dodge it to the bathroom. she knew if she kept her diaper on it would broke open. but as soon as she got into the bathroom stall to take her diaper off the tapes broke off and she had to keep the diaper in place until she grabbed a fresh one out of her diaper bag. so she took the diaper off of her and she wiped herself good. she powdered herself and put a fresh diaper on and went back into the gym for spirit week. right when she sit down she had to go but before she held it in she soaked her diaper half-way. but allison knew if she kept peeing or messing in her diaper that everyone would find out. so allison had to...</span></div></div>",
            "created":1344574800,
            "id":1401987,
            "title":"Her diaper broke open..."
        },
        "134332":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "she excused herself",
                "Stephanie asked, \"What was that?\""
            ],
            "content":"<div class=\"\"><div> <span>She decided that she needed to stay focused on spirit week.  It would distract her from her diapers.<br>\r\n<br>\r\nShe went to the gym where she was going to work on some posters with her best friend.  Her bestfriend's name was Stephanie.<br>\r\n<br>\r\nShe and Stephanie were working on the floor when she felt a stirring in her bowels.  It wasn't long before she really had to poop.  It was too late for her to get away.<br>\r\n<br>\r\nShe grunted a few times.  She tried to do it quietly.  Then the seat of her diaper became really messy.<br>\r\n<br>\r\nThat was when...</span></div></div>",
            "created":1345525200,
            "id":1409809,
            "title":"stay focused on spirit week but messes in her d..."
        },
        "14":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Wind blows her dress up",
                "Her book bag lifts up her dress",
                "Her dress gets caught in her locker",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>…a dress. Allison then grabbed her book bag and Linda brought her to school.</span></div></span></div>",
            "created":1328590800,
            "id":1272232,
            "title":"...a dress"
        },
        "141":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "She pushed it back down before anyone could see",
                "Everyone managed to see her diaper",
                "something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She had just started to go toward her school when she felt a gush of wind around her.  Then the wind blew up her dress.<br>\r\n<br>\r\nThe wind started to push her dress up.</span></div></span></div>",
            "created":1338958800,
            "id":1354114,
            "title":"Wind blows her dress up"
        },
        "1411":{
            "choices":[
                "that her gym clothes were missing",
                "that her locker was covered with eggs"
            ],
            "content":"<div class=\"\"><div> <span>she managed to push it down before the whole class saw what was underneath her dress so she headed in the school to go to class but she had to go she managed to get to the bathroom but didn't make it to the stalls in time as she let out a load of poop and pee into her diaper while running to the bathroom she had to get cleaned up and put a fresh diaper on then she went to her class! it was p.e. and she headed to her lockers to see...</span></div></div>",
            "created":1338958800,
            "id":1354338,
            "title":"She pushed it back down before anyone could see"
        },
        "1412":{
            "choices":[
                "english",
                "p.e.",
                "science"
            ],
            "content":"<div class=\"\"><div> <span>she pulled her dress down but some people start laughing at her not because they saw her in a diaper because they thought she was wearing granny panties but then the laughter was broken up by a teacher and they all went to class but allison didn't realize her had wet her diaper and because she was crying she didn't even feel it coming it was like she didn't realize that she had did it but she knew she had to get to class!</span></div></div>",
            "created":1338958800,
            "id":1354332,
            "title":"Everyone managed to see her diaper"
        },
        "14121":{
            "choices":[
                "allison makes it to the bathroom stall in time",
                "allison fails and poops and pees in her diaper"
            ],
            "content":"<div class=\"\"><div> <span>allison went to english class and sat down on her chair when she realized she had to go again before she realized it she released her bowels in her diaper and she realized that she was going to be in class for awhile after getting done with english class she heads to the bathroom when she has to go again!</span></div></div>",
            "created":1339045200,
            "id":1354631,
            "title":"english"
        },
        "141212":{
            "choices":[
                "Spend the day in a Wet and messy diaper",
                "Go and see the Nurse"
            ],
            "content":"<div class=\"\"><div> <span>Allison was about to make it when suddenly she pooped and peed in her diaper. She realised that it was full so she went into a stall and reached into her bag to get another diaper when she realised there was none left. She had to options she could either spend the day in a wet and messy diaper or she could go to the nurse and see if the nurse has any spare. Allison chose to...</span></div></div>",
            "created":1365915600,
            "id":1571505,
            "title":"A Full Diaper"
        },
        "14122":{
            "author_id":"131242743858g",
            "author_name":"edfvhnaon",
            "choices":[
                "No, and now she has to mess really bad.",
                "Yes, but her diaper leaks when she sits down."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She didnt have time to change herself, and now she had to go to pe? She was super wet, and too much movement would definatly make her diaper leak. She asks the pe teacher if she can sit out and she says..</span></div></span></div>",
            "created":1600201980,
            "id":2903638,
            "title":"p.e."
        },
        "141221":{
            "author_id":"131242743858g",
            "author_name":"edfvhnaon",
            "choices":[
                "She makes it to the bathroom.",
                "She starts going right in front the teacher."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She starts to run her laps, when she gets a sharp pain in her side. She has to poop really bad. She asks if she ca go to the bathroom and the teacher reluctanly waves her away.</span></div></span></div>",
            "created":1600202220,
            "id":2903640,
            "title":"No, and now she has to mess really bad."
        },
        "14123":{
            "choices":[
                "allison sprayed the contents under her dress",
                "allison sprayed the contents under her dress but her messed in her diaper"
            ],
            "content":"<div class=\"\"><div> <span>allison went into science class and she headed to her seat when she lost her footing. she ended up falling to the floor her science teacher saw her in what he thought was a diaper. allison got up and she was okay. the teacher said to allison: hey allison can you volunteer for me. the class wondered what the teacher wanted with allison. there was a bottle of water, and a bottle of water with baking soda in it. the teacher used the spray bottle of water and the teacher said with this i'm gonna have allison spray this under her dress. allison knew she had to think of something quick...</span></div></div>",
            "created":1344920400,
            "id":1404231,
            "title":"science"
        },
        "141231":{
            "choices":[
                "allison was daydreaming the whole time",
                "allison wasn't daydreaming and she had to get a fresh diaper on"
            ],
            "content":"<div class=\"\"><div> <span>allison decided since she didn't want to attract attention that she started spraing the contents when some of the bottle leaked into her diaper. allison not only was soaked in her diaper but now there was water in it as well but then all of a sudden she had to go really bad. but allison had no choice and released her bowels in her diaper. but allison didn't know that she had just filled the mess in her diaper even with the water inside to the max. allison knew she couldn't keep the diaper on. but all of a sudden the bell ring and class is over. allison wondered if this was a dream or if she had to get out of her dirty diaper in the bathroom.</span></div></div>",
            "created":1344920400,
            "id":1404477,
            "title":"allison sprayed the contents under her dress"
        },
        "142":{
            "author_id":"tonyc",
            "author_name":"Tony C",
            "choices":[
                "Jason sees her diaper",
                "Someone else sees it",
                "Allison realizes before anyone sees"
            ],
            "content":"<div class=\"\"><div> <span>Allison goes to her locker to take out some books. She sees her crush Jason across the hall and they wave to each other. She put the books in her book bag. Then she put her bag on, failing to realize that the back of her dress was lifted by it, exposing her diaper. She then started walking to class like that.</span></div></div>",
            "created":1328677200,
            "id":1272749,
            "title":"Her book bag lifts up her dress"
        },
        "1421":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "He is understanding",
                "He has a problem with it"
            ],
            "content":"<div class=\"\"><div> <span>She walks by Jason and he can't help but notice the back of a pink diaper on his crushs bottom. He immediatly runs over to talk to her.<br>\r\n<br>\r\n\"Uhm, I'm not sure how to say this....but the back of your dress...\" <br>\r\n<br>\r\nAllison suddenly notices and pulls it down.<br>\r\n<br>\r\n\"<i>Oh my god!</i> You...saw?\"<br>\r\n<br>\r\n\"Yes...\"</span></div></div>",
            "created":1328677200,
            "id":1273123,
            "title":"Jason sees her diaper"
        },
        "14211":{
            "author_id":"kuddles",
            "author_name":"Kuddles",
            "choices":[
                "Allison's Biology class is boarding a bus for a field day",
                "Allison's Biology class is discussing water/weather today"
            ],
            "content":"<div class=\"\"><div> <span><i>Nooooo!  This can't be happening, right here, in the school hall, with Jason, of all people?!?</i>, thinks Allison.<br>\r\nShe is nearly ready to burst into tears right there, instantly overwrought that Jason of all people should be the one to discover her secret.  <br>\r\n<br>\r\nThe two stand there, facing each other, Allison redfaced, barely able to meet Jason's soulful eyes as he gently takes her hand and tells her, \"It's okay.  I don't think anybody else noticed. My name is Jason.\"<br>\r\nAfter an awkward pause in which Allison is in deep contemplation of how the day could be going so wrong so suddenly, she realizes Jason has spoken to her, and blurts out, \"I know your name already.\" before frantically gazing ANYWHERE but at her cute crush.<br>\r\n<br>\r\nJason stoops down to her eye-level, purposefully making eye-contact, as he says, \"You're Allison, right?\".<br>\r\n<i>He knows my name?  He knows my name!</i>, Allison's thoughts shout.  \"Allison\", is all she can think to reply.<br>\r\n<br>\r\n\"Look, it's okay.  Really.  I was still bedwetting sometimes past elementary school, you know?\", Jason says, it barely registers with her, as she IS now looking into his eyes, and it feels like she could just stand there for eternity, in the middle of the now-clearing halls, \"If you ever want someone to talk to about it, or just need a shoulder, I'm here, okay?\".  And then he gives her his number!  Allison's heart feels like it's alive for the first time in her life!<br>\r\n<br>\r\nBut Allison's revery is broken when a girl in a tight dress(and the body for it) who'd been waiting outside the classroom door for Jason suddenly is yanking at his arm playfully, \"C'mon, Jase-baby\", She coos nasally, \" I want to be able to find seats next to each other\", and she smiles a crooked smile.  It's then that Allison realizes that, although this girl grabbing at her crush has a nice body, she has a kind of <i>long</i> face. <i> Pretty eyes, though</i>, thinks Allison, until the girl says, \"Time to leave the dweeb-bait to her geek world, baby\".<br>\r\n<br>\r\nAllison sees Jason give her the briefest of winks, as he turns and takes her hand, \"S'alright, Misty.  She had a wardrobe malfunction.  I was just letter her know.  You know, save her some embarrassment\".<br>\r\n<br>\r\nAt the doorway, Misty turns and annoyingly pinches Jason's chin, while telling him, \"And that's why I dig you, Jase.  As if someone like <b>that</b> could really suffer any more humiliation than just, you know, being <b>her</b>!  Tee Hee!\" , and Misty snidely looks past him for a millisecond at Allison, who realizes she needs to get on her way to her own class!<br>\r\n<br>\r\n  She had meant to stop by the bathroom before class, but if she does today she will be late again, and on top of the other two tardies she already has, that could mean a visit to the Principle's Office.  <br>\r\n<br>\r\nSo, away Allison goes, her mind whirling from the short encounter in the school hall, even while a part of her has been busy etching Jason's number into her brain.`<br>\r\n</span></div></div>",
            "created":1329195600,
            "id":1277325,
            "title":"He is understanding"
        },
        "142112":{
            "author_id":"falguni",
            "author_name":"Humming Bird",
            "choices":[
                "Jason tries to catch Allisons attention by doing something impressive",
                "A teacher discovers Allisons secret"
            ],
            "content":"<div class=\"\"><div> <span>Despite being exposed to Jason, Allison decided to stay as calm as possible. It was just an accident. She kept telling herself. She just walked slowly towards her classroom. <br>\r\n<br>\r\nAllison hated sitting at the back, but that day the class was completely packed. So, she sat at one of the chairs in the back row, near the window. Biology was always her best subject. That day the professor was discussing water. He talked about water borne diseases and how to stay away from them. He also enlightened why everyone should drink at least 2 liters of water every day. Decreasing water intake can definitely lead to infections, and females tend to get certain infections more than males. Moreover, females should also increase water intake during those special days of the month. <br>\r\n<br>\r\nOh no, not again- Alison thought. She had a serious urge to pee. She had drank a whole litre of coca cola just half an hour ago. That was showing it's effects now. Coke always meant more trips to the bathroom. <br>\r\n<br>\r\nAllison just spread her legs a little, and relieved herself in the diaper. Maybe I'd have to spend some time with the soiled diaper on, but that's much better than having problems in the long run. She said to herself.  </span></div></div>",
            "created":1331355600,
            "id":1292032,
            "title":"Allison's Biology class is discussing water..."
        },
        "1421121":{
            "choices":[
                "p.e.",
                "english"
            ],
            "content":"<div class=\"\"><div> <span>jason does a cool card trick and allison notices that he picks the right card after picking it from the pile and putting it back and grabbing the ace of spades she knew that she couldn't get up after all everyone would see what she did but after class was over she headed to the bathroom and took of the wet diaper and put a fresh diaper on she put the wet diaper in the garbage and headed to the next class!</span></div></div>",
            "created":1338872400,
            "id":1353386,
            "title":"Jason tries to catch Allisons attention by doin..."
        },
        "14211211":{
            "choices":[
                "allison run around the track and nobody notices",
                "allison runs around the track and her classmates notice something"
            ],
            "content":"<div class=\"\"><div> <span>she heads to p.e. and the p.e. teacher tells them to go get there gym clothes on and to go run around the track she starts to run but then she realizes she has to go pee she knows she can't hold it in front of everyone so she releases her bladder into her diaper after that she runs some more but after awhile she has to go poop she tries not to do it by hold it in but it was no use as she released her bowels into her diaper now she realized she had to run the field now in a messy diaper!</span></div></div>",
            "created":1339045200,
            "id":1354931,
            "title":"p.e."
        },
        "142112112":{
            "choices":[
                "lara and she wonders what allison is wearing underneath her dress",
                "marie but nothing happens"
            ],
            "content":"<div class=\"\"><div> <span>allison notices that her classmates or noticing the bulge in her gym shorts and they were looking at her wondering what she was wearing underneath after she was done running around the field she went to her locker and grabbed a clean diaper out of her backpack and went to a stall and got herself cleaned up she wiped herself, then she took the diaper unfolded it and put it on she fastened the tapes on her diaper and she threw the dirty one away that's when she goes to class but with who...</span></div></div>",
            "created":1339822800,
            "id":1361172,
            "title":"allison runs around the track and her classmate..."
        },
        "14212":{
            "author_id":"131242743858g",
            "author_name":"edfvhnaon",
            "choices":[
                "Wets herself",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"oohhh does litlle baby need a diapy change??\" Allison is so embarresed. she...</span></div></span></div>",
            "created":1600203060,
            "id":2903650,
            "title":"He has a problem with it"
        },
        "142122":{
            "author_id":"131242743858g",
            "author_name":"edfvhnaon",
            "choices":[
                "Wets and poops",
                "nothing happens"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other.....</span></div></span></div>",
            "created":1600203120,
            "id":2903651,
            "title":"other"
        },
        "1422":{
            "choices":[
                "cooking class",
                "car shop / mechanic class"
            ],
            "content":"<div class=\"\"><div> <span>allison notices it's her cousin fredrick. fredrick was allison fav cousin he was a chubby gooffball. Fredrick understood her condition he had one himself . Fredricks condition was a bit different from allison's Fredrick couldn't control his pee and would wet himself so he wears diapers. Allison on the other hand both messed &amp; peed herself so she wear diapers. Once Fredrick was right there he told allison that her bookbag was lifting her dress. allison said thanks to him and pulled it down in time. she headed to class and it was... <br>\r\n</span></div></div>",
            "created":1344056400,
            "id":1397694,
            "title":"Someone else sees it"
        },
        "1423":{
            "choices":[
                "a sundress",
                "a black silk dress",
                "a dress with tights underneath"
            ],
            "content":"<div class=\"\"><div> <span>allison realizes before anyone sees her diaper and covers it back up so then she went to her classes and payed attention to what her teachers were telling them and after school jason comes up to her and asks her to prom and she says yes. she gets home and has to figure out what to wear to the prom. but then she decides to put on...</span></div></div>",
            "created":1344056400,
            "id":1397675,
            "title":"Allison realizes before anyone sees"
        },
        "14231":{
            "choices":[
                "jason and he was glad to see you ",
                "jason and he asks you is this the 1960's"
            ],
            "content":"<div class=\"\"><div> <span>Allison puts on a sundress which is not really a dress you would wear to prom but she had no choice. but then she realized she need to wear tights underneath her sundress so no one saw her diaper. that's when she heard the doorbell ring and it was...</span></div></div>",
            "created":1344056400,
            "id":1397677,
            "title":"a sundress"
        },
        "14232":{
            "choices":[
                "Jason and he likes your dress",
                "Jason, but Kerry and Joan bring you to the limo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison puts on a black silk dress but makes sure to put some tights on underneath. Allison didn't want anyone to see her diaper at all. after that she heard the doorbell rang and it was...</span></div></span></div>",
            "created":1344056400,
            "id":1397679,
            "title":"a black silk dress"
        },
        "14233":{
            "choices":[
                "Allison answers the door and it's Jason",
                "Allison answers the door and the wind blows up her dress"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison put on her dress with tights underneath so no one saw her diaper, and so Jason wouldn't know she was wearing a diaper as well. But then she went downstairs to wait for him, when there was a knock on the door...</span></div></span></div>",
            "created":1344056400,
            "id":1397682,
            "title":"a dress with tights underneath"
        },
        "142332":{
            "choices":[
                "She tells him the truth",
                "She lies"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Allison opens the door, but as she does, a heavy wind blows her dress up, exposing her diaper to Jason. She quickly pulled down her dress, but he had already gotten a good look.<br>\r\n<br>\r\n\"Is that a diaper?,\" he said.</span></div></span></div>",
            "created":1344056400,
            "id":1397686,
            "title":"allison answers the door and the wind blows up ..."
        },
        "1423321":{
            "choices":[
                "...accepts it",
                "...asks her a question"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Yes,\" said Allison. \"I wear diapers. I have to for medical reasons.\"<br>\r\n<br>\r\nJason...</span></div></span></div>",
            "created":1344056400,
            "id":1397688,
            "title":"She tells him the truth"
        },
        "14233211":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "\"lets get some dinner.\"",
                "\"lets get to the dance.\""
            ],
            "content":"<div class=\"\"><div> <span>Jason accepts it.  \"We don't get to choose our problems.  It is just the way of life.\"<br>\r\n<br>\r\n\"Thank you so much for understanding,\" Allison said.<br>\r\n<br>\r\n\"You're welcome,\" Jason said.<br>\r\n<br>\r\nThen he said...</span></div></div>",
            "created":1345611600,
            "id":1410719,
            "title":"...accepts it"
        },
        "14233212":{
            "choices":[
                "Allison lets loose and soaks her diaper and Jason has to change her",
                "Allison tries to hold it but messes in her diaper and Jason has to change her"
            ],
            "content":"<div class=\"\"><div> <span>Jason asked Allison why she had to wear diapers. Allison told him it was because her mom was sick and tired of her trying to hold it in for hours, so she bought her diapers to wear day and night. If she didn't wear them, she could end up wetting the bed or wetting herself and her mom would have to change her sheets and wash her clothes every morning. Jason understood and took her to the limo. Allison made sure to grab the diaper bag and she was shocked Jason opened the door for her. She felt like a princess. But as soon as they got on the road, Allison had to go bad. She knew she couldn't hold it long enough to make it to the bathroom, so she had to think of something quick...</span></div></div>",
            "created":1344056400,
            "id":1397690,
            "title":"...asks her a question"
        },
        "142332121":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "now?\"",
                "when we stop?\""
            ],
            "content":"<div class=\"\"><div> <span>Allison decided it was hopeless to hold it.  She was in diapers, and she couldn't take them off.  She was getting really squirmy too.<br>\r\n<br>\r\nJason asked, \"are you okay?\"<br>\r\n<br>\r\nAllison blushed and nodded.  Then she lost it and couldn't hold it anymore.  She let out a sigh as she filled her diaper.  She felt that her diaper was pretty soaked.<br>\r\n<br>\r\nJason asked \"Did you just wet your diaper?\"<br>\r\n<br>\r\nAllison nodded and blushed.<br>\r\n<br>\r\nJason watched her a little bit.  \"How wet are you?\"<br>\r\n<br>\r\n\"Soaked,\" Allison replied with.<br>\r\n<br>\r\nJason asked, \"Do you want me to change you?\"<br>\r\n<br>\r\nAllison blushed, \"would you do it?\"<br>\r\n<br>\r\nJason nodded.  \"Do you want me to do it now, or when we stop?\"<br>\r\n<br>\r\nAllison blushed.  She thought about it, and moved her hips around a little bit feeling how wet her diaper really was.<br>\r\n<br>\r\nThen she responded with, \"Could you do it....</span></div></div>",
            "created":1345266000,
            "id":1407321,
            "title":"Allison lets loose and soaks her diaper and Jas..."
        },
        "1423321211":{
            "choices":[
                "allison tells jason she has to head to the bathroom",
                "allison messes in her diaper before she has the chance to go to the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>could you do it now! allison said.<br>\r\n<br>\r\njason said: okay i will do that.<br>\r\n<br>\r\nso jason removed her wet saggy diaper and he wiped her and put a fresh diaper on her. after that he fastened the tapes and made sure it was secure. after that they got to the dance. when she got into the door she started dancing with jason. but all of a sudden she had this urge to pee so she let loose into her diaper. after that they kept dancing until she felt a bowel movement. allison was scared that if she released her bowels in her diaper she would have a big mess to deal with. allison had to figure out what to do and fast...</span></div></div>",
            "created":1345266000,
            "id":1407384,
            "title":"now?\""
        },
        "14233212112":{
            "choices":[
                "Change Outside",
                "Change in a Classroom"
            ],
            "content":"<div class=\"\"><div> <span>      Allison was about to tell Jason that she had to go to the bathroom but before she could, she felt her bowels release a mess in her diaper. Feeling the mess make her feel sick, and to dance with her loaded diaper was understandable.<br>\r\n<br>\r\n      \"Jason, I need to be changed again.\" she whispered in his ear.<br>\r\n<br>\r\n      \"Sigh*, Alright, let's go.\" he responded.<br>\r\n<br>\r\n      The two left the dance and headed to the bathroom, except that when they arrived there, they found a group of students huddled around the bathroom. Allison knew that if she got too near to anyone that they would be able to tell that she had crapped in her dress and that she was wearing a diaper.<br>\r\n<br>\r\n     \"Not this one, let's go to another one.\" she told Jason.<br>\r\n<br>\r\n     \"Well the only other one on this side of the building is around the corner.\" he responded, pointing towards another hallway.<br>\r\n<br>\r\n     The two walked towards the hallway but found that it had been gated off for the dance.<br>\r\n<br>\r\n     \"Now where?\" Jason asked.<br>\r\n<br>\r\n     \"I don't know but...\" she began as she felt her bladder beginning to leak too \"Somewhere soon!\"<br>\r\n<br>\r\n     The two walked around the area and found that they had only two options...</span></div></div>",
            "created":1345870800,
            "id":1413357,
            "title":"Allison Messes in Her Diaper Before She  Makes it"
        },
        "142332121122":{
            "choices":[
                "She Begins Peeing in the Middle of the Dance When Jason Returns",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>     \"Let's just go into one of the classrooms.\" Allison said, just wanting to get out of the diaper.<br>\r\n<br>\r\n     \"Ok...\" Jason said, following her into one of the math classrooms, the janitor always forgot to lock the rooms after himself.<br>\r\n<br>\r\n      The two entered the classroom and Allison leaned over one the desks to let Jason work. Jason undid the straps and slid the diaper off. He rolled it up into a ball and tossed it into the garbage.<br>\r\n<br>\r\n      \"Umm, Allison? Where is your diaper bag?\" Jason asked as Allison got up to look around.<br>\r\n<br>\r\n      \"They're back in your car!\" Allison squeaked at the realization.<br>\r\n<br>\r\n      \"Stay here, I'll go get them.\" Jason said, leaving the room before Allison could say otherwise.<br>\r\n<br>\r\n      Allison was frozen for a few seconds before following. She followed Jason out into the hallway and all the way into the dance when she felt her bladder leaking.</span></div></div>",
            "created":1345870800,
            "id":1413388,
            "title":"Change in a Classroom"
        },
        "1423321211221":{
            "choices":[
                "burger place",
                "taco place"
            ],
            "content":"<div class=\"\"><div> <span>allison tries to get to the bathroom but on the way in the stall she leaks a little bit of pee on her dress she decided to slide the dress up to clean up her lady bits. after that she relieved the rest of her bladder in the toilet and then she headed back to the classroom. jason noticed allison had a wet spot on her dress and handed her a fresh one. then she put on the dress and he put a fresh diaper on her. he fastened the tapes and made sure they were secure. but then jason tells her why don't we go and get something to eat. allison heads into the limo and they go to a...</span></div></div>",
            "created":1345957200,
            "id":1413625,
            "title":"She Begins Peeing in the Middle of the Dance Wh..."
        },
        "143":{
            "choices":[
                "allison gets to class",
                "allison gets to class but her bladder releases in her diaper"
            ],
            "content":"<div class=\"\"><div> <span>allison is trying to head to class but she gets her dress stuck in the locker she tries to turn around but she knows she would rip her dress if she even thinks of doing that but then she tries to go bend backwords so she can grab the handle of the locker when someone sees what your trying to do he walks over to you and pushes the handle on the locker and asks you how you managed to get your dress stuck in there then you thank him and go to class!</span></div></div>",
            "created":1338958800,
            "id":1353633,
            "title":"Her dress gets caught in her locker"
        },
        "1432":{
            "author_id":"fuckyousapta01",
            "author_name":"leedleleedle",
            "choices":[
                "She ran out of fresh diapers",
                "all stalls were full",
                "she bumped into a teacher and received immidiete detention"
            ],
            "content":"<div class=\"\"><div> <span>Allison makes it to class. But, she hadn't realized her bladder was bursting and ended up wetting her diaper in her seat. As she knew she couldn't just ask to go to the bathroom again, she just sat in her wet diapers until class ended. After class, she ran straight to the bathroom to change. But..</span></div></div>",
            "created":1576645200,
            "id":2761104,
            "title":"allison gets to class but her bladder releases ..."
        },
        "14321":{
            "author_id":"fuckyousapta01",
            "author_name":"leedleleedle",
            "choices":[
                "She decides not to wear anyting under her dress",
                "She takes the girl's panties"
            ],
            "content":"<div class=\"\"><div> <span>Allison made it to the bathroom, despite nearly bumping into a teacher, and having to cut one girl off. She was finally safe. She checked her bag for fresh diapers, but the package was empty! She didn't know what to do. the girl outside the stall was telling her to hurry up.<br>\r\nThen, she notices the girl in the next stall had left her panties on the floor visible and in reach from her own. She could quickly take it and run off, hoping the girl won't notice. But what if she gets caught? Or her bladder just decides to release again?</span></div></div>",
            "created":1576645200,
            "id":2761105,
            "title":"She ran out of fresh diapers"
        },
        "143211":{
            "author_id":"novelfan22",
            "author_name":"absorbsinfo",
            "choices":[
                "Allison makes it through class without going to the bathroom",
                "Allison wets herself in class",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>thinking quickly Allison decided to just too risky to steal the girl's panties and decided to just wear nothing under her dress for the rest of the day <br>\r\nleaving the bathroom stall she quickly told the girl \"its all yours\" and left the bathroom <br>\r\nhowever Allison could feel a cool breeze under her dress and without her diapers knew that if she wet herself she would have no protection from leaks  <br>\r\n\"i'll be fine\" she thought \"as long as i go to the toilet often and dont drink too much water i should be fine\"<br>\r\n<br>\r\nAllison headed to second period which was English <br>\r\n<br>\r\n</span></div></div>",
            "created":1582866000,
            "id":2794548,
            "title":"She decides not to wear anything under her dress"
        },
        "143212":{
            "author_id":"fuckyousapta01",
            "author_name":"leedleleedle",
            "choices":[
                "She doesn't give them back",
                "She gives them back"
            ],
            "content":"<div class=\"\"><div> <span>There was only one class left before the bell rang. Allison decided that she wouldn't have a problem until then. so she decides to take the panties. She quickly grabbed them and put them on.<br>\r\n<br>\r\nAfter class, she was determined to call Linda and tell her she was going to walk home. But after she did, she noticed Marie was sitting on a bench and crying. Allison walks up to her and asks what was wrong<br>\r\n<br>\r\n\"Some girl stole my panties while i was pooping earlier. It would have been fine if pants weren't so tight\" she pointed down her crotch. The outlines of her couchie were very visible. \"Not to mention the one in the back, either. Some boys i didn't know were staring at me\". Marie continued to cry<br>\r\n<br>\r\nAllison felt really bad. Now that she was on her way home, she could give them back, but the she would have some explaining to do</span></div></div>",
            "created":1576645200,
            "id":2761107,
            "title":"She takes the girl's panties"
        },
        "1432122":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "'Im going shopping now for more, so you can have mine'",
                "Explains shes the one who stole them",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she explain this to her</span></div></span></div>",
            "created":1605361920,
            "id":2939947,
            "title":"She gives them back"
        },
        "144":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "her dress got caught in the school entrance door",
                "she had to mess really badly",
                "something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Something else happened.....</span></div></span></div>",
            "created":1340600400,
            "id":1366649,
            "title":"Other"
        },
        "1442":{
            "choices":[
                "she had choir class",
                "she had p.e. class"
            ],
            "content":"<div class=\"\"><div> <span>allison had to go really bad so she tried to get to the bathroom but before she was able to get in the stall to remove her diaper in time she had started filling her diaper with the mess and she had to get herself in a fresh diaper so she took her dirty diaper off and wiped herself, powdered and put the fresh diaper on then she fastened the tapes and secured them in place and she made sure that she headed to class...</span></div></div>",
            "created":1340600400,
            "id":1366756,
            "title":"she had to mess really badly"
        },
        "14421":{
            "author_id":"abdwb",
            "author_name":"Jake",
            "choices":[
                "class started",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She had to go to choir class.  Choir class was her favorite class.  She loved to sing.<br>\r\n<br>\r\nAfter getting to class she found her place to stand.  Then....</span></div></span></div>",
            "created":1342414800,
            "id":1380094,
            "title":"she had choir class"
        },
        "144211":{
            "choices":[
                "letting her bladder go and she soaks her diaper",
                "soaking and messing her diaper"
            ],
            "content":"<div class=\"\"><div> <span>allison took her point in the class and they were gonna sing a bunch of songs for the concert. one song was working on was killing me softly which is originally a solo but they made it into a group effort, but the guys had working on the railroad. for allison she had a solo in the choir concert and it was toni braxton's un-break my heart of course. while she was practicing she felt the need to pee but before she was able to hold she ended up...</span></div></div>",
            "created":1342674000,
            "id":1382511,
            "title":"class started"
        },
        "1443":{
            "choices":[
                "tell him your wearing panties but he doesn't buy it",
                "tell him that your wearing a diaper and he understands"
            ],
            "content":"<div class=\"\"><div> <span>allison goes to the library in a dress. but she knows she can't be seen without someone seeing what she was wearing underneath. allison got to her seat when allison notices some guy was seeing up her dress and was worried that he noticed. so she kept on to her usual routine and did some research for history class. after her hours were up she was headed out the door when her dress started to rip. she didn't realize that her dress was caught in the computer chair so she wheeled it back. allison was thankful as i only ripped at the toe area of the dress. but after she got out of the library the guy asked her what she was wearing underneath and that's when allison had to come up with something to say and quick...</span></div></div>",
            "created":1344056400,
            "id":1397695,
            "title":"something else."
        },
        "14432":{
            "author_id":"ibloc",
            "author_name":"ibloc",
            "choices":[
                "Sneak past Jake without saying another word",
                "Take Jake's offer",
                "You feel like you need to mess..."
            ],
            "content":"<div class=\"\"><div> <span>Allison blushed heavily and whispered to him \"don't tell anyone but I'm wearing a diaper,\"<br>\r\n<br>\r\nHe laughed out loud and Allison thought she was going to die, \"wow, that's the kinkiest thing I've heard in a while maybe we should hang out after school?\" The boy responds, \"my name is Jake\"<br>\r\n<br>\r\nAllison doesn't know what to do...</span></div></div>",
            "created":1465016400,
            "id":2158934,
            "title":"tell him that your wearing a diaper and he unde..."
        },
        "144322":{
            "author_id":"ibloc",
            "author_name":"ibloc",
            "choices":[
                "He's turned on by adult babies",
                "His girlfriend has a thing for adult babies",
                "Jake wants to wear a diaper"
            ],
            "content":"<div class=\"\"><div> <span>Allison meets up with Jake after school. She had made a big mess during choir but had time to change her diaper before meeting Jake by his car. Allison smiles as Jake holds the door open for her.<br>\r\n<br>\r\nOnce in the car, and on the road, Jake admits...</span></div></div>",
            "created":1465016400,
            "id":2158938,
            "title":"Take Jake's offer"
        },
        "1443221":{
            "author_id":"ibloc",
            "author_name":"ibloc",
            "choices":[
                "Allison starts to cry",
                "Allison needs to go potty",
                "Jake takes her to a large crib"
            ],
            "content":"<div class=\"\"><div> <span>Jake brings Allison back to his place and shows her a lacy silk outfit complete with a pacifier, mittens, booties, and a bonnet. Allison wants to back out but Jake already had the pacifier firmly in her mouth.<br>\r\n<br>\r\nHe ties ribbons around her ankles so she has to waddle and Allison waddles over to a mirror to see herself.</span></div></div>",
            "created":1465016400,
            "id":2158940,
            "title":"He's turned on by adult babies"
        }
    },
    "info":{
        "author_id":"tonyc",
        "author_name":"Tony C",
        "brief_description":"Allison’s embarrassing secret is about to be revealed to everyone.",
        "created":1328596740,
        "description":"<td align=\"left\" class=\"norm\">This takes place after the events of “Holding it in” (<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.writing.com/main/view_item/item_id/1846546-Holding-it-in\" target=\"_blank\">http://www.writing.com/main/view_item/item_id/1846546-Holding-it-in</a>).<br>\r\n<br>\r\nTeenager Allison has been wearing diapers for a short time because of bladder problems. She doesn’t want anyone to know about it, but soon everyone will know.</td>",
        "id":1846550,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1605361920,
        "modified":1605361920,
        "pretty_title":"The Diaper Girl"
    }
}