{
    "chapters":{
        "1":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "yes, I want this one.",
                "no, another game for me."
            ],
            "content":"<div class=\"\"><div> <span>Ok! I'm going to start the beginning of this interactive by starting with the most well known Custom Robo game<br>\r\nCustom Robo Battle Revolution A.K.A Custom Robo  as its known here in the states. This was the first international Custom Robo game ever so most people will think of this when seeing its name. <br>\r\n<br>\r\nThis game has ALOT of female characters so prepare for one hell of a list!... Or would you rather do another game from the series?  </span></div></div>",
            "created":1244610000,
            "id":706284,
            "title":"Let's Start!"
        },
        "11":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Marcia",
                "Linda",
                "Mira",
                "Lucy",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright so you chose this one. Now let's start our list, first is...</span></div></span></div>",
            "created":1244610000,
            "id":706285,
            "title":"yes, I want this one."
        },
        "111":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "not much at all, only about 5 pounds.",
                "quite a few, about  20 pounds, she has a little pudginess now.",
                "quite alot, infact 50 pounds! shes pretty chubby!"
            ],
            "content":"<div class=\"\"><div> <span>phew, Marcia sighed from another slow day at work with the Steel Hearts, ever since the defeat of Rahu and the World Day Remembrance Tournament had ended a few weeks ago, crime had slowed downed significantly since then now that robos were cheaper and the general public could more easily defend themselves. Sure every now and then some petty criminal would try to steal from the lab or some trouble was started at the park but for Marcia, Harry, and Hero, for most of the days they pretty much spent their time sitting around waiting for a call,  having chats, and watching the television. <br>\r\n<br>\r\nTo relieve herself of this boredom Marcia had taken up a bit of an eating habit and it done an amount of change to her slim physique, looking at her weight on a scale and herself in a mirror she realized she had gained...</span></div></div>",
            "created":1244610000,
            "id":708190,
            "title":"Marcia"
        },
        "1111":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "keep track of this, I don't want this to get out of hand.",
                "do anything for now, its not really noticeable.",
                "get some food to eat, I could experiment with this new weight."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Oh it looks I've gained a couple pounds.\" Marcia said as she pinched the tiny amount of flab on her midsection. She now weighed 125lbs and was wondering about what to do with this. \"Oh, well  I guess I should...\"</span></div></span></div>",
            "created":1264634040,
            "id":826666,
            "title":"not much at all, only about 5 pounds."
        },
        "1112":{
            "choices":[
                "20 more pounds",
                "50 pounds"
            ],
            "content":"<div class=\"\"><div> <span>She had put on about 20 pounds.  Her belly was noticeably bigger.  Her breasts also got larger, her butt stuck out more, and her thighs got bigger.  She definitely knew she had gained weight, but thought nothing of it and continued her eating habits.  After about a month of continuous eating and little exercise she gained...</span></div></div>",
            "created":1244696400,
            "id":706477,
            "title":"quite a few, about  20 pounds, she has a little..."
        },
        "11121":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "finally start to actually try and lose some of this weight.",
                "try and gain even more weight to pleasure herself "
            ],
            "content":"<div class=\"\"><div> <span>Now at 160lbs Marcia was plump but not exatcly fat. She was now far less defined in her body's once slender form with some new amounts of pudginess on her belly,which stuck out about 2 inchesfrom her dress. Marcia took a look at her fingers and saw that they were now slightly thicker then normal. Her breasts were now about a c cup with more bounciness than before. After taking note of this She decided that she would need to...</span></div></div>",
            "created":1247704260,
            "id":725641,
            "title":"Marcia, the plump girl"
        },
        "11122":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "continue sitting around all day eating and other things",
                "Go to the local bakery to eat some tasty sweets."
            ],
            "content":"<div class=\"\"><div> <span>After one month of laziness Marcia had drastically increased the amount of fat in her body. Now weighing in at 190lbs her ass jiggled quite alot with each step, her breasts were much larger and her belly hung slightly out of her dress now. While watching tv on the couch while eating a bowl of ice cream, Sergei came in concerned with his younger sister's new eating habit and what it had done to her figure. <br>\r\n<br>\r\n\"Hey Marcia\" said Sergei. \"Yes Sergei\" Marcia  replied. \"Have you noticed your recent umm... pausing slightly as to not accidentally say something rude to his sister, change to your body ?\" \"Why yes I have brother\" she said.<br>\r\nAren't you concerned about what people will think?\" Sergei stated \"Well you've told me before you wanted me to stand up for myself and get out of your shadow, so no I'm not concerned.\" \"Alright Marcia\" Sergei sighed \"Just don't take this too far, I don't want you to get hurt because of this.\" Heehee Marcia giggled making her belly jiggle slightly, \"Thanks for your concern Sergei, and don't worry I'll handle this responsibly.\" <br>\r\n<br>\r\nTurning back Sergei decided to go back to his own duties and leave Marcia be while she went back to the show eating to her heart's content. The next morning Marcia decided to...</span></div></div>",
            "created":1246510800,
            "id":718041,
            "title":"50 pounds in one month, shes working hard or not?"
        },
        "1113":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "ignore and it go to work as usual",
                "make an excuse to Ernest to not go to work and think of a solution"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my god!\" Marcia cried, reading the number on the scale at 160, she was very noticeably bigger than her once petite from. \"I can't believe I've gained so much in only a few weeks!\" Poking her now round belly Marcia saw that it jiggled at the touch of her finger. <br>\r\n<br>\r\nLooking at her breasts she noticed that they had gone up by about 1 cup and did a small bounce when she took a step. Turning her head she saw that her ass was much less defined with the new amount of fat in her cheeks. <br>\r\n<br>\r\n\"This won't help me at work if it gets in my way in custom robo battles and also... pausing for moment as she started to blush, how am I going to Hero's attention like this?\"<br>\r\n<br>\r\nAfter this Marcia decided she would...     </span></div></div>",
            "created":1246510800,
            "id":718032,
            "title":"She's quite fat!"
        },
        "115":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Linda",
                "Eliza",
                "another girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>No? Well then how about one of the MANY npcs women in this game. WARNING this list will be extremely long.</span></div></span></div>",
            "created":1246510800,
            "id":718050,
            "title":"someone else"
        },
        "1153":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Isabella",
                "Sophie",
                "more!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are more girls.</span></div></span></div>",
            "created":1246592220,
            "id":718060,
            "title":"another girl"
        },
        "11533":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Trish",
                "someone else (ugh god damn this'll take long time.)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here some more girls.</span></div></span></div>",
            "created":1246510800,
            "id":718055,
            "title":"more!"
        },
        "115332":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Sherry",
                "another"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Heres continuing our list.</span></div></span></div>",
            "created":1246510800,
            "id":718057,
            "title":"someone else (ugh god damn this'll take lon..."
        },
        "1153322":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Mary",
                "another girl dammit!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Heres yet more girls or girl considering theres only two choices per chapter.</span></div></span></div>",
            "created":1246510800,
            "id":718059,
            "title":"another"
        },
        "11533222":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "random girl, you know those girls used as filler space",
                "another girl"
            ],
            "content":"<div class=\"\"><div> <span>Ok jeez calm down will get there eventually. Anyway here are more girls/choices.<br>\r\n<br>\r\nAlso for the random girl choice you can either give her a name or keep her nameless like in the game for comedic effect, and whoever first makes a name for her if you choose to, that name cannot change!</span></div></div>",
            "created":1246592940,
            "id":718062,
            "title":"another girl dammit!"
        },
        "115332222":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "random Eliza/Isabella henchwoman can either be the fat or skinny version.",
                "someone else and get back to the named characters!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>heres another choice choosing chapter.</span></div></span></div>",
            "created":1246593060,
            "id":718063,
            "title":"another girl"
        },
        "1153322222":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Wendy",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright! Damn calm down here we go another choice.</span></div></span></div>",
            "created":1246593180,
            "id":718065,
            "title":"someone else and get back to the named characters!"
        },
        "11533222222":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Mira",
                "or choice number 2 to another girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Heres some more!</span></div></span></div>",
            "created":1246593240,
            "id":718066,
            "title":"someone else"
        },
        "115332222222":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Hiroko the only female cop besides Mira",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok! Only a few more to go thank god.</span></div></span></div>",
            "created":1246593360,
            "id":718067,
            "title":"or choice number 2 to another girl"
        },
        "1153322222222":{
            "author_id":"bogger",
            "author_name":"Shinuto",
            "choices":[
                "Carmen",
                "what?! you want to do an orignal charcter perhaps?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here I think is the last choice so here.</span></div></span></div>",
            "created":1246593600,
            "id":718069,
            "title":"someone else"
        },
        "11533222222222":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Hikari lies in here....",
                "Another one."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>*le gasp* GOOD HEAVENS, LOOK AT THE TIME! IT’S OC OCLOCK<br>\r\n<br>\r\nIt’s time for some ORIGINAL CHARACTERS! I’ll put mine, Hikari, in the first choice for this chapter, but you can choose to make your own in the second choice.</span></div></span></div>",
            "created":1594735200,
            "id":2868405,
            "title":"OH CEE TIM"
        },
        "12":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Yes",
                "No. More Custom Robo Game"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want Custom Robo Arena?<br>\r\nIt'shad female characters to gain weight.</span></div></span></div>",
            "created":1246510800,
            "id":718052,
            "title":"no, another game for me."
        },
        "121":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Liv",
                "Tanya",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>We start with out choices here.<br>\r\n<br>\r\nLiv, the supporting protagonist in the game, and Eddy’s sister. She can’t dive due to childhood trauma, but she can share mental energy, which you need to dive.<br>\r\n<br>\r\nOR<br>\r\n<br>\r\nTamara, the Hero’s sister. She works as a lab assistant for her father, researching and developing Custom Robo.</span></div></div>",
            "created":1594791780,
            "id":2868836,
            "title":"CHOOSE YOUR FIGHTER"
        },
        "1213":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Serene",
                "Polly",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>Next two girls.<br>\r\n<br>\r\nSerene is the champion of Foster Prep, a powerful Custom Robo Battler who can use the Soulboost, and is rich. She’s firm yet kind, and pretty popular to boot.<br>\r\n<br>\r\nOR<br>\r\n<br>\r\nPolly is Serene’s little sister. Like her sister, she’s an excellent Custom Robo fighter, despite being very childish. She looks up to her sister, and is more then willing to defend her.</span></div></div>",
            "created":1594794180,
            "id":2868848,
            "title":"Siblings"
        },
        "12133":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Billy",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Continuing on.....<br>\r\n<br>\r\n<br>\r\nBilly is a member of the IPC in Custom Robo Arena. She seems stuck up, but has good intentions at heart, and is the European Custom Robo Champion. Also she has a crush on Eddy, the Japnese(?) Custom Rob Champion<br>\r\n<br>\r\n</span></div></div>",
            "created":1594797180,
            "id":2868860,
            "title":"Elite Agent"
        },
        "121332":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Kris",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kris is the Police Squad chief in Custom Robo Arena. She is as diligent as she is powerful, and is quite competnetat...and pretty good looking to boot..</span></div></span></div>",
            "created":1594979640,
            "id":2870262,
            "title":"Cop"
        },
        "1213322":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Kindjal",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Kindjal was formerly a researcher for NeoBrain and is a Greybaum member, taking Sling as her responsibility and using him to test illegal parts. She worked in the same laboratory as Dr. Mars, and together they secretly created Hadron. She also temporarily worked as a teacher at Midheart High.</span></div></div>",
            "created":1594980840,
            "id":2870269,
            "title":"Evil Scientist "
        }
    },
    "info":{
        "author_id":"bogger",
        "author_name":"Shinuto",
        "brief_description":"This is a female weight gain story of the series Custom Robo.",
        "created":1244688720,
        "description":"<td align=\"left\" class=\"norm\">Ok, this the first interactive story that I know of about Custom Robo about weight gain. I'm making this story for two reasons<br>\r\n1.I've always wanted to see a story of this <br>\r\n2. No one has done this before of this particular series.<br>\r\nWith that here are the rules<br>\r\n<br>\r\n1. Only female weight gain, obviously. -_-<br>\r\n2. These stories must take place after the main stories in any of the games, nothing in between or before.<br>\r\n3.As a humorous effect if one of the girls you choose has a robo that robo can also gain weight as a side effect even if the robo does not have any distinct female characteristics.<br>\r\n4.Sex and yuri is allowed, however please try to keep it within the story and not random.<br>\r\n5. No scat, I do not enjoy reading an expansion story only to find the character releasing their bodily wastes.<br>\r\n<br>\r\nOther than that have fun and enjoy yourselves!</td>",
        "id":1570115,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1594980840,
        "modified":1594980840,
        "pretty_title":"Custom Robo Female Weight Gain"
    }
}