{
    "chapters":{
        "1":{
            "author_id":"e43rty",
            "author_name":"zsaag",
            "choices":[
                "Daniel",
                "Tak",
                "Maria",
                "Amy",
                "Someone else? (first come first serve!)"
            ],
            "content":"<div class=\"\"><div> <span>\"Another slow day..\" An elderly women sighed laying her head on the counter.<br>\r\nIt's been a year since she opened, and the amount of people coming in wasn't that impressive for her liking.<br>\r\nHer shop, In the Name of Love, was a simple costume shop. Sure it sounded like a sex shop but she liked it! And that is what mattered right?<br>\r\nWith a grunt she closed her eyes and muttered to herself. \"Maybe I should just close up early.\"<br>\r\nIt was at that moment that the bell above her door chimed. \"Um, hello? A friend of mine recommended this place for a costume.\"<br>\r\nLooking up the women saw....<br>\r\n<br>\r\n<br>\r\nDaniel: 22 years old  Caucasian , 6'5\" height, 189 lbs. Short blonde hair, blue eyes athletic build and a popular guy of sorts.<br>\r\n<br>\r\nMaria: 34 years old Latina, 5'7\" height, 172 lbs. Long brown hair, hazel eyes with a curvy shape to her, a slight need to be in control more.<br>\r\n<br>\r\nTak: 19 years old Asian, 5'11\" height, 168 lbs. Short black hair, green eyes with lithe build. Out going zanny personality.<br>\r\n<br>\r\nAmy: 24 years old Italian, 5'3\" height, 160 lbs. Long red hair, brown eyes with curvy full hip shape. More dominate maternal figure.</span></div></div>",
            "created":1388725200,
            "id":1720406,
            "title":"Who's going to the party?"
        },
        "11":{
            "author_id":"e43rty",
            "author_name":"zsaag",
            "choices":[
                "Why is this...",
                "Dear lord what the...",
                "Why on earth...",
                "Who would wear...",
                "There is no way..."
            ],
            "content":"<div class=\"\"><div> <span>Looking around the store, Daniel scratched his cheek. It felt odd for him to be in a store called In the Name of Love, felt kind of... dirty.<br>\r\nWhat if one of his friends saw him walk in? Then again a friend recommended the place. <br>\r\nBeing at 6'5\" he stood out in the colorful store. His broad shoulders and chest filled out his jersey while a small bit of facial hair sat on his upper lip.<br>\r\nThe elderly women grinned from ear to ear as she saw the man enter her store. \"Ah welcome welcome!\" She jumped down from her chair and moved over to him. \"I see, what did your friend send you here for?\"<br>\r\nDaniel rubbed his head as he looked down at her. \"Ah yes well, he has this party coming up tonight and I need a costume. He said that this place was full of them.\"<br>\r\n\"Oh yes, lots of costumes!\" She beamed, moving around the store she looked at him, then got an idea. \"But no ordinary costume will do for you! No no!\" She chuckled, digging behind the counter.<br>\r\nThis was a little odd for Daniel, but he needed something before tonight. \"Well, you seem to know what your doing Ma'am. What do I need?\"<br>\r\nShe grinned pulling out a plain white box from under the counter. \"You need this!\"<br>\r\n\"What is it?\"<br>\r\n\"This is what you need. Perfect costume.\" She waved her hand in the air.<br>\r\nWell his friend told him that it was a good place to get what he needed. \"How much?\"<br>\r\n\"Fifty dollar.\"<br>\r\nHis eyes went wide at this price. \"Fifty dollars!?\"<br>\r\nNodding the women crossed her arms. \"You want or not?\"<br>\r\nWith a grunting nod Daniel pulled his wallet out and put the money on the counter, taking the box walking out muttering under his breath.<br>\r\nAt home though, he tossed the box his table. \"This thing better be worth it.\" <br>\r\nPulling a knife out, he cut open the sides of the box. Inside was...</span></div></div>",
            "created":1388733420,
            "id":1720415,
            "title":"Daniel walks on in"
        },
        "114":{
            "author_id":"mrcrabbs",
            "author_name":"Pinklightning",
            "choices":[
                "And went to bed",
                "In the shower",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>\"What the hell?\" Daniel thought \"Why has she sold me this? And why did it cost $50?? He won't want to wear this\"<br>\r\n<br>\r\nPulling it out Daniel realised it came with a brown pig tail wig and some black sandals.<br>\r\n<br>\r\nThe swimsuit itself was pink with frills at the collar and waist, it had three Disney princesses on the chest and it looked as if it was made for a 5 year old because it was so small.<br>\r\n<br>\r\nDaniel wanted to take it back to the shop but when he got there it was already closed, not to reopen untill Monday, two days from then.<br>\r\n<br>\r\n\"What do I do now Markus' party is tomorrow, what am I supposed to do?\" Daniel thought \"Markus is a bit smaller than me so maybe he will fit into it but I doubt in a million years he would never where this, especially out in public, I'll just have to keep it and take it back on monday\"<br>\r\n<br>\r\nDaniel's watched TV for a bit then had a shower-<br>\r\n<br>\r\n</span></div></div>",
            "created":1459293900,
            "id":2124787,
            "title":"A little swimsuit"
        },
        "1142":{
            "author_id":"mrcrabbs",
            "author_name":"Pinklightning",
            "choices":[
                "He didn't want to",
                "It was stuck",
                "He can take it off"
            ],
            "content":"<div class=\"\"><div> <span>After the shower Daniel got out and dried off. He reached for his clothes and started putting on his trousers<br>\r\n<br>\r\n\"Wtf?\" Daniel said once he realised he was putting on the pink swimsuit.<br>\r\n<br>\r\nDaniel looked around but his clothes had disappeared.<br>\r\n<br>\r\n\"Wtf?\" He said again<br>\r\n<br>\r\nHe had already put two legs in the swimsuit and was trying to take it off bit he couldn't because</span></div></div>",
            "created":1459294260,
            "id":2124790,
            "title":"In the shower"
        },
        "11422":{
            "author_id":"slime-j",
            "author_name":"Slime-J~Has given up",
            "choices":[
                "He noticed he was wearing the wig ",
                "He noticed he was wearing the scandals",
                "Someone knocked on the door ",
                "Something else "
            ],
            "content":"<div class=\"\"><div> <span>He pulled and tugged at it but it wouldn't budge an inch. He quickly waddled over to a cabinet and pulled out a pair of scissors. He immediately tried to cut  off. But, they wouldn't cut an inch of the embarrassing swimsuit. <br>\r\n<br>\r\nHe started to panic as...? </span></div></div>",
            "created":1525457220,
            "id":2488225,
            "title":"It was stuck"
        },
        "115":{
            "author_id":"lazyfriend56",
            "author_name":"Idontknow",
            "choices":[
                "Wore it.",
                "Still didn't wear it."
            ],
            "content":"<div class=\"\"><div> <span>You lift out a big thick diaper big enough for you along with a blue bib that has the words \"Big baby!\" on it and a blue pacifier. Although there's no way in hell you would wear it, it did give you a good laugh and in the end when the time finally came to leave for the party you...</span></div></div>",
            "created":1533260040,
            "id":2528388,
            "title":"There is no way..."
        },
        "1151":{
            "author_id":"lazyfriend56",
            "author_name":"Idontknow",
            "choices":[
                "Sarah.",
                "Kyle."
            ],
            "content":"<div class=\"\"><div> <span>As you step out of the shower all nice and clean you take a look at your bed to see the contents of the box now lying on it all spread out and strangely organized. <br>\r\nYou hadn't left them there but your glad they were now as you considered wearing them, sure you would never usually wear it but it could get a few laughs and once you got past the babyish look of it you realized it was actually quite revealing, like going to the party in your underwear except in this case your underwear was a thick bulky diaper but none the less it was guaranteed to get you some attention from the ladies.<br>\r\n<br>\r\nAnd so there you were strutting into his buddy's Halloween party dressed as a large baby. When you walk in you see...</span></div></div>",
            "created":1533347880,
            "id":2528729,
            "title":"Wear it."
        },
        "12":{
            "author_id":"e43rty",
            "author_name":"zsaag",
            "choices":[
                "  Why is this...",
                "Dear lord what the...",
                "Why on earth...",
                "Who would wear...",
                "There is no way..."
            ],
            "content":"<div class=\"\"><div> <span>Tak looked about as he walked inside the strange store. With a name like In the Name of Love he would have thought there would be more sex related items on the walls to be honest. <br>\r\nAt his odd height, he stood out in most groups, but then again he adapted to most people he hung around with.<br>\r\nThe elderly women grinned from ear to ear as she saw the young man enter her store. \"Ah welcome welcome!\" She jumped down from her chair and moved over to him. \"I see, what did you sent here for, something special?\"<br>\r\nTak mearly nodded as he smiled to her, trying to be polite to the women. Lord knows she was older then his grandmother! \"Yes Miss, something that will make me stand out at my friends party tonight.\"<br>\r\n\"Oh yes, lots of costumes to stand out!\" She beamed, moving around the store she looked at him, then got an idea. \"But no ordinary costume will do for you! No no!\" She chuckled, digging behind the counter.<br>\r\nHe liked the sound of that. \"Really? Something special? Something exciting?\"<br>\r\nShe grinned pulling out a plain white box from under the counter. \"You need this!\"<br>\r\n\"What is it?\"<br>\r\n\"This is what you need. Perfect costume.\" She waved her hand in the air.<br>\r\nHe leaned over the counter, looking at the strange box as his curiosity started to get the better of him. \"How much?!\"<br>\r\n\"Fifty dollar.\"<br>\r\nHis eyes went wide at this price. \"Fifty dollars!?\"<br>\r\nNodding the women crossed her arms. \"You want or not?\"<br>\r\nAgainst his better judgment, his need to know got the better of him. \"Deal!\" He slapped the money down and took off with the box. <br>\r\nAt home though, what he found inside was...</span></div></div>",
            "created":1388733960,
            "id":1720422,
            "title":"Oh hewwo! Tak here!"
        },
        "13":{
            "author_id":"e43rty",
            "author_name":"zsaag",
            "choices":[
                "Why is this...",
                "Dear lord what the...",
                "Why on earth...",
                "Who would wear...",
                "There is no way..."
            ],
            "content":"<div class=\"\"><div> <span>Maria wasn't sure really about going inside this place. She had never heard of In the Name of Love. No adds, no nothing. Yet here she was, walking inside the store.<br>\r\n\"My sister said this was a good place to get something to wear for our friends party tonight.\" Her D cup breasts sat high on her chest thanks to her bra, a slight little paunch to her belly stuck out her shirt though.<br>\r\nThe elderly women grinned from ear to ear as she saw the women enter her store. \"Ah welcome welcome!\" She jumped down from her chair and moved over to her. \"I see, what did you have in mind, something special?\"<br>\r\nShe was suspicious at the women's eagerness to sell her something but she continued on. And nodded shyly.<br>\r\n\"Lots of costumes, make you life of party!\" She beamed, moving around the store she looked at her, then got an idea. \"But no ordinary costume will do for you! No no!\" She chuckled, digging behind the counter.<br>\r\n\"Like what?\" She asked, head tilted as she looked at her.<br>\r\nShe grinned pulling out a plain white box from under the counter. \"You need this!\"<br>\r\n\"What is it?\"<br>\r\n\"This is what you need. Perfect costume.\" She waved her hand in the air.<br>\r\nMaria didn't really get the deal with what it was but, shrugged. \"How much then?\"<br>\r\n\"Fifty dollar.\"<br>\r\nHer eyes went wide at this price. \"Fifty dollars!?\"<br>\r\nNodding the women crossed her arms. \"You want or not?\"<br>\r\nNot really wanting to have nothing to wear to the party she sighed. \"Fine I'll take it.\" She handed the money over and headed back to her car.<br>\r\nThough she was a bit curious and opened it inside her car...</span></div></div>",
            "created":1388734740,
            "id":1720426,
            "title":"Maria the nervous"
        },
        "14":{
            "author_id":"e43rty",
            "author_name":"zsaag",
            "choices":[
                "Why is this...",
                "Dear lord what the...",
                "Why on earth...",
                "Who would wear...",
                "There is no way..."
            ],
            "content":"<div class=\"\"><div> <span>Stepping inside, Amy had her phone in hand, thumb typing away as she chewed away on her gum. Her long crimson red hair pulled back behind a hair band she looked around the store. \"Yeah my friend told me that some good costumes are here.\" Her chest was a 34 B cup, thin waist with a curvy bubble butt and wide hips and thighs.<br>\r\nThe elderly women grinned from ear to ear as she saw the women enter her store. \"Ah welcome welcome!\" She jumped down from her chair and moved over to her. \"I see, what did you have in mind, something special?\"<br>\r\nAmy shrugged as she looked at the women, practically eye level with her. \"I dun know. My friends said they already called you and said they already picked out something.\"<br>\r\nShe beamed, moving around the store she looked at her, then got an idea. \"No ordinary costume will do for you! No no!\" She chuckled, digging behind the counter. \"They pick wonderful costume!\"<br>\r\nThis made her curious as to what in the hell could her friends pick. \"And what might it be?\" <br>\r\nShe grinned pulling out a plain white box from under the counter. \"You need this!\"<br>\r\n\"What is it?\"<br>\r\n\"This is what you need. Perfect costume.\" She waved her hand in the air.<br>\r\nNever putting her phone down, she looked the box over and waved her hand. \"Okay how much then?\"<br>\r\n\"Fifty dollar.\"<br>\r\nHer eyes went wide at this price. \"Fifty dollars!?\"<br>\r\nNodding the women crossed her arms. \"You want or not?\"<br>\r\nWithout a word she took out her money and then took the box.<br>\r\nWalking down the street she looked at the box, deciding to open it..</span></div></div>",
            "created":1388735820,
            "id":1720434,
            "title":"Bold Amy is up!"
        },
        "141":{
            "author_id":"2crazy4summer",
            "author_name":"PoolParty1234",
            "choices":[
                "A pink tutu costume",
                "A maid costume",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Amy was surprised of what costume was inside. <br>\r\n<br>\r\nAmy: What the?<br>\r\n<br>\r\nAmy took it out to get a good look at it. It was....</span></div></span></div>",
            "created":1467408240,
            "id":2173760,
            "title":"Why is this..."
        },
        "144":{
            "author_id":"maria777",
            "author_name":"Maria777",
            "choices":[
                "A giant, baggy Pikachu mascot costume ",
                "A skin tight, exact look of Renamon from Digimon (with big boobs)",
                "A string, yellow binki that covers nothing and yellow bunny ears."
            ],
            "content":"<div class=\"\"><div> <span>Amy opens up the box and looks inside. It was... Amy frown. She can’t tell what it is. It’s yellow and furry. Some animal costume, maybe? And the box feels pretty heavy for her. <br>\r\n<br>\r\nHer phone buzzed in her hand, taking her attention away. She received a text message. It’s from her friend, Betty.<br>\r\n<br>\r\n“Hey, girl! Where ya at? This party has started! Bubbles already lost to a poker game and is drinking beer with her ass, lol!”<br>\r\n<br>\r\nBubbles is the one hosting the party. She’s a shy, pale skin girl with the whitest blond hair you’ve ever seen. She’s slowly opening up to Betty, Amy, Diana, and Melon. Melon’s father had a prediction the day Melon was born and he was right.<br>\r\n<br>\r\nAmy sigh. With one hand, she texted back to Betty. “Almost there. Be there soon.”<br>\r\n<br>\r\nAmy continue to chew her gum between her teeth as she closed her box and continue to make her way to the party.<br>\r\n<br>\r\n—————————-<br>\r\n<br>\r\n“Amy! Thank god you’re here!” A pink, furry bear that looks like a costume straight out of Fortnite ran towards Amy as Amy walked through the door. <br>\r\n<br>\r\nAmy set the box down, momentarily pausing chewing her gum. “Betty, slow down. What’s going on?”<br>\r\n<br>\r\nThe pink bear tilts on the base of her feet, showing the party’s alcohol is getting to her. “You know I texted you that Bubbles drank beer up her ass. Well, she challenged me to do the same after I lost the next match. Which I did. Now I need someone to hold the beer while i’m Upside down.”<br>\r\n<br>\r\nAmy look down, and sees Betty’s pink pants and panties has already lowered to right above her knees. Amy had a good view of Betty’s hairy, well trimmed pussy. <br>\r\n<br>\r\nAmy rolled her eyes, picking up the box. “Betty, why not ask the other girls to do it?”<br>\r\n<br>\r\nBetty pause, clearly showing she hasn’t really thought this through. “Well, Bubbles is too far gone to hold the bottle steady. She is in the middle of giving Gavin a free blowjob, which she would not do normally. I haven’t seen Melon for a while, maybe upstairs... I guess I could ask Diana or the others. Not a guy. Most of the guys have already drink a lot and I haven’t had enough alcohol to allow them near my asshole.”<br>\r\n<br>\r\nAmy smile. Her friend talks a lot but it’s a good way to understand what’s going on if your late. “Ask Diana. I’ll be upstairs changing into my costume upstairs. You can meet me after they make your thirsty asshole drink.” Amy slaps Betty’s ass, surprising her.<br>\r\n<br>\r\nAmy and Betty don’t have the same figure. Amy is taller than Betty. But they both have the same, identical curvy bubble butt. They’ve been called the Bubble Butt twins in their social circle.<br>\r\n<br>\r\nAmy couldn’t tell if Betty blushed but Betty turn around, showing Amy her own huge ass, and walk down the hall to where most of the party is taking place.<br>\r\n<br>\r\nAmy turn to her right and lift the box up the stairs. It’s a heavy box, requiring a lot of Amy’s strength to carry it up those stairs. Her bare feet stepped on the carpet floor, making a strong imprint.<br>\r\n<br>\r\nAfter reaching the top, Amy looked around for a deserted room. Ah. Bubbles’s room has no one in it. Amy carried the box inside and shut the door behind her.<br>\r\n<br>\r\n“Geez. Diana is going to be mad. She’s gonna know I had spend more time looking at those cute guys than working out.” Amy said, letting out a huff and dropping the box on Bubbles’s bed.<br>\r\n<br>\r\nAmy quickly took her top off and her pants followed. She had wasted too much time last minute costume shopping. She only hopes what she got was good.<br>\r\n<br>\r\nCompletely in her underwear, she momentarily powers to blew a bubble. The red head open the box up and pulled out...<br>\r\n<br>\r\n</span></div></div>",
            "created":1535439360,
            "id":2539913,
            "title":"Who would wear..."
        },
        "1441":{
            "author_id":"maria777",
            "author_name":"Maria777",
            "choices":[
                "A Drunker Blond Betty",
                "A Completely Drunk White hair Bubbles",
                "A Sober, Brunette, Carmel skin Diana"
            ],
            "content":"<div class=\"\"><div> <span>... something fluffy and yellow? Amy grab the costume and pulled it out of the box. It’s huge! Amy took the whole thing out and looked at it.<br>\r\n<br>\r\nIt is some sort of mascot costume. “What the hell? That old lady ripped me off.” Amy scoff. She can’t even tell what this is suppose to be anyway.<br>\r\n<br>\r\nAmy toss the costume onto the bed. What is she going to do? She can’t wear this. The point of coming here was to wear a sexy costume and have a good time. Halloween is just an excuse for her and her friends to get freaky.<br>\r\n<br>\r\nAmy looked around for her clothes. She could continue the night and pretend to be someone who just doesn’t care. It would make her stand out and the guys might not approach her but better than wearing a Barney size suit.<br>\r\n<br>\r\nBut Amy quickly noticed her clothes had disappear. Amy scan the floor but her clothes she literally just dropped is no where to be seen.<br>\r\n<br>\r\nNo way... they can’t be gone. Someone is in here. “Hello?” Amy called out nervously. The room is filled with crap, as Bubbles is a bad cleaner.<br>\r\n<br>\r\nNo one answer. Amy squatted down, dropping her ass to the floor, as she picked through the clothes. Nothing. Her clothes are really gone.<br>\r\n<br>\r\nBang bang! Amy fell on her butt in surprise as loud pounding noise came from the door. “Amy- hic - I drank another bottle. Are you done changing yet?”<br>\r\n<br>\r\nIt was Betty. Amy got a little angry from being startled. “Yeah, Betty. I’ll be a minute.” Amy got up from the floor and eyed the yellow costume again.<br>\r\n<br>\r\nBetty is still at the door. “Ok... cause i’m horny. C-c-could you hurry up and help me find a guy? Or,” *rattle rattle* “Let me in and you could make me cum?”<br>\r\n<br>\r\n“Betty.” Amy responded in a even tone. “Patience. I’ll be down shortly. Go back down stairs.”<br>\r\n<br>\r\nThere was silence for a bit but Amy could hear the faint footsteps of Betty leaving the door and heading off towards the stairs. With her short friend gone, Amy looked back at her costume.<br>\r\n<br>\r\nShe doesn’t want to go downstairs in her underwear. It would be like open season for her. So reluctantly, Amy grab the tiny zipper on the costume and pulled it down.<br>\r\n<br>\r\nAmy grab the suit of the bed, and putting one foot in at a time, she slid her legs in. She lowers her head and push her arms in the sleeves. After she got her limbs in the sockets, she stood up.<br>\r\n<br>\r\nThe costume, as big as it is, seems light. She is also able to see clearly through the mask. Amy took a breath check. Ok on breathing. Actually, there is a sizable hole at her mouth. Ooooo. Maybe she could eat while wearing this or have a good blowjob.<br>\r\n<br>\r\nAmy reach around for the tiny zipper. She can’t seem to grab it. Crap. The glove hands are too big. She is going to need someone to zip it for her.<br>\r\n<br>\r\nJust then, the zipper is pulled up, keeping Amy inside. “What the hell!?” Amy cried out in shock by someone pull her zipper. She spun around to find no one. Someone is definitely here and scaring her for their amusement. :(<br>\r\n<br>\r\nThe costume is tightly around Amy. She checked her furry arms and her legs for holes or ugly stains. Actually, she is finding the costume not that bad. If she was dealing with kids. The suit isn’t as baggy as she thought, able to show off how thick her thighs are.<br>\r\n<br>\r\nBang! Bang! Bang! Amy jump with a fright. Someone is at the door. Amy walked over and pulled it open to find...</span></div></div>",
            "created":1538513760,
            "id":2558034,
            "title":"Baggy Pika"
        },
        "14411":{
            "author_id":"maria777",
            "author_name":"Maria777",
            "choices":[
                "Got too hungry and Bubbles is perfect for the first snack",
                "Got her stomach, legs, and arms very fat, but spared face",
                "Grew a 1ft 6ins long cock",
                "Got her body to turn into a slime"
            ],
            "content":"<div class=\"\"><div> <span>“Amy!” Bubbles yelled happily. She jumped up off her bare feet and landed forward onto Amy. Amy, unprepared by Bubbles sudden approach, fell backwards on the floor while cry out with an ’Oof!’.<br>\r\n<br>\r\nAmy laid on the floor as the short hair, bleach blonde goth aggressively cuddle against Amy like she found her giant stuff animal. Well, perhaps she did.<br>\r\n<br>\r\n“Bubbles, get off of me!” Amy growled. Her ass cushioned her fall and now it stings. ;^;<br>\r\n<br>\r\n“Nu!” Bubbles said, her forearm tightly squeeze between Amy’s C cups and her knee rest against Amy’s crotch. Bubbles had a tight hold on Amy as she kisses the yellow fur on Amy’s mask, trying to reach her lips.<br>\r\n<br>\r\n“Yes. You. Will!” Amy said as she struggles against Bubbles strength. She grabs Bubbles’s shoulder and used her own superior strength to pry her off.<br>\r\n<br>\r\nBubbles landed on her back, laughing and giggling. Amy sat up and looked her with an annoyed expression. “Geez, I like you better as your cold, distant sober self than your drunk, wild side, Bubbles.”<br>\r\n<br>\r\nBubbles keep giggling in her laughing fit. Amy looked at her massive boobs that giggled with her. Bubbles is the same age as Amy but a full foot shorter than her. But despite being so short, Bubbles has the biggest breasts in school. Only one of her tit is the size of two of Amy’s own breasts. Amy does feel a hint of jealousy towards Bubbles but it doesn’t get in the way of their friendship.<br>\r\n<br>\r\nBut, as Amy lick her lips, they do taste very good. Perhaps she can have a snack before going down and giving a lucky guy the best blowjob he’ll ever have from a giant Pikachu.<br>\r\n<br>\r\nAmy got off her butt and crawled on all fours to Bubbles, who is wearing some sort of tight, punk costume. Her nipples aren’t even cover, only peeking out through some fishnet-like top. A bare cleavage, a black line in the middle of her breasts, and a fishnet covering underneath to the waist. Amy was focus on the breasts but a quick glance at Bubbles’s bottom half, ignoring the punk boots, there was a yellow puddle forming underneath Bubbles. Probably the alcohol leaking out her ass.<br>\r\n<br>\r\nBubbles calm down and saw a giant Pikachu crawling towards her. “Awww... is ms. Pikachu hungry?” She said, reaching her hand up to the Pikachu’s face.<br>\r\n<br>\r\n“Very.” Amy respond, reaching for Bubbles left tit and aim the tit at the giant Pikachu’s mouth hole. Through it, Amy lowered her head and began sucking on Bubble boob, drinking her sweet milk. Bubbles cooed. <br>\r\n<br>\r\n“I don’t say it when i’m sober but I love it when my friends suck me for my milk. It makes wet.” Bubbles giggle. Amy giggle too with Bubbles’s nipple in her mouth. She reached her right, furry Pikachu hand and stick her middle finger in Bubble’s pussy. Bubbles gasp, as Amy’s middle finger is bigger by the costume.<br>\r\n<br>\r\nWhile this is going on, the Pikachu costume moved strangely on its own. Amy was too preoccupied to notice the changes that were happening but the costume work it magic quick. The changes that were hidden from Bubbles due to the nature of the baggy costume before it was too late. Amy...</span></div></div>",
            "created":1553657700,
            "id":2635425,
            "title":"Blond Goth Betty with the Milky Tits"
        },
        "15":{
            "choices":[
                "\"Oh crap...\"",
                "\"Well this is interesting.\"",
                "\"Of corse its this...Why is it this?\"",
                "\"So much for the boots.\"",
                "\"I knew it and now I have boots to match.\""
            ],
            "content":"<div class=\"\"><div> <span>A young looking woman in her mid 20s walked into the store. Her hair was a golden red that laid down against her fair skin. She was wearing dark sunglasses and her clothes looked more like a casual goth then just a normal girl. She looked over to the counter seeing an elderly woman perk up and move to meet her. \"Hello, I hope I'm not bothering you on your break,\" Xiena replied as she looked to the woman who stood about 5'3\"; a good six inches shorter then herself.<br>\r\n\"No, no! Not at all. Please come in and have a look at what I have,\" the elderly woman replied.<br>\r\nXiena gave a smile and took off her dark sun glasses to see better in the store. Her eyes were two different colors which caught the woman's gaze; the right eye was a forest green and the left a fire blue. \"My friend said they had asked for a particular costume for me. Said it goes great with my eyes,\" Xiena replied looking at the women's costumes hanging near by.<br>\r\n<br>\r\nWitha gentle shake of her head the elderly women grinned wide and went to her counter, \"Ah! Yes, it would seem no ordinary costume would compliment you.\"<br>\r\nXiena looked amused though she followed slowly to look at the other things in the store, \"Hope they warned you my bust is bigger then it seems.\"<br>\r\n\"Your what? Oh you mean your breast. Well don't worry this costume will fit you don't you worry,\" the woman replied bringing a rather plane box and putting it on the counter. It was large enough for just about any costume to fit if folded right.<br>\r\nXiena went to lift the lid for a peek when the woman softly guided the lid back down, \"I was told to not let you see it till you bought it.\"<br>\r\n\"Alright,\" Xiena replied looking now curious and slightly worried as to what it was, \"How much then?\"<br>\r\n\"That will be Fifty dollars,\" The woman replied holding out her hand.<br>\r\nXiena smirked, \"Now I know why they told me to bring more then my pocket change. Well may I also get those boots by the door?\"<br>\r\nThe woman smiled, \"Of corse those are sixty-five.\"<br>\r\nXiena shrugged and moved to collect the boots; they were knee high laced boots with a belt buckle at the top and a decorative strap that wrapped from the top the foot to under the heel. Bringing them to the counter Xiena pulled out the two c-notes she just collected from the bank before coming to the store. The elderly woman boxed the boots and put both boxes in a bag before then giving Xiena her change.<br>\r\n<br>\r\nXiena left the store curious of her new costume though wanting to get home before seeing it. She tucked the bag into her side car buckling it before sitting on her custom bike and riding off for home. Once she was home and parked her bike in her garage she choose to give a peak at her new costume.</span></div></div>",
            "created":1388758620,
            "id":1720535,
            "title":"Xiena"
        },
        "151":{
            "choices":[
                "Lost on the way.",
                "Made it safely.",
                "Weather and realm change."
            ],
            "content":"<div class=\"\"><div> <span>In the box was a white almost sheer dress that had many pieces of jewelry. Xiena took it to her living room and opened it more to look at the pieces of the costume. It was very greek in design and matched more for that which the oracles often wore. But the part that made her say 'Oh Crap' at first sight was the runes on the large neck piece. Not many knew that Vikings had ever reached Greece let alone claim some its females.<br>\r\n<br>\r\nThe Runes were those of Odin and his wife whom Xiena knew to be the Queen and head Valkyrie. Xiena didn't mind that it was something representing a warrior as much as it was representing some one from a Myth that often clashed with her beliefs in not so friendly manner. She looked at the whole outfit and sighed, \"At least its a silver base the a gold one. Looks like I'm taking the car though.\"<br>\r\n<br>\r\nXiena got dressed and added a pair of silver heels with the shin covers that came with the outfit. Under the sheer cloth she wore a white thong and a second white split tongue skirt to feel less exposed. She also had on her silver and leather brown corset to support her large bust as well as to avoid showing off her nipples. <br>\r\n<br>\r\nWith a pause in the mirror she looked at her curves in the costume. Though loose up top it did compliment her eyes well. She then began to do a light touch of makeup to bring out a more natural beauty on her face and neck. Though she had to go heavy with concealer on her right shoulder to hide the long scar and smooth the skin tone much easier. She was not sure why this outfit was chosen but with luck no one would hit on her in a drunken stoop.<br>\r\n<br>\r\nXiena went for her car she her phone rang, \"Hello?\"<br>\r\n\"Hello Miss BloodStone, would you like a ride through magic?\" A voice asked on the other end.<br>\r\n\"No thank you. Me and Magic tend to have disagreements but I would like a ride to the party. Can I assume you are outside my home?\"<br>\r\n\"Yes you can, bring a coat when you come out,\" the voice replied.<br>\r\nXiena smiled and looked out her window to see them sitting in a carriage with two strong brown horses waiting, \"Alright Mike, I'll be right there.\"<br>\r\nXiena hung up the phone and though she wanted her faithful black Duster she chose her foe-fur wolf coat. She then took her small dagger and tucked it in her chest, 'never know when you'll need it' she thought.<br>\r\nAs she met Mike out side she saw his costume, \"And what are you?\"<br>\r\n\"I'm Odin, the all Father,\" Mike said proudly.<br>\r\n\"So then you picked my outfit?\" Xiena replied as she got into the carriage with his help.<br>\r\n\"Well I thought you'd make a very sexy Frea, I was right too~\" Mike replied getting in on the other side to drive the carriage.</span></div></div>",
            "created":1388764740,
            "id":1720606,
            "title":"\"Oh crap...\""
        }
    },
    "info":{
        "author_id":"e43rty",
        "author_name":"zsaag",
        "brief_description":"It's time for Halloween. But what do you wear? Better yet, what happens?",
        "created":1388729880,
        "description":"<td align=\"left\" class=\"norm\">Alright so this follows a wide variety of characters. Four main people, two guys, two girls. And a fifth choice if you want to add your own people and start it your way.<br>\r\nA list of people will be inside, and each one will have a variety of choices for costumes and choices.<br>\r\nThe main people that will be added for the start will be there waiting for what happens after they take it home. They'll be given a white box, but whats inside the box?<br>\r\nI don't want to see any chapters just end. I wanna see this keep going for as long as it can.<br>\r\nKeep the weirdness going!<br>\r\nJust don't get too... weird.<br>\r\n<br>\r\nYou wanna make a guy change gender? Cool. Wanna have some inflation? Sweetness. Gay love/sex? By all means. Make it trashy if you want!<br>\r\nJust make sure it's well written is my only request. Not a whole lot of errors and such. Something that will keep people reading. No text talk, no one liners. You know?<br>\r\nOther then that, I'll start it, have fun!<br>\r\n<br>\r\nBe noted when it comes to what will be inside, I'll make if very oblivious because I want you to decide what is inside. A mystery of sorts! So when those chapters are made, you'll be surprised at what people say.</td>",
        "id":1969707,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1553657700,
        "modified":1553657700,
        "pretty_title":"Halloween Party"
    }
}