{
    "chapters":{
        "1":{
            "author_id":"roninmogura",
            "author_name":"Ronin Mogura",
            "choices":[
                "Contract A",
                "Contract B",
                "Contract C",
                "Contract D",
                "More contracts here."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Simply put, the options below are separate story lines different writers can get in on and create on their own or with help if they so desired. <br>\r\n<br>\r\nPick one and let the fat times roll.</span></div></span></div>",
            "created":1308286800,
            "id":1127855,
            "title":"Make a Contract with me :3"
        },
        "11":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "And There is one Akemi Homura, with her stoic look as always",
                "One of his other friends, Sakura Kyoko? What she's doing here?",
                "Mami-senpai? What she's doing here so early?",
                "Eeehh?! They are all here?(all the above)",
                "Some feminine pale white haired boy with red eyes...and a grin(Kyubey)"
            ],
            "content":"<div class=\"\"><div> <span>The sun peered through the blinds inside a bedroom as a figure inside the bed squirmed and twisted about under the comforters and quilts.<br>\r\n<br>\r\nAnd then right next to his head, his cellphone vibrated. A mop of brownish-going on pink hair looked up, droppy eyes blinking as a hand reached to the cellphone and flipped it open, seeing an email as arrived.<br>\r\n<br>\r\nThe boy, 13 year old Tatsuya Kaname, clicked the ‘open’ option and saw a message.<br>\r\n<br>\r\n-<br>\r\n<i>Hey Tatsuya my parents won’t be able to drive me to school today, so I can walk with ya today. Be up early because I am coming over for breakfast as well.<br>\r\nHomura</i><br>\r\n-<br>\r\n<br>\r\nTatsuya groaned as he closed his cellphone after inspecting the time and date(6:00 am and on Tuesday) and pulled the covers off of him and flipped his feet over the bed, feeling his feet on the cold wooden floor. He yawned again as he put on his PJs from the night before(he was wearing his underwear in bed) and walked like a zombie out of his bedroom.<br>\r\n<br>\r\nFor as long as he can remember, Akemi Homura has been his best friend. When some mean kids were pushing him off the playground, it would be she that would chase them off, usually with her Medusa-level glares and groin shots. With such kicking strength she could be a soccer prodigy. <br>\r\n<br>\r\nBut she always looked out for him, being the big sister he never had, always making sure he’s doing his studying(they study together) and protecting him from jerks and mean people. Why she cared about him was unknown to him. She was pretty he admitted, cute when he first met her, and pretty still.<br>\r\n<br>\r\nSpeaking of pretty girls, as he finished brushing his teeth and stepping into the shower, he always had weird dreams every other week. And it always involved a pink haired girl in some Magical Girl costume, usually white and pink. And she would smile in his direction…<br>\r\n<br>\r\nThen he’d wake up, usually either in the middle of the night or in the morning. Why that girl was in his dreams confounded him. When he first got the dreams, he told his parents about it and his dad laughed on how he might be having wet dreams.<br>\r\n<br>\r\nThe memory made the boy roll his eyes as he stepped out of the shower and dried off and put on his clothes and walked down the hallway and down the stairs, feeling more refreshed as he walked into the kitchen quietly and saw a note on the table. He walked over and read it.<br>\r\n<br>\r\n-<br>\r\n<br>\r\n<i>Hey Tatsuya-kun, this is Mama here!<br>\r\n<br>\r\nRemember how last night you had cram school and went to bed right when you got home? Well…if incase Papa didn’t tell you, I had A LOT of work to do, so I had to stay over at a friend’s house in Shinjuku to help overlook the financial records and what not. Also, Papa just got an offer to represent his company and try and sell stock over in New York City! But it was an accept-now type of offer so he left on a 3 am flight I’m afraid…<br>\r\n<br>\r\nWell besides the soon-to-be-stable economic future of our family, both me and your papa are unable to spend time with you. So so so so sorry!! DX.<br>\r\n<br>\r\nBut regardless, me and your papa love you very much. Papa will be home by this Friday and I’ll be back Thursday afternoon.<br>\r\n<br>\r\nBut, we both know you are very capable of running the house and keeping your grades up. If you ever feel lonely or overwhelmed, this is Papa’s words, bring in one of those girl-friends you know at school.<br>\r\n<br>\r\nLove you! Mama</i><br>\r\n-<br>\r\nTatsuya grinned. “Guess I’m gonna be home alone for two days.” He set the note back on the table and walked over the bread bin to get toast until he heard a knock on his door. <br>\r\n<br>\r\nKnowing it’s Homura, Tatsuya ran over and opened the door…<br>\r\n</span></div></div>",
            "created":1340168400,
            "id":1363667,
            "title":"An intriguing tale of Kaname Tatsuya"
        },
        "111":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Heading to school, who is this new student?",
                "The end of the day, time for...",
                "Back home, Tatsuya is alone"
            ],
            "content":"<div class=\"\"><div> <span>The young man opened the door and what awaited him was his dear friend and occasional annoyance, Akemi Homura in all of her splendid stoic glory.  A blank expression was present on her ivory colored face, however, one could read it as a sign of disappointment which Tatsuya knew all too well.<br>\r\n<br>\r\n\"Good morning Homu.\" Tatsuya motioned her to get inside, stepping away from the door. His friend had yet to move, the expression still present. He sighed as he knew what this meant. Homura would always have these weird quirks to her, even when they were children playing together. It was rather annoying for the youth to deal with, but she was his best friend and he needed to deal with it regardless of his own feelings. Walking back over to the girl, he patted her on the head, needing to stand on the tips of his toes as he was a mite bit shorter than his friend. He was still a growing boy, or that was what he would always say. <br>\r\n<br>\r\n\"Good morning Homura-homu-homu.\" said the younger boy with a dry tone to his face. That was a small name she had come up for herself and always wanted Tatsuya to greet her with it whenever they were alone. Homura gave a big smile and gave the boy a quick hug. \"Now that wasn't that bad was it? Mou, you're always so mean to me Tatsuya-kun.\" said the girl, ruffling his hair and messing it up in the process. He struggled out of the hold. <br>\r\n<br>\r\n\"Yeah yeah, now please get inside, you're letting the bugs in the house.\" The girl did as told and entered the humble abode closing the door behind him. Taking off her shoes and hanged her school bag on the coat-rack and followed her friend into the kitchen. It was an hour or so before school began so the pair would always have breakfast together. Since Homura was a terrible cook, Tatsuya took it upon himself to cook for her. She rather enjoyed his meals so it was a win-win situation. \"So what's on the menu today Tatsuya-kun?\" she asked as Tatsuya faced away from her, busy preparing ingredients on the counter. Since time was limited he always opted for easy to make meals and the girl always insisted on eating more complex stuff. Luckily he decided to treat the girl this morning. He had planned to have crepes and the wraps were already made, all he needed to do was heat them up. Next was to make the cream filling and cut up the fruits that would be used. <br>\r\n<br>\r\n\"Its a surprise.\"<br>\r\n---<br>\r\nHomura eagerly awaited her breakfast, the scent of something sweet was lazing in the air. She really did wish that her friend would always be able to cook for her but they were in different years. She a junior and he was freshman. They would be parting sooner than later as university called out to her. Her melancholic thoughts were disrupted by the boy placing two crepes in front of her on a plate and covered with whip cream and fruit topping. \"Here, eat up.\" A bite from her meal was enough to send her tastebuds right into heaven. <br>\r\n<br>\r\n\"Tatsuya-kun, won't you be my wife?\" Both of the friends laughed at the statement, her thoughts of the future being drowned out for now.</span></div></div>",
            "created":1346216400,
            "id":1416077,
            "title":"Thinking of new"
        },
        "1112":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "The meal is over, Homura managed to wolf it down",
                "Later that night, reflections and decisions "
            ],
            "content":"<div class=\"\"><div> <span>School had ended for the two teens and now they were making their way to get a bite to eat. Class had been rather boring for the pair, both of them were rather bright and things just seemed to drag on. While Tatsuya wouldn't admit it, Homura was always the bright point of his monotonous day. They walked down the city streets, looking for a place that was new just for the sake of it.<br>\r\n<br>\r\n\"Well, what do you feel like eating Homu?\" asked the boy, looking towards his friend who began to thought of what she had a craving for. Lately, she had been wanting something grilled, like barbecued meat or chicken. But that was a bit out of their price-range. They were teenagers after all. So burgers at a fast food joint would suffice.  Latching onto his arm, she began to lead him to her restaurant of choice.<br>\r\n<br>\r\n\"I want burgers Ta-kun.\" A slight tinge to his face, he let himself be pulled along by the girl, it couldn't hurt after all.<br>\r\n---<br>\r\nWalking through the double doors, a wave of cold air hit the two teens. Since it was nearing dinner time, the eatery was slightly packed, with longer lines and fewer tables to sit. Placing themselves into line, Homura noticed that many people in the restaurant were from their school. She had also noticed that a few of the girls had stuffed themselves to a great degree. She couldn't place it, but for some reasons she felt a great hunger coming from her midsection. <br>\r\n<br>\r\n\"Hey, you okay?\" asked Tatsuya, seeing how Homura was in pain, it made him feel uneasy. <br>\r\n<br>\r\n\"O-Oh, I'm fine Ta-kun. I think I was just a bit more hungry than I thought.\" Placing a hand on his shoulder, she did her best to convince him that she was fine. Truth be told, she had no idea why her hunger had exploded like that, but she did not want to worry her close friend. Finally it was her turn in line and was greeted by the peppy cashier.<br>\r\n<br>\r\n\"Hi there, welcome to Flabby Pattys! May I take your order?\" Looking at the menu display, a feeling came over the long-haired girl. A feeling of immense gluttony.<br>\r\n<br>\r\n\"I'll have a number six, a number 2, two number fours, a large soda and a strawberry milkshake.\" Without missing a beat, the cashier placed the order, used to such ridiculous requests. Telling the girl her total, Homura pulled out her cash to pay. Having felt his mouth go agape, the teen placed his order then went over to Homura was nearly drooling in anticipation of her upcoming meals.<br>\r\n<br>\r\n\"Hey Homura, mind telling me what that was about? I thought you were fine?\" <br>\r\n<br>\r\n\"I am fine Ta-kun. I'm just feeling a bit more hungry than usual.\" Not entirely coerced, he placed a hand on her forehead to see if she had a fever or not. Her face becoming flushed, she placed one of her hands on top of his and entwining her fingers with his. \"I had no idea you were so bold Tatsuya...\"  Recoiling his hand at a rapid pace, he turned his head away, trying to hide his embarrassment.  Homura smiled at her friend, enjoying their little exchange. Perhaps she could teach the boy to act more bold in the future?</span></div></div>",
            "created":1356066000,
            "id":1492134,
            "title":"Ideal boldness"
        },
        "11121":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Tatsuya escorts her home.",
                "Cut to 2 weeks later..."
            ],
            "content":"<div class=\"\"><div> <span>\"Ooooohhhhh....\" Groaned Homura as she leaned back in her booth, both hands on her mid-section. The pink haired boy blinked at the sight before him.<br>\r\n<br>\r\nIn under a half-hour, Homura was able to wolf down the entire meal she ordered, which looked like it took a chomp out of her wallet,<br>\r\n<br>\r\nHer belly looked as swollen as a basketball, as it looks like she swallowed one and it landed into her stomach. The black haired girl's shirt rose and hugged her middle tightly.<br>\r\n<br>\r\n\"Mmmmm....\" Tatsuya felt a foot brush his shoes as he could see Homura squirm in pain. Without a word, he got up and sat by her, putting a hand on her middle.<br>\r\n<br>\r\n\"Eh!\" She gasped from the touch. \"T-Ta-kun! What are-\" And Tatsuya began to rub it, very slowly and gently, making the girl get pink on her cheeks. \"D-Don't be so sudden! I mean-\"<br>\r\n<br>\r\n\"You were having a stomach ache Homu, I couldn't just sit by and watch you writhe with a tummy ache,\" said the boy as he continued his rubbing.<br>\r\n<br>\r\n\"B-But...people are staring.\" Tatsuya scoffed.<br>\r\n<br>\r\n\"Haters gonna hate. You're my best friend Homu.\" He continued his rubbing, and Homura's moans of pain slowly became more pleasureful.<br>\r\n<br>\r\nAnd after a good ten minutes, Homura put a hand on his arm. \"I...I think I'm good Ta-kun...\" She gave the pink haired boy a light smile. \"Thank you...\"<br>\r\n<br>\r\nTatsuya grinned. \"Any time.\"</span></div></div>",
            "created":1356843600,
            "id":1497899,
            "title":"The meal is over, Homura managed to wolf it down"
        },
        "111211":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Later that Night, Homu shows up!",
                "Next day, a nice breakfast is had"
            ],
            "content":"<div class=\"\"><div> <span>After resting at the restaurant, waiting for the girl's stomach to settle, the young teen escorted his bloated friend home.  Since it was sundown, the sky was tinged with an orange hue, making the walk back to her place calm. They didn't live far from one another, which meant that they could visit the other whenever they wanted. He was surprised to see his friend eat so much, but the teen didn't want to bring it up, perhaps she was simply hungry? Homura was feeling good enough that she was able to walk by herself, but Tatsuya stayed close to her just in case. They talked of everyday occurrences, from other friends to school work and the like. Eventually, the pair found themselves at the doorstep of the black haired girl's house.<br>\r\n<br>\r\n\"Hey, thanks for today again. It was fun.\" said Homura with a smile. Giving off a smirk, the teen nodded. It was fun for him as well. Looking towards her middle, he noticed that it was still a bit bloated.<br>\r\n<br>\r\n\"Make sure you get some rest too. I don't want you to get sick on me and everything. Who else is gonna bug me to cook for her?\" Putting both hands on his dark pink colored hair, she ruffled it furiously, leaving the teen dizzy and with an incredibly messy hairstyle. Giving a wink, she jumped through the door and slamming it shut, leaving a confused Tatsuya. <br>\r\n<br>\r\n\"I really don't understand that girl in the slightest.\" said the teen as he made his way back home. While she was confusing at times, even he couldn't deny that the girl was very interesting. <br>\r\n---<br>\r\nThe walk home was rather boring, the teen missing the girl's company. Though he would never actually admit that part though.  As his parents were still away, he was thinking of what he should make himself for dinner. With the thoughts of food circulating in his mind, he recalled just how big her midsection had become earlier, something that had flustered him for some reason. <br>\r\n<br>\r\n'Maybe I should start making her more food, if she's going to get appetites like that.' he mused finally reaching his house and getting inside.  He still had chores to take care of, so he wouldn't be able to relax just yet.</span></div></div>",
            "created":1358139600,
            "id":1508464,
            "title":"Ruffled!"
        },
        "1112111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Traditional Japanese",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>As Tatsuya began to load dishes into the dish washer, he heard the doorbell ring.<br>\r\n<br>\r\n\"Eh? Who could that be?\" He asked as he stopped his chore and walked towards the front door and opened it.<br>\r\n<br>\r\nAnd found Homura in a jacket, a scarf covering her lower face as she stared at the slightly shorter boy.<br>\r\n<br>\r\n\"Evening.\" Said the teen.<br>\r\n<br>\r\n\"Hey.\"<br>\r\n<br>\r\n\"Can I ask why you're at my house?\"<br>\r\n<br>\r\n\"Hungry.\"<br>\r\n<br>\r\n\"Can't you eat at your place?\"<br>\r\n<br>\r\nHomura looked away, looking a little flustered and murmured something. Tatsuya tiled his head.<br>\r\n<br>\r\n\"Come again?\"<br>\r\n<br>\r\n\"I love your food...\" She looked back at him. \"Ta-kun...\"<br>\r\n<br>\r\nNow the pink haired teen had pink on his cheeks and rubbed the back of his head.\"Well...I guess I could make you dinner and-\"<br>\r\n<br>\r\nHe couldn't finish thanks to Homura walking in and through him and into the kitchen, after taking off her shoes. The Kaname boy rolled his eyes and followed...<br>\r\n<br>\r\nAnd saw her butt in nice apple bottom jeans, and it looked tighter yet...more defined and bigger...<br>\r\n<br>\r\n'Eh, probably my imagination. And don't look more, or else she'll swat me.' He thought as he followed her into the kitchen as he saw her sit down on the couch.<br>\r\n<br>\r\n\"So...cravin' anything?\" Asked the pink haired teen.<br>\r\n<br>\r\nHomura looked up at him and asked for...</span></div></div>",
            "created":1358917200,
            "id":1514820,
            "title":"Later that Night, Homu shows up!"
        },
        "111212":{
            "author_id":"veritax_95",
            "author_name":"Not Crazy",
            "choices":[
                "Tatsuya makes her a taste-tester! But is that his only goal?",
                "Tatsuya decides he wants to be closer with her; That means more snuggles n meals"
            ],
            "content":"<div class=\"\"><div> <span>\"Homura! Let's go to this restaurant!\"<br>\r\n<br>\r\n\"Homu-chan, this new ramen place opened up!\"<br>\r\n<br>\r\n\"My class went on a trip to Mami's bakery today, I want Homu to have these!\" <br>\r\n<br>\r\nHomura leaned back against the couch, huffing and puffing from her newest meal. Tatsuya sat beside her, rubbing her engorged middle with soft eyes.<br>\r\n<br>\r\nWhen she thought to be 'bolder' she didn't think he'd take her out for more food, even though he'd give her comforting hugs or snuggles after each meal, she was certain his 'boldness' was more about making her bigger. And two weeks had certainly done that. Before she was essentially very slim and well-fitting most of her clothes, now she had a constant pot-belly which struggled with her uniform and its buttons, and her skirt was beginning to ride up on her rump. Her legs and arms were feeling softer as well. <br>\r\n<br>\r\n\"That was delicious, wouldn't you say Homu?\" Tatsuya said with a smile.<br>\r\n<br>\r\n\"It was very good. We should come here more often,\" Homura agreed. Tatsuya's eyes lit up at that.<br>\r\n<br>\r\n\"Speaking of which, I decided to go into cooking after all!\" He said and Homura blinked. He had been a good helper with his parents at home, sometimes preparing meals alongside them whenever he invited Homura, Mami and Kyoko over for dinner and on the downtime been trying out things on his own, so she wasn't very surprised about this. \"I'd like you to try some things I've been cooking up! What do you say?\" He asked cheerfully.<br>\r\n<br>\r\nHomura couldn't say no now. He was acting more confident and affectionate around her whenever they hung out or went for food. <br>\r\n<br>\r\n\"Sure. What's on the menu?\" Homura asked out of curiosity. <br>\r\n<br>\r\nTatsuya grinned. <br>\r\n</span></div></div>",
            "created":1555152900,
            "id":2644225,
            "title":"Cut to 2 weeks later..."
        },
        "1112121":{
            "author_id":"veritax_95",
            "author_name":"Not Crazy",
            "choices":[
                "Homura ends up killing the Demons, but doesn't stop eating.",
                "Homura ends up injured and needing to be saved. She's benched!"
            ],
            "content":"<div class=\"\"><div> <span>Lots and lots of food. The course of the first semester at high school was constant; class, talking with friends - mostly Tatsuya -, and trying his meals. He was even making lunches for her, things a little bigger than she would usually eat for the dinners they had. Kyoko would constantly ask for some but Homura would refuse, stating that it was taste-testing for Tatsuya. Mami would give off an odd smile each time this happened, but Homura thought nothing of it.<br>\r\n<br>\r\nThen the clothing began tearing. It was her shirt at first, embarrassingly during class. She had been asked to go up to the board when her top buttons popped off, revealing a part of her larger chest. She had been excused immediately to fix it up but not before seeing Tatsuya smile in her direction. The tricky little guy was enjoying this...and she liked this. The skirt incident was thankfully at home. She had a new uniform soon.<br>\r\n<br>\r\nHer BMI soon went past Overweight as she took her job more seriously, blowing up faster than before. Her breasts were barely smaller than Mami's, her stomach was starting to slip under her skirt, and her legs and arms had lost useful muscle as the pounds piled on. Needless to say her grade soon began to drop in Physical Education. Kyoko and Mami were getting slightly worried about her size, believing that she would soon become a liability as a Magi. Homura knew she was getting fat, but she wanted to prove that she was still just as good as before. <br>\r\n<br>\r\nWhen they announced they were going to do a Demon raid soon, she immediately offered to join them. Mami was very reluctant, but Kyoko said it would do the 'whale' some good to grease off a bit and so she relented. The day soon arrived, one day before Homura and Tatsuya's hangout, and the black-haired girl was ready. </span></div></div>",
            "created":1555154640,
            "id":2644238,
            "title":"Tatsuya makes her a taste-tester! But is that h..."
        },
        "12":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "Madoka's friends are the main problem!",
                "Kyubey needs to be dealt with!",
                "The Witches are a large threat!",
                "It's Madoka herself that's the cause!",
                "My own idea is the solution!"
            ],
            "content":"<div class=\"\"><div> <span>The white, bland hospital room was a sight that Homura Akemi had known for a very long time. Every time a timeline needed to be reset, she would end up back in her hospital bed, more ready than ever to head into the new timeline in her bid to save Madoka Kaname from her unfortunate fate. It had became a vicious cycle, each reset meaning another long struggle of following a specific plan, working to the wills of time to prevent any and all circumstances of Madoka even coming close to becoming a Magical Girl. And to top it all off, there was also the threat of Walpurgisnacht to deal with too. Homura had known for a long time that this was no easy task.<br>\r\n<br>\r\nHowever, this time was going to be different. Homura started off in the same way: getting herself discharged from the hospital, getting prepared for school and taking her place in Madoka's class room, as always. But that was all that was going to be the same. Homura knew that things needed to change, her current plan of action that only resulted in failure in every timeline she had been through. Drastic action was needed to make sure that Madoka was safe from any harm and that Walpurgisnacht did not destroy the city.<br>\r\n<br>\r\nNow in the classroom, Homura sat at her seat, intently thinking of her new plan of action. She needed something out of the norm, something outlandish and risky that would provide the correct path to success in the current timeline. Something, anything, whatever would make all the struggles she had faced worth it. It was then that Homura got an idea: a tremendously, wonderful, awful idea.</span></div></div>",
            "created":1356152400,
            "id":1492940,
            "title":"Another timeline, another story..."
        },
        "121":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "Sayaka",
                "Mami",
                "Kyoko"
            ],
            "content":"<div class=\"\"><div> <span>Homura's eyes shifted to the figure of Sayaka Miki, a very close friend of Madoka. Homura's stoic expression bore a slight frown as she looked at Sayaka, which soon cast her mind to the others that also played a part with Madoka. She thought of Mami Tomoe, an older girl who mentored Madoka in the timelines. She thought of Kyoko Sakura, who would go to Madoka for assistance after an unfortunate incident with Sayaka. All three girls posed a threat to Madoka, each one shifting her fate closer to the incorrect outcome. Homura knew that Madoka only needed one friend to guide her through the incident, that one friend being none other than herself. After all, it was Homura who was repeating the timeline over and over for the sake of saving her.<br>\r\n<br>\r\nAnd thus, Homura knew what needed to be done. Each one of the girls needed to be taken care of, put of the picture so that none of them could interfere with Madoka, leaving her to only be swayed by Homura's actions. However, she needed to be smart about it. She couldn't just out and kill them, that would gather too much attention. It would be disastrous if Madoka found out, she wouldn't ever speak to her again. No, for this, Homura needed something else, something that would put the girls out of commission for sure.<br>\r\n<br>\r\nBut first of all, which girl would she target first? Which of the the three threats was the most pressing, the one who would having the biggest influence on Madoka?</span></div></div>",
            "created":1356152400,
            "id":1492966,
            "title":"Madoka's friends are the main problem!"
        },
        "13":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Homura is attending school, new to this timeline. She must save Madoka!",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>Kyubey sat on the perching overlooking the city below, tail swishing too and fro. The small white alien cat, also known as Incubator by others, has recruited many a Puella Magi to fight the witches to provide energy to prevent the entropy of the universe.<br>\r\n<br>\r\nAnd while he trawled the city tops, he saw some adds, about 'unlimited energy' or 'green energy cars' and what not.<br>\r\n<br>\r\nAnd it got the emotionless alien being thinking.<br>\r\n<br>\r\nPuella Magis had to supply Grief Seeds into their Soul Gem for energy for not only themselves to prevent themselves, from becoming witches, but also for preventing the collapse of the known universe.<br>\r\n<br>\r\nBut this unlimited energy, and replenishable energy...why didn't he and his kind think of that!! <br>\r\n<br>\r\n\"Interesting~\" cooed Kyubey as he darted through alleys and hopped roof tops and found himself overlooking a gas station. The white alien cat saw cars being refueled as they pulled to and fro.<br>\r\n<br>\r\nPuella Magi need Grief Seeds to sustain their Soul Gems, or they become witches.<br>\r\n<br>\r\nCars need gas to keep moving, or else they don't go.<br>\r\n<br>\r\nBut what if there was a way to maximize energy output, and change the system so that...<br>\r\n<br>\r\nAnd then there was the energy provided by the Seeds and Soul Gems, and if they had bigger cars, they needed more gas. And if the cars keep getting refilled, they can still keep moving.<br>\r\n<br>\r\nSo if the Puella Magi were bigger, they would provide a steady output of energy if they were at a larger mass and had much more energy within them.<br>\r\n<br>\r\nAs the humans say:<br>\r\n<br>\r\n\"Eureka.\" <br>\r\n<br>\r\nAnd Kyubey vanished, preparing to change the system of Puella Magi's. For good.</span></div></div>",
            "created":1364619600,
            "id":1560469,
            "title":"Grief Seeds, more like Gaining Seeds!"
        },
        "131":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "A quiet breakfast is had, the pair bonds.",
                "Perhaps switch tracks to a mysterious youth?",
                "Free choice!"
            ],
            "content":"<div class=\"\"><div> <span>The morning sun was bright in the sky as various people went about with their busy days. A certain black haired girl walked down the sidewalks making her way to her school. Now this wasn't some regular high school aged girl, Homura Akemi was quite special in many ways. The first was that she was a bonafide magical girl, a being who hunted witches as a profession at the risk of being turned into a witch herself. Second was that she had a particular set of abilities, one that made her a formidable opponent. Her specialty was 'time stop' and the girl fancied using fire arms and explosives as her main weapons. Due to the nature of her time travel abilities, she had been jumping in and out of a variety of timelines in order to prevent a dire fate from occurring. Though she has failed countless times already and her emotions had been rather squandered as of late. There was one thing in her mind that fueled her resolve, which was to see Madoka Kaname in a happy future. The trip to school was rather uneventful, what with witches being somewhat scarce this early in the timeline. Reaching the gates of the prestigious school, the cold girl ignored all of the students who attempted to communicate with her. She followed her routine as usual, heading to her shoe locker and putting a few things away and then the girl went to the cafe to have herself a little breakfast. It was the most important meal of the day after all!  <br>\r\n<br>\r\n'To maximize my metabolic production, I should order a simple egg sandwich with a bottle of orange juice.' thought the girl as she headed towards the grill. Tuning out the chatter, she focused herself just in case a new witch would make itself known to her. Due to this, she failed to notice a certain pink haired girl walk up to her and wish her a good morning.<br>\r\n<br>\r\n\"Hi there Homura, how are you doing?\" asked the ever innocent Madoka Kaname with a bright smile and shining pink eyes. Trying her best to distance herself from the girl, she didn't want to respond but seeing such clear eyes made the poor girl remember all of the good times she had spent with Madoka in previous timelines. Perhaps a simple breakfast with her wouldn't hurt?<br>\r\n<br>\r\n\"I am doing fine. Perhaps you would like to join me for breakfast?\"</span></div></div>",
            "created":1364706000,
            "id":1561302,
            "title":"The Start of it all"
        },
        "1311":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Sayaka Miki, Madoka's friend.",
                "That god damned Kyubey...invisible to Madoka's eyes."
            ],
            "content":"<div class=\"\"><div> <span>Madoka blinked, then smiled. \"Of course! I'd be happy to Homura!\" She got up and walked up to her table, sitting down with that same kind smile.<br>\r\n<br>\r\nHomura simply sipped her juice eyes closed with a calm composure. She opened an eye to see Madoka's bag gone. A turn of her head showed that the pinkette was in the cafe line. Nodding, the Time manipulator had a meager bite of her sandwich.<br>\r\n<br>\r\nFor some odd reason, she felt oddly hungry today as she finished her egg sandwich. And it put Homura on edge.<br>\r\n<br>\r\nShe didn't recall being hungry like this in the prior timelines.<br>\r\n<br>\r\n'What could this be?' Pondered the dark haired girl. 'I couldn't be this hungry today can I?' She thought as she scratched her side. She looked down.<br>\r\n<br>\r\n\"Huh. That's odd.\" It appears that her skirt seems to be, by the tiniest of margins, a bit bigger.<br>\r\n<br>\r\nHer mind sharp and calculating, the girl deducted that she must have losed some weight on her way here to school. But simply walking? That shouldn't be possible.<br>\r\n<br>\r\nIt didn't help that even after chugging her OJ she felt concern. What if this was another of Kyubey's tricks! Or a witch maybe nearby and is hidden extremely well! The possibilities ran through Homura's mind.<br>\r\n<br>\r\nSeeing the line still freed up, the dark haired girl sighed as she stood up and walked to where Madoka was in line at the cafe counter. The kind pinkette noticed.<br>\r\n<br>\r\n\"Hungry Homura?\" Asked Madoka with the same kindness.<br>\r\n<br>\r\n\"I had a light breakfast this morning and little dinner,\" Homura replied bluntly. \"Just having a craving or two is all. What are you going to get Madoka?\"<br>\r\n<br>\r\n\"Well...\" She put a finger to her lips. \"I suppose a muffin wouldn't hurt, although they do look  a bit big...oh well.\" She shrugged. \"I'll manage.\"<br>\r\n<br>\r\nHomura remained silent.<br>\r\n<br>\r\nUntil she heard a familiar voice pop up behind her.<br>\r\n<br>\r\n\"Yo.\" And the dark haired girl turned, eyes narrowed at...</span></div></div>",
            "created":1364792400,
            "id":1562674,
            "title":"A quiet breakfast is had, the pair bonds."
        },
        "13111":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "Let's get this one...",
                "Let's get all them"
            ],
            "content":"<div class=\"\"><div> <span>A blue haired girl had entered the vicinity, that girl being Sayaka Miki. A rather large pest for Homura, as she tended to stir up trouble with her affairs, often manipulating the way Madoka acted, with Sayaka's constant interactions with a certain other magical girl. Homura had also noticed how no matter what Sayaka was always doomed for failure, always becoming her problematic witch form regardless of what happened in the timelines. The current Puella Magi was certain her fate would be no different in this timeline.<br>\r\n<br>\r\n\"Hey Madoka, good to see you!\" Sayaka beamed brightly at her close friend, before losing her smile as she turned to the other girl present. \"Hello Homura...\" Another odd thing Homura had noticed that was Sayaka never seemed to trust her, always giving her grief for her actions. She didn't let this bother her, after all she wasn't someone who she was trying to save.<br>\r\n<br>\r\n\"Oh, hi Sayaka! Me and Homura were just thinking of getting some muffins.\" Madoka gestured over to them, still thinking about which kind they could get.<br>\r\n<br>\r\n\"Count me in on this! I could use an extra morning snack.\" Sayaka made her way over and looked at what there was on the display areas, the sweet treats all there for viewing.<br>\r\n<br>\r\n\"How about blueberry?...wait there's raspberry too....and a honey one as well!\" The blue haired girl was carried away as she began to eye up all the muffins that were there. She clasped her hands looking at them, thinking of the flavours that she would taste. Madoka looked on a little confused and overwhelmed by the choice.<br>\r\n<br>\r\n\"Goodness....so many choices....what do you think Homura?\"<br>\r\n<br>\r\nLooking at what there was, as well as taking what Sayaka said into consideration, she replied...</span></div></div>",
            "created":1364878800,
            "id":1563423,
            "title":"Sayaka Miki, Madoka's friend."
        },
        "131112":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Homura tells her.",
                "Homura's growling tummy buts in. Curse this hunger! This never happened before!"
            ],
            "content":"<div class=\"\"><div> <span>\"Ehhh!! All three of them?\" Asked Madoka with wide eyes. Homura simply shrugged.<br>\r\n<br>\r\n\"You only live once.\" Homura's eyes went to the bluenette leaning on her shoulder with a goofy grin.<br>\r\n<br>\r\n\"Nice philosophy there Akemi!\" She said heartily. \"Never put it in that perspective.\" She had one of each in her bag.<br>\r\n<br>\r\n\"Get off me.\"<br>\r\n<br>\r\n\"Okay! Ummm...\" Madoka blushed as she ordered three muffins into a paper bag and paid the cafe waitress. \"So then,\" She turned towards her two friends as they returned to their seat. \"So after class, you all busy?\"<br>\r\n<br>\r\n\"Free all day!\" Grinned Sayaka.<br>\r\n<br>\r\n\"Depends,\" coolly replied the dark haired girl. \"Also Madoka,\" She gestured a finger to bring her closer. She had to tell her to stay the way she is, and not change.<br>\r\n<br>\r\nFor if she does not...she will lose everything.<br>\r\n<br>\r\n\"Eh? What's up Homura?\"</span></div></div>",
            "created":1364878800,
            "id":1563443,
            "title":"Let's get all them"
        },
        "1311122":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "Hunger satisfied! And fast too!",
                "More muffins for Homura!"
            ],
            "content":"<div class=\"\"><div> <span>As the stoic Puella Magi was about to open her mouth, a faint rumblings of her stomach began to increase. They had been a cause for concern already, but now they were interfering with her plans. The growls were not just audible to Homura, as Madoka stared down at her stomach, wondering if it was her own internal systems signally hunger to her.<br>\r\n<br>\r\n\"No problem, I can still do this.\" Homura thought, as she ignored the grumbles and continued. \"Madoka....do you trea-\" It was then a sharp jolt of digestive pain hit Homura in the stomach, causing her to clutch her abdomen with one hand. She slightly winced, hiding her anger behind her blank expression. \"Damn....there's no way I can continue like this. I'll need to eat....what it all means I'll need to find out fast!\"<br>\r\n<br>\r\nFacing her pink haired friend once more, she changed her statement to fit the situation now. \"Madoka, do you mind if I have one of the muffins?\"<br>\r\n<br>\r\n\"Huh? Oh..ah..no problem!\" She handed the bag to Homura. \"Just take whichever one you want!\"<br>\r\n<br>\r\nNot picking a muffin by her own choice and just selecting one at random, Homura thanked Madoka and began to eat, Sinking her teeth into the muffin, which happened to be the blueberry one, Homura thought carefully on what the increased hunger could mean.<br>\r\n<br>\r\n\"Surely if this was Kyubey's doing, he'd have some kind of reason behind it all.....I doubt he'd purposely fatten me up just for kicks.\" As she continued to eat, Homura was unaware of just how fast she was wolfing down her muffin...</span></div></div>",
            "created":1374296400,
            "id":1631360,
            "title":"Homura's growling tummy buts in. Curse this..."
        },
        "13111222":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Well enough of that, onto school!",
                "After school, Homura confronts Madoka to stop being a Puella Magi"
            ],
            "content":"<div class=\"\"><div> <span>Homura wolfed down the muffin like it was no problem, and then reached back into Madoka's bag and grabbed another, this time a banana nut muffin. The pinkette took notice but allowed it.<br>\r\n<br>\r\nThen Homura took another. Then another. And another.<br>\r\n<br>\r\n\"Oui oui, Akemi,\" toted Sayaka, pointing at the black haired girl. \"You're not gonna leave any for the rest of us at this rate.\"<br>\r\n<br>\r\nHomura turned her attention towards Sayaka eyes hard and looked down at her hand, then next to it the several muffin wrappers. Sayaka was right, she was stuffing her face!<br>\r\n<br>\r\nEmbarassed, the black haired girl scarfed down her last muffin and looked away, blushing. \"S-Sorry Madoka...\"<br>\r\n<br>\r\n\"It's okay Homura!\" Said Madoka, putting a hand on Homura's shoulder. \"You must have been starving!\" She then gasped. \"Oh no Homura! Don't tell you're doing those radical diets right?\"<br>\r\n<br>\r\n\"Radical diets?\" Asked Sayaka and Homura at once.<br>\r\n<br>\r\n\"You know, those diets where you never ever eat or you eat and then throw up?\" Said Madoka, pointing a finger up in the air as she explained.<br>\r\n<br>\r\n\"Ummm...I believe you're mentioned Bullimia and Anorexia,\" commented Sayaka.<br>\r\n<br>\r\nHomura shook her head, face stoic once more. Deep down however, she was touched by Madoka's kindness. It was something that never changed and it is what spurs her on to save her, no matter what. \"Thank you but no, I am just...feeling more peckish than usual.\"<br>\r\n<br>\r\nShe lowered her hand to her lap, and felt the small bulge that was her stomach, filled with the egg sandiwch and muffins. The pain was gone at last.<br>\r\n<br>\r\n'This never happened in the previous timelines. What went wrong?' She thought.</span></div></div>",
            "created":1374382800,
            "id":1631825,
            "title":"More muffins for Homura!"
        },
        "131112221":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Homura restrains herself!",
                "She can't help it, Homura needs to eat!"
            ],
            "content":"<div class=\"\"><div> <span>School continued on like a normal affair, each student gathered in their classrooms and took their seats. Homura sat down at her desk, making sure to keep an eye on Madoka from time to time. As the lesson began, Homura found herself becoming quite bored. It wasn't that she disliked learning, it was that she had already gone through this lesson multiple times in other timelines with little variation. If anything, she could have easily taught the class! Finding boredom overtaking her, the black haired girl began to doodle in her notebook. She drew stick figures of herself and Madoka, a small Kyubey and eventually the rest of their friends having fun. It was childish, but the girl thought they were cute. Soon, her thoughts began to drift once more, this time of food. She had no idea why, but she was imagining herself devouring meal after hearty meal. From cakes to ramen noodles, she wanted them all! This trance of hers was broken by Madoka approaching her desk and calling out her name.  <br>\r\n<br>\r\n\"Um, Homura? Are you feeling okay?\" asked the pink haired girl, quite concerned for her friend. It wasn't like the stoic Homura to daze out like that. Quickly shaking her head, the other girl regained her composure.<br>\r\n<br>\r\n\"Oh hello Madoka. Sorry, I just spaced out for a second.\"  <br>\r\n<br>\r\n\"That's fine! Its break time now, do you want to go grab some lunch?\" With a nod, the black haired girl fixed up her desk and left with Madoka. Next was to find Sayaka as she often joined them as well. Reaching her classroom, Madoka quickly went in to pick up the energetic girl as she left Homura to wait outside. Earlier thoughts rushing back to her, and she began to feel quite famished for some reason. <br>\r\n<br>\r\n\"Hey there Homura?\" greeted the blue haired girl as she exited the classroom alongside Madoka. Homura greeted her back and the trio walked towards the cafeteria.<br>\r\n<br>\r\n\"Oh, I hope they have strawberry cake for dessert today! I've really been craving some lately.\" As the school was quite prestigious for the area, the cafeteria catered to multiple tastes as they served food of all types of cuisine. From American to traditional Japanese, everyone could usually find whatever suited them best. Arriving at the room, it was still quite sparse, but it was always a wise idea to save seating. <br>\r\n<br>\r\n\"You two go get food, I'll save us some seats.\" said Sayaka, sitting down at a nearby table. Homura followed Madoka into the Italian section of the lunch area, with a strong thought in her mind.<br>\r\n<br>\r\n'I want to eat all of this!'</span></div></div>",
            "created":1375333200,
            "id":1638486,
            "title":"Daydream Desires"
        },
        "1311122212":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "During class, Homura is out of it!",
                "The hunger persists..."
            ],
            "content":"<div class=\"\"><div> <span>Unable to control such desires, Homura silently gathers as much food as she could on her tray, making sure to not alert her pink haired friend. She would die of embarrassment if Madoka caught her in the act! The black haired magical girl loaded various types of pastas, garlic breads and chicken parms. Slowly making her way towards the drinks station, she poured herself three glasses, filled to the brim with sugary juices. Balancing the tray, Homura made it back to the table, Sayaka seemingly shocked at the amount of food she had.<br>\r\n<br>\r\n\"It seems that someone is a hungry girl.\" snickered Sayaka. With a small blush, Homura sat herself down and began to eat.  Sayaka was a bit confused on how the other girl was wolfing down her food, but she paid it no mind. Sometimes, people just needed to eat. As the table was now safe from other students, she stood up and went to get some food for herself. Soon Madoka walked by and sat down next to Homura, having gotten herself a rather meager meal. The pink haired girl always had a small appetite. As she ate, the girl watched as Homura ate bite after bite. Madoka was quite glad as she always felt that her friend always ate too little. She began to chat with Homura who would only give grunts in return as she continued with her meal. Sayaka eventually returned, getting herself a hearty japanese meal. Eventualyy, Homura began to drown out all other noises, her focus solely on the food in front of her. Her pace increased with every heavy mouthful, each succulent taste, she simply wanted more. This trance of hers ended when her tray was completely empty, not even a crumb surviving the feast. Her stomach now rigid, she had an overwhelming desire to lean back in her chair and nap, having tired herself. Seconds later, Homura felt a sharp tinge from her midsection and let out a yelp in discomfort. <br>\r\n<br>\r\n\"Homura! Are you okay?\" asked Madoka in a nervous tone, her eyes glowing with concern.  Waving her arms in front of her, the black haired girl did her best to show that she was fine.<br>\r\n<br>\r\n\"I'm alright Madoka, it's just a bit of gas. It seems that I ate a little too quickly.\" stuttered Homura, her face turning a soft shade of red. Sayaka wasn't concerned in the slightest as she just chalked it up as Homura being weird like usual. Having accepted her answer, Madoka went back to her own meal, still worried for her friend however. Homura sat there, trying to figure out why such a pain jolted through her system.<br>\r\n<br>\r\n\"Is this another one of Kyubey's doings?\" she wondered as she felt her mouth water once more.</span></div></div>",
            "created":1375678800,
            "id":1640496,
            "title":"Friendly Feast"
        },
        "13111222121":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "What do Madoka and Sayaka do after school?",
                "What does Homura do after school?"
            ],
            "content":"<div class=\"\"><div> <span>Lunch had ended only recently, sending everyone returning to their classes for the rest of the school day. Homura slouched groggily as she walked back to the classroom, her stomach stuffed with the hefty meal she had just consumed. Despite all this, her belly was still ravenous, grumbling and groaning in pleas to have more food devoured for it's pleasure. The seasoned magical girl could only ignore it's cries and shrug off the occasional hunger pangs as she knew there were more pressing matters at hand.<br>\r\n<br>\r\nPractically falling back onto her seat in exhaustion, Homura noticed the concerned eyes of one Madoka Kaname still fixated onto her. She had already expressed her worry for Homura several times during the day, noticing the strange behaviour the hunger was having on her. Madoka tended to have an annoying but unintentional habit of making things complicated whenever she interfered, which was something Homura did not like in the slightest. Her pink haired friend's kind hearted nature always brought the worst misfortune in every timeline, spurring the mostly stoic girl to try and avoid the situation at all costs. So far, she hadn't been able to steer the good intentions of her friend away.<br>\r\n<br>\r\n\"Sayaka, do you think Homura will be okay? She must have some kind of stomach bug with the way she's acting....\" Madoka asked her blue haired companion.<br>\r\n<br>\r\n\"Hey, you shouldn't worry there Madoka! The girl's got a good meal in her belly, that always fixes a stomach bug!\" Sayaka smiled, giving a thumbs up of reassurance.<br>\r\n<br>\r\nThe class begun it's studies soon after. Being a mathematics lesson, there wasn't too much to be excited about. Everyone wrote down their sums, read their books and listen to their teacher, or at least listened to her when she wasn't ranting about her personal life.<br>\r\n<br>\r\nAt first, it seemed everything was alright for Homura. Her stomach had calmed down, the growling reducing over time. She heaved a sigh of relief, hoping it was the last she'd suffer of the strange hunger. Sadly, it was only a calm before the storm.<br>\r\n<br>\r\nWhile listening into to what she was being taught, the hunger pangs begun again. But not just any kind, this was a massive one. The moment it hit her stomach, Homura froze in place. She dropped the pen she'd been holding, her eyes widening. Her entire belly felt like it was on fire, it was an intense pang.<br>\r\n<br>\r\nThat moment, Homura didn't just feel hungry. She felt starving. She felt like she hadn't eaten in days. Still frozen there, her mind was washed away. All other thoughts escaped her, soon to be replaced by new ones. That's when she began to think again.<br>\r\n<br>\r\nHomura thought of all the food she wanted to eat. She was famished, she'd have anything. To think about everything that she could be eating right then, it was a banquet of the subconscious for her. Homura thought back to the lunch break, all the food she'd eaten. The pasta she'd demolished, the bread she'd inhaled, the chicken she'd devoured, the drinks she chugged. What she would give to eat that all again.<br>\r\n<br>\r\nIt only got worse, as her mind began to tease her ever so. The chicken parm in her thoughts marinaded in rich sauces. Seas of red lathered the meat and coated it's golden skin. It filled it's entire plate, bubbling with warmth and flavour. The portion looked enough to feed an entire family, but Homura wanted it all. Before her, the breads materialised and dipped themselves into the sauces. Drops fell from the sopping wet bread, the garlic mixing with the taste of the sauce. A pasta side dish, just as big as the plate joined it's side, a valley of steaming Italian delights caked with melted cheese and succulent ham. She swore she could smell the aromas the meals were giving off, only making her mind race even more.<br>\r\n<br>\r\nThe classroom didn't register. The people around her didn't register. Nothing what was being said was close to sinking in. All that was present to Homura was the foods of her dreams. She wanted to gorge herself on the food in her mind. She wanted to cram her face full of the treats in her thoughts. She would stuff herself forever more if she could. Hunger controlled her.<br>\r\n<br>\r\nThat is, until a hand grabbed her shoulder. As quick as it started, Homura's food fantasy was ended abruptly by the partially concerned and partially annoyed teacher.<br>\r\n<br>\r\n\"Miss Akemi, I was asking you to help us with the problem on the board. Are you feeling well?\"<br>\r\n<br>\r\nBack to reality, the pangs died down. Homura cleared her mind and responded quickly. \"I should be fine, thank you.\" Shaking off the event as best as she could, she walked up to the board and picked up the whiteboard pen.</span></div></div>",
            "created":1376110800,
            "id":1643510,
            "title":"During class, Homura is out of it!"
        },
        "131112221211":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Back at Mami's apartment",
                "Homura's withdrawal "
            ],
            "content":"<div class=\"\"><div> <span>After the last bell of the day, the black haired time traveler bolted out the door, much to the surprise of everyone in the classroom. Madoka worried about her as usual, but Sayaka explained that she must have been exhausted and needed to rest back at her home. Since their exams weren't for a bit, Sayaka and Madoka decided to head to the local mall to do their usual, browse for cute clothes, listen to pop music and get a bite to eat at the cafe, the works really. The trip to the mall was rather mild, filled with idle chit chat and Madoka worrying her little heart out over Homura's recent issues.  When they arrived, both girls headed towards the cafe for a small snack and then they headed towards the cd store. It was usually packed, filled with customers looking for the newest popular single and other types of media. Walking over to one of the sample display stands, Madoka placed one of the headphones onto her pink head and selected a track. Soon, the catchy music played in her ears and she bopped her head with the beat.  <br>\r\n<br>\r\n'Maybe I should get this one.' thought the girl as the song continued. Taking off the headphones, she looked around for Sayaka, who was browsing the dvd section. Satisfied to know that her friend was still near, she placed the headphones back and was about to select a second song when a strange noise blasted through her head.<br>\r\n<br>\r\n'Help me!' was what the girl heard as she frantically looked around for trouble. Seeing nothing wrong in the store, the voice continued to plead, causing the good hearted girl to run out of the store in search of this mysterious individual. Seeing that Madoka was running away, Sayaka frantically ran after her. Eventually the pair found themselves in a section of the mall under construction and closed off. Madoka ignored the warning signs and ran right it, a highly confused Sayaka tailing her. Soon, the pink haired girl found the source of the voice, which was a strange white cat-like creature. Before she could approach it, Sayaka grabbed her by the shoulders, giving both of them a chance to catch their breaths. <br>\r\n<br>\r\n\"Madoka, what the hell are you doing!\"<br>\r\n<br>\r\n\"Someone was calling for help, I couldn't just ignore them!\" shouted back the girl, raising her voice for once.  Before Sayaka could retort, a strange mist surrounded the two, causing them to feel incredibly disoriented. Eventually, the area changed into a more fantastic setting ,with swirling colors, strange creatures and a heavy air. <br>\r\n<br>\r\n\"W-What's going on?\" question Sayaka as she put herself in front of Madoka, in an attempt to protect her from the strange creatures parading around in front of them. They were small creatures, with heads resembling pieces of cotton and small stalk like bodies and legs stemming from a butterfly like structure. They hopped around and carried scissors around menacingly.  They stopped prancing and focused all of their attention on the pair and rushed in, aiming for the girls' heads. Madoka let out a scream and closed her eyes and then she heard a gunshot, similar to a musket. Slowly opening her eyes, Madoka saw a figure in front of them, who looked to be a very heavy set girl. Quickly shooting two other creatures, she twirled around the greet the two.<br>\r\n<br>\r\n\"Oh hello, let me take care of this little problem so I can greet you two properly.\" said the mysterious individual. Getting a good look at her, she had blonde hair that cascaded into twin curls. Her outfit consisted of a strange attire and considering her weight, it fit quite snug on her. Madoka would have guessed that her savoir weight around two hundred pounds. From top to bottom, she had fat bulging from a plethora of places and was well padded in certain areas. Her thighs were thick, strong enough to effectively kick one of the creatures, but soft enough to jiggle with the motion. Her gut was being restrained by the corset she wore around her middle, the brown piece of clothing straining to remain in place, and small bubbles of her gut fat attempted to bulge through the fastenings. Going further up, this young girl had rounded breasts that dropped down to rest on the very top of her belly, and were the biggest that the pink haired girl ever seen. Miraculously. they only bounced around as much as the rest of her fat, giving a very misleading appearance.  Her arms where chunky, her upper arms incredibly fleshy and her forearms looking like tubes filled with soft fat. On the very top of her head, she wore a cute black beret with a small amber brooch attached to the side and made her chubby face look even cuter. As with out effort, she danced around the enemies, using her kicks and shooting dozens of muskets. Eventually the enemies would be wiped out and the subspace disappeared.  Letting out a reliving sigh, she turned to the two girls, a sympathetic expression on her rounded face.<br>\r\n<br>\r\n\"Looks like I have a lot of things to explain huh? <br>\r\n</span></div></div>",
            "created":1377493200,
            "id":1652089,
            "title":"Miraculous Mami"
        },
        "1311122212111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "They enter Mami's apartment, cue a nice big tea&cake party",
                "Back to Homura. What's wrong with her?"
            ],
            "content":"<div class=\"\"><div> <span>Madoka and Sayaka could only gawk. How can anyone be so strong and nimble, yet be so fat at the same time! Talk about Acro-fatic indeed. Yet despite her hefty physique she carried herself with elegance and showed no problem with her large size.<br>\r\n<br>\r\n\"H-How did you do that!\" Gasped Sayaka pointing a finger at the blonde. \"I mean, where did those monsters come from, how were you able to kick them away and shoot them away like some professional marksmen!\"<br>\r\n<br>\r\nThe plump blonde giggled, a hand going to her lips. \"One at a time, one at a time. What say I answer your questions in a more...private place? Come, my home is not too far from here.\" She walked forward, and gave a small curtsey, revealing her thick thighs a bit. \"My name is Tomoe Mami. It is a pleasure to make your acquaintance.\"<br>\r\n<br>\r\nMadoka bowed back in respect. \"K-Kaname Madoka. And this my friend Miki Sayaka...\" The bluenette bowed as well before crossing her arms over her small chest.<br>\r\n<br>\r\n'Lord they're huge.' She thought to herself as she looked at Mami's rather large bosom. Mami simply smiled and then began to glow in a radiant light. Gone was her corset and hemmed skirt, but in it's place was a very similar school uniform.<br>\r\n<br>\r\n\"Ehhh!\" Sayaka said in surprise. \"You go to your school!\" <br>\r\n<br>\r\n\"Well...in a way.\" Replied the blonde scratching her cheek a little. \"Anyways, come, let us head to my home. I can make some tea!\" The plump blonde led the way as Madoka and Sayaka followed.<br>\r\n<br>\r\nAs the girls rounded a corner, Kyubey popped out from behind a trash can.<br>\r\n<br>\r\n\"Hmmm...perfect,\" he said to no one in particular. \"It appears Mami is much stronger now with her new size, and the energy influx at this rate will surpass the sudden bursts of the old ways.\"<br>\r\n<br>\r\nPatience is a virtue, a human saying Kyubey understood. Thanks to Mami's constant hunting of monsters and witches, the girl has gotten larger and meatier with fat. The energy conversation method slowly ate away at her weight at about one to two pounds a day, making for a total energy loss of seven to fourteen pounds a week, and anywhere between twenty-eight and fifty-six pounds a month. In order to be not turned into a witch, Mami needs to both collect the Seeds and do as most humans do.<br>\r\n<br>\r\nEat. Eat lots and lots of food. Having a food baby a day stuffing so ridiculously to gain at a faster pace than the energy would take away the weight. The Seeds are instant gainers, the food the ole fashioned way.<br>\r\n<br>\r\nPerhaps Mami could do more than just the serve the girls tea. He trotted down the path where the girls walked, intent of introducing himself to the two new possible recruits to his quest of saving the universe.<br>\r\n<br>\r\nNot that they need to know though~<br>\r\n<br>\r\n-X-<br>\r\n<br>\r\nMami walked down the hallway leading to her apartment door, wider hips swaying as the two as she opened the door with a set of keys. She fuddled around with the jingling keys.<br>\r\n<br>\r\n\"Hmmm...which one was it again?\" She pondered as she slightly wiggled her bum as she tried to find the right set of keys. Sayaka and Madoka could only blink.<br>\r\n<br>\r\n'I wonder how Homura-san is doing...' Thought the pinkette</span></div></div>",
            "created":1377666000,
            "id":1653125,
            "title":"Back at Mami's apartment"
        },
        "13111222121111":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "Let's see what Homura is up to!",
                "To the next morning!"
            ],
            "content":"<div class=\"\"><div> <span>Thick sausage fingers twiddled with a pair of keys, with one of the many keys eventually fitting into the tiny lock. With a twist of the key and the turn of a handle, Mami swung open the door of her apartment, just barely fitting through the door frame.<br>\r\n<br>\r\n\"Welcome to my apartment!\" She beamed, her cheeks puffing up as she smiled. \"Please, make yourself at home!\"<br>\r\n<br>\r\nNot wanting to keep their saviour waiting, Madoka and Sayaka stepped inside and marvelled at the showcase before them. Mami's home was a very pretty sight, filled with soft carpets and rugs that looked of high quality. Decorations littered the walls, along with many stylish tables, ranging from quality wood to sleek glass. Along with several chairs, there was a couch near one of the walls too, complete with a floral pattern present on the seat. There were several other areas to the apartment which could be seen, such as a bedroom and a bathroom separately. However, the two girls could clearly see the very sizeable kitchen as part of the main living space. At the time, Mami had shut the door behind them and was currently rummaging around the kitchen area, collecting many plates and cups in her hands.<br>\r\n<br>\r\n\"Just take a seat at the largest table over there!\" Mami pointed towards a table by the window, a lace cloth draped over the surface. \"I hope you don't mind on kneeling, it isn't a very tall table.\"<br>\r\n<br>\r\n\"Oh, it's not problem Mami, not at all!\" Madoka replied quickly, kneeling at one end of the table along with Sayaka.<br>\r\n<br>\r\nThe duo of friends looked on as their hefty acquaintance began placing the plates and cups onto the table, three plates at each end for all of them, along with cups for all plus other plates in the centre of the table. This was followed by a teapot, steam billowing out from the spout which indicated the piping hot tea brewing inside. Mami bent over and began pouring fresh black tea into each cup, her grand chest being weighed down by gravity as she did. This was soon followed by the main attraction, Mami bringing over several plastic cases filled with cakes. She carefully opened them up and placed the many cakes onto each centre plate, flakes and sauces of each treat falling to the surface of the plates. She took a long knife and sliced the sponge treats into portions, also providing forks for herself and the other girls.<br>\r\n<br>\r\n\"Please, eat to your heart's content! The cakes before you are Lemon, Coconut, Blueberry and Cinnamon.\"<br>\r\n<br>\r\nWith the delicious looking food before them, Madoka and Sayaka acted. Taking slices of their own personal taste, Mami had her own too. Each forkful that passed her plump lips cause an audible approval from the magical girl.<br>\r\n<br>\r\n\"Wow, this tastes great!\" Sakaya exclaimed. \"You must eat like this every day!\"<br>\r\n<br>\r\nMadoka quickly joined on the end, wanting to avoid offending Mami over her size. \"Ah! I think Sayaka meant to say-\"<br>\r\n<br>\r\n\"No need to worry Madoka, your friend meant no offence in saying that.\" Mami waved a pudgy hand up as a sign of calmness. \"Besides, in my current position eating like this is crucial.\"<br>\r\n<br>\r\nMadoka and Sayaka swapped confused looks. \"I see this is a good time to answer your queries.\" The yellow haired girl bobbed a drill around. \"I am what is known as a Magical Girl. Yes, the same kind you see in Anime and Manga. My job is find and hunt Witches, evil creatures who feed on the souls of the innocent.\"<br>\r\n<br>\r\n\"Woah, you mean we were attacked by a Witch?\" Sayaka questioned.<br>\r\n<br>\r\nMami shook her head. \"Thankfully no. You were only attacked by familiars. They are by-products of Witches, living only to kill on their behalf. If you were attacked by a Witch, it would have been much more dangerous.\"<br>\r\n<br>\r\nThis was followed by Mami taking an object from her pocket, showing it to the girls. \"This is a soul gem, the sign of a magical girl. It shows we've made a contract to fight these witches. It is also a sign of our powers, our magic.\"<br>\r\n<br>\r\n\"Magic?\" Madoka questioned curiously. \"How does it work?\"<br>\r\n<br>\r\nA thick arm reached over to the side, reaching to take another object. Once collected, it was too shown to Madoka and Sayaka.<br>\r\n<br>\r\n\"Hey, it's a photo!\" Sayaka observed. \"It's you, but you're way thinner!\"<br>\r\n<br>\r\nMami giggled. \"Yes, this used to be me. Before I became a magical girl. The reason my soul gem shines this bright is due to my weight. As strange as it seems, Magical Girl powers are based around how fat you are. When you first become a Magical Girl, it's important to gain weight as fast as you can.\"<br>\r\n<br>\r\n\"Huh, weird.\" Sayaka added yet again. \"So that explains this huge spread.\"<br>\r\n<br>\r\n\"Yes, it's important to maintain a large diet.\" Mami responded. \"Magical Girls slowly lose weight over time, meaning constant eating is necessary. Not to mention using your magic excessively will also drain your weight. Plus, the thinner you are, the weaker your powers become. It puts you in grave danger to lose too much weight. If you lose too much, your soul gem turns black. You'll starve to death.\"<br>\r\n<br>\r\n\"Wow, this must be quite serious...\" Madoka sounded worried.<br>\r\n<br>\r\nMami smiled in return. \"It's nothing too much to worry about if you can keep it under control. By defeating Witches, you'll earn grief seeds. While they are Witch eggs that can hatch, they can be used to instantly gain weight, as well as being rendered harmless if disposed of properly. As long as you dispose of them safely, they are of no threat!\"<br>\r\n<br>\r\n\"Say, you've told us all about being Magical Girls, how do you even become one?\" Sayaka pondered. \"You mentioned some kind of contract?\"<br>\r\n<br>\r\n\"That's where I come in.\" A voice sounded from the window, which Madoka recognised. That instant, a white cat like creature leapt into the room, right onto Mami's lap.<br>\r\n<br>\r\n\"Hey, I know that voice!\" Madoka shouted. \"It was the same one that called for help!\"<br>\r\n<br>\r\n\"Yes, that was me.\" The strange creature replied. \"I am Kyubey. My job is to make contracts, to help people become Magical Girls.\"<br>\r\n<br>\r\n\"He's right you know.\" Mami added, stroking his head. \"Kyubey came to me at a time of need, providing me one wish in return of being a Magical Girl.\"<br>\r\n<br>\r\n\"A free wish? Sweet deal!\" Sayaka looked on eagerly.<br>\r\n<br>\r\n\"Yes, any wish you like. Saving lives in exchange for one wish is good, let me tell you.\" Kyubey stared back with deep red eyes. \"If you two intend on being Magical Girls, I suggest eating the meal before you as a good head start on gaining your weight..\"<br>\r\n<br>\r\nMami patted Kyubey's head once more. \"Steady on now Kyubey, these girls have only just found out! Maybe they should hang around with me when I'm on Witch patrol, then they can make up their mind.\"<br>\r\n<br>\r\n\"That sounds great! Don't you think Madoka?\"<br>\r\n<br>\r\n\"Well, Mami will protect us, so I don't see a reason not to...\" Madoka replied, less worried about the concept than before, but it still lingered.<br>\r\n<br>\r\n\"It's settled!\" Mami clasped her hands together. \"After school, we'll meet up and I'll show you both the ropes! But first....\" She picked up a forkful of cake and ate once more. \"Let us finish our delicious meal, shall we?\"<br>\r\n<br>\r\nAgreeing to the statement, all three girls happily ate and drank the spread Mami had made. With the added enthusiasm from the talk about Magical Girls, not a single drop or crumb was left. Once finished. the three girls parted ways for the day.</span></div></div>",
            "created":1377666000,
            "id":1653342,
            "title":"They enter Mami's apartment"
        },
        "131112221211111":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Homura finds herself eating more often, does it show?",
                "A mysterious intruder that night."
            ],
            "content":"<div class=\"\"><div> <span>While Madoka and Sayaka were having their own adventures, Homura staggered home, her mind in a haze and her body quite weak. She had to resort to using her time stopping powers at time to save herself from accidents that she would cause. Soon, she stumbled home, the open white space that was her apartment that suffered from a lack of decor and had a rather 'cold' atmosphere to it. In the living room, all that was present was a round couch along with numerous displays that told Homura much about the current timeline and other info she had gathered during her time looping.  She threw herself onto the couch, her breathing heavy and rapid. Placing a hand towards her forehead, the black haired girl could tell something was incredibly wrong. Ever since that lunch earlier in the day, she had felt a hunger, a deep hunger that she couldn't satiate no matter how much she consumed. As of now, it felt as if there was a black hole in her middle and she felt an overwhelming need to eat something, anything! However, Homura could tell that this was the work of something incredibly sinister.<br>\r\n<br>\r\n\"N-No, I-I can't give into what he wants, Madoka would be in danger again!\" said the girl in pain, struggling and flailing on top of her couch. She continued this on for a few minutes before feeling her mind dive into a blank and staggered into a standing position. Slowly shuffling towards her plain kitchen, Homura was running on instinct and it was screaming at her to close up the hole she felt in her stomach. The drowsy girl slowly opened up her fridge, revealing a less than impressive spread of food. Homura would usually keep the bare minimum when it came to eating at home, so the only food available were juices, milk, eggs and other staples of a balanced diet. Homura would care not for the taste, she simply wanted to consume. She started with chugging her jug of milk, moving on to various sandwich meats and breads. She ate, oblivious to the fact that her stomach was already getting full and that a strange white creature was watching her from the faraway counter. Eventually, the black haired magical girl consumed all of the food that could have been eaten without preparation and laid on the floor, nursing a rigid midsection and letting out a mighty belch. Her mind was still foggy but the hunger had subsided for now, she simply stayed on the floor, her cheeks covered with a thin film of various foods and liquids and a rather wide smile on her face.  Letting out another belch, the girl began to giggle.<br>\r\n<br>\r\n\"I should do that more often.\" said the girl in a sweet tone as she felt her drifting off into a food induced slumber. The white creature flashed its eyes red as it slowly disappeared off the scene.  </span></div></div>",
            "created":1378530000,
            "id":1659258,
            "title":"Homura's Hunger"
        },
        "1311122212111112":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Let's go to the party at Mami's apartment! Lots of food!",
                "Kyoko debuts, and what is this unknown magic power?"
            ],
            "content":"<div class=\"\"><div> <span>As Homura was deep in a food-coma, Kyubey hopped down from the window ledge and prowled through the apartment, right towards the black haired girl in question.<br>\r\n<br>\r\n\"Well then, I suppose she doesn't know the full story,\" he thought out loud, sitting on his haunches and seeing the snoozing time traveler. \"Is she a newbie who doesn't know that you need to be overweight and full to survive as a Magical girl, or ignorant and with a death wish? But~\" He tilted his head. \"I'm sure her hunger will be her driving factor. Soon..\" He walked forward a bit, putting a paw on her stuffed food baby of a gut. It almost looked as if Homura swallowed two cantaloupes. \"Me thinks you can be quite the large one.\"<br>\r\n<br>\r\nThe Incubator's ear's perked up, and he turned around and cantered across the apartment and hopped onto the windowsill. Kyubey looked up into the heavens, smiling face and neutral eyes set in stone. But...he sensed something?<br>\r\n<br>\r\n\"Ho?\" He asked curiously. \"What is THIS unique magic power?\" Could it be another Incubator like him? No, he would have been told before hand, plus he doesn't really need the help.<br>\r\n<br>\r\nAs he gazed into the heavens, he saw a streak of light, looking like a meteor, crash into the ocean outside the metropolis of Tokyo.<br>\r\n<br>\r\n'That's Kyoko's area. I better check with her on this new development.' And the Incubator jumped off the window and into the alleys below.</span></div></div>",
            "created":1380862800,
            "id":1674264,
            "title":"A mysterious intruder that night."
        },
        "13111222121111122":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "Kyoko chases the light down!",
                "Follow Kyubey as he follows the light!"
            ],
            "content":"<div class=\"\"><div> <span>In the dead of night, all was silent in the normally bustling city area. There was surprisingly little traffic that night, with only the occasional car zooming on the highway. Dim lamps lit the sidewalks, amber lights just barely providing vision in the darkened night. The many stores that littered the streets were currently closed, a few neon signs still turned on despite their store sake being shut for the night. Not a single soul was present at the time, the streets devoid of any kind of life. That is, until the appearance of a certain girl.<br>\r\n<br>\r\n\"What kinda moron leaves their keys in plain sight on their desk anyways?\" The girl said aloud, talking to no one but herself. Twirling a set of keys on her fingers, she strolled through an open door and walked around the mass complex. This lady was currently residing a massive warehouse, filled with a massive amount of boxes and storage space. With good reason too, as this warehouse was part of a store chain, this warehouse being their main source of products for the grocery stores throughout the city.<br>\r\n<br>\r\n\"Heh, this was even easier than last time!\" The girl chuckled to herself, as she walked towards a pile of many boxes, all stacked up onto each other. With reckless abandon, she tore open the boxes and looked inside for it's contents.<br>\r\n<br>\r\n\"Just what I've been looking for!\" With no hesitating, she began to take the contents from the boxes she opened and stuff them into her pockets, soon followed by merely carrying them with both arms when her pockets were full. These contents in question was food, a plentiful supply of sweet and sour snack foods which would be expected from a store that sells food.<br>\r\n<br>\r\nFor this girl, it would be most useful. This lady was Kyoko Sakura, who shared the same occupation as one Mami Tomoe, the role as a Magical Girl. Just like Mami, Kyoko had been in the business for many a year, but not as much as the blonde haired girl. However, while Mami was devoted to her work, Kyoko went beyond that. Being a Magical Girl was all that she thought about, leading her to focus all her time on honing her abilities. What better way to do so than to bulk herself up to maximise her magical strength?<br>\r\n<br>\r\nYears of gorging and stuffing had made Kyoko huge. Her original blue shirt had be vastly outgrown, her rounded ball of a belly freely hanging out and over her waist. The shirt barely fit her anymore, just barely covering her breasts along with her black undershirt which too struggled to cover and contain her chest. While she originally wore a pair of blue shorts, she had opted for a pair of blue jeans instead to compensate for her gaining. Not wanting to have her huge rear end on display for the world to see, she pretty much needed to swipe a pair of jeans to make sure she didn't garner any unwanted attention. Even then, the jeans acted more like shorts nowadays, just barely covering her fat filled cheeks and holding her jiggling thighs. Brown boots had turned into brown sandals, having been worn and ripped apart with thousands of steps.<br>\r\n<br>\r\nStroking a hand through her cascading red hair, Kyoko opened one of her many snack boxes and dunked the contents past her plump lips. Slow heavy chews followed by a loud gulp made the girl sigh happily.<br>\r\n<br>\r\n\"Mmmm....never get enough of 'em.\" She gave her belly a few pats. \"This'll do me fine for the next few days. What I'd give to live here, if those security guards would be so kind to keep off my ass....\"<br>\r\n<br>\r\nJust then, Kyoko felt something click in her brain. A strange feeling encompassed her senses. It was all too weird. \"What the hell....\"<br>\r\n<br>\r\nShe then felt a burning sensation. which she inspected. She noticed the source coming from her soul gem, which was shining brighter than she had ever seen it before.<br>\r\n<br>\r\n\"Don't tell me there's some kind of Witch at this time of night? It doesn't make sense!\" She was initially confused, but this was only amplified as she saw a streak of light in the sky through the windows in the roof of the warehouse. As soon as the streak disappeared from her sight, the burning stopped and her soul gem went back to it's usual form.<br>\r\n<br>\r\n\"Yeah, I gotta check that out.\" Cramming as much food into her mouth as possible as not to waste it, she began to make a quick pace out of the warehouse to follow the streak of light.</span></div></div>",
            "created":1380949200,
            "id":1674767,
            "title":"Kyoko enters the story!"
        },
        "131112221211111221":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "The two fight, no time for words",
                "They are stopped by a third party"
            ],
            "content":"<div class=\"\"><div> <span>In a brisk pace, Kyoko made her way towards where the bright light appeared. Huffing and puffing, her plump body jiggled as she upped her pace, not wanting to miss out on this event. Hell if she lost to one of those other 'loser' magical girls, she'd never live it down. She would have transformed right away but for once the red-headed girl gave it some insight and it would have been best to save her energy for whatever was coming. Ten minutes later, Kyoko arrived at the sight, wiping sweat off of her brow with her chubby hand as she did her best to catch her breath.  Taking a look at her surroundings, she saw that she had arrived at a local park and in the dead center of the public area was a smoldering crater with smoke billowing out of it. Surprised that authorities had yet to arrive on the spot, she carefully approached the crater, ready to transform at a moment's notice. Feeling her heart start to race, she could tell that whatever was in the crater was a serious opponent. Before she could even arrive towards the rim, a large figure flapped it's wings, causing the smoke to blow away which revealed the true form of the mysterious figure.<br>\r\n<br>\r\n\"W-What the hell!?\" exclaimed Kyoko as she frantically transformed and put a great deal of distance between them. The girl's magical outfit was mostly red in color, With a red blouse billowing from her midsection with white trims at the end of the fabric. She also wore a pink miniskirt in addition to black tight leggings that hugged her thick thighs very generously. The girl wore knee length red boots and white arm-guards that wrapped nicely around her plump arms. As her weapon was a lance, she held it close to her as she prepared for whatever was about to emerge.  The smoke clearing out, she finally got a good look at her 'enemy.' It was a large dragon, white in color with blue scales trailing down its face towards its long and powerful tail. Most of the dragon's mass was in his forearms and chest, giving the dragon a 'strong' appearance. With a few sharp bites of its powerful jaws, the dragon let out a roar as it began to glow a pure white color as wind began turn around it. Slowly the dragon shrank until it had a more humanoid appearance as the light faded and the wind subsided. Still reeling from the appearance of a dragon of all things, Kyoko kept her guard up. After all, smaller things tended to be the most dangerous. With the transformation complete, she got a good look at the figure and was surprised once more. He looked to be a young man in his early twenties with messy black hair, blue eyes, a slightly muscular build and a rather annoyed expression. Just by this, one would assume that he was any other regular guy his age, however he sported a long white tail that curved around his lower half, blue scales decorating the sides of his cheeks and forearm and had pointed white ears that were covered in blue scales as well. <br>\r\n<br>\r\n\"Well, that landing could have gone a lot better...\" muttered the 'dragon' as he began to stretch due to feeling sore from the whole ordeal. Kyoko having enough with the whole ordeal jumped at the young man and readied her spear to attack.<br>\r\n<br>\r\n\"Okay lizard-brain, tell me, just what kind of familiar are you?\"   <br>\r\n<br>\r\n\"Hm? You think I'm a familiar of all things? I haven't been that insulted in a while y'know.\" said the 'dragon' as he brandished his claws towards the red-head.</span></div></div>",
            "created":1382677200,
            "id":1684305,
            "title":"The Hunt"
        },
        "1311122212111112212":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "The two face an encounter!",
                "The two find a place to rest!"
            ],
            "content":"<div class=\"\"><div> <span>\"There's no need for violence you know.\" An emotionless voice emerged from the top of a mound of dirt. Both the magical girl and the mysterious figure recognised who this was.<br>\r\n<br>\r\n\"You're just as bad as these humans you know. Letting emotions getting the better of you. If I were in your shoes, I'd let such a petty comment go.\" Kyubey hoped down to stand before the male, his tail swaying about as his red eyes shone in the night.<br>\r\n<br>\r\n\"Of course you would, soulless monster.\" He still brandished the claws as Kyubey spoke. \"A complete lack of empathy for everything, disgusting.\"<br>\r\n<br>\r\n\"Huh? You already met Kyubey before Scales?\" Kyoko asked, her teeth still gritted.<br>\r\n<br>\r\nHe looked over to her with a scowl. \"I know him all too well. The same Kyubey that sends young girls to their deaths over his ridiculous contracts.\"<br>\r\n<br>\r\n\"Those witches don't kill themselves you know.\" Kyubey added. \"You still haven't mentioned why you've decided to give this planet a visit.\"<br>\r\n<br>\r\n\"That is my own business.\" He replied with venom in his voice. \"But knowing you, there's no doubt you'll get yourself involved at a future date.\"<br>\r\n<br>\r\nKyubey licked at his paws causally. \"You're most likely right. The only reason you'd come here is something regarding me. Maybe there's a specific magical girl you've got your sights on?\" The male didn't respond, keeping his angered face.<br>\r\n<br>\r\nWith that, Kyubey began to hop back up the piles of dirt made by the fellow's crash landing. \"Well, that's one discovery made for the night. I was hoping it'd be something new, but it looks like it's nothing but old news.\"<br>\r\n<br>\r\n\"It might be old to you! I haven't got a clue what this dragon guy is about!\" Kyoko yelled. \"Are you just going to keep me in the dark?!\"<br>\r\n<br>\r\n\"Maybe you should get to know him.\" Kyubey responded, not looking back. \"You can be a good girl and keep an eye on him, make sure he doesn't cause any trouble. He packs quite a punch though.\" With that, the tiny white creature scuttled away into the pitch black night.<br>\r\n<br>\r\nWith that, the mysterious male was left alone with the hot blooded magical girl. While she wore a frown at the beginning of this encounter, it had dissipated into a more natural look. Shoving a plump hand into a pocket, she brought out a large bag of chips and began munching away.<br>\r\n<br>\r\n\"So, looks like you're stuck with me for the time being. Guess you'll have to start spilling the beans on what the hell you're all about.\"<br>\r\n<br>\r\nThe man folded his arms, looking at his surroundings. \"Seems like it. I didn't have any indications on where to go specifically in this city, so it'd be best to go with someone who knew the area. Especially someone as strong as you.\"<br>\r\n<br>\r\nKyoko stopped eating as the words hit her. Swallowing her current mouthful, she turned to him. \"Strong? Whaddya mean by that?!\"<br>\r\n<br>\r\n\"I'm fully aware of Kyubey's magical girl plan. I know all the aspects, including the weight gain aspect. You must be 300 pounds at the least.\"<br>\r\n<br>\r\nKyoko finished off the last chips and dumped the packet on the floor, moving onto a bar of chocolate. \"Yeah, I'm a pretty hefty gal. Can't remember my weight exactly, last time I tried to weigh myself I broke the scale!\" She gave her belly a playful slap. \"Either way, I must be doing something right!\"<br>\r\n<br>\r\nHe nodded in response. \"Yes, with a weight like that you must be an immensely powerful magical girl. You'll be a most suitable companion to help me traverse the city.\"<br>\r\n<br>\r\n\"Hey, don't get too chummy now.\" The red head pointed with her chocolate as she spoke. \"I'm not some bodyguard or anything. Don't be thinking I'll fight your battles for you.\"<br>\r\n<br>\r\nHe waved his hands dismissively. \"Oh not at all. I'm perfectly capable of taking care of myself, I just need someone who knows the city like the back of their hand.\" He smirked for a moment. \"In all honesty, if we'd have fought back there it would've been a pretty long battle.\"<br>\r\n<br>\r\nKyoko grinned to match his own. \"Good man. Even if you're bluffing about your strength, I can admire your willingness to fight.\"<br>\r\n<br>\r\nWalking up to her, the scaled man held his arm out with his palm facing upwards. \"Shall you led the way Miss...\"<br>\r\n<br>\r\n\"Sakura. Kyoko Sakura. You can ditch the Miss or any other honorifics.\" The blubbery girl began to walk, looking back. \"So what's your name then?\"<br>\r\n<br>\r\n\"All in good time.\"</span></div></div>",
            "created":1382850000,
            "id":1685025,
            "title":"They are stopped by a third party"
        },
        "13111222121111122122":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Kyoko asks for more information from the Chimera",
                "Kyoko's tummy rumbles. We can talk on Kyubey later"
            ],
            "content":"<div class=\"\"><div> <span>The alien and Kyoko walked out of the park and into an alleyway. Leaning against the wall, the pudgy redhead crossed her arms.<br>\r\n<br>\r\n\"So then Scales, what are we gonna do with you?\"<br>\r\n<br>\r\n\"Beg your pardon?\"<br>\r\n<br>\r\nShe pointed a finger at him. \"You're wearing nothin' but a spandex.\"<br>\r\n<br>\r\n\"So?\"<br>\r\n<br>\r\nKyoko's eye quirked up as she reached into her jacket pocket for a box of pocky and put the stick-treat into her mouth. \"Okay, rule of thumb here on earth, we gotta have more...decency. You need clothes so you and I will be crashing at a near by mall.\"<br>\r\n<br>\r\n\"So we will be breaking in to this 'mall?'\"<br>\r\n<br>\r\nThe redhead resisted the urge to face palm. \"Yes and no. I mean is we are going to sleep there for the night, and we aren't breaking anything. Now come one, let's go.\"<br>\r\n<br>\r\nAnd with surprising agility, she jumped from fire escape to do wall hopping until she was on top of a building. She turned around, waiting for Scales.<br>\r\n<br>\r\nAnd he darted up and landed on the rooftop next to her, bat-like wings sprouted from his back. Turning his head he saw the redhead look incredulous. \"What?\"<br>\r\n<br>\r\n\"Can you roof-jump?\"<br>\r\n<br>\r\n\"Yes,\"<br>\r\n<br>\r\n\"Then stow those wings of yours. We have to keep a low profile, AKA,\" she added, thinking his earth-lingo lacking. \"Not attract attention.\"<br>\r\n<br>\r\n\"Understandable. I apologize Kyoko.\" He made his wings return...by his wings glowing and merging back with his body. <br>\r\n<br>\r\n'So he can use magic.' She thought as she took to a run, shirt rising and flesh jiggling as she began to hop from roof top to roof top, Scales right behind her.<br>\r\n<br>\r\nBefore long, they were on top of a large mall complex. \"Right then,\" said the dragon-man. \"How do we...'break in and crash' at this place?\"<br>\r\n<br>\r\n\"I have my ways. This way.\" The hefty young girl gestured for the tall alien to follow and they found a rather large air vent to a wall. Kyoko lifted her Soul Gem and it glowed red, and it formed her spear...only that it was much more smaller.<br>\r\n<br>\r\n\"Thank god for these things being flathead scews.\" She commented as she began to unscrew each nail until the large air vent's gate was loose and she placed it to the side. She looked back and nodded.<br>\r\n<br>\r\n\"Follow me. If the vent is big enough for me, it is for you.\" She climbed onto all fours and started crawling through the tight area, Scales following behind...<br>\r\n<br>\r\nAnd got a front row view of her large wide posterior as it brushed the walls of the vent. The dragon-man could not help but notice how fat her ass was.<br>\r\n<br>\r\n\"I must say Kyoko, for a human Puella Magi are you quite large.\"<br>\r\n<br>\r\n\"Eh, comes with the territory,\" responded Kyoko as she finished a pocky rod. \"Grief Seeds make me stronger and faster, trade off is they make me balloon up each time my Soul Gem takes in one. Are your kind all buff and warrior like or something?\"<br>\r\n<br>\r\n\"Not exactly. My kind has all kinds of shapes and sizes, comes with the territory of being a Chimera.\"<br>\r\n<br>\r\n\"Chimera?\" <br>\r\n<br>\r\n\"That's my kind. Your kind is called 'Humans' from what I have learned, and we are Chimera.\"<br>\r\n<br>\r\n\"So you knew about us? What, did you abduct people and probe their asses?\" Joked the redhead.<br>\r\n<br>\r\n\"That's actually reserved for the Nitoans...we don't probe. Just observe and study. Also your planet's radio signals are too hard to ignore anyway.\"<br>\r\n<br>\r\nKyoko was silent. \"So there are those skinny big headed aliens in flying saucers who abduct humans and probe them.\"<br>\r\n<br>\r\n\"That would be the Nitoans. I dislike them too. They are creepy like that damn Incubator.\" <br>\r\n<br>\r\n\"Hold the phone,\" Kyoko stopped, looking back, but got Scales' head to squish against her jean laden booty. \"Who is Incubator?\"<br>\r\n<br>\r\n\"You don't know? You were talking to him when I first got here,\" Scales said, his tone low. \"His kind...his kind is the absolute worst.\"</span></div></div>",
            "created":1382936400,
            "id":1685644,
            "title":"The two find a place to rest!"
        },
        "131112221211111221221":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "'Scales' gives the story",
                "The next day"
            ],
            "content":"<div class=\"\"><div> <span>Finally reaching the inside of the mall, 'Scales' was somewhat surprised at the sheer size of the mall but kept his composure in front of the ever snarky girl. Wiping off the dirt and dust that stuck to her during their adventurous crawl, she began to lead the chimera to a nearby clothing store.<br>\r\n<br>\r\n\"So here we are, here we can find you something that covers you up a bit more.\" said the flabby girl as she managed to pick the lock open and quickly disable the alarm system with great speed. She lead him inside to the dressing room area and began to size him up. Placing a hand on his midsection, she smirked on how rigid his muscles were.<br>\r\n<br>\r\n\"Hoo, you'd be a popular guy here with muscles as hard as those.\" smirked the girl as she released her hand. <br>\r\n<br>\r\n\"Thanks I guess. We dragon-type chimeras do pride ourselves in our incredibly hard scales. I suppose its the same with you and the amount of fat that you carry on your stomach?\" Letting out a laugh, Kyouko raised up her shirt, revealing her plump pale gut.<br>\r\n<br>\r\n'You got that right Ironsides, here, have a feel!\" shouted the red head, placing his rough hand on the surface of her flabby belly. Surprised at the softness, he gave it a good squeeze.<br>\r\n<br>\r\n\"That's pretty impressive, I can see why you let yourself be that big.\"<br>\r\n<br>\r\n\"Keep up the flattery and I'll let you touch a bit more of me. Now stay here and let me find some nice clothes. Then you can explain everything to me in detail.\" As she walked away, the chimera could have sworn that she was purposely shaking her rear with every step.<br>\r\n<br>\r\n'I should watch out for that girl, she could easily wrap me around her fingers.'<br>\r\n---<br>\r\nAfter about an hour of trying on clothes, Kyouko finally settled on a yellow striped hoodie, black track pants and matching tennis shoes. Of course she packed more clothes in a large garbage bag she found.<br>\r\n<br>\r\n\"How do you feel?\" Taking a one over of himself, the chimera did feel quite comfortable in the fabric.<br>\r\n<br>\r\n\"Alright, I can get used to this. So should I start with the info I got on these damn incubators?\"<br>\r\n<br>\r\n\"Wait! Let me get some snacks, I feel like this is gonna take awhile.\" </span></div></div>",
            "created":1383368400,
            "id":1687803,
            "title":"Midnight Spree"
        },
        "1311122212111112212211":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "Kyoko does NOT take this news well and is furious!",
                "Kyoko keeps her cool, but understands the scale of the truth."
            ],
            "content":"<div class=\"\"><div> <span>Waiting patiently for Kyoko to return with her various goodies, which turned out to be a vast supply of popcorn along with a variety of soda bottles, she plopped herself onto the ground and began to much away.<br>\r\n<br>\r\n\"I thought it'd be fitting.\" She explained between a chugful of soda. \"Now go ahead and tell me all the dirt you've got on Kyubey!\"<br>\r\n<br>\r\nHe nodded. \"Alright. First, you remember what Kyubey told you about the entire deal?\"<br>\r\n<br>\r\n\"Sure. Witches are bad, we fight witches, we don't die and we don't let ourselves get too thin. I'm guessing he's been concealing some information.\" Kyoko replied, already through one entire bottle of soda.<br>\r\n<br>\r\n\"Furry bastard is concealing tons. You ever actually seen a magical girl's soul gem blacken?\"<br>\r\n<br>\r\n\"Never seen one die, but I've seen plenty of newbies neglecting their duties.\" She continued to shovel popcorn as she spoke. \"New blood tends to not realise how fast they lose weight, but then at the same time they're all scared about keeping up appearances.\" Kyoko put on a mock voice. \"Oh no! I've got a little flab on my arm! Now I'll never go out with that cute boy! So many girls getting into this without being prepared.\"<br>\r\n<br>\r\n\"And that's just what he wants.\" He looked aside, sighing heavily with anger. \"His race chose to have magical girls work that way on purpose. He knows how girls think, he also knows how their emotions work. He sets up magical girls to fall.\"<br>\r\n<br>\r\nKyoko laughed. \"Clearly didn't work with me then.\" She patted her belly once more.<br>\r\n<br>\r\n\"That's just the tip of it all. You're playing into his plan just as well.\"<br>\r\n<br>\r\n\"Lemme guess, it's something to do with the energy you mentioned. No clue what he'd need it for.\"<br>\r\n<br>\r\n\"Well, get this. Kyubey is trying to stop the universe as we know it from burning out by using the energy farmed from you magical girls.\"<br>\r\n<br>\r\nKyoko stopped eating for a second. \"You're shitting me, right? I mean, I know your aliens and all but that's a bit tough to buy.\"<br>\r\n<br>\r\n\"I've researched and learnt about his race and their plans for years now. I could recite it in my sleep.\" He clapped his hands together. \"You got that so far? It's a lot of digest, but trust me it's useful knowledge.\"<br>\r\n<br>\r\n\"I gotcha I gotcha. Keep those booksmarts going.\"<br>\r\n<br>\r\nThinking briefly, he snapped his fingers. \"Oh yes, you and energy. As well as making the whole weight gain thing a way of making magical girls fall quicker, it's also a way of storing more energy in your bodies. So when you fight witches and use magic, you're burning greater deals of energy since you can store so much in that 300 pound body of yours. Combine that with your emotions, which he's deducted as far more extreme than any other age or gender on Earth, and that's a hella lot of energy he can use.\"<br>\r\n<br>\r\n\"Um, so how is this bad exactly?\" Kyoko added in. \"Being a magical girl is a dangerous business, you're bound to have some girls not put the effort in and waste away. Witches don't help the cause, so what's the matter?\"<br>\r\n<br>\r\nHe sighed once more. \"Here's the kicker. You know those Witches? The very ones that magical girls are all about fighting? The reason Kyubey told you to become a magical girl in the first place? Those witches are magical girls.\" He didn't falter or stop, he wanted to get every drop of info out. \"When a magical girl's soul gem darkens, when their weight reaches a critical level, they don't just die. Their soul gems become grief seeds, the very ones magical girls need. The way Kyubey harvests his energy. It's all a vicious cycle that never ends. Sooner or later, a magical girl is going to fall and become the very thing they fought only for more poor souls to give their lives. That fucker thinks it's all a worthy cause for saving the universe, but the sheer amount of deaths he's been responsible for is sickening.\"<br>\r\n<br>\r\n\"That's the very truths that Kyubey has been hiding from you Kyoko.\" He finished and sat down, staring at his guest listener.</span></div></div>",
            "created":1383541200,
            "id":1689479,
            "title":"Story time with hidden truths!"
        },
        "13111222121111122122112":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "'Scales' tells her his name.",
                "They are interrupted by a voice. It's Kyubey!"
            ],
            "content":"<div class=\"\"><div> <span>Kyoko had her eyebrows raised and her jaw dropped as she took in the information. She reached over for a small bag of chips and ripped into it and started snacking.<br>\r\n<br>\r\n'Scales' had a quirked eyebrow. \"Well? Are you shocked? Surprised? Betrayed?\" He said, wanting to know more of Kyoko's response.<br>\r\n<br>\r\n\"Oh trust me, I understand where you're going with this, and your claim has some warrant,\" Kyoko said, munching on the potato chips. \"And I do believe you. But the only way I can be a witch is if my Soul Gem darkens and/or I get too skinny right?\" <br>\r\n<br>\r\n\"Ummm...yes, that's how Puella Magi become witches. Soul Gem darkens, turn to Grief Seed, you become Witch.\"<br>\r\n<br>\r\n\"And Soul Gem darkens thanks to over usage of magic and lack of Grief Seeds, oh, and being skinny right?\"<br>\r\n<br>\r\n\"That's...the gist of it.\" 'Scales' was rather surprised. She seemed rather calm about this! \"Aren't you taking this...a bit too well?\"<br>\r\n<br>\r\n\"All I need to do is keep doing what I'm doing,\" commented Kyoko as she finished the bag and tossed it to a trash can like a basketball hoop shot. \"That is, fight and kill witches, get their Grief Seeds, and keep on stuffing my face. The energy that lying cat needs is from my fat right? I lose weight every day or so and that's sent off as energy. So I can just keep on doing this~!\" She opened a chocolate bar and scarfed in a hurry.<br>\r\n<br>\r\n'Scales' blinked. \"You...surprise me in a lot of ways I figured you humans would take this ALOT more seriously.\"<br>\r\n<br>\r\n\"I'm not like most humans Scales,\" smirked the redhead. \"I'm just me. I've come accept, hell, even LIKE my fat.\" She looked down and patted her fat gut. \"I like how softer I am, and how bigger I am. Plus, it keeps away any pedo-pervs who are interested in little girls.\" Kyoko smirked back at 'Scales', who was entranced by her belly play. \"You like it too~?\"<br>\r\n<br>\r\n\"E-Excuse me? Me like your fat?\"<br>\r\n<br>\r\nKyoko opened a box of pocky, rolling her eyes. \"That's what I'm asking lizardhead. You seem impressed on my girth.\"<br>\r\n<br>\r\n\"Well yes. Your the heaviest Puella Magi I have ever seen.\" The Puella of the Lance looked surprised, then she looked deadpan.<br>\r\n<br>\r\n\"Oh god, there's ALIENS who freak over their weight...\"<br>\r\n<br>\r\n\"That or they overused their magic too much and their Soul Gems darken. Humans however have a higher emotional cieling and threshold, hence why that damned Incubator came to this world eons ago.\"<br>\r\n<br>\r\n\"Aliens.\"<br>\r\n<br>\r\n\"You're an alien too in my eyes,\" said 'Scales'.<br>\r\n<br>\r\n\"Eh, whatever. So,\" She stood up and waddled over, and 'Scales' noticed the sway in her hips. \"Now that you filled me in on Kyubey's little scheme, what is your name? I can't keep calling ya 'Scales' forever.\"</span></div></div>",
            "created":1383627600,
            "id":1690117,
            "title":"Kyoko keeps her cool, but understands the scale..."
        },
        "131112221211111221221121":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Finally arrived, Kyoko gives the tour",
                "The morning after"
            ],
            "content":"<div class=\"\"><div> <span>\"I suppose 'Scales' isn't working out?\" he asked in a teasing tone. With a smirk, she walked up to him and pressed a rather plump finger on his broad chest.<br>\r\n<br>\r\n\"Hey, if we're supposed to learn how to deal with each other, the least you can do is tell me you're name, give me a reason to trust you y'know?\" she said, continue to poke his hard upper body. Giving a smirk of his own, it wasn't against protocol to work together with locals as long as they prove to be rational and non-violent. <br>\r\n<br>\r\n\"Fine, fine. My name is Cernhil.\" he said, turning his smile into a frown when he told Kyoko his name. Her body quivered as she continued to giggle at such a 'weird' name.<br>\r\n<br>\r\n\"W-Wow, I knew you were an alien, but I didn't expect you to have such a lame ass name.\"<br>\r\n<br>\r\n\"Oh and Kyoko is so much better?\" he said in retaliation, bearing his fangs for the added intimidation factor. Finally getting herself under control, she once again poked his chest, this time a bit harder.<br>\r\n<br>\r\n\"Hey watch it there, no one makes fun of my name.\" she said in a rather stern tone. Figuring it was simply on of her many 'issues,' Cernhil let it drop.<br>\r\n<br>\r\n\"Alright, I got it. So what now? I trust you have a hideout of sorts?\" <br>\r\n<br>\r\n\"Sure I do, what do you take me for, some chump? Though I think I might have used up a bit more energy than I should have, I'm starting to feel a bit weak...\" she said, feigning a dizzy expression on her face. With another frown, the dragon chimera could already tell what was going to happen.<br>\r\n<br>\r\n\"You're going to force me to carry you I'm assuming?\" with a nod, the red-haired magical girl began to laugh out once more. <br>\r\n<br>\r\n\"As my back is rather sensitive, I'm gonna have to carry you bridal style. Is that alright for a 'pure-maiden' like you?\" Kyoko quickly nodded and allowed for the chimera to pick her up and carry her in the intimate fashion. Wrapping her arms around his neck for support, she continued to chuckle as she saw his rather annoyed face.<br>\r\n<br>\r\n\"You should feel lucky, not everyone gets to treat me like this.\"<br>\r\n<br>\r\n\"I can see why, now feel free to guide me if you're mind isn't too tired.\" Kyoko complied and the pair made their way to her safehouse. As he jumped from roof to roof, her softness was constantly pressing against him, serving as another distraction she had to deal with.<br>\r\n<br>\r\n'Careful Cernhil, you've dealt with her types before, don't let her get the better of you.' he thought as they continued to travel under the night sky. <br>\r\n</span></div></div>",
            "created":1384232400,
            "id":1693187,
            "title":"His Name Was..."
        },
        "1311122212111112212211211":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "Kyoko finishes her current helpings and gives a area overview",
                "Kyoko gets lazy and continues to gorge herself"
            ],
            "content":"<div class=\"\"><div> <span>Keeping her eyes on the look out for the correct landing spot, Kyoko gave Cernhil a sharp slap on the back when she had it in her sights. \"And there we are, make a swift landing over by that old apartment building.\" She pointed a plump finger over to an old boarded up building, still in relatively good condition. There was a small balcony for him to make his landing on, which Cernhil did with a swift slide against the side wall of the building.<br>\r\n<br>\r\nLanding both legs on the ground without strain, he heaved past Kyoko's oversized gut pressing into him to get her onto her feet. Allowing her to gather herself, Cernhil took a moment to explore the outer side of Kyoko's residence.<br>\r\n<br>\r\n\"I see comfortable living is no object to you Kyoko.\" She observed, no intention to being mean with his comment.<br>\r\n<br>\r\n\"Yeah, when you've got enough blubber to pretty much be a bed with pillows there's no such thing as sleeping rough!\" She chuckled as she strolled over to a boarded up doorway on the balcony. \"Here, I'll give you a quick tour of my place before I get layout sorted.\"<br>\r\n<br>\r\nOpening the makeshift doorway, Cernhil looked inside to see a rather plain room. The windows and doos were all homemade and boarded, solid wooden planks being the brunt of them. A very aged and basic bed lay in the corner of the room, the frame heavily crumpled and bent, though the manner of the bending gave Cernhil the impression it was due to an overload of weight on there rather than age. Much to his surprise, he noticed both working electricity and water pumps in the room, a dim electric lamp on a box along with a humming fridge. They were accompanied by a broken down wall which inside contained both a sink and a toilet, the walls signalling they used to be a separate room.<br>\r\n<br>\r\n\"Not much for modesty are you?\" Cernhil noted.<br>\r\n<br>\r\n\"I live alone, I don't see why I'd need to worry about someone seeing me while I take a crap.\" Looking over, Cernhil noticed Kyoko raking around in the fridge he saw, her gigantic ass in clear view as she bent over to rummage inside. When she heaved up, the magical girl had in her hands a vast selection of ice cream along with a spoon between her teeth and several ice pops between her breasts.<br>\r\n<br>\r\n\"That said, I also don't need to worry about modesty when I'm around someone I'm comfortable with...\" In response, Kyoko slipped off her blue shirt and threw it to the floor, revealing the black undershirt she wore which covered her body even less. Cernhil was surprised to see just how little it covered, a glimpse of underboob visible due to it's small size.<br>\r\n<br>\r\n\"Say, I know you're not one for the Ritz, but why choose this location anyway?\" Cernhil asked, his regular facade back into action having gotten over Kyoko's less than classy dress.<br>\r\n<br>\r\n\"Cause it's near all the food stores.\" She replied between a mouthful of strawberry ice cream. \"Not just so I can stuff my face on the drop of a dime, but it also means I can make my way to a Witch encounter faster. Witches love to prey on fatties you see in the chocolate aisle in the supermarkets, so they're more likely to attack a food joint or a place that sells food. Damn convenient.\"<br>\r\n<br>\r\n\"Understood.\" Cernhill replied as she continued to watch Kyoko shovel spoonfuls into her hungry maw.</span></div></div>",
            "created":1385787600,
            "id":1701165,
            "title":"Finally arrived, Kyoko gives the tour"
        },
        "13111222121111122122112112":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Kyoko takes it as a compliment and she flirts.",
                "How about we move over to how Madoka and the others are doing?"
            ],
            "content":"<div class=\"\"><div> <span>And she continued her assault, and within 20 minutes the entire carton of ice cream was cleared. Then, Kyoko felt a pain in her head and rubbed her temple.<br>\r\n<br>\r\n\"Tch, Brain freeze. Always such a pain,\" she griped. \"I'm used to it by now, but you can never get rid of it.\"<br>\r\n<br>\r\n\"Maybe you shouldn't have eaten that ice cream so fast,\" commented the dragon-alien.<br>\r\n<br>\r\n\"Maybe you should your face.\"<br>\r\n<br>\r\n\"Pardon me?\"<br>\r\n<br>\r\n\"It's nothing,\" Kyoko waved it off, the obese Puella Magi waddling over and sitting on the couch. Cernhil noticed every quaking step, every jiggle of her fat and he bit his lip a little bit. \"Say, Scales.\"<br>\r\n<br>\r\n\"It's Cernhil.\"<br>\r\n<br>\r\n\"I'm callin' ya by nicknames. Besides, is that H of yours silent? Anyways,\" She put a hand on her doughy middle. \"Make yourself at home, and one more thing. Could you grab me those 2 boxes of 16-pack Poptarts? They are in the cabinet right of the fridge.\"<br>\r\n<br>\r\nCernhil rolled his eyes and stood up, walking over to the fridge and opening the cabinet. He returned with the two boxes shortly, plopping them next to Kyoko. The redhead beamed and opened one box and tore upon a wrapper, snacking on the strawberry pastry.<br>\r\n<br>\r\n\"Did that Kyubey change your organs by chance? I think he replaced your innards with a black hole,\" commented Cernhil as he sat next to her.<br>\r\n<br>\r\n\"Nah, I just be sure to eat whenever I can. I...did not grow into affluence after all. Beside,s I get full at times!\" Kyoko defended herself, finishing two poptarts and moving to another wrapper.<br>\r\n<br>\r\n\"What about your breath? I'm sure eating such foods aught to make your breath stink or teeth rot.\"<br>\r\n<br>\r\nKyoko giggled cheekily. \"Props of being a Puella Magi: teeth remain sparkly clean, and,\" She pointed behind her. \"I got a ton of breath mints behind me and some basic toothbrush and paste.\"<br>\r\n<br>\r\n\"I thought you said Puella Magi don't need to brush their teeth.\"<br>\r\n<br>\r\n\"Force of habit I guess.\" She was already to the next poptart wrapper, and Cernhil watched her eat, eyes traveling all over her body.<br>\r\n<br>\r\n*squish*<br>\r\n<br>\r\nHe placed a hand on her fat thigh, and Kyoko stopped her munching on the fifth wrapper and swallowed.<br>\r\n<br>\r\n\"Uhh...what are you doing?\" She asked, and Cernhil began to massage her fat thigh.<br>\r\n<br>\r\n\"I must admit...I've never seen a girl as heavy as you, Kyoko. Not even other alien woman have such a high BMI rate, and you show no fear to the Incubator's and their system. It's...alluring in a sense,\" Cernhil said lightly. \"You have a unique air of confidence around you, you don't care about what others think, and you have courage to face dangerous supernatural abominations that could take your life at a moment's notice.\"</span></div></div>",
            "created":1385874000,
            "id":1701568,
            "title":"Kyoko gets lazy and continues to gorge herself"
        },
        "131112221211111221221121121":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Cernhil continues his acts",
                "Cernhil cools down and the two share a close moment."
            ],
            "content":"<div class=\"\"><div> <span>He knew the risks involved, he'd seen in first hand. As he thought earlier, there was certainly something different about this girl. As his hand continued to move up and down her plump thigh, he did think that maybe his actions were a tad bit curt. Cernhil was not a man that was a stranger to intimate contact with someone of the opposite sex or even a different species. He often found it as a nice way to cool off after his missions, but something else was driving him this night. Was it some sort of lust? As he was lost in his own thoughts, the red haired magical girl let out a laugh as she felt his touch on her flesh. <br>\r\n<br>\r\n\"I didn't say I could touch did I?\" said Kyouko as she flashed him a rather wide grin. Knocked out of his trance, he removed his hand but continued to stare at Kyouko with a certain glare. <br>\r\n<br>\r\n\"I didn't think you to be the reserved type. This display just cries out for attention.\" said Cernhil, reaching out his hand and rubbing her flabby gut this time. He let his touch linger once more as he fondled the surface, gently slapping it from time to time. While she didn't show it, Kyouko was starting to be a bit flustered.<br>\r\n<br>\r\n\"Hey, hey hey, that's a bit too much don't you think?\" she said, removing his hand this time but moving a bit closer to him. Sighing, he moved himself a bit closer as well, just to see what would happen.  \"Look, I've been doing this thing now for awhile and I know that sometimes things get hard to deal with. I just think that you just got some pent up things that you would rather let out right?\" As much as she didn't want to admit it, it had been awhile since anyone, be it regular humans or other magical girls, had paid attention to her so intensively.<br>\r\n<br>\r\n\"I know it isn't easy, but if this is going to happen, I want to lead!\" said the red haired girl as she shuffled over and climbed on top of his lap, her heavy bottom and chunky thighs pressing down on his lower half. Letting out a small growl of discomfort, he figured that this was the go ahead to do as he pleased. Wrapping his arms around her fleshy midsection, he did his best to grab as much of her flab as possible, which proved to be a highly difficult task. Kyouko took this as a sign to lean herself further into him and increase the delightful pressure she had over him. <br>\r\n<br>\r\n\"Since you're oh so occupied, I'll take this as a chance to finish up my little snack.\" Grabbing the abandoned box, she continued to feed her greedy mouth as Cernhil continued to explore the rest of her corpulent form. \"When you put it like that, I think these need to go.\" announced the chimera as his hands had found their way to her lower half and wrestled the tight button from her shorts loose, releasing the fat it had held captive. Gently sliding them off, it revealed a nice pair of striped red panties, something that he couldn't see that well from behind her. <br>\r\n<br>\r\n\"H-Hey! Y-Youre heading into some dangerous territory S-Scales!\"</span></div></div>",
            "created":1386046800,
            "id":1702456,
            "title":"A Feeling and a Need"
        },
        "1311122212111112212211211212":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "The night continues for the duo",
                "The next morning"
            ],
            "content":"<div class=\"\"><div> <span>Kyoko attempted to look down past herself, but stopped early on as she knew she'd never see past her huge gut, let alone her sizeable chest. She could only munch away on her frosted snacks in anticipation now that Cernhil had stripped her of those tight pants, leaving him surrounded by a concave of belly and thigh fat. She could feel his surprisingly soft hands around her middle, his fingers sinking to her belly as he held on. Kyoko chewed slowly as she waited.<br>\r\n<br>\r\nAt the same time, Cernhil was quite happy with the situation. Having adjusted himself so not to be bothered by the tremendous weight, his removal of her pants had allowed her belly to roam free, not a single inch being held back by any clothing items. Oddly enough, without too much strain from the weight Cernhil felt rather comfortable. The plushy layers of pudge kept him quite warm underneath them, both her thunderous thighs and her grandiose gut soft to the touch despite Kyoko's battleworn history as a magical girl. Granted, it was likely her wounds would heal considerably fast given the perks as a puella magi.<br>\r\n<br>\r\nHaving some degree of freedom under the huge girl, Cernhil lifted his head up and pressed it against the gigantic belly that lay before him. Since he had freed her belly from it's strained fabric prison, it overhung far past her waist, oozing over her thighs and covering her tortured pair of panties. He leaned forward enough so to allow his head to rest over onto Kyoko's gut. She shivered as she packed away more treats in her mouth, Cernhil's face surprisingly cold to the touch.<br>\r\n<br>\r\nIn contrast, Kyoko's belly was warm. It was like a roaring fire was constantly lit inside, heat radiating from the rounded orb of fat. He pressed his face a little more, feeling it sink into the softness. Despite the fiery redhead having stuffed herself just recently, a large amount of softness remained on her stomach, giving space to sink into the pink flesh. He could hear the soft gurgles from inside, no doubt a sign of her insides hard at work digesting the mounds of ice cream and countless other snacks she'd eaten that night.<br>\r\n<br>\r\nCernhil's arms wrapped around her belly as far as he humanly could. He held it in a tight embrace, the sensation most wonderful to him in every way. At the same time, Kyoko couldn't deny it was quite nice to have someone give her some affection. Granted, it was more for how much of a fatass she was rather than say personality, but all in all she felt optimism to see someone credit her for her figure for once. It was her sole reason for living after all.<br>\r\n<br>\r\n\"Someone sure is enjoying themselves down there.\" Kyoko said as she gave her gut a few pats, cramming the last of the box's contents into her mouth as Cernhil continued to while away the time in the blissful situation.</span></div></div>",
            "created":1386910800,
            "id":1707234,
            "title":"Cernhil cools down"
        },
        "13111222121111122122112112121":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "We now cut to Madoka, Sayaka, and Mami for some exposition and dinner.",
                "Nope, back to Homura, waking up from her food coma. And she's hungry again!"
            ],
            "content":"<div class=\"\"><div> <span>As Kyoko finished all of her snacks she laid back on the floor, her huge stuffed gut rising and falling.<br>\r\n<br>\r\n\"Ah yeah...that's the stuff...\" She groaned as she rubbed her giant fat-filled middle. And she still felt Cernhil's hands continue their wandering all over her bloated form. \"So, you still like this huh? All my fat?\"<br>\r\n<br>\r\n\"I suppose I do,\" answered the alien as he continued to knead and massage her under her middle. \"I mean, there's just something about the softness and the cushiness that is...alluring.\"<br>\r\n<br>\r\n\"You're using that word again,\" chuckled the redhead. \"Does that mean I'm alluring as a whole then?\"<br>\r\n<br>\r\n\"Possibly.\"<br>\r\n<br>\r\n\"Possibly? What kind of an answer is that?\" Asked Kyoko in an amusing tone. \"You unsure, even after all your loving of my fat?\"<br>\r\n<br>\r\n\"Want a yes or no answer?\"<br>\r\n<br>\r\n\"Preferbly.\"<br>\r\n<br>\r\n\"Then possibly.\"<br>\r\n<br>\r\n\"Ehhhh?\"<br>\r\n<br>\r\n\"You didn't say yes or no, so I said possibly.\" Kyoko laughed at his answer. He does have a good sense of humor!<br>\r\n<br>\r\n\"Then in that case, I say yes. I want a yes or no answer.\"<br>\r\n<br>\r\n\"Then yes.\" Smiled Cernhil. \"I...like your flesh and flab.\" He nuzzled his head on his new pillow, Kyoko's giant gut. \"So...we're sleeping here for the night?\" He asked.<br>\r\n<br>\r\n\"Yeah, that a problem?\" She asked. \"We leave at dawn of course. Then it's off for a new day and whatever it will bring.\" She reached a hand to ruffle his hair, scratching behind his ears. \"You know Cernhil, you're a good guy.\"<br>\r\n<br>\r\n\"Mmmm...\" Cernhil groaned out, letting our a pur as Kyoko scratched behind his ears. The Puella Magi giggled.<br>\r\n<br>\r\n\"Like that~?\" She cooed, sighing happily as she laid back on the ground and looked up at the ceiling, a purring Cernhil resting his head on her giant belly and she was stuffed and full.<br>\r\n<br>\r\n'I wonder where all this fat will go~' she thought to herself, interested by the prospect of gaining more flab and fat on her frame. The night wore on and sleep began to take both Puella Magi and Chimera alien.</span></div></div>",
            "created":1389157200,
            "id":1724224,
            "title":"The night continues for the duo"
        },
        "131112221211111221221121121211":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Dinner is had while witch dealings are discussed ",
                "Turn to Homura's situation"
            ],
            "content":"<div class=\"\"><div> <span>Days had passed since Madoka and Sayaka's first meeting with Mami and as of now, they were heading back to her apartment. Given enough time to process just who Mami was and all of the hardships she had to deal with, they all became incredibly fast friends. Since both had stayed after class a bit to help clean up the school and surrounding fields, it was nearing dusk, the air highlighted with a bright orange glow. <br>\r\n<br>\r\n\"Oh I hope that Mami has some strawberry cheescake today. I could use it after all the work we did.\" said Madoka, placing a her small hand on her flat tummy. Sayaka nodded except she wanted something with a bit more substance to it.  \"You can do with your little desert but I need some real food right now.\" As if on command, the blue haired teen's stomach growled loudly, earning her a giggle from the cute Madoka. <br>\r\n<br>\r\n\"Well I'm sure Mami has something for us. I'd imagine having to put on that much weight would make you carry a lot of food at home.\"<br>\r\n---<br>\r\nAfter about ten minutes of walking, the pair had arrived at Mami's apartment and were buzzed in by the blonde. Unlike Madoka and Sayaka who were dressed in their standard school uniforms, Mami was dressed in a more casual garb. With an orange hoodie that was stretched around her flabby middle and black sweats that accented her plump hips and rounded thighs, the magical girl looked quite comfy. At the sight of them, Mami cave them a big hug, nearly drowning the girls with the sea that was known as her soft breasts. <br>\r\n<br>\r\n\"Hey there Mami,\" said Sayaka as she struggled to get air into her lungs. Madoka simply smiled and let Mami shower her with affection. Releasing her firm hold over them, she led them to her coffee table as she went to fetch snacks for them all.  She returned with two cakes, one was a flavored strawberry cheesecake, the other flavored raspberry.  <br>\r\n<br>\r\n\"This is just a little something while I prepare dinner for us all. I hope you don't mind waiting a bit, I still need to let the roast soak for a little.\" said Mami as she cut a slice of each cheesecake and passed them to her friends.  Madoka let out a rather big grin as she dug into the strawberry cheesecake and Sayaka nearly drooled at the mention of the roast.  Half an hour later and both cheesecakes were nearly done. Both girls leaned back from their seats, satisfied for the moment. <br>\r\n<br>\r\n\"I hope you're both hungry, I made plenty for us all.\" said Mami, wearing a tight yellow apron over her bulging midsection, outlining the generous curves of her gut and breasts. In her hands held a large platter with a roast, trimmings and a heaping pile of mashed potatoes. Gently setting it on the table, she left once more to fetch plates, utensils and drinks. Looking at the giant roast and her own stuffed stomach, Sayaka grinned. Being friends with Mami certainly had its perks.   </span></div></div>",
            "created":1389502800,
            "id":1726199,
            "title":"Stuffed Fruits"
        },
        "1311122212111112212211211212111":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "That very same day...",
                "The very next day..."
            ],
            "content":"<div class=\"\"><div> <span>\"I hope you enjoy this as much as I enjoyed making it!\" Mami announced as she sat her gigantic rear down by the table, the mighty roast placed in the centre. Sayaka wasted no time ripping off portions of meat from the plate along with a fair amount of potato, whilst Madoka took some smaller helpings, her already full stomach causing her to slow down considerably.<br>\r\n<br>\r\nAs Mami placed the large cups of tea around the table, she frowned slightly as she looked down, her belly rolls eating away at the table. Brushing against her plate, she was forced to shift her chair back a foot in order to grant more room and more comfort, along with an extra couple of inches as she found her rolls still nibbling at the end. Eventually she found the sweet spot which allowed her to sit at the table with her belly crushing into it, giving off a smile of satisfaction once she did.<br>\r\n<br>\r\n\"So girls, how is my cooking?\" She asked as she took a heaping amount of the roast onto her plate, enough to cover it entirely.<br>\r\n<br>\r\n\"Yeah! This tastes great, you really outdid yourself Mami!\" Sayaka happily said as she tore into another forkful of food, belching loudly with a hand on her gut, slowly expanding as more and more food was pushed into her stomach to join her already eaten cake.<br>\r\n<br>\r\n\"It's really delicious...\" Madoka added, merely picking at her meal since she felt full as it is. She gave a warm smile to show her appreciation for the food.<br>\r\n<br>\r\n\"I'm glad you've enjoyed it! Not to blow my own trumpet, but I think it turned out very well.\" Mami added, shovelling her own meal into her hungry maw, cheeks puffing out with food, followed by a swallow. \"Now then, may I ask if you girls are still interested in becoming magical girls on your own accord?\"<br>\r\n<br>\r\n\"You bet I am! I've been working on plumping up since you said!\" Sayaka answered enthusiastic with another helping of roast dropped onto her plate. Madoka nodded in agreement, nibbling away at a strip of meat.<br>\r\n<br>\r\n\"In that case, I do think it's time you girls got your first taste of hunting witches.\" The much larger of the girls took a sip of her tea.<br>\r\n<br>\r\n\"W-What?\" Madoka stammered. \"You mean...a real witch!? Those things from before were dangerous enough!\"<br>\r\n<br>\r\nMami merely waved her hand. \"There's no need to worry, this time you'll have me with you. Besides, if those familars were that easy to beat, the witch they came from should be a breeze.\"<br>\r\n<br>\r\n\"Come on Madoka, don't be a scaredy cat!\" Sayaka gave her a nudge with her fist. \"Count me in for this Mami!\"<br>\r\n<br>\r\nA giggle came from the plump blonde, using her mouth to cover her laugh. \"Such enthusiasm! I can see you're eager for the experience! Now, if you girls wish to join me in hunting some witches, simply come to my apartment at the same time we usually meet. From there I'll take the lead. There's no set path, but I'll explain why on the day.\"<br>\r\n<br>\r\n\"Come oooon Madoka! I don't wanna go on my own!\" Sayaka resorted to shaking her friend back and forth, making the pink haired girl somewhat queasy.<br>\r\n<br>\r\nA slightly stern look appeared on Mami's face. \"Now now Sayaka, if Madoka doesn't want to come then so be it. We will be entering the witch's barrier just like what happened before and there will be an element of danger. If she doesn't feel safe, then I can understand her not coming.\"<br>\r\n<br>\r\n\"I'll...come.\" She answered. \"I mean, if you're both there I'll be protected and safe, right?\"<br>\r\n<br>\r\n\"Hell yeah! I'll bring my baseball bat to help!\" Sayaka gave a thumbs up.<br>\r\n<br>\r\n\"You'll be in good hands Madoka. You've got 300 pounds of magic on your side.\" Mami gave her hefty belly a few pats. \"Now then ,since we're settled, how about we finish off this lovely meal, shall we?\"<br>\r\n<br>\r\nThe girls ate with gusto, Madoka's hunger somewhat invigorated now she felt more confident.</span></div></div>",
            "created":1389762000,
            "id":1728157,
            "title":"Dinner is had while witch dealings are discussed "
        },
        "13111222121111122122112112121112":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "We follow Homura as she encounters Madoka and a more plumper Sayaka at school",
                "That pesky Kyubey shows up at school where Madoka, Mami, and Sayaka are."
            ],
            "content":"<div class=\"\"><div> <span>\"Ugh...\" Groaned Homura as she crunched another bag of fast food and tossed it to the trash can. The black haired girl sat on the couch, leaning back and slouching as she looked down.<br>\r\n<br>\r\n\"I'm fat.\" She said plainly, eye twitching as she put a hand on her middle. These last two days have been nothing but constant eating. Whenever the time traveler would run out of food, she would go out, use her time-stop to raid some fast food establishments even while they were open, stuff any completed food in bags in her backpack, and leave to go back to her apartment to gorge herself silly. And whenever she got full, she felt the food coma come over and lull her into a deep nap. Rinse and repeat. When any fast food restaurants were closed late, she would just go to a quick mart that is open 24/7 and raid it's contents. Or simply bust open a vending machine. She did have weapons on hand to do so.<br>\r\n<br>\r\nAnd the two days of stuffing face has made her gut look like as if she had swallowed a basketball and change, and she felt the nagging feeling of hunger fade. One thing Homura noticed was that her time-stops were going on longer than usual, which puzzled the Puella Magi. Why was her time-stop magic having a longer time? She also noticed that even with her newly added gut, her softened up bum and breasts and slightly thickened thighs, she was still very agile and mobile.<br>\r\n<br>\r\nWell, she wasn't fat. More like bloated and mildly chubby. Looking down, she rubbed her stuffed gut and shrugged. \"Well, maybe not fat. But I will be at this rate.\" She stood up, and looked over herself, dressed in her PJs and school starts soon. She needs to check in on Madoka, and make sure that pesky Kyubey don't convince her.<br>\r\n<br>\r\nShe put on her school uniform, her thigh-high stockings tight as she pulled them up over her thighs, noticing how they were a bit snugger. Homura continued to work on her school uniform, feeling her tummy hang over her skirt. She didn't want to risk buttoning across of it for fear of a button flying off and ricocheting. <br>\r\n<br>\r\nInspecting herself, she knows for sure this food baby of a gut will be digested by today's end...that is unless she has something for lunch and dinner, which is more or less a guarantee at this point.<br>\r\n<br>\r\nSighing, the time traveler got her bag and locked the door to her apartment and walked out to school.</span></div></div>",
            "created":1390539600,
            "id":1732438,
            "title":"Whats Homura doing?"
        },
        "131112221211111221221121121211121":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Later, Madoka and Sayaka have lunch with Mami and discuss the mission",
                "After school with Homura"
            ],
            "content":"<div class=\"\"><div> <span>Resting her hand on her slightly rigid middle as she went her way to school, the magical girl began to scold herself internally for losing her self control so easily. If things were to continue on like this, then her primary mission would be compromised which ends up putting Madoka in grave danger once more. At the thoughts of the pink haired girl, Homura felt a pang of regret in her heart, which was a stark reminder of how they could never achieve a normal friendship. After around ten minutes of silent walking and sulking, Homura had finally reached the gates to the impressive school and had spotted some familiar faces. It was Madoka and Sayaka who had appeared to wait for the long haired beauty. <br>\r\n<br>\r\n\"Good morning Homura!\" shouted the pink haired girl as she approached Homura. As usual, the stoic girl had the urge to hug her friend, but held back her urges out of respect.<br>\r\n<br>\r\n\"Good morning Madoka, and to you as well Sayaka.\" said Homura in her standard neutral tone. Sayaka had also approached her, but there were a few things different with the usually energetic girl. Right now, her face appeared to be fuller as her cheeks were slightly more rounded. The other fact that Homura picked up on was that her thighs, which were visible right under the skirt she wore, looked softer and had lost the definition she naturally possessed.  Something else that bothered Homura slightly was the fact that Sayaka was munching on a donut and carried a few more in a brown paper bag that she held against her bosom. <br>\r\n<br>\r\n\"Yo, morning there Homura. You sure did take your time getting here, we've been waiting like ten minutes.\" said the blue haired girl, taking another bite from her donut. <br>\r\n<br>\r\n\"I apologize, I overslept this morning.\"<br>\r\n<br>\r\n\"Oh it's okay Homura, Sayaka was just teasing you.\" said Madoka. With greetings out of the way, the trio started the walk to the homeroom that they shared. As they walked, Homura was slightly bothered by Sayaka's apparent differences, including snacking in the morning. In all of the timelines she had been and lived through, something like that had never been an issue. Keeping her guard up, Homura had to assume that this was simply the act of something menacing.    </span></div></div>",
            "created":1391230800,
            "id":1736482,
            "title":"Blue Folly"
        },
        "1311122212111112212211211212111211":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "School continues onwards",
                "School's over, what's going to happen?"
            ],
            "content":"<div class=\"\"><div> <span>As the school bell rang to signal the coming of lunch, Madoka found herself near yanked out of her chair by Sayaka, cramming a final snack into her mouth before swallowing as the two of them left the classroom.<br>\r\n<br>\r\n\"Sayaka! What's all the rush? Mami didn't say anything about rushing...\" Madoka tried to speak as her arm was pulled repeatedly by Sayaka as she dominantly strode down the hallways.<br>\r\n<br>\r\n\"I need to rush! How else will I get the best stuff from the cafeteria if it's all taken before I get there!\" Sayaka replied, a stern force in her voice.<br>\r\n<br>\r\n\"But isn't Mami supplying lunch for us?....\" Madoka mumbled, not wanting Sayaka to hear, eventually letting her pink haired friend go as she stormed into the cafeteria.<br>\r\n<br>\r\nMoments later, Sayaka returned with a tray packed to the brim with food, enough to easily overfill the plate and cause several pastries to fall onto her tray.<br>\r\n<br>\r\n\"You're taking this magical girl stuff seriously, aren't you Sayaka?\" Madoka asked as her close friend chomped at a few loose items of food. \"You know how dangerous it was when we were attacked! And those weren't even witches....it could be even more dangerous! Are you really sure about becoming one?\"<br>\r\n<br>\r\nSayaka turned to Madoka, soon filling her face with a grin, \"That's so you Madoka, always worried about others!\" She walked onwards as Madoka followed. \"Look, Mami means a lot to me. Knowing she's out there, doing heroic stuff with witches and saving lives....makes me want to join in and help. I want to be just like Mami, I want to fight for justice and nothing will steer me from that! You can understand, right Madoka?\"<br>\r\n<br>\r\nMadoka couldn't help but giggle. \"That's so you Sayaka.\"<br>\r\n<br>\r\nEventually, the two girls walked to the school's rooftop, seeing none other that Mami sitting down on one of the benches present, several cakes dotted about the benches with one missing a sizeable slice, said slice half eaten and held between Mami's thick fingers.<br>\r\n<br>\r\n\"Oh my! Sorry girls, but you were taking so long and my poor stomach wouldn't stop growling. Do forgive my manners!\" Mami greeted, slipping the rest of the slice between her lips.<br>\r\n<br>\r\n\"Hey, no sweat Mami! I just went to get a little extra for my training!\" Sayaka stuffed another portion of her lunch into her mouth, sauce dribbling onto her lips.<br>\r\n<br>\r\nMami licked a stray dash of cream from her finger. \"I see you're getting into the spirit of things well Sayaka! It's always good to bulk your body out before becoming a magical girl, it'll give you a nice added boost.\"<br>\r\n<br>\r\nLifting herself from her sitting position, Mami waddled over to Madoka and gave a warm smile. \"I see you're still deciding Madoka! It's nothing to fret, if anything Sayaka is the exception between you, she's more enthusiastic than I've seen anyone in a long time~\" She took a glance over as she attacked the food on her tray whilst sneaking a slice of cake between bites.<br>\r\n<br>\r\n\"So Mami...you said we'd discuss today? I just want to be sure about everything.\" Madoka asked, a little timid as the grandiose belly Mami possessed brushing against her own slim stomach.<br>\r\n<br>\r\n\"Of course Madoka, I shall inform you. I can understand your concerns for what we're going to do, but rest assured you are in good hands.\" Sitting her grand rear back down, with Madoka seating herself by the gorging Sayaka, Mami begun to speak with a plate of cake on her thick thighs.<br>\r\n<br>\r\n\"Now Madoka, what we will do is rather simple. To find a witch, all we need to do is track one down using my Soul Gem.\" Slipping a ring from her finger, the Soul Gem materialised, just as bright as it was last time Madoka saw. \"A feature that Soul Gems possess is that they can track witches. When near a witch, the Soul Gem will begin to radiate and glow much brighter than usual. It will also flash, with the flashes becoming more rapid the closer we are. If we use my Soul Gem, we'll easily be able to find a witch.\"<br>\r\n<br>\r\n\"Wow, neat!\" Sayaka added with a mouthful of noodles, gulping them down before wiping her mouth with her sleeve. \"So what else should we know?\"<br>\r\n<br>\r\n\"Well, once we've tracked down where a witch resides, we'll need to find the barrier entrance.\" Mami took a hefty slice of cake and took a large bite, relishing the taste, a few crumbs falling onto her chest. \"From there, we'll be able to head into the witch's barrier. We'll need to do two things there, save people and stop the witch.\"<br>\r\n<br>\r\n\"Save people...\" Madoka questioned to herself.<br>\r\n<br>\r\n\"Oh yes. Witches will feed on any and all people who are unfortunate enough to be caught. Not only will we need to search the barrier for people, but we'll need to save people before they enter the barrier. Witches are powerful enough to take control of people, making them do their will. I shall explain more during the mission.\"<br>\r\n<br>\r\n\"So once that's all done we can lay the smackdown on this witch!?\" Sayaka took a break from eating so to open her backpack to whip out an massive baseball bat. \"I'll show that witch what for Mami!\"<br>\r\n<br>\r\nMami giggled, a hand on her mammoth breasts. \"I admire your enthusiasm, but sadly you'll have to use that for self defence at best. A witch can only be defeated by a magical girl, their power being able to rival a witches. I shall help make your bat somewhat more effective in combat though!\"<br>\r\n<br>\r\n\"This seems all very risky....but it should be fine, right?\" Madoka's voice once again was timid and meek.<br>\r\n<br>\r\n\"Oh yes, certainly! With Sayaka defending you and I always by your side, you'll be just fine! In fact, you can focus on rescuing people since me and Sayaka will be in combat mostly! They may be in binds and will need untying.\"<br>\r\n<br>\r\n\"See? You'll be fine Madoka! Me and Mami gotcha back!\" Sayaka gave a pat on Madoka's back, slipping her baseball bat back into the backpack.<br>\r\n<br>\r\n\"Hopefully that should clear everything up.\" Mami picked up a few cakes, placing them on both Sayaka's and Madoka's laps. \"Now that we've talked, you two girls eat up and get some strength, you'll be needing it for tonight~\"<br>\r\n<br>\r\n\"Heh, I'm only kinda full this time!\" Sayaka pumped her fist as she ate. \"I'm getting better with how much I can eat!\" Madoka merely picked at her cake whilst Mami gave her belly a few rubs in satisfaction, an enjoyable meal for all of them.</span></div></div>",
            "created":1391835600,
            "id":1742114,
            "title":"Mission discussion"
        },
        "13111222121111122122112112121112111":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "And there was Kyubey, tail swishing and smile on it's face."
            ],
            "content":"<div class=\"\"><div> <span>\"So then, we will begin our first Witch Hunt after school. Be sure you two are prepared for whatever comes your way understand?\" Mami asked the two girls as they lounged in the cafeteria. Sayaka's eyes wandered and saw Madoka eating her cake lightly.<br>\r\n<br>\r\n\"Oui oui Madoka,\" Sayaka closer to the pinkette. \"Your not eating that much~\"<br>\r\n<br>\r\n\"Eh?\" Madoka perked up. \"Oh I...well...I am feeling full and-\" She was cut off when Sayaka crammed a cake slice into her mouth.<br>\r\n<br>\r\n\"Now now Madoka, how do you expect to fight witches when your picking your plate? Eat girl eat!\" Smiled the bluenette as she crammed the treat down Madoka's willing mouth. The pinkette swallowed.<br>\r\n<br>\r\n\"Fuwah!\" She breathed. \"Sayaka-chan. You're mean~\" She pouted, while Sayaka only grinned while Mami smiled to the side. Madoka ate at her cake a bit more, if only to stop her friend from making her choke. She looked at Mami.<br>\r\n<br>\r\n\"Say, Mami-san?\"<br>\r\n<br>\r\n\"Yes?\"<br>\r\n<br>\r\n\"I was wondering...how do you get by everyday?\" As she asked this, come students passed, giving Mami some looks of disgust as the blonde continued to rub her middle. \"Like, how do you...ummm...withstand it?\"<br>\r\n<br>\r\n\"You mean the discrimination of being fat?\" Asked the blonde. \"Well, at first when I became a Puella Magi I was nervous and ashamed that I was always gonna gain weight and be fat, but, I just got used to it.\" She smiled, tilting her head to the side. \"Besides, I think there is a certain...beauty in being this big.\" She looked down and grabbed her heft middle.<br>\r\n<br>\r\n<br>\r\n\"B-Beauty?\" Madoka perked up, surprised to have heard her sempai say that.<br>\r\n<br>\r\n\"Yes, I just feel more...well...confident in myself more than I was before I became a Puella Magi, plus,\" she cupped her bosom. \"I have breasts only shounen heroines would dream of!\"<br>\r\n<br>\r\n\"Got that right!\" Sayaka laughed. \"Hopefully when I become a big huge Puella Magi I can have boobs as big as yours!\"<br>\r\n<br>\r\nMami covered her mouth and chuckled. \"My my you are very eager~\"<br>\r\n<br>\r\n\"Totally! Maybe I'll be strong enough to put that Homura in her place too!\"<br>\r\n<br>\r\nSuddenly Madoka felt a pair of eyes on her and turned, seeing someone entering the cafe and seeing that it was none other than Akemi Homura, who looked as if she was slightly pregnant...and softer too.<br>\r\n<br>\r\nThe atmosphere became tense as Homura, her eyes on Madoka walked past, giving Mami a look as she went over to the cafe-line. Madoka looked at the passing black haired girl, seeing that her tights looked a bit...tighter.<br>\r\n<br>\r\n\"She's been pigging out hasn't she?\" Asked Sayaka as she stuffed another cake slice in her mouth. <br>\r\n<br>\r\n\"She has,\" Mami replied seriously. \"How odd. She carries herself as if she is a veteran, yet for her not to be as big as I am. She lives a dangerous life...\"<br>\r\n<br>\r\nMadoka turned towards Mami to ask. \"What do you mean she lives a dangerous life?\"<br>\r\n<br>\r\n\"The life only a rogue would live,\" said a certain voice, making the two girls turn around and look at the floor...<br>\r\n<br>\r\n\"It's you!\" Madoka gasped in surprise.</span></div></div>",
            "created":1392354000,
            "id":1745402,
            "title":"School continues onwards"
        },
        "131112221211111221221121121211121111":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "The Mission Begins",
                "With Homura, has her hunger subsided?"
            ],
            "content":"<div class=\"\"><div> <span>The trio stared at the white creature, it's red eyes piercing them to their very core. Once again he had appeared, most likely to give cryptic advice and then disappear like always. Mami had already informed the other two about his true existence and what his goal was. Apparently he turned girls into magical girls in order to have them fight witches in order to preserve stability in the universe. The other two girls didn't quite get it, but if it meant things remained peaceful, it must be a good thing right?  Still, seeing his form made a shiver go down Madoka's spin for some reason. However, Mami and Sayaka seemed quite fine.<br>\r\n<br>\r\n\"What do you mean by rouge?\" asked Sayaka, clearly not feeling any fear by the foreign creature. Mami listened in with great intensity, after all, the duties of a magical girl required one to be well informed on their 'comrades.' <br>\r\n<br>\r\n\"Well it's quite simple. That Homura is a lone wolf type, the kind that keeps things to herself and acts surprised when things blow up in her face.\" <br>\r\n<br>\r\n\"Hey, don't make fun of Homura like that!\" shouted the naive Madoka, not willing to listen to the white being. <br>\r\n<br>\r\n\"I'm not, the only thing I'm saying is that her life would be so much easier if she just tried to talk to you all. But enough about her, she's not the reason I'm here.\" said  Kyubey as he walked down the cafeteria table to stand in the middle of the three. Luckily, he couldn't be seen by normal eyes or he would have caused a commotion at the school. He eyed down Mami and Sayaka, noticing the changes to their bodies. <br>\r\n<br>\r\n\"What are you here for Kyubey?\" asked Mami in a much more friendlier tone than the other two. <br>\r\n<br>\r\n\"First, I've see you're keeping up your strength Mami, And it looks like Sayaka here can be a good candidate to be a magical girl.\" said Kyubey, inspecting Mami's fuller face and belly pressing against the table. Indeed she had made strides in her magical power. <br>\r\n<br>\r\n\"Hehe, thanks. I've been thinking of maybe turning into one, but I might need some time to think.\" said Sayaka, rubbing the back of her head in a modest fashion. <br>\r\n<br>\r\n\"So now, I've been sensing a rather strong signal coming from downtown. You're going to handle that correct?\" asked Kyubey as he approached Mami. <br>\r\n<br>\r\n\"Of course, I'm going to go along with these two after school.\" said Mami, taking another bite from the piece of cake that was in front of her. Being silent for a few moments, it seemed that the cat like creature was fine with Mami's decision. <br>\r\n<br>\r\n\"Very well, just make sure you don't burn off too many calories. Even if you do beat the witch, you might get taken out by other familiars before you get a chance to use a grief seed.\" was the last thing that Kyubey said as he quickly walked off. Feeling the pressure around them decrease greatly, Madoka let out a sigh of relief. Letting herself be distracted, Sayaka took this as an opportunity to shove another piece of cake in Madoka's mouth, earning her a cute squeal from the girl.<br>\r\n<br>\r\n\"Hey you heard what he said, we need to keep up with these calories!\" shouted Sayaka as she let Madoka finish the rest of the sweet cake. Readying another piece, she aimed her sights at Mami this time. \"You too Mami, you're our powerhouse after all.\" <br>\r\n<br>\r\n\"Oh I do enjoy being fed~.\" said Mami as she opened up her eager mouth to the moist cake. With a bit of effort, Sayaka shoved the cake in, causing a nice layer of frosting to adorn her mouth. <br>\r\n<br>\r\n\"Hehe, we are so going to kick this witch's butt!\" shouted Sayaka. Madoka looked at the two as the blue haired girl continued to 'fool around' with Mami, Despite such a happy scene, she felt a tiny bit of nervousness from her center. She just hoped that Mami would be able to overcome any witch. Licking some frosting off of her face, she decided to go in for another piece before the ever hungry Mami would consume it all. <br>\r\n</span></div></div>",
            "created":1393131600,
            "id":1750143,
            "title":"Confidence and Cakes"
        },
        "1311122212111112212211211212111211111":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "Mami finds someone with a Witch's kiss",
                "Mami searches for the Barrier entrance"
            ],
            "content":"<div class=\"\"><div> <span>With her eyes transfixed onto the clock on the wall, Sayaka was on the edge of her seat waiting for the timer to signal the end of the school day. Madoka looked uneasily at her blue haired friend, her teeth grit and her head leaning forward in anticipation to leave. When the minute hand finally struck at the right spot, the school bell rang and Sayaka launched from her seat. Madoka quickly got up herself, not wanting to be dragged up by Sayaka as she had before. She hurriedly grabbed her bag and followed behind Sayaka, heaving her own bag up due to the heavy baseball bat she had inside.<br>\r\n<br>\r\n\"Come on Madoka! Mami will be waiting for us!\" Sayaka yelled back as Madoka panted slowly. Her tiny legs couldn't keep up with Sayaka's meatier ones, something which made her somewhat embarrassed. Madoka had never been a particularly good athlete anyway.<br>\r\n<br>\r\nSoon enough, the two girls found themselves by Mami's side, the obese Puella Magi idly snacking on snack foods as she waited by her classroom door. A warm smile instantly appeared on her face as she saw the slightly chubby blue haired girl and the exhausted petite pink haired girl. She quickly finished off her current snack before happily conversing.<br>\r\n<br>\r\n\"Ah, I'm so glad you're so enthusiastic!\" Mami's eyes looked over to Madoka \"I do hope you enjoy this experience dear, I can assure you my pace is not on par with your friend's speed.\" She dipped her hand down her massive cleavage and plucked out a bag of old fashioned sweets, passing them over to Madoka. \"You can eat these on the way, they'll perk you up!\"<br>\r\n<br>\r\n\"We ready to go now? I'm ready and willing!\" Sayaka swung her baseball bat a few times, causing a few glances to be passed in her direction. She was soon stopped by Mami, who placed a plump hand in the end of the bat.<br>\r\n<br>\r\n\"Save that kind of vigour for the witch~\" Mami took out her soul gem briefly, shining the same brilliant golden sheen from before. \"If I'm correct Kyubey said he felt the energy coming from this direction.\" With that, the massive blonde beauty waddled out of the school with her two trainees in tow.<br>\r\n<br>\r\nFor the next half hour, the girls made their way down to the shopping district and began combing the place. Mami wasn't surprised, given the amount of eating establishments in the area. Finding the right one was the tricky part, as it was akin to finding a needle in a haystack, given the sheer amount of places the witch could be situated.<br>\r\n<br>\r\nHowever, Mami finally saw her soul gem glow brighter. Sayaka was keen to note this. \"Hey, your gem is shining! The witch has gotta be near!\"<br>\r\n<br>\r\n\"Correct Sayaka! Now, to just pin point the exact location....\" This didn't take long, much to Sayaka's excitement. The gem was now near burning with energy, starting to radiate heat as they approached the location of the witch's barrier.<br>\r\n<br>\r\n\"Is this it?....\" Madoka questioned, munching at some liquorice. \"I don't see anything unusual here\" Before them was a cafe of sorts, a rather sizeable one with an outside area for eating. Right now it was rather busy, with many seats filled.<br>\r\n<br>\r\n\"Look a little closer Madoka. Notice the people.\" Mami noted.<br>\r\n<br>\r\nThat's when it hit the pink haired girl, with Sayaka shortly after. A vast majority of the customers at the cafe were massively obese, each one with a huge order at their table stuffing themselves with all sorts of meals. Even the few that were thin were eating at a ravenous pace.<br>\r\n<br>\r\n\"This is what the witches do, making barriers where food is available so they can work their influence. No wonder Kyubey could feel the energy here, all these people are ripe for harvesting.\"<br>\r\n<br>\r\n\"Harvest?\" Sayaka questioned.<br>\r\n<br>\r\n\"These people are full of fat energy. The witch is going to eat them. They are greedy creatures, never just satisfied with sucking the energy out of someone. They'll eat the body, bones and all.\" Mami had a distinct firm seriousness in her voice.<br>\r\n<br>\r\n\"That's horrible...\" Madoka trembled slightly.<br>\r\n<br>\r\n\"Thankfully, we're here to stop it.\" As Mami made her way to the entrance, she turned around. \"One more thing, do you girls feel hungry?\"<br>\r\n<br>\r\n\"Yeah, come to think of it...\" Sayaka rubbed her stomach whilst Madoka nodded in return.<br>\r\n<br>\r\n\"It's part of the witch's magic. Whatever you do, don't eat anything from the cafe. No matter how hungry you feel, don't do it.\" Mami patted her body a few times, searching for something. Eventually, she pulled two bags from her skirt pockets, a pair of squashed but still edible biscuits.<br>\r\n<br>\r\n\"Eat these to stave off the hunger. Now let's go and deal with some magical girl justice~\" Losing her serious tone, she smiled and gave a playful wink to the two girls, entering the cafe.</span></div></div>",
            "created":1394254800,
            "id":1757224,
            "title":"Operation Tutorial Witch is a go!"
        },
        "13111222121111122122112112121112111112":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "We follow the girls as they enter the witch's domain",
                "Whats Kyoko and Cernhil doing?"
            ],
            "content":"<div class=\"\"><div> <span>\"Stay close to me, and don't even think of eating those pastries. Otherwise you'll be trapped by the witch's thrall and become pray yourself,\" Mami warned as they walked through the cafe of gluttony and decadance, it's residents stuffing their faces and their flesh pressing against the table.<br>\r\n<br>\r\n\"Wehn you say it like that it does make me think,\" Sayaka replied, hands on her baseball as her head on a swivel. \"I mean, it smells so good...\" The bluenette licked her lips before shaking her head. \"No! Bad Sayaka! Food here bad! You can stuff yourself later on! Build up an appetite! Think of that!\"<br>\r\n<br>\r\nMadoka followed Mami's orders, only focusing on walking in front of her. \"So Mami, is the witch's barrier in this cafe?\"<br>\r\n<br>\r\n\"It is. My best guess is that it would be in the back, so keep a look out,\" the blonde answered as she opened the door into the kitchen and stepped right on through.<br>\r\n<br>\r\n\"There.\" She pointed towards the ice locker, it's door wide open and a distroted mass of color twisting within it's confines. That was the barrier no doubt. The obese Puella Magi transformed, her outfit somehow fitting all over her fat form. \"Stick close, and if I tell you to run, you run. Understand?\"<br>\r\n<br>\r\n\"Don't say that,\" Sayaka replied. \"You're saying as if you could die if you enter there.\"<br>\r\n<br>\r\n\"You never know.\" Mami said seriously. Madoka gulped, looking frightened. <br>\r\n<br>\r\n\"Ummm, can't we stay out here and-\" She sniffed the air, and licked her lips. \"Wow...that smells yummy.\"<br>\r\n<br>\r\n\"This is why you need to enter the barrier with me,\" Mami grabbed both of the girls. \"Because the longer you stay out here, the betetr the temptation to eat the witch's confections and fall under it's thrall. Come, and stay close.\" And the tubby Puella Magi and her two friends entered the barrier.</span></div></div>",
            "created":1395291600,
            "id":1763632,
            "title":"Mami searches for the Barrier entrance"
        },
        "131112221211111221221121121211121111121":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "Downtime with Cernhil and Kyouko",
                "Free Choice"
            ],
            "content":"<div class=\"\"><div> <span>Soon the trio entered the barrier and were witness to a strange and whimsical world. Witch barriers were designed in such a way to confuse all who enter and this one was no exception.<br>\r\n<br>\r\n\"I don't think I'll ever get used to this.\" said Madoka, holding onto the plump Mami as hard as possible. Sayaka didn't say anything but she was quite on edge as well. Clutching her bat, she was ready to whack anything that would even think of hurting the pink haired princess. They all proceeded with caution, Mami making sure to be aware of everything in order to protect the girls from any harm. Madoka and Sayaka simply continued to see the distorted world around them, seeing how things would twist and change without warning. Sniffing the air, Madoka could still smell the sweet fragrance lofting about.  Eventually the trio would reach the very core of the witch's domain, and a very sinister pressure could be felt.  <br>\r\n<br>\r\n\"Alright, the witch is just beyond here. I'm afraid you two won't be able to go any further.\" she said, forming a magic ribbon in her hands. Sayaka and Madoka stared at her, a bit confused at what she meant.<br>\r\n<br>\r\n\"Hey, didn't you say you would protect us? How could you just leave us?\" asked the blue haired girl, her anger slightly rising. <br>\r\n<br>\r\n\"Don't worry you two, I'll set up a barrier so you'll be safe from familiars.\" said Mami as she released the magic ribbon which swirled around the other two girls, forming a golden transparent barrier. Madoka touching the wall of the barrier, it felt quite warm and she began to feel more at ease. <br>\r\n<br>\r\n\"Be careful Mami.\" said Madoka, her pink eyes shining with concern. Mami nodded as she ran out and jumped into the center room, her figure jiggling wildly due to the impact. Feeling the pressure intensify, the magical girl saw the witch in front of her, with her familiars dancing all over.  Raising her body, Mami calmed herself as she gazed upon the hideous witch, it's fly like face and bulbous body flailing wildly. <br>\r\n<br>\r\n\"Well, time to get to work.\" said Mami as she lifted her skirt, causing a multitude of muskets to fall out and accidentally showing off her pillow-like thighs and stretched out white panties. Taking a musket in each hand, she began to fire at the familiars that were starting to surround her, discarding each gun after only a single shot. Twirling around, picking up more and more muskets, she continued her onslaught, destroying most of the familiars and doing some damage to the witch itself. Before she could conjure up some more weapons, the witch had managed to strike Mami and used tentacles to hold her in the air, ripe for a finishing movie. Being held upside down, her skirt failed to cover her voluptuous lower half, showing off her underwear for both Madoka and Sayaka's pleasure. Her immense gut and bouncy breasts drooped downwards as well, causing her to feel a bit disoriented.<br>\r\n<br>\r\n\"Wow, those are pretty big.\" said Madoka with a flushed face, somewhat mystified at the large white expanse laid out in front of her despite Mami's apparent danger.<br>\r\n<br>\r\n\"Huh, think I could ever fill those out?\" thought Sayaka to herself. With her two friends simply watching, Mami was about to be struck with two more tentacles, however, the girl smirked as magical ribbons burst out of the ground and surrounded the witch, entangling it and putting a great deal of pressure on the strange entity. With the witch incapacitated, Mami was released and landed on the ground with a heavy thump. <br>\r\n<br>\r\n\"It seems that you've managed to embarrass me in front of my friends. I won't forgive that.\" said Mami with a smile as she started to glow with a yellow light. Removing the ribbon that was cutely adorned on her chest, she threw it in the air. Swirling around in the air, three heavy cannons fell on the ground near her. Locking down all three flints, magical energy began to gather within the barrel, the pressure now being felt from Mami herself,<br>\r\n<br>\r\n\"Say goodnight. Triple Trio Finale!\" yelled Mami as all three flints exploded, causing the magical energy to fire out, combining into one giant blast. The witch unable to move and only watched their demise happen in front of them. The blast hit the witch, overloading it with magic power and causing a giant explosion. With the witch defeated, Mami caught the grief seed and stored it safely in her pouch. Soon, the barrier diminished, returning all three into the real world in the storage room of the bakery.<br>\r\n<br>\r\n\"Mami, that was incredible!\" screamed out Sayaka as she ran up and hugged the now untransformed Mami, Feeling herself sinking into her flab, Sayaka felt quite warm as her face began to heat up. Mami returned the hug, wrapping her heavy arms around the girl, surrounding her in a nice circle of softness. <br>\r\n<br>\r\n\"Why thank you, I couldn't have done it without you two cheering me on.\" she said, squeezing her tighter. Madoka smiled at well, glad to see her friends were perfectly fine. Still one thought persisted in her mind.<br>\r\n<br>\r\n'Those panties were really big...'  thought the girl, staring at Mami's corpulent lower half. </span></div></div>",
            "created":1395550800,
            "id":1765615,
            "title":"Triple Photo Finish"
        },
        "1311122212111112212211211212111211111212":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "Homura heads back home.",
                "Back to Kyoko and Cernhil"
            ],
            "content":"<div class=\"\"><div> <span>With Sayaka trapped in a tight squishy embrace, Mami couldn't be happier. \"Come Madoka, join us why don't you?\"<br>\r\n<br>\r\n\"I think I'll be fine MamAAAHH!\" Without warning the timid girl found herself dragged into Mami's massive body by Sayaka, falling flat into her flesh and soon crammed into it with a soft thick arm. Mami giggled as she squashed her friends into her titanic frame even more, before letting them go so to have them speak.<br>\r\n<br>\r\n\"I do think a celebratory tea party is in offer, am I right girls?\" She suggested to her much smaller friends, Sayaka nodding rapidly at the suggestion and Madoka gasping for air after being crushed into Mami's breasts.<br>\r\n<br>\r\n\"I do think we're in agreement....\" She looked over at the doorway of the storage room. \"Maybe you'd like to give your thoughts, Miss Akemi?\"<br>\r\n<br>\r\nBoth Sayaka and Madoka turned to the door to see none other than Homura, her somewhat chubby body filling up the doorway. \"So you still insist on trying to lead them to their deaths?\"<br>\r\n<br>\r\n\"Death only occurs to the careless. I can assure you Madoka and Sayaka are far from that.\" Mami replied defiantly, hands on her wide hips.<br>\r\n<br>\r\n\"The only careless person her is you. Taking normal people into a witch barrier is an idiotic idea.\" Homura scowled harshly.<br>\r\n<br>\r\n\"I don't like your tone there Homura.\" Mami was scowling too now, waddling forward to press her massive belly into Homura's much slimmer one. \"I do believe that you should mind your own business and let these girls choose if they want to be magical girls.\"<br>\r\n<br>\r\n\"Come from you? You're close to forcing them to become magical girls yourself!\" Homura pointed a long accusing finger, almost going into Mami's soft breasts. \"If you ever try to do this again, the consequences will be severe.\"<br>\r\n<br>\r\nMami frowned at the threat, but then she took notice of Homura's soul gem, situated on her hand during her magical girl form. Slipping out her reward from the recent witch battle, Mami took the small object and lifted it up.<br>\r\n<br>\r\n\"I think that's quite enough from you. I think this will quieten you for a while.\" With the tiny piece between her thickened fingers, Mami placed it squarely onto Homura's soul gem. The purple haired girl only had a second to react, reeling back from Mami as a strange feeling encompassed her entire body.<br>\r\n<br>\r\nBefore her eyes, Homura found herself getting fatter. Her stomach went from pooching out slightly to hanging well over her skirt. Her ass was hidden even less by her skirt. Her breasts jumped up a whole two cup sizes. Her double chin became more defined. In an instance, Homura had put on a good 40 pounds. She was completely speechless.<br>\r\n<br>\r\nMami covered her mouth as she giggled, Sakuya bursting out laughing behind her. Turning around, the obese Puella Magi explained. \"And that is how grief seeds work. I picked it up just after the witch was defeated. As you can see, it'll give you a nice helping of weight gain as Miss Akemi has discovered. Which reminds me...\" She turned back to the angered Homura. \"I'll accept a thank you any time. Granted you hate being fat, but as a magical girl you'll come to be thankful.\"<br>\r\n<br>\r\n\"You...How dare you!\" Homura barked, seething with anger. \"You will pay dearly for this!\" In her rage Homura stormed out of the store, her larger rear clearly seen as she left.<br>\r\n<br>\r\nMami clasped her hands together \"Well now, that nuisance is out of our hair. I think our tea party is still valid, right girls?\"<br>\r\n<br>\r\n\"Hell yeah!\" Sayaka fisted pumped while Madoka remained silent. The events before her had neither encouraged nor discouraged her from becoming a magical girl, but it had certainly shown her a stronger insight into the mysterious Homura, her reasoning and actions.</span></div></div>",
            "created":1396069200,
            "id":1770415,
            "title":"After-fight aftermath"
        },
        "13111222121111122122112112121112111112122":{
            "author_id":"zarusexic",
            "author_name":"Zaru",
            "choices":[
                "Back to Homura. How is she taking her new weight?",
                "Cut to Mami, Madoka, and Sayaka"
            ],
            "content":"<div class=\"\"><div> <span>The sound of gurgling made Cernhil open his eyes, groaning as he sat up, his white hair in a mess. The alien looked down and saw a sleeping Kyoko, some droll on her lips as she mumbled in her sleep. He then looked down at her obese form, in which last night's stuffing was digested, making her belly bigger and softer, her breasts perkier and larger, and her thighs wider. He imagined she must chafe a lot and wears denim booty shorts for such an occasion. He turned towards the window, seeing that it was still dark, but he could see the fringes of this planet's sun starting to come up. This must be dawn then.<br>\r\n<br>\r\nHe then heard her belly gurgle again as the sleeping beauty awaken, yawning cutely as she looked up.<br>\r\n<br>\r\n\"Mornin' Scales.\"<br>\r\n<br>\r\n\"Good morning yourself.\" He placed a hand on her doughy and large middle. \"Hungry are you?\" The redhead laughed a placed a hand on her gut.<br>\r\n<br>\r\n\"You think?\" She stood up...and then multiple rips were heard and a snap.<br>\r\n<br>\r\nThere goes her bra and panties, snapped due to her newest girth. Kyoko, despite being modest and not caring if people looked upon her fat body, became as red as an apple and covered her breasts, sitting up with a surprising amount of strength.<br>\r\n<br>\r\n\"D-Don't look!\" She cried out, looking at the ground. Cernhil continued to stare.<br>\r\n<br>\r\n\"Your undergarments were destroyed. I take it if we are to move on we will need to gain new undergarments yes?\"<br>\r\n<br>\r\n\"Y-You think! Idiot alien...\" She grabbed some blankets and covered herself. \"I-I need some new undies and-“ She perked up, as does Cernhil.<br>\r\n<br>\r\n“Kyoko. Do you?”<br>\r\n<br>\r\n“Yeah.” Kyoko’s tone of voice became serious as she looked out the window. “I can sense a witch. It’s…it’s in town for sure. And it’s a strong one.”<br>\r\n<br>\r\n“How strong?”<br>\r\n<br>\r\n“Might be the strongest I have faced…” Kyoko actually looked nervous, and Cernhil placed a hand on her shoulder.<br>\r\n<br>\r\n“What’s wrong? Are you-“ He was cut off guard by her hugging him, the fat and obese Puella Magi hugging him nude. “K-Kyoko…”<br>\r\n<br>\r\n“Can I be honest with you?”<br>\r\n<br>\r\n“Of course you can.”<br>\r\n<br>\r\n“I’m…a bit nervous about this witch. The aura feels so strong and-“<br>\r\n<br>\r\n“It’s alright.” Cenrhil said, embracing her and the redhead gasped. “I will come with you to fight that thing.”<br>\r\n<br>\r\n“It isn’t even your fight, I’m…I’m a bit scared is all…”<br>\r\n<br>\r\n“Didn’t you say the fatter you get, the stronger you become?” Asked Cernhil, lifting her chin up as he looked into her eyes. She nodded. “Then all we need to do is make you larger, and your fear should be gone. Right?”<br>\r\n<br>\r\n“Well…I am naked still…”<br>\r\n<br>\r\n\"Not that I care, but you’re in the comfort of your own home. Shouldn’t you be fine naked?” He asked. Kyoko blushed and looked at him with a pout.<br>\r\n<br>\r\n“Mou~, you pervert.” Kyoko looked away, but then looked back at the alien. “G-Guess I’ll be staying inside all day wearing a bathrobe…”<br>\r\n<br>\r\n“I wouldn’t object to that. And who are you calling pervert. You hugged me and you’re nude.” He got a light punch to the shoulder.<br>\r\n<br>\r\n“Because for that,” she pushed him onto his back and she pounced him, making him grunt as she looked down at him grinning. “You’re going to bring me food from the fridge and cellar.”<br>\r\n<br>\r\n“How much and what kind?” He looked up at her, his hands going right to her fat ass and groping it. Kyoko let out a light mew but grinned.<br>\r\n<br>\r\n“All of it.” She replied, grinding her fat gut against him. “And, I will be using you as my wonderful seat as I stuff my face. And you’ll feed me as well.”<br>\r\n<br>\r\n“If your belly doesn’t block my arm’s progress,” purred Cernhil as he gave her ass a spank, making her coo as she got off of him and she rolled onto her side, hands on her giant gut.<br>\r\n<br>\r\n“Now go and get your red queen food. All of it.” She licked her lips and Cernhil gave her belly a grope as he stood up and left the room.<br>\r\n<br>\r\nIf this could be the last several days, then damn it they will make the most of it.</span></div></div>",
            "created":1397278800,
            "id":1777650,
            "title":"Back to Kyoko and Cernhil"
        },
        "131112221211111221221121121211121111121222":{
            "author_id":"okamialpha",
            "author_name":"okamialpha",
            "choices":[
                "The Run in with Homura",
                "Free Choice"
            ],
            "content":"<div class=\"\"><div> <span>The day had come, the pressure in the air was enough to suffocate even those who were unaware to magic. Madoka and Sayaka walked towards the park, where they would meet their rotund friend. This was the big one, a witch that would be enough to essentially provide enough energy to double a girl's weight. Madoka herself was a bit nervous, having a feeling in the back of her head that something could easily go wrong. Sayaka herself was in a much more cheerful mood, currently munching on a donut as she patted her potbelly. Since being introduced to the wonderful world of 'food' by Mami, Sayaka had been quite invested in her own gain, now putting on a clear 30 pounds onto her formerly sporty frame. With softer thighs, a bouncier bust and rounded cheeks, the blue haired girl carried the weight rather well. As they arrived at the park, it was rather empty, something that made Madoka even more nervous. Sitting down, Sayaka had a rather big grin on her face.<br>\r\n<br>\r\n\"Man, I'm so excited Madoka!' shouted Sayaka as she continued to stuff her face. <br>\r\n<br>\r\n\"Y-Yeah, m-me too.\" stuttered out the pink haired girl, clutching her knees in nervousness. As Sayaka was ever oblivious, she failed to notice how nervous her friend was. Soon enough, Mami strolled onto the scene, dressed in a rather form fitting ribbed sweater that outlined her hefty gut and plentiful bosoms and a long skirt that served to accent her thick legs and overfed rear. Like Sayaka, she was munching on an eclair, a bag clutched in her chubby hands that was most likely filled to the brim with desserts.  <br>\r\n<br>\r\n\"Hello you two.\" said Mami with her elegant voice as she approached the two. Both of them stood up, only to be hugged dearly by the oversized blonde.  <br>\r\n<br>\r\n\"Hello Mami...\" said Madoka as she was being pressed against the other girl's massive breasts. It was quite soft, like cuddling with a pillow. Sayaka however took this as an opportunity to grope the blonde's massive belly, squeezing the bottommost roll.  <br>\r\n<br>\r\n\"Now then, are you two ready to head out?\" said Mami as the trio separated.  With soft nods from the other two girls, Mami led them to where the witch's domain was located.  In a local alley way, the domain slowly spread out and engulfed the trio of girls, all of them having the resolve to see things through.<br>\r\n<br>\r\n\"Alright, here it is.\" said Mami as she transformed into her magical girl attired, her overstretched orange panties being visible for just a brief moment on her well-padded rear. <br>\r\n<br>\r\n\"I still want to touch it...\" whispered Madoka to Sayaka as they saw the rather lewd moment. Sayaka nodded, wondering if she could ever pull off such a look. <br>\r\n<br>\r\n\"Alright then, let's go.\" With a nod, the two followed, Madoka opting to clutch onto Mami's soft arm just in case.  </span></div></div>",
            "created":1399611600,
            "id":1793901,
            "title":"Dose of Innocence "
        },
        "1311122212111112212211211212111211111212221":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "When Homura comes to, Mami has a little fun with her...",
                "Have a check up on Cernhil and Kyoko."
            ],
            "content":"<div class=\"\"><div> <span>Being inside a witch's barrier was one Madoka had never really gotten used to. The air always felt weird, as if the wind blew unnaturally through her pink locks or that it felt oddly stagnant in the locked off world. This barrier was no exception, as the entire air of the barrier smelt weird. It was sweet, but not just any sweet. Sickly sweet was the term to use, as the moment they were inside the barrier they could see that the world was pretty much a dreamworld. <br>\r\n<br>\r\nCakes, Chocolates and Candy were all that could be seen for miles. The floors were a soft sponge, a nearby river made entirely of melted chocolate, a mass of structures seemingly random collaborations of foods, whether it be giant lollipops or oversized towers of confectioneries. Oddly enough, some of them still bore wrapping paper, allowing the girls to spy and spot all their favourite brands all across the barrier.<br>\r\n<br>\r\nWith her greedy mouth near salivating at the sight, Sayaka rushed over to a hefty cream cake, about the size of a table and oozing jam from it's sides. Digging her hand into the treat to get a good armful of cream, jam and sponge, her mouth opened to eat it before having her hand grabbed rather forcefully by Mami, who'd seemingly appeared out of nowhere. Despite her unusual strength for a girl of her size, she retained a warm smile as she held Sayaka's arm, giving a slap with her other hand so to smack the piece of cake from the hungry girl's hand.<br>\r\n<br>\r\n\"Witch's food, remember?\" Mami reminded her, Sayaka recalling back to the restaurant from before. \"While I do admire your enthusiasm and commitment to gaining weight, please refrain from doing it here. I don't want to have to roll you out of the barrier now!\" Giving a short giggle, she let go of Sayaka's arm, walking back over to Madoka with her massive rear shaking with every step. The blue haired girl was a little dumbfounded staring at it, but soon snapped out of her stare before joining her friends once more. Whilst disappointed at missing out on sampling the barrier, Mami was right. Sayaka would be a pretty terrible magical girl if she was an immobile blob that was only good at eating.<br>\r\n<br>\r\nThe trio continued through the labyrinth of sweets, surprisingly uneventful. There were very few familiars the girls had to deal with, only the occasional straggler which proved so useless that Sayaka was able to defeat them by simply stomping them into the ground. She was able to get a good kick out of it, enjoying at least being helpful in some manner despite not being a magical girl yet. Meanwhile, Madoka remained close by Mami's side. Holding onto her chubby hand, Madoka found herself more relaxed than she'd ever been in one of the strange barriers. Ever since they'd met, Mami was pretty much a big sister to her, with obvious emphasis on big. Not only was Mami caring a seemingly motherly, but she was great to have around. Her round plush body was great for hugs, she was always warm to the touch, no matter how she dressed her fat seemed to keep her insulated. Not thinking about her actions, Madoka found herself snuggling up to Mami, wrapping her thin arms around Mami's plump one. Of course the obese magical girl noticed this, smiling to herself as her pink haired companion was lost in the warmth of her body, happily squeezing her meaty arm.<br>\r\n<br>\r\nHowever it wasn't meant to last. In that moment, Mami sensed a presence nearby. Outright yanking Madoka from her arm and pushing her over to Sayaka, who'd just finished stomping another hapless familiar, the two girls watched as Mami isolated herself on the main path, her blubbery body tense and her face defiant as she prepared herself for whoever was there. The entity made itself known, dropping down in a flash before Mami. As she expected, it was none other than Homura, looking just as chubby as she did before, her stomach notably pudgy with a modest set of breasts and rather thick thighs.<br>\r\n<br>\r\n\"You\" The venom in Homura's voice could dissolve metal, practically snarling her words out.<br>\r\n<br>\r\n\"Greetings once more Homura. I see you're looking much more healthy.\" Mami responded, smiling lightly with a calm demeanour. \"It's nice to see your weight has bulked up since I last saw you. Given by your frown, I imagine the infamous Magical Girl cravings have gotten to you?\" Mami couldn't help to cover her mouth to laugh slightly. \"I spy those specks of sauce on your cheek. What was it? Barbecue or club sandwich?\"<br>\r\n<br>\r\nHer anger was at a tipping point, Homura was already livid enough as it was. It was enough dealing with those cravings, yet the gluttonous hog before her decided that giving her a good 30 pounds onto her body was a good idea. Homura wouldn't let this stand. With quick dexterous hand movements, she froze time to work on the most evil deed she could think of.<br>\r\n<br>\r\nAfter a brief time freeze, Homura was back where she stood. Mami was too, but she felt oddly chilly. Looking at herself, she noticed what her rival had done. Barely being able to see past her massive body, it was shown that Homura had stolen Mami's skirt, allowing her oversized, stretched orange panties to be on full display. Not only that, but there was a message on the back of the panties.<br>\r\n<br>\r\nMadoka only stared with wide eyes, amazed at just how huge Mami's rear really was under her skirt. Sayaka took the time to read the message wrote on Mami's panties, seemingly wrote in with permanent marker.<br>\r\n<br>\r\n\"Your Mami is so fat, she goes through cakes like she goes through muskets....\" For a moment, Sayaka allowed that to process. A second later, she was on the floor barely able to breathe, her laughter bellowing through the whole barrier. She slammed her fist on the ground as if begging for herself to stop laughing.<br>\r\n<br>\r\n\"Well that's just downright rude.\" Mami folded her arms, tucking them under her heavyset breasts. \"I'm disappointed in you Homura for resorting to lowbrow humour. Now give me my skirt back or I'll need to resort to punishing you.\"<br>\r\n<br>\r\nHomura merely stood there scowling at the morbidly obese Puella Magi. Purple eyes locked with golden eyes before the much heavier girl tutted.<br>\r\n<br>\r\n\"You'll come to regret your choice Homura.\"  Having essentially declared battle, Homura and Mami took action. The black haired girl whipped out a pair of dual pistols, in which Mami was easily able to dodge with some elegant flips to dodge. She was a master of controlling her own bulk, allowing her to avoid every bullet with ease. Now came the fun part. Knowing she'd freeze time to reload, Mami didn't waste a moment to bring out her magic ribbons, flicking them out just before Homura could fire a single new shot. The ribbons snatched the pistols out of her hands and threw them into the background, allowing Mami to rush up to her opponent. However, neither girl attacked. Instead, Homura turned around whilst Mami did a complete 180 front flip over her, to which the moment she landed Homura retrieved a shotgun from her hammerspace arsenal,all ready to blast her blubbery rival into the next century. Sadly for her, Mami was one step ahead. The very moment she landed, being the very moment Homura equipped herself, Mami's trusty ribbons had already swooped down past her legs and across to Homura's wrapping around her to trip her up. Landing flat onto her face, Homura found herself hanging upside down whilst Mami snatched the shotgun out of her hands, snapping it into two with sheer strength.<br>\r\n<br>\r\n\"I think a clear victor can be seen.\" Mami announced, looking over at her incapacitated rival. \"If you apologise to me now I may just let you go and I'll pretend this never happened.\"<br>\r\n<br>\r\nHomura wasn't having any of it though. While unable to use her time powers with the shield, she was still able to swing herself forwards to give Mami a firm smack to the face with the metallic object, a solid hit which sent her off balance, almost losing control of her ribbons over her.<br>\r\n<br>\r\nRegaining her balance, Mami looked back at Homura. The smile was gone. Madoka and Sayaka were in complete awe, as for the first time ever they saw Mami being legitimately angered. In an instant, a sea of ribbons flooded forth, tying up Homura incredibly tight. From leg to shoulder she was trapped, no way of her escaping the hold. Taking hold of every ribbon she'd made, Mami grabbed with both hands and began to swing. Around and around, Mami swung Homura at a blistering pace, until with a mighty throw, she flung Homura high up into the air. The ribbons came apart in the ascent, but it meant nothing as the crushing sensation had left Homura weak. By the time it came for her decent, she was in complete freefall, her body limp.<br>\r\n<br>\r\nThis was Mami's moment to shine. Her eyes remained on Homura as she fell. Watching, she positioned herself carefully just before where she was going to land. She was close to the ground now, almost there now. Then, with perfect timing, Mami struck. Slamming Homura squarely with her gargantuan stomach, just before she was going to hit the ground, With absolute sheer force, Mami's belly sent Homura careening straight into a massive chocolate bar, the whole thing crumbing over as Homura was knocked unconscious.<br>\r\n<br>\r\nMadoka and Sayaka were speechless. Turning their attention to Mami, her classic smile was back again.<br>\r\n<br>\r\n\"What? I've always wanted to belly bounce someone in a fight!\"</span></div></div>",
            "created":1402549200,
            "id":1811214,
            "title":"Chaotic Candy Confrontation Carnage"
        },
        "13111222121111122122112112121112111112122211":{
            "author_id":"lightshadow4",
            "author_name":"searcher4",
            "choices":[
                "The witch traps them."
            ],
            "content":"<div class=\"\"><div> <span>The witch just then appears right behind mami. \"what\" was all the obese magical girl got out before the witch encased her in chocolate and unable to move.<br>\r\n<br>\r\nboth madoka and sayaka both screamed in horror at what just just happened. The witch then takes notes both the girls.</span></div></div>",
            "created":1417237200,
            "id":1895441,
            "title":"Just then, the witch appears."
        },
        "131112221211111221221121121211121111121222111":{
            "author_id":"lightshadow4",
            "author_name":"searcher4",
            "choices":[
                "homura wakes up, frees mami, and the two of them defeat the witch."
            ],
            "content":"<div class=\"\"><div> <span>The witch upon seeing seeing the two girls gabs them with one hand. \"Someone help\" madoka cries. \"let us go\" sayaka yells. The witch then grabs then grabs two small cakes and forces them down their throats. When the witch drops them, they both felt an odd sensation go through them. \"Sayaka, I don't feel so good\" madoka says madoka covering her stomach. \"I don't feel so hot either\" sayaka says doing the same. Then suddenly both girls expanded to mami's size. Both fell of balance trying to digest what had happened. Their attention then turns back to the witch now perpering to attack them.</span></div></div>",
            "created":1417288020,
            "id":1895445,
            "title":"The witch gets them."
        },
        "1311122212111112212211211212111211111212222":{
            "author_id":"lightshadow4",
            "author_name":"searcher4",
            "choices":[
                "Just then the witch apperses and mami and homura work togther.",
                "Free Choice"
            ],
            "content":"<div class=\"\"><div> <span>As they begin to enter the labyrinth, they caught a sweet sent in the air and when they fully entered the sight amazed them. The place was practically and candy and sweets coated wonderland. They started to explore and defeat familiars as they went. They ran into a familiar face.<br>\r\n<br>\r\n\"hello there\" homura says coming out of the shadows. mami then readys a musket. \"I'm not here to fight\" homura reassures them.<br>\r\n<br>\r\n\"I am here because, if you insist on bringing them to these place, we will have beater luck protecting them together\" the now more chubbier  homura says holding out her hand. Mami smiles and says \"then we agree on something\" shaking homura's hand. Leaving both madoka  and sayaka surprised, Madoka then smiles happily and then sayaka smiles and says \"I look forword to working with you\".</span></div></div>",
            "created":1417369020,
            "id":1895830,
            "title":"homura joins"
        },
        "13111222121111122122112112121112111112122221":{
            "author_id":"lightshadow4",
            "author_name":"searcher4",
            "choices":[
                "ig frabs them"
            ],
            "content":"<div class=\"\"><div> <span>The witch then suddenly makes an appearance. Both mami and homura look at one another then begin battling the witch. As the two corner it, the witch then pins both of them to the wall with a spray of marshmallow. \"What the...\" \"didn't expect that\" mami and homura respectively say struggling ageist it.<br>\r\n<br>\r\nJust when the witch was about to attack again. Sayaka grabs madoka by the arm and says \"hey witch, over here\". The witch then looks confusedly in their direction. Sayaka then charges in it's direction and starts hitting it with her bat in order to save the two magical girls.</span></div></div>",
            "created":1417370040,
            "id":1895843,
            "title":"the witch traps them both."
        },
        "131112221211111221221121121211121111121222211":{
            "author_id":"lightshadow4",
            "author_name":"searcher4",
            "choices":[
                "They win"
            ],
            "content":"<div class=\"\"><div> <span>The witch then grabs them and prepares to eat them. The two of them stare scared and mami and homura both scream no. Then suddenly the witch stops and strats sniffing them, it then starts staring them and looks at them and just see's them as talking fish bones. Then it makes a sound in disgust and shoves the two girls in a giant cake.<br>\r\n<br>\r\nEnraged, homura uses all her strength and helps both of the them escape and begin battling again.</span></div></div>",
            "created":1417370760,
            "id":1895852,
            "title":"(oops)it grabs them and mami and homura break free"
        },
        "1311122212111112212211211212111211111212222111":{
            "author_id":"lightshadow4",
            "author_name":"searcher4",
            "choices":[
                "The find madoka and sayaka on the ground, both obase."
            ],
            "content":"<div class=\"\"><div> <span>Mami opens up with shooting it with a few muskets. At the climax Homura catches it off guard with 3 grenades to the face. Giving mami the opening she needed to finish the witch with her tro final. The witch explodes and the two collect the grief seed as the labyrinth begins to dissipate.</span></div></div>",
            "created":1417371420,
            "id":1895861,
            "title":"They win"
        },
        "13111222121111122122112112121112111112122221111":{
            "author_id":"lightshadow4",
            "author_name":"searcher4",
            "choices":[
                "Madoka and homura at madoka's house.",
                "Sayaka visit's kyousuke"
            ],
            "content":"<div class=\"\"><div> <span>They then see both madoka and sayaka on the ground both 300 pounds each and their clothes ripped and tethered. Both ran over to see if they are ok and to help them up. \"are you Two alright\" they both ask. \"Aside from having a horrible stomachache and out clothes ruined, ya we're fine.\" sayaka says. \"Aw, what am I going to tell my parents\" madoka wines about her now heftier body. \"no wearies, we'll help you with that\" homura says reassuringly. \" I concur\" Mami then says.<br>\r\n<br>\r\nMami takes out some of her spar clothes to replace madoka and sayaka's ruined ones. They headed over to mami's apartment and discussed some post plans and they departed. Afterwards....</span></div></div>",
            "created":1417373160,
            "id":1895871,
            "title":"Madoka and sayaka fattend up."
        },
        "131112221211111222":{
            "author_id":"mcknight",
            "author_name":"McKnight",
            "choices":[
                "Kyoko and Pia's new experiences together",
                "Elsewhere..."
            ],
            "content":"<div class=\"\"><div> <span>Where the strange light landed laid an unconscious girl.  She had short, pale-green hair, and her clothes consisted of a yellow shirt, a black, pleated skirt, and black, thigh-high stockings.  She also wore a gas mask and carried some sort of canister on her back.<br>\r\n<br>\r\nShe eventually woke up, to find an odd, white, fox-creature of some sort.<br>\r\n<br>\r\n\"I thought I noticed something fall from the sky,\" said the Incubator.<br>\r\n<br>\r\n\"W-who... are you?\" the girl asked, removing her mask.<br>\r\n<br>\r\n\"You can call me Kyubey.  It looks like you will be needing some guidance.  I can already sense someone I've contracted on her way here.\"<br>\r\n<br>\r\n\"My name... is Wind Pier.\"<br>\r\n<br>\r\n\"Wind Pier...  Well, first thing's first, why don't you make a contract with me and become a Magical Girl?  I can grant you any wish of your choice, and give you the power to fight Witches.\"<br>\r\n<br>\r\n\"Witches... Sinners...  That must mean... that if I can kill enough of them, I will finally graduate back in my world.\"<br>\r\n<br>\r\n\"So you're interested, then?\"<br>\r\n<br>\r\nThe girl nodded.<br>\r\n<br>\r\n\"In that case, please tell me your wish.\"<br>\r\n<br>\r\nShe was too timid to voice her opinion, but Kyubey managed to read his mind while extracting a green, demon-head-shaped jewel from her chest, making her scream in agony.  The next thing she knew, her body swelled up within only seconds, complete with her clothes also expanding to fit and cover her.<br>\r\n<br>\r\n\"Your wish has surpassed entropy,\" said Kyubey.  <br>\r\n<br>\r\nThe girl, however, remained speechless as she looked down at her new build.  She brought her thickened fingers up to her swollen cheeks, and pressed them in.<br>\r\n<br>\r\nJust then, along came Kyoko to observe what was going on.<br>\r\n<br>\r\n\"Kyoko,\" said Kyubey.  \"You've gotten quite big.  This is my new recruit, Wind Pier.  Perhaps you could show her the ropes of being a Magical Girl?\"<br>\r\n<br>\r\n\"Wind Pier, huh?\" replied the redhead.  \"Sounds kinda like... Pia Undo.  Mind if I call you that?\"</span></div></div>",
            "created":1441140540,
            "id":2028841,
            "title":"At the end of the light lies... a new recruit!"
        },
        "131112221212":{
            "author_id":"veritax_95",
            "author_name":"Not Crazy",
            "choices":[
                "Hungry, Hungry Homura",
                "Kyubey watches over Homura, intrigued by her unusual attitude. ",
                "One month later..."
            ],
            "content":"<div class=\"\"><div> <span>What was happening to her? Homura grunted as she left her last class. Once again she had been unable to focus as her body was in too much pain - starving, starving, HUNGRY HUNGRY - for her to pain attention. She managed to hide most of the pain behind cold stare but now that she was on her way home she couldn't hold it up any longer. <br>\r\n<br>\r\n<i>She had to eat. No matter what.</i><br>\r\n<br>\r\nShe decided to rob a convenience store. She had usually been less concerned in the past because she has been only stealing from the Yakuza (all their weaponry), but this would have been a moral dilemma if she weren't so anguished.<br>\r\n<br>\r\nThankfully the store was near, about 50ft away from her position. Giving a quick look she activated her time stop as the doors of the store remained open and sped inside. Anything food, she took; pastries, buns, noodles, sushi, even junk she stored in her shield. She estimated that she stored about 500 packets of food in the weapon, but even that seemed not enough. It would do for the time being, she thought biting into an stolen donut as she left the store. <br>\r\n<br>\r\nShe arrived home as fast as she could move, tossing her bookbag aside as she went to her table and deactivated her time stop. Her body was shaking with pain as she sat down, cringing at the sudden ouch she let out. EAT. She released all the food items she could think to manage, began eating whatever she could. Her first item was a brand of particularly unhealthy chips she had heard about, but it was filled with calories. She tore open the bag and began stuffing her face with them. She grabbed for another handful but found none left, so she moved onto rest of the donuts, gulping down as much as she could. She could feel the pain disappearing as she consumed more and more until she had finished everything that she had immediately released. She was now still hungry, but not starving.<br>\r\n<br>\r\nA loud rumbling echoed from her stomach and Homura let out a loud satisfying belch from her lips. That felt so much better. This unnatural hunger HAD to be related to her Magic, there had been no other factors in other timelines that had made her this way. She growled to herself, it had to be Kyubey's fault again. The rat always some plan, usually involving making Madoka witch out. Like hell she would let that happen. <br>\r\n<br>\r\nHer stomach grumbled again, interrupting her thoughts with a haze of foodstuffs. She snapped out of it, but still relented to the hunger she definitely wouldn't let it get the better of her. She activated her shield, spilling more packaged and unhealthy food everywhere. She spied another calorie fueled chip packet and reached forward, but was stopped by something - her belly, which had grown significantly over the course of her feast. She blinked at it, and usually would have been horrified, but her own gluttony needed to be quenched so she opted to dive into another confectionery near to her. She would spend the whole night devouring what she took, and not studying or thinking of Madoka in the slightest. </span></div></div>",
            "created":1555165080,
            "id":2644290,
            "title":"What does Homura do after school?"
        },
        "1311122212121":{
            "author_id":"veritax_95",
            "author_name":"Not Crazy",
            "choices":[
                "Kyubey, who wants Homura to Witch Out! The amount of energy will be enormous!",
                "Kyosuke Kamijo, who has a hidden passion for larger women...",
                "A familiar rich girl...who is not as straight as she thought. "
            ],
            "content":"<div class=\"\"><div> <span>\"Have you seen Akemi-san? She's grown so <i>big</i> over the last month.\" <br>\r\n<br>\r\n\"She's even bigger than Tomoe-san and Miki-san were - combined!\" <br>\r\n<br>\r\n\"She's a whale that's for sure.\" <br>\r\n<br>\r\nHomura Akemi did not hear their words as she was too consumed by her newfound gluttony to care. The day and nights after that binge had banished any sense of care from her mind and she slowly began to forget her purpose for being here as when she did go out to do Magi work, it defaulted to defeating Witches and then going straight home after a detour to the nearest food-outlet. Food had become her world now, although she did spare. Where she would have normally tried to stop Mami's death, she had been gobbling down burgers from the nearest fast food store; where she should have stopped Kyoko and Sayaka's fight she had been watching a documentary and eating a third pizza; and when Sayaka had finally Witched out she had been in a food coma on her bed. <br>\r\n<br>\r\nHomura was literally the fattest girl in Mitakihara City. Her face had been pretty before, but was now melding with her third chin and jowls, wobbling whenever she stuffed herself. Her eyes always had a glaze in them as her attention was never fully, but were soon forced to near closure by her fat face. Her breasts were always small, but now they were fattened up, they resembled giant, half-deflated watermelons, threatening to pop out of whatever top she wore. Her belly was the biggest culprit though; a huge doughy orb that was in itself probably the size of a beanbag, it made her incredibly slow to the point she was failing and promptly excused from physical education - as she was never paying attention and didn't seem at all invested in losing her weight - and therefore useless as a Magi. Her legs and arms resembled over-fattened chicken wings and pig legs respectively, only possessing enough strength to carry around her books and class items. Her thighs and butt were a 'better' story among the school populace as the envy of the girls who watched their boyfriends stare in awe at her. Of course Homura was too distracted to notice this as the 500 pounds of girl was usually devouring any food before her, thinking of her next meal, or both. <br>\r\n<br>\r\nHowever someone was watching her intently, watching her growth and plushness increase as the month went on. This person was...</span></div></div>",
            "created":1555914000,
            "id":2648300,
            "title":"Hungry, Hungry Homura"
        },
        "13111222121211":{
            "author_id":"veritax_95",
            "author_name":"Not Crazy",
            "choices":[
                "Gretel the Glutton Witch"
            ],
            "content":"<div class=\"\"><div> <span>This girl was ready. When Kyubey had first seen Homura Akemi he had been very wary of her as she hadn't seemed aware of the rules as a Magi, and was far too thin. At first. As the month went on he watched the prospects in town dwindle down; the obese Mami was gobbled up by Charlotte, who was promptly stopped by the new magi Sayaka and Madoka, the former of which had recently Witched out and been killed in a suicide attack by Kyoko Sakura. Madoka Kaname had killed herself soon after learning the truth behind Witches. But Homura had been nowhere to be seen, he thought that she, as a Magi and apparently a friend of theirs, would have stopped them. <br>\r\n<br>\r\nNo. Instead she had broke off into her own little world of gluttony and bloated up into a apathetic 500 pound whale.Kyubey was currently following her home which was too easy as she had stopped at several food places on her way, leaving her likely to fall into a food coma when she returned home. He stopped when she reached the stairs of the building and climbed up the pillars as Homura took the stairs. The poor girl was wheezing and red-faced by the time she reached the top of the stairs, and Kyubey walked over. Homura's gaze was unfocused as she turned to it.<br>\r\n<br>\r\n\"You're an unusual specimen, Akemi Homura. I thought you were friends with those girls, and yet you allowed them to die. I know you can see me, and I know you are a Magi.\" Kyubey dodged her pitiful attempt at a swipe and prodded her plush leg with its tail. Homura didn't respond as she sat down, far too tired to argue or think. Her purple soul gem was looking very murky, almost ready.<br>\r\n<br>\r\n\"Shut up.\" Homura finally groaned in a deeper voice. <br>\r\n<br>\r\n\"It's your fault they died. Mami lost her head, Sayaka witched out, Kyoko and Madoka killed themselves-\"<br>\r\n<br>\r\n\"Madoka's dead?\" That got Homura's attention? Kyubey watched as Homura's eyes watered and genuine horror and sadness appeared on her face. A weakness.<br>\r\n<br>\r\n\"Yes, she did. She killed herself after she learnt what Witches were. <i>You</i> could have stopped her. <i>You</i> could have saved them. But instead they all died.\" Homura was outright crying at this point, her stomach heaving and her soul gem now completely black. \"<b><i>And its all your fault.</i></b>\" It hissed at her.</span></div></div>",
            "created":1556843160,
            "id":2654078,
            "title":"Kyubey, who wants Homura to Witch Out! The amou..."
        },
        "131112221212111":{
            "author_id":"veritax_95",
            "author_name":"Not Crazy",
            "choices":[
                "Magi are disappearing in Gretels barrier! Her familiars are cannibals!",
                "Oriko and Kiriko make their way to this barrier."
            ],
            "content":"<div class=\"\"><div> <span>Homura gave out one last cry just as her soul gem exploded outward, releasing all her despair, her horrors, her inner magic. Kyubey watched in wonder as the barrier began to take shape.. Magic runes floated gently through the air as the concrete walls change into a softer, cake-like texture. Kyubey focused on Homura's transformation.<br>\r\n<br>\r\nHer tears were still spilling but her face was turning bright red. Black seeds began to appear as her features melted away and her hair dropped out. Her head had turned into a strawberry, and she was still growing in size. Her uniform was shredded away and replaced by a black and white stripe bodysuit. A horrible zipping sound echoed as the Witch let out a groan, and a large mouth opened on its stomach region. Its human hands and feet had shriveled into roots. By the time she had finished growing, Homura's Witch was the size of the entire building. <br>\r\n<br>\r\nAnd Gretel <i>burped</i>.<br>\r\n<br>\r\nKyubey grinned. <br>\r\n<br>\r\n<br>\r\nONE MONTH LATER....</span></div></div>",
            "created":1556843460,
            "id":2654081,
            "title":"Gretel the Glutton Witch"
        },
        "132":{
            "author_id":"faczar",
            "author_name":"faczar",
            "choices":[
                "...Madoka, she is the one with limitless potential after all.",
                "...Mami, she is the most mature, it could make the first phase easier.",
                "Some other girl"
            ],
            "content":"<div class=\"\"><div> <span>A public library in the center of Mitakihara City, one of the biggest in fact. Shelves filled to the brim with books, magazines and other various works of literature, sorted by author, title, content and even keywords. Among these shelves, a creature lurked, it's looks much akin to a cat or a squirrel. It was our titular Kyubey, of course.<br>\r\n<br>\r\nHe decided to research the matter more thoroughly, as it was crucially important not to get it wrong. As awkward as it was at the start, when he only vaguely imagined what a \"bigger magical girl\" would look like, he finally narrowed down the desired outcome to a few different viable processes. In alphabetical order, they were called: impregnation, gaining weight and natural growth. There were more, but these seemed the most commonplace, according to the amount of literature on these subjects. Considering each of these, natural growth could be ruled out. It took too long, and he also read that females grow more slowly than males. Also, there was no record of a female achieving the volume he required with shear natural body growth.<br>\r\n<br>\r\nImpregnation seemed to be the result of human procreation. The child grows inside the female and this results in the belly swelling and stretching. The different balance in hormones also causes the female's breasts to increase in volume and weight, as they prepare to produce milk for the baby for when it is born. When reading books such as <i>First-time mommies</i>,<i>Carrying life</i> and <i>My tummy feels funny</i>, he noted that pregnancies usually end in increased weight for the female, as her appetite is increased, which can safely feed into the second possible method.<br>\r\n<br>\r\nWeight gain or gaining weight is much different to the former, as it seems to carry only a negative connotation, with many health disadvantages, such as increased blood pressure, less agility and body fitness, depression and in extreme cases death. These \"side effects\" can be safely disregarded, magical girls aren't supposed to have long lifespans anyways. Weight gain is achieved through continuous intake of foods rich in fat and sugar. What seems to be key is to never cease on the intake for too long, and also to increase food intake exponentially. Not much is written from here on, it only says that \"extremes kill\". Well, what's the worst that can happen?<br>\r\n<br>\r\nHe decided to combine the two. Pregnancy should be achieved artificially, and in such a way that it would show results immediately and produce no offspring. Besides, humans shouldn't suffer unnecessarily. Specifics will be determined later, but first, he needs a test subject. That will be...</span></div></div>",
            "created":1572982560,
            "id":2742758,
            "title":"Kyubey needs more research"
        },
        "15":{
            "author_id":"roninmogura",
            "author_name":"Ronin Mogura",
            "choices":[
                "Contract E",
                "Contract F",
                "Contract G",
                "Contract H",
                "Even more contracts?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The list goes on, huh?<br>\r\n<br>\r\nSure, why not. You know what they say, the more the merrier.</span></div></span></div>",
            "created":1308286800,
            "id":1127856,
            "title":"More contracts here."
        },
        "155":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Contracts I",
                "Contracts J",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here more Contracts for Madoka Magica.</span></div></span></div>",
            "created":1312606800,
            "id":1162554,
            "title":"Even more contracts?"
        },
        "1553":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Contract K",
                "Contract L",
                "More?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More contracts. What can I say?</span></div></span></div>",
            "created":1570175220,
            "id":2727761,
            "title":"OMO"
        }
    },
    "info":{
        "author_id":"roninmogura",
        "author_name":"Ronin Mogura",
        "brief_description":"An interactive focusing on recent anime, Madoka Magica, and Weight gain/expansion.",
        "created":1308306360,
        "description":"<td align=\"left\" class=\"norm\"><b>General Overview</b><br>\r\nPuella Magi Madoka Magica is an anime of the magical girl variety that's well known for it's dark subversion of the usual tropes associated with the genre it's apart of. The main premise of the series itself is that a cat-like being known as an Incubator gives girls the chance to have any wish they desire to be granted, at which point they will become a Puella Magi (or magical girl) and thus will be given the power to fight eldritch monsters known as Witches who pose a threat to the human populace being that they drive human victims to suicide and general cause chaos where ever they maybe.<br>\r\n<br>\r\nFor information regarding the series and it's concepts (WARNING: contains spoilers) -&gt; <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://wiki.puella-magi.net/\" target=\"_blank\">http://wiki.puella-magi.net/</a><br>\r\n<br>\r\n<b>Important Note</b><br>\r\nI realize that this anime, as popular as it maybe, is <i>incredibly</i> spoiler heavy and those who are allergic to them might not find too much enjoyment here being that alot of the elements of this interactive WILL have spoilers in them. Granted, it's nothing that takes place after the end of the anime series, but major plot points such as the evolution of Witches and an Incubator's true purpose are a few of the major points that will be touched on here.<br>\r\n<br>\r\nIf you don't mind spoilers, then by all means, continue. <br>\r\n<br>\r\n<br>\r\n+Fetishes that will appear during this story...+<br>\r\n- Stuffing/Weight Gain<br>\r\n- Pregnancy<br>\r\n- Vore<br>\r\n<br>\r\n<br>\r\nStandard rules apply...<br>\r\n- Only female characters are to expand. Although this doesn't exclude male characters from appearing at all in the interactive.<br>\r\n- Please put forth effort in your chapters.<br>\r\n- Nothing completely outlandish in regards of expansion.<br>\r\n- Let's try to avoid the overly gross situations such as toilet stuff and the like. Burps are fine (farts too, if you play it for comedy), but nothing past that please.<br>\r\n- This is an 18+ interactive so sexual situations are allowed, just...try not to go overboard with them. Use in moderation, basically and try not to have the story revolve too much around it.</td>",
        "id":1786042,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1572982560,
        "modified":1572982560,
        "pretty_title":"Plump Magi Madoka Magica"
    }
}