{
    "chapters":{
        "1":{
            "author_id":"sean9321",
            "author_name":"seanboi",
            "choices":[
                "CONTINUE"
            ],
            "content":"<div class=\"\"><div> <span>John was walking along the path near the open field on his way to his best friend mike's house.<br>\r\nHe came to the point where he usually cross's the road when all of a sudden the heavens open and in the midst of an instantaneous downpour of rain, a beam of light hit him directly in the forehead.</span></div></div>",
            "created":1356990360,
            "id":1498987,
            "title":"the change"
        },
        "11":{
            "author_id":"sean9321",
            "author_name":"seanboi",
            "choices":[
                "to the living room and watch some TV",
                "go to the kitchen and grab some food"
            ],
            "content":"<div class=\"\"><div> <span>You wake up from your strange experience, you can't remember what happened very well, but you soon came to full awareness.<br>\r\n\"Courtney I know you find the idea absolutely mortifying but it is for your own good\" you notice a tall maybe thirty year old women talking to her teenage daughter who you instantly recognise as Courtney kennedy, your nemesis.<br>\r\n\"Mom how am I supposed to just lay back and let you do that to me, I am capable of doing it myself\"<br>\r\n\"Honey these aren't the same as normal ones they have multiple straps either side and are bigger, the doctor said not even people who have been wearing them their whole lives can put them on by themselves, just look at them and see my point\" the women clearly Courtney's other moved her arm swiftly towards your point of view and pick you up, which begged the question \"What are you?\".<br>\r\n<br>\r\nCourtney took you from her mother's hands and began examining you ,whatever you are.<br>\r\n\"I guess I can see it now, but I don't think I need them just yet\".<br>\r\n\"honey look at you underwear, the incident at dinner you had tonight isn't the first, what are you going to do when it happens at school again, the whole school knows by now\"<br>\r\n\"I know, I just don't want to give into this\"<br>\r\n<br>\r\n\"come let's get you ready for bed Courtney\" she said pushing her daughter back on the bed.<br>\r\nIt was then as she unwrapped the towel fro around Courtney's waist did you realise her predicament, she had become double incontinent, you felt joy knowing this, you could destroy her.<br>\r\nThen Mrs kennedy moved you towards Courtney and you got a full face view of her lady parts.<br>\r\nShe began placing supplies down around courtney ,wipes , powder,lotion, what could they all be for you wondered.<br>\r\nThen she began to wipe Courtney's nether region's and you began to figure things out very slowly.<br>\r\nIt all clicked when she moved you and began to pull and stretch your body into painful shapes, that you fully began to understand your existence.<br>\r\nshe slipped you under her and dashed powder on her and soon had you pulled up around her waist, the yo wanted to shout it but couldn't \"holy shit , I'm a diaper\"<br>\r\n<br>\r\n\"There all done , see that wasn't so bad was it ?\"<br>\r\n\"No I guess not\" she said surprisingly honestly.<br>\r\nThen she got up and put on her night gown leaving you exposed as her pyjama pant's  would not fit over you.<br>\r\nshe decide to go</span></div></div>",
            "created":1356991380,
            "id":1498998,
            "title":"CONTINUE"
        },
        "111":{
            "author_id":"sean9321",
            "author_name":"seanboi",
            "choices":[
                "pee ",
                "pee and poop",
                "poop"
            ],
            "content":"<div class=\"\"><div> <span>She moved downstairs and sat down in the living room and watched the TV for a few hours, after a while she felt hungry and thirsty and went to get snacks and a drink of 7-up and some coffee.<br>\r\nafter another hour of TV you could feel her stomach rumbling.<br>\r\nIt got worse and worse and soon Courtney was leaking a little urine from her vaginal lips.<br>\r\nThen suddenly a loud fart tore from her behind, you brace yourself for the worst, but a fart was all it was.<br>\r\nonly ten minutes later courtney let loose her_____ all over you.</span></div></div>",
            "created":1356991740,
            "id":1499003,
            "title":"to the living room and watch some TV"
        },
        "1112":{
            "author_id":"sean9321",
            "author_name":"seanboi",
            "choices":[
                "going to get changed by her mother",
                "going to bed"
            ],
            "content":"<div class=\"\"><div> <span>you wished you could scream at your impending fate as you felt her twist her legs to keep her urine in.<br>\r\nYou felt her bowels rumble with eagerness to release into your very existence.<br>\r\nThen it happened, she let loose and you felt a warm sensation spread through your front and it slowly picked up weight and then the rumbling grew louder and her bowels unleashed hell, thump! thump! as her shit mashed  into you , the smell made yo want to kill yourself.<br>\r\n<br>\r\nshe sat there for another hour before.</span></div></div>",
            "created":1356991980,
            "id":1499005,
            "title":"pee and poop"
        },
        "11121":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Courtney",
                "a member of her family"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you going back on Courtney<br>\r\nor a member of her family </span></div></span></div>",
            "created":1422668580,
            "id":1925866,
            "title":"going to get changed by her mother"
        },
        "11122":{
            "author_id":"sean9321",
            "author_name":"seanboi",
            "choices":[
                "morning (changing)",
                "morning(mom not there)"
            ],
            "content":"<div class=\"\"><div> <span>it becomes clear to john that courtney knows she has messed herself.<br>\r\nCourtney thought about waking her mom up to change her, but she thought better of it and decide to wait until morning.<br>\r\nstill feeling hungry went to the kitchen and made herself some oatmeal before bed, she ate it very quickly as she wanted to go to bed.<br>\r\n<br>\r\nAs she walked up the stairs john was squished between her cheeks, poop mashing into courtneys skin.<br>\r\nshe hopped into bed and dozed off.<br>\r\n<br>\r\nThroughout the night she tossed and turned while you sat there pondering if you would end up in the trash or as another diaper.<br>\r\n<br>\r\nat around 4:30 or so you guessed, she started farting, john looked up to see her anus twitching.<br>\r\n<br>\r\n\"no,no,no please don't not again\" he thought, but it was too late as the sloppy poop poured out from her asshole and filled him with vile liquid.</span></div></div>",
            "created":1359819420,
            "id":1522531,
            "title":"going to bed"
        },
        "112":{
            "author_id":"sean9321",
            "author_name":"seanboi",
            "choices":[
                "poop",
                "pee and poop"
            ],
            "content":"<div class=\"\"><div> <span>She moved downstairs and sat down in the living room and watched the TV for a few hours, after a while she felt hungry and thirsty and went to get snacks and a drink of 7-up and some coffee.<br>\r\nafter another hour of TV you could feel her stomach rumbling.<br>\r\nIt got worse and worse and soon Courtney was leaking a little urine from her vaginal lips.<br>\r\nThen suddenly a loud fart tore from her behind, you brace yourself for the worst, but a fart was all it was.<br>\r\nonly ten minutes later courtney let loose her_____ all over you.</span></div></div>",
            "created":1359818940,
            "id":1522529,
            "title":"go to the kitchen and grab some food"
        }
    },
    "info":{
        "author_id":"sean9321",
        "author_name":"seanboi",
        "brief_description":"A girl I despise, who I can;t stand to see and I end up in a position so below her.",
        "created":1356894900,
        "description":"<td align=\"left\" class=\"norm\">the main character john turns into an item of urinary protection for his nemesis Courtney, she is entirely unaware and this leads to a life of torture for john.<br>\r\n<br>\r\nsex allowed,<br>\r\nno changing john back unless it is for a brief period and into a shrunken version of john 6 inches max.<br>\r\nurine and messing allowed.<br>\r\ncourtney must remain uaware.<br>\r\njohn cannot die.<br>\r\nhe may be switched to other members of courtney's family.  </td>",
        "id":1910831,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1422668580,
        "modified":1422668580,
        "pretty_title":"life as here diaper"
    }
}