{
    "chapters":{
        "1":{
            "author_id":"gronk",
            "author_name":"Gronker",
            "choices":[
                "Jenna",
                "Sheba",
                "Mia",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><br>\r\nWho will gain weight?</span></div></span></div>",
            "created":1143867600,
            "id":310039,
            "title":"Who Will gain?"
        },
        "11":{
            "author_id":"gronk",
            "author_name":"Gronker",
            "choices":[
                "Jenna enters alone",
                "The party follows along with her",
                "She is joined by Sheba"
            ],
            "content":"<div class=\"\"><div> <span>At one time in her journey, Jenna was roaming the world with Felix and co, when they came upon a strange cave, said to contain an ancient and mysterious power.<br>\r\n<br>\r\nThey all stopped outside as they debated whether or not to enter the cave.<br>\r\n<br>\r\nFelix ran a hand along the edge of the entrance,<br>\r\n<br>\r\n'I have heard that there is a very powerful form of psynergy locked away in a tablet in the very centre of this cave, unfortunately it is crawling with traps and monsters, and we have no real information on whether or not this psynergy will be beneficial to us.'<br>\r\n<br>\r\n'I'm sure that whatever psynergy is locked away in there, it must be worth getting!' replied an enthusiastic Jenna.' Sheba also voiced her opinion, saying that she too thought the psynergy would be beneficial to their party, while Piers was against needless risk and Felix remained in doubt still.<br>\r\n<br>\r\nAfter much debating, Jenna started to become irritated 'It's time someone made up their minds around here, i've made up mine, and i'm going in!' Jenna shouted as she stormed into the entrance.<br>\r\n<br>\r\n'Wait!' the party shouted in unison.</span></div></div>",
            "created":1144040400,
            "id":310423,
            "title":"A dangerous cave"
        },
        "111":{
            "choices":[
                "Run into a monster",
                "Run into someone she knew"
            ],
            "content":"<div class=\"\"><div> <span>Jenna nervously entered along, dripping stelactilite was hanging from the roof of the cave. She had looked up to see some bats were sleeping upside down.<br>\r\n<br>\r\nShe didn't want to awaken the bats.<br>\r\n<br>\r\nAs she continued to walk through the caves she had...</span></div></div>",
            "created":1144126800,
            "id":310640,
            "title":"The Cave... Alone"
        },
        "1111":{
            "choices":[
                "15 cakes, spares also!",
                "2000 cakes, a REAL test!"
            ],
            "content":"<div class=\"\"><div> <span>  Jenna quickly looked back at the openning, instantly regreting the quick decision, but she wouldn't lose her pride that easy! She huffed and continued boldly -well, kind of- through the snuffy cave. She gained confidence from the lack of monsters, which was a pleasent suprise. She wandered on, pebbles flying from her steps. The silence gave her a nice chance to think about things that had happened...<br>\r\n<br>\r\n  Then, there was a crackle of rocks grinding behind her! She flipped round, pulling out her staff, ready for action. There was standing... A Gnome Mage...! She looked at the tiny thing, half grinning. She briskly walked over to it, the Gnome Mage bewildered by this. She gripped the staff and gave the gnarled head a quick thwack, knocking it flat. It promtly faded to ash, pretty normal. She quickly turned round and continue.<br>\r\n<br>\r\n  The next half hour was uneventful, which, by this time, she had grown quite bored... Suddenly, she saw a light at the end of the cave. She picked up the pace, sprinting to the source. She quickly came to the psynergy tablet and snatched it from it's placehold. She read the stone encravings; \"item dublicate\". It lit up, granting the power to Jenna. As the light faded, the tablet disappeared, and she looked around. She quickly noticed a strange, chocolate cake had appeared where the stone was. She thought out loud; \"wha- how? Ah, I am pretty hungry. I wonder if they would want any? Would be a good test! Now, how many...\"</span></div></div>",
            "created":1144386000,
            "id":311320,
            "title":"Nice, easy fight, and a prize"
        },
        "11112":{
            "choices":[
                "Stay behind and have another little taste...",
                "Forget it. Just take the cakes."
            ],
            "content":"<div class=\"\"><div> <span>  She picked up the cake, which was quite heavy, and focused. Suddenly, the weight doubled and she promtly dropped the cakes. Luckily, they landed safely on the table. She decided to continue with the cakes where they were. Again, she focused. She heard several plops, but didn't stop until she felt something brush against her face. Jenna instantly openned her eyes to see a cake wall and took a startled step back. She had filled the cavern with cakes! 2000 to be exact.<br>\r\n<br>\r\n  Jenna knew it would be a long way back to the exit, and taking the cakes back would be harder, so she decided that to have a QUICK taste. She took a bite out of the luxurious chocolate cake and let out a groan of ecstasy- these cakes were addictingly delicious! She was just about to start taking the goods back to the group when she had a sly thought...</span></div></div>",
            "created":1144731600,
            "id":312091,
            "title":"Cakes, cakes, brilliant cakes!"
        },
        "111121":{
            "author_id":"shadowfox83",
            "author_name":"Fox",
            "choices":[
                "Jenna has one more little taste",
                "Jenna's self control stays strong"
            ],
            "content":"<div class=\"\"><div> <span>Jenna knew in the back of her mind that she shouldn't do this but being a girl that never let a good opportunity go to waste she decided to give the cake another small taste.<br>\r\n<br>\r\nOnce again the taste was nearly mind-blowing sweet, a wonderful chocolate heaven to be exact, Jenna smiled happily as one taste led to another and another...<br>\r\n<br>\r\nTwenty minutes later she had downed the whole cake. Jenna giggled slightly as she let out a small burp. \"That was delicious!\"<br>\r\n<br>\r\nPicking herself off the floor Jenna quickly noticed a bit of a bulge on her stomach. To her surprise Jenna took note that it wasn't just her stomach, every part of her seemed to have gain a bit of weight. She guessed she must have put on anywhere from 30 to 40 pounds.<br>\r\n<br>\r\n\"Woah, that was some strong chocolate filling. Well no more \"tasting\" for me.\"<br>\r\n<br>\r\nJenna then shifted her focus on finding a way to get the cakes out of the cave, but as she glanced over at the 1,999 cakes left her stomach growled softly as if to say it was in need of more cakes.<br>\r\n<br>\r\n\"More creamy, soft, delicious cakes...\" Jenna mumbled in a daze, her self control nearly snapping.</span></div></div>",
            "created":1144731600,
            "id":312159,
            "title":"One less cake"
        },
        "1111211":{
            "choices":[
                "eat",
                "dont eat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she eats the hole cake and looks like she gaind 400 pounds</span></div></span></div>",
            "created":1197781200,
            "id":476011,
            "title":"Jenna has one more little taste"
        },
        "11112111":{
            "choices":[
                "Agree and eat!",
                "Refuse the offer"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly,Jenna's waistline blew out. Jenna had no idea.All she cared about was the cake.She took one big hand full of cake,then another,and another.All until she had finished all 2000 cakes.\"Whew!\" Sighed Jenna.\"That was allot of cake!\".Just then,there was a loud growl from Jenna's stomach.And BANG! her swollen tummy burst out of her clothes.\"WHATS GOING ON?!\" Jenna screamed as her huge body started filling up the cave. Jenna kept growing until her huge,fat, body fell off the earth into another world.When still growing Jenna landed, funny little humans asked if she wanted  to eat more chocolate cakes for the rest of her life.For it was them who had put the cakes in the cave.        </span></div></div>",
            "created":1237784400,
            "id":665450,
            "title":"Eat some more..."
        },
        "111121111":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jenna eats and eats for the rest of her life. Dying with a weight of over 91,231,546,890,000,000,000,000 pounds</span></div></span></div>",
            "created":1237784400,
            "id":665451,
            "title":"Agree and eat!"
        },
        "111121112":{
            "content":"<div class=\"\"><div> <span>\"Never!\" Jenna says.Upsetting the little humans Jenna was poked and terrified by them. Going along the little humans planed, Jenna's stomach inflated an extra 2000 pounds.In no time after that weight gain,Jenna had a heart attack and died.Weighing 8,300,200;999,123 pounds  </span></div></div>",
            "created":1237784400,
            "id":665455,
            "title":"Refuse the offer"
        },
        "1111212":{
            "choices":[
                "Some friends",
                "Bats that were awakened"
            ],
            "content":"<div class=\"\"><div> <span>Jenna decides to keep strong, despite the fact there were 1999 cakes left in there and she gained 30 to 40 pounds. The taste was what would most likely bring her downfall.<br>\r\n<br>\r\nIt would take a while for her to stop for a moment and think, she was a bit nervous about what to do, now the only option would be walk out of the cavern.<br>\r\n<br>\r\nWhen she got out she had met up with some... </span></div></div>",
            "created":1144731600,
            "id":312280,
            "title":"Stay Strong"
        },
        "11112122":{
            "author_id":"gronk",
            "author_name":"Gronker",
            "choices":[
                "Explain and mention the psynergy",
                "Lie and say you just found cakes"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nJenna neared the entrance of the cave, she was using her lift ability to keep the cakes afloat, it was sapping nearly all of her psynergy but she couldn't think of any other way to transport 1,999 cakes quickly. <br>\r\n<br>\r\nSuddenly she was bombarded by small screeching black shapes, scratching and biting her all over.<br>\r\n<br>\r\nA lot of bats in the cave were unhappy that a huge number of cakes had invaded their home and so were getting to the root of the problem.<br>\r\n<br>\r\nJenna, who was using all her energy just to keep the cakes up was unable to fight back, she cried out for help.<br>\r\n<br>\r\nA blast of energy came from the cave mouth, stunning a couple of bats and sending the rest shrieking into the darkness.<br>\r\n<br>\r\nAt the cave entrance, Sheba lowered her staff and shouted 'Jenna, it's safe to come out now!'<br>\r\n<br>\r\nthe party waited and saw a huge brown wall coming towards them.<br>\r\n<br>\r\n'What in Weyard is that?!' shouted Felix<br>\r\n<br>\r\n'It looks like cake, lots of it...' said Sheba, running her finger down one and licking the icing off her finger (unknown to her, this added about a pound to her weight, not that she'd notice.)<br>\r\n<br>\r\n'Mmm, chocolate, my favourite!' she said happily<br>\r\n<br>\r\n'Are you in there Jenna?' asked Piers<br>\r\n<br>\r\nA tired looking Jenna stepped out from behind the cake wall as it dropped to the ground.<br>\r\n<br>\r\nJenna, you were in there for hours and you look like you put on 50 pounds, what happened in there?</span></div></div>",
            "created":1144818000,
            "id":312442,
            "title":"Jenna has a run in with bats"
        },
        "111121222":{
            "choices":[
                "Lie again and gain more weight...",
                "Tell the truth..."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh I just found them. Other than that nothing happened.\" Jenna said. The party just shrugged their shoulders, leaving the cakes. Jenna was walking along when she doubled over in pain. <br>\r\n<br>\r\nBURRRPPPPPPP! The party turned around at the loud noise and was shocked to see Jenna start gaining weight! Her stomach folded over her pants and then broke the button. Her ass ripped her backpockets to shreds. Soon she was butt naked and looked like she weighed 250 pounds. <br>\r\n<br>\r\n\"What happened in there really?\" Pieter asked, glaring at the obese wizard. Should Jenna...</span></div></div>",
            "created":1176008400,
            "id":396842,
            "title":"Lying is bad for the body"
        },
        "113":{
            "choices":[
                "they find some bats",
                "jenna feels sick",
                "sheba starts to itch on her feet, back, and arms"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>as sheba decides, she runs in with jenna. then</span></div></span></div>",
            "created":1209272400,
            "id":524835,
            "title":"sheba is brave"
        },
        "12":{
            "author_id":"gronk",
            "author_name":"Gronker",
            "choices":[
                "50 lbs heavier than before",
                "150 lbs heavier than before"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nTired from their struggles, Felix and co. decided to take a short vacation, because even the saviours of the world need a break sometimes.<br>\r\n<br>\r\nThey decideed to settle down at a peaceful inn by the beach midway through their travels and have an extended stay, and while a break was good for Sheba, it was having other effects on her as well.<br>\r\n<br>\r\nToo many hearty meals down at the inn was making her a little chubby, her once slim midsection had developed into a small potbelly, her previously flat chest began to swell, her arms and legs developed a thin layer of flab that lent a slight jiggle to her step and her cheeks were starting to become puffy.<br>\r\n<br>\r\nSince she had not been staying active like the others but preferred to study books on psynergy or lie on the beach, she wasn't losing any of it and had recently started snacking between meals as well.<br>\r\n<br>\r\nHer slight gain was not noticed by her at all as she was enjoying herself too much, until eventually after a few weeks of relaxing and snacking she discovers she is-</span></div></div>",
            "created":1144040400,
            "id":310426,
            "title":"A short vacation"
        },
        "122":{
            "author_id":"gronk",
            "author_name":"Gronker",
            "choices":[
                "Change and go join them",
                "Stay put"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nA few weeks later, Sheba inspected herself in the mirror and was shocked at what she saw,<br>\r\n<br>\r\nher potbelly had now swelled into a full fledged gut which hung over her waist, and pushed against her clothes, making her take to removing her belt. Her chest had gone up several sizes are were now larger than average, resting on her belly. Her butt and hips had widened and cushioned her when she sat. Her arms had swelled and her fingers and toes had become slightly chubby. Finally her face had developed rounded cheeks and a full double chin with the slight begginings of a third when she looked downwards.<br>\r\n<br>\r\nUpon weighing she turned out to weigh 250 lbs. a gain of 150 from a few weeks ago, the large meals and inactivity coupled with her snacking was taking it's toll, and yet she rather liked the soft, cushy feeling of her flesh, and the way that it jiggled and bounced when she moved, she decided she might want even more.'<br>\r\n<br>\r\nSuddenly her chain of though was broken by a loud knock at the door, it was Jenna calling,<br>\r\n<br>\r\n'Sheba, you've been in there for weeks, how about joining us on the beach for a little fun?'<br>\r\n<br>\r\nSheba realised the rest of the group had not seen her in weeks and her large form would come as a shock, she decided to make up her mind about it, she would either change into something more appropriate (if her swimsuit still fit, being made for someone a hundred pounds or so lighter) and join them, or hide away in her room for a little longer.</span></div></div>",
            "created":1144040400,
            "id":310437,
            "title":"Sheba is shocked"
        },
        "1221":{
            "choices":[
                "walk to the water",
                "fall asleep in their chairs"
            ],
            "content":"<div class=\"\"><div> <span>sheba decides to join her friends, even though she was embarrased about herself. she had a rather easy time putting on her swimsuit, no struggle. as she walked out the door, jenna was speechless.suddenly, they heard a smash coming from the pool/beach entry.they both ran to the scene, as felix had tripped over the wet lobby floor. he had broken his wrist, but he healed himself. as the four walked to the beach, sheba took a few hot dogs from a concession stand on the beach. as she ate them, her feet, belly, arms and legs became puffier.as they sat down, sheba and jenna</span></div></div>",
            "created":1208667600,
            "id":522272,
            "title":"sheba+beach=whaaaa?"
        },
        "12212":{
            "choices":[
                "\"... Kiss me\"",
                "\"... What do you think you're doing?!\""
            ],
            "content":"<div class=\"\"><div> <span>  The sun beat down upon the two girls as thy sat in their chair, forcing a tiredness within them, and they quickly fell asleep. Moments later, Sheba woke up, the heat intensified due to her bulk. She looked upon her friend and missing her comfort, went over to her chair. Looking over, she could tell that Jenna was asleep. To test this she prodded her several times, all of which yielded no response.<br>\r\n<br>\r\n  A plan formed in Sheba's mind for a funny prank, so, encouraged by the heavyness of Jenna's sleep, she climbed on top of her, fat oozing all over Jenna, quickly engulfing her. Possibly dreaming of teddy bears, Jenna snuggled her face into Sheba's large and over-swollen breasts, causing a giggle. Jenna snapped awake at the sound and stared at Sheba, who had a shocked expression on her rounded face from the surprise of Jenna's awakening. Jenna stare deep into Sheba's eyes, and said;</span></div></div>",
            "created":1208754000,
            "id":522449,
            "title":"Sleeping beauties"
        },
        "122121":{
            "choices":[
                "sheba gains 50 pounds",
                "jenna swells like sheba, and there are two blob girls"
            ],
            "content":"<div class=\"\"><div> <span>\"WHAAAAAATTTTT?!!! you want me to kiss you? why?\",sheba said. jenna told her,\"i just want you to kiss me, right on the cheek.\" sheba leaned into the kiss, but both turned their heads as piers and felix saw them.\"..................\", they both just stood there in shock. eyes wide, mouths open wide. then sheba kissed jenna so fast they were too shocked to notice, then went back to her chair.the chair suddenly broke, and sheba gained 30 pounds. her feet, hands, arms, legs, belly,butt, chest,and hips swelled a bunch. she had a sudden itchy feeling in her feet, then they swelled as big as her head and had turned red from sunburn, as did the rest of her body.</span></div></div>",
            "created":1209272400,
            "id":524832,
            "title":"the kiss"
        },
        "122122":{
            "choices":[
                "she trips",
                "she stands"
            ],
            "content":"<div class=\"\"><div> <span>as sheba heard jenna, she thought, and said,\"uhh..just kinda cold, you know?\", jenna said,\"it's 100 degrees out here! get off me!\" then sheba got back in her lawn chair and jenna ordered some screwball pops from an icecream truck that ran by.\"um, let me dig down deeper, i know i have some change.\"jenna said to the dude that was running the truck.she handed him the change, got the icecreams, and went back to sheba. \"green. brown(rootbeer). pink.purple.black? who the heck ordered black? 5 SBs?\",jenna was thinking a she gave them their icecreams. sheba took the black and ate it, but got brain freeze.\"OWOWOWOWOWOOWOWOWOWOWOWOW......OOOOOOOOOWWWWW!\" sheba yelled. she then suddenly ate her pink one and gained 10 pounds from magic.\"what the crap?\", sheba said. she scratched her left big toe while she said,\" who wants to eat some tacos or something?\" then she suddenly felt her belly rumble asshe grew 30 pounds heavier. \"oh. my. GOD!\" sheba tried to run from the beach, but the three grabbed her legs.</span></div></div>",
            "created":1209272400,
            "id":524683,
            "title":"icecream,youscream,weall scream for iceream!"
        },
        "1222":{
            "choices":[
                "Get some new clothes",
                "Get some food"
            ],
            "content":"<div class=\"\"><div> <span>Sheba's response was, \"No, I think I will stay put,\" and she sighed with a tone of disbelief, she couldn't believe how much she let herself go.<br>\r\n<br>\r\nShe was wondering what to do now as she heard her friend walk down the hallway.<br>\r\n<br>\r\nFor someone her size finding new clothes would be harder than usual, and finding some food would be the next of her troubles, either way if she left her friends would probably see her.</span></div></div>",
            "created":1144126800,
            "id":310643,
            "title":"Staying put"
        },
        "12221":{
            "choices":[
                "Goes to eat",
                "goes to eat"
            ],
            "content":"<div class=\"\"><div> <span>She decided to sneak out and go find a clothing store. She walked down the street in search of a place that she could buy something to fit her new fat figure. She walked into a store and decided to try some things on. Standing before the dressing room mirror in a new pair of pants she stared in disbeleif. The pants fit so tight around her waist and thighs, she could barely squeeze it all in. Rolls of fat hung over the waist band of the pants, jiggling every time she made even a slight movement. She tried on almost everything in the store and nothing could hide how fat she had become. She had to settle for a shirt and pants. The shirt was so tight it barely covered her belly button and her stomach hung over the pants jiggling with every step she took as she walked out of the store. She was still very hungry and needed food.</span></div></div>",
            "created":1246424400,
            "id":717082,
            "title":"Get some new clothes"
        },
        "122211":{
            "content":"<div class=\"\"><div> <span>She smelled food in the distance and waddled off in that direction. She found a restaurant and sat down ordering everything and stuffing herself with all sorts of foods. She really was begining to like the way she felt fat. After the meal she sat rubbing her belly. She decided to eat some more and then leave, patting her stuffed jiggling belly as she walked away.</span></div></div>",
            "created":1246424400,
            "id":717085,
            "title":"Goes to eat"
        },
        "12222":{
            "choices":[
                "Go get something to eat",
                "Get new clothes right away"
            ],
            "content":"<div class=\"\"><div> <span>Sheba waited until her friend left and she waddled out of her room. She decided to go to a dress shop as far away from the hotel as possible just incase her friends had seen her.<br>\r\n<br>\r\nThis would prevent embarassment and further humiliation.<br>\r\n<br>\r\nAs she took a cart, her rear was so immense that she actually took two bus seats when she sat down.<br>\r\n<br>\r\nShe got off at a stop and there was a plus size store and an all you can eat buffet.</span></div></div>",
            "created":1144299600,
            "id":312888,
            "title":"Sheba gets clothes (or sidetracted)"
        },
        "122222":{
            "author_id":"gronk",
            "author_name":"Gronker",
            "choices":[
                "Eat slowly",
                "Pig out!"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nSheba decided 'first thing's first, i'd better get some bigger clothes if i'm going to start pigging out.'<br>\r\n<br>\r\n-and so Sheba waddled into a plus size store and came out wearing a much larger a baggier version of her previous robes.<br>\r\n<br>\r\nComfortable with how they felt, she waddled her way over to the all-you-can-eat-buffet...</span></div></div>",
            "created":1144299600,
            "id":311179,
            "title":"Sheba goes clothes shopping"
        },
        "1222222":{
            "author_id":"gronk",
            "author_name":"Gronker",
            "choices":[
                "Run back in and hide!",
                "Help him up and face the others"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nSheba decided to take it slow, however after a few bites, she found the food was so good she started eating at a faster and faster pace until she was practically shovelling food into her mouth in a bliss of eating.<br>\r\n<br>\r\nAn hour or two later, Sheba had cleared out most of the food in the buffet, she leaned back and gave her stuffed belly a contented pat, making it wobble a little bit. <br>\r\n<br>\r\nSuddenly, she realised the other customers were all staring at her with shocked expressions, a few were leaving very quickly making faint gagging noises, she realised she most have put a great many more pounds on her frame in a short time, her belly had swelled even furthur outwards from all the food she had stuffed into it, it now spread right across her lap as she sat, her bust had gone up yet another size, her butt was now far too small for the stool she sat on, and sagged down either side of it. Her legs and arms had swelled with fat, giving her a pronounced waddle and making her thighs touch together at all times, finally her cheeks had puffed out and her face had grown a full triple chin.<br>\r\n<br>\r\nSheba counted herself lucky she had bought larger clothes previously, or she would be wearing a few scraps right now, her current ones still actually had a little more room to grow.<br>\r\n<br>\r\nSheba decided to make her exit quickly before things got any more embarassing, as she approached the exit, she heard an entering customer remarking on how tasty and cheap the food in the buffet was, before Sheba's large belly sent him sprawling into the dirt.<br>\r\n<br>\r\n'Ohmigod, Felix!' she heard Jenna shout<br>\r\n<br>\r\nLuckily the others hadn't seen her because they were still around the corner, Sheba looked at Felix groaning on the ground and decided to-</span></div></div>",
            "created":1144818000,
            "id":312458,
            "title":"Sheba  nearly clears the buffet"
        },
        "12222221":{
            "choices":[
                "Felix and company found a seat",
                "She found the stall too small of a space to hide"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She was embarrassed about what happened, she waddled back into the restaurant to hide in the washroom stall, however she was simply too fat as she was squished in the stall.<br>\r\n<br>\r\nShe had waited for a good fifteen minutes until...</span></div></span></div>",
            "created":1144818000,
            "id":312478,
            "title":"Run back in"
        },
        "122222211":{
            "author_id":"gronk",
            "author_name":"Gronker",
            "choices":[
                "Let Jenna see her and explain",
                "Attempt to close the door"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nAs Sheba waited in the stall, she heard Felix and co sit down at a table near the door, they talked for a while until she heard Jenna say 'Guys, i'm just going to wash my hands quickly.' and panicked<br>\r\n<br>\r\nShe tried to squeeze out of the stall, but was prevented by her wide hips and buttocks and her flabby belly in front,<br>\r\n<br>\r\nshe wriggled as much as possible until she sweated with exhaustion but it was no good, she was stuck first, she was left with only two options-</span></div></div>",
            "created":1144818000,
            "id":312527,
            "title":"Sheba gets stuck"
        },
        "1222222112":{
            "choices":[
                "Sleep",
                "Call room service for dessert"
            ],
            "content":"<div class=\"\"><div> <span>Sheba attempted to close the door, and miraculously she managed to close it.<br>\r\n<br>\r\nBut now it was starting to get really tight in there that she sucked in her large belly to accomidate some more, the only problem was that she could only hold so much air in her lungs until she would have to let it out.<br>\r\n<br>\r\nShe let it out as Jenna left to sit down.<br>\r\n<br>\r\n\"Now to try and get out.\" Sheba said to herself.<br>\r\n<br>\r\nShe shuffled out of the stall and she decided to waddle out of the restaurant as fast as she could.<br>\r\n<br>\r\nFelix and company were too busy eating to take notice of Sheeba.<br>\r\n<br>\r\nSheeba had decided to go back to the hotel to her room to...</span></div></div>",
            "created":1144904400,
            "id":312738,
            "title":"She closes the stall door"
        },
        "12222221122":{
            "author_id":"gronk",
            "author_name":"Gronker",
            "choices":[
                "She had gained a further 200 lbs!",
                "Felix standing over her with a shocked expression"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nSheba knew she might regret it later but decided to order dessert, she wasn't quite full yet and the long walk from town to the hotel had worked up her appetite.<br>\r\n<br>\r\nShe called for room service and ordered the dessert round usually meant for a family of five.<br>\r\n<br>\r\n-the servant asked her if she had some friends coming along later, 'Yes' she lied.<br>\r\n<br>\r\nA large trolley was eventually wheeled into her room, Sheba licked her lips in anticipation, unknown to her, the servant had mixed a special little concoction into the ice cream before he wheeled it in.<br>\r\n<br>\r\nOn it was a huge chocolate cake drowning in cream, several bowls of jello, and finally several large tubs of ice cream.<br>\r\n<br>\r\nThe servant bowed and left the room and as soon as she heard him walk down the stairs she dug in.<br>\r\n<br>\r\nSheba ate the entire dessert course very quickly and was so stuffed with food she fell asleep almost straight away. her new clothes were now very tight around her engorged belly.<br>\r\n<br>\r\nLuckily the others had paid the costs for the rooms and any extras they could want beforehand so the others wouldn't notice the cost of the dessert.<br>\r\n<br>\r\nWhen Sheba woke up the next morning, what she saw made her heart skip-</span></div></div>",
            "created":1144990800,
            "id":312920,
            "title":"-and now for dessert"
        },
        "122222211221":{
            "author_name":"BeautifulSin",
            "choices":[
                "Sheba is finally found out.",
                "She managed to hide after all..."
            ],
            "content":"<div class=\"\"><div> <span>She was now even bigger then when she went to sleep, she never heard of gain like this! Her stuffed belly was twice as big now, and wider too. Her arms filled with fat, plumply rounded. Her chest had grown too, each breast larger then her head, which was also very swollen, in the chin and cheeks. Her butt had become more massive as well, and her hips and legs nearly twice as wide. All this extra weight, estimated at 200 lbs, had crushed the bed underneath her while she was sleeping. It was impossible to have gained this much from just one hearty meal, what did that waitress put in there?<br>\r\n<br>\r\nShe managed to stand up, tho she had a hard time trying to stay on her feet. Her enormous belly and butt made her feel unbalanced. She could barely move around, and yet still... she felt hungry.<br>\r\n<br>\r\n\"I may have an eating problem\"<br>\r\n<br>\r\nShe said in a near comical self relevation, if she could get this fat and still want more, she wasnt thinking straight. In fact, she might even have to ask her friends for help after all, despite the incredible embarassment it would involve. Especially now, it would be hard to hide from them, she must weigh 600 lbs now. Sighing she slowly waddled out of her bedroom, however there was a problem.<br>\r\n<br>\r\n\"Was this door always this small?\" <br>\r\n<br>\r\nSheba could not get through now, but she wouldnt give up, no door would get in her way. So she struggled to get through, first sticking her arms through, and then forcing her belly to pass. Her hips were the biggest pain, as she took minutes to squeeze them free. Unfortunately the sudden release made her lose balance, and she fell down on the floor. Just at that time, a knock was heard on the door. \"Sheba, you in here? Come on, you cant hide from the beach forever!\" Jenna's cheerful tone rang behind the door. The door itself was of course not locked, so it would only be a matter of time before she would get in. And right now Sheba felt even more affraid to show her current state to them, she wanted to hide! But try as she might, she was simply to heavy now to lift herself off the ground in such short time, she just fell back to the ground with every push. The door knob turned, she was coming in!</span></div></div>",
            "created":1145336400,
            "id":313700,
            "title":"Waking at 600"
        },
        "1222222112211":{
            "author_id":"gronk",
            "author_name":"Gronker",
            "choices":[
                "Sheba explains everything",
                "Something unfortunate happens"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nJenna entered the room to find a 600lb. girl lying belly down on the floor, after the inital shock, Jenna became angry.<br>\r\n<br>\r\n'Who are you and what are you doing in Sheba's room wearing her clothes?' she demanded<br>\r\n<br>\r\n'Jenna, i AM Sheba!' Sheba wailed<br>\r\n<br>\r\nJenna didn't believe this at first, but she took a closer look at Sheba's face and something clicked in recognition.<br>\r\n<br>\r\n'Sheba! What happened to you?!' Jenna said as she helped Sheba onto her chubby feet<br>\r\n<br>\r\n'I don't really want to say...' muttered Sheba blushing<br>\r\n<br>\r\n'Come on, Sheba- me and the others need an explanation for why you've been hiding away for so long, but first we need to get you into something more suitable for the beach...'<br>\r\n<br>\r\nAbout half and hour and a lot of grunting and tugging later, Sheba managed to get on the swimsuit she had worn when she was about 500lbs lighter. It was so tight the bikini bottom covered little more than a thong, the top was pulled to it's very limit and was so tight it covered very little, Sheba blushed like a beacon when she saw herself.<br>\r\n<br>\r\nJenna looked her over 'Hmmm, it's a tight fit, but it'll have to do on such short notice.'<br>\r\n<br>\r\n-before Sheba could protest, Jenna grabbed her cushy arm and led her unwillingly down to the beach where the others were.<br>\r\n<br>\r\nOnce Felix and Piers recognized her, their mouths dropped open and they momentarily lost the power of speech.<br>\r\n<br>\r\n'I think we all need an explanation, come on Sheba!' Jenna said</span></div></div>",
            "created":1145768400,
            "id":314779,
            "title":"Time for an explanation"
        },
        "1222222112212":{
            "choices":[
                "She gets stuck",
                "Ravenous hunger overcomes her"
            ],
            "content":"<div class=\"\"><div> <span>Sheeba managed to get into the washroom, she had hid out there while her friends were searching for her.<br>\r\n<br>\r\nShe had known that she couldn't hide forever, as she was starting to get too fat to, what would happen at 700 or 800 pounds when she starts to get too fat to move?<br>\r\n<br>\r\nShe didn't think about that right now as her friends had left, she knew it was her friends because they were to check up on her.<br>\r\n<br>\r\nAs she attempted to escape the cramped washroom...</span></div></div>",
            "created":1147323600,
            "id":318170,
            "title":"Sheeba hides again"
        },
        "12222221122121":{
            "choices":[
                "One of her friends walks in",
                "A stranger walks in"
            ],
            "content":"<div class=\"\"><div> <span>Sheeba was stuck in the stall, she squeezed and struggled to get out before someone could see her, she figured she was now in too deep.<br>\r\n<br>\r\nShe waited and waited to see what could happen but the problem was that someone definately was going to walk in.<br>\r\n<br>\r\nSheeba was waiting paitiently until...</span></div></div>",
            "created":1156654800,
            "id":342568,
            "title":"Sheeba is stuck"
        },
        "122222211221212":{
            "author_id":"ragnair",
            "author_name":"Iruiel",
            "choices":[
                "Mason breaks open the door, and sees Sheba stuck inside.",
                "Mason leaves without finding her, and Sheba breaks free from the stall."
            ],
            "content":"<div class=\"\"><div> <span>BAM. The door to the bathroom burst open, nearly whacking whoever came in in the head. <br>\r\n<br>\r\n\"Aw, VERDAMMEN!\" A male voice shouted, the person stomping in angrily. Sheba stood, rather, hung in the stall, deathly afraid that the new person would find her in the bathroom, a huge blubbery mass of an Adept. The stalls creaked a little, but not enough to be noticed by the newcomer. But, her security was not to last as the bathroom door swung open once more. TWO people? She was about to faint from stress and the confines of the stall.<br>\r\n<br>\r\n\"Mason, calm down! It's just a little paint!\" the voice pleaded, belonging to a younger male.<br>\r\n<br>\r\n\"No, I won't! That cheap salesman lied through his teeth to me that the grenade would not go off in my hands. And you know what, Reeves? IT DID!\" Mason roared, turning on the water faucet furiously. Water was heard by Sheba gushing out of the pipe.<br>\r\n<br>\r\n\"Fine, Mason. Just keep it down to a dull roar.\" And with that, Reeves left the bathroom. Mason was cursing in German under his breath. The stalls creaked again, this time much louder.<br>\r\n<br>\r\n\"What the...\" Mason said, then he abruptly shut off the water. Everything was silent. Sheba held her breath, and this just made her larger, causing it the stall to creak very, VERY loudly. She heard footsteps, then the door opening, and she sighed. A fist came soaring out of nowhere, shattering a hole through the stall's wall! It was gloved, and covered in a thin film of runny, red paint. Sheba could only wait until the danger passed, her eyes only focusing on the door and hand as it unclenched. </span></div></div>",
            "created":1194411600,
            "id":461607,
            "title":"New Guest: Mason Ortiz"
        },
        "1222222112212122":{
            "choices":[
                "Yes, she has to. She must see Felix and the others.",
                "No, the mind is willing, but the body has needs. She digs in!"
            ],
            "content":"<div class=\"\"><div> <span>Against all odds, Sheba managed to stop the creaking long enough to confuse the angered guest. Which was a good thing since his companion made a sudden return. <br>\r\n<br>\r\nAnd he quickly pulled Mason away. \"Mason, what is wrong with you?\" Reeves asked while trying to keep his voice down. \"You can't just go punching holes in walls. We do not owe this place!\" Mason pulled himself loose. \"I just heard noises, that is all.\" He looked back at the stalls, trying to see through the hole if anyone was on the other side of the door. \"You were lucky then, that nobody is actually here to see you make such a scene.\" As luck would have it, the lights were too dim for him to make out what was actually a fat mass of wind adept. Though it did not stop her from weating ounce after ounce.<br>\r\n<br>\r\n\"Come on. Let's go away before anyone catches you with the damage you have done. The maids will clean it up. As for you, I am sure we can find something else to punch.\" He lead his friend away, as he rubbed his knuckles. \"If you say so.\" Finally the pair had left the room, leaving her to get the hell out of here. Though she was still stuck here and there, it took a lot of maneuvering to break free. <br>\r\n<br>\r\nWhich she did, by smashing the door down.<br>\r\n<br>\r\n\"Oops.\"<br>\r\n<br>\r\nMason must have unhinged it a little, and now it was totalled. She wished she could fix it, but she also wished to not get caught. Time was of the essence here. Now Sheba realized that it was too dangerous to continue like this, she had to confide in her friends and ask them for help. So she waddled out of the restroom, taking each step slowly to make sure she would not fall down again. Because she feared she was getting too heavy to get up. She dared not imagine herself in such a position, a beached whale for all the other guests to mock.<br>\r\n<br>\r\nSo close, she thought, so close. Yet there was a distraction along the way, an unguarded kitchen. The doors were wide open, nobody was in sight, this was all very curious indeed. The food inside smelled so nice, if only she could taste just one bit. If only she did not need to be elsewhere..<br>\r\n<br>\r\nCould she resist the temptation?</span></div></div>",
            "created":1249016400,
            "id":735788,
            "title":"Mason leaves without finding her"
        },
        "12222221122121222":{
            "choices":[
                "There is nothing to do, she is found out!",
                "She manages to escape again, somehow.."
            ],
            "content":"<div class=\"\"><div> <span>It was too much, the smell overcame all her senses. Before she even knew how and when, she and all of her flab had slipped through the doors. Before her stood a feast for kings: steamed vegetables and exotic fruits, sweet deserts and rich drinks, boiled meat and steaks the size of tables. Whether there was a large celebration this night, or an open buffet for the entire town, these things she did not know. All Sheba knew was that there was nobody in sight, a chance like that she could not pass up. Every bit of reasoning and logic in her mind was overpowered by her hungering massive body. It wanted more, and more!<br>\r\n<br>\r\nSo she digged in.<br>\r\n<br>\r\nAfter who knows how many meals, how many hours, she had eaten enough. She was satisfied and could store no more. It was all a blur to her, she could barely remember what tasted best or what took longest to go down. But what were the costs?<br>\r\n<br>\r\nThey were rather astounding to say the least. Again her body had reacted to the food intake like an overactive factory. There was not an inch on her body that had not been given an extra layer of fat. Her arms were as thick as pillows, her legs as wide as tree trunks. Her butt and chest had swelled up as well, though their weight increase was nothing compared to the blubber that was her belly. She must have gained a hundred pounds, two-hundred even! This time she knew she had gone too far. \"And yet, I allowed it to happen.\" She started sobbing. \"What is happening to me? Why can't I stop?\"<br>\r\n<br>\r\nJust then a sound rang across the room, someone was coming!<br>\r\n<br>\r\nShe would have liked to hide, she could sitll barely move, but her bulk was now far too immense to be obscured by any structure. She had gone into the kitchen, and now she had to pay the consequences. What would she do, what!?<br>\r\n</span></div></div>",
            "created":1249016400,
            "id":735802,
            "title":"An Open Kitchen is asking for trouble"
        },
        "122222211221212221":{
            "choices":[
                "It is the cook, and boy does he look surprised.",
                "It is 'an old foe'. (It was a trap!)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Footsteps! Nowhere to run! This was it!!!<br>\r\nBut who would it be? The cooks, or someone completelly different?</span></div></span></div>",
            "created":1249084740,
            "id":735807,
            "title":"There is nothing to do, she is found out!"
        },
        "12222221122122":{
            "author_id":"surferchic15",
            "author_name":"lolachica",
            "choices":[
                "Sheeba gets back to the hotel and falls asleep. ",
                "Sheeba makes a pit stop in the hotel game room. "
            ],
            "content":"<div class=\"\"><div> <span>Sheeba hurries out as fast as she can. She comes out to realize all the buffet food has been restocked and once again indulges. What must have been 30 minutes later, the entire restaurant is empty of food and Sheeba sits down on the floor and sighs. She scratches her stomach and notices that her weight has once again increased.<br>\r\n<br>\r\nShe is 750 pounds! <br>\r\n<br>\r\nSheeba gets up and hobbles out of the restaurant, squeezing her fat through the slim door.<br>\r\n<br>\r\nSuddenly, she remembers her friends back there, but can't do anything but get back to the hotel (which takes hours). <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1243314000,
            "id":697638,
            "title":"Ravenous hunger overcomes her"
        },
        "122222211221221":{
            "author_id":"surferchic15",
            "author_name":"lolachica",
            "choices":[
                "Sheeba collapses right infront of Felix",
                "She call Jenny to go out for lunch. "
            ],
            "content":"<div class=\"\"><div> <span>Sheeba sleeps lazily for the night, and wallows in her self pity. Not only do her friends likely despise her, but she is gaining weight quicker than an elephant. Unfortunately, the temptation of food is just too much.<br>\r\n<br>\r\nSheeba orders room service, the continental breakfast family size- twice. Enough food for what could be 14 people! <br>\r\n<br>\r\nShe grabs the food in her pudgy hands and shoves it into her mouth... she finishes, she is still hungry.<br>\r\n<br>\r\nShe notices that all her clothes are ridiculously tight and uncomfortable. Sheeba orders 3 more rounds of breakfast then decided she should confront her friends (then go shopping again.) <br>\r\n<br>\r\nShe is 800 pounds, but is still able to walk. </span></div></div>",
            "created":1243314000,
            "id":697644,
            "title":"Sheeba gets back to the hotel and falls asleep. "
        },
        "1222222112212211":{
            "author_id":"surferchic15",
            "author_name":"lolachica",
            "choices":[
                "Sheeba gains 200 pounds. ",
                "Sheeba goes and hides before Felix can come back"
            ],
            "content":"<div class=\"\"><div> <span>As Sheeba made her way to the hotel lobby, she smashes into Felix. Or, Felix runs into her extremely protruded belly that jiggled as he bumped. <br>\r\n<br>\r\n\"Ummm, hi Felix!\" Sheeba muttered as she collected herself.<br>\r\n<br>\r\nFelix looked at her confused, \"Sheeba? What happened to you?\" he said in a disgusted tone. <br>\r\n<br>\r\nSheeba collapsed from hunger, pinning Felix to the ground in her wake. <br>\r\n<br>\r\nHe pulled himself from beneath her, and (somehow) managed to get Sheeba sitting up.<br>\r\n<br>\r\n\"Food!\" she screamed, \"I need food!\" her drastic change in tone made the mingling people turn and stare. <br>\r\n<br>\r\nFelix, still helping a friend, went to the hotel kitchen and requested that every dish be brought to the woman sitting in the lobby. </span></div></div>",
            "created":1243314000,
            "id":697650,
            "title":"The Felix Encounter "
        },
        "12222221122122111":{
            "author_id":"as1224",
            "author_name":"george",
            "choices":[
                "and orders room service then goes to sleep",
                " stops buy every place that sells food than to the room to order room service"
            ],
            "content":"<div class=\"\"><div> <span>now 1,000 pounds sheba tells felix not to say anyting to the others. felix agrees and leaves. sheba of coarse whant more food looks to see is open. she gos in and ceans out the entire place just to wiegh 1,800 pounds. still hungry she run or in this case waddles very slowly to a nearby ware house and cleans it out. now wieghing 3,500 pounds heads back to the hotel.</span></div></div>",
            "created":1258272540,
            "id":791885,
            "title":"Sheeba gains 200 pounds. "
        },
        "122222211221221112":{
            "author_id":"as1224",
            "author_name":"george",
            "choices":[
                "felix tells the others the truth",
                "felix says she wnt to the beach at high tyde and got swept in"
            ],
            "content":"<div class=\"\"><div> <span>on the way she relized every store(except the buffet)open and ready to sell. by the time shes back at the hotel her cothing is barley holding and wieghing 12,000 pounds. she barley gets trough the dorway to her room. in her room she order enough dessert to feed 20 families of 16 obese people. now wieghing 600,000 pounds she tears her clothing flabb every where. she hears felix at the door and tells him to0rder all the food inthe town. worrying he does she eats every thing now wieghing 2,900,650 she breaks trough the floor. worred felix asked if he should tell the others. sheba says no, but felix is having second thuoghts</span></div></div>",
            "created":1258273440,
            "id":791894,
            "title":" stops buy every place that sells food than to ..."
        },
        "1222222112212211121":{
            "author_id":"as1224",
            "author_name":"george",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you suck no additions on this end. END OF STORY!!!!!!!!!!!!!!</span></div></span></div>",
            "created":1258273560,
            "id":791896,
            "title":"felix tells the others the truth"
        },
        "1222222112212211122":{
            "author_id":"as1224",
            "author_name":"george",
            "choices":[
                "felix leaves after feeding seba for a few years",
                "he marrys sheba becouse he relizes if he leaves who will take of sheba"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>sorrow filled the frieds much like fat and any substance edible filled sheba. the crew returned home except for sheba(obvously)and felix.</span></div></span></div>",
            "created":1258273920,
            "id":791897,
            "title":"felix says she wnt to the beach at high tyde an..."
        },
        "12222221122122111221":{
            "author_id":"as1224",
            "author_name":"george",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>felix dies a lonely man wishing he stayed to help sheba. and sheba wieghed 999,999,999,999,999 pounds when felix left and died of sarvation many years after wieghing 10 pounds</span></div></span></div>",
            "created":1258274280,
            "id":791898,
            "title":"felix leaves after feeding seba for a few years"
        },
        "12222221122122111222":{
            "author_id":"as1224",
            "author_name":"george",
            "choices":[
                "felix trys to encourage sheba to loose wieght",
                "felix continues feeding sheba without question"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>felix feeds sheba and raises money to get a crane to move sheba to his new home in the town. by the end of tis chapter sheba wieghs 2,934,345,677,999,750 pounds</span></div></span></div>",
            "created":1258274760,
            "id":791899,
            "title":"he marrys sheba becouse he relizes if he leaves..."
        },
        "122222211221221112221":{
            "author_id":"as1224",
            "author_name":"george",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>sheba gets angry and eat felix and everyone in town and every thing wieghing 500,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000, 000,000 pounds than she accidently rolls over and suffucats in her own fat.</span></div></span></div>",
            "created":1258275000,
            "id":791900,
            "title":"felix trys to encourage sheba to loose wieght"
        },
        "122222211221221112222":{
            "author_id":"as1224",
            "author_name":"george",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>felix kept on feeding sheba he fed her so much she wieghed a number that i cant register on this computer but you get my point. the both died old and happy(and for sheba very fat).</span></div></span></div>",
            "created":1258275300,
            "id":791901,
            "title":"felix continues feeding sheba without question"
        },
        "13":{
            "author_id":"gronk",
            "author_name":"Gronker",
            "choices":[
                "Tell them now.",
                "Tell them about it later."
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nMia stared down the wizard,<br>\r\nthere had been a long and arduos battle in which Isaac, Garet, Mia and Ivan had fought against an evil sorcerer who was terrorizing a village they were passing through.<br>\r\n<br>\r\nAfter a flurry of attacks and psynergy, the sorceror was close to death and it seemed like only one more blow would finish the wicked man forever. Mia rasied her staff and let out a stream of mercury psynergy which overcame the wizard, leaving the man still alive, though barely. As Mia looked over him, he muttered his last words, 'I place a curse upon thee, girl- whenever you see food, you will be wracked with an uncontrollable hunger and will be forced to finish all that is in front of you!' and with that, his body crumbled into ashes and blew away with the wind.<br>\r\n<br>\r\nMia, shocked at what she had heard, decided whether or not to tell Isaac and the rest of her party about the curse-</span></div></div>",
            "created":1144040400,
            "id":310429,
            "title":"A curse upon her"
        },
        "131":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "take her to a sorceress",
                "ignore it",
                "accept her fate"
            ],
            "content":"<div class=\"\"><div> <span>Mia tells her group about her curse of hunger and how she'll become fat. <br>\r\n<br>\r\n\"Hmm let's test this.\" Isaac said pulling out some food and waving it in front of Mia.<br>\r\n<br>\r\nAs the food entered her vision Mia immediately became wide eyed and pounced on it fiercely scarfing it down.<br>\r\n<br>\r\n\"Wow she showed no restraint.\" Ivan added.<br>\r\n<br>\r\n\"Oh no I really couldn't help myself.\" Mia cried.<br>\r\n<br>\r\n\"Well is this really a problem, so what if Mia gets fat. I think she'd look good with some extra weight.\" said Garet.<br>\r\n<br>\r\n\"As do I but her condition could hinder our journey.\" Isaac reasoned.<br>\r\n<br>\r\n\"So what should we do?\" asked Ivan.<br>\r\n<br>\r\n\"I figure we could...\"Isaac said</span></div></div>",
            "created":1465750980,
            "id":2163041,
            "title":"Tell them now."
        },
        "132":{
            "author_id":"gronk",
            "author_name":"Gronker",
            "choices":[
                "Run away!",
                "Explain everything to Garet"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nAbout a week later, Mia felt happy, the wizard's curse didn't seem to have held- she must have resisted it's effects as she had felt no hunger pangs or urge to gorge herself whenever she saw food.<br>\r\n<br>\r\nMia ran into Garet, who was munching on a box of cookies.<br>\r\n<br>\r\nMia was struck with a great pang of hunger and grabbing the cookie box, started stuffing the cookies into her mouth ravenously.<br>\r\n<br>\r\nGaret stared at her, goggle eyed but then snapped out of it once a rather embarassed Mia handed him back an empty box.<br>\r\n<br>\r\n'Hey, there were enough cookies in there to last a week, besides i would have let you have some if you'd just asked!' Garet said loudly<br>\r\n<br>\r\n'Sorry...' Mia replied very quietly<br>\r\n<br>\r\n'What's wrong anyway. Mia? It's not like you to take things without asking!' Garet said<br>\r\n<br>\r\nbefore Mia could reply, she felt her waist start to expand until it became a small potbelly, luckily Garet did not notice this because of her baggy dress, but Mia was shocked, she decided to-</span></div></div>",
            "created":1144818000,
            "id":312449,
            "title":"The curse takes hold"
        },
        "1321":{
            "choices":[
                "She eats, but gets caught.",
                "She eats undisturbed."
            ],
            "content":"<div class=\"\"><div> <span>  \"and another thi-\" Mia ran off before Garet could finish, making him even more steamed. She ran through the village at incredible speed, tears streaming down her face. She noticed the inn, quickly jumped inside and dove into the nearest door. Unfortunately, this was the larder... And a pretty big larder, easily taking up quarter of the inn. She leaned against the door, panting. When she caught her breath again see opened her eyes to look round the room...<br>\r\n<br>\r\n  She suddenly noticed all the food around and she almost felt like crying when her stomach roared with hunger... </span></div></div>",
            "created":1147064400,
            "id":331874,
            "title":"Big mistake!"
        },
        "13211":{
            "choices":[
                "Her room to calm down and think",
                "Inform the others of her situation"
            ],
            "content":"<div class=\"\"><div> <span>  Eyes darting around the room, her hands reached for the closest object- a huge three gallon tub of an unknown creamy substance. Ripping the lid off, she quickly tipped her head back, the container with it, and greedily guzzled the sweet contents. The fat spread throughout her, her belly, leg, arms and breasts swelling up and testing the endurance of her clothing. Her body ballooned and surged in all directions as the food filled her at an alarming rate, as she refused to breathe while stuffing herself.<br>\r\n<br>\r\n  She finished the tub at too great a pace and chucked it backwards (in the direction of the door), causing an almighty *CLUUUNG* to ring out, alerting and arousing the inn-keeper's suspicions that someone was, in fact, in the pantry, freeloading. Mia was in the process of moving towards another item to sate the uncontrollable hunger when three loud knocks on the door made her freeze and brought her out from the trance, making her see her new 70 pound heavier body jiggling slightly. Tears welled up in her eyes as the door opened and her stomach threatened to cave in. She ran through the opening door, dress ripping slightly, to...</span></div></div>",
            "created":1185598800,
            "id":429970,
            "title":"Short-lived rampage"
        },
        "13212":{
            "choices":[
                "She is able to hide",
                "She gets caught"
            ],
            "content":"<div class=\"\"><div> <span>She eyed the shelves of food and couldn't control herself. She practically dove into all the food and quickly got to work on eating. She gulped down every bit of food she saw, clearing out nearly the whole larder. Soon her small pot belly grew into a huge tummy that not even her baggy dress could hide. Her whole body was swelling with fat, she could barely move. \"Oh no! What's happening to me!!!!\" she said to herself. She tried to stop but she was just so hungry and the hunger wouldn't go away. She continued eating, stuffing food in her mouth as she quickly expanded, getting fatter and fatter. As she was swallowing down the last of the food she heard someone approaching the door.</span></div></div>",
            "created":1246338000,
            "id":717059,
            "title":"She eats undisturbed."
        },
        "132121":{
            "author_id":"as1224",
            "author_name":"george",
            "choices":[
                "she eats everything in the place",
                "she manges to only eat 3/4ths of the buffet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After the person passed she came out of hiding. she was trying to get out of town,but on the way she came across a all you an eat buffet</span></div></span></div>",
            "created":1258269840,
            "id":791873,
            "title":"She is able to hide"
        },
        "1321211":{
            "author_id":"as1224",
            "author_name":"george",
            "choices":[
                "the person turns at the last munite leaving her undisturbed",
                "the person comes through but taught her to be a hill"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she now is so big she has to roll to get out of town.finally out of town she comes across an orange orchered, but she hears somthing in the distance</span></div></span></div>",
            "created":1258270200,
            "id":791874,
            "title":"she eats everything in the place"
        },
        "14":{
            "author_id":"as1224",
            "author_name":"george",
            "choices":[
                "she gets up to get her food ",
                "she moves the fridge for future refrences",
                "she calls for room service to get the food from the fridge",
                "she calls for roomservice to bring food",
                "she calls room service to move the fridge for future refrence"
            ],
            "content":"<div class=\"\"><div> <span>on rakel's journy to find her father she runs into a merchant selling fruit the man warned her he sells fruit that has unkown sideaffects, but she was in a rush and didnt pay attention and chose one of the fruits he warned her about. right before battle she ate the fruit, because she was hungry she emmeditly got full and stayed full for the rest of the day. but during the night a change was happenning. she woke up in the middle of the night, becuase she had a wierd dream she went to the refrigerater to get water when she noticed her clothes got a little bit tighter. she nothing of it since it was mabye only 5 or 6 extra pounds. next day she noticedher cothes were realy tight and she woke up at 2:00 pm when she usally wakes up at 5:00am. she also noticed she had an urge to eat tons of junk food and didn,t feel like doing the daily excersizes. after getting out of bed she felt like she wieghed 300 lb instead of 125 lb <br>\r\n(lb = pounds). it took her 3 trips to the kitchen to finally see she was 300lb in the mirror. she was a little upset, but she didn't seem to care any more. all day she sat in front of the tv eating all kinds of garbage really fattening ones to. the fruit added 175 lb every night but than it increased to 200 lb a night and she ate 300lb worth of junk so by the afternoon when she woke up she wieghed 800 lb this time she really didn't want to do any thing exept sit down watch tv and eat.</span></div></div>",
            "created":1258277460,
            "id":791908,
            "title":"Rakel"
        },
        "145":{
            "author_id":"as1224",
            "author_name":"george",
            "choices":[
                "tell rakel he likes her",
                " show n emotion and walk away",
                "just stare until superviser yells at him to get back to work"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the owner loved money so he made room service moove the fridge. one of the room service guys was angry until he saw rakel in her tight sleep wear. he sort of had a thing for large women. </span></div></span></div>",
            "created":1258278060,
            "id":791910,
            "title":"she calls room service to move the fridge for f..."
        },
        "15":{
            "author_id":"kraw",
            "author_name":"Kraw",
            "choices":[
                "Karis",
                "Sveta",
                "Himi",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, how about the new girls from Dark Dawn?</span></div></span></div>",
            "created":1293420960,
            "id":1023126,
            "title":"Other"
        }
    },
    "info":{
        "author_id":"gronk",
        "author_name":"Gronker",
        "brief_description":"Fatten up the girls from the Golden Sun games",
        "created":1143923100,
        "description":"<td align=\"left\" class=\"norm\"><br>\r\nA WG Interactive in which the girls from Golden Sun game series gain weight, no vore, sex or killing off the main characters, apart from that pretty much anything goes- have fun!</td>",
        "id":1089098,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1465750980,
        "modified":1465750980,
        "pretty_title":"Golden Sun Weight gain Interactive"
    }
}