{
    "chapters":{
        "1":{
            "author_id":"guilhermehank",
            "author_name":"hank",
            "choices":[
                "A shrinking ray",
                "A special chemical ",
                "Radiation ? (not necessary from Earth)",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>- Michael ! Wake up.<br>\r\n- Argh...<br>\r\nMichael slowly get up from his sleep. In the future, they managed to get everything that a boy at his age ( and size) needed. He had clothes, hot showers, study and everything. Michael is a blue dark hedgehog (furry like, you know).<br>\r\nHis size was neve...aww who I am fooling at ? His size was always a trouble. He suffered bully and laughter of other kids, and while being a small kid, he doesnt knew how to react...soo sometimes that led to troubles with police.<br>\r\nBut that is past, Michael is a grown man and ready to finally be shrunk back and be a man for the first time.<br>\r\nAfter taking a shower, getting dressed, eat breakfast and say good bye to his family...he finally start to walk to the normality.<br>\r\nThe scientist, to shrink him, would use...<br>\r\n</span></div></div>",
            "created":1335847080,
            "id":1326703,
            "title":"The beginning..."
        }
    },
    "info":{
        "author_id":"guilhermehank",
        "author_name":"hank",
        "brief_description":"This story is about Michael and how scientists try to shrink him back to normality. ",
        "created":1335846240,
        "description":"<td align=\"left\" class=\"norm\">In the year of 2035...<br>\r\nThis is story about Michael, he is like any normal person, he go to school, he study, he watch movies, he plays...try to be happy...But...he shares a trouble.<br>\r\nWhen he had birth, the doctors saw that he was bigger than any another baby, but that was ok. However...in his 3ª birthday, he was the size of a 6ª year old. At 10 years, he was the size of a of their house. Michael suffers from a disease that makes the individual grow and grow. He is 19 now days, he have 134 (going to 135) ft. His family its made of his mother, his father and his little sister (she have a good reason to call him big brother). He like being bigger but...he wished that he was normal as well. He had a girlfriend but she dumped him for another guy, saying \"sorry...I like you but...its just that you are waaay too big \" in tears.<br>\r\nAt the age 19, scientists finally founded a way to cure him and make him normal. But, it will really work ? The giant hedgehog will finally be normal ? or the things will only get worse ?...Find out here and...please, add some chapters  :P</td>",
        "id":1864862,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1335847080,
        "modified":1335847080,
        "pretty_title":"Michael The Giant Hedgehog"
    }
}