{
    "chapters":{
        "1":{
            "author_id":"dannyboy101",
            "author_name":"Trigger The Chu",
            "choices":[
                "Cream becomes chubby and started gaining.",
                "Cream getting fat from one of Tails' experiments.",
                "Cream and the BIG meal (Like Virus-20's comic)",
                "Cream dreams of a world of sweets.",
                "Free Choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do you want to make this bunny gain?</span></div></span></div>",
            "created":1526792400,
            "id":2496120,
            "title":"Cream's choices."
        },
        "12":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "She began to grow fatter!",
                "She began to regress in age?",
                "She felt an uncontrollable hunger..."
            ],
            "content":"<div class=\"\"><div> <span>Cream went over to Tails' house one day, as she was invited to try out one of Tails' new inventions. She loved hanging out with Tails, and seeing one of his new devices or machines was always a delight.<br>\r\nWhen she reached the door, she knocked on it and Tails soon opened it.<br>\r\n\"Hey, Cream! Thanks for coming!\" Tails said, gesturing for Cream to come inside.<br>\r\nCream smiled. \"Anytime, Tails! What kind of device do you have today?\" Cream wondered as she entered, looking around the room. One thing stood out in particular, a rather large device that seemed to be some kind of laser emitter.<br>\r\n\"This is my Growinizer! It makes anyone who it's pointed at grow huge!\" Tails explained. \"Just stand right there, and I'll hit you with it.\"<br>\r\nCream clapped. \"Yayy! I've always wanted to be bigger!\"<br>\r\n<br>\r\nTails aimed the laser, and shot it at Cream, sending a bright blue ray of electrical light towards Cream. She felt something inside her change, when suddenly...</span></div></div>",
            "created":1526965200,
            "id":2497077,
            "title":"Cream getting fat from one of Tails' experi..."
        },
        "123":{
            "author_id":"sagepsypris",
            "author_name":"TheSage",
            "choices":[
                "Most deffinatly hungry now (blindly eats)",
                "Hunger wares off fter a few minutes (eats some, but stops)",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>A gurgle, a very low slightly ominous gurgle happened.  Not expecting the effects of the ray to take hold so quickly he hesitantly walked over to Cream.<br>\r\n<br>\r\n<br>\r\n\"Oh my,\" Cream let out softly as her belly rumbled. She felt empty, dangerously so, dispite having already eaten a pretty big meal by her standards nit even a half hour ago.<br>\r\n<br>\r\n<br>\r\n\"Hey Cream,\" Tails wandered over to his now hungry friend \"How are you feeling?\"  She didn't know quite how to answer his question right away.  She knew wht she felt wasn't hunger just yet, but she should eat.<br>\r\n<br>\r\n<br>\r\n\"Honestly I don't quite know yet,\" her eyes cought site of Tails' tabble of snacks. \"But I feel empty,for sure.\"<br>\r\n At this point there was a rumble as Cream started  to pay more attention to the table full of all the best food she could imagin.  She walked over completely drowning out any of Tails' questions as her focus was solely on filling this emptyness she felt in her stomach.  It started with a cookie, she inhaled it, not even noticing what flavor it was.  Not that it mattered for now she was after one thing food, it didn't matter what kind of food it was as long as it could fill her empty stomach.  It only took her ten minutes to fully eat 4 bakers dozens of cookies.  Tail's was so excited that his hunger ray was working well he walked up behind his friend with a big smile and positive reenforcement.<br>\r\n<br>\r\n\"Oh wow Cream, I guess you were rather hungry,\"<br>\r\n<br>\r\n\"Hungry,\" Cream mindlessly repeated inbetwen snack cakes, and dounuts much to the excitement of Tails.<br>\r\n<br>\r\nwhere should this go... will cream get hungryer, or will the effects wear off... YOU DESIDE!!!! <br>\r\n</span></div></div>",
            "created":1531198800,
            "id":2517579,
            "title":"She felt an uncontrollable hunger..."
        },
        "13":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Was getting tankards of ice cream ready for her daughter.",
                "Began working on the next batch, showing her pouring WG formula into the food.",
                "Started playing with Cream's growing flab, watching it bloat and fill her up."
            ],
            "content":"<div class=\"\"><div> <span>Cream was walking around Mobius one day, and she felt her stomach growl. It had been a while since she had a good meal, and she knew her mother was wonderful at making delicious food for her, so she decided to make her way to her mother, Vanilla's, house.<br>\r\n<br>\r\nWhen she arrived, she saw her mother in the kitchen, already making a meal for Cream. Upon turning, Vanilla seemed to have a large platter of food on a dish, walking towards Cream and asking. \"Are you hungry, dear? I have plenty of food for you to eat, and I have much more where this came from.\"<br>\r\n\"Yum! Yes, please!\" Cream said sitting down at the table where Vanilla placed the dish down when she began to ravenously and gluttonously devour everything on the plate. Everything was better than she imagined it would be, greasy burgers, succulent hot dogs, and outstanding fries, all hers for the eating.<br>\r\n\"Yes, eat, Cream! Keep eating and getting fatter.\" Vanilla said. \"You're such a cute, adorable little girl, but all little girls need to grow!\"<br>\r\n<br>\r\nSoon, Cream was finished, and Vanilla had already replaced her meal with a significantly larger one, much to Cream's excitement. Cream didn't know where all this newfound gluttony was coming from, but she loved it with a passion, and wanted only to eat more and more.<br>\r\nAs Cream was eating her food, Vanilla...</span></div></div>",
            "created":1526965200,
            "id":2497087,
            "title":"Cream and the BIG meal (Like Virus-20's comic)"
        },
        "131":{
            "author_id":"dannyboy101",
            "author_name":"Trigger The Chu",
            "choices":[
                "Gives the hose back to Cream.",
                "Puts the hose into her mouth.",
                "Gives Cream another hose as well as the first one."
            ],
            "content":"<div class=\"\"><div> <span>Cream had bloated up so much that she broke the chair she was sitting on. As far and full as she looked, her stomach still grumbled for more.<br>\r\n<br>\r\n \"Now I want dessert, mommy.\" Cream said to Vanilla.<br>\r\n \"Okay. I get the tank and hose.\" Vanilla said.<br>\r\n<br>\r\n Vanilla then went to a big tank of ice cream and took the hose out. She then put the hose into Cream's mouth and turned the machine on. Cream happily gulped down the ice cream. As she did, she bloated up bigger and bigger.<br>\r\n<br>\r\n \"Drink up my big sweet cake. The eating has only just begun.\" Vanilla said happily.<br>\r\n<br>\r\nCream was filled with more and more and still wanted more. Vanilla was more than happy to oblige and turn the knob higher. Cream was now grow fatter and fatter. She stopped after bloating up to a giant pear size. <br>\r\n<br>\r\n \"That was good, mommy. But I'm still hungry. I still want some more.\" Cream said to Vanilla.<br>\r\n \"Don't worry. I still have plenty of more ready for you.\" Vanilla said. \"Let me just check the machine.\"<br>\r\n<br>\r\n As Cream tilted over, Vanilla wanted to check in the tank. As she checked the tank, she looked at the hose. She fed Cream with it for a while and realized how addicted she was to it. She then...<br>\r\n</span></div></div>",
            "created":1526965200,
            "id":2497334,
            "title":"Tankards of ice cream ready for her."
        },
        "1313":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Played with Cream's growing body.",
                "Upped the intensity of the ice cream.",
                "Took the hoses out, wanting to feed her food by hand."
            ],
            "content":"<div class=\"\"><div> <span>Vanilla smiled and handed the tube back to Cream, as well as another tube so her growth could continue twice as fast. As she turned the machine back on, Vanilla could visibly see Cream becoming larger and fatter, her weight pouring across the floor and making her clothes tight along her fattened body.<br>\r\nCream's butt was huge, flooding into the rest of the kitchen, yet her panties held on strong. They stretched around her massive, thick hips, and only accentuated her curvaceous body.<br>\r\n\"Oh, you're so big, so perfectly huge and blobby! But you should be bigger, my dear, much bigger!\" Vanilla stated, as she...</span></div></div>",
            "created":1527051600,
            "id":2497426,
            "title":"Gives Cream another hose as well as the first one."
        },
        "13132":{
            "author_id":"dannyboy101",
            "author_name":"Trigger The Chu",
            "choices":[
                "Tails came in.",
                "Cream goes out to find more food.",
                "Cream sees another tank of ice cream."
            ],
            "content":"<div class=\"\"><div> <span>Vanilla turned both tanks to the max, causing more ice cream to come out of the tube in an alarming rate. More cream went through the tube and right inside Cream's belly. Soon she swelled up bigger and bigger, filling up half of the room. Cream enjoyed every passing second.<br>\r\n<br>\r\n\"More! More!\" Cream muttered.<br>\r\n<br>\r\nAs Cream filled up more, Vanilla was starting to get smuttered by both by the wall and Cream's fat. She didn't seem to mind it. When the tanks were on empty, Cream filled up 2/3 of the whole house. Once Cream realized that the tanks were empty, she spat out the hoses from her mouth.<br>\r\n<br>\r\n\"Awww! I wanted to have some more.\" Cream said disappointed.<br>\r\n <br>\r\nCream looked down and noticed that her mom was passed out. Either cause Cream accidently knocked her out or because her fat was soft enough to rest on. Either way, Cream still wanted more food. At that moment....<br>\r\n<br>\r\n</span></div></div>",
            "created":1527051600,
            "id":2497640,
            "title":"Upped the intensity of the ice cream."
        },
        "131323":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Her mother came back to pamper her.",
                "Cream's fat began to spread into the nearby city.",
                "Someone else found Cream."
            ],
            "content":"<div class=\"\"><div> <span>Cream noticed another tank of ice cream, this one quadruple the size of the other one! It towered over her like a monolith, and Cream wanted to eat it all! She grabbed the tube and chugged it down happily, filling up her body with all the ice cream she could handle.<br>\r\nHer weight spread across her entire house until it collapsed, and even then she continued growing larger. She wanted to have it all, to be bigger and bigger without end!<br>\r\n<br>\r\nCream continued chugging the ice cream nonstop, barely a quarter of the way in when suddenly...</span></div></div>",
            "created":1527224400,
            "id":2498764,
            "title":"Cream sees another tank of ice cream."
        },
        "1313232":{
            "author_id":"dannyboy101",
            "author_name":"Trigger The Chu",
            "choices":[
                "Covered more cities.",
                "Covered half the world.",
                "Took a break."
            ],
            "content":"<div class=\"\"><div> <span>Already outgrowing her house, Cream had only continued to grow fatter and fatter so long as she was willing to. Soon, her body began to turn more blob-like and spreaded out more to the nearest city.<br>\r\n<br>\r\nAt first some people were confused with what they were seeing. But once the blob began getting close to the city, they all started to panic. Anyone who didn't want to get covered on Cream's flab ran for it.<br>\r\n<br>\r\nEven with the tank down to half, Cream still continued to grow.<br>\r\n<br>\r\n'More! I want to get even bigger.\" Cream said happily still wanting more.<br>\r\n<br>\r\nAfter covering the the city, it was on to more areas. Cream then....</span></div></div>",
            "created":1527224400,
            "id":2498830,
            "title":"Cream's fat began to spread into the nearby..."
        },
        "13132322":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Noticed the tank refilled itself, it was a near infinite supply!",
                "Ran out of cream, but wanted to be fatter!"
            ],
            "content":"<div class=\"\"><div> <span>With the tank now down to a quarter left, Cream had covered half of her home planet in her gigantic, massive flab. She loved every second, flooding the world in thick, doughy pudginess that went on forever, continuing to grow and grow as she chugged more of the fattening ice cream. However, it seemed to be running out.<br>\r\n<br>\r\nAs Cream covered more of the planet, her body slowly outgrowing the very planet she once called home, too big to even stay on it without crushing almost all of the life on it, she...</span></div></div>",
            "created":1527310800,
            "id":2498934,
            "title":"Covered half the world."
        },
        "131323221":{
            "author_id":"dannyboy101",
            "author_name":"Trigger The Chu",
            "choices":[
                "Outgrew the solar system.",
                "Outgrew the galaxy.",
                "Outgrew the Universe."
            ],
            "content":"<div class=\"\"><div> <span>As Cream thought the tank was gonna run out, something surprising happened. The tank slowly refilled itself. In someway, the tank seem to have an infinite supply of ice cream. Either way, it was good for Cream. It meant she could eat more and bigger without stopping.<br>\r\n<br>\r\n\"Heehee! Watch out, world. I'm gonna be bigger than you soon. As we'll as everything else.\" Cream thought.<br>\r\n<br>\r\nNone long after, she outgrew the planet, but was only get started. Soon, she became twice the size of the planet and was only growing fatter with every passing second. <br>\r\n<br>\r\nAs minutes and hours pass, Cream....</span></div></div>",
            "created":1527742800,
            "id":2501082,
            "title":"Noticed the tank refilled itself."
        },
        "1313232211":{
            "author_id":"dannyboy101",
            "author_name":"Trigger The Chu",
            "choices":[
                "Keep going.",
                "Stop for a bit."
            ],
            "content":"<div class=\"\"><div> <span>More and more Cream's belly swelled. She continued to gulp down more from the ice cream tankard. Soon after, planets that were close were doomed to be trapped in Cream's flab. The once little bunny now filled up the galaxy.<br>\r\n<br>\r\n\"Wow! I fill like I'm bigger than everything.\" Cream thought. \"This was a really big meal. I feel so full. Should I keep going?\"<br>\r\n<br>\r\nCream thought with her cosmic side, was she big enough? Cream decided to...<br>\r\n</span></div></div>",
            "created":1536037200,
            "id":2542965,
            "title":"Outgrew the solar system."
        },
        "13132322111":{
            "author_id":"anon5601",
            "author_name":"Anon5601",
            "choices":[
                "Another hose appeared to feed Cream!",
                "Another person joined Cream and Vanilla!",
                "Vanilla gives the hose back to Cream!"
            ],
            "content":"<div class=\"\"><div> <span>Cream still wanted more ice cream.<br>\r\n<br>\r\nAs she continued to gulp down even more of the sweet infinite cream, her massive blobby body continued to grow and grow and grow. Soon, she outgrew even her own galaxy and couldn’t stop. With every gulp, fat flowed out in every direction.<br>\r\n<br>\r\nAs Cream kept growing, she felt in one of her many fat folds someone hiding. It was her mother, Vanilla!<br>\r\n<br>\r\n“Mommy, I’m so glad you’re okay!” said Cream. Apparently, Vanilla woke up from her slumber to find that she was no longer on Mobius, but on her own gigantic daughter!<br>\r\n<br>\r\n“My my, haven’t you done quite the growing while I was asleep!” said Vanilla. <br>\r\n<br>\r\n“Mommy, this ice cream is so good! You just have to try some for yourself.” Said Cream.<br>\r\n<br>\r\nVanilla did just that. Taking the hose from her daughter she put it in her mouth and let the ice cream flow. With every swallow she grew at an alarming rate. Within a minute, she was becoming a blob herself, and Vanilla was loving it just as much as her daughter was before. “You’re right sweetie, this tastes incredible! And all this fat just makes me want more!” Vanilla muttered in between gulps.<br>\r\n<br>\r\nWhile still a speck compared to her daughter, Vanilla was already growing pass the size of a house and growing more with every gulp.<br>\r\n<br>\r\n“Aw, but mommy, I want some more ice cream too.” said Cream, who was suddenly very hungry.<br>\r\n<br>\r\nJust then, out of nowhere...</span></div></div>",
            "created":1574139600,
            "id":2748653,
            "title":"Keep going."
        },
        "131323221111":{
            "author_id":"anon5601",
            "author_name":"Anon5601",
            "choices":[
                "They broke open the entire universe!",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>Vanilla was bloating up the more she ate. Every gulp caused her to get fatter and fatter, soon nearing the size of her gigantic daughter. “Mmm, it’s soooooo good. I need more, more, MORE!” Vanilla thought as the two rabbits had now outgrown the very solar system they were once apart of. <br>\r\n<br>\r\nWhile Vanilla was enthralled in her cream-filled gluttony, her daughter Cream was absolutely starved at this point, her tummy rumbling so loudly that it sent ripple across all of her fat. “Ooooh, I’m so hungry and mommy won’t share with me!” Cream complained.<br>\r\n<br>\r\nSuddenly out of nowhere, as if the machine feeding the rabbits was reading Cream’s mind (and stomach), another hose came from the machine and right into Cream’s mouth! Almost immediately, Cream was being fed with ice cream once again, her belly gurgling in happiness over finally being fed again. “Mmmmm, yes it’s so delicious! I want to be fatter than ever before!” Cream said in ecstasy.<br>\r\n<br>\r\n“Cream this ice cream is amazing, the more I eat the fatter I get, and the fatter I get the more I want to eat!” Vanilla said to Cream. “I know mommy, I feel the same. I’m so happy I can get fatter than the universe with you mommy!” Cream said to her mother, both still gaining at an alarming rate. “Mommy?” “Yes, Cream my cute blubbery baby?” “I want to keep gaining forever, do you want to with me?” “Of course, sweetie!”<br>\r\n<br>\r\nIt seemed like the gain of the two rabbits would never end. The cream flowing from the tubes into their immense bellies, causing more and more fat to be added onto their gargantuan blobby bodies, fat flowing out in every direction with every gulp. Soon the two had outgrown their galaxy and continued growing until they had nearly reached the ends of the universe, the machine never ceasing to provide both orbs of rabbit fat with ice cream. Soon, there was nothing in the universe but the blubbery fat of the mother-daughter duo, taking up all the space that there could be, even though the universe was thought to have been infinite.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1577941200,
            "id":2768399,
            "title":"Another hose appeared to feed Cream!"
        },
        "1313232211111":{
            "author_id":"anon5601",
            "author_name":"Anon5601",
            "choices":[
                "The machine stopped",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Cream and Vanilla couldn’t stop eating the infinite ice cream flowing from the machine into their stomachs, constantly gurgling in delight as more and more fat was being added on to the already universe-sized bunnies. “Mmm, it’s sooooo good. Keep growing, I want to more and more!” Cream thought <br>\r\n<br>\r\nThe two rabbits continued to eat and eat, soon reaching the ends of the universe. But just because the universe stopped for the mother and daughter didn’t mean the machine would. No, the machine made sure that these two would become bigger and bigger no matter what.<br>\r\n<br>\r\nStill being pumped full of ice cream, Cream and Vanilla suddenly heard a loud shattering noise! “What was that mommy?” Cream asked, taking a break from eating. “Seems the universe couldn’t handle all of our blobby bunny fat.” Vanilla said, still eating as her sized still paled in comparison to her daughter’s. “Oh wow, I can’t believe we’ve gotten so big already, I can’t wait to grow even bigger!” Cream said. “It seems we have enough space now to grow as much as we want forever my ‘big’ little honey bunny!” Vanilla said.<br>\r\n<br>\r\nWith both of the bunnies getting back to eating, it seemed their growing would never seize, the machine always providing them as much ice cream as they could handle. Every gulp added to the rabbit’s universe-sized blubber.<br>\r\n<br>\r\nCream and Vanilla continues eating and eating until...</span></div></div>",
            "created":1579755600,
            "id":2777624,
            "title":"They broke open the entire universe!"
        },
        "13132322111112":{
            "author_id":"anon5601",
            "author_name":"Anon5601",
            "choices":[
                "The machine somehow ran out of ice cream!",
                "The universe wasn’t the only thing that would burst today"
            ],
            "content":"<div class=\"\"><div> <span>While the mother and daughter bunnies were still eating the ice cream, still infinitely getting fatter and fatter, something happened. Cream and Vanilla were beginning to feel full!<br>\r\n<br>\r\n“Ohhh, mommy my tummy’s feeling stuffed now. Can we stop?” Asked Cream to her gigantic blob of a mother. *huff* *huff* “I’m getting pretty full too now sweetheart. I think we can take a bit of a break.” Said Vanilla, as she and her daughter stopped eating from the machine for the moment.<br>\r\n<br>\r\nHowever, not even a minute after the two stopped eating, the hoses forced themselves back into the mouths of the two bunnies! Now they were being force-fed the ice cream at what seemed like double or even triple the rate they were eating at before. Their already planet-sizes cheeks began to swell even more with all the ice creamed being pumped into the duos not-so-awaiting stomachs.<br>\r\n<br>\r\n“Mommy! What’s going on?!” “I don’t know honey, the hoses won’t stop!” Said Cream and Vanilla, their mouths muffled by the hoses. Now, the rate ice cream being consumed caused both bunnies galactic bellies to begin to bulge out, ice cream constantly filling it, not having a chance for the body to digest it fast enough. Soon, both bunny bellies were bright red from the strain of all of the ice cream.<br>\r\n<br>\r\nWhat happened next was...<br>\r\n<br>\r\n</span></div></div>",
            "created":1579755600,
            "id":2777633,
            "title":"The bunnies are full"
        },
        "131323221111121":{
            "author_id":"anon5601",
            "author_name":"Anon5601",
            "content":"<div class=\"\"><div> <span>Feeling fuller they had ever felt before, Cream and Vanilla were begging for the machine to stop, the strain this amount of ice cream had on the bellies being consumed at this rate was near unbearable. “Ohhhh, mommy my tummy really hurts now! I want I to stop!” “I know honey, mommy feels the same way, but I don’t think there’s anything we can do except eat!” Vanilla said to Cream through the constant gulping of ice cream.<br>\r\n<br>\r\nAt this rate, it seemed the bunnies would be too full, their bellies reaching max capacity, their cheeks swelling to the size of galaxies now, nearly being consumed themselves by their own neck and face fat. Cream and Vanilla were becoming as big as the multiverse, and might even cause their own “Big Bang”!<br>\r\n<br>\r\nSuddenly, for some reason, perhaps because the near infinite supply or because someone somewhere was able to turn it off, the machine stopped feeding Cream and Vanilla! The hoses retracted back to wherever their source was located, leaving the two with their own fat and each other.<br>\r\n<br>\r\n“Thank goodness the feeding is finally over” said Vanilla, relieved that neither she nor her daughter would meet the same fate as the universe they just recently burst out of. “Hehehe, even though I feel soooo full now, that was so much fun to get fat with you mommy!” Said Cream, ecstatic that such a wonderful meal with her mother ended the way it did.<br>\r\n<br>\r\nAnd then the two bunnies here a peculiar rumbling. <br>\r\n<br>\r\n“What was that mommy?” “That was our stomachs sweetheart.” Cream said to Vanilla, both seeming bewildered at the incredible gurgling that emanating from their stomachs, the force causing all of their fat to jiggle as much as it ever had before.<br>\r\n<br>\r\nAll that ice cream that the two had eaten so quickly gave each of the bunnies quite the tummy ache, and how does one fix a tummy ache? With a burp. The mother (and daughter) of all burps to be exact.<br>\r\n<br>\r\nBWOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO OOOOOOOOOOOOOOORP!<br>\r\n<br>\r\nAs if I’m unison, Cream and Vanilla let out a chorus of gas from their mouths. Even though there were no planets in sight, these burps somehow caused a massive earthquake, one that shook the foundation of reality itself. And it could not have been more satisfying to the mother and daughter.<br>\r\n<br>\r\n“Hehe, that was a lot of gas mommy!” “Ah, nothing like a gigantic burp to ease a stomach” Cream and Vanilla said, relieved that their meal ended on quite the high note.<br>\r\n<br>\r\nNow, Cream and Vanilla were able to talk to each other and be amazed at all the fat they had up to this point, looking at each of their now multiverse-sized blobs of bunny fat, and loving each other like only a mother and daughter could.<br>\r\n<br>\r\n“Mommy?” “Yes my blubbery sweetheart?” “I love you. Thank you for getting so fat with me.” “I love you too Cream, I had a wonderful time getting fat with you.”<br>\r\n<br>\r\n                                   THE END</span></div></div>",
            "created":1579755600,
            "id":2777640,
            "title":"The machine somehow ran out of ice cream!"
        },
        "1313233":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Tails the fox.",
                "Antoine the coyote.",
                "Your own choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As someone who was watching nearby found Cream herself for after all it was either someone she knew or didn't even know.<br>\r\n<br>\r\nWho was it that found Cream?</span></div></span></div>",
            "created":1569474000,
            "id":2723845,
            "title":"Someone else found Cream."
        },
        "14":{
            "author_id":"dannyboy101",
            "author_name":"Trigger The Chu",
            "choices":[
                "Some lollipops.",
                "The chocolate trees.",
                "The milkshake river.",
                "Candy roads.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>If there's one thing Cream loves to do, is sleep. Sleep and dream. Currently, she was sleeping and already in dreamland. Another thing Cream loves, is sweets. That's why she was currently dreaming of a world made entirely out of the stuff.<br>\r\n<br>\r\nThe sky was blue with pink clouds made of cotton candy, grass and bushes made out of sugar, chocolate trees, giant lollipops, hard candy roads, a vanilla milkshake river, and many other delight. It was a sweet paradise.<br>\r\n<br>\r\n\"Oh my! So many yummy treats. Where do I start?\" Cream asked herself.<br>\r\n<br>\r\nAfter looking around, Cream started with....</span></div></div>",
            "created":1526965200,
            "id":2496977,
            "title":"Cream's sweet dream."
        },
        "142":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Cream devours the entire tree",
                "Cream moves on to a different snack.",
                "Cream is greeted by someone."
            ],
            "content":"<div class=\"\"><div> <span>Licking her lips Cream went over to one of the chocolate trees and took a large bite. The chocolate bark peeled away easily revealing that the tree had rich chocolate fudge in place of sap.<br>\r\nCream continued taking bites of the tree and it didn't take long for a noticeable pot belly to develop on the young girl.</span></div></div>",
            "created":1567746000,
            "id":2714317,
            "title":"The chocolate trees."
        },
        "1421":{
            "author_id":"andrewiscool12",
            "author_name":"Andrew ",
            "choices":[
                "She looks for another treat.",
                "A random person walks up to her.",
                "She starts eating everything in sight."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cream was so hungry, she had eaten the entire tree. Licking the chocolate from her lips, she then moved on to another tree. And another tree. Her belly started to stick out more and more so. After finishing a third tree...</span></div></span></div>",
            "created":1579928400,
            "id":2778250,
            "title":"Cream devours the entire tree"
        },
        "15":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Yess~",
                "Nah, I like her at this age."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe we could have a younger cream gaining?</span></div></span></div>",
            "created":1526965200,
            "id":2497080,
            "title":"Free Choice."
        },
        "151":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Toddler (3-5 years old)",
                "Baby (1-2 years old)",
                "Basically Newborn (1 second-11 months old)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How young?</span></div></span></div>",
            "created":1526965200,
            "id":2497081,
            "title":"Yess~"
        },
        "152":{
            "author_id":"deadspace123",
            "author_name":"Sans ",
            "choices":[
                "Story 5",
                "Story 6?",
                "More?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about alien abduction? Cream get's fattened up by little green men.<br>\r\n<br>\r\nMaybe a trip to the circus will make Cream fat? Clowns love cream pies after all. <br>\r\n<br>\r\nMore?</span></div></span></div>",
            "created":1526965200,
            "id":2497132,
            "title":"Nah, I like her at this age."
        },
        "1521":{
            "author_id":"deadspace123",
            "author_name":"Sans ",
            "choices":[
                "Flipped her on her belly and pulled down her pants to stick a tube in her butt",
                "Began to feed her strange alien food",
                "Injected somthing into her. "
            ],
            "content":"<div class=\"\"><div> <span>Cream woke up from her sleep. she felt groggy and sore. <br>\r\n\"Ugh....where am I? she said as she found herself on a metal table in her cute blue PJs. all alone. <br>\r\nShe tried to get up only to find her arms and feet where stuck as their where cuffs keeping her pinned to the table. <br>\r\n<br>\r\nCream began to panic \"Hello!? help where am I?<br>\r\nSuddenly a bright light filled the room as she heard a strange voice said \"The mammal is awake. now we can began are probing and testing...\" <br>\r\nCream looked all around to see tiny little grey aliens all around her with giant heads and big black eyes. <br>\r\nCream said \"Wait what are you going to do to me? stop!<br>\r\n<br>\r\nThe aliens ignored Cream as they began their tests, Cream looked on in fear as they....</span></div></div>",
            "created":1526965200,
            "id":2497137,
            "title":"Story 5"
        },
        "15212":{
            "author_id":"single22",
            "author_name":"Singed212",
            "choices":[
                "Add in a sedative to the mixture, tricking her emotions into liking the growth.",
                "Make Cream younger, where she might be able to enjoy the gain more."
            ],
            "content":"<div class=\"\"><div> <span>Cream felt a tube shove down her throat as she was strapped tight to a chair. As the tube began to pump, it filled her with a thick, gooey glop that, at first, tasted horrible. But, since she had no means of escape, she had to endure. She chugged it down, feeling sick to her stomach until she felt her belly begin to bloat up from the goop. It seemed to be artificially inflating her with lard and fat, skipping the digestive phase and moving right along to spreading out the weight evenly across her body.<br>\r\nCream tried even harder to escape, but only succeeding at jiggling about in futility as she grew larger and larger. Cream sighed, hoping only that her growth would end soon. She didn't want to be a big, fat blob. She wanted to be back on Mobius, where she could play with her friends, but here she was.<br>\r\n\"Hopefully Sonic will come soon, or maybe Tails or Knuckles, or Amy or anyone!\" Cream thought to herself.<br>\r\n<br>\r\nThe aliens noticed Cream was uncomfortable in her position, and they didn't like this. So, they decided to...</span></div></div>",
            "created":1526965200,
            "id":2497147,
            "title":"Began to feed her strange alien food"
        },
        "152121":{
            "author_id":"deadspace123",
            "author_name":"Sans ",
            "choices":[
                "Had one alien trasform into her mother, to encourage her to gain weight",
                "Put a mirror in front of her so she could see how fat she was getting"
            ],
            "content":"<div class=\"\"><div> <span>Cream hated the taste so much. it was so gross, but she had no choice but to keep drinking the alien goo.<br>\r\nIt filled up her white cheeks making them bloat out.<br>\r\n<br>\r\nAs she drank her whole body grew in weight gaining a big round fat belly that made her PJ top ride up.<br>\r\nShe grew plump fatty boobs, and her new round fat ass filled the chair she sat on.<br>\r\n<br>\r\nThe aliens where happy with the growth, but not with Cream's sadness. she looked so afraid and sad, so the aliens added a sedative to the alien goo to help Cream. <br>\r\nAs Cream drank, she suddenly felt strange. like almost good...the taste of the alien goo didn't taste as bad and the site of her own fat body was becoming less scary and more exciting. <br>\r\n<br>\r\nCream kept drinking and soon found herself liking the WG as she said in her head \"Maybe this isn't so bad....I could get used to this, in fact I want to be fatter, <br>\r\n<br>\r\nThe aliens wanted to help Cream enjoy this more, so they....</span></div></div>",
            "created":1526965200,
            "id":2497154,
            "title":"Add in a sedative to the mixture, tricking her ..."
        },
        "1523":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Story 7",
                "Next choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Story seven: perhaps she enters an eating contest and packs on more pounds than she expected.</span></div></span></div>",
            "created":1527742800,
            "id":2501394,
            "title":"More?"
        },
        "15231":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "The food was extremely fattening.",
                "She was doing better than some of the competition."
            ],
            "content":"<div class=\"\"><div> <span>Cream set down her place at a long table for the eating contest the local mall was hosting. Normally she didn't dissipate in this thing but prize was too good to ignore so she decided to give it a shot. However as the other contestants took their seats she felt a little discouraged as it seemed most of the contestants were mobians significantly older and larger than herself.<br>\r\n<br>\r\nCream did her best to suppress her doubts as the contest began. She was only a few plates in when she realized...</span></div></div>",
            "created":1567746000,
            "id":2714326,
            "title":"Story 7"
        },
        "15232":{
            "author_id":"shapeshifter5",
            "author_name":"Tacocat ",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps she could be a teenager?</span></div></span></div>",
            "created":1573534800,
            "id":2745768,
            "title":"Next choice."
        },
        "152321":{
            "author_id":"shapeshifter5",
            "author_name":"Tacocat ",
            "choices":[
                "Cream is a rich spoiled brat who gets whatever she wants when she wants it?",
                "Vanilla is secretly fattening her up.",
                "Cream wakes up in an alternate universe where only junk food exists.",
                "She’s a world famous plus sized pop star.",
                "More."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What story will teenage cream gain weight in.</span></div></span></div>",
            "created":1573534800,
            "id":2745771,
            "title":"Yes"
        }
    },
    "info":{
        "author_id":"dannyboy101",
        "author_name":"Trigger The Chu",
        "brief_description":"The little bunny from Sonic becomes not-so-little anymore.",
        "created":1526858700,
        "description":"<td align=\"left\" class=\"norm\">Based on Chubby-Chimaera's original post before it was gone. I'm just bring it back.<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\nCream is the main gainer, but others can join.<br>\r\nNo sexual stuff.<br>\r\nNo dirty stuff.<br>\r\nNo weight limit.</td>",
        "id":2158634,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1579976040,
        "modified":1579976040,
        "pretty_title":"Cream the Rabbit Weight Gain"
    }
}