{
    "chapters":{
        "1":{
            "author_id":"oliversmillie",
            "author_name":"Revilo",
            "choices":[
                "A Male/Female Space Captain",
                "A Male/Female Space Pirate ",
                "A Male/Female Crew member",
                "A Male/Female Alien ",
                "More Choices "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who/what are you? and what are you doing? </span></div></span></div>",
            "created":1450846800,
            "id":2078395,
            "title":"Who are you going to be?"
        },
        "13":{
            "choices":[
                "the captain tells them thier duties",
                "gives them a tour "
            ],
            "content":"<div class=\"\"><div> <span>Ashley reports directly to the Captain of her new ship. Ashley introduces herself along with her sixteen year old daughter Cassie and her other daughter twelve year old Zoe. Ashley also asks where hers and Ashley new uniforms are. Zoe politely asks if she can be any help. Next </span></div></div>",
            "created":1450846800,
            "id":2078635,
            "title":"A Male/Female Crew member"
        },
        "132":{
            "author_id":"oliversmillie",
            "author_name":"Revilo",
            "choices":[
                "Readers Choice ",
                "an emergency occurs while Ashley is changing ",
                "Readers choice "
            ],
            "content":"<div class=\"\"><div> <span>The Captain introduces himself as Captain Fairbanks, the captain of the USS Valiant, \"Welcome to the Valiant\" he smiled \"as you of course be aware the USS Valiant is one of hundred ships in the fleet\" \"The Valiant is a luxury cruise ship with six levels, each level is  \"Fairbanks replies to Zoe in a polite but strict way \"We are good at the moment Zoe, all i ask is that when your mum is on duty not to distract her.\" Zoe nodded.   Captain Fairbanks then takes them down a hallway where there are three rooms, one for each of them, \"here is your quarters Ashley\" Ashley sees a computer screen next to the door \"the door is encoded to your hand print to open the door you just press your hand to the screen\" Ashley reaches out her right hand and places it on the screen and a moment later a computer voice says \"Hand print recognized you are cleared to enter\" the door then slid open.  they all walked in as Captain Fairbanks continued  \"inside is a futuristic room with a levitating bed, some mirrors are attached to the wall above your bed,\" there is a also a chest of drawers and a side door that leads to the bathroom\" Ashley sees her uniform on her bed, the uniform is made up off a shirt, a jacket and pants which are all white on the ground next to the bed are a pair of black military shoes that changes to fit the wearers feet size and have automatic straps (Think Back to The Future) \"There is also a skirt if you don't want to use the pants\" Captain Fairbanks said.<br>\r\n\"I shall leave you briefly to get changed\" he then walked out of the room. The Door sliding shut behind him.<br>\r\n<br>\r\nAshley turned to her daughters \"I want you too get changed as well\" \"my shift starts soon, so don't dawdle\" \"yes mum\" they both said before leaving the room. Ashley then turned to her bed and thought 'Well this is home for the next five years' she then realized 'The Captain hasn't told me what my job is yet\" as she removes her clothing <br>\r\n<br>\r\n<br>\r\n<br>\r\n            </span></div></div>",
            "created":1451019600,
            "id":2079214,
            "title":"gives them a tour "
        },
        "1322":{
            "choices":[
                "welcome abroad party for her.",
                "pirates are in control now",
                "reader choice"
            ],
            "content":"<div class=\"\"><div> <span>As Ashley is changing an alarm goes off. She quickly puts on the rest of her uniform. To bad for her skirt is on backwards. She runs to find Captain Fairbanks. As she runs past her daughters they are still changing. She tells them for now to stay in their main living area that share. She goes to where the bridge is. Once she gets their she finds</span></div></div>",
            "created":1451096340,
            "id":2079359,
            "title":"an emergency occurs while Ashley is changing "
        },
        "13221":{
            "author_id":"oliversmillie",
            "author_name":"Revilo",
            "choices":[
                "Ashley meets her fellow crew mates",
                "jump to the following day as the USS Valient goes to space. "
            ],
            "content":"<div class=\"\"><div> <span>Ashley runs into the bridge \"what's the situation Capt-? \"SURPRISE\" shouted the Captain and the Bridge Crew, Ashley stops mid sentence \"what's this?\" Captain Fairbanks comes up to her with his smart phone \"Very well done Ashley 2 minutes 35 seconds\" :Not bad at all,\" \"Sir?\" Ashley says confused \"Sorry I wanted to test how quickly you would react in a an emergency and you exceeded my expectations\" <br>\r\n<br>\r\n\"Since you don't start your duties until tomorrow\" Captain Fairbanks began to say handing Ashley a glass of Champagne who accepted it \"you are allowed to have a few drinks in celebration of joining our crew,\" \"Sir exactly what are my duties anyway?\" \"you didn't say before\" \"Sorry\" The captain began \"I Didn't realize I forgot to tell you\" \"you will be serving the passengers who come on board tomorrow\" \"either with luggage or serving them drinks\" \"Pretty much helping making their stay on our star ship a pleasant one while we travel the stars and hop from planet to planet\" \"Yes sir\" Ashley said 'Well that sounds simple enough' she thought.  \"off course we may also have a few aliens on the ship tomorrow I expect you give them the same respect as the human passengers\" \"Yes Sir\" Ashley saluted. \"good,\" the captain said \"but for now go and meet the crew.\"         </span></div></div>",
            "created":1451114940,
            "id":2079464,
            "title":"welcome abroad party for her."
        },
        "132211":{
            "choices":[
                "reader choice",
                "reader choice"
            ],
            "content":"<div class=\"\"><div> <span>She goes around and introduces herself to her fellow crew members. She does let her daughters know what is going on. She also tells them to unpack. She has a great time at the party. As the party goes on they are heading to their next port of call. After the party she goes back to her cabin. She finds her daughters are watching a movie together. They also unpacked as she asked. After awhile they go to bed. The next day</span></div></div>",
            "created":1451179440,
            "id":2079741,
            "title":"Ashley meets her fellow crew mates"
        },
        "1322111":{
            "choices":[
                "show Sir Burlington his quarters",
                "she introduces him to her daughters"
            ],
            "content":"<div class=\"\"><div> <span>Ashley is called to Captain Fairbanks's ready room. Captain Fairbanks tells a very important person is coming on board. He tells her that is important he is kept happy and is up to her. The guy coming on board is leader of huge colony world. He can be very demanding. The guy's name is Sir Burlington. Ashley meets him. He tells her she needs to remove all her clothes. He prefers woman that serve him be nude at all times. Ashley not wanting to but knew it was part of her job removes all her clothes. He then asks for a tour of the ship. Ashley gives him a tour. Ashley's crew mates like her new uniform. She introduces Sir Burlington to everyone saving Captain Fairbanks for last. He also likes Ashley's new uniform. Ashley leaves the two guys alone but stays close. Next</span></div></div>",
            "created":1451709300,
            "id":2082981,
            "title":"reader choice"
        },
        "13221112":{
            "choices":[
                "Taking sir Burlington meal to him",
                "Reader choice"
            ],
            "content":"<div class=\"\"><div> <span>I am not to happy being naked but I like me job. I don't have a chance to warn my daughters. I walk into our quarters with Sir Burlington. Captain Fairbanks joined us as well. The girls are shocked at me being nude. I introduce my girls to Sir Burlington. He looks the girls over and asks if they will also be serving him. Captain Fairbanks answers for me by saying no. Captain Fairbanks and I both can tell Sir Burlington isn't happy about it but he doesn't say anything. He asks to see his quarters. I take him to his quarters. He again talks to Captain Fairbanks. Sir Burlington retires to his quarters. Captain Fairbanks informs me that Sir Burlington wants my girls to help me with him while he is on board. It takes some doing but with Captain Fairbanks's help I talk the girls into helping. The girls strip naked and join me </span></div></div>",
            "created":1512346380,
            "id":2423600,
            "title":"she introduces him to her daughters"
        },
        "14":{
            "choices":[
                "A male and female human size alien creature?",
                "A male or female human size alien creature?",
                "A giant male and female alien creature?",
                "A giant male or female alien creature?",
                "More choices for the alien creature?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> The alien or aliens in question are?</span></div></span></div>",
            "created":1451019600,
            "id":2079295,
            "title":"A Male/Female Alien?"
        },
        "144":{
            "choices":[
                "Giant Male",
                "Giant Female",
                "Both male and female."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> The giant alien creature is?</span></div></span></div>",
            "created":1451019600,
            "id":2079296,
            "title":"A giant male or female alien"
        },
        "1441":{
            "choices":[
                "Doric looks in a window.",
                "D-4 heads to a lake or the beach?",
                "Doric is a giant human, not Poleepkwa looking?"
            ],
            "content":"<div class=\"\"><div> <span> In an empty cornfield surrounded by some very tall trees, a large, nearly invisible, saucer shaped spaceship lands unnoticed during the night. There is no full moon in the sky, so everything in this mountainous area is dark. The only light comes from the nearby houses and from the city in the distance. After it lands, the spaceship immediately becomes invisible to the naked eye, and a few minutes later, a doorway opens in the air seemingly out of nowhere. A huge alien creature exits the vessel, Doric is the alien's name, and he stands around 80 feet or 24 meters high. This alien creature strongly resembles a Poleepkwa or Prawn from the movie District 9 but he is much bigger. <br>\r\n<br>\r\n Doric is male, but his cruel, yet curious species tends to be bisexual and carnivorous with an incredible sex drive. Doric is the human equivalent of a University Professor where he teaches alien biology to other giant Poleepkwa college students. Doric is on Earth to collect as many healthy living human specimens as possible, who will either be used in his college classroom experiments or he might sell them. If that happens, they could be used as pets, live bait, toys, food, or pet food. When a captured human or humans are placed inside of a glass specimen jar, they are immediately frozen in time. When they are removed from the jar, time quickly returns to normal for the tiny captured humans. As the alien looks around, he sees a dollhouse nearby. <br>\r\n<br>\r\n There is a two-story farmhouse nearby. The extremely attractive, buck-naked white parents are in their bedroom passionately kissing each other. 39-year-old David and his 38-year-old wife Amber are beginning to have unprotected intercourse on their bed. Meanwhile in the bathroom, one of their gorgeous daughters, the youngest, a blonde, 12-year-old Chrissie has just finished taking a shower, but she has not yet turned off the water yet. Meanwhile, the oldest daughters, 14-year-old Emily and 16-year-old Julie are fast asleep. In addition, their only son 13-year-old Kevin is asleep as well. What the older daughters and the son are wearing as they sleep is up to you. Since they live in the country; there are no curtains on the second floor windows. <br>\r\n<br>\r\n Doric, along with his huge robot companion D-4...   <br>\r\n<br>\r\n.....................<br>\r\n<br>\r\n Please do not make the humans gigantic or the aliens small. Any humans found will be 6 feet or 1.8 meters tall to 4.5 feet or 1.3 meters tall, depending on the human's age and gender. <br>\r\n<br>\r\n He looks a little like this, <a rel=\"nofollow\" href=\"http://aliens.wikia.com/wiki/Poleepkwa\" target=\"_blank\">http://aliens.wikia.com/wiki/Poleepkwa</a> </span></div></div>",
            "created":1451019600,
            "id":2079318,
            "title":"Giant alien Male Doric."
        },
        "14411":{
            "author_id":"oliversmillie",
            "author_name":"Revilo",
            "choices":[
                "Doric sneaks into Julie's bedroom?",
                "Doric tries to get too Chrissie without her seeing him?",
                "Readers choice?  "
            ],
            "content":"<div class=\"\"><div> <span>Doric walks up to the house, because he stands 80 feet tall he can easily see into the windows, he sees that David and Amber are facing away from the window and are too distracted with each other to see him and had now gone from making out to full on sex with each other, the window he looks through belongs to 16 year old Julie who is fast asleep under a blanket as its not cold night. Doric Also looks through the window next to Julie that Chrissie has now turned off the shower and is now drying herself, she is also facing away from the window giving Doric a nice view of her ass. Doric starts to get an erection from Chrissie's ass. Luckily because of the angle Doric is standing Chrissie doesn't see him in the reflection of the bathroom mirror.      </span></div></div>",
            "created":1451223540,
            "id":2079939,
            "title":"Doric looks in a window."
        },
        "144112":{
            "choices":[
                "He sees 13 year old Kevin asleep in his bed.",
                "He sees Kevin peeping on a neighbor girl or woman.  ",
                "He leaves and goes where?"
            ],
            "content":"<div class=\"\"><div> <span> Doric smiles as Chrissie slowly began to towel off her lovely nude 12-year-old body. Doric knew this girl would make a fabulous specimen for his collection. A lovely girl such as herself would make a prized pet, toy, or food if he ever decided to sell her. Doric takes a long vacuum tube looking device, and easily pops open the large bathroom window with it, quietly breaking the glass. The tube is four feet wide as it quickly begins to suck. The young naked blonde-haired girl drops her towel in horror, and before she can scream, she is easily sucked into the device. Normally he would want to study her immediately, and as horny as he is he wanted too, but he could not risk her alerting her family. The scared girl suddenly reappears inside of a glass specimen jar unharmed, and buck-naked. She is floating around inside, and frozen in time. <br>\r\n<br>\r\n Doric then turns his attentions to the other window and saw Julie sleeping in her bed. Doric is proud that he captured the first girl and created little to no sound doing it. As Julie sleeps, Doric quietly pops open the large bedroom window with his long, but strong fingers. Doric's fingers grab a hold of her top sheets and gently pull them off her lovely body. To the alien's surprise, he notices that the 16-year-old sleeps in the nude. Doric smiles as he points the vacuum device at the sleeping beauties bare feet, and presses a button. The girl is quickly sucked into the long tube before she wakes up, and she reemerges inside the same specimen jar that holds her younger sister. The two-buck naked girls are just floating around inside the glass jar, stuck in time, unaware of what is now happening. <br>\r\n<br>\r\n Just then, Doric sees 14-year-old Emily opening up her bedroom window and leaning outside. She is dressed only in a thin, pink; nearly see through t-shirt, with no panties. The bottomless girl looks outside, and sees nothing as the wind howls around her. As she looks around, two long, huge fingers gently grab the girl, lifting her up into the air. Before she knew it, something had ripped her shirt off her chest leaving her completely naked. While she hangs there, dangling naked in the air, she sees a giant monster is holding her by her upper arms, examining her closely. The naked girl is about to scream when everything suddenly stops. Emily is now floating around inside the same jar that holds her two sisters. After Doric secures the jar, he smiles while looking over his three captured specimens. He has always loved the look on their tiny faces, as they were unfrozen in time and suddenly found themselves in an embarrassing, and dangerous situation. These three specimens would be great to study, humiliate, and molest. <br>\r\n<br>\r\n Doric looks in another window, and sees the girl's naked parents holding each other, grinding their pelvis together while moaning loudly. Doric overhears the two adults chatting with their squeaky voices. He can hear them talking about the thrill of being abducted by aliens and used breeders, food or live bait, and then it dawns on him, the adult humans are simply role-playing, Doric thinks to himself. Doric, not wanting to disappoint the adult couple pops open their large bedroom window, points the vacuum device at them, and easily sucks them both up. The buck-naked couple is unharmed, and frozen in time, in a separate glass specimen jar. The couple is still joined together, and facing each other, as they float around in their passionate embrace. Doric secures the two jars inside of a book bag, and as he is about to leave, he...</span></div></div>",
            "created":1451357640,
            "id":2080728,
            "title":"Doric gets Chrissie and most of her family too. "
        },
        "1441122":{
            "author_id":"oliversmillie",
            "author_name":"Revilo",
            "choices":[
                "Doric takes Kevin as one of his specimens ",
                "Doric goes after the women in the other house"
            ],
            "content":"<div class=\"\"><div> <span>Doric turns around to head back to his ship with his collected specimens when he sees someone out the corner of his eye that grabs his interest, he sees Kevin who is looking out his window with some binoculars, Doric looks in the direction Kevin is looking and sees a women who looks to be in her mid teens perhaps around 16 or 17 in what appeared to be her room changing in front of mirror in the house next door, Doric judge from where the binoculars were positioned Kevin could see the girls breasts, Doric observed Kevin and noticed that one of the boys hands were in his pants and that the boy was getting turned on somehow by the woman.       </span></div></div>",
            "created":1451390460,
            "id":2080937,
            "title":"He sees Kevin peeping on a neighbor girl or wom..."
        },
        "14411221":{
            "choices":[
                "Looks the Garcia house over for more tiny people?",
                "Walks back to his ship.",
                "Sees a young, nude, exhibitionist couple having sex in the open."
            ],
            "content":"<div class=\"\"><div> <span> Doric looks at the 13-year-old boy, and watches curiously as Kevin moves his hand around inside his underwear. As he watches the boy masturbating to the girl next-door, the alien decides to add the cute, horny young male to his collection. Doric needed some human males for his experiments anyways, and as horny as this young male is, he could probably breed every female in his collection. In addition, the boy looks a bit tasty, just like his sisters and his parents. <br>\r\n<br>\r\n The giant alien creature carefully walks back over to the house, and decides to try something different to capture the tiny boy sense there is nobody else is in the house. Doric grabs a weird looking gun from his bag of equipment, and points it at the boy in the window, then fires it. At the same time, Ken is holding onto his binoculars with one hand and he is jerking himself off with the other. As he jerks off, he is watching his 16-year-old neighbor Katie Garcia combing her long, black, damp hair. Katie has just taken a shower, and she is standing in front of her full-length mirror, completely nude. Katie is a mixture of Hispanic and German ancestry. She has large, perky, natural breasts, smooth olive colored skin, and she has a lovely figure with curvy hips. There are no curtains on the second floor of Katie's house.<br>\r\n<br>\r\n Kevin watches as Katie's firm bare ass is shaking back and forth to a song. Kevin takes off his underwear, and tosses them to his side. Kevin is now completely nude as he watches the girl shaking her bare ass. As he watches the girl, his outer bedroom wall glows and it vanishes. The naked boy drops his binoculars as he watches a giant creature gently grabbing him. A few seconds later, the horrified boy is floating around a third specimen jar, frozen in time, naked. <br>\r\n<br>\r\n Next, Doric carefully walks over to the Garcia house. His many huge penises become hard and his stomach begins to growl as he peeks in a window and sees a lovely brunet girl dancing around her bedroom, fully nude. The alien decides to play it safe, because he does not know if anyone else is inside the dollhouse. Doric uses the gun to vaporize only Katie's, bedroom wall. The stunned girl turns around in shock, while attempting to hide her private body parts with her bare hands. Before she can scream, Doric places a vacuum cleaner like hose inside her bedroom, and quickly sucks her up. Katie finds herself nude, frozen in time, and floating around a fourth glass jar. Doric secures the four specimen jars, and... </span></div></div>",
            "created":1451557200,
            "id":2081976,
            "title":"Doric takes Kevin and the girl."
        },
        "144112212":{
            "author_id":"oliversmillie",
            "author_name":"Revilo",
            "choices":[
                "Doric plays with the specimens he has collected ",
                "We see what D-4 is up too",
                "Readers choice "
            ],
            "content":"<div class=\"\"><div> <span>Doric decided that he has gotten enough specimens for the time being and decides to take them back to his ship, he holds up the De-Mat gun to Katie's room again and switches a button on the side and presses the trigger, the wall reapers he also heads back to Kevin's room and replaces the wall there too. Doric looks at his handy work with satisfaction, he then continues to his ship, now if someone passed by or looked out their window they wouldn't be able to tell that something happened outside in the street at all. Doric reaches the entrance to the ship before turning around to face D-4 \"Boy I want you to remain here on Sol 3 and search out the area for me.\" \" We want to get some more specimens especially around the humanoid age of 13 to 25 from what I understand humans around that age go to places called schools and universities, You must not be seen got it?\" D-4 nodded before it turned invisible and ran off into the darkness.       <br>\r\n<br>\r\n Once back on the ship Doric puts the specimen jars into a storage room thus making sure they wouldn't be harmed or broken on the flight back. Doric walks into the flight area where he can see the view screen and sits down in the chair, Once doing so leans forward and presses a button on the display then leans back again closing his eyes he said \"Come in home base,\" A few seconds later the view screen comes to life and another creature like Doric appears \"Hello Doric, have you found some specimens for us\"? Doric reopened his eyes and replied \"Hello Sardic, yes I have found some humans for us to study at our scientific collage of alien studies\" \" I do plan on getting more very soon though it may take 24 to 48 hours by humans standards and providing D-4 pulls through. \"Very well Doric, you have done well\" Report back when you have these new specimens \"I will let you decide what to do with the ones you already have\" and with that the view screen went out.        </span></div></div>",
            "created":1451644260,
            "id":2082370,
            "title":"Walks back to his ship."
        },
        "1441122122":{
            "choices":[
                "Doric and D4 play with a few of them on the ship?",
                "They wait until they are at the giant alien college?",
                "Readers choice? "
            ],
            "content":"<div class=\"\"><div> <span> As the giant alien creature heads to his ship with his tiny living specimens, the giant invisible robot D4 stealth fully heads to a lake. The robot resembles a tripod from the 2005 movie War of the Worlds, but with more tentacles and more storage space inside. As the tripod slowly moves across the countryside, there is no moon in the night sky, so the robot might as well be invisible. While the robot carefully walks towards the lake, it immediately detects something interesting with its visual scanners. It notices a completely nude young human couple in the process of reproduction. <br>\r\n<br>\r\n Meanwhile, down below a hot young couple is making love in the female dominate position. The nude couple is both 14-years-old, and they are camping in the forest alone. Erica is an extremely attractive blonde-haired girl that strongly resembles the actress Chloe Moretz, only younger, with bigger breasts. Her boyfriend Jake strongly resembles the actor Colin Ford, only younger. With their tent behind them, the kinky young couple is making love out in the open, underneath a tree. Erica is grinding and pumping her bare ass around, on her lover's rock hard-unprotected cock, while Jake lustfully caresses her large perky breasts. The nude couple is passionately kissing each other, and never notices a long, warm tentacle wrapping around them both. The huge robot quickly places the horny couple inside its body for safekeeping. The couple is immediately placed into a state of suspended animation. The nude teen couple is frozen in time, while floating around and embracing each other. First breeding pair of specimens collected, the intelligent robot thinks to its self. <br>\r\n<br>\r\n The robot again slowly moves across the land, arriving at the lake. Its visual scanners again detect human activity. It detects the presence of many healthy human females swimming around in the water down below. It scans the group while hidden by some tall lush trees. The robot counts over 40 females of various ages below. They are all wearing swimsuits of some type. This group appears to be a mixture of ethnic groups, with 60% being of European decent, 10% being of African descent, another 10% being of Asian descent, yet another 10% being of Latin American descent, and the rest are of mixed race. The robot accurately detects their ages to fall into two groups, the majority of the girls in group one are between 12 to 16 years old, and the second group is between 19 to 24 years old. Unbeknownst to the huge robot, it has stumbled upon a camp for gymnasts, dancers, and cheerleaders. The majority of the group below is campers, while a minority is University age counselors. The head counselor, a hot redhead named Samantha, Sam for short looks like the actress Debbie Ryan. <br>\r\n<br>\r\n As the 35 young campers and the 8 counselors splash each other playfully in the water, dozens of long tentacles lash out from the darkness, quickly capturing them all. The tripod immediately places all 43 of the new specimens inside itself for safekeeping. The 43 unharmed, bathing suit-clad girls are now floating around inside the robots. They are all frozen in time with a look of dread on their lovely faces. <br>\r\n<br>\r\n The robot is getting ready to head back, when it detects some sexually aroused young males nearby approaching the lake. Unbeknownst to the robot, the boys are from a nearby camp and they have come to spy on the girls it has just captured. The 12 boys are between the ages of 13 to 16 years old, 60% of them are of European descent. As the boys, carefully move through the foliage, expecting to see some girls swimming at any moment, tentacles again shoot out of nowhere. Before the boys could react, the tripod places them all inside itself for safekeeping. The unharmed, fully clothed boys are floating around inside of it, frozen in time. Soon, they will all know the joy, humiliation, and pain in store for all of them. <br>\r\n<br>\r\n The robot now has 57 human specimens in its hold as it heads back to the ship. As it heads back, it detects a car moving down the street. It scans the small car and discovers a healthy 33-year-old mother and her young healthy 12-year-old son are in the automobile. The robot quickly vaporizes the car but not the two passengers inside. The hot mom named Lisa along with her biological son Adam are unharmed as they end up inside the robot, still fully clothed. Lisa strongly resembles the actress Reese Witherspoon while her son resembles a much younger Chord Overstreet. The mother and her son like the rest are frozen in time. <br>\r\n<br>\r\n D4 quickly heads back to the ship and informs Doric of the mission's success. Doric smiles wickedly thinking there are more than enough specimens for his needs. Doric commands the D4 to immediately vaporize the clothing of all of the captured human specimens in its hold, except for Lisa and Adam; he has something disturbing in store for them. D4 complies, and instantly removes all of their clothing. With the exception of the mom and her son, the rest of the 57 specimens are now naked as the day they were born. D4 finally enters the ship, and meets Doric as he is preparing to launch. The ship takes off, and after the vessel safely leaves the Earth, Doric, and D4... <br>\r\n<br>\r\n..................<br>\r\n<br>\r\n The D4 has 59 specimens in all and Doric has 7 specimens with him. All of the human specimens are buck-naked except for the mom and son, Lisa and Adam. </span></div></div>",
            "created":1451877300,
            "id":2083998,
            "title":"D-4 has hit the Jack Pot!"
        },
        "14411221223":{
            "author_id":"oliversmillie",
            "author_name":"Revilo",
            "choices":[
                "Doric rapes Noriko",
                "Noriko runs while Doric gives chase"
            ],
            "content":"<div class=\"\"><div> <span>As they are about to leave Earth's orbit, Doric picks up a signal of some more human females close by, Doric knew he has 66 specimens overall but they were part of his mission and he couldn't have any fun with them. Doric checked the scanner and saw that the signal was coming from a High School in Tokyo Japan, Doric set the controls and sat back. <br>\r\n<br>\r\n By the time Doric's ship landed on the grounds of a high school it was dark and a thunderstorm had started it was perhaps around 7:00 pm, the ships stealth ability was on so no one knew it was there, Doric stepped out onto the school grounds a scanner was in his hands, The scanner told him there were two females in the building.  <br>\r\n<br>\r\nMeanwhile In the women's change room Sanae was about to get changed it had been a long practice season for the women's school basketball team, the reason why they had stopped was because of the storm and that the lights blew leaving everyone in darkness she and Noriko were the only two left in the school. The Basketball coach had given Noriko the key to the school so she and Sanae could lock up when they left. Both were trustworthy with such a task, Noriko had already changed and had said she would wait in the hall. Sanae striped off her skirt.<br>\r\n<br>\r\nDoric reached the window where Sanae was changing and looked in, his sexual appetite went into over drive, he put the scanner away and pressed a button on his suit, Doric shrunk to a size where he could climb in the window and silently opened the window and climbed in, Sanae felt a presence behind her, thinking it was Noriko she turned around \"I thought you-\" her voice stopped in her throat as she saw Doric standing over her, Sanae's eyes widened with fear as Doric picked her up and pinned her against the locker Sanae opened her mouth to scream but before she had the change Doric put his mouth on her's his tongue connected with her's. Sanae blushed, Doric then gently moved Sanae from the locker and onto the floor, his hands removed her panties, Doric removed his mouth from Sanae's \"your mine now\" Doric told her, he tore her shirt up revealing her bra which he quickly removed, Doric's massaged Sanae's left and right breasts with his hands as he focused on her lower body, ' I wonder what her vagina tastes like' thought Doric as he lowered his head towards her vaginal region and inserted his tongue into her. He had never tasted something so good and nice.<br>\r\n<br>\r\nSanae had never felt so much pleasure in her life before, without fully realizing it she moaned out loud \"That feels so good\" as Doric's tongue went back and forward within her. Sanae was getting more and more aroused as her body got more and more hot. <br>\r\n<br>\r\nDoric knew there was someone else around so he had to deal with the woman he was with quickly . Doric decided that even though he was having fun with this girl he would have to deal with the other one too. Just then he heard a voice \"Sanae have you finished changing yet? Sanae? Doric looked behind him as he heard a door open he saw Noriko looking around in the darkness, Doric quickly knocked out Sanae with his hands before setting his sights on Noriko.<br>\r\n<br>\r\nNoriko's eyes started to adjust to the darkness just in time to see her friend knocked out and naked on the floor and a massive creature standing and looking at her.                           </span></div></div>",
            "created":1451908620,
            "id":2084169,
            "title":"Time for some fun on Earth"
        },
        "144112212232":{
            "choices":[
                "Doric and his robot studies her alone.",
                "Doric and his robot studies her with another captured human.",
                "Doric and his robot, you choose?"
            ],
            "content":"<div class=\"\"><div> <span> Doric gets ready to charge after the other girl, but his communications device activates and his supervisor in another solar system is demanding that he returns with his tiny human cargo sooner than previously scheduled. The annoyed Doric nods and tells him that he would be lifting off shortly. However, he has some business to take care of first. Doric looks down at the still unconscious Sanae and says in broken English, “Sorry, but I have to go now!”<br>\r\n<br>\r\n With that, the big alien creature grabs the naked teenage girl, places her in his wide mouth, and gulps her down. As a bulge goes down his throat, Doric begins to see the outline of the other teenage girl, hiding in the corner of the changing room. Noriko still dressed in her Japanese student uniform is cringing after witnessing her best friend being molested and swallowed alive. Noriko believes she would be next as the big monster moves towards her. So Noriko runs out of the room, down the hall and out of the building, trying to make a mad dash for the schools exit. <br>\r\n<br>\r\n The beautiful thirteen-year-old girl makes it up to the gate, when she notices the transparent outline of something huge resting in the front lawn of the school. Not wanting to find out what it is, she tries to open the gate, when something yanks her up into the air. She looks back and screams when she sees the creature has her now. From her point of view, it is much bigger than before, and it is now gigantic. <br>\r\n<br>\r\n Doric smiles at his prize that could easily become his snack on the trip home as he takes the tiny screaming girl back to his ship. When he enters his ship, he closes the door and begins the trip home. As his ship leaves the Earth solar system, he places the now tiny Japanese girl on the table and looks her over. Her clothes are cute, but they are getting in the way of his examination. So Doric smiles at her, and points a vacuum cleaning hose like device at her. The girl backs up, and grabs a hold of something that is latched on the table, just as the suction kicks in. The girl is lifted up into the air as she holds on for dear life. Doric grins as her clothes are slowly sucked off her slender body. First, her shoes, socks, and skirt are sucked off, followed by the rest of her clothes. Doric turns off the clothes-sucking vacuum and the exhausted tiny girl falls to the huge table naked as the day she was born. Doric looks at the sore, tiny naked girl that is now cringing before him, and decides too… </span></div></div>",
            "created":1452999780,
            "id":2090276,
            "title":"Noriko runs Doric gives chase."
        },
        "1441122122321":{
            "choices":[
                "They go to the giant alien classroom at the school. ",
                "They go to the giant alien auction at the pet store. ",
                "You choose where they go?"
            ],
            "content":"<div class=\"\"><div> <span> Doric along with his trusty robot moves their huge eyes closer to the tiny naked Japanese girl. From Noriko point of view, their giant faces are only eight feet or 2.44 meters away from her. At that distance, the terrified girl could feel Doric’s warm breath blowing against her smooth bare skin. Noriko could see and feel Doric’s eyes along with the robots scanners studying her natural form. The terrified and shy young girl naturally wraps right arm around her young teenage breasts and she uses her left hand to hide her nearly hairless crotch. The girl then hears the alien say to her in Japanese, with English translation, “You have a lovely body, and humans taste so good. No wonder giant creatures from all over the universe love to play with their human food or keep them as pets or specimens or live bait.” <br>\r\n<br>\r\n<br>\r\n As the naked girl stands their shivering with her hands over her breasts and crotch, Doric’s long finger sneaks up behind her and gently spank her lovely bare ass. The tiny girl naturally jumps up and screams as he slaps and tickles her bottom. The girl’s reaction to having her tender ass touched like this is making Doric incredibly horny and hungry. Before the girl knew what was happening to her, several spaghetti looking tentacles lash out of the alien’s mouth and seize her limbs, securing her in the spread eagle position. Next, three thicker tentacles lash out of his mouth, one penetrating her anus, one her mouth, and the third her virgin pussy. The girl is in shock as the three penis like appendages probe and taste all three of her holes. The one probing her pussy worries her the most because of the fear of pregnancy, while the one probing her rectum is the most painful. <br>\r\n<br>\r\n<br>\r\n She is being held there in the spread eagle position, with Doric’s three miniature cocks penetrating her three major holes. The aliens many large tongs now taste her bare flesh as she gags in both revulsion and lust. Separately, Doric’s tongs are also tickling and massaging her smooth bare skin, leaving a trail of slim over her exposed breasts, legs, stomach, and ass cheeks. The robot tastes her as well to determine her use as possible bio-fuel. As the crying girl squirms, Doric moans loudly as his miniature cocks begin to twitch. Noriko’s eyes become huge as she feels a warm cream entering her mouth, ass, and pussy. The 13-year-old gags as the monster moans with joy. <br>\r\n<br>\r\n<br>\r\n A few seconds later, she is released. The young girl gently falls to the table with greenish goo leaking out of her ass, mouth, and pussy. As the young girl cries and pukes out the alien’s seaman, one of the robots tentacles lashes out, grabs the shocked girl by her slender stomach, lifts her up into the air, and as she begs to be free, the robot places her inside its massive mouth. The tiny nude girl quickly falls into its belly where she will painlessly, yet quickly become much-needed bio-fuel for the robot. Doric and the robot notice they are now in orbit around their home world. As the ship lands, Doric along with the robot take their tiny human cargo and go where first?  </span></div></div>",
            "created":1456029540,
            "id":2107157,
            "title":"Doric and his robot study her alone."
        },
        "14411221223212":{
            "choices":[
                "A horny nude couple, a tiny human sex show.",
                "Young Chrissie and some young people or her family?"
            ],
            "content":"<div class=\"\"><div> <span> Doric walks into a large dark room with his robot servant by his side. There are giant alien creatures of many species sitting in the darkness waiting for the show/auction to begin. As Doric gets things ready, he can see the eerie glow of many eyes watching him as he sets up the show. Right in front of Doric, in the center of the room is a warm, metallic table easily big enough to show off several humans. There are lights above the table, and the table can turn so the alien bidders can examine the naked human specimen’s easier. There is also a small queen size bed in the center of the miniature stage. Under the rules, the aliens are allowed to touch and even taste the human’s bare flesh if they wish. Several aliens here want these tiny undressed humans as pets, toys, for breeding, for cross breeding, for science experiments, as live bait, for their artwork, as specimens for school classrooms, for tiny porn movies, for pet food or as their food. “There, everything is set up, but who to show first?” Doric says. <br>\r\n<br>\r\n<br>\r\n The giant alien Doric gently grabs a few humans and places them on the auction table. He shows the eager crowd their first living human specimens of the night. These humans are only a few inches tall from the crowd’s point of view. “And the bidding will begin at 200 credits,” a loud voice says while speaking into a universal translator. The scared, tiny human slaves/specimens hear everything in English or their native language as they attempt to cover their private parts with their bare hands.    <br>\r\n<br>\r\n………………….<br>\r\n<br>\r\n Before we go on, which of these poor humans is being sold first and as what? <br>\r\n</span></div></div>",
            "created":1458635640,
            "id":2121110,
            "title":"They go to the giant alien auction."
        }
    },
    "info":{
        "author_id":"oliversmillie",
        "author_name":"Revilo",
        "brief_description":"A Space Adventure where you are in command. ",
        "created":1450855860,
        "description":"<td align=\"left\" class=\"norm\">Welcome to the Quest/Adventure of a life time, you and your team may run into all kinds of danger, from aliens, to space pirates or maybe something far more sinister.<br>\r\n<br>\r\nA few rules, Characters must be over 12 years old if children appear in the story they must be background characters or related to the characters. <br>\r\n<b>Children can not be harmed. </b><br>\r\n<u>No diapers, pee, shit, etc.</u> <br>\r\nVore is allowed, providing the person in question is over 16.<br>\r\nswearing is allowed. <br>\r\nThe story can be in first person or 3rd person. Within the story you can go anywhere, you can land on planets, board ships, raid ships and/or have your own fleet. The ships have to be spaceships as this is a space story. <br>\r\n<br>\r\nYou can name your own ships as well <br>\r\nonce a character has a name or a ship has a name you can't rename them. <br>\r\nAnd Finally have fun. </td>",
        "id":2069361,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1512346380,
        "modified":1512346380,
        "pretty_title":"Intergalactic Space Adventure  "
    }
}