{
    "chapters":{
        "1":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "Alex",
                "Sarah (Alex's twin)",
                "Aqua (Alex's Girlfriend)",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before we start, lets decide who you are. lets start with the people close to Alex, including himself.</span></div></span></div>",
            "created":1405573200,
            "id":1829292,
            "title":"getting started"
        },
        "11":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "it's late at night and everyone else went to bed",
                "it's the middle of the day and you decided you needed to relax",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Alex is known throughout the city as the boy who bridged the gap between virtual world and real world. he tries to be as nice as possible, but he knows when it's time to be tough. he will do just about anything for the ones he cares about, including his hero's. He is most fond of the game Pikmin.<br>\r\n<br>\r\nnormally, Alex is dressed in a T-shirt and Shorts. he has tennis shoes that he wears almost all the time. he has short brown hair and matching brown eyes. he often falls asleep while working.<br>\r\n<br>\r\nin a fight, he'll either use technology that he has or strategy, finding an enemies weak points easily. however, if in the rare case that he gets angry, Alex will charge an enemy and use brute force. Multiple people have said this might get him killed, but he still does it.<br>\r\n<br>\r\nso, now that you know about Alex, let's get started!</span></div></div>",
            "created":1405573200,
            "id":1829294,
            "title":"Alex"
        },
        "111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "thunder",
                "a crash",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Alex yawned as he worked on his invention. it was late, but he didn't want to stop working. the Dimension hopper had multiple flaws, glitches that could be dangerous if mass produced. and what inventor creates something that he purely wants for himself, right?<br>\r\n<br>\r\nwhile the random coordinate generation was the problem he was trying to fix now, there was also that overload problem that causes the device to be lost. not lost as in destroyed, but lost by it's definition: put somewhere randomly in the dimension. surprisingly, the device always seemed to appear somewhere within the dimensions story line, generally towards the end.<br>\r\n<br>\r\nthe device was connected to the computer, which whirled and beeped at random points. occasionally the screen would show a binary code, or a voice would say something like<br>\r\n<br>\r\n\"error, objective not found\" or \"power source inactive\"<br>\r\n<br>\r\ngenerally either one determined the difference between progress and...whatever the opposite was.<br>\r\n<br>\r\na loud noise sounded suddenly. it sounded like...</span></div></div>",
            "created":1405746000,
            "id":1830264,
            "title":"late at night"
        },
        "1111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "he awakes with no one around",
                "he is being examined by someone",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>thunder boomed outside. Alex remembered that Sarah had said that there was supposed to be a thunder storm tonight...that meant he had to finish quickly, or risk a repeat of his first experience.<br>\r\n<br>\r\nlightning flashed outside, with thunder booming every once in a while. the thunder he could handle, it was the lightning he was afraid of. lightning contained thousands of joules worth of electricity, most middle scholars knew that. that meant if lightning were to strike the lightning rod his parents built, then the resulting electricity would overload the Dimension Hopper, causing it to activate. Alex closed the machine, ready to finally put it away...and then it came.<br>\r\n<br>\r\nthe flash of light was brighter, and the crackle of electricity could be heard loud and clear. the lights flashed as the machine started up. Alex didn't have time to get away before a bright flash of light caused him to black out.</span></div></div>",
            "created":1405746000,
            "id":1830276,
            "title":"thunder"
        },
        "11111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "pikmin",
                "pokemon",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>the world around me was dark, probably due to my heavy eyelids. I was numb, but my mind seemed to be functioning.<br>\r\n<br>\r\n'baby steps' I thought to myself 'ok...my name is Alex...I'm 16...I was working on my dimension hopper...'<br>\r\n<br>\r\nI opened my eyes and saw a world I didn't recognize. wait...maybe I did recognize it...<br>\r\n<br>\r\nas my mind cleared, I started to see resemblance to a world I already knew. it was the world of...</span></div></div>",
            "created":1405746000,
            "id":1830285,
            "title":"an unknown world"
        },
        "111111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "a medow in the morning",
                "a snow filled vally, mid-day",
                "other (time and place required)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pikmin! That's where I was! but...where exactly was I?</span></div></span></div>",
            "created":1405832400,
            "id":1830862,
            "title":"pikmin"
        },
        "1111111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "the chanting of a small creature",
                "the sound of a loud roar",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>I rubbed my eyes in the morning sunshine. it seemed like I was in a field...which was good considering I had no protection from the elements. I slowly got up as my senses came back. I couldn't see a whole lot due to the tall stalks that seemed to be everywhere, but I COULD hear something.<br>\r\n<br>\r\nit definitely did NOT sound like the wind. I think it was...</span></div></div>",
            "created":1405832400,
            "id":1830967,
            "title":"a medow in the morning"
        },
        "11111111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "it seemed functioning, and he put it on",
                "it was broken and he saved it for later",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>I listened closely, trying to figure out the sound. whatever creature it was quickly gave a yelp of surprise, then I heard what sounded kind of like arguing.<br>\r\n<br>\r\nI walked towards the sound, and saw a small object on the ground. it looked kind of like an ear piece. I looked up and saw two pikmin, a red and a yellow, interacting with each other. it looked like the red one was angry at the yellow, which wasn't out of the ordinary.<br>\r\n<br>\r\nI picked up the ear piece and looked at it.</span></div></div>",
            "created":1405832400,
            "id":1830972,
            "title":"the chanting of a small creature"
        },
        "111111111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "the yellow one seemed overjoyed (good reaction)",
                "the red one was upset (bad reaction)",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>I put on the ear piece and turned it on. after a bit of white noise, it cleared and I could hear regular voices.<br>\r\n<br>\r\n\"...and that's why you're not supposed to try it on!\"<br>\r\n<br>\r\n\"well, how was I supposed to know that would happen?\"<br>\r\n<br>\r\n\"your ears are way too big! you knew it wouldn't fit!\"<br>\r\n<br>\r\nI walked up to the pikmin as they argued. for most people, that was a big mistake. in fact, most people would be spooked from them talking in general. the fact that my girlfriend was once a pikmin helped me overcome that fear.<br>\r\n<br>\r\n\"hi!\" I said.<br>\r\n<br>\r\nthe pikmin immediately stopped and looked at me. their emotions were kind of hard to make out...</span></div></div>",
            "created":1405832400,
            "id":1830981,
            "title":"finding pikmin"
        },
        "1111111111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "say someting",
                "stay quiet",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\"look Flame! a person!\" the yellow said.<br>\r\n<br>\r\n\"I can see the person Daisy\" the red, who I assumed was Flame, replied \"I can also see he's wearing the translator\"<br>\r\n<br>\r\n\"oh...that means he can understand us!\" Daisy went on \"is that right, person?\"<br>\r\n<br>\r\nI was stunned. they were talking to me...was that supposed to happen? I didn't know what to do...should I talk? should I just stay quiet?</span></div></div>",
            "created":1405918800,
            "id":1831427,
            "title":"friendly pikmin"
        },
        "11111111111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "go with them. what's the worst that could happen?",
                "stay behind. I could hurt them accidentally.",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>well, I guess answering their question wasn't a bad idea.<br>\r\n<br>\r\n\"y-yes, I can understand you\" I said.<br>\r\n<br>\r\n\"he talks! he talks!\" Daisy yelled, obviously overjoyed. even Flame seemed surprised.<br>\r\n<br>\r\n\"you know, I bet a bulborb would have freaked if it heard us speaking it's language\" Flame said.<br>\r\n<br>\r\nI started piecing together everything, and I realized something. Flame and Daisy were the names of the red and yellow leader...both of which I had taken home with me last time. I also remembered both leaders talking about how different they were when they were leaves, and both of these pikmin had leaves...but they were more mature by the time I met them, mainly due to the crashing, which had been caused by interference from Olimars ship. what if I was in a pikmin world where Olimar never crashed? that would make me their first captain...<br>\r\n<br>\r\n\"we should show him the onions!\" Daisy said \"he could help us survive!\"<br>\r\n<br>\r\n\"no way!\" Flame replied \"what if he destroys them?\"<br>\r\n<br>\r\n\"fine, lets let him pick!\" Daisy said, turning to me.<br>\r\n<br>\r\nI had to think quickly. finally, I decided to...</span></div></div>",
            "created":1405918800,
            "id":1831434,
            "title":"say someting"
        },
        "111111111111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "none others",
                "4 othres",
                "2 others"
            ],
            "content":"<div class=\"\"><div> <span>Daisy was ecstatic as I said yes. \"let's go right now!\" she exclaimed, running off.<br>\r\n<br>\r\nFlame rolled his eyes and followed, leaving me to follow behind him. after a bit of running, we got to a large clearing. there were several ship-like structures that I recognized as the onions...at a glance, I saw three: Red, Blue, Yellow. but I felt as though there were more...</span></div></div>",
            "created":1409288400,
            "id":1848958,
            "title":"go with them"
        },
        "1111111111111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "shyness",
                "curiosity",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>looking around, I realize there actually wasn't anymore, so I ignored the feeling. I saw only one blue pikmin was out, and it had a leaf.<br>\r\n<br>\r\n\"Aqua! look at what we found!\" Daisy exclaimed.<br>\r\n<br>\r\nAqua turned to me curiously. her leaf twitched every once in a while, as if she was alert. she looked at me with...</span></div></div>",
            "created":1409288400,
            "id":1848961,
            "title":"none others"
        },
        "1111111111113":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "rock and wing",
                "purple and white"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what were they?</span></div></span></div>",
            "created":1409288400,
            "id":1848959,
            "title":"2 others"
        },
        "11111111112":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "say something to stop them.",
                "let them deal on their own",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>I stayed quiet. Daisy was looking at me expectantly, but I couldn't find the right words to say.<br>\r\n<br>\r\n\"yea, he can totally understand us\" Flame said mockingly.<br>\r\n<br>\r\n\"shut up Flame!\" Daisy retorted \"maybe he's just nervous! or he can't talk!\"<br>\r\n<br>\r\nI just blinked at them \"yea, well he has one heck of a dumbfound look for someone who can understand what we're saying\" Flame said.<br>\r\n<br>\r\n\"would you knock it off!\" Daisy shot back \"maybe you're scaring him!\"<br>\r\n<br>\r\n\"he's bigger than us! he might as well be afraid of a bulborb!\" Flame retorted.<br>\r\n<br>\r\nI could see they were ready to fight, and that didn't look good. should I stop them?</span></div></div>",
            "created":1405918800,
            "id":1831525,
            "title":"stay quiet"
        },
        "11111111113":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "another pikmin comes in before you can speak",
                "you move back",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what happens?</span></div></span></div>",
            "created":1415979000,
            "id":1886293,
            "title":"other"
        },
        "111111111131":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "stay quiet (better safe than sorry)",
                "speak (couldn't hurt...right?)",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>before I could respond, a blue pikmin came running up \"guys! there's-\" she cut herself off as she saw me.<br>\r\n<br>\r\n\"what's wrong Aqua?\" Daisy asked<br>\r\n<br>\r\n\"she's obviously scared of the person\" Flame said.<br>\r\n<br>\r\n\"oh! he doesn't mean any harm!\" Daisy said. she turned to me \"isn't that right?\"<br>\r\n<br>\r\nI still hadn't thought about whether I should talk...Aqua looked sensitive, what if I scared her?</span></div></div>",
            "created":1415980680,
            "id":1886305,
            "title":"another pikmin comes in before you can speak"
        },
        "1111111112":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "whistle",
                "walk away",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>the red one glared at me, fire in its eyes \"can't you see we're in the middle of something?\" it asked angrily.<br>\r\n<br>\r\n\"hey! he didn't know!\" the yellow yelled \"he's not even our species!\"<br>\r\n<br>\r\n\"all the more reason for him to leave us alone!\" the red retorted.<br>\r\n<br>\r\n\"want to try telling that to a bulborb?\" the yellow shot back.<br>\r\n<br>\r\nbased on how they reacted, it seemed I made the fight worse. I could walk away and hope that they eventually calm down. I could also try whistling and see if that does any good...</span></div></div>",
            "created":1405918800,
            "id":1831571,
            "title":"angry pikmin"
        },
        "1111111113":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "they turned away as another pikmin came in (blue pikmin)",
                "they looked terified (ready to run)",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok, what about these?</span></div></span></div>",
            "created":1415978880,
            "id":1886292,
            "title":"other"
        },
        "1111112":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "he finds something nearby",
                "something finds him",
                "there's nothing nearby"
            ],
            "content":"<div class=\"\"><div> <span>as my body regained it's senses, I suddenly felt immense cold. Snow...of all the places to end up, I was in a Valley mid-winter. it didn't help that I had almost NO snow experience once so ever. I knew I was going to freeze to death if I didn't find something to warm myself up, especially with how small I am.<br>\r\n<br>\r\nI looked around for something...</span></div></div>",
            "created":1405832400,
            "id":1830938,
            "title":"cold awakening"
        },
        "111113":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "World of sonic the hedgehog",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What world is?</span></div></span></div>",
            "created":1530581100,
            "id":2514252,
            "title":"other"
        },
        "1112":{
            "author_id":"hurttoto",
            "author_name":"^HURTTOTO^",
            "choices":[
                "look around monster high(reboot)",
                "leave",
                "someone else approaches"
            ],
            "content":"<div class=\"\"><div> <span>Phineas:huh who's that?<br>\r\n<br>\r\nMilo: Hey he's why our teleporter didn't work<br>\r\n<br>\r\nRigby: Cool<br>\r\n<br>\r\nFrankie Stine: Can we just go now<br>\r\n<br>\r\nThen they and meny others went with them<br>\r\n<br>\r\nCongrats you found a reference to \"the end of cartoons\" storyline<br>\r\n<br>\r\nWhat now?</span></div></div>",
            "created":1480909860,
            "id":2245918,
            "title":"a crash"
        },
        "12":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "it's late at night and Sarah decides to do late-night reaserch",
                "it's the middle of the day and Sarah wants to surprise Alex with extra help",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Sarah is Alex's identical twin. while Alex likes to work hands-on, Sarah prefers to research instead. Sarah likes to analyze everything, but otherwise acts a lot like Alex does.<br>\r\n<br>\r\nshe always wears a T-shirt and a skirt, both usually brightly colored. she usually wears sneakers, but sometimes wears dress shoes. she has brown hair to her mid-back, and matching brown eyes.<br>\r\n<br>\r\nin a fight, Sarah will try to avoid contact until she knows how to attack. however, once she finds a strategy that works, she acts VERY aggressively, often not using any strategy if the first one fails. That said, she'll only fight if provoked, and often likes to avoid fighting.<br>\r\n<br>\r\nso, that's Sarah! ready to get started?</span></div></div>",
            "created":1405573200,
            "id":1829301,
            "title":"Sarah"
        },
        "121":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "thunder outside",
                "a crash from upstairs",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>I yawned as I looked at my research. it had all started to blur together, but I wanted to finish. I sleepily looked at Alex's machine, which was connected to the computer. all it took was pressing one button, and I could be anywhere I wanted to be...but how? that's the question I was trying to figure out.<br>\r\n<br>\r\nAlex figured that half of the glitches the machine had could be fixed if I found out how it worked. sure, Alex built it, but that shock the first time he used it altered the circuitry, and Alex theorized that's how he got it to work. I was also trying to figure out if that was true, or if something else had happened to the machine to make it work the way it did.<br>\r\n<br>\r\na loud noise sounded. it sounded a lot like...</span></div></div>",
            "created":1405918800,
            "id":1831577,
            "title":"reaserching late"
        },
        "1211":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "she wakes up with no one around",
                "she wakes up with someone looking at her",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>I yawned, thinking it would be another crazy storm. I knew Alex's machine could overload if lightning struck, but I needed to finish my research. I rubbed my eyes as lightning flashed. yep, that would be one heck of a storm.<br>\r\n<br>\r\nI closed my books and put them away, but I had forgotten to disconnect the machine from the computer. as I remembered, a bright flash of lightning signaled that it struck the lightning rod we had, which meant it would go through the houses electrical circuits...uh oh...<br>\r\n<br>\r\nI blacked out as the machine whirled on.</span></div></div>",
            "created":1405918800,
            "id":1831584,
            "title":"thunder outside"
        },
        "12111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "pikmin",
                "pokemon",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>the world was black, and my whole body was numb. ok, lets see what happened...I'm Sarah...I'm 16 years old...as I slowly regained full consciousness, I opened my eyes. the world around me was unfamiliar...which meant the machine had activated.<br>\r\n<br>\r\nbut what world did I end up in?</span></div></div>",
            "created":1406523600,
            "id":1834605,
            "title":"alone"
        },
        "121111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "a medow in the morning",
                "a snowy valley mid day",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok, where was I in this world?</span></div></span></div>",
            "created":1406523600,
            "id":1834610,
            "title":"pikmin"
        },
        "1211111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "a loud roar",
                "quiet chanting",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>large flowers, a fresh breeze, the feeling that the world was much larger than I was...this seemed like the pikmin world alright! but...that meant there was also pikmin themselves...and pikmin predators. I hoped I found the pikmin before a monster found me.<br>\r\n<br>\r\nI stood still a moment, listening. there was a noise...it sounded like...</span></div></div>",
            "created":1406523600,
            "id":1834613,
            "title":"a medow in the morning"
        },
        "12111111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "red spotted bulborb",
                "spotted bulbear with dwearf bulbeas",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I looked around frantically. it sounded REALLY close! I quickly hid in some bushes as I heard footsteps approach.<br>\r\n<br>\r\nsoon enough, a creature emerged from the grass. it was a...</span></div></span></div>",
            "created":1407387600,
            "id":1838576,
            "title":"a loud roar"
        },
        "13":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "it's late at night and she decided to look around",
                "its mid day and she's looking for Alex",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Aqua was a pikmin that Alex turned human after his first use of the dimension hopper. Aqua is gentle, but isn't afraid to get her hands dirty if she needs to. She often knows more than she should, and is thought of as sweet and innocent.<br>\r\n<br>\r\nAqua always wears a blue dress, and a blue hat to cover the part of her hair that's green. the rest of her hair is blond. she has bright blue eyes, and wears blue slippers most of the time.<br>\r\n<br>\r\nAqua HATES the thought of fighting, preferring to help instead, a lot like Alex. If faced with a foe, she will more than often try to get to safety first, but if faced with no other choice, or if a friend of hers is in danger, she'll often attack with strength that would surprise anyone.<br>\r\n<br>\r\nwell, that's Aqua! so, ready to get started?</span></div></div>",
            "created":1405659600,
            "id":1829520,
            "title":"Aqua"
        },
        "132":{
            "author_id":"keifren1ooo",
            "author_name":"Keifren1ooo",
            "choices":[
                "The Pikmin world.",
                "The Pokemon world.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Aqua wandered throughout the house, trying to find out where Alex was. She just wanted to check to see how he was doing, since lately he's been very preoccupied with that machine he's been working on, the dimension hopper. He would keep talking to her at length about what he could do once he got the machine working; visiting other dimensions. He was particularly interested in the video game dimensions.<br>\r\n<br>\r\nOf course, like any machine, it had multiple kinks, bugs, and glitches that could prove dangerous. Alex always tried to find ways to fix these flaws, and while it was nice to see Alex so committed to his machine, Aqua always tried to make sure he was okay from time to time.<br>\r\n<br>\r\nAfter looking through every other room in the house, Aqua realized why she hadn't just checked Alex's room in the first place. Of course he would be in there, since that's where his machine is also located. Aqua went up to Alex's room and poked her head in. \"Alex?\"<br>\r\n<br>\r\n\"Hm? Oh, hi Aqua!\" Alex said, sitting at his computer. He smiled at Aqua, then went back to work on his machine, which was hooked up to the computer he was working on. Aqua walked over to him and watched him. After a few moments, Alex said, \"I thought you were playing with Emily.\"<br>\r\n<br>\r\n\"She went to play with your other siblings. Besides, I wanted to see how you were doing.\" Aqua explained. She glanced at the dimension hopper for a moment. \"How is your machine so far?\"<br>\r\n<br>\r\n\"Funny you asked,\" Alex replied. \"I was actually going to run a short test of it now. Um...\"<br>\r\n<br>\r\nSeeing Alex's conflicted face, Aqua asked, \"What's wrong?\"<br>\r\n<br>\r\n\"You don't mind if... you test the machine, do you? I want to see if someone other than myself can use it.\" Alex eventually said. He quickly added, \"It might be dangerous though, so you don't have to if-\"<br>\r\n<br>\r\n\"It's fine, Alex!\" Aqua interrupted. \"I'll be glad to!\"<br>\r\n<br>\r\nA mixture of relief and happiness spread across Alex's face. \"Thanks!\" He then disconnected the machine from his computer and handed the machine to Aqua. \"Okay, all I need you to do is use the machine to go to a dimension, then use it again to come back to this dimension. It should go smoothly... hopefully.\"<br>\r\n<br>\r\n\"Okay.\" Aqua replied. She looked at the machine, and saw that there were only two options available. She looked at Alex inquiringly. \"Only two options?\"<br>\r\n<br>\r\n\"Heh, yeah about that...\" Alex said, scratching his head. \"I've still yet to make more options. If this test goes smoothly, then I <i>should</i> be able to add more options. But for now, just use the options available. And... thanks again!\" he added, smiling.<br>\r\n<br>\r\n\"Your welcome! Now about these options...\" Aqua took a look at the two options available. thinking about it, she realized she could also plug it back in if she decided not to go to either of those worlds. finally, she decided to go to...</span></div></div>",
            "created":1408251600,
            "id":1843308,
            "title":"It's mid-day and she's looking for Alex"
        },
        "1321":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "a meadow in the morning",
                "snowy field mid day",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Alex walked out of the room, knowing he would end up transported as well if he stayed. As he left, I looked at the machine.<br>\r\n<br>\r\n\"I'm surprised he actually found coordinates\" I said out loud.<br>\r\n<br>\r\nI decided to go to my home world, pikmin. It would be fun to see how my friends reacted to me being human.<br>\r\n<br>\r\nI chose the option, but nothing happened.<br>\r\n<br>\r\n\"Well, I guess it doesn't work then\" I said, reconnecting it all Alex wouldn't have to. The moment I connected it I was thrown into a world of darkness.<br>\r\n<br>\r\nWhen I opened my eyes, I saw I was in...</span></div></div>",
            "created":1408251600,
            "id":1843319,
            "title":"The Pikmin world."
        },
        "1322":{
            "author_id":"keifren1ooo",
            "author_name":"Keifren1ooo",
            "choices":[
                "Take the risk and try to grab the Poké ball.",
                "Stay safe and try to run away.",
                "Wait and see what the Pokémon will do."
            ],
            "content":"<div class=\"\"><div> <span>\t“This place!” I exclaimed, pointing at the option labeled “Pokemon World”.<br>\r\n\t“Okay. You know what to do. I'll wait outside the room, since I'll get teleported with you if I stay.” Alex walked out of the room, but he quickly peeked his head back in and said one last thing, “Oh, and be careful!”<br>\r\n\tI gave Alex a reassuring smile. “It's alright, Alex! I'll be fine, but thanks!” Alex nodded his head and closed the door, leaving me alone in the room.<br>\r\n\tI turned my attention back to the dimension hopper, and chose the Pokémon option. The device started making some weird beeps and clicks, but I didn't know what they meant.<br>\r\n\t<i>I wonder where I'll end up...?</i><br>\r\n\tThe beeps on the machine started getting louder, and there was a bright flash of white light, temporarily blinding me.<br>\r\n\t“Aah!” I shouted, closing my eyes. When I opened my eyes again, I saw that I was in a large field full of tall grass.<br>\r\n\t“Whoa.” I said to myself, looking around. “It worked! I can't wait to tell Alex! All I have to do is...”<br>\r\n\tI looked around, but... I couldn't find the machine! I started to look around frantically for the machine in the tall grass, but I just couldn't find it!<br>\r\n\t“Oh no oh no!” I panicked. “What am I supposed to do now? Maybe I'll just keep looking...”<br>\r\n\tI kept searching around in the tall grass for what felt like hours, but I still couldn't find it.<br>\r\n\tThat was when I heard a growl. I looked up and saw an animal looking straight at me, it's mouth pulled back in a snarl.<br>\r\n\t“H-Hi there.” I said nervously. I didn't really know what Pokémon it was, but Alex probably knew. But he wasn't here with me now. And I didn't know why, but this Pokémon looked really angry.<br>\r\n\tRight behind the Pokémon, I saw what looked like a Poké ball. <i>I could run behind the Pokémon and see what that Poké ball has, or maybe even try to capture the Pokémon... but it might be safer if I ran away too. But wouldn't it be able to chase me?</i><br>\r\n\t“Grrr...” the Pokémon said to me again, making me yelp in fear. I didn't have many choices, but in the end I decided to...</span></div></div>",
            "created":1411185000,
            "id":1859052,
            "title":"The Pokemon world."
        },
        "13223":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "a voice called out",
                "it attacked",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I stayed there, frozen to the spot. Alex had taught me that pokemon act like animals a lot, and that animals sometimes react badly to sudden moments...So, I stood still.<br>\r\n<br>\r\nThe pokemon watched me curiously...that's when...</span></div></span></div>",
            "created":1411274460,
            "id":1859527,
            "title":"Wait and see what the Pokémon will do."
        },
        "132231":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "Growlith",
                "Poocheana",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\"hey! what did I say about running off?\"<br>\r\n<br>\r\nthe voice sounded male. the pokemon turned towards the sound of the voice. was the boy it's trainer?<br>\r\n<br>\r\n\"oh! did you find something?\" the voice asked. I heard footsteps, and a young boy about my age walked over. \"oh, who's this?\"<br>\r\n<br>\r\n\"I-I'm Aqua\" I said shakily. the pokemon was watching me with a look that I could only identify as hostile.<br>\r\n<br>\r\n\"nice to meet you Aqua\" the boy said \"sorry about this guy, he's a bit aggressive sometimes...\"<br>\r\n<br>\r\nI smiled, warming up to the kid. \"it's ok, he just took me by surprise\" I replied \"what pokemon is he?\"<br>\r\n<br>\r\nthe trainer looked at me with shock \"you should recognize him, he's a pretty common species\" the boy said \"but, might as well tell you. He's a...\"</span></div></div>",
            "created":1421954220,
            "id":1921358,
            "title":"a voice called out"
        },
        "1323":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "Metroid",
                "Kirby",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>The moment Alex walked out of the room, I sighed and put the machine down. I wasn't brave enough to travel alone, I wasn't experienced enough either. I plugged it in, but realized too late that it was set to automatically activate. the world became dark...<br>\r\n<br>\r\n<i></i>what world does Aqua end up in?<i></i></span></div></div>",
            "created":1410066000,
            "id":1853798,
            "title":"Other"
        },
        "14":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "Emily (younger sister)",
                "Zack (younger brother)",
                "May (older sister)",
                "Max (older brother)",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about one of his younger or older siblings?</span></div></span></div>",
            "created":1405659600,
            "id":1829521,
            "title":"Siblings"
        },
        "141":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "it's late at night and she got curious",
                "it's mid-day and she got bored",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Emily is 7 years old, 9 years younger than Alex. she LOVES adventure, and also loves science. she's VERY perky, and often wants to help, though she also breaks things on accident. she knows very little about the world, but sometimes surprises people with her knowledge. she's often treated as the girl who isn't ready yet, and sometimes she gets upset because of that.<br>\r\n<br>\r\nEmily usually wears a pink shirt with a matching pink skirt. sometimes she'll wear a tiara or a princess hat. she has hazel eyes, and brown hair. she normally wears pink light-up sketchers, if she wears any shoes at all.<br>\r\n<br>\r\nshe doesn't know how to deal with fighting very well, since she's so young, and will often look to someone else for protection. during a battle, she'll follow any order that doesn't involve fighting directly, and she'll follow it exactly.<br>\r\n<br>\r\nso, that's Emily! ready to get started?</span></div></div>",
            "created":1405659600,
            "id":1829524,
            "title":"Emily"
        },
        "1413":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Alex asks for her help.",
                "Alex forces her to do this.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, how does Emily get mixed up with dimension hopping?</span></div></span></div>",
            "created":1518354240,
            "id":2451704,
            "title":"The start of a great journey."
        },
        "142":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "it's past bedtime and he's hiding",
                "it's the midle of the day and he's playing hide-and-seek",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Zack is 4 years old. he's just learning about technology, and tends to be rather destructive. he's always curious about the world around him, and he often gets distracted easily. most of his siblings know not to leave him alone with anything for too long.<br>\r\n<br>\r\nhe usually wears a loose T-shirt and shorts, both of which are usually the same color. If he isn't barefoot, which is rare, then he wears sandals. he has short brown hair, and dark brown eyes.<br>\r\n<br>\r\nZack knows when danger is near, and will often either be ready for it, or run from it, depending on whether he trusts the people around him. in a battle, he goes for weak spots, and can find them VERY easily.<br>\r\n<br>\r\nso, that's Zack! want to get started?</span></div></div>",
            "created":1405659600,
            "id":1829526,
            "title":"Zack"
        },
        "143":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "it's late at night and she decided to check on an experament",
                "it's mid-day and she's cleaning",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>May is 19. she LOVES science, and constantly looks into it. she's often distracted, and is known to blurt out facts occasionally. she's known to be high in energy, but can act like she's calm. she'll often fake boredom or disinterest so people will do what she wants.<br>\r\n<br>\r\nshe wears shorts and a loose T-shirt, often with designs on both. she has brown hair and hazel eyes. Unless she's wearing slippers or dress shoes, she's wearing sneakers.<br>\r\n<br>\r\nin a fight, May puts her energy to good use. she's light on her feet, and can dodge attacks easier than most. however, she's not very strong, and often chooses to run.<br>\r\n<br>\r\nso, that's May! ready to get started?</span></div></div>",
            "created":1405659600,
            "id":1829529,
            "title":"May"
        },
        "144":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "it's late at night and he's working on machienery",
                "it's mid-day and he decided to fine-tune something",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Max is 24. he loves technology, and loves building it. he's known to ignore others when he's working, and at times when he just wants to be left alone. Max often gets bored of things that are low-tech, and when not working, he's often in his room.<br>\r\n<br>\r\nMax usually wears a T-shirt and Jeans. he has short brown hair, and dark brown eyes. he wears semi-casual shoes most of the time, but otherwise wears sneakers.<br>\r\n<br>\r\nin a fight, Max prefers to use machinery. however, a lack of mechanics doesn't mean he can't fight. Max is VERY strong, and will use that strength to his advantage if he needs to.<br>\r\n<br>\r\nso, that's Max! ready to get started?</span></div></div>",
            "created":1405659600,
            "id":1829532,
            "title":"Max"
        },
        "145":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "me!",
                "no thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about your point of view?</span></div></span></div>",
            "created":1405659600,
            "id":1829533,
            "title":"a new perspective"
        },
        "1451":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "male",
                "female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you a boy or a girl? (yes, it matters)</span></div></span></div>",
            "created":1405659600,
            "id":1829539,
            "title":"gender"
        },
        "14511":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "footsteps, sounding from someone older",
                "footsteps, sounding form someone younger",
                "thunder from outside"
            ],
            "content":"<div class=\"\"><div> <span>you got the chance of a life time when Alex invited you to his house to show you an invention. the only problem is, he had to take care of an emergency, leaving you to wonder the house while he fixed it.<br>\r\n<br>\r\nyou wondered into the basement, where Alex keeps his machine. the computer was already hooked up to it, and you knew it could activate at any moment.<br>\r\n<br>\r\nsuddenly, you hear a noise. it was...</span></div></div>",
            "created":1405659600,
            "id":1829540,
            "title":"male"
        },
        "145111":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "May",
                "Max",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you heard heavy footsteps. it must have been one of his older siblings! or maybe he was coming back!<br>\r\n<br>\r\nwho was it?</span></div></span></div>",
            "created":1405659600,
            "id":1829541,
            "title":"footsteps, sounding from someone older"
        },
        "1451113":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "Alex",
                "Lilly",
                "multiple people (Alex, Lilly, or older siblings)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>was it Alex, Lilly, or was it more than one person?</span></div></span></div>",
            "created":1405659600,
            "id":1829542,
            "title":"someone else"
        },
        "145112":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "Emily",
                "Zack",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the footsteps sounded light, like they were from someone young. who was it?</span></div></span></div>",
            "created":1405659600,
            "id":1829544,
            "title":"footsteps, sounding form someone younger"
        },
        "1451123":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "Aqua",
                "multiple people (Aqua and younger siblings)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>was it Aqua? or more than one person?</span></div></span></div>",
            "created":1405659600,
            "id":1829545,
            "title":"Other"
        },
        "14512":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "the footsteeps of someone older",
                "the footsteps of someone younger",
                "thunder from outside"
            ],
            "content":"<div class=\"\"><div> <span>you were excited because Alex had invited you over for Dinner. you didn't know why, though you suspected his friends had pressured him into it. you had gotten there early, and Alex was still getting ready, so you decided to explore the house.<br>\r\n<br>\r\nyou wondered into the basement, where Alex kept his machine. you didn't notice the machine, and instead looked at the computer, which was connected to it.<br>\r\n<br>\r\nsuddenly, you hear a noise. it's...</span></div></div>",
            "created":1405659600,
            "id":1829553,
            "title":"female"
        },
        "1452":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "Olimar (pikmin)",
                "another pikmin charachter",
                "another world"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here's where it gets interesting. instead of starting from Alex's world, you can start inside a videogame world. the question is, what character?</span></div></span></div>",
            "created":1405659600,
            "id":1829537,
            "title":"charachters"
        },
        "14521":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "he uses it",
                "he saw someone else use it",
                "he found it, but it's not in use"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>does he use it, or is someone else using it?</span></div></span></div>",
            "created":1418321520,
            "id":1900936,
            "title":"Olimar (pikmin)"
        },
        "145211":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "he was transported to Alex's world",
                "Alex gave it to him to study",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what are the circumstances?</span></div></span></div>",
            "created":1418321640,
            "id":1900937,
            "title":"he uses it"
        },
        "14522":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "Louie",
                "Kopites",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Louie? one of the Kopites?</span></div></span></div>",
            "created":1421429160,
            "id":1918698,
            "title":"another pikmin charachter"
        },
        "145223":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>well, what about a pikmins point of view?</span></div></span></div>",
            "created":1421429220,
            "id":1918699,
            "title":"other"
        },
        "14523":{
            "author_id":"kingalex1234",
            "author_name":"kingalex1234",
            "choices":[
                "Mario",
                "another mario charachter",
                "a diffferent world"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mario maybe?</span></div></span></div>",
            "created":1412178780,
            "id":1864753,
            "title":"another world"
        },
        "145233":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Ty the Tasmanian tiger.",
                "Another game's world."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ty the Tasmanian tiger perhaps?</span></div></span></div>",
            "created":1413219000,
            "id":1870914,
            "title":"a diffferent world"
        }
    },
    "info":{
        "author_id":"kingalex1234",
        "author_name":"kingalex1234",
        "brief_description":"the machine Alex made can travel through dimensions...but who uses it, and where to?",
        "created":1405648620,
        "description":"<td align=\"left\" class=\"norm\">(based on my previous fanfictions) Alex isn't the only one who used his machine! now, you can not only choose what he or his friends/family do, but also where they go, and what happens!<br>\r\n<br>\r\nwhile I prefer not restricting people, there are some things I prefer, and some things I won't allow.<br>\r\n<br>\r\n-do NOT kill a main character. unless it's set in the storyline of whatever dimension you choose, do NOT kill off main characters...that includes the one you choose to start with. an exception to this would be if you were ending the story line by killing the character you started out with, and there must be an alternate choice.<br>\r\n<br>\r\n-stay true to character! unless you give a valid reason, and another option, stick to the characters personality.<br>\r\n<br>\r\n-no sloppy chapters! rushing things is one thing, making it so the reader doesn't have a clue what's going on is another.<br>\r\n<br>\r\n-don't force your way. don't force someone to choose a specific choice. in fact, I'd prefer it if there is always two choices.<br>\r\n<br>\r\n-for the main characters, I prefer first person. the exception to this is your point of view, which must be second, and any virtual character, which may be third.<br>\r\n<br>\r\n-note that this story eventually has an end. this can happen in multiple ways that don't involve death. due to this, it is possible to end the story without an alternate choice. in order for this to happen, you must ask me first, otherwise the chapter may either get rewritten or deleted altogether.<br>\r\n<br>\r\nother than that, enjoy my first interactive story!</td>",
        "id":2000910,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1530581100,
        "modified":1530581100,
        "pretty_title":"the dimension hopper"
    }
}