{
    "chapters":{
        "1":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "Later that night at home, Connor tells his Dad.",
                "At school the next day, Connor's friends find out.",
                "Telling his swim coach the news.",
                "Connor decides to keep it a secret and try swimming again."
            ],
            "content":"<div class=\"\"><div> <span>Connor put his shirt back on and sat in the blue doctor's chair. The doctor left the room, and Connor sat there nervously. Connor was waiting for the news - his shoulder had been bothering him and he had gone to the doctor to find out what was up. His mother looked at him sympathetically, \"No matter what the results are Connor, were going to get through this and everything is going to be fine.\" Connor just smiled; he had had shoulder problems before and he feared this time it might be serious. They sat together is silence for what seemed like ages. Finally, the doctor returned and turned to Connor, \"Well, to put in layman's terms, the muscle in your shoulder is over-worked and is experiencing decay. Now, this may seem drastic, but it can be stopped by resting it; this means no sports...I noticed you're a swimmer...this is probably one of the worst activities for someone with your condition. There is a surgery that we can perform, but I don't recommend it because it will greatly reduce your shoulder mobility. Thank you for coming in, and if you have any questions feel free to call.\" <br>\r\n<br>\r\nConnor and his mother gathered their things and left. \"Honey, it'll be fine.\" Connor looked at her,\"Yeah, I guess...uuuh...It's just that with school and sports...I guess I'll miss them; 'cause I don't really want to get surgery so...\"</span></div></div>",
            "created":1212987600,
            "id":542231,
            "title":"Bad news"
        },
        "11":{
            "choices":[
                "decided to ignore it and head to bed.",
                "decided to get an apple to eat."
            ],
            "content":"<div class=\"\"><div> <span>Connor decided to take a nap before he told his dad it had been a long day. He woke around supper time and headed downstairs. His mother had make a big meal and Connor was hungry. He ate his meal and then went into the living room with his dad.<br>\r\n<br>\r\n\"Hey dad\" Connor said \"You know how I went to the doctors today for my shoulder right\"<br>\r\n<br>\r\n\"Yes so what did he say\" his dad says wanting  to know.<br>\r\n<br>\r\n\"Well it not gonna kill me but I won't be able to play sports anymore, escpecially swimming\" Connor said as his father got up to stare out the window. Connor father was an oylmpic swimmer who lost his chance to get gold and wanted his son to acheive that for him some day but now it was all over. <br>\r\n<br>\r\n\"Well at least it would kill yah, there always a good point to very bad thing\" Connor dad said.<br>\r\n<br>\r\n\"Yeah there is dad\" Connor said a little worried though how all his friends were gonna be able to take it. Connor stomach then growled for more food.<br>\r\n<br>\r\nConnor...</span></div></div>",
            "created":1213333200,
            "id":543742,
            "title":"News for Dad"
        },
        "12":{
            "choices":[
                "They felt obvious sympathy for him.",
                "They became overly agnry.",
                "They mocked Connor.",
                "They try to just make the best of it.",
                "writers choice."
            ],
            "content":"<div class=\"\"><div> <span>\"Connor! What's goin' on man?\" Cory asked Connor.<br>\r\n\"What do you mean?\" Connor replied innocently.<br>\r\n\"We heard you didn't even attend the swim team try-outs. Why not?\" Cory questioned. \"Swimming is your life here, what in the world could make you give it up?\"<br>\r\nCory slumped his shoulders, knowing that he'd have to tell them the truth about his condition. He had hoped to keep it a secret. Was he really so transparent about his motivations?<br>\r\n\"You guys know how my shoulders been hurting recently right?\" Connor began.<br>\r\nWhen his two best friends nodded he continued. \"Well I went to the doctor yesterday to get it checked out. He says that I've developed something, I can't remember what its called, but it is deteriorating the muscles in my shoulder. I need to let it rest so my body can sort itself out, exerting myself at this point can aggravate the condition and make it much worse. So, swimming is out of the option right now.\"<br>\r\nHis two friends, so predictable in their reactions were exactly what Connnor expected, and didn't want.....</span></div></div>",
            "created":1215838800,
            "id":555310,
            "title":"Revelations"
        },
        "121":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "The next class, more sympathy.",
                "After school, the three boys walk home together.",
                "A few days later."
            ],
            "content":"<div class=\"\"><div> <span>\"Aww man that sucks, I'm so sorry. That's the worst news. I feel so bad for you. Man, is there anything I can do for you.\" Cory replied.<br>\r\n<br>\r\n\"Nah, not really, unless you can magically heal shoulders,\" Connor chuckled back.<br>\r\n<br>\r\n\"No really, I feel horrible too,\" Danny added,\"That really stinks about your shoulder. If there is anything I can do feel free to ask. I feel so bad you can't swim.\"<br>\r\n<br>\r\n'Really guys its fine.\" Connor interrupted.<br>\r\n<br>\r\n\"You know what, I'm not going to play soccer this year, just for you. This way we can all hang out and it won't be too hard on you not to swim.\" Danny interjected.<br>\r\n<br>\r\n\"No, you REALLY don't have to do that for me,\" Connor answered.<br>\r\n<br>\r\n\"I want to. I want to do this for you,\" Danny quickly said.<br>\r\n<br>\r\n\"Yeah, me too. I'm not going to wrestle this year. That way we can all hang out together and it won't be to weird not to be doing sports because we'll be having so much fun.\" Cory added.<br>\r\n<br>\r\n\"You can't Cory, as nice as that is, wrestling is your life, I couldn't ask you to give that up.\"Connor said.<br>\r\n<br>\r\n\"What don't you understand, WE WANT to be there for you.\" Cory snapped back. <br>\r\n<br>\r\n\"Ok thanks guys, this is gonna be awesome. All three of us together all the time,\"Connor said. The three hugged and began walking to class.<br>\r\n</span></div></div>",
            "created":1216098000,
            "id":556500,
            "title":"They felt obvious sympathy for him."
        },
        "1212":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "Danny plots to get revenge on Cory with Connor, but how?",
                "Danny forgives Cory and makes up, after all they have three weeks left together.",
                "Danny goes to \"help\" Cory with drinks, and they argue about it away from Connor."
            ],
            "content":"<div class=\"\"><div> <span>\"Did you understand the pre-calc. homework today?\" Danny asked.<br>\r\n\"Not really.\" Cory answered.<br>\r\n\"I did, its really not that hard, I'll explain it to you later,\" Connor added,\"Man, it really sucks that I can't swim, I was for sure gonna be captain this year, but I guess there's nothing i can do about it.\"<br>\r\n\"Yeah, that does suck, I'm not really that sad I'm not gonna play soccer this year. I think our year was last year, and since a ton of seniors graduated last year the team is going to be a bunch of new freshman. We probably won't win state again. So I guess its better to end on a high note,\" Danny said.<br>\r\n\"Yeah, I'm gonna miss wrestling a ton, but I'll still work out and maybe, I can still join if I really do miss it that much 'cause tryout are still three weeks away, but it'll be fun to hang out with you as much as I can.\" Cory replied.<br>\r\n\"WHAT!?!\" Connor and Danny shouted shocked.<br>\r\n\"I thought you were going to quit so that we could all be together?\" Danny stated,\"You know cause our best friend Connor can't play.\"<br>\r\n\"It sounded like a good idea at the time to say to make him feel better, but I didn't really think it through, I don't know...I want to quit, i guess...but I'm just not sure, well, maybe I want to...\" Cory started.<br>\r\nConnor, interrupting, \"No, don't feel bad. I never asked you to do it, and although it was a nice gesture I don't want to hold you back just 'cause I can't swim.\"<br>\r\nDanny just stared at Cory, under his breath,\"Well, I'm not playing soccer.\"<br>\r\n<br>\r\nThe rest of the way home was very quiet with the occasional sigh or grunt. Danny was clearly upset that Cory had said this to Connor and was even thinking about wrestling. Danny would often shoot Cory an mean glance or uncomfortable stare.<br>\r\n<br>\r\nFinally, the boys came to Connor's house. They went inside and Cory turned to Danny and sharply said, \"I'm going to use the bathroom, if that's ok with you Danny. Unless, you have an objection to me running my own life.\" Danny just stared at him and raised his eyebrows. Cory went to the bathroom and Connor and Danny sat down on the couch and turned on the tv.<br>\r\n<br>\r\n\"So, are you upset about not being able to swim this year?\"<br>\r\n\"Uh, kind of, not really I guess. I don't think I would have swam in college. It was just something to do, I already got my letter, but it would have been cool to be captain though; that's the only thing I'm disappointed about. Why did you give up soccer for me? I would have been fine.\"<br>\r\n\"Well, I don't really like playing soccer. My dad just likes me to play sports and that's the best of the worst I guess. Plus, you're my best friend and it's our senior year, we should be hanging out and just having a great time.\"<br>\r\n\"Yeah, it will be great, won't it?\"<br>\r\n\"Yeah it will!\"<br>\r\n<br>\r\nJust then Cory came back and said, \"Connor and Danny, I'm really sorry if I upset you or made you mad, but this could be my year and I know what I said, and I really do want to be there for you Connor, but I might want to wrestle, that's all. Do you guys want anything to drink?\"<br>\r\n<br>\r\n\"NAH...\" both boys replied as Cory walked into the kitchen.<br>\r\n</span></div></div>",
            "created":1216256100,
            "id":556708,
            "title":"After school, the three boys walk home together."
        },
        "12121":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "Connor agrees.",
                "Connor can't go through with the plan."
            ],
            "content":"<div class=\"\"><div> <span>\"What a jerk,\" Danny whispered as soon as Cory was out of sight,\"How could he even think about wrestling, he's our best friend and you can't swim this year. You'd think he would want to be here for you.\"<br>\r\n\"You know you're right Danny. He of all people should be supporting me and you are so why shouldn't he. Cory's being selfish.\"<br>\r\n\"Hey, why don't we get back at him. After all if he doesn't want to support you when you can't swim, then we don't have to support him when he wrestles, right?\"<br>\r\n\"Right! But how should we get back at him?\"<br>\r\n\"I don't know yet, but don't make it seem like were being sneaky, act like were going to be ok with this and he'll never know.\"<br>\r\n<br>\r\nJust then Cory returned to the living room with a bag of chips and a soda pop for him. Cory sat down uncomfortably on the other couch.<br>\r\n<br>\r\n'\"You know Cory, I'm sorry how I acted. You're right I can't decide things for you and you should wrestle. If that's what you like to do then you should do it,\" Danny said breaking the silence.<br>\r\n\"Thanks man,\" Cory replied,\"Cause I could do great this year, plus we still have three weeks until the wrestling tryouts, so we can hang out for three weeks all the time, just us three.\"<br>\r\n\"Yeah, but what about your working out? That's all you ever do during the season.\"<br>\r\n\"DURING the season, I don't have to be at competition weight at tryouts, plus I'm only like ten pounds away from my weight class, that's not that far and when the season starts that weight will just melt off real quick.\"<br>\r\n<br>\r\nDanny just got an idea, he worries so much about his weight during the season, what would happen if he just started getting heavier and heavier, the season workout would be a pian and he would freak out about making weight. Danny leaned over to Connor and whispered, \"Let's make Cory gain weight. After all that's the major aspect of wrestling and if you can't swim, let's make wrestling a little more difficult.\"<br>\r\n\"I don't know Danny, it sounds a little mean, and after all how could we?\" Connor replied.<br>\r\n\"Oh, come on you wuss, he can just lose the weight, after all he just said he was really close to his weight and tryout weight doesn't matter. Plus we can easily find some way to put weight gain powder or whatever in his food, he will be with us for like three weeks straight and won't have much time to work out. Come on it'll be just good fun.\"<br>\r\n\"Well...\"<br>\r\n</span></div></div>",
            "created":1216573620,
            "id":558309,
            "title":"Danny plots to get revenge on Cory with Connor,..."
        },
        "121211":{
            "choices":[
                "Connor calls his girlfriend",
                "Connor decides to test out the product"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, just don't hurt him,\" Connor says after a few seconds of thinking it over.<br>\r\n<br>\r\n\"Excellent, we'll plan a little more after he leaves,\" Danny replied.<br>\r\n<br>\r\nAfter a while the movie was finished, and so was Cory's junkfood.<br>\r\n<br>\r\n\"Well I think it's time I get back, mind if I get a ride?\" Danny asked as he stood up from the couch.<br>\r\n<br>\r\n\"Already you want to go, we've only been over for maybe two hours,\" Cory replied as he crumpled up the once full bag of chips.<br>\r\n<br>\r\n\"No I think Danny is right, I still have a lot of homework to do and I might see Desi later,\" Connor added in, he decided to play along with whatever Danny was doing.<br>\r\n<br>\r\n\"Hmm, ok then,\" Cory said, he got up and stretched a bit, the movement caused a loud belch to escape.<br>\r\n<br>\r\n\"Ready?\" Connor asked.<br>\r\n<br>\r\nThey all got their sneakers on and headed out to Connor's car.<br>\r\n<br>\r\n\"Make sure you drop him off first,\" Danny whispered to Connor as they got in.<br>\r\n<br>\r\nThey arrived at Cory's house and pulled over.<br>\r\n<br>\r\n\"Alright guys see you tomorrow,\" Cory said as he started getting out.<br>\r\n<br>\r\n\"Yeah, come over tomorrow morning before school, I'll make some breakfast,\" Connor added.<br>\r\n<br>\r\n\"Huh, sounds good to me,\" Cory sai with a little surprise, he gave connor a pat on the shoulder and got out of the car.<br>\r\n<br>\r\n\"Alright now let's go to the mall,\" Danny said as soon as the Cory left the car.<br>\r\n<br>\r\n\"What are we going to do there?\" Connor asked as he headed in the direction of the mall.<br>\r\n<br>\r\n\"We're just going to pickup a few things,\" Danny replied smugly.<br>\r\n<br>\r\nInside the mall Danny and Connor headed over to the GNC store.<br>\r\n<br>\r\n\"Ah I see what you're up to.  But do you think we should both go in?\"  Connor asked.<br>\r\n<br>\r\n\"Why wouldn't we?\" Danny asked.<br>\r\n<br>\r\n\"I dunno, maybe they would give you a better deal if you pretended to be some lifting newbie or something like that,\" Connor suggested.<br>\r\n<br>\r\n\"Hmm, ok fine I'll just go in, wait out here and come in once you see meat the register, just to make sure nothing seems like a scam,\" Danny said.<br>\r\n<br>\r\nConnor nodded and Danny went inside, there was only one other customer.<br>\r\n<br>\r\n\"Hello there sir, is there anything I can help you with?\" asked a cute sales rep probably in her late twenties with long brown hair and a fabulous body.<br>\r\n<br>\r\nDanny was a little flustered by the beautiful saleswoman at first, but managed to pull himself together.<br>\r\n<br>\r\n\"Yeah, I'm thinking about starting a workout regiment, but I wanted to gain some mass before I started the real serious workouts.  Do you have any sort of powder or supplement I can take?  I mean I want to gain a serious amount of weight pretty quickly,\" Danny said, he thought it sounded good.<br>\r\n<br>\r\n\"Well firstly, be careful not to try and put on too much weight before you start your training.  My ex-boyfriend tried to be a body builder but he took too much weight gain powder, and not enough exercise, he became a little too chunky for my taste.  But you seem responsible, I have just the thing for you,\" The saleswoman said with a wink and went behind the counter into the back room.<br>\r\n<br>\r\nShe quickly reappeared with a large tub of powder sport a flashy logo, 'Proto-Mass Packer 4500!'.<br>\r\n<br>\r\n\"This is the new stuff, all the employees got a free tub, but I gave mine to my boyfriend and he put on nearly thirty pounds in three weeks.  Of course he has the correct diet and excersises all the time. And since I think you seem so ready to get huge, I'll cut the cost by 50%,\" the saleswoman said enthusiastically.<br>\r\n<br>\r\n\"Wow thanks, I really do want to get big.  But, speaking of diets, I know it's important to be eating a lot to keep your body going, but sometimes...\" Dany said but was cut off.<br>\r\n<br>\r\n\"I know just the thing,\" the saleswoman went to one of the shelves and returned with a small pill bottle.<br>\r\n<br>\r\n\"These are appetite stimulants, they make you feel less full and help your body store more carbs for energy,\" the saleswoman explained.<br>\r\n<br>\r\n\"Ok everything sounds great, I think his will be all,\" Danny said, and just then he noticed Connor walk up beind him.<br>\r\n<br>\r\n\"Oh you have a friend with you?  I can throw in another discounted tub of Proto-Mass if you want,\" the salsewoman said as she eyed Connor.<br>\r\n<br>\r\n\"Uhh sure why not,\" Connor said.<br>\r\n<br>\r\nDanny paid for everything, which was much cheaper than he would have thought and they went back to Connor's car.<br>\r\n<br>\r\n\"Ok we'll split the bottle of pills and each take a tub of powder, that way we can sneak it into Cory's food no matter where we are,\" Danny said as they got in the car.<br>\r\n<br>\r\n\"Alright, just read the directions first,\" Connor said as the startd to pull away fom the mall.<br>\r\n<br>\r\n\"Ok the appetite stimulants read take one hour before eating with food or water, warning, taking more than one pill a day can result in stomach pain, dry mouth, and dizzy spells.  Ok so one of us will give him a pill during lunch at school.  Umm, ok, Proto-Mass Powder 4500, mix one scoop with one liter of water, for maximum results take daily and after workouts.  Basically sneak this into anything he tries to eat,\" Danny said.<br>\r\n<br>\r\n\"Alright see you for breakfast tomorrow, and ourfirst test run,\" Connor said as they arrived at Danny's house.<br>\r\n<br>\r\n\"Don't worry about it, evrythin will go fine,\" Danny said and he got out of the car.<br>\r\n<br>\r\nConnor drove home, it was about 5:30, still early, and he really didn't have any homework to do.</span></div></div>",
            "created":1263249480,
            "id":818935,
            "title":"Connor agrees."
        },
        "1212111":{
            "choices":[
                "Breakfast the next morning",
                "Desiree discovers the weight gain supplies"
            ],
            "content":"<div class=\"\"><div> <span>After eating dinner, two large helpings of lasagna, Connor decided to invite his girlfriend over to hang out.<br>\r\n<br>\r\n\"Hey Des, want to come hang out tonight?\" Connor asked.<br>\r\n<br>\r\n\"Sure, I'd love too.  See you in a few,\" Desiree replied.<br>\r\n<br>\r\n\"Ok see you soon,\" Connor answered and hung up the phone.<br>\r\n<br>\r\nConnor walked inside to the den and sat on the couch with a thud.  He began to rub his gut which was soft from the lasagna, he mulled over the idea of Desiree coming over and his plan to fatten up Cory.  As his hand massaged his slightly expanded stomach, he wondered what it would be like to put on a few pounds.  Then he heard a knock on the door and got up.<br>\r\n<br>\r\n\"Hey nice to see you,\" Connor said as he greeted his girlfriend at the door, he gave he a quick kiss.<br>\r\n<br>\r\n\"Mmm, nice to see you too,\" Desiree replied.<br>\r\n<br>\r\nThey went inside and sat down in the den to watch some TV.  Connor had is arm around Desiree and after a while she lay down on his lap.  Desiree noticed Connor's stomach was a little swollen and she aimlessly ran her finger over Connor's soft midsection, Connor didn't mind.  After a while Connor's stomach began to grumble a little.<br>\r\n<br>\r\n\"Hmm, someone's hungry I see,\" Desiree said as Connor's stomach gurgled.<br>\r\n<br>\r\n\"Huh, I guess a little,\" Connor said as he noticed that he ws feeling a little hungry.<br>\r\n<br>\r\n\"Why don't you get us some ice cream?\" Desiree suggested.<br>\r\n<br>\r\n\"Sure,\" Connor responded, he lifted her head off of his lap and went into the kitchen to get some ice cream from the freezer.<br>\r\n<br>\r\nAfter a few minutes Connor returnd with two bowls of ice cream, one of them had a much more generous amount of ice cream, he also brought some chocolate syrup.<br>\r\n<br>\r\n\"I figured you might want something sweet,\" Connor said as he set the syrup down on the table.<br>\r\n<br>\r\nDesiree sat up and watched as Connor went to work on his ice cream, she didn't eat much.<br>\r\n<br>\r\n\"Hey, don't you want any?\" Connor asked after a few minutes as he notced she wasn't eating much.<br>\r\n<br>\r\n\"Oh, well I figured I have volleyball tryouts in only a few days, I wouldn't want to ruin my hardwork,\" Desiree said.<br>\r\n<br>\r\n\"Oh, ok, that makes sense,\" Connor replied and went back to eating.<br>\r\n<br>\r\nAfter another few minutes Connor let his spoon clank in the empty bowl, he sat back on the couch, his belly now spilled over the waistband of his sweatpants.  Desiree moved close to him and slowly began to rub his stomach.  She was so used to his rippling six pack, toned and stiff, and she could still feel his muscular abs, only now they were hidden under a soft layer of flesh.<br>\r\n<br>\r\nDesiree kissed him, \"Why don't we go to your room, I have something to show you,\" she said as she headed upstairs.<br>\r\n<br>\r\nConnor sprang up and followed her up to his room, he locked the door and sat down on his bed.  Desiree sat down on his lap, Connor noticed she was holding the bottle of chocolate syrup.  Desiree popped open the cap and drank a little of the syrup, she let some linger on her lips.<br>\r\n<br>\r\nDesiree kissed him again, he could taste the sweet syrup, \"Mmm, doesn't that taste good,\" she said seductively.<br>\r\n<br>\r\nConnor was getting turned on by this, and Desiree could feel it.<br>\r\n<br>\r\n\"Hmm, wouldn't you like a taste?\" Desiree said as she put the bottle into his mouth and squeezed on it.<br>\r\n<br>\r\nConnor let the syrup flow into his mouth, he could feel Desiree massaging his pecs, he flexed them in ecstasy.  Desiree took the bottle from his mouth and kissd him again.<br>\r\n<br>\r\n\"Uhh, I just love chocolate,\" She said, Desiree could tell now Connor was so turned on, she could feel his heart beating harder and faster as she worked her fingrs into his chest..<br>\r\n<br>\r\nDesiree unbuttoned her shirt and Connor tore of his t-shirt and threw it to the floor.  She could now see what she had been longing for, Connor's distended gut.  Desiree could see the start of a juicy roll of fat forming below his navel, she pictured how soft he could become.  Desiree squeezed some more syrup into his mouth and spilled some onto his chest and stomach.<br>\r\n<br>\r\n\"Looks like I'll have to clean up this mess,\" Desiree said as she began to lick the chocolate off Connor's body.<br>\r\n<br>\r\nConnor couldn't stand much more, sweat started to bead up on his body, Desiree began to massage his stomach and slowly worked her way into his pants.  She slowly ran her hands agaist his thick and hard shaft.  And then Connor moaned in ecstasy as his muscles tensed up.<br>\r\n<br>\r\nConnor and Desiree lay there, kissing each other intermitantly amidst the silence.</span></div></div>",
            "created":1263505920,
            "id":820209,
            "title":"Connor calls his girlfriend"
        },
        "12121112":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Ask him about it",
                "help him along."
            ],
            "content":"<div class=\"\"><div> <span>Conner was sleeping peacefully and Desiree was taking her boyfriend in.  She had always liked Conner's rangy swimmers body.  She was proud to be seen with him because of his looks but tonight she was seeing a new and better Conner.  She watched the soft bulge of his belly as he slept.  She liked the soft fat laid over his muscular frame.  He would look magnificent with a few more pounds.  He seemed to like eating so maybe she could just help him along.<br>\r\nShe checked the small refrigerator by his bed to see what might be available.  Then in the cabinet beside the fridge she found the weight gain powder and appetite stimulant. She decides that It looks like Conner is trying to gain weight.  <br>\r\nShe decides to</span></div></div>",
            "created":1290387900,
            "id":998549,
            "title":"Desiree discovers the weight gain supplies"
        },
        "121211122":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "go alone and manipulate Conner to stuff himself",
                "call in some help"
            ],
            "content":"<div class=\"\"><div> <span>Desiree did't tell anybody that she was a chubby chaser and that Conner was the perfect target.He muscular frame is perfect as a big soft bell will make him more of a man. She could see it know Conner with a huge belly and muscular legs, arms and a handsome face. Her family owned seven restaurants a big gym. He had the muscle and now she wanted the fat. She decide to go...</span></div></div>",
            "created":1325029380,
            "id":1247417,
            "title":"help him along."
        },
        "121212":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "One week later. Connor and Danny have been hard at work at their plans.",
                "The next day at school."
            ],
            "content":"<div class=\"\"><div> <span>\"...I just don't think I can do that, sure he didn't want to give up wrestling, but why should I be mad at him just 'cause I can't swim. It is his senior year, and it would be really hard to do that plan anyway.\"<br>\r\n\"Ok that's fine,\" Danny repiled.<br>\r\nDanny really wanted to go through with the plan, maybe he'll do it alone without Connor, The boys sat talking and watching tv for a few more hours, but Danny seemed to keep drifting off to his plan to fatten Cory. Danny had to go through with it, it was too perfect. Cory always prized his body and what better way to get back at a wrestler, to fatten his body, and maybe Connor should be a little heaftier too. After all he doesn't need his buff body for swimmming, and Danny was only trying to do this to make Connor feel better, but he just shot down his idea before it even got time to form. Yeah, maybe Danny will fatten up both of his friends. Danny fidgeted with excitement he knew he had to get to the mall soon and get some weight gain suppliments. Danny waited anxiously for the boys to finish so that he could go and start his plan. <br>\r\n<br>\r\nThe boys were working on Precalc homework and Connor noticed that Danny was working extremely fast Connor didn't think anything of it though because he was having difficulty concentrating. Connor found himself thinking about Danny's plan, it was a brilliant plan. Maybe Connor should do it, look at cory all smug with his \"perfect\" body. Yeah, he was going to fatten Cory and maybe Danny needs a little fattening too. After all, Danny suggested it so why waste such a good idea on just one person. Plus, Danny already has a softer stomach than him or Cory, so he probably doesn't really care if he gains a little weight. <br>\r\n<br>\r\nThe two boys mulled over their plans, rationalizing fattening their friends while trying to do matracies and graph parabolas. Finally Precalc homework was done and Connor took his friends home. After Connor rushed to the mall to buy some weight gain supplements. Connor got to the mall in no time and parked the car and ran off to the entrance. He walked with a spring in his step it was hard to conceal his overhelming excitement. Connor made his way into the GNC and began looking at the supplements, pills, powders, and everything else. How was he ever going to find what he needed? <br>\r\n\"Excuse me sir can I help you?\"<br>\r\nPERFECT!<br>\r\n\"Yes, I need to find your weight gain supplements.\"<br>\r\n\"Of course, right this way, what exactly are you looking for?\"<br>\r\n\"Well, I...need to bulk up for wrestling season, my coach says, and I was hoping to gain as much weight as possible in the next three to four weeks.\"<br>\r\n\"Ok, well there are many things you can use; this right here will increase appetite, or you can use this weight gain supplement, but if you don't work out constantly while using this on it will turn to fat, so you have to be careful, or there's metabolism slowers, which might be useful seeing as you're still young and your metabolism is probably pretty high still, or you can go more toward steroid like supplements.\"<br>\r\n\"Um... I think I take tow bottles of apettite increasers, a large case of the weight gain supplement, and three containers of metabolism decreaser.\" <br>\r\n\"That's quite a bit, probably enough for three or four people to use all of it, you probably don't need that much.\"<br>\r\n\"Oh, well , I plan on sharing it with the team.\"<br>\r\n\"Ok, now make sure you follow the instructions carefully, and if you want to follow me to the front, I can ring you up.\"<br>\r\nConnor followed the lady to the cash register and paid for his stuff he was so excited to have really started the plan. <br>\r\n<br>\r\nConnor made his way to his car, but on his way out of the mall, he saw Danny in the distance. Connor quickly ducked into a store, he didn't want Danny to see what he bought and get suspicious. Connor waited for Danny to pass and made his way home. <br>\r\n<br>\r\nDAnny made his way into the GNC and asked the lady at the front, \"Excuse me, I need some help finding a weight gain supplement. Do you know know where any is.\"<br>\r\n\"That seems to be a hot item tonight, sure follow me.\"<br>\r\nDanny listened to the info on the supplements and decided of the appetite increaser, weight gain supplement, and metabolism decreaser. He paid for his mercandise at the register and went home. Danny was so excited to start his plan and watch his friends slowly fill up.<br>\r\n<br>\r\nBack at home connor took out his stuff and began to read the labels.<br>\r\nInsta-appetite: Take one pill two hours prior to eating and it will trigger hunger receptors in the brain's hypothalamus and disengage the recptors that trigger the sensation of fullness. When used over an extended period of time... \"Whatever,\" Connor thought, \"just feed them to my friends two hours prior to eating, this probably meant he would have to get them to eat it at lunch at school, or in the morning before lunch.\" Bulk Up 3000: Used to decrease the needs of your body, allowing you to store the nutrients of your food to be used for muscle development. Caution, because of the nature of this supplement if a rigorous work-out routine is not in cycle it is not recommended using this supplement because the food will store as fat if not used up. Put one tablespoon into any food at two meals a day and within a few days of beginning you'll start to notice the changes.\"Perfect, his friends won't be working out at all over these next weeks because its the time they all agreed to spend together.\" Metabo-low: Use for people suffering from being underweight and have difficulty gaining. This drug can cause permant body changes to metabolism and helps to keep your body from using up the food you eat. Take one pill a day. \"This plan is going to be awesome, everything seems to be falling into place.\" Connor contiued to examine the supplements reading the packaging over and over. He found that with Bulk Up 3000 alone he could get Danny and Cory to gain upward of 3 - 4 pounds a week and with the addition of the other products his friends could gain almost double that. Cory and Danny might be gainig almost 8 pounds every week. That's over 24 pounds when their together time is over. \"Awesome!\" this was going to be even better than he had expected.</span></div></div>",
            "created":1216655220,
            "id":558469,
            "title":"Connor can't go through with the plan."
        },
        "1212121":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "At a buffet - to eat.",
                "At Cory's wrestling tryout."
            ],
            "content":"<div class=\"\"><div> <span>ONE WEEK LATER<br>\r\n<br>\r\nConnor and Danny had been working hard on their plans. Each one had found sneaky ways and manuevers to get the other to take the pills and incorporate the weight gain power into foods. Everyday at lunch Danny offered to go buy the boys food while they found a table. So, Connor and Cory would go to a table and give Danny the money to buy the food. Danny would then add crushed up pills or powder to their drinks or food. The boys never caught on. Connor, everyday had Danny and Cory over for breakfast before school. Connor would make pancakes or waffles or fench toast something he could add the weight gain powder to. Then after school the boys started a little ice cream and movie get together. To the icecream and shakes Connor would add more. Connor and Danny were working full time finding new ways to get their friends to eat the supplements without them knowing. Cory thought ut was wierd that he never got to get any of the food they ate, but he didn't mind or think much of it. <br>\r\n<br>\r\nOne day after school Connor, Danny and Cory were coming home from school and Cory's stomach was growling so loud, \"I guess the appetite pills are working,\" Thought both Connor and Danny. <br>\r\n\"Man, you guys I starving. Would you care if we stopped off to eat somewhere first?\"<br>\r\n\"No, that sounds great!\" Connor answered quickly.<br>\r\n\"Yeah, I could use some food.\" Danny added.<br>\r\n<br>\r\nNeither Connor nor Danny noticed their own growing hunger and waistline, but seemed too focused on the others. Cory on the other hand, seemed oblivious to everything. The boys hadn't put on much noticable weight but it was probably around 7 or 8 pounds each. The boys looked a little bloated at best, but with both Connor and Danny working hard to make the others gain weight the boys were sure to gain quite abit of weight by the end of their time together.</span></div></div>",
            "created":1216768920,
            "id":566038,
            "title":"One week later. Connor and Danny have been hard..."
        },
        "12121212":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "At a secret meeting with Kevin the next day.",
                "The announcement of this years wrestling team."
            ],
            "content":"<div class=\"\"><div> <span>The weeks together few by fast and with both Connor and Danny working on their plans to fatten up their friends the boys certainly put on quite a bit of weight. Connor put on a good 25 pounds to his 185 lb frame. His rippled abs faded and a descent layer of fat was forming. His pecs softened and a bit of over hang formed. Connor's already tight shirts now showed his belly beginning to for, and his jeans clung to his bubble butt. Danny also gained about 32 pounds to his already soft 160. Danny, already softening up, had his shirts stretching across his expanding gut. Danny stopped wearing belts on his size 31 jeans and began wearing sweatpants to school a lot more. Danny had really chunked up and looked the most stocky ot them all. Cory had put on the most weight, adding a whopping 37 pounds to his 155 pound lean frame. Cory was sporting a thick midsection, puffed up butt, and meaty chest the amazing results of three and a half weeks of aggressive fattening by two friends and constant eating. The work of both Connor and Danny on Cory certainly paid off, and although Cory did notice a \"slight\" weight gain he didn't think anything of it because he could easily drop the maybe ten pounds he thought he had gained. <br>\r\n<br>\r\nCory grabbed his gym bag and wrestling onsie and got into the car with Danny and Connor. <br>\r\n\"Ready guys...I'm super pumped for tryouts and I'm glad you guys want to come with and support me. It really means a lot to me, thanks.\" Cory stated as he entered the car and shut the door.<br>\r\n<br>\r\nThe car ride was chatter of tryouts and the hopes for the team this year with the inclusion of the occasional pep talk. The boys finally reached the school. Connor and Danny went to the visitors side of the gym and took a seat to watch the tryouts. They sat and watched as the coach unrolled the mats and set up the equipment. Cory made his way into the locker room to get ready.<br>\r\n<br>\r\nCory entered the locker room and saw a few of the boys already geared up in their uniforms from last year. Cory grabbed out his uniform and took off his clothes to put it on when all of a sudden Kevin noticed Cory's weight gain and commented...<br>\r\n\"Looks like someone went up a weight class\"<br>\r\n\"What do you mean Kev?\"<br>\r\n\"I mean just that...You've packed on the pounds, Tubby Boy.\" as Kevin made his way over to Cory and patted his belly and watched it jiggle for a second afterwards. Kevin found himself surprisingly intrigued and grabbed it again shaking it up and down and then massaging it around.<br>\r\n\"What the hell? Anyway what is it ten pounds?\"<br>\r\nAlec snapped out of it and looked embarrassed up at Cory<br>\r\n\"More like twenty or more even.\"<br>\r\n\"Nah, your f'ing with me.\"<br>\r\n\"Fine if you don't believe me then go weigh yourself.\"<br>\r\n\"I will.\"<br>\r\nCory made his way over to the scale and kicked off his shoes and dropped his cargo shorts. He stepped up on to the scale and started to adjust the weight. Kevin couldn't help but notice the way Cory's briefs stretched across his now bubble butt and the elastic digging into the fleshy sides of Cory's once firm and chisled body. Kevin continued staring at the soft curves and expansive shape of Cory and felt himself getting excited about it. Kevin didn't know what to do all the guys were here and he was getting hard looking at Cory. Kevin sat down, grabbed his duffle bag, and placed it on his llap to hide his excitement. He pretended to look through it. Cory finally got the scale balance and let out a gasp...<br>\r\n\"192?!?! That's 37 pounds higher than just a few weeks ago and 42 pounds away from my competition weight....NAH... this scale must be broken, it han't been used all year and is out of sync. I couldn't have gained THAT much so fast.\"<br>\r\n\"Well, it certainly looks like you did,\" Kevin remarked as he felt his excitement beginning to relax. Alec took off the sweatshirt he was wearing and grabbed out his uni.<br>\r\n\"You think I gained weight look at yourself, Kevin...you're straight up fat.\"<br>\r\n\"Yeah I know I gained like twenty pounds cause I had a summer job and didn't get to work out and last spring when my leg was broken I started to pack it away, but I'm ready to work it off.\"<br>\r\n\"No you gained more than twenty pounds if I put on 37 you put on at least 50 in the past six monthes.\"<br>\r\n\"Here I'll check then.\"<br>\r\nKevin stepped on the scale after removing his sweatpants and shoes. Cory thought he looked like a suasage stuffed into his Under Armor. Alec used to be ripped but now he was pudgy and his short frame made him look even bigger. The fat made the once tiny wreestler into a portly rolly polly looking beach ball. Kevin's face had rounded out and much of the weight gain was held in his gut which has surpassed begginer flab months ago. Kevin was sporting a full blow beer belly, it protruded a good four or five inches, much different than his once washboard abs.<br>\r\nKevin adjusted the scale and looked at it in disbelief.<br>\r\n\"You were right, I weigh 174! Shit that's 56 pounds!! I have a lot more work than I thought.\"<br>\r\nThen a voice came from the doorway, it was coach,<br>\r\n\"Hurry up ladies, I don't have all day, let's get this show on the road.\"<br>\r\nAll the boys left the locker room but Kevin and Cory who were not dressed yet. They grabbed their unitards and started to put them on, neither of them realized they had their uniforms from last year and in their present plump perdicament they probably wouldn't fit. Kevin started to pull his up first, and felt the spandex expand and hug tight to his thickened thighs and plump bottom. Kevin felt the uniform strain and as he yanked it up further he tryed to fit it over his gut. The suit stopped and kevin tryed to suck it in he tugged hard and then turned to Cory who was laying on the locker room bench sucking it in too. The unitard was skin tight around his meaty thighs like an expanding balloon and his butt was pushing out against the fabric and created a marshmallow effect with his fat lovehandles pouring over the top of the uniform. Cory gave a pained look to Kevin and pulled the spandex over his gut, but the suit would not make it over his arms onto his shoulders. Kevin smiled and sighed back.<br>\r\n\"Damn, we did put on a little weight i guess.\"<br>\r\nThe boys laughed and the spandex rolled down Cory's body and landed under the belly. Cory peeled the tight fabric from his legs. Cory stood in the locker room with only his briefs and laughted with Kevin. Cory walked up to Kevin and offered,<br>\r\n\"Hey, let me help you.\"<br>\r\nCory helped Kevin up onto the bench and pulled on the straps. Kevin felt the strain increase and the suit began to cover his gut. Kevin felt so uncomfortable his crotch was aching from the pulling and his fat was so tight in the suit he was for sure the blood was going to be cut off to his legs and entire midsection. Kevin sat up and the strain ripped the singlet down the back. Kevin laughed and ripped the rest of the suit off of him. Kevin looked at Cory and started laughing again.<br>\r\n\"Hey do you think I could wear your singlet??\"<br>\r\n\"Sure if you want its not fitting me.\"<br>\r\n\"Yeah cause I weight only a bit more than you do at competition weight...well, quite a bit more but it might fit.\"<br>\r\n\"Yeah\" <br>\r\nCory tossed kevin the unitard and watched him try it on. Surprisingly it did fit...it was tight but fit. The logo on the front was stretched far and distorted and the leg holes created a muffin effect on Kevin's lefg fat, and the belly inside looked massive. Cory chuckled and said, <br>\r\n\"I guess its better htan nothing...damn we really did get big.\"<br>\r\nCory rooted through the box of old uniforms in the locker room and found one that fit descent. Cory looked big in his too, but it'll do. They left the locker room and walked out to tryouts. THe team all commented and coach made a lot of jokes about the plumped up jocks, but soon enough tryouts were over and the boys all went back to the locker room. All the boys called Cory and Kevin nicknames like tubby, bubble butt, lard ass etc., all having to do with their recently meatier figures. The boys all cleared out and Cory and Kevin were left again alone.<br>\r\n\"Dude your uniform is so tight...this wasn't a good idea to wear if I ever wanted to have children.\"<br>\r\n\"Yeah, I can't believe how big we got...how does this even happen, we were so in shape and now...look at us.\"<br>\r\n\"Yeah look at us...Cory?\"<br>\r\n\"Yeah?\"<br>\r\n\"I think I kinda like the extra weight....I mean it was sorta fun to you know, just relax and eat what I want...and the tighter my clothes got I enjoyed feeling my shirts stretch across my expansive belly....don't think I'm weird or anything...I just kinda enjoy not having to spit in water bottles to make weight and only eating a banana for a whole day to make weight.\"<br>\r\nCory sat there not sure how to respond.<br>\r\n\"Yeah I guess I know what you mean.\" Cory responded after a while. Cory's hands made their way to his softened gut and began to feel the taught spandex covering his sweaty swollen gut. Kevin walked over and reached around Cory. Kevins hands ran over the slick uniform and met Cory's. Flinched for a second and then let Kevin continue to massage his belly. Cory melted into Kevin's body and his head rested on Kevin's fleshy belly. Kevin felt himself getting hard, but the tight singlet held his penis in place. Kevin slowly removed the straps from Cory's shoulders and rolled the spandex off Cory's torso and let it rest underneath the little roll of fat forming on his waist line. Kevin's hands moved sensually around Cory's exposed flab. Cory was getting hard too, and Kevin noticed the bulge growing in Cory's singlet, and he kept going. Cory's breathing deepened and he flipped around ontop of Kevin. Cory realized Kevin was hard to, he was nervous...he had never done anything like this before, but it felt so good to be touched by Kevin. Cory lightly kissed Kevin's neck and simultaneously peeled the sweaty singlet from Kevin's body. Kevin's body acted like an expanding marshmallow in a microwave, as his body was released from the spandex prison it puffed up and his fat spilled out. The tight spandex had been holding the fat down and now it was released and Kevin's deep breathes pushed the uniform off his body and his belly flopped out onto his lap. Cory removed the uniform with his hands as he kissed his way down Kevin's body. As the singlet came off Kevin's full blown erection shot up and pitched a tent in his breiefs. Cory removed the rest of his singlet too and laid atop kevin. Their stomaches felt warm upon each other and their meaty thighs rubbed together as they placed a game of cat and mouse with their erect penises. They contiuned kissing each other as Kevin worked his hands into Cory's underwear and gripped his meaty bubble butt. Cory did the same, but the weight pressing down made it impossible to grip Kevin's ass so he began to stoke Kevin's dick. The two trusted together until both exploded and Cory rolled off Kevin and ran to the shower. Kevin slowly followed. The two stood naked in the shower silently. no a word was exchanged. Then Kevin broke the silence,<br>\r\n\"Maybe I won't wrestle this year, and just focus on gaining...and maybe you could help or do it with me?\"<br>\r\n\"Cory replied quickly and quietly,<br>\r\n\"Yeah, I'd like that.\"<br>\r\nThe two finished washing up and got dressed in silence. They left the locker room and Cory joined Connor and Danny and Kevin walked a seperate way but not before they exchanged one last look. <br>\r\nConnor and Danny began talking about the tryout, but Cory couldn't think about anything but the locker room experiance he had just had.<br>\r\n</span></div></div>",
            "created":1218014220,
            "id":612796,
            "title":"At  Cory's wrestling tryout."
        },
        "12122":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "The boys are unable to finish that much food.",
                "Connor wins! The boys take a nap then decide his prize!"
            ],
            "content":"<div class=\"\"><div> <span>Cory returned from the kitchen with two bags of chips, a two liter of Pepsi, a bag of popcorn, and three cups. <br>\r\n<br>\r\n\"I thought you might want something, I know you said no, but...\"Cory started.<br>\r\n\"Thanks,\" Danny interjected, \"and you're right, I can't run your life, why shouldn't you wrestle? If that's what you want to do then we'll support you.\"<br>\r\n\"Apology accepted,\"Cory replied,\"thanks guys, and who knows, maybe in three weeks I won't want to wrestle. We'll just have to wait till tryouts.\"<br>\r\n<br>\r\nThe boys all sat down and Cory poured Connor and Danny a cup of soda and opened the bags of chips. Connor got up and put in a movie. The boys all sat together and watched the movie. <br>\r\n<br>\r\nCory reached into the bag of chips and hit the bottom. He searched with his hand around the bottom of the greasy chip bag unsuccessfully. Cory crumpled up the bag and threw it on the table.<br>\r\n<br>\r\n\"Danny, pass me the chips,\" Cory said.<br>\r\n\"Yeah...we finished the chips, popcorn, and soda like twenty minutes ago.\"<br>\r\n\"Holy crap, we ate two jumbo family sized chip bags, a bag of movie style popcorn, and a drank a whole two liter. Man, how can that be? I'm still hungry.\"<br>\r\n\"Yeah me too.\"<br>\r\n\"Me too.\" Connor added, \"What should we do? How can we STILL be hungry, we just ate a ton of junk?\" <br>\r\nDanny suggested,\" Why don't we go out to eat?\"<br>\r\n\"That's a good idea,\" Connor answered.<br>\r\n\"Yeah, let's go to McDonalds, I have three weeks before I need to be in shape for wrestling, and I'm only five pounds from my target season start weight, so I can indulge a little.\" Cory remarked.<br>\r\n\"Yup, so it's settled, you guys grab your stuff and we'll go to McDonalds,\" Connor said as he grabbed his coat and headed out to his car. Soon after Danny and Cory followed suit and buckled up in the backseat. Connor turned on the radio and off they went to get food. <br>\r\n<br>\r\n\"Hey, guys, ok be open with me on this, but what if we have a food eating contest whoever can eat the most fastest? Huh? Are you guys up for it?\" Danny asked.<br>\r\n\"I don't know...Are you ready to lose?\" Connor shouted.<br>\r\n\"Well, guys, I can eat a lot, so bring it!\" Cory yelled.<br>\r\nWow Danny was surprised at how well his suggestion was taken. \"Ok the rules are each person will have two Big Macs to eat and whoever eats it fastest wins.\"<br>\r\n\"That's it?\" Cory remarked, \" Ok light weights.\"<br>\r\n\"Said the boy who's only in the middle weight class for wrestling. Fine we can add three hamburgers each.\"<br>\r\n\"And two supersize fries!\"<br>\r\n\"And a large drink!\"<br>\r\n\"Bring it on!\" Cory finished.<br>\r\n\"Ok guys, its our turn to order,\" Connor slipped in.<br>\r\n\"Welcome to McDonalds , How may I help you today?\"<br>\r\n\"Ok we need six Big Macs,\" Connor began, \"Whatelse?\" Connor yelled back.<br>\r\n\"Nine hamburgers!\" Cory replied.<br>\r\n\"Nine hamburgers.\"<br>\r\n\"Six supersize fries!\" added Danny.<br>\r\n\"Six supersize fries.\"<br>\r\n\"Three drinks, one Sierra Mist, one Pepsi, and one whatever you want,\" Danny said finishing the list.<br>\r\n\"A large Sierra Mist, Pepsi, and Mountain Dew,\" Connor finished telling the drive-thru operator.<br>\r\n\"Is that all today.\"<br>\r\n\"Yeah.\"<br>\r\n\"So you need six Big Macs, nine hamburgers, six supersize fries, and three large sodas a large Mountain Dew, Pepsi, and Sierra Mist. That will be $25.67 at the first window please. Thank you and have a great day.\"<br>\r\n<br>\r\nConnor pulled up to the first window and paid and then continued to the second to pick up their food. It took a while until their meal was ready, they did order a lot. Finally the food came to the window and the worker handed Connor the bags of food, and remarked,\"Is this ALL for you three?\" <br>\r\n\"Yup,\" Connor said as he passed the food back to Cory. They finished grabbing the food and began to head back to Connor's house. All three boys were salavating at the smell filling the car. It seemed like ages but they finally reached Connor's house. Connor had hardly stopped the car when Cory and Danny were dashing out of the car and were in the house. Connor made his way in the house and went to the bathroom. When he came out he found the food all set up in the living room ready for the competition. <br>\r\n<br>\r\n\"Ok,\"Danny explained,\"You have to eat all the food and finish your drink. Whoever does this in the fastest time will be the winner.\"<br>\r\n\"And what do we get if we win?\" Connor asked.<br>\r\n\"I didn't think that far, we can decide that later, let's hurry up and start I'm starving. Ok, ready, on your marks, get set, EAT!!!\"<br>\r\n<br>\r\nThe boys began to chow down. They each made their way through the first Big MAc with ease. Cory began working on his second, still in fast pace. Danny began on his hamburgers, and Connor was eating his french fries. It didn't seem any of the boys were going to willingly lose to their friends. The competition continued at a gradual slowing speed and rapidly expanding bellies. Cory's stomach was forming a quite noticable bump inside his tight shirt and Danny's gut, which already was a little soft, was filling to the limit and straining his jeans. Danny decided to unbutton his 32 jeans to allow his gut to expand. When he reached down to do this his hand grazed along his swollen gut and then it unbuttoned his pants, his gut felt the relief it needed to allow more food in as his stomach expanded past his pants. Connor had also undone the button on his pants and his tight muscle shirt began riding up his ballooning belly. The competition continued and....<br>\r\n<br>\r\n</span></div></div>",
            "created":1216328400,
            "id":556929,
            "title":"Danny forgives Cory and makes up, after all the..."
        },
        "13":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "Accept, what a great way to stay involved.",
                "Decline, team manager - that's for nerds."
            ],
            "content":"<div class=\"\"><div> <span>It was the end of the day and an announcement came over the loudspeaker, \"Anyone interesting in joining the LHS swimming and diving team for this year's season, there is a mandatory informational meeting at 2:35 in room 256.\" Connor sighed and gathered up his stuff and put it in his backpack. Connor knew he had to talk to his coach and was not looking forward to it. <br>\r\n<br>\r\nThe bell rang and Connor grabbed his backpack and walked quickly to his locker; he gathered his homework and books that he'd need for the night and began walking to room 256. He passed Cameron, a member of the swim team, who asked,\"HEY! Are you going to the meeting today?\" Connor nodded yes. \"Ok, cool, I'll see you there!\"<br>\r\n<br>\r\nConnor finally reached the room and made his way in; he saw Coach Joe sitting at a desk in the back and walked over. <br>\r\nConnor started, \"Coach, can I talk to you?\"<br>\r\n\"Yeah, what is it?\"<br>\r\n\"Well, I went to the doctor yesterday to see what was up with my shoulder, and it turns out that I'm not going to be able to compete this year.\"<br>\r\n\"Aww man, that sucks, we had such big plans for this year, and you were such a great captain last year.What is it?\"<br>\r\n\"I have a condition that is making me lose muscle mass in my shoulder, so if I do competitive swimming its going to irritate my shoulder too much, but I still want to be involved. I'm going to be doing physical therapy, but I want to work out with the team too and do some swimming as much as I can, if that's ok.\"<br>\r\n\"Yeah, for sure, but I think you should tell the team, don't you?\"<br>\r\n\"Yeah\"<br>\r\nConnor made his way to the front of the room and waited for the last of the boys to trickle in. Connor then began to say,\"Ok, this year I'm not going to be able to be a part of the team because of my shoulder, but I want to stay involved, I'm going to be working out as much as I can with you guys, if that's fine with you.\"<br>\r\n<br>\r\nThe room was silent. No one knew what to say, he was such a major part of the team.<br>\r\n<br>\r\nAfter a while of uncomfortable quiet Cameron shouted, \"TOTALLY FINE!!! You should be our manager!!!\" <br>\r\nThe other boys all continued with shouts of a approval, and when it quieted down Coach Joe said,\"That's a good idea Cameron; what do you guys think, should Connor be our swim team manager?\" The boys all agreed. \"What do you think Connor, do you what to do it?\" <br>\r\n<br>\r\nWhat does Connor do?</span></div></div>",
            "created":1213160400,
            "id":543047,
            "title":"Telling his swim coach the news."
        },
        "131":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "One Week Later, Connor's shoulder has been acting up.",
                "Later that night, Connor can't sleep and needs a midnight snack.",
                "The next morning on his way to school, a surprise downstairs."
            ],
            "content":"<div class=\"\"><div> <span>\"Uhh, yeah...yeah!\" Connor replied, \"yeah what a great way to stay involved! That's awesome, thanks so much, this is going to be a great year!\"<br>\r\n<br>\r\nThe team cheered!<br>\r\n<br>\r\n\"And you can still practice all you want with us!\" Cameron shouted over the top of the team.<br>\r\n<br>\r\nConnor couldn't have hoped for a better response from his team. The team finished up their business and Connor called Desiree to see if she wanted to get together.<br>\r\n<br>\r\n\"Hey Des, do you want to get together for dinner and maybe some studying?\"<br>\r\n\"Yeah,\" Desiree said back,\"I'll pick you up and we can get something to eat.\"<br>\r\n<br>\r\nConnor waited outside school for Desiree. She finally showed up and Connor got in the car and they drove towards Connors house.<br>\r\n<br>\r\nDesiree handed Connor a Chocolate Earthquake Blizzard from Dairy Queen and asked,\"Where do you want to eat?\"<br>\r\n\"What's this for?\"<br>\r\n\"Oh, I went to your house after school 'cause I forgot about your swim meeting and she told me about your shoulder.\"<br>\r\n\"Thanks, but the team was really great about it, and I'm going to be the team manager this year, and I can practice with them as much as I can. So, where do you want to eat?\"<br>\r\n\"That's awesome about the team, but I think you should pick where to eat.\"<br>\r\n\"Do you care if we just go home to eat? I'm kinda tired from today.\"<br>\r\n\"That's fine.\"<br>\r\n<br>\r\nDesiree pulled into Connor's driveway, and they went inside. Connor threw away his empty Blizzard and went over to the fridge. He found a note from his mom, \"Went to the grocery store - be back in an hour or two - there's dinner on the stove - Love Mom.\" Connor went over to the stove and got some dinner for him and Desiree. <br>\r\n<br>\r\n\"Hey, my mom went to the store, but she left dinner for us.\"<br>\r\n\"Come in the living room we can watch some TV and just relax.\" <br>\r\n<br>\r\nConnor went over to Desiree and gave her a plate. He was a little full from the blizzard but he decided to eat anyway. Connor sat next to Desiree and they watched MTV. Before Connor knew it he had finished his plate and Des was resting her head on his lap. Connor gently placed her head on a pillow and grabbed their plates and brought them to the kitchen; on the way over Connor ate Desiree's unfinished food, and placed the plates in the sink. Connor opened the fringe and saw some leftover dessert from last night. He cut two pieces of cake and brought them into the living room.<br>\r\n<br>\r\n\"Why'd you leave? I was so comfortable.\"<br>\r\n\"Oh,\" Connor chuckled,\"I just had to clean up. I got us some dessert though, do you forgive me?\"<br>\r\n\"Yeah, get bad over here already!\"<br>\r\n<br>\r\nConnor made his way back to the couch and handed a piece of cake to Desiree. She curled up next to him and started to feed him the cake.<br>\r\n<br>\r\n\"That piece was for you, Des.\"<br>\r\n\"You know I can't eat junk food, I'm in training for volleyball, Connor.\"<br>\r\n\"Oh yeah, sorry, I forgot sweety.\"<br>\r\n\"That's fine, you're just going to have to eat it.\"<br>\r\n\"I' guess that's just the price I have to pay, and I'm willing to burden eating this cake.\"<br>\r\n<br>\r\nDesiree fed Connor her cake and then fed him the other piece of cake as well. Connor felt so full after eating so much he had to unbutton his jeans. Des started to rub his belly as he spread out on the couch and she laid on top of him. Des felt his six pack pushed out on top of all the food inside his gut and began to work her way down to his unbuttoned jeans. Connor grabbed Desiree's face, and they began to make out. Connor could feel one of Desiree's hands making its way up to he muscled pecs and the ofter moving downward. Desiree was massaging his pecs and working her other hand into his pants. Connor felt his jeans get tighter and his full on erection pushing hard against his underwear. Des began stroking his dick and Connor flinched; it felt so good. Connor was getting sweaty and he started to breath heavier as he got closer and closer to climax. Just then they heard the garage door open and Desiree jumped off Connor and sat up. She fixed herself and Connor re-did his button and got off the couch. <br>\r\n\"Hey, Mom,\" Connor shouted as he walked toward the garage and adjusted his still hard penis, \"Do you need help with the groceries?\"<br>\r\n\"Yes, thank you very much.\"<br>\r\n<br>\r\nConnor grabbed a few bags and brought them inside. After all the groceries were inside Connor began to put them away. <br>\r\n<br>\r\n\"I got it Mom you can just relax.\"<br>\r\n\"Thanks, honey, that's so sweet of you. Oh, hi Desiree how are you?\"<br>\r\n\"Good Mrs. Sanders, and you?\"<br>\r\n<br>\r\nConnor continued to put away the groceries as his mother made her way into the office. Connor noticed that his mother certainly bought a lot of sweets. Maybe she didn't realize it was swimming season already, but this was a lot even when its not swimming. \"Oh, well\" Connor thought as he put the third quart of ice cream (so far) into the freezer. </span></div></div>",
            "created":1215752400,
            "id":554967,
            "title":"Accept, what a great way to stay involved."
        },
        "1313":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "A few more days of treats.",
                "The first swim meet of the season."
            ],
            "content":"<div class=\"\"><div> <span>Connor woke up the next morning, the swelling of his stuffed stomach had gone down from last night. Connor took a shower, got dressed, and went down stairs to get some breakfast and head off to school. When Connor got downstairs he turned into the kitchen and saw three baskets of cookies and sweets. Connor looked in the baskets; they were from three different swim team members, (they never were good at organizing team activities). Connor grabbed a few cookies from one basket and heard Desiree honking outside. Connor grabbed a few more cookies and ran out the door. <br>\r\n<br>\r\nAt school Connor saw more team members with other gifts; some gave rice krispy treats, candy, cookies, cupcakes, most of the gifts were sweets accompanied by a card. By the end of the day it seemed to Connor as if every member of the swim team had given him something. Connor was very grateful to each and every teammate for their gifts. <br>\r\n<br>\r\nWhen Connor got home he took in all his gifts, taking a few trips. His dining room  was almost completely covered in his gifts. Connor's mom came home and was shocked at all the stuff covering the dining room table.<br>\r\n<br>\r\n\"Connor, that's so sweet that your friends care so much, but could you bring all this to your room? Where are we supposed to eat?\"<br>\r\n\"Yeah, sorry, I didn' know EVERYONE was going to get me something!\"<br>\r\n\"That's fine, honey.\"<br>\r\n<br>\r\nConnor moved his sweets into his room and lined them under his window, along his bed, and on his bed side table. Then he went downstairs to watch TV and do some homework before dinner. <br>\r\n<br>\r\n\"Connor, come and eat.\"<br>\r\nConnor wasn't all that hungry, he hadn't realised but he had been snacking on sweets since after school. Connor didn't want to tell his mom he wasn't hungry so he went to eat anyway.<br>\r\n\"Coming,Mom!\"<br>\r\n<br>\r\nConnor sat down to dinner with his mom and dad and began to eat.<br>\r\n\"So how was school today Connor?\" his father asked.<br>\r\n\"Great!\" Connor replied, \"Almost everyone from the swim team got me a gift. It was awesome, I thought maybe a team gift, but they didn't organize one and each person just got me something.\"<br>\r\n<br>\r\nThe dinner conversation continued and before long Connor had eatten his dinner and dessert. Connor was stuffed and decided to go to bed, but while in his room Connor found himself snacking on more treats.</span></div></div>",
            "created":1215838800,
            "id":555089,
            "title":"The next morning on his way to school, a surpri..."
        },
        "13132":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "The team starts to notice the heftier team manager.",
                "Next Meet."
            ],
            "content":"<div class=\"\"><div> <span>A FEW WEEKS LATER<br>\r\n<br>\r\n\"Don't forget the first swimming and diving meet of the year is this afternoon at Tremper High School. All members of the LHS swim and dive team meet in the pool room at 2:45 after school; the bus to Tremper will leave promptly at 3:00. All students interested in attending the meet the student bus will leave at 4:30. The auditions for the spring musical will be held this <br>\r\nWednesday in the theater, the audition spots are filling fast! Also, during lunch hours for the next week, we will collecting for are annual Holidays for the Homeless drive, so spare some change to help make the holidays special for someone else. Thanks and have a great day LHS students and staff!\"<br>\r\n<br>\r\nThe day went by fast, everyone was pumped for the swim meet. The Tremper Devils were the LHS Crusaders biggest swim rivals. The meet was going to be crowded, everyone was going to come with as much team spirit as possible, it would be a great way to kick off the swimming season. Finally, the end of the day came and the team met at the pool room.<br>\r\n<br>\r\nThe team got on the bus. They were all chatty and loud; this was going to be a tough meet, but afterall the team had been training hard for weeks, well, everyone but Connor. Connor hardly made it near a pool deck over these past few weeks. He had kept so busy creating charts and time scheduals, reorganizing past swimming records, and taking inventory of the swim teams materials and ordering new stuff for the team. Connor hadn't realized how big of a responsiblity managing the team would be. Connor had worked hard and loved being the team manager and now at the first meet and with everything else in order, he could focus solely on the team today.<br>\r\n<br>\r\nThe LHS team finally arrived at Tremper High School. They got ready and started warm-ups. After warm-ups the team got in their huddle and Coach Joe gave his traditional pep talk; then the team perpormed their swim team school chant. After the team finished all their prep work, Coach Joe pulled out a box.<br>\r\n<br>\r\n\"Our new team wear came in just in time for the first meet and I wanted you guys to wear it.\"<br>\r\n<br>\r\nCoach passed out the speedos to each of the members and then gave them each a T-shirt. The boys all changed. The T-shirts all fit tight, the swim team loved to show off their muscles, with good reason, they work hard to have them. <br>\r\n<br>\r\n\"And for Connor, I know you're not on the team this year, but I got you a team speedo and T-shirt, after all your an important part of the team. I wanted to surprise you, so I just used your sizing from last year.\"<br>\r\n<br>\r\n\"Thanks Coach.\" Connor replied as he put his speedo in his bag.<br>\r\n<br>\r\nThe meet started and Connor grabbed his shirt and put it on. Connor pulled the shirt over his head. It fit a little tighter than he remembered. It must just be because he had a shirt on under it, \"That's it,\" Connor thought. He took off the shirt underneath and put back on the team shirt. It was still tight, \"Preshrunk,\" of course thought Connor. The shirt clung tight to his softening midsection, but Connor didn't seem to notice his midsection was the problem, preferring to make excuses blaming the shirt. He always did gain a little weight on the off season, but he was pretty ripped at the begining of the season because it was his senior year and he did do pre-season work outs. But maybe these few weeks occupied as team manager started to take its toll...on his waistline.</span></div></div>",
            "created":1215925200,
            "id":555598,
            "title":"The first swim meet of the season."
        },
        "131321":{
            "author_id":"andyman0987",
            "author_name":"AndyMan",
            "choices":[
                "Connor is shocked...NO WAY! He has to get his old body back!",
                "Sure. Whoever knew Des would be so into it? Awesome!"
            ],
            "content":"<div class=\"\"><div> <span>   As the team all went into the locker room to change into their new speedos, Connor took roll,\"Joel, Jordan, Cameron, Mitch...\" Mitch noticed Conner's snug shirt and patted his little belly. \"Cute,\" Mitch said. Connor was taken aback for a moment, but continued roll,\"Harrison, Alec, Kelli, Peter, Brent, Nick...\" Nick also noticed and grabbed Connor's sides and shook him, \"Aww, look at our little chunker.\" Connor reajusted his shirt and went back to roll a little more peeved, \"Lawrence, Greg...\" Greg, one of the fattest boys on the team, stopped and said, \"Looks like someone's catching up to me, HA, keep up the good appetite.\" Greg smiled and walked into the locker room. Connor finished the roll and was a little self conscious about that last statement. The boys all changed and Coach gave his pep talk. The boys grabbed their stuff and left the locker room to start their warm-ups. Connor stayed back, after all he didn't need to watch warm-ups he already posted the meet order and events. <br>\r\n   Connor took off his shirt and placed it, along with his clipboard and new speedo, on the bench. Connor walked over to the mirror and looked at his new forming belly. It did seem softer than he remembered, and was beginning to make his pants feel a little more snug. Connor unbuttoned his jeans and grabbed his little belly. He examined his sofftening body in the mirror. He felt his fluffy pecs and decided to weigh himself. Connor walked over to the scale and stepped up. The needle climbed up to 203, \"Man, I've gained 18 pounds!\" Connor thought. He grabbed his speedo and tried it on. Connor undressed and pulled up his speedo. The lycra stretched over his thick thighs and rested taught across his bubble butt. He went to the mirror and looked at his softening body and puffed-up ass. The speedo was definatly getting small but could pass for now. Connor changed back into his clothes and went out to the pool deck.<br>\r\n   The meet ended and Connor packed up and went home. Desiree met him there. Connor brought her up to his room and changed into his speedo.<br>\r\n \"Des, I want you to be honest when you see me, ok?\" <br>\r\n\"Ok\"<br>\r\n\"No really.\"<br>\r\n\"Ok, Connor, I will, just come in the room. What do you want to ask me.\"<br>\r\nConnor entered the room.<br>\r\n\"Do you think I'm too fat now?\"<br>\r\nDes smiled, \"No, everyone gains on the off season, and I think you look cute.\"<br>\r\n\"REALLY?!?\"<br>\r\n\"Yeah I kinda like you a little pudgier.\" Desiree hugged Connor and grabbed his lycra covered butt. \"I really like you this way,\" she whispered into his ear,\"Maybe we can keep it up.\"<br>\r\n\"You want me to purposly gain weight???\"<br>\r\n\"Yeah, please, baby, for me?? Not a lot we can just fill you out a little more.\"</span></div></div>",
            "created":1227937920,
            "id":612848,
            "title":"The team starts to notice the heftier team mana..."
        },
        "1313211":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Running",
                "Bicycling"
            ],
            "content":"<div class=\"\"><div> <span>Conner was shocked that Desi liked his new size.  <br>\r\n\"I don't know,\" he said rememebering how tight the speedo had been when he pulled it on.  He had been taking it too easy,<br>\r\nAll the time he was thinking that he had to get back in shape. No way he would let himself turn into a lardo even if Desi lked him fat,  \"I think I need to get back into shape.\"<br>\r\n\"Well,\" Desire told him. \"If that's what you want but I think you would be even hotter with a bit more weight,\"<br>\r\nLater that night Conner prepared a plan to get his old body back.  The big problem was with his shoulder he had to be careful about exercise.  Last year he was swimming so much that no matter what he ate he stayed lean and in shape.  This year without the swimming he was up 18 pounds.  At this rate he'd be up 100 pounds by next year.  No way he was going to let that happen. He would have to cut back his eating for sure but what kind of exercise could he do?  Maybe he should try</span></div></div>",
            "created":1253726580,
            "id":764791,
            "title":"Connor is shocked...NO WAY! He has to get his o..."
        },
        "13132112":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                " Conner checks his weight",
                "Conner puts on his speedo"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I'll try bicycling.\" Conner reasoned with himself on the way back home from Desi's house.  <br>\r\nNext day, he checked out bikes and decided that he could find time to ride at least three times a week.  A call to his doctor confirmed that unless he got wild and crazy or carried his bike, there shouldn't be any problem with his shoulder. <br>\r\nConner got started the very next day.  He found that doing a ride of 10 miles was pretty easy to work into his schedule, even with his duties with the swim team.  He liked the idea of getting back into shape.  Each day during his ride, he could feel the fat burning off his body. He was slowly getting back to his old weight.  <br>\r\nWhere he was having trouble was cutting back his eating.  In fact, the new exercise just made him more hungry.  Somehow he just couldn't manage the will power to say no to the tempting food that Desi kept bringing him and the coach kept bringing donuts when Conner had to work with the swim team records.<br>\r\nStill with all the new exercise, he was sure that he was well on his way back to top physical condition and his old weight.<br>\r\nTwo weeks later</span></div></div>",
            "created":1254976620,
            "id":772144,
            "title":"Bicycling"
        },
        "131321122":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "He could see some definition",
                "Still too much belly."
            ],
            "content":"<div class=\"\"><div> <span>Two weeks later, Conner was feeling confident that he was on track to getting his fit body back.  The bicyling was working well.  He felt better and it seemed to him that his clothes were fitting better.  His pants had been pretty tight.  He decided that he should see how the old speedo fit him.  In his room he stripped and going to the mirror he started pulling on the skimpy suit. <br>\r\n\"Still tight,\" he was thinking as he stepped back to check out his progress.<br>\r\nRemembering himself as a lean, powerful swimmer last year, he compared the image in the mirror.<br>\r\n\"MMM, he thought, \"Same powerful shoulders.  Legs look a little thicker  Abs-</span></div></div>",
            "created":1255712160,
            "id":776801,
            "title":"Conner puts on his speedo"
        },
        "1313211222":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "his girlfriend Desiree wanting to hangout ",
                "his mom needing help with the groceries "
            ],
            "content":"<div class=\"\"><div> <span>“My abs are not back yet. Too much belly.” Thought Conner as he pinched his belly roll and looked in the mirror. Thinking back on the bicycling he remembered hearing professional bicyclist tend to have very strong and toned legs and a toned butt that women love to gossip about. “I could focus on some sit ups or crunches, but many abs based building exercise involve the shoulders and the doctor said no movement to give my shoulder a chance to heal.” Though Conner. He also remembered that since he started bicycling Desiree commented that his butt looked more toned and she even grope his butt sometimes when they were alone together. The look of love in her eyes was evidence that she approved his bicycling. He was pulled out of thoughts as he changed back into to his regular clothes.  He went downstairs to sat on the couch and T.V.  and turned the channel to ESPN and started to watch a football match. Half an hour later he heard a knock on the door. Conner got up and opened the door and he saw it is….</span></div></div>",
            "created":1465459860,
            "id":2161412,
            "title":"Still too much belly."
        }
    },
    "info":{
        "author_id":"andyman0987",
        "author_name":"AndyMan",
        "brief_description":"Connor, a highschool student, begins to gain weight after he quits the swim team.",
        "created":1213053420,
        "description":"<td align=\"left\" class=\"norm\">Connor - a 17 year old highschool boy, Connor is very active and fairly fit when the story begins. He is a member of the swim team, but also plays football in the fall. He can not be part of the swim team his junior year as result of a shoulder injury and the story begins. He's about 6\"0' and 185 lbs, but quite muscular.<br>\r\n<br>\r\nDesiree - Connor's girlfriend. She is very active and into sports and plays volleyball and runs track.<br>\r\n<br>\r\nCory - One of Connor's close friends. He is a wrestler and is very macho. He is a jock and a party boy. He is about 5\"7' and 155 lbs of lean muscle.<br>\r\n<br>\r\nDanny - Another good friend of Connor. He is rather shy and plays soccor. He is about 5\"9' and is a 160 lbs, but has a soft belly forming.<br>\r\n<br>\r\nIf you like the story please add. Keep the story going, just keep the focus on weight gain, in anyway you want (It's interactive for a reason, take it where you want, but please no killing off of main characters.)</td>",
        "id":1436808,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1465459860,
        "modified":1465459860,
        "pretty_title":"The Stout Swimmer"
    }
}