{
    "chapters":{
        "1":{
            "author_id":"sally3",
            "author_name":"Sal3",
            "choices":[
                "Who will suggest a game ?",
                "Tyler sets up the game",
                "You draw your brothers together.",
                "Some boy cousins come over to play as well."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your mother and sister has gone over to mom's sisters for the weekend and left your older brother Tyler in charge of You and your younger brother Syd.</span></div></span></div>",
            "created":1598072400,
            "id":2889519,
            "title":"Boy's only night"
        },
        "12":{
            "author_id":"sally3",
            "author_name":"Sal3",
            "choices":[
                "Ty talks to Syd",
                "All agree and start playing",
                "Syd wants to go first",
                "Tyler suggested paper, rock & scissors to see who goes first",
                "More Ideas / Choices"
            ],
            "content":"<div class=\"\"><div> <span>After about half of the first day had passed, our older brother Tyler came into my room, \" hey what's up Johnny ? I was thinking that you, me and Syd could play a game. ..\" I looked at my big brother Ty and smiled as I said \" a game would be cool Ty, have you talked to Syd yet ?  What kind of game were you thinking about big brother ? \" .<br>\r\n<br>\r\nTy stood there thinking and suddenly his eyes shit open wide as he said \" Let's all play truth or dare, but the adult version since mom and dad wont be back for a good while \" looking at him grinning I said \" what is the adult version Ty,  will we have to do stuff to each other ? \" as it was now my turn to smile and grin, \" Well I am definitely in Ty but you need to talk to Syd first and let him know that all dares will be anything that we say.<br>\r\n<br>\r\nI watched Tyler smile and walk out of my room and into Syd's room, I was already thinking about my first dare I will give ....</span></div></div>",
            "created":1599541200,
            "id":2899408,
            "title":"Tyler sets up the game"
        }
    },
    "info":{
        "author_id":"sally3",
        "author_name":"Sal3",
        "brief_description":"The boy's in the Donner family plays truth or dare together.",
        "created":1598108160,
        "description":"<td align=\"left\" class=\"norm\">Only male Donner family plays a game of truth or dare.<br>\r\n<br>\r\nNo vore or gore, no toilet stuff.<br>\r\n<br>\r\nIncest and oral is great !</td>",
        "id":2230134,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1599565200,
        "modified":1599565200,
        "pretty_title":"Family Truth or Dare "
    }
}