{
    "chapters":{
        "1":{
            "author_id":"mystewriter131",
            "author_name":"Mystewriter",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before we get into the story itself, are you going to be a male or a female?</span></div></span></div>",
            "created":1464325200,
            "id":2154682,
            "title":"Choice 1 (Gender)"
        },
        "11":{
            "author_id":"mystewriter131",
            "author_name":"Mystewriter",
            "choices":[
                "Erik",
                "Andy",
                "James",
                "Kenny",
                "Tyler"
            ],
            "content":"<div class=\"\"><div> <span>  The next choice; what type of body do you have?<br>\r\n<br>\r\n<br>\r\n1) Erik<br>\r\nShort, messy jet black hair | Deep green eyes | 5'6\" | Tan skin | Toned body | 7\" dick<br>\r\n<br>\r\n2) Andy<br>\r\nMedium-length, strawberry-blonde hair | Grey-blue eyes | 5'9\" | Olive-tone Skin | Lanky | 4\" dick<br>\r\n<br>\r\n3) James<br>\r\nCurly brown hair | Brown eyes | 5'3\" | Pale Skin | Mildly Chubby | 6\" dick<br>\r\n<br>\r\n4) Kenny<br>\r\nEmo-style light brown hair | Blue eyes | 5'5\" | Fair Skin | Average build | 5\" dick<br>\r\n<br>\r\n5) Tyler<br>\r\nShaved blonde hair | Brown Eyes | 6'1\" | Mildly tanned skin | Muscled Build | 9\" dick</span></div></div>",
            "created":1464325200,
            "id":2154684,
            "title":"Choice 2 (Body Type)"
        },
        "111":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "Mom",
                "Dad or someone else"
            ],
            "content":"<div class=\"\"><div> <span>Erik was always a athletic boy, which left him with a toned body. Though he didn't follow sterotypes.<br>\r\n<br>\r\nHis favorite type of media was anime, and several other things. Currently he was on his computer playing a erotic game called corruption of champions.<br>\r\n<br>\r\nHe minimized his browser when he heard someone walking in who was it?</span></div></div>",
            "created":1470370860,
            "id":2191330,
            "title":"Erik"
        },
        "1111":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "Bigger tits on his mom",
                "His mom becomes a tigershark girl from coc",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>It was his mom,  \"what are doing?\" Asked his mother. \"I was just watching some youtube videos mom.\" Erik said.<br>\r\n<br>\r\n\"Alright. I'll be down stairs if you need me.\" She said as she left. Erik nodded he felt bad for his mom. His dad had left them when they were younger, so it had been mostly his mom and him. <br>\r\n<br>\r\n\"If only  I could do something.\" Said Erik to himself as he got up from his seat and headed downstairs.<br>\r\n<br>\r\nErik saw his mom watching TV. \"I wish she was younger.\" Erik thought. As that thought happened Erik mom moaned.<br>\r\n<br>\r\nFrom what Erik saw his mother skin was gaining it's youth, he could see his mother crows feet changing, becoming sexy and daity and smaller.<br>\r\n<br>\r\nSoon his mom looked younger. Erik suprised asked himself if he did, deciding to test it out. He wished<br>\r\n</span></div></div>",
            "created":1470771240,
            "id":2193596,
            "title":"Mom"
        },
        "11112":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "Izma tigershark",
                "No just a normal tigershark girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Not just any tigershark how about izma, or not.</span></div></span></div>",
            "created":1475171760,
            "id":2216526,
            "title":"His mom becomes a tigershark girl from coc"
        },
        "111121":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "She goes to look for some new clothes.",
                "She lustfuly looks at her former son."
            ],
            "content":"<div class=\"\"><div> <span>\"I wish my mom became izma from corruption of champions.\" Eric said.<br>\r\n<br>\r\nHis mother moaned her height increased to six foot two, her clothes were ripping.<br>\r\n<br>\r\nShe moaned more rubbing her crotch, as something pushed outwards.<br>\r\n<br>\r\nShe undI'd her pants to show her panties had ripped, and what was pushing out was a cock, Eric could also see a ball sack forming.<br>\r\n<br>\r\nHer skin started to turn orange with black horizontal stripes appearing, her lower half became even more sexy,<br>\r\n<br>\r\nShe rolled onto the floor moaning ass pointed to the air as a shark tail pushed it's way out,  it was the same color as erics mother new skin color. It even had horizontal black stripes.<br>\r\n<br>\r\nEric saw a dorsal fin push it's was out between his mother shoulder blades.<br>\r\n<br>\r\nSoon his mother looked like and sounded like izma.<br>\r\n<br>\r\n\"My head hurts, do i have two separate memories, yes I do.\" Izma said to herself she looked at her son or should it be former son.<br>\r\n<br>\r\n\"I don't know what you did, but I love it.\" She said.<br>\r\n<br>\r\nWhat happens next.<br>\r\n<br>\r\n</span></div></div>",
            "created":1476750480,
            "id":2224737,
            "title":"Izma tigershark"
        },
        "1111212":{
            "author_id":"tailxshepard",
            "author_name":"fire",
            "choices":[
                "Yes",
                "No "
            ],
            "content":"<div class=\"\"><div> <span>Izma looked lustfuly at her former son \"this is so much better then being a boring old mother.\" She said \"I'm going to repay you.\"<br>\r\n<br>\r\nEric told izma to wait a second to which she did, Eric  wished he was the same height as izma.<br>\r\n<br>\r\nHe grew taller clothes ripping till he was six foot two, he undressed leaving him completely naked.<br>\r\n<br>\r\nIzma walked over to Eric and kissed him on the lips. She rubbed his cock and gently forced him to lay down.<br>\r\n<br>\r\nPositioning herself right above his erect dick, she slid down on to it earning moans from eric. \"Im loving this new look, the silver hair is a nice touch by the way.\"<br>\r\n<br>\r\nShe started to bounce up and down, they fucked for hours on end.<br>\r\n<br>\r\nIzma walked into the shower her lower half covered in sticky cum. <br>\r\n<br>\r\nAs she washed herself did Eric walk in.</span></div></div>",
            "created":1476751500,
            "id":2224746,
            "title":"Some good old sex"
        },
        "113":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Make Melisa hot and sleep with everyone and everything",
                "Curb stomp that asshat Sean.",
                "Grab that cunt Barbara by the cunt."
            ],
            "content":"<div class=\"\"><div> <span>You wake up to find that you have infinite power. You don't know where it came from but now you're all powerful. What to do now... Oh you know! You're gonna use it for sex! That'll be fun! Or you could take your revenge on those assholes who mocked your weight. You're only MILDLY chubby but everyone at school insist that you're fat. You could also have sexy revenge on people. Yes sexy revenge sounds pretty good. So you work out who would be the head of your harem, who your first victum would be and who your first vengeance inspired sex slave would be. <br>\r\n<br>\r\nThe second in command would probably be Melisa Wright. She's usually nice to you but she is very ugly. You can change that now so it doesn't matter, but you cannot stress enough how unappealing she will be without your help. <br>\r\n<br>\r\nThe first target for your revenge would obviously be Sean Stevenson. He beats the shit out of you everyday. literally he sells tickets to have people watch as he keeps whaling on you until you shit your pants. So you know, he's on the list.<br>\r\n<br>\r\nIf you wanted to have vengeance while getting laid with every beautiful women you can find, your first target would be Barbara Petal. She's the hottest lesbian in the world with her gloriously giant tits, her mostly slim waste and her perfect ass.  Her long red hair looked as soft as her perfect skin must feel. Her brown eyes were as alluring as her tongue is sharp. Unfortunately she was a bitch, and she's not even into guys anyway. But now you can change that, to whatever extent would make you feel great and her feel the pain she has inflicted upon you seven fold. <br>\r\n<br>\r\nSo what's your choice?</span></div></div>",
            "created":1526448660,
            "id":2493851,
            "title":"James"
        },
        "12":{
            "author_id":"mystewriter131",
            "author_name":"Mystewriter",
            "choices":[
                "Jessica",
                "Taylor",
                "Brittney",
                "Elizabeth",
                "Analise"
            ],
            "content":"<div class=\"\"><div> <span>The next choice; what type of body do you have?<br>\r\n<br>\r\n<br>\r\n1) Jessica<br>\r\nLong, blonde hair | Green Eyes | 5'4\" | Tan Skin | Toned Body | D-cups | Bubble butt<br>\r\n<br>\r\n2) Taylor<br>\r\nShoulder-length brown hair | Brown Eyes | 5'6\" | Pale Skin | Average body | B-cups | Flat butt<br>\r\n<br>\r\n3) Brittney<br>\r\nWaist-length black hair | Brown Eyes | 5'2\" | Olive Skin | Plump body | D-cups | Large butt<br>\r\n<br>\r\n4) Elizabeth<br>\r\nKnee-length, natural-red hair | Blue eyes | 5'7\" | Fair Skin | Thin Body | A-cups | Small Butt<br>\r\n<br>\r\n5) Analise<br>\r\nShoulder-length, dark blue (dyed) hair | Green Eyes | 5'5\" | Pale Skin | Average Body | C-cups | Plump butt</span></div></div>",
            "created":1464325200,
            "id":2154685,
            "title":"Choice 2 (Body Type)"
        },
        "123":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Getting revenge against Tyler, your step brother",
                "Going to class, of course",
                "Getting revenge on people from highschool "
            ],
            "content":"<div class=\"\"><div> <span>You were Brittney, the beautifully plump short girl. Sporting a beautiful set of olive skin, you found yourself at the moment in the bathroom, getting ready for yet another day at your community college.<br>\r\n<br>\r\n As with most mornings, you were standing in front of the bathroom mirror, taking in your curvy form. Aside from a bit of extra flab on your thighs and belly, you're an overall sexy beast thanks to your bountiful bust and wide, thick butt. It was the kind of body girls envied, but in truth, you hated it. Not because of the body itself (you felt like pure hotness) but because of the reactions you got.<br>\r\n<br>\r\nAll throughout high-school, you had to deal with the fallout of having such an overtly sexual figure. Even when all you wore was a simple t-shirt and jeans you could feel the sexual leers from the guys in the hallway. Everyday you had to deal with their stupid comments and \"accidental\" mistakes that just so happened to have them bump into your chest or backside. Sometimes they weren't even that subtle and just took to flicking coins or other small objects in your exposed cleavage like a sexy carnival game.<br>\r\n<br>\r\nJust thinking about your treatment made you fuming. So mad you were that you failed to notice the water that had splashed onto the outlet. A deadly surge of electricity blasted through your body as you went to plug in the hairdryer, nearly killing you. Or so you thought. It was this shock that revealed to you the new powers you had gained overnight, allowing you to change anyone or anything to your will.<br>\r\n<br>\r\nTesting it out (though not test was required, for truly you were aware of the full extent of your abilities), you immediately willed your hair dry and it was so. With a smile on your face, you marched out of the room, intent on...</span></div></div>",
            "created":1464411600,
            "id":2155175,
            "title":"Plump Brittney"
        },
        "1231":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Gave yourself an even bigger dick than his and fucked him.",
                "Gave yourself some muscles and beat the crap out of him.",
                "Turned him into a perfectly tailored set of underwear"
            ],
            "content":"<div class=\"\"><div> <span>You stomped through the hallway, your mind focused on revenge against your step-brother. For years you've had suspicious about Tyler, your handsome and tall stepbrother. You would catch him so often staring down your shirts and even caught him \"accidentally\" walking in on you in the shower a few too many times. You brushed these off but now, thanks to your powers, you knew he was just being a pervert. Like every other guy you knew.<br>\r\n<br>\r\nBeyond that, your omnipotence made you aware of other things he had done in secret. It seemed your brother was a bit of a celebrity on the erotic blog sphere; he had made videos involving you for years. He would hide cameras in your room and post vids of you undressing or masturbating. Some days he would sneak into your room while you were gone and rub his cock all over your clothes. Perhaps most devilish of all, he would wait until you weren't looking, taking your left out drinks and jerk off into them, only to return them and observe as you unknowingly guzzle down his semen.<br>\r\n<br>\r\nAnger swelled within as you stormed into his room, unlocking the door with a touch. Tyler was beating his 9'' dick when you walked in, fittingly enough to one of those very videos.<br>\r\n<br>\r\n\"H-hey!\" He yelled, his fist grappled around the base of his meaty member, \"I-I'm busy!\"<br>\r\n<br>\r\nHe wanted to cover himself, but you refused, forcing him to freeze in place.<br>\r\n<br>\r\n\"So you think taking videos of me is funny, do you?\" You asked. \"Treating me like a sex toy? All because of these?\"<br>\r\n<br>\r\nYou squeezed your tits together and realized you'd never changed. You were still buck-naked from your morning routine, making this situation all the weirder. You could sense the fear in Tyler.<br>\r\n<br>\r\n\"Not just those. Your ass too,\" Tyler said, his face going white with despair. In truth, he didn't mean to say that, but you were forcing him to tell the truth. The mental anguish he felt was palpable.<br>\r\n<br>\r\nAs fun as mental torture was, you wanted to do something a little more substantial. Something worthy of your powers. With a cocked grin, you...</span></div></div>",
            "created":1464437520,
            "id":2155179,
            "title":"Tyler, Your Pervy Stepbrother "
        },
        "12311":{
            "author_id":"boboceanbob",
            "author_name":"ThatGuy",
            "choices":[
                "revenge on more people",
                "go to class"
            ],
            "content":"<div class=\"\"><div> <span>You smile as you will a monster dick to your crotch.  Its 18 inches long and as think as your arm.  \"WHAT THE HELL?!?!\" Tyler yells as he tries to become one with the wall.  You turn his dick into a small, tight vagina and laugh as he notices the change.  You walk over, put him on all fours and start pounding his new vagina.  <br>\r\n<br>\r\nYou quickly start slamming your dick into him with such force, Tyler's head hits the wall with each thrust.  \"Can...you...please stop?\" he begs through each headbutt on the wall.  \"Shut up!\" you growl as you will his mouth gone, leaving just smooth skin behind.  He starts to cry because of a mixture of mental and physical pain.  You smile as you start to dump gallons of cum into him.  You pull out and hear him sigh with relief.  \"You think I'm done?\" you laugh as you plunge your third leg into his butt filling him with more cum.  <br>\r\n<br>\r\nYou look at your cum soaked brother and say \"I'll give you your mouth back but you will only beg for sex.  Oh and turning anyone down either.\"  You walk out of his room and start to think about the rest of your day.   </span></div></div>",
            "created":1464835080,
            "id":2157487,
            "title":"Gave yourself an even bigger dick than his and ..."
        },
        "123112":{
            "author_id":"boboceanbob",
            "author_name":"ThatGuy",
            "choices":[
                "Mess with her more",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You quickly finish your routine and head to car for class.  As you pass your brother's room, you hear him say \"Brittney I am sorry, please f-f-fuck my ass.\"  He clamps his hand over his mouth and runs back to his room to hide for the rest of the day.  You chuckle to yourself as you get in your car and head to class.   <br>\r\n<br>\r\nYou walk into the huge lecture hall and sit down on the side remembering the satisfaction of your morning.  Your thoughts are quickly interrupted by the rude preppy girl behind you.  Stephanie, she is a short fit girl with long brown hair and assets that she loves to show off with some tight clothing.  She is chatting quite loudly with her sorority sisters about her list of trivial problems she has today.  You decide to give her a reason to complain.   You will everyone is class not to notice any changes you make to Stephanie and you start her changes by slowly removing her right hand.  <br>\r\n<br>\r\nAbout 10 minutes into class, she screams \"WHERE IS MY HAND?!\"  Her friends start laughing.  \"Good one Steph.\" one says in between snorts.  You will her entire right arm to disappear and she freaks out even more.  Noticing the disgust from the professor and the chuckles from the class, she quickly grabs her things and leaves.  <br>\r\n<br>\r\nAfter class you go to the bathroom and find Stephanie still freaking out about her arm.  </span></div></div>",
            "created":1466711340,
            "id":2169481,
            "title":"go to class"
        },
        "1231121":{
            "author_id":"boboceanbob",
            "author_name":"ThatGuy",
            "choices":[
                "Mess with the next person you see",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You walk up to Steph and say \"Listen, I'll give you your arm back on one condition.  You have to get someone off once a day.  Man or woman, I don't care but as long as you get some one to that big O everyday, you will have your right arm.  Fail to do so and your arm will disappear.\"  Steph looks at you with rage and panic then screams \"Bitch I don't know what you are talking about but I have bigger issues.\"  As she finishes her sentence, you will away everything below her boobs.  As she hits the bathroom floor with a startled yelp, you tell her \"Along with my rules of getting someone off, you do not count.  Am I clear?\"  She looks up at you and weakly says \"Crystal.\"  \"Good\" you reply, willing back her body minus her arm.  \"Now\" you say willing yourself naked and sitting up on the sink \"Make me cum for your right arm back.\"  <br>\r\n<br>\r\nStephanie dives mouth first into her duty.  You grab her head holding it there.  At first its just relaxing but then she finds your clit.  She flicks her tongue until you get a small orgasm.  \"I'll count it.\" you say pushing her head away as you will your clothes back.  \"Remember, tomorrow you need to get someone to cum by midnight or that arm will disappear again.\"  Steph nods and quickly runs from the bathroom while her mouth is still covered in your juices.  You chuckle to yourself thinking how much you love your powers.  </span></div></div>",
            "created":1475007960,
            "id":2215565,
            "title":"Mess with her more"
        },
        "12311211":{
            "author_id":"boboceanbob",
            "author_name":"ThatGuy",
            "choices":[
                "next class",
                " continue revenge on others"
            ],
            "content":"<div class=\"\"><div> <span>As you leave the bathroom, you see the jerk frat guy that embarrassed you.  You two hooked up after a party but he stole your clothes the next morning and made you walk home in just a guys t-shirt.  You smirk as you will his clothes to disappear.  Everyone walking by starts to snicker and you yell \"Hey! In here!\"  You hold the bathroom door as he rushes into the first stall.  \"Thanks\" he says behind the locked door.  \"Name is Tyler, what's yours?\"  You smile as you think of a fitting punishment for him.  \"Brittney.  Weren't you at the soccer house party last week?\" you ask with an even bigger smile on your face.  <br>\r\n<br>\r\n\"Yeah I was...\" he replies with his voice fading as he remembered you.  \"I'm sorry for-\" he was cut short as you will the door to blow open and his naked self to float up in front of you.  \"Too late you dick.\" you shout.  \"But what to do with you...\"  You walk around his naked form and then get an idea.  \"Since you are such a dick, yours will now be forever hard, swollen and hyper sensitive.\"  you say watching his impressive member harden.  \"Please st-\" he is silenced after you will his mouth away.  <br>\r\n<br>\r\n\"Oh lets make this bigger.\" you say as you grab his dick.  Tyler's junk starts to grow.  In a few seconds, Tyler has a 20 inch dick that is 8 inches around.  You give him back his mouth and say \"Alright, you have a monster dick that will never see another release but will forever tease you.  Oh you won't get used to the feeling anytime soon either.\"  \"But i need clothes\" he says meekly.  \"Fine you get clothes.\"  as you will him dressed in a very slutty school girl costume.  <br>\r\n<br>\r\nYou set him down and look at your work.  There is a 6ft 2in Tyler in a tied off white blouse with black bra under it.  He is wearing a short green skirt with white stockings.  To top his look off, you gave him 9 inch heels and panties with a vibrating butt plug turned up to 11.  \"Have fun\" you say as you leave the bathroom.  </span></div></div>",
            "created":1479949260,
            "id":2241088,
            "title":"Mess with the next person you see"
        },
        "123112111":{
            "author_id":"boboceanbob",
            "author_name":"ThatGuy",
            "choices":[
                "Mess with Beth after class",
                "go home"
            ],
            "content":"<div class=\"\"><div> <span>While walking to your last class of the day, you spy a guy trying to get a up-skirt shot of a tiny Asian standing near him.  \"Well if wants to see panties so much, lets make him some.\" you think as you will the pervert into the Asian girls underwear.  You laugh as you listen to his thoughts as he tries to figure out what happened.  <br>\r\n<br>\r\n\"What are you laughing about tubby?\" snaps the model like figure walking in front of you.  You smile a mischievous smile and reply \"Oh hey Beth, I was still laughing at that nude guy running around the building earlier.  Looked a lot like you.\"  \"Oh shut up bit-\" Beth is cut short by the professor who sternly says \"Sit down and finish your argument later.\"  You quickly sit down and Beth walks a few rows ahead of you and takes a seat.  <br>\r\n<br>\r\nAbout halfway through class, you get an idea on how to mess with Beth.  First you change Beth's clothes to a headless full body spandex body suit.  Then, every time the professor paused or used a filler sound like uh, she would gain a pound.  After about 15 minutes you see Beth has gained a good amount of weight.  You decide to up the torture and snap on a chastity belt that would grow with her and a bullet vibrator sealed in her vagina.   You chuckle at your handwork as she squirms in front of you.  </span></div></div>",
            "created":1482114180,
            "id":2251773,
            "title":"next class"
        },
        "1231121111":{
            "author_id":"boboceanbob",
            "author_name":"ThatGuy",
            "choices":[
                "Distraction",
                "Home"
            ],
            "content":"<div class=\"\"><div> <span>You stop Beth's weight gain after class.  She looks to be around 100 lbs heavier.  You then follow her back to her dorm to mess with her a bit more.  On the way there you entertained yourself by changing where her new weight was located.  You started on her chest watching it blow up to unheard of sizes.  Beth spent a few minutes crawling because of the monstrous mammaries.  As she started to go through the door to the building, you shift all the weight to her lower body.  You laugh as she struggles with her huge legs rubbing against the chastity belt. The last thing you do is shift all her new weight and then some to only her limbs.  Her legs below her butt and arms are now 50 lbs each.  You laugh as you head home.  </span></div></div>",
            "created":1489524660,
            "id":2289695,
            "title":"Mess with Beth after class"
        },
        "12311211112":{
            "author_id":"boboceanbob",
            "author_name":"ThatGuy",
            "choices":[
                "Help people",
                "Fufill all fantasies.  "
            ],
            "content":"<div class=\"\"><div> <span>As you head to your car, you notice 3 girls picking on a smaller girl.  The smaller girl was a genius who starting college at 15.  The 3 girls were jealous and were trying to bully her out of college.  You stop and decide to make the smaller girl a double threat, super smart and physically perfect.  You take the 3 girls and combine their bodies with the little girl.  The little girl didn't change much.  She would become much more attractive later in life.  <br>\r\n<br>\r\nYou get in your car, hoping that your power doesn't get too out of hand.  As you drive home, you change yourself a bit.  All you did was make yourself a bit more average looking.  But you felt something was missing.  A snap thought to the morning causes you to will a dick where your clit was.  It would grow to the same size as this morning but for now it is just a 1 inch soft nub.  You smile and think of your next step.  </span></div></div>",
            "created":1496767200,
            "id":2332092,
            "title":"Home"
        },
        "12313":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "You played with your own form.",
                "You paid mother a visit"
            ],
            "content":"<div class=\"\"><div> <span>Even now, you could feel the purity of his libido. His fear couldn't erase the glances of lust at your chest and hips. He wanted so badly to embrace your form and grasp your sexy figure. Not wanting to disappoint, you decided to do just that, but in a way he wasn't expecting.<br>\r\n<br>\r\nWith a lick of your lips you approached, making sure to add a little extra bounce in your step to make your flesh jiggle in all the right place. You bent right beside his cock, allowing your breathe to tickle the erect member. The blood pumped furiously through its veins as you came closer and closer to fulfilling his dirty pervert dreams. Unfortunately for him, this is as close as you'd come.<br>\r\n<br>\r\n\"You want my body so much, Tyler?\" you asked. \"I'll make sure you get a close a view as possible!\"<br>\r\n<br>\r\nWith a snap of your fingers (though that was actually unnecessary) the first of what would be many transformations began. As a joke, you started with his dick; It rapidly shrunk, rocketing down into his own body and disappearing into his crotch area along with his swollen balls. Seeing his member evaporate forced out a half echoed scream, for his mouth too had begun to fuse shut.<br>\r\n<br>\r\nHis limbs were next, following in the same vein as his dick as his clothes literally disappeared into thin air, leaving him nude (not that there was anything left to see). Even his head went away, leaving only his chiseled torso to fall helplessly onto the bed. That was not the end, though, as it continued to change, his flesh turning purple and soft as silk. <br>\r\n<br>\r\nBefore long all that was left was a wonderful pair of silk panties and matching bra, perfectly fit for your goddess figure. You slipped them on, enjoying how snug they hugged you. Tyler, to both his pleasure and dismay, was left entirely aware. He could see, smell, taste, hear, and feel everything in the immediate vicinity. <br>\r\n<br>\r\n\"Thanks for the help, little bro!\" You joked, looking over your body in the mirror. The bra was really something else; the perfect kind of push up that made your breasts looking even larger without the discomfort.<br>\r\n<br>\r\nThat's when it hit you. You could have modified yourself a little bit, molding your form into one more agreeable. Then again, lust for revenge was still overwhelming you and punishing your mother for her transgressions was something you wanted to do as well. In the end... </span></div></div>",
            "created":1464438300,
            "id":2155181,
            "title":"Tyler's Inanimate Transformation"
        }
    },
    "info":{
        "author_id":"mystewriter131",
        "author_name":"Mystewriter",
        "brief_description":"People always want the power of change, and you have it now! Just not how you meant it...",
        "created":1464333120,
        "description":"<td align=\"left\" class=\"norm\">Summary:<br>\r\n  People always want the power of change, and you have it now! It's just not really how you meant it. Instead of the power to convince the masses through good speech and effort, you now appear to be able to modify the bodies and minds of those around you, with little to no downside for yourself.<br>\r\n  There don't appear to be any rules to this, you simply wake up one morning and find yourself with this power.<br>\r\nThe only role-play rules are as follows.<br>\r\n1) Keep your addition legible and more than a few sentences; if you need to add a \"More options...\", you may, but try to keep them down by substituting in a [Reader's Choice] where possible. This is to reduce the number of short chapters and increase the number of story chapters.<br>\r\n<br>\r\n2) Try not to ruin the story. This is things such as killing off the main character to make a more desirable one; you can change up the main character but if I find multiple chapters in a row that contradict the previous change-wise, I may remove them. It's not a definite, but it's not interesting to have your character or another strictly go C's&gt;D's&gt;C's, and have that be the focal point of the chapter.<br>\r\n<br>\r\n3) Have fun! I'm not going to shame fetishes here, so you can go for anything you want; I have a different story with a bit more of a limit, but here anything is allowed.</td>",
        "id":2085491,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1526448660,
        "modified":1526448660,
        "pretty_title":"Power of Change"
    }
}