{
    "chapters":{
        "1":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "The LSS Aspiration Sets out."
            ],
            "content":"<div class=\"\"><div> <span>Note if you just want to read the story feel free to skip this background info. If you want to add a chapter though you'll probably need to go through it. Enjoy!<br>\r\n<br>\r\nThe story is set in the year 2209 AD, over 100 years after a nuclear war on Earth. A few 'Off Earth'  colonies have struggled back from nuclear apocalypse and civilisation is now centered on these colonies. On Earth almost no-one survived the war, and the remainder are back in stone age tech. There are always rumours of old spaceships, bases or robots ships roaming about, left over from before the war, but most people rate these stories at the same level as bigfoot and UFOs are in the modern world. Certainly no government has admitted to finding any evidence of these. No-one knows if the pre-war governments ever sent a ship beyond the solar system.<br>\r\nThe various current national groups around in the solar system now are:<br>\r\nMartians, proud pioneers, a hodgepodge of different central bases and huge numbers of ungoverned outposts. Think Wild West with a disorganized, multinational government that quarrels constantly.<br>\r\nJovian Assembly, the remainder of several corporations that had bases at Jupiter when the war broke out. Possibly the most advanced culture, but only because they kept old tech going.. now very little of it is understood but the old automated factories still produce pretty well... for now. Their government is rigid and personal freedoms are few, but tales from those few that leave Jupiter have painted a surprisingly content people. Maybe they just don't know what freedoms they are missing!<br>\r\nFinally the four Lunar bases, loosely allied into a Federation. The bases here were founded by the US, Japan, European Union and Russia and have a long tradition of grand engineering works. They think big and bulky, a little lighter on safety than other nations, but they get things done, usually with a string of patriotic messages after a success, very little after a failure (Similar to the later years of USSR, though not as draconian).<br>\r\nThe Lunar nation is where a scientist discovered a method of inflating Quantum wormholes up to a useful size to travel through, albeit at a huge energy cost to keep them open.<br>\r\nThe prototype generator was so large that an idea for making a computer controlled 'probe' to test it was discarded early on. Instead a large crewed ship was built, taking over six years to complete. By that time Lunar factories were building smaller versions of the generator, making some people claim that the 'Great Project' is a waste of time. These small drives are too inaccurate for interstellar travel, but have greatly decreased the time taken to move around the solar system.<br>\r\nAmidst controversy over the 'Great Project', increased tension between the three major powers now that travel times have been drastically reduced, and fears that other nations are secretly building their own wormhole starships, the Lunar Fleet Command has rushed the ship to completion and drummed up a skeleton crew for it's maiden voyage. They hope it's first trip will discover enough (and be a good enough spectacle for the people) to validate the time and effort to build it, and persuade the economic council to put money down on further research and construction.<br>\r\nThey named the ship LSS Aspiration.<br>\r\nOn August 2nd 2209 AD it climbed into Lunar orbit and made ready for the first jump to the stars.<br>\r\n<br>\r\n(Note feel free to add anything but try to keep to the general feel of the background, don't introduce any 'magical' technology, and keep the main characters (Lindhurst, Abi and Brandt) as much in char as possible.)</span></div></div>",
            "created":1121536560,
            "id":261728,
            "title":"Historical Background."
        },
        "11":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "They are hailed in English. Who is out here?",
                "Charting the area they find an earth type world.",
                "Only asteroids around this sun. Recharge then move on.",
                "It was sabotage! Security just caught someone.",
                "Scanners show a ship, but it's not human built!"
            ],
            "content":"<div class=\"\"><div> <span>In the dark, perpetual night of space a crescent arc of brightness slides, seemingly effortlessly through the void. Puffs of vapor spray and it starts to spin slowly, like a whale turning languidly around by it's flukes. Seen closer the whole outline of it becomes clear; a large sphere, over a hundred feet wide, the dull white hull reflecting the sharp light of the distant sun. Closer still, near one end of the giant white globe, dull orange lights shine through ports, outlining three shapes as they huddle over controls, two of them quietly speaking.<br>\r\n\"Primary drive feeds... check\"<br>\r\n\"Rotation secure, on line for forth burn. Holding for checklist.\"<br>\r\n\"Reactors... 1 through 5 online. Still getting the flicker on 6.\"<br>\r\n\"Heat distribution stable. Hull map within 5% of expected conditions.\"<br>\r\n\"Prime coolant lines... check, Reactor 6 online, I'm keeping the inhibitors on standby and flush systems warmed up.\"<br>\r\n\"Life-support tank shows green. Primary feeds clear.\"<br>\r\n\"Captain? Comm-line from LFC. I think it's Admiral Benning.\"<br>\r\nThe third figure hunches forward in his seat, tapping controls on his chair while the other two continue the checklist. Gray hair is visible under his peaked light blue cap. Lines cross his face lending a severe feel to his face which his cold gray eyes do nothing to disway.<br>\r\n\"Admiral. Captain Lindhurst reporting. Orbit burn successful and we are now lining up for our starting run.\"<br>\r\nOn a small monitor in the chair's arm a wavering image appears of a dark haired woman with similar military style clothing to the Captain. Her expression is just as severe, though her more youthful features don't carry it as well as his.<br>\r\n\"I take it the Nuke drives worked well then?\" she said, her clipped speech given at a rapid fire pace.<br>\r\nCaptain Linhurst's mouth tweaked in what might have been mistaken for a smile for a moment. \"The 'Nuclear Thermal Rockets' worked better than in tests Admiral. We still have over seventy eight percent of our fuel reserve remaining, thanks in no small part to Chief Engineer Timmins and his staff.\"<br>\r\nA faint smile came from one of the two figures infront of the captain. The other leant over to him and mouthed 'Don't let it go to your head!' before returning to her check list.<br>\r\n\"Good, good. How long till you can fire up the WG?\"<br>\r\nThe Captain paused for a moment, reading displays infront of him and listening to the continuing checklist.<br>\r\n\"I think in about half an hour, though I'll get back to you after I've spoken to our resident genius in the control booth. Was there anything else Admiral?\"<br>\r\nThis time the Admiral paused, frowning as she stared at the camera intently.<br>\r\n\"No Mike, just the formal 'God's speed'... and take care of yourself out there!\"<br>\r\n\"Will do Admiral.\" he said, and saluted to the camera by the screen. \"I'll be back in touch tomorrow. Keep your ears open.\"<br>\r\nAnother smile from the Admiral and the screen went blank.<br>\r\n\"I suppose I have to check on Professor Abi now.\" The Captain said, jovially as he stood up. \"If I'm not back in ten minutes send a team to extract me!\"<br>\r\n\"Good luck!\" muttered Timmins.<br>\r\nThe Captain self-consciously straightened his light blue uniform, brushing the braid slightly. With a sigh he nodded to the two at the controls and headed out of the bridge aft ward.<br>\r\nTimmins turned to his companion with a smile.<br>\r\n\"Fifty Creds says he doesn't last five minutes.\" he said, pushing a button on his panel and hearing the hiss of an intercom engage.<br>\r\n\"You're on!\" said his partner with a grin.<br>\r\n\"Sometimes I wonder about you Liliya. Don't you ever get tired of losing?\"<br>\r\n\"Dream on Sam! The Captain's made of stern stuff!\"<br>\r\n\"Maybe, but Kazuko's made of diamond!\"<br>\r\n<br>\r\n*******<br>\r\n<br>\r\nCaptain Michael Richard Lindhurst, veteran of the Lobar riots, New London evacuation, and even the Trent assault on Mars stood outside the laboratory door and tried to calm himself. Nervously he tipped back and forth, feeling the pull up and down shift in the familiar twist of the artificial gravity. Soon this section would have to stop rotating and he'd get the usual reports afterwards of ailments from various new crew members that hadn't got their space legs yet. Personally he preferred zero gravity, it made it so much easier to hide nervous fidgeting... if you had enough practice.<br>\r\nWith a sigh he put his 'Stern Face of Authority' look on and pressed the buzzer.<br>\r\n\"Not now!\" came the short response followed by the click of the intercom switching off.<br>\r\nGritting his teeth Captain Lindhurst took out his override key and opened the door manually. The laboratory was cramped, with benches on every wall and one down the middle of the room. Two people were here, both in white lab coats. One was a small boy, maybe seventeen with thick glasses, the other was a six foot, stern looking woman with a permanent scowl on her face.<br>\r\n\"Miss Abi, we...\"<br>\r\nShe interrupted him with a raised hand, not even looking at him as she continued to peer into a monitor.<br>\r\n\"Raise beam levels by 2%\"<br>\r\n\"MISS ABI,\" the Captain said between grated teeth, \"We are in position fo..\"<br>\r\n\"I SAID 2% Sedwick! That's better. Get me the data sheet for that run.\"<br>\r\nFor a few seconds the Captain counted in his head, trying to calm down before speaking.<br>\r\n\"We are in pos..\"<br>\r\n\"Yes Lindhurst. What?\" she said, staring at him unblinkingly.<br>\r\n\"We are in position.\" he said slowly \"How soon can the generator be ready?\"<br>\r\nFor five seconds her stare bored into him, making him feel like an insignificant speck. This was worse than the retrieval at Sanalos bay!<br>\r\n\"I said it would be ready and it will be ready on schedule, Captain.\" she said.<br>\r\n\"HOW SOON?\"<br>\r\n\"Captain, there is no need to shout!\" she said quietly, still staring at him intently. \"I will warm up the pulse chambers now. You can start creation of the wormhole in twenty two minutes.\"<br>\r\n\"Very w...\" but before he could complete his sentence she had turned her back to him and was peering at another monitor again.<br>\r\n\"Sedwick, get the prime accelerators on-line at 20%.\"<br>\r\nMichael bit his lip and turned away. Somehow he managed to keep from screaming as he headed back to the bridge.<br>\r\n<br>\r\n********<br>\r\n<br>\r\n\"See, told you he'd keep his cool.\" Timmins said as he turned off the intercom to the Lab.<br>\r\n\"Oh right, shouting at her was really cool!\"<br>\r\n\"He didn't blow up, that's what counts.\"<br>\r\nThey both shut up as the door opened behind them.<br>\r\n\"Is the Captain around?\" said the tall newcomer. He was crisp in a gray one piece ship suit, shining boots, black gloves and a gray and black almost peakless square cap on his crew cut blonde hair.<br>\r\n\"He'll be back in a sec,\" said Liliya \"keep your hair on Brandt.\"<br>\r\n\"Very well Lieutenant.\" he said and sat down at the fourth chair in the cramped bridge.<br>\r\nSoon the bridge door opened once more.<br>\r\n\"All right Lieutenant Guzov,\" intoned the Captain as he entered, \"plot our entry angle and get ready to move through the wormhole when the good doctor back there deigns to open it for us. Sound the Cancel Spin alert.\" Liliya Guzov nodded and turned to her console. A low siren sounded three times and a soft recorded voice echoed throughout the ship.<br>\r\n\"Gravity section will cease rotating in two minutes. Fasten down all loose items and stay near handholds till section reaches complete zero gravity.\"<br>\r\n\"OK, Chief Timmins lets have the report on the main drive. I don't want any surprises.\" Timmins nodded and got to work. Then the Captain noticed Lieutenant Brandt. \"Hanz, something wrong at Tactical?\"<br>\r\nBrandt stood and saluted, one hand automatically grasping a hand hold on the wall, staying completely still despite the slowly diminishing gravity.<br>\r\n\"No sir, all systems nominal. I just felt it was wise to have Tactical spread out in case any section of the ship is damaged during transit, Sir!\"<br>\r\n\"Well, I guess Polly can handle Tactical without you for a few minutes. Welcome to the bridge, such as it is.\" he turned his chair forward again looking between Timmins and Guzov, out the viewing ports as the stars turned slowly while they maneuvered. Finally their motions ceased and he glanced at his chair's clock.<br>\r\n\"Just about time, is the feed to LFC live?\"<br>\r\n\"Yes sir.\" reported Timmins.<br>\r\n\"Good, then lets get this show on the road hmm?\"<br>\r\nLiliya Guzov nervously bit her upper lip as she gave commands to the ship, and to the main lab. It seemed Professor Abi was good to her word and the worm hole generators were cranking up. Slowly the field grew and Liliya noted the power drain from the batteries. All seemed in order.<br>\r\n\"There it is!\" the Captain said softly as a dull glow appeared infront of the ship. Slowly it grew and became fainter. The glow was just effects from the generators, the wormhole itself was almost invisible except a lensing effect. The intercom spoke again.<br>\r\n\"Gravity at zero point one Gees, zero point Oh five, zero. Rotating section braked and locked. All crew clear to move.\"<br>\r\nAll the crew on the bridge were strapped in, though The Captain had to remember to press his hat on a little more firmly to keep it there. For the next few minutes the glow infront of the ship spread wider and wider, getting dimmer and dimmer, leaving a patch of darkness growing infront of the ship, occulting the stars and leaving a ring of clustered stars around it.<br>\r\n\"Wish it didn't look so much like a black hole.\" the Captain muttered.<br>\r\nThe intercom beeped and Lindhurst answered it.<br>\r\n\"Bridge, Captain speaking.\"<br>\r\n\"Wormhole at maximum extent.\" Came the crisp tones of Professor Abi \"Energy reserves will hold it for ten minutes. Hole radius is nine hundred and forty meters and holding. You have a 70% clearance around the ship for passage.\" the Captain started to respond but Abi cut in: \"Lab out.\"<br>\r\nThrough grated teeth Lindhurst turned back to the view ports.<br>\r\n\"OK Miss Guzov, you heard the woman, take us through!\"<br>\r\n<br>\r\n*******<br>\r\n<br>\r\nIn the darkness of space the dull crescent of white slid slowly towards the spherical emptiness before it, seeming to twist and bend as it entered, sliding out of sight in a very odd way. After a while it had completely vanished, leaving the Solar System with only the hole it had left through as evidence it was ever there.<br>\r\n<br>\r\n*******<br>\r\n<br>\r\nDarkness was outside the bridge, for a few moments the Captain wondered, had something gone wrong? Then slowly light built up ahead, then spread out into a pattern of stars.<br>\r\n\"OK, easy does it Liliya. Get us clear before shutting it down. How's the feed?\"<br>\r\n\"Sorry sir, lost it half way through, too much distortion.\"<br>\r\nThe Captain sighed, that had been a long shot, most wormholes had far too much distortion to send radio waves through.<br>\r\nAfter a few moments The ship climbed out of the wormhole completing it's first interstellar journey. Lieutenant Guzov's board shifted, orange lights shifting to green, or in one or two cases red.<br>\r\n\"Worm hole generators have been shut down. Engines online.\"<br>\r\nChief Timmins turned to the Captain.<br>\r\n\"Energy bank is at fifty eight percent and charging. Reactors all at 85% power.\"<br>\r\nSlowly Lindhurst sat back, relaxing. He hadn't even been aware he'd tensed up through the whole trip.<br>\r\n\"Very well. Lieutenant Brandt, since you're here give us a sensor report will you.\"<br>\r\n\"Yes sir!\" Hanz Brandt replied, turning to his console.<br>\r\n\"All in all a good transition. I've seen far worst on the L5 run. Lieutenant Guzov, let me know if...\"<br>\r\nHanz butted in, his voice a little higher pitched than usual. For him this was an extreme tone of voice, something must be wrong.<br>\r\n\"Sir, all star maps have failed in comparisons. I'm rechecking, but this isn't Proxima Centauri Sir!\"<br>\r\nThe Captain snapped back to Guzov rapidly.<br>\r\n\"The hole, is it still active? Get the generators back on line and hold it open!\"<br>\r\n\"Sorry sir,\" Liliya responded, \"it's already closed.\"<br>\r\nThe bridge was silent in shock for several seconds. Where were they and what on earth would they do now?</span></div></div>",
            "created":1121537100,
            "id":375527,
            "title":"Jump into the dark."
        },
        "111":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "The decription is finished and communication begins.",
                "It's an odd 'message', and they aren't responding."
            ],
            "content":"<div class=\"\"><div> <span>Captain Lindhurst sat, fingers drumming on the armrest. Abi could be fractious at the best of times, but if she thought he was going to blame this disaster on her she'd never be helpful at all. She may even quit, and he needed her to fix this!<br>\r\n\"EM broadcast!\" came the sharp call from Lieutenant Brant.<br>\r\n\"What? Is the Wormhole still open a crack? Who is it, LFC?\"<br>\r\nA pause followed, and the Captain swivelled his chair to face the Lieutenant.<br>\r\n\"No Captain, it's not Lunar Fleet Command. The wormhole is definitely closed. Signal bearing is 46.7 by 72.3 on our current heading. I don't know the signal format, but I'm recording the message.\"<br>\r\nFor a few moments the Captain was silent, face locked in thought.<br>\r\n\"Very well, let me know if you get a fix on the format. I want to hear that message.\" then he turned back to front once more. \"Sam, can you lock passive sensors on that heading. What's out there?\"<br>\r\nChief Engineer Sam Timmins' fingers flew across his panel. The bridge had been shrunk a little from the initial designs. This version only had four control seats rather the seven originally on the design plans. The only way that worked was that each station could do multiple jobs. Technically anyone could access any task from each station. Now Timmins switched from his normal engineering readouts to the sensor systems.<br>\r\n\"First sweep shows one small world about five degrees off that heading sir, not enough data for distance and size yet, and... that's odd.\" for the next few seconds his fingers rattled the keys as he checked data. \"Sir, we have a close object, moving laterally to us. I think it's a ship performing a course alteration. If you want my guess, I think it's matching speed with us. I'll have confirmation of that in about five minutes sir.\"<br>\r\n\"Very well. Liliya, orientate the ship on that object, bring the ship to yellow alert.. and warm up the railguns, just in case.\"<br>\r\nLieutenant Guzov frowned as she started the turret power-up sequence and alerted the gunner staff back at Tactical. Brandt should have done this, but as with everything else on this cut down ship you often had to do someone else's job when they were already busy. The LFC's rush job on this ship had a lot to answer for as far as Liliya was concerned!<br>\r\nChief Timmins turned back to the Captain.<br>\r\n\"Sir, I'm sure it's a ship, but I'm getting odd readings. I think that exhaust I'm reading is helium and hydrogen, helium-3 at that.\"<br>\r\nLindhurst sat up straight at that.<br>\r\n\"Helium? Are you saying that thing has a working fusion drive? Who in hell managed to..\"<br>\r\n\"SIR!\" Brandt's sharp retort broke into the Captain's response. The fact that Brandt butted in alone got the Captain's attention, that was unheard of for him!<br>\r\n\"Yes Lieutenant?\"<br>\r\n\"The signal, I got the coding worked out, it's odd but based on an old FM microwave code. It's an old UNSA code.\"<br>\r\n\"UN Space Agency? But that's...\" the Captain turned slowly to stare out the viewport to a barely discernable dot in the distance. \"... that's from before the war? Who the hell are these guys?\"</span></div></div>",
            "created":1121624640,
            "id":261878,
            "title":"Company."
        },
        "1112":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "The ship comes to a halt, but still no response.",
                "Something emerges and heads for the Aspiration."
            ],
            "content":"<div class=\"\"><div> <span>\"OK.\" Muttered the Captain. \"Brandt, what do you have on the message?\"<br>\r\n\"Well, it seems to be an alphanumeric sequence, very long, very fast data rate, pretty much at the limit of our systems. Most of it I haven't figured out yet, but it starts with this; '1.5.5.2.7.8.3.2 --- Alpha priority --- Awaiting primary or secondary syscom --- Current operations: Condition Green --- Request update --- Main link down --- syscom file corrupted --- Sequence still running --- Request update --- Current Sequence history to follow:' and then it degenerates into pure numbers, data files definitely but no headers. I currently have no way to begin to decript, or interpret them.\"<br>\r\nLindhurst squinted, rubbing his chin for a second.<br>\r\n\"Liliya, that sound like something a Comms officer would send?\"<br>\r\n\"Uh, doubtful sir, unless he was a computer geek.\"<br>\r\n\"Yes, my thoughts as well. We could well be dealing with some sort of automated probe. Perhaps something from before the war. Not a happy thought.\" Again the captain drummed his fingers on the armrest, staring at the tiny dot as it flickered slightly. \"Engine burn?\" he said, looking at Timmins.<br>\r\n\"Looks like it sir. I have confirmation, it's definitely a fusion rocket of some sort. It's making small corrections in flight now, range estimated at seven hundred kilometers. That's quite a co-incidence don't you think? Why would we come out right alongside it by chance?\"<br>\r\n\"Hmm, chance indeed. I think I need to have a word with Miss Abi, if she'll let me get a word in edgewise. I want to know what happened. ETA on that 'ship' Timmins?\"<br>\r\n\"At the rate it's making course corrections I think it's heading for a close approach, maybe coming to a halt about 5 kilometers away. It'll have finish maneouvering in about fifteen minutes sir.\"<br>\r\n\"Very well.\" Lindhurst said, standing slowly, keeping a grip on the chair in the zero gravity. \"Maintain contact, but don't respond to it yet. We don't know what it want's. I'll be in Physics Lab 1 if you need me. You have the Conn Brandt.\"<br>\r\nTimmins quietly glanced at Liliya, when she caught his eye he raised an eyebrow and made a slight nod to Brandt. Liliya rolled her eyes in response. Brandt was not neccessary the best liked crew member onboard. <br>\r\n<br>\r\n******<br>\r\n<br>\r\n\"No,\" Captain Lindhurst said \"I just want to know why it happened so we can be sure the next jump will not be a repeat!\"<br>\r\nProfessor Abi's eyes bored into the Captain's as she stood, arms crossed in front of her, standing her full six foot two inches, plus the two inches between her and the floor. Abi didn't have a lot of experience in free fall.<br>\r\n\"Let me repeat myself... AGAIN!\" she said, scowling. \"The system worked perfectly. There is no problem, the drive will work. Is that concise enough for you?\"<br>\r\nThe Captain sighed.<br>\r\n\"Abi, if it worked perfectly then why are we not at Proxima Centauri?\"<br>\r\n\"Hmph! How should I know, I didn't do the navigation calculations. Why don't you ask your navigator?\"<br>\r\nBefore he could say another word she had turned her back on him once more and pulled herself into her seat.<br>\r\n\"Now if you don't mind I'm doing a complete diagnostic... AGAIN! Perhaps I could have some peace and quiet for it, Hmm?\"<br>\r\nLindhurst simmered slowly, but eventually got his temper under control. How long could he last before he blew up at her? What's more was that he dreaded the result if he did!<br>\r\nA forced smile lay plastered on the Captain's face for a moment, then he spun effortlessly around and kicked off, coasting out of the Lab, the door sliding shut behind him.<br>\r\nNow what? If he couldn't trust the wormhole drive how in hell would he ever get this rust bucket back home?<br>\r\nStopping in a corridor he floated, hanging off a hand rail. He'd have to get something working soon or there'd be panic back home!<br>\r\nAs far as he could see he had very few options. One seemed fairly harmless at least. With a nod he decided to go for it. What could the harm be?<br>\r\n<br>\r\n*******<br>\r\n<br>\r\n\"Lieutenant Guzov, set the encoder to the alphanumeric code type in that message.\"<br>\r\nCaptain Lindhurst made a perfect hand bounce from the ceiling and slid into his chair, braking himself on the armrests and strapping himself in.<br>\r\n\"Coder ready sir.\" Liliya said \"You say it, we'll record it. I take it you want to check it before sending?\" The Captain nodded.<br>\r\n\"Unknown vessel. This is the LSS Aspiration. We request information on your intentions, ship details, history and place of origin. In a show of good faith we will initiate with a similar list of information.\" and he nodded to Timmins. \"At that point put in the public issue data file on the Asp, chart co-ords for the solar system, rough plot of our ride here as history, and state our intentions as explorers.\"<br>\r\nAfter a few minutes Timmins and the Captain ironed out a few wrinkles in the message.<br>\r\n\"Ready sir.\" Timmins stated.<br>\r\n\"Go ahead Chief, transmit it on all frequencies.\"<br>\r\nThey waited for a response but soon it was obvious that none was forthcoming, at least not yet.<br>\r\n\"Liliya, how soon till they finish braking?\"<br>\r\nLieutenant Guzov tapped at her control panel.<br>\r\n\"In a little over two minutes sir by the look of it.\"<br>\r\n\"Damn it, who or what is it, and what the hell do they want with us?\"</span></div></div>",
            "created":1121664480,
            "id":261949,
            "title":"Messages and Portents."
        },
        "113":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Set course for the asteroids on normal drive.",
                "Talk to Abi about the Wormhole Generators."
            ],
            "content":"<div class=\"\"><div> <span>For the next few minutes the bridge was almost silent, quiet whispers all that was said as the crew tried not to admit what had happened.<br>\r\nThey were lost! Charts couldn't find a single lock, even distant stars. They must be many thousands of light years away, too far to be able to accurately head home, even if they knew where home was!<br>\r\n\"Sir,\" said Lieutenant Brandt \"I've made a preliminary sweep on optical and I've detected no large or near worlds. This close to that sun there should be something in visible range. I'd guess that gives us maybe 30% chance or less that there are any worlds around this star.\"<br>\r\nThe Captain turned to the rear and port, facing Hanz.<br>\r\n\"What about the stars Brandt, have you got any matches?\"<br>\r\n\"None yet sir, I'd suggest staying in system until we can get our bearings. Perhaps if we make a small in-system hole we can triangulate the nearer stars. That may give us something to go on.\"<br>\r\n\"Hmm, perhaps, but I'm nervous about using the generators at all given their performance just now.\" He stared down at the comm-link button on his chair, trying to decide if he should talk to Professor Abi or not right now.<br>\r\n\"Sir,\" butted in Lieutenant Brandt, \"I do have some confirmation of detected orbital bodies. Currently fifteen small bodies orbiting at approximately zero point eight AU from the primary star.\"<br>\r\n\"And the star itself, what do you have?\"<br>\r\n\"Looks like a dim K type sir, not too dissimilar from our own sun. Definite confirmation on those bodies sir. Their asteroids, unknown composition currently, high albedo, maybe ice rocks. They vary from Fifty to two hundred kilometers in diameter.\"</span></div></div>",
            "created":1121539020,
            "id":261739,
            "title":"A barren system?"
        },
        "115":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "The language was unintelleable. What now?",
                "They speak English? How? Why?"
            ],
            "content":"<div class=\"\"><div> <span>Captain Lindhurst nervously drummed his fingers on the console.<br>\r\n\"Can you confirm the sensor data isn't corrupted? Are you certain we aren't at Proxima?\" he said softly to Lieutenant Brandt.<br>\r\nAfter a few seconds tapping at his console the heavy set man sighed and turned around.<br>\r\n\"I'm sorry sir, it's confirmed. We have no recognizable locks in star patterns. The system is checking all stars, starting with the brightest, for spectral analysis but that will take hours. Our records are definitely still intact and the sensors are reading right... This isn't our target system.\"<br>\r\nStaring at the fore view ports at the unfamiliar stars Lindhurst tried desperately to think of something for the crew to focus on. However he was having difficulty focussing himself. They were lost!<br>\r\n\"Sir, I'm getting an odd reading on the magnetometers.\" came Timmins' cautious voice \"I thought it was just an iron asteroid but it seems to be... accelerating. Range approx. six thousand kilometers and closing at two hundred meters per second. Acceleration about zero point six G's Estimated mass fifteen thousand tons metallic.\"<br>\r\n\"Chief?\" Lindhurst said, sitting up in his seat. \"What's on the other sensors?\"<br>\r\nA few moments sped by as Timmins checked, the tension rising dramatically in the room.<br>\r\n\"Not much at this range but I think I have something on infrared. Patching it to your viewer.\"<br>\r\nThe Captain looked down at his monitor and frowned. It looked odd, sort of patchy as if made up of wadded bits of paper stuck together with tubes.<br>\r\n\"What kind of ship is that? It's not even symmetric! What's it's vector? Is she heading directly towards us?\"<br>\r\nAgain time strung out.<br>\r\n\"She's definitely heading towards us sir... It's possible that the sensor readings just look odd... maybe that thermal signiture isn't comparable to it's actual structure, but either way I can't map that signature to any known ship. I think...\"<br>\r\nSuddenly Timmin's eyebrows shot up and he pressed his hand to his earpiece. At the same Time Lieutenant Brandt suddenly got tense.<br>\r\n\"Sir!\" Brandt's terse voice cut in \"Comm signal... I think.\"<br>\r\n\"You think?\" Lindhurst said turning to him. \"What do you mean 'you think'?\"<br>\r\n\"There is a carrier wave but the frequency, modulation and format are unknown. I've never seen anything like this before. Give me a few minutes to work with it.\"<br>\r\nBrandt furiously began to work at his terminal, processing the raw data from the short signal through the ship's computers. Attempt after attempt failed to get any kind of pattern out of the data but finally...<br>\r\n\"Got it!\" he gasped, making the captain jump \"What the hell is this? Sir, I think this is some sort of video feed from the pattern repeats I'm seeing but I'm having difficulty getting the format intelligible.\"<br>\r\n\"Just put it on screen, intelligible or not.\" Came the Captain's hoarse voice.<br>\r\n\"Um, Sir? I mean I can't figure out how to arrange the video signals at all sir. It's weird it's as if the line signals get shorter before they repeat almost as if... Ah!... I don't believe it!\"<br>\r\n\"Brandt!\"<br>\r\nThe lieutenant snapped his head around to the Captain.<br>\r\n\"Sorry sir, I think I've got it. They aren't lines they're circles. Hang on, I've got the coding. Patching it you your monitor.\"<br>\r\nLindhurst looked down at his monitor trying to release the death grip he had on his armrests. First a black disk appeared on his monitor, then started flickering.<br>\r\n\"It's some sort of circular scanning Sir.\" Brandt said, still working at his terminal \"I'm working on the coding sir. It's a kind of phase modulation with five shift patterns. I think they're the colour cycles.\"<br>\r\nThe image flickered again, shifted, rotated, looking like odd static. Slowly something started to come out of the randomness, colours faded and changed till finally a face popped into existance. For a few seconds it was purple, then it shifted till it was green, but that wasn't what drew Lindhurst's attention. It was the features. They weren't human!<br>\r\nThe 'face' had three eyes each on short boney looking stalks coming forward out of the face, one at the top and one on either side. The eyes themselves looked... almost human, though it looked like there were two irises inside one another. The face itself was a ridged sphere, slightly flattened at the top, and between the three eyes was what looked like a mouth... maybe. It was a crinkled opening with hints of some pinkness inside.<br>\r\nSilence reigned on the Bridge for a few moments as all the crew stared at their monitors.<br>\r\n\"Th... that's the first frame sir.\" Brandt's rather muted voice stated. \"Do you want me to play the message? The audio portion was simpler to decode.\"<br>\r\nThe Captain just nodded and stared at the screen as it suddenly became animated.</span></div></div>",
            "created":1169394240,
            "id":375537,
            "title":"Alien contact."
        }
    },
    "info":{
        "author_id":"gimlet",
        "author_name":"Gimlet",
        "brief_description":"A hard scifi tale of mankind's first voyage beyond the solar system.",
        "created":1121536080,
        "description":"<td align=\"left\" class=\"norm\">This is a hard scifi story, so no Star Trek ultratech: transporters, shields etc. Take modern tech and make it better (ie spaceships feel like modern subs) and add a few techs we nearly have today, and Wormhole Generators, the new invention taking Mankind to the stars.<br>\r\n<br>\r\nFeel free to take this story anywhere but there are two things to keep the same: Tech (even aliens) should stay as hard scifi. 2nd, if you're going to write something, try to be consistent with previous entries in that thread.</td>",
        "id":991392,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1169394240,
        "modified":1169394240,
        "pretty_title":"Aspire to the Stars!"
    }
}