{
    "chapters":{
        "1":{
            "author_id":"shadstgstory",
            "author_name":"Shad",
            "choices":[
                "A 24 muscular bodybuilder!",
                "A fat business man in his 30s!",
                "Starting to be an adult by the age of 18!",
                "A guitarist at the age of 27!",
                "Even more options!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Erica will wake up and transform into the following on this particular day...</span></div></span></div>",
            "created":1385438700,
            "id":1699123,
            "title":"What shall happen?"
        },
        "15":{
            "choices":[
                "An anthropomorphic Canine, aged 21!",
                "A hardened 'Nam Vet with Erectile Dysfunction, aged 64!",
                "A door-to-door cardboard salesman who owes the Japanese Yakuza money, aged 38!",
                "A young tribal hunter-gatherer alien from another galaxy, aged 142!",
                "Even more Options!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Erica will wake up and transform into even more (im)possible things on this particularly unusual day...</span></div></span></div>",
            "created":1385444280,
            "id":1699156,
            "title":"Chapter 1: What shall happen, Continued."
        },
        "151":{
            "choices":[
                "Head East to inspect the cave...",
                "Head West to find the road..."
            ],
            "content":"<div class=\"\"><div> <span>          Erica awoke in the dark of early morning, as usual. She could never wake at 7 like she wished to, instead always finding the sky still pitch black, her family still asleep and her clock usually somewhere between \"2:00 AM\" and \"4:00 AM.\" To make matters worse, she had a bad case of insomnia as well, keeping her awake and staring at her ceiling 'till well after midnight. If she even sleeps at all on a given night, she'll find herself getting maybe two hours of sleep, at the very most. Her parents have worried extensively for her, as sleep meds have proved useless to help her, and it was beginning to take a serious toll on her mood. This lack of sleep would be unhealthy for anyone, but especially so for a girl her age; she was only eight years old as of July. It was August now, and school was set to start in barely a week's time. <br>\r\n<br>\r\n          With a sigh, she put her bunny slippers on and staggered outside to her family's outhouse, puffy dark circles under her reddened eyes. Turning on the lamp, she wandered out into the cold nighttime air. Her thin nightgown and cotton panties did little to combat the cold, but she braved it for the sake of her aching bladder. She reached the outhouse, only to find, to her dismay, that the door was jammed and her weak arms could do nothing to open it. She started hopping, twisting her legs together as the pressure in her bladder increased to unbearable levels. She wouldn't dare urinate out in the open and risk her family waking up and seeing her being indecent, so she ran into the woods just beyond the fence marking the extent of the farmland. She heard a tear as she passes through a thorny bush, and upon finding a clearing, realized she had lost all her clothes, now standing entirely nude in the bitter cold. She grasped herself tightly, teeth chattering away.<br>\r\n<br>\r\n          Feeling she would not be spotted, she squatted down above a patch of grass and spread her labia with her fingers. After a few seconds, her pee began to stream down onto the forest floor, a soft hiss and Erica's sigh of relief mixing with the natural sounds of the forest. She began to relax, the cold not bothering her as much, her more immediate need finally being sated. Suddenly, the bushes in front of her began rustling. A furry, four-legged animal with lots of teeth and glowing eyes jumped into the clearing and ran towards Erica. She screamed and backed away as fast as her arms and legs would allow, complete terror filling her body, her urine still flowing freely between her legs, now more from fear than the needs of her bladder. The creature was nearly upon her when she kicked it as hard as her small body would allow. Its head knocked hard into a tree, and its body fell limp to the ground. Tears running down her face, her heart still beating wildly, she approached the creature. It was then that the clouds above began to clear, and the light of the moon illuminated the creature, revealing it to be Rex, the family pet, her beloved Irish Wolfhound.<br>\r\n<br>\r\n          She stared at her dog, laying in a heap at the bottom of the tree, entirely motionless. She reached out to touch her dog, when suddenly her wrist was firmly grasped by a large gloved human hand. She looked up, finding its owner to be a complete stranger, an unknown man seemingly in his fifties, dressed in a long trenchcoat and fedora, which kept his face shaded from the moonlight.<br>\r\n<br>\r\n          \"You heartless little monster,\" he said. She said nothing, still staring up at this towering stranger, unsure of what to say or do. He let go of her wrist, putting his hand in his pocket. \"Have you any compassion for this animal you dared consider your 'pet'? You may very well have caused him serious, permanent injury, if not worse!\"<br>\r\n<br>\r\n          \"I... I...\" She struggled to speak, the events of this morning blanking her already-weakened mind and spirit. <br>\r\n<br>\r\n          \"This is a crime, you know! Abuse! You'll have dear consequences to pay, little one, dear consequences!\"<br>\r\n<br>\r\n          She shook her head in disbelief. \"B-but, it was an... an accident, I thought...\"<br>\r\n<br>\r\n          The man took out a cigarette, lit it and smoked it, wisps of the cigarette's hot swirling vapors puffing out with every exhale. \"An accident? Bringing your dog into the woods and kicking its head into a tree doesn't sound like an accident! Reaching out to check if its dead is not an accident!\" he took another puff of his cigarrette. \"You're a criminal. A rotten criminal. And this...\" he took his hand out from the pocket of his coat, clenching a bottle full of a glowing red-and-blue liquid, which looked reminiscent of a lava lamp, \"...Is your punishment!\"<br>\r\n<br>\r\n          Erica tried backing away, but the man grabbed her by the neck, lifting the naked child into the air effortlessly. He pulled the cork from the bottle with his teeth and forced the open end of the bottle into Erica's mouth, pouring the liquid down her throat as she kicked and gagged. She only drank half of it before finally kicking the man square in his funnybone. The sudden shock caused him to drop the bottle onto a rock below, the rest of it evaporating into steam. He threw Erica to the ground, clutching his arm. She started to run, but fell to her knees, feeling her stomach burn and growl wildly, the feeling of intense nausea pervading her body.<br>\r\n<br>\r\n          Her whole body began to burn, as her bones and flesh stretched and her body grew in every direction. She rapidly grew in height, changing from a mere 3' 9\" to a full 5' 8\" in seconds. Her small hips became much more pronounced, growing almost as wide as her shoulders. Her pudgy childhood fat disappeared, leaving her stomach thin and attractive-looking, light muscular abs appearing. Her flat chest grew into enormous, full E-sized breasts that jiggled as she writhed on the ground, foam dripping from her mouth as she continued to change and morph. Her short black hair grew long enough to reach down past her butt, itself growing much larger, and attractively-jiggly. Then the pain suddenly ended. She laid on the ground for a few seconds, breathing heavily, then sat up and wiped the residual foam from her mouth. As she looked down at herself, she realized she now had the bodily appearance of a highly attractive woman of her early 20's.<br>\r\n<br>\r\n          Though the burn was gone, she noticed a heat begin to form across her body, most notably, her groin. She instinctively reached down to her vagina, noticing a pronounced clitoris growing out from under her hood. On a single touch of her stiff nub, she squealed, her entire body shuddering, while her pussy clenched hard, spewing out a stream of her natural lubricant over the forest floor and drenching her hands. It felt like bubbles were popping in her head as her first-ever orgasm reached its completion. But the heat would not go away; her new adult body was overflowing with 10-years worth of female hormones. She stuffed her fingers in her sopping-wet cunt, fingering herself with one hand and rubbing her labia and clit with the other. She moved one hand to her breasts so she could lick, suck and nibble on her erect nipples, the other hand slapping at her soaked cunt, it now squirting hard with every touch. She gave herself orgasm after orgasm, paying no mind to the stranger's presence before her, lost in the bliss of her own body.<br>\r\n<br>\r\n          As she licked her wet fingers, admiring the taste of her sex, she started noticing hair on her tongue. She looked at her hands, watching as they grew vast amounts of thick, soft, black fur. Her entire body itched as the hair grew in, but soon the itch was replaced by more burning. Her mouth and nose began to stretch outward, causing her enormous pain. She screamed and grasped at her face as it grew into a muzzle, her nose flattening in line with her mouth and growing a wet, leathery coating. From her ass grew a tail, and her feet began to morph into four-toed skin-padded furry paws, big sharp claws replacing her human toenails. She grew two sets of smaller breasts beneath her normal pair, and her ears grew long and flopped down to the side of her head. When the pain yet again subsided, she found she was now an anthropomorphic canine. A wave of her vaginal musk hit her extra-sensitive dog nose hard, and she nearly gagged from it.<br>\r\n<br>\r\n          Suddenly, she fell forward, something big and heavy leaping onto her back. It was Rex, red veiny cock throbbing at her vaginal opening, the dog awoken by Erica's strong scent and overcome with passionate lust. He buried his unsheathed penis into her pussy, making her scream and squeal. After a few thrusts, he unloaded his semen into her, knotted her, and pulled out, the size of his knot making her scream in pain on exit. She reached back to her gaping vagina, feeling the mix of virginal blood and dog cum smear over her furry fingers.<br>\r\n<br>\r\n          \"Huh. Well that was strange. That potion was meant to turn you into a dog, not a dog-morph. And your actual dog was supposed to have died anyway... Ugh, this is what happens when people don't drink the whole potion. Terrible side effects. Well, this was a waste of time and resources. Sorry to bother you,\" The odd man then walked off into the bushes.<br>\r\n<br>\r\n          \"Waaaait!! Change me back!! I can't live like this!!\" Erica cried out, but the man was already gone. Erica stumbled to her feet, using a tree as support. Suddenly, the burning started again, and after a few seconds of blinding pain, she realized her tits were gone, and her pussy was changed into a cock. \"Oh no... no, no, noooo...!\" She grasped at her groin, futilely trying to get back her natural parts. Her dog began barking and growling. She turned to see the growling was towards her. Rex chased the male dog-morph Erica into the woods and away from the farm, territorial instinct overcoming what little logic he had. Erica, now a boy, was unsure of where to go or what to do. She noticed a cave to the east, but knew that towards the west was the highway... What should she do?<br>\r\n</span></div></div>",
            "created":1385499120,
            "id":1699364,
            "title":"Every Dog has its Day"
        },
        "155":{
            "author_id":"shadstgstory",
            "author_name":"Shad",
            "choices":[
                "A 41 year old clown man! Ahyuk!",
                "Beauty becomes the beast.",
                "Even more options!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, what other ways could we sour her morning with transformations?</span></div></span></div>",
            "created":1385513280,
            "id":1699462,
            "title":"Even more Options!"
        },
        "1553":{
            "author_id":"shadstgstory",
            "author_name":"Shad",
            "choices":[
                "She becomes a father of two kids, age 28!",
                "Digitilized into an adult(or adult version) male videogame character!",
                "Even more options!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Picky, aren't we? Well have some more transformations to sour her morning for all I care...</span></div></span></div>",
            "created":1385513460,
            "id":1699464,
            "title":"Even more options!"
        },
        "15533":{
            "author_id":"shadstgstory",
            "author_name":"Shad",
            "choices":[
                "Male stripper at the age of 30!",
                "More options!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More, more!</span></div></span></div>",
            "created":1458628140,
            "id":2121071,
            "title":"Even more options!"
        }
    },
    "info":{
        "author_id":"shadstgstory",
        "author_name":"Shad",
        "brief_description":"A eight year old girl demands respect, but she needs to learn responsibility.",
        "created":1385438520,
        "description":"<td align=\"left\" class=\"norm\">Hello, everybody, today we meet an eight-year old girl named Erica, who wishes to be respected by her elders and those younger than her.<br>\r\n<br>\r\nTherefore, we are going to change her into an adult male, or it can be an adult male that's not a human... mhmhmhm...<br>\r\n<br>\r\nThe rules:<br>\r\n<br>\r\n1. Sex is permitted.<br>\r\n<br>\r\n2. Erica can't change back to being a girl.<br>\r\n<br>\r\n3. Erica cannot die.<br>\r\n<br>\r\n4. After her age-changing and gender-changing transformation, Erica is allowed to get younger, but no younger than eighteen.<br>\r\n<br>\r\n5. \"See more options\" must always have four other choices while the fifth is \"See more options\", fail to obey this rule gets its page removed.<br>\r\n<br>\r\n6. Her transformation must be detailed in one whole page, not instantly, gradually in one page.<br>\r\n<br>\r\n7. Use proper grammar.<br>\r\n<br>\r\n8. After choosing a transformation, you must only use only two choices each chapter from then on.<br>\r\n<br>\r\n9. Love and relationships is not limited to male and female, you can have male and male too.<br>\r\n<br>\r\nSo let's have fun with this thing, why don't we?!</td>",
        "id":1964259,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1458628140,
        "modified":1458628140,
        "pretty_title":"Learning Responsibility"
    }
}