{
    "chapters":{
        "1":{
            "author_id":"airship-king",
            "author_name":"Airship-King",
            "choices":[
                "Try to pull yourself together with your detached limbs.",
                "Freeze in horror at your situation.",
                "Scream in horror at your situation.",
                "Take a brief moment to enjoy the new sensation of being in pieces.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>You consider yourself to be fairly ordinary as members of your tribe go. You've got the normal grey fur, are of about average height, weight, and build, and not exceptionally skilled at any particular job, although you are also quick to point out that you aren't particularly <i>bad</i> at any given job either. You are considered pretty bright however, so that's something.<br>\r\n<br>\r\nOne day, you go out for a walk, and wind up pretty far from the village. Although the Jungle can be dangerous at times, you are fairly confident that you won't run into anything you can't handle. After all, despite the distance involved, this is still a fairly well traveled part of the jungle, and you can't remember anyone warning you about dangerous creatures living around here.<br>\r\n<br>\r\nWhile you are walking along a trail near a small stream, you stop to rest for a minute. Suddenly, a lightning bolt cracks down through the treetops and strikes you dead on. Although the pain is excruciating, everything quickly goes white and you black out...<br>\r\n<br>\r\nWhen you come to, you can immediately tell that something is wrong, even without opening your eyes. Although you aren't feeling any residual pain from the lightning strike, your body parts are giving you all sorts of contradictory feelings. You've heard one of the other tribesmen say that lightning strikes can do funny things to a person's head, so maybe that's what this is? You open your eyes slowly, and look around. You can hardly believe what you're seeing!<br>\r\n<br>\r\nScattered all around you are body parts. Very <i>familiar</i> body parts. <i>Your</i> body parts. You gape. You've literally been blown to pieces! As far as you can tell, you've been divided into six parts. Your head, your body, your arms, and your legs. Thankfully, your body parts still appear to be clothed (you were wearing typical tribal garb). But what are you going to do?</span></div></div>",
            "created":1347858000,
            "id":1429785,
            "title":"A strange day"
        },
        "11":{
            "author_id":"digitaljackal",
            "author_name":"ASDFJACKAL",
            "choices":[
                "It was your friend from the village Silver",
                "It was just a harmless animal",
                "Nothing it was just the wind"
            ],
            "content":"<div class=\"\"><div> <span>You try to see if you could pull yourself together with your detached limbs. You still had your sense of control, why not try moving it? \"Hmmm...let me see If I could do this?\" You try to see if you could make minor movements first, it didn't take you long enough to see your right arm wiggling it's fingers, then your other limbs followed by your torso which was twitching. Now for the major movements you saw your right arm rising and waving at you followed by your left.<br>\r\n<br>\r\nWith all those practices out of the way you attempt to assemble yourself now, you move both of your arms and scurry towards your disembodied torso. You first attach your right arm on the empty stump, upon attaching the severed limb you could feel a slight tingling sensation from afar. You swing your right arm around to see if it stays in place and it looks like it didn't come off. You grab your other arm and attach it in the same manner \"Alright...looking good\" you said afterwards you used both of your arms to push against the ground lifting your disembodied torso then started walking towards your pair of legs. You attach both of your legs and soon you were whole again...well ALMOST.<br>\r\n<br>\r\nYour body started to walk towards your head and picks you up. You were curious at first and examined your body from bird's eye view \"This is so weird...did that lightning do this to me?\" you asked yourself then placed your head back on your neck where it belongs. Good as new, there were no scars around you body and it looks like you were never broke. You took a moment to stretch for a while before you could proceed back to your village, however you tripped on a rock.<br>\r\n<br>\r\n\"Argh!\" you shout in pain as you fell back to the ground and were scattered in pieces again. You groaned in pain and noticed that you weren't completely whole and that you could still disassemble yourself. A few moments later you assemble yourself and proceeded to go back to the village, but before you could  you hear a sound in the bushes.</span></div></div>",
            "created":1432995420,
            "id":1985281,
            "title":"Try to pull yourself together with your detache..."
        },
        "111":{
            "author_id":"tpds",
            "author_name":"TPDSMCH",
            "choices":[
                "Return to the village headless.",
                "Headless hunting",
                "Put your heads back on"
            ],
            "content":"<div class=\"\"><div> <span>Silver, a friend of yours from the village, immediately appears out of the bushes. He was one of the more physically-strong members of your tribe, and often went to look for food for everyone as a hunter. In his hand is a spear.<br>\r\n<br>\r\n“Felix, how are you?” he asks.<br>\r\n<br>\r\n“Not very well,” you say. “I’ve been literally falling apart.”<br>\r\n<br>\r\n“No way.”<br>\r\n<br>\r\n“Yes, I’ll show you.”<br>\r\n<br>\r\nYou grab your head with both hands and, after tugging it for a while, you pull your head off and settle it down.<br>\r\n<br>\r\n“Really? And you stay alive as well?”<br>\r\n<br>\r\n“Exactly.”<br>\r\n<br>\r\n“Well, try pulling at my head and let’s see if you can’t pull that off.”<br>\r\n<br>\r\nWith your head commanding it, your body grabs Silver’s head and pulls it off. Not only does he survive, but his head can command his body the same way your can. Your body gives Silver’s body his head.<br>\r\n<br>\r\n“This is weird,” Silver says.<br>\r\n<br>\r\n“Even weirder when the first wolf in the tribe to be affected can pull the head off another.”<br>\r\n<br>\r\n“I get you there. So what now?”</span></div></div>",
            "created":1570393980,
            "id":2729052,
            "title":"It was your friend from the village Silver"
        },
        "1111":{
            "author_id":"tpds",
            "author_name":"TPDSMCH",
            "choices":[
                "You go see the shaman.",
                "You put your heads back on now.",
                "You take everyone’s heads off their bodies."
            ],
            "content":"<div class=\"\"><div> <span>Leaving your heads detached, you and Silver walk back to the village in a few minutes. On arrival, the rest of the wolves are taken aback by how you look. They cannot believe that a lightning strike can cause a wolf to become modular AND gain the ability to take others apart. After a while, however, they get used to the site. So now what happens?</span></div></div>",
            "created":1570397040,
            "id":2729083,
            "title":"Return to the village headless."
        },
        "11113":{
            "author_id":"tpds",
            "author_name":"TPDSMCH",
            "choices":[
                "Immediately after you return",
                "At the tribal circle"
            ],
            "content":"<div class=\"\"><div> <span>So it looks like you’re having too much fun going around as a headless tribe member and decide you want to remove all the heads from the other wolves and create a headless tribe. The heads will still be able to control their bodies and could even share heads, the list of possibilities floating around in your detached head are endless. At what time do you start the separating of heads?</span></div></div>",
            "created":1570397160,
            "id":2729086,
            "title":"You take everyone’s heads off their bodies."
        },
        "111132":{
            "author_id":"sabrina-taur",
            "author_name":"SabTaurDalton",
            "choices":[
                "The tribes bodies pick up heads at random",
                "The tribes bodies leave the heads around the center",
                "Other option"
            ],
            "content":"<div class=\"\"><div> <span>You decide to wait until the next tribal circle a few days later on the full moon, taking the matter up with the tribal mother and council. You show them your capabilities without your head, and that, after a minor slip up a day prior revealed to you and Silver, while a part is detached you are fully modular and incapable of being cut or stabbed with the wound having the same furry texture as your stump. And to demonstrate, you remove the tribal mother’s head, holding her back as Silver’s body runs at her body with a spear, running her right through the heart. The council and tribal mother gasps, but are even more shocked to find no blood being drawn. Pulling the spear out, the tribal mother rubs the wound, finding a small, furry hole where it impaled her, which is easily pinched closed. With this demonstration of a “modular’s” abilities, the tribal mother and council agree it would be best if the whole tribe were decapitated by you.<br>\r\n<br>\r\nA few days later at the circle, with all of the members of your tribe sitting in a wide circle around a fire, you and Silver begin walking around, removing each head from your three dozen or so tribe members. The heads are set a bit closer to the fire on pre-built pedestals, the tribe mother speaking a long prayer to the stars as you do so. Once all the heads are removed, the tribal mother utters something you hoped you’d hear.<br>\r\n“From this day on, your bodies are not your own, they are everyone’s, for the good of the tribe. So long as your head stays detached from your body, you are invulnerable. Don’t throw that ability away.”<br>\r\n<br>\r\nWhat happens now?</span></div></div>",
            "created":1605376920,
            "id":2940026,
            "title":"At the tribal circle"
        },
        "1113":{
            "author_id":"tpds",
            "author_name":"TPDSMCH",
            "choices":[
                "Original heads returned",
                "Head swap"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do the original bodies have their heads returned or do you swap heads?</span></div></span></div>",
            "created":1572596520,
            "id":2740956,
            "title":"Put your heads back on"
        },
        "11132":{
            "author_id":"nobodyimp",
            "author_name":"nobodyimportant",
            "choices":[
                "Return to the village like this.",
                "Go for a walk together.",
                "Continue to try to get used to your new bodies."
            ],
            "content":"<div class=\"\"><div> <span>\"We should probably put our heads back on, actually,\" says Silver, \"wouldn't want to lose them.\"<br>\r\n<br>\r\n\"Good point,\" you say in agreement. You're about to replace your head, but as you look over Silver holding his head under his arm, you get a crazy idea.<br>\r\n<br>\r\n\"Hey SIlver...\" you say timidly.<br>\r\n<br>\r\n\"Hm?\"<br>\r\n<br>\r\n\"There's no way to ask this without sounding strange, but what if we put our heads on each other's bodies?\"<br>\r\n<br>\r\nSilver blushed. He was clearly taken aback by the idea, but you could see on his face that he was considering it. He looked you over once more, tail wagging nervously.<br>\r\n<br>\r\n\"I mean... I suppose we could try...\" he said sheepishly.<br>\r\n<br>\r\nCarefully, you take his head from his body and position your heads over each others necks. At the same time, you drop them and they attach cleanly, both of you now in control of each others bodies.<br>\r\n<br>\r\n\"This is just... so...\" SIlver started, trailing off as he felt up his new body, his borrowed paws exploring everywhere.<br>\r\n<br>\r\n\"Hey, take it easy, friend,\" you say sternly. SIlver's- <i>your</i> paws halt and return to their sides.<br>\r\n<br>\r\n\"Sorry, I got carried away,\" Silver said, looking guilty.<br>\r\n<br>\r\n\"Don't worry about it, buddy, I'll admit I'm feeling the same way...\" you reply,trying to reassure him.<br>\r\n<br>\r\nIt's a really interesting feeling to have your best friend's buff body. You definitely like it. What should you do now that you've both swapped heads?</span></div></div>",
            "created":1574993940,
            "id":2753203,
            "title":"Head swap"
        },
        "112":{
            "author_id":"sabrina-taur",
            "author_name":"SabTaurDalton",
            "choices":[
                "Reveals that it too is modular",
                "Steal one of your parts",
                "Other option"
            ],
            "content":"<div class=\"\"><div> <span>A feral wolf comes out of the bushes. Thanks to your tribe being the wolf tribe, you have a mutual friendship with the ferals. The wolf walks over to you and starts sniffing at you. It sniffs your joints, before throwing it's body at you, causing you to break apart again.<br>\r\n<br>\r\nWhat does it do next?</span></div></div>",
            "created":1459373400,
            "id":2125258,
            "title":"It was just a harmless animal"
        },
        "1121":{
            "author_id":"tpds",
            "author_name":"TPDSMCH",
            "choices":[
                "You swap heads",
                "You both fall apart",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens between you and the feral wolf?</span></div></span></div>",
            "created":1572596700,
            "id":2740958,
            "title":"Reveals that it too is modular"
        },
        "1122":{
            "author_id":"tpds",
            "author_name":"TPDSMCH",
            "choices":[
                "Grab one of your arms and run",
                "Grab your torso and run",
                "Grab your head and run"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does the feral wolf do?</span></div></span></div>",
            "created":1572596580,
            "id":2740957,
            "title":"Steal one of your parts"
        },
        "11223":{
            "choices":[
                "you lose control of your body!",
                "your body catches up!"
            ],
            "content":"<div class=\"\"><div> <span>You try to start reassembling yourself. Before you can finish, the feral wolf wraps its jaw around the little bit of neck attached to your head, lifting you up off the ground. \"HEY! PUT ME DOWN\" you yell at it. At this point your body is still missing an arm and a leg, though you find yourself reassembling yourself much quicker now.<br>\r\n<br>\r\nThe wolf snaps its head to look at your still disassembled body, then darts off in the opposite direction. \"NO NO NO\" you try reprimanding it. You try to blindly reconstruct yourself as fast as you can. It was already an entirely new process to get used to controlling your body in third person, but getting used to it while having to chase a head thief was ridiculous! You can't see much as everything passes by in a flash thanks to the wolf's speed, but you prioritize getting both legs first. Once you feel the sensation of your other leg reattaching, you pick up your arm and command your body into a dead sprint after the direction you were headed. Well at least the direction you were like 60% sure you were headed.<br>\r\n<br>\r\nAs the wolf ran with you more, you did take a moment to feel the breeze against the bottom of your neck, you can feel the wind in your neck fur. Interesting enough that your stumps are covered in fur almost like your parts didn't belong together.<br>\r\n<br>\r\nYour thoughts are interrupted when suddenly...</span></div></div>",
            "created":1605212880,
            "id":2939185,
            "title":"Grab your head and run"
        },
        "13":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Go see the shaman",
                "Play with Silver with your new powers",
                "Play with your new powers alone.",
                "Other choice",
                "Reader's choice ver.2"
            ],
            "content":"<div class=\"\"><div> <span>As you scream to the heavens for your fate, faint rustling sound echoes soon after, and someone walks in to see you fallen apart.<br>\r\n<br>\r\n\"W-what the!?\"<br>\r\n<br>\r\nYou manage to turn your head to see Silver, a friend of yours from the village. He was one of the more physically-strong members of your tribe, and often went to look for food for everyone as a hunter. In his hand is a spear, which he drops in shock. His face is frozen with utter horror, soon meeting your gaze.<br>\r\n<br>\r\n\"H-help! Silver, help me!\" you shout.<br>\r\n<br>\r\n\"W-wait, Felix? You're...You're alive!?\" he asked.<br>\r\n<br>\r\n\"Yes, somehow. I...I was, uh, t-taking a walk, then, a lightning bolt, blacked out, then, this!\" you say, panic clear in your voice.<br>\r\n<br>\r\nSilver shakes his head as he walks up to your head.<br>\r\n<br>\r\n\"O-okay, so a lightning bolt struck you, and you fell into pieces, literally...And you're still alive?\"<br>\r\n<br>\r\nYou do your best to nod as Silver picks up your head. It feels weird being carried by your friend like this.<br>\r\n<br>\r\n\"D-do you think you can be put back together?\" he asked.<br>\r\n<br>\r\n\"Uh, I dunno. But, let's try it.\" you manage to say.<br>\r\n<br>\r\nSilver places your head on a rock as he gathers your pieces together. Once or twice, your limbs twitch as you giggle. You were somewhat ticklish, you see. Silver managed to gather your whole body and began reconnecting them. When it was finished, he places your head right where it belongs. You blink as you felt a tingling sensation when your body parts were being put together. As you slowly push yourself into a sitting position, you test everything to make sure it was put back right.<br>\r\n<br>\r\n\"S-so, you're okay now?\" Silver asked.<br>\r\n<br>\r\n\"Hmm...My legs don't feel right.\" you say.<br>\r\n<br>\r\nYou look down at your feet and realized that Silver got your legs switched around. Shaking your head, you point out this flaw to Silver, who smacks his forehead for his own clumsiness. You place a hand on one leg and begin thinking to yourself.<br>\r\n<br>\r\n\"If I could just take this off, I can fix this little mistake.\"<br>\r\n<br>\r\nAnd just like that, it came off with a single tug. Silver gave a small yip as you just stared at your re-detached leg. You place another hand on your other leg, pull it off, and put the legs back on your body the right way.<br>\r\n<br>\r\n\"T-that was...I'm gonna need to get used to that.\" Silver said.<br>\r\n<br>\r\n\"Um, Silver, how did you find me all the way out here?\" you ask.<br>\r\n<br>\r\n\"O-oh, I was out looking for some meat. That lightning strike caught my attention, so I decided to take a look. Then, I heard you scream, so I rushed over here, and saw you.\"<br>\r\n<br>\r\nYou stand up with Silver's help. Everything feels normal, like you were never broken apart in the first place.<br>\r\n<br>\r\n\"Do you...Do you think some kind of magic is at work?\" you ask.<br>\r\n<br>\r\n\"You were blasted into pieces, and you were still breathing. Then, it turns out that you can pull yourself apart again. I think that's pretty obvious.\" Silver points out.<br>\r\n<br>\r\nYou nod as you hold onto his arm for support. You mind wanders a bit as you imagine how Silver would react if this happened to him. Suddenly, you almost fall forward as Silver's entire arm pops right off! Silver screams almost as loud as you did, his arm flailing around in your arms.<br>\r\n<br>\r\n\"My arm! My arm!\" he shouts.<br>\r\n<br>\r\n\"C-calm down! Look, I'm gonna put it back!\" you say.<br>\r\n<br>\r\nYou put the arm back, and Silver moves it around to make sure it's back to normal. Then he looks back at you, surprise in his eyes.<br>\r\n<br>\r\n\"F-Felix...I think...That lightning gave you these powers!\"<br>\r\n<br>\r\n\"Powers? What, to pull myself and others apart? What good will that do for the tribe?\" you say.<br>\r\n<br>\r\n\"Felix, don't you understand? This must be some kind of sign from the spirits or something! We need to go see the shaman about this!\"<br>\r\n<br>\r\nSilver picks up his spear as you think about what he said. It's true that lightning bolts don't normally give someone powers. However, if this really was some kind of sign, why him? There's nothing special about him. At least, that's what he believed. Maybe it would be a good idea to see that shaman about this. Or, he could test out his powers to see what he can really do!</span></div></div>",
            "created":1384664400,
            "id":1695450,
            "title":"Discovery"
        },
        "132":{
            "author_id":"nobodyimp",
            "author_name":"nobodyimportant",
            "choices":[
                "\"No way,\" you say, \"I like you better like this.\"",
                "\"Alright,\" you say, \"I was just having a little fun.\"",
                "\"On one condition,\" you say, \"let's keep experimenting privately.\""
            ],
            "content":"<div class=\"\"><div> <span>Before Silver can run off toward the shaman, you reach for his head and yank it off! His body runs for a bit, but he stops when he realizes what you've done.<br>\r\n<br>\r\n\"Felix? Wha- is that my body? What did you do?\" your friend's head protests. His strong shoulders look even more broad without a head between them.<br>\r\n<br>\r\n\"Sorry, SIlver, but I can't have you talking to the shaman about this yet. I haven't even gotten to enjoy it!\" you say.<br>\r\n<br>\r\n<i>\"Enjoy it!?\"</i><br>\r\n<br>\r\n\"Look, you know the shaman, he's gonna freak out and keep me cooped up for days to examine me! I don't feel like being a test subject just yet,\" you explain.<br>\r\n<br>\r\n\"Fine, I won't tell him, but can you please give me back my body?\" Silver says.<br>\r\n<br>\r\n\"Oh,\" you say, feeling a little guilty, \"of course, buddy.\" You walk over and reattach SIlver to his body, but backwards.<br>\r\n<br>\r\n\"Ha ha, very funny, now put me back on the <i>right</i> way, Felix,\" SIlver says, extremely annoyed. You giggle at the ridiculous sight in front of you.</span></div></div>",
            "created":1574994840,
            "id":2753208,
            "title":"Play with Silver with your new powers"
        },
        "14":{
            "author_id":"nobodyimp",
            "author_name":"nobodyimportant",
            "choices":[
                "...actually a rescue party! Phew.",
                "...a hunting party from a neighboring tribe! Hopefully they're friendly...",
                "...just a harmless animal. Wait, is it getting closer?",
                "...someone else who trips and also falls to pieces in front of you!"
            ],
            "content":"<div class=\"\"><div> <span>You know, after the initial shock wears off, this is quite relaxing. You feel at peace. Your head managed to land on a particularly soft patch of moss and you happen to be looking right at a rainbow! Other than not being able to really move your scattered body parts in your newly vulnerable state, this is honestly great.<br>\r\n<br>\r\nYou begin to lose track of time as the sun sets. You hear your stomach growl... right next to your ear. So that's where your torso fell. You decide it's probably a good idea to see about getting yourself back together. THe tribe is probably worried about you, as well.<br>\r\n<br>\r\nThe only problem is getting your body back together is proving to be incredibly difficult. You have little to no leverage on any of your limbs and you can't really prop any part of yourself up. Maybe this isn't as heavenly as you thought...<br>\r\n<br>\r\nJust then, you hear rustling in the bushes. You hope it's a search party from your tribe, but you worry at the other possibilities. Suddenly, something jumps out of the bush! It's...</span></div></div>",
            "created":1574994420,
            "id":2753206,
            "title":"Take a brief moment to enjoy the new sensation ..."
        },
        "144":{
            "author_id":"lurkingleapold",
            "author_name":"Bangle",
            "choices":[
                "try to put yourself back together!",
                "try to wake the coyote!",
                "try to call for help!",
                "try to figure out how to maneuver your parts without reassembling them!",
                "shriek in terror, as a witch emerges from the trees!"
            ],
            "content":"<div class=\"\"><div> <span>Either the gods have a very strange sense of humor, or else a witch has hexed this ground very deliberately for its high foot traffic.  From the foliage to your right you heard footsteps, though you were unable to discern if they belonged to a sentient or feral beast.  The footfalls grew in volume, and as they drew nearer a female voice accompanied them.  Still, you did not cry out, unaware if the voice belonged to a friendly tribe or rival villain.  Your tribe knew neighbors of both varieties.  Finally, a figure emerged from the clearing, a coyote of tan complexion and a lithe build, sporting the garb of messenger or scout.  You sighed with relief, the coyotes friendly to your tribe if not properly its ally.  You had just opened your mouth to speak when the coyote, noticing the blackened spot in the ground where the black bolt had dashed you apart and approaching it curiously, tripped over one of your wayward legs and fell directly onto the black spot.<br>\r\n<br>\r\nA second bolt of dark lightning streaked down from the heavens, striking the coyote in the small of her back and scattering her body parts as she shrieked in pain.  Just like you, she was broken into six parts; torso, limbs, and head, which were thrown about violently.  You yelped as her torso landed right on top of your head, the impact heavy but thankfully cushioned by her butt which now rested on your scalp.  Her head landed in front of yours, though while you were lucky enough to land in moss the right way up, she had landed on a hard patch of dirt on her side.  You heard a click, and saw the tip of a tooth fly out, though just like you the bolt had knocked her unconscious before she hit the ground.  When her parts had ceased raining down, and the ringing in your ears was again replaced by the sounds of the jungle, you blinked twice and retook stock of the situation.<br>\r\n<br>\r\nThat particular patch of ground was cursed or very special to the gods, you and a coyote scout had both stumbled on it within half a day of each other and were now scattered across the jungle floor in many living pieces, and night was fast approaching.  You were hungry, you were confused, and you wanted to be away from this cursed place and preferably back home before the nocturnal beasts and nighttime stalkers came out.  With these goals in mind, the first thing you do is...</span></div></div>",
            "created":1603164600,
            "id":2925105,
            "title":"...someone else who trips and also falls to pie..."
        },
        "15":{
            "author_id":"nobodyimp",
            "author_name":"nobodyimportant",
            "choices":[
                "Reverse your head once more.",
                "Swap the positions of your head and your junk."
            ],
            "content":"<div class=\"\"><div> <span>You really can't believe this. It's just too weird. No, it's impossible! You shut your eyes tight and try to wake up from whatever weird dream you're having. But instead of waking up, you start to feel very... light-headed.<br>\r\n<br>\r\nYou open your eyes and, to your further shock, you seem to be floating! What...? How...<br>\r\n<br>\r\nJust then, your other parts start to float too. They, along with your head, begin to swirl in a cloud of purple smoke. The world is spinning, or maybe that's just you, but when it stops you find yourself fully back together again!<br>\r\n<br>\r\nYou breathe a sigh of relief, but then suck it right back in as panic sets in once more. As you look down, you find that your head has been attached to your body backwards! This is somehow worse than being in pieces!<br>\r\n<br>\r\nYou instinctually reach up and push on the sides of your head, separating it once again from your body with an audible <i>pop.</i> Guess it wasn't a dream... You spin yourself around and fix your head, patting yourself all over to make sure everything else is in the right spot.<br>\r\n<br>\r\nYou start making your way back to the tribe when, much like the lightning earlier, inspiration strikes you. You can not only take yourself apart, but rearrange yourself at will. And, if you concentrate, you can even reassemble your entire body hands-free! This is too good of an opportunity to pass up. Before you head back, you decide you want to make an extreme fashion statement. Time to rearrange your body on purpose, but how?</span></div></div>",
            "created":1574993400,
            "id":2753202,
            "title":"Something magical happens!"
        }
    },
    "info":{
        "author_id":"airship-king",
        "author_name":"Airship-King",
        "brief_description":"You are a wolf anthro living with the rest of your tribe, when you one day become modular!",
        "created":1347914100,
        "description":"<td align=\"left\" class=\"norm\">You are an ordinary male wolf anthro, living with the rest of your tribe in an isolated jungle. One day however, while you are out away from the village, you are struck by a mysterious force and your body becomes modular!<br>\r\n<br>\r\nAbilities:<br>\r\n<br>\r\n1. You are the only member of your tribe that was (directly) affected by the blast that made you modular, so no one else has your abilities. However, while the other tribe members may not be modular, in addition to your ability to take yourself apart, you can also take others apart.<br>\r\n<br>\r\n2. Body parts remain under the control of whoever they were last attached to.<br>\r\n<br>\r\n3. While parts can be swapped with inanimate objects, it is entirely up to you whether such objects remain inanimate when attached to someone. That is, it's literally part of your abilities.<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\n1. Try to add at least a paragraph to each chapter.<br>\r\n<br>\r\n2. Nothing <i>too</i> explicit please.<br>\r\n<br>\r\n3. Good grammar is important!<br>\r\n<br>\r\n</td>",
        "id":1892061,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1605376920,
        "modified":1605376920,
        "pretty_title":"Modular tribe"
    }
}