{
    "chapters":{
        "1":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is your gender?</span></div></span></div>",
            "created":1361077200,
            "id":1534156,
            "title":"Gender"
        },
        "11":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Grass",
                "Fire",
                "Water",
                "more..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select your preferred type.</span></div></span></div>",
            "created":1361077200,
            "id":1534173,
            "title":"Pokemon Type"
        },
        "111":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Bulbasaur",
                "Treeko"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select a grass type.</span></div></span></div>",
            "created":1361077200,
            "id":1534176,
            "title":"Grass"
        },
        "1112":{
            "author_id":"pintoarcade",
            "author_name":"PintoArcade",
            "choices":[
                "Treeko",
                "Snivy",
                "FILL IN DA BLANK ALREADDDDY"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a Treeko? Or are you a different Starter Pokémon?</span></div></span></div>",
            "created":1529307480,
            "id":2508797,
            "title":"Treeko"
        },
        "112":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Charmander",
                "Cyndaquil",
                "Torchic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select a fire type.</span></div></span></div>",
            "created":1361077200,
            "id":1534178,
            "title":"Fire"
        },
        "113":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Squirtle",
                "Psyduck",
                "more..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select a water type.</span></div></span></div>",
            "created":1361077200,
            "id":1534179,
            "title":"Water"
        },
        "1133":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Totodile",
                "Mudkip"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More water types.</span></div></span></div>",
            "created":1361077200,
            "id":1534180,
            "title":"Water cont."
        },
        "114":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Electric",
                "Normal",
                "Fighting"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other types...</span></div></span></div>",
            "created":1361077200,
            "id":1534174,
            "title":"more..."
        },
        "1141":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Pikachu"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select an electric type.</span></div></span></div>",
            "created":1361077200,
            "id":1534182,
            "title":"Electric"
        },
        "11411":{
            "author_id":"firebreak",
            "author_name":"Firebreak",
            "choices":[
                "Chikorita",
                "Torchic"
            ],
            "content":"<div class=\"\"><div> <span>In the darkness of the midnight forest, lay a person whose mind faded in and out in irregular patterns during a dark and confusing night. He had no recollection of anything that happened before this time. All he knew was the erratic fading in and out. But a few hours (seemingly) passed until he began to take control of his consciousness. The black outs were still there, but they became less and less frequent until he managed to sustain a state of focus.<br>\r\n<br>\r\nAs he rose to his feet, he looked around and did a quick scan of the area to get a rough idea of where I was. <br>\r\n<br>\r\n<i>I seem to be in a forest, and there was a clearing ahead surrounded by an army of bright, lush, evergreen trees.</i><br>\r\n<br>\r\nHe peeked upwards into the sky and saw gray clouds escaping the light of the sun as it began it's conquest upon the once dark and sleepy land. And as the day lit up, so did he as he began to fully wake up.<br>\r\n<br>\r\nBut even though he woke up, he was still somewhat confused about the whole situation. <br>\r\n<br>\r\n<i>Huh? That's weird. I remember nothing about what happened yesterday. And even more strange... My body felt... Inhuman. I can't really place it, but my body just didn't feel like it belonged to a human being.</i><br>\r\n<br>\r\nAnd to confirm his suspicions, he looked at his paws. \"...W-what the?\" the cute, yellow rat stammered in surprise. He didn't have arms or hands, but yellow paws with stubby little \"fingers\" that looked like they were nowhere near as dexterous and adroit as human fingers would be, resulting in a rather surprised and disappointed rat-like animal. Or more accurately, Pokemon. Something immediately clicked in his mind that he wasn't a human, but a human turned pokemon!<br>\r\n<br>\r\n\"W-what!? W-why am I...?\" The Pokemon scrambled for something in the English language that could fully describe what happened and how, but to no avail. His scattered thoughts were interrupted as a stream of light struck is face.<br>\r\n<br>\r\nThe sun was beginning to rise above the mountains in the distance, giving them a beautiful, ethereal golden glow. And towards the mountains in the clearing surrounded by the trees was a small, fresh water pond right in the center. He walked toward it and immediately noticed his limited mobility due to his stubby legs.<br>\r\n<br>\r\n<i>Great. I have stubby legs and not-so-fast hands...</i> He grumbled to himself as he made his way to the pond. On the way, he quickly learned that his body was designed for primary movement on all fours. And once he started using his paws, he now traveled in a more comfortable speed than with only his hind legs.<br>\r\n<br>\r\nFortunately, it didn't take long to get accustomed to movement on all fours and he made it to the pond in no time. He stared at his reflection in the clear, blue water. Pikachu saw a yellow, rat-like Pokemon. He had two very large red dots on each side of his cheek, and long, slender, bunny-esque ears with a black tip. He also had a slim, furry body with two paws and feet that looked like enlarged almonds with toes. And to top it off, he had a long, zig-zaggy, yellow tail that extended from where his tailbone supposedly was to the top of the back of his head. There was no doubt it. He was a...<br>\r\n<br>\r\n<i>Pikachu. Just as I thought. Somehow I... I've been turned into a Pikachu.</i> The Pokemon confirmed in his mind that he was a Pikachu. He was still somewhat surprised, but most of it was offset due to his swiftness in learning quadrupedal motion. Due to that, he know that we was some sort of fox, or rat-like pokemon.<br>\r\n<br>\r\nThe sound of a rustling bush disturbed Pikachu's train of thought. He turned to the direction of the source of a sound and say the leaves of a bush moving about as if something was about to emerge. And as he stood there observing, a pokemon showed itself from it's bushy cover. The pokemon was a...</span></div></div>",
            "created":1377479400,
            "id":1651547,
            "title":"Arise"
        },
        "114111":{
            "author_id":"firebreak",
            "author_name":"Firebreak",
            "choices":[
                "They make their way to the Wigglytuff Friend Area shop"
            ],
            "content":"<div class=\"\"><div> <span>The sound of a rustling bush disturbed Pikachu's train of thought. He turned to the direction of the source of a sound and say the leaves of a bush moving about as if something was about to emerge. And as he stood there observing, a pokemon showed itself from it's bushy cover. The pokemon was a Chikorita. She abruptly froze in her tracks and her face lit up with a surprised expression as she laid her eyes on the alert Pikachu. They both stood there, eyeing each other until Chikorita began slowly walking towards him. The leaves of the trees were ruffled by the fresh wind and made a sound like that of the waves on the seashore. Chikorita stopped about 5-7 feet away from the Pikachu, whose heart was racing.<br>\r\n<br>\r\n\"H-hello. My name is Chikorita,\" she nervously started. \"Who are you?\"<br>\r\n<br>\r\n\"I'm P-pikachu, I guess,\" he replied. \"But, where am I? And you're a Pokemon, right? How are you able to talk?\" <i>This is getting weirder than I thought. Should I tell her that I'm a human?</i> <br>\r\n<br>\r\n\"Of course I can talk, silly!\" Her face lightened up. \"All Pokemon can talk!\"<br>\r\n<br>\r\n\"Have you seen any humans around?\" Pikachu replied to her, hoping to warm her up in case he should tell her he is, or was, a human.<br>\r\n<br>\r\nShe looked a bit surprised to have been asked that. She replied, \"No. Human's don't exist in the real world. They're only seen in myths, legends, and other lore.\" It was true, there are no humans, and their absence was common knowledge among the populace it seems.<br>\r\n<br>\r\n\"Huh, well that's funny. I remember being human yesterday,\" Pikachu replied, deciding to take the risk of telling her the truth. Understandably, she was taken aback by the statement and her mouth was agape in shock and disbelief.<br>\r\n<br>\r\n\"Really? But you look like a regular Pikachu in every way! You don't look like a human at all!\"<br>\r\n<br>\r\n\"Yeah, that's the problem. What's even worse is that I have no recollection of what happened yesterday, only the fact that I'm a human turned pokemon. Geez,\" Pikachu said as he scratched his head in frustration. \"But putting that aside, I woke up in a forest, and I don't really see any civilization anywhere. What I'm I gonna do?\" He started to tear up now that he'd thought about that, and Chikorita rushed over to him.<br>\r\n<br>\r\n\"Hey. C'mon, don't cry,\" she reassured him. \"I'll take you to a town. It's not far from here. Maybe you can find out what you can do from there!\"<br>\r\n<br>\r\nPikachu swallowed his tears and began to follow the grass pokemon to civilization. They went towards the mountains past the clearing and the sun was already rising above the apexes. The fresh wind brought a cool and relaxing atmosphere that helped calm down the distressed Pikachu. He followed Chikorita into a small area surrounded by lush trees, once again captivated by the beautiful sight of nature.<br>\r\n<br>\r\n\"They call this place Tiny Woods. It used to be a peaceful place, but now the pokemon here have become hostile and it turned into a Mystery Dungeon,\" Chikorita explained as they were walking through the forest. That same feeling of dread crept back into Pikachu as he regained his nervousness. <br>\r\n<br>\r\n\"Hostile? You mean we can get attacked? And what's a Mystery Dungeon?\"<br>\r\n<br>\r\n\"A mystery dungeon is a weird type of place. It changes every time you visit it, so it's never the same layout whenever you visit. Also, if you get knocked out you may lose some of your supplies and money. It's best to be careful,\" Chikorita calmly explained as to avoid unnerving Pikachu.<br>\r\n<br>\r\n\"Wow. Sounds like a video game to me,\" he said, recovering from the state of nervousness.<br>\r\n<br>\r\n\"Yeah well, that's what this Interactive Story is based on anyways.\"<br>\r\n<br>\r\n\"What?'<br>\r\n<br>\r\n\"Never mind. Let's just keep on walking,\" Chikorita said, cursing herself for breaking the fourth wall. \"Oh look! There's the exit! Pokemon Square is just up ahead!\"<br>\r\n<br>\r\n\"That's good! I'm kinda tired from all the walking,\" Pikachu said with a hint of relief. They both entered the square and it was bustling with Pokemon buying and selling. \"Wow! It's just like in the human world!\"<br>\r\n<br>\r\n\"I would imagine,\" Chikorita said with a giggle. \"I've been here many times and it always amazes me how it's so energetic here!\" They both stood there admiring the noisy town and how exciting it looked. Stars appeared in Pikachu's eyes.<br>\r\n<br>\r\nChikorita broke the silence, \"Alright. C'mon, let's get you a place to live.\"<br>\r\n<br>\r\n\"Y-yeah,\" Pikachu replied, breaking away from the trance.</span></div></div>",
            "created":1377735780,
            "id":1653320,
            "title":"Chikorita"
        },
        "1142":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Meowth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select a normal type.</span></div></span></div>",
            "created":1361077200,
            "id":1534183,
            "title":"Normal"
        },
        "1143":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Machop",
                "Cubone"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select a fighting type.</span></div></span></div>",
            "created":1361077200,
            "id":1534184,
            "title":"Fighting"
        },
        "12":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Grass",
                "Fire",
                "Water",
                "more..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select your preferred type.</span></div></span></div>",
            "created":1361077200,
            "id":1534186,
            "title":"Pokemon Type"
        },
        "121":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Bulbasaur",
                "Chikorita",
                "Treeko"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select a grass type.</span></div></span></div>",
            "created":1361077200,
            "id":1534194,
            "title":"Grass"
        },
        "122":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Charmander",
                "Torchic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select a fire type.</span></div></span></div>",
            "created":1361146620,
            "id":1534207,
            "title":"Fire"
        },
        "123":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Squirtle",
                "Psyduck",
                "more..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select a water type.</span></div></span></div>",
            "created":1361146680,
            "id":1534209,
            "title":"Water"
        },
        "1233":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Totodile",
                "Mudkip"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More water types.</span></div></span></div>",
            "created":1361148720,
            "id":1534222,
            "title":"Water cont."
        },
        "124":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Electric",
                "Normal",
                "Fighting"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other types...</span></div></span></div>",
            "created":1361148840,
            "id":1534223,
            "title":"more..."
        },
        "1241":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Pikachu"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select an electric type.</span></div></span></div>",
            "created":1361149080,
            "id":1534226,
            "title":"Electric"
        },
        "1242":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Eevee",
                "Skitty"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select a normal type.</span></div></span></div>",
            "created":1361149140,
            "id":1534227,
            "title":"Normal"
        },
        "12422":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "She's Confused",
                "She's Angry"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.5;\">          The wind blew gently through Pokemon Square.  It was far too early for anyone to be awake.  The sun had just risen over the ocean overlooking the Pelipper Post Office, though despite the chilling wind and the earliness of the day, the Pelipper were already making their postal deliveries to the awaiting Pokemon.  Whiscash Pond was silent, the water rippling gently and the leaves gently shaking.  Even the upcoming Makuhita Dojo was silent, its workers slumbering before they were to get back to work.<br>\r\n          Beyond this beautiful little town, there was the Tiny Woods.  A lone Pokemon lay sleeping in the cold, her tail twitching gently as she dreamed peacefully out in the open.<br>\r\n<i>What a nice dream...</i> she thought.  <i>It seems so real.  It's like none I've ever had before!</i><br>\r\n          Of course, lying out in the open does attract peering eyes, and soon her sweet dream was dashed with a small voice.<br>\r\n\"Hey!  What are you doing lying out here?  You'll catch a cold if you sleep out here in the forest!  C'mon, get up!\" urged the friendly voice, followed by some nudging.<br>\r\n          The cute cat-like creature blinked her eyes gently as she stretched out and yawned, showing off a set of sharp front teeth.  She stood tall, a large tail dangling over her head.  Her fur looked soft and delicate, and it was a light pink color.  On the end of her tail were three long, yellow hairs.  She sat down, giving a look of confusion to the person before her.<br>\r\n\"Who...  Er...  What are you?\" she mewed, not giving any notice to her somewhat off figure.<br>\r\n\"Me?  I'm Shinx!\"  exclaimed the blue furred Pokemon.  His yellow star-tipped tail wagged happily as he smiled at her.<br>\r\n          The girl seemed to flush at the name.  She finally began to realize something a bit off.  He was a Pokemon, and yet he was talking.  Not only that, but he seemed a lot taller than he should be.  She looked down to her feet, which now, in a way, looked like paws.  And oddly, there was a tail swishing right beside her.  She knew exactly what tail that belonged to.  A Skitty.</span></span></div></div>",
            "created":1365908760,
            "id":1571263,
            "title":"Skitty"
        },
        "124221":{
            "author_id":"firebreak",
            "author_name":"Firebreak",
            "choices":[
                "They make their way to the Wigglytuff Friend Area shop",
                "Shinx went to go buy something from the Kecleon brothers first"
            ],
            "content":"<div class=\"\"><div> <span>The cute, pink kitten-like pokemon blinked her eyes more than twice before she began to realize what was going on. Her mind raced with all sorts of jumbled up thoughts as she stood there frozen with an equally confused Shinx staring at her. After a few awkward minutes of silence, Shinx spoke to her.<br>\r\n<br>\r\n\"H-hey. You alright?,\" he said with a somewhat concerned expression. \"You were spacing out.\"<br>\r\n<br>\r\n\"Y-yeah. I'm fine. It's just... It's just that I'm surprised. I'm supposed to be a human, yet somehow I turned into a Skitty,\" she replied in the most straightforward manner. Now Shinx was surprised.<br>\r\n<br>\r\n\"Human? But you look like a regular old Skitty! You don't look like a human at all,\" he said with his ears downcast.<br>\r\n<br>\r\n\"Yeah, that's what confuses me,\" Skitty said with her ears downcast as well. <br>\r\n<br>\r\nAt this time, the rest of the town began to wake up. Sounds of business and work were become increasingly louder as the Kecleon Brother's opened their shop, and the Kangaskhan Storage warehouse turned it's lights on. The sun was shining brighter than before, and it's rays covered the town in a lovely glowing, golden light. As Skitty stood agape at the beautiful sight of the town, Shinx once again broke the silence.<br>\r\n<br>\r\n\"It's pretty, isn't it,\" he said, amazed himself with little stars twinkling in his eyes.<br>\r\n<br>\r\n\"Yeah,\" Skitty replied as her breath was taken at the view. And the both of them stood there silently, admiring the town as it began to get more active under the golden morning sun.<br>\r\n<br>\r\n\"C'mon. We gotta get going,\" Shinx said, breaking the mood. \"Let's get you a place to sleep.\"<br>\r\n<br>\r\n\"Y-yeah,\" Skitty said, snapping out of it.</span></div></div>",
            "created":1377620280,
            "id":1652425,
            "title":"Confusion"
        },
        "1242212":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "They're out of stock..!",
                "Finally, some merchandise!"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.5;\">\"Before we do anything, I need to stop by the Kecleon Shop,\" Shinx explained.<br>\r\n          The Skitty gave a look of both impatience and confusion.<br>\r\n\"It'll only take a second!  It's really important!\" he added quickly, flicking his tail before setting off, the kitten-like pokemon following close behind.  \"So, eh... I never caught your name before,\" Shinx started, attempting to break the awkward silence.<br>\r\n\"My name? I, uh... It's Carsen,\" she replied quietly.  <i>This is weird.  I can hardly remember anything from before.  All I can remember is my name, and that I was a human before...  Who am I?</i>  She flicked her ears in confusion as she continued to ruminate in quiet.<br>\r\n\"Well...\" Shinx snickered loudly, a few sparks flashing from his tail as it wagged with amusement.  \"Carsen is a funny name!\"<br>\r\n          Carsen glared and stuck her tongue out at him.<br>\r\n          Shinx smiled with delight before continuing to talk, trotting his way through the town square.  There were many pokemon here today, mostly talking with one another rather than shopping.<br>\r\n\"It's a pleasure to meet you, Carsen,\" Shinx said with a friendly tone.  He stopped suddenly in front of what appeared to be a smallish building that was a work in progress.  Inside sat two Kecleon, one green and one purple.  The appeared to be having a friendly bicker before they noticed the two of them.<br>\r\n\"Oh, look, my brother!  Customers!\" sang the purple Kecleon.<br>\r\n\"It appears to be our usual, Mr.Shinx!  What can we do for you today?\" the green Kecleon joined in, seeming rather chipper to see Shinx.<br>\r\n\"I need two Oran Berries and an Apple today, please,\" Shinx requested impatiently, placing a few golden coins on the counter.</span></span></div></div>",
            "created":1389329100,
            "id":1724876,
            "title":"The Kecleon Brothers"
        },
        "12422121":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "A new home",
                "Something happens..!"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.5;\">\"Oh..!  You came here with the intention of purchasing something?\"  The green Kecleon asked, now seeming a bit down.<br>\r\n\"Funny thing about that...  We are actually all out of stock!\" The purple Kecleon explained.  \"It was Team Meanies, I believe, that cleaned us up.\"<br>\r\n          Shinx gave a look of worry and nodded.<br>\r\n\"What's wrong, Shinx?  Who's Team Meanies?\" Carsen asked, tilting her head in confusion.<br>\r\n          The three pokemon stared at her in shock.  It was almost as if she were missing out on something, so she decided to sit, her tail swishing with curiousity.<br>\r\n\"Team Meanies,\" Shinx started,\"Is the most selfish and cruel rescue team there is.  They're only in it for the money, I think...  They target some people, whole rescue teams even!  If you ever get their attention, you must have something they want...\"<br>\r\n\"Yes, yes, yes... Gengar and his team are bad news, Miss.Skitty,\" the green Kecleon warned.<br>\r\n\"Best to stay away, far, far away!\" Joined in the purple Kecleon.<br>\r\n          Shinx nodded in agreement before letting out a depressed sigh.  He took back the coins and turned back to Carsen.<br>\r\n\"I guess we'll have to go out and find the supplies...\" He huffed.  \"Follow me, I have a place where you can sleep tonight, if you're interested.\"<br>\r\n          Carsen nodded before following Shinx out of town.  She glanced back at the town, which had started to grow quiet, as the sun had begun to set and left the place glowing a golden yellow.</span></span></div></div>",
            "created":1389374220,
            "id":1725102,
            "title":"Out Of Stock"
        },
        "124221212":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "The Tiny Woods"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.5;\">          Shinx led Carsen down a long path, engaging her in some small talk as they journeyed forward.  She didn't pay much attention to him at all, just occasionally nodding in agreement and mumbling out a few words of response.  All she could seem to do was think.  <i>I'm a human!  I know I'm a human!  A human girl with blonde hair and blue eyes!  There's no way I'm a pokemon, let alone a Skitty!  How did this happen; no... Why did this happen?  Who am I?</i><br>\r\n\"Well, this is it!\" Shinx introduced, stepping aside to allow Carsen optimum viewing privilege.  What he had led them to appeared to be a small hut-like place.  It had a small pond and a nice grassy yard, along with a sweet mailbox out front.<br>\r\n          Carsen was at a loss of words.  <i>Wow..!  I'm... Really happy!  I can't even explain it!  I really like this place...  Maybe this is how it feels to want to wag your tail...</i><br>\r\n\"I can tell you like it!\" Shinx said happily, giving a look of joy.  \"I made this place myself, and have been living here, but I don't mind sharing it with you.\"<br>\r\n\"It's really cool, Shinx...  Thank you so much!\" Carsen exclaimed, a purr emanating from her.<br>\r\n\"I'm glad...  I was sure you would like it..!\" he replied, flicking his tail.<br>\r\n          Just as Shinx was about to tour her around the base, a loud cry could be heard from afar.<br>\r\n\"What was that..?\" Shinx asked, cocking his head in confusion.<br>\r\n\"It sounds like a cry for help...  Coming from that way!\" Carsen answered, quickly darting in that direction.  \"Let's check it out!\"<br>\r\n          Without even have given the time to respond, Shinx quickly followed after.  It wasn't long until they came upon a panicked and distraught Butterfree.<br>\r\n\"Oh no, oh no, oh no!  My poor baby!' she cried out, tears falling from her eyes.<br>\r\n\"Whats the matter..?\" Shinx asked, approaching this new figure.<br>\r\n\"My poor Caterpie is lost!  A fissure opened up and he fell in!  I tried to go after him, but I was attacked... The pokemon...  They're in an uproar!\" she explained, continuing to sob.<br>\r\n\"Oh no...\" Shinx responded, a look of panic on his face.  \"Carsen, this is a job for a rescue team..!\"<br>\r\n          Carsen sat for a moment before charging into the forest, a look of determination on her face.<br>\r\n\"W-Wait..!  Carsen!  That's a Mystery Dungeon!  It's dangerous!\" Shinx called after her, now almost as panicked as the Butterfree.<br>\r\n\"I don't care!  This kid needs help right now!\" she shouted back at him before disappearing into the thicket.</span></span></div></div>",
            "created":1389413340,
            "id":1725338,
            "title":"First Mission: Butterfree and Caterpie"
        },
        "1243":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Cubone"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select a fighting type.</span></div></span></div>",
            "created":1361149200,
            "id":1534228,
            "title":"Fighting"
        }
    },
    "info":{
        "author_id":"poppingcorn",
        "author_name":"Fredmom",
        "brief_description":"Make your own Pokemon rescue team and restore natural order to the Pokemon universe!",
        "created":1361142000,
        "description":"<td align=\"left\" class=\"norm\"><div align=\"center\"><b>~INTRODUCTION~</b></div><br>\r\n          You were just a normal and average human with no other goals but to raise and train your loving Pokemon and beat the Elite Four and become the most powerful Pokemon trainer known to man!  But the day of your 10<sup>th</sup> birthday, something strange happens.  When you wake up, you find nothing at all is right!  You're a Pokemon!  But how could this be..?<br>\r\n<br>\r\n<div align=\"center\"><b>~RULES~</b></div><br>\r\n1)  No Godmodding<br>\r\n2)  Have some idea of the <i>Pokemon Mystery Dungeon</i> games.  Go checkout some of the playthroughs, or look at this article to see a full overview of the first two games! <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://bulbapedia.bulbagarden.net/wiki/Pok%C3%A9mon_Mystery_Dungeon:_Red_Rescue_Team_and_Blue_Rescue_Team\" target=\"_blank\">http://bulbapedia.bulbagarden.net/wiki/Pok%C3%A9mon_Mystery_Dungeon:_Red_Rescue_...</a><br>\r\n<br>\r\n<div align=\"center\"><b>~DISCLAIMER~</b></div><br>\r\nTHIS IS BASED OFF OF THE POKEMON MYSTERY DUNGEON GAMES FOR BOTH GAMEBOY AND NINTENDO DS/DSI/3DS.  I DON'T OWN ANY RIGHTS TO THE CHARACTERS OR ORIGINAL STORYLINE.</td>",
        "id":1919995,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1529307480,
        "modified":1529307480,
        "pretty_title":"Pokemon Mystery Dungeon"
    }
}