{
    "chapters":{
        "1":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "You are 1 foot tall.",
                "You are 6 inches tall.",
                "You are 2 inches tall.",
                "You are 1/2 inch tall."
            ],
            "content":"<div class=\"\"><div> <span>\"Really?\" Evelin huffed, \"you bought one?\"<br>\r\n<br>\r\n\"Yeah,\" you answer nervously, \"I was thinking... you know ...\"<br>\r\n<br>\r\n\"What!?\" Evelin quickly retorted as she crossed her arms and started to tap her right foot on the ground. The black flat she wore tapping on the tile floor of the living room like a metronome.<br>\r\n<br>\r\nYou wipe the sweat from your brow. \"I was thinking... um... that perhaps we could play with this machine... and... um you know... shrink me and let me... you know.\"<br>\r\n<br>\r\nEvelin rolled her eyes. \"How much did this cost?\" she interrogated as she stomped towards it and looked over the controls. \"This looks really expensive.\"<br>\r\n<br>\r\n\"It wasn't too bad.\" you lie.<br>\r\n<br>\r\n\"TWO THOUSAND DOLLARS!\" she shouted in disbelief as she lifted up the price tag still attached to the machine. You forgot to take it off and now you feel really stupid.<br>\r\n<br>\r\n\"Come on babe,\" you plead, \"this is an opportunity for me to indulge in my biggest fantasy. You know I want to be shrunk.\"<br>\r\n<br>\r\n\"We can't afford this!\" she cried back.<br>\r\n<br>\r\n\"Look...\", you begin to reason, \"Let's give it a shot and try it out. We can return it for a full refund within 14 days. Just please try it. For me. You never know you might like it. Please.\" Evelin glares at you while you placed your palms together and bring them up to your face pleading. \"Please babe.\" She rolls her eyes.<br>\r\n<br>\r\n\"Fine\", she snorts, \"how do we do this?\"<br>\r\n<br>\r\nYou clap excitedly and show her the button she needs to press. You've already set up the machine to your desired height. You begin to take your clothes off as the shrinking process can cause injury if you are wearing any clothing during the shrinking process.<br>\r\n<br>\r\n\"There's a warning here not to shrink live animals and humans,\" she queries while you continue to get undressed.<br>\r\n<br>\r\n\"Yeah, it's okay, it's just so the company isn't liable for anything that happens to us,\" you explain as Evelin silently questions why you are getting naked. \"I have to,\" you reply to her unspoken question, \"else my clothes might shrink before I do and hurt me.\"<br>\r\n<br>\r\n\"Whatever,\" she replies displeased. You kiss her gently on the cheek as your enter the chamber. \"Thank you babe,\" you whisper. You close the door behind you and stand in the middle of the cold dark chamber. \"PUSH THE BUTTON!\", you yell through the door. The machine suddenly whirs to life and you are blinded by a sudden burst of life. You cover your ears over the sound of the chamber and stumble slightly in confusion. The sound stops and you blink repeatedly to restore you eyesight. The door to the chamber opens and you are suddenly in glorious awe at the massive size of Evelin. IT WORKED! <br>\r\n<br>\r\nEvelin just stares blankly down at your diminutive size.</span></div></div>",
            "created":1562389200,
            "id":2683229,
            "title":"Surprise!"
        },
        "12":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Give you a foot massage?",
                "Rub your pussy?",
                "Evelin suggests an idea"
            ],
            "content":"<div class=\"\"><div> <span>You run excitedly towards the massive entrance to the chamber. You reach the lip of the entrance and climb over it. You then crane your neck and stare up at your huge girlfriend. She's still wearing her work outfit. A pair of jeans and a red shirt. Her hair is tied back in a pony tail and she pushes some loose strands of hair behind her ear as she stares down at you. She shuffles her feet in her black flats which instantly arouses you as the shoes creak and buckle.<br>\r\n<br>\r\n\"And now?\" Evelin questions as she slowly lowers onto her haunches to get a closer look at you. \"Look how excited you are already\", she comments as she pushes down on your erection with the tip of her massive index finger. Your penis springs back up as her finger passes down and Evelin giggles at its reaction. \"You're so cute like this\", she then coos.<br>\r\n<br>\r\n\"So...\", you begin nervously.<br>\r\n<br>\r\n\"I can't hear you\", Evelin informs.<br>\r\n<br>\r\n\"SO...\", you repeat louder, hoping Evelin will come up with a suggestion first.<br>\r\n<br>\r\n\"Yes?\", she questions innocently.<br>\r\n<br>\r\n\"Can I... uh...\"You nervously stammer as Evelin tilts her head to await your request. \"...uh... Can I...</span></div></div>",
            "created":1562389200,
            "id":2683231,
            "title":"6 Inches Tall."
        },
        "121":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "\"Fine...\" she sighs.",
                "\"No!\" she snaps."
            ],
            "content":"<div class=\"\"><div> <span>Evelin giggles. \"You...\", she laughs,\" want to give me... a foot massage... at this size?\"<br>\r\n<br>\r\n\"Please,\" you plead.<br>\r\n<br>\r\n\"Come on Ron! You think you can give me a foot massage at this size? Just be honest. You want to fuck my feet?\"<br>\r\n<br>\r\n\"Yes please,\" you yell excitedly as Evelin just continues to stare at you in silence.<br>\r\n<br>\r\n\"No!\", she shoots back. You feel dejected. \"You asked to massage my feet so you will massage them.\" Evelin's right hand than encircles your body and you are lifted off the floor as she rises up to her full height. You are dizzy with the sudden launch but delirious with joy and excitement with finally having your fantasy become a reality. You are deposited onto the coffee table as Evelin flops down in the couch in front of you. She brings her left foot on top of her right knee and with both hands pops her shoe off. She then stretches her leg out and with a loud thud, her giant left foot is slammed right in front of you as you stare at her enormous sole. She repeats with the other foot and you are face to face with two giant feet. They are slightly dirty from having been in her shoes all day. You can smell some sweat and foot odor. You prefer clean feet. Suddenly both feet rotate 90 degress away from each other and you stare at Evelin's grinning face that appears miles away.<br>\r\n<br>\r\n\"Well...\", she beckons, \"start massaging my feet, I've been on them all day and they need some good TLC.\"<br>\r\n<br>\r\n\"Um...\", you query, \"Can you uh... wash them first, they're a little dirty.\"<br>\r\n<br>\r\nEvelin's grin disappears and she scowls down at you, annoyed.</span></div></div>",
            "created":1562389200,
            "id":2683234,
            "title":"Foot Massage?"
        },
        "1211":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Let me get you off.",
                "Let me paint your toenails."
            ],
            "content":"<div class=\"\"><div> <span>With an annoyed sigh, Evelin drags her feet off the coffee table and strolls to the washroom.<br>\r\n<br>\r\n\"Let me help you clean them\", you suggest.<br>\r\n<br>\r\n\"No!\" she shouts back as she disappears behind the living room wall. You wait patiently on the coffee table as your hear the bathtub faucet turn on and splashing sounds as Evelin washes her feet. You pace in circles until you hear the faucet suddenly stop and then silence. You wonder what's taking so long, but it probably hasn't even been 3 minutes. You hear the medicine cabinet open and close and then approaching booms and increasing ground shakes indicate Evelin's return.<br>\r\n<br>\r\nShe drops down onto the couch and carefully raises her feet up so you can inspect her soles.<br>\r\n<br>\r\n\"Good enough?\" she snarls as she wiggles her toes. You burst with excitement at the sight. 10 glistening toes and a freshly cleaned sole.<br>\r\n<br>\r\n\"Yes\", you clap.<br>\r\n<br>\r\n\"Good\", Evelin continues, \"wouldn't want to disgust my boyfriend with my dirty feet after working a full day while he lounges around and does nothing.\" You sigh. You lost your job recently and have been struggling to find work. It's been putting a strain on the relationship recently but you pushed that thought aside as two huge feet barrel toward you. Once again, you stare at the enormous soles of your girlfriend's feet. You can smell the soap on them and they are still slightly wet from the bath. Her toes wiggle high above your head.<br>\r\n<br>\r\n\"Here,\" Evelin says as a giant lotion bottle appears in the air above you, \"I want you to rub this on my feet.\" She squeezes the bottle and gallons of lotion drop onto the coffee table beside you. She then lowers the bottle onto the table and retreats back to the couch and taps away at something on her phone. You stare at the mass of lotion and then over at Evelin's perfect feet. You've rubbed those feet at your normal size when Evelin would let you. Feeling the wrinkles, the soles, the balls, the toes but now, now they are dominating. The same wrinkles and soles and balls and toes. Even the tiny mole she had on her left sole, now the size of a basketball. You are overcome with lust. This is a moment you have only dreamed of. You never thought it would be possible, but once you heard of the DownSizer, you have paced relentlessly for an opportunity to get one and shrink yourself. You reach out and gently touch the massive sole in front of you. You feet the cool dampness of the skin. It's smooth too. You rub your hand up and down and then you place both hands and rub them up and down. You lean in to bury your face into the sole but almost loose your balance as the mass suddenly lifts up and you are staring down Evelin's leg at her puzzled face.<br>\r\n<br>\r\n\"Hey,\" she clicks as she snaps her fingers at the lotion, \"start rubbing.\" Before you can respond, her face disappears behind the sole as it lowers in front of you. You walk over and grab some lotion then return and rub it onto her sole. It glides over her skin and leaves a scented glean. Your urges grow and pulse with each swipe of your hands over her delicate foot. You find yourself standing closer and closer to her sole. Wanting to be absorbed by it like the lotion. You gently kiss it and sniff it. Your one hand swipes down to your groin and you begin stroking your dick. You're moaning now. Over come with lust. This is your fantasy. You can't hold back. You sink your face into the sole and inhale deeply as your rub her sole with one hand and stroke your cock with the other. You close your eyes and tense up as you're close. Inhaling more foot scent and rubbing your whole face across the smooth sole. You moan loudly as you spew a load onto Evelin's massive foot. The sole you're leaning against suddenly lifts and you stumble around to regain your balance as you open your eyes to see Evelin swing her foot over to her opposite knee to inspect the sole.<br>\r\n<br>\r\n\"Did you just come on my foot?\" she interrogates as she studies the minuscule droplets of cum running down her sole. She daps at them with her index finger. \"Eww!\" she cries out disgusted. \"You just came on me.\" She then angrily stares at you. \"What's wrong with you!?\"<br>\r\n<br>\r\n\"Evelin, come on, you know this is my biggest fantasy\", you reason.<br>\r\n<br>\r\n\"So you can just come on me whenever you like?\"<br>\r\n<br>\r\n\"I'm sorry\", you reply meekly.<br>\r\n<br>\r\n\"Why can't you be a normal boyfriend\", Evelin asks rhetorically, \"like why are you so obsessed with shrinking and feet?\"<br>\r\n<br>\r\nThere's an uncomfortable silence. You glance over at Evelin's other foot that is still on the coffee table. She notices you staring at it and shifts it towards her and lowers the foot onto ground so it is out of your sight. \"I don't like this\", she says, \"let's get you back to size and I want that machine out of the apartment.\" She shifts forward to pick you up.<br>\r\n<br>\r\n\"No, please\", you plead, \"come on, let me make it up to you.\" Evelin freezes with her hand just inches away from grabbing your body.<br>\r\n<br>\r\n\"How?\"</span></div></div>",
            "created":1562475600,
            "id":2683248,
            "title":"Clean Feet"
        },
        "1212":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "You lick her feet",
                "You refuse"
            ],
            "content":"<div class=\"\"><div> <span>\"You want my feet clean? You can clean them yourself,\" she stammers and her face is suddenly replaced by her two giant, dirty soles as she uprights her feet directly in front of you.<br>\r\n<br>\r\nYou stare at her wrinkly soles as she taps away on her cellphone on the couch.<br>\r\n<br>\r\n\"How am I supposed to clean your feet?\" you ask. Evelin rotates her feet away from each other and you see her disappointed face appear again in the distance.<br>\r\n<br>\r\n\"I don't know,\" she replies uncaringly, \"why don't you lick them clean, hmm?\" The two massive feet in your face suddenly sway left and right as Evelin wiggles her toes. \"Come on Ron,\" she beckons, \"lick my dirty feet.\"</span></div></div>",
            "created":1596586980,
            "id":2880731,
            "title":"\"No!\" she snaps."
        },
        "12122":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "...I'll get you what you need.\"",
                "...I'll go relax by myself in the bedroom then.\""
            ],
            "content":"<div class=\"\"><div> <span>You cross your arms and storm off to the other end of the coffee table. Evelin giggles as she watches you have your hissy fit.<br>\r\n<br>\r\n\"What's wrong little Ronny?\" she teases. \"I thought you LOVED my feet.\" You glare angrily at Evelin and then look away. \"Are you actually mad at me?\" she asks, \"it was just a joke.\"<br>\r\n<br>\r\nYou turn to look at her cheeky grin and then make a dramatic effort to look away in anger, to show your displeasure at her jokes. Why won't she just let you have some fun?<br>\r\n<br>\r\nAn uncomfortable silence follows. Suddenly, you crouch to steady yourself as the table shakes and you look over to see Evelin slide her feet off the table and then rise up off the couch. She stares down at you the whole time.<br>\r\n<br>\r\n\"Why do you have to be such a sour puss?\" she snarls, as she places her hands on her hips. You stare tepidly at her un-amused face miles above you.<br>\r\n<br>\r\n\"FINE!,\" she blurts out, \"...</span></div></div>",
            "created":1596587640,
            "id":2880734,
            "title":"You refuse"
        },
        "121221":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "You begin washing her feet",
                "You demand she wash her own feet"
            ],
            "content":"<div class=\"\"><div> <span>Evelin disappears and you hear your rummaging in in the washroom. You feel small tremors in the coffee table as her increasingly loud footfalls announce her return. She stops in front of the coffee table and carefully places down a bowl of warm water and a face cloth. She winks and smiles at you as she returns to her seated position on the couch.<br>\r\n<br>\r\n\"There you go,\" she coos, \"everything you need to wash my feet and make them all pretty for you.\" You stare straight ahead as your giant girlfriend leans back in the couch and raises her legs to stretch out her two huge feet onto the coffee table in front of you. She wiggles her toes and giggles as she watches you stare at them.<br>\r\n<br>\r\n\"Well...,\" she comments, \"what are you waiting for? My feet aren't going to wash themselves.\"</span></div></div>",
            "created":1596588180,
            "id":2880740,
            "title":"...I'll get you what you need.\""
        },
        "1212212":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "you're smaller.",
                "you're larger."
            ],
            "content":"<div class=\"\"><div> <span>\"You're joking? Right!\" Evelin asks in shock.<br>\r\n<br>\r\n\"Come on,\" you plead, \"I've been looking forward to this all day, all I ask is that you just clean your feet so I can live out my fantasy, come on, you know this really turns me on. Why won't you just do this for me?\"<br>\r\n<br>\r\nEvelin slides her feet off the coffee table and slams them onto the ground as she leans forward and glares down at your tiny frame on the coffee table below her.<br>\r\n<br>\r\n\"So let me get this straight,\" she begins, \"I come home from a LONG day at work to find my boyfriend, who doesn't have a job by the way, and doesn't earn any money, at home all day. Doesn't have dinner ready for me, didn't even bother cleaning up.\" Evelin looks with disgust about the room. \"Instead,\" she continues, \"he spends 2000 dollars that we don't have on something that we don't need just so he can jerk off to my FEET! TWO THOUSAND dollars of MY money by the way at this point.\" You slowly back away from Evelin's angry face.<br>\r\n<br>\r\n\"All I ask for is just ONE thing... just clean my feet,\" she blasts, \"just clean my feet and then you can do whatever the fuck you want with them, rub the soles, fuck my toes, whatever you wanted and INSTEAD, you complain that I don't do enough for you?\" Does that sound like the relationship is fair? she asks.<br>\r\n<br>\r\nYou just stare uncomfortably at her displeased face. \"Well,\" she asks again, \"do you think that it's fair that I have to earn the money, make dinner, clean the house AND clean my feet while you just get to jerk off?\"<br>\r\n<br>\r\nYou stare awkwardly at the floor in front of you, trying to avoid your massive girlfriends annoyed glare.<br>\r\n<br>\r\n\"I'll clean my feet,\" Evelin states. You look up at her with a bit of excitement, \"After I squish you,\" she adds cruelly. You jump back in fright. A slight smile escapes your girlfriends lips. \"What difference would it make in my life,\" she lamented, \"after I wash your guts off my feet, I still have to earn money, make dinner, clean the house but then I don't have some annoying, loser boyfriend spending my money! Sounds like that's a better deal. Hmm, don't you think?\" she smiles down at you. \"Should I squish you?\"<br>\r\n<br>\r\n\"Evelin,\" you timidly reply, \"come on, I'm sorry, I'll clean your feet.\"<br>\r\n<br>\r\n\"Oh No!,\" she spits back, \"we're well passed than, in fact, I have a better idea.\" Before you can react, she quickly stretches our her hand and engulfs you in her grip. You are lifted from the table and carried over to the DownSizer machine.<br>\r\n<br>\r\n\"Evelin! What are you doing?\" you ask fearfully, as she lowers onto the cold ground and stands back up.<br>\r\n<br>\r\n\"You'll see,\" she retorts and then slams the door closed. The machine roars to life moments later and you are blinded by the intense light and block your ears to drown out the deafening sounds. Eventually it all stops and you breath a sigh of relief only to be blinded again as the door to the DownSizer swings open. You look up at your grinning girlfriend standing at the entrance and realize...</span></div></div>",
            "created":1596589500,
            "id":2880752,
            "title":"You demand she wash her own feet"
        },
        "12122121":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "go make dinner.",
                "go for a walk."
            ],
            "content":"<div class=\"\"><div> <span>Evelin claps her hands in excitement while she bounces on her toes before bending down and gripping you between her thumb and finger to lift you up to her face.<br>\r\n<br>\r\n\"Evelin, what are you going to do to me?\" you ask nervously.<br>\r\n<br>\r\n\"Well,\" she replies while walking towards the bedroom, pick something up from the washroom along the way, \"I figured why don't I get something I DESERVE for a change rather than just doing everything YOU want.\" She slowly lowers her self onto the bed.<br>\r\n<br>\r\n\"And what do girlfriends deserve?\" she ask rhetorically, while lowering you down onto the bed sheet. She pushes her finger onto your stomach, pinning you onto your back. She raises her eyebrow waiting for an answer.<br>\r\n<br>\r\n\"I..I..,\" you stammer, \"I don't know, hugs and kisses?\"<br>\r\n<br>\r\n\"No silly!,\" she giggles and then grips your leg and flips you onto your stomach. \"girlfriends deserve gifts. And what better gift to give your loving girlfriend than jewelry.\" A shadow passes over head and with a tremendous thump, you feel Evelin's heavy toe press down onto your back, mushing you into the bed spread. Evelin pinches her left arm and wraps it upwards and over the top of her toe lumbering on your body.<br>\r\n<br>\r\n\"And since you never give me any jewelry or even gifts,\" she continues as you feel her tighten a loop of dental floss around your left wrist as she pinches your right arm and raises back up over the toe towards the left one, like you were being handcuffed. \"I figure why not turn you into the perfect gift for me?\" she chuckles as she tightens both your wrists together over the toe resting uncomfortably atop your entire back. The pad pushes your face down into the mattress she finishes bounded your wrists together. You hear the sound of scissors sliding across a desk and then the unmistakable sound of extra thread being snipped.<br>\r\n<br>\r\nYou groan as the bounds are uncomfortable and too tight on your wrists. \"Oh hush!\" Evelin replies as her toe presses your body down into the mattress, expelling the air from your lungs, before relieving the pressure. Your girlfriend grips your left leg and forces it up against her toe and towards your bound wrists as your groan again in discomfort. \"And what better gift to turn my neglectful boyfriend into then a piece of jewelry.\" she teases as you feel her wrap another thread around your left ankle before gripping your right leg and forcing it up towards the left one close to your bound wrists.<br>\r\n<br>\r\n\"And what would be the perfect piece of jewelry to turn my boyfriend into,\" she continues as she wraps thread around your right ankle and then your wrists and bounds all four limbs together. You groan loudly as pain shoots through your body as your muscles strain from being stretched to their limits. The thread is tightened and your limbs are tied together as you are wrapped uncomfortably around Evelin's toe. <br>\r\n<br>\r\nYou girlfriends finger and thumb grip your sides and she rotates you around her toe, you face turn from facing the bed sheet beneath her heavy foot to staring up at the ceiling and Evelin's smiling face before it while your bound limbs are position between her toe and the bed.<br>\r\n<br>\r\n\"And there we have it,\" Evelin gloats as she rubs your tummy, \"my foot loving boyfriend is now my pretty little toe ring!\" Your girlfriends massive, grinning face shrinks away as she stretches out her leg and raises her foot towards the ceiling to get a better look at her new toe ring. She clenches her toes and you feel like your bones are almost going to pop out of their sockets as the bones in her toe contort your back outwards. Your wrists strain painfully against the bound thread holding them to your ankles. You cry out in agony.<br>\r\n<br>\r\n\"Oh does that hurt?\" Evelin coos as she relaxes her toes and then evilly grins again before clenching her toes once more, taking delight in your anguished cries. He face grows again as she brings her foot back down to the bed in front of her. She taps your stomach and then grips your sides and wiggles you slightly against her toe, testing to make sure you won't easily fall off. She then  lightly flicks your boner.<br>\r\n<br>\r\n\"You like being my toe ring don't you?\" she teases. \"And you look so cute wrapped around my toe,\" she adds.<br>\r\n<br>\r\nThe would spins as your girlfriend swings her feet over the bed and lowers them to the floor. You fell your bound hands and feet make contact with the cold floor as her toe presses them down. You stare up her legs as she stands up and grins down at you.<br>\r\n<br>\r\n\"Come,\" she says, \"Let's...</span></div></div>",
            "created":1596591300,
            "id":2880762,
            "title":"you're smaller."
        },
        "123":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "You start cleaning the shoes.",
                "You storm furiously into the bedroom."
            ],
            "content":"<div class=\"\"><div> <span>\"I've got an idea!\", Evelin shouts as she quickly rises up and scurries into the main bedroom, leaving you all alone in the huge living room. You tepidly walk around admiring your surroundings. The massive coffee table, the huge TV, the large couch, the imposing bar chairs at the kitchen counter. Booms and creeks in the ground announce Evelin's return as she walks back into the living room holding something behind her back.<br>\r\n<br>\r\n\"Since you just decided to go and spend a huge amount of money on a really ugly machine in our living room without consulting me,\" she begins, \"I think you should do me some favors until I think you've earned your keep.\" You just stare blankly up at her as she continues. \"So I think that since you like to be shrunk and you like feet, why not clean my shoes.\" She then moves her hands from behind her back and shows off the white sneakers she was holding. She places then down right in front of you and then disappears into the kitchen to grab some items from the cabinets. She pops back up with a bucket and a scrubbing brush and rushes over to the DownSizer to place them inside. You watch in awe are her massive body moves over you, both feet swinging by with a force of wind. Evelin shrinks the items, carefully fills the now tiny bucket with water and places them down between her sneakers.<br>\r\n<br>\r\n\"There!\", she triumphs, \"everything you need, now start cleaning, I want these shoes clean before bed.\" She then pivots on her feet and walks towards the bedroom. Before disappearing behind a wall, she stops and looks back at you.<br>\r\n<br>\r\n\"And don't you dare even think about cumming on those shoes!\" she threatens before disappearing into the bedroom.<br>\r\n<br>\r\nYou just stare blankly at the giant sneakers in front of you. The front and sides tainted with grime and dirt and other unidentifiable smudges across the surface.</span></div></div>",
            "created":1562475600,
            "id":2683236,
            "title":"Evelin suggests an idea"
        },
        "1232":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "...shoving a tiny man into my ass.",
                "..eating a man."
            ],
            "content":"<div class=\"\"><div> <span>Although it only took Evelin a few seconds to walk to the bedroom, it took you much longer at your reduced sized. But nevertheless, you huffed and puffed your way into the room to find Evelin lying on her back on the bed reading something on her phone. Her black flats were discarded by the doorway and she didn't even notice you enter.<br>\r\n<br>\r\n\"Hey!\" you should up at her to get her attention. She turns her head to look at you. \"You seriously expect me to clean your shoes?\" you shout up at her.<br>\r\n<br>\r\nEvelin raises an eyebrow as she slowly lifts herself up off the pillow behind her back. \"Excuse me?\" she asks politely.<br>\r\n<br>\r\n\"I bought that machine with my OWN money so I don't think I have to consult you on THAT and I don't like you ordering me to clean your shoes.\" you yell.<br>\r\n<br>\r\nEvelin shifts both her legs to dangle off the side of the bed. She crosses her right leg over her left and dangles her foot off the ground as she stares at you. You are mesmerized by her massive foot hanging high up in the air in front of your face. Your trance is interrupted by her booming voice.<br>\r\n<br>\r\n\"So let me get this straight.\", Evelin queries, \"I work all day to get money so we can buy food because you're too lazy to get a job. Now usually you just sit around all day playing games rather then clean the apartment. But today, you go out and buy an expensive machine we CANNOT afford and then when I get home you demand to be shrunk to do what exactly? Be honest? Sniff my feet and jack off? Is that it? Hmm?\" She bounces her right foot rhythmically while she waits for an answer.<br>\r\n<br>\r\n\"So yes\", she continues, \"I do expect you to clean my shoes cause God knows you do nothing around here and I could use a fucking break once in a while okay!?\" You continue to stare at her bobbing foot. \"Hey!\", she shout as her gaze up at her angry face, \"Look at me when I'm talking to you. Now, with that attitude you're definitely not getting anywhere near my feet tonight so you can kiss that idea goodbye. I would have let you touch them if you just did what I asked but since you have such a bad attitude I'm not going to anymore. So see these feet?\" Evelin points down to her right foot as it raises up exposing her toes and soles to you. \"You're not even going to see them until you decide to behave yourself. Evelin lifts her feet up and crosses them under herself on top of the bed out of your sight.<br>\r\n<br>\r\n\"Why you being such a bitch today?\" you ask courageously.<br>\r\n<br>\r\n\"Excuse me?\" Evelin retorts shocked.<br>\r\n<br>\r\n\"You know this is my biggest fantasy and you can't even for one day just let me have the best time of my life. It wasn't like it was going to take ALL night. All I wanted was to just have a some fun is that soo much to ask? Like seriously, I would never turn down your biggest fantasy.\"<br>\r\n<br>\r\n\"Really?\" Evelin exclaims devilishly.<br>\r\n<br>\r\n\"Yes. Really. Cause I'm a nice boyfriend and that is what couples should do. Indulge in each other's fantasies.\"<br>\r\n<br>\r\n\"Do you know what my biggest fantasy is?\" Evelin asks.<br>\r\n<br>\r\n\"Uh...\" you stammer while scratching your head. You try to recall if Evelin ever mentioned one. You honestly can't remember.<br>\r\n<br>\r\n\"If I tell you\", she continues, \"you'll do it then, cause that's what couples do right?\"<br>\r\n<br>\r\n\"Yes\", you reply.<br>\r\n<br>\r\n\"Well, my biggest fantasy is...\"</span></div></div>",
            "created":1562475600,
            "id":2683258,
            "title":"You storm furiously into the bedroom."
        },
        "12321":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "She easily catches you.",
                "You managed to dive under the couch."
            ],
            "content":"<div class=\"\"><div> <span>\"What?\" you stammer as you stumble backwards.<br>\r\n<br>\r\n\"That's right\", Evelin repeats, \"I want to shove a tiny man into my ass, that's my biggest fantasy, so I have an idea, how about you indulge in my fantasy and then I'll indulge in yours, cause that's what couples do right?\" She drops her legs over the side of the bed and you watch as her feet hit the floor, she then stands up to her full height and grins down at you.<br>\r\n<br>\r\n\"Oh honey!\", she cries excitedly, \"are you looking forward to being inside my butt?\"<br>\r\n<br>\r\n\"You can't be serious?\" you nervously reason.<br>\r\n<br>\r\nEvelin unzips her jeans and let's them fall to the floor. \"But dear\", she continues, \"it's my biggest fantasy and you wouldn't refuse me living out my biggest fantasy would you?\"<br>\r\n<br>\r\nYou continue to stare up at her enormous body shell shocked as she playfully tugs at the sides of her panties. \"Just think\", she teases, \"once I'm satisfied, these sexy things are all yours.\" She stretches our her right foot and wiggles her toes right in your face. The white nail polish glistens as it catches the light dancing across it's surface. \"You do want to play with my feet don't you\", she then pouts as her toes stop wiggling and then all five point downwards. \"Come give my toes a kiss\", she commands. You freeze in confusion. Despite all the mixed messages, you do have a raging boner but you definitely don't want to be inside your girlfriends ass. <br>\r\n<br>\r\n\"No?\" Evelin queries as she brings her foot back to the ground beneath her. She then removes her shirt exposing her breasts neatly tucked into her bra. She admires her body in the mirror before returning her gaze to you. \"Come now dear\", she says as she leans down to pick you up.<br>\r\n<br>\r\nYou jump backwards and then start to run out of the bedroom. \"Where do you think you're going?\" Evelin teases as she struts after you.</span></div></div>",
            "created":1562475600,
            "id":2683273,
            "title":"...shoving a tiny man into my ass."
        },
        "123211":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Evelin leaves you in while she sleeps.",
                "Evelin pulls you out slightly so you can tickle her ass."
            ],
            "content":"<div class=\"\"><div> <span>Evelin laughs as you are brought up to her huge smiling face. \"Don't be scared\", she begins, \"I know this is your fist time inside an ass so I'll go easy on you.\" She carries you over to the bed side table and grabs the lubricant out of the drawer. You stare in shock but Evelin only smiles reassuringly back. With one hand and some wiggling she manages to remove her panties and stands in front of the mirror wearing only her bra. She then holds you in front of her face.<br>\r\n<br>\r\n\"Ready?\" she asks rhetorically before popping the cap off the lubricant tube with the thumb of her other hand. She tilts you sideways and you feel the cool, damp jelly-like lubricant hit your legs. Evelin tosses the tube aside and with both hands, rubs the lube over your entire body, humming to herself.<br>\r\n<br>\r\n\"Evelin,\" you plead, \"please don't stick him in your ass.\"<br>\r\n<br>\r\n\"Shhh\", she coos back, \"maybe you'll like it? You should always try everything at least once, no?\"<br>\r\n<br>\r\n\"I'm sorry\", you stammer, \"I'll clean your shoes, I promise.\"<br>\r\n<br>\r\n\"Oh Ron,\" she giggles, \"we're way past that now.\" Evelin rights your body and winks at you before turning around with her ass facing the mirror. She backs up to get as close to the mirror as possible and bends down to spread her ass checks. She then moves you around her backside and positions you feet first at her asshole. You stare down the at your feet to see the giant asshole just waiting to gobble you up. You crane your neck to look at the mirror and see the exact same sight, except Evelin's grinning face is staring back from behind her ass.<br>\r\n<br>\r\nYou are slowly moved towards the asshole and your feet touch the wrinkly surface. You try to squirm, but massive hand as gripped you too tightly. Suddenly your feet enter into the anus and the sphincter forms a constricting hold around your ankles.<br>\r\n<br>\r\n\"Evelin, NO! PLEASE!\" you cry as your lower half is steadily inserted into your girlfriend's massive asshole. The lube allows you to effortlessly glide in and you can feet the internal heat emanating from inside the ass on your lower legs.<br>\r\n<br>\r\n\"It's just the tip honey\", Evelin jokes as she continues to insert you. You feel the anus suddenly tighten up around your knees and you are fastened in position. Evelin releases you from her hand and watches you flail about in the mirror as you dangle from her ass. She laughs at your predicament and then returns with both her hands to fasten your arms to your sides and push you further into her. <br>\r\n<br>\r\n\"Evelin. PLEASE!\" you cry again. But she doesn't respond and only continues to push you inside her ass until the anus is constricting around your neck.<br>\r\n<br>\r\n\"There were we go\", she states triumphantly as she softly pats your head with her finger, \"all snuggled up in my ass.\" You stare at the mirror to see just your head sticking out of her asshole. Evelin stands back up and her ass checks close around you, sealing you in and restricting your field of vision to just a small sliver of light between the two mounds. Your body begins to sweat from the heat of your girlfriends rectum. Evelin bounces over to the bed and lays face down. She raises her legs into the air behind her and plugs away at her phone. You squirm a bit to try get more comfortable.<br>\r\n<br>\r\n\"Ooohh, yeah\", Evelin moans, \"keep doing that, that feels good.\" You stare up as a giant cellphone comes into view and with a blinding flash takes a photo of your predicament. The phone quickly disappears and you hear giggling that reverberates through the muscles constricting around your neck. \"I can't believe your actually inside my ass.\" Evelin teases.<br>\r\n<br>\r\n\"Evelin. Please\", you cough, \"I'm chocking.\"<br>\r\n<br>\r\n\"Oh stop being such a baby\", she shouts back. \"Just relax and enjoy it okay.\"<br>\r\n<br>\r\n\"Evelin, seriously...\"<br>\r\n<br>\r\n\"Hey!\" she shouts as she twists her body to try get a look at you, \"now shut up or I'll shove you all the way in and I don't think you'll like that okay!\" She then shifts back and returns her feet up in the air behind her.<br>\r\n<br>\r\n\"Why don't you just stare up at my feet and think of how you can be a better boyfriend in the future. Cause right now I think you're a piece of shit.\" Evelin snickers at her little joke and you watch hopelessly as her toes wiggle way above your head. Her soles rubbing against each other as she taps on her phone. Despite it all, you still have a raging boner as your lay fastened insider her ass.</span></div></div>",
            "created":1562475600,
            "id":2683286,
            "title":"She easily catches you."
        },
        "1232112":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "You manage to wiggle out",
                "Evelin goes to use the washroom"
            ],
            "content":"<div class=\"\"><div> <span>You lay jammed inside your girlfriend's ass for several minutes while she just lay on her stomach playing away at her phone ignoring you. You stared up at her feet swaying far above your head, wishing you could touch them but instead you were neck deep inside a hot asshole.<br>\r\n<br>\r\n\"Come on Evelin\", you plead, \"I know this isn't really your fantasy, you're just messing with me.\"<br>\r\n<br>\r\n\"Oh but it is!\", she teases and then giggles as your feel the sphincter tighten and release repeatedly around your body. \"It feels really good having you in there.\" she adds. \"In fact, why don't I put you to use.\" Your girlfriends index and thumb suddenly grip each side of your head and slowly you are pulled out of her ass, her sphincter almost struggling to release it's grip as your body is pulled out just enough for your arms to be free. Before you could swat at the fingers though, you are pushed further back down till the tight muscle constricts around your upper waist.<br>\r\n<br>\r\n\"Tickle my asshole.\" Evelin commands as her fingers retreat.<br>\r\n<br>\r\n\"What?\" you reply shocked.<br>\r\n<br>\r\n\"Tickle my asshole, come on\", she repeats and then thrusts her ass up and down in the air sending you into a dizzy with the erratic movements before finally stopping.<br>\r\n<br>\r\n\"Evelin please,\" you beg, \" this is gross.\"<br>\r\n<br>\r\n\"Oh! Licking feet is gross but you don't seem to have any issue with that.\" she retorts. \"Now come on tickle my ass.\"<br>\r\n<br>\r\n\"But I like feet\", you try to reason.<br>\r\n<br>\r\n\"I don't!\" Evelin replies, \"but I allow you to cause you like it, now how about you stop being a selfish asshole and do something that I like for a change.\" Suddenly she giggles. \"Guess I shouldn't really call you an asshole, well, since you're stuck in one. Isn't that the truth eh?\" You feel the muscle contract around your waist, painfully compressing your rips before releasing as Evelin takes delight in squeezing you with her ass. \"The sooner you get this done, the sooner I let you play with my feet.\" she reminds you.<br>\r\n<br>\r\nYou sigh and then begin to rub your hands all around the giant sphincter gripping you in place. It feels slightly rough and your hands bumble over all the ripples. You rub your hands across your chest, coating them in lube and then return to rubbing the muscle all around you. You hear Evelin softly moan.<br>\r\n<br>\r\n\"Oooo... that actually feels really good,\" she utters, \"go a little faster.\"<br>\r\n<br>\r\nYou follow your girlfriend's commands and begin to rub the asshole even faster. Your hand's are now making audible noises as they rumble over the folds in the muscle. Evelin moans a little louder at your efforts. \"Oh wow,\" she exclaims, \"this actually feels good.\" Suddenly the massive ass holding you rises slightly into the air as Evelin lays on her knees so she can start to finger herself. \"Don't stop\", she breathlessly commands as you continue to rub her ass while she begins to pant and you can feel her massive hand rubbing her pussy through the colon that your body occupies. <br>\r\n<br>\r\nYou decide to rub your hands even faster and in a circular rhythmic movement around your waist. Evelin gasps and moans even louder at your renewed effort. \"Oh God!\" she softly screams as her fingering becomes more aggressive. \"Don't stop, don't fucking stop\", she pants. You continue and then you are suddenly gasping for air as the massive asshole constricts tightly around your chest, forcing the air our of your lungs as Evelin cries out in ecstasy. The muscle releases and you fill your lungs quickly before being painfully constricted again and again as Evelin moans through her pulsating orgasm.Just as you think your lungs are about to be popped, the asshole relaxes and you are thundered back down as Evelin collapses onto her stomach.<br>\r\n<br>\r\n\"Oh my god Ron\", she pants between breaths, \"That was probably the best sex we've every had... which is kinda sad when you think about it.\" You take the opportunity to try to wiggle your way out of your girlfriend's ass so you can finally be free but she giggles lightly as she tightens her asshole preventing you from escaping.</span></div></div>",
            "created":1562475600,
            "id":2683595,
            "title":"Evelin pulls you out slightly so you can tickle..."
        },
        "12321121":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Fuck Evelin's feet",
                "Try to reason with Evelin"
            ],
            "content":"<div class=\"\"><div> <span>Evelin eventually relaxes her tight grip on your lower chest and you use your hands for leverage to extract the rest of your body out of her ass. You fall clumsily onto the top of her lower leg and then plunge onto the mattress between them. You hear Evelin giggle at your misfortune as your pick yourself up and try to brush some of the lube off your body. You enjoy feeling the cooling sensation of the fresh air on your body.<br>\r\n<br>\r\nYou give up trying to get the lube of of your and climb over Evelin's one leg and then onto the side. She is lying face down with her head resting on a mattress as she cools down from her orgasm. You follow her smooth legs down to her feet. Finally, you are free to indulge in your ultimate fantasy. As you walk around her right foot, you stand behind both of them admiring the wrinkles on her sole and the reddish pads of her toes as they face skywards. You approach the right foot and kneel down to rub her hands along the undersides of her toes and the damp surface of her wrinkled sole. Evelin flinches her toes and quickly shoos your hands away with her foot.<br>\r\n<br>\r\n\"That tickles!\" she shrieks. You are overcome with sexual joy and decide to just plop yourself down on her sole and rub your entire body over it. It feels fantastic as the smooth skin of her foot rubs against your body with the lube providing a frictionless sensation. You reposition so your erection pokes between a tight space between Evelin's toes and the ball of her foot. You close your eyes and breath in your girlfriend's foot scent as you begin to hump her foot.<br>\r\n<br>\r\n\"Don't tire yourself out\", Evelin warns, \"you need to save some energy for round 2.\"<br>\r\n<br>\r\n\"Round 2!?\" you shout while you continue to grind your dick on her foot.<br>\r\n<br>\r\n\"Yes. Round 2. Don't act like you're not going back in ass after what just happened.\" Evelin replies<br>\r\n<br>\r\nYou stop your movements and lean back for a minute as Evelin remains still.<br>\r\n<br>\r\n\"Evelin,\" you begin, \"I really don't want to go back in your ass.\"<br>\r\n<br>\r\nEvelin lifts her head and turns to try to look at you, but can't quite twist her head back far enough.<br>\r\n<br>\r\n\"I think it's only fair,\" she continues, \"I let you fuck my foot and then you rub my ass. One-for-one. So after you fuck my foot or whatever you're doing, you owe me a good rimjob.\"<br>\r\n<br>\r\n\"I already rubbed your ass, you owe me a footjob.\"<br>\r\n<br>\r\nEvelin twists her body even more, causing you to roll of her foot as it twist sideways with her movements. She can now make eye contact with you.<br>\r\n<br>\r\n\"Oh, no. That was punishment for buying that machine without telling me. I'm actually doing you a favour now by letting you fuck my foot. After that, you'll owe me.\" Evelin goes back to laying on her stomach and rests her head back on the pillow. Her feet return to their original position and her toes wiggle slightly. \"So come on, get back to fucking my foot. I know you want to.\" Her toes continue to wiggle as you stare at her foot. You look down at your throbbing erection and then at Evelin's ass laying ahead of her gorgeous feet enticing you.</span></div></div>",
            "created":1563080400,
            "id":2686876,
            "title":"You manage to wiggle out"
        },
        "123211212":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "\"Um... no, you're going back in my ass.\"",
                "\"Yeah, let's start over.\""
            ],
            "content":"<div class=\"\"><div> <span>You walk up to Evelin's huge face as it rests on the pillow. Her eyes are closed and she is breathing peacefully with a satisfied grin on her face.<br>\r\n<br>\r\n\"Evelin\", you say softly as you watch her eyes slowly open to look at you.<br>\r\n<br>\r\n\"Yes dear,\" she says sweetly.<br>\r\n<br>\r\n\"Can we talk?\" you ask.<br>\r\n<br>\r\nEvelin's mouth opens slightly as she yawns and then she returns her gaze to you.<br>\r\n<br>\r\n\"What do you want to talk about?\" <br>\r\n<br>\r\nYou stare down at the soft mattress you are standing on then return to look at Evelin's huge, beach-ball sized eyes staring back at you.<br>\r\n<br>\r\n\"I really didn't enjoy being in your ass\", you begin tepidly. You notice Evelin's eyes go larger and her grin suddenly disappears. \"But... but... just listen\" you quickly huff, \"I'm sorry I didn't consult you about the DownSizer and I'm sorry I just expected you let do what I want. I just... I think we got off on the wrong foot here.\"<br>\r\n<br>\r\n\"ha ha... foot,\" Evelin quickly joked.<br>\r\n<br>\r\n\"Yeah...\", you mumble before continuing. \"I think what's best is to just enlarge me back to size and we'll start over. We'll discuss our needs and wants and work out a plan that satisfies both of us. What do you think?\" You stare back at Evelin's huge face as she just lays there motionless for several seconds of awkward silence.<br>\r\n<br>\r\nYou fail to notice Evelin's hand suddenly swoop down and grab cause you were too busy trying to gauge her reaction in her facial expressions. Evelin leans up and picks you up off the mattress. She smiles down at you. You can't tell if it's a happy smile or a mischievous smile. Eventually, she speaks:</span></div></div>",
            "created":1563080400,
            "id":2686878,
            "title":"Try to reason with Evelin"
        },
        "1232112121":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Do as she wishes",
                "Refuse"
            ],
            "content":"<div class=\"\"><div> <span>\"Evelin! No!\" you plead.<br>\r\n<br>\r\n\"Sorry Ron\", she says honestly, \"you just have no idea how good you feel in my ass. We're gonna do that again. Okay?\" She cocks her head to one side as she rises up onto her knees and spreads them across the mattress.<br>\r\n<br>\r\n\"Evelin! Come On!\" you plead.<br>\r\n<br>\r\n\"The sooner you get me off, the sooner it ends,\" Evelin reminds you as she bends down and carries you between her legs to see her other hand waiting for you at her ass.<br>\r\n<br>\r\nYou continue to beg and plead as Evelin manipulates your squirming body and inserts you into your ass. She only replies with suggestions for you to calm down and to just accept what's happening. Despite your best efforts, you cannot overcome your girlfriends strength and you find yourself back up to your armpits inside her asshole. Evelin crawls along the mattress to reach for the bedside table. Your entire world shakes and flurries about as her ass swings from side to side from her movements. You hear the bedside drawer open and close and then the unmistakable sound of a vibrator. <br>\r\n<br>\r\nYou whirring sound gets louder and then you feel the vibrations through Evelin's ass as she rubs it against her pussy. Suddenly you are shaken left and right repeatedly as Evelin commands you to begin rubbing her ass.<br>\r\n<br>\r\n\"Come on Ron. Rub my ass.\"</span></div></div>",
            "created":1563080400,
            "id":2686879,
            "title":"\"Um... no, you're going back in my ass...."
        },
        "12321121212":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "She shuts you in a drawer.",
                "She carries you into the bathroom."
            ],
            "content":"<div class=\"\"><div> <span>\"No!\" you protest. You hear the vibrator stop and the pulsing through Evelin's tight ass muscles on your body cease.<br>\r\n<br>\r\n\"Are you seriously not going to do what I say,\" Evelin threatens.<br>\r\n<br>\r\n\"Evelin...\", you plead, \"You're raping me.\"<br>\r\n<br>\r\n\"Oh Jesus Christ! Such a fucking little faggot. Do you know how many men would just kill to be where you are right now?\"<br>\r\n<br>\r\nYou groan in displeasure.<br>\r\n<br>\r\n\"You do realize that you just gave me the most powerful orgasm I've ever had like 15 minutes ago and now you're refusing to give me pleasure.\" Evelin is mad. \"I mean, all I'm asking is for you to just rub your hands on my asshole like you did and I'll do all the rest.\"<br>\r\n<br>\r\nYou try to push yourself out of Evelin's ass but just as you start to wiggle out, her muscles contract around your body and pull you slightly back in.<br>\r\n<br>\r\n\"Oh, you're not going anywhere. I CAN'T BELIEVE you said I was raping you. How? Any normal man would be only too pleased to do what I ask. But not you. All you want is to just fuck my foot and then roll over and go to sleep. You're the worst boyfriend ever. I think I might break up with you. Is that what you want? Hmm\" Evelin squeezes your body in your ass for emphasis.<br>\r\n<br>\r\n\"I just don't like doing this. I'm sorry.\"<br>\r\n<br>\r\n\"Well maybe I should find someone who does?\" Evelin retorts.<br>\r\n<br>\r\nYou just continue to groan in displeasure as you hang just slightly out of your angry Girlfriends ass as it hovers in the air behind her.<br>\r\n<br>\r\n\"I'm so mad right now, I'm seriously considering just squishing you. Do you want that? Hmm? Do you want to be squished?\" Evelin asks bitterly. \"DO YOU!?\" she shouts.<br>\r\n<br>\r\n\"No,\" you respond meekly.<br>\r\n<br>\r\n\"I first put you in my ass cause I was mad and I wanted to make you suffer but ... God, I don't know, it just felt really good. I didn't think it would, but it does. It feels so fucking amazing and now... now, you don't want to make me happy. You know some of my friends boyfriends love their girlfriend's asses. You know Maria, well Leon loves licking her ass. Maybe that's what I deserve. A boyfriend who loves ass. That's what I should look for.\"<br>\r\n<br>\r\n\"Evelin, no, I'm sorry\", you plead as you place your hands on her ass and begin to gingerly rub it. \"I'm sorry\", you say again, trying to make her happy. Evelin's fingers pinch each side of your head and her anus relaxes as you are pulled out of it. \"Evelin, No!\" you beg, \"I'm sorry, I'll do what you want.\"<br>\r\n<br>\r\n\"The moment's lost. I'm not horny anymore,\" she states as you are brought around her backside and up to her face, \"I'm just mad now. I seriously don't know what to do with you.\" You just hang uselessly in her grip as you stare at her massive, disappointed face. Evelin rolls her eyes, \"I seriously can't even look at your right now!\" she complains and then shuffles off the bed.</span></div></div>",
            "created":1563080400,
            "id":2686888,
            "title":"Refuse"
        },
        "123211212122":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "the bathtub.",
                "the toilet."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You hang limply in Evelin's grip as she strolls into the bathroom. The apartment whirls by. Evelin extends out her hand and drops you into...</span></div></span></div>",
            "created":1563080400,
            "id":2686892,
            "title":"She carries you into the bathroom."
        },
        "1232112121221":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Continue with Evelin."
            ],
            "content":"<div class=\"\"><div> <span>You land awkwardly on all fours and then slowly stumble up to assess where you are. You are surrounded on all sides by the white porcelain of the bathtub. A loud thump causes you to spin around and see Evelin step into the bathtub. You watch her giant left foot come to rest beside her right one just inches in front of you. You crane your neck up and stare up the incredibly beautiful and naked body of your giant girlfriend. She just scowls down at you. A look of disgust on your face. You slowly walk backwards as you worry about what's to come.<br>\r\n<br>\r\n\"What's ... uh... what's going on?\" you sheepishly ask.<br>\r\n<br>\r\nEvelin cocks her head to one side. \"I'm just thinking if I should squish you with my right foot or my left foot. Why don't you decide?\"<br>\r\nYou watch as the massive left foot lifts in the air and the sole is displayed towards you. The toes wiggling slightly.<br>\r\n<br>\r\n\"Left?\" Evelin asks. The foot retreats back and then the right foot is raised so you can inspect the sole. \"Or right?\" You don't answer and just watch as the foot is lowered back down. You stare back up at your girlfriends angry face.<br>\r\n<br>\r\n\"Evelin. Please. Come on, let's talk about this. I'm sorry.\"<br>\r\n<br>\r\n\"Nope!\" your girlfriend shoots back, \"we're done talking. I'm not in the mood to talk right now. I've had enough of you. I honestly think you might be the worst boyfriend on the planet. I don't know what I saw in you.\"<br>\r\n<br>\r\nYou sink to your knees in disbelief.<br>\r\n<br>\r\n\"I can't believe I let you fuck me.\" Evelin laughs in embarrassment, \"Look at you now. The size of a doll and still sporting a boner even though you're about to be squished, cause that's how much you like feet. It's not normal. You're not normal. You're sick and there's no hope for you.\"<br>\r\n<br>\r\n\"Evelin. Come on! You can't do this. Just grow me back and we'll talk.\"<br>\r\n<br>\r\nEvelin shakes her head. \"No... No. I need to make this right. For me. I need to get you totally out of my life.\"<br>\r\n<br>\r\n\"Seriously!\" you shout, \"You're seriously going to kill me cause I didn't rub your ass?\"<br>\r\n<br>\r\nEvelin smirks wickedly. \"No. It's been building up for a while now and today was just the last straw. So no, we're not going to talk about this. It's over Ron. You're done.\"<br>\r\n<br>\r\n\"You need me!\" you shout up at your huge girlfriend as she lifts her right foot onto it's toes and rubs the area of the bathtub in front of you with them.<br>\r\n<br>\r\n\"I don't need you\" Evelin corrects, \"In fact I need to get rid of you. You've been dragging me down ever since we met.\" Suddenly Evelins right foot lifts up and hovers over your head. You quickly shuffle to get up and dodge it but you weren't quick enough and you feel the mass hit your back and instantly flatten you to the floor. The heat emanating for Evelin's massive foot contrasting against the cold surface of the bath tub. The pressure increases slightly and you feel the mass of flesh move sideways. Evelin's sole sticks to the skin of your back and you are dragged with the foot and then rolled over. The massive foot shifts quickly and rests uncomfortably on your body. Evelin's toes wiggling just below your neck. You can feel the blood pulsing through the toe pads as they weight heavily on your chest. You look up at Evelin's smiling body as she leans down to get a better look at you.<br>\r\n<br>\r\n\"How different your current situation is from what you hoped? Hmm?\" Evelin teases, \"I mean you buy that machine thinking, oh awesome, I'm gonna shrink down and fuck my girlfriends feet and it's gonna be totally awesome. But instead you are shrunk down to some pathetic little worm and about to be flattened by your girlfriends feet instead. Hmm? Isn't that just the worst?\" You feel the pressure on your chest increase as Evelin props her foot up onto it's toes. The pads turn white as they push down on your upper body and neck.<br>\r\n<br>\r\n\"You know what I'm gonna do after I squish you?\" Evelin asks as her foot pushes down even more on your chest, forcing you to struggle for air. \"I'm gonna go on Tinder and I'm gonna set up dates with hot guys and the first question I'm gonna ask them is if they want to fuck me in the ass. Then I'm gonna take the hottest one and bring him back here and shrink him in your machine and have him please me better than you ever could and then after that. I'll do whatever he wants.\" Evelin mouths the last words slowly and licks her lips sexily. \"He might even be into feet, who knows, I'll let him do whatever he wants with my feet. I'll do more for him than I ever would have done for you in a thousand years. And we'll have the most amazing sex ever and you? You'll just be stain on the bottom of my foot while he's fucking me. Hmmm? How does that make you feel? Hmm? You'll be dead and I'll continue living my life happily ever after.\"<br>\r\n<br>\r\nYou struggle to make words from the pressure on your chest.<br>\r\n<br>\r\n\"I'm so glad you bought that machine.\" Evelin taunts, \"Now I know what I really want and what I really don't need. See, we're discussing our needs and wants like you wanted.\" You continue to struggle and begin punching at he bottom of Evelin's foot as she laughs at you.<br>\r\n<br>\r\n\"Any last words?\" she request, but you just continue to squirm under her foot. Barely able to breath.<br>\r\n<br>\r\n\"Oooo! Poor thing. Is my foot too heavy. It is isn't it.\" she taunts savagely and then shifts her foot slight up your body so her big toe now rest right over you mouth. \"Kiss my foot. Come on. Kiss it.\" she continues to ridicule. \"Kiss it and say Sowry Evewin. Come one. Sowy.\" Evelin coos in her baby voice as her  big toe covers your lower face. The digit slamming down onto your mouth painfully. <br>\r\n<br>\r\nSuddenly your ribs crack and you cry out in pain.<br>\r\n<br>\r\n\"Oopsie,\" Evelin feigns empathy. The incredibly heavy foot lifts off your body and rises into the air as you wince in pain. You stare up at it, wondering why this is all happening. You remember a time when you had those feet resting on your face after you had just painted the toenails. Evelin laughed happily as you massaged them and brought them up to cover your eyes so you could sniff her soles while she rubbed your dick. Now, that exact same foot was hovering above your face. Except now, it was massive... and deadly.<br>\r\n<br>\r\n\"Hey Ron!\" Evelin pipes up and you avert your eyes to look at her face. \"FUCK YOU!\" she spits and her face immediately disappears behind her rapidly descending sole as it comes slamming down on top of you. The last thing you see.<br>\r\n<br>\r\n\"Oh God!\" Evelin exclaims as she continues to slam her foot down on your flattened body. Watching the blood spurt out of your corpse. \"Well Ron\", she continued at the bloody mess now coating the underside of her foot. \"I know you're dead and all but if you can hear me I just want to say that I actually, really enjoyed squishing you.\" Evelin uses the removable shower head to wash you're gooey remains off her foot and down the drain. \"Should have just rubbed my asshole like I asked,\" she adds as the last of your crushed remains are washed off her sole.</span></div></div>",
            "created":1563080400,
            "id":2686910,
            "title":"the bathtub."
        },
        "123212":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Approach Evelin",
                "Wait till morning"
            ],
            "content":"<div class=\"\"><div> <span>You bolt around the door frame and keep close to the baseboards as you sprint towards the living room. You feel Evelin's massive footfalls behind you and her evil laugh as she chases you. Light dims as her shadow overflies you and just as you are about to be snatched up by her hand you swing around the living room wall and flying jump under the couch.<br>\r\n<br>\r\n\"Ugh!\" Evelin grunts in frustration. You scramble on all fours and shuffle to the centre of the couch, as far away from all openings as you can. You see Evelin's massive feet move around to the front of the couch and her enormous form drops to her knees followed by her hands followed by half her face appearing between the gap of the floor and the bottom of the couch. \"What's a matter Ron?\" she teases, \"you don't want to go inside my ass?\"<br>\r\n<br>\r\n\"Evelin, why are you doing this?\" you ask.<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\n\"Why you being so mean?\"<br>\r\n<br>\r\n\"Oh...\", she replies with mock surprise, \"I didn't realize it was mean to just expect my boyfriend to indulge in my fantasies without asking him first. I'm sorry. Perhaps next time I should discuss it first before just jumping ahead with it? Perhaps that would be a better idea wouldn't it? Huh?\"<br>\r\n<br>\r\n\"Why are you mad at me?\" <br>\r\n<br>\r\n\"Because RON! You just went ahead and bought a really expensive, ugly machine with a LOT of money without talking to me cause you felt like it and just expected me to do everything you wanted. We can't afford two thousand dollars. We spoke about consulting each other with big expenses.\"<br>\r\n<br>\r\n\"But this is my fantasy, \" you plead, \"you know that. I wanted to surprise you.\"<br>\r\n<br>\r\n\"Well I don't like this surprise. I don't like the fact that it takes up half the living room and I don't like the fact that it cost more than you can afford. Like, can you even pay the rent this month?\" <br>\r\n<br>\r\n\"I\"ll come up with a plan.\" you answer.<br>\r\n<br>\r\n\"So you thought with your dick first?\" Evelin replies angrily. \"You can't even pay this months rent but you went ahead and bought this ugly machine.\"<br>\r\n<br>\r\n\"Evelin, I\"m sorry...\"<br>\r\n<br>\r\n\"NO!\", Evelin shouts back, \"I'm really annoyed with you right now. Perhaps it's best you stay under the couch cause I might just squish you if I catch you.\"<br>\r\n<br>\r\nYou stare at your girlfriends huge, angry face in shock.<br>\r\n<br>\r\n\"Would you like to be squished? Hmmm?\" she asks, \"Did you think about that when you bought the machine? Or did you just do a really stupid impulse buy without thinking about all the consequences, like paying the rent or how I would feel?\"<br>\r\n<br>\r\nYou continue to stare at Evelin in shocked silence.<br>\r\n<br>\r\n\"God! You look so pathetic right now\", she snarls, \"cowering under the couch... and your hard dick too.. you're enjoying this aren't you? Why don't you jerk off right now? Hmm? Isn't this your fantasy?\"<br>\r\n<br>\r\n\"Evelin, I'm sorry\", you plead, \"I'm sorry. I made a mistake. Let's just grow me back and we'll get rid of the machine and I'll make it up to you. I'm sorry, just please don't be mad at me.\"<br>\r\n<br>\r\n\"How long can we keep the machine for a full refund? 2 weeks?\" Evelin asks.<br>\r\n<br>\r\n\"Yes.\"<br>\r\n<br>\r\n\"Okay, well here's the plan then,\" she continues, \"you're going to stay shrunk for 2 weeks and then we'll see what you decide. I mean this is your fantasy, I wouldn't want to prevent you living out your fantasy. In 2 weeks time you can then decide if you want to spend the rest of your life shrunken like that or if you want to grow up. And I mean grow up both figuratively and literally. Okay?\"<br>\r\n<br>\r\n\"But Evelin, 2 weeks...\"<br>\r\n<br>\r\n\"THIS CONVERSATION IS OVER!\" she shouts before shuffling back up to a standing position. \"This is happening so deal with it!\"<br>\r\n<br>\r\nYou just stare straight ahead at Evelin's huge feet facing you just outside the front of the couch. Her toes wiggling slightly as she adjusts her stance. They're beautiful and massive and you wish you can just run up and start kissing them.<br>\r\n<br>\r\n\"And one last thing\", you hear Evelin warn, \"I suggest you keep your distance from me. I think there's some bugs in this house and I hate bugs. If I see one, I'm going to squish it.\" You watch Evelin's right foot disappear above the underside of the couch and then jump back in fright as it suddenly plummets back to the ground with a loud thud. She then lifts the foot up onto it's toes and grinds it against the floor as tough snuffing out an imaginary cigarette bud. With fascination you watch as the feet walk out of view and into the kitchen.<br>\r\n<br>\r\nOver the next several minutes you hear Evelin shuffling around in the kitchen, making dinner. You carefully shuffle over the edge of the couch so you can see her legs and feet move about the tiled floor of the kitchen. You hear her chopping and stirring and frying and eventually she sits down at the tiny dining table that is now shoved uncomfortably against the wall to make room for the DownSizer. She sits on the small wooden chair and crosses her left leg of her right as she blows on her hot dinner and begins to eat while tapping away at her phone in the process.<br>\r\n<br>\r\nYour stomach grumbles and you are incredibly hungry. You watch Evelin's left foot twirl about and the toes curl as it lays just inches above the floor, hanging from her crossed left leg. You can't imagine that she would actually squish you. You just wonder if she's cooled off for a bit and would be willing to give you some food. Or maybe it's best to just wait till tomorrow and let her sleep off her anger.</span></div></div>",
            "created":1562907600,
            "id":2685724,
            "title":"You managed to dive under the couch."
        },
        "1232121":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Clean Evelin's white sneakers",
                "Try to sneak into the bedroom",
                "Fast forward 2 weeks"
            ],
            "content":"<div class=\"\"><div> <span>You timidly shuffle from under the couch and slowly approach your massive girlfriend eating her dinner at the tiny dining table. You stare up at her face as it glares at her phone while she eats. Her left foot continues to slowly twirl about. You stop at a distance you determine is safe enough for you to dash back behind the couch if Evelin suddenly decides to try catch you.<br>\r\n<br>\r\nYou stand there for several seconds hoping that Evelin notices you but she doesn't. You then jump up and down hoping the noise will get her attention but it doesn't seem to work. You sigh in frustration and the decide to shout her name as you wave your arms.<br>\r\n<br>\r\nEvelin slowly peels her eyes away from her phone screen and coldly looks over at you.<br>\r\n<br>\r\n\"Oh!\" she says surprised, \"look who decided to come out of his hiding spot.\"<br>\r\n<br>\r\n\"Evelin\", you continue tepidly, \"can I have some food?\"<br>\r\n<br>\r\n\"Oh.\", she mouths while raising an eyebrow, \"the bug is hungry. If only it had cleaned my shoes like I asked, maybe it'll get some food.\" Evelin looks over at her white sneakers still placed in the middle of the room and then back at you.<br>\r\n<br>\r\nYou follow her eyes and then return her gaze. \"Oh Evelin, please, it'll take me forever to clean your shoes, can I just have a little something to eat now?\"<br>\r\n<br>\r\nEvelin continues to stare at you as she raises a fork full of food to her mouth. Gently blows on it and then deposits into her mouth and begins to chew while she continues to stare at you. She swallows loudly and taps her stomach playfully. \"So delicious\", she teases. \"Looks like the bug thinks it should just get things for free and not work for it.\" she adds. She then continues to stare at you with a wicked grin while she raises another fork of food to devour.<br>\r\n<br>\r\nYou sigh in defeat and slump your shoulders while you slowly walk over the sneakers. Behind you, you hear Evelin giggle. \"Aww...\" she coos, \"you look so sad. Come, come have some food before you work.\" You turn around and watch as Evelin places a few grains of rice just on the floor just in front of her. You perk up and then strut over but suddenly slow down as your approach your massive girlfriend. She stares down at you with a triumphant, cheeky grin. Your eyes lower and fixate on her left foot playfully dangling just above the rice grains on the floor. You pause for a moment. Evelin has something planned. You know it.<br>\r\n<br>\r\n\"What's wrong?\" she asks cheekily, \"I thought you were hungry, is rice not good enough for you?\"<br>\r\n<br>\r\n\"Evelin, look, I'm sorry about everything that's happened. I know you're mad and I don't want you to continue being mad. I'm just a little hungry, so I'll eat what you've given me and then I won't bother you for the rest of the night. Then we can discuss things in the morning.\" you propose.<br>\r\n<br>\r\n\"I honestly can't take you seriously when you're the size of doll and you're naked and you still have a boner.\" she retorts. \"So stop fucking around and come eat your dinner!\" She points down at the rice below her.<br>\r\n<br>\r\nYou realize that you have no power in this situation. You're hungry and you need to eat something. You can't spend the night without food. Evelin has something planned and you'll just have to deal with it. You slowly walk over to the rice and you are just about in reach when suddenly Evelin's massive left foot slams down right in front of you smothering the rice. You just stare at her huge toes as they wiggle in delight while Evelin laughs maniacally above you.<br>\r\n<br>\r\n\"Get down on your knees\", she commands. You look up at her face and are met with that same mischievous grin. You obey.<br>\r\n<br>\r\n\"Now beg me for food.\"<br>\r\n<br>\r\nYou sigh. \"Please may I have some food.\"<br>\r\n<br>\r\n\"No!\" Evelin retorts, \"beg properly.\"<br>\r\n<br>\r\nYou put her hands in front of your face in a praying position. \"Oh Evelin my beauty, please may I have some food.\"<br>\r\n<br>\r\n\"I want you to refer to me as your goddess and I want you to bend down to the ground and worship me while you beg for food.\"<br>\r\n<br>\r\nYou lower your self onto your knees and bend down with your arms outstretched towards Evelin's toes. You can almost touch them. \"Please goddess, may I have some food?\" you beg. You hear Evelin giggle and you raise your head to see her pointing her phone at you taking video. \"Kiss my toes\", she commands.<br>\r\n<br>\r\nYou shuffle forward and are now position directly in front of Evelin's toes. You suddenly forget your hunger and are overcome with excitement. This is what you have always dreamed of. Being tiny in front of a beautiful girl's foot. You stare down at the large digits and the white nail polish glistening in the light. You grab each side of Evelin's big toe and bend down to kiss the nail. You can smell the sweat and leather. You inhale the scent and then kiss her toe. You return your gaze up to her huge face as she continues smiling down at your from behind her phone. \"Kiss all the toes\", she commands.<br>\r\n<br>\r\nYou shuffle sideways and repeat the kiss along the 4 remaining toes. \"Good\", Evelin chuckles and then you watch as the ball of her foot lifts off the floor. Several grains of rice are stuck to her foot as it lifts. \"Eat the rice off my foot.\"<br>\r\n<br>\r\nYou reach out to grab one of the cucumber-sized rice grains. Evelin's foot shuffles to the side and out of your reach. \"Don't touch my foot!\" she demands, \"eat the rice OFF my foot.\" You place your hand behind your back as Evelin's massive foot returns to infront of your face. The toes just resting slightly above your head. You lean forward and bite into one of the rice grains. The cool, slightly damp flesh on her foot presses against your head as you strain to reach the rice grain. You inhale the foot scent as you do. Despite the humiliation, you are actually thoroughly enjoying finally being this close to Evelin's feet. You continue to eat the rice plastered to her foot while she stops her video recording and returns to eating her dinner high above your head.<br>\r\n<br>\r\nBefore you could finish your rice, Evelin gets up, taking 2 grains of rice still plastered to her foot with her as she goes walks to the kitchen sink to wash up her empty bowl. You stare in fascination at her massive body as she ignores you while going about her evening chores, eventually finishing off with Evelin retiring to the bedroom and closing the bedroom door behind her. You are left alone in the living room in the dark with only one night light from the washroom providing limited illumination. You decide what to do next.</span></div></div>",
            "created":1562907600,
            "id":2685737,
            "title":"Approach Evelin"
        },
        "12321213":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Sara, your ex-girlfriend",
                "Max, Evelin's ex-boyfriend",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>2 weeks pass in much the same manner. Evelin refers to you jokingly as bug or pet or even sometimes bitch followed by a giggle. She sometimes has you eat off her feet or just places the food on the ground or in a bowl she calls the dog-bowl. You try to have conversations or talk to her but she just shoos you away and ignores you, even going as far as shoving you into a box and locking you away in a cupboard when you really start to bother her. You try to please her by cleaning her shoes or dusting around the apartment as best you can but she just replies that you are supposed to do that since she's looking after you and providing you food. Evelin even purchased some accessories from pet stores to make your life easier. A ladder up and over the bath rim allowed you into the tub where a discarded bar of soap and a dish that collects Evelin's shower runoff are used to clean yourself after using the drain as a makeshift toilet. A hamster water bottle is attached to one of the lower cupboards in the kitchen so you can drink.<br>\r\n<br>\r\nEvery now and again, Evelin will allow you to indulge in your fantasy. Sometimes she'd lift you up to the coffee table so you can \"massage\" your feet and then giggle as she commands you to make love to her feet. Once she even got you to paint her toenails and then watched as you fucked her toes after before flicking you off her foot in disgust. Another time as she was laying on her bed she lightly slapped her foot on top of your body repeatedly asking why you are so weird only to watch you wither in excitement at being smother by her foot but also pain at the weight of the huge mass. Other times when Evelin was out at work or shopping you'd scramble around her shoes and imagine being playfully teased by her feet. Her yellow flip flops were your favourite as it clearly showed the outline of her foot in it from multiple use.<br>\r\n<br>\r\nJust as any other day. You quickly scramble out from the shoe closet as you hear Evelin opening the apartment door. You rush out into the living room to see her dropping her purse on the kitchen counter and removing her mules from her feet. She spots you and quickly motions for you to return to the bedroom as two more massive people enter the room. You just catch a glimpse of black work boots before rushing back into the bedroom and hiding under the bed in a panic. \"Who are they?\" you wonder.<br>\r\n<br>\r\n\"There it is\", you hear Evelin say to the guest, as you hear the heavy footsteps move into the living room. You listen as heavy grunting follows and sounds of metal scraping. The sounds increase and it sounds like they're coming into the bedroom and you look out of the bedroom door as you see a pair of work boots cross back out of the apartment door, followed by a dolly with something heavy on it and then another pair of boots followed by Evelin's barefeet.<br>\r\n<br>\r\n\"Thank you\", she says sweetly and then closes the front door.<br>\r\n<br>\r\n\"Oh Ron...\" she calls, \"come on out, we need to discuss something.\"<br>\r\n<br>\r\nShe hasn't called you Ron in days. You shuffle out from under the bed and follow behind Evelin as she walks over to the couch. You freeze and notice that the DownSizer machine is gone! Evelin sits down on the couch and crosses her right leg over her left as she glances back at you. She pats the seat beside her.<br>\r\n<br>\r\n\"Come\", she calls as one would to a dog.<br>\r\n<br>\r\nYou slowly approach her legs and she bends down to lift you up and place you on the coffee table. She then leans back on the couch and looks at you and you stare back in silence.<br>\r\n<br>\r\n\"The... the downsizer is gone\", you mutter in disbelief.<br>\r\n<br>\r\n\"Yes. Yes it is.\" Evelin replies matter-of-factly.<br>\r\n<br>\r\n\"But... how are you going to grow me back?\" you ask fearful of the answer.<br>\r\n<br>\r\n\"Well, that's what I wanted to discuss,\" your girlfriend continues. She glances down and then returns back to your gaze. \"Look,\" she begins, \"I've been doing a lot of thinking and I actually really, really enjoyed these last 2 weeks. I don't know what it is.\" She then pauses for reflection and gauges your reaction. \"Like, I guess, not having you around, like you know, being your normal size, having you tiny felt like you weren't here and to be honest; I was actually happier these last 2 weeks then I've been in the last year.\"<br>\r\n<br>\r\n\"Evelin...\", you interrupt. Evelin raises her hand.<br>\r\n<br>\r\n\"Let me just finish, I need to get his off my chest.\" she interjects. \"Also, I've notice that I have spent a lot less money over these last 2 weeks which made me realize that you have poor financial discipline.\"<br>\r\n<br>\r\n\"Evelin...\", you interrupt again and then quickly go silent as your watch your massive girlfriends face scowl back at you.<br>\r\n<br>\r\n\"So, with all this in mind, I decided that perhaps it's best if you stay tiny, cause that's what you really like and we continue like this cause it makes me happier.\"<br>\r\n<br>\r\n\"What!?\" you shout in shock.<br>\r\n<br>\r\n\"I know you like this too.\" Evelin replies, I mean, you really can't hide how you really feel. You feel a rush of blood to your groin as Evelin's large foot suddenly fills your vision as she rests it against the coffee table. You can just barely see her face over the toes wiggling in your face. The foot shifts to the side so she can see your full body.<br>\r\n<br>\r\n\"See\", Evelin points at your boner. \"I know you like this. This is a win-win situation for both of us. You get to live your fantasy and I get to have a little foot pet.\"<br>\r\n<br>\r\n\"You need me\", you reason.<br>\r\n<br>\r\n\"For what exactly?\"<br>\r\n<br>\r\n\"I'm you're boyfriend\"<br>\r\n<br>\r\n\"Ummm...\", Evelin humms awkwardly, \"... yeah... ugh.. in case it's not clear. We are broken up. I can't really date someone who is smaller than me. Like really, really smaller than me.\"<br>\r\n<br>\r\nYou stare back in despair.<br>\r\n<br>\r\n\"But don't worry,\" she adds, \"I'll still let you play with my feet. After all, you're my little foot boy.\" Evelin raises her foot and wiggles her toes in front of your face. \"You like being my little foot boy don't you\", she teases.<br>\r\n<br>\r\n\"But... but...\" you stammer as Evelin places her foot on it's heel directly in front of you. The foot slowly collides with her body and she pushes you back along the coffee table as she outstretches her leg. \"This isn't FAIR!\" you scream. Evelin allows her foot to drop to the side so she can look directly at you.<br>\r\n<br>\r\n\"How is this not fair?\" she asks, \"you get to live out your biggest fantasy and I'm happier. You do want me to be happy don't you?\"<br>\r\n<br>\r\n\"I'll never be big again.\"<br>\r\n<br>\r\n\"Never say never\", Evelin replies, \"I returned the DownSizer to get the refund but there's still others out there. Depends how you behave. Maybe one day I'll return you to your normal size.\"<br>\r\n<br>\r\n\"That refund was my money!\"<br>\r\n<br>\r\n\"Yeah, well I need it for rent.\" Evelin retorts.<br>\r\n<br>\r\n\"And rent...\", you add, \"how are you going to afford rent without me around.\"<br>\r\n<br>\r\n\"You didn't have a job anyway.\"<br>\r\n<br>\r\n\"But I could get one if I was back to my normal size. There's plenty of jobs out there. I could have gotten one in the last 2 weeks if you didn't keep me tiny.\"<br>\r\n<br>\r\n\"True...\", Evelin says softly, \"but... I've... uh found someone to move in and share rent.\"<br>\r\n<br>\r\n\"What!? You can't do that...\"<br>\r\n<br>\r\n\"Shhh... shhhh...\" Evelin coos as her foot raises up again to cover your face from her gaze. You try to move around but Evelin keeps blocking your path with her foot and pushing you away as you try to walk closer to her along the coffee table. \"Why don't you give me a foot massage. You're really good at that.\"<br>\r\n<br>\r\n\"Evelin...\" you muffle as her foot flesh covers your face while you try storm towards her. \"...ugh... come on.\"<br>\r\n<br>\r\nYou freeze as you hear a knock on the door. Evelin's foot retreats as she jumps to her feet. \"That must be our new roommate now.\" Evelin squeals in delight. \"Are you excited to meet them?\"<br>\r\n<br>\r\n\"Evelin, Please. You can't do this.\"<br>\r\n<br>\r\nEvelin stares down at you as your plead on the coffee table below her. \"This is happening, so just deal with it.\" she says before bounding towards the apartment door. She opens the door.<br>\r\n<br>\r\n\"Hi!\" she shrieks happily before exiting the apartment to hug the stranger. \"Come on in\", she offers and returns to the apartment followed by another giant human behind her. You look past Evelin and see...</span></div></div>",
            "created":1562907600,
            "id":2685747,
            "title":"Fast forward 2 weeks"
        },
        "123212131":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "You do as she commands",
                "You refuse and turn your back"
            ],
            "content":"<div class=\"\"><div> <span>After some friendly kisses on the cheeks and hugs, Sara suddenly looks around the apartment.<br>\r\n<br>\r\n\"Where is he?\" she asks.<br>\r\n<br>\r\n\"Right over here\", Evelin motions as she walks back to the living room and points to the coffee table. Sara breaks out into a huge smile as she sees your diminutive form on the coffee table.<br>\r\n<br>\r\n\"Oh my god! He is soo small.\" she shrieks in joy as she slowly approaches, not taking her eyes off of you for a second. Sara slowly sits down the couch next to Evelin and they both stare down at you with huge, cheeky grins.<br>\r\n<br>\r\n\"You remember Sara?\", Evelin asks teasingly, \"she's going to live with me now. She'll move into the office once we get rid of off your stuff in there.\"<br>\r\n<br>\r\n\"So it was his decision to shrink himself?\" Sara asked.<br>\r\n<br>\r\n\"Yip.\" Evelin replied, \"He decided without consulting me, then just expected me to do everything for him.\"<br>\r\n<br>\r\n\"And he did it because we wanted to fuck your feet?\" Sara continued.<br>\r\n<br>\r\n\"Oh yeah. Well, being tiny and fucking feet is his biggest fantasy. Isn't that right Ron?\" Evelin asked as she placed both her massive feet onto the coffee table.<br>\r\n<br>\r\n\"Yes, I remember him telling me that,\" Sara added as she fumbled with her shoes while continuing to stare at you.<br>\r\n<br>\r\n\"Uh-oh Ron,\" Evelin teased, \"I think you're about to have your hands full with double the number of feet needing attention now.\"<br>\r\n<br>\r\nWith a loud bang, Sara's right foot smashed down onto the coffee table. Her sole making a loud slump as it dropped in front of Ron. The pads of her toes turning white as they compressed against the surface. Another thump and her left foot slammed down next to it.<br>\r\n<br>\r\n\"You know Ron\", Sara began, \"When Evelin posted that she needed a new roommate, I thought, Hmmm, that's interesting? Did she break up with Ron or did Ron break up with her.\" Sara slowly rubbed  her hands down her legs towards the top of her feet as she continued, \"Well, I messaged her to find out, cause I was curious and so happened to need a place to stay as well and... well..\" Sara fidgeted with removing some lint from between her toes as she paused. \"I could not believe what she told me. And I thought wow! God must be smiling down on me cause not only have I now find a place to stay, but my loser ex-boyfriend will be my foot slave too. That's amazing.\"<br>\r\n<br>\r\nEvelin began chuckling as you started sweating. You watched as Sara's fingers rubbed the tops of her toes in a sensual manner.<br>\r\n<br>\r\n\"Remember when you used to give me foot massages?\" Sara asked, \"it was about the only thing you were good at.\" <br>\r\n<br>\r\nEvelin burst out laughing. She then removed her feet from the coffee table so she could lean down and rub her index finger across Sara's toes. \"Don't you want to kiss these beautiful toes? Hmm\" she teased, \"I know you do. You can't hide your excitement.\" You slowly walk up to Sara's feet.<br>\r\n<br>\r\n\"Ah Nah Nah!\" Sara huffs, \"you didn't say please.\" You stare up at both Evelin and Sara smiling devilishly down at you as Sara's toes wiggle slightly while both her and Evelin rub their fingers across her foot.<br>\r\n<br>\r\n\"Please?\" you whimper. Both Sara and Evelin burst out laughing. \"So pathetic!\" Sara comments as her gaze returns to you. \"This is priceless. Do it properly, like a good little bitch.\" she commands. You stare blankly at Sara's face as Evelin looks on smiling.<br>\r\n<br>\r\n\"Get down on her hands and knees. Bow down to me as your lord and savior and beg me to let you touch my feet.\"</span></div></div>",
            "created":1562994000,
            "id":2686280,
            "title":"Sara, your ex-girlfriend"
        },
        "1232121312":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "...I brought something.",
                "...let's shrink him smaller."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my god! I cannot belive you just did that\", Sara exclaimed in surprise. She then looks over at Evelin to gauge her reaction. Evelin looks at Sara and shakes her head in disgust.<br>\r\n<br>\r\n\"I think we need to teach him a lesson,\" Sara continues, \"and I've got just the perfect idea...\"</span></div></div>",
            "created":1563253200,
            "id":2687914,
            "title":"You refuse and turn your back"
        },
        "12321213121":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Clear, see-through, platform shoe",
                "Sandal with tiny handcuffs all over it",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Sara jumps up for the couch and goes over to her bags. She unzips her luggage and shuffles through the contents looking for something.<br>\r\n<br>\r\n\"Ah ha! Here it is!\", she exclaims as she extracts an object from the pile of clothes. She then walks over to the couch and proudly raises her hands displaying the item.<br>\r\n<br>\r\nEvelin's eyebrows raise in surprise as she looks at the...</span></div></div>",
            "created":1563253200,
            "id":2687916,
            "title":"...I brought something."
        },
        "12321213122":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Evelin wants you smaller",
                "Evelin wants to sell you to someone"
            ],
            "content":"<div class=\"\"><div> <span>\"We can't\" Evelin corrects, \"I got rid of the shrinking machine.\"<br>\r\n<br>\r\n\"Oh that's okay,\" Sara says reassuringly, \"I have a friend with one, let me just take our little slave over here and I'll return with him at a... more appropriate size for his maturity.\"<br>\r\n<br>\r\nYou turn around to look at their faces. Sara has a massive, evil grin on her face. Evelin seems unsure. You haven't seen Sara in ages and you had a terrible break-up. You're very worried about being alone with her.<br>\r\n<br>\r\n\"Evelin,\" you plead, \"why are you doing this to me? Please don't break up with me. Please don't keep me shrunk forever.\"<br>\r\n<br>\r\nBefore Evelin could respond, Sara leans in and fills your vision. \"Poor little Ronny,\" she teases, \"if you weren't such an asshole you wouldn't be our little bitch.\" She then leans back and turns to Evelin. \"I'm gonna take him and shrink him even smaller. Then he'll really be sorry.\"<br>\r\n<br>\r\nSara returns to look at you with her wicked grin. \"Here's the deal Ron,\" she continues, \"If you don't do what we say, we make you smaller and if you do what we say, we make you bigger. So, if you continue to disobey us, eventually you'll be smaller than an ant but if you do exactly as we say, then maybe you'll be big enough to, I don't know, actually be your normal loser self again.\"<br>\r\n<br>\r\n\"You'll eventually return me to my normal size?\" you ask.<br>\r\n<br>\r\n\"Uh... eventually,\" Sara replies, \"but you'd have to do a lot to get there.\"<br>\r\n<br>\r\nYou look back at Evelin. \"Evelin, please,\" you beg, \"can you just ask Sara to make me normal size again and we'll talk things over. This is too much to handle at my tiny size.\"<br>\r\n<br>\r\n\"Evelin's done with your sorry ass,\" Sara interjects.<br>\r\n<br>\r\nEvelin leans forward to speak and both you and Sara await her response.</span></div></div>",
            "created":1563330900,
            "id":2687922,
            "title":"...let's shrink him smaller."
        },
        "123212131221":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "That sounds like a great idea.",
                "I don't know about that."
            ],
            "content":"<div class=\"\"><div> <span>Your heart sank as Evelin waved goodbye to you sneeringly while Sara carried you out of the apartment. With careless regard for your comfort, you are carried limply in her fist while she travels down to her car. You are unceremoniously dumped into the cup holder as Sara starts her car and drives off.<br>\r\n<br>\r\n\"I'm gonna make her eat you, you know?\" Sara began. You look up at her confused as she glances down at you.<br>\r\n<br>\r\n\"Evelin,\" she continues, \"I'm gonna make her eat you. It's all part of my grand plan.\"<br>\r\n<br>\r\nYou remain silent. You're not listening to another of Sara's threats. She always threatened something horrible if you didn't do what she wanted. It's her immature nature.<br>\r\n<br>\r\n\"You don't believe me eh? You really think I needed to move into an apartment... with Evelin. There's tons of apartments in this city, but when Evelin told me that you were shrunk. Well, it was too good of an opportunity to turn down. I would love nothing more than to watch you disappear into Evelin's mouth and be gone forever.\"<br>\r\n<br>\r\n\"What's wrong with you!\" you shout up at Sara. She ignores you. \"She's not going to eat me,\" you add.<br>\r\n<br>\r\n\"Not right now. But I have a plan and step one is to get you smaller and we're already well ahead of schedule for that.\"<br>\r\n<br>\r\nYou ignore Sara and she doesn't continue the conversation. Several minutes of silence pass by. You look up at her smug face as she drives.<br>\r\n<br>\r\n\"And step 2?\" you ask.<br>\r\n<br>\r\n\"Huh,\" Sara replies, as she quickly glances down at you.<br>\r\n<br>\r\n\"Step 1 was to get me smaller and step 2 in your grand plan?\"<br>\r\n<br>\r\n\"Oh, while I'm not just gonna tell you my whole plan like some Bond villian. You'll just have to wait and see. Oh here we are!\"<br>\r\n<br>\r\nThe car comes to a stop and your world is shaken up again as your are grabbed in Sara's fists and then carried around like some ragdoll while she walks to her destination.<br>\r\n<br>\r\n----<br>\r\n<br>\r\nTen minutes later and you are back in the same cupholder. Only this time it is much larger. Sara clicks her seatbelt and starts the ignition. She looks over at you. \"There we go, now the perfect size to be eaten,\" she teases.<br>\r\n<br>\r\n\"Why don't you just eat me?\" you ask.<br>\r\n<br>\r\nSara's smile goes larger. She leans down to you and you cower in fear.<br>\r\n<br>\r\n\"I could,\" she whispers as you feel her breath, \"but... I really, really hate you and I know you still love Evelin and I can only imagine the pain of someone you love eating you and then being digested and turned into shit. It's probably the worst thing that can happen to you. And when Evelin eats you, I'm gonna film it and then I'm gonna watch it over and over again and take sadistic delight in watching your poor little face as you disappear inside her mouth, knowing that you're going to digested and she's going to enjoy it.\"<br>\r\n<br>\r\nSara blows you a kiss and then leans up. \"Anyway,\" she adds, \"that's plan B.\"<br>\r\n<br>\r\n\"Plan B?\"<br>\r\n<br>\r\n\"Yeah, if for some reason Evelin is too much of a prude to eat you, well then, I'll just have to do it myself.\" Sara looks back down at you. \"So if I was you, I'd try to not piss me off, cause I might just loose my cool and decide to end you once and for all.\"<br>\r\n<br>\r\nThe rest of the ride back to your apartment was in silence as you contemplated what Sara had said. You need to get back on Evelin's good side and convince her to get you back to your original size. What a horrible day this has been. Eventually you're back at the apartment and laying down in Evelin's enormous palm as she looks at your diminutive size.<br>\r\n<br>\r\n\"He's so much smaller.\" she muses as you stare up at her massive face filling your vision. You glance over at her lips and into the dark cavern of her mouth and think about what Sara said. She's standing beside Evelin gleaming down at you. \"Bet you wish you'd just obeyed us?\" Evelin teases.<br>\r\n<br>\r\n\"Sara wants you to eat me!\" you blurt out hoping to throw a wrench into Sara's plans. Evelin looks at you confused and then over at Sara.<br>\r\n<br>\r\n\"It's true.\" Sara says matter-of-factly and you are thrown into disarray at her honesty. Evelin's face turns back to you and you stare up at her. \"Hmm,\" she begins while continuing to stare down at you...\"</span></div></div>",
            "created":1563333000,
            "id":2687939,
            "title":"Evelin wants you smaller"
        },
        "123212132":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "suck my dick in front of him.",
                "show him how you fuck a real man",
                "slap him with my dick"
            ],
            "content":"<div class=\"\"><div> <span>Evelin jumps up and wraps her arms and legs around Max's body as he enters the apartment. He drops his tote bag beside him as he wraps his arms around Evelin's waist. Evelin leans her head back and plants a massive kiss on Max's lips. Slowly she untangles her self and drops back down onto the ground. She's still on her tippy toes to kiss Max. Finally, she breaks the contact and opens her eyes to stare at his face.<br>\r\n<br>\r\n\"I missed you\", she says as she cradles his cheek.<br>\r\n<br>\r\n\"It's been a while hasn't it.\" Max replies.<br>\r\n<br>\r\nEvelin grabs his hand and leads him into the living room as Max swings his leg out to kick the apartment door closed.<br>\r\n<br>\r\n\"Come make yourself at home,\" Evelin suggest as she pushes him down onto the couch and Evelin straddles his one leg beside him so she can continue planting kisses on his face. Max locks eyes with you.<br>\r\n<br>\r\n\"So that's your little bitch you told me about then?\" Max asks as Evelin continues kissing his face while angling her head slightly so she can see you.<br>\r\n<br>\r\n\"Yeah, don't worry about him\", Evelin reassures Max. \"He's my little pet.\" she whispers into his ear.<br>\r\n<br>\r\n\"And you fucked him?\" Max asks angrily, \"while I was in prison?\"<br>\r\n<br>\r\nEvelin leans back so she can look at Max. \"Don't worry baby\", she says sultrily, \"he didn't even compare to you. Besides, he only likes feet.\"<br>\r\n<br>\r\nMax continues to stare at you angrily as Evelin goes back to kissing the side of his face and his neck. She slithers her hand under his shirt and starts rubbing his chest.<br>\r\n<br>\r\n\"And why shouldn't I just fucking smash him right now?\" Max asks. You stumble back in fear. Evelin slowly leans back again as she continues rubbing his chest.<br>\r\n<br>\r\n\"Cause he will do things I tell him... we tell him,\" Evelin suddenly corrects, \"and he'll look after my feet.\" she adds as she places her left foot on the table while her right leg is crossed over Max's and she goes back to caressing him. Max continues to stare at you and Evelin slowly looks over at you too through slightly open eyes.<br>\r\n<br>\r\n\"Kiss my foot,\" she commands between kisses. You freeze in fear. The sight of Max's enormous body, eclipsing Evelin's as it lays sprayed across his side is intimidating as hell. Evelin curls her toes and her sole breaks out into wrinkles as she awaits your move.<br>\r\n<br>\r\n\"He's not doing it?\" Max comments and Evelin sighs in an annoyed fashion as she has to stop kissing him to focus on you. <br>\r\n<br>\r\n\"Fucking kiss her foot or I'll fucking smash you with mine!\" Max warns. You stare up at Evelin pleading.<br>\r\n<br>\r\n\"Better do what he says\", she replies with her arm wrapped around his neck and the other rubbing his chest. You walk up to Evelin's foot as it lays sideways across the table. Her toes wiggling as you kneel down and plant a kiss on her sole. The flesh pulsating between softness and hard wrinkles as her toes curl and stretch.<br>\r\n<br>\r\n\"I don't know how I feel about this?\" Max ponders loudly.<br>\r\n<br>\r\n\"About what?\" Evelin asks between kisses as she shuffles on his lap and starts to plant kisses on his lips.<br>\r\n<br>\r\n\"About him\", Max points at you. Evelin stops her kissing and turns her head to look at you. You stop your kissing and look back up at both their faces. Max looks pissed and Evelin looks concerned. Evelin turns back to look at Max.<br>\r\n<br>\r\n\"We'll discuss him later, now come on, I haven't got laid in like 3 weeks and I need a good fucking,\" Evelin teases as she pulls her hand from under his shirt and rubs between his legs. \"I want this dick in me.\" she adds.<br>\r\n<br>\r\n\"That's the last guy you fucked?\" Max asks as he points to you, still cowering behind Evelin's foot. Evelin briefly looks back at you in slight disgust and then returns to kissing Max while rubbing his dick through his pants.<br>\r\n<br>\r\n\"He may have been the last guy to have sex with me\", Evelin says between kisses, \"but he never 'fucked' me.\" Evelin stops kissing Max and stares sexily into his eyes while biting her lower lip.<br>\r\n<br>\r\n\"Well, I'm gonna show him who the fucking boss is around here\", Max threatens as he picks Evelin up and dumps her beside him on the couch while she squeals in delight at being manhandled. Max rises up and unbuckles his belt and rips his jean zipper open. He then allows his pants to fall to the floor and removes his boxers too revealing a massive, erect cock. Evelin stares at it greedily. \"Oh god!\" she moans. \"How I've missed that cock.\"<br>\r\n<br>\r\nMax looks over at her and commands: \"...</span></div></div>",
            "created":1562994000,
            "id":2686320,
            "title":"Max, Evelin's ex-boyfriend"
        },
        "1232121323":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Evelin easily catches you",
                "You make it and hide under the TV stand."
            ],
            "content":"<div class=\"\"><div> <span>You stumble in shock. Meanwhile, Evelin's foot moves away from you as she leans over to reach for you. Without even so much as a protest she giggles in delight as she happily follows Max's command.<br>\r\n<br>\r\n\"Evelin! No!\" you scream as she stretches our her hand to grab you. You only briefly look up at her hungry smile as she is obviously drunk with lust.<br>\r\n<br>\r\nYou turn and decided to make a run for it. Planning to jump off the coffee table and run to the TV stand to hide under it, you bolt away from Evelin's fast approaching hand.</span></div></div>",
            "created":1562994000,
            "id":2686322,
            "title":"slap him with my dick"
        },
        "12321213231":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Let's put this cock in my pussy.",
                "You should cum on him."
            ],
            "content":"<div class=\"\"><div> <span>You barely complete your second step and already you feel Evelin's fingers clamp around your waist and lift you off the table.<br>\r\n<br>\r\n\"Evelin! Please no!\" you cry out as you are lifted and positioned in her hand facing upwards at both her and Max's smiling faces. Evelin is standing now and brings you between her and Max. She presses her body into his as she then lowers you to be below his enormous cock. The massive pillar of flesh bulges as if fills your vision. Evelin looks at Max for further direction.<br>\r\n<br>\r\n\"Grab my dick and slap him with it!\" Max commands as he stares down at you. Without any hesitation you watch as Evelin's other hand wraps around Max's cock. Her fingers and thumb meeting around the meaty mass just above your body. You flail in despair but Evelin only giggles in delight at your struggles. You watch as she pulls the cock slightly higher and then with frightening speed, the dick slams into your body, knocking the wind out of you. Evelin bursts out laughing at the slapping sound it makes as the hard mass collides with your struggling body.<br>\r\n<br>\r\n\"Slap him again!\" Max commands.<br>\r\n<br>\r\nYou close your eyes as you see the dick lift up again and then feel it smash into you again. You cry out. \"Please! Stop!\"<br>\r\n<br>\r\n\"Keep slapping him!\"<br>\r\n<br>\r\nYour cries are muffled and distorted as the wind is repeatedly knocked out of you as the massive dick slams down onto your body. You try to squirm out of Evelin's grip, but you are not strong enough at your size. Between the sickening sound of the flesh slapping against yours you can hear Evelin laughing at your predicament. The pounding stops and you keep your eyes closed as you catch your breath.  You hear Max command you to open your eyes. You slowly open them to see Evelin's hand still gripped around the massive dick that fills most of your vision. Max is smiling higher up above it and Evelin is also beaming down at you in delight. \"He's small than your cock\", she teases.<br>\r\n<br>\r\n\"He needed to be put in his place,\" Max adds, \"He needs to know where he stands in this house.\"<br>\r\n<br>\r\n\"A cock fluffler?\" Evelin teases with a giggle. You watch in horrid fascination as her hand glides up and down Max's penis. Her fingers and thumb disappearing out of view and then return as she slowly jacks him off.<br>\r\n<br>\r\n\"That feels so good\", Max utters. Evelin looks up at him and kisses him while she continues to stroke his cock. You are lifted slighly higher and wince as you approach the mass of erect flesh but you are paused just inches from the flesh. You can hear the sound of skin friction as Evelin's other hand continues stroking so close to your face.<br>\r\n<br>\r\n\"I've got a hot idea\", Evelin says as she lowers back down onto her feet and the dick rises up too in the process. You look up at Evelin's evil, smiling face behind the massive cock as she stares down at you. \"...</span></div></div>",
            "created":1562994000,
            "id":2686337,
            "title":"Evelin easily catches you"
        },
        "12321213232":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Go to the kitchen",
                "Go to the washroom"
            ],
            "content":"<div class=\"\"><div> <span>Evelin's fingers graze your back as you bolt away on the coffee table. Without a thought you jump off and land heavily on your feet onto the floor. You don't look back and just bolt towards the TV stand.<br>\r\n<br>\r\n\"Don't worry, I'll get him,\" Evelin says to Max as she stands up to chase after you. Before she gets far, Max grabs her arm and pulls her back into his embrace.<br>\r\n<br>\r\n\"It's okay,\" he says, \"let the little bitch run away.\" You dive under the TV stand and crawl all the way back to the wall.<br>\r\n<br>\r\n\"He just needs to know that if I ever see him again, I will step on him,\" Max threatened, \"YOU HEAR THAT LITTLE BOY. I SEE YOU. I SQUISH YOU.\"<br>\r\n<br>\r\n\"No,\" Evelin giggled, \"don't squish him. He can be useful.\"<br>\r\n<br>\r\nYou look out from under the TV stand across the room, below the coffee table and Max and Evelin's feet. Suddenly, Evelin's feet disappeared above the coffee table and you heard her squeal in delight as Max picked her up and carried her into the bedroom. The door slammed shut behind them. Soon the silence was broken by heavy breathing and pleasurable moans emanating from the bedroom.<br>\r\n<br>\r\nYou need to decided what to do next. You contemplate going to the kitchen and taking this opportunity to find food before Max come's out of the bedroom. You also consider hiding in the washroom and waiting for Evelin. She always went to the washroom after sex. You need to talk to her. Convince her to hide you from Max and beg her to set you free. You can't continued hiding in fear in your own apartment.</span></div></div>",
            "created":1570174920,
            "id":2727754,
            "title":"You make it and hide under the TV stand."
        },
        "123212132322":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Max",
                "Evelin"
            ],
            "content":"<div class=\"\"><div> <span>You run to the washroom, passing the bedroom door along the way. You can hear the bed creaking rhythmically and Evelin moaning in sexual pleasure. You dive into the washroom and hide behind the toilet. Waiting for Evelin.<br>\r\n<br>\r\nThe sounds of sex eventually die down and several more minutes pass till the bedroom door opens and someone enters the washroom. It's ...</span></div></div>",
            "created":1570174980,
            "id":2727756,
            "title":"Go to the washroom"
        },
        "1232121323222":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Smiles sweetly",
                "Max suddenly enters"
            ],
            "content":"<div class=\"\"><div> <span>You see Evelin's bare feet enter the washroom. She's holding a couple of Kleenex against her vagina and she unceremoniously throws them into the garbage and then begins to admire her naked body in the mirror.<br>\r\n<br>\r\n\"Evelin?\" you nervously call out from behind the washroom.<br>\r\n<br>\r\nEvelin looks down at you and...</span></div></div>",
            "created":1570175160,
            "id":2727758,
            "title":"Evelin"
        },
        "12321213232222":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Evelin blocks your path",
                "You successfully run out of the washroom"
            ],
            "content":"<div class=\"\"><div> <span>Evelin continues to smile down at you as Max enters and wraps his arms around Evelin as he hugs her from behind. Evelin leans her head back and closes her eyes as he kisses her neck. He then unlocks his arms and proceeds towards the toilet. Lifting the seat and positions himself in front of it.<br>\r\n<br>\r\nYou carefully cower behind bowl, staying out of his vision as he begins pissing.<br>\r\n<br>\r\n\"Be careful,\" Evelin says as she eyes Max's body up and down.<br>\r\n<br>\r\n\"What?\" Max asks confused.<br>\r\n<br>\r\n\"Our little pet is behind the toilet, don't want you accidentally pissing on him.\"<br>\r\n<br>\r\n\"Is that so,\" Max says menacingly.<br>\r\n<br>\r\nIn a panic, you flee from under the bowl and bolt towards the door. You need to escape before he can catch you and while he's peeing you figure he wouldn't chase after you.</span></div></div>",
            "created":1570175340,
            "id":2727762,
            "title":"Max suddenly enters"
        },
        "123212132322221":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "\"He's gonna be our little sex toy\"",
                "\"He's gonna become our pet\""
            ],
            "content":"<div class=\"\"><div> <span>You slam into the side of Evelin's foot as it slams down in front of you and bounce onto your back looking up at her smiling face. Max bursts out laughing as he shakes the last drops of piss out of his dick.<br>\r\n<br>\r\nYou rub your winded chest as you stare up at Evelin's towering naked body. Max joins from the opposite side and they both stare down at you smiling.<br>\r\n<br>\r\n\"Well, well, well, what do we have here,\" Max teases.<br>\r\n<br>\r\n\"Please,\" you huff winded, \"please don't squish me.\"<br>\r\n<br>\r\nBoth Max and Evelin burst out laughing. \"Poor little thing,\" Evelin coos.<br>\r\n<br>\r\n\"If I remember correctly,\" Max continues, \"I said that if I see you again, I'm gonna squish you.\"<br>\r\n<br>\r\n\"No, don't squish him,\" Evelin suggests.<br>\r\n<br>\r\n\"What should we do with him then?\"<br>\r\n<br>\r\nSuddenly, Evelin's face breaks out into a huge smile:</span></div></div>",
            "created":1570175760,
            "id":2727766,
            "title":"Evelin blocks your path"
        },
        "1232121323222211":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "He puts you in head first",
                "He puts you in legs first"
            ],
            "content":"<div class=\"\"><div> <span>Evelin picks up your body off the floor and lifts you up to her face.<br>\r\n<br>\r\n\"Did I tell you what I wanted him to do for me when I shrunk him?\" Evelin asked Max.<br>\r\n<br>\r\n\"What's that?\"<br>\r\n<br>\r\n\"I wanted to stick him in my ass and make him rub my asshole.\" she smirked, \"and he just ran away and didn't do it.\"<br>\r\n<br>\r\n\"Oh you dirty girl,\" Max teased. Evelin smiled sexily.<br>\r\n<br>\r\n\"Let's take him back to the bedroom and shove him in my ass. Then he can rub my asshole while I suck your dick.\"<br>\r\n<br>\r\nMax leaned in and you were squished between their naked bodies as his mass pressed you into Evelin's chest.<br>\r\n<br>\r\n\"I like the sound of that,\" he whispered and then kissed Evelin heavily on the lips. Their bodies parted and Evelin raised you to her face.<br>\r\n<br>\r\n\"And if he doesn't do a good job pleasuring me,\" Evelin threatened, \"well, I haven't decided if I should eat him as an after-sex snack or have you fuck him into my pussy.\"<br>\r\n<br>\r\n\"I'd love to fuck him into your pussy,\" Max added.<br>\r\n<br>\r\n\"Yeah,\" Evelin joked as she walked into the bedroom, Max following behind, \"that will likely happen as based on past performance, I can pretty much guarantee that he will NOT please me. Then you can fuck him right into my womb and then maybe he'll become my baby.\" They both burst out laughing as Evelin walked over to the beside table and grabbed some lube.<br>\r\n<br>\r\nShe poured some over you in her hand, as Max lay on his back on the bed.<br>\r\n<br>\r\n\"Evelin please,\" you begged.<br>\r\n<br>\r\n\"Shhh, Ron,\" she said as she lathered your body up with lube, \"if I was you, I'd make sure you please me, or else you're going inside my body. I just don't know which hole you'll enter.\" You were then handed over to Max as Evelin crawled onto the bed on all fours and spread her ass in front of him.<br>\r\n<br>\r\n\"Put him in,\" she instructed, \"legs first and make sure his arms can rub my asshole.\"<br>\r\n<br>\r\nMax looks at you with an evil grin.<br>\r\n<br>\r\n</span></div></div>",
            "created":1570176480,
            "id":2727769,
            "title":"\"He's gonna be our little sex toy\""
        },
        "12321213232222112":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Evelin pulls you out",
                "Max lifts Evelin and places her on her back"
            ],
            "content":"<div class=\"\"><div> <span>\"Sucks to be you,\" Max comments as he pushes your legs into Evelin's warm sphincter. The muscle relaxes and you easily slide in. He pushes you in up to your chest. Your arms spread out over the folds of Evelin's asshole.<br>\r\n<br>\r\n\"Poor little Ron,\" Evelin added, \"shrinking you was the best thing I've ever done.\" Your world spun around as Evelin shuffled around the bed and positioned herself between Max's legs. You stared out of the ass, as Evelin lowered down onto her stomach and lifted her legs into the air, her feet swinging above you as you were hugged tightly by her asshole.<br>\r\n<br>\r\n\"Remember that time you thought you'd get to fuck my feet,\" Evelin teased, \"but instead you find yourself shoved into my ass while I suck another guys dick?\" You heard her laugh evilly and Max chuckled too.<br>\r\n<br>\r\n\"But, no, seriously,\" she continued, \"thanks for buying that shrinking machine, else I wouldn't have been back with Max. Now start pleasuring me and you better do a good job or I'll eat you. You don't want to be eaten do you?\"<br>\r\n<br>\r\n\"If you eat him, he'll eventually come out of your ass.\" Max commented. Evelin laughed out loud. \"That's so true.\" You then heard her start sucking on Max's cock briefly before you world began to shake violently. With a loud, audible pop, you heard Evelin lift her head off Max's dick.<br>\r\n<br>\r\n\"You better start pleasuring my ass,\" she demanded, \"unless you want to come out of it as a piece of shit.\"<br>\r\n<br>\r\nYou instantly get to work and rub her hands vigorously over her sphincter as Evelin returns to sucking Max's cock. You're not sure what to do, but you just continue rubbing Evelin's asshole and kicking your legs about insider her colon as your hear Max groan in pleasure while Evelin gives him a blowjob.<br>\r\n<br>\r\n\"Fuck you're amazing,\" he blurts out as you feel Evelin's sphincter tighten around you and then release the pressure.<br>\r\n<br>\r\nSuddenly, the world is shifted as</span></div></div>",
            "created":1570177200,
            "id":2727772,
            "title":"He puts you in legs first"
        },
        "123212133":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Your mother",
                "Your sister",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You blink in disbelief! It's...</span></div></span></div>",
            "created":1562907600,
            "id":2685749,
            "title":"Someone else"
        },
        "1232121333":{
            "author_id":"bobobo303",
            "author_name":"bobobo303",
            "choices":[
                "Your highschool teacher, Ms Claire",
                "Your favourite fetish model, Mistress Rebel",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You rub your eyes and look again. It' can't be! It's...</span></div></span></div>",
            "created":1562907600,
            "id":2685750,
            "title":"Someone else"
        },
        "12322":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"My biggest fantasy is to eat a man! Small enough to swallow whole, yet big enough to cause him immense pain!\" She slowly advances, as you back up. \"You fit that description!\"<br>\r\n<br>\r\nAll the color drains from your face. You hadn't planned on dying, you thought Evelin would just help you with your fantasies.<br>\r\n</span></div></div>",
            "created":1573587360,
            "id":2745798,
            "title":"..eating a man."
        }
    },
    "info":{
        "author_id":"bobobo303",
        "author_name":"bobobo303",
        "brief_description":"Will your girlfriend be willing to indulge in your fantasies with the latest technology?",
        "created":1562472360,
        "description":"<td align=\"left\" class=\"norm\">Your name is Ron and you live in an apartment with your girlfriend, Evelin. She is aware that one of your biggest sexual fantasies is to be shrunk. She is also aware of your foot fetish but does not enjoy indulging in it. With your limited savings you can barely afford the latest DownSizer machine that can actually shrink objects. Although the manufacturer forbids the shrinking of humans, you know it is possible as other users have done it before. While the machine takes up an uncomfortably large portion of your tiny living room, you wait patiently for Evelin to return from work so you can convince her to operate the machine and shrink you. Your palms are sweaty as your are unsure of what her reaction might be.</td>",
        "id":2195141,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1596591300,
        "modified":1596591300,
        "pretty_title":"Shrunk with Girlfriend"
    }
}