{
    "chapters":{
        "1":{
            "author_id":"super_big_mac",
            "author_name":"Mac: The Editor",
            "choices":[
                "The characters wake up in a secret passage.",
                "The characters get saved by a passing animal/creature.",
                "The characters are brought back because of a magic spell.",
                "The powers of the MaGriffon activate!"
            ],
            "content":"<div class=\"\"><div> <span>The cyan pegasus opened an eye hesitantly, before shouting in triumph; she’d done it! Even after all of her past blunders, she’d done it! Checking to make sure nopony (or, in this case, <i> dragon</i>) was lurking in the shadows, she cautiously trotted towards the pedestal in the center of the room. She’d much rather fly, but after the last time she’d tried that, she’d stick with the pressure-plate riddled ground.<br>\r\nLooking at said ground, she decided to do what many ponies had said she couldn’t: think. “Hmm, let’s see. The floor panels here all have different patterns of dots, kinda like the ones on the walls. Thank goodness I know how to read Braylle!” She turned her head towards the first wall, reading the inscription aloud to make sure she got it right. “WATCH YOUR HEAD IF THE LION FALLS THEN YOU ARE DEAD.” She turned again to the first section of the floor, seeing that the tiles could spell words if hit in the correct order. “Alright, I just can’t let the lion ‘fall’ for the first part. Easy as pie!” The adventurer leapt for a tile marked with a braylle ‘L’. She could do this.<br>\r\n<br>\r\nFinally, after a circuitous route around the chamber, she was in the center of the room. Wiping some sweat off of her brow, she made her way up the steps towards the item of her quest: The Dragon Emperor’s Geon. The Geon was a supposedly hypothetical electromagnetic field that’s held together by its own gravitational attraction, or something like that. But Bolt knew the truth. The Geon was one of the most magically powerful objects ever: a Soul Shard from the Dragon Emperor.<br>\r\nThe Dragon Emperor had died in the Chaotic Era, helping to protect the world from Discord. He had taken his own soul and had fractured it into six crystals of immense power, not even matched by Star Swirl himself!<br>\r\nA sudden, loud clatter was enough to startle the pegasus. A small purple and green form was approaching her across the trap-riddled floor, not caring at all as he was plunged into pools of lava or hit by arrows, as even their iron-tipped shafts unable to penetrate the thick, scaly hide that covered his body. \"Oh, buck!” Bolt grabbed the Geon in her mouth and jumped into the air. She thrust her wings downwards, and took off down the passageway as more and more dragons started snarling and roaring in the distance. She needed to get away, and get away <i>now.</i> She only hoped Daring Do was close by, otherwise she might as well tan her own hide.<br>\r\nFlapping her wings all the harder, she weaved her way through the hallways and corridors, taking only moments to pass traps that were activating in one long chain behind her; there was a reason the temple was called ‘the grounded gauntlet,’ taking to the air was like signing your own death sentence.<br>\r\nGrating gears and the sound of stone scraping against stone was heard in the distance; the only problem was that it was between her and her escape. Swerving to the right down an unfamiliar passageway while narrowly avoiding the lava pouring from the ceiling, Bolt prayed for another way out.<br>\r\nHer answer came in the form of a nearby explosion. There was no way a temple for dragons would have a self-destruct mechanism; they were too fond of the hoarded jewels within to want its destruction. That could only mean one thing: “DARING!” The dragons tailing her were trying to turn her into fried chicken, and if the smell of burnt hair was any indication, they weren’t too far from succeeding.<br>\r\nBolt flew around the next corner, shooting out into the sky as the volcano behind her trembled with the mighty roars of angry dragons. The path caved in after another blast of TNT, sealing the route and leaving the dragons in the dust.<br>\r\nThey'd found the second piece of the Dragon Emperor's Soul, the 'Geon.' The First part, the 'Kina,' had already been returned to the Sister's Cathedral in the Everfree Fortress. Now the two adventurers only had the 'Magus,' the 'Honei,' the 'L'yalt,' and the 'Leoff' to complete the set.<br>\r\nBolt swooped down to land beside her friend, her lover, and her Hero, and gave Daring a kiss. \"Thanks for the save, Daring. Looks like I owe you another one.\"<br>\r\nThe mustard yellow adventurer just snorted and nuzzled her companion. \"Don't worry, Bolty. Once we've set up camp, I plan to take<i> full </i>advantage of your... 'favor'...\" They shared another small kiss before flying off towards the east, away from their latest adventure, bruised, but not beaten.<br>\r\n--<br>\r\nRainbow Dash got up from her desk and stretched, yawning widely. “Whew! Another chapter done, and thank Celestia for it! I’m gonna have to take an extra-long nap during work today if I’m gonna be able to function at all!”<br>\r\n--<br>\r\nDaring Do swung through the jungle on the vine, her eyes locked on those of her friend, wishing that her mouth was free so that it could join with those supple cyan lips. The sunset filled the Galloppalachian Mountains with a rosy light; the trees of its jungle-encroached sides tinted a ruddy color. Daring Do let go of the vine right as it reached the upwards crest of its swing, flapping her wings slightly so as to not hit the ground too hard. She looked into the eyes of the injured cyan pegasus, both of their eyes filled with longing and passion. She opened her mouth to speak as she caressed her partner’s cheek. “Rainbow Dash, whatcha writin’?”<br>\r\n--<br>\r\n“Gyah!” Rainbow fell from her chair with a thud. “P-Pinkie Pie?! Wh-what are you doing here?!” Dash looked around her spacious bedroom. <i>Her</i> bedroom, made of <i>clouds</i>. “Better question: how are you here?”<br>\r\n“Oh, silly Dashie! I got a ticket from the Plot Device Shop, and it needed me to bring it here!”<br>\r\nRainbow Dash cocked an eyebrow, but decided that whatever was left of her insanity was perfectly fine as it was: intact. She wasn't gonna ask... “What the hay is a plot device shop?”<br>\r\n\"No, silly,” Pinkie giggled, “not just <i>a</i> shop, but <i>THE</i> Shop! The one and the only, Macaroni!”<br>\r\nDash groaned, her forehead resting against the frog of her hoof. The blood pounded in her head to a staccato beat that did nothing to help her feel better.<br>\r\nPinkie seemed content with ignoring Dash with whatever had caught her short attention span, so Rainbow just returned to her desk, resolving to get back to her Daring Do fic.<br>\r\nPinkie popped up next to her, and started reading over her shoulder. “Ooohhh, ‘<i>Daring Do and the Dashing Delinquent, Part four: The Pair’s Paradise</i>’! Wow, Dashie! I didn’t know that <i>you</i> had written this series! And I can’t believe how many spin-offs and crossovers have been generated from it, not to mention how hard it must be to incorporate as much as you do from those other stories into Canon! You must be able to do a sonic rainboom with your <i>eyes</i> to read that much!”<br>\r\nRainbow looked at her longtime friend, the bags under her eyes almost too heavy to allow one of them to twitch with agitation. “Pinkie,” she growled through clenched teeth. “What d'ya want? I’m busy.”<br>\r\n\"Yeah, I know! But I’m here to give you this, from The Plot Device Shop; you’ll need it very soon,” Pinkie cried in a sing-song voice before dropping an envelope onto the desk by Rainbow’s cloud-made typewriter and disappearing through the floor.<br>\r\nRainbow Dash looked out the window to see Pinkie Pie floating back down to the ground under a group of balloons and just shook her head. Pinkie is as Pinkie does, and the reason why is just because. She chuckled at the sudden rhyme, and decided that she might put it in as something a Zebra could say in one of the later chapters. Hmm... Was Zircon or Zeke a better name?<br>\r\n--<br>\r\nBolt Spectra and Daring Do were locked in a passionate embrace, their tongues caressing one another as they sank lower and lower into the quicksand. Tears streamed down their faces as they put all of their love and regret into that last action; there was nopony coming to save them, and no vines hanging within reach to help them.<br>\r\nTheir lips broke apart, both mares gasping at the loss of contact, their eyes conveying what they couldn’t hope to form the words for. “I idolized you, you know. Thought you were just another hero. Then I got to know you, Daring. And I found something more than a hero, or a friend. I found a pony that I could love.” Daring Do blushed, her tears streaming down her face in shimmering cascades of rugged, lovely beauty.<br>\r\n“Oh, Bolty…” The two kissed once more before the quicksand came to their necks, forcing them to part one last time. “You know I hate goodbyes.”<br>\r\n“Heehee, So do I.” Daring and Bolt both relaxed as the sand crept up their necks and over their snouts, and the last thing either saw was the other before the sand veiled their eyes.<br>\r\n--<br>\r\n“Phew, I didn’t think I had it in me!” Rainbow Dash sighed as she busied herself with cracking her neck and getting rid of all the cricks and stiff joints that sitting upright and hunched over a desk had developed in her body. Dash yawned, settling into her bed. “Now,” she murmured softly to herself as she drifted off. “How the hay do I save them?”<br>\r\n<br>\r\nIt had been almost a month. She <i>still</i> didn’t have an idea to save the crusading couple! Rainbow groaned and beat her head softly against her desk. Why couldn’t she think? It was too late to go back and edit the last chapter; she’d already sent it to the Fanservice Weekly Journal for publishing! She needed the next chapter out in <i>three days.</i> She hadn’t even started it yet!<br>\r\nShe sighed and groaned in defeat, before seeing Pinkie Pie's envelope. Rolling her eyes, Rainbow ripped open the envelope, shaking out a little card.<br>\r\nDash picked up the card and flipped it over to read what was on the front.<br>\r\n<br>\r\nThe Plot Device Shop<br>\r\n<br>\r\nBelow the title was a group of four different ideas...</span></div></div>",
            "created":1348249500,
            "id":1432204,
            "title":"Daring Pairing"
        }
    },
    "info":{
        "author_id":"super_big_mac",
        "author_name":"Mac: The Editor",
        "brief_description":"I  can't describe what my brain thought up in only 90 characters. Read on, if you dare...",
        "created":1348021380,
        "description":"<td align=\"left\" class=\"norm\">The population of Ponyville love a good story, but all the writers have come across the most vital of flaws: Not every situation they put their characters through are easy to pull them out of. But that's where this strange shop comes to play: While wandering the streets, some of our esteemed authors have wandered into a store that has no business being where the flower shop should be, nor is it a stall outside of Sofas and Quills. With that in mind, don't think that this is a bad thing, for without it, many of this <span style=\"text-decoration:line-through\">peaceful</span> <u>zany</u> town's residents would go mad trying to get past their writer's block.</td>",
        "id":1892325,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1348249500,
        "modified":1348249500,
        "pretty_title":"The Plot Device Shop"
    }
}