{
    "chapters":{
        "1":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "The StarFox team",
                "The StarWolf team",
                "Dinosaur Planet/Sauria",
                "Aparoids",
                "Writer's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It's time for Fox's adventures in the stomachs of other StarFox characters! Choose a situation or team listed below and start feeding Fox to those hungry predators!</span></div></span></div>",
            "created":1135746000,
            "id":292238,
            "title":"Choose Fox's Destiny"
        },
        "11":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Falco Lombardi",
                "Krystal",
                "Slippy Toad",
                "Peppy Hare",
                "Other/Original Character/Friends?"
            ],
            "content":"<div class=\"\"><div> <span>It's quite ironic that Fox is the leader of a team full of anthro animals that want to eat him! But, who shall eat him first? Will it be Falco? Or Krystal? Or will you decide to make your own character? Or prehaps someone like James McCloud, Bill Grey, or Katt Monroe may be hungry for a nice vulpine snack! It's all up to you!</span></div></div>",
            "created":1135746000,
            "id":292240,
            "title":"The StarFox Team"
        },
        "112":{
            "author_id":"midwest92",
            "author_name":"Tiger64",
            "choices":[
                "Krystal controls herself and the thoughts go away",
                "She finds Fox and yiffs him"
            ],
            "content":"<div class=\"\"><div> <span>It was a normal day on the Great Fox except for the fact that everybody was gone save Fox and Krystal.  Fox was in the kitchen area making himself a sandwich and Krystal was in her room.  <br>\r\n<br>\r\n\"Hmm...I wonder if Krystal's ok.  She's been in her room for a while know.\"<br>\r\n<br>\r\nLittle did Fox know that Krystal was going through a change that would change both their lives.  Krystal was sitting on her bed panting as dirty thoughts went through her mind.  They were very strange though, not the typical fantasy that you would expect.  They were of her having sex with Fox and then shoving him down her throat.  She was getting wet from the thought of it and needed to do something NOW!!<br>\r\n<br>\r\n\"Ah screw this, I need to go find Fox!!!\"</span></div></div>",
            "created":1140757200,
            "id":303366,
            "title":"Krystal's fantasy"
        },
        "1121":{
            "choices":[
                "She eats the small fox",
                "She keeps him for herself and eats his parents",
                "She tells that his parents are dead"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sorry, I am not allowing Krystal as a predator anymore.</span></div></span></div>",
            "created":1259730000,
            "id":800259,
            "title":"Krystal the empress"
        },
        "115":{
            "author_id":"readasaur",
            "author_name":"Readasaur",
            "choices":[
                "James McCloud!",
                "Katt Monroe",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>James McCloud, or Katt Monroe?</span></div></span></div>",
            "created":1313470800,
            "id":1169660,
            "title":"Other/Original Character/Friends?"
        },
        "1153":{
            "author_id":"readasaur",
            "author_name":"Readasaur",
            "choices":[
                "Bill Grey",
                "Kool Cat",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bill Grey, or Kool the Cat?</span></div></span></div>",
            "created":1313470800,
            "id":1169664,
            "title":"Other"
        },
        "12":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Wolf O'Donnell",
                "Leon Powalski",
                "Panther Caroso",
                "Pigma or Andrew",
                "Other?"
            ],
            "content":"<div class=\"\"><div> <span>The StarWolf team, the rivals of Fox! Will they finally capture him? Will he give himself to them? Does he become their little sex and vore slave? Will Wolf mate with Fox, or will he just eat him and digest him, finally defeating him? Will Leon torture him a little before sending Fox off to his belly? Once again, it's all up to you!</span></div></div>",
            "created":1135746000,
            "id":292242,
            "title":"The StarWolf Team"
        },
        "121":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "He gets to the hangar and finds...",
                "Wolf grabs him from behind as he leaves"
            ],
            "content":"<div class=\"\"><div> <span>Fox sighed as he sat in the kitchen of the Great Fox, resting his head on his palm. It had been a month after defeating the evil Aparoid race and there was still no word from Wolf or his team. He was starting to get worried that they really had been killed by the Aparoids when drawing tem away from Fox and his team. The vulpine, wearing his standard StarFox uniform of a white, sleeveless vest, and green flight suit, stood up and replayed what happened in Corneria just a month ago in his head.<br>\r\n<br>\r\nHe walked out of the kitchen and headed back to his room, sighing along the way. He stepped into his room and sat on his bed, picking up a picture of when he and Wolf were younger, back when they were friends and when Wolf had use of both eyes. He sighed softly, fearing the worst, then lied down. He didn't get a chance to rest when the alarm system rang throughout the ship. ROB's voice came out over the alarm, reporting that there was an intruder on board.<br>\r\n<br>\r\nGrabbing his blaster, Fox ran out of his room and towards the hangar, ready to engage the intruder.</span></div></div>",
            "created":1144040400,
            "id":310398,
            "title":"Intruder Alert"
        },
        "1212":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Wolf yiffs him.",
                "Wolf eats Fox for dinner"
            ],
            "content":"<div class=\"\"><div> <span>As Fox turned to go down to the hangar, an arm wrapped around his neck and pulled back. In surprise, the gun fell from Fox's paws and struggled as his attacker pulled Fox back into the room. The door shut behind them, almost sealing them completely in. Fox continued to struggle, trying to get out of his assailant's grip. \"Lock the door.\" The attacker order.<br>\r\n<br>\r\nFox knew the voice well and stopped struggling. He reached over to the keypad beside the door and locked it down in place. Once it was locked, Fox's attacker released him. Fox turned around to look at his attacker, trying to hide his smile as he confirmed that it was Wolf O'Donnell. The lupine gave him a smirk and Fox could see that he was sporting his own blaster pistol. Fox stared at it with fear. \"Oh relax Fox, if I wanted to kill you, I would have shot you instead of dragging you back in here.\" Wolf said, holstering his blaster.<br>\r\n<br>\r\nFox nodded and relaxed a little, hearing the footsteps of his teammates pounding outside his room as they ran for the hangar, then jumped as Falco pounded on the door. \"Fox! You in there?\" He called out, slamming his fist on the metal door.<br>\r\n<br>\r\nWolf nodded. \"Yes...the intruder is authorized to be here, and is in the room with me. It's Wolf.\" Fox replied, smiling at Wolf.<br>\r\n<br>\r\nThe avian left him alone and Fox stepped closer to Wolf. \"So...what do you want with me?\" Fox asked.<br>\r\n</span></div></div>",
            "created":1144040400,
            "id":310399,
            "title":"Grabbed From Behind"
        },
        "12121":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Refuse (Rape)",
                "Accept and bend over"
            ],
            "content":"<div class=\"\"><div> <span>Wolf grinned and looked Fox up and down, Fox giving a little blush as the lupine checked him out. \"I thought we could have a little fun...\" He said in a sly tone, winking at Fox.<br>\r\n<br>\r\nFox rubbed the back of his head, figuring he knew what Wolf was talking about, but decided to ask the question in his head anyway. \"What...what kind of fun...do you have in mind?\" He asked, tilting his head.<br>\r\n<br>\r\nWolf grinned again and licked over his lips. \"The kind of fun that requires you bent over in front of me so that I can feel a pleasure I haven't felt in ages...\" He replied, grinning more.<br>\r\n<br>\r\nFox blushed and rubbed the back of his head, quite flattered that Wolf wanted to yiff him, but he wasn't sure if he wanted it or not. What was he going to do?</span></div></div>",
            "created":1144040400,
            "id":310402,
            "title":"Wolf Wants Some Fun First"
        },
        "121212":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "That's enough! (Forced vore)",
                "Fox wants to be dinner"
            ],
            "content":"<div class=\"\"><div> <span>Fox blushed and looked around before smiling back up at Wolf. \"Ok...I'll do it...\" He replied, rubbing the back of his head.<br>\r\n<br>\r\nWolf grinned and watched as Fox pulled down his pants. Wolf murred and pointed at Fox's bed. \"On there, lie on your arms and knees, then raise your rump...and hike your tail while you're at it!\" Wolf ordered, unzipping his own pants and letting them fall to his knees.<br>\r\n<br>\r\nFox nodded and hauled up his pants so that he could walk and lay on his chest once he got to the bed. He pushed his pants back down and raised his hips, gripping the bed and closing his eyes as Wolf joined him. \"You ever been taken before, pup?\" Wolf asked, rubbing over Fox's bare cheek.<br>\r\n<br>\r\nFox nodded and looked back at Wolf. \"Eight years alone with four guys with no female contact is enough to make someone take a guy for some action, and is also enough to make a submissive person bend over for said guy.\" He explained, pretty much saying that if someone was horny, Fox bent over for them.<br>\r\n<br>\r\nWolf nodded and positioned himself, wrapping his arms around Fox's waist. \"Good..\"<br>\r\n<br>\r\nFox closed his eyes and let out a gasp as Wolf's large, throbbing member slid into his tailhole, stretching it as it tried to clamp down. He arched his back and dug his fingers into the sheets as Wolf pressed further in, feeling the lupine's fingers digging into his sides. \"Ohhhh...that feels good...\" Fox cried out, his mouth hanging open as Wolf's length rested inside him.<br>\r\n<br>\r\nWolf grinned and wiggled his hips, leaning down close and pushing Fox's hips down, then lied on his back, hugging Fox close. Fox got used to the new position and murred as Wolf whispered in his ear. \"The best is yet to come...\"<br>\r\n<br>\r\nWolf began to pull out, then thrusted his cock back into Fox. The moan of the vulpine kept Wolf thrusting harder and harder, feeling Fox wiggle under him with each powerful thrust. Wolf moaned himself and took a deep sniff of Fox's body, shuddering from the scent which caused him to push in harder and faster. \"Oh Wolf...you feel so good...harder!\" Fox cried out in passion, clenching hard around Wolf's cock.<br>\r\n<br>\r\nWolf inhaled Fox's scent once more and pushed in harder, stretching the tightening tailhole of Fox McCloud. Fox bucked his hips and grinded his rump against Wolf's hips. As Wolf kept pulling in and out, he dragged Fox off the bed a little, then pushed him foward with each thrust into his tailhole. Their moaning increased and Fox began to murr as he felt Wolf's precum leaking from his cock, moistening and lubricating his tailhole. \"Almost...there, Fox...\" Wolf said, licking the back of Fox's head.<br>\r\n<br>\r\nWolf murred, as did Fox, and continued to pound the vulpine, enjoying him so far. Fox's tail found its way around Wolf's waist and wrapped around it, digging his fingers into a pillow and burying his face into it as he made loud moans. Wolf arched his back and pushed in as hard as he can, his climax spurting his thick, hot seed into Fox's tailhole. Fox clenched hard and began milking Wolf's cock of wolf cum, greedily taking it all for himself and not letting a drop fall. Wolf kept pumping in and let out a howl of pleasure, lowering himself back onto Fox as it faded, still pumping into him. As the thrusts stopped, the two canines were left panting deeply. Fox felt Wolf sniffing over him and then blushed as Wolf patted his back. \"You were great, Fox...\"<br>\r\n<br>\r\nFox smiled and looked back. \"So were you.\"<br>\r\n<br>\r\nWolf grinned and took small, multiple sniffs of the vulpine. He moaned and licked the back of his head. \"Mmm...you smell..and taste delicious, Fox.\" He said, thinking of making the vulpine his meal.<br>\r\n<br>\r\nFox blushed, but didn't know what he meant. He looked back and wiggled his hips. \"What do you mean, Wolf?\"<br>\r\n<br>\r\nWolf grinned and licked his lips. \"It means that I want to eat you up...swallow you whole and alive...let you make my belly bulge with your body.\"</span></div></div>",
            "created":1144040400,
            "id":310404,
            "title":"Wolf's Fun With Fox"
        },
        "1212122":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Strip 'em",
                "The shell's the best part!"
            ],
            "content":"<div class=\"\"><div> <span>Fox blushed and looked back at Wolf with a grin. \"Mmm...then eat me up...I'd love to go inside your stomach...\" Fox said, rubbing Wolf's gut with his tail.<br>\r\n<br>\r\nWolf grinned and licked his lips, smelling Fox once more deeply, drool plopping down on Fox's head. \"Mmm...I can't wait to devour you! You smell so delicious!\" Wolf said, rubbing over his prey's front.<br>\r\n<br>\r\nFox blushed and giggled, his cock going erect from the treatment Wolf was giving him. \"Oh, thank you! I aim to please!\" Fox said, pawing at the bed.<br>\r\n<br>\r\nWolf chuckled and let out a hiss as he pulled his cock out of McCloud's tailhole. It came out with a pop, causing both to shiver and gasp. Wolf climbed off the vulpine's bed, while Fox lay there for a while, using his finger to feel for any cum that escaped. \"Mmmm...good aim...not a drop missing...\" Fox said, giggling.<br>\r\n<br>\r\nWolf blushed and watched Fox get up. \"You want to dine on me with my clothes on or off?\" Fox asked, smiling at Wolf.</span></div></div>",
            "created":1144040400,
            "id":310461,
            "title":"Wolf's Dinner Plans"
        },
        "12121222":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Digest Fox",
                "Let him out"
            ],
            "content":"<div class=\"\"><div> <span>Wolf grinned. \"Keep your clothes on...I have all the time I want to eat you nude.\" Wolf said, licking his lips.<br>\r\n<br>\r\nFox zipped up his pants and came closer to Wolf, wrapping his arms around his waist so Wolf could easily devour him as his snack. \"What do you mean?\" Fox asked, waiting for that drooling maw to engulf him.<br>\r\n<br>\r\nWolf gave Fox's forehead a lick and grinned, moaning in delight from McCloud's flavor. \"I think I'm going to be staying here for now on...\" He said before stretching his jaws over Fox's head.<br>\r\n<br>\r\nFox murred in delight of being eaten and that Wolf was going to stay with him so he could do this whenever he wanted. He closed his eyes and let Wolf work his jaws over his furry head, smiling as the wolf gulped, pulling in his head. The rough tongue slurped over Fox's face, closing his eyes in delight as Wolf savored the taste Fox had. \"Mmmm...delicious...\" Wolf said, already enjoying his meal.<br>\r\n<br>\r\nFox went limp in Wolf's grip, letting the lupine swallow him whole. The wolf's lips pressed over Fox's neck and then began stretching more to take in his broad shoulders. Wolf pushed Fox's shoulders into his jaws and slurped at his clothed chest. Surprisingly, the clothing tasted just like Fox's fur, and even carried the same scent! He'd have to ask Fox about that when he got him inside his stomach.<br>\r\n<br>\r\nFox moaned in delight as his muzzle pressed into Wolf's throat, the muscles pulling him down. He murred from the tongue washing over him, coating him in Wolf's thick saliva. He shuddered in pleasure and his tail wagged happily as Wolf made Fox his food. \"Eat me up, Wolf...I'll feel so good in your belly!\" Fox cried out, obviously having been eaten before since he liked it so much.<br>\r\n<br>\r\nWolf groaned around Fox and used his paws to guide his delicious morsel into his jaws. Another powerful gulp brought Fox in up to his elbows. The strong lupine lifted Fox up into the air, letting gravity help pull Fox further in. He felt his neck and chest bulge as Fox was pulled inside for his meal, now working over his rump. Outside, his tail swished and his legs kicked happily, adding more pleasure to Fox's predator. \"Mmmmm...\"<br>\r\n<br>\r\nFox giggled and felt Wolf push the rest of his body into his jaws, slurping up his tail like a noodle as it was the last thing remaining. He closed his jaws and licked his lips, tasting the delicious fox on them. His stomach expanded as Fox was forced to curl up inside, leaving a distinctive outline in his belly. Wolf opened his eyes and rubbed where the outline of Fox's head was, then let out a massive belch. \"Mmmm...you were delicious, Fox...the perfect meal for a hungry wolf like me.\" O'Donnell said, chuckling.<br>\r\n<br>\r\nFox smiled and murred, wiggling around inside Wolf's stomach, nuzzling into the stomach walls. He was coated in saliva, but yet he was as happy as he could ever be. He looked up at the opening to Wolf's throat, which was tightly closed to prevent his meal from escaping. \"Was I filling?\"<br>\r\n<br>\r\nWolf nodded and let out a little belch. \"Mmm...very much so.\" He said as he pondered what to do next.</span></div></div>",
            "created":1144040400,
            "id":310472,
            "title":"Wolf's Fox McCloud Dinner"
        },
        "123":{
            "author_id":"readasaur",
            "author_name":"Readasaur",
            "choices":[
                "He decides to meet Panther for the romantic dinner date.",
                "He decides not to meet Panther. ",
                "He calls Panther and invites him to join him on his own ship for the date. "
            ],
            "content":"<div class=\"\"><div> <span>Fox entered his quarters with the slow tread of the really exhausted, and sat in his favorite chair with a long sigh. What a day... They'd flown five missions in a row, and finally earned some time off. Drowsy as he was, Fox had no idea how he was going to spend his vacation, and decided that he'd sleep on it. He was so tired that he wound up falling asleep in his chair, and woke up hours later feeling a little sore from sleeping while sitting up. He stretched, yawned, and began to cross his room to his bed when he noticed something on the table. It was a holo-message, a little disk that contained a short recording, and a red rose lay in front of it. Had that been there when he'd come in? Or had someone put it there when he'd been asleep? None of his crewmates were really the type to leave roses... <br>\r\nThe idea of an intruder sneaking onto the ship while they were gone was disturbing, but not half as disturbing as someone coming into his room while he was sleeping and leaving a note. Gingerly, he picked up the holo-message, and pressed 'Play'. <br>\r\nInstantly the image of Panther Caroso's head appeared above the disk, and his deep, purring rumble of his voice came out of the speaker in time with the movement of his mouth. <br>\r\n\"Fox McCloud, is is I, Panther Caroso of the Starwolf Team... I have tried to ignore my feelings for the sake of professionalism, but I cannot hold back any longer. I have been captivated by you since the first moment I lay eyes on you. From that day, I have desired only to make you mine, to love and worship you as a creature of your exquisite beauty deserves. If you could find it in your heart to give me the opportunity, I would eternally grateful. Please, do me the honor of joining me for a romantic dinner tomorrow night. I promise, you won't live to regret it...\" <br>\r\nStarfox dropped the holo-message, looking a little freaked-out. Panther was... interested in him? The infamous ladies man, Panther, was interested in Fox, who might not have been the manliest guy in the galaxy, but definitely a guy. Maybe there was a mistake, and this was meant for Krystal? But no, it was addressed to him, and Panther had said his name directly. This was just crazy.<br>\r\nStill... Panther was a handsome cat, and the message was flattering... And it wasn't like Fox had anything else to do... <br>\r\nBut what if it was a trap? Maybe Wolf O'Donnell had made Panther say those things, in order to lure Fox to his doom. Or maybe Panther himself was lying just to get Fox, and clear the way to Krystal.<br>\r\nFox picked up the rose, sniffing it and looking contemplative. <br>\r\nWhat to do... </span></div></div>",
            "created":1284181200,
            "id":954871,
            "title":"Panther Caroso, the Romantic Rouge"
        },
        "13":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Go through the game",
                "New Adventure",
                "Nah, just feed him to a tribe/Other",
                "Nah, just feed him to an adult Tricky",
                "Nah, just toss him to General Scales!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Dinosaur Planet/Sauria was full of hungry dinosaurs, yet barely any of them tried Fox out as a snack. Will you go through the game and feed Fox to those dinos, or will you have him go back on a visit?</span></div></span></div>",
            "created":1135746000,
            "id":292245,
            "title":"Dinosaur Planet Choices"
        },
        "133":{
            "choices":[
                "Tribe.",
                "Wild person.",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you've chosen this chapter. Would you like a tribe, a rouge wild person or other options.</span></div></span></div>",
            "created":1259557200,
            "id":799423,
            "title":"Nah, just feed him to a tribe/Other"
        },
        "1333":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Random Encounter #1 - Lightfoot Cookout",
                "More Choices (Always have this choice before starting)",
                "More Choices (Always have this choice before starting)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So rather than specifics, let's try some random scenarios based on Dinosaur Planet!<br>\r\n<br>\r\nLet's begin!</span></div></span></div>",
            "created":1313384400,
            "id":1169054,
            "title":"Encounters"
        },
        "13331":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Fox wakes up naked",
                "Fox wakes up fully clothed"
            ],
            "content":"<div class=\"\"><div> <span>\"C'mon Fox, let's get going!\"<br>\r\n<br>\r\nFox's peaceful slumber was interrupted by the shrill calling of his dinosaur companion. His eyes opened up, filling with the calm blue sky of the mid-afternoon Cape Claw resting place Fox McCloud had chosen to settle down for a quick nap. He turned to face Tricky, the small little Earthwalker bouncing up and down next to him. \"C'mon, c'mon! Let's go back to the Hollow and tell mom how far we've come!\"<br>\r\n<br>\r\nFox chuckled a little to himself, but made no effort to get off the warm sand. \"Tricky, I just hoofed it all the way down here, nearly got fried by that fun electrical floor in the Ocean Force Point temple, and nearly went insane trying to figure out that box in the temple itself. I kinda want to have a nap, if you don't mind! I haven't had a good sleep since I started the mission.\"<br>\r\n<br>\r\nTricky groaned unhappily and started to tug on Fox's shirt with his beaked mouth. \"You can sleep at the Hollow! Let's go, c'mon!\"<br>\r\n<br>\r\nFox finally gave in and groaned, rising to his feet and dusting himself off. He picked up his vest, having had it bundled up under his head to serve as a pillow and slipped it back over his arms. He gathered up his pack and followed Tricky up the winding path leaving to the cave outside the Cape. \"If we get lost in the maze again, I'm blaming you.\" Fox snicked at Tricky.<br>\r\n<br>\r\n\"Yeah yeah, whatever. Let's go!\" The excited Earthwalker chimed.<br>\r\n<br>\r\nFox groaned as he climbed up and down the ladders leading towards the area outside the Lightfoot Village, approaching the maze with an unhappy frown. \"I hate this place...those spiked plants really hurt.\" Fox groaned, staff in hand.<br>\r\n<br>\r\nFox quickly navigated the maze, smacking his staff against the sentient plants attached to the walls that lunged at him. Finally, using his PDA map, he found his way out of the maze and into the mouth of the entrance to Lightfoot Village's outskirts. Waiting there was a whimpering Lightfoot baby. Fox took pity on the little dinosaur and knelt down beside it, asking how it was. Tricky, however, suspicious of it, watched the trees, calling out too late as the Lightfoot tribe sprung their trap, pouncing Fox and knocking him out cold...</span></div></div>",
            "created":1313384400,
            "id":1169078,
            "title":"The Ambush"
        },
        "133311":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "They begin to rape Fox",
                "Musclefoot grabs a spear"
            ],
            "content":"<div class=\"\"><div> <span>Fox's eyes opened, the dazed look of two pairs of feet stood in front of him. He tried to raise his head, but the pain was too much and he looked down towards his own feet. What he saw nearly completely stirred him from his daze: His clothes were gone!<br>\r\n<br>\r\nFox's head shot up in spite of the pain and saw the entire Lightfoot tribe surrounding him, the chief and the Lightfoot he rescued looking at him with angry faces. Fox was stripped nude, tied to a large totem pole by his wrists. He could only struggle as the pain slowly left his head. \"That's the one! That's the steenking beast that stole our treasure!\"<br>\r\n<br>\r\nFox glared at the lying Lightfoot and growled. \"Stole it?! You threw it at me and told me to take it! Untie me, and give me back my clothes!\"<br>\r\n<br>\r\nThe chief ignored Fox's demands. \"You steeel our treasure...and give it to the steenking Sharpclaw! Your clothes, however...no use to you are they now!\"<br>\r\n<br>\r\nFox continued to glare, but then two Lightfoot on either side of him grabbed one of his legs, lifting each one towards the chief and the lying Lightfoot. They grinned as Fox's tail drooped straight down, exposing his tight round tailhole. They looked over his rump approvingly and grinned. \"Yes...he is perfect.....now let us show you what we do to thieves...\"<br>\r\n<br>\r\nFox's eyes shot wide as they began to approach him, struggling and trying in vain to kick his legs. There was nothing he could do now...</span></div></div>",
            "created":1313384400,
            "id":1169088,
            "title":"What do you want?"
        },
        "1333112":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "The Chief's Brutal Revenge",
                "Fox is suffering enough, no need to hurt him more"
            ],
            "content":"<div class=\"\"><div> <span>Fox, forced into a seating position, watched with horror as the Lightfoot referred to as \"Musclefoot\" approached him with a spear. His legs twitched, the two Lightfoot holding them starting to massage and grope along his thighs and calves,  grinning as they watched Musclefoot approach their prisoner, giving a sinister chuckle. They held Fox's legs tightly and spread them apart, while a third Lightfoot slipped under Fox and began to grope and spank his tight, round and large rear end.<br>\r\n<br>\r\nFox would have blushed in normal circumstances, but the horror of watching Musclefoot line that spear up with the entrance to his rump scared the living daylights out of him. He waited for the pain of it entering, but he just stayed put, hovering that sharp stick near his rear. The Chief Lightfoot stepped up close to Fox and grabbed a toe, rubbing his claws along Fox's feet, as if testing them, then he leaned in towards Fox and too a deep sniff along his body. \"Mmm...well, is time to sentence!\" He said, licking those scaly lips.<br>\r\n<br>\r\nFox's ears flattened to his head, starting to pant heavily in fear, his heart beating so fast and so loud that he swore it was ceremonial drums being beat throughout the village. \"Thief, for stealing our treasure...you are sentenced to be roasted and served at tribal banquet.\" The Chief said aloud, much to the delight of the crowd.<br>\r\n<br>\r\nThe vulpine thought they were joking, but the sound of a fire starting grabbed his attention. His head turned to see a fire growing between two spit holders, and a Lightfoot tossing Fox's clothes into the fire to help feed it. Tears began to flow from his bloodshot eyes, begging the Chief to reconsider. \"Please don't! I didn't steal anything! I swear! I'm the good guy here, let me go and together we can beat the Sharpclaw!\"<br>\r\n<br>\r\nThe chief merely shook his head. \"The sentence has been said, there is no overturn. Musclefoot, prepare the beast for dinner.\" The chief ordered.<br>\r\n<br>\r\nMusclefoot grinned and nodded to the Lightfoot under Fox groping his rear. The dinosaur stroked a few fingers along Fox's tight tailhole before gripping his rear end, Fox giving a yelp in surprise as the Lightfoot tugged, pulling Fox's cheeks apart and stretching open Fox's tailhole just wide enough for Musclefoot to guide the tip of the spear inside. With loud grunts, Musclefoot slowly pushed the spear into Fox's body, the cries of Fox inciting cheers from the crowd who enjoyed the fact that Fox was in pain. The vulpine felt the spear slowly extending into his body and sobbed in terror, his legs and toes trying to kick and twitch, but only his toes could wiggle as the Lightfoot held him on tightly. The Chief watched and licked his lips, he wanted more, he wanted the crowd to enjoy the 'thief's' plight, but he wondered if he should increase Fox's punishment, or just leave it be as is...</span></div></div>",
            "created":1313470800,
            "id":1169097,
            "title":"The Satisfying Sound of One's Impalement"
        },
        "13331121":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Fox is placed over the fire",
                "Fox's fur is shaved off"
            ],
            "content":"<div class=\"\"><div> <span>The chief grinned, he could see his tribe was anxious about getting a chance to induce more pain into their meal, Fox was yelping, but it wasn't enough for them. Musclefoot was getting all the fun, slowly shoving that spear into Fox, the bulge of it now visible in Fox's lower abdomen. The chief raised his claw and gave a call to attention. \"Tribe, attention! This beast is tough and hard...we must tenderize him! Do with the beast as you will! Just make sure it is still alive to be cooked!\"<br>\r\n<br>\r\nFox's eyes went as wide as saucers, but then curiously watched as all the Lightfoot left the sacrificial mound, save for Musclefoot, who himself has stopped impaling Fox, the three holding him up, and the Lightfoot tending to the fire. Everything seemed to be on pause, but Fox's heart sank when he saw the Lightfoot tribe slowly returning to the mound with blunt objects and other devices, no doubt going to be used on him. Objects included large to small wooden clubs, to even spatulas, tribal belts, and rocks. One by one, they all lined up, eager to get a turn with Fox. The four near him stepped aside slightly, to not obstruct the crowd, while Musclefoot continued to slowly push the spit into Fox's rump.<br>\r\n<br>\r\nThe tribe then went postal. The first walked up with his wooden club and struck Fox on his right thigh as hard as the dinosaur could, invoking a shrill shriek from Fox that was answered with a roar of approving cheers. One by one , the tribe struck Fox with whatever they had, tossing rocks at him, beating his legs and rear, strapping his back and arms with the whips and belts, each scream met with a crowd of cheers. Eventually, they began to sang and dance to celebrate Fox's pain, even while still beating him. His screams became one with the music, and the more musically inclined dinosaurs used Fox's body as a drum set, the loud thwacks of their sticks and clubs landing on his body served as drum beats. Fox hadn't even noticed the chief placing a grill over the fire, heating it up. The Lightfoot holding Fox lifted him more as the spit shoved through, keeping him straight and level as it miraculously, despite everything else, avoiding all vital organs and piercing very little. Musclefoot was no doubt skilled at spitting living meat, and keeping it alive during the process.<br>\r\n<br>\r\nAfter an hour and a half of the savage beatings, Fox had been untied from the pole, now sporting one end of a spear sticking out of his rump, and the sharp end hanging outside his jaws, the wood shaft laying on his tongue all the way through his body. Musclefoot and his three helpers then carried Fox through the dancing crowd, Fox's translator deciphering their lyrics, all singing a song about how they were going to eat Fox. Those who had them threw rocks at him, none missing their target, others whipped him, as the foursome carried him towards the fire.</span></div></div>",
            "created":1313470800,
            "id":1169113,
            "title":"The Chief's Brutal Revenge"
        },
        "133311211":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Tricky to the rescue!",
                "No hope, Fox is lunch now"
            ],
            "content":"<div class=\"\"><div> <span>Fox's eyes watered and tears leaked down his furred cheeks, hoping this was all some sort of horrible nightmare. His entire body ached, outside and inside, and the odd, uncomfortable, and unnatural feeling of a spear running through his whole body caused him to make 'erk' sounds each time he was bounced by the two carrying him. His aching body felt more heat arriving the closer he got to the fire, then he was placed between the two holders, his eyes watching the spear's tip rest  between the Y shaped logs. Musclefoot then tied a rope around the spear's tip, making Fox a little curious, despite everything that had been going on.<br>\r\n<br>\r\nHe got his answer soon enough. The chief had the other end of the ropes tied to both ends of the spear and used them to lower Fox onto the grill placed over the fire. Fox's underside sizzled as he touched the heated bars, the vulpine letting out an agonizing cry as the grill burned into his skin, leaving an imprint of the bars. The Lightfoot tribe cheered, celebrating the 'criminal's' pain. The chief would then lift Fox off the grill and allow Musclefoot to slowly rotate Fox over the fire. The chief would then lower Fox back onto the grill at certain points, making sure he was being grilled evenly while roasting over the open fire. The smell of roasting vulpine soon began to flood the village, and those not in attendance made their way to the dining area set up to house Fox once he was finished. Fox's cries of pain fell on deaf ears, the only reaction being the enjoyment of the crowd that he was in pain. The tip of the spear glowed red, and Fox began to drip succulent juices into the fire, sizzling and crackling as it licked at his body, ensuring he would be roasted to perfection.<br>\r\n<br>\r\nHe was lowered onto the grill again, but instead of being lifted out in a second, the chief kept him there, and Musclefoot continued to rotate Fox while resting on the grill. Fox screamed as loud as his lungs could scream, and now more Lightfoot began to strike him again with their clubs and stones, the torture of the meat ensuring its flavor for the royal feast. It seemed hopeless for Fox, he had seen now what the Lightfoot did with thieves, in the back of his mind, he wondered what treatment perpetrators of more serious crimes had received.<br>\r\n<br>\r\nFox's body grew red, and the scent began to attract the odd Sharpclaw at the village's gate. Many were drooling, a few had even begun to masturbate to Fox's torture, while everyone eagerly awaited the moment their meal was cooked. </span></div></div>",
            "created":1313470800,
            "id":1169303,
            "title":"Roasting the Vulpine"
        },
        "1333112112":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Fox survives his roasting",
                "Fox is roasted golden brown (Fatal)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are two ways for Fox's outcome. Which fate shall he receive?</span></div></span></div>",
            "created":1313470800,
            "id":1169304,
            "title":"We interrupt this story for a choice! "
        },
        "13331121122":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "content":"<div class=\"\"><div> <span>The Lightfoot surrounding Fox jeered at him, calling him a thief, a 'steenking liar', and now 'meat' as they savagely tortured the poor vulpine. His plump rear was glowing red from the fire's heat, and the beatings of the tribe, Fox's eyes shut tight and failing to hold back tears. The chief had lifted Fox from the grill again and now stood in front of the cheering crowd, celebrating Fox's agony. \"Now...we shall beat until the meat passes out!\" the Chief proclaimed, returning to the ropes and lowering Fox back onto the grill.<br>\r\n<br>\r\nAll at once, he was being rotated over the grill while all the Lightfoot that could surrounded him and beat him mercilessly. The tribe struck, and whipped, and landed several blows to Fox's body, only stopping when his agonizing cries faded away as he shut his eyes for the last time and passed out from the immense pain. The crowd dissipated, leaving the chef to deal with the still living meat.<br>\r\n<br>\r\nThe dinosaur hummed to himself as he grabbed a vial and squeezed the plunger, squirting liquids onto Fox's body to baste him. Squirting as much as he could, the Lighfoot cook began to evenly spread the liquid over Fox's body, using his fire-resistant scaled claws to massage it all over the vulpine's body and fur. The vulpine hardly stirred, but the Lightfoot could feel his heart beating as he massaged the chest. Grabbing an improvised razor, the dinosaur then sheered Fox's fur, shaving it from his heated body, collecting it in a large bag as he went along Fox's body, clipping the fur off every inch, excluding his tail. The furred tail would later become a trophy after the tribe had dined on Fox, and his bones would be used to make weapons and decorations. The Lightfoot spanked Fox's bare rump twice to test the meat, then went back to basting the vulpine, squirting water over his body that sizzled with the heat.<br>\r\n<br>\r\nThe dinosaur spent over two hours alone with Fox, rotating him on the grill, seasoning and basting the poor vulpine, until his skin had become as golden as the fur that once covered his body. The scent had filled the village, prompting jokes about how he was supposed to be a 'steenking beast', not a 'delicious meal'. There was no longer any life left in McCloud, it had all been roasted out of him. The chef pulled the browned Fox from the fire, a circle of grill lines covering his body, the flesh cooked to perfection. The spit was pulled from Fox's rear without any care, and an apple had been placed into his mouth. Under the chief's order, the chef then slid various fruits native to Sauria into Fox's rear, including the delicious Dumbledang pods. He was then placed on a silver platter and carried to a large table, where the chief stood at the end, facing Fox's stuffed rear end. A horn sounded throughout the village, signalling that the meal was being served. The entire tribe showed up, and after a prayer to the Krazoa, the chief grabbed his bone carving knife and sliced into Fox's thigh, giving a slice of white meat to the nearest Lightfoot.<br>\r\n<br>\r\n<br>\r\nThe tribe went back to their huts with full bellies, some of the more hungrier Lightfoot even had plump bellies from the amount of meat they consumed. Fox, however, had been reduced to a pile of bones tossed casually around the sacrificial mound. The bigger ones were collected to make weapons and armor, while the smaller bones were to become necklaces. The prized tail was kept hanging above the chief's chair to serve as a fan, while the full skull of Fox was kept as a trophy by Musclefoot.<br>\r\n<br>\r\nThe StarFox team never learned what happened to their leader, and he officially was put on the Missing in Action list. Peppy, however, had the correct assumption that Fox had met his end in the belly of a dinosaur.</span></div></div>",
            "created":1313470800,
            "id":1169689,
            "title":"The Golden Fox"
        },
        "14":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Go through the game",
                "Fox's run-in with the queen",
                "Fox finds himself outnumbered with little ammo",
                "Fox's run in with one of the bosses (Choose one next chapter)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Those aparoids are hungry too! Like with Dino Planet, will go through the game? Or just feed Fox to them?</span></div></span></div>",
            "created":1135746000,
            "id":292247,
            "title":"Oh no, Aparoid.....choices."
        },
        "15":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "FT Oikonny (Original Character)",
                "Writer's Choice",
                "Writer Choice",
                "Writer's Choice",
                "Writer's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A story is about to begin now with this next choice. If you want to start another story, please select \"Writer's Choice\" in this chapter. Now, let's begin!</span></div></span></div>",
            "created":1171342800,
            "id":382016,
            "title":"Time for a story"
        },
        "151":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Yiff Fox",
                "Eat Fox"
            ],
            "content":"<div class=\"\"><div> <span>Fox's eyes slowly opened as he awoke from a wonderful sleep. His dreams were filled of fun times with his mate, and how much he enjoyed his mate's company. His eyes finally opened fully, with a smile on his face, and glanced at the time on the alarm clock which sat on a stool next to his bed. The clock read \"10:30 AM\" and Fox wiggled a bit and turned his head towards his waist.<br>\r\n<br>\r\nFox, sleeping in the nude, saw a green arm wrapped around him. He was used to this and liked the feeling, along with his mate's body pressing against him while he slept. He rolled over slowly and watched his sleeping mate, FT Oikonny.<br>\r\n<br>\r\nFT was a tall, green dragon in the Cornerian military. He was a Captain with striking blond hair. Sticking out of his hair were two golden horns with very sharp points. His yellow eyes were hidden from his closed eyelids and Fox closed his own eyes when a blast of air was snorted from the nostrils on FT's snout. Fox let out a little murr and rubbed FT's arm, smiling and wagging his tail, waiting for the dragon to wake up.<br>\r\n<br>\r\nAs if on que, the dragon's eyes fluttered open and met Fox's emerald eyes. Fox giggled as a deep sniff came from FT. Fox loved waking up every morning and being smelled by the dragon, and FT loved to smell Fox, often drooling from the scent. The dragon purred and a small bit of drool fell from his lips.<br>\r\n<br>\r\nFox caught it with his finger and giggled, poking FT's nose with his other hand. \"Good morning, FT.\" He finally said, placing a kiss on FT's lips.<br>\r\n<br>\r\nThe dragon returned the affectionate kiss and rubbed Fox's furry side. \"Morning, Fox.\" He yawned, causing Fox to murr and stare down the open maw.<br>\r\n<br>\r\nFox's curious paw ran down FT's body and wrapped around his dragonhood. \"Someone's got morning wood.\" Fox said with a blush.<br>\r\n<br>\r\nFT did the same and licked Fox's muzzle. \"So do you.\" He said with a rumbling belly.<br>\r\n<br>\r\nFox blushed again and looked towards FT's stomach. \"Someone's hungry too.\" He said, rubbing FT's growling stomach.<br>\r\n<br>\r\n\"So, what's it going to be, FT? Breakfast or tenderizing for later?\" Fox giggled, referring to being eaten by FT or being taken by him. FT decided to...</span></div></div>",
            "created":1171342800,
            "id":382018,
            "title":"I woke up next to a dragon today"
        },
        "1511":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "FT wants Roast Fox McCloud",
                "FT wants raw Fox McCloud"
            ],
            "content":"<div class=\"\"><div> <span>FT sat up in bed and pulled the sheets off his body. Fox did the same and eagerly waited for the dragon's response. His tail wagged in anticipation. \"Get on your arms and knees, sexy. And show off that wonderful rump of yours!\" FT ordered, licking his lips.<br>\r\n<br>\r\nMcCloud did as he was ordered and grinned as he moved in front of FT, raising his tail to show off his tailhole. He heard a lustful growl from FT and closed his eyes, waiting for his hole to be stretched open by FT's cock.<br>\r\n<br>\r\nFT crawled over to his foxy mate and placed his paws on Fox's shoulders. He mounted up and rubbed his cockhead against Fox's tailhole. \"Get ready McCloud, I'm about to launch a nova bomb into your ass.\"<br>\r\n<br>\r\nFox giggled and blushed, preparing himself for the Assault. FT growled and let out a hiss as he thrusted his hips forward, pushing the bulk of his huge member into Fox's tailhole. He felt the tailhole stretch around his cock and kept pushing in. Fox let out a yelp as it was pushed in, but it turned into a moan.<br>\r\n<br>\r\nFT leaned down to his mate's head and licked Fox's cheek. \"Time to tenderize the fox meat.\" He said in Fox's ear as he began to thrust in hard, causing Fox to yelp and moan in pleasure.<br>\r\n<br>\r\nFox closed his eyes and grinded his rear into FT's crotch, moaning and burying his head into the mattress. He loved the feeling of the dragon cock sliding in and out of his tailhole. He'd been taken many times, but he was still as tight as a virgin.<br>\r\n<br>\r\nFox and the dragon moaned loud as the thrusts sped up, FT gripping his fox hard. Both arched their backs and lifted their heads, crying out in pleasure as FT pounded in and out of Fox's tight and sexy ass. His precum lubricated the innards of Fox McCloud, allowing him to make even more fast and harder thrusts. Fox let out a squeal of pleasure and looked back towards his horny mate. \"Pretty energetic...for someone...who just got up!\" he said between moans.<br>\r\n<br>\r\nFT laughed and growled with a lustful tone. Both horny animals knew that the climax would be coming soon. Then, without any warning, FT made a very hard thrust and let out a roar that was heard around the Great Fox as his cum flowed into Fox's tailhole, filling his innards with rich, hot dragon seed.<br>\r\n<br>\r\nFox let out a howl and used his tailhole's muscles to clench and milk the dragon of his seed. Once the flow of dragon spooge came to a stop, the two collapsed on the bed, panting hard while FT sniffed and licked Fox, tasting his flavor and smelling his wonderful scent. Fox moaned and wiggled under FT. \"I know what's next. You want to eat me, and I want you to eat me.\" Fox said, smiling with pleasure.<br>\r\n<br>\r\n\"You want a roast Fox or a raw Fox?\"</span></div></div>",
            "created":1171342800,
            "id":382023,
            "title":"Morning Sex"
        },
        "15112":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Feet first",
                "Head first"
            ],
            "content":"<div class=\"\"><div> <span>FT licked the white stripe of fur on Fox's head and gave another powerful thrust into Fox's ass. \"Mmm...I think I'll have raw Fox this morning.\" FT said, rubbing Fox's sides.<br>\r\n<br>\r\nFox became excited, but was also disappointed. \"Aww...I don't get to be cooked?\" He asked, his tail rubbing FT's belly.<br>\r\n<br>\r\nFT giggled and patted Fox on the back. \"I'll cook you for dinner, ok?\" FT replied, kissing Fox's cheek.<br>\r\n<br>\r\nFox smiled and nodded, just being happy that he was going to get eaten either way. He loved being FT's dinner. He always had fantasies of being a dragon's lunch, but never thought he'd meet a dragon who could make them come true. So, once he met FT, he made sure he didn't lose him.<br>\r\n<br>\r\nFox wiggled under the dragon and gasped as the cock was pulled from his tailhole. FT climbed off Fox, who was happily pinned under his weight, and looked over his mate turned meal. He never digested Fox, and never planned to do so. He had an ability to control the acids in his stomach. \"So Fox. The choice is now yours. You want to be eaten feet first, or head first?\" FT asked, licking his lips as he watched his delicious fox mate.</span></div></div>",
            "created":1171342800,
            "id":382028,
            "title":"Raw Breakfast"
        },
        "151121":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Go back to sleep",
                "Let Fox out"
            ],
            "content":"<div class=\"\"><div> <span>Fox flipped over onto his back and kicked his feet slowly in front of FT. \"Eat me feet first, dear. I want to see myself becoming a bulge in your sexy body.\" Fox said with a murr.<br>\r\n<br>\r\nFT grinned and leaned forward, smelling Fox's sexy and delicious scent. \"Mmm, alright McCloud. Feet first it is.\"<br>\r\n<br>\r\nThe dragon grabbed Fox's ankles and pushed his feet together. His jaws opened up and he slipped his lips over the furry footpaws. Fox moaned and watched his feet disappear in FT's mouth. He giggled and laughed as the tongue lapped at his feet, soaking them in his warm and sticky drool. FT grinned and slowly pressed his lips down over Fox's legs, his tongue slurping at his haunches while his neck stretched with the outline of Fox's lower body.<br>\r\n<br>\r\nFox moaned and slowly rubbed his midsection, his erect cock throbbing from the arousal of being devoured by this wonderful dragon he had for a mate. Fox enjoyed the view of his lower body becoming a bulge in FT's throat and lifted himself up to allow FT to take his round rear into his jaws.<br>\r\n<br>\r\nFT placed his paws on Fox's back and lifted him up off the bed, guiding his incredibly delicious mate into his salivating jaws. FT moaned and licked faster, trying to taste every inch of Fox McCloud, savoring his delectable flavor as he turned Fox into his meal again.<br>\r\n<br>\r\nFox leaned forward and hugged FT's snout as he slipped past FT's lips more. Fox felt the tongue dancing over his belly and back before another voracious swallow pulled him in to his chest. He giggled and worked his own arms into FT's jaws and just lay back and let his mate enjoy his breakfast.<br>\r\n<br>\r\nFT closed his eyes and reached up, placing on paw on Fox's head and the other on his throat. He shoved Fox into his jaws and purred while Fox tilted his head back to watch the jaws close around him. Once he was sealed behind a cage of teeth, the tongue lapped at the remaining Fox meat before a swallow took all of Fox McCloud into FT's gullet.<br>\r\n<br>\r\nFT rubbed his throat, guiding and feeling Fox slide down his gullet and let his paws rest on his expanding belly as Fox slipped inside. The vulpine curled up into a ball and wiggled his body, sending pleasure throughout FT's body. The dragon moaned and licked his lips, still tasting Fox's flavor on his lips. He sat back in bed and rubbed over his squirming gut with Fox's outline before letting out a Fox scented belch. He giggled and patted his stomach and blushed once Fox decided to deal with his own morning wood. \"That was a wonderful breakfast, Fox. I always enjoy your breakfast in bed surprise!\"</span></div></div>",
            "created":1171342800,
            "id":382030,
            "title":"Fox goes down FT feet first"
        },
        "152":{
            "author_id":"readasaur",
            "author_name":"Readasaur",
            "choices":[
                "Continue",
                "They decide to have some fun with him first. ",
                "Someone decides to swallow him whole, right there and then. "
            ],
            "content":"<div class=\"\"><div> <span>Morale was low on the Great Fox. <br>\r\nAn ambush by a fleet of their many enemies had left them floating in space. <br>\r\nThe Starfox team had destroyed the fleet, but not before they had knocked out the Great Fox, and they couldn't get very far in just their Arwings. <br>\r\nThe power was depleted, they were lost, and the ship itself had sustained heavy damage. They were reduced to using just their momentum to travel along in the direction they hoped was the right one. What little energy they had was spent on maintaining life support in the crew's quarters, so they could at least wait in relative comfort. <br>\r\nThe good news was that Slippy was almost certain they were headed to a space station, where rescue awaited. <br>\r\nThe bad news was that their cargo bay had been hit, meaning they had no supplies to survive the trip! <br>\r\nThere was still the emergency water rations, but without food, they simply wouldn't make it. All of them were already painfully hungry, and they often went to bed trying to ignore their growling stomachs. <br>\r\nThat was when Peppy had called them all together and calmly announced the only sensible course of action. Naturally, the other three had been shocked and horrified, but Peppy had remained resolute. He told them that it was standard procedure in situations like this one, and that only the meat of a crew member would ensure the survival of the team. He went on to cheerfully tell them how ere had been a fourth member of the original Star Fox team, until a situation much like this one had come along and he had been randomly selected and cooked. Peppy even smiled in fond remembrance of his former friend's taste, and how full and satisfied he felt after devouring him. Gradually, his loving descriptions had melted the apprehension of the rest of the team, and they even began to look forward to it. Truth be told, their hunger made it easy to stop seeing one another as close friends and comrades, and more and more as potential meals. Peppy had sternly told them that the choice would be random, and that only one need be eaten. <br>\r\nUnsurprisingly, the predatory Fox had warmed up the idea faster than the others. He kept trying to imagine what it would be like to munch on Slippy's smooth, strong legs, or to chow down on his delicious-smelling mentor, Slippy. Most of all, he drooled at the thought of eating Falco. Picturing that sexy bird, who's bunk he'd shared quite a few times on lonely nights, cooked to perfection and golden-brown was enough to make his stomach rumbles drown out the others. He was trying to decide which part of Falco he'd start on (His muscular chest? His strong arms? His tight ass?) when Peppy snapped him out of it, asking him to go and fetch the four straws they'd need to decide who would go in the oven. <br>\r\nFox was eager to comply, licking his lips when he was out of sight of the others. He'd decided now, as good as the other two looked, they were going to eat Falco. He found the straws in a drawer and quickly snipped them into four different lengths, then carefully arranged them in his closed fist so that the various sizes were hidden, then moved them into order. He had a plan... He would approach the group carefully so that Falco was on his left when they went to grab the straws, and he had put the longest straw on the left side of the small group. They would never suspect their brave and honorable leader of cheating like that, so they would all bid Falco a fond farewell and cook him right up. Fox couldn't wait! He wondered if he should give Falco one more kiss goodbye, then dismissed it. He would be getting more of Falco's taste than he ever dreamed soon. <br>\r\nHe came back to the group, where they waited a little anxiously to see who would get eaten. It was perfect, Slippy was on his right, Peppy in front of him, and Falco on his right. All of them grabbed their straws, took a breath, and pulled them free, leaving Fox with the shortest straw. <br>\r\nFox looked eagerly at Falco, but to his surprise, the bird seemed relieved to see that he had the longest straw. All three were looking at him with pitying expressions. <br>\r\n\"Sorry, Fox, it looks like luck was against you...\" <br>\r\nIn a bolt of realization, Fox realized that he had misheard Peppy, and that it was the <i>shortest</i> straw that was the losing one! Stunned, he began to stammer, paralyzed with fear as his teammates closed in on him. <br>\r\n\"We really appreciate this, Fox. A leader sacrificing himself for his team. Your father would be proud...\" Peppy told him, standing so close that Fox could feel the head from his breath on on the back of his head. He was surrounded, and in his mute panic, could think of nothing to do or say. Slippy grabbed hold of his pants' waistline, and Falco took a hold of his shirt. The frog pulled down as the bird pulled up, and Fox was suddenly naked between his chest and ankles. <br>\r\n\"Wow, Fox! You got a great ass! Really big and plump! I bet it's gonna taste great!\" Slippy had crouched down to slowly work him out of his lower clothes, and had paused to admire the foxbutt inches from his face. He even gave it a friendly pat before pulling Fox's pants, shoes, underwear and socks completely off of him, thanks to Falco lifting him up long enough for Slippy to get it all off vulpine's legs. Then he started to shamelessly grope Fox's ass, though whether this was because he found those cheeks arousing or because he was trying to decide the quality of the meat was impossible to guess. <br>\r\n\"Don't worry, Fox...\" Falco whispered in his ear, as the team's former leader began to pant with fear. \"...We promise to savor every bite of you.\" Smiling darkly, he finished stripping Fox, and tossed his jacket and shirt away. Fox recovered from his shock enough to blush and try to cover himself, looking from each one of them fearfully. <br>\r\n\"Ah ah ah, Fox...\" Falco gently but firmly pulled Fox's hands away from covering his crotch and moved the trembling vulpine's hands behind his back. \"Food needn't be modest. Let us devour you with our eyes before we really get to feast...\" <br>\r\nWhy did they have to act like this? Wasn't it bad enough they were going to eat him? All of them standing so close, touching him and complimenting him... He was starting to feel aroused in spite of himself. </span></div></div>",
            "created":1313125200,
            "id":1167171,
            "title":"Emergency Rations (Cooking, hard vore) "
        },
        "1521":{
            "author_id":"readasaur",
            "author_name":"Readasaur",
            "choices":[
                "He's cooked, but survives. ",
                "He doesn't survive the cooking.",
                "They take pity and spare him. "
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nPeppy took Fox's hands and carefully bound them in a soft rope, that would hold him securely without hurting him. Fox tugged uselessly at it and whined pitifully, flattening his ears and looking at the faces of his friends, pleading for mercy. But they just smiled and gave him no more consideration than they would any prime cut of meat. <br>\r\nHe tried to free his wrists again, but it was no use. The rope wasn't painful, but it was tight, and there was no where to run. <br>\r\nThe sense of increased helplessness, plus their unwavering attention finally had him start to get hard, closing his eyes and trying not to think about the despair and humiliation he was feeling. A soft hand was lightly grasping his erection, but he couldn't guess whether it was Falco or Peppy, and he was afraid to open his eyes and find out. Slippy hadn't stopped groping him, and all the stimulation was more than enough to get him start dripping pre. Someone stepped away, and there was a lot of clanging and banging behind him, and the sound of equipment being turned on. His former crewmates and future predators were tugging him back towards the noise, and they were soon rejoined by whoever had left. When he finally dared look, his felt his heart fall to his feet. It was an oven, a huge oven that looked more than capable of handling a meal his size. His voice stolen by fear, he whined again, more pathetic this time, and looked at each of his friends, searching for any sign that they might relent. Instead, they just carefully forced him onto the platter that had been prepared, and got him into position, pushing his hands down to his butt and pulling his feet up to tie them with his hands, leaving him completely immobile on the silver plate. <br>\r\nHe was close to hyperventilating when Peppy suddenly spoke up. \"Wait! Stop, don't put him in!\" <br>\r\nRelief like he'd never imagined washed over Starfox, who looked up with immeasurable gratitude at his oldest friend, his mentor, and began to thank him profusely for saving him at the last-<br>\r\nAnd then Peppy stuffed an apple into his mouth, silencing him. \"I knew we'd probably have to resort to this, so I was saving that.\" <br>\r\nThis was just too much for Fox, who gave into despair and resigned himself to being food. At least soon his torment would be over. <br>\r\nBut not too soon, it seemed. Peppy had searched the rest of the kitchen, and found some sort of basting oil, which would not only help him be cooked all the way through, but it would make sure his fur burned right off, negating the need to shave him before or after. He hadn't really paid attention to what they were doing or saying, save to notice they spoke of him as just another meal, with no trace of remorse about what they were about to do. So it came as a surprise when he felt the warm liquid being poured on him, as six hands started to rub it into his fur. He began to whine as much as he could around the apple, though it was barely audible. He was forced to endure their tortorously pleasurable hands as they kneaded and rubbed him all over, paying special attention to his more sensitive areas, like his stomach, his large rear end, and even his still hard cock. One of them scratched him fondly under the chin, and another behind his ears. One of them gave his butt a sharp spank, and someone else tweaked his nipples. At last, they drew back, lifting up the platter and carrying it towards the oven, which opened as they approached. Fox gasped at the blast of heat, which only grew more intense as they got closer. He heard and felt the tray being set into the grooves, and gave one last muffled cry as he was inserted into the heart of the fiery oven. </span></div></div>",
            "created":1313125200,
            "id":1167172,
            "title":"Continue"
        },
        "153":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "The Feast of the Fox",
                "Writer's Choice",
                "Writer's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is your choice?</span></div></span></div>",
            "created":1313816400,
            "id":1171939,
            "title":"Chooooose"
        },
        "1531":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Fox hits the craft",
                "A ship shoots Fox down!",
                "StarWolf Arrive!"
            ],
            "content":"<div class=\"\"><div> <span>The space above Corneria, so peaceful with the stars glistening on the otherwise black sky, a blue glow coming from the fourth planet of the Lylat system as it floated in its orbit, was suddenly filled with the chaos of an intense battle, lasers coasting left and right as spacecraft fired onto one another. Corneria’s orbit around the Lylat star had brought the capital of the Free Lylat Alliance close to Sector X, a notorious nebula that had become a graveyard of debris from ships and a secret research base of the former emperor of Venom, Andross. This debris field made it a perfect spot for bandits and criminals to hide, and often they will raid lone commerce ships foolish enough to approach the Sector unguarded.<br>\r\n\tWhile Corneria itself was heavily fortified from space with the Beltino Space Gate and Pepper Class ‘A’ Battleship – the Hound Dog guarding all approaches to the planet, bandits still remained a problem as they would ambush civilian and small cargo ships, then disappear into the debris when chased. If they scored a hit, they would return after the chase had given up and collect their bounty. The StarFox team had been called to escort a military transport to the Beltino Gate, but happened upon such an attack on a civilian convoy heading to the Hound Dog and with the help of the Cornerian Space Defense team, engaged in heavy fighting. Fox’s Arwing bucked as he raised a wing to let a laser pass under, then returned fire onto the craft that shot at him. The ship dived down under his Arwing to avoid the fire and made way for Slippy’s Arwing. “Slippy, on your left flank!” Fox quickly called out, turning his ship over and preparing to dive down on the elusive craft.<br>\r\n\tSlippy looked to his left and saw the ship heading for him and turned to make a head-on pass. The ship fired onto the green toad, but missed when Fox hit his stabilizer. Slippy opened fire and struck the ship right in the cockpit, instantly killing the pilot. The ship began to drift, and Fox gave a little smirk, knowing he was just as responsible for the kill as Slippy was, as he had disabled the shield with his hit to the stabilizing systems. “Thanks Fox, I got him!” Slippy reported, dipping his wings up and down in celebration.<br>\r\n\tFox chuckled and nodded, then banked right to deal with a bandit firing onto a civilian jet. Before he could even press the trigger on his joystick, the bandit exploded in a large fireball, and Falco recklessly swooped low over Fox’s Arwing. “Sorry Foxy, but I can’t let you take ‘em all!” Falco radioed with his grin spreading across his beak.<br>\r\n\tFox shook his head and rubbed a paw over his chest, feeling his heart beating fast from that close shave. He could swear his cockpit heated up from coming so close to Falco’s G-Diffuser engine. “That’s fine, Falco, just don’t crash into me, ok?” Fox asked, obviously a little shook up.<br>\r\n\tFalco merely grinned and gave a smug look by closing his eyes. “What, me? Crash? Into you? Who do you think I am, Slippy?” Falco replied, provoking a ‘hey!’ from Slippy over the communicator.<br>\r\n\t“That’s enough fooling around guys, focus on the mission!” Peppy called out, guiding one of the ships to the Hound Dog.<br>\r\n\tFox flicked on his All-Talk setting and gave a serious look. “Peppy’s right guys, let’s make sure these nice folk get to the Hound Dog in one piece, ok?” Fox ordered, flicking off his comms and turning into a bandit, firing into the ship.<br>\r\n</span></div></div>",
            "created":1313816400,
            "id":1171941,
            "title":"The Space Battle"
        },
        "15311":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "They ambush Fox!",
                "Fox tries to ambush them!"
            ],
            "content":"<div class=\"\"><div> <span>The bandit shook and rolled, trying to deflect the fire, but turned at the wrong moment and lost a wing as the laser sliced through the thin metal wing of his inferior ship. The ship fell into an uncontrollable spiral and drifted towards the planet before striking a large piece of debris, exploding into a massive fireball. Falco took down another ship and Peppy guided the last civilian through the debris and into the large battleship, its anti-aircraft weapons knocking the last bandit ship from the space surrounding it. “That’s it! All bandits are down, civilians are safe, and military ship has docked! Mission complete!” Peppy reported.<br>\r\n\t<br>\r\n<br>\r\nFox ordered everyone to form up and returned to Corneria, giving a show for the crowd in the busy streets, looking up from their daily lives to see the famous StarFox Arwings performing manoeuvres around tall buildings as they returned to the Great Fox docked in the military port aptly named the James Memorial Dockyard in memory of Fox’s father, James McCloud. Once docked, everyone congratulated each other and followed Fox down the long corridor leading deeper into the ship. From behind Fox, they began to grin at each other and started removing articles of their clothing, Falco stepping up to Fox, almost completely nude, save for his white jacket. “Hey Fox…I think we should have a nice big meal to celebrate that mission, what do you think?” He asked, placing his feathered hand on Fox’s shoulder.<br>\r\n\t<br>\r\n<br>\r\nFox glanced behind him and saw his team had suddenly lost their clothes, and that Falco was grinning at him. He suddenly imagined them all, laid out on all fours on a large dining room table, all with apples in their mouths, thinking they were all going to offer themselves to their great leader as a grand feast. He licked his lips and grinned, nodding his head. “Good idea! Let’s get started on that!” Fox chuckled, staring at Falco, deciding he would save Falco for last, as he was certainly the most delicious of the three.<br>\r\n</span></div></div>",
            "created":1313816400,
            "id":1171942,
            "title":"Fox hits the craft"
        },
        "153111":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "A roasting spit is waiting",
                "A roasting pan is waiting"
            ],
            "content":"<div class=\"\"><div> <span>Falco grinned and Peppy licked his lips, looking at Fox’s green rump swaying in his pants. Slippy reached out and grabbed Fox’s belt, glaring at the vulpine with a hard look in his eyes. “Good! We’re glad you agree Fox, right guys?” Falco said, looking back and nodding.<br>\r\n\t<br>\r\n<br>\r\nBefore Fox even had a chance to react, the three quickly surrounded him, grabbing at his clothes. Fox yelped and felt Slippy pull his belt free and Peppy grabbed his rump, pulling his pants down over his ankles. Falco gripped Fox’s vest and yanked it off, raising Fox’s arms while Slippy pulled Fox’s shirt over his head, revealing Fox’s white belly and chest. Falco grasped Fox’s hips and rubbed over his back, pressing his body against Fox while Peppy, with Slippy’s help, raised Fox’s legs one at a time and removed his pants and boots. Fox blushed, not realizing what was really going on, thinking the three were going to worship his body before becoming part of it, Falco licking at his chin while groping his chest, Peppy had been rubbing his tight rump, and Slippy coiled his long tongue around Fox’s leg, slowly rubbing up and down his thighs. “So guys…what do you think?” Falco asked the three molesting Fox.<br>\r\n\t<br>\r\n<br>\r\nPeppy chuckled and spanked Fox’s rump. “Mmm…his rump is perfectly plump and tight, very meaty…just like his father’s…it’ll need some tenderizing, though.” Peppy reported, causing Fox’s jaw to drop as he began to realize they weren’t feeding themselves to him…they were going to eat him!<br>\r\n\t<br>\r\n<br>\r\nFalco sensed Fox was going to cry out and tied Fox’s muzzle shut with his own red scarf. Slippy grinned and nibbled Fox’s ankle. “His legs are so juicy! They’ll make excellent drumsticks! And his feet! It’ll be such a shame to put those little booties on them! We’re eating good tonight!” Slippy smiled, glancing up at the rump Peppy had taken such a liking to.<br>\r\n\t<br>\r\n<br>\r\nFalco looked into Fox’s eyes, seeing them water. He patted Fox on the head and rubbed over Fox’s front. “Well…he’s not as sexy as I am, but he’s going to make a lovely meal. Lots of meat on these bones, and let me tell you, from the amount of tongue baths I had to give this guy, we’re not shaving him like we did with Krystal. The fur’s the best part!” Falco reported, patting Fox’s cheek and kissing his lips.<br>\r\n\t<br>\r\n<br>\r\nFox’s eyes widened as he suddenly heard the truth about Krystal’s sudden disappearance. She hadn’t left the team after Fox wanted her out of danger, or because she found out that he was gay like he had begun to suspect, his team had eaten her, and now they were going to eat him. His former boyfriend looked him right in the eye and winked. “Don’t worry so much, Foxy. It won’t hurt you, we’ll be careful with your tender meat.” Falco teased.<br>\r\n\t<br>\r\n<br>\r\nFox struggled between the three, but Peppy had grabbed some rope from the wall and tied it around Fox’s wrists, the team then lead him upstairs to the large kitchen. </span></div></div>",
            "created":1313816400,
            "id":1171943,
            "title":"Not What He Had In Mind"
        },
        "1531112":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "They gang rape Fox/Rape Fox one at a time",
                "They spank Fox's rump"
            ],
            "content":"<div class=\"\"><div> <span>Fox’s eyes watered more when he saw a roasting pan already laid out for him. His sadness was overcome with anger when he remembered that he had left that out overnight, planning to cook the team in the morning, but the sudden call for a mission made him forget all about his plans. He realized they must have discovered what he was up to and were going to cook him before he could roast them. He was incorrect in this thought. “Get him on the pan, let’s go.” Falco ordered and all three picked Fox up and set him down in the black metal pan.<br>\r\n\t<br>\r\n<br>\r\nHis legs were bent up to his chest and his ankles tied together, Fox now sitting down on the large pan. He looked up and saw Peppy grab a book from the shelf Fox had thought was just for show, as none of the books on it seemed to be real. He saw the title and felt his heart sink. It was called ‘How to Cook Foxes’. Fox suddenly realized the truth. This wasn’t something they planned after discovering the roasting pan, they had been planning to cook Fox for a very long time, and they were just waiting until the right moment to get him in the oven. Falco untied the scarf around his mouth, but before he could speak, Slippy had wedged an apple into his mouth, barely even leaving any room for Fox to breath. Peppy flipped through the book and found the recipe he was looking for. “Ok…step one, baste and spice your fox until covered.” He read aloud.<br>\r\n\t<br>\r\n<br>\r\nFox glared at his team as Falco and Slippy grabbed salt shakers and began to sprinkle them over their leader, while Peppy, his mentor and father figure, squirted water over his head with a turkey baster, his nose still stuck in the cookbook. The hare continued squirting Fox until his entire body was soaked with the water and it began to pool under his body. Fox watched Slippy constantly sprinkle salt on his feet and then lick it all up, causing Falco to hit him after the fifth time, Slippy grumbling as he coated Fox’s feet, then moved up to his legs. Fox whimpered and looked up at Falco, who was dashing salt on Fox’s muzzle, moving along until the shaker was between his ears. With Fox spiced up and basted, Peppy continued to read. “Step two: Tenderize the meat.”<br>\r\n</span></div></div>",
            "created":1313871660,
            "id":1171944,
            "title":"Onto the Pan"
        },
        "15311121":{
            "author_id":"readasaur",
            "author_name":"Readasaur",
            "choices":[
                "Falco.",
                "Peppy. "
            ],
            "content":"<div class=\"\"><div> <span>Fox can't help but curl his tail protectively around himself, his ears drooping as he takes in the overly-happy expressions of his former crew. <br>\r\nAll of them are looking at his rump with far too much interest, and he can't help but whimper and curl his tail around it tighter. <br>\r\n\"You are a fine specimen of a fox, Fox...\" Peppy said, reaching over and patting his left buttock. \"But aside from the meat back here, you are a bit scrawny, so we'll just focus on tenderizing this...\" He gave it a sharp spank to emphasize his point.<br>\r\nHis heart fell at that. 'Meat', the ass he'd been so proud of and showed off was reduced to being called mere 'meat', and would be treated as such. He rolled his eyes back to try and catch Falco's gaze. Surely the falcon who had pounded him so hard so many times for so many nights would not let them turn the ass he enjoyed humping so much to just a meal? But Falco was licking his beak with the other two, still eying Fox as a feast, not a friend. <br>\r\nAlmost as though he had read his mind, Slippy sneered down at him. The other two took no notice as he started talking to him, too busy discussing which vegetables would go best with Fox. Falco wanted carrots, but Peppy insisted on potatoes.<br>\r\n\"That's right, you know that this is your best part, right? Always wearing tight pants and strutting around to show it off. But you never gave me a chance to worship this ass like I could have, cause I was just a kid, and not handsome like Falco. Well, you had your chance, and it's too late now, so I guess I'll just eat it instead.\" He smirked, and lowered himself down behind Fox, nuzzling his big butt and flicking his tongue out to leisurely lick his canyon. <br>\r\nWait, Slippy was mad at him? Fox supposed that he could have been a little nicer about Slippy's crush on him, but who could pay attention to an unattractive frog when beautiful Falco was practically throwing himself at him? Then, with one swift thrust of his tongue, Slippy made Fox aware of how much he'd been missing out. <br>\r\nFox's eyes grew very wide, and he struggled and whimpered in shock. That tongue! That tongue, plunging into his tight ass like it was nothing, wiggling and diving deeper and deeper, whirling and writhing. He was shocked, unable to believe that Slippy could make him feel so good, so fast, so easily! Shit, he REALLY should have given the frog a chance! He tried to speak around the apple in his mouth to no avail. He should at least try to apologize, maybe then Slippy would have pity on him and let him escape. <br>\r\nThat didn't seem likely, though, because the frog had grasped his hips tightly and was clearly relishing the way Fox's ass tasted, driving his tongue deeper, then pulling it out, then driving it in again, twirling it like a lasso, and he really, really enjoyed watching Fox shudder and twitch, going out of his mind with the pleasure that Slippy was lavishing on him. <br>\r\nFox was painfully erect by now, and dripping into the saucepan, mingling with the salty water that was already there from the spraying and salting. He started to lose track of time as Slippy continued to tongue-fuck him, whimpering when the frog would intentionally stop whenever Fox got too close to orgasm, drawing out this sweet torture. After what seemed like an eternity, someone cleared their throat. Both frog and fox opened their eyes to see Falco and Peppy looking impatient. <br>\r\n\"I'm sure he's slick enough by now, Slippy.\" Peppy said pointedly, and the the frog reluctantly withdrew his tongue completely and stood up. Fox couldn't help but weakly wiggle his hips and clench in protest of losing that incredible tongue, but he couldn't stop it from leaving anymore than he could escape his fate as food. <br>\r\nPeppy shook his head, but he smiled indulgently. <br>\r\n\"I know you're excited about this, but we need to cook him before we all starve. And if you make us wait too long, you're going right in the oven with him.\" He told Slippy sternly, and the frog gulped nervously. They would, too. It wasn't just foxes who went in that oven. Squirrels, monkeys, frogs, rabbits, cats... Many had been prepped and cooked to feed the ravenous crew of the Star Fox. As much as he feared being eaten, Slippy couldn't deny that a small part of him felt tingly at the thought of being stripped naked, tied up, and sensually prepared for the oven. Fox would never know how close he'd come to almost getting his crew to willingly become his feast. <br>\r\nWith the taste and memory of Fox's ass in his mouth, and the thoughts of cooking in his head, Slippy was more than ready to begin 'tenderizing' their former leader. <br>\r\nHe had to hop up on the table, being too short to reach Fox otherwise, and crawled over him to brace himself over their future meal. <br>\r\n\"Ready, Fox?\" He teased, then without anymore hesitation, thrust his hips forward and entered that loosened and slick hole. His eyes rolled up in his head when he managed to force himself inside. <br>\r\nHow could such a slutty fox be so <i>tight</i>? Fox McCloud's ass was everything he'd dreamed it would be and more, and he whimpered as he began to slowly thrust. He would never admit it, but before this very moment, he'd been a virgin. He had to go slowly or he'd risk cumming early, and he would be humiliated if he did that. Besides, this was what he'd spent many lonely nights dreaming about, losing his virginity by pounding his leader's big, shapely butt. Beads of sweat were starting to appear all over him, as he grunted and thrust, making him shine and gleam in the kitchen lights. <br>\r\nPeppy and Falco couldn't help but scope him out as he rutted Fox. His legs were long and muscular, as most frogs' legs are, and his ass was tight and bouncy as it sprang forward and back to fuck Fox, and the shine of his perspiration just made him all the more appealing. They weren't kidding about being willing to eat him, because everyone was fair game when you cooked other people for food. Both of them had dreamed of eating his delicious looking legs, just as they knew they both thought about eating each other. It made it all the more exciting, trying to eat and avoid being eaten. <br>\r\nBut Slippy was already nearing his limit, though he'd finally hit a rhythm that kept him from embarrassing himself. He would slam his hips forward to bang them against Fox's buttocks, inserting himself deep before pulling back out, pausing for a moment, then repeating the process. It was making Fox moan, and those moans were making it hard to hold back. He grunted again, trying to focus, his sweat dripping down and adding to the salt and water that was already in Fox's fur, as he finally gave up and sped up his tempo, finally cumming deep inside his first crush with a loud cry, and panted on top of him. Weakly, he withdrew and sat down on the floor, his tongue flicking out to idly start cleaning himself off. <br>\r\nPeppy chuckled at the impulsiveness of youth, and glanced at Falco. <br>\r\n\"So? Which of us is next?\" </span></div></div>",
            "created":1324182000,
            "id":1241683,
            "title":"Fun kind of tenderizing!"
        },
        "153111212":{
            "author_id":"readasaur",
            "author_name":"Readasaur",
            "choices":[
                "Stuffing the meat with bredding and vegtables",
                "Basting the fox. "
            ],
            "content":"<div class=\"\"><div> <span>Falco waved him off casually.<br>\r\n\"You go, I've had him plenty of times, and I know you've been looking forward to this.\"<br>\r\nPeppy smiled and walked behind Fox. <br>\r\nFox couldn't believe his ears, and looked back at Peppy in shock.<br>\r\nNo way, no way was Peppy going to do this!<br>\r\nHe could wrap his head around the idea that his mentor was going to eat him, horrible as it was, but surely his trusted father-figure was not going to have sex with him?<br>\r\nAs an answer, Peppy grabbed the cooking dish Fox was lying in and pulled it to the edge of the table, grasping Fox by his tail and lifting him up to inspect his rear critically. <br>\r\n\"Ah yes, just like your father...\" He said proudly, setting Fox back down and patted his rump. \"I know you're sick of hearing that, Fox, but it's true! He had a butt like yours, too, but he was more modest in showing it off. Sure, when he was on the Great Fox he'd wear those sinful little shorts and tempt any of the crew into dragging him into the nearest room...\" Peppy sighed happily, lost in his memories, even as he dragged the bound fox off of the cooking dish and position him so that Peppy would have no trouble entering him. The hare was not about to go climbing on top of a table, after all. Fox whined helplessly, but he was already too exhausted to put up more than a weak struggle. Even as he prepared to rut the fox who had been like a son to him, Peppy continued to speak gently. <br>\r\n\"I missed that butt almost more than I missed the rest of him, but you've certainly filled out in that regard, haven't you?\" He gave Fox a light smack that made him yelp through the apple. \"I really was glad you were such a naughty boy, that way I got to spank you quite a lot, and be reminded of your father.\" He smiled kindly, and then firmly drove himself inside the big red ass that was presented to him. He sucked in a deep breath, and let it out slowly, stroking Fox's back. <br>\r\n\"Just like your father...\" Fox twisted and struggled weakly, trying to escape, or resist somehow, but it was hopeless. And he hated to admit it, but Peppy knew what he was doing. He was thicker than Falco, and bigger than Slippy, and he knew just the right angle to make Fox whimper and start pouring pre again.<br>\r\n\"He wasn't quite so shameless about showing off, like I said. I know I should have discouraged you from strutting around in those tight, tight pants of yours, but honestly it did me good to see a McCloud showing off again. And yes, Falco's right, I've been waiting for this for a long time. I was going to simply wait until you were old enough, but then you started seeing Falco, and I'd missed my chance.\" He sighed sadly, and then thrust especially deep to make Fox's eyes go wide and a spurt of pre come shooting of his already abused cock. <br>\r\nJust like Peppy and the falcon had checked out Slippy, now the frog and Falco were eying the hare. If anything, his butt was even bigger than Fox's own beautiful behind, and he certainly had thick, strong legs, not to mention an ample amount of fat to keep a predator sated for a while. Both of them practically drooled as they watched his hips thrust back and forth, looking almost effortless on his part as he made the slutty food-fox howl through his apple. Peppy grinned to himself as he felt their hungry eyes on him, intentionally leaning forward to give them a better look and showing off. As a prey species, it gave him a tingling thrill to be so appreciated by hungry preds, and he even tauntingly wiggled his ass at them before going back to pounding Fox. <br>\r\nBy now, his ass was almost properly tenderized, and Peppy felt it was only fair to give Falco a turn before they gobbled up this delicious fox. <br>\r\nSo he began to speed up and picked Fox up to raise and drop him even as his hips increased their tempo. <br>\r\n\"This is it, Fox.\" He whispered in the whimpering vulpine's ear. \"I'm going to miss you a whole lot, but you're just too delicious to resist.\" With that, he firmly kissed his former charge and came hard, growling as he forced a healthy amount of fresh rabbit cream up the ass that had wiggled so temptingly for so many years out of reach, pumping his helpless lover slowly several times before kissing him again and laying him back down in the cooking pot. <br>\r\nFalco smiled, knowing it was his turn at last. He gave Peppy a big, congratulatory slap on the ass as they passed each other, which got a pleased chuckle from the hare, who soon stood next to the still seated Slippy, and the frog began looking at the dripping lapine cock with interest. <br>\r\nThe falcon climbed on top of the table and lowered himself so that he was almost laying on top of Fox, keeping him covered on all sides. The one-time leader of the Star Fox team was reduced to whimpering and cringing, begging Falco with his eyes for mercy. The bird of prey just smirked. <br>\r\n\"Sorry, Fox, but you had to know this was coming. Didn't I always tell you how delicious you looked? And now we'll all get to find out if you're as fun to eat as you are to fuck!\" At the last word, he pulled the fox's cheeks apart with his hands and thrust inside, hilting himself on the first jab, grinning as the familiar tightness of that McCloud ass gripped his cock tightly. <br>\r\n\"Ah...! I'm gonna miss this, Fox!\" He confesses, grinning as he begins their familiar rutting. <br>\r\nMuch as Fox was loathe to admit it, when they accused him of being slutty, they weren't really wrong. If he wasn't aware that he was going to be cooked and eaten, he would be really enjoying the hardcore attention of his crew, and dimly wished that he had instigated something like this before now, when he was doomed to the oven soon. He whined needfully and weakly wiggled his hips to tell Falco he needed more. The raptor laughed and sped up, knowing all the places and ways that Fox liked it, shameless bottom that he was. It was already wet and sloshy inside of him, but it was no different than the other times they had fucked several times in a row. Falco glanced behind him and was pleased to see that Slippy had his long tongue wrapped around Peppy's cock, and was cleaning the hare off. Of course, he'd soon be sucking him off, and that just improved Falco's mood. When he caught their eye, he lifted his tail-feathers and playfully mooned them both. Naturally, he himself was in danger of being turned into a fried bird, stuffed and cooked to a golden brown and devoured. His strong wings and shapely legs were mouth-watering, after all. His crazed stalker, Leon, wasn't hunting him across the galaxy for nothing, after all. Falco had many times pleasured himself to the messages he received from the mad chameleon, lovingly describing how he was going to fuck, prepare and cook Falco himself when he finally caught him. Of course Falco planned on turning the (dinner) tables on his 'admirer', but it was thrilling to think about. A pity Fox couldn't seem to get into the spirit of it, but he was a bit arrogant. He probably never thought he'd wind up as the meal. <br>\r\nFalco chuckled and gave that fine fox-butt a slap, knowing that his friend was getting closer and closer to climax, and always stopping just before Fox could reach it. They had agreed that they wouldn't let Fox cum, as full balls always tasted better. He reached down and gave Fox's cock a taunting squeeze before slowing down again. Now he was on his knees on the table, his arms folded behind his head in a show of sexual prowess as he screwed that fine McCloud ass with practiced perfection. He tilted his head back and closed his eyes, wanting to savor this as long as possible before he finally came. <br>\r\nFrom the sounds behind him, he guessed that Slippy had gotten Peppy erect again, and was helping him with it. He could feel their eyes on him, and couldn't resist showing off, swaying his hips from side to side and then in circles to make Fox scream into his apple. <br>\r\nBut all good things must end, and soon he was nearing his. <br>\r\n\"Well Fox, this is it...\" He grunted, pounding slowly and steadily now. \"I want to thank you for helping me in the skies and all those many, many nights, but now its time for you to do me the biggest favor yet. Nice knowin' ya, Fox!\" And with that, he came hard for the final time in Fox's tight ass, and sighed happily before climbing down. <br>\r\nFox had a temporary reprieve to recover then, panting hard through his nose as he felt the sloshing mixture of his three friend's seed inside of him, and heard Falco firmly order Slippy to clean him off as well. He weakly looked over his shoulder to see Slippy on his kneels, with his tongue wrapped around both Falco and Peppy's cocks, slathering and licking, and Fox groaned, knowing that he was soon to be in for more voraphile torment the instant they were done.<br>\r\nBut what came next...?</span></div></div>",
            "created":1324188600,
            "id":1241726,
            "title":"Peppy. "
        },
        "15311122":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Slippy goes first",
                "Nah, let's just cook him"
            ],
            "content":"<div class=\"\"><div> <span>The three bent Fox over until he was on his arms and knees, then lifted up his tail. Each grabbed a spatula and began to spank his rump hard with them, leaving red marks appearing under the fur. Falco had hit him the hardest, right on the cheek he loved to grip so much when making love to the vulpine. Fox began to wonder if Falco really loved him, or if he was just preparing Fox to be turned into a meal in the future. Once the bird had finished, he gave Fox a little kiss on the cheek, as if he had known his thoughts. “As much as I love ya, Foxy…you’re just too tasty. I’ll be getting the most of you. Peppy, what’s next?” He said to Fox before looking up to Peppy.<br>\r\n\t<br>\r\nPeppy grinned and simply said ‘stuff him’. Falco grinned and Peppy walked away. Slippy and Falco went behind Fox and the vulpine could feel Slippy grab his cheeks while Falco started to lick and rub at the tailhole the bird had become so accustomed to filling. Fox couldn’t help but blush, but then felt horrified when Slippy pulled on his cheeks, opening up Fox’s rear. Expecting Falco’s hardened cock, his eyes are bulging when Peppy started to push carrots and bananas into his rump. He was afraid to take a guess as to how many, but he knew they were stretching him open so uncomfortably wide. Peppy stuffed in as much as he could, then patted Fox’s rump. “Just like his father…” he repeated.<br>\r\n\t<br>\r\nWith their treat prepared for the oven, they glanced over each other and then to Fox. “Guys, he’s not like Krystal…we’ve known and grown up with Fox. I think we should say some final words to him before we cook him.” Slippy suggested.<br>\r\n</span></div></div>",
            "created":1313871720,
            "id":1171946,
            "title":"Tenderize the meat"
        },
        "153111221":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Falco comes in, and they cook Fox",
                "Falco comes in, and he helps Fox!"
            ],
            "content":"<div class=\"\"><div> <span>Falco and Peppy left the room in agreement, Slippy sitting down in front of Fox on a stool. “Hey Fox…I know this must be scary for you, but you must have known. I mean, Krystal disappeared and we were all a little fatter for a while, and all those stories of disappearing foxes whenever we dock here. We didn’t want to do this to you, but you’re just too tasty for your own good. You were my best friend, and now I hope you’ll be my best meal, you are the most delicious looking fox I ever ate, and I’m glad Peppy referred us to you.” Slippy said, patting the confused Fox on the head as he left.<br>\r\n\t<br>\r\n<br>\r\nPeppy entered next and sat down on the stool Slippy had been sitting. “Fox, now that we’re going to eat you, I must confess…I know exactly how your father died…Andross was going to kill us both, and I escaped by making a deal…I offered to cook James for my freedom. Andross and I sat down together and devoured your father, and he was so delicious. I spent years wanting to eat you too, but you were much too young. And now that your meat has matured, it’s time for you to join him. Falco and Slippy, they’re fox-eaters too. They’ve wanted to devour you for years too; in fact I’ve had to stop Slippy every time you shower. And now that you know, well…I hope you understand now why we’re eating you.” Peppy said, giving Fox’s nose a lick.<br>\r\n\t<br>\r\n<br>\r\nFox whimpered and started to cry, hoping Peppy would take pity on him. “Heh…James looked just like that before I cooked him. You’re tastier than him, though.” And with that, Peppy left.<br>\r\n</span></div></div>",
            "created":1313871840,
            "id":1171947,
            "title":"Final words"
        },
        "1531112212":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Fox is...outfoxed, back in the oven with you!",
                "They let him go"
            ],
            "content":"<div class=\"\"><div> <span>Falco came in last and didn’t sit down. Instead, he climbed up onto the table and lay across Fox, licking the back of his ears. “I really don’t want to do this to you, buddy. But…you just taste too good. It really hurts me to do this to you, but I have no choice. It’s either you or me, buddy. And I want to help you, I think I got ‘em fooled with my enthusiasm, but if you escape now, they’ll know I had a hand in it. That’s why I want you to start struggling hard and take me hostage when you get up.” Falco said, loosening the ropes around Fox’s wrist.<br>\r\n\t<br>\r\n<br>\r\nFox’s eyes lightened up in delight when he heard Falco saying he was going to help him and he would have kissed the bird if he could. “I love you Foxy, I’m not about to let these freaks devour you.” He then got up and sat on the stool.<br>\r\n\t<br>\r\n<br>\r\nThe others came in at his call and surrounded Fox, all licking their lips at him. Fox whimpered and started to struggle hard, especially when they lifted the tray and started to carry Fox to the oven. Falco purposefully pretended he was losing his grip due to Fox’s struggles, secretly removing the bananas and carrots from Fox’s rump while they weren’t looking, and dropped the vulpine on top of him. Fox broke free from his rope and quickly untied the ropes around his legs, grabbing a knife from the table and holding it to Falco’s neck as he lifted him up in front of him. He spit the apple towards Slippy and growled. “None of you take one step, or I’m gonna paint the walls by opening this can here!” he threatened pressing the blade to Falco’s neck.<br>\r\n</span></div></div>",
            "created":1313871900,
            "id":1171949,
            "title":"To the Rescue"
        },
        "15311122122":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Falco swallows Fox",
                "Falco takes him home"
            ],
            "content":"<div class=\"\"><div> <span>They backed off and Fox quickly took Falco out of the kitchen. He smiled to the bird and kissed him on the cheek, both turning and running down the hall for the Arwings. Falco took the pilot’s seat of Fox’s Arwing and Fox climbed in on his lap. He turned to see the two chasing down the hallway with their blasters out and Falco took off just as they opened fire.<br>\r\n\t<br>\r\n<br>\r\nFox rested his head on Falco’s chest and licked happily, nuzzling under the bird’s beak. “Thank you, Falco…I don’t know how to repay you.” Fox said, looking up at the bird.<br>\r\n\t<br>\r\n<br>\r\nFalco smiled and rubbed Fox’s side. “It’s no problem, Foxy…besides, if anyone’s gonna eat you, it’s gonna be me!” he grinned, biting Fox’s ear.<br>\r\n</span></div></div>",
            "created":1313871960,
            "id":1171951,
            "title":"We're letting him go?"
        },
        "153111221222":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "content":"<div class=\"\"><div> <span>Fox’s ears dropped down. “But I thought…”<br>\r\n\t<br>\r\nThe bird smirked and held onto Fox tightly, piloting through the Cornerian cityscape towards his private residence that not even Fox knew about. “Hehe…such a scaredy fox you are. I told you I’d never hurt you.” Falco replied, not really reassuring Fox he wasn’t going to be eaten. <br>\r\n<br>\r\nAs Falco landed at his home, he welcomed Fox and helped him out, bringing him inside the home, Fox himself unsure if he was going to be living here in secret with Falco, or if the bird had merely brought him here to eat him all to himself. Either way, neither Fox nor Falco was ever seen again…<br>\r\n</span></div></div>",
            "created":1313872020,
            "id":1171954,
            "title":"Going home"
        },
        "1532":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "The Hot-Rodders Meal",
                "Writer's Choice",
                "Writer's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Take your pick!</span></div></span></div>",
            "created":1315701420,
            "id":1184916,
            "title":"Even more stories!"
        },
        "15322":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Where am I?",
                "Writer's choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here we go, another story!</span></div></span></div>",
            "created":1340062020,
            "id":1362467,
            "title":"More stories"
        },
        "153221":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "A blinding light fills his eyes",
                "Red lights begin to light up the area"
            ],
            "content":"<div class=\"\"><div> <span>The darkness seemed eternal, he couldn't be sure if his eyes were even open. The last thing Fox could remember was fighting Lucario on the Smash Battleground, then he took a hit from an attack. A tomato landed near by and he began to crawl towards it, then THWACK, he was out like a light. Fox figured Lucario must have hit him with something and knocked him out cold. Fox began to panic, hoping the hit hadn't blinded him, but something seemed even more off. Opening and closing his eyes wielded nothing but darkness, but he could feel ropes around his wrists and ankles, and he was on his knees on something hard, padded with something smooth and cold. Something was in his mouth, gagging him, and whatever it was, it was tied around his muzzle and chin to keep it inside his jaws.<br>\r\n<br>\r\nFox's senses started to come back, the first was his sense of smell. Wherever he was had to be small and confined, for all he could smell was himself, and a hint of some kind of plant. His hearing started to heighten, he could hear voices, muffled greatly by whatever he was inside of. He could hear the sounds of forks scraping against plates, dishes clattering, and some music. He wiggled lightly in his tight space and tried to call out, but the object in his mouth silenced his voice.<br>\r\n<br>\r\n<br>\r\nFox began to worry, did Lucario sell him out to StarWolf? Or some other group of his enemies? Was he in a prison cell? He couldn't tell. It wouldn't be long before he found out... </span></div></div>",
            "created":1340065380,
            "id":1362509,
            "title":"Where am I?"
        },
        "1532211":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "The entire Smash cast is having him for dinner!",
                "Lucario stares at him with hunger in his eyes...."
            ],
            "content":"<div class=\"\"><div> <span>Fox continued to squirm in place, his nose bumping against the side of whatever he was trapped in. He could hear tapping on the other side, someone had to know he was there now! He tried to call out, ask the person for help, but received no response. He grunted and tried to turn his head, hoping he could see something behind him, but all he could see was his shoulder, his arms were tied behind his back, was all he could tell.<br>\r\n<br>\r\nHis tail brushed against the top of his confines, whatever it was he was trapped in, it was small. Very small....almost too small! What could he possibly be inside of?<br>\r\n<br>\r\nHis answer came suddenly. He heard the sound of scraping metal, then the sudden light nearly blinded him. He closed his eyes instinctively for protection, shaking his head, slowly opening his eyes again.<br>\r\n<br>\r\nHis vision came back, and then his eyes went wide...</span></div></div>",
            "created":1340066220,
            "id":1362522,
            "title":"Not Good!"
        },
        "15322112":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Lucario hardvores Fox",
                "Lucario starts to swallow Fox whole"
            ],
            "content":"<div class=\"\"><div> <span>Fox's eyes met with Lucario's, the Pokemon staring into him with those burning eyes, staring at the vulpine in obvious hunger. The pokemon was sitting at a dinner table, and Fox was in the middle, laid out on a nice platter lined with lettuce. Lucario slurped his chops at Fox, a fork in one paw, a knife in the other. Fox's eyes moved down the Pokemon's body and stopping at the bib Lucario wore around his neck.<br>\r\n<br>\r\nIt sported a picture of Fox on a dinner plate, a fork in his leg, with a fork and knife drawn on either side. Lucario reached over and pulled the platter closer, leaning in to take a deep whiff of the vulpine. Fox whimpered and closed his eyes, hoping it was just a dream, that he'd wake up in the Smash Hospital, but when he opened his eyes, Lucario had his maw open and was pointing inside of it. \"That's right Fox...you're going in there...\" he telepathically told the trapped vulpine.<br>\r\n<br>\r\nFox wiggled, but the ropes were too tight, there was nothing he could do, at the complete mercy of a Pokemon that wanted him for dinner. McCloud watched the Lucario, hearing that stomach growling for its dinner, the pokemon patting his stomach, taunting Fox with it. \"Don't worry, you'll get your fill of fox meat soon!\" He grinned at Fox and licked his sharp teeth.<br>\r\n<br>\r\nBiting down softly on the apple, Fox whimpered, tail drooped depressingly over his side. Lucario patted Fox's head and licked along the bridge of his nose to the white stripe on his forehead. \"Mmmm....such a delicious little foxy you are. You'll be perfect for my belly!\" He taunted again, reaching for the salt and pepper shakers.<br>\r\n<br>\r\nFox closed an eye as Lucario sprinkled his head with salt, unable to watch as Lucario moved along his body, making sure he salted each and every part of his large Fox meal. When he was finished, he grabbed the pepper shaker and tapped Fox's nose. \"This might make you sneeze...I bet you have such a cute little sneeze. You look adorable on a platter, and you'll look even better in my stomach.\"<br>\r\n<br>\r\nFox's eyes closed completely when Lucario peppered him, and just like Lucario said, the vulpine began to sneeze cutely, until Lucario began to pepper the rest of his body, paying close attention to Fox's rump and thighs, drooling heavily at the sight of them, watching the shaker sprinkle the spices over those juicy legs and that thick rump. When he was done, finishing by peppering Fox's cute little toes, he took what was left of the salt and pepper and tossed it into Fox's tail, knowing the swishing of it would cause Fox to continue seasoning himself.<br>\r\n<br>\r\nNow that his meal was spiced up, Lucario picked up the fork and knife, licking his lips, and advanced on Fox...</span></div></div>",
            "created":1340067480,
            "id":1362532,
            "title":"Lucario's Dinner"
        },
        "153221122":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Fox's taste is making Lucario horny...",
                "Keep gulping!"
            ],
            "content":"<div class=\"\"><div> <span>Fox's eyes could only go wide as saucers as the Pokemon's jaws opened up and came straight for him. Frozen in fear, Fox stared into the oncoming jaws of pointed teeth, dripping heavily with saliva. His nose pressed against Lucario's tongue and his teeth brushed against the sides of Fox's head. The nose of the vulpine slipped perfectly into Lucario's mouth, the edges of Lucario's tongue bunching up on the sides of Fox's muzzle. His black nose pushed against the back of Lucario's throat. McCloud whimpered, staring into the pulsating gullet, even when Lucario started to lick at his face, tasting the deliciousness of Fox McCloud. As Lucario predicted, Fox's tail began to fling wildly in fear and distress, causing Fox to continue seasoning himself.<br>\r\n<br>\r\nLucario patted Fox's back, pleased with the fact that Fox was seasoning himself, digging a paw into Fox and dragging him forward. Fox heard Lucario take his first gulp, the wet sound filling Fox's ears before the mouth of the Pokemon forced his ears to flatten to the fox's head. Lucario's jaws stretched slightly, opening up to take in his meal, the tip of his tongue licking at Fox's neck. Fox whimpered as his head disappeared into Lucario, unhappy with the fact that he was just a meal now. The Pokemon rubbed at Fox's broad shoulders, feeling them up for when they would have to squeeze into his mouth. His defeated dinner tasted absolutely delicious, better than he could have hoped for. The tough fight earned him this meal, and he was sure the others would be jealous if watching him swallow down the delicious Fox.<br>\r\n<br>\r\nStretching his jaws wider, the Lucario winced as he heard two pops, dislocating his jaws like a snake. He could pass it off to the doctors at the hospital that he took a hard punch from Fox, but the trip would have to wait until he digested the vulpine, or otherwise spit him back up. He'd have to get Yoshi to help in that case, it'd just be easier to digest Fox. But that was to be worried about later, for now, Lucario had to swallow those delectable shoulders!<br>\r\n<br>\r\nLucario's maw slowly pushed over Fox's shoulders, Fox letting out a muffled scream as his head slipped into Lucario's gullet, the tail flailing even crazier, Fox began to wiggle and squirm harder. The Pokemon smacked Fox with the back of his paw, poking him hard with the spike, causing Fox to yelp. \"Stop squirming, save that for when you're in my stomach!\" he ordered, and when Fox refused to obey, Lucario poked him harder with the spike.<br>\r\n<br>\r\nFox settled down, being swallowed whole, at least for now, was a lot less painful than being stabbed by the Lucario's paw spike. He felt utterly hopeless, surrounded by the walls of flesh squeezing and tugging on him, pushing on him like toothpaste towards the Pokemon's stomach. The wet walls and saliva from Lucario's maw drenched his golden fur, matting it down with each lick of the tongue or gulp of his throat. Fox shivered, feeling that bumpy tongue licking at his chest, hearing the stomach beckoning for him, demanding that it be filled with Fox McCloud. He was dinner, dinner for a Pokemon, and there was nothing he could do about it. </span></div></div>",
            "created":1340070900,
            "id":1362555,
            "title":"Into the Pokemon"
        },
        "1532211222":{
            "author_id":"ft2k4",
            "author_name":"FT2k4",
            "choices":[
                "Lucario lets Fox go",
                "Fox is digested"
            ],
            "content":"<div class=\"\"><div> <span>Fox grunted, Lucario's swallows jerking him further into the tight gullet. Lucario closed his eyes, the aura of Fox filling his vision as he savored the flavor of his dinner, tongue dancing along Fox's body. The taste of the vulpine spread across Lucario's tongue, perfectly seasoned, tasting absolutely divine! The pokemon moaned in delight, gulping around Fox, dragging his little plump belly into Lucario's mouth. Lucario poked Fox's belly with his teeth, grinning at the fatness of the fox, licking his tongue along the surface. \"Getting chubby, Fox? What could be the cause of that? Too many sweets? Falco? All I know is that it's more meat for me!\" He teased, paws patting at Fox's plump, but firm rear end.<br>\r\n<br>\r\nThe vulpine struggled in Lucario's throat, the ropes holding him in a perfect position to fold into Lucario's body, nose poking at the entrance to Lucario's stomach. Outside the Pokemon, the shape of Fox formed in Lucario's neck and chest, slowly reaching Lucario's hungry belly. Lucario bit down on Fox in sadistic pleasure, causing Fox to writhe within the pokemon. Lucario chuckled and groped along Fox's rump, squeezing the cheeks, teasing the base of Fox's tail by squeezing it, and groping at his thick thighs. Lucario titled his head back and took a heavy gulp, dragging Fox's belly into his warm gullet.<br>\r\n<br>\r\nDrool pooled along Lucario's own thighs as it dripped from his lips and Fox's fur, Lucario brushing his paws through the golden coat. \"I hope my belly can digest all this, I'd hate to think of the furball you'd make. I doubt it'll be as easy to get up as it was easy to gulp you down!\" Lucario smirked, smacking Fox's tight rump.<br>\r\n<br>\r\nAlthough he was flustered with Lucario's teasing, he couldn't help but blush and moan slightly at the gropes and attention to his rump. In turn, he felt hotter, even with the morbid temperature coming up from the stomach, growling louder now that Fox's nose pushed into it. Fox was smacked in the face with the hot, putrid scent of stomach acids and digesting meat. He whimpered, his eyes tearing up as the heat got into his eyes, looking around in the belly, glowing slightly from the stomach acid as the throat pushed Fox's head inside. The glow seemed...unnatural, but he paid no attention to it. Lucario tilted further back and stretched his jaws over Fox's rump, licking along the cheeks, leaving Fox's feet hanging outside his maw, along with the tail. The curled up position of Fox made his cheeks bulge out greatly, almost uncomfortably, but it was worth it. Lucario snapped his head back and took one last thick swallow, sealing Fox's fate, snapping his jaws shut, and wiping his lips with the bib, looking down at his ever expanding belly.<br>\r\n<br>\r\nFox yelped around the apple as the throat dumped him into the pool of stomach acid, digesting the rope tied around his muzzle. Fox spit out the apple and sputtered, trying to get the burning acid out of his mouth, keeping his head above the acid as best he could. As the rest of him filled the small space, he struggled to get into an upright position, yelping from the stinging at his rump and feet as he sat in a fetal position in Lucario's belly. \"Lucario, you damn beast! Spit me out!\" Fox cursed, kicking at the stomach walls.<br>\r\n<br>\r\nLucario patted his stomach and let out a satisfied hearty belch, lovingly rubbing over his stomach to feel Fox moving around inside him. \"Oh, I have no intentions of letting you out. You can squirm now, maybe you'll find what's left of my earlier meal!\" Lucario grinned, licking his lips, still tasting Fox.<br>\r\n<br>\r\nThe ropes around Fox were eaten away by the acid and Fox looked at the source of the glow. He stared in horror as he held up the half-digested mechanical eyepatch of Wolf O'Donnell. He felt sick to his stomach, knowing that Wolf had been gobbled up by Lucario, and now it was his turn. He felt tears rolling down his cheek, feeling so defeated, cursed to a fate of being Lucario food...</span></div></div>",
            "created":1340075580,
            "id":1362600,
            "title":"In the Belly of a Pokemon"
        }
    },
    "info":{
        "author_id":"ft2k4",
        "author_name":"FT2k4",
        "brief_description":"Vore Story: Fox McCloud sure has a problem with attracting predators!",
        "created":1135787940,
        "description":"<td align=\"left\" class=\"norm\">As the short description says, this is a vore story. The following guidlines must be followed:<br>\r\n<br>\r\n1) Fox McCloud will always be the prey<br>\r\n2) No one-line posts unless it's a choice chapter<br>\r\n3) Fox must be eaten at some point in the story<br>\r\n4) Always include \"Other\" as an option for character/situation choice chapters.<br>\r\n<br>\r\nThe following are not required, but you can put them in:<br>\r\n<br>\r\n5)Sex is allowed, but try to at least keep it to M/M or M/F<br>\r\n6) Digestion is allowed, but please reform Fox.<br>\r\n7) Killing him off is an option, but make sure you leave a choice where he doesn't die.<br>\r\n8) Other kinks like torture, non-fatal cooking, and hard vore are allowed.<br>\r\n9) Krystal as pred is allowed<br>\r\n<br>\r\nOther than that, enjoy! By the way, I don't hate Fox. In fact, he's my favorite character in the SF games! I just like seeing him get yiffed and eaten.<br>\r\n<br>\r\nStarFox (C) Nintendo</td>",
        "id":1050482,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1394830260,
        "modified":1394830260,
        "pretty_title":"The Fox Hunt"
    }
}