{
    "chapters":{
        "1":{
            "author_id":"smart_dude",
            "author_name":"Clever_man",
            "choices":[
                "Godzilla",
                "Rodan",
                "Anguirus",
                "Baragon",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off, what is the kaiju? Also, can you add some chapters onto this interactive please?</span></div></span></div>",
            "created":1386824400,
            "id":1706912,
            "title":"It begins."
        },
        "11":{
            "author_id":"smart_dude",
            "author_name":"Clever_man",
            "choices":[
                "He just heads back to Monster Island with his new \"plaything\".",
                "He starts to do his usual rampage.",
                "It looks like he has two other monsters with him.",
                "Your decision.",
                "Your decision."
            ],
            "content":"<div class=\"\"><div> <span>You are a lady named Amy and are just walking around on a street when you see a huge black bumpy yellow clawed hand scoop you up. you look below as you see the ground go further and further away. The hand stops and you turn around to see the face of a giant dino with teeth protruding out from the top of its bumpy maw and have orange eyes and what looks like spines going down its back. \"well hello little one. You look like a fun little toy to play with\" He says as he pokes you a bit.</span></div></div>",
            "created":1411534800,
            "id":1861256,
            "title":"GORILLA WHALE!"
        },
        "111":{
            "author_id":"labc2000",
            "author_name":"LABC2000",
            "choices":[
                "He feels the presence of another kaiju approaching.",
                "He walks to his private glade to play with you.",
                "He spits you in his hand as he walks somewhere."
            ],
            "content":"<div class=\"\"><div> <span>Ambiguous gender in this story path please.<br>\r\n<br>\r\nAfter he makes sure you're secure in his grip, he turns around to go back into the ocean. His gargantuan tail knocking down buildings and his feet kneading the warehouses of the docks into dust.  You struggle all the while, trying to break free from his clawed fingers. Soon the water level reaches his chest, making him remember the inability of his toy to breathe underwater. With a quick movement, he puts you in his mouth. The texture and saliva in his tongue seems to try to swallow you completely as you struggle to get to the front of the giant reptile's snout.<br>\r\n<br>\r\nHe entertain himself with your despair before closing his mouth and plunging to the bottom of the ocean, completely evading the military and swimming quietly to Isle of Monsters. You fight to escape the explorations that the enormous tongue submits you to. Soon he arrives at the island, still reveling in your unique flavor as his dorsal fins break the surface of the water to walk to the beach.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1536768900,
            "id":2546763,
            "title":"The new toy of the King"
        },
        "114":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Male Godzilla",
                "Female Godzilla"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well lets take a step back...<br>\r\nSo we got Godzilla... but we weren't asked anything more, just made into a woman, well here are other options&gt;</span></div></span></div>",
            "created":1451019600,
            "id":2079396,
            "title":"Your decision."
        },
        "1142":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay it doesn't matter male or female it just means that the other set of organs on her will not be there as she can asexally reproduce if she must... However we have another question that must be answered... You are male or female human?</span></div></span></div>",
            "created":1451019600,
            "id":2079397,
            "title":"Female Godzilla"
        },
        "11421":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Male 1",
                "Male 2",
                "Male 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To prevent hogging of a line we have more choices</span></div></span></div>",
            "created":1451019600,
            "id":2079398,
            "title":"Male"
        },
        "114211":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "She decideds to eat you",
                "she decideds to let you ride her",
                "She decideds other"
            ],
            "content":"<div class=\"\"><div> <span>You are watching the ocean, regardless of the warnings you have heard... Godzilla was near the Island... but hasn't tried coming inland... well who cares you found a good place to sit.... and have your picnic...<br>\r\nYou ate the sandwhich and was drinking some water when the ground started thudding... You look up from your picnic and see Godzilla...<br>\r\nYou get up and scream and run... but Godzilla catches you... Godzilla shows to you that he is a she... not at all what you expected... She then places you down and looks at you thoughtfully... <br>\r\n\"Um so what do you want to do to me?\" You ask with your horace voice from your scream...<br>\r\nShe looks at you more and seems to decide something...</span></div></div>",
            "created":1451102280,
            "id":2079400,
            "title":"Male 1"
        },
        "1142113":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Tailhole",
                "Vagina"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So she decided to use you for her rear... but which of the two holes you see approaching?</span></div></span></div>",
            "created":1451102340,
            "id":2079401,
            "title":"She decideds other"
        },
        "11421132":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Climb on in",
                "pull out and try to get away"
            ],
            "content":"<div class=\"\"><div> <span>Her tail comes down slightly pulling you closer to her lips... they were massive making you think she wouldn't feel you and you would possibly fall out and down there or possibly end up being a pancake in her lips...<br>\r\n<br>\r\nShe pulled you till you slipped an arm in she gave a rumbling roar of happiness... You decide to</span></div></div>",
            "created":1451103300,
            "id":2079407,
            "title":"Vagina"
        },
        "114211321":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "She sighs",
                "You hear her"
            ],
            "content":"<div class=\"\"><div> <span>You climb on into her... slipping past the outside lips... her lips were tight enough to keep you in her... so you wiggled fowards trying to reach her womb before you had no air left... after another move her sex twitched pulling you closer to your destination... she seemed to be purring and walking... I reached her crevice... I pressed against it for a bit before it opened. Her womb was massive, even in this inactive state... she had a lot of room you could stack five cars in here and her womb would have room for other things still... but I guess I should just enjoy it while I can... I find a good fold to lay under as it was warm and I could feel her thrum through it...<br>\r\n<br>\r\nLater...<br>\r\nI woke and found I was still alive... and Godzilla had stopped moving... I pet her flesh seeing what could get her attention... after rubbing her realy hard I felt a question in my mind... I couldn't say what it was suppose to mean as It seemed alien to me...</span></div></div>",
            "created":1451104560,
            "id":2079410,
            "title":"Climb on in"
        },
        "11422":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "female 1",
                "female 2",
                "female 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To prevent hogging we have more choices</span></div></span></div>",
            "created":1451101980,
            "id":2079399,
            "title":"Female"
        },
        "12":{
            "author_id":"smart_dude",
            "author_name":"Clever_man",
            "choices":[
                "\"Yes, I would love that thanks\" you say to him (he puts you on his head)",
                "\"No thanks, maybe later though\" you say to him (he puts you down)",
                "Other monsters show up.",
                "Something stops you before you make your decision.",
                "\"How about we stay here.Those feet look tempting\" you smile to him (he blushes)"
            ],
            "content":"<div class=\"\"><div> <span>You walk around the island looking around admiring the scenery. You say to yourself \"Wow this place sure looks great. The sandy beach looks great and those forest trees look rather excel-\" Your speech was cut short when by accident you bump into a sharp talon foot. You back up a bit and look at the red large armored leg pteranodon. It looks like it has a spikey belly with two horns off the back of its head and a sharper black beak. The spikey bellied birdy bends down to look at you. \"It looks like you like Monster Island here\" Rodan says with a smile. It scoops you up in it wing claws and studies you more. \"I have never seen your kind on this SIDE of Monster Island. What might your kind be?\" Rodan says in a friendly tone as he gently pokes you with one of his wing claws \"a human\" you say back to him. Rodan tilts his head \"a human? Haven't heard of your kind before\" Rodan then thinks for a bit \"Hey since you like it here do you feel like coming up to my nest and seeing the others up there?\" You look questionably at him \"Others?\" you say to him. He smiles. \"Yeah, Manda, Varan, and Mothra. Manda occasionally slithers up that mountain and Mothra occasionally flies in every once in a while. It's mostly just me and Varan\" he says to you. \"so do you feel like meeting them?\" he says to you.</span></div></div>",
            "created":1538682540,
            "id":2559239,
            "title":"The Big Birdie"
        },
        "13":{
            "author_id":"smart_dude",
            "author_name":"Clever_man",
            "choices":[
                "\"Yeah sure, I would love that\" you say back to him.",
                "\"Nah, no thanks. But i do want to get to know you better.\" you say to him.",
                "Another monster shows up.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You start walking around enjoying the sun on Monster Island when it suddenly gets dark and you hear a loud awkward roaring sound and you turn around. You see a colossal spikey beast with razor sharp teeth. Naturally a person would scream and try to run away, but you felt rather affectionate about this beast. You stroke your 50 meter buddy with your little hands and play with his nasal horn. \"Hello there little buddy\" Anguirus telepathically says to you. He seems rather affectionate to you too and your a bit surprised that he CAN speak telepathically, let alone speak at all. \"Y...Y...You can speak tele-\" He interrupts you there \"yes, I can use telepathy and speak to you through your mind.\" He continues \"Most of the monsters here can, Do you want to go see them?\" He says to you.</span></div></div>",
            "created":1405746000,
            "id":1829972,
            "title":"Spikey buddy"
        },
        "131":{
            "author_id":"labc2000",
            "author_name":"LABC2000",
            "choices":[
                "Godzilla",
                "Rodan",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He uses his tongue to bring you up to his level before turning and heading in the other direction, all while licking and twisting you in his mouth. \"You have such a fantastic taste Little One!\"<br>\r\n<br>\r\nWho does he bring you to?</span></div></span></div>",
            "created":1536769200,
            "id":2546769,
            "title":"\"Yeah sure, I would love that\" you say ..."
        },
        "133":{
            "author_id":"smart_dude",
            "author_name":"Clever_man",
            "choices":[
                "Gomora",
                "Eleking",
                "Other Ones"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps Gomora or Eleking?</span></div></span></div>",
            "created":1505517480,
            "id":2386380,
            "title":"Not a Godzilla monster if you want."
        },
        "15":{
            "author_id":"smart_dude",
            "author_name":"Clever_man",
            "choices":[
                "Option #1",
                "Option #2",
                "Option #3",
                "Option #4",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other kaiju? (I decided to make these into numbered options)</span></div></span></div>",
            "created":1386997200,
            "id":1707802,
            "title":"Other"
        },
        "155":{
            "author_id":"smart_dude",
            "author_name":"Clever_man",
            "choices":[
                "Eleking",
                "Manda",
                "Completely made up kaiju."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more kaiju.</span></div></span></div>",
            "created":1386997200,
            "id":1707803,
            "title":"More"
        },
        "1552":{
            "author_id":"smart_dude",
            "author_name":"Clever_man",
            "choices":[
                "Snake",
                "Dragon",
                "Actually, how about some other choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Manda though?</span></div></span></div>",
            "created":1410930000,
            "id":1858115,
            "title":"Manda"
        },
        "1553":{
            "choices":[
                "Made up kaiju 1",
                "Made up kaiju 2",
                "More spaces"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are the first 2 options for made up kaiju. Do whatever you like.</span></div></span></div>",
            "created":1405659600,
            "id":1829739,
            "title":"Make space"
        },
        "15531":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Beaver Kong from tiny toon adventures.",
                "Next choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's some made up Kaiju or Daikaiju to pick from.</span></div></span></div>",
            "created":1405746000,
            "id":1829989,
            "title":"Made up kaiju 1"
        },
        "155311":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "I told her she could keep me.",
                "I told her she couldn't keep me."
            ],
            "content":"<div class=\"\"><div> <span>*Beaver Kong from tiny toon adventures point of view* <br>\r\n<br>\r\nOne summer day, I Beaver Kong your friendly neighborhood giant monster and King Kong sized hunk of a monster was strolling through downtown acme acres heading towards the nearest nude beach, when i spotted a damsel in distress in an back alleyway being threatened by a couple of goons. I knew i had to do something right away.<br>\r\n<br>\r\n\"This looks like a job for Beaver Kong.\" I heroically said.<br>\r\n<br>\r\nImmediately i made my way into the back alleyway, and confronted the two goons while the damsel in distress swooned upon seeing yours truly.<br>\r\n<br>\r\n\"Either let the damsel in distress go or else.\" I said addressing the two goons.<br>\r\n<br>\r\n\"Or else what?\" The two goons asked.<br>\r\n<br>\r\n\"Let me put it this way, i'll flatten you two with my giant beaver feet or i could sit on you both and wait for the authorities to arrive. What's it going to be?\" I asked while menacingly looking at them.<br>\r\n<br>\r\n\"We'll let her go, please d-d-d-don't hurt us\" They stammered as they ran away completely terrified while the damsel in distress and i could only look on.<br>\r\n<br>\r\n\"Never fear milady, I Beaver Kong have saved your life and now must be on my way to the nearest nude beach.\" I said.<br>\r\n<br>\r\nThat's when she asked me something i never would forget.<br>\r\n<br>\r\n\"Since you saved my life, would you be willing to be my pet monster\"? she asked.<br>\r\n<br>\r\nThen....</span></div></div>",
            "created":1407992400,
            "id":1841472,
            "title":"Beaver Kong from tiny toon adventures."
        },
        "15532":{
            "choices":[
                "Yes!",
                "No! (New character option)"
            ],
            "content":"<div class=\"\"><div> <span>Name: Soniazilla<br>\r\nAge: 10<br>\r\nHeight: 200ft<br>\r\nPicture: <a rel=\"nofollow\" href=\"http://krizeii.deviantart.com/art/Sonia-Strumm-summer-vacation-472798681\" target=\"_blank\">http://krizeii.deviantart.com/art/Sonia-...</a><br>\r\nBio: No one knows how she got made, but she did. Her name is Soniazilla, and she is like a giant girl version of Godzilla. She can roar like a monster, she can fire an atomic breath from her mouth, and is nearly indestructible to many things. She can also breathe underwater. However, she is one happy and friendly kaiju, who is willing to do a good deed for the city like destroy a few buildings and such. She also wears a pink bikini in case you ask. She cannot talk since she is a monster, but I believe she makes a good kaiju.<br>\r\n<br>\r\nSo, want to use her? Note, that she doesn't obey abusive people.</span></div></div>",
            "created":1410584400,
            "id":1856188,
            "title":"Soniazilla"
        },
        "155321":{
            "author_id":"smart_dude",
            "author_name":"Clever_man",
            "choices":[
                "It's her brother.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Soniazilla was casually walking down the small street (to her, also I'm planning to give her shorts and at least some slip-ons.)  Making boom sounds for each step she takes and unintentionally stepping on some cars. She hears a guy shout at her but she just ignores him. She then hears another giant person walking around. She stops when she sees the person.</span></div></div>",
            "created":1410930000,
            "id":1858231,
            "title":"You'll go with her."
        },
        "1553212":{
            "choices":[
                "Go to the beach and have fun",
                "Go destroy some buildings for the workers like monsters"
            ],
            "content":"<div class=\"\"><div> <span>The other person person who was walking by and roaring like a happy giant monster as somehow another Soniazilla. However, there was something different about this Soniazilla. First, she is only 150ft tall, and looks seven years old. Could this be her younger sister? The new Soniazilla roared like a kaiju to Soniazilla, and Soniazilla roared back. Could they be talking to each other? Anyways, you decided to refer to her as Chibi-Soniazilla, her sister after you noticed a bit. Chibi-Soniazilla is currently wearing the same clothes Soniazilla is wearing (slip one and shorts) but her bikini is red. So, what to do now?</span></div></div>",
            "created":1415336400,
            "id":1882926,
            "title":"Her younger sister"
        },
        "15533":{
            "author_id":"kerion27",
            "author_name":"Kerion",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about something from another movie or game series?</span></div></span></div>",
            "created":1505512320,
            "id":2386346,
            "title":"More spaces"
        },
        "155331":{
            "author_id":"kerion27",
            "author_name":"Kerion",
            "choices":[
                "Movies, TV",
                "Video Games"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now which media?</span></div></span></div>",
            "created":1505512380,
            "id":2386347,
            "title":"Yes"
        },
        "1553312":{
            "author_id":"kerion27",
            "author_name":"Kerion",
            "choices":[
                "Primal Rage",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now pick which series you want.</span></div></span></div>",
            "created":1505512500,
            "id":2386350,
            "title":"Video Games"
        },
        "15533121":{
            "author_id":"kerion27",
            "author_name":"Kerion",
            "choices":[
                "Earth(Our world)",
                "Urth(World of Primal Rage)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before going forward, select how the world is.</span></div></span></div>",
            "created":1505512680,
            "id":2386354,
            "title":"Primal Rage"
        },
        "155332":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about creating your very own kaiju to go through this story with?</span></div></span></div>",
            "created":1536727860,
            "id":2546557,
            "title":"Custom kaiju "
        },
        "1553321":{
            "author_id":"oblaanbo",
            "author_name":"OblaanBo",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Great. Let’s make some massive monsters. First off, please don’t make your kaiju op. Leaves a bad taste in my mouth (not that I can enforce this haha.) as for the actual building of the kaiju, follow these guidelines so that people know what it is and it’s personally. Also, this is your oc. Please don’t steal.<br>\r\n<br>\r\nImage: (if you have one.)<br>\r\nName: (name your kaiju)<br>\r\nGender: (male, female, herm, neuter. For this it’s gender based on genitalia)<br>\r\nAge: (I suggest less than 50000 years old but that’s just my suggestion.)<br>\r\nHeight: (try to stick to 50 ft to 500 ft tall as an adult so it is still a kaiju and is not ridiculously big.)<br>\r\nWeight: (your kaiju’s weight. Try to keep it realistic to your kaiju’s size.)<br>\r\nSpeed: (the speed at which the kaiju moves and all the ways it can move.)<br>\r\nHabitat: (where your kaiju normally lives)<br>\r\nFood: (What your kaiju normally eats)<br>\r\nAbilities: (try to not be too op. About 4-6 is a good amount.)<br>\r\nStrengths: (again, try not to be too op. About 3-4 is good)<br>\r\nWeaknesses: (include at least one of these, maybe two)<br>\r\nCharacter description: (describe your character in a paragraph. Try to be as detailed as possible.)<br>\r\nCharacter background: (try to be as detailed as possible.)<br>\r\nCharacter personality: (try to be as detailed as possible.)<br>\r\nLikes and dislikes:<br>\r\n(List everything, sex (y/n), vore (y/n) kinds of vore, etc.)<br>\r\n<br>\r\nThere you go. This should be good enough to make a kaiju from. Add anything else to your character description if you want to. Again, as this is not my interactive. I can’t enforce anything but I just wanted to make it so that it is easier for others to add.<br>\r\n<br>\r\nThe first choice is also the example. This is my new oc.<br>\r\n<br>\r\nImage: none<br>\r\nName: Lily<br>\r\nGender: Female<br>\r\nAge: 40 years old<br>\r\nHeight: 70 feet tall (quadrupedal) 100 ft tall (bipedal)<br>\r\nWeight: (your kaiju’s weight. Try to keep it realistic to your kaiju’s size.)<br>\r\nSpeed: walk (140 feet per sec at a fast walk) fly (280 feet per sec at a fast fly)<br>\r\nHabitat: mountainous regions<br>\r\nFood: Non intelligent animals.<br>\r\nAbilities: <br>\r\n1. She can control her stomach acids<br>\r\n2. She has a secondary stomach that can provide everything a living animal needs to stay alive.<br>\r\n3. She can breathe a cone of golden fire that damages only the things she wants it to damage.<br>\r\n4. She has a rage mode. This turns her all black and turns her fire black as well. This doubles her damage, health, strength, and speed but makes her easily predictable if you know what you’re doing. After her rage is over (takes about half an hour.) she becomes extremely exhausted, barely able to move a muscle.<br>\r\nStrengths: high health, high speed, and high strength <br>\r\nWeaknesses: <br>\r\n1. Small size compared to other kaiju, making her a lot weaker than if she was as big as the others. <br>\r\n2. She cares for her friends and all living things a lot. This can be used to extort her. <br>\r\n3. She is weak to slashing, fire, and magical attacks.<br>\r\nCharacter description: She is a white furred dragonlike kaiju. She is semi-bipedal (carries herself like a pangolin usually) with a long and thick tail to act as a counterbalance. Her head is rather long with a long muzzle as well. Comparatively, her mouth is rather small for her size but she can extend it past it’s normal limits. Her body is about 1.5 times as long as her height up to the shoulders (quadrupedal) her tail is 2 times longer than that. Her neck is the size of her body. She has two large white swept back horns adorning her head and a tiny one on the tip of her muzzle. Her wingspan is larger than she is long. About 200ft long.<br>\r\nCharacter background: she was hatched from a single egg. The last of a destroyed clutch of eggs. She was super lucky. But without her family, she struggled to survive but through her strong will and persistence, she managed to not only survive, but to thrive. Now, she hides her dark pass behind a cheerful exterior but sometimes when she gets really angry, her dark side is released.<br>\r\nCharacter personality: she is super friendly and enjoys meeting new prople. She tries her best to not damage things but she always inadvertently does and feels real bad about it afterwards. She is super energetic and sometimes acts like a kid, because (whilst mature enough to mate) is still really young for a kaiju. She enjoys spending time with friends as well as eating them on occasion.<br>\r\nLikes and dislikes:<br>\r\nLikes:<br>\r\nSex: yes<br>\r\nVore: yes<br>\r\nTypes of vore: oral, anal, endo, and unbirth<br>\r\nCan be pred and prey<br>\r\nCuddles<br>\r\nCompany<br>\r\nHer friends<br>\r\nDislikes:<br>\r\nHard vore <br>\r\nDigestion of intelligent creatures<br>\r\nGore<br>\r\nKilling<br>\r\nTorture<br>\r\nRape<br>\r\nMurder<br>\r\nSmut<br>\r\nEtc.<br>\r\n<br>\r\nThere you go for the custom kaiju. Message me for more information about her:</span></div></div>",
            "created":1536731820,
            "id":2546574,
            "title":"Make your own kaiju"
        }
    },
    "info":{
        "author_id":"smart_dude",
        "author_name":"Clever_man",
        "brief_description":"You have an enormous pet kaiju that you get to do whatever you want with.",
        "created":1386894840,
        "description":"<td align=\"left\" class=\"norm\">Pretty much anything goes. You get to do whatever you want with your enormous kaiju buddy. <br>\r\n<br>\r\n-Rampage<br>\r\n-Have it eat people<br>\r\n-Have YOU get bigger (match your kaiju size or be a bit bigger)<br>\r\n-Just play around<br>\r\n-Fuse with it<br>\r\n-Anal Vore if you want<br>\r\n<br>\r\nAnything goes, Except guts splattering everywhere. I changed the rules because they didn't make any bit of sense. Also you can do WHATEVER you dang well please except for sexual stuff.</td>",
        "id":1966848,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1538682540,
        "modified":1538682540,
        "pretty_title":"My Pet Kaiju"
    }
}