{
    "chapters":{
        "1":{
            "author_id":"roninmogura",
            "author_name":"Ronin Mogura",
            "choices":[
                "C.C.",
                "Kallen Kōzuki",
                "Euphemia li Britannia",
                "Nunnally vi Britannia",
                "More character choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well...only if you eat a ton of food, but let's see where you're adventure begins...</span></div></span></div>",
            "created":1352336340,
            "id":1463327,
            "title":"Beginning of the Rebellion"
        },
        "11":{
            "author_id":"roninmogura",
            "author_name":"Ronin Mogura",
            "choices":[
                "Stage 01",
                "Stage0 2",
                "Stage 03",
                "Stage 04",
                "Additional Story choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>C.C. the Pizza girl, huh? Well then, choose which story route you want to begin and let's let the good times fly!</span></div></span></div>",
            "created":1352337060,
            "id":1463330,
            "title":"C.C."
        },
        "12":{
            "author_id":"roninmogura",
            "author_name":"Ronin Mogura",
            "choices":[
                "Stage 01",
                "Stage 02",
                "Stage 03",
                "Stage 04",
                "Additional Story choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Black Knight's best Knightmare pilot...and a roving glutton if we play our cards right.</span></div></span></div>",
            "created":1352337300,
            "id":1463331,
            "title":"Kallen Kōzuki"
        },
        "15":{
            "author_id":"roninmogura",
            "author_name":"Ronin Mogura",
            "choices":[
                "Shirley Fenette",
                "Milly Ashford",
                "Nina Einstein",
                "Villetta Nu",
                "More choices, stage left."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And here's more, just inquire below...</span></div></span></div>",
            "created":1352336760,
            "id":1463328,
            "title":"More character choices."
        },
        "151":{
            "author_id":"kangaroo43",
            "author_name":"yellowturkey",
            "choices":[
                "Upon finding out Lelouch is zero after fighting mao in the middle of nowhere.",
                "When shirley gets shot in the train station."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>At what part of the series plot should the geass be used to fatten up shirley.</span></div></span></div>",
            "created":1452954420,
            "id":2089999,
            "title":"Shirley Fenette"
        },
        "1511":{
            "author_id":"kangaroo43",
            "author_name":"yellowturkey",
            "choices":[
                "Shirley wakes up with food boxes everywhere.",
                "Shirley goes to school"
            ],
            "content":"<div class=\"\"><div> <span>Upon finding out Zero is Lelouch, Shirley is crying and in fear, Lelouch has no choice and uses the Geass on her. Now he decides how he wants to change her personality.<br>\r\nHe tells her to forget everything that just transpired however also he thinks to himself how he wants to make sure she stays safe and don't ever take risks from now on. <br>\r\nHe decides the best course of action would be immobilizing her, but how. Looking around the area he sees a giant empty bucket that says lard shack, worried but still curious to his power he decides that would be the best idea, to make her massively obese and force her to focus solely on gaining weight the rest of her life.<br>\r\n<br>\r\nSo he then says to shirley still waiting for his commands before stopping his geass since its a one time use on somebody,\"Shirley I command you to forget everything that transpired today and focus your entire life to getting very very fat, don't try to do any real exercise and quit all your extra activities, focus on making me happy by showing me your fat progress every week, it will please me\". Shirley nodded and then Lelouch turned off the geass. <br>\r\n<br>\r\nShirley then snapped out of her trance and asked where are we, told her everything is fine and we should get back on the train home, Shirley took no heed of the situation and they both went home, however not before Shirley gets 3 bucks of chicken from lard shack to snack on during the trip back, unaware as to why she is so hungry all of a sudden. The next day...</span></div></div>",
            "created":1452955320,
            "id":2090004,
            "title":"Upon finding out Lelouch is zero after fighting..."
        },
        "15112":{
            "author_id":"kangaroo43",
            "author_name":"yellowturkey",
            "choices":[
                "The next day....",
                "1 week later...."
            ],
            "content":"<div class=\"\"><div> <span>Shirley was somehow feeling a slight belly under her shirt when going to school from her binge at the train going home, feeling disgusted from always making sure she stays fit and trim with exercise she decides she will go workout after school, However the red hypnosis of the geass in her eyes makes her change that mind, she then immedietly goes to gym class to let the teachers know she is quitting the swimming team. They ask her in shock as to why considering she is one of the best in the class, she tells them she wants to focus on her new life goal for her boyfriend to be Lelouch. The teacher thinks how nice it must be to be in love show the teacher understands and wishes her the best. <br>\r\n<br>\r\nShirley still with red in her eyes goes to the cafeteria and orders everything on the menu and also goes the milkshake vending machine to buy 12 muscle builder drinks which contain 3000 calories a can used for muscle but for her it would only build lots of fat with the meals ahead. She sits down by herself in a corner and starts chowing down, Shirley starts with 5 fully loaded pizzas and goes to town on them, Not even caring how much pizza sauce hits her plump breasts.Next she grabs 5 buckets of fried chicken and bites every portion of the greasy fattening fried food til its all bones. Next starts to eat a new product she brought with her in her backpack called lard rolls, basically egg rolls but highly fattening. Each lard roll had about 5000 calories each and she at 50 of them!! Now ever thirsty she starts drinking the milkshakes to quench her thirst, this kept going on for a few hours til night time hit.<br>\r\n<br>\r\n9:00 pm struck and now Shirley is free of the hunger and the red in her eyes was gone. She was too tired to notice any changes and went back to her dorm to sleep, unaware that her clothes and skirt were just about ripped from all the feasting, she weighted about 85 pounds today and after half a day later, her metabolism is destroyed and now weighes 275 pounds, and still more will be forming in her as fat while she sleeps to food off, not caring about changing into a gown, Shirley pops herself in bed with the springs popping in the bed frame from her sudden growth, and snoozes off, </span></div></div>",
            "created":1452956400,
            "id":2090009,
            "title":"Shirley goes to school"
        },
        "155":{
            "author_id":"roninmogura",
            "author_name":"Ronin Mogura",
            "choices":[
                "Empress Tianzi",
                "Kaguya Sumeragi",
                "More choices, see inside."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Annd we're still going...</span></div></span></div>",
            "created":1352336880,
            "id":1463329,
            "title":"More choices, stage left."
        }
    },
    "info":{
        "author_id":"roninmogura",
        "author_name":"Ronin Mogura",
        "brief_description":"You have a Geass? Why not make some ladies nice and fat with it!",
        "created":1352335980,
        "description":"<td align=\"left\" class=\"norm\"><b>General Overview</b><br>\r\nCode Geass is an anime series beginning where the world is split into three superpowers, Britannia, the Chinese Federation, and the Euro Universe (EU). The story takes place after the Holy Britannian Empire's conquest on Japan in August 10, 2010 a.t.b., by means of Britannia's newest weapon, the \"Armored Autonomous Knight\", or Knightmare Frame. In turn, Britannia effectively strips Japan and its citizens of all rights and freedoms and renames the country Area 11 with its citizens referred to as Elevens. The series begins as the main character Lelouch gains support from the Japanese and fights against Britannia.<br>\r\n<br>\r\nFor information regarding the series and it's concepts (WARNING: contains spoilers) -&gt; <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://codegeass.wikia.com/wiki/Code_Geass_Wiki\" target=\"_blank\">http://codegeass.wikia.com/wiki/Code_Geass_Wiki</a><br>\r\n<br>\r\n<b>Important Note</b> (kinda)<br>\r\nThe interactive doesn't have to follow the storyline of the original series down to the letter. If anything, you're welcome to form your own little stories around the characters and stretch your creative muscles a bit. I only ask that you act within reason and try to stay in universe with your ideas. If you wanna try something but, aren't sure it would fit or not, then don't be afraid to hit me up with a question and I'll see what you're trying to work with. <br>\r\n<br>\r\n<br>\r\n+Fetishes that will appear during this story...+<br>\r\n- Stuffing/Weight Gain<br>\r\n- Pregnancy<br>\r\n- Vore<br>\r\n<br>\r\n<br>\r\nStandard rules apply...<br>\r\n- Only female characters are to expand. Although this doesn't exclude male characters from appearing at all in the interactive.<br>\r\n- Please put forth effort in your chapters.<br>\r\n- Nothing completely outlandish in regards of expansion.<br>\r\n- Let's try to avoid the overly gross situations such as toilet stuff and the like. Burps are fine (farts too, if you play it for comedy), but nothing past that please.<br>\r\n- This is an 18+ interactive so sexual situations are allowed, just...try not to go overboard with them. Use in moderation, basically and try not to have the story revolve too much around it.</td>",
        "id":1902435,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1452956400,
        "modified":1452956400,
        "pretty_title":"Code Geass: Rotund Rebellion"
    }
}