{
    "chapters":{
        "1":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "SW, You, 24, Jason, trying a new human sushi restaurant, only girls on menu.....",
                "SW, You, 27, Amanda, biology teacher at a high school....Mmm...students.....",
                "NS, You, 16, Jill, at school, being dragged off by a hungry Senior to be lunch..",
                "NS, You, 16, Jack, at school, trying to survive the day......",
                "More choices......"
            ],
            "content":"<div class=\"\"><div> <span>          Who are you in this incredible world of vore? Are you a hungry guy or gal look for the next meal? Or are you powerless morsel waiting to be jumped on by the next hunger crazed person? Are you a teen or a little bit older? Will you end up having a full belly or feeding a belly. You decide your fate.<br>\r\n<br>\r\nSW=You are a swallower.<br>\r\n<br>\r\nNS=You are not a swallower.</span></div></div>",
            "created":1194152400,
            "id":460734,
            "title":"Where To Start?"
        },
        "11":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "You choose one of the tasty girls from the menu",
                "Request to eat the waitress"
            ],
            "content":"<div class=\"\"><div> <span>You had eaten many people before but you wanted to try out this new sushi restaurant, they only served girls. Naked and wrapped in seaweed and rice. You walk into the restaurant. \"Table for one,\" the hostess asks. The uniforms there were very revealing, probably because even the waitresses were part of the menu. She leads you to a table and hands you a tablet that each waitress is given with pictures of today's choices on it.</span></div></div>",
            "created":1464066000,
            "id":2153522,
            "title":"SW, You, 24, Jason, trying a new human sushi re..."
        },
        "111":{
            "author_id":"fnbr",
            "author_name":"KingDog13",
            "choices":[
                "Get a number 25",
                "Get a number 34",
                "Be suprised"
            ],
            "content":"<div class=\"\"><div> <span>“I want the hottest girl on the menu.” Jason says confidently.<br>\r\n“Well,” the waitress replied, looking at the menu, “the daily special is a number 25 (Blonde, Slim, Eager), however I can get you a pretty good deal for a number 34 (Red Haired, Oblivious, Fatter). Or would you like to be suprised?”</span></div></div>",
            "created":1599362040,
            "id":2898245,
            "title":"You choose one of the tasty girls from the menu"
        },
        "1111":{
            "author_id":"fnbr",
            "author_name":"KingDog13",
            "choices":[
                "Eat the maid",
                "Grab the menu and look for another prey",
                "Pay the bill and look among the street for a free meal"
            ],
            "content":"<div class=\"\"><div> <span>“I’ll take a number 25.” Jason says.<br>\r\n“Will that be all?” The waitress asks.<br>\r\n“For now.” Jason replies. “But I doubt one girl will fill me up entirely.”<br>\r\n“Alright then!” The waitress smiles, before returning to the kitchen for a few moments. After a couple minutes, she returns with a 15 year old female with big breasts, blonde hair, and big eyes. She is stilly fully dressed in jeans and a leather jacket.<br>\r\n“I’ll leave you to your business then.” The waitress replies, before returning to the kitchen once again.<br>\r\nJason looks at the girl across from him. “Hey.” he says, flashing a smile.<br>\r\n“H-hi!” The girl replies excitedly. “I’m Emily!”<br>\r\nJason admires the girls enthusiasm. “How come you want to be eaten?” he asks.<br>\r\n“Well, a bully at my school got mad that I didn’t finish his homework, and said that he was gonna eat me on Monday. I thought “I don’t want my resting place to be in the gut of a bully”, so here I am!”<br>\r\n“Wow.” Jason remarked.  “Well, let’s get this done.” He walks over to Emily and proceeds to strip her down to panties and a bra.<br>\r\n“Any last words?” Jason asked, chuckling.<br>\r\n“Goodbye Cruel World!” Emily yells dramatically, before throwing herself into Jason’s mouth. <br>\r\nJason is suprised at the amount of work that is being done for him. He just sits back, licks all over Emily, before finally gulping her down. After a few burps, the panties and bra lie in a sticky mess on the table.<br>\r\n“How’s it going in there Emily?” Jason asks. Who says you can’t play with your food?<br>\r\n“Actually pretty comfy!” She replies from within the depths of Jason’s belly.<br>\r\nWhile all this is happening, a teen maid stats to clean up the underwear remains in front of Jason. <br>\r\nJason grabs the menu and says, “Hey Emily, do you want a friend in there?”<br>\r\nAll he hears is a muffled “sure!” from within.</span></div></div>",
            "created":1599366600,
            "id":2898262,
            "title":"Get a number 25"
        },
        "11111":{
            "author_id":"fnbr",
            "author_name":"KingDog13",
            "choices":[
                "He wants the waitress",
                "He wants to see the dessert menu"
            ],
            "content":"<div class=\"\"><div> <span>Jason grins as he grabs the maid by the neck and brings her to his mouth.<br>\r\n\"W-wait!\" the maid protests, try to push herself away from a very sticky end. \"I'm no ton the menu!\"<br>\r\n\"Rules of the restaurant say that any employee that is asked to be eaten has to be eaten. Rules are rules.\" Jason laughs, before pushing the maid into his mouth. After a couple big swallows, Jason is burping out the maids garments. <br>\r\n\"Tasty.\" Jason grins, smacking his belly a couple times, before letting out a huge burp. The maids panties come flying out of his mouth, and land in a slimy puddle on his table. <br>\r\nJason seems pretty full now, but he still wants dessert. He calls over another waitress, a cute 16 year old girl with black hair and green eyes. Jason guesses that her boob size is about a c cup, and her ass is medium sized. She could be a good dessert, but after looking at the menu, he sees that there is entire section of desserts. He decides that...</span></div></div>",
            "created":1602038280,
            "id":2916438,
            "title":"Eat the maid"
        },
        "11112":{
            "author_id":"fnbr",
            "author_name":"KingDog13",
            "choices":[
                "Cosplay Cupcake",
                "Chocolate Cutie"
            ],
            "content":"<div class=\"\"><div> <span>Jason grabs the menu in front of him, and looks at his options. He could either get the \"Cosplay Cupcake\", which was someone dressed up as an attractive fictional character, or a new dish called the \"Chocolate Cutie\", which was a teen girl dipped in chocolate sauce. He decides that he wants the...</span></div></div>",
            "created":1602038460,
            "id":2916441,
            "title":"Grab the menu and look for another prey"
        },
        "111121":{
            "author_id":"fnbr",
            "author_name":"KingDog13",
            "choices":[
                "Harley Quinn",
                "Elsa"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The current options are Harley Quinn, or Elsa.</span></div></span></div>",
            "created":1602038520,
            "id":2916442,
            "title":"Cosplay Cupcake"
        },
        "11113":{
            "author_id":"fnbr",
            "author_name":"KingDog13",
            "choices":[
                "Three Cute Teen Vandals",
                "A Karen"
            ],
            "content":"<div class=\"\"><div> <span>\"Maybe I can find some free food out on the streets!\" Jason decided, speaking to no one in particular. He drops a couple of 20$ on the table, and then proceeds to leave the restaurant. Looking around the streets, he tries to see if he can find any prey to vore. To his delight, he finds, that just turning around a corner, are... </span></div></div>",
            "created":1601429460,
            "id":2912604,
            "title":"Pay the bill and look among the street for a fr..."
        },
        "112":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "Feet",
                "Head"
            ],
            "content":"<div class=\"\"><div> <span>You look at the pictures on the tablet. They were all delicious looking girls but none of them caught your fancy, there were Asians, Caucasians, Indians, Africans. The Africans looked especially delicious but what really looked delicious was the cute Asian waitress showing all of this to you, she is what you wanted for dinner. <br>\r\n<br>\r\n\"So did you choose something?\" she asks you.<br>\r\n\"Yes, I want you for dinner.\" You answer with a smile.<br>\r\n\"Haha, funny, but what did you choose.\" She says as she laughs it off.<br>\r\n\"I want you, how many times do I have to say it.\" You answer.<br>\r\n\"Sure if you don't stop this, you will have to leave.\" She says getting serious.<br>\r\n\"Go tell your manager that I want you for dinner.\" You say.<br>\r\n\"Okay, but he will just throw you out.\" She answers, seeming sure of herself.<br>\r\n<br>\r\nShe goes to the back of the restaurant and about five minute goes by. Finally she returns holding a silver plate and looking horrified.<br>\r\nShe places it on your table and barely mutters out, \"enjoy your meal.\"<br>\r\n<br>\r\nShe climbs up and lies on her stomach on the platter, do you eat her feet first, or her head first?</span></div></div>",
            "created":1464152400,
            "id":2154031,
            "title":"Request to eat the waitress"
        },
        "1121":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "Pay the bill",
                "Menu"
            ],
            "content":"<div class=\"\"><div> <span>You decided to eat her feet first, that way you can take time to lick and enjoy the flavor of her feet, and that way she can face the world as she goes in. Her head was facing you so you stand up and stand above her. She seems nervous, apparently she wasn't quite used to the idea of vore yet. She seemed oblivious to what was in the contract, that every waitress who was not a swallower could be served.<br>\r\n<br>\r\nStanding above her you tear her clothing off, the restaurant might charge you for the uniform but it was worth it. Now she was only in her bra and panties, which you also removed. She was now completely exposed and vulnerable on the table. You sat down at her feet, you removed her shoes and socks and saw the delicious little things right there.<br>\r\n<br>\r\nYou started licking the soles of her feet, making sure your tongue got in between every toe which caused her to squirm greatly. After about five minutes of licking you placed her feet in your mouth and reached your hands up to grasp her butt cheeks, one in each hand. She squealed and squirmed as you pulled her by her butt further into your mouth. As her knees entered your mouth you could feel her feet entering your throat. You pulled her thighs in and as her butt entered your mouth you licked her nether regions causing her to gasp in pleasure.<br>\r\n<br>\r\nYou grabbed her breasts before moving your hands up to grab her shoulders and pull her in farther. Tired of wasting time you pull her in up to her neck, you give her one last chance to look at the outside world and then push her head in. You swallow several more times until you feel her enter your stomach. <br>\r\n<br>\r\nDo you pay the bill for the waitress or call another waitress over to choose somebody from the menu?</span></div></div>",
            "created":1464152400,
            "id":2154039,
            "title":"Feet"
        },
        "11212":{
            "author_id":"fnbr",
            "author_name":"KingDog13",
            "choices":[
                "Accept the offer and ask for the vandals",
                "Deny the offer and proceed with the menu"
            ],
            "content":"<div class=\"\"><div> <span>Jason decides that he should enjoy the new restaurant some more, and actually order off the menu this time. As the second waitress comes over, Jason suddenly has a strong urge.<br>\r\n“Excuse me miss,” Jason asks the new waitress, “are we allowed to add toppings to our meals?”<br>\r\n“Yes,” the new waitress replied. “The toppings include Maple Syrup, Chocolate Sauce, and other yummy goods.” The waitress leans closer to Jason and whispered, “Thanks for eating that waitress. She stole my shift, and with her gone, I can get it back! For that, I can offer you a special discount! We just “found” three annoying brats that were spray painting our restaurant. If you want, we can give you those three for free! What do you say?”</span></div></div>",
            "created":1599363300,
            "id":2898249,
            "title":"Menu"
        },
        "112121":{
            "author_id":"fnbr",
            "author_name":"KingDog13",
            "choices":[
                "The leader of this group (Long dark hair, c cups, big ass, and green eyes)",
                "The cheerleader (short pink hair, d cups, blue eyes, nervous)"
            ],
            "content":"<div class=\"\"><div> <span>“Well, I do love helping out the community. Let me teach these girls a lesson.” Jason replies with a demonic grin.<br>\r\n“As you wish.” The waitress replied happily. “Would you like them stripped, or dressed?”<br>\r\n“Strip them down to their bra and panites please.” Jason replies.<br>\r\n“And would you like them all at once, or one at a time?” <br>\r\n“One at a time please.” <br>\r\n“Alright, let me go get one for you.”<br>\r\nThe waitress disappears to the kitchen for a few moments, before bringing</span></div></div>",
            "created":1599365280,
            "id":2898257,
            "title":"Accept the offer and ask for the vandals"
        },
        "12":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "You tell him no, that he should just keep being a good student.....",
                "He wants it, so you take him to your apartment to be your dinner......",
                "Take him home, swallow him then let him out, to show him what it is like.....",
                "You say, \"Okay, I think Kelly wants some company in my belly.\"......"
            ],
            "content":"<div class=\"\"><div> <span>          You are Amanda, a young leggy and busty biology teacher. You are 5ft 7in with long brunette hair with a slight curl to it; D-cup breasts, long sexy smooth legs and a lovely round ass.  Your class was filled with tasty young freshmen. You didn't eat your students when you got hungry. You would eat students that failed tests or constantly made excuses for not turning in homework. Most of the guys in the class were ones that had heard of you and requested you as their teacher. They of course didn't want to be eaten, they just wanted to ogle you. You didn't mind the boys staring at you as long as they kept up with there work. One boy last year went a little too far, he smacked your ass when you went passed him going down the aisle. Consequently he ended up adding to and coming out of the ass that he smacked.<br>\r\n          This year started out with you not having to eat any of your students in this first month, but that changed this day. Today just before the period bell rang you had the last half of a pair of female legs kicking and flailing around out of your mouth, until finally you made one last gulp and they slipped quickly in and down into your belly, you let out a little belch, \"Okay class, before you go I have to warn you, Kelly got what she deserved because she failed the last test. She didn't study and work hard enough. Your homework for tonight is to read chapter 3 and be ready for a quiz over it tomorrow, please do it, because I don't want to have to end the semester with no students in my class and fat on my body that I have to work off. Oh, and Jason see me before you leave.\" The class was startled by what you did, but the boys liked it because you strip the girl naked before you gulped her. The tone sounded and the class rushed out of the classroom as it was period eight, so it was time to go home. Jason walked up to your desk and said, \"Okay Miss Summers, I'm ready to join Kelly in your belly.\" Jason had also failed the test.<br>\r\n          You looked at him sternly, \"No I am not going to eat you. Jason, I know you failed that test on purpose. I'm giving you an A because I know that is what you should have gotten. Why did you fail that test?\"  \"Miss Summers, I want you to eat me up. I want to be a part of you, to be in you,\" Jason said.  You laughed, \"I'm flattered Jason that you want to be a part of me so much, but why do you want this? You are an excellent student, you have a good life ahead of you.\" Jason looked deeply into your eyes, \"Well, I know that sooner or later some girl is going to gobble me up. Well, I rather it be you than some random girl, who might not even look very hot. You are lovely and sexy. I just can't wait to get in your belly.\"<br>\r\n<br>\r\nHe was pushing for this really hard, what did you do?</span></div></div>",
            "created":1194757200,
            "id":462888,
            "title":"You Are A Biology Teacher With An Appetite."
        },
        "121":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Say no and digest the poor girl",
                "Let her out and let her go home with a promise shell do better",
                "Let Kelly out but tie her up and keep her as a slave"
            ],
            "content":"<div class=\"\"><div> <span>\"No Jason Im sorry but I will not be eating you\"  Amanda replies quickly.  Jason seems disappointed even though he shouldn't be.  Amanda sighed as she sat down.  \"Jason do you know what is happening to poor Kelly right now.\"  She says rubbing the girl shape silhouette in her stomach.  <br>\r\n<br>\r\n\"Being digested.\"  Jason responded.  He tried to add more before Amanda cut him off. <br>\r\n<br>\r\n\"Yes she is being digested.  In order to digested her I have to slowly dissolve her with very strong and very painful acids.  Do you understand?\"<br>\r\n<br>\r\nJason nodded.<br>\r\n<br>\r\n\"Good, now you're a good student, I am not going to let you end your life over a teen fantasy that will not even be enjoyable, okay?\"<br>\r\n<br>\r\n\"Okay Miss.\"  Jason said nodding.  <br>\r\n<br>\r\n\"Good now head home while I digest Kelly to death here.\"  Amanda smiled at Jason as he left the room.  Leaning back in her chair she enjoyed the fact that her stomach acids double as taste buds, allowing her to taste every inch of Kelly's brown skin.  Suddenly there was a cry.  \"Oh hello my Colombian princess, how are you enjoying herself.\"  There was a moan.<br>\r\n<br>\r\nScreaming at the top of her lungs the toned and shapely girl replied.  \"Please Miss Summers I'm sorry, please let me out it hurts so bad.\"<br>\r\n<br>\r\n\"Yes digestion is rather painful to the victim, rather pleasurable to the eater.  She smiled as she continued to the rub the silhouette.  <br>\r\n<br>\r\n\"Please let me out I promise Ill do better please!\"  The latina screamed desperately before moaning in pain.<br>\r\n<br>\r\n\"Oh now you want to do good and pay attention,  tuttut Kelly you should of thought about that earlier, would of saved you from an agonizing death.\"<br>\r\n<br>\r\n\"Please I'm sorry, please it hurts so bad, my stomach- its on fire, my entire body is.\"<br>\r\n<br>\r\n\"Yes as I said digestion is rather unpleasant to you.\"  She replied dryly.  <br>\r\n<br>\r\n\"Please end it then!\"  She cries desperately.<br>\r\n<br>\r\n\"Now?  Oh no my dear you have at least three or four days to enjoy you acidic bath; have fun.\"  Kelly moaned at this.<br>\r\n<br>\r\n\"Please, please have mercy!\"  Kelly yells.<br>\r\n<br>\r\n\"The answer is no.\"  Miss Summers replied.  \"You made a decision and this is the consequence for it.  Don't worry though I keep my students remains, a memento another member of our faculty taught me.\"  She smiled.<br>\r\n<br>\r\n\"Please,  I promise Ill do better, just let me live to I can prove it to you.  Please you don't understand how-\"  She was interrupted by a cry of agony.  \"Please!\"<br>\r\n<br>\r\n\"I must say you sophomores always taste good.\"<br>\r\n<br>\r\n\"Please!\"<br>\r\n<br>\r\n\"Hmmmm.\"  Miss Summers replied.</span></div></div>",
            "created":1395118800,
            "id":1762697,
            "title":"The answer is no"
        },
        "1211":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "You have another student tied up in the closet",
                "The next day a student fails a test"
            ],
            "content":"<div class=\"\"><div> <span>Amanda decided to just digest Kelly. Kelly continued to scream, plea, and beg for Amanda to have mercy on her. If she did that, she might gain a reputation for having mercy and then people won't be as afraid to fail tests. <br>\r\nSince it was the end of the day for her, Amanda gathered her things and walked out to her car. Her stomach jiggling all the way. It would be harder to drive home with the huge stomach but she would manage. She arrived back home at her apartment where she immediately laid down on the couch to rub her stomach.<br>\r\nAmanda decided to have a little bit of mercy on Kelly, she could control digestion. Even though she had told Kelly it would take 3 or 4 days she decided to shorten it to 5 hours.<br>\r\n\"Kelly I've decided to have mercy on you,\" Amanda said.<br>\r\n\"You mean you're going to let me out?!\" Kelly asked excitedly.<br>\r\n\"No, I'm shortening your digestion period from 3 days to 5 hours,\" Amanda said with an evil grin on her face.<br>\r\nKelly just groaned.<br>\r\n\"You have less to live but there will be much less pain involved,\" Amanda said.<br>\r\nWithout another word Amanda fell asleep and by the time she woke up, Kelly had completely digested.</span></div></div>",
            "created":1463979600,
            "id":2152573,
            "title":"Say no and digest the poor girl"
        },
        "1213":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Order Chinese ",
                "Go out to eat",
                "Hearing a knock on the door"
            ],
            "content":"<div class=\"\"><div> <span>\"Just wait in there another hour. Then you'll have wished that you took the three day long death.\" You tell your stomach as you make your way to your car. You hop in and drive down the freeway to your downtown apartment. You hop out the car and get inside the tenements, riding the elevator to the tenth floor. Getting out, you walk down the hall to your shitty apartment 345.<br>\r\n<br>\r\n Here, you unlock the door, and walk inside to the kitchen. You then push on your stomach, making gagging noises. You are soon hearing the cries of pain from the Colombian girl, but you aren't definitely in the clear until you see Kelly's head pop out of your mouth. You suck her body clean as she pops out the way she came in. She lies on the ground, soaking wet as you take a chain and attach both her arms and legs to the wall next to your bed.<br>\r\n<br>\r\n \"This isn't what I asked for!\" She tiredly exclaims.<br>\r\n<br>\r\n\"No, but it's what you get.\" You tell her as you stick your entire fist up the helpless girl's pussy, wiggling it around inside despite her screams of pleasure and pain. You then retreat, chuckling at her pain. You go to the living room of the small apartment and</span></div></div>",
            "created":1457499600,
            "id":2115242,
            "title":"Let Kelly out but tie her up and keep her as a ..."
        },
        "122":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Order in some food",
                "Go to sleep",
                "Hit the town"
            ],
            "content":"<div class=\"\"><div> <span>\"Fine Jason, if you want it so bad, I won't argue. I won't have to go hunt down dinner anyways. But be warned, there is no turning back now. After this conversation you are nothing but food to me.\" You tell the freshman as you tie him up, duct taping his mouth and carrying him out to your car.<br>\r\n<br>\r\n You open the trunk to your mustang and cram his screaming body inside, shutting the ingredient into your car. You hop in and start to head home, and get on the freeway. You can hear him yelp with every pothole on the road, but you no longer care for your former straight A student.<br>\r\n<br>\r\n You pull into your nice neighborhood, as looting off of your meals turns out to be a very lucrative business. You pull Jason out of the trunk, and drag him over your shoulders as you enter the large house. You set him on the kitchen counter, removing his clothes and duct tape as you hum a catchy tune.<br>\r\n<br>\r\n \"Ms Summers, I'm starting to rethink this.\" He said as you turn on the stove, putting a large pot on top, waiting for the water inside to boil. <br>\r\n<br>\r\n \"Already told you, too late.\" You speak to the immobile student. You continue to hum the melody as you casually pick up his squirming body and set him in the pot, laughing at his screams in the scorching water. You pour salt on him, surrounding him with carrots, sticking them up holes he didn't know carrots could fit.<br>\r\n<br>\r\n He sat in the painful pot for thirty minutes before you came back to retrieve your meal. He sat in defeat as you plucked him out the metal and set him on your plate. Licking your lips, you start on his feet, and slowly work your way up his tender nude body, sending him further down your digestive track so easily it was as if he was lubed.<br>\r\n<br>\r\n You get to his screaming head as he yells \"Ms Summers! Never mind! I want out!\"  You ignore his desperate requests, muffling his cries by shutting your map and sending him down into his final pit of fate known to you as your stomach. You rub your belly as you feel his banging on the walls get slower and slower with every passing second. He finally stops as you burp a smell which resembles the cologne Jason heavily applied each day.<br>\r\n<br>\r\n You decide to</span></div></div>",
            "created":1457240400,
            "id":2114057,
            "title":"He wants it, so you take him to your apartment ..."
        },
        "124":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Get a female student for a snack",
                "Get a male student for a snack",
                "Go home right away, you can eat later"
            ],
            "content":"<div class=\"\"><div> <span>Miss Summers obliges, more for him than anything else, as she prefers swallowing girls. She strips him of his clothing and swallows him quickly. Jason curls up next to Kelly, and Miss Summers sits back in her chair, hearing Jason sooth the girl in her stomach. Finally, Kelly calmed down, and Miss Summers' stomach worked away at them slowly, stripping them of skin, then dissolving their muscle, reducing their bones and organs to a mushy soup. The sexy teacher sighed in contentment. She looks at the clock. It's almost time to go home, but she wants one more snack...</span></div></div>",
            "created":1362114000,
            "id":1541647,
            "title":"You say, \"Okay, I think Kelly wants some co..."
        },
        "1241":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Eat the student anyways, and be rough about it",
                "Be gentle and kind as you devour the girl",
                "Let her go to live another day"
            ],
            "content":"<div class=\"\"><div> <span>Miss Summers walks out into the hall, searching for the perfect feminine prey. She spies a senior down the hall, putting her books into her locker. She is tall, around 6 feet, with an hourglass shape and large breasts, as well as a huge butt and long legs. Miss Summers sneaks up behind the girl grabs her, covering her mouth and dragging her back into the classroom. The girl, normally a predator herself, is in tears as her teacher releases her. \"Please, Miss Summers. I don't want to die. I get good grades, and I try to work hard. Please!\" Miss Summers is almost moved bv her begging. Does she really want to snuff out this girl's bright future? After a moment she decides...</span></div></div>",
            "created":1362114000,
            "id":1541650,
            "title":"Get a female student for a snack"
        },
        "12412":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Begins to devour the student",
                "The student turns the tables"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm so sorry, hon,\" says the buxom teacher, patting the girl's cheek and smiling a bit sadly. \"But a girl's got to eat. Now just relax, and it will all be over soon.\" The student has tears in her eyes. \"Please, please don't do this. I'll do anything.\" Miss Summers leans in and whispers in her ear. \"Just close your eyes.\" The girl takes a shaky breath and nods, then closes her eyes. Miss Summers leans in, her mouth open, and.....</span></div></div>",
            "created":1362114000,
            "id":1541651,
            "title":"Be gentle and kind as you devour the girl"
        },
        "124121":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Release the girl and apologise",
                "Keep ehr inside you: she's yours now"
            ],
            "content":"<div class=\"\"><div> <span>Miss Summers takes the girl's head into her mouth. Her tongue caresses the girl's face, stroking her cheeks and cleaning the tears from her eyes. Slowly, the teacher places her hands on her student's thighs, and begins to gradually slide them up her slightly struggling figure. She reaches the top of the girls shirt and, with one quick tug, pulls it off. The girl isn't wearing a bra, so her huge mounds fall free. The sexy teacher begins to massage the girl's pillows as she takes in her shoulders. The student begins to moan as her lovely breasts are kneaded like dough. Then Miss Summers takes in those huge mounds and begins licking them all over, running her tongue in the cleft between them, licking her hardening nipples, biting gently, causing the girl to gasp. Miss Summers takes a huge gulp, bringing the girl in to her waist. Her head pokes into the stomach and she sees the pool of skin colored goo that was Kelly and Jason, with Kelly's Skull still floating in it. She begins to panic again, her long gorgeous legs kicking into the air. Miss Summer's gently unbuttons and slips off the girl's Denim jeans, along with her pink panties. She rubs the girls thighs soothingly, but the girl cannot be calmed down. Finally, Miss Summers takes another gulp and sends her meals thighs down. She would have liked to lick the girl's nether region, but this girl, as far as she knows, is straight, and deserves to be respected for her sacrifice, and not used for pleasure against her will. Finally, she takes two more gulps, and the girl's pink painted toes enter the teacher's maw. Miss Summers, after removing the girl's sandals, closes her mouth around the appendages and swallows one last time. The girl is now completely encased within her teacher, sitting in the pool of goop her former peers had made. She sobs and begins struggling. Miss Summers placed a hand on her belly, feeling the naked girl's spine against the stomach wall. She strokes the girl gently, beginning to feel some remorse, but she's so full now...</span></div></div>",
            "created":1362114000,
            "id":1541655,
            "title":"Begins to devour the student"
        },
        "1241212":{
            "author_id":"firebolt2526",
            "author_name":"Firebolt",
            "choices":[
                "Lure them into your room, then into your gurgling belly!",
                "Go home and wait until tomorrow"
            ],
            "content":"<div class=\"\"><div> <span>You belch as your belly rumbles in satisfaction. The feeling was so good, you couldn't possibly release her now. You lay back in a comfortable chair behind your desk and relax. The weight in your belly was too much to be able to move now. Might as well lay back and enjoy the struggles in your bulging belly now.<br>\r\n       \"Miss Summers, please let me out!\" The girl begged. \"I'll ace all my tests, I promise!\"<br>\r\n        You give another long, loud belch. You ignore the girl's pleads for mercy and rub your stuffed belly. The girl quits begging and instead begins viciously struggling, kicking and punching the walls of your stomach. Normally you would enjoy the feeling, but this girl is much stronger. Her struggles actually make you nauseous, and you retch a few times. The last time you feel the girl sliding up your throat, but a powerful swallow sends her back down with a splash. Your stomach gurgles and groans and begins kneading the girl into the same goo as her peers now were. Her struggles continue, but get weeker. Your stomach sloshes as you get in a more comfortable position to digest the girl. After a half hour of your belly gurgling, bubbling, sloshing, moaning, and groaning, the struggles end. Your belly continues digesting in a fit of gurgling nioses, breaking down the remains of the girl. Finally the nioses stop, and your belly has shrunk in size. You notice that your already ample breasts and ass have increased in size. Your shirt suddenly tears open, reveling your lucious breasts. <br>\r\n       \"Drat. Another shirt outgrown.\" You mumble as you stand up. Suddenly, though, your belly shakes slightly and growls. You thought it would by satisfied with three students, but it wasn't. You glance out the window. You see some junior girls in the parking lot, just having finished their last class. Two in particular catches your eye, each with a supple, round ass and large, juicy boobs. You look down at your belly, which was still slightly larger than your bust. You decide it could handle two more students today. But should you really?</span></div></div>",
            "created":1368162000,
            "id":1587504,
            "title":"Keep her inside you: she's yours now"
        },
        "12412121":{
            "author_id":"grimm7",
            "author_name":"Grimm",
            "choices":[
                "Eat them",
                "Don't"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see two twins in your classroom.\" Miss Summers please eat us\"</span></div></span></div>",
            "created":1522213200,
            "id":2471488,
            "title":"Lure them into your room, then into your gurgli..."
        },
        "124122":{
            "author_id":"grimm7",
            "author_name":"Grimm",
            "choices":[
                "Go hunting",
                "Go home"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The student forces Miss Summers off her and into her mouth. She quickly swallows her and digests her. She now has K-cup breasts.<br>\r\n<br>\r\n<br>\r\n<br>\r\nNow what dose she do?</span></div></span></div>",
            "created":1522213200,
            "id":2471487,
            "title":"The student turns the tables"
        },
        "12413":{
            "author_id":"fnbr",
            "author_name":"KingDog13",
            "choices":[
                "Refuse the offer and find the Soccer Coach",
                "Accept the offer and follow the student home"
            ],
            "content":"<div class=\"\"><div> <span>Miss Summers sighs. “Well, I only eat kids who are spoiled, and don’t care about grades. You can go, but if you tell anyone, you will be nothing but stomach acid, you hear me?!” <br>\r\n“Y-yes, I promise.” the girl stammers, happy to survive a one way trip to the toilet bowl. “Since I am not your snack, maybe I can help you find a substitute! I have this little older brother who is FAILING math, and needs me to tutor him. Maybe you could help me get rid of him?”<br>\r\nMiss Summers thinks about this. She was just about to go eat the soccer coach, but maybe a smaller meal would digest easier.</span></div></div>",
            "created":1599362820,
            "id":2898248,
            "title":"Let her go to live another day"
        },
        "1243":{
            "author_id":"thegamer6",
            "author_name":"andy",
            "choices":[
                "you make it home",
                "something happens",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>No i can eat later i will just go home now.<br>\r\nYou leave the school walking to your car</span></div></span></div>",
            "created":1455944400,
            "id":2107074,
            "title":"Go home right away, you can eat later"
        },
        "13":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "Kristy, Senior blond head cheerleader, what's you as an after practice snack....",
                "Lauren, a rather plump Junior known for her voracious appetite; to lunchroom....",
                "Steve, nerdy Junior, takes you to his home to have fun with you, before dinner..",
                "Young Mr. Larson your biology teacher, wants to give you a special lesson....."
            ],
            "content":"<div class=\"\"><div> <span>          You are Jill, a cute and sweet Sophomore in high school. You are 5ft 3ins, you have medium length brunette hair, and a plump little above average looking body, so you were still considered a catch for most guys that were looking for a girlfriend. But one problem was you were also considered a catch by all the hungry swallower people in school. The second problem was that you had just been caught by a swallower while you were at your locker. You had been on the look out, but you let your guard down. Now a hungry swallower has you.<br>\r\n<br>\r\nWho is the swallower that has you? Where does this person take you?<br>\r\n </span></div></div>",
            "created":1194325200,
            "id":461101,
            "title":"Not A Good Day To Be At School."
        },
        "131":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "You couldn't get free, now you will make Kristy's belly bulge......",
                "You are able to free yourself from the rope that has you tied.....",
                "One of the cheerleaders feels sorry for you and sets you free......"
            ],
            "content":"<div class=\"\"><div> <span>          It had been a long day of doing work and dodging hungry students. You were at your locker preparing to leave for home, when your arms were grabbed and tied behind your back. You heard the mocking voice of Kristy the head of the Senior cheerleaders, \"Well looks like I found my after practice snack, though Jill you are pretty plump and curvy, you might spoil my dinner.\" You tried to think of something to save yourself, \"Well if I'm to much, than why don't you just find something less filling to snack on. I just saw Sally go in the bathroom.\"  Kristy giggled, \"Oh she's to skinny for my tastes, besides my motive for eating you is more than just for food. Yesterday, my boyfriend Rick tried to break up with me saying that he wanted to date someone that was down to earth. He told me that he was going to ask you out, he said even though you were younger, you have more brains, better outlook on life, and he said he loved your plump ass.\"  You couldn't believe Rick wanted you, you thought your ass was too fat, but apparently it is a guy magnet, \"So where is Rick, I bet he'll be here to stop you.\"<br>\r\n          Kristy laughed, \"Unless he can reform himself and get out of the sewer system. I wasn't going to let you have him, so I had him right on the spot as my dinner. I told him if he wanted a girl with a plumper ass than he could just add to mine.\"  You were furious, \"Kristy you are a selfish bitch. Rick just wanted to move on with his life and find someone better and you couldn't stand it so you ate him.\"  \"He was and idiot,\" Kristy said, \"He had the hottest girl in school and he threw it away to be fat on my ass.\" You shouted, \"He didn't choose for you to eat him, and some guys find that there is more to being hot than just looks.\"  Kristy laughed again, \"Well, since you agree so much with Rick, you can help him in making my ass fatter.\" You cringed as after Kristy said that she licked you on the cheek while grabbing your ass, \"Mmmm, Jill you are a sweet and plump treat, I think you will make a great after practice snack.\"  She dragged you off to the gym where cheer practice was. She sat you on the edge of one of the rows of front seats and tied you to the rail handle so you couldn't escape while she practiced.<br>\r\n          Kristy addressed the cheer squad, \"Okay girls, time for another hour of practice. The girl watching is Jill, my after practice snack, she is keeping me from eating one of you non-swallower members. I know you girls didn't like the fact that I ate Stacey last week when she made me mad. When you take your water break, you can go over and play with Jill.\" You couldn't believe that the girls took Kristy's advice. Several of the girls when they took their water breaks, would come over and feel you up. One fondled your breasts. Another rubbed your thighs and squeezed your ass. The last one to come over go real into it, she unzipped your jeans and started licking and sucking between your legs. Even though you were repulsed by it you couldn't help be pleasured by the thorough eating out you received. It was nearing the end of practice and the whole time you had been thinking of ways to escape.<br>\r\n<br>\r\nDid you somehow escape? Or did you become snack food?</span></div></div>",
            "created":1194757200,
            "id":462874,
            "title":"Cheerleader Kristy Wants To Snack On You."
        },
        "1311":{
            "content":"<div class=\"\"><div> <span>          Kristy tied your ropes well enough that you are unable to get free during practice.  When she is finished, Kristy unties you from the rail, picks you up, and slings you over her shoulder.  As she carries you to the locker room to enjoy her snack, Kristy keeps pinching your ass and licking her lips.  When the two of you get back to the locker room, you are laid on a bench and Kristy sits next to you.  She picks your upper half up towards her face and smiles.  \"Snack time,\" she greedily proclaims.  Then she pulls your face towards her and begins making out with you.  Only as she is deeply kissing and sucking on your face, she starts pulling your head into her mouth.  \"Mmmmm,\" she exclaims as she swallows your head.  Everything goes black while you are being sensually gulped down Kristy's gullet.  As your head enters her stomach, only from your waist down is still sticking out of her mouth.  She makes sure to take her time, tasting your pussy over and over to get your full flavor.  Next, she tilts her head up and begins sucking down your legs.  You can hear her make smacking noises with her lips against your soft, delicious body.  <br>\r\n          Now, only your feet remain outside Kristy, and she soon slurps them up as well.  Fully inside Kristy's stomach, you feel very turned on, but still a  little bitter that she ate you.  As you squirm to get comfortable inside her now enormous tummy, you can hear Kristy talking to you.  \"You were absolutely delicious!  Mmmm, I wish I could eat you again and again; but I think I'll take a little nap to digest you.\"  As Kristy pats her full belly, she notices a few more tasty looking cheerleaders that should satisfy her appetite next time.  Only, how could she possibly decide when everyone looks so tasty?<br>\r\n</span></div></div>",
            "created":1222146000,
            "id":586570,
            "title":"You're A Tasty Locker Room Snack."
        },
        "1313":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "Gets eaten by Kristy who had witnessed the whole thing",
                "Goes back to eat Kristy to show her who's boss",
                "Slips out of the school quietly to go home for a peaceful digestion"
            ],
            "content":"<div class=\"\"><div> <span>After practice came over to play with you, her name was Amanda, you recognized her from math class. She sat down on your lap and started grinding while Kristy was in the locker-room changing. As soon as Kristy was out of sight, Amanda started untying you from the poll. <br>\r\n\"Follow me, she said!\" <br>\r\nShe lead you to one of the hall bathrooms, you assumed she was going to help you climb out of the window to be free from Kristy. As soon as you went in there though, she shoved you into one of the stalls. You were confused as she followed you in and closed the door behind her. She grabbed her hair to pull it back into a ponytail. You got excited as she leaned in to kiss you, but just before your lips made contact, she widened her mouth. Her mouth engulfed your entire head. You felt her pulling your clothes off as she started feeling your body. She began gulping and pulling you in, she pulled your shoulders in and gave your breasts one last feel before they entered her mouth. She used her tongue to stimulate your nipples for a minute before swallowing them to follow your head on it's way to her stomach. She grabbed you by the thighs and pulled your stomach into her mouth. You felt her squeeze your fat cheeks before slipping a few fingers into your butthole. You gasped as your butthole opened widely to accept them and for a few seconds she started anally fisting you. After about a minute she pulled her hand out swallowed the rest of your legs. She tickled your feet before sending your entire body down to digest in her bloated stomach. Next she </span></div></div>",
            "created":1525213620,
            "id":2486929,
            "title":"One of the cheerleaders feels sorry for you and..."
        },
        "13131":{
            "author_id":"fnbr",
            "author_name":"KingDog13",
            "choices":[
                "Amanda successfully threw Jill up",
                "Amanda failed to throw Jill up"
            ],
            "content":"<div class=\"\"><div> <span>“Hello Amanda.” Kristy says smugly, emerging from the shadows.<br>\r\n“K-kristy!” Amanda stuttered, terrified about what was going to happen next. <br>\r\n“So,” Kristy says, slowly walking around Amanda. “Is there something that you think I should know? Something about this, maybe?” Kristy asked, sticking a finger right in Amanda’s belly.<br>\r\n“Kristy, I-“<br>\r\n“SAVE IT!” Kristy yelled. “That was MY meal that YOU stole.” <br>\r\n“I can cough her up! I swear!” Amanda states, desperately trying to throw her most recent meal up.<br>\r\n“You better!” Kristy yelled. “Or else you will be my next meal.”</span></div></div>",
            "created":1599364260,
            "id":2898254,
            "title":"Gets eaten by Kristy who had witnessed the whol..."
        },
        "13133":{
            "author_id":"ww10030",
            "author_name":"White Wing Writer",
            "content":"<div class=\"\"><div> <span>Your pleas for release and subsequent assault on her fleshy stomach walls are no good. Sloshing around inside, you can do nothing but sit there and allow her stomach acids to wither away at your body. You must have been a fitting meal, however, as plenty of groaning and other sorts of belly noises emit from her, very loudly, as she finishes you off.<br>\r\n<br>\r\nNonetheless, your life comes to a quick, slimy, end, at that.</span></div></div>",
            "created":1525220760,
            "id":2486971,
            "title":"Churning away"
        },
        "132":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "You manage to escape",
                "She starts eating you feet first",
                "She starts eating you head first"
            ],
            "content":"<div class=\"\"><div> <span>You sat on the shoulders of the chubby junior Lauren, who was notorious for her over the top appetite of underclass men. She had you slung over her shoulders, and you were being walked through the halls with heads turning and staring at you with devious smirks. You struggle to free yourself, but the junior has a much greater level of strength then you and holds you airtight to her body.<br>\r\n<br>\r\n She is a brunette with a beautiful face, but her voracious appetite led to her body being more of a pear shaped figure. You were unsettled by thinking that the fat which cushioned your ride now was provided by those who had fallen to Lauren before you.<br>\r\n<br>\r\n She made her way to the school's cafeteria, and sat down with her usual set of friends, as you saw a couple of them had meals as well. Lauren picked you up and <br>\r\n</span></div></div>",
            "created":1457499600,
            "id":2115343,
            "title":"Lauren, a rather plump Junior known for her vor..."
        },
        "1321":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "She eats you headfirst",
                "She eats you feetfirst",
                "She forces you to bend over and swallows you assfirst"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly you kick her in the face, you jump down off the table and start running as fast and as far as you can. Nobody chases you but you hear Lauren say \"don't worry, she won't get far.\" <br>\r\nAs you reach the cafeteria doorway you suddenly run into a boy, one of the juniors and also a jock. \"Where do you think you are going, underclassman, Lauren hasn't finished with you yet.\" He slings you over his shoulder as you try to escape. Suddenly he drops you onto the table in front of Lauren. <br>\r\n\"Well well, looks like you tried to escape, but you can't. Now hold still and it will all be over soon.\" </span></div></div>",
            "created":1463979600,
            "id":2152699,
            "title":"You manage to escape"
        },
        "1322":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Her letting you out ",
                "Yourself being digested",
                "Nothing, you find out you can't be digested"
            ],
            "content":"<div class=\"\"><div> <span>You squirm as the junior out powers you and lifts you onto the lunch table in front of her. She first takes off your shoes and socks, working her way up to your yoga pants, slowly pulling those off, followed by your panties. She finally makes her way to your breasts, pulling your blouse and bra off, leaving you naked and lying down on a cafeteria table.<br>\r\n<br>\r\n She and her friends chuckle as she brings you over her mouth and sets your legs into her moist cavern of a mouth. She tickles the soles of your foot as it goes deeper and deeper, slipping down her esophagus. Along with your feet the rest of your body slides into Lauren, leaving her teeth up to your ass. <br>\r\n<br>\r\n She takes her hands and places them on your head, pushing down, while you scream for the never arriving help. You are now up to your luscious bare tits into the digestive system of an upperclassmen, when she starts swallowing. You feel her rush down your body as she takes her time to enjoy you to your fullest.<br>\r\n<br>\r\n Your cries for help are silenced as Lauren shut her mouth over your head, and you are surrounded by the echoes of your own terror inside the esophagus of a junior. You shut up as the only sounds you hear certainly aren't coming to your rescue, in fact the rumbles and swishes are that of which you fall.<br>\r\n<br>\r\n You are pressed into a small compartment, known as Lauren's gut, and the room is bigger than you'd think. You can feel the swinging if your prison as the predator patted on her body in pleasure. She let out a burp which shook the entire stomach, and you felt</span></div></div>",
            "created":1457845200,
            "id":2116685,
            "title":"She starts eating you feet first"
        },
        "13222":{
            "author_id":"ww10030",
            "author_name":"White Wing Writer",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before long, you pass out completely. Her body does the rest of the work, and before you know it, you are little more than a memory.</span></div></span></div>",
            "created":1505624400,
            "id":2386970,
            "title":"Yourself being digested"
        },
        "13223":{
            "author_id":"ww10030",
            "author_name":"White Wing Writer",
            "content":"<div class=\"\"><div> <span>All this serves to do is prolong your death. Your futile, weak struggles do nothing to her thick, padded belly. Eventually, you succumb to dehydration after days of being exposed to her harshly hot, cramped belly. You likely would have at least died less miserably had you been digested.</span></div></div>",
            "created":1505624400,
            "id":2386972,
            "title":"Nothing, you find out you can't be digested"
        },
        "133":{
            "choices":[
                "\"Sure, why not. I'll help you. I'll be round at 6\"",
                "\"Give me one good reason why I should help you?\"",
                "\"I can't tonight, but tomorrow I can. You'll have to redeem yourself though!\""
            ],
            "content":"<div class=\"\"><div> <span>You suddenly feel a large hand grab your ass. You turn around in utter shock to find Steve, the teacher kiss-ass. Despite his blonde hair, masculine figure, and charming attitude, he is someone that truely fools the human eye. He may have the looks, but this hardcore nerd if selfish, arogant, and has more greed than Kirsty the cheerleader. <br>\r\n\"What do ou think you're doing Steve?\" You shout in his face, sending several spitballs into his perfect-looking skin. <br>\r\n\"Oh my, who's feeling a bit....fiesty....today then, eh? Why, I belive it's little miss Jill. How's Jack? Fixed his crown yet? Hahahahahahahaha!\" You can't belicve how ridiculous his jokes were. You've heard some of his before, but never that cheesy! You close your locker and prepare to go home but Steve stops you in your tracks. <br>\r\n\"Look, Jill. I'm sorry about that, but I kinda need your help. You see, I've been failing in Biology lately, and I've noticed you're getting good grades. Would you mind coming round to my house, say this evening, and help me out? I really don't want to fail next weeks test!\"</span></div></div>",
            "created":1268715600,
            "id":852142,
            "title":"Steve, nerdy Junior, takes you to his home to h..."
        },
        "134":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Mr. Larson wants Mexican for dinner",
                "Ms.Mason wants to take you home and prepare you for dinner",
                "Its nothing,but she has to walk home passed some people lookin for a \"menu item\""
            ],
            "content":"<div class=\"\"><div> <span>(From OBusywriter: Read and follow the rules people. The rule is the maximum age for characters is 35. I changed Miss Mason's age from late forties to 34.)<br>\r\n<br>\r\n\tJill knew she should be careful in school.  Everyone could swallow her and all she could do to protect herself was to be vigilant.  The problem was, she was tasty looking.  She was a only 5 foot 3, but she had nice generous curves that were toned.  She wasn't busty, but she turned heads.  She had shoulder length raven black hair and beautiful dark tanned skin.  Her family was Mexican with some Puerto Rican mixed in.  She considered herself intelligent but also athletic.  However while beauty and brains were never a bad thing it made her a target for swallowers.  Who didn't want to eat a beautiful latina and feel her squirm in their stomach as their digestive acids dissolved her.<br>\r\n\t<br>\r\nStill she had made it halfway through the year and while there had been some close calls she had made it.  <br>\r\n\t<br>\r\nToday she wasn't going to be so lucky.<br>\r\n<br>\r\n\tShe felt a hand on her shoulder and she froze.  The school day was almost over.  She turned around and saw Mr. Larson.  He was her biology teacher.  He was tall and scrawny with nicely trimmed hair and a round face.  He was in his lower thirties.  He hadn't eaten anyone in her class that she knew of, however she had seen him look at her and lick his lips.<br>\r\n\t<br>\r\n“High Mr. Larson.”  Jill said looking up at the 6 foot 3 man.  <br>\r\n\t<br>\r\n“Hi Jill, how are you today?”  He asked pleasantly.<br>\r\n\t<br>\r\n“Good sir.”  She replied timidly.<br>\r\n\t<br>\r\n“I just wanted you to know that while your science fair project you turned in is good, it needs some adjustment.  Could you follow me to my classroom?”  He asked.<br>\r\n\t<br>\r\n\t'Um- o- okay sir.”  Jill said timidly.  Her greatest fear was getting swallowed and being digested alive.  She had nightmares of stomach acid falling all over her and coating her.  But she still followed Mr. Larson to the biology room.  By the time he was done going over her project all of the kids had been gone for a good hour.  It was only her and the teachers that remained.  <br>\r\n\t<br>\r\n\tShe sat down in a desk and waited for Mr. Larson to finish his discussion on the phone so she could use it to call her mom.  Until then she fiddled with her short gym shorts and tank top that she had been wearing after gym class at the end of the day.  Mr. Larson set down the phone and noticed someone walking in.  <br>\r\n<br>\r\n\tIt was Miss Mason.  She was probably a bombshell in her earlier days, but now she was thirty-four and had a good bit around the middle.  She had long blond hair and was always making jokes with the girls.  Jill had heard rumors before that she would eat a pretty girl once a semester, Jill didn't know if it was true or not.<br>\r\n<br>\r\n\tMr. Larson said hello as he got up and went over to talk to her.  She didn't her what they were saying, but she got nervous when they both chuckled and quickly glanced at her.  She gulped.<br>\r\n</span></div></div>",
            "created":1346043600,
            "id":1414980,
            "title":"A Tasty Mexican"
        },
        "1341":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "Ties you to a spit and places you over a fire",
                "Rubs different spices onto you",
                "Places you in a pan like you would a turkey"
            ],
            "content":"<div class=\"\"><div> <span>As Ms.Mason left you heard one sentence that she said, \"enjoying your Mexican meal,\" suddenly you stood up to run but Ms.Mason grabs you from behind and places a rag over your mouth. As you breath very heavily everything starts to go dark, it was a chloroform rag. As Ms.Mason laid you out Mr.Larson's desk Mr.Larson held a roll of duct tape to secure your hands and feet. \"You lucky son of a biscuit, I have always wanted to eat Jill, but there is no point in arguing now, the better predator got to her first.\" She said smiling, \"thank you for your help in securing her, if you want you could come over and watch the preparation of Ms.Bondad.\" Mr.Laron offered, \"hmm, I have papers to grade but I might drop by later to watch.\" <br>\r\n<br>\r\nShe leaves the room as Mr.Larson finishes taping your hands and feet and placing a piece over her mouth. He slings your over your his shoulder and takes you out to his car, the other predators watched with open jaws as you carried the Mexican beauty out of the school. He lays you out on the backseat and gets in the drivers seat. You wake up as he pulls in his driveway, unable to speak or move you just sit there, panicking a little. He takes you inside and sets you on the dining room table. He removes your clothes and leaves you in your bra and panties. What does he do next?</span></div></div>",
            "created":1464152400,
            "id":2154052,
            "title":"Mr. Larson wants Mexican for dinner"
        },
        "13413":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "Mr.Larson devours you whole",
                "Ms.Mason gets to you first"
            ],
            "content":"<div class=\"\"><div> <span>You lie there trying to think of ways out of this predicament, he had temporarily disappeared into the kitchen. You wiggle your hands hoping maybe you can slip your hands through the tape. After a minute of trying to get the tape off (to no avail) he reappears with a large pan. He opens a pantry door and pulls out a container of broth. You watch worriedly as he pours it into the pan, your only worry more as he comes over, picks you up and places you into the pan on your knees. <br>\r\n<br>\r\nHe sprinkles salt and pepper on you. He reaches over and unhooks your bra, he replaces it with an edible bra that looked like it was made of bacon. He does the same with your panties. Now you are sitting there, tied up, sitting in a pan of broth, and clad in bacon underwear, you have no idea what is wrong with the teacher you had grown to like. At the same time he had been developing a lust for your taste. <br>\r\n<br>\r\nHe carries the pan over to a giant oven, you started squirming trying to avoid going into the oven. <br>\r\n\"Don't worry about going into the oven, my dear Jill, you will not die, the oven will just heat up and add a lot of flavor to your already delicious Mexican flesh.\" Mr.Larson said. Without another word he opened the door and turned the heat up to 250, setting the cooking timer for 20 minutes.<br>\r\n<br>\r\nHe closed the door and sat back to watch the process, after a minute or two he left for a minute. When he returned Ms.Mason was there with him, she must have come over to watch the preparation. Finally after you felt like you were about to die of heat the door opens and Mr.Larson with the help of Ms.Mason lift the pan out of the oven. Setting you on the counter, you were finally ready to eat.</span></div></div>",
            "created":1464238800,
            "id":2154417,
            "title":"Places you in a pan like you would a turkey"
        },
        "1342":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "She goes straight to the preparation",
                "She decides to let Jill have one last request",
                "She decides to tickle torture Jill first"
            ],
            "content":"<div class=\"\"><div> <span>Mr. Larson and Ms. Mason continued to talk for a few moments.  Eventually Mr. Larson smiled and said, “okay Deborah, have Mexican tonight.”  With that he picked up his bags and walked out of the room.  Jill's heart skipped a beat.  Was Mr. Larson talking about her, when he said 'have mexican tonight', was Ms. Mason going to eat her.  She was petrified in her chair as Ms. Mason walked towards her.<br>\r\n<br>\r\n“Oh, hello Jill.”  She said with what sounded like mock surprise.  Jill was barely able to raise a hand to make a small 'waving' gesture.  Ms. Mason just put on a broad smile.<br>\r\n<br>\r\n“I didn't realize you were her so late.  Do you need a ride home?”  She asked tilting her head to the side.  Jill again, was barely able to move her head side to side to say no.<br>\r\n<br>\r\n“Are you sure?”  Ms. Mason asked again.  <br>\r\n<br>\r\n“Y- y- y- yes, Miss Mason.  I just have to call my madre.”  She said stuttering.  Ms Mason replied okay and walked towards the back closet and opened it.  Jill was to terrified to move to the phone, or even look behind her.  She was taken by total surprise when Ms. Mason came back towards her and shoved a cloth towel over her face.  Jill screamed as loud as she could but it barely made a muffle.  She stood up and tried to escape but Ms. Mason wrapped her arm around her waist and forced her onto the ground pinning her.  After a few seconds Jill fell into unconsciousness.  <br>\r\n<br>\r\nMs. Mason stood back up and looked down at her soon to be dinner.  Her short gym shorts let her see her smooth tasty theighs, and her shirt had rolled up a bit exposing part of her midsection, which was always considered the tastiest part of a girl.  She licked her lips and picked up Jill and with one motion put her up on her shoulder.  All her things were already in her car, all she had to do was carry Jill out and she was a good and gone.  Ms. Mason walked out of the front office and said bye to Mrs. Sandra who giggled at seeing Jill tossed onto Ms. Mason's shoulder.<br>\r\n<br>\r\n“You're eating the gorgeous latina girl?”  She said grinning.<br>\r\n<br>\r\n“Yep Sandy, sure am.  I'm sure she'll be quite the meal.”  She said giving Jill's but a little pop.<br>\r\n<br>\r\n“Shame, she was such a sweet girl.”  Mrs. Sandra said grinning.<br>\r\n<br>\r\n“Oh, I'm sure she'll be sweet and meaty.”  Ms. Mason said.  They laughed at her joke.  “And besides, I save my students- remains anyways.  You can come by and say hi if you ever want to.”  They both giggled as she walked out to her car and tossed Jill into the trunk.<br>\r\n<br>\r\n<br>\r\n<br>\r\nJill awoke many hours later and saw through a skylight that it was really dark out.<br>\r\n<br>\r\n“Oh good Miss. Bondad is awake.”  Jill heard.  She looked around as her vision came into view.  She shivered.  She was able to lift her head slightly and realize that she had been stripped to her  dark blue lingerie.  It was modest, but still didn't cover much besides her chest and ass.  She tried to lift up her arms but found that her wrists and ankles were cuffed to the hard wooden table that she laid upon.  Her knees and elbows where also strapped down in this way.  She tried to escape for one moment until she saw Ms. Mason walk over.<br>\r\n<br>\r\nShe shook from fear  as she saw Ms. Mason lick her lips and stand over her.  Tears started to stream from her face and she begged for Ms. Mason not to eat her.  Ms. Mason didn't speak, she just laid a hand down on her silky smooth, swarthy, toned midsection.  She looked Jill in the eyes and shook her head no.  Jill let out a scream until Ms. Mason calmly but forcibly gagged her with her hand.<br>\r\n<br>\r\n“Now miss Jill Bondad.”  She said running her hand over her extremely smooth and ticklish belly.  “I'm going to eat and digest you,”  she ignored Jill's audible but undecipherable cries, “the question is, how long until you feel my digestive juices on your beautiful belly.”</span></div></div>",
            "created":1346043600,
            "id":1415111,
            "title":"Kidnapped for Food"
        },
        "13423":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "She decides to soak her in basting juices ",
                "How about a Latina-on-a-spit"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nMs. Mason lifted her hand from Jill's mouth and smiled.  “But don't worry I'm going to have some fun first.”  She said smiling diabolically.  “You see I know you're ticklish,”  she said starting to slide her fingernails ever so gently across Jill's silk like belly and sides, “that boy that liked you, and you liked but never got the courage to ask out.  I know that he enjoyed sneaking up on you and tickling you.”  She said as her nails continued across Jill's midsection.  Jill started to whimper and squirm a bit as her captor and soon-to-be swallower made her nails graze a bit faster.<br>\r\n<br>\r\n“I don't understand why you didn't ask him out.”  Ms. Mason said puzzled.  “Him not asking you, I understand.  However you where considered one of the best looking girls in school.  What did the boys call you?  Bonita-Latina?”  She smiled.  “How about tasty latina?”  She said as Jill started to cry again.  “Now now, don't cry.  No point in it.  I mean its not that bad.  I mean yes digestion is extremely painful and can take up to four days for you to lose consciousness....  But besides that.”  This did nothing but make Jill's crying worse.  Ms. Mason sighed.<br>\r\n<br>\r\n“Oh well looks like I'm going to have to gag you after all.”  She said leaving the room.  She came back and shoved a small washcloth into Jill's mouth before paying over a half-a-dozen strips of duct tape over it.  She stood to the side of the table   “But you are to damn gorgeous to just eat and let that be it.  No I'm going to make you squirm first.”  <br>\r\n<br>\r\nWith that Ms.Mason lowered both of her hands and with her long fingernails she started to stroke Jill's belly.  Jill was ticklish to the tenth degree and she immediately started laughing to her gag.  Ms. Mason's nails went to the side of Jill's abdomen then up to her ribs.  Jill was a sight to see as she attempted to squirm away, yet she could barely move due to her ankles, knees, wrists and elbows being held down by metal cuffs.<br>\r\n<br>\r\nShe wasn't given a break as Ms. Mason's nails glided along her silky smooth belly.  He dark tan belly convulsed as she laughed harder that she had before.  After a few minuets the nails dug in deeper and she arched her back.  This did nothing but make it easier for Ms. Mason to tickle each of her ribs.  Jill had tears streaming down her face and she was exhausted, yet it had only begun.<br>\r\n<br>\r\nOnly thirty minuets had passed.  Ms. Mason bent over and blew a couple of raspberries into her stomach.  She then started to lick all across her belly.  She 'mmmmmmm'ed as she did this and after a view minuets she raised her head.  “My god Jill!  You may be the best tasting student I've ever eaten!”   This, along with the drool dripping onto her belly, did nothing to make her feel better.  But it did give her a much needed break to catch her breath.  While Ms.Mason licking her belly made her squirm and giggle, it was nearly as bad as having her nails gliding across her belly.  <br>\r\n<br>\r\nThe licking lasted for thirty minuets.  Ms.Mason occasionally would nibbled her belly and make a comment on her impending doom.  She bit really hard a couple of times and it stung, not that Ms. Mason noticed.  No she just kept licking for thirty minuets.  When she was done Jill's entire midsection was coated in wet saliva.  Ms. Mason smiled.<br>\r\n<br>\r\n“I'm not going to forget your belly.  It was wonderful to have my tongue glide across your smooth belly.  But I think you're also ticklish here.”  Ms. Mason said suddenly squeezing Jill's inner thighs.  This also made her laugh as she stroke her thighs for fifteen minuets before moving on.  She pulled back one of her cute pedicured feet.  “Blue toe nail polish.  Interesting.  Jill are your feet ticklish.”  Jill mumbled through her gag.  “What was that, I couldn't understand you- oh well I figure it out this way.”  She started to scratch the bottom of her sole making her cry out in lauughter.  After a few moments she started tickle the top and bottom of the sole.  A few minuets later she did the same to the other foot, then both at once.  Ms. Mason looked at her exhausted latin meal.<br>\r\n<br>\r\n“Its only been 3 hours.  I've got plenty left.  You didn't wake up til midnight, so now I'm tickling till sunrise.”  Jill groaned, it was winter.  She still had probably a good six hours of tickle torture left.  Ms. Mason actually sat on her hips and smiled.  “High bonita.  You're going to be so tasty, and feel so good as you digest in my stomach, desperately trying to escape the burning acids.”  She smiled evilly.  One hand went to tickle her toned thighs as another went back to her sexy midsection.  The next hour was hell as she ran out of tears and grew tired from bucking and squirming.  Ms. Mason leaned forward and started to tickle her armpits.  These were also ticklish and made her laugh as well.  Finally she got a five minuet break after 5 hours of hell.<br>\r\n<br>\r\nAfter those five minuets though Ms. Mason brought out a electric toothbrush, and with one hand put that into her round, deep naval while the other hand tickled her ribs and sides.  It was to much and she pulled against her restraints with all her might, yet they didn't move an inch.  She cried and became to tired to even move.  Finally Ms. Mason let up and started to stroke her inner thighs.<br>\r\n<br>\r\n“Such a sweet kind girl.  Sorry it has to end like this.”  Ms. Mason said, she almost sounded serious Jill thought.  “You've behaved pretty well so here's a treat.”  Ms. Mason said her hand moving up towards her dark blue panties.  For an half hour or so Jill had some pleasure as Ms. Mason made her buck with pleasure nice and easy.  Finally she let up.<br>\r\n<br>\r\n“One more round of tickling- okay?”  Jill just laid her head back against the hardwood table.  This round was by far the worst.  It started at her feet, where Ms. Mason used her long nails and the toothbrush to great effect.  Next she played with her sexy thighs and slapped them as much as she tickled them.  She temporarily skipped her midsection and moved to her neck and underarms where she spent a half and hour torturing her.  Finally she felt Ms. Mason's tongue gliding across her belly again, this time her fingernail accompanied her.  <br>\r\n<br>\r\nLicking, nails, and the toothbrush all ran across her belly.  She couldn't take it, her tanned swarthy skin had marks from her nails and was sore from the tickling.  She felt her sides being savaged by Ms. Mason's fingernails, as she licked her belly and used her chin to hold down the toothbrush in her navel.  She even used her toes to tickle her thighs and feet.  It was to much.  She felt the toothbrush be pushed down to the bottom of her navel, just as the was a large lick across her belly and she felt the strokes on her sides.<br>\r\n<br>\r\nIt was to much, she passed out.<br>\r\n<br>\r\nWhen she woke up, light was streaming though the skylight.  She was still sore from the tickle torture and knew that she would soon be dissolving agonizingly slowly in digestive juices.  She realized she had wetted herself the night before and hadn't been changed.  In fact she had been left exactly the way she fainted.  Still tied down on the table.  She started to shake as she saw Ms. Mason approach her.  <br>\r\n<br>\r\n“Well, well. Well.  Miss Bondad, you lasted six hours.  That's a record.  You should of seen yourself, you kept squirming and giggling even after you passed out.”  She smiled and started to lightly glide her nails over her belly, causing Jill to squirm again.  “But today I make you docile, tomorrow- I prepare you.  But how?</span></div></div>",
            "created":1346130000,
            "id":1415286,
            "title":"She decides to tickle torture Jill first"
        },
        "134231":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "She ties her out on the hot patio to dry in the blistering sun",
                "Puts on some spice rub and ties her to a spit over a fire for a little roasting"
            ],
            "content":"<div class=\"\"><div> <span>Jill was left alone for an hour or so as Ms. Mason went to set up everything.  She would occasionally come and tickle her for a few moments before she left to do something else.  She was hungry but was still gagged.  After an hour or so Ms. Mason came by and pulled off her gag.  She tried to lick her lips but found that her mouth was dry.  Ms. Mason told her to 'drink' and she had a rather large cup of water poured into her mouth.  She drank this quickly and was then regagged with a ball gag.  Considering her situation she didn't say that she was hungry if though she had some hunger pains.<br>\r\n<br>\r\nShe remained tied down for the rest of the day.  Ms. Mason came by one time and tickled her for a good two hours then licked her belly for another hour.  She gave her plenty of water but no food.  She wasn't untied to go to the bathroom and finally Jill couldn't hold any more and peed in her panties.  Ms. Mason came over and put a towel on the table below her bum.  She groaned in her gag from being sore and stroked her hair while she gave her more water.<br>\r\n<br>\r\nThat night she tickled her some more before letting her delicious meal sleep.  The gorgeous latina woke up the next morning feeling sore and hungry.  She didn't feel like she had that much strength and cried at her situation.  Ms. Mason walked over.<br>\r\n<br>\r\n“Sleep well?”  She asked smiling.  Jill shook her head; Ms. Mason shrugged.  She unsnapped the cuffs that held her down to the table.  She helped Jill sit up and Jill rubbed her sore wrists.  Ms. Mason grabbed her roughly and forced her to walk, basicly dragging her, to another room.  Her was a large six-foot by six-foot, clear plastic container.  <br>\r\n<br>\r\n“Why?”  Jill moaned, tired.  Ms. Mason rubbed her tummy in response.  She led Jill and forced her to lay down in the container.  There were four cuffs on the bottom and her ankles and wrists were strapped in.  Unlike the her last restraints she could actually move her wrists and ankles a few inches.  Not a lot but it was something.  She looked up and saw Ms. Mason leaning on the container.  <br>\r\n<br>\r\n“You see,”  she started, “this container will soon have a hose in it.  I'm going to fill up this container with flavorful juices to add some flavor to my tasty latina.  You'll lay there soaking for- I don't know, probably a day.  Then I'll empty the container and I'll dry you out.”  She said with that evil smile.  “But first.”  She bent down and picked up what looked like something from a scuba shop.  She stepped into the container and bent down and placed it on Jill's face.  It secured onto her face, covering her nose and mouth.<br>\r\n<br>\r\n“I want to eat and digest you alive Miss Bondad.”  Ms. Mason said smiling.  “Can't do that if you drown.”  With that she walked away and put in a thick four-inch wide hose.  Jill just closed her eyes as the liquid came out of it and fell onto her stomach.  It started as a ticklish trickle before turning into a downpour.  Within a few minuets the juice was around her breathing equipment.  After ten the container was mostly filled and Jill heard the hose stop running.<br>\r\n<br>\r\nShe didn't have much to do.  Unfortunately all she could do was think about the inevitable.  She was going to be eaten and digested slowly.  She knew digestion wasn't painless and she had her swallower smiling about it.  <br>\r\n<br>\r\nShe tried desperately to escape her restraints, but even though they allowed some flexibility they still held her tight.  She tried again and again but nothing gave.  Finally she added salty tears to the thick soup she was being soaked in.  She gave up and awaited her fate.  The only good thing was at least the juices felt like a bit of a massage.  Her sore and aching body would take anything it could get.  It was a thick soup she was in, her hair was plastered on the bottom of the container and she could practically feel her skin soaking up the extra flavor.<br>\r\n<br>\r\nIt went on and on.  She just laid there wondering where Ms. Mason was.  She remember that that horrible woman had set up a camera and was filming all of this.  She grew angry but knew there was nothing she could do.  Finally after a day of soaking she heard an noise and her tired and hungry mind realized that the juices were being drained.<br>\r\n<br>\r\nAfter a few minuets she opened her eyes and saw Miss Mason standing there.  She was smiling as she released her from her cuffs.  Jill had no strength to fight her or try to escape.  She was docile as her old teacher slapped old fashion hand cuffs on her and with surprising strength felt herself lifted up and out of the container.<br>\r\n<br>\r\n“Where to now.”  Ms. Mason muttered.</span></div></div>",
            "created":1346216400,
            "id":1416402,
            "title":"A long soak."
        },
        "1342311":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "Place her in a pan and put her in the hot oven for 15 minutes",
                "Devour her on the spot"
            ],
            "content":"<div class=\"\"><div> <span>\"I know just the place,\" Ms.Mason slung Jill over her shoulder, she walked out of the room. Jill couldn't see where Ms.Mason was going but she didn't think she would like it. Compared to being tickled all day and then soaking in juices all day what was next couldn't be too much worse. At least she would be out of the liquid filled box.<br>\r\n<br>\r\nMs.Mason walked out the back door onto the patio. It was a hot day, the end of school and the summer weather had come early. Ms.Mason set Jill down on the same table that she had been tickled and forced to lay on for two days straight. Now the table was sitting in the hot sun beating down on them. Ms.Mason ripped off Jill's bra and panties, securing her to the table as she had done before.<br>\r\n<br>\r\nMs.Mason disappeared into the house and then reappeared a second later, carrying spices. She sprinkled them all over Jill's body and rubbed them in. \"You know, Miss Bondad, it is very rare that I put this much effort into the preparation of a meal. Latinas like you are quite the catch, you should feel special, my delicious Mexican Princess.\" Jill just squealed because she hated every second of this.<br>\r\n<br>\r\n\"I'll let you sit here in the sun for 12 hours, then I'll have dried Latina. In six hour I will come to turn you over onto your back.\" Ms.Mason walked away to take care of other things. Jill did the only thing she could, laid there in blistering sun. She thought Ms.Mason couldn't do anything worse to her than the tickling and the soaking. This was worse, she would have gladly returned to the juice box to soak for another day rather than lay here for 12 hours. She had to poop so badly but she couldn't since she was laying on her backside. <br>\r\n<br>\r\nFinally after six hours, Ms.Mason came back and turned Jill onto her stomach. Jill had bad sunburns by now, to which Ms.Mason found it fitting to slap her torse several times which was incredibly painful for Jill. Finally after Jill was covered in major sunburns Ms.Mason took her back inside. What would she do with her now,</span></div></div>",
            "created":1464066000,
            "id":2153140,
            "title":"She ties her out on the hot patio to dry in the..."
        },
        "1342312":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Miss Mason eats Jill"
            ],
            "content":"<div class=\"\"><div> <span>Miss Mason carried Jill over to her kitchen and set her down on the counter.  She didn't even bother tying her down, by now she was to weak and tired.  Jill just moaned as Miss Mason came back with a box of spices.<br>\r\n<br>\r\n“This will help with your flavor.”  Ms. Mason said giving Jill's belly a little tickle.  Jill just groaned as Ms. Mason picked up some spices and put in on her belly.  She then slid her hands around her belly and made sure her midsection had a nice even spread.  This caused Jill to giggle.  Her arms, legs and head were likewise coated.  Ms. Mason then carried her into another room were she saw a spit right next to a large fire.<br>\r\n<br>\r\n“Oh, no, please no!”  Jill said begging to Miss Mason.<br>\r\n<br>\r\n“Come now Miss Bondad.”  Ms. Mason replied.  “You need to have a little heat added to you.”  She said smiling.  “Give you a nice brown coating- well actually you already have that, but this will help make everything blend.”  <br>\r\n<br>\r\n“Please!”  Jill cried pleadingly as her arms were attached out in front of her like a superman pose.  Her feet and knees were locked onto the spit as well.  Ms. Mason did went back around and locked in her elbows.  Now only clothed in her bra and panties, Jill hung from a spit with her waist hanging a bit below the rest of her secured body.<br>\r\n<br>\r\n“Just some final touches.”  Ms. Mason said as she pulled Jill's hair up and had her hair secured to the pole.  She then to a red apple and forced it into her mouth.  Jill grunted but the apple was wedged in there.  “Stay warm.”  Miss Mason said evily as she pushed Jill over the fire.<br>\r\n<br>\r\nThe heat was intense and she felt the heat wash over her sore body.  Her belly hung lower and was being burned by the heat.  She was forced to look forward but she could see the smoke rising up.  Her body was covered in basting juices, spices and her own sweat.  Some juices ran off and evaporated before it could even land in the blazing fire.  Jill moaned in pain as the heat washed over her body.  It felt as though she had been submerged in coals.<br>\r\n<br>\r\nThis went on for half an hour while Miss Mason -humming to herself- set up her table.  She put on a nice white table cloth and set up a glass of wine.  There was only one chair, at the end of the table.  Jill grunted as Miss Mason walked back over.<br>\r\n<br>\r\n“Cooking good I hope.”  She said smiling.  She then took the spit and started to rotate it clockwise slowly.  It gave Jill's front a short reprieve as Miss Mason let her back soak up some heat.  After a short while she turned her again for a few moments.  The room spun around Jill and she closed her eyes as she grew dizzy.  <br>\r\n<br>\r\n“You are a fine piece of meat Jill.”  Ms. Mason said poking Jill's side to see how she was cooking.  “Lets speed things up a bit.”  Ms. Mason then proceeded to lower the spit by about four or six inches.  She then left Jill face down over the roaring fire.  She felt the blistering fire cook her body.  She gasped into her apple as the fire momentarily rose up and a small flame danced along her belly.  This happened every few minuets or so and she gasped in pain each time.  Tears ran from her eyes and down her cheeks only to evaporate shortly after leaving her face.<br>\r\n<br>\r\nHer jaw ached but the only reprieve she got was when Ms. Mason raised the bar back up a couple of inches.  Her body was being cooked and while she had a swarthy latina skin tone, it had become an even more “well done” complexion.  Finally after a couple of hours Miss Mason came over and poked her in the belly a couple of times.<br>\r\n<br>\r\n“It seems your done cooking.  Nice and even.”  She said smiling.  She then pulled Jill over by the table and unhooked her.  She actually had some steam rising from her and her muscles ached.  Her hands and feet were tied with some edible string but they were really unneeded.  Her apple was taken out though.  It was the only good thing that happened to her.<br>\r\n<br>\r\n“Please.”  She said softly as Miss Mason sat in her chair a looked at Jill's feet.  She was about to take in her smooth and pedicured feet into her mouth when she looked right at Jill.<br>\r\n<br>\r\n“Miss Jill Bondad.  I know that a young, healthy, youthful and innocent young girl like you shouldn't go out this way.  But by now there is really no point in complaining.  I mean you're cooked, I might as well eat you instead of tasty food like you going to waste.”  Jill moaned.<br>\r\n<br>\r\n“Please I don't want to be digested alive.”  She pleaded.<br>\r\n<br>\r\n“There, there it will only take a couple of days.”  Miss Mason said patting Jill's leg.</span></div></div>",
            "created":1347598800,
            "id":1427352,
            "title":"Latina-on-a-Spit"
        },
        "13423121":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "To the Digestion"
            ],
            "content":"<div class=\"\"><div> <span>Jill whimper as Ms. Mason took in her cute little feet.  Ms. Mason “mmmmmmed” as she finally got a good taste of Jill's amazing flavor.  She licked Jill's ticklish arch as she took in her toes and eventually her heel.  Jill was a delicacy.  Jill tried to squirm away but her body was to tired and sore to move even an inch.  She could only watch as Ms. Mason licked  and mmmmmed up to her ankle.  Ms. Mason took in her tasty ankles and half slurped and half swallowed very slowly up to her tasty calves.  <br>\r\n<br>\r\nJill was nice and meaty, but had a salty and meaty taste.  Ms. Mason partially bit down and chewed Jill's skin a bit.  She didn't draw any blood but she bit down hard making Jill cry.  Ms. Mason when she wasn't biting down on her calves sucked all the delicious flavor (for which there was a lot) off of Jill's skin.  She took her time before moving on to Jill's meaty but very toned and fairly slim thighs.  <br>\r\n<br>\r\nJill tried begging as she felt Ms. Mason's tongue become like her jaws.  Very big.  This was another effect of voring someone.  Her tongue became a foot-and-a-half long and four inches wide.  It wrapped around her thighs, tasting her delectable meat as she felt warm, sticky saliva coat her still steaming legs.  Ms. Mason was in ecstasy as she ate probably the tastiest girl she had ever eaten.  She took her time as she neared her upper thighs.  Jill felt Ms. Mason's wet and thick lips wrapping themselves around her sexy legs like a snake eating a mere rodent.  All she could do was watch.<br>\r\n<br>\r\nFinally Ms. Mason moved on to her ass.  Biting down on her cheeks, her hips, cheeks and panties were all swallowed up by Ms. Mason as she continued to feast of her Latina delicacy.  Her but wasn't the largest in the world but it was very shapely and curvy.  But like the rest of Jill, it too would soon be turned into nutrients for Ms. Mason's body. <br>\r\n<br>\r\nFinally Ms. Mason moved onto her favorite part.  Swallowing slowly she took in the bottom of Jill's midsection.  She wrapped her tongue around her smooth and soft (though cooked) belly.  She let out a loud “mmmmmmmmmmmmmm!” as Jill tried her best to gain some control over her limbs.  Moving slowly Ms. Mason took in Jill's belly and coated her entire belly in saliva.  She tasted her entire belly and put her tongue in Jill's navel, this and the rest of the licking made Jill involuntarily giggle.  Ms. Mason bit down hard on Jill's midriff, causing her body to arch which only increased the pain.  Ms. Mason continued during this time to suck on her delicious tummy.<br>\r\n<br>\r\nLicking back and forth she spent almost an hour on Jill's still warm and delectable stomach.  Ms. Mason ran her teeth along Jill's belly, collecting all the salt and spices before sucking on her belly once again.  Finally with some sadness Ms. Mason swallowed again and started to lick and taste Jill's ribs.  She used her teeth to dig in and find the contours of each and every one of Jill's ribs.  She licked in between them and wrapped her tongue completely around her sexy waist.  Finally after a good half hour she swallowed again and took in Jill's good sized- but far from huge- breasts.<br>\r\n<br>\r\n“Please, nonononononononono.”  Jill said almost hysterically, shaking her head.  “Please Miss Mason- nooo.”  She said almost whispering as she felt Ms. Mason's lips suck onto her neck.  Soon her chin was taken in my those same lips as Jill laid her hair back and looked up to the ceiling.  Silently she awaited her fate.  Finally she felt Miss Mason lick her tasty and very salty face and the world became dark -though she could see a bit- as Miss Mason took in the rest of her head.  <br>\r\n<br>\r\nJill cried silently as Ms. Mason slurped up her hair and arms as though they were just spaghetti.  At the end she played with Jill's fingers before one-by-one she pushed them down into her mouth and with one last giant gulp she sent her young, poor innocent latina meal down into her awaiting stomach.  Jill was no longer a sweet, good looking girl.  Instead she had become a simple piece of meat, and like meat she was now going to be digested.  She had been devoured.<br>\r\n<br>\r\n“Misses Bondad you were BY FAR the best meal I have ever had!”  Miss Mason said finally able to speak.  “And I can not wait for to feel you try to squirm in my stomach.  You'll get to know my acids soon enough.  Have a good burning bath Jill, I'll see what's left of you in a few days.”  She then let out a loud cackle as she took a glass of wine and downed it.  She wobbled her way over to a couch with a now really large stomach that was now the final resting place for a beautiful young latina.<br>\r\n<br>\r\nMeanwhile inside of Miss Mason's stomach Jill was forced into a bit of a hogtie.  Her belly and front was forced into the wall of Ms. Mason's stomach and were already being heavily coated in acids.  She was bent at the knees with her lower legs being forced behind her.  Her tight prison pinned her arms behind her back and forced her chest and stomach forward.  It was very uncomfotable.  Then she felt an excruciating burning.</span></div></div>",
            "created":1347858000,
            "id":1430050,
            "title":"Jill is devoured "
        },
        "134231211":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Jill wakes up in her bed early the next morning",
                "Poor Jill ends her trip by coming out of Miss Mason's other end"
            ],
            "content":"<div class=\"\"><div> <span>Jill cried out in agony as she felt a burning on her entire body.  The burning was espcially excrutiating on her front.  Her midsection was forced to rubbed against the stomach wall which felt to her like it was being rubbed against white-hot sandpaper.  He yelled as she felt the acids coating her body.  She struggled and tried to escape but the stomach walls pressed against her to tight and she couldn't move enough to try to escape.  <br>\r\n<br>\r\nShe cried as a new wave of hopelessness and pain washed over her.  It was fairly dark but enough light penetrated Ms. Mason's stomach were a faint red-orange glow illuminated her digestive chamber.  She could see some of her skin and realized that she was being slowly dissolved.  She knew about digestion but now that she was experiencing it-.  <br>\r\n<br>\r\n“Please!”  She cried out in desperation.  Ms. Mason just chuckled and patted her belly.  <br>\r\n<br>\r\n“Now, now Jill just keep digesting.”  She let out another chuckle as Jill gasped in pain as more digestive juices coated her body.  She coughed and gagged as a bit of the digestive acids got into her mouth and burned her throat.<br>\r\n<br>\r\n“Ahhh, pleees!”  She screamed.  Meanwhile her thighs were being marinaded in burning acids as well and Jill's navel was filled with acid.  Her hair was slick with acids and her entire body was on fire.  “NO!”  She yelled trying to escape again.  Unfortunately for her her struggles only increased the intensity of the acids.  It continued unabated for hours.  Jill couldn't fall asleep with the pain so intense and she cried.  She could barely move her fingers due to the digestion, the tips of them had gone mercifully numb.  Her back felt as though it was put against a blow torch and her belly-.  Her belly felt as though someone was rubbing sandpaper against her stomach while laying a glowing white-hot piece of metal against her stomach.<br>\r\n<br>\r\nMeanwhile Ms. Mason rested and enjoyed the squirms and cries of her meal as she sipped a bit of wine and read a book.  Miss Bondad's digestion was going well and Miss Mason was in ectasay.  She patted her stomach and closed her eye, enjoying a message that Jill's struggles were giving her.  Meanwhile the gurgles of her stomach made her feel better and humans that could Vore had faint taste buds in their stomach, meaning even now she could taste her succulent meal.<br>\r\n<br>\r\nAfter twelve hours of digestion Jill knew all hope was loss.  She was cramped and the burning had gotten worse, not better.  The air was stale, hot and smelly.  Acid ran down her back and coated her stomach.  She cried.  She was barely 16, she was a innocent, smart young girl that had never done anything bad.  Why did Miss Mason decide to eat her.  She didn't have many tears and coughed again as more acid got in her mouth.  <br>\r\n<br>\r\nIt felt as though the top layer of skin from her belly had been dissolved, and her legs were starting to dissolve as well now.  She missed her family, friends and the boy she wanted to go out with.  Now she knew the only remains of her would be flushed to the sewers.  Or kept as smelly mementos of her demise.  She spasm from the pain and realized most of the skin was gone from her fingers, and at the tips the bone was now being dissolved.<br>\r\n<br>\r\nShe sighed as she finally realized that her entire body was going to be turned into nutrients for her devourer.  Her flesh and muscle was all going to be dissolved and turned into protein and enzymes.  She moaned as waves of pain again washed over her.  It was unending.  <br>\r\n<br>\r\nThere was no sleep for her that night as her body was soaked in juices.  It was hell.  The skin of her midsection had been dissolved and and now her abdomen muscle was being soaked in acids and her muscle was becoming proteins.  She cried in agony and her chest had acid run down it and she felt the skin on her thighs be completely dissolved.  Her face was also burning and acid filtered down her hair and burned her scalp.  The poor latina had another spasm as she got a mouthful of acid and could barely breath.<br>\r\n<br>\r\nWhen she got her breath back her stomach was on fire on the inside as well on the outside.  Over the course of the day she struggled to try to find a ray of hope, but found none.  Half way through the second day inside the agonizing stomach she much of her skin had been dissolved and the muscle and tissue on her arms, cheeks, midsection, legs and arms were being dissolved.  The bones on her hands and feet were being slowly dissolved.  <br>\r\n<br>\r\nMiss Mason wobbled to her bed and decided to enjoy her day off digesting the young latina meal and watching t.v.  “Enjoying the digestion?”  She asked Jill while she patting her stomach.<br>\r\n<br>\r\n“Please!”  Jill screamed.  “Please!”  Ms. Mason let out a cackle as a response.  Jill's entire body was submerged in a white-hot fire.  Once her skin was dissolved her muscle was dissolved quicker.  Her abdomen was being dissolved and her shoulder bones were being slowly revealed.  Her scalp was burning.  Her body was cramped even though her dissolving skin actually gave her some room to move.  She tried to get out of her vertical hogtie put was overpowered by a spike of pain.  She let out a long cry.  The pain just kept getting worse and worse.  <br>\r\n<br>\r\nAnother night past without sleep and she felt herself slipping into darkness, but the burning acids kept her from that mercy.  Her abdomen had been mostly dissolved.  Jill was able to finally get out of the cramped hogtie but it was a moot point by now.<br>\r\n<br>\r\n“How did you sleep?”  Miss Mason asked evilly.  Jill moved what remained of her hands and realized just how much of her body and been turned into a nutritious soup.<br>\r\n<br>\r\n“Oh my god I can feel my ribs!  Please Miss Mason, please!  Mercy!”  She yelled.  Miss Mason just rubbed her belly again.  <br>\r\n<br>\r\n“Soon Jill, soon.”  <br>\r\n<br>\r\nJill found it hard to breath.  Her skin had been dissolved along with much of her muscle.  She wanted to fall into a sleep.  She felt the stomach churn her body.  She knew her destiny was to be a piece of meat.  A mexican dinner for one of her teachers.  Her young, good-looking body was digested into nutrients for Miss Mason.  She felt the pain climax as her abdomen was completely dissolved.  Then she mercifully lost consciousness. </span></div></div>",
            "created":1350104400,
            "id":1446314,
            "title":"The Digestion of Jill Bondad"
        },
        "1342312111":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Jill goes to school and confronts Miss Mason",
                "Jill goes and asks the shy Austin out on a date"
            ],
            "content":"<div class=\"\"><div> <span>Jill gasped  as her eyes snapped open.  There was no pain, she wasn't cramped.  Was she in heaven?  She looked around, it was very dark with a small light illuminating the room she laid in.  She realized she was naked and felt a thin sheet laying across and silhouetting her body.  She looked up and saw the light illuminate a poster.  She gasped as she recognized the poster.  She got up and turned on the light.  She was in her bedroom.  It was dark out.  She looked down on her naked body and caressed herself.  Her flesh was all there, silky smooth and not burning.<br>\r\n<br>\r\nShe had heard rumors that some people could survive digestion.  That they woke back up in there beds after their bodies were digested.  Was she one of these people?  She had to be.  She knew it wasn't a bad dream.  She had been cooked and digested.  She shivered and covered her face as she remembered the agonizing burning as her body was slowly dissolved.   <br>\r\n<br>\r\nShe put on a pair of bra and panties and a  night gown and walked into the living room and turned on all the lights.  She had to choke back tears as she realized she had survived.  She opened her parents room and gently woke them up.  Her mother's eyes blinked open a couple of times, then snapped open as she bolted up in bed.<br>\r\n<br>\r\n“Jill!”  She yelled, waking up her father.  Jill couldn't reply, she just started to cry and hugged her mom and dad.  Over the next hour she explained what had happened to her and her parents listened.<br>\r\n<br>\r\n“Once ironic is that if I remember correctly I have school tomorrow.”  Jill said with a weak smile.<br>\r\n<br>\r\n“You don't have to go to school tomorrow if you don't want to Jill.”  Her father said patting her shoulder.<br>\r\n<br>\r\n“Though I bet you want to see Miss Mason's face when she sees you, don't you.”  Her mother said.  Jill smiled realizing that she actually had options now.  She also wanted to see Austin.</span></div></div>",
            "created":1350190800,
            "id":1446349,
            "title":"Alive!"
        },
        "13423121111":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Miss Mason turns the tables on Jill",
                "Miss Mason Flees the Classroom"
            ],
            "content":"<div class=\"\"><div> <span>Jill went to school the next day.  She got a couple of looks from people, apparently her horrible fate had become public knowledge by now.  Jill still shivered as she remember her body being cooked, devoured and digested, still she knew she needed to confront Ms.Mason.  She go distracted however on her way to Ms.Mason's class as she saw Austin close his locker.  She had a feeling he had a crush on her and she did like him.  He turned towards her and his eyes widened when he saw her.<br>\r\n<br>\r\n“Jill!?”  He said his eyes wide.  “Rumor had it you got vored by one of the teachers.”<br>\r\n<br>\r\n“Interesting.”  Jill said with a smile.  She got on the tips of her toes and gave him a kiss on his cheek, he froze and started blushing as Jill just smiled.  “Come talk to me after class okay.”  She said as the bell rung.  Austin just stood there blushing and nodded.  Jill walked off and took a deep breath.  Secretly she was terrified of confronting Miss Mason, but she needed to in order to move on, that's what she told her parents.  <br>\r\n<br>\r\nShe went to the bathroom and used the restroom and tried to control herself.  After taking a deep breath she headed out to Ms.Mason's room.  She heard the cruel woman's voice inside the room teaching.  Taking a deep breath she opened the door.  Miss Mason turned from the board and dropped her writing utensil.  Her eyes became wide.<br>\r\n<br>\r\n“Jill, but you're- I diges-”<br>\r\n<br>\r\n“I got better.”</span></div></div>",
            "created":1377320400,
            "id":1650926,
            "title":"I got better"
        },
        "134231211111":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Jill cries to Austin",
                "Jill cries to her Parents"
            ],
            "content":"<div class=\"\"><div> <span>There was an awkward pause as Miss Mason just stared at the gorgeous 16 year old latina.  Jill stood her ground while Miss Mason had a sly grin across her face.<br>\r\n<br>\r\n“Class will you all head outside to the garden.”  Miss Mason said with a smile.  Her rather small class hurried left, not wanting to become her next meal.  “Well Jill it seems like you're a reformer.  I mean I have your remains back in a tub in my closet back home.”<br>\r\n<br>\r\n“You're digusting.”  Jill muttered grimacing.<br>\r\n<br>\r\n“You were delicious beyond all reason.”  Miss Mason said taking a few steps towards Jill.  Jill took a few steps back almost stumbling.  Miss Mason smiled as she realized Jill was terrified of her.  “I have something you need to see.”  The teacher said as she went back to the back closet and unlocked it.  Jill walked towards it but stayed back as Miss Mason opened the door and turned on the light.  She gasped as she saw Jesse tied and gagged to a pole.  <br>\r\n<br>\r\nJessica, or Jesse, was a good friend of hers.  She was almost full blooded Puerto Rican and at 16 years old she a a flawless body.  She was tied tightly and gagged.  Tearmarks ran down her eyes as she was no doubt terrified of the fate that awaited her.  <br>\r\n<br>\r\n“Jesse...”  Jill muttered.<br>\r\n<br>\r\n“Shes been in her for a couple of days, haven't had a chance to transport her back home, her family has to much weight with the police department.  I usually only eat a couple of girls every year but having you inspired me to get one of you for a slave.  I'm going to keep her for a couple of months and then devour her and enjoys her cries as she digests.”  Miss Mason was nearly drooling as she ran her hands down Jesse's perfect midsection.  Jesse started to cry again.<br>\r\n<br>\r\n“Don't!”  Jill yelled stomping her foot.<br>\r\n<br>\r\n“I propose an exchange.”  Miss Mason said smiling and turning.<br>\r\n<br>\r\n“Exchange?”  Jill said.<br>\r\n<br>\r\n“You see the reason why I don't eat all the girls in the school every year is that the school needs children to function, if I eat to many they'll have no choice to fire me, seeing as parents will just decide to homeschool their children.  But you here are an inextinguishable supply of delicious and sexy meat.”<br>\r\n<br>\r\nJill gulped.  “You think I'm going to let you devour me again.”<br>\r\n<br>\r\n“Jill, Jill.  You reform after being digested.  Your best friend Jessica her- well what you think the odds are I eat two reformers in a row?  You have a trait that is found in only 1 out of every 50 people.  Will you really doom your friend to a horrible and excruciating death sentence just to spare yourself some pain?”  Jill gulped again.<br>\r\n<br>\r\n“You want me to submit as food.”<br>\r\n<br>\r\n“Yes.”  Miss Mason replied.  “And not just once, you will be my slave.  When I call you come.  When I want to eat you, you strip and dissolve excruciatingly in my belly.  I'll probably talk to your parents and explain why you need to move in with me.”<br>\r\n<br>\r\n“Please-”  Jill whispered.<br>\r\n<br>\r\n“Or I can call you over when I uh- get rid of Jessica's remains.”  She said looking at the crying Puerto Rican girl over her shoulder.<br>\r\n<br>\r\n“What if I don't reform again?”  Jill asked.<br>\r\n<br>\r\n“Reformers are reformers I assure you.  And for once you can trust me unconditionally I'm not lying.  Truly this is a huge boon for me.  You were possibly the best girl I've ever had, and I can eat and digest you again, and again, and again, and again, and again, and again.”<br>\r\n<br>\r\nJill felt tears in her eyes as she started to shuffle on her feet.  “Can you make digestion painless.”  Jill said, begging by now.<br>\r\n<br>\r\n“You will be digested and be in excruciating pain the entire time.  And I'm going to enjoy it.”  She turned and closed and locked the closet door on the whimpering Jessica and walked towards the other latina.  “I'm going to take Jessica home tonight.  I promise I won't eat her.  I'll bring her back in two days, I expect you here in class.”<br>\r\n<br>\r\n“In class?”  Jill asked softly.<br>\r\n<br>\r\n“You represent a  meal rebelling against their master.  Thats what reformers do.  I need to show your classmates who is in charge.  If it makes you feel better you wont be cooked this time.  You will strip and be devoured by me.  The next couple of days the class will be able to see your struggles and hear your cries and moans as you digest.  I think that will make the message clear don't you.”<br>\r\n<br>\r\nJill didn't say or do anything.<br>\r\n<br>\r\n“Don't you!”  Miss Mason said angrily.  Jill quickly nodded.  “Good its a deal.”  Miss Mason said licking her lips and patting Jill's shoulder.  <br>\r\n<br>\r\n“Miss Mason?”  Jill asked.<br>\r\n<br>\r\n“You mean master?”  Miss Mason said turning around.<br>\r\n<br>\r\n“Forgive me master.”  Jill whispered submissively.  “What of Jessica.”<br>\r\n<br>\r\n“She'll be in class that day.  As long as you're in my belly she'll be safe, just don't try anything, clear.”<br>\r\n<br>\r\n“Yes master.”  Jill said sadly.  </span></div></div>",
            "created":1377320400,
            "id":1650928,
            "title":"The Exchange"
        },
        "1342312111111":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Head First",
                "Feet First"
            ],
            "content":"<div class=\"\"><div> <span>Jill cried to Austin after her discussion with Ms.Mason.  He held her outside the school at the end of the day.  <br>\r\n<br>\r\n“We'll figure something out Jill.”  He said holding the sobbing Latina.  <br>\r\n<br>\r\n“I'm going to have to do it you know.  You're friends with Jesse.  If she gets devoured she dies, if Ms. Mason eats me I'll reform.”<br>\r\n<br>\r\n“Perhaps I should talk with her.”  Austin replied trying to console Jill.<br>\r\n<br>\r\n“No don't!”  Jill said looking up.  “I don't want her to realize she can use you as leverage.”  Jill said pushing her head into Austin's  chest.  Austin just kissed the top of her head.  <br>\r\n<br>\r\n“I'll be here for you.”  Austin said.<br>\r\n<br>\r\n“I'll be fine.”  Jill said pulling back and wiping away tears.<br>\r\n<br>\r\n<br>\r\n<br>\r\nTwo days later Jill walked into Miss Mason's class.  Her parents were not happy about the situation but there was nothing they could do about it and they knew they couldn't just let Jesse die.  Jill took a deep breath as she walked into the classroom and saw Miss Mason smile as she cam in.  She saw Austin in the class give her a thumbs up.  Finally she saw Jess sitting on Miss Mason's desk.  She was shaking and was obviously happy to be wearing clothes after being held captive in her panties for the last 5 days.  <br>\r\n<br>\r\nMiss Mason tapped on Jesse's shoulder.  “You can go home now.”  She said, Jesse jumped up and nearly ran out of the class towards the front office where he mother had been called to pick her up.  She did however stop and give Jill a bear head on her way out.  “Thank you Jill, than you.”<br>\r\n<br>\r\n“Its okay Jesse.  Go home and rest okay, Ill be back in a few days.”  She smiled and looked at Jesse.  Jesse nodded and ran out of the room.  <br>\r\n<br>\r\nJill gulped and walked into the room.  Ms.Mason smiled and motioned for her to come towards her desk.  “Class over the next few days we are going to go over the human digestion system.  Jill here has graciously allowed me to demonstrate on her a swallowers digestive abilities.  We will probably be able to hear her- uh- moans for the next few days.”<br>\r\n<br>\r\nJill reached the desk and started to shake from fear as Ms.Mason continued to speak.  <br>\r\n<br>\r\n“Now we shall get started.  “Ms.Bondad could you strip please.”  Jill gulped but nodded as she reached down to pull off her shirt.  Ms Mason's mouth watered as she once again saw Jill's midsection.  So smooth, toned and sexy.  It was delicious.  Austin felt his breath quicken as his mouth watered and he admired Jill's body.  His mouth almost dropped as she stripped off her jeans, revealing her sexy athletic thighs and calves.<br>\r\n<br>\r\n“Now, should I eat you feet first or head first?</span></div></div>",
            "created":1377838800,
            "id":1654589,
            "title":"The Sacrifice"
        },
        "13423121111111":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Follow Digestion from Jill's Prospective",
                "Follow Jill being digested from Austin's prospective"
            ],
            "content":"<div class=\"\"><div> <span>Miss Mason looked at Jill stripped to her bra and panties and felt her mouth water.  “Now Jill please lay down on the table here.”  Jill nodded submissively and laid down onto her cold metal desk.  “I'll need a helper.”  She said to herself.  “Ummm Austin, please come up here and help me with her.”  She pointed at Austin who stared at her for a second before coming up to the front of the class.  He looked at Jill and her amazing body and felt his cheeks become red.<br>\r\n<br>\r\n“Now class, I am going to show you what Jill is- food, a piece of meat for us with power.”  She took Jill hands and stuck them in her mouth as Jill just closed her eyes.  Miss Mason 'mmmmmed' at tasting Jill's luscious brown skin again.  She stuck her wrists into her mouth followed by the top of her arms.  Jill felt saliva run down her arms but remained silent.  Miss Mason talked to Austin with a mouthful of Jill.<br>\r\n<br>\r\n“Dear Austin- can you help me tenderized- Jill's belly for me?”  She said taking another gulp sending Jill up to her elbows into her maw.  Austin raised an eyebrow at his teacher.  “Slap her belly, hard.”  Austin looked down at Jill who nodded.  He took his hand and slap Jill's belly with a smack.  Jill flinched and Miss Mason smiled as Austin's slap left a stinging red area of Jill's soft, silky midsection.  “Again.”  Austin nodded and over the next few minuets he tenderized Jill's midsection with dozens upon dozens of slaps to her belly.  Jill grunted in pain and felt her eyes watering but motioned for Austin to continue.<br>\r\n<br>\r\nFinally Miss Mason mumbled for Austin to stop, by now Jill's entire brown midsection was red and stinging.  Miss Mason had finished Jill's arms and was at the top of her heads.  Mumbling with a mouthful and throatful of Jill she talked to Austin.<br>\r\n<br>\r\n“Go ahead and enjoy yourself Austin.  Jill is very ticklish on her belly, have some fun.”  Austin blushed as he looked down at Jill.  She was at his mercy as she was slowly consumed by Miss Mason.  Her belly had been made even softer by his slapping at it was very sensitive on top of being very smooth and yet toned.  Jill looked at Austin.  <br>\r\n<br>\r\n“Go ahead Austin, have some fun, I'm in no position to defend myself.”  She said seductively, rolling side to side as she felt her hair starting to be soaked in Miss Mason's saliva.  Austin nervously placed his hands on Jill's belly and slowly ran his fingers around her tummy, it felt silky smooth, so soft.  Jill immediately grinned and started to giggled.  His fingers started to dance along her midsection as Jill burst out in hysterics and she rolled her sexy body back and forth on the desk.  <br>\r\n<br>\r\nAustin continued his attack by putting a finger in her navel while digger savagely into her midriff.  Jill laughed and arced her back.  Her brown mexican body was covered in sweat as Miss Mason moved and swallowed her head, sealing her lips around Jill's neck.  Jill's laughter was still audible for ten more minuets as Austin tickle tortured her and Miss Mason took in her bra.  <br>\r\n<br>\r\nAustin stopped tickling her as Miss Mason reached her midriff.  She stopped and tickled Jill for a few minuets, she kicked her legs until Austin was told to hold them down, afterwhich Jill could only struggle in a futile series of twitches.  Finally Miss Mason stopped and flipped the sexy latina on her belly.  Miss Mason's tongue became large as she licked up and down her belly collecting salt and savoring the tastiest part of Jill's body.  <br>\r\n<br>\r\nThe class was captivated by the feasting and they especially enjoyed the fact that Miss Mason had stripped Jill.  Now they enjoyed her squirms as her sexy midriff was licked and savored.  Ms.Mason would occasionally sink her teeth in and chew on Jill's soft tummy- hard.  This caused Jill to suddenly kick her legs in a spaz of pain.  Finally after an hour of class Miss Mason was finishing up Jill's midsection.  <br>\r\n<br>\r\nShe signaled to Austin and made motions representing someone slapping a girls butt.  Austin's eyes became wide but with a a powerful finger pointing her nodded and started to slap Jill's ass.  Jill kicked her legs as her hands got close her the stomach of Miss Mason, she was terrified of the pain that awaited her in digestion.  She was cramped in Miss Mason's throat but hoped Austin was enjoying himself- the class surely was.<br>\r\n<br>\r\nFinally after ten minuets Ms.Mason waved Austin off and took in Jill's panty-clad ass.  She then slapped and tickled Jill's thighs as she savored her athletic legs.  She slowly sucked in Jill's legs until only Jill's feet remained.  She carefully lifted herself up revealing a bulge in her throat as she played with Jill's ticklish feet.  The bulge suddenly started to bounce around.  Then with finality she took in her soft feet and swallowed hard.  <br>\r\n<br>\r\nThe bulge was sent to her stomach.  <br>\r\n<br>\r\nJill felt herself forced into an uncomfortable 'U' with her head and feet up with her midsection pushed down into the bottom of the stomach where there was a swallow pool of stinging stomach acids.<br>\r\n<br>\r\n“Now class.”  Miss Mason said wiping drool off her mouth.  “You can probably see a silhouette of Jill her.”  She lifted her shirt revealing a layer of fat and a almost skin tight silhouette of Jill, complete with being able to see her navel and hair.  “Now over the next few days we will watch her and examine her digestion and pain.  As of right now she is probably being coated in a layer of stomach acids.  Give it a few minuets and the pain will become extremely intense, and soon be unbearably painful.  <br>\r\n<br>\r\nWith the the silhouette started to pushed around a few inches in her captors tight belly.  Whimpers could be heard as Jill tried to keep her captor from being pleasured by her cried, but she failed and was soon crying in pain and was pushing as hard as she could against the stomach walls.<br>\r\n<br>\r\nThis is going to be a very fun lesson class.</span></div></div>",
            "created":1377838800,
            "id":1654648,
            "title":"Devouring Jill (Again)"
        },
        "134231211111112":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Jill Reforms in Austin's house",
                "Jill Refroms in Ms.Mason's house"
            ],
            "content":"<div class=\"\"><div> <span>Austin watched as Jill's silhouette started to squirm as the digestion became more painful.  He was able to start hearing her moans after a few minuets.  <br>\r\n<br>\r\n“Now class it is unfortunately time to go for today, but by this time tomorrow the digestion will be even more painful for her.  Soon Jill's begging will be audible even to you.  Have fun class.”  The bell then rang.  The class went by one by one and looked at the skin tight silhouette.  Miss Mason looked at Austin intently as he stared at Jill.  He could see her squirm and moan.<br>\r\n<br>\r\n“Isn't is great.”  Miss Mason said beaming.  “Agonizing for her of course, but there is no better meal for people who have the power.”  Austin heard a cry from Jill as her belly was soaked and messaged with stomach acids.  <br>\r\n<br>\r\n“See you two tomorrow.”  Austin said before leaving.  He was the first in class the next day and was greeted with a desperate moan.  <br>\r\n<br>\r\n“Oh high Austin.  Don't mind Jill she's just digesting.”<br>\r\n<br>\r\n“Please mercy!”  She cried audibly from Miss Mason's churning stomach.<br>\r\n<br>\r\n“Now, now Jill just keep digesting.”<br>\r\n<br>\r\n“Oh god please, it hurts to bad.”  <br>\r\n<br>\r\n“And I'm enjoying every second.”  Miss Mason replied rubbing her stomach.  “Come look Austin.”  She said revealing her stomach.  Jill could still be seen though if a bit smaller.  Finally the class came in and Miss Mason explain what was happening to Jill (Jill frequently made her presence known thorough begging and moans) about how her skin was slowly being dissolved.  What part of her body was giving her protiens and enzymes.  How people with the power had the right to do whatever they pleased to those without.<br>\r\n<br>\r\nOn the third day there was a lot more moaning from Jill.  Miss Mason explain how most of her skin had been dissolved and how some of her muscle had been dissolved as well.  Austin heard a faint “please” halfway through class- but honestly, he was enjoying it almost as much as Miss Mason.  <br>\r\n<br>\r\nFinally on the fourth day the silhouette had shrunk noticeably and there was constant incoherent moaning from Jill.  They left for the day but as he was leaving Miss Mason called to Austin.<br>\r\n<br>\r\n“Austin can you come here for a minuet.”<br>\r\n<br>\r\n“Sure Ms. Mason.”  He replied.  He walked over as Miss Mason listened to Jill's moans for a minuet.<br>\r\n<br>\r\nJill will probably not be- responsive tomorrow.  Could you stay after class at the end of the week.<br>\r\n<br>\r\n“Okay Miss Mason.”<br>\r\n<br>\r\nShe was right.  Jill had finally fallen into that deep slumber, only to be awaken by reformation after he body was completely digested.  You could hear Miss Mason's stomach churn Jill's hot captive body.  Towards the end of the week there was no silhouette.  Instead there was just a bump the size of a beach ball.  The next day there was no bump, if maybe a bit more fat.  Miss Mason explained this.  And Austin did stay after class.<br>\r\n<br>\r\n“Austin dead boy I have something to show you.”<br>\r\n<br>\r\n“Yes?”  Austin replied.  Miss Mason responded by place a large jar on the table and sliding it towards Austin.  It was filled with-<br>\r\n<br>\r\n“Ugh is that what I think it is.”  Austin said looking at the jar.<br>\r\n<br>\r\n“Yes that is Jill's remains that I got rid of last night.  You can have it.”<br>\r\n<br>\r\n“No thanks.”  Austin replied.<br>\r\n<br>\r\n“I insist.”  Miss Mason said picking up the jar and putting it into his hands.  It was still warm, and heavy, he could see the remnants of Jill's bra and panties in there.  “We must stick together.”<br>\r\n<br>\r\n“We?”  Austin asked.<br>\r\n<br>\r\n“Swallowers.”  Austin opened his mouth to speak but Ms. Mason cut him off.  “We look for developing swallowers.  You think we don't know of that incident last year.  You may feel some guilt Austin but you did the right thing, what your body told you to do.”<br>\r\n<br>\r\n“What do you know?”  Austin asked.<br>\r\n<br>\r\n“I know you defended your vegetable grandmother from a abusive college age cousin.  But perhaps you would like to tell me the whole story.”  She said smiling.<br>\r\n<br>\r\nAustin was silent a few minuets before speaking.  “She had just come back from a run, sweaty, in shortshorts and a sports bra.  She was upset about something and was going to take it out on my grandmother I was staying with over the summer.  I panicked.  And well- her head entered my mouth, then her stomach- and she just tasted so good.  She was italian and she tasted like it.  He midsection, legs.  Best thing I've ever tasted.”<br>\r\n<br>\r\n“Of course.”  Miss Mason said smiling.<br>\r\n<br>\r\n“I tried to throw her back up.  I didn't want her to die- but I didn't know how.  I was scared.  So even though I was able to taste her and felt as though I was in an addictive ecstasy while she was digested I still felt bad.  She begged and pleaded for four days straight.  She screamed.  But I couldn't get her out.  Finally I went to the woods behind the house and got rid of her.”<br>\r\n<br>\r\n“Austin there is nothing to be ashamed of she was food nothing-”<br>\r\n<br>\r\n“We have different world views Miss Mason.  Now why do you want to talk to me?”<br>\r\n<br>\r\n“Swallowers aren't as liked as they use to be.  But you're popular and no one would ever consider you a threat.  Your good PR could get the heat off of some of the more- infamous swallowers.”<br>\r\n<br>\r\n“Like that officer who pulled over and ate women?”  Austin asked.<br>\r\n<br>\r\n“Yes like him.  Now Jill will probably reform wither tonight or tomorrow.  I still plan on eating her many more times.  She really is one of the tasty girls I've ever eaten.  But if the school saw a couple between a Swallower and a Reformer, one were the reformer knew her place as food and submitted as such.  Well that would be good publicity as long as you two had smiles.  And I know you desperately want to eat Jill after seeing my lesson.”<br>\r\n<br>\r\nAustin could not deny that.<br>\r\n<br>\r\n“What are you suggesting.”<br>\r\n<br>\r\n“That we share Jill.  Reformation is powered by part of the brain.  You accept that you have partial ownership of Jill then she'll reform in your house -I would suggest buying some clothes by the way as she'll reform nude.  If you want she could reform at my house and you can eat her some other time.  Still keep the jar and call me later okay.”<br>\r\n<br>\r\n“Sure Miss Mason- sure.” </span></div></div>",
            "created":1386478800,
            "id":1704847,
            "title":"Today's Lesson:Digesting Jill"
        },
        "1342312111111121":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Austin eats Jill a few days later, Jill is arranged at a Swallower Restaurant ",
                "Miss Mason wants to show off Austin, he has him eat Jill in class"
            ],
            "content":"<div class=\"\"><div> <span>Jill gasped a little as she woke up.  A lamp was on, it wasn't her room this time.  She groaned as she realized she must of woken up at Miss Mason's house.  She was grateful though, she was no longer in a burning hell.  It took four days this time to digest.  It was horrible, slowly digestion in burning and stinging acids.  Now there was no burning.  She looked around some more, it didn't look like a room she would find at Miss Mason's house, sports posters were on the wall and a baseball glove sat on a shelf.  She sat up confused but gasped and caught the sheet around her chest as she saw Austin sitting in a chair against a wall sleeping.<br>\r\n<br>\r\nHe woke up at her gasp.  He smiled.  \"Jill, thank god you did reform!\"  He smiled and looked up.  Jill wanted to see him more than anyone but she was still stunned.  <br>\r\n<br>\r\n\"Austin?\"  She asked.  <br>\r\n<br>\r\n\"Yeah.\"  He said nodding.  He picked a bag off another chair and handed it to her.  \"Clothes.\"  He said as the latina pulled out the clothes.  \"Ill give you some privacy.\"  He said turning to leave.  <br>\r\n<br>\r\n\"Wait.\"  Jill said.  \"Just turn around, fill me in please.\"  She said.  Austin nodded and did what she asked as she dressed.  Austin told her a bit, how Miss Mason let her reform her, and how he went and bought some clothes for her.  Jill smirked, the panties and bra he got her fit fine, even if the bra was strapless, but the other clothes was a tube top and a miniskirt.<br>\r\n<br>\r\n\"Thanks for getting me something modest.\"  She said.<br>\r\n<br>\r\n\"Sorry.\"  He said blushing.<br>\r\n<br>\r\n\"Its fine Austin.\"  She said telling him he could turn around.  He need and was almost stunned by the sight of Jill with her miniskirt showing off her legs and most of her luscious midsection being exposed.  Jill sat down on the bed and patted the mattress for him to come over.  \"Why did Miss Mason do this?\"  She asked as Austin sat down and wrapped a hand around her exposed waist.  She giggled as he squeezed her side.  <br>\r\n<br>\r\n\"Well-\"  Austin said as he went on to explain the discussion with Miss Mason.  Jill raised an eyebrow her or there and silently nodded a few times, but didn't seem to upset.<br>\r\n<br>\r\n\"So I'm a slave to you as well.  Just food.\"  She said in a fake hurting tone.  Austin thought she was serious and tried to calm her down.  Jill just chuckled at patted his cheek.  She then swung her legs up and laid on her back on Austin legs, leaving her brown body laid out in front of him.  <br>\r\n<br>\r\n\"Wow.\"  Austin muttered as Jill brought his hands down onto her silky smooth tummy.  She started to squirm as Austin grinned and lightly tickled her belly.  <br>\r\n<br>\r\n\"I know that you want to tickle me and eat me as well.\"  She said smiling.  She patted her belly.  \"Have a taste.\"  Austin grinned as he bent down and nibbled on Jill's belly.  She laughed and arched her back as she felt saliva coat her belly, for once she wasn't worried.  It went of for a few minuets as she laid there submissively as Austin tasted her.<br>\r\n<br>\r\n\"Damn Jill, I don't blame Miss Mason.\"<br>\r\n<br>\r\n\"Thanks.\"  Jill muttered.  <br>\r\n<br>\r\n\"Hey this plan is to keep you out of her belly as much as possible.\"<br>\r\n<br>\r\n\"I know.\"  Jill muttered sadly.  <br>\r\n<br>\r\n\"Listen Jill well think of something.\"  Austin replied.<br>\r\n<br>\r\n\"Oh don't worry Austin.\"  Jill said sighing.  She looked at him.  \"Just give me a few days to rest before you send me to your belly to digest.\"<br>\r\n<br>\r\nAustin stuttered for a moment.  \"Jill-\"<br>\r\n<br>\r\n\"Oh come on.  You want to swallow me more than anything, except maybe digest me.\"  She smirked at Austin knowing she was right.  <br>\r\n<br>\r\n\"I'm not sure Jill.\"<br>\r\n<br>\r\n\"Oh don't worry about it.  Between you or Miss Mason.\" <br>\r\n<br>\r\n\"Jill.\"  Austin said stopping her, he rubbed her belly and looked down at the gorgeous mexican girl.  \"When you were swallowed by her, and when we heard you digesting.  I got to say- I enjoyed it, I like seeing you digest.\"  He looked at her expecting her to be mad.  She just shrugged though.<br>\r\n<br>\r\n\"Yeah, yeah.  Swallowers just simply like that, its not because of you, swallowers like nothing more than seeing someone get vored and digested.\"<br>\r\n<br>\r\n\"But if I swallow you, you'll be in all that pain again.\"  Austin whispered, half to himself.<br>\r\n<br>\r\n\"And it will be a very pleasurable experience for you.  Excruciatingly painful more me yes.  But better you than Miss Mason.\"  She smiled.  \"Im sure you can make it up to me after I reform.\"<br>\r\n<br>\r\n\"I suppose.\"  Austin said smiling.<br>\r\n<br>\r\n\"I know you want another taste.  Go ahead.\"  She said rolling side to side seductively.  Then she laid her head back and giggled as he started to taste her belly again.  </span></div></div>",
            "created":1404104400,
            "id":1820225,
            "title":"Jill and Austin"
        },
        "1342312112":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Follow Ms. Mason in her hunt to eat and digest more beautiful high school girls",
                "Epilouge"
            ],
            "content":"<div class=\"\"><div> <span>Ms. Mason knew when Jill had finally lost conscieness.  She smiled and went to sleep as she felt her body churn her body into soup.  The next morning her chubby stomach had gotten chubbier and she realized she had to use the restroom.  She went over to a cabinet and got out a fairly good sized plastic tub and took off the lid.  <br>\r\n<br>\r\nShe squatted over it and let out Jill's 'remains'.  She smiled the entire time as she formed a large pile in the container.  Poor, poor Jill had been reduced to a pile of shit.  She licked her lips as she remembered her succulent taste.  She remembered all her feasts, but she would remember Jill especially.  After a few minuets she was done and she put the lid on the large pile and placed it on her kitchen counter.  <br>\r\n<br>\r\nShe then found the book she had made and put it on top.  In it was writings about Jill, her preparation for her capture and the <i>actual</i> preparation; as well as details on Jill herself.  Also included was hundreds of HD pictures of Jill throughout her the entire experience. She then taped a DVD that was in a plastic bag to the cover the book.  This DVD had the entire thing on tape and she would enjoy watching many times in the future.  <br>\r\n<br>\r\nShe placed this all on top of the plastic container that held Jill's remains and walked over to a huge walk in closet.  <br>\r\n<br>\r\n“Lucky number fifty.”  She said chuckling as she opened the door.  She placed the container on a lower shelf and labeled in 'Jill Bondad, 16'.  It now rested along with 49 other containers; each one containing the remains of all her feasts since high school.<br>\r\n<br>\r\n“Yes Miss Bondad you were especially delicious.    </span></div></div>",
            "created":1350104400,
            "id":1446327,
            "title":"Jill's remains"
        },
        "13423121122":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "content":"<div class=\"\"><div> <span>Poor Jill Bondad was a beautiful and shapely girl of 16.  She was innocent, sweet and intelligent.  Unfortunately she was prepared and eaten by Miss Mason.  She was then slowly digested as just another piece of meat.  Her parents rightly assumed her fate and her friends felt sad.  But they all knew she must of been one hell of a meal.  Miss Mason kept her remains and her good friend Mrs. Sandra come by and see her remains from time to time.  Ms. Mason found a lot of pleasure in the pictures and dvd that chronicled Jill's capture, tickle torture, preparation, feasting and digestion.  She had eaten many High School girls before Jill and ate many after, but she always remembered Jill as one of the divine tasting girls she ever devoured and digested.</span></div></div>",
            "created":1350104400,
            "id":1446331,
            "title":"Epilouge"
        },
        "14":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Savannah, beautiful girl wth a little bit of curves",
                "Carla, skinny girl, wouldn't know she was SW if you hadn't seen it",
                "Coach Smith, 27 year old attractive woman",
                "Ms Anderson, Assistant Principal ",
                "Ms. Diaz, hot 35 year old Chemistry teacher"
            ],
            "content":"<div class=\"\"><div> <span>You are Jack, a sophomore at Lincoln High. You stand at 5'9, with blonde hair and a muscular frame. You are quite a catch in the tenth grade, both for dating and dinner. You had managed to get past your freshman year, but the half of the year so far has been a struggle.<br>\r\n<br>\r\n There are many women who would love to have you, but you ran an intelligent schedule, hanging out with strictly non swallower girls. That is, except for</span></div></div>",
            "created":1457931600,
            "id":2117263,
            "title":"NS, You, 16, Jack, at school, trying to survive..."
        },
        "141":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "\"Totally Jack\"",
                "\"Why don't you meet me at my place tonight\"",
                "She grabs you and carries you to lunch"
            ],
            "content":"<div class=\"\"><div> <span>Damn it, she was just too sexy to avoid. Savannah was a known swallower but she was just so sexy, with her borderline E cup breasts and an ass which only grew with every meal, her little bit of fat was just a small toll to pay if you were going out with her. Her brown hair dangled to her shoulders, standing shorter than most at 5'6.<br>\r\n<br>\r\n You approached the most popular girl, asking her \"Hey savannah, I was wondering if you wanted to hang out.\" She looks at you with a strange face, and replies with \"</span></div></div>",
            "created":1459573200,
            "id":2126410,
            "title":"Savannah, beautiful girl wth a little bit of cu..."
        },
        "142":{
            "author_id":"ww10030",
            "author_name":"White Wing Writer",
            "choices":[
                "Look away in recoil and try to act like it never happened",
                "Fix my stare onto her some more, even throwing in a glare of my own",
                "Laugh"
            ],
            "content":"<div class=\"\"><div> <span>Carla is deceptively good at what she does, given how easily she is able to hide the aftermath of her prey. You've heard all too many stories of people who have taken a trip inside of her and never lived to tell the tale. She has a death trap of a belly, one you hope you'll never have to visit.<br>\r\n<br>\r\nAs you're caught zoning out, you realize you're staring right at her. Carla notices, as she turns right at you, locks your eyes with hers, and gives you an awkward, semi glare of a stare down in return. What do you do?</span></div></div>",
            "created":1505624400,
            "id":2386947,
            "title":"Carla, skinny girl, wouldn't know she was S..."
        },
        "1422":{
            "author_id":"ww10030",
            "author_name":"White Wing Writer",
            "choices":[
                "Stand your ground, keep the staring contest up",
                "Recoil and look away"
            ],
            "content":"<div class=\"\"><div> <span>You focus your stare into her eyes, and return the glare. Dead silence. The silence is broken up seconds later by her laughter.<br>\r\n<br>\r\n\"Um.... Hi\" She begins<br>\r\n<br>\r\nBefore you have the ability to respond, you hear a loud \"Grrrrroooooooaaaattttt.\" The sound was, of course, a very loud gurgle from her stomach.<br>\r\n<br>\r\n\"Oohhh... Hee hee, I guess I'm hungry\" she says, as she returns to staring at you, with a bit more arrogance in her eyes.<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1523163600,
            "id":2476448,
            "title":"Fix my stare onto her some more, even throwing ..."
        },
        "14221":{
            "author_id":"ww10030",
            "author_name":"White Wing Writer",
            "choices":[
                "Fight my way out",
                "Accept my fate"
            ],
            "content":"<div class=\"\"><div> <span>You keep up your glare, which turns the arrogant confidence on her face into intrigue.<br>\r\n<br>\r\nYou hear her stomach groan again.<br>\r\n<br>\r\n\"Hey, you wanna come a little closer?\" She utters, looking both ways as if she was about to cross a street.<br>\r\n<br>\r\nBefore you have the chance to react, she springs up and wraps you around her arms. Her deceptiveness extends to her upper body strength. You feel like a rat, constricted by a powerful snake, unable to move against her absurdly strong arms.<br>\r\n<br>\r\nShe lifts you in the air, and you are revolted by what you see next. Her mouth opens ridiculously wide, wide enough where you swear you could fit an entire car inside.<br>\r\n<br>\r\nShe promptly lowers you in to her mouth, depositing you inside with ease.<br>\r\n<br>\r\nShe then begins the lengthy swallowing process. You can only flop like a fish, darkness and hot, sticky liquid surrounding you, as you descend down her throat.<br>\r\n<br>\r\nAt long last, you reach what you suspect to be her stomach. You land with a plop, shaking her insides and everything around you. You hear various stomach noises, in addition to her heartbeat loud and consistently.<br>\r\n<br>\r\n\"Mmm....\" She says, as she hugs her stomach and begins to rub it, taking you in with no consequence.<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1523163600,
            "id":2476451,
            "title":"Stand your ground, keep the staring contest up"
        },
        "142211":{
            "author_id":"ww10030",
            "author_name":"White Wing Writer",
            "content":"<div class=\"\"><div> <span>....It's no good.<br>\r\n<br>\r\nYou punch her stomach walls with force and conviction, hard as you can. When that doesn't work, your kicks against her gut prove just as futile. You can't climb out through the top, as you can't get either a solid footing or the ability to actually grab something with which to climb up with. Trying to do so simply results you in slipping and falling all around her stomach, shaking it violently but not improving your situation at all. As you struggle, she sits on the ground, arms around her tummy to restrict your movement further. Eventually, unconsciousness kicks in, and you fall, dormant. Shortly thereafter, her belly claims you as its most recent victim, and you become little more than fat somewhere on her body.</span></div></div>",
            "created":1523164620,
            "id":2476453,
            "title":"Fight my way out"
        },
        "144":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "\"We are selling you online\"",
                "\"I have to eat you\"",
                "\"You're the main prize in the school fair tomorrow\""
            ],
            "content":"<div class=\"\"><div> <span>You wish you hadn't, but you often had to visit the voluptuous assistant principal due to your attraction to troublemaking. She in her mid thirties, with brown hair to her neck and DD tits to complement her incredible ass. She walked with a waddle, as her features caused an unusual sense of gravity.<br>\r\n<br>\r\n Today you had just been throwing an apple across the cafeteria in an attempt to hit your friend Tom when she grabbed you by your ear and led you to the office. You knew of her three strike system, and were terrified of what she would do to you now that you had hit the mark of three. She say you down on the uncomfortable leather seat across from her desk as she sat down and wrote something down.<br>\r\n<br>\r\n \"Jack, we went over this. I gave you multiple chances and here we are. I'm sorry but you had your warnings, so as of now </span></div></div>",
            "created":1458104400,
            "id":2118633,
            "title":"Ms Anderson, Assistant Principal "
        },
        "1441":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Korea",
                "Alabama ",
                "London "
            ],
            "content":"<div class=\"\"><div> <span>\"There was a big debate on what to do with you, and we figured you were quality enough to get us a good twenty grand, so we are selling you on the Internet to fund school programs.\" The brunette announced to you. Your heart sank as you realized your fate as a snack for some woman you didn't even know. \"Let's just get you posed...\" Ms. Anderson said as she takes off your clothes and overcomes your struggles, strapping your arms and legs to a wall in front of her camera.<br>\r\n<br>\r\n She takes pictures of your nude body before switching sides and getting some shots of your ass. She then unstrapped you and threw you in a cage next to her desk as she uploaded the pictures of you to EBay. You wait as she refreshes the screen saying \"That was quick! You are quite the desired man Jack! I just sold you for $30,000 to a nice woman in</span></div></div>",
            "created":1458104400,
            "id":2118654,
            "title":"\"We are selling you online\""
        },
        "14413":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "\"I need sex volunteers\"",
                "\"You're next.\" She points at you"
            ],
            "content":"<div class=\"\"><div> <span>\"Have fun in England!\" She yells as you are carried off to a truck, with the doors shutting and your eyes following. You wait until the airplane takes off, shaking you and the crate with a girl of about your age right next to you.<br>\r\n<br>\r\n You exchanged conversation with the C cup breasted girl, the short haired blonde was named Bella and really nice. She had been sold to the same woman in London and you were both just small ingredients in the woman's collection.<br>\r\n<br>\r\n The plane landed in the foreign country as you were transported through the urban area and to the mansion on the outskirts of the town. You were pushed on a dolley through the house and to the kitchen where you were set in a large cage with about fifty other people of all sorts of ages and races.<br>\r\n<br>\r\n As you laid down on the cold ground, the owner of the facility walked in. She was a woman of indian descent in her mid thirties wearing a white bath robe, and she had just the right proportions on her body. She introduced herself as Madame Sandra, and instructed for Bella to walk towards the entrance. She unlocked the cage and snatched the young girl by her arm, leading her to the table next to your prison, and stuck the struggling girls feet into her jaw.<br>\r\n<br>\r\n You watched in terror as the indian woman worked her way from the feet to the calves of your friend in just seconds, following with a series of swallows which resulted in the short blonde being up to her breasts inside the digestive track of a rich woman. Madame Sandra laughs with pleasure as she finishes Bella off by shoving the screaming teenager's head down her throat and burping, proceeding to blow the smell of your digesting friend in all of your faces.<br>\r\n<br>\r\n She rubbed her belly as she continued eating with an omelette, as her stomach grew smaller and smaller until it returned to her normal petite frame in a matter of minutes. She then smiled and said</span></div></div>",
            "created":1459573200,
            "id":2126415,
            "title":"London "
        },
        "144132":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "Eats you feet first like she did Bella",
                "Places you on a tray and cooks you in the oven for 15 minutes"
            ],
            "content":"<div class=\"\"><div> <span>You looked around and all of the other prisoners looked relieved that it wasn't them. You stood up and walked towards the door and Madame Sandra grabbed you and carried you over and placed you on the table. She grabbed an apple and placed it in your mouth. What she does next surprises you</span></div></div>",
            "created":1463979600,
            "id":2152677,
            "title":"\"You're next.\" She points at you"
        },
        "1441321":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "She digests you on the spot",
                "She devours another girl to join you in her stomach"
            ],
            "content":"<div class=\"\"><div> <span>Without any sort of warning she picks you up and dangles your feet over her huge mouth. You watch as her throat expands.<br>\r\nSuddenly she lets go and you feel your feet go all the way down to her stomach. She pushes down on your head as her stomach expands to accommodate your entire body. As you slide in she licks your manhood and your ass with her huge tongue. Even though you are about to die it gives you an erection which causes her to smile. <br>\r\nWith one final push you are completely inside of her mouth. Now you slowly slide down to her stomach.</span></div></div>",
            "created":1463979600,
            "id":2152681,
            "title":"Eats you feet first like she did Bella"
        },
        "14413211":{
            "author_id":"ww10030",
            "author_name":"White Wing Writer",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You eventually pass out before her body finishes you off.<br>\r\n<br>\r\nYou end being little more than added fat for her rear.</span></div></span></div>",
            "created":1505624400,
            "id":2386967,
            "title":"She digests you on the spot"
        },
        "1442":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "The Principal",
                "A Teacher",
                "A Student"
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry Jack, but enough is enough and we cant have a problem like you running around any more\" She says standing up and approaching your sitting body. She places a hand on your shoulder and laughed as she said \"I doubt you'll taste bad either.\" she then licked the side of your cheek, you being to startled to wipe the dripping saliva from your face. She pulled your shirt off first, placing it in a bin near the front of the room as she followed with your pants. You were soon sitting in nothing but your birthday suit in the office of your AP.<br>\r\n<br>\r\n She licked the front of your body, making her way slowly from the top of your hair to your growing cock. She noticed, grabbing the throbbing dick and squeezing it in a mocking manner. She picks your body up like it was nothing, and stuck your toes inside of her mouth, quickly moving on to your heels. You scream as you feel the warm, slimy walls of her mouth close around your lower body. You knew it was useless, as the room was soundproof, but even if someone could hear your desperate pleas for rescue they would probably just laugh your death off. The Principal was up to your waist, and with another heavy gulp your were up to your shoulders in the digestive system of her. You tried to keep your upper body out by pushing on her shoulders, but it was no match asshe just overpowered you in every way, sending the final part of you, your yelping head, down into her permanent detention.<br>\r\n<br>\r\n you sat in the warm, sticky prison for a good three hours, waiting for the end as a wave of acids came pouring in. You knew this was it as the juices ate away at your body, quickly decaying you into fat on the administrator's body. She finished him off with  rub of her stomach and a large belch, letting the world know of the fall of Jack. <br>\r\n<br>\r\n We will continue the story as </span></div></div>",
            "created":1460091600,
            "id":2129428,
            "title":"\"I have to eat you\""
        },
        "145":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "\"You're getting eaten\"",
                "\"We're gonna have sex\"",
                "\"You need to do me a favor\""
            ],
            "content":"<div class=\"\"><div> <span>You knew what they were made of, but you still couldn't resist staring in awe at Ms. Diaz's Enourmous tits in the middle of chemistry. Her habit for finding random excuses for eating students didn't build up any fat on her other than her voluptuous figure. Her ass, though made of digested teenagers was drop dead.<br>\r\n<br>\r\n You listen to her explain some nonsense about the elements as you and the rest of the guys watch her juggle with every step in the lecture. Just then you hear the Hispanic beauty call out to you \"Jack, I need to talk to you after class.\" Shit. This was it. You followed her orders as the bell rang and all of your friends walked out the room.<br>\r\n<br>\r\n You approached her desk, where she finished typing something into the computer and got to you. \"Jack, I saw you looking, and because of that</span></div></div>",
            "created":1459659600,
            "id":2126944,
            "title":"Ms. Diaz, hot 35 year old Chemistry teacher"
        },
        "15":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "NS, You, 18, Mike, walking through town, what could possibly go wrong.....",
                "NS, You, 21, Sarah, server at a human sushi restaurant, what could happen.....",
                "SW, You, 20, Sam, a hungry college student, plenty of tasty girls around....",
                "SW, You, 23, Lisa, live at parents, your younger brother & sister made you mad..",
                "Even More Choices....."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>          If you didn't what the other choices here are some more.<br>\r\n<br>\r\nSW=You are a swallower.<br>\r\n<br>\r\nNS=You are not a swallower.</span></div></span></div>",
            "created":1194152400,
            "id":460736,
            "title":"More choices......"
        },
        "151":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "You decide to club",
                "You are captured for an imported food company",
                "A drunk girl starts flirting"
            ],
            "content":"<div class=\"\"><div> <span>You collect your thoughts as you walk through downtown New York. This was your first weekend in the city which you moved to with great ambitions. It was a swallower's world, but you were hoping that you may be able to twist it to pardon you. The streets were filled with women, all giving you looks of lust, either licking their lips or even going far enough to smack your ass.<br>\r\n<br>\r\nYou just needed to get to your apartment, but you still had a decent amount of blocks to go. The nightlife was booming, intoxicated young adults roaming the streets.  You keep walking and finally</span></div></div>",
            "created":1460523600,
            "id":2132636,
            "title":"NS, You, 18, Mike, walking through town, what c..."
        },
        "1512":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "London, England",
                "Tokyo, Japan",
                "Sydney, Australia"
            ],
            "content":"<div class=\"\"><div> <span>You walk past the clubs and into the poorer neighborhood in which you lived. It was a sketchy place, but it was what you had to call home. The dark alleys looked threatening, but that was about as deep of a threat they were. Or so you thought. Only one block left, you could see the dimly lit building from your current spot. The only thing that took your eyes off of the building in fact, was the headlights of the van in the alley you were in front of. Just then a muscular woman came out from the shadows and despite your best attempts to fight back, she out-powers you and plucks you onto her shoulder, with you banging and kicking at your kidnapper's back and stomach with no luck to escape.<br>\r\n<br>\r\n She sets you on the cold metal floor of the van and ties your hands to your feet, and slides you to the back. The van takes off as you are immobilized. The van's tires screech as it takes off into the streets and you helplessly scream but aren't heard. It goes on for hours as you realize the hopelessness of the situation and grow silent. The car comes to a sudden halt and the back is opened, only for the same woman to grab and drag you across the concrete into a warehouse. Here, you are placed in a cargo crate, which is then carried to a jet. It soon takes off, and you drift to sleep, petrified at the thought of what came next.<br>\r\n<br>\r\n When you pull your eyelids slowly apart, there is a beam of light in the crate. you bang on one of the planks until a eye slit was formed, and you could see that you were being loaded into an eighteen wheeler. You looked at the skyline of the city as you were being dragged into the truck to recognize it as the familiar structure of</span></div></div>",
            "created":1461301200,
            "id":2137314,
            "title":"You are captured for an imported food company"
        },
        "1513":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "She Starts to eat you",
                "You Just Party with Her",
                "You Break Free and go Home"
            ],
            "content":"<div class=\"\"><div> <span>You walk past the bar district, looking inside the clubs to see the strobe lights beaming on and off and keep walking, whistling your own tune which was often drowned out by the dance music playing in the bathroom. You were about a block away from your apartment whenever out of nowhere an attractive woman of about twenty two jumped in front of you and started intoxicatedly dancing.<br>\r\n<br>\r\n She grinders on you as you smelt the alcohol in her breath. You try to walk past her but she doesn't seem to let you go as she wraps up against you like a fire pole. You attempt to push her off before </span></div></div>",
            "created":1466830800,
            "id":2170900,
            "title":"A drunk girl starts flirting"
        },
        "15131":{
            "author_id":"ww10030",
            "author_name":"White Wing Writer",
            "choices":[
                "Struggle to get out, it can't end this way!",
                "Accept your fate and let her digest you"
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately, your efforts to push her off are futile. She easily overpowers you, and before you know it, your head is deep within her throat. It's not long before she finishes you off, as you fall straight into her stomach. Unfortunately, her insides aren't as roomy as they may seem, and you find yourself being borderline suffocated by her body. You can hear her laugh on the outside.<br>\r\n<br>\r\n\"You taste good, my little morsel\"<br>\r\n<br>\r\nYou.....</span></div></div>",
            "created":1505624400,
            "id":2386936,
            "title":"She Starts to eat you"
        },
        "151311":{
            "author_id":"ww10030",
            "author_name":"White Wing Writer",
            "content":"<div class=\"\"><div> <span>Your futile punches against her stomach wall do essentially nothing but create minor activity on the outside of her elastic stomach. You feel her pat her belly hard before seeming to lay down to finish you off. Your continued assaults on her innards provide nothing but exhaustion, and you slowly feel yourself being overwhelmed by the hot, damp, sticky surroundings. Eventually, you wear yourself out. It's all you can muster to stay awake, but you even fail to do this after long enough.<br>\r\n<br>\r\nIn the morning, you are little more than a memory. She wakes up, with a deflated belly, realizing what she did. She smirks to herself, as she gets into more publically acceptable attire and leaves. You are no longer even a memory, except for that small extra bit of fat on her rear.</span></div></div>",
            "created":1505624400,
            "id":2386939,
            "title":"Struggle to get out, it can't end this way!"
        },
        "151312":{
            "author_id":"ww10030",
            "author_name":"White Wing Writer",
            "content":"<div class=\"\"><div> <span>Accepting your inevitable fate is a disappointing, but all too eventual outcome. You sit inside her confines, and eventually exhaustion and sleep come your way. Unfortunately, her belly acids ensure you never wake up again.<br>\r\n<br>\r\nBy the time morning comes, you are little more than a memory. She wakes up, noticing her deflated belly. She smirks, realizing what she has done, and changes into more publically acceptable attire before heading out into the city. You are no longer even a memory, accept for the small bulge added to her rear.</span></div></div>",
            "created":1505624400,
            "id":2386940,
            "title":"Accept your fate and let her digest you"
        },
        "152":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "It's a cute college guy, but he doesn't like what's on the menu, he wants you...",
                "It's a business woman, she just wants to know what are the day's specials....."
            ],
            "content":"<div class=\"\"><div> <span>          You are Sarah, a beautiful 5ft 7in brunette haired server at a human swallower restaurant. You have sexy long legs, tight round ass, and an ample pair of C-cup breasts. You normally wouldn't have chosen a job such as this, but you were desperate to make money. Surprisingly enough, for some reason unknown to you, it is a very high paying job. You wondered why the position was hard to fill. You had started two weeks ago, after signing a little contract, saying how much you were to be paid and that you were to come in dressed in the restaurant uniform, which consisted of a blue pair of extremely short shorts, and a very skimpy bright yellow bikini top. Of course in normal circumstances you would never be caught dead publicly in such a revealing outfit, but again, you needed the money. Also on the contract, was some very fine print that you couldn't read, but decided it probably said something about how checks and tips were distributed to the employees, but you already knew how that stuff worked.<br>\r\n          It was an interesting job. It was hard to listen to the girls plead to be let go as you carted them out on a platter to be devoured. There were guys served, of course only to women, but for some reason most of the guys didn't beg or cry. It was like they wanted to be eaten by a girl or woman. Now, you are headed to your next table to take the order.<br>\r\n<br>\r\nWho is it? What happens?</span></div></div>",
            "created":1194325200,
            "id":461245,
            "title":"You Serve People.....People."
        },
        "1521":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "You signed the contract, so you served yourself to the guy......",
                "You pleaded with the guy to choose something from the menu.....",
                "You bolted for the door, screw the stupid contract....."
            ],
            "content":"<div class=\"\"><div> <span>          The next table you were going to take the order for, was occupied by a cute young college guy. You walked up to the table and said, \"Hi, my name is Sarah, and I will be your server today, so have you chosen one of our delicious girls on the menu.\" The guy looks up at you and smiles as he sees your lovely form, \"Well I really don't like the looks of any of the girls on this menu.\" You frowned, \"Well sir, what we have on the menu is what have in stock today, so you have to pick one of them.\" You nearly jumped up five feet as the guy grabbed your thigh and started caressing it. \"I like you,\" the guy said, \"You are just what I am hungry for, I am ordering you.\" You broke out in a cold sweat being nervous at such a reply, but you were confident, \"I am a server, that is all I am employed for, I am not on the menu. You need to chose something on the menu or leave.\" The guy laughed, \"Okay honey buns, you go tell your manager that I want you for lunch or he is loosing a paying customer.\" You sighed, \"I'll do that, but he is just going to come out here and tell you that servers are not on the menu.\" The guy laughed again as you walked off to your manager's office.<br>\r\n          You knew that this problem was going to be easily dealt with and you could get back to work. You entered the office and told your manager what happened. He sighed and frowned like he really hated to have to do something. He went over to a nearby shelf and pulled down a large clean silver platter and handed it to you and said, \"Go back out there and put this on the table, strip off your uniform, get on the platter and tell him to enjoy his meal.\" You were stunned, \"What!? I'm not doing that!\" Your manager replied, \"You signed the contract, you will be served for lunch.\" You were puzzled, \"This wasn't in my contract, I didn't sign anything that said I was food.\" Your manager pointed to the door, \"Sorry, apparently you didn't read the fine print. It said that the reason you are being paid so much for a serving job is that if a customer finds that he or she wants you instead of what is on the menu, you are to serve yourself to that customer. So, get out there and feed that guy before he leaves, taking his money elsewhere.\" You in shock, \"B-but, but...\" Your manager rose his voice, \"Go! I have work to do, I have to put out another add for a new waitress.\" You finally got the energy to leave the office, and then you slowly headed for the young guy's table. You were mad at yourself that you hadn't read the fine print. You didn't know what to do now, you didn't want to be some guy's lunch.<br>\r\n<br>\r\nHow did you decided to handle this situation?</span></div></div>",
            "created":1194325200,
            "id":461255,
            "title":"You Should Have Read The Fine Print."
        },
        "15211":{
            "choices":[
                "\"Hold still\"",
                "\"Climb in!\""
            ],
            "content":"<div class=\"\"><div> <span>Still mesmerized at what your boss had just ordered you to do, you arrived at the guy's table to see him smiling up at you knowingly. Not knowing what else to do you placed the large platter down on the table.<br>\r\n\tQuickly glancing at the door you thought about escape briefly, but you'd taken enough law at school to know that you wouldn't come out favorably should it come down to a court case.<br>\r\n\tNoticing some of the awkward stares from about the room you were beginning to get embarrassed, and in that state you could only do what your boss had told you. <br>\r\n\tBeginning to sweat, you quickly knelt down and took off your shoes and ankle-socks, before sliding off your blue shorts and panties together, and then untying your bikini top and dropping it on the floor.<br>\r\n\tShaking like a leaf you climbed up on the table, you began to feel wet as the cold silver platter touched your skin (\"oh my God am I enjoying this?!\"). Kneeling down, and red-faced you stammered<br>\r\n\t\"Enjoy your meal\"<br>\r\n<br>\r\nThe guy chuckled and then said . . . </span></div></div>",
            "created":1195448400,
            "id":466264,
            "title":"Giving in"
        },
        "152112":{
            "choices":[
                "Surrender",
                "Try to reason with him"
            ],
            "content":"<div class=\"\"><div> <span>\"W-what?\" you gasp<br>\r\n<br>\r\n\"I want you to climb in and drag yourself into my stomach\" he replied<br>\r\n<br>\r\n\"B-but-\"<br>\r\n<br>\r\n\"I know this restaurant and I know the law. You might have had a defense from not knowing the contract required you to be food. But now you've actually offered yourself to be eaten, anything you do to get in the way would be amazingly illegal.<br>\r\n<br>\r\n\"besides\" he said beginning to open his mouth wider <br>\r\n<br>\r\n\"if you hated the idea of being eaten by me, you wouldn't be up on the table right now, would you?\"<br>\r\n<br>\r\n\"Well...\" you murmured, incredibly conscious of the growing wetness in your crotch<br>\r\n<br>\r\n \"I know what your answer will be\" he grinned, opening his mouth widely.</span></div></div>",
            "created":1195448400,
            "id":466276,
            "title":"\"Climb in?\""
        },
        "1521121":{
            "content":"<div class=\"\"><div> <span>You were beginning to admit to yourself, since being up on the platter, you were beginning to enjoy the thought of being eaten, and then digested by this cute guy.<br>\r\n<br>\r\nThe guy was right, you liked the idea of being eaten by him! As for actually climbing in and feeding yourself to him, the more you thought about it the more your arguments against it grew thin. <br>\r\n<br>\r\nYou wanted to be eaten, and unlike most others you had actually served yourself to the customer. Why not go the whole way?<br>\r\n<br>\r\nYou reached out timidly and placed both hands into the guy's open mouth, he licked them teasingly, but didn't swallow.<br>\r\n<br>\r\nFeeling his tongue on your fingers you giggled. You began to relax and you knew it was over now. <br>\r\n<br>\r\nSmoothly, you pushed your arms further into his mouth, and down his throat, as his mouth opened further to accommodate your head and shoulders. He continued to massage you with his tongue.<br>\r\n<br>\r\nStanding up, and increasingly pulling with your arms, you managed to slide your head into his esophagus, bringing your breasts into his mouth. You moaned as he tasted your breasts, slowing, but still moving.<br>\r\n<br>\r\nYou managed to get your hands down into his stomach, pulling, you slid your slim waist into him quite quickly. But then you shuddered as he poked your clit with his tongue. You shuffled in slightly further, and then tried your best to rub yourself against his tongue. <br>\r\n<br>\r\nHe seemed to take the hint. Feeling him licking your womanhood up and down, along with your whole upper body being massaged by his throat sent you insane with joy. Feeling the pleasure well up inside you, you couldn't help but moan as your orgasm coursed through you.<br>\r\n<br>\r\nStill writhing with pleasure, you knew it was time. You pulled down one last time and were now fully vertical. Slipping down, your legs glided through his mouth as your body curled up in his stomach.<br>\r\n<br>\r\nNow fully inside his stomach, your skin began to tingle pleasantly as the acids began to do their work. You'd heard the (vore run) government's propaganda - digestion by a vore doesn't hurt, and can actually be pleasurable - but you hadn't believed it until now.<br>\r\n<br>\r\nAs you felt the guy's hands rub against you through his belly. You accepted you had made the wrong decision. Getting onto that plate you had signed your own death sentence. But you couldn't bring yourself to regret it, feeling so serene curled up inside another person.<br>\r\n<br>\r\nThe tingling became more intense, and slowly your consciousness faded out to nothing, as your body became nourishment.</span></div></div>",
            "created":1195448400,
            "id":466285,
            "title":"Surrendering to your fate"
        },
        "15212":{
            "author_id":"wendword",
            "author_name":"Wendword",
            "choices":[
                "\"I came here for a girl like you; I'm not leaving til one's in my belly\"",
                "\"Bring me your pick of the girls in stock, then suck me off once she's eaten\""
            ],
            "content":"<div class=\"\"><div> <span>          You had no idea this could happen; for fuck' sake, you picked this job because you thought it would be safe!<br>\r\n          You desperately plead, \"Please, I don't want to die. If you choose someone on the menu, I'll do anything you want that doesn't see me dead. Please...I'm begging you.\"<br>\r\n<br>\r\n          The customer considers you, the tears streaming down your face, ponders for a moment, then makes his decision.<br>\r\nA mischievous grin stretches across his handsome features.<br>\r\n\"Blow me,\" he tells you, and your heart sinks as he clarifies.</span></div></div>",
            "created":1416546000,
            "id":1891110,
            "title":"Desperate bargaining"
        },
        "15213":{
            "author_id":"chibilikeme12",
            "author_name":"chibilikeme",
            "choices":[
                "Kick him in his face",
                "Sceam in terror"
            ],
            "content":"<div class=\"\"><div> <span>You darted toward the door, in a combination of fear and anger your adrenaline kicked in making you run past the table causing the man to shout \" Hey!!!!!\" but you kept going out the door, down the sidewalk to your car you unlocked the door as fast as posssible and leapt in. Jamming your keys in the ignition and your foot hit the gas pedal, the car tires squeled in protest as it began to zoom away from the restaurant, your boss and the young man shouted from the front door of the restaurant before the young man got in his own car and drove after you refusing to let his meal get away, Looking behind you in a fast paced motion you spotted the young man in his car driving after you at equal pace, You gasp in shock before you get a crazy idea you  spin your steering wheel so the car is spinning then you brace yourself for a collision, the man jerks his own steering wheel and avoids your car before crashing his own, once your car stops spinning you  immediatly began to speed off again but the man runs in front of your car so you have no choice but to stop. The man sweating heavily from his experience stands smirking in front of your car as he walks slowly in front of your door \" Going somewhere sweetheart\" he opens the car door only for you to....</span></div></div>",
            "created":1451019600,
            "id":2079367,
            "title":"You bolted for the door, screw the stupid contr..."
        },
        "152131":{
            "author_id":"chibilikeme12",
            "author_name":"chibilikeme",
            "choices":[
                "It's one of your fellow coworkers, shirley",
                "The man !!??"
            ],
            "content":"<div class=\"\"><div> <span>You kick him in the jaw before pushing him on the ground then you began to fully harm the man who threatened your life to his hungry stomach. You began to punch him over and over before running away , thus the chase begginning again you run along the streets avoiding the bleeding hungry predator eventually you make it home and go inside you slammed the door and locked it only for a knock at the door 15 minutes later. Being exhausted you simply ignore it annd take off your stuffy uniform as you stared into your full size mirror, you hair was wild and your face covered in  bruises and the blood of your predator, marks from your somewhat high speed chase and spin littered your body, but you smiled giddily anyway . You were alive!!!! and at the time that was something to be joyful for. You did a happy dance from your bedroom to your bathroom before you cut the hot water on ready to wash the sweat and clean your pores. Once you got out and got fully clothed your cellphone rand you answered it only to hear the panicked voice of your boss \" don't throw that, put that plate down\" then there was a war cry of one of your workers before the sound of splintering wood. \" before the sound of crinkling glass in your own home as a hand went over your mouth \" gotcha\"</span></div></div>",
            "created":1451106000,
            "id":2079447,
            "title":"Kick him in his face"
        },
        "1521312":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "You are a reformer",
                "He digests you and keeps your remains"
            ],
            "content":"<div class=\"\"><div> <span>\"I got you and there is no escaping this time.\" He says maliciously. You start to panic and try to fight him but his grip is too strong. \"You know if you had just let me eat you at the restaurant you would have had a quick digestion within a matter of minutes but now I will draw it out for days. <br>\r\n<br>\r\nAt that note the man wasted no time in the process. He turns you around and kisses you on the lips, after a second he widens his mouth to engulf your head. He rips off your clothing and strips you naked. He moves his hands down and fondles your breasts a little before bringing them into his mouth as well. He lifts the rest of you up in the air and slips his hand down to your nether regions causing you to gasp in ecstasy. Not wanting to waste time he pushes the rest of you in and swallows you down to his stomach. \"My my, what a meal you were, since you were such a good meal your digestion process will only be about six hours long.\" You start to cry, you never expected this to happen.</span></div></div>",
            "created":1464066000,
            "id":2153154,
            "title":"The man !!??"
        },
        "1522":{
            "author_id":"open8673",
            "author_name":"open8673",
            "choices":[
                "...five minutes.\"",
                "...an hour.\"",
                "...five hours.\""
            ],
            "content":"<div class=\"\"><div> <span>         \"Hello, my name is Sarah, what would you like\" you ask.  The business woman tapped her chin in thought.  She had curly red hair that made it to her shoulder blades.  She had a navy blue pantsuit on.  <br>\r\n         \"Hmm.  What are your specials today\" she asked.<br>\r\n         \"We have our specials listed on page 3 on the menu\" you reply.  She turned the page and pondered some more.<br>\r\n         \"I think I will have a boy prepared number 4\" said the woman.<br>\r\n         \"Can I get a name for your order\" you ask.<br>\r\n         \"Oh.  Yes.  Allie\"  She said.  \"How long will it take?\"<br>\r\n         \"Not more than five minutes\" you replied.<br>\r\n         \"Good.  I am in a hurry\" Allie sighed.  You go back and place the order.  It is ready quickly and you roll it out to Allie.<br>\r\n         \"One number 4 boy\" you say as you put him on the plate.<br>\r\n         \"Thank you.  When do you get off work\" Allie asked randomly.  You are caught slightly off-guard.  Before you answer, you see Allie lift up her meal and quickly swallow.  You see her meal going down her throughout and into her stomach.  Her tummy ballooned out and was surprisingly contained by her suit.  You just looked at her.  Allie was an interesting woman.  \"I don't think you answered my question\" Allie said stretching back in her chair.<br>\r\n         \"Oh, I get off in...<br>\r\n</span></div></div>",
            "created":1421816400,
            "id":1921052,
            "title":"It's a business woman, she just wants to kn..."
        },
        "154":{
            "author_id":"fnbr",
            "author_name":"KingDog13",
            "choices":[
                "Amber",
                "Brad",
                "Both"
            ],
            "content":"<div class=\"\"><div> <span>\"Get out of my room, you little sh*t!\" Lisa yells to her younger sister, Amber, 14, who had stolen some of Lisa's expensive makeup. <br>\r\n\"Don't swear!\" is all you hear from your mother.<br>\r\nAmber, a spoiled brat who took advantage of everything, stuck her tongue out at Lisa, before running to her room. <br>\r\nLisa had another sibling, one less demonic, but all as annoying. His name was Brad, who was 16, who was a total perv. He once walked in on Lisa \"doing things\" (if you catch my drift), and hadn't told anyone, but it was embarrassing all the same. Lisa decided that someone had to move out of this house, and it wasn't gonna be her. Her stomach started to growl, and she smiled. She was hungry. As a SW, she could vore someone. She had only done it twice, to her ex and his gf, but she was eager to try it again. She grinned. Her next meal was gonna be...</span></div></div>",
            "created":1602039000,
            "id":2916448,
            "title":"SW, You, 23, Lisa, live at parents, your younge..."
        },
        "155":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "NS, You,18, Nick, girlfriend says she needs to tell you something......",
                "NS, You, 22, Sally, tossed in someone's shopping cart, while you shopped.....",
                "Still Even More Choices......"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>          Even more choices, are you that picky?<br>\r\n<br>\r\n    SW=You are a swallower.<br>\r\n<br>\r\n    NS=You are not a swallower.<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1194152400,
            "id":460738,
            "title":"Even More Choices....."
        },
        "1551":{
            "author_id":"vorelover194",
            "author_name":"Idkimalt",
            "choices":[
                "Be Her Dinner",
                "Make Her Dinner",
                "Say She Can Get A Snack On The Way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Have A Meal Before She Goes SomeWhere</span></div></span></div>",
            "created":1600913880,
            "id":2908972,
            "title":"NS, You,18, Nick, girlfriend says she needs to ..."
        },
        "1552":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "A guy, a young and hungry college student......",
                "A woman, she was beautiful, but looked to be about in her earily thirties......",
                "A woman, young, blonde,  your age, she works in the office you work at......"
            ],
            "content":"<div class=\"\"><div> <span>          You are Sally, you are 5ft 6in have long auburn hair, lively C-cup breasts, and sexy round ass that is connected to a pair of thick thighs, you do have a couple of extra pounds on your body but those are mainly proportioned on that ass and thighs. You had went to the supermarket to get a few items to restock your kitchen like, milk, bread, cheese, chips, spaghetti, and sauce. You had everything in your little arm basket and was about leave when you were grabbed from behind by someone. The person tied your arms behind your back and then tied your legs together.  You felt as the person lifted you up and placed you in his or her cart with the rest of the items.  The person placed your basket under the cart.  You couldn't see who was abducting you, because when you were tossed in the cart your head was jammed up against the front of the cart and you couldn't see behind, where the person was. The person continued shopping tossing in other items and finally headed for the check out line. The person unloaded the contents of the cart except for you onto the cart. You pleaded with the woman at the check out counter to help you get free but she just didn't care, she acted like it was an everyday occurrence, which in the supermarket it usually was.  The check out woman just came around and grabbed the basket you had put your stuff in and added it up and said normally, \"Okay this is what she would have bought from the store if she hadn't been selected by you, the total of the items in the basket add up to twenty-two dollars and fifty six cents, so that is what I have to charge you if you want to take her.\" The person must have nodded yes to wanting you, because you didn't hear anything and you saw the register light up as the woman rang you up as, \"one female customer, $22.56\".<br>\r\n          You couldn't believe it, but you had just been bought like any other supermarket item. Not only that, but with how big you were you were practically a steal. It wasn't long before the person wheeled you outside. You had a feeling that you would be curled up in this person's belly by the end of the night. With all the hard work you did to survive high school and college with out being eaten, it looks like your luck ran out.  The cart stopped at the person's car, and the person put the other items in the backseat, then the trunk popped open and the person picked you up and placed you in. Before the trunk lid was shut to leave you in darkness, you caught a glimpse of the person that had purchased you.<br>\r\n<br>\r\nWho had bought you?</span></div></div>",
            "created":1194238800,
            "id":461092,
            "title":"You Are Just Another Item To Be Bought."
        },
        "15521":{
            "author_id":"writer3000",
            "author_name":"writter3000",
            "choices":[
                "He pushes you in the rest of the way....",
                "You decide you want to do this and climbed the rest of the way...."
            ],
            "content":"<div class=\"\"><div> <span>(edited by OBusywriter, because of grammatical errors.  Also I am leaving this as an example of what too short of and edition is. This has five sentences, but the minimum is six. It needs and extra sentence. It also would have been good to add more to the story that just this, like dialog, meaning talking done with quotation marks and done properly.)<br>\r\n<br>\r\nWhen the trunk opened and he was a drop dead beauty. <br>\r\nHe said his name was Mike and was extremely horny and hungry.<br>\r\nThen the next second you know you were on the ground naked with him on top doing you and you were kissing him and next thing is you are so hot you are offering your self to him. Then you say to him open your mouth. He opened his mouth and you started to climb in his mouth, you then realized you weren't sure you wanted to die. </span></div></div>",
            "created":1197176400,
            "id":473815,
            "title":"Doing Dinner"
        },
        "15522":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "A mansion ",
                "A suburban home"
            ],
            "content":"<div class=\"\"><div> <span>You look out of the trunk at the face of a beautiful blonde woman who appears to be in her early thirties. She has DD breasts with an ass that was skin tight around her large yoga pants. She was a little chubby, but you presumed she worked out due to her pear shape. She displays no emotion shutting the trunk and getting into the car. You hear the shake of the motor as you are bound to the small prison of her leather trunk.<br>\r\n<br>\r\n She drives for a good period of time before coming to a screeching halt at</span></div></div>",
            "created":1457499600,
            "id":2115237,
            "title":"A woman, she was beautiful, but looked to be ab..."
        },
        "155222":{
            "author_id":"peppersworth",
            "author_name":"Pepper",
            "choices":[
                "She digests you",
                "She lets you out to keep you for later"
            ],
            "content":"<div class=\"\"><div> <span>As she opens the trunk you look out and see a decent suburban home belonging to somebody from the middle class. She slings you over her shoulder and carries in the groceries. <br>\r\nYou had no idea what plans this woman had in store for you. She carried you over to a large chest freezer that was empty, she dropped you inside. You didn't know if she was going to freeze you to death or you were just being stored in there until she was ready to eat you.<br>\r\nIn the kitchen the woman was making dough. Finally after you had been in the freezer for about half an hour, she takes you out and on the counter you see what looks like pizza dough on the counter. <br>\r\nShe takes you over and sets you on the dough on your stomach, after stripping your clothes off she started spreading tomato sauce on your back, then she put cheese on your back. <br>\r\nAfter this she wraps the dough around you, you realized that you were to be some kind of human Stromboli. She picks you up and places you in the oven, it's surprising she has an oven big enough to fit a human, she must have human meals quite often.<br>\r\nAfter about half an hour she opens the oven, she still wanted a live human meal but she wanted you to be slightly cooked. She takes you out and carries you over to the dining room table. She starts on your head and since most of your body is being restrained by cooked dough she swallows you do to your knees. <br>\r\nShe pushes your feet in and you can feel yourself travelling down to her stomach. Suddenly you fall through an opening and fall into her stomach. <br>\r\nNever did you expect to be plucked from the supermarket and then eaten all with the matter of a few hours.</span></div></div>",
            "created":1463979600,
            "id":2152578,
            "title":"A suburban home"
        },
        "1553":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "SW, You, 21, Rick, you are sent to babysit your twin 16yr-old cousins......",
                "SW, You, 20, Gina, accepted by a non-swallower college sorority.....",
                "NS, You, 18, Jason; found out you can't be digest, you want to cash in on this.."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>          Okay this is the last set of choices.<br>\r\n<br>\r\n    SW=You are a swallower.<br>\r\n<br>\r\n    NS=You are not a swallower.<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1194238800,
            "id":460740,
            "title":"Still Even More Choices......"
        },
        "15531":{
            "author_id":"writerlord",
            "author_name":"OBusywriter",
            "choices":[
                "You resisted and ordered pizza for dinner......",
                "You licked your lips, \"Strip girls, I missed lunch, and I am hungry for twins.\""
            ],
            "content":"<div class=\"\"><div> <span>          You are Rick. It is Summer and you drove over to your thirty-four year old Aunt May's house. She had just moved back home from New York, you hadn't seen her or your twin cousins for about three years. Your Aunt May asked you to watch her twin sixteen year old daughters Emily and Hanna, while she left on a business trip. They weren't identical twins, but they still acted like they were, doing practically everything together. You are a swallower and they aren't, neither is your Aunt May. You arrived at the relatively large house and knocked on the door. Your Aunt answered, quite happy to see you, \"Good, I don't have much time, I have to leave here in a minute so I don't miss my flight.\" You replied, \"Don't worry I will take good care of them.\"  May looked at you with a little worry in her eyes, \"Now Jason, I know you heard that Emily and Hanna found out that they don't have the swallowing power. I know that by law that makes them far game to be swallowed, but please don't eat my daughters. They have gotten quite beautiful since you last saw them, and a little plumper, but please don't eat them. Ah, well, your family, you wouldn't think of eating them anyway.\"<br>\r\n          May gave you a big hug and ran off to her car. You shut the front door and stood for a moment in the living room. May had told you that the twins were watching a movie in the entertainment room upstairs. The last time you saw Emily and Hanna, they were thirteen, a pair of cute girls. Then, you had secretly hoped that when they came of age, that they wouldn't have the power. They were curious girls then, always asking if you wanted to gobble them up, you had a feeling that they both had a crush on you. Now you decide to go upstairs to spy on them before telling them you were there. May had said they had gotten beautiful, and she wasn't kidding. You peeked around the corner of the door of the entertainment room and stared as they sat comfortably on a sofa watching a chick flick. They had both matured quite a bit in the last few years. They were now both 5ft 5ins, with medium length brunette hair, very developed chests that were borderline D-cup, and the extra weight May had talked about had filled out their thighs and padded their lovely round asses. You couldn't help drool while looking at them. It was going to be hard to resist gulping down your two cousins.<br>\r\n          You decided to enter the room and say hello. Emily nudged Hanna to look over at you, and she turned off the movie. They both greeted you to your liking with a big sandwich-like huge and said, \"Hey, Jason, you're here finally.\"  Emily gave you a peck on the cheek, \"Oh it has been so long since we have seen you.\" To your surprise Hanna gave you a little slap on the butt, \"Ya, it's been too long.\" Wow these girls were getting a little feisty, you wouldn't have been surprised....or cared if they tossed you on the couch and tore your clothes off. They did have you sit down on the couch and they sat on either side of you, and started asking questions, the first of which they asked simultaneously, \"So, do you have a girlfriend.\" \"Well,\" you started, \"A couple of weeks ago I had a girlfriend, Tina. I had been with her for about five months and decided she wasn't my type of girlfriend; she wasn't too happy when I broke up with her, especially when I ended it with her curled up in my belly waiting for her to digest.\"  \"Did Tina taste good,\" Emily asked. \"She was yummy,\" you replied. Hanna tried to stick her finger in your mouth, \"I bet Emily and I taste whole lot better than that Tina did.\" You had to agree with Hanna.<br>\r\n          \"Ya, Jason,\" Emily said, \"Hanna and I want you to have us as your next two meals, preferably eating one of us and quickly the other so that we can be together in your belly.\"  \"Now, now, girls,\" you said, \"As tasty as you might be, I promised your Mother that I would not devour a single one of you.\"  Hanna replied with a giggle, \"Oh Mom, doesn't know what is good for us. She should know  better that sooner or later, both Emily and I will end up in some guy or girl's belly. We might as well have you are wonderful cousin devour us, better you than some stranger.\" You had to admit that she was making some sense.<br>\r\n<br>\r\nYou were faced with a choice, what did you do?</span></div></div>",
            "created":1194238800,
            "id":460755,
            "title":"Tasty Twins To Take Care Of."
        },
        "155311":{
            "author_id":"aparkbear",
            "author_name":"ZPB",
            "choices":[
                "A gorgeous pizza girl, that the twins happen to know, shows up at the door.",
                "Your cousins are attempting to make their move."
            ],
            "content":"<div class=\"\"><div> <span>          After pausing and starring at your two cousins--who would taste far better than any pizza would--you decide to not ravage and eat them, like a beautiful pair of edible fuck toys.<br>\r\n<br>\r\n          \"Alright girls...\" You sigh and continue, \"As much as I'd love to have and intimate night with you two.\" You can already see them deflating from their previously hyper-ecstatic mood. \"I think it's better that we get some pizza and I adhere to your mother's request. However, your guys choice of pizzas and if there a particularly tasty looking pizza girl...\" You pay your growling stomach suggestively and watch as the twins perk back up. <br>\r\n<br>\r\n           A devious smile emerges on Emily's lips as she whispers something to Hannah, who then runs off. Before you can question this, Emily begins talking. \"So, Hanna wants a meat lovers pizza and I want a deluxe. You know, the kind with everything on it.\" She gets real close to your face as she says this, pressing her entire body into yours and trace a dainty hand across your jawline and lips. You can tell that she's trying to stress her attractiveness and go through the motions, but you just pretend let it go over your head. \"Sure thing.\" You just pull out your phone and wait of her to ease up<br>\r\n<br>\r\n          As soon as she does, you land a firm slap on her wonderfully shaped rear. Which quickly changes into a small grope, momentarily kneading the soft flesh between your fingers. You swiftly plant a moist kiss on her neck, getting a bit of her extraordinary flavor, then retract your hand. She stiffened up and stares at you with a flustered longing expression.<br>\r\n<br>\r\n          You pretend nothing happened. You just stare at your phone, faking indifference, as you dial the local pizzeria's number and state, \"Tell Hannah that's for earlier.\" She just gets up and quietly leaves, with a hand on her neck where you kissed her. You now know for a fact these girls like you.<br>\r\n<br>\r\n          After the pizzeria picks up, you order the pizzas and some other small things from the pizzeria. About 20 minutes pass and...</span></div></div>",
            "created":1464325200,
            "id":2154837,
            "title":"Pizza it is."
        },
        "1553111":{
            "author_id":"californasun1",
            "author_name":"californasun",
            "choices":[
                "Digest Marisa, enjoy the teen latina's cries of agony",
                "Let Marisa out and fill out paperwork to make her your slave",
                "Let the other girls decide whether to digest Marisa or enslave her"
            ],
            "content":"<div class=\"\"><div> <span>You sat down for as you waited fo the piazza to arrive.  Meanwhile Emily and Hannah heard a car drive up.  Pulling a curtain back Emily smiled.  \"Oh look its Marisa.\"  She said with a smile.<br>\r\n<br>\r\n\"Who's Marisa- whoa.\"  You mutter as you look at the girl getting out of the car.  She looks Hannah's and Emily's ages.  She was latina from the looks of it.  With long brown hair and beautiful brown skin.  A gorgeous face and toned body, with wonderful legs that look great.<br>\r\n<br>\r\n\"She's a friend of ours.\"  Hannah replied.  \"She plays Softball.  Really good.\"  You didn't care too much and Hannah grinned as she looked at your face.  \"Tasty looking yes?\"<br>\r\n<br>\r\n\"Oh no doubt.  Sexy as hell.\"  You replied.  <br>\r\n<br>\r\nEmily grinned.  \"How about this, we lure her in, and you get to eat her.  We get the pizza.\"  Yo grinned.<br>\r\n<br>\r\n\"I like your thinking.\"  You reply.  The girls smiled as they walked to the door and opened it.  <br>\r\n<br>\r\n\"Hey Marisa!\"  They said to the teen latina.<br>\r\n<br>\r\n\"Hey how are you two.\"  She replied with a sterling grin.  You couldn't help but admire her body.  The teen looked beyond delicious.  <br>\r\n<br>\r\n\"Good.\"  Emily replied.  \"Want to come in for a moment.\"  Marisa srhugged as she brought in the pizzas.  She set them on the counter by the table.  \"This is our uncle.\"  She added.  Marisa waved as she looked at you, almost blushing as she looked at you.  <br>\r\n<br>\r\n\"Oh hi.  How are you?\"  She asked.<br>\r\n<br>\r\n\"Good.\"  You replied.<br>\r\n<br>\r\n\"Marisa is a very sweet girl.\"  Emily said with a smile.  <br>\r\n<br>\r\n\"And very smart.\"  Hannah said.<br>\r\n<br>\r\n\"How nice.\"  You reply.  \"She looks very delicious as well.\"  Marisa looked taken a back a bit.  <br>\r\n<br>\r\n\"Im- uh.  Do you have the payment.\"  She asked nervously.  <br>\r\n<br>\r\nYou walked up to her, youre dominating physique making her tremble and paralyzed.  \"No, but Im not eating the pizza thats for them.  Im interested in a very different meal.\"<br>\r\n<br>\r\n\"No- please.\"  The teen latina said trembling.  \"I have a bright future, Im aiming to be the valedictorian, I due charity- please.\"<br>\r\n<br>\r\n\"You'll serve better as a meal.\"  You said grabbing her.  She struggles and screams and Emily records with her phone.  She begs the girls for help as you with your muscles easily rip her pizza uniform blouse off, revealing a sexy stomach.  Grabbing her arms you pin them behind her back and press her against the table.<br>\r\n<br>\r\n\"Please dont!  Help!\"  She begs as you bind her wrists and elbows in edible meal tape.<br>\r\n<br>\r\n\"Hannah, help with the jeans please.\"  She smiles as you unbutton Marisa's jeans with one hand while feeling up her waist with the other.  Hannah pulls off her jeans, revealing an amazing rear end and some of the smoothest and best looking thighs youve ever seen.  You slap them, eliciting a moan out of the sobbing girl.<br>\r\n<br>\r\n\"No!  Don't please!\"<br>\r\n<br>\r\n\"Oh its going to be nice to listen to your cries of agony as you digest.  Going to be a long three days for you babe.\"  You say groping her body as Hannah binds her ankles and knees.  Marisa tries to struggle but its no use.  <br>\r\n<br>\r\n\"No please!  Please Im begging you!\"  She says as you lick up her body, making her shudder as you taste her brown skin.  <br>\r\n<br>\r\n\"I think Ill just eat you.\"  You reply.  You flip her up.  \"Hannah can you do me  a favor and smack her belly and thighs with your belt as I eat her.\"  <br>\r\n<br>\r\n\"Sure thing!\"  Hannah says excitedly as she takes off her jeans belt.  Marisa shakes her head.<br>\r\n<br>\r\n\"No!  Why, please!  Why are you doing this!\"<br>\r\n<br>\r\n\"Oh because your sexy body is so tasty.\"  You say nibbling her belly, your favorite part.  You then go and take in her toes as Hannah smacks her belly with her studded belt, making her gasp in pain.  She does it again and again as you take in her soft feet.  She tasted amazing.  Your saliva coated them, and then her muscular calves as you slowly took in her body.  You groped her amazing legs and ass as you ate her calves.  She tasted sublime.  She cried in anguish as her belly burned more and more from the belt.  Meanwhile you reached her knees and \"Mmmmmed\"<br>\r\n<br>\r\n\"Please stop this!  Emily help please!\"  She begged as Emily kept filming.  She tried to struggle but couldn't as you bit down, almost chewing as you got to her thighs that burned from Hannah's whipping.  \"Ahh please, Ill do anything!  Please digestion is days of agony dont!\"  She begged.  You just grinned as you brought in her amazing rear, firm and great, you couldnt wait to reduce it to nothing but nutrients and excretes.  Finally you rubbed her belly as you neared your favorite part.  You made your tongue longer and licked up and down her amazing belly as it quivered in pain.  Slowly you move up, eating her belly inch by inch.  The pain and torment had caused her lovely body to gain a sheen of sweat.  And it tasted even better.  At her abdomen you bit down hard, making her gasp and sob.<br>\r\n<br>\r\n\"She's in this much pain right now, I cant wait to film her screams as she digests.\"  Emily said.<br>\r\n<br>\r\n\"Please!  Please!  I'll be your slave!  Think about it, Ill fill out all the paperwork!  Think of how cheap that is, you can do anything you want to me, just please dont kill me, and certainly dont digest me!\"  You raised an eyebrow.  And interesting option, she would certainly be fun to keep around as a submissive slave.  Yet she tasted so good you continued to eat.  Bringing in the rest of her sexy midsection, you squeezed her proportioned breasts as you swallowed them to.  She sobbed.  \"No no no.  I had such a future, please dont end me with this agony!\"  She begged.  With another couple of gulps you sent her to your gut.<br>\r\n<br>\r\n\"Oh my girls, that was an incredible meal!\"  You said slowly standing with a hot senorita in your gut.  <br>\r\n<br>\r\n\"Yay!\"  The girls chanted as you waddled to the couch while they each got a slice of pizza.  Meanwhile Marisa was forced into almost a vertical hogtie in your stomach, with her arms taped behind her and her legs bent behind her at the knees.  It was very tight and her body made a perfect silhouette that the girls loved to look at as you lifted your shirt.  Inside the latina gasped as your digestive juices started to coat her.  Then the excruciating pain began.<br>\r\n<br>\r\n\"Oh please, Oh god it hurts so much mercy!\"  She cried as she felt your stomach massaging acids into every pore of her body, her belly getting the brunt, acids feeling like white hot sand paper on her luscious skin.  \"Oh mom!  Please it hurts!\"<br>\r\n<br>\r\nYou chuckle as you prepare to enjoy 3 days of this singing.  \"Im surprised you didn't keep her as a slave.\"  Hannah said with a smile.  \"Would love to see you dominating her.  We might of even joined her.\"  She added seductively.<br>\r\n<br>\r\n\"Yes but it would be difficult to regurgitate her, besides look how nice it is too watch her scream and beg in agony.\"  Emily said with a smile looking at Marisa, her contained thrashing in your gut.<br>\r\n<br>\r\n\"Please, it hurts so much mercy!\"</span></div></div>",
            "created":1481864400,
            "id":2250647,
            "title":"A gorgeous pizza girl, that the twins happen to..."
        },
        "155312":{
            "choices":[
                "Hannah, she had thicker thighs.",
                "Emily, she had a bit more chubbiness to her."
            ],
            "content":"<div class=\"\"><div> <span>The girls squealed in unison as you told them to strip, and they did so as fast as they could. They then stood before you completely naked, all of their beauty finally bestowed to you. You stared at their bodies deeply, drooling as you did. Suddenly a loud growl brought you out of your trance and you looked at the girls eager faces. \"So, who's going in first?\" you ask with a devilish grin on your face. Then one of the girls rushes towards you, the girl was...</span></div></div>",
            "created":1312088400,
            "id":1158958,
            "title":"You licked your lips, \"Strip girls, I'm hungry!\""
        },
        "1553121":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Quickly, so she can join her twin",
                "Slowly, you want to enjoy it"
            ],
            "content":"<div class=\"\"><div> <span>You smiled at Hanna as she came forward, grinning in anticipation. You wrapped your arms around her and began an intense makeout session with her, slipping your tongue into her mouth to sample her flavor. As the kissing continues, you slowly creep you mouth over her hand and your hands down to her ass. Finally, you open wide and take in the whole head, pushing on her ass to help her shoulders in. She giggled as you licked her face, slathering it in saliva. Your tongue begins to lick her breasts, flicking the hardening nipples. You swallow again and take her up to her waist. As your hands massage her ass, your tongue creeps into her nether region, causing her to shudder. Soon, she orgasms, the signal for you to continue eating her. You swallow her again up to her thighs, then her knees. She kicks her feet playfully. Finally, you swallow her feet, the blue painted toes disappearing from view. She lands in your stomach, the curve of her spine pressed to the outside wall. You look up and see the other waiting anxiously to join her twin. You decide to swallow her....</span></div></div>",
            "created":1362114000,
            "id":1541665,
            "title":"Hannah, she had thicker thighs."
        },
        "15531211":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "\"Sure, girls.\" (hold back digestion till Aunt May get's home)",
                "\"Sorry, but no.\" (digest them instantly)"
            ],
            "content":"<div class=\"\"><div> <span>You swallow Emily rather quickly, sending her to join her twin in their last minutes of life. The two wrap themselves around each other, rubbing each other's thighs, making out, humping and grinding. You're very turned on by this action. \"Oh, girls,\" you moan. \"You were so delicious.\" The two helpless females giggle. \"I wonder if mom tastes as good as us,\" Hannah said out loud. Emily laughed. \"I bet she does.\" She then speaks directly to you. \"Jason, can you please keep us alive until mom gets home so she can be with us in your belly? Pleeease?\" You're reluctant about eating your aunt, since she's definitely going to be unwilling. \"I don't know.\" Both girl's faces are pressed against your stomach wall, pestering you to devour their mom alive to join them in a bizarre threesome. Finally, you sigh and say...</span></div></div>",
            "created":1362114000,
            "id":1541670,
            "title":"Quickly, so she can join her twin"
        },
        "155312111":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Eat her quickly to join the girls",
                "Play around with your beautiful relative a bit"
            ],
            "content":"<div class=\"\"><div> <span>You hold back your digestive juices and keep your airway open, allowing the girls to continue having lesbian incest in your belly. Finally, your Aunt comes home. For the first time, you notice how attractive she is, with large breasts, full lips, and a curvy figure. She sees your belly and instantly grows concerned. Her concern lessens slightly when your stomach moves and Emily says, \"Mom? Are you home?\" May looks at you with wide eyes. \"Jason, how could you? Let them out now!\" You hold up your hands. \"Don't blame it on me. The girls wanted to be eaten.\" \"Yeah, mom,\" adds Hannah. \"And we want you in here too!\" May goes from shocked to terrified in moments. She looks at you. \"Jason, don't....\" You smile at her and walk forward. You decide to...</span></div></div>",
            "created":1362114000,
            "id":1541672,
            "title":"\"Sure, girls.\" (hold back digestion til..."
        },
        "1553121111":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Let the girls have some more fun",
                "Enough is enough. Time to die, girls"
            ],
            "content":"<div class=\"\"><div> <span>You approach the quivering woman ,smiling wickedly. \"Sorry, Aunt May,\" you say, patting your massive belly full of live, wriggling meat. \"But the girls are pretty insistent.\" You take her by the cheeks and kiss her deeply as she squirms to escape. Then you stuff her head into your mouth. As she struggles, you quickly rip off her blouse and pants, as well as her bra and underwear. You swallow her quickly, though you pause to sample her breasts, making her gasp. Despite her blubbering protests, you cram her in up to her waist. But before you can explore her nether regions, the twins inside of you grab their mother and drag her fully inside. You barely manage to remove her high heels before the last of her legs slip into your mouth and join her body. May struggles insistently. \"Jason, you have to-mmmppphhh\" You can infer on what's happening now. The girls are literally r*ping their mother. Emily kisses her full force on the lips and sneaks a hand to her lower lips, while Hannah wraps her legs and arms around her parent from behind, massaging her breasts and whispering in her ear softly. The woman struggles, but is powerless against her two hot horny daughters. Eventually, she gives in and starts to kiss back. You lovingly massage the three helpless, soon to be dead females in your massive gut. \"I love you girls,\" you say, the prepare to release your acids. But maybe you want them to play around a bit more....</span></div></div>",
            "created":1362114000,
            "id":1541676,
            "title":"Eat her quickly to join the girls"
        },
        "15531211111":{
            "author_id":"wiztech46",
            "author_name":"Wizard",
            "choices":[
                "You accept",
                "You decline "
            ],
            "content":"<div class=\"\"><div> <span>You decided to let the girls continue having their fun.  You go and lay down on the couch and take a nap. You wake up 3 hours later and can still fill the girls going at it in your stomach.  You can tell that Aunt May has passed out and that the twins are taking full advantage of her body.  \"How is it going in there?\" you ask the twins. They replie in unison ,\"Great it's been real fun in here.  We have a proposition for you.  Do you want to hear it?\" \"Sure,\" you replie \"what is it?\" Hannah says, \" how about you let us out, digest our mom, and we will be your slaves for the rest of our lives and you get the house?\"</span></div></div>",
            "created":1381294800,
            "id":1676732,
            "title":"The proposition "
        },
        "155312111111":{
            "author_id":"wendword",
            "author_name":"Wendword",
            "choices":[
                " Your mom's in my belly and your sister's safe and sound.",
                "Sorry, Em. You're an only child now"
            ],
            "content":"<div class=\"\"><div> <span>          You have to admit, the offer is appealing. Sure, you only get one meal's worth of girl instead of three, but in exchange for a pair of willing slaves, plus your own house! Coming fresh out of your senior year at college, you can appreciate how much of a financial boon this is.<br>\r\n          \"Ok girls,\" you say, rubbing your belly. You fell them squirming and giggling, playfully fighting over who gets to feel your massaging hand. \"I like the idea, but I want to be sure of a few things first. One, for you to have the legal authority to give me your house, your mom needs to be dead. Two, while you are both legally edible, you still are minors, so only your mom has the authority to give, sell, or trade you away to anyone, even a relative like me. We need to think of a way to work that out.\"<br>\r\n          Your food murmurs in agreement.<br>\r\n          \"Lastly,\" you add, \"why the sudden change of heart? Earlier you were looking forward to being digested, now you're looking for a way out. What changed?\"<br>\r\n          The pair squirms silently inside you for a moment, all thoughts of sex abandoned. You begin to feel additional movement, and realize Aunt May is slowly starting to recover. At length, Hannah quietly tells you, \"We're scared. We both noticed about twenty minutes ago that all of us are getting really soft and squishy, and I've lost all my hair except what's on my head.\"<br>\r\n          \"Same for me and Mom,\" Emily cuts in.<br>\r\n          \"Basically, we're getting pretty close to dissolving into yummy nutritious girl-goo, like I know you want us to, but we've realized...well...we really liked being eaten, and we really, really like digesting...but we don't want to die.\"<br>\r\n          You feel a pleasant tugging in your gut as Emily nods in agreement. It makes sense, now that you think about it. These girls aren't even halfway through high school; hell, they're barely old enough to realize just how much they haven't done yet. They may belong in your belly, but they deserve at least a little more time to live.<br>\r\n          \"I'm ok with letting you be my slaves for the rest of your lives, but you should know that as your owner and a swallower, your lifespan will be as long as I feel like. And the only promise I can make is that you won't die of old age.\"<br>\r\n          \"That's perfectly fine,\" replies Emily with a giggle. Hannah chimes in, \"We know that even as slaves we'll end up as nothing but calories in the long run. We just want some more time to enjoy life...or at least get used to the idea that we're not going to be around much longer.\"<br>\r\n          Before anything more can be said, you feel your stomach churn suddenly. You realize with a jolt just how little time these two have. Not waiting for further discussion, you immediately begin heaving and trying to vomit them out. Aunt May should still be fine, she hasn't been in as long, but if the girls are as softened up as they say, this round of internal pulsations will pleasantly but fatally turn them into a thick sweet paste.           Emily flops slimily out of your throat onto the floor where she lies, quivering and gasping. You feel another figure in your throat, working her way up and out. Deeper inside you your stomach is in full gear, mashing and rubbing your gastric contents. You don't know if it was Hannah or May who got left behind, and if it was Hannah...<br>\r\n          The unconscious woman in your throat slides smoothly out onto the ground beside Emily. Too weak to move her head and look, Emily asks feebly, \"is that Hannah?\"</span></div></div>",
            "created":1409634000,
            "id":1851461,
            "title":"Two slaves or one?"
        },
        "1553121111111":{
            "author_id":"wendword",
            "author_name":"Wendword",
            "choices":[
                "Thank you so much. I accept.",
                "Nah, I'll just digest you and take what I want."
            ],
            "content":"<div class=\"\"><div> <span>You carry the girls one at a time to their bedroom and lay them gently on the covers of their bed. A less experienced vore might think them beyond saving, but you've brought a few of your girlfriends out of your belly at this stage of digestion. Leave a girl in this condition to sleep in peace for an hour or two and she'll be as hale and lively as she was when she went down your throat.<br>\r\nWith the twins comfortably recuperating, you head over to the bathroom and down a handful of antacid tablets. They leave you feeling a little bit sickly and bloated, but now Aunt May should be safe from full digestion for at least another twelve hours. After a few minutes of coughing and burping your stomach is fine again, and you can definitely feel Aunt May waking up. You prod your midsection to get her attention.<br>\r\n\"Ugh, what a feeling...haven't felt that good since Robert got eaten..wha-! Wait! Girls! Emily! Hannah! You-you digested them, didn't you? You murdered my daughters! You-!\" She screams in fury and sorrow for nearly half an hour, and you let her do so without interruption. No stranger to an upset aunt, you know to just ride out the rant until she runs out of steam. Eventually she calms down, just as you knew she would. You say, \"Aunt May, relax, please. Your daughters are fine; I just needed to regurgitate them to keep them from dissolving. You see, they have a new idea for their future.\" You go on to explain their plan.<br>\r\nAunt May ponders the news for a while. Obviously she realizes that whatever happens you will digest her. Her main priority now is to protect her beloved daughters as much as possible. You must admit that you are impressed how devoted to her children she is. Even after they disobeyed her, got a predator to eat her, and are now planning to let her digest and take all her things, she still only wants the best for them.<br>\r\nAt length she says, \"Alright. I'll give you the house and the girls, and I won't even complain while you dissolve me. But I get to set the terms of their slavery and the property transfer. No ifs, ands, buts, or negotiations of any kind, or even questions. The girls get their wish and you get everything else; that's far beyond fair. Do we have a deal?\"<br>\r\nYou ponder a moment, then reply.</span></div></div>",
            "created":1409634000,
            "id":1851463,
            "title":" Parental consent"
        },
        "15531211111111":{
            "author_id":"wendword",
            "author_name":"Wendword",
            "choices":[
                "You know what, I would like to change things",
                "Sorry. It's my aunt's last request, so I'll leave things as they are."
            ],
            "content":"<div class=\"\"><div> <span>Your aunt sighs in relief and slumps back against your stomach wall. She says, \"Well, we'd best get moving. I know it's too much to ask that you'd let me out of here, so we only have until I digest to make everything official.\" You walk back into the twins' room where, to your surprise, both are awake and even 'dressed' in matching semi-transparent nightgowns that make their lack of any other clothing sexily obvious.<br>\r\n\"Get in the car, girls. We're going on a little trip,\" You announce. They happily obey, dashing outside and eagerly piling in your car. Once on the road, May directs you to the law firm she uses. It's fortunately a very quiet day at the office, and you are able to walk right up to the receptionist without any delay.<br>\r\nTo your surprise, the young lady at the desk is a girl you know from college, a slim redhead named Dani. You recall she was a non-swallower who survived the shark-pool of the education system by being so unobtrusive and just plain small (from her height to her boobs) that no one noticed her, much less had her on the menu. To your further surprise, she actually greets you by name.<br>\r\n\"Hello, Jason. Never would have expected to see you patronizing a pricey law firm like this place. What do you need?\" Before you can reply, the slightly muffled voice of your aunt says from your slightly bulging middle, \"He's not the one who needs to to business here; I am.\"<br>\r\n\"My apologies, ma'am. Could I have your name?\" Aunt May give it. Dani types it into her computer and asks, \"What services are you in need of today, Mrs. Swanson? I'm afraid your current status as food renders most of your civil rights and thus, our services invalid. On the positive side, all the options still available to you are things I can personally help you with.\"<br>\r\nAunt May replies that she would like to review the details of her will.<br>\r\n\"One moment please,\" Dani says, typing swiftly. \"Which portion of your will would you like to examine?\"<br>\r\n\"Who will inherit my house when I die?\"<br>\r\n\"That would be your two daughters, Emily and Hannah. They each will receive an equal share in the house upon your death. Are they the two girls here with you and Jason?\" You nod. Dani smiles her thanks and goes back to conversing with your stomach. <br>\r\n\"Your daughters are very pretty, Mrs. Swanson. Now, is there anything else you would like me to do for you?\" There is a long pause before Aunt May quietly says, \"I would like to register two new slaves and initiate a property transfer of the same.\" Dani efficiently prints out the necessary paperwork and places it on the desk in front of you.<br>\r\n\"I hope you don't mind, Jason, but would you please fill out and sign these for your aunt? Keep in mind, I am running a recorder right now. If these documents are needed in a court of law and their content differs from what your aunt dictates, there will be serious repercussions,\" Dani says. You fill in names and dates, social security numbers and suchlike. When all the identity proofs have been taken care of, Dani takes the papers back. She explains, \"This next section must be filled out by a legal official, so I'll have to do it. Ok, here we go. Point 1, what is/are the name(s) of the parties entering slavery?\" Your aunt tells her, \"Emily D. Swanson and Hannah J. Swanson.\" Dani raises her eyebrow, but makes no comment on this.<br>\r\n\"Point 2,\" she says, \"are these individuals of age and consensual, underage with consenting guardian, or being coerced by legal sanction?\"<br>\r\n\"Underage, guardian Mabelene Swanson consenting.\" The twins, silent and patient till now, squeeze your midriff from behind, squealing \"thank you, Momma! Thank you so much!\" Dani smiles again at their display of affection before going on, \"Do you wish to immediately transfer ownership of the slaves-to-be to a different party, and if so, to whom?\"<br>\r\n\"Yes,\" May says, \"they will belong to Jason Miller.\" At this, Dani indicates for you to sign your acceptance of the girls's ownership. From there things proceed quickly.<br>\r\n\"Point 3, is this transfer part of a monetary exchange, an item or property-based barter, or a gift?\"<br>\r\n\"Gift\"<br>\r\n\"Point 4, have any parties involved in this transaction ever been charged or convicted in a criminal court? If so, please elaborate.\"<br>\r\n\"No\"<br>\r\n\"Point 5, what degree of slavery are these girls being entered into? There are four official degrees of slavery, each successively higher degree involving an addition to the slaveowner's control over the slave in question. These degrees are as follows.<br>\r\n1) Green- obedience. The owner may demand the slave to perform any legal activity within reasonable estimation of the slave's ability. This does not apply to the slave's own person.<br>\r\n2) Yellow- behavior. The owner may dictate the slave's behavior, including clothing, speech, diet, and hygiene.<br>\r\n3) Orange- body. The owner may physically touch the slave in any way desired, excluding bodily harm.<br>\r\n4) Red- life. The owner may, in a way that a jury of peers can deem humane, kill the slave.<br>\r\nPlease note, all degrees require the slaves to forfeit any property they acquire or own, including inheritance rights.<br>\r\nOrange and red degree slaves pass on their status to their children.<br>\r\nRed degree slaves cannot be freed or moved to a lesser degree.\"<br>\r\n\"Green, definitely green!\" May exclaims fearfully, much to the girls' disappointment. Yours too, but you promised not to complain.<br>\r\n\"One last point. 6, for what purpose are these girls being enslaved? Choose one of the following:<br>\r\nServant<br>\r\nPersonal stripper or courtesan<br>\r\nProstitute<br>\r\nHuman cattle (food)<br>\r\nHuman cattle (breeder)\"<br>\r\n\"Servant\"<br>\r\nDani marks a few other things, orders the papers, and puts forth one final sheet with a line each for your, May's, and Dani's signature.<br>\r\n\"All that's left is for everyone to sign here. Jason, you'll have to sign for May.\" Hands shaking in anticipation, you sign the paper and hand it back. In return, Dani hands you two metallic collars with small green lights on them.<br>\r\n\"Go ahead and place these on Emily and Hannah's necks.\" You carefully clasp them, first around Emily, then around Hannah. The girls help, holding their hair out of the way for you. The collars lock on seamlessly, and Dani announces, \"Congratulations, Jason. You are the proud new owner of two brand-new and extremely cute slaves. Would you like to alter the conditions of their slavery?\" Practically in unison, you, the girls, and Aunt May ask, \"what!?\"<br>\r\n\"You're their new owner, so the previous owner's conditions do not apply. As long as they consent or are subject to certain other exceptions, you can change the terms of their slavery however you like.\" You look at your stomach, thinking the same thing as Aunt May: you can override her restrictions with zero consequences.<br>\r\n</span></div></div>",
            "created":1409634000,
            "id":1851465,
            "title":"Officially yours"
        },
        "155312111111111":{
            "author_id":"wendword",
            "author_name":"Wendword",
            "choices":[
                "Yes, please!",
                "No, thank you"
            ],
            "content":"<div class=\"\"><div> <span>          A bunch of things happen at once. The twins squeak in delight and hug you fiercely, Aunt May begins screaming in protest, and Dani tries to say something, but you can't hear her over the noise. Eventually you calm the girls down enough to hear Dani yelling, \"Would you like something to quiet your stomach?\" It only takes a second for you to make your decision.</span></div></div>",
            "created":1409634000,
            "id":1851467,
            "title":"My girls, my food, my rules"
        },
        "1553121111111111":{
            "author_id":"wendword",
            "author_name":"Wendword",
            "choices":[
                "Pensive",
                "Angry"
            ],
            "content":"<div class=\"\"><div> <span>You nod, not even trying to speak over your food. Who knew someone encased in a stomach could be that loud? Dani hands you what looks like a throat lozenge, which you gratefully swallow down. Within a minute, Aunt May's shouts are eclipsed by the churning and squelching of your gastric system. Another minute, and everything is quieted. All movement in your slightly protruding waist ceases, and it begins to shrink. You thank Dani and turn to address your new property.<br>\r\n\"Say goodbye your mom, girls,\" you tell them. Dutifully they caress and kiss your now-empty belly and chorus, \"Bye, Momma! We hope to see you soon!\"<br>\r\n\"Quite the obedient pair you've got there. You're one lucky guy; getting ones like them on the market costs a fortune,\" Dani comments.<br>\r\n\"I know,\" you reply. \"It'll almost be a pity when I digest them. Speaking of which, would you mark them down as red-class?\" The twins giggle happily as their doom is sealed. A few lines typed into the computer, and their collar lights change to red, and the locks permanently fuse, leaving them forever enslaved in the most degrading and complete way possible. Dani asks, \"Will that be all, Jason?\" You nod and ask what your fee is, but Dani just smiles. She explains, \"Your aunt there was really quite wealthy. When you digested her, all her possessions passed to her daughters, and since they are permanent slaves, it all belongs to you, including her credit with our firm. Trust me, you're more than covered. So if that's everything, you can leave whenever you wish.\" You and the twins head to the door, and you jokingly say over your shoulder, \"Unless you want to join my new slave girls, I think I'm good.\" Glancing back, you can see Dani looks</span></div></div>",
            "created":1409634000,
            "id":1851470,
            "title":"Goodbye, Aunt May"
        },
        "15531211111111111":{
            "author_id":"wendword",
            "author_name":"Wendword",
            "choices":[
                "And I'm taking it!\"",
                "But I'm not one for easy ways out.\""
            ],
            "content":"<div class=\"\"><div> <span>When there is no immediate sign of laughter or anger, you do a double take. Astoundingly, Dani seems to genuinely be contemplating giving herself to you as a slave. You tell Emily and Hannah to wait for you in the car and return to the front desk.<br>\r\n\"What's going on, Dani? You do know I was joking, right?\" You ask. She sighs and shakes her head.<br>\r\n\"Do you realize how bad a position I'm in, Jason? I'm at a minimum wage job, working two shifts a day to try to pay off an impossible college loan debt. Acting mediocre all through college may have helped me avoid notice, but it also made me avoid scholarships too. Take room and board out of my paycheck, and I barely make enough to pay off the monthly interest, much less the overall loans. Worse, one of the big-time lawyers here has threatened to eat me unless I buy or catch him one young girl for lunch every day. I've mostly been able to trick the children of clients into going into his office, but people are catching on! The last week I had to buy him his lunch four days out of five! If that keeps up, I'll be losing more cash working here than I would just living on the streets.\" She takes a moment to catch her breath, and the thought occurs to you that she's been wanting to tell someone this for a long time.<br>\r\n\"Now suddenly you come in, the smart guy, the cool guy, the linebacker everyone adored, the one that girls actually fought over the right to be eaten by. You stroll in, happy as a clam with a woman in your belly, two cute new slaves in your arms, and a family fortune handed to you on a platter. My life sucks and yours doesn't, but you'll be able to live nice and comfortably and you seem like a decent guy, so yeah. Being enslaved to you seems like a way out to me...</span></div></div>",
            "created":1409634000,
            "id":1851471,
            "title":"#nonswallowerstruggles"
        },
        "155312111112":{
            "choices":[
                "Orgy",
                "Rude interruption"
            ],
            "content":"<div class=\"\"><div> <span>\" Hmmmmm\" you ponder about the girls proposal it's tempting but you have a better one. They had so much fun in your belly and it'd be shame for them not to be able to do  it again besides you didn't get a chance to join since you were the pred and a incest orgy sounds like it would be fun, also now that you have been established as the dominant male of the house none of the girls were in a position to argue not to mention they were currently at your mercy. You smile and Say \"Tempting offer girls but I'm gonna say no\" \"What why?!\" They say simultaneously. You grin before flexing your throat and stomach muscles to spontaneously upchuck all three of them<br>\r\nThey land on the floor in front of you nude , slimy and skin glistening with stomach fluids. You instantly get hard seeing your sexy brand new slaves skin wet with your fluids. You aunt is still unconscious but not the girls.Both Hannah and Emily look at you with lust written all over their faces. \"We thought you were going to digest us when you said no but obviously you have something in mind\" said Hannah. \"Why yes I do\" you say standing up taking off your shirt. \"Well what is it ?\" Emily asks massaging one of her large breast while rubbing her pussy with the other hand. You give them a self-satisfied grin as you begin to unbuckle your belt just as May wakes up. \"I was thinking\"......you say pulling down your pants and letting your huge 10 inch cock spring to life free of your boxers \"That 3 slaves are better than two\".</span></div></div>",
            "created":1427518800,
            "id":1955395,
            "title":"You decline "
        },
        "15531211112":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Keep them inside and let them die",
                "Save their lives and stop the flow of acids"
            ],
            "content":"<div class=\"\"><div> <span>\"Here we go, girls,\" you say, releasing your acids. \"Sorry it has to end. I'd love to keep you in my belly forever, but...you know how it is.\" The three females stop their orgy as the clear, burning liquid enters their chamber. At first, the girls are eager to feel what propoganda has said is a clam and enjoyable process. But as soon as their skin touches the fluid, they begin screaming in pain. You sigh sadly as the girls discover the truth of being digested. May paws desperately at the stomach walls. \"Jason, you have to let us go now!\" You stoke her flailing figure, smiling sadly. \"Sorry, Aunty, but the girls wanted this.\" Emily starts sobbing from the pain. \"Jason, I changed my mind. Please let us go. I thought it would be soothing and peaceful, like on TV, but....it hurts! It hurts so much!\" Hannah pipes in, her voice raw from swallowing some acid. \"Please, Jason, help us! Let us go!\" You feel regret, but if you let them out now, there's no telling what state they'll be in. You decide to</span></div></div>",
            "created":1362114000,
            "id":1541679,
            "title":"Enough is enough. Time to die, girls"
        },
        "155312111121":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Order a pizza, and hope for a good-looking delivery girl",
                "Go prowl the town for unsuspecting women"
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry, girls,\" you say, caressing their rapidly disintegrating forms through your flesh. \"But you wanted this. Now you pay the price for leaping before you looked.\" The girls sob and beg and plead, but you ignore them, rubbing your belly. Emily is the first to go, slipping and being completely submerged in the acid. Her eyes melt away, as does her flesh and muscle, fat and organs, turning the acid a light fleshy color. Hannah sees her sister's skull float to the top of the mixture and cries. The acid rises and pours down her throat, digesting the poor girl form the inside. Her heart stops beating, and she slowly slides down the wall, her eyes blank, until being completely submerged. May lasts a bit longer, but in the end, suffers the same fate as the acids completely fill the chamber. You sigh as the three women's bodies melt away, leaving a sloshy, goopy mess with three floating skulls inside. A tear actually falls from your eye, but you wipe it away. You stand up and go to the bathroom, ridding yourself of the last of your relatives. Then, you decide to...</span></div></div>",
            "created":1362114000,
            "id":1541684,
            "title":"Keep them inside and let them die"
        },
        "1553121111211":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Invite her inside",
                "Eat her up right there"
            ],
            "content":"<div class=\"\"><div> <span>Despite having devoured and digested your beloved aunt and cousins, you still feel hungry. You ring up Guido's Pizzeria and ask for a large meat lovers. After about twenty minutes of impatient waiting, you get a knock on the door and heave yourself from the couch. Holding your late aunt's credit card, you walk to the door and open it to see the most gorgeous girl you've ever laid eyes on. Her curly red hair falls to her shoulders, and her perfect skin has a decent scattering of freckles around the nose and cheeks. Her green eyes glitter with interest and humor, as if she'd find anything you say interesting and any joke you tell, no matter how corny, hilarious. She smiled, showing off her perfect white teeth. \"One large meat lover's pizza?\" she asks in a soft voice, with a slight trace of an Irish accent. You smile back as best you can, feeling your knees turn to jello, and...</span></div></div>",
            "created":1362200400,
            "id":1542346,
            "title":"One Pizza to go!"
        },
        "15531211112111":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "You (gulp her down)",
                "You (kiss her)"
            ],
            "content":"<div class=\"\"><div> <span>You stand back and respond, \"Why, yes, it is. Please, come on in. I'll get your money.\" You quickly slipped your aunt's credit card into your pocket so she wouldn't grow suspicious. As she enters, while her back is turned, you lock the door behind her, just in case you decide to eat her after all. You take an appreciative look at her ample backside, then saunter after her into the kitchen. She places the pizza on the counter and turns to him. \"Alright, sir. That'll be thirteen twenty five,\" she says in the same soft, gentle voice as before. You step up to the girl, towering over her by almost five inches, and lean down. You whisper, \"I don't want the pizza. I want...\"</span></div></div>",
            "created":1362200400,
            "id":1542351,
            "title":"Come on in!"
        },
        "155312111121111":{
            "author_id":"atreides213",
            "author_name":"TheStatue",
            "choices":[
                "Be kind and let her go",
                "Tease and caress her as she digests"
            ],
            "content":"<div class=\"\"><div> <span>The poor girl barely has time to register what is happening before you kiss her full on the lips. her green eyes widen, first in shock, then in horror as you engulf her head. You begin stripping her slowly with her head in your mouth. No need to rush, after all. She's yours now. You run your tongue slowly, sensually across her face. Her smooth, perfect cheeks, her cute nose. You taste tears as you lick under her eyes and almost feel sorry for her. You're finished stripping her now and pause to admire her gorgeous body. Her skin is smooth and flawless, and she has long legs, a large ass, and big boobs. Truly a treat. You suck her in further, and her perfect little head goes into your throat as her breasts enter your moth. You lick over them hungrily, taking in her flavor. Her nipples harden and she moans slightly, then whimpers again in fear. You swallow her up to her waist and venture your tongue into her nether lips. Her legs kick, her toes clench, and her entire body squirms in arousal. Once she comes, you continue swallowing her, licking her perfect thighs and succulent calves. Finally, only her perfect, dainty feet are left. You close your mouth around them and lick them thoroughly, making the girl laugh again. Then you take one last gulp and send her down. She enters your belly and curls into the fetal position, sobbing. You pat your belly. \"Come on. Don't cry. You were delicious.\" \"Is that supposed to make me feel better?\" she yells. \"I'm going to die in here!\" You feel a bit sad, but you don't really want to give up your meal now, do you? You can hear her cry out as the acids begin to work. What to do?</span></div></div>",
            "created":1362200400,
            "id":1542468,
            "title":"I want you *gulp*"
        },
        "155312111121112":{
            "choices":[
                "Take You? (GULP!)",
                "A Special Girl deserves special treatment( do her in your aunt's room)"
            ],
            "content":"<div class=\"\"><div> <span>You swiftly yet gently  place your lips on hers in a passionate kiss, she makes a small noise of surprise before she begins to relax and kiss back with just as much passion, grabbing you behind the head to deepen the kiss. You rub your tongue against her lips  wanting an invitation inside of her mouth, which she is all to happy to give, opening her mouth to deepen the kiss  even further and allow your tongues to lustfully wrestle for dominance in each others mouths.<br>\r\nYou and her continue to explore each others mouth for five minutes before you both pull away to breath in some much needed air. Your press your forehead against hers, and pull her closer to you grinding your hips into hers. She looks deeply into your eyes, her own filled with lust and wonder. She absently moves her hand from behind your head , down your torso and eventually to your cock, which has tented the front of your pants. She gasps again feeling how aroused you are, and you almost cum prematurely feeling her soft hands rub your sore erection through the fabric. Feeling the need to return the favor ,you begin to fondle and massage her huge plump breasts through her shirt making her moan ecstatically. Unable to wait contain yourself any longer you savagely tear her clothes off leaving her nude as the day she was born and finally  revealing her goddess like body. Her skin is  smooth and picture-perfect, and she has perfect large round ass ,  amazing long legs and her enormous HH cup tits. Truly you have found the perfect woman. You grab her again and resume kissing her in a animalistic way, this time however she jumps and straddles you, wrapping her legs around your waist and clutching your head ,running her hands through your hair. You both fall over and land on the couch with her on top of you. She then proceeds to shred your clothes in a similar  manner that you did hers. She grabs your cock in her hands and slowly strokes it, causing some pre-cum to leak onto her hand. Leaning down she thirstily licked the head of your cock sensually before taking the whole thing into her mouth. Your eyes roll into the back of your head  as she bobs her head up and down, practically swallowing your manhood whole. Just as your about to explode she releases you and wraps her massive boobs around your penis and massaging it between her tits. You lean back and moan as she begins massaging even faster until you finally explode in her face.<br>\r\nShe licks the semen off her face and lies down on you. She kisses you lustfully and says in a sultry voice \"Take me now \"</span></div></div>",
            "created":1407128400,
            "id":1837153,
            "title":"You (kiss her)"
        },
        "1553121111212":{
            "author_id":"wiztech46",
            "author_name":"Wizard",
            "choices":[
                "Your twin cousins: they are both reformers",
                "Your crush: SW"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You go to prowl for some more women to eat at the mall. A few girls catch your eye and you're contemplating witch one to eat.  Then you start to hear your phone ring. You awnser it and it's...</span></div></span></div>",
            "created":1381294800,
            "id":1676655,
            "title":"Go prowl the town for unsuspecting women"
        },
        "15533":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Someone wants to eat you",
                "Someone wants to hire you"
            ],
            "content":"<div class=\"\"><div> <span>You finish the add in Microsoft paint as you sigh in relief. The entire weekend you were trying to use your newly found ability to not be digested to gain a profit. You thought that this would be it, a business in which you charged a hefty fine to go down the throat of any woman that would want you to. It would be tough work, but it would be lucrative. At the end of the ad you make sure that you say \"Open to employment in larger companies\" in order to let those executives out there that you would be willing to work for them.<br>\r\n<br>\r\n You save the image to your desktop and open craigslist in chrome, posting the advertisement on the website. You then print out hundreds of copies and set them in a stack, before checking your email to see</span></div></div>",
            "created":1461992400,
            "id":2141325,
            "title":"NS, You, 18, Jason; found out you can't be ..."
        }
    },
    "info":{
        "author_id":"writerlord",
        "author_name":"OBusywriter",
        "brief_description":"Are you a hungry guy or girl, or person trying to stay out of people's bellies.",
        "created":1194229140,
        "description":"<td align=\"left\" class=\"norm\">          In this world a new power has arisen.  Almost fifty percent of the people in the world have the power to swallow other people whole. Now there are some regulations that are put into place so that there isn't total chaos.  People are not allowed to eat people that have the power.  The power doesn't come out in people until the age of fifteen, so people fourteen and under are off limits for swallowing.  The very sick crime of a guy eating a guy is punishable by death, by having a jug of acid poured on the criminal slowly until he is dead.  Girls eating girls is just fine. Since this power appears when teens enter high school, graduation numbers are down. The Seniors usually have a contest to see who can eat the most underclassmen before graduation. There are restaurants that capture unsuspecting people and put them on the menu for the people with the power; some restaurants just do that like a sushi restaurant for people with the power.<br>\r\n<br>\r\nRules:<br>\r\n1.) NO Gay stuff. So no guys eating guys;;; girls eating girls is just fine, since it is hot.<br>\r\n2.)No animals. No furries, scalies, and whatever else.<br>\r\n3.)The minimum age for characters is 15 years old, the maximum age is 35. When the main character is a guy, there are to be no other guys in that branch of the interactive. If the main character is a girl, there can be only one guy at a time, so if you want to add a second guy, kill the first one off or have him move away or whatever, just, no having two guys in the same scene.<br>\r\n4.)Along with the age thing, it means nobody that is under or over the age limit is to be in or mentioned in the chapter.<br>\r\n5.)Editions are to be written in the second person perspective; example, \"You went to find help.\"<br>\r\n6.)Editions must be at least six sentences long, (i.e. A paragraph). Be descriptive. Description is what gives a story substance. Use adjectives and adverbs, they make a story more in-depth and interesting, like you were actually there experiencing it.<br>\r\n7.)Spell and grammatical check editions before adding them, I will not tolerate misspellings and grammatical errors.<br>\r\n<br>\r\nFollow the rules perfectly and I won't delete. Have fun.</td>",
        "id":1343187,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602039000,
        "modified":1602039000,
        "pretty_title":"Incredible World Of Vore"
    }
}