{
    "chapters":{
        "1":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "Water Goddess",
                "Earth Goddess",
                "Wind Goddess",
                "Fire Goddess",
                "Lighting Goddess"
            ],
            "content":"<div class=\"\"><div> <span>Victorian Oriental Reform Education Academy for girls is a prestigious school with high class facilities but the dubious rep of being the last stop for delinquent girls from across Asia and the Pacific ring. It sit on its own inland in the center of a lake in the Japan's main inland. There was once was a shrine here but it was burned down in fire, whats left of the main shrine is on the hill behind the school. While the main building foundations was used as par of the schools construction. the school is 4 bildings, student dorms, school building, the gym building, and teachers dorm. other land marks are the shrine ruins top of the hill the abandoned mansion/castle of the miner lord that ruled the lake original opposite of the school the grave yard and the ferry dock. witch runs to the farming town and back 3 times a day 4 days a week, tuesday, thursday, saturday and Sunday.<br>\r\n<br>\r\n<br>\r\nThe Goddess each have a aliened element, also beside each chosen weapon they all carry Katana and Wakizashi.<br>\r\n<br>\r\nWater Goddess is a grate white scaled Naga with vary large breast (Fcup), red eyes pail skin and long white hair. Her weapon is a Naginata. <br>\r\n<br>\r\nEarth Goddess is a Bakaneko with short red hair and fur, two tails and green eyes. Her weapon is a Kau Sin Ke.<br>\r\n<br>\r\nWind Goddess is a fearsome Tengu with black fathers and blue eyes, she has feet ands like a birds feet and wings of her back. Her weapon is a pair of twin Tessen (war fans).<br>\r\n<br>\r\nFire Goddess is a lovely Kitsune with gold and white fur, white eyes, blond hair done like a geisha and nine tails. Her weapon is a Yumi bow. <br>\r\n<br>\r\nLighting Goddess is a Oni looks human with blueish skin and 3 small yellow horns on her fore head, shor black hais and golden eyes, Her weapon is a Kanabo. <br>\r\n<br>\r\nAgroup of girls brake curfue to go to the hill top shrine, but thing are about to go vary badly for the girls.<br>\r\n<br>\r\nAtthe top of a forgoten and over growen stone stear cace is a large arch in frount of a old shrine the shrine is a single one room hut with a sliding door covered in sutras. In froun of the door is a old bell and offering box as well as the remains of inceacens sticks and other offering by more religes girls of the school.<br>\r\n<br>\r\nWitch do they free?</span></div></div>",
            "created":1321246800,
            "id":1223001,
            "title":"Awakening"
        },
        "11":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "She eats all of them",
                "she eat 2 posses the 3rd",
                "she posses one and enslaves the other 2 ",
                "She enslaves all 3",
                "She eats one posses the one and enslaves the last one."
            ],
            "content":"<div class=\"\"><div> <span>3 girls wallked up to the shrin from the school.They all had the schools unform a white bluse black skirt red neckerchif and kneesocks with black shoes. <br>\r\n<br>\r\n\"Are you sure its a good idea to come up here isint this place sacred or some thing?\" asked Jen a blond girl clearly from a ameracen famly.<br>\r\n<br>\r\n\"Jan you got sent here cause you spared the word terrest on a moasc on the bace you dady is station at. Why would you cear?\" Said Kokoro who had a lit ciguret between her lips (Kokoro is baced of late 80s shoolgirl delinqent witch often smoked just like the high schoolers in 50s movies in the USA)<br>\r\n<br>\r\n\"Thats diffrent. Beside i keep hearing scary stories about these old shrines, curese and evil spirets and sach.\" said Jen<br>\r\n<br>\r\n\"There not true i come here evey night befor test to pray to budda.\" said Chun-Li who had short red hair and was from china (her father was a Srteet fighter fan)<br>\r\n<br>\r\n\"I though its a Shinto shrine?\" askked Jen puzzled.<br>\r\n<br>\r\n\"It is but, I think the spirets don't mind to mach. I always get A's on my tests so, I think there happy to get offerings at all in these times.\" said Chun-Li<br>\r\n<br>\r\nThey looked at the offering box, incents bowl and bell. Then Chun-Li pulled out a incents stick and lit it of Kokoros ciguret. She then set in the bowl to burn droped a coin in the box claped twice and rang the bell 3 time then claped again. <br>\r\n<br>\r\n(to any one reading this that better knowes shinto religen and prayer rites or how japanese shrin work pls dont be ofaned i only have what i seen in anime and manga so if you see any thing wrong in what was portrayed dont hesate to on site emial me with what it is.)<br>\r\n<br>\r\n\"What in side?\" asked Jen pointing to the doors sealed with a sutras.<br>\r\n<br>\r\nChun-Li shruged and Kokoro said \"Not sure realy never been in, looks like no one has for years.\" <br>\r\n<br>\r\nJen went up to the door her curiosty over comin her earlyer fears. \"Hay dont do that im not that rilages but brake seals is realy bad idea and karma.\" said Kokoro looking nervus. Then there was a pop as the sutras broke and the door slid open. The room lookas if it was brad new as if time left it alone. In side was 5 small shrines boxes each sealed and each painted depicting a goddess and had a weapons in frount of them on a stand.<br>\r\n<br>\r\nOne caught the eye of the girls. It had the picture of a albino naga with red eye and masive breasts in the robes of a pristess in white and blue colors. In her hand was the naginata and the 2 swords on her hips. She was portraed against a raging sea. the picture was partly covered be a stra on the door. \"Hay check the spear looking thing...\" Said Jen as she grabed it.<br>\r\n<br>\r\nThe moment she did the mini water shrin started to shake and its door poped open with a rush of watter sending the girls out of the shrin building. they coughed and clear there eye only to see they wher in circled by the naga who had the swords on her hip. \"My Naginata!\" The naga comaned holdin out her hand to Jen that still held it. <br>\r\n<br>\r\nJen giggles \"Um sarry it looks cool.\" she said handing it to her. <br>\r\n<br>\r\n\"No that im free what should i do with you girl.....\" said the naga<br>\r\n<br>\r\nThe 3 girls gulp in fear.</span></div></div>",
            "created":1321430520,
            "id":1223889,
            "title":"Water Goddess"
        },
        "112":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "Jen the blond amercan girl",
                "Kokoro the thug naitive to japan",
                "Chun-Li unwanted girl twin sent to be raised by a realtive that is a teacher"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm vary hungry but im also week still.\" she waped her tail around the girls \"One of you will host me and the other will fill my hunger.\" said the goddess<br>\r\n<br>\r\n\"Wait please don't if we just disapier people will ask questions.... \" Said Chun-Li <br>\r\n<br>\r\nThe naga goddess spoke \"Oh realy whe'll see about that but first who will be my host.\" she looked over the girls \"Your from china and have given many offerings... Tho un wanted cause your wher born as the female second twin.\" she gave Chun-Li breast a sques as she said that. \"You on the other hand are thug and roughfion, People fear you and would not notice a change in the way you act or question if you had a weapon.\"  her tail squesed Kokoros ass. \"Last theres the fariner. Your exotic i like that and your of a miltary famly you parints made you keep in shape.\" she kissed Jen after she said that.<br>\r\n<br>\r\nThe goddes grines and picks</span></div></div>",
            "created":1321523340,
            "id":1224306,
            "title":"she eat 2 posses the 3rd"
        },
        "1123":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "goes to the dock to ",
                "goes to the school to eat (or 3 months later in the school)",
                "goes to the castle  (or 2 weeks later in the abandoned castle)"
            ],
            "content":"<div class=\"\"><div> <span>\"You Chinese girl I'll spare your life in return you'll be my host\" Said the naga. <br>\r\n<br>\r\n\"But My friends?\" Chun-Li protests<br>\r\n<br>\r\n\"Don't wary they will be with you i ll hold on to there souls....\" The naga looked a Jen and Kokoro and lined in close. \"I think I'll start with the exotic meal.\" <br>\r\n<br>\r\nHer jaws opened wide as she lifted Jen to her open maw. \"No please i freed you remember. Ples-MMMMffffff\" was the last wards Chun_li heard before the nagas maw close over Jen's head and shoulder. The water goddess did not have the strength to saver her meal so she just eat her quickly in 5 gulps Jen was struggling on her way in to the nagas depths. <br>\r\n<br>\r\n\"She was tasty i might res her later to enjoy her right. Now for seconds!\" she Looked at Kokoro with hungry eyes <br>\r\n<br>\r\n\"Fuck my life i die, eaten a live by a myth.\" said Kokoro as she looked in to the nagas gaping maw. Chun-Li watched as her second friend was wolfed down the nagas hunger gullet.<br>\r\n<br>\r\n\"Kokoro,.... Jen.........\" Said Chun-Li as she looked at the bulges as they squirmed in the nagas coils and rubbed past her.<br>\r\n<br>\r\n\"No litle one Kiss me.....\" Chun-Li gave in knowing struggling was point less....... ther lips touched and Chun-Li's eyes glowed red and her breasts swelled as the Naga glowed and vanished.<br>\r\n<br>\r\nChun-Li's Possessed body walked down the stairs her eyes now red and having a larger bust size. \"My i missed a lot over the years haven't I Chun-Li. You room mate seems fun i might make her a slave after i regain my full strength.\" Chun-Li grounded in her head *I should have goon to the buddhist temple in town...* \"Dont be that way now you can repay me for all the help on those tests.\" said the goddess in Chun-Li's vice</span></div></div>",
            "created":1321547040,
            "id":1224363,
            "title":"Chun-Li Possessed by the Water goddess"
        },
        "11232":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "Sex then soul vore",
                "yuri 3 way domation Chun-Li and Sakura worship her."
            ],
            "content":"<div class=\"\"><div> <span>(P.= Possessed)<br>\r\n<br>\r\nP.Chun-Li was got som stairs for the new breasts and when asked she simply said she prayed and was rewarded. The reactions of the other girl amused the Water goddess useing Chun-Li to no end. It was even more fun that her room mate, a local girl named Sakura, was a in thraled with fighting games and her host sheard the name of a charicter from one of the games. And mach to her host dismay the naga agrred to dress in fighing game cossplay with Sakura. <br>\r\n<br>\r\n\"Oh! Wow! It's so tight a fit on me.\" said the goddess in Chun-Li's body As she rubbed her hips and set one foot on Sakura bed. In side Chun-Li her mind was goning mad as the goddess made her flirt with Sakura. She lined in smiling \"Dose it fit me well. If so I'd like a little fun in return.\" her lage slide behind Sakura and P.Chun-Li pushed her crouch to Sakura's belly. <br>\r\n<br>\r\nSakrua blushed bright red. \"Ch-Ch-Chun-Li son....... Its perfect, your perfect.\" said Sakura as she huged P.Chun-Li and pushed her face to P.Chun-Li bust warped in Chinese silk. \"I'm yours do what ever you want of me. My Goddess.\" <br>\r\n<br>\r\nP.Chun-Li grined and huged her presing Sakura's face thight to P.Chun-Li's breasts. \"Anything i want well then I'll enjoy you.\" <br>\r\n<br>\r\nWhat dose the naga do<br>\r\n<br>\r\nShe kills her and eat her soul after sex.<br>\r\n<br>\r\nShe reviles her self fand has her way with both girls and Sakura pledges her self to be the water goddess's pristes.</span></div></div>",
            "created":1321576920,
            "id":1224588,
            "title":"water goddess in school"
        },
        "112322":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "Sakura rushes  head frist in",
                "Sakura heastaets and the Naga acts befor Sakura can speake "
            ],
            "content":"<div class=\"\"><div> <span>\"I have some thing to show you.\" said P.Chun-Li then her eyes glowed and ther was a flash of light and the Naga water goddess and coiled around the 2 girls.<br>\r\n<br>\r\nChun-Li blinke her body and eyes stay as they had been altered \"Ahhh so tight, it rubs my nipoles when i move....\" Said chun-Li at the shock of the retrun of her senes.<br>\r\n<br>\r\n\"Who- what are you?\" aske a shocked Sakura as she marvuled.<br>\r\n<br>\r\nthe Naga \"Im Your goddess I am using her for a human form. If you will give your self Me and i'll make sure Chun-Li is your fantacy as long as you keep me happy as my Pristess.\" she smiled <br>\r\n<br>\r\nSakura marvuled at the goddess then bowed down before her. \"Im yours! My Goddess! Faver me as with your blessing i pray to you. I offer you my vary body and Soul.\" Sakura was in thraled she wanted the goddess to take for any resson.<br>\r\n<br>\r\n\"I'll test that then I'll give you a test to please me is you fale or heastaet you will be my slave and i well do any thing I want with you tell i get bord and eat you like i did the others. If you do as I ask you will be rewarded.\" <br>\r\n<br>\r\nChun-Li laid softly mouning as she was rubed between the coils.<br>\r\n<br>\r\nSakura looked up \"What would you ask of your Servent? My Goddess!\" she said.<br>\r\n<br>\r\n\"Crawl in to my womb and swalow the egg in ther it will conect you to me alowing me to move my power through you.\" She moved her clothing to reveal her wet cunt. </span></div></div>",
            "created":1321597680,
            "id":1224747,
            "title":"yuri 3 way domation Chun-Li and Sakura worship ..."
        },
        "113":{
            "author_id":"topbeehler",
            "author_name":"TopBeehler",
            "choices":[
                "The Naga wants to know how the world has changed and show her around.",
                "The Naga wants to find a sexier host so she will attract more slave girls.",
                "The Naga wants to eat more souls to regain her power and rule the School."
            ],
            "content":"<div class=\"\"><div> <span> \"I think it's time I get to know this strange new world.But I can't go around like this.I need a host.Who wants to be my host?\"The naga said.\"You're clearly the most attractive one so you will be my host.\"<br>\r\n<br>\r\n\"Who,Me?\"Chun-Li asked.<br>\r\n<br>\r\n\"Yes,and the other girls will be my slaves.\"The Naga said.<br>\r\n<br>\r\n\"Wait a minute!I'm not going to be anybodies slave!\"Jen yelled out.<br>\r\n<br>\r\n\"Then I'll eat your body and soul instead.\"The naga said as she brought her face up to Jen.<br>\r\n<br>\r\n\"No thanks I'm good.\"Jen quickly said.<br>\r\n<br>\r\n\"Good,now time to get in my new body.First I'll have remove that soul to make room.\"The naga said.<br>\r\n<br>\r\nThe naga lifted up her Naginata and said a weird chant.Then the Naga stabbed Chun-Li.Both the girls watched in shock at what was happening.<br>\r\n<br>\r\n\"Why did you do that?!\"Kokoro asked.<br>\r\n<br>\r\n\"Don't worry,her body was unharmed but I removed her soul by cutting it's link to her body.\"The Naga said as she lifted Chun-Li's soul up to her face.<br>\r\n<br>\r\nThen he naga opened her mouth and put the glowing blue soul in her mouth.She licked it and sucked on it before finally swallowing it down.The soul landed in her stomach and it made her stomach give off a blue glow.<br>\r\n<br>\r\n\"Now that was perfect.Don't worry,Your friend is just find.I only trapped her in my stomach.I think I'll keep her in me as a reminder of what I can do to you girls if you dis obey me.Now It's time for me to get in my host.\"The naga said as she looked at Chun-Li's body.<br>\r\n<br>\r\nThe naga jumped at Chun-Li's body and a huge glow filled the room.Jen and Kokoro looked away for a second and when thay looked back Chun-Li's body was up again.<br>\r\n<br>\r\n\"This will do for now.I look just like that busty girl.Now you two!I have a job for you.\"The Naga said.<br>\r\n<br>\r\n\"What do you want\"Kokoro asked trying not to get the naga mad.<br>\r\n<br>\r\nThe naga smiled and said.....</span></div></div>",
            "created":1322348760,
            "id":1229815,
            "title":"she posses one and enslaves the other 2 "
        },
        "1132":{
            "author_id":"topbeehler",
            "author_name":"TopBeehler",
            "choices":[
                "Thay steal a boat and go to Japan's main island.",
                "The Naga uses magic to take them to Japan quickly.",
                "The Naga will wait untill she is at full strangth to go get a new host."
            ],
            "content":"<div class=\"\"><div> <span> \"I need to find a better host,This one is nice but I need one that will make everyone want to serve me.\"The Naga said as she grabbed her new breast.<br>\r\n<br>\r\n\"What kind of host do you want?Jen asked.<br>\r\n<br>\r\n\"Something that is beautiful but strong.It needs to also be someone people know.\"The naga said as she walked up to the girls.<br>\r\n<br>\r\n\"Wait!I think I know just the host.\"Kokoro said as she reached in her bag.<br>\r\n<br>\r\nKokoro pulled out a magazine with women on it.She flipped to a page and showed the naga.<br>\r\n<br>\r\n\"This is Miyabi Isshiki.She is a Gravure model and very sexy.Will she be a good host?\"Kokoro asked.<br>\r\n<br>\r\n\"Yes,She is perfect.That's a good slave.Maybe when I take over the Island I'll let you live in my Temple instead of my gut.\"The naga said.<br>\r\n<br>\r\n\"But Miyabi lives on the main land of Japan.We'll have to leave this island and go to the main land.\"Jen said.<br>\r\n<br>\r\n\"Then we'll head to Japan's main island right away.\"The naga said.<br>\r\n<br>\r\n\"How will we get there?\"Jen asked.<br>\r\n<br>\r\n\"Let me take care of that.\"The naga said.....</span></div></div>",
            "created":1322350740,
            "id":1229835,
            "title":"Body shopping."
        },
        "11323":{
            "author_id":"topbeehler",
            "author_name":"TopBeehler",
            "choices":[
                "The naga ate Jen then took Kokoro to japan to find Miyabi Isshiki",
                "Jen awakened another goddess and hoped it would save her."
            ],
            "content":"<div class=\"\"><div> <span> The naga starts to chant and her body starts glow.Then the naga just stopped and so did the glowing.<br>\r\n<br>\r\n\"What's wrong?\"Jen asked.<br>\r\n<br>\r\n\"My magic has grow weak over the years.I need to eat more to get my strangth up.\"The naga said.\"Bring me some tasty humens from your school.\"<br>\r\n<br>\r\n\"Fine,but I want something in return.\"Jen said.<br>\r\n<br>\r\n\"How about I let you live.\"The naga said.<br>\r\n<br>\r\n\"I want to be a goddess too.\"Jen demanded.<br>\r\n<br>\r\n\"You will never be a goddess.now go and bring me meny tasty young girls.\"The naga demanded.<br>\r\n<br>\r\nJen and Kokoro left the temple but the naga decided to stay and learn how to use her new body better.The girls walked back to the school.<br>\r\n<br>\r\n\"We better find alot of girls or we might be eaten.\"Kokoro said.<br>\r\n<br>\r\n\"No way.That naga is just a bitch.We don't need to lisson to her.\"Jen said trying to act cool.<br>\r\n<br>\r\nThe next night Jen and Kokoro headed back to the temple.Kokoro tricked 6 sexy girls to go with her.Jen didn't bring anyone.When the girls got to the temple thay walked inside and the door closed behind them.<br>\r\n<br>\r\n\"Well come back my sevents.\"The naga said still in Chun-li's body.<br>\r\n<br>\r\n\"I brought you alot of food.Kokoro said.<br>\r\n<br>\r\n\"Thank you.You will be rewarded for the work you have done.\"The naga said to Kokoro.<br>\r\n<br>\r\n\"But where are your girls?\"The naga said to Jen.<br>\r\n<br>\r\n\"I didn't bring any.I don't need to lisson to you.\"Jen said.<br>\r\n<br>\r\n\"You will be punished for this.Now time to eat.\"Just then the Naga came out of Chun-li's body and all of the girls started to scream and panic.<br>\r\n<br>\r\nThe naga wrapped her tail around a few of them and began to swallow them alive.The naga quickly swallowed all of the girls and her stomach was alittle swollen and jiggled as the girls tried to get free.Then the naga looked at Jen.<br>\r\n<br>\r\n\"You are next.Once I eat you I will have enough energy to go to japan.\"The naga said.<br>\r\n<br>\r\nJen started to panic and ran.But the naga was to fast.Jen ran as fast as she could and then.....</span></div></div>",
            "created":1323519660,
            "id":1237446,
            "title":"The Need to Feed"
        },
        "12":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "She eats all of them",
                "she eat 2 posses the 3rd",
                "she posses one and enslaves the other 2 ",
                "She enslaves all 3",
                "She eats one posses the one and enslaves the last one."
            ],
            "content":"<div class=\"\"><div> <span>3 girls wallked up to the shrin from the school.They all had the schools unform a white bluse black skirt red neckerchif and kneesocks with black shoes. <br>\r\n<br>\r\n\"Are you sure its a good idea to come up here isint this place sacred or some thing?\" asked Jen a blond girl clearly from a ameracen famly.<br>\r\n<br>\r\n\"Jan you got sent here cause you spared the word terrest on a moasc on the bace you dady is station at. Why would you cear?\" Said Kokoro who had a lit ciguret between her lips (Kokoro is baced of late 80s shoolgirl delinqent witch often smoked just like the high schoolers in 50s movies in the USA)<br>\r\n<br>\r\n\"Thats diffrent. Beside i keep hearing scary stories about these old shrines, curese and evil spirets and sach.\" said Jen<br>\r\n<br>\r\n\"There not true i come here evey night befor test to pray to budda.\" said Chun-Li who had short red hair and was from china (her father was a Srteet fighter fan)<br>\r\n<br>\r\n\"I though its a Shinto shrine?\" askked Jen puzzled.<br>\r\n<br>\r\n\"It is but, I think the spirets don't mind to mach. I always get A's on my tests so, I think there happy to get offerings at all in these times.\" said Chun-Li<br>\r\n<br>\r\nThey looked at the offering box, incents bowl and bell. Then Chun-Li pulled out a incents stick and lit it of Kokoros ciguret. She then set in the bowl to burn droped a coin in the box claped twice and rang the bell 3 time then claped again. <br>\r\n<br>\r\n(to any one reading this that better knowes shinto religen and prayer rites or how japanese shrin work pls dont be ofaned i only have what i seen in anime and manga so if you see any thing wrong in what was portrayed dont hesate to on site emial me with what it is.)<br>\r\n<br>\r\n\"What in side?\" asked Jen pointing to the doors sealed with a sutras.<br>\r\n<br>\r\nChun-Li shruged and Kokoro said \"Not sure realy never been in, looks like no one has for years.\" <br>\r\n<br>\r\nJen went up to the door her curiosty over comin her earlyer fears. \"Hay dont do that im not that rilages but brake seals is realy bad idea and karma.\" said Kokoro looking nervus. Then there was a pop as the sutras broke and the door slid open. The room lookas if it was brad new as if time left it alone. In side was 5 small shrines boxes each sealed and each painted depicting a goddess and had a weapons in frount of them on a stand.<br>\r\n<br>\r\n\"Wooh! Check the Kau Sin Ke!\" Said Kokoro as she grabed what looked like a kuma with a chain and waight on it. It was in froun of a mini shrine that had the image of a Bakaneko witch looked like a red furred cat girl with 2 tails and green eyes, wearing a brown ninja outfit standing on a mounten top. She was holding the Kau Sin Ke in her hands with the wight spining and the 2 swords on her back one low on her hip the other longer one cross her back. When Kokoro pickked up the weapon the whole place shook and the seal on the mini shrine snaped and doors flew open there was cloud of dirt, sand and dust that drove the gils from the room shrine. <br>\r\n<br>\r\n\"What the Hell!\" Shouted Kokoro from behind the other 2 girls looked over to see the Kokoro was on the ground with a Wakizashi pionted at her throat and the bakaneko stralting her. <br>\r\n<br>\r\n\"Drop my weapon and I may spair your life Little girl!\" Kokoro did as was told her eyes locked to the gaze of the earth goddess green eyes. the goddess reclamed her weapon then......</span></div></div>",
            "created":1321435620,
            "id":1223897,
            "title":"Earth Goddess"
        },
        "122":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "in school Kokoro in cuntrol willing partnur to the Bakaneko",
                "in the castle bakaneko having fun with the horny thug girl",
                "in school shes come out as lesbion and is forcing hoter girl to be her play toys"
            ],
            "content":"<div class=\"\"><div> <span>The Goddess sheathed her weapon and garbed the Kau Sin Ke. Then laid on top of Kokoro \"I'll barrow you for a time, hope you don't mind.\" With that said the Earth goddess kissed Kokoro then started to crumble to dust over her. P.Kokoro Sat up pulled out a smoke and lit it. <br>\r\n<br>\r\nChun-Li steped forward \"Kokoro you O-\" Her qrestion was cut short buy P.Kokoro grabing her throat. \"Let.... go.. Ko.....ko...\" Chun-Li was choking in P.Kokoros grip. Kokoros eyes changed to green the tips of her hair went red her nails grew longer. <br>\r\n<br>\r\nP.Kokoro Spoke \"Don't warry i wont choke you but you Friend here has some dark dreams she fantasizes about having her way with you.... So I'll let her feel you in her arms as  I kIss you and swallow your soul and hid it in her then I'll have her eat your body to nurish me.\" She took her cigaret out from her lips before kissing Chun-Li. Chun-Li's eye roled back and she went limp. P.Kokoro Swallowed then let her drop to the ground and trunned to Jen.<br>\r\n<br>\r\nJen started to run then some thing caught her in the shoulder and yanked her off her feet. \"Your not exsacping eather.\" Said the Earth goddess in Kokoro she pulled out the blade of her Kau Sin Ke. Jen felt her self shrining the before being picked up. She was now 6 inches tall and next to the 6 inche souless body of Chun-Li. P.Kokoro licked her slips then pusthe them in to her mouth head frist and sawllowed both at onced in 2 gulps. <br>\r\n<br>\r\nJen kicked and scremed in P.Kokoro as she was digested. P.Kokoro rubed her belly. \"See my toy I knew youed enjoy it......\" <br>\r\n<br>\r\nIn her Mind Kokoro was mouning *Chun in my nethers a warm feeling so good and the tast of fleash.... the scent of blood... I feel so alive.*</span></div></div>",
            "created":1321713420,
            "id":1225456,
            "title":"she eat 2 possessed the 3rd"
        },
        "13":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "She eats all of them",
                "she eat 2 posses the 3rd",
                "she posses one and enslaves the other 2 ",
                "She enslaves all 3",
                "She eats one posses the one and enslaves the last one."
            ],
            "content":"<div class=\"\"><div> <span>3 girls wallked up to the shrin from the school.They all had the schools unform a white bluse black skirt red neckerchif and kneesocks with black shoes. <br>\r\n<br>\r\n\"Are you sure its a good idea to come up here isint this place sacred or some thing?\" asked Jen a blond girl clearly from a ameracen famly.<br>\r\n <br>\r\n\"Jan you got sent here cause you spared the word terrest on a moasc on the bace you dady is station at. Why would you cear?\" Said Kokoro who had a lit ciguret between her lips (Kokoro is baced of late 80s shoolgirl delinqent witch often smoked just like the high schoolers in 50s movies in the USA)<br>\r\n <br>\r\n\"Thats diffrent. Beside i keep hearing scary stories about these old shrines, curese and evil spirets and sach.\" said Jen<br>\r\n <br>\r\n\"There not true i come here evey night befor test to pray to budda.\" said Chun-Li who had short red hair and was from china (her father was a Srteet fighter fan)<br>\r\n <br>\r\n\"I though its a Shinto shrine?\" askked Jen puzzled.<br>\r\n <br>\r\n\"It is but, I think the spirets don't mind to mach. I always get A's on my tests so, I think there happy to get offerings at all in these times.\" said Chun-Li<br>\r\n <br>\r\nThey looked at the offering box, incents bowl and bell. Then Chun-Li pulled out a incents stick and lit it of Kokoros ciguret. She then set in the bowl to burn droped a coin in the box claped twice and rang the bell 3 time then claped again. <br>\r\n<br>\r\n(to any one reading this that better knowes shinto religen and prayer rites or how japanese shrin work pls dont be ofaned i only have what i seen in anime and manga so if you see any thing wrong in what was portrayed dont hesate to on site emial me with what it is.)<br>\r\n <br>\r\n\"What in side?\" asked Jen pointing to the doors sealed with a sutras.<br>\r\n <br>\r\nChun-Li shruged and Kokoro said \"Not sure realy never been in, looks like no one has for years.\" <br>\r\n<br>\r\nJen went up to the door her curiosty over comin her earlyer fears. \"Hay dont do that im not that rilages but brake seals is realy bad idea and karma.\" said Kokoro looking nervus. Then there was a pop as the sutras broke and the door slid open. The room lookas if it was brad new as if time left it alone. In side was 5 small shrines boxes each sealed and each painted depicting a goddess and had a weapons in frount of them on a stand.<br>\r\n <br>\r\nChun-Li Looked around in aw with the other girls \"These are seald shrines ment to hold spirets traped in side them. But why are they here in a shrine of wership?\" said Chun-Li as she set her hands on a fan in frount of a mini shrine, that had the image of a black feathered tengu with blue eyes wearing green samuri armor holding 2 fans with its wing spred and a sysclone behind her. The next thing the girls know the mini shrine pops open and a powerful wind fills the room pining them to a wall. A black feathered tengu with blue eyes manafested before them. The girls watched in shock and aw as the goddess took her weapons. She then looked at them. \"Thank you for freeing me but im still week.\" said the wind goddess<br>\r\n<br>\r\nThen</span></div></div>",
            "created":1321440000,
            "id":1223904,
            "title":"Wind Goddess"
        },
        "14":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "She eats all of them",
                "she eat 2 posses the 3rd",
                "she posses one and enslaves the other 2 ",
                "She enslaves all 3",
                "She eats one posses the one and enslaves the last one."
            ],
            "content":"<div class=\"\"><div> <span>3 girls wallked up to the shrin from the school.They all had the schools unform a white bluse black skirt red neckerchif and kneesocks with black shoes. <br>\r\n<br>\r\n\"Are you sure its a good idea to come up here isint this place sacred or some thing?\" asked Jen a blond girl clearly from a ameracen famly.<br>\r\n <br>\r\n\"Jan you got sent here cause you spared the word terrest on a moasc on the bace you dady is station at. Why would you cear?\" Said Kokoro who had a lit ciguret between her lips (Kokoro is baced of late 80s shoolgirl delinqent witch often smoked just like the high schoolers in 50s movies in the USA)<br>\r\n <br>\r\n\"Thats diffrent. Beside i keep hearing scary stories about these old shrines, curese and evil spirets and sach.\" said Jen<br>\r\n <br>\r\n\"There not true i come here evey night befor test to pray to budda.\" said Chun-Li who had short red hair and was from china (her father was a Srteet fighter fan)<br>\r\n <br>\r\n\"I though its a Shinto shrine?\" askked Jen puzzled.<br>\r\n <br>\r\n\"It is but, I think the spirets don't mind to mach. I always get A's on my tests so, I think there happy to get offerings at all in these times.\" said Chun-Li<br>\r\n <br>\r\nThey looked at the offering box, incents bowl and bell. Then Chun-Li pulled out a incents stick and lit it of Kokoros ciguret. She then set in the bowl to burn droped a coin in the box claped twice and rang the bell 3 time then claped again. <br>\r\n<br>\r\n(to any one reading this that better knowes shinto religen and prayer rites or how japanese shrin work pls dont be ofaned i only have what i seen in anime and manga so if you see any thing wrong in what was portrayed dont hesate to on site emial me with what it is.)<br>\r\n <br>\r\n\"What in side?\" asked Jen pointing to the doors sealed with a sutras.<br>\r\n <br>\r\nChun-Li shruged and Kokoro said \"Not sure realy never been in, looks like no one has for years.\" <br>\r\n<br>\r\nJen went up to the door her curiosty over comin her earlyer fears. \"Hay dont do that im not that rilages but brake seals is realy bad idea and karma.\" said Kokoro looking nervus. Then there was a pop as the sutras broke and the door slid open. The room lookas if it was brad new as if time left it alone. In side was 5 small shrines boxes each sealed and each painted depicting a goddess and had a weapons in frount of them on a stand.<br>\r\n <br>\r\nThe girls looked around and a shrine caught Kokoros eye. On the mini shrine there was the image of a golden kitsune with nine tails and bow with a flaming airrow in her hands, wearing the clothes of a geisha in orange and red standiging in the midle of a infeno with 2 swords crossed behind her back in the sash. Kokoro walked up to it and grabed the bow. \"Thats co-\" she started to talk when the sutra burned off and the doors flew open with a birst of fire sending the girls flying out the shrine. The girls where singed and kokoro hand droped the bow. <br>\r\n<br>\r\nThen came the hard clunk od a hard platform sandles as the Fire goddess walked out flames on her tail tips stoping she reached down to pick up her bow. \"I can't belive i had to waight till a nother lowwly mortle tuched my bow to be freed.\" she looked at the girls with a evile glint in her eyes </span></div></div>",
            "created":1321442160,
            "id":1223911,
            "title":"Fire Goddess"
        },
        "144":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "they all obaied and tricked some girls to the castle",
                "Kokoro dosent obay and call her bluf she is punished",
                "they refuse and suffer for it dearly"
            ],
            "content":"<div class=\"\"><div> <span>The fire goddess smiles \"I know what I'll do with you three. You will be my servents.\" She reached out for Kokoro pulled her off the the ground and kissed her her clivage felt hot as the syimble of a nine tailed foe formed in red just below her collor bone. The Kitsune then did the same to Chun-Li and Jen. <br>\r\n<br>\r\n\"There i can now track you where ever you are and speck to your mind from any where and vice versa. Your mine till im done with you. and your frist task is to bring me some human girls to eat. you have three days fail and i will punish you.\" She vanishes in a ball of fire after saying that<br>\r\n<br>\r\nThe Goddess voice rang in there hears \"Bring them the castle in three days or sufer my wrath.\"<br>\r\n<br>\r\nThree days later.....</span></div></div>",
            "created":1322143260,
            "id":1228138,
            "title":"She enslaves all 3"
        },
        "1442":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "Possesses Kokoro as punish ment",
                "she eats Kokoro as well",
                "She takes Kokoro's humanity"
            ],
            "content":"<div class=\"\"><div> <span>Chun-Li had sliped a class mate a rufie to bring her to the goddess while Jen sempliy lied out her ass about some boys with a boat camping there. Needless to say had braguht girls for the Fire Goddess to eat. <br>\r\n<br>\r\n\"Jen you bitch where the boys and who is the bi-\" the girl Jen braught was cut of as the Kitsunes jaws cloesed over the girl from behind and she gulped her down with little truble from the girls strugling.<br>\r\n<br>\r\n\"Well down Jen. Now Chun-Li wheres your offering.\" Chun-Li un rolled the blanket to reveal a naked and unconuse girl. <br>\r\n<br>\r\nChun-Li bowed before speking \"I made sure to strip her so you can have her full flaver.\"<br>\r\n<br>\r\nThe Goddess smiled as she set apon eating the second girl with out a single problame. She then rubed her bell witch even with 2 girls in side her showed not even a puge. \"Where is Kokoro?\" said the fire goddess.<br>\r\n<br>\r\n\"I'm here bitch.\" Said Kokoro as she walked in smoking a cigarte. <br>\r\n<br>\r\nKitsune was clearly displeased that she was alone. \"And where is your offering?\" she asked unhappy tone.<br>\r\n<br>\r\nKokoro walked right up to to the fire goddes took a long drag on her smoke and blew it in her face.\"There bitch. Don't chocke.\"<br>\r\n<br>\r\nThe goddees glears at her \"You will be punished.\" </span></div></div>",
            "created":1322146740,
            "id":1228156,
            "title":"Kokoro dosent obay and call her bluf she is pun..."
        },
        "15":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "She eats all of them",
                "she eat 2 posses the 3rd",
                "she posses one and enslaves the other 2 ",
                "She enslaves all 3",
                "She eats one posses the one and enslaves the last one."
            ],
            "content":"<div class=\"\"><div> <span>3 girls wallked up to the shrin from the school.They all had the schools unform a white bluse black skirt red neckerchif and kneesocks with black shoes. <br>\r\n<br>\r\n\"Are you sure its a good idea to come up here isint this place sacred or some thing?\" asked Jen a blond girl clearly from a ameracen famly.<br>\r\n <br>\r\n\"Jan you got sent here cause you spared the word terrest on a moasc on the bace you dady is station at. Why would you cear?\" Said Kokoro who had a lit ciguret between her lips (Kokoro is baced of late 80s shoolgirl delinqent witch often smoked just like the high schoolers in 50s movies in the USA)<br>\r\n <br>\r\n\"Thats diffrent. Beside i keep hearing scary stories about these old shrines, curese and evil spirets and sach.\" said Jen<br>\r\n <br>\r\n\"There not true i come here evey night befor test to pray to budda.\" said Chun-Li who had short red hair and was from china (her father was a Srteet fighter fan)<br>\r\n <br>\r\n\"I though its a Shinto shrine?\" askked Jen puzzled.<br>\r\n <br>\r\n\"It is but, I think the spirets don't mind to mach. I always get A's on my tests so, I think there happy to get offerings at all in these times.\" said Chun-Li<br>\r\n <br>\r\nThey looked at the offering box, incents bowl and bell. Then Chun-Li pulled out a incents stick and lit it of Kokoros ciguret. She then set in the bowl to burn droped a coin in the box claped twice and rang the bell 3 time then claped again. <br>\r\n<br>\r\n(to any one reading this that better knowes shinto religen and prayer rites or how japanese shrin work pls dont be ofaned i only have what i seen in anime and manga so if you see any thing wrong in what was portrayed dont hesate to on site emial me with what it is.)<br>\r\n <br>\r\n\"What in side?\" asked Jen pointing to the doors sealed with a sutras.<br>\r\n <br>\r\nChun-Li shruged and Kokoro said \"Not sure realy never been in, looks like no one has for years.\" <br>\r\n<br>\r\nJen went up to the door her curiosty over comin her earlyer fears. \"Hay dont do that im not that rilages but brake seals is realy bad idea and karma.\" said Kokoro looking nervus. Then there was a pop as the sutras broke and the door slid open. The room lookas if it was brad new as if time left it alone. In side was 5 small shrines boxes each sealed and each painted depicting a goddess and had a weapons in frount of them on a stand.<br>\r\n <br>\r\nThe girls looked at the mini shrines one caught Chun-Lis eye and made her nervas. \"The other 4 are all spirets or goddess but this is a Oni. Why is it here?\" The mini shrine had a the image of the a linghing stom and in it was a blueish skin oni girl with 3 yellow horns on her forhead short sraguly black hair and gold eyes. She was holding a kanabo in on hand and drinking from a saka gourd in the other hand she wore a tiger skin pesent robe. <br>\r\n<br>\r\n\"So this is a Kanabo....\" said Kokoro as she tried to lift it but endded up droping in to the floor \"Its pure iron mosut waigh over 300 pounds.\"<br>\r\n<br>\r\nJust then it started sparking and all 3 girls where hit by a bolt of electricity puting them to the ground as the Mini shrine opened riping its seal. The girls could only watch as the oni apired and colcted her weapons. Then she looked at the girls and licked her lips. \"My what soft sappule bodys......\"</span></div></div>",
            "created":1321443960,
            "id":1223921,
            "title":"Lighting Goddess"
        }
    },
    "info":{
        "author_id":"dragonjaj",
        "author_name":"Ace",
        "brief_description":"A japanese school for trubled girls feels the wrath of anchent goddess and there hungers.",
        "created":1321277040,
        "description":"<td align=\"left\" class=\"norm\">A school for truble maker girls in japan was built on the runes of a shrine on a small inland there still stands one biulding a sealed shrin at the top of the mounten. In side was 5 sealed goddess locked away to save the people of the inland that lived in the manshen from there rage at them for leting the shrin burn. There the 5 warrior goddess sleep in the shrine sealed buy ther oun weapons. that was till some girl brak school ruls and set them free......<br>\r\n<br>\r\n<b>Rules<br>\r\nNo men this is a yuri story<br>\r\nthe stroy will always be 3rd person<br>\r\nNo ending it if the girls that start the stroy are eaten creat others at randome.<br>\r\nAloud Soft vore, unbirth, breast vore, sex, soul vore, violeace, possaion <br>\r\nMore then one Goddess can be freed but they must be don one at a time.<br>\r\nonly a human can free them<br>\r\nwhen the goddess kill a human there a lilte blue ball of there soul left for her to eat or use<br>\r\nP.[name] = possessed person Ie P.jess means she is possessed</b><br>\r\n<br>\r\nWill delet/change rule violtion</td>",
        "id":1825915,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1323519660,
        "modified":1323519660,
        "pretty_title":"V.O,R.E. Academy"
    }
}