{
    "chapters":{
        "1":{
            "author_id":"alnaga",
            "author_name":"AlNagaTheDreaded",
            "choices":[
                "\"Wow, Uncle Billy.  How did you do that?\" Told from Reece's viewpoint.",
                "\"How did your Uncle Billy do that?\" Told from Tucker's viewpoint",
                "\"Cool, a lady body suit!\" Told from Dillon's viewpoint",
                "How about we add a girl character",
                "The Poison 3's Technical Guide!  A list of the special objects used in the story"
            ],
            "content":"<div class=\"\"><div> <span>Reece is driving his Ford Mustang Mach II down a Nevada Highway.  His best friend, Tucker Mikel sits in the passenger seat and their mutual friend, Dillion Sanchez rides in the back seat.  \"Easy Reece!  I think you rubbed the decals off that delivery truck you passed\" Dillon complained.  \"Dillon, stop being a wimp!  Reece drives fine.\" Tucker replied.  \"Hey, what you guys think of that last fight.  I didn't think Sakura was gonna take down that big guy so quick.\", Reece asked them.   \"Hugo didn't have a chance.  He was totally demolished by Sakura.\" Dillon told him.  \"I did not expect that little Japanese girl to take down that huge guy so quickly\" Tucker remarked.  \"Isn't she our age too?\", Reece asked them.  \"I don't know how she gets to fight.  My mom would wrap me in bubble wrap if I ever tried to enter a Street Fighter tournament\" Dillon joked.  \"That would be awesome!\" Tucker replied.  \"Awesome to be wrapped in bubble wrap?\" Dillon wondered.  \"No to be in a Street Fighter tournament!\" Tucker corrected him.  \"That would be epic, but we'd probably get our butts kicked\" Reece pointed out.  \"I know some kick boxing.\", Tucker told him.  \"Kick boxing, these guys shoot Chi!  They'd be scraping your ashes off the floor.\" Dillon remarked smartly.   \"If only we could get some fighter to train us.\" Reece wished.  \"I hear Zangeif has an online course!\" Dillion added.  \"Zangeif, that loser!\" Tucker chided.  \"Hey, I like Zangeif!   He's proving the excellence of wrestling as a fighting art.\" Dillon grumbled.  \"More like the failure of Wresting as fighting art!\", Tucker teased.  \"Dillon's right, Zangeif's pretty cool.  He can with stand Chun Li's Lightning Kick like it was nothing.\" Reece stated.  \"Though probably because he can look up her Qipao as she's kicking.  That would be worth taking a couple of her lightning kicks\" Dillon joked.  \"Dude, don't be dirty!\" Reece scolded Dillon.  \"That's why he's Dirty Sanchez\", Tucker added.<br>\r\n<br>\r\n\"Hey guys!  We're here!\" Reece stated as he pulled up in front of a large double wide trailer in the Nevada Desert.  \"Uncle Billy told me we could stay here, if we didn't go into his room.\" Reece told the others as he fumbled for a key to the trailer.  The boys all got into the trailer and started watching television.  Soon it was very late, and the boys passed out on the couches in the living room.  A loud noise and a curse awakened Tucker.  He shook Dillion awake, \"I think there's someone else in here.\" he whispered.  \"Uh, comeon man!  It's late.\" Dillon weakly said.  Reece was roused also and said, \"I think I heard it too!\"  \"The door to your uncle's room is open!\" Tucker noticed.  \"Let's go have a look-see then.\" Dillon spoke, as he picked up a pizza box as a crude weapon.<br>\r\n<br>\r\nThe boys peeked around the corner into the room.  A pair of long female legs wearing tiny cut off shorts and red stiletto heels could be seen in the room, the rest of this woman was hidden from view by the closet door.  \"You said your Uncle Billy was gay, so I don't think that's his girlfriend.  I saw we use the sexual assault version of defense and tie up and gang this lady burglar\" Dillon suggested.  \"A burglar who wears Daisy Duke shorts and heels\" Tucker whispered.  \"That's so you feel sorry for her and let her go when you catch her.\" Dillon explained.  \"I don't care what she's wearing, she's taking my Uncle Billy's stuff!  I say on the count of three, we all tackle her!\" Reese told them whispering.  The Boys crept into the room, the lovely burglar seemed not to notice.  Dillon shut off the lights as Reese and Tucker jumped her.  \"Ah!  get off me!\" the voice of the female demanded.  Dillion turned the lights back on and Reese and Tucker were on top of the perpetrator who was wearing a Nazi SS Hat, heavy chain belt, and a white tank top, with fluffy pink hair to complete the ensemble of the cut off blue jean shorts and red pump stilettos.  \"And I'll tackle these beautiful legs\" Dillion said as he held the legs of the woman in place.  \"What are you doing in my Uncle Billy's house!\" Reece demanded.  \"I can explain everything!\" the woman demanded.  \"Hey, guys.  In this closet is like every piece of clothing I've ever seen Poison wear.\" Tucker noted.  \"Poison, isn't she that scanty clad manager of that big guy, Hugo that Sakura demolished at the fight?\"  Reece asked.  \"The one you told us was really a guy?\" Dillon added, suddenly backing off the woman as it might not be 100% sexy female flesh.  \"I am a woman!\" the pink haired woman protested.  \"What are you doing in my Uncle Billy's house!\" Reece demanded.   \"Um, Reece.  I think this might be her closet.  All her clothes her look like hers.\" Tucker pointed out.   \"Too bad your not really a woman, I would have let you go if you had sex with all of us\" Dillon added smiling as Reese and Tucker let the woman off the floor.<br>\r\n<br>\r\n\"That would so wrong.\" Poison told the boys, \"especially since one of you boys is my nephew!\" she added as she touched the choker on her neck and seemed to turn it significantly.   A jet of gas escaped around the color, and Poison reached her right hand on the tuft of hair on her scalp the spot above her forehead and started to pull her face off.<br>\r\n<br>\r\nShe revealed the face of Reece's Uncle Billy underneath as she removed her face!  \"Uncle Billy!  How did?\"  Reece sputtered.   \"What just happened?\" Tucker asked as he looked on.  \"Neat trick, show me how to do it?\" Dillon added.  \"This is a special body suit that makes me into a woman!  That's how I become Poison.\" Billy told the boys.</span></div></div>",
            "created":1356411060,
            "id":1494279,
            "title":"Hey Reece, meet your Uncle POISON!"
        }
    },
    "info":{
        "author_id":"alnaga",
        "author_name":"AlNagaTheDreaded",
        "brief_description":"A Teenaged boy and his friends find out his uncle, Billy is actually Poison of FinalFight!",
        "created":1356404400,
        "description":"<td align=\"left\" class=\"norm\">Fighter match in Las Vegas, Nevada.  Reece arranges to stay at his Uncle Billy's house there, who has known his sister's son when they used to live in the same town with him.  Billy is out of town due to Business, and arranges for Reece to take care of his house while he's out of town.  Reece, Tucker, and Dillion go that night see a match, watching Hugo get demolished by Sakura.  They go home to Uncle Billy's house, and hear an intruder in Uncle Billy's room.  The rush the intruder, and capture her.  To everyone's surprise, it's Poison(from the game Final Fight).  Tucker notices that Uncle Billy's closet has a lot of Poison's fighting costumes.  Poison reveals taking off his girl suit, she's really Uncle Billy!<br>\r\n<br>\r\nReece Barlowe<br>\r\nAge 16<br>\r\nDescription: 6'2\" tall, Blonde hair, Green Blue eyes, white skin.  Dresses like a football jock.<br>\r\nFavorite Anime/Manga: Naruto<br>\r\nFavorite Musicians: loves Judas Priest<br>\r\nPersonal History: Nephew of Billy Barlowe, he was raised partially by Billy who helped his mother take care of him after Reece's father left the family.  Reece is popular as the star quarter back of his High School Football team, some joke that he'd rather talk football strategy with his favorite wide receiver Duncan Rice than talk about girls.<br>\r\nPersonal Preferences:  Reece has always seen the women of Street Fighter as fighters, not as sex symbols.  He somewhat more a fan of them, than the guys as they fight the guys on their level.   His single mother raised him with much sacrifice, and he identifies the strength and courage of these women with his own mother.  Reece goes to an Evangelical church with his mother on Sunday, mostly to please her, as he really would prefer to watch Football on Sunday.  Sakura has the personality to win Reece over, though she has a huge crush on Ryu who is also Reece's favorite street fighter.<br>\r\nFighting Style: Has a typical \"Mini-Mall\" black belt in several typical known martial arts such as Karate, Tai Kwon Do, and Judo.  Roxy and Poison help him develop that into a fighting style.<br>\r\nSakura<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://streetfighter.wikia.com/wiki/Sakura\" target=\"_blank\">http://streetfighter.wikia.com/wiki/Sakura</a><br>\r\nRyu<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://streetfighter.wikia.com/wiki/Ryu\" target=\"_blank\">http://streetfighter.wikia.com/wiki/Ryu</a><br>\r\n<br>\r\nTucker Mikel<br>\r\nAge 16<br>\r\nDescription: 6'8\" tall, Black hair(shaves head), Black eyes, Moca Brown skin(he's African American).  Dresses like a basketball jock.<br>\r\nFavorite Anime/Manga: Ranma 1/2<br>\r\nFavorite Musicians: Says it's Jay Z, but it's his dark secret that he sings Beyonce songs in the shower<br>\r\nPersonal History: Tucker's basketball coach scolds him daily, as he doesn't perform as he used too.  Tucker is not sure he even wants to play basketball anymore.<br>\r\nPersonal Preferences:  Tucker is the guy who always dresses as a movie starlet every Halloween, making everyone laugh, especially with his feminine Mike Tyson like voice.  However Tucker was raised by his Grandmother and his aunts, so he identifies with women better than men.  His uncle started him playing basketball when he was a kid to make a man of him.  His attraction to cross-dressing makes him worry that he might be gay and his religious Southern Baptist family will reject him.  He thinks Chun-Li is a goddess, but Ken Masters is his idol as a fighter.<br>\r\nFighting Style: Tucker knows Kick Boxing, which he enjoyed when he was younger, but had to give if up to keep playing basketball to please his uncle.  His unusually longer reach gives him an distinct advantage in combat.<br>\r\nChun Li<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://streetfighter.wikia.com/wiki/Chun-Li\" target=\"_blank\">http://streetfighter.wikia.com/wiki/Chun-Li</a><br>\r\nKen Masters<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://streetfighter.wikia.com/wiki/Ken_Masters\" target=\"_blank\">http://streetfighter.wikia.com/wiki/Ken_Masters</a><br>\r\n<br>\r\nDillon Sanchez<br>\r\nAge 15<br>\r\nDescription: 5'9\" tall, Dark Brown hair, Dark Hazel eyes, pale pink skin(despite being Mexican American).  Dresses like a nerd.<br>\r\nRelationship Preference: <br>\r\nFavorite Anime/Manga: Says it's D. Greyman, but actually it's Pretty Face.<br>\r\nFavorite Musicians: Says it's Green Day, but loves Lady Gaga secretly<br>\r\nPersonal Preferences: Dillon is secretly has a fetish for ladies shoes and stocking, he used to wear them himself before his feet got too big.  Dillon has a secret fantasy of being in a relationship with a beautiful woman who accepts him dressed in those kinds of shoes and stockings.  But he's afraid to tell anyone his secret.  He doesn't consider himself gay, just a pervert.  His friends have an idea of this as they call him \"Dirty Sanchez\", as he always the one to make the perverted comment in any situation, despite claiming to be too Catholic to say bad cuss words.  His fantasy girl and most favorite fighter is Cammy White.  His favorite male fighter is Zangief.<br>\r\nFighting Style:  Dillion was never instructed before as a fighter, but he is a superb dancer in the style of Gene Kelly and is the school's mascot and knows Cheerleader tumbling.  Poison instructs him in his own style, which she developed from her own knowledge of gymnastics.<br>\r\nCammy White<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://streetfighter.wikia.com/wiki/Cammy\" target=\"_blank\">http://streetfighter.wikia.com/wiki/Cammy</a><br>\r\nZangief<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://streetfighter.wikia.com/wiki/Zangief\" target=\"_blank\">http://streetfighter.wikia.com/wiki/Zangief</a><br>\r\n<br>\r\nUncle Billy Barlowe(Poison)<br>\r\nAge 38<br>\r\nDescription:<br>\r\nMale Form<br>\r\n5'9\" tall, Green hair, wears a black motor cycle jacket, muscle shirt, jeans, and boots.<br>\r\nFemale Form(When wearing the suit)<br>\r\n5'9 tall, Pink hair, has Green Blue eyes, long pink/purple hair wears a nazi Germany style officers hat, a  skimpy white mad-riff revealing tank top and a pair of skimpy denim cut-off shorts(Daisy Dukes) and high heels she also has chains around her waist and a pair of hand-cuffs and jockey stick.<br>\r\n<br>\r\nPersonal Preferences: Billy sticks to the fighting circuit, in one day Cody accepting him as Poison and his wife.  However he hasn't had much luck with that.<br>\r\n<br>\r\nAlso useful: Former member of the Madgears Street Gang.  Loves memorabilia of the Axis(Nazi Germany, Fascist Italy, World War II Japan).  It's a sideline job of his buying and selling this war memorabilia when he's not busy in his Poison persona managing the fighter, Hugo.  Is totally crazy for Cody, one of the heroes who fought him in the series Final Fight.<br>\r\n(From Poison)<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://streetfighter.wikia.com/wiki/Poison\" target=\"_blank\">http://streetfighter.wikia.com/wiki/Poison</a><br>\r\n</td>",
        "id":1910097,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1356411060,
        "modified":1356411060,
        "pretty_title":"Final Fight: The Legend of The Poison 3!"
    }
}