{
    "chapters":{
        "1":{
            "author_id":"amylaverick",
            "author_name":"Nish Laverz",
            "choices":[
                "Hensar follows",
                "Hensar runnes home to tell her mother",
                "Hensar hears a loud screem and runs for her life"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>'Thats just things parents say to scare us in to not going to far from home.' Marhak replied before he tuned back towards the woods and disappeared beyond the first line of trees.</span></div></span></div>",
            "created":1230943620,
            "id":628334,
            "title":"Marhak enters the wood"
        },
        "11":{
            "author_id":"odyssey",
            "author_name":"Odyssey",
            "choices":[
                "Hensar just manages to catch a glimpse of Marhak before he disappears again...",
                "Hensar finds the ball but no sign of Marhak, she continues toward an odd noise.",
                "Hensar catches up with Marhak and they discover something very strange."
            ],
            "content":"<div class=\"\"><div> <span>Hensar hesitated for only a moment before deciding to follow her brother. She felt particularly close to her only sibling, Marhak, especially since they were the last remaining children living in Dankar. Shamil, their cousin, had disappeared just a few months earlier. Their parents and the elders had pulled Hensar and Marhak aside one morning to question them about his whereabouts. They’d obviously hoped he was playing a trick on them and was hiding somewhere in the village. It wouldn’t have been the first time: Shamil loved to play practical jokes - even the Chief hadn’t been immune from their cousin’s antics the day he put Succir weed in the old man’s pipe - but this time was different. They’d all sensed that something terrible had happened. There was a strange quality to the air that day. It seemed somehow denser and had what one could only describe as the vile stench of evil. <br>\r\n<br>\r\nHensar was more scared of never seeing Marhak again than she was for her own safety. She stepped beyond the permissible zone and into the thick woods after him...<br>\r\n</span></div></div>",
            "created":1231134360,
            "id":629363,
            "title":"Hensar follows"
        },
        "113":{
            "author_id":"boiledbeef",
            "author_name":"beef",
            "choices":[
                "Stay in the light of the clearing",
                "Head back the way they came",
                "Investigate the noise in the bushes"
            ],
            "content":"<div class=\"\"><div> <span>Hensar reached Marhak as they entered the clearing. She saw  him stop and bend downwards as if investigating something on the forest floor below. The wind whistled through the branches around and far away to the left she could hear footsteps lightly crunching fallen leaves. She reached Marhak and he displayed his discovery. In his hand he held a rucksack. It was her brothers.  A low growl came from behind the trees to their left. She looked at Marhak and held his hand. What should they do now....</span></div></div>",
            "created":1236087960,
            "id":655348,
            "title":"Hensar catches up with Marhak and they discover..."
        },
        "1131":{
            "author_id":"boiledbeef",
            "author_name":"beef",
            "choices":[
                "Run to the left",
                "Run to the right",
                "Investigate the contents of the backpack"
            ],
            "content":"<div class=\"\"><div> <span>As Hensar and Marhak cling to each other in the middle of the clearing the solitary growl in front of them becomes two then three. Behind them a noise of footsteps come form the undergrowth. It stops a squickly as it started. Then as the growling dies down Hensar hears something sniff the cold winter air</span></div></div>",
            "created":1236182040,
            "id":656031,
            "title":"Stay in the light of the clearing"
        },
        "12":{
            "author_id":"boiledbeef",
            "author_name":"beef",
            "choices":[
                "Hensar searches for her mother in the house",
                "Hensar runs back into the forest to see what is wrong",
                "Hensar visits her mothers neighbour in the hope of obtaining help"
            ],
            "content":"<div class=\"\"><div> <span>Hensar arrived at the house five minutes later. Her mother had left the comfort of the rocking chair on the porch and it seemed that she had ventured back inside the house momentarily. Hensar ran up the path shouting her but no answer came from inside. When she reached the porch she saw the front door was swinging open in the wind and the glass that once held her mothers homemade lemonade was smashed on the floor, the lemonade itself disappearing fast in the crack between the wooden floorboards. She shouted her mother once more but still there was no reply. Maybe she was asleep? Maybe she had gone next door? Maybe even to the village? Hensar didnt think this was likely as it wasnt like her mother to leave the house so unsecure.<br>\r\n<br>\r\nThen all thoughts of her mother were quickly removed from her mind. Behind her back in the woods she heard Marhak scream....</span></div></div>",
            "created":1236180420,
            "id":656027,
            "title":"Hensar runnes home to tell her mother"
        },
        "121":{
            "author_id":"boiledbeef",
            "author_name":"beef",
            "choices":[
                "Hensar searches the house from top to bottom"
            ],
            "content":"<div class=\"\"><div> <span>After hearing her brothers cry she knew he was in trouble. She ran into the hall screaming for her mother. The front room was empty the only sign of anyone having been in it being the fire that was smouldering underneath the mantle. The same was true in the dining room. Her mothers knitting lay cast aside on the floor beneath the chair were she usually resided. Other than that nothing.... </span></div></div>",
            "created":1236181680,
            "id":656029,
            "title":"Hensar searches for her mother in the house"
        },
        "13":{
            "author_id":"boiledbeef",
            "author_name":"beef",
            "choices":[
                "run for help",
                "use her phone to call for help",
                "persuade Marhak to go into the woods with her to investigate"
            ],
            "content":"<div class=\"\"><div> <span>Hensar turned to run. The scream came from somewhere far ahead of them but, in the silence of the evening, it echoed across the valley. Her thoughts immediately turned to her missing brother. Something told her inside that it was him, something told her he was fighting for his life. Marhak, by her side seemed stuck to the spot. Some older brother he was. It would have to be her, she would have to make the decision. Another scream ran across the valley this time a little further away. The time to make a decision was upon her...</span></div></div>",
            "created":1236186120,
            "id":656048,
            "title":"Hensar hears a loud screem and runs for her life"
        }
    },
    "info":{
        "author_id":"amylaverick",
        "author_name":"Nish Laverz",
        "brief_description":"Marhak enters the woods. What happens next is up to you",
        "created":1230943320,
        "description":"<td align=\"left\" class=\"norm\">Marhak and his younger sister Hensar have ventured to the outer edge of the village near to the dark woods. They start to play with the ball passing it to each other. Then Marhak miss through the ball and it went into the woods. Marhak went to enter the woods to retrieve the ball but before he could enter Hensar said 'Mom always says Never enter the woods Evil beings live there! They will eat you for breakfast. I don't think you should go and get the ball.'<br>\r\n</td>",
        "id":1511259,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1236186120,
        "modified":1236186120,
        "pretty_title":"Evil in the woods"
    }
}