{
    "chapters":{
        "1":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "Sakura Haruno",
                "Hinata Hyuuga",
                "Ino Yamanaka",
                "Somebody Else",
                "Somebody Else"
            ],
            "content":"<div class=\"\"><div> <span>She felt it. First it was the strong punch to the head by that pink haired girl, then it was the touch of those damn reincarnations. She knew what was to come next. She knew she was to be sealed away. Her power strip from her, and split among those nine beasts. The rest of her chakra that she had taken from those lowly humans would be returned to them. Her soul would be lost to the ages yet again. It wasn't fair. She hadn't even been back a day, and she was yet again being sealed. She looked down and saw that Black Zetsu was still pinned to the ground. The ground began to break apart and surround her in a stone prison. She needed to think of something, and something quick if she wanted any chance of escape. Then it hit her. <br>\r\n<br>\r\nJust before she was about to be sealed again for the second time, Kaguya Ōtsutsuki had one more trick up her sleeve. It would be risky, but at this point it was better than nothing. <br>\r\n<br>\r\nUsing a technique that had been passed down the Ōtsutsuki clan for ages as a way of prolonging their own lives, Kaguya split off a small piece of her chakra, along with her soul, and used them to created an Ōtsutsuki Chakra Seed based on herself. From here, she planned to plant the seed into the root of a host body's chakra system, in hopes that it would begin to spread and infect that body and allow for her to be revived. <br>\r\n<br>\r\nAs more rocks began to entomb her body. She quickly focused her chakra and split it off with her soul, to form the \"seed.\" She watched as the small ball of chakra form in front of her. It was about the size of a golf ball. As it finished forming, her vision began to fade. The last thing Kaguya saw was when it shot off to find a suitable host body. Her body began to whither and decay as she felt the rest of her chakra began to escape her. <br>\r\n<br>\r\nThe small ball of chakra shot out of its rocky prison as it made its way find a new host body to take. <br>\r\n<br>\r\nWho did the Chakra Seed go to?</span></div></div>",
            "created":1588015440,
            "id":2825713,
            "title":"Ōtsutsuki Chakra Seed"
        },
        "11":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "She notices it right away",
                "She doesn't notice"
            ],
            "content":"<div class=\"\"><div> <span>Kaguya needed a new body and quick. One of the closest bodies to her was the pink haired female. Her name was Sakura, if she remembered correctly. She was a female strong enough to injure her, she would make a suitable host for Kaguya's revival. Willing everything she could, Kaguya sent the seed towards Sakura in hopes that it would quickly take root within the girl. <br>\r\n<br>\r\nDoes Sakura notice the Chakra Seed?</span></div></div>",
            "created":1588621320,
            "id":2830019,
            "title":"Sakura Haruno"
        },
        "12":{
            "author_id":"mizushinobi",
            "author_name":"hydroshinobi",
            "choices":[
                "It successfully takes root within Hinata",
                "Something within her body forces the seed out",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>The small ball of chakra shot out of its rocky prison as it made its way find a new host body to take. Looking to be more discrete in its selection of host, a tiny black portal opens as the seed makes its way back to the original dimension in where all the shinobi resided. It looked for a host with chakra and a body that it would find to be most compatible.<br>\r\n<br>\r\nAs the seed made its way through the battle field full of cocooned shinobi that were caught under the Infinite Tsukiyomi, it was drawn to one that had a chakra closest to its own. Within this wrapped was the body of Hinata Hyuuga. The Hyuuga were descendants of her son Hamura Ōtsutsuki and shared her Byakugan bloodline. The seed would have no problems taking root.<br>\r\n<br>\r\nThe seed then began to enter the cocoon that had wrapped up Hinata, and entered in to it.<br>\r\n<br>\r\nDoes the seed successfully take root in her?</span></div></div>",
            "created":1588621380,
            "id":2830022,
            "title":"Hinata Hyuuga"
        },
        "14":{
            "author_id":"napo08",
            "author_name":"napo08",
            "choices":[
                "Naruto Uzumaki",
                "Tenten",
                "Tsunade",
                "Kurenai",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of them?</span></div></span></div>",
            "created":1588018800,
            "id":2825743,
            "title":"Somebody Else"
        }
    },
    "info":{
        "author_id":"mizushinobi",
        "author_name":"hydroshinobi",
        "brief_description":"Kaguya Ōtsutsuki had one more trick to escape being sealed.",
        "created":1588006680,
        "description":"<td align=\"left\" class=\"norm\">Just before she was about to be sealed again for the second time, Kaguya Ōtsutsuki had one more trick up her sleeve. <br>\r\n<br>\r\nUsing a technique that had been passed down the Ōtsutsuki clan for ages as a way of prolonging their own lives, she could split off a small piece of her chakra, along with her soul, and create an almost chakra seed of sorts. From here, the seed would be planted into the root of a host body's chakra system. It is there that it would begin to spread and infect the host body. <br>\r\n<br>\r\nIt would use the small amount of chakra, within the chakra seed, to absorb the chakra from its hosts body. It would convert it into its own, and circulate back into the body of its host. From here the seed's chakra would begin to influence the body it inhabits. The host body would begin to transform over some time to eventually become an exact copy of the Ōtsutsuki that created the seed. The more the of the hosts chakra that get converted the more their body changes. As the physical changes happen, so do changes to the hosts mind/personality. <br>\r\n<br>\r\nAs their chakra is converted they begin to find themselves acting similar to the Ōtsutsuki that created the seed. Once the body has mostly been transformed by the seeds chakra, the soul trapped within the seed begins to take over the hosts soul. The host begins to lose their sense of personality and identity. They often begin to identify and refer to themselves as the original Ōtsutsuki. Eventually the seed's soul will \"consume\" the soul of the host, as it becomes sealed away within host. Kind of like a Bijuu/Jinchūriki situation. This completes the revival of the Ōtsutsuki that created the seed as it inhabits the body without interruption. <br>\r\n<br>\r\nThis method of body transformation and revival does come with its own risks for the Ōtsutsuki that creates a seed. <br>\r\n<br>\r\nFor one it depends on whether or not, the host becomes aware of the transformation. Sometimes the host becomes aware of the changes. <br>\r\n<br>\r\nDepending on the host, they might try and resist the transformation. If caught early enough, and if the seed hasn't taken a strong enough root, the host might be able to have the seed extracted from them as well. <br>\r\n<br>\r\nSome seed hosts are receptive of the body changes and additional power given to them by the seed, and embrace its transformation. This allows for a faster transformation of their body and mind, but can leave their soul more prone to being consumed by the soul of the Ōtsutsuki and completing the revival.<br>\r\n<br>\r\nBy the time the transformation reaches its completion, more often then not, the Ōtsutsuki's soul will often win out and complete their revival. There are some other times though, that this is not always the case. If a host's soul is truly resilient, they might be able to try and resist the consumption of their soul, and control of their body. <br>\r\n<br>\r\nFrom here their are a few possibilities that can play out. <br>\r\n<br>\r\n1. The host soul wins out, and is able to keep the Ōtsutsuki's soul separated and sealed off from theirs. The host then has complete control of their transformed body. The host does need to be careful though, as the Ōtsutsuki can still exert some subtle influence, especially when the host draws upon more of the Ōtsutsuki's. If they draw too much, the host risks breaking their seal containing the Ōtsutsuki's soul.<br>\r\n <br>\r\n2. The Ōtsutsuki's soul wins out, and the host's soul is sealed away. The Ōtsutsuki takes complete control of the body, completing their revival. In some subtle ways the host can exert some subtle influence, especially when the Ōtsutsuki is under emotional instability, or in a weakened state. When low on chakra, their seal over their host can weaken to the point that they can break free, and fight for control over their body. <br>\r\n <br>\r\n3. Sometimes there is the case that neither soul wins out. The two are strong enough to coexist with one another and are able to work out a way to mutually share the body. <br>\r\n<br>\r\n4. There is also the possibility that the two souls fail to win out and collapse in on each other. This causes an irreversible fusion of the two, creating a new identity.  </td>",
        "id":2220364,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1588621380,
        "modified":1588621380,
        "pretty_title":"Kaguya Ōtsutsuki's Revival "
    }
}