{
    "chapters":{
        "1":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "Bill Johnson",
                "Dante Adams",
                "Stephanie Grant",
                "Rebecca Ward",
                "Other characters"
            ],
            "content":"<div class=\"\"><div> <span>Choose the character-<br>\r\n<br>\r\nBill Johnson- A CEO of a big company who is a chauvinistic womanizing guy who doesn't treat women correctly wakes up in the body of a meek female secretary who works for a man that was just like him.  <br>\r\n<br>\r\nDante Adams- A high school student who thinks that the popular girls have life easier and plays pranks on them a lot.  He wakes up in the body of a head cheerleader whose life isn't as easy as he thought.<br>\r\n<br>\r\nStephanie Grant- A hardcore feminist that thinks that men have life easier and get paid better than women.  She wakes up in the body of a man who works for a domineering female boss who treats the man like shit and pays him a lot less than her.<br>\r\n<br>\r\nRebecca Ward- A popular girl who can have any boy she wants and treats others badly wakes up in the body of a clumsy nerd. </span></div></div>",
            "created":1353214800,
            "id":1470280,
            "title":"Reality Check"
        },
        "11":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "Get ready for work",
                "Call yourself",
                "Try to find out why you are a girl",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You are dreaming of your day at work yesterday.  You are telling your co workers that a woman should be seen not heard, you chew out your secretary for forgetting to print a page of a report and then you hear a loud beeping sound and you shoot awake.  You feel different somehow.  The room is dark so you get up and head for the bathroom.<br>\r\n<br>\r\n\"Ugh, I don't remember drinking this much last night, wait what's with my voice?\" you say as you look in the mirror and see a young woman looking back.  \"HOLY SHIT! I'm a chick!\" you scream.<br>\r\n<br>\r\nYou begin to panic and run around when you hear a phone ring.  You run to pick it up. \"Hello?\" you ask.<br>\r\n<br>\r\n\"Listen up Sarah because I am only saying this once\" an angry voice on the other line says. \"I need those reports today,and you should wear a short skirt so I can see your pretty ass wiggle in it.\" <br>\r\n<br>\r\n\"Uh, yes sir\" you say confused.<br>\r\n<br>\r\n\"See you at work\" the voice says and hangs up.</span></div></div>",
            "created":1353387600,
            "id":1471945,
            "title":"Bill Johnson"
        },
        "111":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "Go to her work",
                "Something happens on the way",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>You don't know why, but you feel like you have to get ready for work.  Now, you are noticing your new body more.  You are a girl that's at least 25, with long brown hair, brown eyes, an attractive face, a decent build and slender arms and legs. <br>\r\n<br>\r\n\"Well, I probably should take a shower...\" you say walking into the shower and turn the water on.  You wash yourself, and notice that her soap smells like flowers.  You finish the shower and walk out and brush and blow dry your hair, which the body seemed to take over for.  You make your hair look nice and then go out to put on clothes.  You see a business suit hanging in the closet, so you grab it and go into her drawer for a bra, panties and pantyhose.  You put on the lingerie and then look at yourself in the mirror.<br>\r\n<br>\r\n\"This is weird\" you say \"I look kinda hot\"<br>\r\n<br>\r\nYou continue getting ready, put makeup on and then the suit.  You have trouble with the skirt because it is so short.  Then you put the heels on, they were like 3 inches! This chick is nuts! You look at yourself in a mirror.  If you were a guy, you would want to have sex with this girl, but now your thoughts are on how pretty you are, in a personal sense.  But whatever, where the hell does she work?  You check her phone and it has an address and name of the place.  ThundCorp... weird name.  </span></div></div>",
            "created":1353560400,
            "id":1472981,
            "title":"Get ready for work"
        },
        "1111":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "Figure out what she does",
                "Find those reports",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You find a pair of car keys, and walk outside the house.  You see one of those Smart Cars.  Jeez, those cars look like they could get torn through by a semi truck.  Oh well, it's the only car you can use.  You put the address into the GPS and start to drive. You can't help but notice that you feel smaller, almost weak and fragile.  You brush it off and keep driving.  You try to turn on the radio, but it looks like it's broken.  You turn on the CD Player.  Out of the speakers comes the most girly sounding song ever, you've never heard it before, but it's really catchy.  You listen to the entire CD and then you are at her workplace.  <br>\r\n<br>\r\nYou walk into the building, not used to the heels yet,but you manage to make it to the elevator.  Her phone said that she worked on the 15th floor, so you click the button and wait.  It stops on a floor and a man walks in.  For some reason, you can't place, you feel weak and fragile again.  The man turns to you, glaring.<br>\r\n<br>\r\n\"Sarah, did you finish the reports yet?\" he says, instantly reminding you of who he is.<br>\r\n<br>\r\n\"Um, no sir, I just got here\" you reply.<br>\r\n<br>\r\n\"Well, have it finished by the end of the day, got it?\" he says.<br>\r\n<br>\r\n\"Yes, sir I will be sure of that\" <br>\r\n<br>\r\n\"And good choice on the skirt\" he says as the elevator beeps for 15 and you get off, you can feel him staring at your ass as you walk towards your cubicle.  You see one that says Sarah Anderson, and inside there are pictures hanging up, one with an old man, an old woman, and the woman whose body you now inhabit.  You assume that those are here parents and sit down.  Now what to do?</span></div></div>",
            "created":1353906000,
            "id":1475872,
            "title":"Go to her work"
        },
        "11112":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "A co-worker approaches you",
                "The sexist boss approaches you"
            ],
            "content":"<div class=\"\"><div> <span>You go onto the computer and look at the desktop.  You see a file name in all caps.  The file says \"REPORTS IMPORTANT\" you click it and you see something pop up.  You don't understand what it means but you see that it seems finished so you log into the email program and send it to the email address labelled boss.  You hope that it was right and sit and wait for a reply.</span></div></div>",
            "created":1357362000,
            "id":1502537,
            "title":"Find those reports"
        },
        "111121":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "Lunchtime",
                "Your sexist boss approaches you"
            ],
            "content":"<div class=\"\"><div> <span>You are sitting at the desk and are focusing intently on the screen when someone grabs you on the shoulder.  You turn around with a start to see another woman looking at you.<br>\r\n<br>\r\n\"Woah, Sarah.  Are you okay?\" she says.<br>\r\n<br>\r\n\"Oh, yeah.  You just startled me.\" you reply.<br>\r\n<br>\r\n\"Okay, so listen, you want to go get lunch?\"<br>\r\n<br>\r\n\"Sure.  When do you want to go?\"<br>\r\n<br>\r\n\"I was thinking in like a half hour, I have to just fix a few files and I'll come back to get you\"<br>\r\n<br>\r\n\"Yeah, that sounds great\"</span></div></div>",
            "created":1359090000,
            "id":1516756,
            "title":"A co-worker approaches you"
        },
        "1111211":{
            "choices":[
                "During lunch, you start acting more like Sarah.",
                "During lunch, you slip up and say something totally out of character for Sarah."
            ],
            "content":"<div class=\"\"><div> <span>Time passes excruciatingly slowly. <br>\r\n<br>\r\nYou really have no idea how to do Sarah's job. Sure, you managed to find some allegedly “important” reports that you emailed to Sarah's boss … hopefully! <br>\r\n<br>\r\nBut that was blind luck.<br>\r\n<br>\r\nYou scarcely know how to walk in heels much less do Sarah's job.<br>\r\n<br>\r\nFor a long while you sit there, just staring at Sarah's computer screen and fidgeting with the hem of the short, tight skirt you're wearing.<br>\r\n<br>\r\nSuddenly the phone rings.<br>\r\n<br>\r\nReflexively you pick up the receiver and answer: “ThundCorp, this is Sarah Anderson speaking. How may I direct your call?”<br>\r\n<br>\r\nWeird.<br>\r\n<br>\r\nJust a moment ago, you were hopelessly lost. Now at the sound of a bell, you're like one of Pavlov's dogs, conditioned to respond automatically in just the way Sarah's body is accustomed to doing so.<br>\r\n<br>\r\nThe caller is a gruff sounding man who treats you rather rudely and demands to speak with your boss. <br>\r\n<br>\r\n“Yes, sir,” you chirp pleasantly. “I'll connect you with him immediately, sir.”<br>\r\n<br>\r\nYou deftly press a few buttons on your phone console and in no time flat have the call dutifully transferred to the boss.<br>\r\n<br>\r\nLet him handle it, you think. He's a man and knows better anyhow.<br>\r\n<br>\r\nWithout even realizing what you're doing, you've bent down and picked up your purse. Removing a nail file, you begin to studiously work on your nails and wait for the clock to count down to lunchtime.<br>\r\n<br>\r\nAfter a few more minutes have passed, the woman you had made a lunch date with earlier finally returns.<br>\r\n<br>\r\n“You ready to go, Sarah?” she asks.<br>\r\n<br>\r\nFor a moment, you forget that she's talking to you. Weird, you think. A few moments ago, I was completely in “Sarah Mode,” thinking and acting like her. <br>\r\n<br>\r\n“Uh, yeah, I'm ready,” you say, rising unsteadily to your wobbly feet. You might be able to answer a phone call as Sarah, but you still haven't mastered the art of walking in three inch heels.<br>\r\n<br>\r\nBetter get used to it if you're going to remain a woman!<br>\r\n<br>\r\n“Where are we going?” you ask.<br>\r\n<br>\r\n“Oh, I figured we'd go to the usual place,” says the strange woman.<br>\r\n<br>\r\nFat lot of help <u>that</u> is, you think to yourself. If you want any worthwhile clues about your new life, it appears you're going to have to try a lot harder than that. <br>\r\n<br>\r\nYou follow your new friend to the elevator, listening to her constant stream of gossipy chit-chat about various co-workers you haven't even met yet. Despite not recognizing any of the names, you feel easily drawn into listening to all the juicy little details of who got caught saying or doing what to whom!<br>\r\n<br>\r\nBefore you know it, the two of you are in the parking garage getting into the woman's car.</span></div></div>",
            "created":1359349200,
            "id":1518930,
            "title":"Leaving for Lunch"
        },
        "11112112":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "Tell her that you aren't Sarah",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>You get to the restaurant, which is called \"The Dreaming Tree\", and go inside.  You and the woman are led to a table and wait for a waiter to show up.  The waiter shows up and looks happy.<br>\r\n<br>\r\n\"Hey Sarah, Hello Allison\" he says.  Allison, that's her name.<br>\r\n<br>\r\n\"Hello Trevor\" Allison says.  <br>\r\n<br>\r\n\"Hey Trevor\" you say.<br>\r\n<br>\r\n\"What would you two like, the usual?\" he says.<br>\r\n<br>\r\n\"Yep.\" Allison replies to which you nod yes to.<br>\r\n<br>\r\n\"Okay, so I'll be back soon with the food.\" he says.<br>\r\n<br>\r\n\"That's great, thanks Trevor\" Allison says.<br>\r\n<br>\r\n\"So Sarah, how is it going with trying to get Mr. Horndog off your back?\"<br>\r\n<br>\r\n\"Not well, I'm just not sure what to do about it.\" you say honestly.<br>\r\n<br>\r\n\"Well, you could get a boyfriend, or pretend to have one.  He'd probably buy that.\"<br>\r\n<br>\r\n\"You think Trevor would work?\" you say, seeing as he's the only other male you've met today aside from your boss.<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\n\"Well, couldn't he pretend?\"<br>\r\n<br>\r\n\"Sarah, are you okay?  You know he's gay right?  And so does our boss.\"<br>\r\n<br>\r\n\"Well, I forgot ok?\" <br>\r\n<br>\r\n\"You don't just forget something like that! What's going on today?\"</span></div></div>",
            "created":1359435600,
            "id":1520009,
            "title":"Sarah doesn't act like that"
        },
        "111121121":{
            "choices":[
                "Allison insists on finding and meeting \"Bill Johnson.\"",
                "Allison insists on going back to work as if nothing is unusual."
            ],
            "content":"<div class=\"\"><div> <span>Ouch, you're in an awkward spot right now. <br>\r\n<br>\r\nAllison stares at you intently.<br>\r\n<br>\r\n“What's going on today?” she repeats.<br>\r\n<br>\r\nYou blush and look down, fidgeting anxiously with the hem of your short skirt. Beneath the table, you kick off one of your shoes partially and nervously twirl your big toe about on it. <br>\r\n<br>\r\n“Sarah, answer me,” presses Allison. “Something really weird is going on with you today. Now I want answers. Truthful ones. What's going on?”<br>\r\n<br>\r\n“I'm not really Sarah Anderson,” you say softly.<br>\r\n<br>\r\n“Excuse me?” asks Allison.<br>\r\n<br>\r\n“I'm not Sarah,” you say, slightly louder this time. “This isn't actually my body. I'm an imposter – trapped in Sarah's body. But I'm not really her, and I actually don't know anything about her or her life.”<br>\r\n<br>\r\n“You're kidding me,” deadpans Allison.<br>\r\n<br>\r\nYou shake your head somberly.<br>\r\n<br>\r\n“Okay, let's play along with this,” replies Allison, still not quite believing her ears. “Uh … so you're not my friend and co-worker Sarah. That just begs the question: who the hell are you?”<br>\r\n<br>\r\n“My name is Bill Johnson,” you answer. “I'm the CEO of IntrepiCorp, Ltd.”<br>\r\n<br>\r\n“And how did you end up in my friend Sarah's body?” asks Allison.<br>\r\n<br>\r\nYou shrug your shoulders.<br>\r\n<br>\r\n“You just woke up in Sarah's body this morning and have no idea how it happened?” Allison asks skeptically.<br>\r\n<br>\r\n“Yes,” you answer. “I swear, this is all the honest truth. I don't know how this happened. I'd love to get my own body back. You think I like going from being the boss to being a secretary?”<br>\r\n<br>\r\n“Not just a secretary, but Mr. Horndog's personal plaything!” laughs Allison.<br>\r\n<br>\r\n“What?” you say, gulping nervously.<br>\r\n<br>\r\n“You really aren't Sarah, are you?” says Allison, more seriously this time. “Oh my god. I don't know why – but I believe you. This is crazy! Things like this just don't happen in real life. But it's the only explanation. You're not Sarah. You're … uh … I'm sorry, I forgot your name already?”<br>\r\n<br>\r\n“Bill Johnson,” you say meekly.<br>\r\n<br>\r\n“Yes, Bill Johnson,” she repeats. “Well, perhaps you and I better keep that our little secret, eh? Sarah is a ditzy dingbat, but so far she doesn't have a reputation for outright insanity. I'd hate to see my best friend get locked up in an insane asylum for running about claiming she's a man.”<br>\r\n<br>\r\n“You're going to help me?” you ask shyly.<br>\r\n<br>\r\n“What are friends for?” smiles Allison. “We should probably check in with your life at some point and find out if the real Sarah is now trapped in your old body. Maybe she has an idea of what happened … and how this can be undone. Or, I'm sorry – did you want to remain a girl from now on?”<br>\r\n<br>\r\nIs she serious, you think in horror. <br>\r\n<br>\r\nYou vigorously shake your head no.<br>\r\n<br>\r\n“It's not all bad, you know,” says Allison. “I'd hate for you to steal my friend's body without her permission. But if Sarah did this deliberately, maybe she wants to remain a man. In that case, you might have to get used to wearing skirts and pantyhose everyday.”<br>\r\n<br>\r\nYou sigh and struggle to hold back a flood of tears. Damn, these female hormones messing with your emotions already!<br>\r\n<br>\r\n“Hey calm down,” Allison says. “We won't know anything until we find your old body and see whether or not Sarah's spirit wound up inside it. In the meantime, you and I are best friends. I've got your back, okay? Just listen to good old Allison – I'll help guide you through work and the rest of Sarah's life. You just have to promise me that you'll be a good custodian of Sarah's body until we find out if she did this on purpose or not. That means no getting yourself tattooed or knocked-up or anything like that yet, okay?”<br>\r\n<br>\r\nThe suggestion of you getting pregnant is too much, and the floodgates suddenly open. Before you know it, tears are streaming down your cheeks and you're softly sobbing on Allison's shoulder.<br>\r\n<br>\r\n“There there,” she says. “Calm down, and just let Allison help take care of everything.”<br>\r\n<br>\r\nYou suspect there's precious little Allison can do, though, to alter the fact that you're now a woman and could theoretically get yourself pregnant. You don't want Sarah's life, her body, her clothes, her job, and all the problems that come with living inside her skin for the rest of your days!</span></div></div>",
            "created":1359608400,
            "id":1521134,
            "title":"I'm not real Sarah"
        },
        "1111211211":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "Pretend to be the other person until further notice",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Have you tried calling your old body?\" Allison asked.<br>\r\n<br>\r\n\"Uh...\" you stammer as you realize that you never did try to call yourself.<br>\r\n<br>\r\n\"Looks like you still have some of her ditzy brain in you. Why don't we try that? You do remember your own phone number right?\" she asked.<br>\r\n<br>\r\n\"Of course I do.\" you say and dial it into Sarah's cell phone. \"I can't do this.\"<br>\r\n<br>\r\n\"Then I'll do it.\" Allison taking the phone. <br>\r\n<br>\r\n\"Hello?\" says a male voice on the other line.<br>\r\n<br>\r\n\"Hello, is this Bill Johnson?\" she asks.<br>\r\n<br>\r\n\"Uh, yes it is?\" the voice replies.<br>\r\n<br>\r\n\"I'm calling on the behalf of Sarah Anderson, do you know her?\" she asked.<br>\r\n<br>\r\n\"Allison?\" the voice asks.<br>\r\n<br>\r\n\"Sarah?\"<br>\r\n<br>\r\n\"Oh my god! Thank god! I woke up in this body and I was too scared to call my own phone. Is this guy in my body?\"<br>\r\n<br>\r\n\"Yes, but he's as in the dark as you are.\" <br>\r\n<br>\r\n\"So, what do we do?\"<br>\r\n<br>\r\n...</span></div></div>",
            "created":1375938000,
            "id":1642835,
            "title":"Allison insists on finding and meeting \"Bil..."
        },
        "11112112111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "the meeting",
                "on the way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"sure\" said Allison<br>\r\n<br>\r\nThey also agreed to meet tonight </span></div></span></div>",
            "created":1475211600,
            "id":2216881,
            "title":"Pretend to be the other person until further no..."
        },
        "111121122":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>You tell her that you are just not feeling well today and for the moment she seems to buy that, but overall you have to be careful to not blow your new identity even this is hard and you certainly don’t want to stay that or any woman for the rest of your days.</span></div></div>",
            "created":1571634000,
            "id":2736256,
            "title":"try your best to pretend to be Sarah"
        },
        "1111211221":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "boss shows up and you can not leave ",
                "at your new appartment",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>After lunch you are back at what will be now your working place:<br>\r\nYou set down, continue to handle the phone calls and examine your surroundings more closely.<br>\r\nYou're in a usual office room, but your space is decorated with all sorts of girly knickknacks – decorative hearts ,angels, ribbons, and flowers on the shelves and across the walls. The room is so small, compared to your old office…<br>\r\nBut to be honest it's all nice, tidy, and quite clean though. <br>\r\nTime passes by and after 4 the office starts to empty, and around 5 you are almost alone.<br>\r\nThis gives you the opportunity to look up and down at your body. Obviously, you already know you're a woman, a young woman in her mid-twenties.<br>\r\nYou have to say that you are quite shapely. You're currently dressed in your business clothes and everything clings tightly to your nicely rounded hips and behind. But these shoes. You wonder why women love those kind of shoes? This will the first thing you will get out once you are home!<br>\r\nBut even you learned a lot of your new identity and you already start to react when someone calls “Sarah” the overall and main question still is:<br>\r\n“Who am I?” you whisper in a softly feminine soprano voice. “And how did I become this crazy chick?”<br>\r\nMaybe you will find it out tonight. Anyhow at 8 it is time to leave the office for today.<br>\r\n</span></div></div>",
            "created":1571634000,
            "id":2736262,
            "title":"first day of your office day as Sarah"
        },
        "11112112212":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "sleep",
                "try to get something to eat, you are quite hungrey",
                "someone calls you"
            ],
            "content":"<div class=\"\"><div> <span>Back into your small car and home. Since the radio is not working you think about getting another CD for tomorrow or even try to get a working sound system into that car. But most properly this can be more expensive as the complete car.<br>\r\nIf your fate will be that you have to remain Sarah you have to check her financials to see if something for a new car is possible…<br>\r\nBut now you arrive the place what is considered as your home now:<br>\r\nOnce inside, a quick survey of the apartment shows no changes to what you have left in the morning:<br>\r\nAnother glance in your new small, red leather purse gives you again the possibility to discover your current driver's license, that still and of course identifies you as “Anderson, Sarah Marie” and pegs your age at 25. The woman in the photo is pretty, but meek looking with long, brown hair and deeply soulful, almond brown eyes. She looks quite attractive, but rather shy.<br>\r\n<br>\r\n“I don't believe this is happening,” you mutter.<br>\r\n</span></div></div>",
            "created":1571634000,
            "id":2736266,
            "title":"at your new appartment"
        },
        "111122":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "\"Anyway, I hope you're not going to disappoint me.\", he leaves.",
                "Your fingers tremble as you button your blouse, hiding the bear.",
                "\"S..Sir, that's in... inappropriate...\" you object weakly.",
                "\"Or perhaps a frigid polar bear.\" he muses, patting your shoulder.",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>As you start to rise from your chair, he rests a hand on your shoulder. It's massive and powerful, effortlessly guiding you back to the seat. Even if you'd made it to your feet, he'd still be intimidating. Even with these humiliating heels, you suspect he has a few inches on you.<br>\r\n<br>\r\nPatting your shoulder, he turns you to face the computer.<br>\r\n<br>\r\n\"I hope you'll have the reports ready in time for the meeting.\"<br>\r\n<br>\r\nUnwilling to face him, you stare at the screen, not wanting to show your terror.<br>\r\n<br>\r\n\"I'd hate to have to punish you for being naughty, if you fail.\" His voice warms your scalp. Shuddering you realise he must be leaning low to be so close to your ear. The smell of garlic on his breath, making you queasy.<br>\r\n<br>\r\nYou gasp, as you doubt he's looking at the screen. The view down your cleavage is a far likelier option. His hand shifts from your shoulder, almost playing with the bra strap beneath your blouse to brush against the gold chain of your necklace.<br>\r\n<br>\r\n\"It's very pretty...\"<br>\r\n<br>\r\nAgain you repress a shiver of your skin, \"Is that a panda?\" He asks.<br>\r\n<br>\r\nYou imagine him nodding to the golden bear dangling deep in your cleavage. </span></div></div>",
            "created":1571374800,
            "id":2734710,
            "title":"The sexist boss approaches you..."
        },
        "1111221":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "The reports are all in a mess, the task is impossible.",
                "Hoping to impress, you do the best job you can.",
                "You snatch the necklace off, ripping the chain from your neck.",
                "\"C'mon Sarah... Get a grip.\" you tell yourself firmly.",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>\"Anyway, I hope you're not going to disappoint me.\" He plants his other hand on other shoulder, giving them an unwanted massage.<br>\r\n<br>\r\n\"No, I can't imagine you ever disappointing me.\" He gives your shoulders a final pat, before leaving.<br>\r\n<br>\r\nA whole body shudder runs through you, and you feel dirty for just being in the same room as him. Not wanting to give him the opportunity for more lewd innuendo, you turn your attention to producing those reports. You won't.... Absolutely won't have him call you a 'naughty' in front of your colleagues.<br>\r\n<br>\r\nThe half-reflected Sarah Bachmann, in the screen looks terrified as the prospect. Wishing it was still Bill Johnston she saw reflected there, she gnawed nervously on her plush lower lip.<br>\r\n<br>\r\nTaking in her appearance, she heard Bill's approval inside her head.<br>\r\n<br>\r\nShort skirt <span class=\"cgreen\">✔</span><br>\r\nTight blouse <span class=\"cgreen\">✔</span><br>\r\nCleavage displayed to best effect <span class=\"cgreen\">✔</span><br>\r\n<br>\r\nA spear of pain shot through her temple, as Sarah fired back. <br>\r\nYou're not just eye-candy.<br>\r\nYou can do more than reports.<br>\r\nYou're as smart as you were yesterday!<br>\r\n<br>\r\nHowever, as you felt the bra-straps digging painfully into your shoulders, and with all the questions you wonder if it was all still true.</span></div></div>",
            "created":1571547600,
            "id":2735675,
            "title":"\"Anyway, I hope you're not going to dis..."
        },
        "11112213":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "You leap back into the seat, hoping to reverse ... this!",
                "\"Madre Dios\"... you curse, and stop, hearing the purring Latina lilt.",
                "You feel a little of Bill's memories fade to nothing....",
                "Your friend arrives to take you to dinner... Another secretary?!",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>\"You can do this.\" You tell yourself firmly. Despite all the changes, all the evidence of your new life. The ID in your purse confirming you're a simple secretary, and nothing to show you're truly Bill Johnson.<br>\r\n<br>\r\nYou revisit your memories, you still recall everything Bill -<i>Damn It</i>- Everything You did... <b><i>You</i></b>... until yesterday. Even if you have parallel memories as Sarah, as the timid young woman eager to please, and happy for any opportunity.<br>\r\n<br>\r\nSnagging your hands around the bear, you rip the chain from your neck. Embarrassingly it takes two attempts, your scrawny arms just lacking the strength for that simple task.<br>\r\n<br>\r\n\"A woman should be pretty, and decorated prettily...\"<br>\r\n<br>\r\nA deafening voice inside your head startles you. Leaping from the chair, it crashes unnoticed to the floor, as you look around for the source of the voice. There's no-one there, and you swallow as you recognise the words. Your own coming back to haunt you. Unwilling to settle your bust, unfortunately reminded of your lecherous boss' recent touch, you allow the girls to settle on their own.<br>\r\n<br>\r\n\"A woman can't learn without proper discipline.\"<br>\r\n<br>\r\nMutely, you shake your head, your thoughts. Were intended as a joke, as a light-hearted threat of a spanking. Now take on a new menace, as you imagine yourself being put over your boss' lap, and 'disciplined'.<br>\r\n<br>\r\nCheeks burning crimson, you can already imagine your squeaks and squeals of protest as the punishment continues relentlessly.<br>\r\n<br>\r\nBut, the taunting voice has other ideas in mind.<br>\r\n<br>\r\nAs you stand there, you feel a warmth spread through your body.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/5e/9d/af/5e9daf90a7ef831cf7bc54d5952298b9.jpg\" target=\"_blank\">https://i.pinimg.com/originals/5e/9d/af/...</a><br>\r\n<br>\r\nThe heat separates into two regions, and you quake dreading whatever is going to happen. A suspicion making you know what Bill would like, what Sarah would dread comes true, as you feel your body shift. Silently, you bust swells even larger. Your cleavage more prominently, more proudly displayed. As your hips widen, and your ass fills, you hear the crack, as your bones adjust.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/19/c9/46/19c946f4c27450b5285c1891c4333ebf.jpg\" target=\"_blank\">https://i.pinimg.com/originals/19/c9/46/...</a><br>\r\n<br>\r\n\"If you can't work, or won't work, at least you can look pretty.\"<br>\r\n<br>\r\nThe booming voice echoes inside your head. The volume is lower, but humiliatingly it's clearer too. The voice is Bill Johnson's and it's words feel like commandments.</span></div></div>",
            "created":1571547600,
            "id":2735680,
            "title":"You snatch the necklace off, ripping the chain ..."
        },
        "112":{
            "choices":[
                "\"Bill Johnson\" answers and claims you're lying about all this body swapping.",
                "Sarah answers and says she's thrilled to be you; she refuses to switch back.",
                "Sarah answers and says she wants to switch back, but doesn't know how!"
            ],
            "content":"<div class=\"\"><div> <span>You set down the strange phone and examine your surroundings more closely.<br>\r\n<br>\r\nYou're in a cramped little living room, decorated with all sorts of girly knickknacks – decorative hearts ,angels, ribbons, and flowers on the shelves and across the walls. The room is so small, you could probably fit three of these living rooms in your master bedroom alone! It's all nice, tidy, and quite clean though. <br>\r\n<br>\r\nNext, you look up and down at your body. Obviously, you already know you're a woman. Upon closer examination, you discover you're young – mid-twenties at the most. Quite shapely. You're currently dressed in nothing but a skimpy, peach negligee with black trim and a matching pair of panties that clings tightly to your nicely rounded hips and behind.<br>\r\n<br>\r\n“Who am I?” you whisper in a softly feminine soprano voice. “And how did I become this crazy chick?”<br>\r\n<br>\r\nA quick survey of the apartment yields a small, red leather purse. Inside, you discover a driver's license that identifies you as “Anderson, Sarah Marie” and pegs your age at 25. The woman in the photo is pretty, but meek looking with long, brown hair and deeply soulful, almond brown eyes. She looks quite attractive, but rather shy.<br>\r\n<br>\r\n“I don't believe this is happening,” you mutter.<br>\r\n<br>\r\nThen a brilliant thought crosses your mind.<br>\r\n<br>\r\n“I'll just call myself,” you say, snapping your long, delicate fingers in delight. “This Sarah Anderson person is probably stuck in my body right now. She'll be eager to get back to her own, mousy dead-end life. I'll just call her up, order her to get her butt over here, and we'll figure out how to switch back.”<br>\r\n<br>\r\nPadding on dainty, bare feet back to the phone, you dial up your old number and wait impatiently for Sarah to answer.<br>\r\n<br>\r\n“Come on and answer, you crazy bitch!” you growl into the still-ringing phone.</span></div></div>",
            "created":1355115600,
            "id":1485594,
            "title":"Call yourself"
        },
        "1122":{
            "choices":[
                "Go to work at ThundCorp, pretending to be Sarah Anderson. ",
                "Screw that! Go to your old house and confront her face-to-face.",
                "Before you can decide, there's a knock at the front door."
            ],
            "content":"<div class=\"\"><div> <span>“Hello?” comes the smooth, masculine baritone of your old, familiar voice. “Is this Sarah?”<br>\r\n<br>\r\n“No, this isn't Sarah!” you snap, irritated with the high-pitched squeak of your feminine voice. “I'm Bill Johnson, and you've stolen my body. I want it back, now!”<br>\r\n<br>\r\n“I didn't steal your body, sweet cheeks!” laughs the real Sarah Anderson from within your old body. “But I'm thrilled to have it now. Looks like I'm pretty rich! And I get to be a big, muscular guy. I'll bet I order around meek little chicks like you all the time, don't I? Well, now I'm wearing the pants and you get to waggle your cute little ass around in a tight skirt. The shorter and tighter, the better! Just a piece of advice from me to you, Sarah. Your boss is a pig and a jerk, but he'll go easy on you if you dress slutty and obey all his orders instantly.”<br>\r\n<br>\r\n“I'm not Sarah!” you roar. “You are! Give me back my body.”<br>\r\n<br>\r\n“I told you,” laughs Sarah. “I didn't do this. I really don't know who switched our bodies around or how exactly it happened, but I wouldn't reverse it even if I could. Enjoy your new life, Sarah.”<br>\r\n<br>\r\n“No, wait!” you cry. “Don't do this to me! Look, even if you're not responsible for this body swap, we should meet and work together to figure out a way of undoing this.”<br>\r\n<br>\r\n“Forget it!” answers Sarah. “I'm not going back to being a wage slave secretary like before. That's <u>your</u> life now, Sarah.”<br>\r\n<br>\r\n“But I don't know the first thing about being you …” you start to protest.<br>\r\n<br>\r\n“Your name is Sarah Anderson. You work at ThundCorp, on the fifteenth floor. Your boss is a raging jerk and thinks you're a brain-dead bimbo. Good luck, Sarah.”<br>\r\n<br>\r\nWith that, the phone went dead.</span></div></div>",
            "created":1356584400,
            "id":1495916,
            "title":"Sarah wants to keep your body!"
        },
        "11223":{
            "choices":[
                "Sarah's big, brutal, dominating ex-boyfriend -- pissed off about their breakup.",
                "Sarah's former BFF -- angrily confronting you about stealing her boyfriend."
            ],
            "content":"<div class=\"\"><div> <span>“To hell with that!” you scream into the already dead phone.<br>\r\n<br>\r\nThe real Sarah has already hung up on you. <br>\r\n<br>\r\nHow dare she?<br>\r\n<br>\r\nYou decide to drive right over to your old place and confront her. <br>\r\n<br>\r\nAlthough you reluctantly admit to yourself that you'll have to get dressed – in Sarah's clothes – before you can go anywhere.<br>\r\n<br>\r\nDismayed, you sigh and look down at the skimpy, peach and black negligee and panty set you're currently wearing. <br>\r\n<br>\r\n“I'm a damned chick!” you grumble, preparing to pad back to Sarah's bedroom and look for some suitable attire to wear.<br>\r\n<br>\r\nJust then, you're startled by the sound of loud, firm pounding on the door. <br>\r\n<br>\r\n“What?!” you say, your high-pitched voice sounding a bit more scared and vulnerable than you wanted.<br>\r\n<br>\r\nStill in your bare feet, you pad over to the door.<br>\r\n<br>\r\nAgain, the sound of urgently angry pounding comes resonating loudly from behind the door.<br>\r\n<br>\r\n“I'm coming!” you say.<br>\r\n<br>\r\nSomeone is pretty impatient to see you … or rather to see Sarah Anderson, you think glumly.<br>\r\n<br>\r\nWho is it?</span></div></div>",
            "created":1357189200,
            "id":1501129,
            "title":"\"Sarah\" has a visitor"
        },
        "112232":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "she accepts and left, but there still is need to discuss. she said",
                "she does not let you ....",
                "you are interupted"
            ],
            "content":"<div class=\"\"><div> <span>Oh shit this even becomes worse, you don’t want to be involved into this girl talk shit about stealing someone’s boyfriend or so….<br>\r\nYou need to cut off this other girl by telling her that you need to work and your boss already has called?<br>\r\n</span></div></div>",
            "created":1571374800,
            "id":2734719,
            "title":"Sarah's former BFF -- angrily confronting y..."
        },
        "12":{
            "choices":[
                "Another football player walks in: Dante's teammate, Maya's one-night stand",
                "Maya's grumpy, alcoholic father yells for Dante to shut up",
                "Phone rings: a friend of Maya's calls in tears"
            ],
            "content":"<div class=\"\"><div> <span>Dante Adams woke up expecting to find a ratty-haired blonde in his arms, the girl he took home from the previous night's homecoming party, but the bed was empty. This itself wasn't surprising. It had been a lousy night.<br>\r\n<br>\r\nShe couldn't stop prattling while straddling him about cosplaying as Yana-Yugo-San or some-such nonsense at an anime convention; all the while, Dante kept his ear peeled for the garage door in case his parents had lied and weren't staying the night with friends. He threw in the obligatory grunt here and there, whispered \"I love you's\" and \"Oh yeah's\" but his heart wasn't in it and he figured the girl knew. She was just happy some football player had paid attention to her.<br>\r\n<br>\r\nHe rubbed the sleep out of his eyes. The ceiling was the same slate-gray as his own, but everything else seemed different... The bed was closer to the ground, the sunlight came from another angle, the covers felt thinner and the corner pulled across his shoulder was decorated with green-and-brown bamboo sticks. His had been plain, and he was sure the nerd girl hadn't brought her own blanket...<br>\r\n<br>\r\nA poster on the wall caught his attention. \"MARTYR OF THE RUCKUS,\" bold, faux-3D letters declared beneath a photo of sleazy, scowling men in leather and dreads. They were the big pop-band of that year, geared mostly toward popular girls who wanted to feel \"rebellious.\" All the cheerleaders loved them. Dante's thoughts began to race at the association until, spotting family photos featuring a certain brunette, his mind seized the impossible. He clutched his head and felt a thicker mane of hair, and in the motion several strands fell before his eyes - brown, not blonde and close-cropped.<br>\r\n<br>\r\nThe covers flew off and Dante discovered the damp camisole plastered to his new rack of epic proportions: breasts he only dreamed of, now two inches from his vision. Green boxer shorts cut off at his thighs and revealed tan, vibrant legs, no doubt as muscular as his old ones, but more compact in their power and capable of a grace beyond the limits of his old broad-shouldered, 6'3'' body. Bare feet with pink-pig toes wiggled at the edge of this smaller bed. They taunted him with the new reality.<br>\r\n<br>\r\n\"What the fuck!\" he squeaked, voice crackly, soft and new. \"I'm actually Maya Braynard!\"</span></div></div>",
            "created":1353560400,
            "id":1473023,
            "title":"Dante's In f'r no easy times"
        },
        "121":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "Call his phone to see if Maya is in his body",
                "Get dressed",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"And I'm actually Steve Raleigh.\" a deep voice said. Dante turned around to see Steve Raleigh, one of his teammates, shirtless, standing near the door.<br>\r\n<br>\r\n\"Steve?\" Dante asked.<br>\r\n<br>\r\n\"Don't tell me you forgot about last night. That's a night that no girl can forget about.\" Steve replied, as he pulled his shirt on.<br>\r\n<br>\r\n<i>\"Course he went home with her. What does this make it, half the team now?\"</i> Dante wondered.<i> \"Hope Maya didn't think they had anything. He's just in it for another conquest story to tell us.\"</i><br>\r\n<br>\r\n\"Anyway, I've gotta go. Practice is early this morning and coach hates it when we're late.\" Steve said.<br>\r\n<br>\r\n\"Have fun...\" Dante said as Steve left the room.<i> \"Okay, so let's see what happened. I somehow became Maya Braynard during the night, and I have to figure out what happened, and how to change myself back into me. Good, let's begin with...\"</i></span></div></div>",
            "created":1475470800,
            "id":2218516,
            "title":"Another football player walks in: Dante's t..."
        },
        "1212":{
            "author_id":"secretspider",
            "author_name":"Susie",
            "choices":[
                "Your mom calls you downstairs ",
                "Steve takes advantage and goes for another round ",
                "You orgasm "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You get up realizing you were naked and couldn’t help but massage and kissing your new boobs and that make you horny and you started to rub your new vagina and you couldn’t stop until what happened?</span></div></span></div>",
            "created":1573426560,
            "id":2744947,
            "title":"Get dressed"
        },
        "12121":{
            "author_id":"secretspider",
            "author_name":"Susie",
            "choices":[
                "Your mom",
                "No one"
            ],
            "content":"<div class=\"\"><div> <span>You stop for now and you put on a tank top Steve left and it sorta fit but it’s good enough. You put on some thin yoga pants and you realize you didn’t put on panties or a bra but you like it better without them. You start to admire your new butt and slapping and squeezing it . You say “Look I’m maya I have a fat a$&amp; and look at it jiggle. This is mine now and I love having it.” As you continue. What stops you?</span></div></div>",
            "created":1573427340,
            "id":2744957,
            "title":"Your mom calls you downstairs "
        },
        "121211":{
            "author_id":"secretspider",
            "author_name":"Susie",
            "choices":[
                "At school ",
                "On the way"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly you something pull down your pants and slaps it good casing you to moan. Your mom say “remember who you got it form” and she start doing what you were doing. And you unintentionally slap her butt and she laughs and takes off her panties and say “our butts got to stick together so if you don’t wear them I don’t.” You nod and you go in the car to school.</span></div></div>",
            "created":1573427640,
            "id":2744958,
            "title":"Your mom"
        },
        "1212112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue",
                "continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>on the way you are still confused about this encounter with your, or better Maya's mother....</span></div></span></div>",
            "created":1573463220,
            "id":2745162,
            "title":"On the way"
        },
        "123":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "listen what Anne has to say",
                "you are interupted",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>And the display of the phone showed the caller as Anne. Dante only knows her from seeing and she is not very popular, because she is always a kind of drama queen. And picking up the call and hearing Anne crying and complaining about something underlined the picture he had from her…</span></div></div>",
            "created":1353646800,
            "id":1473639,
            "title":"Phone rings: a friend of Maya's calls in tears"
        },
        "1231":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "still listen",
                "end the call",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And the picture of Anne got confirmed, as she told that her boyfriend had cheated her with some exchange student and so on and so on, girls stuff…</span></div></span></div>",
            "created":1357275600,
            "id":1501522,
            "title":"listen what Anne has to say"
        },
        "12313":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "tell her to stop",
                "just hang up",
                "be patient and listen further"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Dante was about to end the call, he had to scope with the fact, that he suddenly and unwanted somehow became this Maya girl, but unfortunate Anne was talking and talking…</span></div></span></div>",
            "created":1571374800,
            "id":2734729,
            "title":"talking and talking"
        },
        "123133":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "shower",
                "dress",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>after a while she ends the call and you finally have your freedom again, but you are still trapped as Maya the girl</span></div></span></div>",
            "created":1573463280,
            "id":2745163,
            "title":"be patient and listen further"
        },
        "14":{
            "choices":[
                "Ronald's mother comes in to check on him.",
                "One of Ronald's dweeby, nerd friends arrives to walk to school with him.",
                "Ronald's phone starts ringing. Ronald (in Rebecca's body) is calling!",
                "See how Ronald is faring, waking up just now in Rebecca's body?",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>Rebecca Ward enjoyed the best night's sleep she'd ever had in her sixteen-year old life.<br>\r\n<br>\r\nShe'd dreamed it was senior year of high school already, and she had been elected Prom Queen, finally fulfilling what she knew had always been her just role in school. All the boys were clamoring for her attention, but only the hunkiest and hottest could be her date, of course. All the girls had been put firmly in their places: either as ladies-in-waiting to run errands for Rebecca and laugh at all her snide jokes, or cast off into the outer circle of losers and social misfits deemed unsuitable to interact with the rest of teenage society.<br>\r\n<br>\r\nYes, what a wonderful dream, thought Rebecca as she yawned and stretched in the golden, warm rays of the early morning sunlight streaming through her window.<br>\r\n<br>\r\n“Wait a minute,” she grumbled to herself. “I hate morning sunlight!”<br>\r\n<br>\r\nShe'd insisted her parents put up expensive, extra-thick curtains to block the light from disturbing her beauty sleep. What was going on?<br>\r\n<br>\r\nIrritated, Rebecca sat upright in bed, fully prepared to fight with the drapes to get them closed. Mom and dad would get an earful about this at breakfast, of course! They'd promised her these window treatments were the best, and yet here she was being awoken by rotten old blinding sunlight when … <br>\r\n<br>\r\nRebecca abruptly stopped her mental tirade in order to blink her eyes a few times in amazement.<br>\r\n<br>\r\n“This isn't my bedroom,” she said flatly.<br>\r\n<br>\r\nThe room was a cluttered, claustrophobic mess of drab colored, dirty piles of clothes. Paperback books were stacked waist-high along one wall. A bookshelf nearby stood filled, not with books but with a bewildering array of plastic model spaceships and little toy action figures of robots, aliens, and comic book heroes. The walls were plastered with badly hung, cockeyed posters ripped out of cheap, glossy magazines. Rebecca, who normally had perfect vision, couldn't quite make out the pictures depicted in the posters.<br>\r\n<br>\r\n“Why is it so blurry?” she said.<br>\r\n<br>\r\nThen she noticed her voice.<br>\r\n<br>\r\nIt <u>wasn't</u> her voice.<br>\r\n<br>\r\nIt was a squeaky yet low-pitched voice. Almost like the voice of a … a boy?!<br>\r\n<br>\r\nImmediately, Rebecca leaped out of bed and started examining herself.<br>\r\n<br>\r\nHer worst fears were confirmed: she was in the chubby, pale skinned body of a sixteen-year old boy right now!<br>\r\n<br>\r\nShe was currently shirtless, and could see her flabby yet flat-chested, male torso clearly displayed. Whoever's body this was, the poor schlub clearly never worked out! Around her legs was a pair of flannel pajama pants. Lifting the front waistband of the pajamas, Rebecca peered down and sighed in disgust at the sight of her own flaccid penis, just hanging there limply. <br>\r\n<br>\r\n“I've become some pathetic loser,” she said, still staring in horror at her small yet undeniably masculine sign of manhood.<br>\r\n<br>\r\nGroping around a bit, Rebecca managed to find a sweatshirt to pull on. Next came a pair of glasses with mind-bogglingly thick lenses and unflatteringly unfashionable cheap, plastic frames. They allowed her to see much better though, and she was finally able to complete a visual survey of the tiny bedroom she now occupied.<br>\r\n<br>\r\nUnsurprisingly, the posters on the walls all depicted various stupid sci-fi movies and television shows Rebecca was unfamiliar with. Likewise, the stacks of paperback novels all had dumb science fiction or fantasy titles on them. She didn't see a copy of the <i>Hunger Games</i>, <i>50 Shades of Gray</i>, or one of the<i> Twilight</i> books anywhere! Clearly this geek had <u>no</u> taste in literature!<br>\r\n<br>\r\n“Who the hell am I?” she wondered aloud.<br>\r\n<br>\r\nOn cue, an obnoxiously nasal voice called out from somewhere else in the house: “Ronald, darling sweety-pie, are you awake yet my little pumpkin?”<br>\r\n<br>\r\n“Oh … my … gawd,” Rebecca said, trying to fight a rising tide of panic within her. “I'm that clumsy, fat nerd kid from school – Ronald Dwebble.”</span></div></div>",
            "created":1357189200,
            "id":1501130,
            "title":"Rebecca Ward"
        },
        "141":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue",
                "something else",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Ronald, dear?” said a soft, feminine voice from behind.<br>\r\n<br>\r\nRebecca jumped, startled by the sudden intrusion of a stranger into her new bedroom. She breathed a sigh of relief when she caught sight of the plump, middle aged woman who, she surmised, must be her new mother.<br>\r\n<br>\r\n“Oh, hello,” Rebecca said, forcing a smile. “You just surprised me.”<br>\r\n<br>\r\n“My, you're a bit of a surprise yourself this morning, honey,” said Ronald's mother with a proud smile. She looked up and down Rebecca, admiring the choice of attire Rebecca had effortlessly selected and clothed herself in. “You're already dressed for school, and I must say your appearance looks so neat and tidy for a change. I'm really proud of you, sweetie. You clean up so nicely when you want to. Maybe you'll be asking a girl out on a date today at school?”<br>\r\n</span></div></div>",
            "created":1360558800,
            "id":1529843,
            "title":"Ronald's mother comes in to check on him."
        },
        "1411":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "check for alternatives, maybe bus or bike",
                "walk",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Rebecca tried not to burst out laughing at the thought of fat, nerdy, shy Ronald Dwebble asking out a girl. <br>\r\n<br>\r\n“My little man is growing up,” said Ronald's mother. “I'm sorry to embarrass you, honey. It's just that I'm so thrilled to see you finally coming out of your shell.”<br>\r\n<br>\r\nRebecca felt a pang of guilt. She didn't really know Ronald, but she could somehow still empathize with a mother who wanted to see her son happy.<br>\r\n<br>\r\n<br>\r\nShe must know what a loser he is, but nevertheless she hopes and prays he'll find a way to fit in and be happy. <br>\r\n<br>\r\nAnd she probably has no idea just how cruel Rebecca and the other popular kids at school have been to her little boy over the years.<br>\r\n<br>\r\n“Uh, I think I should just get to school,” Rebecca said to Ronald's mother, suddenly unable to face the woman.<br>\r\n<br>\r\n“Have a great day at school, sweetie!” said Ronald's mother. “I think you look very handsome today. Any girl at that school would be lucky to be dating you.”<br>\r\n<br>\r\nRonald Dwebble on a date, thought Rebecca with a mixture of disgust and guilt. She still thought the overweight, social recluse was an ugly, pathetic geek. But at the same time, Rebecca was now starting to see first-hand some of the silent, hidden pain Ronald must live with.<br>\r\n<br>\r\nIt was no fun being him!<br>\r\n<br>\r\nGrabbing Ronald's heavy book bag, Rebecca heaved a sigh and began trudging out the door.<br>\r\n<br>\r\n“Oh, I give up!” Rebecca said, because all of this was really very difficult for her!<br>\r\n<br>\r\nBut not now, not yet! She headed out to school!<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nAs Rebecca she was used to go to school by her own car, a nice sporty red convertible, but now she had to walk.<br>\r\n</span></div></div>",
            "created":1360645200,
            "id":1530576,
            "title":"continue"
        },
        "144":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue",
                "back to Rebecca in his body",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Here we go: Let’s focus the story on the poor guy, Ronald Dwebble, a clumsy nerd kid from school – very often pranked by other kids, treated badly especially from Rebecca, who only needs him to copy homework!<br>\r\nRonald had a bad sleep as most of his nights. He was now sixteen-years old, but wondered what he had reached so for in his poor life. Ok his family loved him and he had rather good marks in school, but he is also misused by this Rebecca girl, who had great looks, but also a mean personality and she very often copies his homework, instead of doing it herself!<br>\r\nAnyhow secretly he'd dreamed it was senior year of high school Prom and he had been elected King with her as his Queen…<br>\r\nBut he was sure that this dream was not only his, but All the boys were dreaming the same. One is lucky, her boyfriend Steve, football star, and …to be honest the hunkiest and hottest guy around…<br>\r\nAll ladies are in-waiting to run errand Rebecca and get him…<br>\r\nRonald awakes and must laugh at all rules of teenage society.<br>\r\n“Wait a minute,” he grumbled to himself. “Something is wrong!”<br>\r\n</span></div></div>",
            "created":1357275600,
            "id":1501521,
            "title":"See how Ronald is faring, waking up just now in..."
        },
        "1441":{
            "choices":[
                "Rebecca (in Ronald's body) calls on the phone.",
                "Rebecca's mom tells him to hurry up and get dressed.",
                "Rebecca's annoying little brother barges into the room."
            ],
            "content":"<div class=\"\"><div> <span>Ronald, long forced by the cruelties and pranks of adolescent society into developing swift instincts for detecting danger, knew something was wrong far before Rebecca.<br>\r\n<br>\r\nHis tiny body was shivering.<br>\r\n<br>\r\nRonald had always been a bit pudgy – husky, his mother called him. But he'd never been small or light enough to shiver from a simple cool, morning breeze in the early air. Something had happened to the small ridge of fat he usually had padding and protecting his body from a chill.<br>\r\n<br>\r\nBolting upright in bed, Ronald blinked his eyes to full alert status.<br>\r\n<br>\r\n“My spidey sense is definitely tingling,” he said to no one in particular.<br>\r\n<br>\r\nHis voice was <u>all wrong</u>. But that could wait. At the moment, Ronald was more immediately consumed by the fact that his bedroom was even <u>more</u> wrong!<br>\r\n<br>\r\nEverything was pink and girly (not to mention neat and tidy!)<br>\r\n<br>\r\nAnd Ronald himself was laying under some expensive looking, pink and white satin sheets in a big, plush bed that was for more comfy than the one he was accustomed to.<br>\r\n<br>\r\n“I'm not me anymore,” he said simply. “And this isn't my bedroom. What, oh just what, is going on here?”<br>\r\n<br>\r\nCalmly, Ronald climbed out of bed and began to examine his own body.<br>\r\n<br>\r\n“Confirmed,” he said to himself, looking down at a pair of perky, firm breasts and creamy, smooth skin clad beneath a skimpy, white negligee with lace trim. “This is most definitely not my body.”<br>\r\n<br>\r\nHe began walking around the room, searching for clues to his identity. Passing a wall-mounted mirror, Ronald caught a glimpse of reflection and actually stood still, genuinely surprised.<br>\r\n<br>\r\n“Rebecca Ward?” he said, a bit shocked. “Of all the people in the world, I somehow … I mean, I really switched bodies with Rebecca?”<br>\r\n<br>\r\nLong a fan of science fiction and fantasy books, films, and television, Ronald had found it easy to swallow that something incredible had happened to him: he had magically swapped bodies with another person. But what Ronald wasn't prepared for was that the person he had switched with would be the gorgeously beautiful yet shallow and superficial Rebecca Ward – the same person Ronald had secretly harbored an unrequited crush on since grade school … and the same person who had always treated him with nothing but cruel, mean-spirited contempt.<br>\r\n<br>\r\n“Why am I Rebecca?” he said, softly touching his cheek while still gazing into the mirror. </span></div></div>",
            "created":1357275600,
            "id":1501806,
            "title":"Ronald's unusual morning"
        },
        "14411":{
            "choices":[
                "At school, Ronald decides to change Rebecca's reputation for the better.",
                "At school, Rebecca decides to change Ronald's reputation for the worse!"
            ],
            "content":"<div class=\"\"><div> <span>Just then, a thin glittery purple phone on Rebecca's dresser started playing a Lady Gaga song Ronald was unfamiliar with.<br>\r\n<br>\r\nTearing his eyes away from his angelic new reflection in the mirror, Ronald picked up the phone and answered.<br>\r\n<br>\r\n“Hello?” he said.<br>\r\n<br>\r\n“You miserable toad!” came the familiar voice of an angry, teenage boy. “You stole my body. I want it back <u>right now</u>, or else!”<br>\r\n<br>\r\n“Excuse me?” Ronald said, actually confused for a moment about who would be so angry with him. “Oh, wait – is this Rebecca Ward?”<br>\r\n<br>\r\n“Of course I'm Rebecca!” she shouted with Ronald's voice. “You think you can steal my body and leave me trapped as a fat nerd? Oh, I'm going to make your life so miserable …”<br>\r\n<br>\r\n“Calm down,” Ronald said. “I didn't do this on purpose. In fact, I don't think I did anything at all to cause this. It's as big a surprise to me as it seems to be to you. Believe me, I'd love to get back to my own body.”<br>\r\n<br>\r\n“What are you talking about?” said Rebecca. She found it inconceivable that Ronald didn't want to remain in her body. She was beautiful, popular, and spoiled rotten by her rich parents. Ronald <u>had</u> to have done this on purpose. He was jealous of her and had wanted to steal her life … right?<br>\r\n<br>\r\n“I said I didn't do this,” Ronald repeated calmly. “And if you'd like, I think we should cooperate and work together to find a way of reversing this.”<br>\r\n<br>\r\n“You actually want to go back to your fat, loser nerd body?” Rebecca asked incredulously.<br>\r\n<br>\r\n“Uh, yeah,” Ronald said. “I guess I do. Look, you're very pretty Rebecca … but … well, I don't really want to be a girl.”<br>\r\n<br>\r\nRonald laughed nervously.<br>\r\n<br>\r\n“Okay,” Rebecca said suspiciously. “So what do we do to change back then, Mr. Braniac?”<br>\r\n<br>\r\n“Well,” said Ronald. “In episode seventy-nine of <i>Star Trek</i>, Janice Lester uses an alien life-energy transfer procedure to steal Captain Kirk's body, and …”<br>\r\n<br>\r\n“Oh my gawd!” groaned Rebecca. “I can't believe I'm listening to my own voice say all this creepy, nerd stuff!”<br>\r\n<br>\r\n“I'm just trying to help,” Ronald said with an irritated edge to his voice.<br>\r\n<br>\r\n“Then help!” sighed Rebecca. “Build a warp drive and beam us up back to normal, or whatever you nerds do.”<br>\r\n<br>\r\n“First, in the show it was a life-energy transfer procedure, not a warp drive or transporter,” Ronald pointed out. “Second, I couldn't build a transporter, much less a functioning warp core, even if I wanted to! Which believe me, I'd love to be able to do. But some things are simply in the realm of science fiction rather than …”<br>\r\n<br>\r\n“Shut up!” screamed Rebecca. “Look, can you switch us back or not?”<br>\r\n<br>\r\n“Not at the moment,” answered Ronald. “But if we work together, I'm sure we can eventually find a way to reverse this.”<br>\r\n<br>\r\n“This sucks!” yelled Rebecca. “Oh, and great. Now your mom is yelling at me to get dressed and go to school. I don't want to be you!”<br>\r\n<br>\r\n“We'll talk at school,” Ronald said, trying his best to calm down the melodramatic diva now inhabiting his body.<br>\r\n<br>\r\n“You better find a way to give me back my body!” shouted Rebecca one last time, before hanging up the phone.</span></div></div>",
            "created":1357275600,
            "id":1501807,
            "title":"Hysterical Phone Call"
        },
        "144111":{
            "choices":[
                "Dress her body in conservative, modest clothes and be friendly with nerds.",
                "Dress her body in nerdy clothes and be a know-it-all overachiever in her classes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does Ronald do today to improve (from his perspective) the life and reputation of Rebecca Ward?</span></div></span></div>",
            "created":1357534800,
            "id":1504115,
            "title":"Changing Rebecca's reputation?"
        },
        "1441111":{
            "choices":[
                "The real Rebecca's friends spot Ronald and come over to talk.",
                "Rebecca herself (in Ronald's old body) arrives and confronts him."
            ],
            "content":"<div class=\"\"><div> <span>Ronald sighed and looked down at his girlish new body. <br>\r\n<br>\r\nRebecca sure sounded angry on the phone, he reflected. It would be best, Ronald mused, to avoid further arousing her ire. He felt confident they'd eventually find some way to reverse the bodyswap that had affected them. After all, that was the natural course of events in the fantasy and sci-fi stories Ronald had often read. To be sure, it was awfully strange being a girl right now. But Ronald remained confident that his tenure as the occupant of Rebecca Ward's body would be temporary.<br>\r\n<br>\r\nSo Ronald simply had to act as an interim steward for Rebecca Ward – don't do anything to embarrass, annoy, or otherwise fluster the real Rebecca. He was simply a caretaker for her body. Ronald resolved to keep a low profile and strive to simply blend in with the crowd at school. That should be the safest course of action. <br>\r\n<br>\r\nWhile bashfully averting his eyes, Ronald stripped out of the skimpy negligee and panties Rebecca had worn to bed last night. He then groped about in her underwear drawer (a prospect that normally would both aroused and embarrassed him) before pulling out a pair of lime green cotton granny panties from the far back of the drawer. These would be the best to wear, he thought. After all, he'd have to change clothes in the girls gym locker today. He'd hate to embarrass Rebecca by having the other girls see her body wearing something skimpy, provocative, or otherwise too revealing. <br>\r\n<br>\r\nPulling the panties up onto his smooth, soft legs, Ronald tugged to get them properly fitted to cover his large, curvy, round hips and behind. <br>\r\n<br>\r\nNext, Ronald pulled out a random bra from Rebecca's dresser. He wasn't sure it was important to match the bra with the panties, but figured such things were fairly trivial. He struggled for a few moments with the stiff, lacy purple garment, but finally managed to get it securely fitted over his firm, perky breasts. <br>\r\n<br>\r\nThat's weird, thought Ronald gazing down at his feminine chest. He'd always thought the role of a bra was to restrain and secure a woman's breasts. And yet with the bra on, Ronald's new female assets seemed even bigger and more jiggly than before. Somehow this garment was padded or something to enhance the size of Ronald's boobs and even make his cleavage more pronounced than ever. He had to admit, it was a pleasing sight – one that would have pleased him far more had he still been a teenage boy! But he now felt himself hoping Rebecca wouldn't be angry with him for choosing a bra that drew too much attention to her former breasts.<br>\r\n<br>\r\n“Clearly, there's a lot I still need to learn about women and their clothing,” Ronald said aloud to himself.<br>\r\n<br>\r\nStill bashfully worrying and fretting over his breasts, Ronald opted to dress himself in modest, reserved clothing. As a boy, Ronald had been a simple t-shirts and jeans kind of guy. So he dug through Rebecca's clothes hoping to find something similar. He managed to find a plain, light gray t-shirt made of some soft, girlish fabric. He put it on, but chose not to pair it with jeans. Everything Rebecca owned seemed too tight and revealing – skinny jeans, jeggings, leggings, and super short shorts. Exasperated, Ronald finally gave up and put on the longest skirt he could find in Rebecca's closet: a dark pink garment that came down to mid-calf on his new body. <br>\r\n<br>\r\nThe skirt left him feeling cold, drafty, and exposed around the legs though. So Ronald found a pair of opaque, hot pink tights and worked them up onto his feet and legs. He then found a pair of black and white, Converse Chuck Taylors and put them on. <br>\r\n<br>\r\n“Good enough,” Ronald said to himself, finally checking out his reflection in the mirror.<br>\r\n<br>\r\nThe girl in the mirror, however, looked all wrong.<br>\r\n<br>\r\n“What am I not doing right?” Ronald wondered.<br>\r\n<br>\r\nHe grabbed a pink, button down cardigan sweater and slid his arms into it. Did that help? Not really. Maybe he needed to do something with his hair? Ronald hurriedly brushed his long, golden blonde locks, slicked it all straight back, and tied it into a loosely limp ponytail. Still not right! Maybe he needed makeup? Girls like Rebecca were always wearing makeup. Timidly, Ronald reached for a random tube of lipstick and began smearing his lips with a coat of bright, bold, ruby red gloss. Again, back to the mirror – again, still not right!<br>\r\n<br>\r\n“Oh, I give up!” Ronald said in exasperation. “This will just have to be close enough.”<br>\r\n<br>\r\nRonald made sure to grab Rebecca's school bag full of books before heading out the door. He definitely didn't want to embarrass her by forgetting to bring her homework or study materials for class. <br>\r\n<br>\r\nUnlike Ronald himself, Rebecca owned her own car – a sporty little red convertible. So while Rebecca was trudging to school on foot in Ronald's body right now, Ronald got to enjoy the new experience of driving himself to school. He made absolutely certain not to speed or do anything foolish. He didn't want Rebecca getting a ticket.<br>\r\n<br>\r\nArriving at the high school's parking lot, Ronald got out of the car and had to adjust his tights and skirt a bit, in a most unladylike fashion. At the other end of the parking lot, Ronald spotted two other teens – a pair of social misfits named Edith and Penelope. As a guy, Ronald had enjoyed a passing acquaintance with the two. He was lab partners with Edith again this year, and he and Penelope were in the audiovisual club together and had done some behind-the-scenes tech work on sound and lighting for school plays. Ronald wasn't exactly friends with either girl, but had enough of a casual association with both to say hello in the school halls.<br>\r\n<br>\r\nNow disguised in the body of popular Rebecca Ward, Ronald skipped up to Edith and Penelope and greeted the pair.<br>\r\n<br>\r\n“Hi, guys!” he chirped in Rebecca's voice.<br>\r\n<br>\r\nEdith and Penelope stopped dead in their tracks, staring long and hard at Ronald without speaking.<br>\r\n<br>\r\nPenelope, a tall skinny girl with a pale complexion made worse by her choice of all black clothing, forced herself to smile politely and nod quietly at Ronald.<br>\r\n<br>\r\nEdith, a short chubby girl with thick glasses and hair dyed an unnatural neon green girl, stared with her jaw dropped wide for a moment. <br>\r\n<br>\r\n“What the hell is wrong with you today, Li'l Miss Prom Queen?” Edith asked. “Since when do you deign to grace the dregs of high school society outcasts with your stylish presence?”<br>\r\n<br>\r\nPenelope said nothing but quietly began to giggle.<br>\r\n<br>\r\nRonald blushed with embarrassment. <br>\r\n<br>\r\n“Look, I'm sorry if I haven't been that nice to you in the past,” he said. “But bygones are bygones, right? I just thought …”<br>\r\n<br>\r\n“You? Thought?” laughed Edith. “That's one for the history books, Penelope! Our pretty pink cheerleader princess here just had her <u>very first</u> thought. Stop the presses! Rebecca Ward's brain develops a thought – details during the 11 o'clock news.”<br>\r\n<br>\r\n“Okay, I probably deserved that,” admitted Ronald ruefully. Normally, he rather enjoyed chemistry class with Edith's caustic, biting sense of humor constantly aimed at the popular kids in class. This morning though, it was all directed right at him. “But now, I'm … uh … I'm turning over a new leaf and trying to be a new person. I'm sorry about everything that I've done in the past. I hope you and Penelope can forgive me. I assure you, I really am a changed ma- ... a changed girl. I'm a whole new person now!”<br>\r\n<br>\r\n“Good for you,” Penelope said quietly, still struggling not to giggle.<br>\r\n<br>\r\n“Is that why you let a pack of hyperactive, color-blind, four year olds dress you this morning?” asked Edith. “Sheesh, at least the old you had style – vapid, shallow, superficial style … but style nonetheless. What are you now: the Ugly Betty Barbie Doll? Ooo, I love your makeup Rebecca! Tell me: is it maybelline or lipstick by the Joker?”<br>\r\n<br>\r\n“Edith, come on. Let's just go,” giggled Penelope.<br>\r\n<br>\r\n“No way,” said Edith. “This Lindsey Lohan wannabe here has made our lives an absolutely miserable living hell since middle school. And now she suddenly has a change of heart and wants to play friendly? What happened – did your little bimbo friends all desert you, and now you have no one to be snooty and arrogant with? Or were you visited last night by the ghostly spirits of prom queens past, present, and future and given visions of why you must change your simpleminded, superficial ways? Is that why you want to play at this little game of Let's Patronize the Freaks and Geeks?”<br>\r\n<br>\r\n“Sorry about her,” Penelope said, still struggling not to snort with uncontrollable laughter. “We like the new you, Rebecca. We <u>really</u> do!”<br>\r\n<br>\r\nPenelope now forcibly dragged her shorter friend away, leaving a stunned Ronald standing alone in the parking lot, scratching his head and wondering what he had done wrong. A brilliant but friendly nerd like himself in the body of a beautiful, popular girl – he should have the best of both worlds right now!</span></div></div>",
            "created":1357880400,
            "id":1506397,
            "title":"The new Rebecca arrives at school"
        },
        "14411111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "they start to gossip",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Now another encounter with other girls, Ronald recognized them as Jenna and Mindy, and they are member of the IT girls around here, so they certainly are so called friends of Rebecca, the old Rebecca, but for the moment Roland plays it save to avoid another disaster he just had with Edith and Penelope!</span></div></div>",
            "created":1358226000,
            "id":1509181,
            "title":"The real Rebecca's friends spot Ronald and ..."
        },
        "144111111":{
            "choices":[
                "How much they secretly hate that uppity Rebecca and want revenge on her.",
                "What they think about Ronald and his own circle of friends. "
            ],
            "content":"<div class=\"\"><div> <span>Spotting Jenna and Mindy standing just outside the main doors into the high school, Ronald quietly darted behind some nearby bushes hoping they hadn't seen him.<br>\r\n<br>\r\nAfter his disastrous encounter with Edith and Penelope, Ronald was eager to avoid attention at all costs. Obviously, there was a lot he still failed to understand about women – nerds or otherwise!<br>\r\n<br>\r\nHiding in the bushes and waiting for Jenna and Mindy to go inside, Ronald heard the two popular girls begin their daily discussion of all the latest scandal, rumor, and hearsay currently making its way through the teenage grapevine. <br>\r\n<br>\r\nWho and what are they gossiping about?</span></div></div>",
            "created":1358312400,
            "id":1509962,
            "title":"Jenna and Mindy are gossiping"
        },
        "1441111112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "interact",
                "ignore it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And situation becomes worse, since now poor Ronald must listen to their conversation about him, about how much they dislike Ronald…</span></div></span></div>",
            "created":1358398800,
            "id":1510246,
            "title":"What they think about Ronald and his own circle..."
        },
        "14411111121":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "catfight",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“Gawk, I hate it when you gossip all the time about those kids like Ronald! You better should have a look at yourselves!” shouted Ronald to the other girls…</span></div></span></div>",
            "created":1359522000,
            "id":1520303,
            "title":"interact"
        },
        "144111111211":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "to late- Ronald was in fighting mode already",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>It was now time to no longer restrain and being the one, who always loses for Roland. Now he had the matching body and environment to change something for the first time in his life, at least he felt that this was the first time in his life now.<br>\r\nJenna and Mindy felt that Rebecca is acting strange today and wanted to avoid confrontation or even a catfight!<br>\r\n</span></div></div>",
            "created":1359694800,
            "id":1521508,
            "title":"catfight"
        },
        "1441111112112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "Jenna and Mindy",
                "Penelope"
            ],
            "content":"<div class=\"\"><div> <span>The other two girls took their books and hurried off to their classrooms and had luck that Ronald/Rebecca had other classes right now. The bell saved all 3 girls from executing a catfight now!<br>\r\n<br>\r\n<br>\r\nShit, thought Ronald, there was no way to teach them a lesson right now! But he was sure that time will come where they get what they deserve!<br>\r\nWhen not today then maybe tomorrow!<br>\r\n<br>\r\nNow, still trapped inside Rebecca’s body he had to join some of her classes and even some algebra exam…<br>\r\nHe gazed at the first question: Find a polynomial with integer coefficients that has the following zeros: - 1/3, 2, 3 + i<br>\r\n<br>\r\nPiece of shit, he thought, trying to find any answer, at the end just writing something down in kind of autopilot mode…<br>\r\n<br>\r\n<br>\r\nNext question: Factor f(x) = x³ + 2x² +14x completely over the complex numbers.<br>\r\n<br>\r\nAgain writing something down and he thinks he even knows the answer…<br>\r\n<br>\r\n<br>\r\nWhat next? Find all vertical and horizontal asymptotes for the graph of the following function and then graph the function…<br>\r\nNow Roland’s skills of mathematics came back and he could answer this and 6 more questions easy and with confidence within the remaining 15 minutes of testing time.<br>\r\nThen the bell rang and he was confronted with somebody…<br>\r\n</span></div></div>",
            "created":1359694800,
            "id":1521511,
            "title":"not now"
        },
        "14411111121121":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "it worked out well",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Ah there they are again, those two annoying girls, Jenna and Mindy. Ronald wished he could avoid them anyhow, but this was part of Rebecca’s live and as long as he is trapped as her, it is also part of his current life!<br>\r\nHe found a new strategy, ignore them at all!<br>\r\n</span></div></div>",
            "created":1359954000,
            "id":1524061,
            "title":"Jenna and Mindy"
        },
        "144111111211211":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "get closer to the new girl, make advantage of your current look",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>And he could find a way now, which was just following the English classes now, where no further problems arrived!<br>\r\nToday was the day, where two new students were introduced, because they moved here with their families. There was a guy and his sister. She was pretty, had a perfect smile, which causes Ronald’s male mind to jump of joy, because she was sitting on the desk next to him!<br>\r\nSo he greets the new girl, called Alyssa, which is a very nice name for the very pretty and nice girl!<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nRonald tries to imitate the best face he could show as Rebecca, always having in mind that he is a girl talking to another girl….<br>\r\nBut he could not hide his true desires, his current female body felt warm and gooey inside from the arousal of sitting next to Alyssa…<br>\r\n<br>\r\n“Hi” he said giggling for no real reason, “my name is Rol--- Rebecca…”<br>\r\n<br>\r\n“Very nice to meet you, Rebecca” said the friendly new girl and they were handshaking, which also caused some luckily invisible arousal inside Roland’s groin area. This might be an advantage of being female!<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nBut overall it was a torture to be trapped in the flesh of a hot girl for Ronald, not having real possibility to do something what he would like to do!<br>\r\n</span></div></div>",
            "created":1360040400,
            "id":1525000,
            "title":"it worked out well"
        },
        "1441111112112112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Realizing the current situation with the new girl, this made Ronald a little bit frustrated and he was sitting a little bit absent in the seat in class…<br>\r\n<br>\r\nGreat, he thought, either she will think I’m a lesbian or something or she will dislike me or ….<br>\r\n</span></div></div>",
            "created":1360126800,
            "id":1525700,
            "title":"thinking"
        },
        "14411111121121121":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "teacher asked to share thoughts",
                "Alyssa asked to share thoughts"
            ],
            "content":"<div class=\"\"><div> <span>Ronald went on with is thoughts, which were spinning around and around:<br>\r\nI don’t want to be lesbian or bisexual on top of everything else, he moaned to himself.<br>\r\n<br>\r\n“There has be some way out of this mess” he whispered to himself.<br>\r\n<br>\r\n“What was that, Miss Rebecca?” asked the teacher<br>\r\n<br>\r\n“Nothing sir,” Ronald answered loudly “just thinking”…<br>\r\n</span></div></div>",
            "created":1360213200,
            "id":1526649,
            "title":"continue"
        },
        "14411111122":{
            "choices":[
                "Ronald encounters more ridicule as he circles the school.",
                "Ronald actually encounters someone sympathetic to his current plight. "
            ],
            "content":"<div class=\"\"><div> <span>“Gawd, and I hate it when those fat kids like Ronald look at you!” sneered Jenna. “It's all creepy and stuff, knowing those greasy nerds actually <u>like</u> you. Yuck! I'd be all like totally grossed out if he ever asked me on a date or something. Ugh!”<br>\r\n<br>\r\n“I know,” sighed Mindy, rolling her eyes in disgust. “Can't they like build a separate school just for all the Ronald Dwebbles of the world? I mean, why should normal people like us have to go to the same school as these geeky creeps do!”<br>\r\n<br>\r\n“I had to sit next to Ronald last year in history,” shuddered Jenna. “You have no idea how gross he is! And then he's this total nerd too, always raising his hand in class and giving all the right answers.”<br>\r\n<br>\r\n“And I beat he ruins the grading curve for everyone else?” asked Mindy.<br>\r\n<br>\r\n“Yeah, like totally,” replied Jenna. “Stupid fat jerk, he just thinks he's better than us because he reads books and stuff. Gawd, I hate him and all his loser friends.”<br>\r\n<br>\r\nRonald, still hiding in the bushes, bit his bottom lip and held back the stream of tears he could feel beginning to build up behind his eyes. <br>\r\n<br>\r\nMoving as quietly as he could muster, Ronald rose and tiptoed away from Jenna and Mindy. A brief walk around to the other side of the building would do him good, giving him a chance to compose himself before entering the school from a different entryway.<br>\r\n<br>\r\n“I knew Rebecca's friends were all mean,” he whispered to himself as he walked. “But I had no idea just how cruel they could be.”</span></div></div>",
            "created":1358398800,
            "id":1510369,
            "title":"Ignore it"
        },
        "144111111222":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "she is really nice",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Still kind of sad and disorientated about the current situation and realizing how mean those stupid girls are, Roland now sits in the classroom and next to another girl, he only knows from seeing and she is new to town and this school, so she has no history neither with Roland and Rebecca,. This might be the chance to start up something new and he introduced himself of course as Rebecca, not having any other choice right now…</span></div></div>",
            "created":1358485200,
            "id":1510782,
            "title":"Ronald actually encounters someone sympathetic ..."
        },
        "1441111112221":{
            "choices":[
                "Meanwhile, Jenna and Mindy confront Rebecca in Ronald's body!",
                "Continue with Ronald's day at school as the new Rebecca. "
            ],
            "content":"<div class=\"\"><div> <span>“Hi!” Ronald said, leaning across the aisle between desks in the classroom. “My name's … Rebecca. You're new here, right?”<br>\r\n<br>\r\nRonald internally winced at having to introduce himself as Rebecca. But it wouldn't make sense to go around calling himself by a boy's name now.<br>\r\n<br>\r\n“I'm Alyssa,” said the girl, a drab nervous-looking mousy girl. “Yeah, my family just moved here. It's nice to meet you.”<br>\r\n<br>\r\n“Have you met anyone else here yet?” Ronald asked.<br>\r\n<br>\r\n“No,” Alyssa said quietly. “You're the first person who has taken the time to say hello to me. Everyone at this school is either really busy or …”<br>\r\n<br>\r\nAlyssa trailed off, leaving the unspoken line lingering silently in the back of Ronald's mind: “Or just a bunch of stuck up snobs?”<br>\r\n<br>\r\nRonald smiled as prettily as he could, trying to remember that he was a girl right now.<br>\r\n<br>\r\n“We're not all like that,” he answered. “I know some of the kids here aren't very nice. But some of us are … well, some of us aren't what we seem.”<br>\r\n<br>\r\nAlthough Ronald knew he needed to rendezvous with the real Rebecca at some point today and compare notes, it wasn't a discussion he was looking forward to having. So, he decided to throw caution to the wind. <br>\r\n<br>\r\n“Alyssa, would you like to come over to my house after school?” he said. “I think we could be pretty good friends. I'm sure my folks would love to have you stay for dinner.”<br>\r\n<br>\r\n“Sure, thanks!” Alyssa said happily. “It's a relief to finally have someone to talk to around here.”<br>\r\n<br>\r\n“You don't know the half of it,” Ronald grinned.</span></div></div>",
            "created":1358485200,
            "id":1510962,
            "title":"Alyssa is really nice"
        },
        "14411111122212":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "it worked out well",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The remaining day at school is more or less rather unspectacular and the time for meeting the new girl in her house comes closer…</span></div></span></div>",
            "created":1358744400,
            "id":1513070,
            "title":"Continue with Ronald's day at school as the..."
        },
        "144111111222121":{
            "choices":[
                "Back at Rebecca's house, Ronald and Alyssa discover they share many interests.",
                "Ronald and Alyssa meet Rebecca's family at her house: they're all just like her!"
            ],
            "content":"<div class=\"\"><div> <span>Ronald easily muddled his way through the rest of the school day. Other than catching a few snide comments from Rebecca's meaner friends directed at his lack of fashion sense, the day seemed to progress remarkably well. Ronald was confident that he'd performed very well on a few tests he'd had to take in Rebecca's classes. She'd thank him later, he was sure, for helping raise her grades.<br>\r\n<br>\r\nAt the end of the day, Ronald found Alyssa waiting for him at his new locker.<br>\r\n<br>\r\n“Hi, Rebecca!” Alyssa said with a shy smile. “Did you still want to hang out after school?”<br>\r\n<br>\r\n“Sure thing,” Ronald said with a bashful smile. Despite the fact that he was in the body of the hottest, most popular girl in school, Ronald still found himself attracted to the female gender. And there was something about this shy, unassuming new girl that Ronald found very attractive. If only he was still a guy, perhaps he'd try to work up the courage to ask her out even?<br>\r\n<br>\r\nAh, who was he kidding. Ronald was a nervous basket-case around girls. He'd never asked out anyone on a date yet. <br>\r\n<br>\r\nBut now that Ronald <u>was</u> a girl, it felt like the pressure of was. He could relax and be himself around someone like Alyssa. It would be fun to actually get to know her. Maybe they could be best friends?<br>\r\n<br>\r\n“So I've heard a lot about you,” Alyssa said.<br>\r\n<br>\r\n“Oh?” Ronald replied carefully. Tugging nervously at his skirt, he started to grow nervous. If Rebecca's reputation had preceded him, maybe a shy, smart girl like Alyssa would want nothing to do with him.<br>\r\n<br>\r\n“Yeah. Everyone here knows you,” Alyssa said, with a bit of reverent awe. “I hear you're a cheerleader? And everyone loves the big parties you throw at your house. You've dated tons of really super cute guys. And all the really popular girls with the In Crowd here all claim to be your best friend.”<br>\r\n<br>\r\n“Well, I don't know about all that …” Ronald said cautiously.<br>\r\n<br>\r\n“Rebecca, don't get me wrong,” Alyssa said. “I'm very flattered that you're being so nice to me. And I really do have a good feeling about you. I think we could be good friends. But I just have to ask: you're not just pretending to be nice to me as some kind of prank or mean joke? I know it sounds crazy, but things like that have really happened to me before, at my old school. I'm accustomed to being a social outcast and a reclusive loner. Nobody like you has ever wanted to be my friend before.”<br>\r\n<br>\r\n“Alyssa, I swear to you,” Ronald said solemnly. “I am not playing any jokes on you. I really want you and I to be friends. And as for my reputation … well, let's just say the other kids are probably exaggerating. I'm really not as popular as you might think. A lot of what you heard is old history. I'm a different person now from who I once was.”<br>\r\n<br>\r\n“But you're still a cheerleader?” Alyssa said, clearly impressed with Ronald's perceived social standing.<br>\r\n<br>\r\nRonald had to reluctantly admit to himself that yes, as long as he inhabited Rebecca's body, he was in fact a cheerleader. Sooner or later he'd be wearing a tiny skirt and prancing around in front of crowds of screaming fans. It wasn't something he was particularly looking forward to!<br>\r\n<br>\r\n“Uh, yeah, I'm a cheerleader,” Ronald said. “But I'm a lot of other things, too.”<br>\r\n<br>\r\n“Wow, I could never be a cheerleader,” Alyssa said, a touch of hero-worship creeping into her voice. “I'm so clumsy! I really envy you Rebecca. You've got the perfect life. You're awful pretty. And yet, you're such a nice girl. I think I'm actually going to enjoy living in this town.”</span></div></div>",
            "created":1358744400,
            "id":1513354,
            "title":"Ronald and Alyssa"
        },
        "1441111112221211":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "when is the next party",
                "can you show me your room?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They strolled around in town and after some time they arrived at Rebecca’s home, where she was always having those parties and so on.<br>\r\nAlyssa asked….<br>\r\n</span></div></span></div>",
            "created":1358830800,
            "id":1513973,
            "title":"at Rebecca's house"
        },
        "14411111122212111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "do it",
                "hesitate"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“Maybe I should organize one very soon!” was Ronald’s idea and Alyssa liked this and also offered her help for organizing it…</span></div></span></div>",
            "created":1359435600,
            "id":1519502,
            "title":"when is the next party"
        },
        "14411111122212112":{
            "choices":[
                "Ronald suggests they bring over his friend 'Ronald' to help.",
                "Ronald tries to give Alyssa a fashion makeover all by himself. "
            ],
            "content":"<div class=\"\"><div> <span>Ronald and Alyssa were really hitting it off nicely by the time they reached Rebecca's home.<br>\r\n<br>\r\nMy home now, Ronald glumly reminded himself.<br>\r\n<br>\r\nHe lead Alyssa through the unfamiliar home, remembering the way to his new bedroom from the brief moments he spent in this house earlier this morning. It had still been less than 24 hours since Ronald and Rebecca's strange bodyswapping odyssey first began.<br>\r\n<br>\r\nAgain, Ronald was immediately disgusted by Rebecca's bedroom, decorated thoroughly in pinks and whites. He felt a twinge of guilt, as though he was intruding in this place of privacy.<br>\r\n<br>\r\n“This is your bedroom?” asked Alyssa.<br>\r\n<br>\r\n“Yes it is,” sighed Ronald, acknowledging the truth of his situation.<br>\r\n<br>\r\nThe two sat down on the big, fluffy pink bedspread across Rebecca's bed.<br>\r\n<br>\r\n“I like it,” said Alyssa.<br>\r\n<br>\r\n“I was thinking of changing it,” Ronald replied. “Some serious re-decorating to reflect my, uh, recently turning over a new leaf.”<br>\r\n<br>\r\n“Oh don't do that,” Alyssa said. “You've got style, Rebecca. I really admire that about you. Everyone at school says you're the most fashionable trendsetter around. And I think you've done a fabulous job with your room. It's everything I wish my room was. You should see it: my bedroom is so bare and spartan. It's a lonely place. But your bedroom is happy and chipper and full of fun!”<br>\r\n<br>\r\n“Uh, thanks,” Ronald slowly admitted. <br>\r\n<br>\r\n“Rebecca, do you think you could help me out?” Alyssa suddenly said. “I've never been popular or cool. And I know my fashion sense is horrible. Could you give me a makeover or something? Or at least some lessons on how to be one of the 'In Girls,' because I do so desperately want to fit in. I'm tired of being such an overlooked wallflower. Half the time, nobody notices me at school. And when they do notice me, it's only because they want to make fun of me. Can you help me, please?<br>\r\n<br>\r\nOh dear, thought Ronald. This was a job for the real Rebecca – not the clumsy, male, nerd imposter that he was. He might possess the body of the hottest, most popular girl in school, but he clearly possessed none of her sense of what was chic or in vogue. </span></div></div>",
            "created":1358830800,
            "id":1514123,
            "title":"Back in Rebecca's bedroom"
        },
        "144111111222121121":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "him? Alyssa wonder why this is a boy",
                "let's do it sure"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“Listen Alyssa, I will help you. I have a good friend, who is really able to support your requests. We should meet with him tomorrow!” Ronald said.</span></div></span></div>",
            "created":1359003600,
            "id":1515885,
            "title":"Ronald suggests they bring over his friend '..."
        },
        "1441111112221211211":{
            "choices":[
                "He decides to tell Alyssa the truth about who he is and what's happened. ",
                "Just then, Rebecca's mom says a strange boy named Ronald is at the front door!"
            ],
            "content":"<div class=\"\"><div> <span>“What?” giggled Alyssa nervously. “Your friend Ronald knows more than you do about makeup and fashion? Oh, Rebecca – I find that very hard to believe!”<br>\r\n<br>\r\n“No, really Alyssa,” insisted Ronald. “I'd love to give you a makeover. Really, I would!”<br>\r\n<br>\r\nA big part of Ronald was telling the truth. He was finding himself very attracted to this new girl, and he very much liked the idea of running his hands through her hair, touching her face, and of course seeing her in various stages of undress. <br>\r\n<br>\r\nBut Ronald also knew the end result of his fashion consultancy would prove a disappointing failure. Honestly, he was surprised Alyssa hadn't already questioned the odd disconnect between his current, badly mismatched attire and his supposed reputation for having an impeccable sense of dress and style.<br>\r\n<br>\r\n“Well, sure Rebecca,” said Alyssa. “I guess we can certainly wait until tomorrow and meet with your friend Ronald then. Is he gay or something?”<br>\r\n<br>\r\n“No!” Ronald found himself insisting a bit too loudly. “No, no, no. He's a very totally ordinary guy. He just … he just likes … uh … styling girl's hair and makeup and … and helping them pick out clothes to wear.”<br>\r\n<br>\r\nRonald was aware of how pathetically lame what he just said must sound. Alyssa simply nodded agreeably. <br>\r\n<br>\r\nWhat a mess this was, thought Ronald glumly. Here was a girl he genuinely liked. And he was getting to spend a bunch of quality, private time alone with her, up close and personal. But he had to do it all in the body of Rebecca. And the worst thing of it all was that he was inadvertently making his own former self look pretty fruity. If he ever got back to his own body, why would Alyssa ever want to go out with him?<br>\r\n<br>\r\nRonald sighed with self-pity.</span></div></div>",
            "created":1359003600,
            "id":1516132,
            "title":"Ronald makes things worse"
        },
        "14411111122212112112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "Ronald makes a scene",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“Ah here he is” said Ronald and added “we don’t need to wait until tomorrow then!”</span></div></span></div>",
            "created":1359090000,
            "id":1516529,
            "title":"Just then, Rebecca's mom says a strange boy..."
        },
        "144111111222121122":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "offer her to sleep here",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>“Alyssa,” insisted Ronald. “I'd love to give you a makeover. Really!”<br>\r\n<br>\r\nA big part of Ronald was telling the truth. He was finding himself very attracted to this new girl, and he very much liked the idea of running his hands through her hair, touching her face, and of course seeing her in various stages of undress. <br>\r\n<br>\r\nBut Ronald also knew the end result of his fashion consultancy would prove a disappointing failure. Honestly, he was surprised Alyssa hadn't already questioned the odd disconnect between his current, badly mismatched attire and his supposed reputation for having an impeccable sense of dress and style.<br>\r\n<br>\r\n“Thanks, Rebecca,” said Alyssa. “I guess we can certainly wait until tomorrow and now go to bed, I am really tired!”<br>\r\n</span></div></div>",
            "created":1359349200,
            "id":1518686,
            "title":"Ronald tries to give Alyssa a fashion makeover ..."
        },
        "1441111112222":{
            "choices":[
                "Alyssa is responsible for bodyswapping Ronald and Rebecca.",
                "Alyssa didn't swap them, but knows a lot about magic and the occult."
            ],
            "content":"<div class=\"\"><div> <span>Ronald leaned over to the new girl sitting across the aisle from him.<br>\r\n<br>\r\n“Hi!” he said with a smile. “My name is Rebecca Ward. You're new here aren't you?”<br>\r\n<br>\r\nThe drab looking, quiet girl flashed Ronald a queer smile.<br>\r\n<br>\r\n“Your name isn't Rebecca Ward,” she said softly. “It's <u>Ronald Dwebble</u>.”<br>\r\n<br>\r\n“What?!” Ronald said, suddenly taken aback. “How did you …”<br>\r\n<br>\r\n“Shhh,” whispered the girl. “My name is Alyssa. We should talk, don't you think?”<br>\r\n<br>\r\nRonald nodded silently.</span></div></div>",
            "created":1358485200,
            "id":1510964,
            "title":"Alyssa is something else"
        },
        "144111112":{
            "choices":[
                "Catfight!",
                "Ronald steps in and breaks things up before it escalates to violence."
            ],
            "content":"<div class=\"\"><div> <span>Ronald watched in stunned silence as Edith and Penelope walked away from him, laughing cruelly. Sure, he'd always known Edith had a mean streak to her sarcastic, biting sense of humor. But Ronald had always enjoyed being lab partners in chemistry class with the quirky, eccentric girl. Until today, she'd always seemed funny, friendly, and nice in a offbeat, kooky kind of way. <br>\r\n<br>\r\nAs Ronald watched Edith and Penelope head towards the school's main entrance, he spied them encountering Jenna and Mindy – two popular girl flunkies of Rebecca Ward. The duo ranked just one notch below Rebecca herself in the school's pecking order and basically served as sycophantic lackeys to the teenage beauty queen whose body Ronald now inhabited.<br>\r\n<br>\r\nThis morning Ronald watched with mixed emotions as Jenna surreptitiously slipped out her foot in front of Edith's path, causing the short, chubby girl to go crashing down into the hard pavement. As Edith picked herself up from the ground, now sporting a scraped knee and a purplish-yellow bruise on her thigh, Jenna and Mindy laughed themselves silly at the nerd girl's pain and humiliation.<br>\r\n<br>\r\nRonald quietly approached the kerfuffle, hoping to overhear everything without being seen and getting drawn into the row. <br>\r\n<br>\r\n“Yeah, because physical violence is not only really mature, but it's hilarious too!” Edith spat at Jenna. “Where'd you pick up your highly refined sense of sophisticated humor, Jenna? Was it watching reruns of <i>The Three Stooges</i> or just zoning out in front of old <i>Tom &amp; Jerry</i> cartoons?”<br>\r\n<br>\r\n“Shut up, you dumb nerd,” laughed Jenna, twirling a strand of her long, straight blond hair. “You're not only like weird, but fat and all nerdy too, and I don't know why you, like, dye your hair 'cuz you're totally not trendy and your hair is so ugh, so like why don't you just go build a model space ship with your loser Trekkie friends and stuff and don't even bother trying with hair and make up.”<br>\r\n<br>\r\n“Oh my God,” said Edith rolling her eyes. “Was that bit of verbal diarrhea all just one single, gigantic run-on sentence?”<br>\r\n<br>\r\n“Edith, come on,” whispered Penelope nervously. “Let's just go!”<br>\r\n<br>\r\n“No. Wait,” insisted Edith. “I want to hear more monosyllabic insults from this troglodytic trollop. Please, entertain us again with your rapier sharp wit, Jenna.”<br>\r\n<br>\r\n“Huh?” asked Jenna.<br>\r\n<br>\r\n“Wit,” said Edith slowly. “It means humor: banter, whimsy, badinage, drollery, satire, rapartee. Am I speaking your language yet, you neanderthal nitwit?”<br>\r\n<br>\r\n“I'm proud I don't speak <u>your</u> stupid nerd language!” retorted Jenna. “I don't need to understand you in order to know you're just a loser.”<br>\r\n<br>\r\n“You didn't understand me again?” replied Edith. “I'm sorry. Neanderthal means Caveman. I guess you haven't heard the latest Katy Perry song:  'Paleoanthropology of the Late Pleistocene.' She explains all about the displacement of mousterian culture by the aurignacian, but in a pop song. Oh, it's very catchy! Or maybe a lower primate like yourself prefers the Justin Bieber cover, because I'm pretty sure he did a version of that song, too. I'll bet philistines like you and Mindy just <u>love</u> Justin Bieber.”<br>\r\n<br>\r\n“Shut up you stupid loser!” snapped Jenna. “Gawd Edith, you're such a bitch just cuz you're jealous of us for being popular, and having boyfriends, and being on the cheerleader squad.”<br>\r\n<br>\r\n“Oh, yes!” beamed Edith sarcastically. “I'm secretly dying to trade away my ability to do long division in exchange for a polyester skirt riding up my thigh. Because you're so right: my life would just be pure bliss if only I could be an illiterate icon of ignorance and indiscriminate promiscuity … just like you, Mindy, and that vapid Paris Hilton imposter you both slavishly take orders from.”<br>\r\n<br>\r\n“I swear to god, I'm going to kick your ass you stupid fat nerd freak!” growled Jenna.<br>\r\n<br>\r\n“I see,” Edith said calmly. “And your threat of brute violence makes a clever rejoinder to my comparing you to a primitive, prehistoric dullard because why … ?”</span></div></div>",
            "created":1358312400,
            "id":1509966,
            "title":"Jenna vs. Edith"
        },
        "14411112":{
            "choices":[
                "Follow Ronald throughout the day in Rebecca's body.",
                "Follow Rebecca throughout the day in Ronald's body."
            ],
            "content":"<div class=\"\"><div> <span>The real Rebecca Ward was just then huffing and puffing, struggling to make her way up to the school. Trapped under the heavy, blubbery weight of Ronald's chubby out of shape body, Rebecca had worked up quite a sweat in her rush to get to school. Thick, wet armpit stains dripped down the sides of her size XXL t-shirt – a faded yellow garment with the words “Particle Physics gives me a hadron” spread out across the front in yellow print. Rebecca didn't get the joke, but the shirt was one of the only clean looking things she could find to wear in Ronald's bedroom.<br>\r\n<br>\r\nPushing her glasses back up the sides of her greasy, oily nose, Rebecca spotted her old body in the distance. <br>\r\n<br>\r\nOh no, she thought. It looked like Ronald was talking to those two obnoxious weird girls: Penelope and Edith. Please don't spoil my reputation by hanging with the likes of them, she thought.<br>\r\n<br>\r\nRebecca hurried up, waddling as fast as her clumsy, corpulent body could muster.<br>\r\n<br>\r\nAs she approached her old body, Rebecca could see the weird geek girls disengaging with disgust from discussion with her old body and now walking straight towards her.<br>\r\n<br>\r\n“Hey Ronald!” Penelope said warmly, while batting her eyes. <br>\r\n<br>\r\nOh dear god, Rebecca thought with horror. This beanpole goth wannabe has a crush on me now! Ewww.<br>\r\n<br>\r\n“Hey,” Rebecca muttered back in reply, still focused on reaching Ronald in her old body.<br>\r\n<br>\r\n“You checking out the queen of mean?” laughed Edith, gesturing backwards at Ronald in Rebecca's body. “The princess of pain, duchess of depravity, our demonic La Belle Dame sans Merci?”<br>\r\n<br>\r\n“Huh?” said Rebecca. She didn't get what Edith was saying, but she knew it wasn't complimentary.<br>\r\n<br>\r\n“Becky Ward turned over a new leaf,” explained Penelope, still blushing and giggling when she spoke to Rebecca in Ronald's body. “That's why she's dressed like that.”<br>\r\n<br>\r\nRebecca burned with rage gazing at the mismatched array of clothing Ronald had clad her beautiful body in.<br>\r\n<br>\r\n“Rebecca's wardrobe comes courtesy of Goodwill and the K-Mart Corporation,” said Edith in a dramatic stage whisper. <br>\r\n<br>\r\n“I'll kill him,” hissed Rebecca angrily.<br>\r\n<br>\r\nPenelope grinned with delight, and Edith actually giggled.<br>\r\n<br>\r\n“You're going to murder the president of the society for the historical reenactment of the movie Clueless?” gasped Edith in mock horror. “Better get in line, Ronald. Half the school wants to see that promiscuous tart get finally get her comeuppance. The day she dies the murder suspects will include every girl who lost a boyfriend to her, the pallbearers will be comprised of the entire football team, and the coffin will have to be shaped like the letter Y.”<br>\r\n<br>\r\nPenelope burst into snorts of laughter. Rebecca frowned, still not getting it yet recognizing she was the butt of the joke. <br>\r\n<br>\r\n“Don't let her get under you skin, Ronald,” said Edith. “In a few short years, we'll all be college graduates and poor little Rebecca Ward will be spritzing perfume in the cosmetics aisle of some discount department store, slaving away for minimum wage.”<br>\r\n<br>\r\nRebecca fumed silently in Ronald's bloated, sweaty body.  Furious, she stomped away from the nerd girls and went to confront the slimy toad currently ruining her life.<br>\r\n<br>\r\n“Uh, good morning,” Ronald said to her with a weak smile. He tugged nervously at the fabric of his long, pink skirt. “I see you, uh, got to school all right today.”<br>\r\n<br>\r\n“What the hell did you do to my body?” demanded Rebecca. “How can you go out in public dressed like that? Even the nerdettes are making fun of you!”<br>\r\n<br>\r\n“Yeah, I know,” Ronald said glumly, staring down awkwardly at his new breasts. “I really tried hard to be nice to them. Usually I get along okay with Edith and Penelope, but today …”<br>\r\n<br>\r\n“Listen you stupid, fat blob of grease,” Rebecca said, shaking her own chubby finger at the thin, beautiful body that once belonged to her. “As long as you're me, you are NOT friends with those two lame misfits! And another thing: after school today, I'm going home with you and I'm going to hand select your outfits for the rest of the week. Plus, I'm laying down some other laws. No going outside without makeup – and that nasty lipstick stain ring around your mouth right now does not count as a makeup, by the way. And you're learning how to style hair tonight, too. No arguments!”<br>\r\n<br>\r\n“Wait a minute, Rebecca,” interrupted Ronald. “I'm doing the best I can, and …”<br>\r\n<br>\r\n“Don't call me 'Rebecca' any more, you slimy toad,” hissed Rebecca with an angry whisper. “You're Rebecca Ward now. Geesh! Start acting like it. You've got a reputation to maintain. You can't go around acting like a happy, dumb nerd boy anymore. Get a clue!”<br>\r\n<br>\r\n“Okay, fine,” said Ronald, frowning and trying to collect his thoughts. Everything he'd done this morning had turned out wrong. Maybe he should start following Rebecca's advice. “You're Ronald and I'm Rebecca. I promise I'll try to behave more like you.”<br>\r\n<br>\r\n“Good,” snapped Rebecca. “Now your locker is # 327. I wrote down the combination for you on this scrap of paper. Here's your class schedule too. Don't be a brainiac in class! You're me now, okay? So just sit quiet, look bored, and if a teacher asks you anything just say, 'I don't know.' But don't be a nerd in my body, please!”<br>\r\n<br>\r\n“I'll try,” said Ronald. “Thanks for all this. I guess I should write down your locker number, combination, and class schedule too. That was very thoughtful of Reb- … I mean, Ronald.”<br>\r\n<br>\r\n“Don't be nice,” hissed Rebecca. “This isn't second grade Sunday School. You don't have to say please and thank you all the time. Sheesh! Act like I would.”<br>\r\n<br>\r\n“In that case,” said Ronald thoughtfully. “Maybe we shouldn't be talking. I probably shouldn't be seen associating with you, uh, 'Ronald.' I hope you understand?”<br>\r\n<br>\r\n“That's the first smart thing you've done yet,” grumbled Rebecca. “I'll see you after school. Don't forget: you're Rebecca Ward now.”</span></div></div>",
            "created":1358312400,
            "id":1509816,
            "title":"The real Rebecca arrives"
        },
        "144111121":{
            "choices":[
                "Skip school and go with Emily. ",
                "Tell Emily he's fine, then head straight to Rebecca's first class of the day."
            ],
            "content":"<div class=\"\"><div> <span>Ronald managed to find and open Rebecca's locker without major incident. Glancing down at his schedule, he saw the first class of the day would be Remedial General Science. <br>\r\n<br>\r\nRonald groaned. He was a science whiz! He should be in Intermediate Chemistry this year, not Remedial General Science. And as per Rebecca's orders, he was supposed to sit quietly in glance and pretend to be a brain-dead bimbo. The indignity of it all!<br>\r\n<br>\r\n“Hey, girlfriend!” chirped a friendly voice from the locker on the left. “Rebecca, you look terrible. What's wrong, girlfriend? Do you need to talk?”<br>\r\n<br>\r\nRonald looked up and lost his breath gazing closely into the sweet, soulful eyes of Emily Butler. Her soft brown eyes showed genuine care and concern as she smiled sympathetically at Ronald. Standing so close to Emily, Ronald was intoxicated by the ambrosial fragrance of her perfume. <br>\r\n<br>\r\n“I'm, uh, I'm just not myself today,” Ronald stuttered, clumsily dropping his book bag and spilling textbooks all over the floor of the hallway.<br>\r\n<br>\r\n“Let me help,” Emily said supportively. “What's going on, girlfriend? Your hair is a mess, your clothes are all yuck, and your makeup … uh … the less said about that, the better.”<br>\r\n<br>\r\n“I'm just not me right now,” Ronald repeated, feeling apprehensive and twitchy being in such close proximity to one of Rebecca's beautiful best friends. <br>\r\n<br>\r\n“Rebecca, you can't go to class looking like this,” Emily said, bending over and whispering in Ronald's ear.<br>\r\n<br>\r\nThe sensation of her warm breath in his ear and on the side of his neck sent shivers of delight down Ronald's spine.<br>\r\n<br>\r\n“Let's skip class,” Emily suggested. “I'll give you a total makeover, and you can tell me all your troubles. Unburden yourself, girlfriend! What are BFFs for, right?”<br>\r\n<br>\r\nRonald had never skipped class in his life. In fact, he'd never even stayed home from school while genuinely ill before. His attendance record was spotlessly perfect … up until this point in time. And he had to admit, it was very seductive, the thought of cutting class to spend some close, intimate time with a beautiful girl who wanted to run her fingers through his hair and touch his face and body (even if all Emily was interested in was primping and beautifying Ronald).<br>\r\n<br>\r\nAnd maybe Ronald even could unburden himself to Emily? The real Rebecca was proving to be mean, nasty, and downright unpleasant about their current role reversal. Emily on the other hand seemed warm and sympathetic. Perhaps Ronald could explain what had happened? Maybe Emily would even have an idea to help switch Ronald and Rebecca back to normal?<br>\r\n<br>\r\nRonald fidgeted silently, staring at the glossy polish on the tips of his fingernails. Should he skip school and go with Emily … or should he scamper off to class like a good, responsible student?</span></div></div>",
            "created":1358312400,
            "id":1509817,
            "title":"Ronald meets Emily"
        },
        "144112":{
            "choices":[
                "Dress his body in girls clothes and act excessively sissy at school.",
                "Dress in trendy, male clothes and start hitting on all the popular, hot girls."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does Rebecca do today to destroy the life and reputation of Ronald Dwebble in order to get revenge on him for stealing her life?</span></div></span></div>",
            "created":1357534800,
            "id":1504116,
            "title":"Changing Ronald's reputation?"
        },
        "1441121":{
            "choices":[
                "He flirted back and invited her into the changing rooms?",
                "Something else happened?"
            ],
            "content":"<div class=\"\"><div> <span>Rebecca got to school and then went straight into the girls changing rooms and found a dress and other things to wear that she likes.<br>\r\n<br>\r\nShe's going to destroy Ronald's reputation and make him a laughing stock of the school.<br>\r\n<br>\r\nRebecca then put make up on and then walked into the main school area and started hitting on a boy she liked.<br>\r\n<br>\r\nSomething happened she wasn't expecting?</span></div></div>",
            "created":1446958800,
            "id":2058304,
            "title":"Dress his body in girls clothes and act excessi..."
        },
        "1441122":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Rebecca sighed and looked down at her male new body.<br>\r\n<br>\r\nRonald sure sounded rather calm on the phone, and Rebecca mused that it would be best to stop being angry and also tried to calm down a little bit to avoid further trouble! At least for the moment!<br>\r\nShe hopes that there will be a way to reverse the body swap that had affected them! It was awfully strange and felt so wrong being a boy right now and Rebecca hoped so much, that the unwanted body swap would be only temporary and not to long!<br>\r\n<br>\r\nSo Rebecca simply had to act as an interim steward for Ronald, don’t do anything to embarrass, annoy or other things. She was simply a caretaker for his body. She just needs to blend in at school. That should be the safest and most logical step now until there is a solution!<br>\r\n</span></div></div>",
            "created":1358226000,
            "id":1509184,
            "title":"prepare school day as a male"
        },
        "14411221":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "Ronald's mother comes in",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>But before leaving to school dressing this male body was needed: Rebecca stripped out of the nightwear Ronald was wearing and tried to find some fresh underwear in his drawer. She found some boxers she decided to wear for today. Hopefully she won’t need to undress today in the boys locker rooms!<br>\r\nAfter she had successfully pulled on the boxers on her now more hairy legs, she started to feel strange sensations on the new male tool while on the other hand she missed her smooth nice female curvy body including her boobs!<br>\r\nBut no time for this right now: She pulled out some random t-shirt from his drawer and some jeans. How trivial this was compared to what a girl needs to consider every morning while dressing!<br>\r\n“Clearly there’s a lot I still need to learn about boys and their clothing” Rebecca said aloud to herself now having Ronald’s baritone voice…<br>\r\n</span></div></div>",
            "created":1358312400,
            "id":1509712,
            "title":"dressing"
        },
        "144112211":{
            "choices":[
                "At school, she encounters some of Ronald's old friends.",
                "At school, she encounters her old friends, who mock and ridicule her. "
            ],
            "content":"<div class=\"\"><div> <span>“Ronald, dear?” said a soft, feminine voice from behind.<br>\r\n<br>\r\nRebecca jumped, startled by the sudden intrusion of a stranger into her new bedroom. She breathed a sigh of relief when she caught sight of the plump, middle aged woman who, she surmised, must be her new mother.<br>\r\n<br>\r\n“Oh, hello,” Rebecca said, forcing a smile. “You just surprised me.”<br>\r\n<br>\r\n“My, you're a bit of a surprise yourself this morning, honey,” said Ronald's mother with a proud smile. She looked up and down Rebecca, admiring the choice of attire Rebecca had effortlessly selected and clothed herself in. “You're already dressed for school, and I must say your appearance looks so neat and tidy for a change. I'm really proud of you, sweetie. You clean up so nicely when you want to. Maybe you'll be asking a girl out on a date today at school?”<br>\r\n<br>\r\nRebecca tried not to burst out laughing at the thought of fat, nerdy, shy Ronald Dwebble asking out a girl. <br>\r\n<br>\r\n“My little man is growing up,” said Ronald's mother. “I'm sorry to embarrass you, honey. It's just that I'm so thrilled to see you finally coming out of your shell.”<br>\r\n<br>\r\nRebecca felt a pang of guilt. She didn't really know Ronald, but she could somehow still empathize with a mother who wanted to see her son happy. She must know what a loser he is, but nevertheless she hopes and prays he'll find a way to fit in and be happy. <br>\r\n<br>\r\nAnd she probably has no idea just how cruel Rebecca and the other popular kids at school have been to her little boy over the years.<br>\r\n<br>\r\n“Uh, I think I should just get to school,” Rebecca said to Ronald's mother, suddenly unable to face the woman.<br>\r\n<br>\r\n“Have a great day at school, sweetie!” said Ronald's mother. “I think you look very handsome today. Any girl at that school would be lucky to be dating you.”<br>\r\n<br>\r\nRonald Dwebble on a date, thought Rebecca with a mixture of disgust and guilt. She still thought the overweight, social recluse was an ugly, pathetic geek. But at the same time, Rebecca was now starting to see first-hand some of the silent, hidden pain Ronald must live with.<br>\r\n<br>\r\nIt was no fun being him!<br>\r\n<br>\r\nGrabbing Ronald's heavy book bag, Rebecca heaved a sigh and began trudging out the door. </span></div></div>",
            "created":1358312400,
            "id":1509951,
            "title":"Ronald's mother comes in"
        },
        "1441122111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "chat with them",
                "ignore it"
            ],
            "content":"<div class=\"\"><div> <span>“Oh, I give up!” Rebecca said, because all of this was really very difficult for her!<br>\r\n<br>\r\nBut not now, not yet! She headed out to school!<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nAs Rebecca she was used to go to school by her own car, a nice sporty red convertible, but now she had to walk.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nHer feet were hurting when she arrived finally at school, where she spotted some other teens, they were Edith and Penelope, oh she hated those girls, but now they think Rebecca is Ronald, and she is kind of or at least looking like him and they saw him and their reaction was similar like Ronald’s mother before, they were amazing but the sudden change in his clothing style and also liked the improvement Ronald had gone through…<br>\r\n</span></div></div>",
            "created":1358398800,
            "id":1510245,
            "title":"At school, she encounters some of Ronald's ..."
        },
        "14411221111":{
            "choices":[
                "Rebecca succumbs to the inevitable and asks Penelope out on a date.",
                "Rebecca gets as far away as possible from Penelope and Edith!"
            ],
            "content":"<div class=\"\"><div> <span>“Hi, Ronald!” said Penelope, a tall thin pale skinned girl dressed in a shapeless black top and matching long, black skirt.<br>\r\n<br>\r\nOh yuck, thought Rebecca at the sight of Penelope batting her eyes. This creepy nerd girl has a crush on me!<br>\r\n<br>\r\n“Uh, hello there,” Rebecca forced herself to say. Was this the girl Ronald's mother thought she should ask out on a date?<br>\r\n<br>\r\n“Lookin' sharp there, Ronnie!” said Edith, Penelope's inseparable BFF. She was short and chubby, with hair dyed bright green. “You look more handsome than Johnny Depp if he had the brain of Stephen Hawking. Mmm, excuse me while I indulge a brief mental fantasy.”<br>\r\n<br>\r\nEdith dramatically closed her eyes tightly and sighed dreamily.<br>\r\n<br>\r\n“Okay, I'm good now!” she beamed.<br>\r\n<br>\r\n“Edith, you're so weird,” laughed Penelope. “Sorry, Ronald. She's so weird. Isn't she weird, Ronald? I'm not weird. I mean, I'm a little bit weird. Just eccentric really. I try hard to be interesting. And I'm interested in lots of different things. We probably share a lot of interests. Um, so, like, what sorts of things are you interested in Ronald?”<br>\r\n<br>\r\nPenelope giggled, blushed, and then looked away.<br>\r\n<br>\r\n“Lo! and Behold – the Queen of Subtlety!” Edith loudly intoned in a theatrical voice.<br>\r\n<br>\r\n“Huh?” Rebecca frowned quizzically. She'd always hated Edith with her stupid sarcastic quips about everything. <br>\r\n<br>\r\n“I think somebody likes you,” Edith whispered loudly in Rebecca's ear.<br>\r\n<br>\r\nRebecca looked back up at Penelope and groaned.<br>\r\n<br>\r\nWhy is this happening to me, thought Rebecca. What have I done to deserve this? I'm trapped in the body of this gross, fat nerd … and now weird, geek girls want to date me!</span></div></div>",
            "created":1358398800,
            "id":1510367,
            "title":"Chat with them"
        },
        "144112211111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Rebecca must now understand that she is more or less a changed person now and maybe she has to act like that and she does saying:<br>\r\n“Good for you, Penelope, do you want to go out with me tonight?<br>\r\n</span></div></span></div>",
            "created":1358485200,
            "id":1510779,
            "title":"Rebecca succumbs to the inevitable and asks Pen..."
        },
        "1441122111111":{
            "choices":[
                "Check in with how Ronald is faring with Rebecca's life.",
                "Continue with Rebecca changing around Ronald's life at school."
            ],
            "content":"<div class=\"\"><div> <span>Well this is interesting, thought Rebecca. Here I can kill two birds with one stone. If I'm trapped as Ronald Dwebble forever, at least I can improve my social standing by getting a girlfriend. And if I ever get back to my own body, I can at least get even with Ronald by saddling him with a goofy geek girl liked Penelope. What have I got to lose?<br>\r\n<br>\r\n“Sure, Ronald!” beamed Penelope, gazing at Rebecca longingly with big doe eyes before finally blushing and turning away. “I'd love to go out with you. Um, thanks! You know where I live. You want to pick me up at seven?”<br>\r\n<br>\r\n“Absolutely,” said Rebecca with a confident smile, completely out of place on Ronald's shy, nebbish face. <br>\r\n<br>\r\nThen just to seal the deal, Rebecca leaned over and kissed Penelope – just a soft, gentle, friendly kiss on the cheek. But it was enough to send the tall, gangly girl swooning.<br>\r\n<br>\r\n“Tonight on Nerds in Love: The Ronald and Penelope Story!” quipped Edith sarcastically.<br>\r\n<br>\r\n“Shut up and don't spoil this for me,” retorted Penelope.<br>\r\n<br>\r\nRebecca just grinned with satisfied pride at the changes she was already imposing on the life of Ronald Dwebble.</span></div></div>",
            "created":1358485200,
            "id":1510961,
            "title":"Penelope loves Rebecca"
        },
        "14411221111112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "it worked out well",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now another encounter at school was on Rebecca’s agenda. The first class of today was mathematics and she was not good at this subject, but Ronald normally does not have any kind of issues here…<br>\r\nShe hoped to survive this class!<br>\r\n</span></div></span></div>",
            "created":1358744400,
            "id":1513067,
            "title":"Continue with Rebecca changing around Ronald..."
        },
        "144112211111121":{
            "choices":[
                "Next class?",
                "See how Ronald is doing in Rebecca's body right now?"
            ],
            "content":"<div class=\"\"><div> <span>On the way to math class, Rebecca found her mind wandering as she plodded through the school hallways with Ronald's chubby, clumsy body. Although she'd never in a million years admit it, she was actually enjoying checking out all the pretty girls at school. Most of these were girls she'd been friends with just yesterday. Now she found them attractive!<br>\r\n<br>\r\nBlushing and shaking her head to clear these alien thoughts from her mind, Rebecca failed to notice Jeff Harris, one of the popular jocks at school, sneak up from behind. Without warning, Jeff put his foot out in front of Rebecca's path causing her to tumble head over heels, splatting face first into the hard tile floor of the school hallway.<br>\r\n<br>\r\n“Careful there, fat ass!” laughed Jeff, kicking Rebecca in her over-sized behind. “You're such a loser, Dwebble. Can't you even walk down the hall without embarrassing yourself?”<br>\r\n<br>\r\nJeff laughed, kicked Rebecca once more, and sauntered away.<br>\r\n<br>\r\nIt was all Rebecca could do to restrain herself from bursting out into tears. She'd dated Jess Harris a couple of times, and always thought he was just a handsome, nice, friendly person. Now that she had been transformed into a fat, male nerd though, the popular school athlete had nothing but scorn and ridicule for her.<br>\r\n<br>\r\nScooping up her books, Rebecca quickly hurried off into math class, managing to get into Ronald's seat just seconds before the bell rang. The teacher, a white haired old spinster ironically named Miss Young, was just passing out exams.<br>\r\n<br>\r\nShit, thought Rebecca. There is absolutely <u>no way</u> she was going to be able to pass a test in Ronald Dwebble's advanced math class! She wasn't a nerd like him. This was the last thing she needed today.<br>\r\n<br>\r\nNevertheless, Rebecca sighed and started in on the exam, figuring she had no real alternative. <br>\r\n<br>\r\nShe gazed at the first question: Find a polynomial with integer coefficients that has the following zeros:<i> - 1/3, 2, 3 + i.</i><br>\r\n<br>\r\nPiece of cake, she thought, quickly scribbling down the correct answer. Must be a fluke or something. Maybe Miss Young threw in that one just to give everyone an easy question to start off with.<br>\r\n<br>\r\nNext question: Factor <i>f(x) = x<sup>3</sup> + 2x<sup>2</sup> + 14x</i> completely over the complex numbers.<br>\r\n<br>\r\nAgain, no sweat! Rebecca had the problem solved in her head almost faster than she could write it down on paper.<br>\r\n<br>\r\nWhat's next? Find all vertical and horizontal asymptotes for the graph of the following function and then graph the function … <br>\r\n<br>\r\nBefore she knew it, Rebecca had whizzed her way through the entire six-page test, confident she had easily earned an A if not an A+ on the exam. And on top of it all, she still had another fifteen minutes left before the bell rang.<br>\r\n<br>\r\nThe first person in class to complete the test, she handed her paper into Miss Young, then took her seat again and started daydreaming about cute girls. Maybe it was a good thing she'd asked out Penelope earlier. She was sorta cute, thought Rebecca. And more importantly, Penelope was smart and the two of them shared so many interests. </span></div></div>",
            "created":1358744400,
            "id":1513346,
            "title":"Rebecca knows math!"
        },
        "1441122111111211":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "girly feelings still?",
                "no attraction to this guy!"
            ],
            "content":"<div class=\"\"><div> <span>Next class was more of Rebecca’s interest, it was English and she was rather good there, no problems arrived here!<br>\r\nToday was the day where two new students were introduced, because they moved here with their family. The new guy was handsome and had the perfect smile, Rebecca always likes at boys, but now she is so much confused from all the gender and body switch….<br>\r\nAnyhow she greets the new guy, called Karl, which is a very seldom name, but kind of nice…<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nRebecca tried to imitate the best face she could show as Ronald always considering that she is a boy talking to another boy!<br>\r\n</span></div></div>",
            "created":1358830800,
            "id":1513972,
            "title":"Next class?"
        },
        "14411221111112111":{
            "choices":[
                "At the end of class, Karl wants to talk to her. ",
                "At the end of class, Jeff Harris starts bullying her again."
            ],
            "content":"<div class=\"\"><div> <span>Much to her surprise, Rebecca felt all warm and gooey inside as she introduced herself to Karl and shook hands with the tall, handsome stranger.<br>\r\n<br>\r\n“Hi,” she said giddily. “My name is Reb- … Ronald. I'm Ronald Dwebble.”<br>\r\n<br>\r\n“Very nice to meet you Ronald,” said Karl politely. <br>\r\n<br>\r\nMmm, his handshake was strong and manly.<br>\r\n<br>\r\nBut Rebecca herself was <u>also</u> technically manly. What in blazes was happening to her? Here she was fantasizing about girls one minute, then experiencing this puppy dog crush on Karl the next minute!<br>\r\n<br>\r\nWhat had she done to deserve this torture?<br>\r\n<br>\r\nOh right, she reflected soberly. The years of being a bitchy ice princess and treating everyone in school like shit. <br>\r\n<br>\r\nRealizing her handshake with Karl had gone on for too long and become awkward, she released her grip on his hand, batted her eyes playfully, and blushed as she resumed her seat in class.<br>\r\n<br>\r\nGreat, she thought. Either Karl thinks I'm a nut job now, or he's gay and thinks I was coming on to him.<br>\r\n<br>\r\nAlthough wasn't that exactly what <u>was</u> happening?<br>\r\n<br>\r\nI don't want to be gay or bisexual on top of everything else, Rebecca moaned to herself. <br>\r\n<br>\r\n“There has to be some way out of this mess,” she whispered to herself.<br>\r\n<br>\r\n“What was that, Mr. Dwebble?” asked the teacher.<br>\r\n<br>\r\n“Nothing, sir,” Rebecca answered loudly. “Just ready for today's assignment.”<br>\r\n<br>\r\nIt was English class and today was a free writing assignment: just spend the entire hour writing extemporaneously on a topic.<br>\r\n<br>\r\nRebecca just hoped today's topic wasn't cute guys … or cute girls!<br>\r\n<br>\r\nThe topic turned out to be: My Favorite Movie.<br>\r\n<br>\r\nRebecca took a deep breath and started scribbling away, eager to take her mind off that handsome hunk across the aisle: the exciting and cute Karl.<br>\r\n<br>\r\nShaking her head to clear her mind, Rebecca threw herself into the assignment, and before she realized what was happening she had filled up a half-sheet of paper with a verbose dissertation on the latest Star Trek movie and how it compared with the other ten films and five television shows in the franchise.<br>\r\n<br>\r\n“Why am I stuck being half me and half Ronald?” she whispered to herself after seeing what she'd just done.</span></div></div>",
            "created":1358830800,
            "id":1514121,
            "title":"When Rebecca met Karl"
        },
        "144112211111121112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "Karl has seen this and interacts",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“You still in my way, fat ass!” laughed Jeff, kicking Rebecca in her over-sized behind the moment she went out from classroom “You're such a loser, Dwebble. Can't you even walk faster!”</span></div></span></div>",
            "created":1359003600,
            "id":1515882,
            "title":"At the end of class, Jeff Harris starts bullyin..."
        },
        "1441122111111211121":{
            "choices":[
                "Karl quietly reveals his strange, amazing secret to Rebecca. ",
                "The female part of Rebecca takes control and she kisses Karl."
            ],
            "content":"<div class=\"\"><div> <span>Once again, Rebecca went flying head first across the corridor and into the wall.<br>\r\n<br>\r\n“You're a fat loser, Dwebble!” roared Jeff with laughter. “Won't you ever learn to get out of the way? I thought you were supposed to be a genius, you lard ass! Is your Einstein-like brain too clogged up with fat cells to think straight?”<br>\r\n<br>\r\n“Knock it off,” came a quiet, steady voice from behind Jeff.<br>\r\n<br>\r\n“Excuse me?” Jeff answered, turning around and bearing down menacingly at the speaker.<br>\r\n<br>\r\nIt was Karl – the new kid.<br>\r\n<br>\r\n“I said knock it off,” Karl repeated calmly. “Leave Ronald alone.”<br>\r\n<br>\r\n“Oh, you just sealed your death sentence, new kid!” growled Jeff.<br>\r\n<br>\r\n“My name isn't New Kid,” replied Karl. “It's Karl. And I think you owe my friend Ronald an apology.”<br>\r\n<br>\r\n“I don't owe either of you nerds a thing!” roared Jeff.<br>\r\n<br>\r\nHe lunged at Karl suddenly, trying to catch the boy off guard with a sudden, swift punch. Instead, with lightning speed, Karl dodged Jeff's incoming fist, dropped low to the ground, and a quick roundhouse kick, knocked Jeff's legs out from under him.<br>\r\n<br>\r\nThe confused bully went tumbling to the floor.<br>\r\n<br>\r\nBefore Rebecca even had time to blink, Karl was standing atop Jeff's prone body.<br>\r\n<br>\r\n“I said you owe my friend here an apology,” Karl said quietly.<br>\r\n<br>\r\n“Screw you!” wheezed Jeff, still struggling to catch his breath.<br>\r\n<br>\r\nKarl calmly bent low and jabbed two fingers at Jeff's throat.<br>\r\n<br>\r\n“Arrrgh!” cried out the bully in pain. “No, no, don't do that again. I'm sorry Ronald. I'm sorry! I shouldn't have picked on you. Jesus, dude just let me up. I'm sorry, really. I won't mess with you and your friend again.”<br>\r\n<br>\r\nWith neither words nor fanfare, Karl simply released Jeff and then walked over to help Rebecca to her feet.<br>\r\n<br>\r\nThe other students in the hall erupted into a chorus of cheers and applause as Jeff cravenly beat a hasty retreat down the corridor.<br>\r\n<br>\r\n“Are you all right, Ronald?” asked Karl.<br>\r\n<br>\r\n“Yeah, yeah, I think I'm fine,” Rebecca said, dusting herself off. <br>\r\n<br>\r\nThis strange new kid has a lot of guts, she thought. He doesn't look that strong or tough, but clearly he works out! <br>\r\n<br>\r\nThe feminine part of Rebecca was powerfully attracted to Karl now, in a romantic hero worship kind of way. The masculine part of Rebecca was simply very grateful and wanted more than ever to become good friends with Karl.<br>\r\n<br>\r\n“Thank you,” she said simply. <br>\r\n<br>\r\n“It was nothing,” replied Karl, with an oddly bashful smile.</span></div></div>",
            "created":1359003600,
            "id":1516136,
            "title":"Karl to the Rescue!"
        },
        "14411221111112111212":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "positive",
                "negative"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But how does Karl react?</span></div></span></div>",
            "created":1359090000,
            "id":1516522,
            "title":"The female part of Rebecca takes control and sh..."
        },
        "144112211111121112121":{
            "author_id":"yoshikingll",
            "author_name":"GoneToTheDogs",
            "choices":[
                "He's just happy Ronald likes him",
                "A weird and strange reason soon revealed to Rebecca!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why is Karl having a positive reaction?</span></div></span></div>",
            "created":1359090000,
            "id":1516668,
            "title":"positive"
        },
        "1441122111111211121212":{
            "author_id":"yoshikingll",
            "author_name":"GoneToTheDogs",
            "choices":[
                "Karl actually knows that Rebecca is in Ronald's body!",
                "Rebecca's kiss as Ronald lifts a curse off of Karl!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And what is the strange and weird reason?</span></div></span></div>",
            "created":1359090000,
            "id":1516669,
            "title":"A weird and strange reason soon revealed to Reb..."
        },
        "14411221111112111212122":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "Karl is a girl cursed to be a boy",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what kind of course could this be?</span></div></span></div>",
            "created":1359349200,
            "id":1518650,
            "title":"Rebecca's kiss as Ronald lifts a curse off ..."
        },
        "144112211111121112122":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "run away",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“Wow, thanks, but this is too much!” Karl said and pushed Rebecca back…<br>\r\n“I’m so sorry!” she said and she was, because this was a big mistake…<br>\r\nHow can she go on?<br>\r\n</span></div></span></div>",
            "created":1359349200,
            "id":1518680,
            "title":"negative"
        },
        "1441122111111211121221":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "Karl...",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She just strolled around in town kind of helpless and humiliated and after a while she arrived at Ronald’s home, where she was expected by a person. Who?</span></div></span></div>",
            "created":1359435600,
            "id":1519501,
            "title":"run away"
        },
        "14411221111112111212212":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "fun",
                "it leads to some problems"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was not Karl, such lucky…<br>\r\nBut it is Penelope, she comes around and yes sure she was there because they agreed to have date tonight and spend some time together…<br>\r\n</span></div></span></div>",
            "created":1359522000,
            "id":1520300,
            "title":"Pennelope"
        },
        "144112211111121112122121":{
            "choices":[
                "The evening goes remarkably well.",
                "The evening goes well until ... something unexpected happens?"
            ],
            "content":"<div class=\"\"><div> <span>As Rebecca finally rounded the last corner of her long trudge back to Ronald Dwebble's house, she saw a familiar figure in the distance standing out on the front lawn waiting.<br>\r\n<br>\r\nIt was the tall, thin silhouette of Penelope. She had changed clothes and was now wearing a dark burgundy dress and a pair of matching flats. Her long, limp hair had actually been done up about the back of her head and neck in an attractive, sweeping style. <br>\r\n<br>\r\nPart of Rebecca thought, what a geek! This is obviously her first date <u>ever</u>, and I've been on like dozens of dates with dozens of guys way hotter than Ronald Dwebble. What a pathetic loser.<br>\r\n<br>\r\nBut a different part of Rebecca's mind was going through a metamorphosis … not exactly part of the magical transformation that had resulted in her disgusting, fat, male body. Rather it was more of a transformation of personal growth. <br>\r\n<br>\r\nJust the one day Rebecca had spent struggling to live the lonely life of a social outcast in high school was already teaching her something about sympathy for others … and something about empathy for a sad little lonely geek girl who'd never been asked out on a date before, and now stood here nervously worrying and dreaming about how her very first date would go.<br>\r\n<br>\r\nRebecca had the power to be a selfish jerk here.<br>\r\n<br>\r\nBut Rebecca also had the power to do something truly selfless. She could go on this date with Penelope and try to make the poor girl's first ever date a memorable, magical experience. <br>\r\n<br>\r\nAnd for the first time in her life, Rebecca thought doing something nice for someone else – with no expectation of reward – was the right thing to do. Rebecca Ward, the Ice Princess, felt her heart melt with pity and affection for this poor girl's hopes and dreams.<br>\r\n<br>\r\n“I can't believe I'm really going to do this,” she whispered to herself, as she approached her blushing, fidgety date.<br>\r\n<br>\r\n“Hi, Ronald!” beamed Penelope. <br>\r\n<br>\r\nThe poor girl was practically bursting at the seams with excitement.<br>\r\n<br>\r\n“Penelope, you look beautiful,” Rebecca said, taking Penelope's right hand and gently kissing it. “I've really been looking forward to seeing you all day. Let's go somewhere nice. I thought dinner and a movie, followed by a walk in the park at sunset. I promise, it'll be a good restaurant though. Nothing cheap.”<br>\r\n<br>\r\n“Oh, anything is fine!” giggled Penelope. Her face was shining with radiant delight.<br>\r\n<br>\r\nRebecca smiled, feeling a bit of enjoyment at bringing a ray of light into this girl's normally dim and dull world.<br>\r\n<br>\r\n“No. We need to go someplace special,” said Rebecca. “After all, you're a very special person to me, Penelope.”<br>\r\n<br>\r\nPenelope gazed with adoration in Rebecca's eyes. The girl was blinking rapidly, struggling not to cry tears of joy over how romantic and gentlemanly her secret crush was behaving.</span></div></div>",
            "created":1359608400,
            "id":1521135,
            "title":"Rebecca and Penelope"
        },
        "1441122111111211121221211":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "the place where she lost her virginity ...",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“what and where is this special place?” Penelope asked, but Rebecca played her role of the guy perfectly and told her that this will be a surprise and took her by the hand and guides her to this special place, which was….</span></div></span></div>",
            "created":1359694800,
            "id":1521504,
            "title":"The evening goes remarkably well."
        },
        "144112211111121112122122":{
            "choices":[
                "She's angry after hearing gossip about \"Ronald\" kissing Karl.",
                "She spoke with \"Rebecca Ward\" who told her a crazy story about bodyswapping."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of problems is caused by Penelope meeting up with Rebecca?</span></div></span></div>",
            "created":1359608400,
            "id":1521136,
            "title":"What kind of problems?"
        },
        "144112212":{
            "choices":[
                "At school, she encounters Ronald in her old body.",
                "At school, she encounters the school bully who starts tormenting her. "
            ],
            "content":"<div class=\"\"><div> <span>Smoothing out the wrinkles in her strange, masculine clothes, Rebecca struck a pose in front of a bedroom mirror plastered with old, half-peeled off stickers of superheroes.<br>\r\n<br>\r\n“I guess I look okay, for a fat kid,” grumbled Rebecca. <br>\r\n<br>\r\nShe still missed her old body. But without even consciously thinking about it, she'd managed to dress Ronald's body in much more fashionable, trendy style than his ordinary messy, sloppy manner. That was a good thing, at least. It turned out Ronald cleaned up pretty nicely. Sure, he could drop a couple pounds. But nobody was perfect!<br>\r\n<br>\r\nNo, the thing that looked wrong now in Rebecca's new reflected image was her body language. She could tell that she was still carrying herself with her old characteristic dainty, petite mannerisms. The result was that Ronald in the mirror looked like something of a metrosexual – neat, tidy, and clean with all the subtle gestures and posture of a homosexual man (or, in Rebecca's case, a heterosexual teenage girl).<br>\r\n<br>\r\n“Gawd, I hate this,” pouted Rebecca, grimacing in frustration at the mirror. “I miss being a girl.”<br>\r\n<br>\r\nBut at the moment, she was firmly stuck with the reality of the situation: she was Ronald Dwebble and he was Rebecca Ward.<br>\r\n<br>\r\nAnd nothing Rebecca could think of would change that. <br>\r\n<br>\r\nHopefully Ronald was right when he intimated there was some way for them to undo this transformation. In the meantime, all that Rebecca could do was leave it in the capable hands (and brain) of Ronald. He might be a social outcast and loser supreme, but he was smart. If anyone could think up the means to reverse a body swap, it would be Ronald.<br>\r\n<br>\r\nTrying her best to resist the subconscious urge to mince and move femininely, Rebecca hefted Ronald's heavy book bag and began the long trek to school.</span></div></div>",
            "created":1358312400,
            "id":1509954,
            "title":"Just a touch off ..."
        },
        "1441122122":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>On the way to math class, Rebecca found her mind wandering as she plodded through the school hallways with Ronald's chubby, clumsy body. Although she'd never in a million years admit it, she was actually enjoying checking out all the pretty girls at school. Most of these were girls she'd been friends with just yesterday. Now she found them attractive!<br>\r\nBlushing and shaking her head to clear these alien thoughts from her mind, Rebecca failed to notice Jeff Harris, one of the popular jocks at school, sneak up from behind. Without warning, Jeff put his foot out in front of Rebecca's path causing her to tumble head over heels, splatting face first into the hard tile floor of the school hallway.<br>\r\n</span></div></div>",
            "created":1359954000,
            "id":1524062,
            "title":"At school, she encounters the school bully who ..."
        },
        "14411221221":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "follow him and fight like the man you are now",
                "go to your classes"
            ],
            "content":"<div class=\"\"><div> <span>“Careful there, fat ass!” laughed Jeff, kicking Rebecca in her over-sized behind. “You're such a loser, Dwebble. Can't you even walk down the hall without embarrassing yourself?”<br>\r\n<br>\r\nJeff laughed, kicked Rebecca once more, and sauntered away.<br>\r\n</span></div></div>",
            "created":1360040400,
            "id":1524988,
            "title":"continue"
        },
        "144112212211":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "work out a plan",
                "revenage right now!"
            ],
            "content":"<div class=\"\"><div> <span>Rebecca could no longer restrain herself from bursting out in pure anger!<br>\r\nEven when she remembered that She'd dated Jess Harris a couple of times, and always thought he was just a handsome, nice, friendly person. Now that she had been transformed into a fat, male nerd though, the popular school athlete had nothing but scorn and ridicule for her. And she wanted to teach him a lesson and make him pay!<br>\r\n</span></div></div>",
            "created":1360126800,
            "id":1525698,
            "title":"follow him and fight like the man you are now"
        },
        "1441122122111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "next class",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>She certainly will need a plan!<br>\r\nBut now it was time for her math class.<br>\r\nShe was managing to get into Ronald's seat just seconds before the bell rang. The teacher, a white haired old spinster ironically named Miss Young, was just passing out exams.<br>\r\n<br>\r\nShit, thought Rebecca. There is absolutely no way she was going to be able to pass a test in Ronald Dwebble’ s advanced math class! She wasn't a nerd like him. This was the last thing she needed today.<br>\r\n<br>\r\nNevertheless, Rebecca sighed and started in on the exam, figuring she had no real alternative. <br>\r\n<br>\r\nShe gazed at the first question: Find a polynomial with integer coefficients that has the following zeros: - 1/3, 2, 3 + i.<br>\r\n<br>\r\nPiece of cake, she thought, quickly scribbling down the correct answer. Must be a fluke or something. Maybe Miss Young threw in that one just to give everyone an easy question to start off with.<br>\r\n<br>\r\nNext question: Factor f(x) = x3 + 2x2 + 14x completely over the complex numbers.<br>\r\n<br>\r\nAgain, no sweat! Rebecca had the problem solved in her head almost faster than she could write it down on paper.<br>\r\n<br>\r\nWhat's next? Find all vertical and horizontal asymptotes for the graph of the following function and then graph the function … <br>\r\nBefore she knew it, Rebecca had whizzed her way through the entire six-page test, confident she had easily earned an A if not an A+ on the exam. And on top of it all, she still had another fifteen minutes left before the bell rang.<br>\r\n</span></div></div>",
            "created":1360213200,
            "id":1526646,
            "title":"work out a plan-- later"
        },
        "14411222":{
            "choices":[
                "A quiet, shy girl who somehow knows what happened to Rebecca and Ronald.",
                "A giggly, geeky nerd girl who starts flirting with Rebecca. "
            ],
            "content":"<div class=\"\"><div> <span>Desperate to simply blend into the background and avoid attracting any attention Rebecca walked silently to school that morning. Ronald's body was heavier than her own and significantly out of shape, so she was huffing and puffing, out of breath by the time she arrived at school.<br>\r\n<br>\r\nRebecca's heart leaped into her throat in panic as soon as she entered the busy, bustling school corridors. <br>\r\n<br>\r\nAny other day of the year, this was <u>her</u> domain.<br>\r\n<br>\r\nRebecca Ward was Queen of this Castle, and all these little insignificant students were her subjects: lowly peasants who looked to her for royal rulings and decrees on matters of fashion, style, and social standing.<br>\r\n<br>\r\nAnd now Rebecca, the once high and mighty sovereign of the school, had become the monstrously repugnant troll who lurked hidden and unseen living in the dank undergrowth beneath the castle drawbridge.<br>\r\n<br>\r\nNow Rebecca actually felt fear entering these ordinarily familiar, happy hallways where once she ruled supreme. She was the outcast now. The high school was no longer the fairytale play-land of Princess Rebecca. It had been twisted into a dark, foreboding, nightmarish realm where everything Rebecca was familiar with had been turned topsy-turvey. <br>\r\n<br>\r\nShuffling down the corridor while quivering and quaking with fear, Rebecca felt her fat, clumsy body getting bumped and pushed aside by various kids higher in the schools' hierarchy than that of her lowly, new identity as an overweight nerd.<br>\r\n<br>\r\n“Watch where you're going lard ass!” said one particular towering hulk of a football player.<br>\r\n<br>\r\nRebecca bit her quivering lip in fear as the boy shoved her against the wall, laughed, and moved on.<br>\r\n<br>\r\nOnly two days ago, that very same boy – Mike Farlen – had asked Rebecca out on a date. She'd kept the handsome hunk dangling, refusing to commit to anything. Rebecca had always enjoyed teasing and toying with all the boys who were constantly asking her out. <br>\r\n<br>\r\nNow she was getting bullied them!<br>\r\n<br>\r\nHow could the new life of Rebecca Ward possibly get any worse?<br>\r\n<br>\r\nJust then, at the end of the hall she encountered … </span></div></div>",
            "created":1358312400,
            "id":1509959,
            "title":"Once Upon a Time in High School ..."
        },
        "14412":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "dressing now",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Ronald sighed and looked down at his girlish new body. <br>\r\n<br>\r\nRebecca’s mom sounded angry and a look on the clock told that he was late!<br>\r\nSo, he reflected. It would be best, to dress and pretend to be Rebecca for the moment, to avoid further issues!<br>\r\nHe felt confident they'd eventually find some way to reverse the body swap that had affected them. After all, that was the natural course of events in the fantasy and sci-fi stories Ronald had often read. To be sure, it was awfully strange being a girl right now. But Ronald remained confident that his tenure as the occupant of Rebecca Ward's body would be temporary.<br>\r\nSo Ronald simply had to act as an interim steward for Rebecca Ward – don't do anything to embarrass, annoy, or otherwise fluster the real Rebecca. He was simply a caretaker for her body. Ronald resolved to keep a low profile and strive to simply blend in with the crowd at school. That should be the safest course of action. <br>\r\n</span></div></div>",
            "created":1360299600,
            "id":1527476,
            "title":"Rebecca's mom tells him to hurry up and get..."
        },
        "144121":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "go on dressing",
                "you are interupted"
            ],
            "content":"<div class=\"\"><div> <span>Ronald sighed and looked down at his girlish new body. <br>\r\n<br>\r\nRebecca’s mom sounded angry and a look on the clock told that he was late!<br>\r\nSo, he reflected. It would be best, to dress and pretend to be Rebecca for the moment, to avoid further issues!<br>\r\nHe felt confident they'd eventually find some way to reverse the body swap that had affected them. After all, that was the natural course of events in the fantasy and sci-fi stories Ronald had often read. To be sure, it was awfully strange being a girl right now. But Ronald remained confident that his tenure as the occupant of Rebecca Ward's body would be temporary.<br>\r\nSo Ronald simply had to act as an interim steward for Rebecca Ward – don't do anything to embarrass, annoy, or otherwise fluster the real Rebecca. He was simply a caretaker for her body. Ronald resolved to keep a low profile and strive to simply blend in with the crowd at school. That should be the safest course of action. <br>\r\nWhile bashfully averting his eyes, Ronald stripped out of the skimpy negligee and panties Rebecca had worn to bed last night. He then groped about in her underwear drawer (a prospect that normally would both aroused and embarrassed him) before pulling out a pair of lime green cotton granny panties from the far back of the drawer. These would be the best to wear, he thought<br>\r\n<br>\r\nPulling the panties up onto his smooth, soft legs, Ronald tugged to get them properly fitted to cover his large, curvy, round hips and behind. <br>\r\n<br>\r\nNext, Ronald pulled out a random bra from Rebecca's dresser. He wasn't sure it was important to match the bra with the panties, but figured such things were fairly trivial. He struggled for a few moments with the stiff, lacy purple garment, but finally managed to get it securely fitted over his firm, perky breasts. <br>\r\n<br>\r\nThat's weird, thought Ronald gazing down at his feminine chest. He'd always thought the role of a bra was to restrain and secure a woman's breasts. And yet with the bra on, Ronald's new female assets seemed even bigger and more jiggle than before. Somehow this garment was padded or something to enhance the size of Ronald's boobs and even make his cleavage more pronounced than ever. He had to admit, it was a pleasing sight – one that would have pleased him far more had he still been a teenage boy! But he now felt himself hoping Rebecca wouldn't be angry with him for choosing a bra that drew too much attention to her former breasts.<br>\r\n<br>\r\n“Clearly, there's a lot I still need to learn about women and their clothing,” Ronald said aloud to himself.<br>\r\nStill bashfully worrying and fretting over his breasts, Ronald opted to dress himself in modest, reserved clothing. As a boy, Ronald had been a simple t-shirts and jeans kind of guy. So he dug through Rebecca's clothes hoping to find something similar. He managed to find a plain, light gray t-shirt made of some soft, girlish fabric. He put it on, but chose not to pair it with jeans. Everything Rebecca owned seemed too tight and revealing – skinny jeans, joggings, leggings, and super short shorts.<br>\r\nExasperated, Ronald finally gave up and put on the longest skirt he could find in Rebecca's closet: a dark pink garment that came down to mid-calf on his new body. <br>\r\nThe skirt left him feeling cold, drafty, and exposed around the legs though.<br>\r\n<br>\r\nSo Ronald found a pair of opaque, hot pink tights and worked them up onto his feet and legs. He then found a pair of black and white, Converse Chuck Taylors and put them on. <br>\r\n<br>\r\n“Good enough,” Ronald said to himself, finally checking out his reflection in the mirror.<br>\r\n<br>\r\nThe girl in the mirror, however, looked all wrong.<br>\r\n<br>\r\n“What am I not doing right?” Ronald wondered.<br>\r\n<br>\r\nHe grabbed a pink, button down cardigan sweater and slid his arms into it. Did that help? Not really. Maybe he needed to do something with his hair? Ronald hurriedly brushed his long, golden blonde locks, slicked it all straight back, and tied it into a loosely limp ponytail. Still not right! Maybe he needed makeup? Girls like Rebecca were always wearing makeup. Timidly, Ronald reached for a random tube of lipstick and began smearing his lips with a coat of bright, bold, ruby red gloss. Again, back to the mirror – again, still not right!<br>\r\n<br>\r\n“Oh, I give up!” Ronald said in exasperation. “This will just have to be close enough.”<br>\r\n<br>\r\nRonald made sure to grab Rebecca's school bag full of books before heading out the door. He definitely didn't want to embarrass her by forgetting to bring her homework or study materials for class. <br>\r\n<br>\r\nUnlike Ronald himself, Rebecca owned her own car – a sporty little red convertible. So while Rebecca was trudging to school on foot in Ronald's body right now, Ronald got to enjoy the new experience of driving himself to school. He made absolutely certain not to speed or do anything foolish. He didn't want Rebecca getting a ticket.<br>\r\nArriving at the high school's parking lot, Ronald got out of the car and had to adjust his tights and skirt a bit, in a most unladylike fashion. At the other end of the parking lot, Ronald spotted two other teens – a pair of social misfits named Edith and Penelope. As a guy, Ronald had enjoyed a passing acquaintance with the two. He was lab partners with Edith again this year, and he and Penelope were in the audiovisual club together and had done some behind-the-scenes tech work on sound and lighting for school plays. <br>\r\n<br>\r\nRonald wasn't exactly friends with either girl, but had enough of a casual association with both to say hello in the school halls.<br>\r\nNow disguised in the body of popular Rebecca Ward, Ronald skipped up to Edith and Penelope and greeted the pair.<br>\r\n<br>\r\n“Hi, guys!” he chirped in Rebecca's voice.<br>\r\n<br>\r\nEdith and Penelope stopped dead in their tracks, staring long and hard at Ronald without speaking.<br>\r\n<br>\r\nPenelope, a tall skinny girl with a pale complexion made worse by her choice of all black clothing, forced herself to smile politely and nod quietly at Ronald.<br>\r\n<br>\r\nEdith, a short chubby girl with thick glasses and hair dyed an unnatural neon green girl, stared with her jaw dropped wide for a moment. <br>\r\n<br>\r\n“What the hell is wrong with you today, Li'l Miss Prom Queen?” Edith asked. “Since when do you deign to grace the dregs of high school society outcasts with your stylish presence?”<br>\r\n<br>\r\nPenelope said nothing but quietly began to giggle.<br>\r\n<br>\r\nRonald blushed with embarrassment. <br>\r\n<br>\r\n“Look, I'm sorry if I haven't been that nice to you in the past,” he said. “But bygones are bygones, right? I just thought …”<br>\r\n<br>\r\n“You? Thought?” laughed Edith. “That's one for the history books, Penelope! Our pretty pink cheerleader princess here just had her very first thought. Stop the presses! Rebecca Ward's brain develops a thought – details during the 11 o'clock news.”<br>\r\n<br>\r\n“Okay, I probably deserved that,” admitted Ronald ruefully. Normally, he rather enjoyed chemistry class with Edith's caustic, biting sense of humor constantly aimed at the popular kids in class. This morning though, it was all directed right at him. “But now, I'm … uh … I'm turning over a new leaf and trying to be a new person. I'm sorry about everything that I've done in the past. I hope you and Penelope can forgive me. I assure you, I really am a changed ma- ... a changed girl. I'm a whole new person now!”<br>\r\n<br>\r\n“Good for you,” Penelope said quietly, still struggling not to giggle.<br>\r\n<br>\r\n“Is that why you let a pack of hyperactive, color-blind, four year olds dress you this morning?” asked Edith. “Sheesh, at least the old you had style – vapid, shallow, superficial style … but style nonetheless. What are you now: the Ugly Betty Barbie Doll? Ooo, I love your makeup Rebecca! Tell me: is it maybelline or lipstick by the Joker?”<br>\r\n<br>\r\n“Edith, come on. Let's just go,” giggled Penelope.<br>\r\n<br>\r\n“No way,” said Edith. “This Lindsey Lohan wannabe here has made our lives an absolutely miserable living hell since middle school. And now she suddenly has a change of heart and wants to play friendly? What happened – did your little bimbo friends all desert you, and now you have no one to be snooty and arrogant with? Or were you visited last night by the ghostly spirits of prom queens past, present, and future and given visions of why you must change your simpleminded, superficial ways? Is that why you want to play at this little game of Let's Patronize the Freaks and Geeks?”<br>\r\n<br>\r\n“Sorry about her,” Penelope said, still struggling not to snort with uncontrollable laughter. “We like the new you, Rebecca. We really do!”<br>\r\n<br>\r\nPenelope now forcibly dragged her shorter friend away, leaving a stunned Ronald standing alone in the parking lot, scratching his head and wondering what he had done wrong. A brilliant but friendly nerd like himself in the body of a beautiful, popular girl – he should have the best of both worlds right now!<br>\r\n</span></div></div>",
            "created":1360558800,
            "id":1529841,
            "title":"dressing now"
        },
        "1441212":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "bad news",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But suddenly there was the principal, who interrupted the girls with an announcement…</span></div></span></div>",
            "created":1360645200,
            "id":1530575,
            "title":"you are interupted"
        },
        "1442":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "ruin his life by making him gay",
                "something else",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does Rebecca do today to destroy the life and reputation of Ronald Dwebble in order to get revenge on him for stealing her life?</span></div></span></div>",
            "created":1360299600,
            "id":1527480,
            "title":"back to Rebecca in his body"
        },
        "14421":{
            "choices":[
                "rebbeca really ronald's pov, gym+shower?",
                "ronald really rebbeca's pov, shower?"
            ],
            "content":"<div class=\"\"><div> <span>she had her plan all thought out by the time she got on the bus and made the uncomfortable ride to the school. \"God i wish my car.\" she thought to herself. arriving at school she made her way to the locker room, she knew this was ronalds first class because it was her first class too.<br>\r\n<br>\r\nShe sat on a bench and watched all the boys getting naked, few were skinny and some were fat like ronald, but the ones she wanted were the jocks. she eyed them up as a girl but now she got to see them naked. \"win/win\" she thought to herself as one of the more muscular seniors bent over stepping out of his pants revealing blue boxers. \"well hello.\" she said loud enough to be sure he and everyone else heard. there was a moment of silence as the senior took his bag and moved away.<br>\r\n<br>\r\n\"ALRIGHT LADIES GET YOUR BUTTS ON THE GYM FLOOR!\" the coach screamed from the door. \"It's wednesday!\"<br>\r\nRebecca got dressed quickly as she could into the school issued singlet. she minced outside with the other guys while the other suck ups were helping the coach set up the wrestling mats.<br>\r\n<br>\r\nit wasn't long before it was her turn to wrestle. She jumped at the chance clapping her hands \"be gentle with me.\" she said to the muscular boy as he took her back. \"dude.\" he responded with his surfer dude accent. She was quickly pinned with the boy on top of her crotch. \"You're supposed to get him off of you.\" said the coach. \"why would i want to?\" she winked at the boy who quickly got up and off the mat.<br>\r\n<br>\r\nthe coach made her sit on the bleachers the rest of the class where she spotted herself with the girls.</span></div></div>",
            "created":1395550800,
            "id":1765723,
            "title":"ruin his life by making him gay"
        },
        "144211":{
            "choices":[
                "Walk up the her and kissed her?",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>Rebecca POV:<br>\r\n<br>\r\nShe finished wrestling practice and tried her best to make out the Ronald is gay while doing it.<br>\r\n<br>\r\nShe wait in the changing room saying the odd comment about some of the gays as they change, but most of the just ignored her.<br>\r\n<br>\r\nAfter all of them had left Rebecca got in the shower and started wash herself, she did notice that Ronald had a slight feminine figure she expected it was due to genetics or something like that.<br>\r\n<br>\r\nAnyway she showered and then got out and started getting dressed when she had another idea to destroy Ronald's reputation at school.<br>\r\n<br>\r\nShe went to the lost and found and sore two box's out with male on the side the other with female.<br>\r\n<br>\r\nShe went straight for the female one and pulled out some bright pink thongs and put them on and tucked her penis between her legs then was about to get dressed.<br>\r\n<br>\r\nWhen she turned and some the surfer dude looking at her, what did he do?</span></div></div>",
            "created":1461646800,
            "id":2139456,
            "title":"rebbeca really ronald's pov, gym+shower?"
        },
        "1442111":{
            "choices":[
                "Go to the next class?",
                "After school at alan's house?"
            ],
            "content":"<div class=\"\"><div> <span>He walked up to her and kissed her Rebecca, pulled away and took one last look at Alan and sore a 5.9 dirty blonde very well defined muscled surfer dude.<br>\r\n<br>\r\nHe smiled and said Ronald I didn't know you where gay, I knew your a little feminine but I thought that was due to your late puberty, he then picked up Rebecca and kissed her more.<br>\r\n<br>\r\nRebecca pulled away once more what about people coming in and seeing us, don't worry darling nobody will be in for the next hour it's lunch.<br>\r\n<br>\r\nRebecca smiled liking that he's speaking to her as if she's in her old female body again and treating her like a girl, she missed it.<br>\r\n<br>\r\nHe then kissed her and moved the thong she was wearing to one side and felt something go into her arse or Ronald's arse, she moaned in a very girly way.<br>\r\n<br>\r\nJesus it hurts, it's so big, Alan kissed her and said don't worry it only hurts at first.<br>\r\n<br>\r\nAlan started moving her and her was right and she started to really enjoy the sensations that Alan was making her feel and didn't realise a male body could be made to feel like this.<br>\r\n<br>\r\nAfter about 10 minutes of this Alan whispered your my girl babe, \"fuck\" your my girl, my tomboy girl \"fuck\" \"jesus\" Rebecca moaned I'm you girl honey, I'm your girlfriend.<br>\r\n<br>\r\nAdam then climaxed inside her and gently took her to the shower where they washed each other and then got dressed.<br>\r\n<br>\r\nRebecca went to the lost and found and took some girls jeans, tshirts and thongs and got dressed.<br>\r\n<br>\r\nAlan gave you his number and asked you to meet him at his house after school.<br>\r\n<br>\r\nWhat do you do now?</span></div></div>",
            "created":1462078800,
            "id":2141677,
            "title":"Walk up the her and kissed her?"
        },
        "144212":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "talk",
                "follow your plans with Sarah"
            ],
            "content":"<div class=\"\"><div> <span>Ronald’s POV:<br>\r\nAfter Ronald woke up this morning in a different body and gender he almost got mad…<br>\r\nNow he was trapped as Rebecca, one of the popular girls, who always treated him and his friends mean.<br>\r\nEven he does not like being a girl, he likes being a popular person around school now….Considering this, the price is high but at the end worth it!<br>\r\nRebecca had the same first course this morning, PE: This will become interesting thinks Ronald, because he is really fed up of this wrestling stuff and maybe the girls will do something better….At least he also now would get the possibitlies to be inside the girls locker rooms and get to see some of the girls better and closer like he could as a boy…<br>\r\nOne advantage of being popular was now that he no longer had to go to school by bus. Rebecca had an own car. Even being in a poor family his parents had made it able for him to get a driver’s license. So Ronald had a license but no car. So this has changed for the better now and he was driving in his new car to school….<br>\r\nArriving there he entered the girl’s locker room in excitement. For the start he sat on a bench and watched all the girls getting naked: Most of them were skinny like he is now! There were also 1 or 2 fat girls…He showed no interest in them of course!<br>\r\nRonald went on eyes the pretty girls and likes to be more on the winner’s side of life. Now he saw one girl he secretly had a crush on: She was just sliding out of her street wear and Ronald saw her in her underwear: Only in bra and panties…”Wow” he said loud enough that she and the other girls around could hear “Rebecca” commenting on Sarah’s underwear and body shape….<br>\r\nThere was a moment of silence, but Sarah just turned around and put on her sportswear…<br>\r\nRonald thinks and wanted to follow with another comment, but the trainer came in and pushed him and the remaining undressed girls to speed up…<br>\r\nSo Ronald got dressed quickly as he could and followed the group of other girls outside into the gym…<br>\r\nThe girls had to warm up, but Ronald decided to set on the bench with Sarah, just to see how far he can go now with his new identity….<br>\r\nBut instead of starting a conversation with Sarah, he had to see the boys training wresting and saw his old body on the mat, while Frank, one of the more sportive guys and handsome guys, was over his old body….His old body looked like gay and the coach let him sit on the bleachers…<br>\r\n</span></div></div>",
            "created":1395637200,
            "id":1766658,
            "title":"ronald really rebbeca's pov, shower?"
        },
        "15":{
            "author_id":"kouji",
            "author_name":"Kouji",
            "choices":[
                "Jamal Anderson",
                "Alexander Pointdexter",
                "Steve Johnson",
                "Samatha Claire",
                "More characters"
            ],
            "content":"<div class=\"\"><div> <span>not like the first characters? not a problem, here some more to choose:<br>\r\n<br>\r\nJamal Anderson - A young black man who think white people are racists snobs that are good for nothing, he wake up in the body of a single white man lower-middle class office worker that live in a neighbour mostly compose for black people who are constlantly harass by  the blacks in his neighbour <i>and</i> work place, who is also mostly compose of blacks<br>\r\n<br>\r\nAlaxander Pointdexter - A Straight A nerd who thinks all the popular kids are a bunch the arrogants morons that most like are going to end work in low pay jobs, wake up in the body of the quaterback of his school team that have to be in constlantly pressed by everyone, teammates, coach, girlfriend, family, teachers. and is constlantly scorned has a moron<br>\r\n<br>\r\nSteve Johnson - A construction worker who thinks all rich people are a lazy useless  that are lose of sight of real life and live only in they frivollous little worlds, he wake up in the body to a high middle-class managerment who is not respect by those who worker from him<br>\r\n<br>\r\nSamatha Claire - A goth girl who thinks all preppy girl are nothing but just sluts, she wake up in the body of the head cheerleader</span></div></div>",
            "created":1360645200,
            "id":1530670,
            "title":"Other characters"
        },
        "154":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "Samatha Gets a Call From Rachel Miles",
                "Tiffany's Mom Knocks on the Bedroom Door, Wanting to Talk to Samatha",
                "Samatha Gets a Call From Tiffany, Who is Now in Samatha's Body"
            ],
            "content":"<div class=\"\"><div> <span>Samatha Claire leaned against the wall and scowled at Tiffany McGann and Rachel Miles, two of the most preppy girls at her school.  Tiffany was also the head cheerleader.  Samatha hated them.  They all dressed like real life Barbie dolls and acted like total sluts, especially with the jocks.  It made her so sick.  Why couldn't they all be more like her and her Goth friends?  Samatha and her friends used their brains to get ahead, not their bodies.  Sure, the Goths were looked down upon and the Preps were looked up to, but in the long run, it was the ones with the brains that succeeded in life.  Right?  If only things were different, maybe high school would be a lot more tolerable.<br>\r\n<br>\r\nShaking her head, Samatha headed home, not even realizing that the next morning, things <i>would</i> be different, but not exactly the way she intended or wanted them to be.<br>\r\n<br>\r\n------<br>\r\n<br>\r\nBeep ... beep ... beep ...<br>\r\n<br>\r\nSamatha groggily woke up, then slammed her fist down on her alarm clock snooze button.  \"Jus a little more sleep,\" she muttered, her eyes barely open.  But then something caused her eyes to open wide and that's when she realized that something was wrong.  <i>Very</i> wrong.<br>\r\n<br>\r\n\"What the hell?\" she uttered, looking around her bedroom.  Except ... it wasn't her bedroom.  She was even sure that this wasn't her house.  How did she get here?  Wherever she was, she was sure that the bedroom didn't belong to a Goth.  In fact, the room looked quite pink and girly.<br>\r\n<br>\r\nShe sat up a bit, to get a better look at her surroundings, and that's when she saw her body.  The covers slid down, exposing a tanned-skin body with large breasts, all somewhat covered by a lavender nightie.  This was definitely <i>not</i> her body.  What was happening?<br>\r\n<br>\r\nSamatha got out of bed and ran to the bedroom mirror, hoping that it would clear up a lot of things.  Well, it cleared up one thing.  She wasn't in her own body anymore.  Instead, she was in Tiffany McGann's body!</span></div></div>",
            "created":1367816400,
            "id":1585476,
            "title":"Samatha Claire"
        },
        "155":{
            "author_id":"bustie",
            "author_name":"MRBustin",
            "choices":[
                "Sure, go with this",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>Jonathan Green - 16 year old junior in high school, 6 feet 3 inches tall, short brown hair, blue eyes, white skin. Jonathan is a varsity lacrosse player (defense) and is a slightly above average student. He believes that girls don't need to work as hard in sports to achieve the same success. One day he wakes up in the body of the only girl on the lacrosse team.</span></div></div>",
            "created":1388466000,
            "id":1718507,
            "title":"More characters"
        },
        "1551":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "wake up",
                "something else",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>The night before he had been in his favorite pub until around 10 with his friends from the team. Only Mia was not with them: Of course as a girl she has to go to bed early….<br>\r\nWhen Jonathan left the pub, he went home and watched TV until around midnight when he fell asleep. This morning he woke groggy and felling like he had a real bad sleep.<br>\r\n</span></div></div>",
            "created":1389157200,
            "id":1724146,
            "title":"Sure, go with this"
        },
        "15511":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue",
                "continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As he opened his eyes he was blending by the morning and his eyes and his head hurt…<br>\r\nNot having another option he got up, and began getting dressed for school that day. <br>\r\n</span></div></span></div>",
            "created":1571374800,
            "id":2734730,
            "title":"wake up"
        },
        "155111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Bored as every morning Jonathan arrived at his school he entered his classroom for the first course of the day.<br>\r\nAlso like every day he sees the other students, one would call the usual suspects, some are your friends and some are not….He is also happy to see Mia again, he missed her yesterday in the pub!<br>\r\nIn the morning break Johnathan enters the bathroom, he needed to pee.<br>\r\nTo do so he started to drag out his schlong from his boxers and stands in front of the urinal to let it flow.<br>\r\nBut today and now it was not as every day and very strange: while he wanted to piss something happened<br>\r\n</span></div></div>",
            "created":1571634000,
            "id":2736268,
            "title":"at school"
        },
        "1551111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "freak out",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>As you pee, you realized you felt different somehow... <br>\r\nWhile your schlong is in your hand and you let the steam flow it seems to shrink.<br>\r\nYou could finish your business standing, but some moments later you would have to sit for doing your business… <br>\r\nYou felt slightly damp between your legs…<br>\r\n</span></div></div>",
            "created":1571720400,
            "id":2736731,
            "title":"loosing your penis"
        },
        "15511111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "freak out more",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You immediately went into some stall and looked between your legs: You freak out as you got confirmation of what you already feared:<br>\r\nYou didn't see your penis and testicles but instead a vagina nestled between your legs. <br>\r\nWow, what is going on? <br>\r\nStill freaking out inside the toilet you hear the bell for your next class. Damn you cannot miss this course, the teacher already hates you so you have to show up!<br>\r\nSo you quickly pulled up your boxer shorts and trousers and.... damn it you have to clarify this, losing your penis it nothing you can scope with…<br>\r\nSo you try to skip school at least for the afternoon, but first you have to go back to the course, mathematics: You hate the subject and the teacher and also you are not favorite student of this particular teacher!<br>\r\nYou leave the toilet and go back to your classroom: Damn the teacher is already there and you have to excuse yourself for being late. For some reason he seems to be nice today and accepts and the lesson went quite uneventful. After this one you need to leave to clarify your issues:<br>\r\nTo get off for the rest of day, You pretend to be sick, but after all you don’t need to pretend, since losing your manhood is certainly more than a simple sickness….<br>\r\nThe nurse you told to not feel well and she agreed that you are allowed to stay away from the afternoon courses.<br>\r\nSo you make your way home to finally find out what is going on:<br>\r\nAfter a while you arrive at your home and sort your mind:<br>\r\nWhile thinking you'll additionally have to find out that your body is slowly becoming that of a girl.<br>\r\n</span></div></div>",
            "created":1571806800,
            "id":2737186,
            "title":"freak out"
        },
        "155111111":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You started feeling warm so you took of your trousers and top to notice your body is hairless but the worst part is that you are wearing <a rel=\"nofollow\" href=\"https://www.amazon.co.uk/Fabio-Farini-Seamless-Panties-Knickers/dp/B019WHJ2SM/ref=mp_s_a_1_15?dchild=1&amp;keywords=boxer%2Bshorts%2Bwomen&amp;psc=1&amp;qid=1571832319&amp;rnid=1731380031&amp;s=clothing&amp;sprefix=Boxer%2Bshorts%2Bw&amp;sr=1-15&amp;th=1#immersive-view_1571832583077\" target=\"_blank\">https://www.amazon.co.uk/Fabio-Farini-Se...</a> and they feel very comfortable. </span></div></span></div>",
            "created":1571836200,
            "id":2737247,
            "title":"freak out more"
        },
        "1551111111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "do it",
                "hesitate",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>And next you not only see that your chest has grown and two nice female tits are now sitting on your hairless chest….With the changed body shape and now no longer having a penis and with these boobs there is no way that you are considered as male any more. Suddenly also your hair grows longer and with that one the final step to look like a girl is done…. You only can burst into tears, since your life as you know it is definitely over….<br>\r\nYou think about Mia, one of the girls from your class you would call a friend, how she would react now seeing that you are a female as well.<br>\r\nMaybe you should contact her?<br>\r\nThe best opportunity would be tonight, since there is a party scheduled, where all the cool people will be around and Mia will be there as well. But this means you have to show up there as a girl…<br>\r\n</span></div></div>",
            "created":1571839020,
            "id":2737259,
            "title":"final changes"
        },
        "15511111111":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Pick one in the wardrobe ",
                "Buy a new one (you see Mia in the store) "
            ],
            "content":"<div class=\"\"><div> <span>After some thinking you decide to go to the party but you know you'll have to dress the part if you want them to let you in once you get to the party.<br>\r\n<br>\r\nYou look at the boyshorts you are wearing and reluctantly get up and look in your wardrobe you see everything a girl would have although you mainly have jeans hung up on hangers you also three dresses.<br>\r\n<br>\r\nDo you pick one or buy a new one? </span></div></div>",
            "created":1573713960,
            "id":2746560,
            "title":"do it"
        },
        "155111111111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "hesitate",
                "not at all"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe you should risk to take one of the 3 dresses?</span></div></span></div>",
            "created":1573723860,
            "id":2746611,
            "title":"Pick one in the wardrobe "
        },
        "1551111111111":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>You take out a purple long sleeved dress that came to just above the knees then you picked out a bra and knicker set.<br>\r\n<br>\r\nOnce dressed you put on some boots and left for the party. <br>\r\n<br>\r\nYou felt strange wearing a dress but you just tried to ignore it as you approached the party... So you can find your friend to help you as you don't know how this happened or what to do know... </span></div></div>",
            "created":1573738920,
            "id":2746677,
            "title":"yes"
        },
        "15511111111111":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Hello, who are you? ",
                "Hello (pause) Josephine come in"
            ],
            "content":"<div class=\"\"><div> <span>You get to the house where the party is it seems quiet but you think you are pretty early, you knocked on the door.<br>\r\n<br>\r\nA guy opened the door and looked you up and down then you saw Mia coming from behind him and she looked at you to and said... </span></div></div>",
            "created":1574060220,
            "id":2748164,
            "title":"Continue "
        },
        "155111111111112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "try it",
                "hesitate",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Damn it she really thinks I am a girl, How could I convince her that I was a guy just some moment before?</span></div></span></div>",
            "created":1574078100,
            "id":2748240,
            "title":"Hello (pause) Josephine come in"
        },
        "1551111111111121":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>Mia took you to a bedroom and you sat down and said \"Mia it's me Jonathan\" Mia smiled and said \"I know it's you John, but what happened to you\"....<br>\r\n<br>\r\nWhy are you a girl? <br>\r\nWhy are you wearing the dress? (you look good in it by the way)<br>\r\nAnd why did you come here and not just ring or message me? <br>\r\n<br>\r\nFuck Mia a million questions.. <br>\r\n<br>\r\nFirst I don't know why I'm a girl I started turning into one for no reason, even my clothes have changed. <br>\r\n<br>\r\nI'm wearing the dress because I found it in my wardrobe and thought I would have to dress the part to be able to talk to you at the party. <br>\r\n<br>\r\nAnd to be honest I was in a panic and didn't think of just picking up my phone.. </span></div></div>",
            "created":1574150040,
            "id":2748673,
            "title":"try it"
        },
        "1552":{
            "author_id":"mrsqueejee",
            "author_name":"MrSqueejee",
            "choices":[
                "Christian Toback",
                "Jason Carter",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>   Christian Toback, a 17 year old high school student who thinks school is a huge waste of time and disrespects all his teachers, wakes up one day in the body of one of his teachers.<br>\r\n<br>\r\n   Jason Carter, a 26 year old bodybuilder who thinks all fat people are lazy, finds himself in the body of a very fat woman.<br>\r\n<br>\r\n   Or something else?</span></div></div>",
            "created":1402117200,
            "id":1808659,
            "title":"Other choices"
        },
        "15521":{
            "author_id":"bfine2626",
            "author_name":"Bfine2626",
            "choices":[
                "Sarah Alvarez, the 8 months pregnant art and photography teacher ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which teacher does he wake up as?</span></div></span></div>",
            "created":1466571600,
            "id":2168590,
            "title":"Christian Toback"
        },
        "155211":{
            "author_id":"bfine2626",
            "author_name":"Bfine2626",
            "choices":[
                "Readers chocie",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>It was the third week back from christmas break. Christian hated school and hated being here. He didnt want to be forced to learn. He especially hated the teachers because they had all the power. While at his desk, he started to drift in and out of consciousness until he finally blacked out. Unbeknownst to him, a figure is going to give him the power he desired by making him one of his teachers by swapping his body and life with them.<br>\r\n<br>\r\nHe slowly wake up. He felt like he was sitting in a chair and not a bed. He was able to look around and see bright light and a classroom that looks like the  photography teachers room. \"Why the fuck am I at school?\" He thinks to himself . Long brown strands of hair fall in front of his  eyes. \"Ooph. What was that feeling?\" He thought as a kicking sensation just hit his bladder. He  notices  that he  was now sitting at Mrs. Alvarez desk in her classroom. He looked at the clock on the wall. \"Its 2:30. School just let out 5 minutes ago.\" He realized. \"Wait isnt Mrs. Alvarez.... Oh Shit!\" <br>\r\nHe looked down and were shocked at what he saw. He  saw two swollen and milk filled presumably DD cup boobs hanging of his chest, and they were laying on top of a big pregnant belly. He remembered that she said that she was about 18 weeks pregnant on the first day of the year. She was about 34 weeks along last week. He was now in the body of  the pregnant photo teacher. The 32 year old, 34 week pregnant photography teacher. <br>\r\n<br>\r\nHe had a hard time getting up with alll of the weight in the front. He was not used to a heavy pregnant belly. His feet were swollen. He gets a good look at his new body. <br>\r\n<br>\r\n[URL=http://s1175.photobucket.com/user/bfine2525/media/Pregnant/20160125_121 450-ANIMATION_zps5is2ao7f.gif.html][IMG]<a rel=\"nofollow\" href=\"http://i1175.photobucket.com/albums/r625/bfine2525/Pregnant/20160125_121450-ANIMATION_zps5is2ao7f.gif\" target=\"_blank\">http://i1175.photobucket.com/albums/r625...</a>[/IMG][/URL]<br>\r\n<br>\r\nHe waddled down to the bathroom because of the constant kicks to the bladder. The thought of having to actually give birth in a few weeos scared him considering that he was now in his pregnant photography teachers body. This body felt so different compared to his skinny 15 year old body. He had to endure his first awkward experience going to the bathroom but was able to almost naturally remember how to go to the bathroom as a 32 year old pregnant woman. He was able to get another good look at the brand new body that he was forced into for some reason. <br>\r\n<br>\r\n[URL=http://s1175.photobucket.com/user/bfine2525/media/Pregnant/20160125_123 0440_zpslyj6bauq.jpg.html][IMG]<a rel=\"nofollow\" href=\"http://i1175.photobucket.com/albums/r625/bfine2525/Pregnant/20160125_1230440_zpslyj6bauq.jpg\" target=\"_blank\">http://i1175.photobucket.com/albums/r625...</a>[/IMG][/URL]<br>\r\nChristian waddled back slowly, because of his new pregnant belly. He was still not used to being a pregnant woman. The feelings were so foreign to him. The constant kicking, the extra weight in the front on the small dainty frame, the not having his male part anymore. He got back to her desk and sat down very carefully because he was afraid he would hurt whatever is inside this mountain of a belly. He naturally puts his hand on his belly and begins to rub it pretty good. He snapped out of the trance and realized that Mrs. Alvarez must have a car and be able to drive here somehow. The thought of that made him try to get up slowly from the comfortable chair. He was slowly but surely able to get up from the chair and rest one hand on his big belly. He searched around and found Mrs. Alvarez purse. She had keys in it and he took them out and waddled slowy out of the classroom and out of the building. He had to stop for a second because of a very forceful kick from inside. She was able to get out and waddled towards the only car left in the high school parking lot. It was a pretty nice car that did not look like something a normal art teacher could afford. She got in and had to move the seat back a bit in order for her to reach the pedal because of the belly. Memories kicked in due to the permanentness od the spell that his mom had cast on him when he was suddenly put into Mrs. Alvarez pregnant body and life as a teacher. <br>\r\n<br>\r\nShe drives to a house that she suddenly remebers even though \"Miles\" has no clue. She arrives at Mrs. Alvarez or rather her house that she will have to live in because of the whole body swap situation. She gets out of the car nd waddles into the family style house. Most of Mrs. Alvarez life memories are coming back, having twin brothers, getting a teaching degree for art and photography, meeting her husband Dan, getting married, and finally getting pregnant, and now is 34 weeks pregnant with a baby girl that she has not decided a name on yet. She waddles in to what looks like a living room and set her stuff down. She then sits down and puts her feet on the couch and slowly but surely takes a nap<br>\r\n<br>\r\nChristian slowly starts to wake up. He thinks that the whole being Mrs. Alvarez was all a very realistic and strange dream. He couldnt really have switched his slim and newly 16 year old body and life with Mrs. Alvarez 32 year old, 34 week pregnant body and life as a high school art teacher. \"Wait how did I know that she was 34 weeks pregnant?\" He thought to himself as he slowly opened his eyes. He was looking up as he was laying on a couch of some sort with a blanket laying on top of him. He noticed that where he was looked nothing like his house. It just seemed too modern for his family. He again felt a similar kick to the bladder \" Oh no. Please tell me I am not her still. I dont want to be a pregnant woman.\" Long brown strands of hair fell in his face again. He finally pulled of the blanket and saw what he ultimately dreaded. He was still in Mrs. Alvarez's body and he was in her house now. <br>\r\n<br>\r\nHe struggled to get up and had to use the couch for support. He waddled into the kitchen to look for somwthing to eat because the baby in his or rather her belly kept kicking and her stomach growled. She made her self the weirdest of snakc because of cravings. She remembered that she had already gained 40 pounds because of the pregnancy. She looked at her belly and said, \"Man, you sure make your mamma pack on the pounds.\" She giggled at herself and somehow forgot about formely being a 16 year old kid and her new life as Mrs Alvarez kicked in to her subconscious.</span></div></div>",
            "created":1466571600,
            "id":2168674,
            "title":"Sarah Alvarez, the 8 months pregnant art and ph..."
        },
        "15522":{
            "author_id":"bfine2626",
            "author_name":"Bfine2626",
            "choices":[
                "Readers choice ",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Jason always hated to see fat people. He thought that they were lazy and just gave up on life. He was talking with his friends at the gym when he saw a very obese woman struggling to move, he started to make fun of her and the fact that she could barely move from stuffing her face so much. Unbeknownst to him an unknown figure heard him and decided to put him in the body of an obese woman to show him thr struggles. Jason went home because of a massive headache and passed out on his bed. He blacked out.<br>\r\n<br>\r\nJason slowly woke up. The room looked completley different as he saw a ton of refrigerators. He was laying in a gigantic bed. Long black strands fell in front of his eyes. He tried to lift himself off of the bed but instantly fell backward as he felt a ton of weight on his body. He was just barely able to lift his much heavier arm and was shocked when he pulled off the covers. He saw two gigantic boobs sag nearly to the mountain of fat that was his stomach. He couldnt even see his legs over his stomach. There was a mirror up above him and saw his new body. [URL=http://s1175.photobucket.com/user/bfine2525/media/Pregnant/9080A37F-29A2-45 BE-8349-D6753D9DB9F2_zpsx9hytd35.jpg.html][IMG]<a rel=\"nofollow\" href=\"http://i1175.photobucket.com/albums/r625/bfine2525/Pregnant/9080A37F-29A2-45BE-8349-D6753D9DB9F2_zpsx9hytd35.jpg\" target=\"_blank\">http://i1175.photobucket.com/albums/r625...</a>[/IMG][/URL]<br>\r\n<br>\r\nThere was a remote next to the giant mounds of flesh that was him. It had three buttons, one for food delivery, one for a nurse assistance, and one for feeding. <br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1466571600,
            "id":2168611,
            "title":"Jason Carter"
        },
        "15523":{
            "author_id":"mrsqueejee",
            "author_name":"MrSqueejee",
            "choices":[
                "Daniel Everett",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>   Daniel Everett, a 16 year old high school student who constantly picks on mentally handicapped kids, finds himself in the body of Georgia Willis, a girl with Down Syndrome<br>\r\n<br>\r\n   Or something else?</span></div></span></div>",
            "created":1402117200,
            "id":1808660,
            "title":"Other"
        },
        "155231":{
            "author_id":"mrsqueejee",
            "author_name":"MrSqueejee",
            "choices":[
                "Going to school",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>   Dan sighed as Georgia walked into the classroom. She smiled stupidly. He hated this class. Okay, so he hadn't gotten the best grades in math last year, but he never thought he'd be put in an extra help class with Georgia Willis!<br>\r\n<br>\r\n   Georgia Willis was a girl in Dan's school with down syndrome. People always told him it was mean that he hated her, but he didn't care. They didn't have classes with her.<br>\r\n<br>\r\n   \"Retard bitch,\" Dan muttered, and nearly jumped out of his skin when somebody behind him said, \"What did you just say?\"<br>\r\n<br>\r\n   Dan turned around. Standing behind him was Mrs. Corter, his math teacher. She was a strict old lady who hated Dan and loved Georgia.<br>\r\n<br>\r\n   \"I- I didn't say anything,\" Dan exclaimed.<br>\r\n<br>\r\n   \"Don't lie to me! I heard what you said!\" shouted Mrs. Corter.<br>\r\n<br>\r\n   \"It-it won't happen again!\" Dan pleaded.<br>\r\n<br>\r\n   \"I don't believe you. Your problem, Daniel, is that you can't see through the eyes of others. You don't know what it's like to be Georgia and face what she faces every day. I'm about to change that!\"<br>\r\n<br>\r\n   Suddenly, everything went dark.<br>\r\n<br>\r\n   *****<br>\r\n<br>\r\n   Dan woke up in a cold sweat. A dream, it was just a dream. Anyway, there was only a week left in the school year and then Dan would never have to deal with Georgia Willis again.<br>\r\n<br>\r\n   Climbing out of bed, something felt wrong, but he didn't know what. He didn't figure out what it was until seeing himself in the mirror. He almost screamed.<br>\r\n<br>\r\n   <a rel=\"nofollow\" href=\"http://img3.wikia.nocookie.net/__cb20121024053033/americanhorrorstory/images/thumb/f/f5/Addie.png/210px-Addie.png\" target=\"_blank\">http://img3.wikia.nocookie.net/__cb20121...</a><br>\r\n<br>\r\n   Why was he in Georgia's body? He looked around. It seemed like he was in a child's room. Why was he in her room?<br>\r\n<br>\r\n   It wasn't a dream, he realized, it was a reality. Somehow, Mrs. Corter had put him in the body of Georgia!<br>\r\n<br>\r\n</span></div></div>",
            "created":1402117200,
            "id":1808665,
            "title":"Daniel Everett"
        },
        "155232":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "A Mile in her Heels",
                "Something else",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A Mile In Her Heels: After a nasty breakup with your girlfriend, a pair of women's shoes are delivered to you each day, and you are compelled to put them on. Once you do, you are forced to live out the life of the woman that the shoes belong to.</span></div></span></div>",
            "created":1530594000,
            "id":2514438,
            "title":"other"
        },
        "1552321":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "A secretary's black pumps",
                "A cheerleader's white sneakers",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jackson Harding set the shoe box on the coffee table and stared at it in exasperation.<br>\r\n<br>\r\n\"I can't even figure out what this is supposed to mean...\" he mused.<br>\r\n<br>\r\nA few days earlier, he had gotten into a nasty fight with his girlfriend Lana, which had resulted in her deciding to leave him, moving out that night and going god knows where. Probably with a friend. It was the same fight they had gotten into a million times, Lana wanted to go out, to some function with her office colleagues, and Jackson wanted to stay in that night. When he finally relented, he was mad that they were going to be late because she was taking forever getting ready.<br>\r\n<br>\r\n<i>\"You just don't understand how hard it is to be a woman!\" Lana shouted. \"I can't just throw on an old shirt with a stain on it and just go!\"<br>\r\n<br>\r\n\"Complain, complain, complain is all you do! It can't be that hard!\" Jackson shouted back.<br>\r\n</i><br>\r\nThe fight went on, they said some things they'd both regret, and she was gone. But this morning, Jackson's doorbell had rung. He had hoped it was Lana, ready to make up, but instead it was a shoe box. He picked up the box and opened it, revealing a pair of....</span></div></div>",
            "created":1530594000,
            "id":2514440,
            "title":"A Mile in her Heels"
        },
        "15523211":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "Waking up",
                "Something else",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Revealing... black pumps, the type that Lana would wear to work at the office. Jackson set the box down on the table and stared at it. He grabbed one of the heels and looked inside of it, then inside the box.<br>\r\n<br>\r\n\"No note from Lana... Maybe a friend borrowed these from her and don't know about the living situation yet? Or...\" Jackson continued to think.<br>\r\n<br>\r\nHe absentmindedly kicked off his socks and continued thinking. He tried calling Lana, but no answer, same as it was for the last few days.<br>\r\n<br>\r\nAs he mused, he almost didn't notice himself pick up one of the shoes again and start to slip it onto his foot. He probably wouldn't have noticed, but it fit!<br>\r\n<br>\r\n\"What the?\" he asked. \"Why are these in my size?\"<br>\r\n<br>\r\nHe looked down at his foot again. It seemed... almost smaller? He compared both his feet, and sure enough, the one without the heel on was bigger.<br>\r\n<br>\r\n\"What if...\" he started, before morbid curiosity got the best of him. He quickly put the other heel onto his other foot. He wiggled his toes, which tingled as the shoes snugly encased his feet. \"Okay, that's enough.\"<br>\r\n<br>\r\nHe started to take off the shoe, but found that it was stuck to his foot. He started to panic.<br>\r\n<br>\r\n\"Get off!\" he shouted, as he pulled, to no avail.<br>\r\n<br>\r\nHe stood up and started walking across the room to the kitchen to get a knife, but on the way he stumbled and fell backwards. He braced himself to hit the floor, but was surprised that he kept falling as his vision faded to black.</span></div></div>",
            "created":1530594000,
            "id":2514441,
            "title":"A secretary's black pumps"
        },
        "155232111":{
            "author_id":"vanillathunder",
            "author_name":"Vanilla Thunder",
            "choices":[
                "Shower?",
                "Get dressed?",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jackson awoke in a cold sweat. The alarm was blaring and he reached over and hit the snooze button. As the alarm stopped, he heard a strange tapping sound as he fumbled to turn the alarm off entirely.<br>\r\n<br>\r\nJackson yawned and stretched as he pulled himself upright, noticing that he felt strange... and didn't remember getting into bed the previous night. He felt a tickling on his shoulders and noticed that his vision was framed by long blonde hair.<br>\r\n<br>\r\n\"Ahh!\" Jackson screamed, though it wasn't his voice.<br>\r\n<br>\r\nHe jumped out of bed and looked around the room. Something clicked in his head.<br>\r\n<br>\r\n\"This isn't my room!\" he shouted. \"This isn't my voice!\"<br>\r\n<br>\r\nHe fumbled around for a light switch and found one, turning on the lights. He looked around his surroundings.<br>\r\n<br>\r\nThe room was a light lavender, and the pillows and sheets on the bed matched. The room had a bed, a dresser with a TV sitting on top of it, and a small pile of DVDs, a closet, and a vanity with a mirror. Jackson looked down at his body, noticing that it was much smaller, and he was wearing a black nightgown. Not only that, but he had breasts, which he grabbed at, before grabbing at his crotch, finding that part of his anatomy had been replaced.<br>\r\n<br>\r\n\"No, no, no!\" he sighed as he put his hands over his face.<br>\r\n<br>\r\nHis fingernails were longer and had a french tip design, and his toes were perfectly pedicured and matched the design of his fingernails.<br>\r\n<br>\r\nJackson walked over to the vanity and looked into the mirror, seeing a blonde woman. She didn't look like him, and definitely didn't look like Lana.<br>\r\n<br>\r\n\"Who am I?\" Jackson asked.<br>\r\n<br>\r\nSuddenly, the door to the room was thrown open and another woman, looking similar in age to whoever Jackson was now, poked her head in.<br>\r\n<br>\r\n\"Come on! We're gonna be late!\" she shouted.<br>\r\n<br>\r\n\"...Late?\" Jackson asked.<br>\r\n<br>\r\nJust as he started thinking about who this woman was or what was going on, his mind was suddenly flooded with memories. This was Sarah, his best friend and roommate, and they both worked at the same office.<br>\r\n<br>\r\n\"For work.\" Sarah said. \"Unless you don't want the ride...\"<br>\r\n<br>\r\n\"Oh! Uh... I'll be ready in a little bit.\" Jackson said.<br>\r\n<br>\r\nSarah shut the door, leaving Jackson alone to...</span></div></div>",
            "created":1530594000,
            "id":2514442,
            "title":"Waking up"
        },
        "1552321111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "do it",
                "no time for shower-- you are late allready",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I need a shower – Jackson said and wanted to use the time alone in the bathroom to sort out what happened and what is going on….</span></div></span></div>",
            "created":1571374800,
            "id":2734731,
            "title":"Shower?"
        },
        "15523212":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "the shower",
                "to get dressed",
                "the car to leave for school"
            ],
            "content":"<div class=\"\"><div> <span>a cheerleader’s white sneakers. Jackson set the box down on the table and stared at it. He grabbed one of the sneakers and looked closer at it, then he looked inside the box…<br>\r\nNothing inside. He wondered where this box came from and whom those sneakers belong?<br>\r\nHe absentmindedly kicked off his socks and continued thinking about these sneakers and the question about the owner…Maybe Lana might know, but this is not of such high importance to call or contact her right now!<br>\r\nAs he mused, he almost didn’t notice himself pick up one of the sneakers again and start to slip it onto his foot. He properly wouldn’t have noticed, but it fits…<br>\r\n“What the…” he asked and wondered why the sneakers are fitting. He certainly does not have a girl’s shoe size and they don’t look like men’s shoes at all!<br>\r\nHe looked down at his feet again and they seemed smaller?! He in the meantime was wearing both of the sneakers! How can you not realize to put them on?- He wondered about himself…<br>\r\n“What if…” he started, before morbid curiosity got the best of him. He wiggled his toes and the sneakers somehow felt comfortable….”Ok that is enough” he shouted out loud!<br>\r\nHe wanted to get out of the shoes but somehow his feet were stuck…He started to panic and shouted again…<br>\r\nNot getting out of the sneakers he started to panic more and more and runs around like a madman.<br>\r\nNot paying attention at all, he falls down the stairs….His vision faded to black….<br>\r\nJackson woke up in cold sweat. There was a shrilling sound of an alarm clock….<br>\r\nLaying inside his bed he wondered how he came here after this fall….<br>\r\nHe yawned and stretched and was happy that nothing seems to be broken! But overall he felt strange!<br>\r\nSomething was wrong with his hair? Why was it so long suddenly? And it was blonde!<br>\r\n“Ahh” Jackson screamed and it came out of his mouth but it was not his usual voice….<br>\r\nShocked he jumped out of the bed and looked around in the room. For sure this wasn’t his room. He even realized that it was not his house! So it was not his hair, not his voice and not his bedroom….<br>\r\nHe inspected the room more closer and found that the wands were not white but had a kind of light lavender color…. Not bad but definitely not his style!<br>\r\nThe room had a table with a computer on it and some what you would call vanity table….<br>\r\nShocked Jackson looked at his body and found out that he was wearing a black nightie, omg…<br>\r\nHe found that he had breasts and grabbing between his legs, he found nothing what could be considered as male there….<br>\r\n“no please not this” His fingernails were nicely done and Jackson took the risk to use the mirror of the vanity table to get confirmation what was already obvious he somehow became a girl! A blonde young woman of maybe 16 looked back at him!<br>\r\n“Who I am?” was the question of the moment. The unanswered question so far.<br>\r\nSuddenly the door opened and a woman of maybe 40+ came in and told Jackson to speed up, it is time for school.<br>\r\nSchool, oh no, Jackson somehow turned into a school girl overnight….<br>\r\nHe had to realize that he was Sandra now, a cheerleader and school girl from the neighborhood…<br>\r\nDamn, how and why this is happening?<br>\r\nJackson must find it out and maybe he can contact Lana…<br>\r\nBut Sandra’s mother was pushing her into….<br>\r\n</span></div></div>",
            "created":1571634000,
            "id":2736281,
            "title":"A cheerleader's white sneakers"
        },
        "155232121":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue",
                "continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I need a shower – Jackson said and wanted to use the time alone in the bathroom to sort out what happened and what is going on….</span></div></span></div>",
            "created":1571720400,
            "id":2736728,
            "title":"the shower"
        },
        "1552321211":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "arrive",
                "on the way",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Even the time for a shower was short, it was giving Jackson some time to prepare and getting ideas of how he will survive now trapped as a teenage girl, obviously a cheerleader. Also he had to find out why and how this unwanted life impacting change has happened and who was causing that and for what purpose and reason and the of course the major question: Is there a way back?<br>\r\nBut now after drying his now long hair and still getting used to have a female body with boobs and no more a penis, he dressed like this Sandra girl, he became would do and then made the way to school….<br>\r\n</span></div></div>",
            "created":1571806800,
            "id":2737182,
            "title":"make a plan"
        },
        "1552322":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "First few days ",
                "First few weeks "
            ],
            "content":"<div class=\"\"><div> <span>You are Robert and you are 16 years old, you are an average student, happy been male and you have many friends.<br>\r\n<br>\r\nAfter a lab accident you slowly start turning into a girl... <br>\r\n<br>\r\nOnce it's finished you'll still be you and sort of look like you expect you'll be the girl version of yourself.</span></div></div>",
            "created":1573714560,
            "id":2746562,
            "title":"Something else"
        },
        "15523221":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>First few days after the lab accident you feel a little on edge not knowing if you wanted to cry or scream but it soon passed and you felt yourself again.<br>\r\n<br>\r\nYou noticed within a week your skin seems softer as does your hair on your arms and legs...<br>\r\n<br>\r\nYour friend Alex (short for Alexandria) noticed something different about you but she couldn't put her finger on what it was... </span></div></div>",
            "created":1573715040,
            "id":2746564,
            "title":"First few days "
        }
    },
    "info":{
        "author_id":"vanillathunder",
        "author_name":"Vanilla Thunder",
        "brief_description":"Some people think that others have an easier life.  Be careful what you wish for...",
        "created":1353251940,
        "description":"<td align=\"left\" class=\"norm\">Have you ever been treated badly by someone?  Did you ever want them to walk a mile in your shoes?  That's what happened here, Four people treat others badly and then have to live their life for an indeterminate amount of time.</td>",
        "id":1904178,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1574150040,
        "modified":1574150040,
        "pretty_title":"Reality Check"
    }
}