{
    "chapters":{
        "1":{
            "author_id":"mysterio",
            "author_name":"FFtheSnake",
            "choices":[
                "Characters from Japanese anime & manga...",
                "Characters US cartoons and live action shows...",
                "Characters from video games...",
                "Characters from comic books...",
                "Characters from multiple genres interacting..."
            ],
            "content":"<div class=\"\"><div> <span>Fat Vornography was just a concept at first. Something that appeared on Writing.com. <br>\r\n<br>\r\nThen somehow, a video showed up.<br>\r\n<br>\r\nIt starred Maggie the Cat, a character from the cartoon Gargoyles, fattened up to immensity after somehow being altered by Sevarius and forced to eat her lover and the other mutates. It was fairly popular, especially amongst those who liked furries, vore, weight-gain, or all of the above.<br>\r\n<br>\r\nMore videos came out, eventually replaced by DVDs. Soon after, a new character was added after a website for the series was made. White Tiger, a character from Marvel Comics and the second of four to bear the name, apparently read Maggie's story, saw how lonely she was and how depressed she was because of the lack of control over her ravenous appetite, and agreed to become her total slave, giving Maggie total control of her life and giving up all her free will and rights. In short: Tiger fell in love with Maggie and willingly made herself into Maggie's property. The two made a lot of films with that theme, Maggie falling in love with her devoted slave and apparently making Tiger her official property, according to a copy of a legal document on the website. DVDs involving the two fat lovers sold out quickly. <br>\r\n<br>\r\nEventually, Fat Vornography DVDs featuring Felicia, of Darkstalkers fame appeared. Soon after, more comics characters got involved, Emma Frost, and the four Generation X girls, Jubilee, M, Husk, and Hollow. More and more, supposedly fictional characters from popular media, both male and female, became involved in Fat Vornography films. They became tremendously popular, although no one knew why the various companies would agree to let their characters be used like that. <br>\r\n<br>\r\nNo one save the people at the Fat Vornography studio know the truth.<br>\r\n<br>\r\nMaggie and Tiger were just the first, characters from alternate worlds where fatness and eating people whole were savored. The heads of the studio seek out realities based on popular media from this world and bring them over, making videos for people's enjoyment and making a mint...<br>\r\n<br>\r\nThis is a story involving the stars of Fat Vornography...<br>\r\n</span></div></div>",
            "created":1182627240,
            "id":419462,
            "title":"A Brief History"
        },
        "12":{
            "author_id":"mysterio",
            "author_name":"FFtheSnake",
            "choices":[
                "Later on, Jasmine and Shego head back to Jasmine's home...",
                "Meanwhile, at another studio...",
                "Meanwhile, at another studio...",
                "Meanwhile, at the home of another set of stars...",
                "Meanwhile, at another studio..."
            ],
            "content":"<div class=\"\"><div> <span>\tThrough the hallways of an Arabian palace, an unusual stalker skulked through the ivory pillars.  Her body was trim and slender save for her rump, a soft, plush curve, and her breasts, large, firm and round.  Her hair, long and dark, was bound in a ponytail, the slight moonlight making her pale skin shimmer.  She wore a black and green bodysuit, one that accentuated her every feminine curve.<br>\r\n<br>\r\n\tShe moved with a purpose, sticking to shadows and moving quickly past the muscular guards (who, she noted with something akin to nervousness, were all clad in edible outfits made of expertly shaped taffy).  She had a mission to complete.  She was the best.  And she would not fail.  <br>\r\n<br>\r\n\tWith stealthful skill, she came into the room of her target.  She chuckled softly.<br>\r\n<br>\r\n\tPrincess Jasmine was beautiful, yes, clad in no more than a silk loincloth and top, but she was also incredibly fat.  Her flawless, perfectly bronzed skin bulged from her body in smooth and graceful curves.  Her three-foot long and four-foot wide belly swelled prominently from her wide, graceful hips, her ass cheeks larger than the pillows she rested upon.  Her flabby legs were pressed together by their girth, and her arms were so thick with fat that she had to make effort if she wished to touch her sides.  Her breasts were huge, larger than Shego's head twice over, and yet still round and perky despite their fatness.  Jasmine's face was swollen with fat, three chins and puffy cheeks cushioning her face and giving her a cherubic appearance.  She slept soundly on her immense bed, the remnants of her last meal laying on a cart nearby, the servants not having come to claim it yet.  On a cushioned pad next to her bed lay Jasmine's pet tiger, Rajah.  A graceful, elegant beast larger than Shego herself, Shego noted that the tiger had a fat, prominant belly like her mistress.<br>\r\n<br>\r\n\t*Maybe not as much of a threat as I thought he'd be...* she thought, *But still, I'd best be careful and stick to long range attacks...*<br>\r\n<br>\r\n\t\"You can come out of hiding now, dear,\" said a voice.  It took the assassin a moment to realize that it had come from Jasmine.  <br>\r\n<br>\r\n\tReluctantly, she came out of the shadows, her fists glowing with etherial green energy.  Jasmine and Rajah smirked at her, not frightened in the slightest.  <br>\r\n<br>\r\n\t\"How did you know I was there?\" she said.  <br>\r\n<br>\r\n\tJasmine chuckled. \"I am the favored priestess of the gluttonous goddess of evil, Mirage.  She warned me of your coming weeks ago, Shego of America.  Also, one of my guards spotted you coming in.\"<br>\r\n<br>\r\n\tShego cursed her carelessness and frowned.  \"So you know who I am.  Do you know why I am here?\"<br>\r\n<br>\r\n\tJasmine nodded.  \"To kill me.  Although I'm afraid I can't allow that.  That would be... inconvenient.\"<br>\r\n<br>\r\n\tIt was Shego's turn to smirk.  \"And what makes you think you can stop me?\" she said, raising one of her glowing fists.<br>\r\n<br>\r\n\tShe never noticed the club-weilding guard behind her, not until it was too late and he had knocked her out.<br>\r\n<br>\r\n\tJasmine smirked, and said \"Guards that will do anything to please me and stay out of my belly.\"<br>\r\n<br>\r\n\tMuch later, Shego woke up.  She found herself bound by the arms, a rune placed upon her forehead that nulled her powers, her body stripped completely of her clothes, her legs bound by a chain leading to a heavy iron ball.  <br>\r\n<br>\r\n\t\"What... What's going on?\" she said, standing up as best she could and looking around.  She was still in Princess Jasmine's chambers, although now she was surrounded by the muscular guards.  Rajah was standing up, sniffing at her bare sex.  She tried to shy away, but a guard thrust a spear in her face.  Jasmine chuckled at her, and licked her lips.  <br>\r\n<br>\r\n\t\"You can't beat me, dearie,\" she said, \"My goddess has commanded me to make a sacrifice out of you.  I will devour you in her name, and add your strength to my own.  But first... Heheh... It's been so long since Rajah has had a woman other than me...\"<br>\r\n<br>\r\n\tShego spat at her.  Jasmine just smirked.  Shego snarled, and said, \"If you think I'm going to get down on my knees and let your beast rape me...\"<br>\r\n<br>\r\n\t\"I wasn't giving you a choice, deary.  Fazan?\"<br>\r\n<br>\r\n\tA guard standing by Shego struck her in the back of the legs, forcing her to her knees.  Another guard grabbed her and held her down as Rajah stepped up onto a platform set up for him by another guard.  She winced as she felt the tiger's fat belly resting on her back<br>\r\n<br>\r\n\t“No… Don’t… AAAHH!!” Shego said, screaming as the tiger’s thick shaft enter her cunt, filling it to the limit.<br>\r\n<br>\r\n\tInside Shego’s ear, an amused voice spoke over a tiny communicator.  “Try not to sound like you’re enjoying it so much.  Remember, Shego, we’re filming a ‘rape’ scene here.”<br>\r\n<br>\r\n\tShego had to bite back the urge to giggle as she forced herself back in character.  She grimaced in pain and pleasure as Rajah’s fat member slammed into her sex over and over, the beast’s bloated gut smothering her almost completely, the skilled cameramen still getting shots of her breasts bouncing with each thrust of the tiger’s thick cock into her sex.  She shivered in pleasure, careful to make it look like she was in pain as the fat tiger humped her.  <br>\r\n<br>\r\n\tFinally, she ended up biting her lip hard enough to bleed as her climax hit, Rajah emptying his load of hot tigercum into her sex.  Shego collapsed, groaning in feigned pain as the guards roughly picked her up, bringing her to Jasmine.<br>\r\n<br>\r\n\tJasmine ignored her at first, turning to Rajah.  “Did my baby like my little gift?” she said in a cooing voice.  <br>\r\n<br>\r\n\tRajah growled, the flabby tiger grinning and going over to lay down again.  Jasmine giggled and then turned to Shego.  She gestured, and the guards forcibly made Shego lay on Jasmine’s chest.  <br>\r\n<br>\r\n\t“You b-bitch…” Shego said.<br>\r\n<br>\r\n\tJasmine grinned.  “Little fool.  Your government means nothing to me.  You’ll all be sacrifices in either my belly or my goddess’s belly.  You are merely my first meal.  But I think you should be a little plumper, first…”  <br>\r\n<br>\r\n\tJasmine motioned for her guards again, and held up her flabby breast.  The guards gripped Shego’s hair roughly, and forced her mouth up against Jasmine’s nipple.  Shego struggled for a bit, but a spurt of milk came from the fat princess’s nipple.  Shego, stunned by the taste, began actively suckling, milk flowing down Shego’s throat and into her belly.<br>\r\n<br>\r\n\tJasmine groaned, Shego eagerly suckling milk from her huge, flabby breast.  As she drank, Shego’s body began to bloat out, first her belly and then her butt and breasts inflating, followed by the rest of her becoming incredibly fat.  After a few minutes of drinking and fattening, Jasmine waved the guards off, dragging Shego away from her breast.<br>\r\n<br>\r\n\tShego suckled the air for a moment, briefly lost in the pleasure she gained from the milk.  Then she recovered, noticing her body.  “Whu… What happened…  Why am I so fat?” <br>\r\n<br>\r\n\tJasmine licked her lips and leaned forward, kissing Shego’s flabby face lovingly and licking the blood from her lip.  “My dear girl…  My milk is very fattening.  It makes my meals even tastier.”<br>\r\n<br>\r\n\tShego shook her head, her eyes widening fearfully.  “No… Please… NO!!!”<br>\r\n<br>\r\n\tJasmine licked her lips and opened her jaws wide, the guards shoving Shego’s head into the princess’s maw.  Jasmine groaned softly, her tongue slurping over Shego's face, her throat muscles opening to engulf the superwoman's head.  Shego struggled desperately in the grasp of Jasmine's guards, but her newly fattened body threw off her balance, making it difficult to move.<br>\r\n<br>\r\n\tThe guards gripped Shego's thick, flabby shoulders, working the soft flesh into Jasmine's drooling maw, the gluttonous princess reaching up to fondle the pale-skinned woman’s heavily fattened breasts before gripping them roughly, her jaw stretching painfully wide as she forced them in, Shego screaming in pain.  <br>\r\n<br>\r\n\tJasmine’s throat was incredibly distended, each gulp making it bulge out further and further as she devoured Shego.  The guards lifted Shego until she was almost vertical, making it easy for Jasmine to gulp her down.<br>\r\n<br>\r\n\tAs Jasmine’s lips started to pass over her belly, Shego felt the princess pause.  “Please… Please let me be too big to swallow…” she said, the sound muffled by the fact that her head was down into Jasmine’s chest.  <br>\r\n<br>\r\n\tBut Jasmine just chuckled, the dark-skinned gluttonous princess having her guards push, Shego’s flabby gut forcibly descending into Jasmine’s gullet, her belly starting to bulge as Shego entered into it, the superwoman’s body held tightly by the princess’s throat muscles.  With a slurping pop, Shego’s belly and flabby rump were forced into Jasmine’s grossly distended throat.  The guards let go of Shego’s legs, letting Jasmine finish her off.  Shego’s flabby wriggling legs were sucked comparitively easily into Jasmine’s gullet, a few quick, strong swallows moving the heavily distended bulge Shego made in her chest and throat into Jasmine’s huge, rounded belly.  <br>\r\n<br>\r\n\tSoon only Shego’s chubby feet were in Jasmine’s jaws.  Letting out a muffled laugh, Jasmine reached up and shoved Shego’s feet down her throat.  Jasmine shut her jaws, which were back to normal, and swallowed hard, her flabby gut surging outward as Shego was forced into her gut.  <br>\r\n<br>\r\n\tJasmine belched thunderously, motioning to her guards who began to caress and massage her heavily bloated belly.  Shego screamed in agony, visibly writhing around as Jasmine’s stomach got to work of digesting her flabby form into more fat.  <br>\r\n<br>\r\n\tJasmine belched again, idly playing with one of her breasts as she savored Shego’s dying thrashes.  “Mmmm, so delicious Americans are… You made a splendid sacrifice to Lady Mirage, Shego.  And soon, you shall be no more than fat on my beautiful body.”  <br>\r\n<br>\r\n\t“Hail to you, Princess Jasmine,” the guards massaging her belly said. <br>\r\n<br>\r\n\t“Hail to Lady Mirage, goddess of evil and gluttony,” Jasmine said, laughing viciously. <br>\r\n<br>\r\n\t“Aaaaand… CUT!” said a voice.  <br>\r\n<br>\r\n\tThe guards stopped massaging Jasmine and stood up.  She grinned and kissed them, letting them go change clothes.  Shego stopped struggling, playfully poking Jasmine, who chuckled and sat up in the chair, patting her stomach. <br>\r\n<br>\r\n\t“You’ve been using that cream rinse I reccommended,” Jasmine said, idly rubbing her tremendously fat stomach.  <br>\r\n<br>\r\n\tShego nodded.  “Yeah.  It’s great.  And apparently it makes me taste good, heh,” she shouted, the sound muffled by the layers of fat and flesh surrounding her.  <br>\r\n<br>\r\n\tA skinny man in a director’s outfit came out, smiling.  “Excellent as always, ladies.  And in one take, too!”<br>\r\n<br>\r\n\tJasmine smiled.  “Thanks Manny,” she said.<br>\r\n<br>\r\n\t“Hey Manny!” Shego shouted, pressing her face up against Jasmine’s belly, “When am I gonna get my own series of movies?  I like being eaten, but I like eating even more.  Hell, I even got perfect prey.”  <br>\r\n<br>\r\n\tManny chuckled.  “People like the LOVING Master/Slave relationship Maggie and Tiger have, as opposed to what you have with Bonnie Rockwaller, whom you forced into being your food slave.”<br>\r\n<br>\r\n\tShego laughed.  “So what?  That still doesn’t answer my question.” <br>\r\n<br>\r\n\tManny shook his head.  “The studio heads want to find a dimension with a predish Kim Possible and Ron Stoppable first.  You’re more well known as a villain and the studio heads want to play on that.”  <br>\r\n<br>\r\n\tShego made a razzing noise and relaxed inside Jasmine’s belly.  Manny grinned.<br>\r\n<br>\r\n\t“So what now?  You want Jasmine to bring you back up?  Or go ahead and add yourself to her fat, coming back through the Regen Contract?” he asked.  <br>\r\n<br>\r\n\tShego thought about it, and chuckled.  “Naaah, I’ll just stay here.  That tiger’s an amazing fuck and I wanna spend time with Jaz anyway.”  <br>\r\n<br>\r\n\tJasmine blushed.  <br>\r\n<br>\r\n\tManny chuckled.  “Suit yourself,” he said, “I’ll go get the film on DVD.”  <br>\r\n<br>\r\n\tManny walked away, leaving Jasmine and Shego to relax in the set’s throne. <br>\r\n</span></div></div>",
            "created":1233349320,
            "id":640921,
            "title":"Characters US cartoons and live action shows..."
        },
        "121":{
            "choices":[
                "Follow them into the bedroom",
                "Skip to the next morning",
                "Another studio"
            ],
            "content":"<div class=\"\"><div> <span>The two talked for a bit until Shego eventually passed out and was digested. She reappeared in her dressing room feeling refreshed like she just took a nap. She stretched her arms and legs and looked at herself in the mirror. She wasn't fat anymore and back to her skinny self, a little sad she couldn't keep any of it but as part of the Regen Contract all prey that reformed had to go back to their original form before the shoot. Shego got her stuff and left the dressing room to find Rajah and Jasmine waiting outside, with Jasmine in more comfortable clothes.<br>\r\n<br>\r\n\"Hey thanks for waiting for me. You know you could have just left without me and I would have gone to your house.\" Shego told her.<br>\r\n<br>\r\n\"I know but Rajah didn't want to leave without you.\" Jasmine explained. The large tiger nuzzled Shego's leg affectionately, having bonded with her during the film shootings. \"Besides, the last time I did that you broke into my house instead of using the front door.\"<br>\r\n<br>\r\n\"Old habits die hard. If you're still upset that I walked in on you changing I don't get the big deal. We see each other naked all the time.\" <br>\r\n<br>\r\nJasmine rolled her eyes and reminded Shego, \"C'mon the limo's waiting.\"<br>\r\n<br>\r\n\"Alright, but couldn't you have kept that sexy item you had on set on?\"<br>\r\n<br>\r\nThe two laughed and headed to the limo followed by Rajah. When they arrived at Jasmine's home, the design a lot like her palace, they ate dinner and had some wine while talking about upcoming film roles. Rajah was sitting on the couch with Jasmine after he had devoured one of the cleaning ladies.<br>\r\n<br>\r\n\"So Jasmine, somethings been bugging me for a while. How come you only go for roles where you're in some harem or a sultan. It's kinda.....cliche.\" Shego wondered.<br>\r\n<br>\r\n\"I know but they remind me of home and I get to wear all kinds of skimpy outfits.\" She answered.<br>\r\n<br>\r\n\"We're in vornos, all of our outfits are skimpy and since you're so fat everything you wear is skimpy.\"<br>\r\n<br>\r\nJasmine giggled and drank from her glass. \"I haven't heard any complaints. Besides, in either roles I'm either surrounded by sexy girls or in complete control.\"<br>\r\n<br>\r\n\"Ah. I wish I could be a part of that. In all my movies I've always been a side character, not the star of it.\"<br>\r\n<br>\r\n\"You'll get your chance soon Shego.\" <br>\r\n<br>\r\n\"Yeah right, they are infinite amount of dimensions. Who knows how long it'll take for them to find one where Kim vores people or is willing to be vored.\"<br>\r\n<br>\r\n\"Just give it some time. Besides, at least for the moment we get to work together.\" Jasmine said in a sultry voice.<br>\r\n<br>\r\nShego finished her glass of wine and leered at the princess. \"That is one thing I do enjoy. You and the fur ball over there are the best coworkers a girl could ask for.\" <br>\r\n<br>\r\n\"Well in that case I was hoping you'd like to....rehearse in the bedroom.\" She said teasingly.<br>\r\n<br>\r\nShego smirked and got out of her chair. \"Alright, but I'm on top this time.\"<br>\r\n<br>\r\nThe two giggled and headed to the bedroom with Rajah following behind them eagerly.  </span></div></div>",
            "created":1395337800,
            "id":1763625,
            "title":"Later on, Jasmine and Shego head back to Jasmin..."
        },
        "1212":{
            "choices":[
                "She and Jasmine got the day off",
                "They're needed on set",
                "They found a universe with a preddish Kim and Ron"
            ],
            "content":"<div class=\"\"><div> <span>The next morning, Shego and Jasmine were cuddled together in bed with Rajah sleeping on the floor with a contempt grin on his face. The bedsheets were coated with various cum stains. The trio were exhausted from last night like they usually were. On set, they had to show restraint otherwise they'd get off script. In bed, they were wild. Jasmine and Shego's relationship was...confusing at best. The only way to describe them for the moment was friends with benefits. They were best friends who were attracted to each other but since they were in the vorno business it was hard to tell if it was actual love or just physical attraction. Neither of them were sure so for now they remained friends and if one of them was in the mood the other would gladly pleasure them. <br>\r\n<br>\r\nShego was the first to wake up, her hair a mess and a strap on still attached to her midsection. She took it off and looked at the clock, which read 8:00 am. They weren't needed on set until 10 so she thought about making breakfast. As she got out of bed, Jasmine stirred awake and smiled. \"Leaving so soon?\" She teased.<br>\r\n<br>\r\nShego smirked and said, \"I'm making breakfast. You want me to actually make something or find some prey?\" <br>\r\n<br>\r\nJasmine yawned and burped a little, \"How about some actual food. I'm not ready to swallow someone yet.\"<br>\r\n<br>\r\nShego nodded and headed to the kitchen. While she wasn't the best cook she knew what the princess liked. As she started cooking, her cell phone buzzed and she answered.<br>\r\n<br>\r\n\"Y'ello.\" Shego said. It was Manny and he was calling to tell her that... </span></div></div>",
            "created":1395338460,
            "id":1763630,
            "title":"Skip to the next morning"
        },
        "13":{
            "choices":[
                "Pokemon",
                "Fire Emblem",
                "Sonic",
                "Mario Bros",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay what videogames do you guys want?</span></div></span></div>",
            "created":1548694620,
            "id":2608860,
            "title":"Characters from video games..."
        },
        "132":{
            "choices":[
                "Robin",
                "Camilla",
                "Tharja",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which girl from Fire Emblem do you want?</span></div></span></div>",
            "created":1548694620,
            "id":2608861,
            "title":"Fire Emblem"
        }
    },
    "info":{
        "author_id":"mysterio",
        "author_name":"FFtheSnake",
        "brief_description":"A counterpart to Fat Vornography, this time with a fanfic-style twist...",
        "created":1182627060,
        "description":"<td align=\"left\" class=\"norm\">Okay. The theme of this story is, essentially, that you are playing a character in a pornography studio where weight gain and vore are the primary themes of the videos/DVDs. You can choose to focus on any character, but keep within the general theme of the story.  Remember, this is a mega-crossover.  Moderately OOC behavior is allowed, but nothing too extreme.  <br>\r\n<br>\r\nScat/Watersports is not allowed. Everyone takes special digestives that makes that unnecessary, all right? <br>\r\n<br>\r\nSex is allowed, be it hetero, homo, or whatever. It's a porn studio, so sex is pretty much a given. Beastiality is allowed. <br>\r\n<br>\r\nPregnancy is allowed, as is romance. Some semblance of plot is allowed as well. <br>\r\n<br>\r\nThe youngest characters I'll allow having sex is 16. Any younger and I'll delete the chapter. If you want to have a character that is normally younger than 16 in, have them aged up to 16.  Alright?  <br>\r\n<br>\r\nKeep choice chapters to a minimum, please. <br>\r\n<br>\r\nBut most of all, I want you to have fun. </td>",
        "id":1281052,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1587253440,
        "modified":1587253440,
        "pretty_title":"Fat Fanfiction Vornography"
    }
}