{
    "chapters":{
        "1":{
            "author_id":"shannonchapel",
            "author_name":"Shannon",
            "choices":[
                "If I only knew...",
                "I've got a golden ticket!",
                "Ransom",
                "Repent",
                "Diaphoresis"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\">Choose a prompt and write a story (please keep it to 750 words or less). REMEMBER...after you're finished leave at least 3 prompts for the next guy to choose from.<br>\r\n<br>\r\n<br>\r\n1. If I only knew then what I know now I would have...<br>\r\n<br>\r\n2. You go to visit your elderly aunt, only to find her dead holding a winning lottery ticket. What do you do?<br>\r\n<br>\r\n3. You receive a letter in the mail that reads: \"We have your son. If you ever want to see him alive again do not call the police. We will contact you with further instructions.\"<br>\r\n<br>\r\n4. You're walking down the sidewalk in a large city. You can hear a street preacher shouting from the curb up ahead. You try to pass by quickly, but as you do he reaches out to grab you by the arm and says, \"You only have 30 days to live, my brother. Repent!\"<br>\r\n<br>\r\n5. You wake drenched in sweat. You feel as if someone is watching you. Suddenly from the corner of your eye you see someone approaching from the corner of the room. He's holding a...<br>\r\n<br>\r\n</font></span></span></div></div>",
            "created":1171515600,
            "id":382473,
            "title":"Chapter One"
        },
        "11":{
            "choices":[
                "If I only knew...",
                "It can talk?!",
                "Two by two, hands of blue...",
                "No one understands me!"
            ],
            "content":"<div class=\"\"><div> <span>           If I only knew then what I know now I would have spent more time eating pomegranates.  It is so strange how we miss what we least expect.  When I was preparing to leave I thought I would miss the sunshine on my skin, or the feeling of a planet pulling me down.  And I do miss these things, in a simple, expected way.  I didn't think that I would miss the sometimes frustrating experience of prying apart the red edged, white flesh of a pomegranate fresh from the tree.  No matter how careful I was,  a few seeds always burst and sprayed red juice everywhere.  It stained my shirt, stung my eyes, and generally made a mess of things.  Then I would pry each little seed, more pit than fruit, and crunch on them.  They were always a deep ruby red, tart, and astringent.  We lived in a climate warm enough for the bush to grow, and too cold to have sweet fruit.  So now I am here, looking down on the planet where I was born, loved, grew up, bore a child and then buried him.  I can see more stars than I could ever have imagined, and I float about, without orientation or resistance.  It is a brave new world, a new frontier, an exciting adventure, and all I can think about is that wonderfully tart explosion of juice in my mouth as I bite into a dozen pomegranate seeds.<br>\r\n<br>\r\nOld prompt:<br>\r\nIf I only knew...what is your story based on this prompt?  <br>\r\n<br>\r\n<br>\r\nNew prompts:<br>\r\nIf your pet (or potted plant) could talk, what would they say?  Would they like you?<br>\r\n<br>\r\nTwo by two, hands of blue...What does this line invoke in you?  (no it is not mine, it is a quote from a TV show I like.)<br>\r\n<br>\r\nNo one understands me!...write a story where this is said by one of the characters.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1220331600,
            "id":577490,
            "title":"If I only knew..."
        },
        "111":{
            "author_id":"lilithmoon",
            "author_name":"Lilithmoon☽",
            "choices":[
                "If I only knew... ",
                "What would you do if you won a billion dollars? ",
                "What if... "
            ],
            "content":"<div class=\"\"><div> <span>If I only knew I would be running for my life today I would have taken the car. <br>\r\n<br>\r\nIf I only knew it was Z-day I definitely would NOT  have hid in the cemetery. <br>\r\n<br>\r\nAnd I couldn't help but thinking to myself as my dead mother came lumbering towards me. If I only knew the dead would rise from their graves I would have had mom cremated. </span></div></div>",
            "created":1333167600,
            "id":1306361,
            "title":"If I only knew..."
        },
        "1112":{
            "author_id":"lilithmoon",
            "author_name":"Lilithmoon☽",
            "choices":[
                "Write about your dream job.",
                "Write a story about friends. ",
                "Write about whatever you want. "
            ],
            "content":"<div class=\"\"><div> <span>I would buy the best health insurance available, get a doctor and get healthy. I would provide for all my family and friends. I would buy a beautiful home on some wooded land with a lake (which I would stock with all types of fish) they I would buy a boat and go fishing on my lake. <br>\r\n<br>\r\nI would travel the world experiencing new cultures and lands. I would take my grand daughter and husband on a photo safari in Africa. I would eat Sushi in Japan. I would visit Loch Ness and look for the monster. I would study with the Dali Lama. <br>\r\n<br>\r\nI would buy a RV and travel the United States. I would visit Mount Rushmore. I would visit the Grand Canyon. I would visit the Smithsonian. I would camp in Yosemite. I would visit Yellowstone. I would visit Time Square. I would fish the Great Lakes. I would pan for gold in Alaska. I would spend a week at Disney World. <br>\r\n<br>\r\nAnd last but not least I would want to start a business. I would buy my husband a restaurant that he would run for the needy. I would start a movie production company for myself.  </span></div></div>",
            "created":1333170720,
            "id":1306397,
            "title":"What would you do if you won a billion dollars? "
        },
        "112":{
            "author_id":"falguni",
            "author_name":"Humming Bird",
            "choices":[
                "How did the parrots gave their owner company?",
                "What is the biggest blessing of your life? ",
                "What would you do if you had to change your life with someone else?"
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cred\"><b> I just simply couldn't believe my ears....My Raja and Rani, my beloved parrots can actually talk! At first, both of them accused me, threw a few curses at me for keeping them confined in cages for ages. <br>\r\n<br>\r\nJust then, I unlatched the cage door to let them go out. Surprisingly, they didn't go out of the room, they just flew to the nearest mango tree to get some rest.<br>\r\n<br>\r\nYou've taken very good care of us, so we'd never leave you. They said in unison.</b></span>  </span></div></div>",
            "created":1333388100,
            "id":1307955,
            "title":"It can talk?!"
        },
        "113":{
            "author_id":"nfdarbe",
            "author_name":"Prosperous Snow",
            "choices":[
                "I don't want to go home...",
                "Where are my pet rocks?",
                "We missed the space shuttle..."
            ],
            "content":"<div class=\"\"><div> <span>Two by two, hands of blue<br>\r\nwe walk together through the snow<br>\r\nshivering as the north winds blow.<br>\r\n<br>\r\n\"What are you doing,\" he said reaching over to stroke my right hand and knocking the pen to the table.<br>\r\n<br>\r\n\"I'm writing a poem,\" I picked up the pen with my left hand and continued to write.<br>\r\n<br>\r\n'Why?\"<br>\r\n<br>\r\n\"Because your hands inspired me.\"<br>\r\n<br>\r\n\"How did...\" he looked down at his hands. \"Oh!\" He hid his hands under the table. \"Please, don't say anything about this to anyone!\"<br>\r\n<br>\r\n\"Only if you tell me why your hands are blue.\" I look down at my hand to see it turning blue. \"Why is my hand turning blue?\"<br>\r\n<br>\r\n\"Because I'm an alien and I love you.\"<br>\r\n<br>\r\n\"I suppose that makes as much sense as anything else,\" I laughed. \"You are the weirder then me, which explains why I love you.\"<br>\r\n<br>\r\n\"Then can we..\"<br>\r\n<br>\r\n\"Not until you meet my  parents!\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1409695860,
            "id":1851462,
            "title":"Two by two, hands of blue..."
        },
        "114":{
            "author_id":"lilithmoon",
            "author_name":"Lilithmoon☽",
            "choices":[
                "Write about love. ",
                "Write about fear. ",
                "Write about your dreams. "
            ],
            "content":"<div class=\"\"><div> <span>No one understands me. No one understands my sick sense of humor. No one understands that I make jokes when I am scared or nervous. No one understands that I use sarcasm as a defense mechanism. No one understands that I make others laugh trying to fit in. No one understands that I would rather have people laugh at me than hate me. No one understands that I even make fun of the things I like. No one understands that I laugh to keep from crying. </span></div></div>",
            "created":1333168200,
            "id":1306367,
            "title":"No one understands me!"
        },
        "1141":{
            "author_id":"six2s",
            "author_name":"symmetryrocks!",
            "choices":[
                "Congrats! You are an extra in a movie!",
                "You get to meet your favorite celebrity.",
                "\"I'm so sorry I did'nt tell you...can you ever forgive me?\""
            ],
            "content":"<div class=\"\"><div> <span>Love?<br>\r\nLove is the most peculiar emotion there is. It's different for everyone. For some people it gives them the sensation of walking on air. Light, carefree, and content. For others, it makes them sick. It triggers every nerve in the body, activating feelings of anxiety and fear. In my own opinion, love is a horrible , twisted emotion. Love is nothing but a manipulating force. Love is for the weak. Love is for the ordinary.</span></div></div>",
            "created":1409167440,
            "id":1848203,
            "title":"Write about love. "
        },
        "1142":{
            "author_id":"six2s",
            "author_name":"symmetryrocks!",
            "choices":[
                "I thought you were my friend",
                "Class",
                "Super heroes "
            ],
            "content":"<div class=\"\"><div> <span>    My lungs burn, my muscles ache, my head pounds, everything inside of me begs me to stop. But I can't, can't stop running. If I stop, I die. <br>\r\n    I feet the intense stinging over and over as twig after twig snaps into my skin, as thorns tear at my bleeding flesh, but I keep going. I want to glance behind me, but I don't dare. I can hear him behind me, hear his heavy breathe and his gentle, yet quick footsteps on the leaves behind me, counteracting my heavy, crashing ones. He has the home field advantage, he knows these woods, I do not.<br>\r\n    I realize it too late. I had been too preoccupied with the thoughts of the man behind me that my mind never registered the sound of rushing water ahead. If I was smart I would have turned, started running left or even right, anywhere that would put distance between me and him. But I'm not, I hesitate, just long enough for him to catch up.<br>\r\n    Within a second I can feel his strong arm wrapping around my throat, squeezing tight, but not tight enough so that I can't breathe. He doesn't want to kill me yet, he wants me to suffer. <br>\r\n    \"You saw to much,\" comes his quiet, sinister whisper. He chuckles softly, then gradually his chuckle gets louder and turns into a hysterical fit of laughter. \"and now you're gonna pay.\"<br>\r\n     It dawns on me that this amuses him. It was fun, it was sport, he loves it. He doesn't want it to end too quickly. I close my eyes, bracing myself for the hours of terror that are to come before I will finally be given the privilege of taking my last breathe. I feel the sharp sting of a knife blade as it is pressed against my stomach. <br>\r\n       I feel my heartbeat quicken, I can hear it thudding in my ears, pounding against my head. I feel sick to my stomach, I just want to collapse and throw up and pass out right there at the same time. <br>\r\n      This is it. There is nothing beyond this. I had thought that I had felt this emotion before, but no, whatever I had felt before were just mere imitations of the real thing. This is shear terror. This is true fear.<br>\r\n<br>\r\n<br>\r\n<br>\r\n1. I couldn't hold back anymore, \"I thought you were my friend!\" I shouted.<br>\r\n2. I sat in the classroom, staring at the board. <br>\r\n3. It's not MY fault that my parents are super heroes</span></div></div>",
            "created":1396216140,
            "id":1770753,
            "title":"Write about fear. "
        },
        "12":{
            "author_id":"sharonscribe",
            "author_name":"sharonscribe",
            "choices":[
                "I'll use the money for things I know you would enjoy.\"",
                "The ambulance screams up the street.  I walk out the door to meet it."
            ],
            "content":"<div class=\"\"><div> <span>\"Aunt Clara?  Aunt Clara!\"<br>\r\n<br>\r\nI shake her by the shoulder by she doesn't respond.  I see the lottery ticket in her hand and carefully extract it from her stiff fingers.  Lying on the sofa next to Aunt Clara is today's paper listing the winning lottery numbers.  Just for kicks, I compare the numbers on the ticket to the  paper.  It looks like they all match.<br>\r\n<br>\r\n\"They all match!  Whoo-hoo!\"<br>\r\n<br>\r\nI stuff the ticket in my back pocket, roll up the paper and stuff it under my arm as I head to the kitchen to call the paramedics.<br>\r\n<br>\r\nWhile I wait for the ambulance, I sit next to Clara.  Suddenly it hits me that my aunt is dead.<br>\r\n<br>\r\n\"Oh, Aunt Clara.  I'm so sorry you aren't here to enjoy this wonderful occasion.\"</span></div></div>",
            "created":1205816400,
            "id":510402,
            "title":"I've got a golden ticket!"
        },
        "121":{
            "choices":[
                "a giant Finds a tiny island",
                "What whould you do if you had the powers of spider-man",
                "You wake up  as your favrite Anime Charter"
            ],
            "content":"<div class=\"\"><div> <span>\"I-I WON!!\" i screamed, i hold the winning loto ticket in my hand, i won  the largest prize, a zilllion dallors!!<br>\r\nbut what to do?<br>\r\n<br>\r\n<br>\r\nJust then, i saw  a bunch of poor abandon, orphens,and animals. \"Hey, you!!!\" i shouted. the little kids turned toward me, and i bought them a huge house,  a few callage funds, and a home, for them.<br>\r\n<br>\r\n<br>\r\nwhat happends next?</span></div></div>",
            "created":1220331600,
            "id":577772,
            "title":"I'll Use this money, for your benifit"
        },
        "1211":{
            "choices":[
                "You're skydiving when the parachute malfunctions",
                "You are exploring an area that no one has explored before",
                "You are having a sword duel"
            ],
            "content":"<div class=\"\"><div> <span>I tower above a vast blue ocean, flat and clear. I'm so high up that I can see the horizon. Looking up, I can see the flat overcast clouds above me, and the sun shining through. It's a beautiful day. Well, for me at least.<br>\r\n<br>\r\nI take a step forward. My foot plunges through the ocean, safely landing on the sea floor. The water only really goes up to my toes anyway. I take a few more steps, the ocean giving way to my unstoppable size. I can't see any fish or anything in the ocean. They must have been scared away from my steps.<br>\r\n<br>\r\nThat's when I see it.<br>\r\n<br>\r\nA small, square, lush green island in the middle of the blue ocean. On top of it is a tree and a house, with a curious yellow man on top of it. It's a small island, but it'll do. I haven't squashed any islands for ages...<br>\r\n<br>\r\nI break into a run and reach the island, in just a few strides. I look down on the island, letting my shadow cover the whole thing. Imagine how that yellow islander must be feeling about now. But I look down, and he curiously hasn't moved at all, his feet anchored to that small patch of green grass on his island. But that doesn't matter. I lift up my giant foot and quickly slam it down on the islan-<br>\r\n<br>\r\nOW!<br>\r\n<br>\r\nI take my foot off the small Lego creation that someone had made. Why did I want to step on it anyway? I step back onto the thick blue carpet. Good thing I didn't destroy too much of that little Lego building. Some kid is still going to be pissed though. I quickly go out of the room and also make sure to turn off the light as I go out. That thing seriously is as bright as the sun.</span></div></div>",
            "created":1330507920,
            "id":1286228,
            "title":"Tiny Island"
        },
        "1212":{
            "author_id":"six2s",
            "author_name":"symmetryrocks!",
            "choices":[
                "You've suddenly been thrown into your favorite book.",
                "One day you find out that you have two twin brothers you never knew about.",
                "You get a text message from an unknown number that reads, \"I'm watching you\""
            ],
            "content":"<div class=\"\"><div> <span>   I shook my head, the last week had been weird for me. I'm not quite sure what had happened to me, but I had I had a feeling that whatever had caused these strange events had originated at my uncle's workplace. He was some kind of scientist, though I wasn't sure exactly what he did, I sure wished now that I had been paying attention when he had talked to me about his job so many times, at the dinner table, picking me up from school, while he was showing me around even! Gosh I was stupid. Unfortunately while he was showing me and my mom around the lab, I had wandered off despite his warnings, and I had managed to find some kind of odd chamber filled with hundreds, maybe even thousands of spiders.<br>\r\n   Now unlike most girls my age I had always found spiders cool, fascinating even. So, naturally I went to go get a closer look. Everything was fine, or so I thought, I had only been in the chamber a few minutes before I heard voices approaching and had to quickly duck out to avoid being caught. It wasn't  until later that night that I had found the small spider bite on my shoulder.<br>\r\n  It looked normal, not infected, not poisonous ,but of course these spiders had been in a LAB, I knew they couldn't be normal. I had panicked at that point, was I sick? Was I going to die? Even if I didn't  Uncle Jason was going to kill me! I couldn't tell him. So my only option was to wait it out and see what happened.<br>\r\n  It was the next day that I noticed the changes, the first incident was when I picked up my Algebra textbook to pack it in my backpack.  When I had tried to let it go, it stuck. The book stuck to my hand! That is so not normal, but after I had pried the book from my hand, I somehow managed to convince myself that it had never happened, it was just my imagination. That worked, for about 2 hours, when it happened again, this time with my English paper. <br>\r\n  Over the next week I noticed significant changes, for instance my sticky fingers, which I had managed to control, I had gotten stronger physically, and more agile, and my newest discovery, I could shoot webs of spider's silk...from my wrists. I know it sounds crazy, but it's true. I haven't told anyone yet, not my mom or uncle. I wasn't sure how. But, there was someone I felt I could talk to, maybe even help.<br>\r\n  Rising in popularity was a new, er, super hero if you will. Some say he works for good, others say he is against us. As for me, I believe that he is on our side, and I wish to help him. He calls himself, spider man.<br>\r\n </span></div></div>",
            "created":1379786460,
            "id":1666797,
            "title":"What whould you do if you had the powers of spi..."
        },
        "1213":{
            "author_id":"six2s",
            "author_name":"symmetryrocks!",
            "choices":[
                "You are running late for somethng when you find a lost child in the streets",
                "A teenage girl shows up at your doorstep claiming that she is your daughter",
                "You wake up one morning and everyone is gone"
            ],
            "content":"<div class=\"\"><div> <span>  I woke up and yawned, stretching my arms high above my head. It took mea moment to realize it but something didn't seem right. I stood up in a hurry, those candles on my dresser, they weren't burning symmetrically!! I hurried to fix them, melting the right one down to the same height and shape as the left. I sighed and admired their beauty for a moment. But something was still wrong.<br>\r\n  \"Hurry up kid we're going to be late!\" I female voice called. I frowned...I knew that voice, vaguely. And..kid? come on I'm 14! I sighed. something was definitely wrong, This body didn't seem like mine. I quickly looked in the mirror to find that instead of the short , auburn haired girl I had been I was now tall with black hair, golden eyes, there were three white stripes on the side of my head and oh yeah...and I was dude! I grinned into the mirror.<br>\r\n \"Hurry up kid!\" I heard the voice again. <br>\r\n  \"Coming Liz\" I shouted back. I had a feeling that it would be an exiting day...I was death the kid.</span></div></div>",
            "created":1375507980,
            "id":1639215,
            "title":"You wake up  as your favrite Anime Charter"
        },
        "13":{
            "content":"<div class=\"\"><div> <span>As I went to the mailbox, I anticipated the usual advertisements and and bills that seem to always find their way into my life. Today, however, was different. As I walked from the box thumbing through the daily paper carnage I was excited by the sight of a hand written letter. As time has passed the hand written letter has become somewhat of a novelty, shared mainly by the elderly, the imprisoned, and those serving in the armed forces. Yet here, I was holding one such letter in my very hand. There was no return address, so I quickly opened the letter hoping to find some unforeseen fortune or perhaps the scribbling of a long lost friend. Instead, I was confronted by these words, \"We have your son. If you ever want to see him alive again do not call the police. We will contact you with further instructions.\"<br>\r\n</span></div></div>",
            "created":1330506360,
            "id":1286223,
            "title":"Ransom"
        },
        "14":{
            "choices":[
                "Jackie and Michael",
                "Elemental Guardians",
                "Dreams"
            ],
            "content":"<div class=\"\"><div> <span>Quietly walking down the sidewalk in a large city, I can hear a street preacher shouting from the curb up ahead. I try to pass by quickly, I'm not in the mood, but as I do he reaches out to grab me by the arm and says, <br>\r\n\"You only have 30 days to live, my daughter. Repent!\" I cringed, shook him off and ran down the street. I finally reached a corner and sharply collapsed into it. I broke down in tears, flooding, was it that obvious, did I really look that ill? Cancer, freaking thing! I can feel my lungs seize up and n't help but cry more. A sudden car stopping makes me look up.<br>\r\n\"Jade?\" He looked down on me and then bent on his knees to my level.<br>\r\n\"Lee? What are you doing here?\" I ask pulling my hat right over my head. <br>\r\n\"Helping so it seems.\"<br>\r\n\"I'm fine, just a stupid street preacher.\"<br>\r\n\"Ah.\" Lee shook his head. <br>\r\n\"Why can't they just leave us alone?\"<br>\r\n\"They're only spreading the word of God.\"<br>\r\n\"Don't you start.\" I laugh as I get up and walk beside Lee. <br>\r\n\"So how've you been?\"<br>\r\n\"Need a cigarette.\"<br>\r\n\"I don't think you should be doing that.\"<br>\r\n\"Why not? According to the word of God I'm not going to be here in thirty days.\" I smirk flirtatiously. I'm nineteen, I shouldn't be here. I should be out having fun but no, God's word be bloody spread!<br>\r\n<br>\r\nAfter Lee walked me back to my house. I became very dizzy and mum and dad helped me up to bed. <br>\r\n\"Thank you.\" I grin as my mum listens to all that happened today. <br>\r\n\"It's okay dear.\"<br>\r\n\"Mum, I think I'm going to go to France when all this is over.\"<br>\r\n\"Really?\" Mum smiles trying to hold back a frantic amount of tears.<br>\r\n\"I'm going to get some rest for now.\" I whisper as I take off my hat to reveal a head without hair, like a foot without toes, a deformity, I loved my hair.<br>\r\n<br>\r\nWhen I awoke Andrew was at my bed side.<br>\r\n\"Hi hunny.\" I blush as I pull my hat over my head, the wool itches. <br>\r\n\"I've seen it all already.\" He mutters removing the hat again.<br>\r\n\"Still embarrassed.\"<br>\r\n\"Don't care.\" He laughs kissing my forehead.<br>\r\n\"You're dumb.\"<br>\r\n\"You're short.\"<br>\r\n\"You have to listen to me I'm ill.\"<br>\r\n\"You have to listen to me I'm your big brother.\"<br>\r\n\"Fine.\" I strop carefully wondering if people could all be like him. Beautifully blatent.<br>\r\n\"Good night.\"<br>\r\n\"I just woke up.\" I smile.\"<br>\r\n\"I know but I have to go take Aneli for a walk in the park so I want you to be asleep when I go.\" Aneli was my brothers daughter, his ex wife's daughter.<br>\r\n\"Okay.\" <br>\r\n<br>\r\nThe final days were the worst. Pain ran all through my body. I was sure Lee came to see me once but then again I was sure of alot of things, like I wouldn't die of cancer...Sad really... <br>\r\n<br>\r\nNew Prompts:<br>\r\n<br>\r\n<br>\r\n+ \"Jackie how could you?\" Michael whispered at his wife's grave. \"I love you.\" <br>\r\n<br>\r\n+ I ran and jumped off the cliff, my arms lifted up into the air like The Elemental Guardian had told me and I flew through the sky.<br>\r\n<br>\r\n+ A little girl sits alone on the playground dreaming of...</span></div></div>",
            "created":1171602000,
            "id":382744,
            "title":"Cancer"
        },
        "141":{
            "author_id":"six2s",
            "author_name":"symmetryrocks!",
            "choices":[
                "Dead Body",
                "Kidnapped",
                "Adopted"
            ],
            "content":"<div class=\"\"><div> <span>   \"Jackie how could you,\" Michael whispered at his wife's grave. \"I love you,\"<br>\r\n   I sat watching from a distance, I wasn't sure what to do, he just hadn't been the same since Jackie had been killed trying to save a group of school children from an insane gunman. She had been a good woman, a great wife, a wonderful sister in law, and if she had lived would would've been an amazing mother.<br>\r\n   It broke my heart every time I thought of my unborn nephew, and especially the fact that Jackie never even knew she was pregnant. They had found out only after she had been pronounced dead last month. <br>\r\n   Since then my older brother Michael had moved back home, he didn't talk much, he sat in the dark all day, sometimes even locking himself in his room.<br>\r\n  I stepped forward. \"Mike?\" I asked gently. His head snapped up, \"go away Sadie,\" he said calmly, his voice choked with tears.<br>\r\n  \"But, Michael-\"<br>\r\n   \"Leave me alone!\" he screamed angrily. He stood up and turned to face me. \"You're just a kid! This is none of your business so just stay out of it!!\" He stormed past me.<br>\r\n  Tears came to my eyes as I watched him walk off. I wish I knew a way to help him. I just wanted my brother back.<br>\r\n<br>\r\n<br>\r\n  New prompts<br>\r\n    1) \"Oh crap what do I do now?\" I muttered, staring down at the body.<br>\r\n    2) I woke up in some kind of cell, tightly bound with a  coil of rope.<br>\r\n    3) \"I cant believe it, why wouldn't they tell me I'm adopted?\"</span></div></div>",
            "created":1379884860,
            "id":1667645,
            "title":"Jackie and Michael"
        },
        "1411":{
            "author_id":"six2s",
            "author_name":"symmetryrocks!",
            "choices":[
                "choice 1",
                "Choice 2",
                "Choice 3"
            ],
            "content":"<div class=\"\"><div> <span>    \"Oh crap, what do I do now?\" I muttered, staring down at the body. It had been an accident. I swear it had been an accident! I looked around, there was no one else in this wing of the school, which was to be expected considering the time of night it was. I looked back down at the body of my English teacher, Mrs. Hagar, who had caught me out of bed just ten minutes ago. Ok, Ok this was easy enough, I'd just take the body out back and bury it in the woods before any one noticed, then I'd slink back to my bed before everyone woke up. I stared down at the heavy rock paperweight in my hand. Is it still murder if it isn't planned?<br>\r\n<br>\r\n<br>\r\nNew prompts<br>\r\n<br>\r\n1) I stared down at the ground below me, not daring to come down<br>\r\n2)  \" I already told you I won't accept the mission!,\" I screamed, slamming my fist down on the desk.<br>\r\n3)I sat in his lap, leaning back into his chest</span></div></div>",
            "created":1393553820,
            "id":1752555,
            "title":"Dead Body"
        },
        "14111":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Choice 1",
                "Choice 2 or 3."
            ],
            "content":"<div class=\"\"><div> <span>\"Come on Jimmy, you have to come down sometime. Mom goes ballistic if we aren't in by five.\" I mentally roll my eyes and resist a snarky comeback. Trust my little sister to worry about being an obedient little angel even when innocent lives hang in the balance. The one I've been sent to save casts me a sympathetic look even as she clings to me for protection. It's clear we're both no stranger to the brat's demanding nature. I stared down at the ground below me,not daring to come down. It always seems so much farther each time I look. As my blood freezes in my vieins, my sister starts whining again and it all becomes too much.<br>\r\n<br>\r\n\"Well excuse me for being afraid of heights!\" I finally snap \"the next time YOUR kitten gets stuck in a tree, YOU can save her!\"<br>\r\nThe three new prompts are:<br>\r\n1. Belching contest with mom<br>\r\n2. Arm wrestling your sister<br>\r\n3. Eating bugs.</span></div></div>",
            "created":1393558560,
            "id":1752588,
            "title":"choice 1"
        },
        "143":{
            "choices":[
                "Brother-in-law...",
                "Confetti..."
            ],
            "content":"<div class=\"\"><div> <span>A little girl sits alone on the playground dreaming of happy things. Memories of laughter and ice cream, her big brother’s warm smile. With a small shiver, she wraps her arms around her bare shoulders. It is cold and dark now. She wonders when they will come to take her home. They always come… eventually. She looks longingly at the swings, heart filled with the memory of flying. The wind in her hair always makes her forget. Reluctantly, she turns away, fingering the blanket around her legs. Daddy says she must always be grateful. Think of those poor dying children in Africa, he says. If she complains he might send her to join them. She forces a smile, they will come soon…<br>\r\n<br>\r\n“Ellie?”<br>\r\n<br>\r\nA soft whisper and she looks up with a grin “Luke!”<br>\r\n<br>\r\nHe kneels, drawing his sister into a warm embrace “They forgot you again, didn’t they?”<br>\r\n<br>\r\nShe shakes her head, a small tear running down her cheek “They will be here soon!”<br>\r\n<br>\r\n“Oh Ellie!” He scoops her up into his arms “Let’s go home.”<br>\r\n<br>\r\nShe glances up at his face, eyes staring into the distance with a furious frown. He sees her wide eyes and melts into a smile, “It’s okay, I’m not mad at you Ellie. I just can’t believe they forgot, again!”<br>\r\n<br>\r\n“They might still come…” she is on the verge of tears, imagining daddy’s yells when he finds an empty playground.<br>\r\n<br>\r\n“It’s nine thirty Ellie!” he snaps. She begins to cry. <br>\r\n<br>\r\n“Hey, sweetie…” he holds her close as she sobs against his chest “you must have been sitting her for hours!”<br>\r\n<br>\r\nShe tries to shake her head again but descends into another wave of sobs. He walks towards his car, rubbing the child’s back. He opens the passenger door and places her in the front seat, gently moving her legs under the dashboard. She is too exhausted to protest though he knows she is frightened. Cars always make her remember. <br>\r\n<br>\r\nHe secures her seat belt with a reassuring smile “I will drive very carefully.”<br>\r\n<br>\r\nShe smiles back, eyes full of trust.<br>\r\n<br>\r\nAs they drive away from the lonely playground she wriggles in her seat, still expecting to see them. Luke fights tears, eyes focused on the road ahead. He wishes he could take her away. She will be okay, he tells himself, but he doesn’t believe it. Giving her back to them is the last thing he wants to do.  Rebellious resolution blooms into fruit as he pulls over, phone in hand.<br>\r\n<br>\r\n“Vicky… honey.” He glances at his tiny sister, already succumbed to sleep “I’m bringing her home with me tonight… Yes… Thank you.”<br>\r\n<br>\r\n<b>New Prompts</b><br>\r\n<br>\r\n1.“It’s my prerogative as your brother-in-law!”<br>\r\n2.We'll have to rethink the confetti…<br>\r\n</span></div></div>",
            "created":1181451600,
            "id":414981,
            "title":"Dreaming alone"
        },
        "15":{
            "author_id":"artemisnw",
            "author_name":"Artemis Savory",
            "choices":[
                "Eric and main character go out for lunch",
                "They \"hang out\" after hours at the Vegan pub",
                "your choice"
            ],
            "content":"<div class=\"\"><div> <span>I awoke drenched in sweat. It felt as if someone was watching me. Suddenly from the corner of my eye I saw someone approaching from the corner of the room. He was holding a small paper bag with a yellow M on the package. I cringed and pressed my back fast against the headboard as he slowly approached, the artificial smell of meal-worm hamburger and salt-drenched fries assaulted my nostrils.  When he was standing only a few feet away, he tossed the bag into the air and it landed next to me on the bed. I rolled onto the other side of the bed and jumped to the floor, grabbing a t-shirt I had thrown down last night and using it to cover my nose and mouth. <br>\r\n  <br>\r\n\"What are you thinking?!\" I shrieked. \"Get that shit OUT OF HERE!\" The person continued to approach me and I slowly backed up until my back hit the wall. The window wasn't far. I tried to inch my way over. The person didn't notice. There was a pencil stuck in the sill. I tried pulling it out to no avail. The person grabbed both of my wrists and raised my arms above my head. He slammed them against the wall and pressed himself against me. I could smell the nasty stench of pre-packaged onions, ketchup, and fake meat on his breath. He was wearing a ski mask so that I couldn't see his face. It wasn't black, but red. As though he hadn't had time to buy something dark to keep himself better hidden.  He pulled something from his pocket. I struggled against the grip he had on me. He was too close for a good knee in the crotch, but too far for a kick. Suddenly he was coming at my mouth with a can of something. A can of--of-- \"Not an ENERGY DRINK! ANYTHING but that!!\" I scrunched my eyes closed and turned my head away, but he brought one hand down, keeping my arms with the other, and forced the sweet, sticky fluid into my mouth. I spit it in his face. Dropping the still-full can on the floor, he ripped off the mask and drove his tongue into my mouth. The taste of rubber chicken and salt came to mind, but something was familiar about the motions.<br>\r\n<br>\r\nHe ran his arms down my sides, squeezing my upper arms and pulling me against him. He pulled away and stared at me. \"Eric! You're back?\" He only smiled and reached for the button of my pants, making me forget all about my vegan breakfast of the morning. How could I have eaten after what he'd put me through? Salt-and-meal-worm morning. </span></div></div>",
            "created":1262235600,
            "id":813461,
            "title":"Diaphoresis"
        },
        "153":{
            "author_id":"artemisnw",
            "author_name":"Artemis Savory",
            "choices":[
                "Roses",
                "Alcoholics Anonymous",
                "Kiss a frog"
            ],
            "content":"<div class=\"\"><div> <span>oops...<br>\r\n<br>\r\nMy prompts for you!:<br>\r\n<br>\r\n1. A person is standing at your door with a bouqet of roses. He/she tells you rose buds have iron and they're good for a woman going through her period. But you aren't a woman. What are you (don't blantantly say it: SHOW it) and what do you say/do?<br>\r\n<br>\r\n2. You are dating this person that you totally like, maybe almost love. He/she goes to \"meetings\" they say. He/she invites you to one and you go. What you see is a bunch of strung-out people telling their stories and crying. What do you do? Do you love this person enough to survive with this?<br>\r\n<br>\r\n3. You're high/drunk/tired/dreaming/etc. and kiss a frog. When you're conscious, it's a person. Tell this story. </span></div></div>",
            "created":1262275260,
            "id":813464,
            "title":"your choice"
        }
    },
    "info":{
        "author_id":"shannonchapel",
        "author_name":"Shannon",
        "brief_description":"An interactive writing promt exercise. Choose a prompt, then create prompts for others.",
        "created":1171539660,
        "description":"<td align=\"left\" class=\"norm\"><span style=\"font-family:times new roman, serif\"><font class=\"size4\" style=\"\">I will start this exercise by creating several writing prompts from which you, dear reader, will choose one to write about. <br>\r\n<br>\r\nAfter you choose your prompt, write a story (please keep it to 750 words or less).  When you're finished, create at least 3 prompts for others to choose from. <br>\r\n<br>\r\nThis will be a great resource for all of us, with potentially hundreds...maybe even thousands of prompts to choose from.</font></span></td>",
        "id":1218333,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1409700960,
        "modified":1409700960,
        "pretty_title":"Pay It Forward"
    }
}