{
    "chapters":{
        "1":{
            "author_id":"brianuk",
            "author_name":"briankuk",
            "choices":[
                "put you in her shoes and put it",
                "eat you to see what it like to eat u and keep you in there for a day",
                "put you down her bra and get you to rub her breast",
                "put you down her pantiess then walk around the house"
            ],
            "content":"<div class=\"\"><div> <span>three years ago you was give the power to shrink to any size you want and it was a year on that Kate found out your secret when she walked in your room and saw you shrink and that was also when you found out that you can't die if you'll tiny when she stepped on you.<br>\r\n<br>\r\nyou are at your Kate and Jack's home where they said you  can stay for a week as Jack is going away for his job.<br>\r\n<br>\r\nyou and Kate was chatting for about a hour when she asked if you can shrink so you two can have some fun so you shrink to 3 inches then Kate picked you.<br>\r\n<br>\r\nwhat did she do   </span></div></div>",
            "created":1171342800,
            "id":382020,
            "title":"giantess Kate"
        },
        "11":{
            "author_name":"Anonymous",
            "choices":[
                "Ask if she wants a foot massage",
                "Demand that she continue",
                "Do something else, somewhere else."
            ],
            "content":"<div class=\"\"><div> <span> \"How about you put me in yor shoes?\" you say. She smiles playfully and puts her left foot to her right heel; she slips the left shoe off and repeats. Then she slides both her shoes to you.<br>\r\n \"Bare, or socked?\" she asks. You think a little, and say \"Bare.\" She put her feet in front of you and says \"You do the honors.\"<br>\r\n Trembling, you slide her socks off, and rub a shaky hand against the side of her left. Then, already sporting a large boner, you scale the walls of her shoes and fall inside with a thud. Instantly you're excited by the smell of her feet, and nestle yourself in the toe section.<br>\r\n \"Ready?\" she asks.<br>\r\n \"Ready as ever,\" you shout back.<br>\r\n She slips her foot inside, and it slowly draws nearer. Then in a flash you're between her big and second toe.<br>\r\n \"Comfy?\" she calls.<br>\r\n \"Heavenly,\" you respond. Her toes rise and fall: you creep underneath her soles and lay in euphoria. Then she stands and walks around. This continues for some while until you realise you've been in her shoes for hours. Her foot comes out of the shoe, and you clamber out.<br>\r\n \"Sorry George,\" she says, \"but my feet are killing me.\"<br>\r\n You begin to get ideas. . .</span></div></div>",
            "created":1183352400,
            "id":422131,
            "title":"In the Leather"
        },
        "111":{
            "author_id":"loco18",
            "author_name":"ale",
            "content":"<div class=\"\"><div> <span>you got an idea ...\"how about i give you a foot massage\" you said...she excited answers \"at ur size?....sure\"....she then slides both foot's off her shoes...and put them next to you....\"are you ready?\"..she ask...and u answer..\"sure...here i come\".....\"how am i doing it?\"  you ask and she answers \"very good ...like a pro...thank you...you earn your stay in my shoes....down my feet's..hehehe\"....she then slips her foot inside her shoe with you in her shoe...and ask you...\"are you comfy down there....cuz ull spend the rest of ur life there\".....The End</span></div></div>",
            "created":1195880400,
            "id":468560,
            "title":"Ask if she wants a foot massage"
        },
        "113":{
            "author_id":"wtk55",
            "author_name":"Corvus",
            "choices":[
                "Socks",
                "Panties",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where do you want to be now?</span></div></span></div>",
            "created":1281934800,
            "id":937513,
            "title":"Do something else, somewhere else."
        },
        "1131":{
            "author_id":"wtk55",
            "author_name":"Corvus",
            "choices":[
                "1 inch",
                "Half an inch ",
                "1 cm"
            ],
            "content":"<div class=\"\"><div> <span>you ask kate if she can put you in her socks now. \"but my feet still hurt\" she says.<br>\r\n\"what if i shrink more so i can be in heaven and your feet wont hurt\" you suggest. \"hmm....well, that sounds good!\" kate says with a smile.<br>\r\nso you start to shrink too...</span></div></div>",
            "created":1296277200,
            "id":1044005,
            "title":"Socks"
        },
        "1132":{
            "author_id":"wtk55",
            "author_name":"Corvus",
            "choices":[
                "front",
                "back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which side?</span></div></span></div>",
            "created":1296277200,
            "id":1044008,
            "title":"Panties"
        },
        "11321":{
            "author_id":"asanovasan",
            "author_name":"AsanAsanov",
            "choices":[
                "Да",
                "Может перейдём в другое место?"
            ],
            "content":"<div class=\"\"><div> <span>) хорошо ), Кейт натягивает свои трусы и аккуратно \"бросает\" вас туда.Вы упали. Вы трогаете её киску. Кейт улыбается. Хихихи.<br>\r\nОна закрывает трусики и оставляет вас там в темноте.Вы чувствуете из её киски странный запах. Позже вы понимаете что это запах мочи.<br>\r\n-Мне надо в туалет.Говорит Кейт. Она идёт в туалет.Открывает трусы. Вы боитесь упасть, поэтому крепко держитесь за трусы.Наконец Кейт пописела и закрывает трус, она выходит из туалета.<br>\r\n-Всё хорошо?. Спрашивает она.</span></div></div>",
            "created":1585312800,
            "id":2808261,
            "title":"front"
        },
        "11322":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "long loud farts",
                "wet and loud gass with a chance of metor sized shit"
            ],
            "content":"<div class=\"\"><div> <span>You climb up her leg and climb into the back of her panties you get nice and close to her arse hole and started kissing and rubbing it untill she said \"be careful\" and soon you found out why her arse hole slightly opened and you felt a gus of warm moisr air shortly followed with a <br>\r\nsmell that to you smelt increadable but to everyone else it smelt the oposite.<br>\r\n\"oh exscuse me, he I told you to be careful<br>\r\n and oh whats this I suddenly feel poking in my butt? Has a little one got excited? Well theres plenty more where that come from\" and with that she relised more silent but deadlies<br>\r\nuntill she felt a big gass bundle heading down.</span></div></div>",
            "created":1427691600,
            "id":1956200,
            "title":"silent gass attack"
        },
        "1133":{
            "author_id":"wtk55",
            "author_name":"Corvus",
            "choices":[
                "Bra",
                "Mouth",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else?</span></div></span></div>",
            "created":1281934800,
            "id":937514,
            "title":"Other"
        },
        "11333":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "yes",
                "other options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a \"play date?\" with Alice?</span></div></span></div>",
            "created":1344920400,
            "id":1404840,
            "title":"Reader's Choice"
        },
        "113331":{
            "author_id":"trippy321",
            "author_name":"Sam",
            "choices":[
                "Why not?",
                "No that's cruel"
            ],
            "content":"<div class=\"\"><div> <span>You and Katie walk over to Alice's crib and Katie says \"I've got an Idea,\" She lifts Alice from the baby crib and begins to remove Alice's diaper even though it's still clean. Alice wakes to this wondering why she was removing her diaper even though it was still clean. Katie then says I want you to crawl into Alice and teach her sexsual pleasure\" you think about it for a moment and you thought</span></div></div>",
            "created":1380690000,
            "id":1673417,
            "title":"Pleasureful playdate"
        },
        "1133311":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "Keep crawling deeper.",
                "Rub the walls.",
                "Try to escape."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size45\" style=\"\">Katie placed you and Alice in the crib together while Alice was still a bit dazed from being woken, taking your chance you walked up to Alice's pussy and slowly parted the lips, the insides were warm and soft and not wasting another second you began to crawl inside, Alice didn't sound like she was in pain though she was letting out the occasional moan, you continued crawling deeper inside till no light could reach you and as you looked back you noticed how the entrance had closed behind you.</font></span></div></div>",
            "created":1571354160,
            "id":2734574,
            "title":"Why not?"
        },
        "12":{
            "author_name":"demonfox",
            "choices":[
                "decide to wait a while youll get there eventually",
                "crawl through her body to the light at the end of the tunnel"
            ],
            "content":"<div class=\"\"><div> <span>she lifts you high into the air, then with a wicked grin opens her mouth and slurps you in, strangely your eyes adust to the pitch black, even without light you see like its bright. then in a rush her tongue moves up to the roof of her mouth and you're pushed to the back of her troat, and down further, slipping into the depths of her body. you slide wetly down her troat and land with a plop in her stomach. 'well what now?' you think...</span></div></div>",
            "created":1173157200,
            "id":387284,
            "title":"down the hatch"
        },
        "121":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "She puked you up,",
                "You moved into her intestines,",
                "She started drinking coke,"
            ],
            "content":"<div class=\"\"><div> <span>You decided to wait in Kate's belly, 'How bad could it be?' you thought, but that thought was quickly interrupted when you heard  Kate letting out a small cute burp, however from your position it sounded much louder, but you still liked it, \"Excuse me,\" she said with her hand over her mouth and rosy cheeks, \"Must of been something I recently ate.\" Kate giggled at this as she uncovered her mouth, lifted up her top and started rubbing and patting her smooth silk belly.<br>\r\n\"What did I recently devour?\" Kate said in a mocking tone, \"I think it was a tiny piece of meat, but not any normal type of meat.\" She paused \"Oh yes I remember now, I ate you, now didn't I George.\" She started laughing then she poked at her belly. \"Can you feel that? Huh?\" She teased before continuing to rub her belly in both satisfaction and pleasure. <br>\r\n<br>\r\nJust then...</span></div></div>",
            "created":1447707120,
            "id":2063114,
            "title":"Teasing the food."
        },
        "1212":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "Pushed the button,",
                "Decided against it,",
                "Readers choice."
            ],
            "content":"<div class=\"\"><div> <span>You travell through her intestines as Kate continued to rub her belly, not till two hours later did you see the outside world, on your way out, you was pushed by her other recently devoured items, you and the log fell out into the toilet bowl, when Kate was finnished she hesitated as she looked down apon you standing on her waste.<br>\r\n\"Should I? Should I not?\" Kate said confusing your tiny mind,<br>\r\n\" you should or shouldn't what?\" You asked, Kate grinned and said, <br>\r\n\"I am thinking about flushing you!\"<br>\r\n\"What!?\"<br>\r\n\"You heard me, I may flush you as I would flush any organic thing that is pushed out of my ass.\" Kate then slowly moved her hand towards the flush button on the top of the toilet box. You silently whatched in fear, you asked yourself all kinds of questions, what would happen if she did flush me? Where would I go? Would I be stuck in the sewage system for a while? <br>\r\nFinally Kate,</span></div></div>",
            "created":1449768300,
            "id":2072761,
            "title":"You moved into her intestines,"
        },
        "12122":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "Wait",
                "Try to move"
            ],
            "content":"<div class=\"\"><div> <span>Kate took you out hesitantly before washing you up in the bathroom sink. Once you were clean Kate took you in to her living room and threw you on to the sofa before showing you her perfect ass. Looking up at the goddesses beautiful rear, you couldn't wait for it to descend upon you. Finally it did, Kate sat down right on top of you as you found yourself under the crack. Kate relaxed on you as she watched some tv. <br>\r\nIn your current position you could move slightly. Although this movement may just result in going deeper into her crack and maybe even right up inside her ass hole. That does sound nice however. <br>\r\nIn the end you decide to </span></div></div>",
            "created":1468112880,
            "id":2177785,
            "title":"Decided against it,"
        },
        "121222":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "You get pulled into her asshole",
                "You are stuck there"
            ],
            "content":"<div class=\"\"><div> <span>You struggled around under her beautiful ass, trying to find a way to make yourself more comfortable. You could feel yourself worming deeper into her ass, and the heat around you grew more intense, ass did the smell of crap.  Soon your hand pushed against wrinkled skin, and slipped into some kind of sphincter. </span></div></div>",
            "created":1494876300,
            "id":2319907,
            "title":"Try to move"
        },
        "122":{
            "author_name":"demonfox",
            "choices":[
                "fall into the water and drown (unless she fishes you out!)",
                "or sclae her pussy lips and plunge into the warm folds of her most intimate of p"
            ],
            "content":"<div class=\"\"><div> <span>you crawl through the convolute twists and turns of her insides for what seems like foreverbefore your head bumps  into somthing. you look up and see the goal of your labour, her asshole! you push your arms out and feel her legs moving together and realize shes running and she squeezes her ass cheeks together holding you half in and half out. then the pressure releases and you see, to you horror, the toilet bowl!' theres only 2 options here...' you think to yourself</span></div></div>",
            "created":1173157200,
            "id":387285,
            "title":"out of the dark"
        },
        "1221":{
            "author_id":"tgaetani",
            "author_name":"ggjftyu",
            "choices":[
                "She has butt sex",
                "She changes her mind and leaves you there for the time being"
            ],
            "content":"<div class=\"\"><div> <span>She catches this and rethinks and squeezes her ass together again. You try your best to move past the sphincter's powerful muscles, but something unusual happens. Your body and her butt hole seem to fuse together, as your legs disappear and pretty soon your arms too. Your torso seems to separate into the walls of her anus, leaving only your head as the sole exit of her body. She notices this and says, \"Well, isn't that funny? This ought to be fun. Now we can be together forever.\" She tries you out for the first time, and feeling sick you think you're going to throw up. But, as your mouth opens, a heaping pile of shit comes out and lands in the toilet below you. You think to yourself, is this how I'm going to spend the rest of my life? You hear her speak again, \"Well, that was nice, but I wonder how anal sex would work?\" You quiver..</span></div></div>",
            "created":1198472400,
            "id":479172,
            "title":"Becoming one with Kate... Literally"
        },
        "13":{
            "author_id":"brianuk",
            "author_name":"briankuk",
            "choices":[
                "sleep in kate bra with her still wearing it",
                "be  in between kate's cleavage as she rub her boobs together"
            ],
            "content":"<div class=\"\"><div> <span>when you shrunk yourself to a small doll size, kate started to underbutton her shirt and when she was done, you was staring at the most biggest boobs you'll have seen to see kate reaches out for you.<br>\r\n<br>\r\nkate look at you then said if like my nice breasts you can rub them for me, you looks up at kate and say uh...ok so you touches her breast and rubbing her nipple and when you was done you started on her other nipple then you say wow you have the prefect breast.... they so prefect that in would sleep in your bra.<br>\r\n<br>\r\nkate told you, where you did a good job she let you sleep in her bra with it still on or she could put you in between cleavage and rub her boobs together</span></div></div>",
            "created":1183006800,
            "id":421191,
            "title":"giant boobies"
        },
        "131":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "You were in the exact same place that you had fallen asleep.",
                "Still on her bra that is on her bed.",
                "in the _______ of her panties."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kate picked you up and positioned you right where her nipple would be on her bra before using tape to keep you nice and secure and then putting the bra on.<br>\r\nIt did not take long till you had fallen asleep but when you woke up...</span></div></span></div>",
            "created":1448156280,
            "id":2065171,
            "title":"sleep in kate bra with her still wearing it"
        },
        "1311":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "There's milk!",
                "She take's you out of her bra.",
                "You slip inside her nipple and get stuck in her breast."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size45\" style=\"\">When you woke up you noticed how Katie was still going about her day like normal, you weren't sure how long it had been but you sure were hungry, you tried getting her attention but all you got in return was a giggle from Katie and suddenly an idea came to mind, Katie only gave birth 3 years ago, if you're lucky she may still be lactating or at least it wouldn't be that hard to induce lactation again, with this in mind you aligned yourself with her nipple and tried to latch on.</font></span></div></div>",
            "created":1571354820,
            "id":2734577,
            "title":"You were in the exact same place"
        },
        "132":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "She has had enough fun with you, and lets you grow back to normal again.",
                "She requests that you to stay small and massage her feet now.",
                "She requests that you to stay small and spend some time playing with Alice."
            ],
            "content":"<div class=\"\"><div> <span>\"Okay Kate, how about we do the second one. It's not like I have to worry about being crushed or anything, after all.\"<br>\r\n<br>\r\n\"Alright then little bro, you just relax and leave everything to me.\" Kate said with a cheerful smile.<br>\r\n<br>\r\nYou simply sit back as your giantess sister-in-law plucks you up between her thumb and index finger. She then moves you over to the massive valley of her cleavage and drops you in between her huge boobs. As you felt yourself being surrounded by Kate's massive mounds, you couldn't help but feel incredibly aroused. Seeing the tiny erection beginning to form in your pants, Kate simply giggled at you.<br>\r\n<br>\r\n\"So little bro, it seems like you <i>and</i> your little friend are having a lot fun down there.\"<br>\r\n<br>\r\nYou begin to blush as you move your hands to cover your crotch, witch only makes your giantess sister-in-law giggle even more.<br>\r\n<br>\r\n\"Yeah Kat, it's really nice. Like I said, your boobs are perfect...\" you say, trying to hide your embarrassment.<br>\r\n<br>\r\n\"Well then, I just know that you're going to love this.\"<br>\r\n<br>\r\nAnd just like that, Kate took one of her massive fleshy orbs in each hand before proceeding to press them together. You could feel a relaxing warmth of in her cleavage as her massive breasts squeezed your tiny form. Your sister's boobs had a firm hold on your body, and you were inescapably clamped between the enormous mountains of feminine flesh. To any normal person, this amount of pressure would have been enough to make their body pop like a grape. However, your body was immune to pain as long as you remained small. Instead of the agony of being crushed, the only thing you felt was an incredible amount of pleasure. Your sister's globes kneaded your miniature body between them, and the soft flesh squeezing your body from all sides put you in absolute heaven.<br>\r\n<br>\r\nThis went on for another 30 minutes, and you could tell that Kate was enjoying this just as much as you were. It was obvious that she loved playing with you between her breasts just as much as you loved being played with by them. By the time she finally finished, Kate laid back and allowed you to crawl out from her massive cleavage. Looking up at her with a smile, you decided to see if there was anything else that she wanted of you before you returned to normal size.<br>\r\n<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\n</span></div></div>",
            "created":1311656400,
            "id":1155532,
            "title":"Boob smothered by your sister-in-law"
        },
        "1323":{
            "author_id":"brianuk",
            "author_name":"briankuk",
            "choices":[
                "you two play with the plays ",
                "you play dress up with the dolls",
                "after a hour Kate called up bed time"
            ],
            "content":"<div class=\"\"><div> <span>you walk in to Alice's room at the same size as a kent doll, you could see she was sitting on her bed looking at kids book, she was wearing a night dress that with to her knees.<br>\r\n<br>\r\nAlice thought she heard something coming in her room so she looked over and saw you standing by the door t with a smile on your face, Alice knew it was you and she was always happy to see you when you would come round when her dad wasn't around you would shrunk for her, she would dress up with you as the doll sometime or have you play in her toys.<br>\r\n<br>\r\nAlice got off her bed and walked up to you, as she stopped by you with her feet next to you which you could see she was also wearing a diaper, Alice picked you up and put you on her bed then she went get some toys and dolls to play.<br>\r\n<br>\r\n </span></div></div>",
            "created":1407387600,
            "id":1838723,
            "title":"She requests that you to stay small and spend s..."
        },
        "13233":{
            "author_id":"brianuk",
            "author_name":"briankuk",
            "choices":[
                "her doll house ",
                "in her diaper "
            ],
            "content":"<div class=\"\"><div> <span>after you two was playing you hear Kate say it was bed time, being the good girl she was, Alice picked up her toys and dolls to put away, Alice wanted to play with you more.<br>\r\n<br>\r\nas you was watching Alice put her toys away, you remembered one time when she wasn't looking what she was doing and put you away with her toys in the toy box and you was in there for an hour.<br>\r\n<br>\r\nAlice walked back to her bed and asked if you could sleep in her room with her and seeing the sad face she had, you said sure which made her really happy, so told Kate that you be sleeping in Alice's room.<br>\r\n<br>\r\nwhere do you sleep?    </span></div></div>",
            "created":1407387600,
            "id":1838728,
            "title":"after a hour Kate called up bed time"
        },
        "132332":{
            "author_id":"brianuk",
            "author_name":"briankuk",
            "choices":[
                "the back",
                "the front"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where in diaper you sleep<br>\r\n</span></div></span></div>",
            "created":1407387600,
            "id":1838731,
            "title":"in her diaper "
        },
        "1323321":{
            "author_id":"brianuk",
            "author_name":"briankuk",
            "choices":[
                "flashback to when Alice found out about you",
                "you wake when Kate is changing Alice"
            ],
            "content":"<div class=\"\"><div> <span>Alice got under dress and put her night dress on and turned round to see you'll walking around on her bed so she walked up to her bed and jumped on it  sending you flying.<br>\r\n<br>\r\nyou was just walking round Alice's bed looking around as it still get to you how big thing are, you had a quick look to if Alice was ready you saw she was just putting her night dress on so you turned back round and kept looking round and then the next thing you knew, you was flying in the air and as you was falling back down you could see Alice had her mouth wide open and you was going land in there, you know she wouldn't eat you without asking but it was still scares.<br>\r\n<br>\r\nAlice saw you go flying in the air and thought it would be fun to catch you in her mouth and play with you in there just for a bit, she wasn't going to eat you, when you did land in her mouth, she closed her mouth and stated sucking on you as if you was a sweet, Alice remembered when you first asked her to eat you to proof that he would be ok, it was a week after she found out about you shrinking.<br>\r\n<br>\r\nAlice then spat you on her hand and apologise for playing with you in her mouth like that, you told her that it was ok and you was happy that she spat you out, you asked her to get your pjs that you shrink the last time you stayed round,Alice give you your pjs as your clothes was now wet, when you put them on, Alice pulled the back of her diaper waist band and said in you go,you climbed in the back of her diaper and when you was in Alice said goodnight and the got into her bed.<br>\r\n<br>\r\nAlice would sleep on her belly so you could get some sleep but before you fell asleep you remembered when Alice found out  when you could shrink and telling her that her dad can't find out.</span></div></div>",
            "created":1449529980,
            "id":2071644,
            "title":"in the back you go "
        },
        "1323322":{
            "author_id":"2013mortho",
            "author_name":"MorTho",
            "choices":[
                "\"I want to do naughty stuff\"",
                "\"I need to go wee wee\"",
                "\"Nothing\""
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size45\" style=\"\">Alice had just finished getting ready for bed, she was looking down at you with an expectant look in her eye and after you gave her a thumbs up she didn't waste a second before picking you up.<br>\r\n<br>\r\nShe raised you up to her face and gave you a sweet kiss, she was probably trying to kiss you on the lips but she ended up kissing your entire face, after parting her lips from you she opened the front of her diaper and lowered you inside.<br>\r\n<br>\r\nShe let her diaper close, leaving you with a full view of her vagina, this wasn't the first time you had slept in her diaper and you hoped it wouldn't be the last time, you had almost gotten to sleep when you heard Alice start to stir \"what is it, Alice\" you say trying to understand what was going on, after a couple of seconds of silence she replies with...</font></span></div></div>",
            "created":1571277180,
            "id":2734052,
            "title":"the front"
        },
        "13233222":{
            "author_id":"brianuk",
            "author_name":"briankuk",
            "choices":[
                "You stay and get peed on ",
                "You grow to be a her teddy bear for the night ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Alice told you that she had to go wee wee and asked if you want stay in there when she go a pee as she was to tired to get up to go and didn't want disturb her mum.<br>\r\n<br>\r\nIt wasn't the first time Alice wet herself when you was in her diaper, you couldn't stay mad at her for peeing on you, you just have to have a bath in the morning which would be on your own or you would still be tiny and have a bath with Alice or Kate.</span></div></div>",
            "created":1582804860,
            "id":2793733,
            "title":"\"I need to go wee wee\""
        },
        "14":{
            "author_name":"Someone",
            "choices":[
                "Yell to her!",
                "Try to get out!",
                "Just wait."
            ],
            "content":"<div class=\"\"><div> <span>She asked if you wanted to be in her panties. You refused, but you have no other choice. She grabbed you and pulled the back of her panties, she dropped you in and snapped the panties back. She walked around the house, here butt jiggling as she moved. She sat down and squashed you. When she got up, you were stuck in her butt crack. She said that she needed to used the restroom to you. You could smell what was coming. She got to the restroom, she pulled down her panties and sat on the toilet. She did not see you in her panties, but she had to got bad! She pushed, and you popped out with her crap. Now were in the toilet. She's about to flush it... what do you do?</span></div></div>",
            "created":1172293200,
            "id":384480,
            "title":"The panties of pain"
        },
        "141":{
            "author_id":"brianuk",
            "author_name":"briankuk",
            "choices":[
                "kate didn't hear you",
                "kate heard you and get you out"
            ],
            "content":"<div class=\"\"><div> <span>as you was about to yell Kate sat back down where she needed to go again thinking you was still in her panties not knowing that her poo and pee was hitting you, kocking you under.<br>\r\n<br>\r\nKate got off the toilet and cleared her ass then she pulled her panties up not seeing if you was still in them, Kate looked down in the toilet thinking did all that come out of me but then she thought she saw something.<br>\r\n<br>\r\ndid she see you?</span></div></div>",
            "created":1178773200,
            "id":406645,
            "title":"what a shit way to go"
        },
        "1411":{
            "author_id":"shadowsx1234",
            "author_name":"nightrun",
            "choices":[
                "her room",
                "the kitchen",
                "the living room"
            ],
            "content":"<div class=\"\"><div> <span>Kate didn't heat you and she closed the toilet lid and left you there.<br>\r\nthe lid open and you saw your girlfriend Amy you try and yell out HELP but she didn't hear.<br>\r\nAmy is 23 year old is tall 7'4 in height.<br>\r\nshe turns around pulls down her panties and sat down. You couldn't see a damn thing all can see is darkness then hear a sound like water running she peeing soon the sound stop and you hear her grunt you think \"ho on\" then all the shit came and cover you.you resurface too see that Amy has left then you see Amy looking strait at you does she see you in there. yes she does and take out clean you off and say \"how get so small\" before can speak Amy puts you here bra and wakes to.....</span></div></div>",
            "created":1283922000,
            "id":952790,
            "title":"kate didn't hear you"
        },
        "14113":{
            "author_id":"trippy321",
            "author_name":"Sam",
            "choices":[
                "The Front of your diaper",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>You see from between Amy's cleavage you see a large baby cradle. Amy bends over and says \"coochie coochie coo\". Since her breasts were extremely sweaty you easily slid between them and dropped into the baby cradle. When Amy finally walked away you got up, turned around and saw the crib belonged to the larger-than-life Alice. Technically Alice \"knows\" that you can grow and shrink even though she still cocks her head in curiosity. You hear Amy's thundering footsteps approach wanting her to think that you shrinking was a dream. You try too run and find a hiding place but are held back you turn around and see that Alice had her hand wrapped around your torso. Knowing you were out of time to find a hiding place faraway from Alice you Only had one choice \"Alice?\" you asked hoping she can understand you \"Could you please hide me in ...?\" </span></div></div>",
            "created":1379480400,
            "id":1665332,
            "title":"The Baby"
        },
        "141131":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "she goes on a marathon",
                "she has a dentist appointment and has to be gassed with you on her ass for hours"
            ],
            "content":"<div class=\"\"><div> <span>Alice pulls open the front of her diaper and you see her little vagina then you enter and lay down  then Alice closes her diaper and goes to sleep, when Alice woke up she forgot about you in her diaper.<br>\r\n<br>\r\nyou are next to her vagina and it lets out a lot of heat suddenly you see it open and a ocean of piss comes out and covers you suddenly you feel shaking as Alice stands up and is lifted by Kate then she lays Alice down and removes her diaper, you are flung out and land on the sofa, then you are about to regrow but then look up and see <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://i.pinimg.com/736x/29/4f/dc/294fdcf507983e96b4971897e07c5bf3--rear-view-tights.jpg\" target=\"_blank\">https://i.pinimg.com/736x/29/4f/dc/294fdcf507983e96b4971897e07c5bf3--rear-view-t...</a> as Kate sits on you  then you regrow as an emergency but it doesn't work as now you are stuck in a few loose fibres of Kate's yoga pants...</span></div></div>",
            "created":1536870660,
            "id":2547228,
            "title":"The Front of your diaper"
        },
        "141132":{
            "author_id":"trippy321",
            "author_name":"Sam",
            "choices":[
                "The Back of your diaper",
                "Two more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alice hide me in...</span></div></span></div>",
            "created":1379480400,
            "id":1665339,
            "title":"More"
        },
        "1411321":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "you shrink then she trips and you gettrapped under her tit",
                "in the morning you go to wake up Kate and shrink on her bed but gets rolled on"
            ],
            "content":"<div class=\"\"><div> <span>Alice looks at you then pulls back the back of her diaper and puts you in your are not in between her cheeks until she releases the diaper and it puts you in between her ass cheeks you see her anus in front of you then you hear a muffled voice then a lot of pressure put on to you, then you feel Alice leave the ground then day light...<br>\r\n<br>\r\nKate walks over to Alice and says \"honey roll onto your back it'll be easier to pick you up\" then Alice rolled and gets picked up to be changed but Kate sees you and puts you in the back pocket of her skinny jeans <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.denimblog.com/wp-content/uploads/2012/11/rag-bone-back-pockets-skinny-jeans.jpg\" target=\"_blank\">http://www.denimblog.com/wp-content/uploads/2012/11/rag-bone-back-pockets-skinny...</a> then she finished changing Alice and went upstairs putting a lot of pressure on to you, then she removed you and you see her smile then you see her naked and you see you're in between <a class=\"blue2roll\" rel=\"nofollow\" href=\"https://cdn.pornpics.com/pics/2016-05-24/225747_16big.jpg\" target=\"_blank\">https://cdn.pornpics.com/pics/2016-05-24/225747_16big.jpg</a><br>\r\nthen she falls asleep with you in her breasts, so you grow back and put some blankets on her and walk away to your room where you find a good movie put it on your phone and shrink to watch it like a cinema, you were so engrossed with the film you didn't notice Kate walks in behind you sleepwalking then she starts to sit suddenly you look up and see <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://rpicz.com/pics/1236/sexy-nude-girls-big-ass.jpg\" target=\"_blank\">http://rpicz.com/pics/1236/sexy-nude-girls-big-ass.jpg</a> as she sits on you then you grow and she ends up face sitting you then she stands up and leaves...</span></div></div>",
            "created":1524350880,
            "id":2482629,
            "title":"The Back of your diaper"
        },
        "1411322":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "\"Alice can you hide me in your mouth\"?",
                "even more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Alice can you hide me in your mouth?\" </span></div></span></div>",
            "created":1427691600,
            "id":1956168,
            "title":"more"
        },
        "14113222":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "spotted (Alice takes care of you)",
                "spotted (Amy takes care of you)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To late Amy has spotted you!</span></div></span></div>",
            "created":1427691600,
            "id":1956170,
            "title":"even more"
        },
        "1412":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "Sat and farted on you.",
                "Undressed and rested her pussy on you.",
                "left the room to get something."
            ],
            "content":"<div class=\"\"><div> <span>Kate noticed you in the toilet bowl, she looked for a cloth to pick you out with. Once Kate found a cloth she pinched the cloth together to pick you out of the toilet.<br>\r\n\"Wow that was a close one Kate.\" You mentioned to Kate as she placed you next to the bathroom sink and then walked back over to the toilet to flush it. <br>\r\n\"It was a bit close, wasn't it.\" Kate sighed as she began washing you off under the sink. <br>\r\nYou and Kate leave the bathroom and make your way to her bedroom. Kate entered her bedroom with you in the palm of her hand and she threw you on the bed before she,</span></div></div>",
            "created":1445144400,
            "id":2048732,
            "title":"Out of the frying-pan."
        },
        "14121":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "More farts.",
                "Lunch time."
            ],
            "content":"<div class=\"\"><div> <span>You look up as a shadow casts over you, you see Kate's large, round, soft beautiful ass that was hurdling towards you. Before you could even think about moving, Kate had already finished her decent and was now sitting very comfortably on your tiny body. <br>\r\n\"I wonder where he has got to now?\" she questioned with a devious smile on her face, obviously she knew exactly where you were she knew that her perfect butt was resting on your minuscule body. She also knew that their was more than one reason for her deciding to sit on you. However, you did not see her devious smile you began thinking that she might of not realised that she was sitting on you.<br>\r\nYour first instinct was to try to get her to notice you, but how? You could try calling out to her, you thought but when ever you attempted to speak your mouth was filled up by Kate's butt fat. What else could I try? You asked yourself. Then the idea to wiggle to get her attention. <br>\r\n\"Oh what's that wiggling underneath my ass?\" Kate said in a slightly mocking tone.<br>\r\nThen a rumble could be heard moving quickly toward Kate's tight ass hole, until <br>\r\nfinally her ass hole opened up right above me but behind the material of her skirt, leggings and panties, and she let out a small smelly fart. <br>\r\n<br>\r\n</span></div></div>",
            "created":1447304400,
            "id":2060432,
            "title":"From above."
        },
        "141212":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "Struggle",
                "Let her enjoy you as her snack."
            ],
            "content":"<div class=\"\"><div> <span>Kate finally stood up off of you but wasted no time in picking you up.<br>\r\nShe stares at you for a moment before licking her beautiful moist lips that hypnotised anyone who looks at them. Thats just at normal size! Kate then moved you closer to her mouth and this time instead of licking her lips Kate stuck her tongue out much further and licked your body instead. Even with Kate tasting you, you neither resisted or complained. After being licked a few times Kate placed you carefully on her soft tongue and closed her mouth. <br>\r\n\"Hmmm..\" Is all she said as she savoured your unique tastes. Kate could no longer resist as you found yourself being pulled down her throat to later be held in Kate's cave like stumoach. </span></div></div>",
            "created":1468113480,
            "id":2177789,
            "title":"Lunch time."
        },
        "14123":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "Mystery 1",
                "Mystery 2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kate left the room and when she returned she was hiding something behind her back. When she revealed it you wondered why she had a...</span></div></span></div>",
            "created":1445144400,
            "id":2048734,
            "title":"Mystery item."
        },
        "143":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "Yes!",
                "No, and she flushes you!",
                "No, but the toilet is broken!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she notice you?</span></div></span></div>",
            "created":1494886200,
            "id":2319992,
            "title":"Just wait."
        }
    },
    "info":{
        "author_id":"brianuk",
        "author_name":"briankuk",
        "brief_description":"your name is George and you have the power to shrink and grow back",
        "created":1171396800,
        "description":"<td align=\"left\" class=\"norm\">you are George and you have the power to shrink to any size you want and grow back, you all so can't be killed when you are tiny. <br>\r\n<br>\r\nthe only one who know your secret is Kate who is marry to your brother Jack who had to go away for work so you stay with her for a week and that when the fun start, Kate is really kind and nice to you, also have a three year old baby<br>\r\n<br>\r\nyou are 22 years old<br>\r\nKate is 30 years old<br>\r\nAlice is 3 years old<br>\r\nanything goes </td>",
        "id":1217413,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1585312800,
        "modified":1585312800,
        "pretty_title":"giantess sister in-law"
    }
}