{
    "chapters":{
        "1":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "Use edward to have sex with a girl, or have your own character have sex with him",
                "Use Alphonseto have sex with a girl or have your own character have sex with him",
                "sleep with winry",
                "sleep with maria ross",
                "have some fun with lust"
            ],
            "content":"<div class=\"\"><div> <span>up until today you probably havent seen much hentai related to Full metal alchemist, at least not on this site. in this story you may add in whoever you want from either the first series or following the manga. for now the characters invovle.<br>\r\nEdward Elric<br>\r\nAlphonse Elric- in his human body not armour<br>\r\nWinry<br>\r\nmaria ross<br>\r\nLust</span></div></div>",
            "created":1255237200,
            "id":774125,
            "title":"HENTAI IS AWESOME BUT FMA ROCKS "
        },
        "11":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "homunculi, shes here to kill you",
                "state alchemist, here to seduce you and recruit you",
                "its winry",
                "Random girl that loves cock",
                "Ishbal warrior here to kill people"
            ],
            "content":"<div class=\"\"><div> <span>Today was a day like any other. Except, of course, that it was going to get interesting. You are Edward Elric, you have long hair and 1 arm made of metal and one leg of metal. Your out in a sparse, green field the sun is high in the sky and there’s a slight breeze. a large willow tree stands about 50 yards away, next to you is a dummy made of metal. You’re using this to train and it’s all banged up. Suddenly from the direction of the willow tree you see movement. Then you see her. Who or what is she?  </span></div></div>",
            "created":1255582800,
            "id":776497,
            "title":"Use edward to have sex with a girl, or have you..."
        },
        "111":{
            "author_id":"ravad",
            "author_name":"Raith",
            "choices":[
                "Lust",
                "Sloth (anime version) ",
                "Envy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which homnculus is it? </span></div></span></div>",
            "created":1282317060,
            "id":939993,
            "title":"homunculi, shes here to kill you"
        },
        "112":{
            "author_id":"ravad",
            "author_name":"Raith",
            "choices":[
                "Original",
                "Female!Canon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would this be a female version of a canon alchemist or an original character? </span></div></span></div>",
            "created":1282317780,
            "id":939999,
            "title":"state alchemist, here to seduce you and recruit..."
        },
        "1122":{
            "author_id":"ravad",
            "author_name":"Raith",
            "choices":[
                "Roy Mustang/Rei Mustang",
                "Zolf J. Kimblee/....Z. Jane Kimblee",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Female versions of existing canon male alchemists. </span></div></span></div>",
            "created":1282331940,
            "id":940124,
            "title":"Female!Canon"
        },
        "113":{
            "author_id":"isoace",
            "author_name":"otherworlder",
            "choices":[
                "readers choice",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Winry smiles and beckons you over to where she is standing. You walk over to her and ask \"what do you need?” She smiles timidly \"Ed there is something I need to tell you\" she blushes comes in closer. \"What is it?\". Winry looks down and says under her breath \"Ed I...I..\" she looks up and looks deep into your eyes \"I love you!\". You reel back in surprise. Winry walks up to you and gives you a giant bear hug. You are having the same feelings for her and reply with a hug back. You tilt her head up and lean into a kiss. Your tongues dancing within each others mouths. \"take me Ed\" she sighs. With much enthusiasm you fondle her large breasts. she moans and pushes you down to the ground. She bends down and unzips your pants. Your large member pops out to say hello. Her eyes widen in surprise. \"Its larger then i thought\" she says. Winry then plunges your rock hard cock into her mouth. Her tongue swirling inside her mouth. Occasionally she would let it out to lick your head. You stop her and have her get on her back. You go down and take off her brown skirt and polka dot underwear. You start swirling your tongue on her already wet pussy. Sometimes pushing it into her pink hole. she moans and her chest heaves up and down. you continue licking until her body trembles as she cums. liquid splashes your face filling your mouth full of her juices. You spit it out. you then go up and unbutton her shirt, it slides off to reveal rock hard nipples. you suck on them delicately. Your tongue swirl’s around her tit. as you are sucking she reaches down and starts stroking you.” I cant take it anymore fuck me Ed!!\" she yells. you smile then adjust yourself so that your hard dick is in position to penetrate her seeping pussy. You stick it in her. she yelps as you go in and out of her tight vagina. her breath quickens as she plays with her breasts. You lean down a kiss her. Minutes pass of you and Winry making sweet love. her body convulses as she climaxes. Your body tightens as you reach for your ending as well. You cum inside her pussy. She shivers as her body cums, your fluids mixing.\" I love you Ed\" she heaves. \"I love you too Winry\" you the lay down on the ground to relax. after 30 minutes pass Winry gets up \"Grandma Pinako is expecting us home\" she gets up and gets re dressed. \" i had a really fun time Ed.\" she leans down and kisses you passionately. You get up and dress as well. you walk up with your hands intertwined. </span></div></div>",
            "created":1281667080,
            "id":935158,
            "title":"its winry"
        },
        "114":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "She laughs and keeps sucking ",
                "shes pissed, your supposed to be her bitch now",
                "she mounts you"
            ],
            "content":"<div class=\"\"><div> <span>As she moves closer you notice a few things, mostly the way she moved, she was very graceful and was fast, then you noticed what she looked like, beauty incarnate. that was the best word you could think of to describe her.<br>\r\nShe has long, flowing, blonde hair, down to the middle of her back, soft features in the face, no makeup, she’s about 5'6 and wearing a red skirt and a white blouse, id put her at 130lb and she has these cute little feet in sandals.<br>\r\nAs she seems to zone in on your position your metal dummy suddenly goes flying, half impaled by a wooden spear. You watch as the girl claps her hands together and suddenly did a flip touching her hands to the ground, she came up bearing a whip made of grass, and this girl was skilled in alchemy and everything about her said violence.<br>\r\nYou set your stance so that you can easily dodge any attack she throws at you with the whip. Much to your surprise she simply drops it, claps her hands, and comes up bearing a grass sword, different than the whip you throw your right arm(the metal one) out to intersect with the sword, it works, for the most part, the sword breaks, being made of grass it was no surprise. What was a surprise was when it broke apart on its own and wrapped around your wrist and extends to the other one. <br>\r\nYou are now bound by your hands and then your legs as she is one fast girl, Your completely at her mercy, she introduces herself as Alicia, she said she saw you training and it turned her on. Immediately she clapped her hands, performing more alchemy on your clothes, it snaked around you and the clothes became a dildo held in her hand. You feel your arousal, not noticeable during the one sided fight. And realized you were rock hard. She must have been impressed because she whistled and grabbed it in one of her soft skinned hands. You almost came immediately but held off until she stuck your cock in her mouth, cum was now coating her mouth and throat. What happens next?   <br>\r\n</span></div></div>",
            "created":1255669200,
            "id":776977,
            "title":"Random girl that loves cock"
        },
        "1141":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "you lick it as she commands",
                "you get your feet under you and kick her off, reversing the situation",
                "you resist so she turns around and presses her ass to your mouth"
            ],
            "content":"<div class=\"\"><div> <span>As the pulsing slows to a stop, Alicia lifts her head and giggles, some cum falling out of her mouth; with a fair amount still in her mouth she kisses you. Giving you a mouthful of your own sperm. you ignore the taste in your mouth and wait for her to break the kiss, she then goes back to sucking on you, you let the cum flow out of your mouth onto the back of her head, covering her hair in it. She applies a little pressure with her teeth and you cringe at the pain, she continues sucking on you normally. This felt good but the fact that she bested you in a fight of alchemy was irritating, you hadn’t even gotten the chance to attack. <br>\r\nAs Alicia sucked on your cock she thought about how good it felt to her, perfect for the things she wanted to do to herself. She stops sucking on you, looks at you and smiles, and a wide toothy smile, perfectly white. She throws you back into the ground and sits on your chest, somehow in the confusion of being thrown around all of her clothes were off and she was now pushing her pussy into your face. \"Lick it\" she commands. What next?<br>\r\n</span></div></div>",
            "created":1255842000,
            "id":777689,
            "title":"She laughs and keeps sucking "
        },
        "11411":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "They allow you to finish, then capture and take advantage of both of u",
                "they attack while your making love,(large battle scene with lots of fighting)"
            ],
            "content":"<div class=\"\"><div> <span>You lick it as she commands, wishing to plunge your tongue deep into her luscious folds. You lick up and down the sides of her pussy, breathing on it from time to time, and then you begin to tease the folds, flicking them with your tongue, sucking them into your mouth. You begin nibbling at her clit which has become firm, suckling it at times. You continue to lick and suck and slurp her juices as they begin to flow more freely.<br>\r\nAs Alicia sits on your chest she moans, delighted in the sensations you’re giving her, pushing her pussy forward whenever she thinks you’re going to plunge deeper, she also plays with her breasts, kneading them and tweaking her nipples.<br>\r\n<br>\r\nFrom afar pair of figures watch, they are alchemists. They are all in black and have transmutation circles on the parts of their arms that are visible; to look at one would be as looking into a face tormented in a prison cell. But no, these were alchemists, anything done to them was earned in their work or in a fight, and they were intent on taking out the couple making love a little ways away.<br>\r\n<br>\r\nWhat next?   <br>\r\n</span></div></div>",
            "created":1257483600,
            "id":787985,
            "title":"you lick it as she commands"
        },
        "114111":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "readers choice",
                "the alchemists transmute something, and fill both you and Alicia's holes"
            ],
            "content":"<div class=\"\"><div> <span>Still flicking your tongue in and around her pussy, you feel her body above you spasm. Releasing her juices all over you face, some gets in your mouth and the rest spraying over your face. You love the taste of her cum.<br>\r\nAlicia had let herself fall backwards, feeling something hard along her face she notices your cock. Seeing as your still a tied up she decides to get herself up and mount you, guiding your shaft into her warm, comfortable slit. Moving in circles, forward, and back. Pleasuring herself more than you, all the same though you blew your load inside of her and set off her own orgasm. Satisfied she falls against you chest, letting your cock out of her. Kissing your chest she falls asleep, leaving you still tied up and sopping wet with a mix of both your juices.<br>\r\n<br>\r\nThe alchemists in black decide that now is the time to move, they decide the best approach would be to simply walk up and tie the couple together, as one was already tied up and the other is asleep. this would be pretty simple. <br>\r\n<br>\r\nNot ten minutes later you and Alicia were bound gagged and about to be penetrated in the deep of night. You curse Alicia for tying you up and decide that you were going to have to escape. During the trip so far you had been pissed on by her, accidently, because of the way you were tied up. This was shaping up to be a bad day. You knew these alchemists planned on doing some type of forbidden alchemy on you, it involved nudity and sex, so you figured it wouldn’t be too horrible. So what happens next?<br>\r\n</span></div></div>",
            "created":1270494720,
            "id":862656,
            "title":"They allow you to finish, then capture and take..."
        },
        "11412":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "she frees you and you have fun with her body",
                "she rides you"
            ],
            "content":"<div class=\"\"><div> <span>as she waits for you to start licking her pussy you decide that you would rather not be the one on the bottom. Therefore you knew you had to reverse the situation, although her pussy looked enticing and delicious. At your moment of hesitance you realize that it would be easy to get your feet under you and push her off. So, like anyone else would do in that situation you got your feet under you, pushed Alicia off you, and jumped on her chest with your arms and legs still bound. You fall slightly on her and she manages to grab onto you. She then flips you off of her and performs alchemy on the ground causing vines to come up and bond you even further, breaking the old clothing bonds they stretch you out. Alicia looks at you and laughs, moving back to her former position and telling you to lick her pussy, this time you do so and are rewarded with a nice jet of girl cum. What next? </span></div></div>",
            "created":1256360400,
            "id":780668,
            "title":"you get your feet under you and kick her off, r..."
        },
        "114122":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "she cums",
                "the state alchemists arrive, alicia is wanted for rape in 6 major cities"
            ],
            "content":"<div class=\"\"><div> <span>Alicia lets out a small moan, leaning backwards as she cums on your face. Satisfied she then inches herself back, stopping when she feels your cock, she moves a little farther back, making it stand at an angle instead of straight up. She then proceeds to grind her ass with your cock, kind of stroking it.<br>\r\nThis feels good; it’s almost like having your cock between to large and soft breasts. Not sure of what else you could do in this situation you simply allowed her to continue, knowing that you could hold out for a fair amount of time now.<br>\r\nAlicia notes that she isn’t stimulating you very well and decides to fix the situation by lifting herself up and placing her pussy on your rod. she isn’t a virgin but she is still pretty tight, she was dripping wet from your previous affections and now you slid in and out as fast as she decided to go, sometimes wriggling your cock to put an angle on the strokes, adding to her pleasure, soon you feel yourself getting perilously closer to orgasm, but before that happens....what happens?   <br>\r\n</span></div></div>",
            "created":1257808500,
            "id":789429,
            "title":"she rides you"
        },
        "1142":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "continue to eat out her ass",
                "try to escape",
                "allow the dildo to be changed"
            ],
            "content":"<div class=\"\"><div> <span>She takes your full load in her mouth, but doesn’t swallow it; instead she spits it out on you. Covering your stomach in your own cum. you can tell she’s mad, her eyebrows form the V and she starts to yell. Looking off into the distance you pay attention to the grass blowing in the wind, the trees and their beautiful green leaves. Alicia seems to notice your not listening to her shouting. So she is going to make you her bitch. <br>\r\n<br>\r\nShe takes the dildo and slowly starts rubbing it against your cock, arousing you slightly; she then starts to rub it around your asshole. You begin to feel wary, not quite knowing her purpose. But moments later you understand perfectly. She stretched your cheeks apart and shoved the clothing dildo into your ass, shoving it as far as your clenched ass allowed. She then proceeds to position her tight, bubble ass in your face, spreading her cheeks and forcing herself down around you mouth, you hear her tell you to lick it or else she would make the dildo in your ass longer, and have it vibrate. Thinking of the consequences of each act, you idly sample her ass....What next?<br>\r\n</span></div></div>",
            "created":1273898400,
            "id":883382,
            "title":"shes pissed, your supposed to be her bitch now"
        },
        "12":{
            "author_id":"jacktheblack",
            "author_name":"ESen",
            "choices":[
                "Time for sex!",
                "Blowjob!",
                "Force him to eat her out",
                "Bring him to the place where she took Ed and use both of them",
                "More women come"
            ],
            "content":"<div class=\"\"><div> <span>Alphonse Elric was waiting for his brother. They wanted to meet there after Edward had finished the state alchemist test he had to absolve regularly. While he was waiting he didn`t notice the girl that was entering the street where he stood. She went around him in the shadows and didn`t make any noise. When she stood right behind him she said in a mysterious voice: \"Hey, you have to be Al. I`ve met your brother, Edward. He said something like \"Okay, kill me, but do nothing to Al!\" She laughed and Alphonse stepped back in fear. \"I can tell you, your brother is dumb. As if I would ever kill anyone. Now he knows that, but... well, you know. The only reason for me to spend time with men... is the one thing we all are made for!\" With that the mysterious woman grabbed his pants and ripped them off.</span></div></div>",
            "created":1282650300,
            "id":942706,
            "title":"The female rapist"
        },
        "13":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "You wash her pussy with your tongue",
                "shes mad that you didnt warn her and makes you eat her ass out",
                "she wants you to lick her feet and toes clean",
                "she lets you take her Analy",
                "She lets you screw her pussy, shes not even close to being a virgin"
            ],
            "content":"<div class=\"\"><div> <span>Tonight is a special night for you. You had the guts to ask Winry to go out for dinner and a movie, and she agreed, even though Edward Elric was around you still won out. <br>\r\nTo fill you in on what you are you’re an alchemist and can use the same methods as Edward, transmute objects by clapping your hands together. Your average height and have a fairly large sized penis.<br>\r\n<br>\r\nYou arrive at Winry's door and find her working on an auto mail part, when you ask what it is she tells you it’s a vibrator and that she needs to have a shower before she leaves. You ask if you can partake in this and she says of course. You both go to the bathroom and strip down naked. You take in the look of her soft medium sized breasts; meanwhile she’s looking at your raging erection and takes command, grabbing it and leading you into the shower. She gets down on her knees and starts sucking on you, in about 2 minutes you cum and she swallows it all. What next?  <br>\r\n</span></div></div>",
            "created":1255237200,
            "id":774148,
            "title":"sleep with winry"
        },
        "131":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "she's got to go to the bathroom wait outside, or go with her if your into that",
                "she wants your cock there and then",
                "you two finally get cleaned up and go to eat"
            ],
            "content":"<div class=\"\"><div> <span>Once she’s sucked all of you’re cum out of you she stands up and kisses you. You then hug her, grabbing her ass, and as she steps back you move down onto your knees and look straight into her pussy, you kiss it, acting as though you’re making out with it, then lick up and down the sides of her pussy, causing her to quiver. You start sucking on her clit and poking a finger into her ass. Your tongue is moving in circles around her vagina. You keep this up for a short while longer and feel her whole body shake and quiver as she cums; using your shoulders for support she sprays her cum on your face. The water from the shower cleans it off and you stand up. What next?</span></div></div>",
            "created":1255323600,
            "id":774153,
            "title":"You wash her pussy with your tongue"
        },
        "1312":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "she cums showering your lower body in her juices",
                "she mysteriously passes out",
                "she holds off and you cum first by accident"
            ],
            "content":"<div class=\"\"><div> <span>She must have been craving cock, because one moment you were standing there admiring her beautiful curves and then next she was pushing you against a wall trying to guide your cock into her pussy. \"I want your cock here and now.\" she states in a way you that you cant refuse her. As she finally positions herself correctly she slowly slides herself onto your rod, the water of the showing acting as a lubricant, she thrusts her hips back and forth, screwing you against the wall. Moaning and thrusting, in and out. <br>\r\n<br>\r\nYou’re standing there concentrating on not blowing your load inside her so quickly, she’s thrusting herself on your rod as if it’s the last thing she was ever going to see or have. Finally you feel her body tensing, getting ready for her to explode. She quivers and falls on you sinking deep onto your rod. What next? <br>\r\n</span></div></div>",
            "created":1257224400,
            "id":786429,
            "title":"she wants your cock there and then"
        },
        "13122":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "she wakes up, worried and scared",
                "she stays asleep, leaving you to do whatever you want to her naked body"
            ],
            "content":"<div class=\"\"><div> <span>In one simple moment as she quivered you were thinking about anything except this beautiful, willing, and naked girl bouncing on your rod. She’s quivering but hasn’t had her orgasm yet and you’re too much of a gentleman to orgasm first.<br>\r\n<br>\r\nWinry is in ecstasy, loving the feeling of your long cock brushing the inside of her pussy as though you were brushing her teeth. Feeling herself spread wide and raising herself up only to lower herself again. She can feel you holding back, aware of how much strain and pressure is building up. It’s exciting her so much. <br>\r\n<br>\r\nFinally winry lifts herself up for one final thrust, and falls fast onto your willing rod. Winry orgasm’s as soon as her pussy hits the hilt of your cock, triggering your own orgasm. As you spurt your white liquid against hers, you suddenly feel her legs give out. You catch her, feeling your cock go limp as you’ve finished filling her pussy with your seed.<br>\r\n<br>\r\nYou slowly lower yourself down in the shower, careful so as not to hurt winry as she apparently slept. It must have taken a lot out of her, having multiple orgasms, and enjoying your cock. Finally sitting at the bottom of the tub with water running down both your bodies you study Winry’s body. Her long blonde hair flows partway down her chest, covering a nipple. Further down, you notice her shapely curves and her light haired mound above her pussy. You reach a tentative hand toward her mound, rubbing your hand through it, then moving it further down her body, cupping her pussy in your hand, inserting your middle finger and ring finger. Sliding them in and out you watch for her to waken. Emboldened when she doesn’t you take your hand away. You’re wondering in your head why you don’t want her to wake up while you’re doing this but can’t come up with an answer.<br>\r\n<br>\r\nIn her exhaustion educed sleep winry dreamed. She was dreaming about being tied and gagged. Random hands and fingers feeling her privates, slipped fingers in her pussy, in her ass, and tweaking her nipples. She wasn’t enjoying this dream. She hoped whatever was going on in the waking world was not the same as what was going on in the dream.<br>\r\n<br>\r\nThe fact was the reality and dream was closely related. You now had nearly your whole hand in her pussy, rubbing and flicking it, Winry’s breathing deepens but she remains asleep. you pull your cum covered hand away from her pussy and proceed to slowly and carefully roll her over, so that now her face rested against your chest and her ass was more accessible. You immediately start to rub around her asshole. Finding the whole itself you slip a finger closing your hand and opening it again you add another finger, you start pumping those two fingers in and out. Feeling the friction created and knowing it must pain Winry’s tight ass more than your hands, you don’t want to stop it, and you don’t want her to wake up....what happens next?<br>\r\n</span></div></div>",
            "created":1278915180,
            "id":916213,
            "title":"she mysteriously passes out"
        },
        "1313":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "at the theatre the maid cleans Winry’s still sopping wet pussy",
                "In your seat at the theatre, the maid sucks you off",
                "Winry straddles you and gives you a lap dance during the movie"
            ],
            "content":"<div class=\"\"><div> <span>You realize that in the time it took to accomplish your sexual needs for each other, to much time passes by, the reservations were made and you didn’t want to look like a fool so you grabbed the soap and gave winry a good cleaning, after which she returns the favour. Finally you put your clothes on and head to the restaurant. <br>\r\nInside you survey the area. Seeing that there were many booths by the sides and table in the middle you decided to take a booth in a corner, the seats are red and cushiony. The waitress takes your order and comments on how lovely the two of you look together; winry boldly asks if she would like to join in your fun at the movies. The waitress said yes with barely any hesitation.<br>\r\nSometime during the meal you move you foot to rest on the seat between Winry’s legs. Slowly you move your leg, so that no one would notice. Then you press it into her covered pussy, moving it back and forth, she sat there quivering, trying not to attract attention and you eat your meal casually, as if you’re doing nothing at all. Winry is almost finished her meal but cant eat anymore due to your constantly pleasuring her. She soon cums quietly, soaking her skirt in her juices. She looked mad because she didn’t want anyone to notice the large wetness down there when you left. You simply smiled and continued your meal. A short time later winry snuck out the back way to avoid notice and you met up with the maid, she grins but says nothing as you continue on to the movie theatre. What next? <br>\r\n</span></div></div>",
            "created":1255323600,
            "id":774629,
            "title":"you two finally get cleaned up and go to eat"
        },
        "13132":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "winry goes down on the maid",
                "you go down on the maid"
            ],
            "content":"<div class=\"\"><div> <span>Once in the theatre to some movie you didn’t know the name of. The maid wasted no time in unbuttoning your pants and pulling your cock out, winry looks a bit lonely but simply pulls her clothes down to her ankles and starts fingering herself as the maid bobs up and down your cock without blinking. Sucking the tip and then dipping her head in to run her tongue along the length of it, she sucks from the base, getting some pubic hair in her mouth and driving you crazy. coming back up for air she looks up and smiles at you, then licks the tip of your cock, tasting the pre cum. she showers your cock, kissing it with her lips, up and down one side and then the other, going down even farther she gives your balls a little lick. She goes back to bobbing her head up and down your shaft. You finally blow after about 10 minutes, the maid swallows it all, only a little falling out and running down her chin, witch winry kisses off. What happens next?    </span></div></div>",
            "created":1270432200,
            "id":862204,
            "title":"In your seat at the theatre, the maid sucks you..."
        },
        "13133":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "Maids turn, winry outa the way!",
                "winry cums and the maid cleans both of you with her mouth and tongue"
            ],
            "content":"<div class=\"\"><div> <span>So as you find your seats in the middle of the movie theatre, almost deserted, you take the seat between winry and the strange maid. a movie comes on, the lights go dark, its a romance movie and your ready to just zone out, or have some fun. But unfortunately, Winry beats you to it. She reaches over and unbuttons your pants, pulling your cock free. It is instantly hard and winry climbs on top of you. She moves her skirt out of the way and pulls her panties to the side, and guides your cock into her. <br>\r\n<br>\r\nThis is the first time you had been inside her hole; she was tight but not a virgin. she started to move up and down, on the third down stroke you came inside her, filling her love snatch with your seed. she doesn’t stop, she just keeps going, keeping you hard inside her and she raises the tempo, faster up and down, the sloshing was loud but neither of you cared. What next?  <br>\r\n</span></div></div>",
            "created":1255496400,
            "id":775933,
            "title":"Winry straddles you and gives you a lap dance d..."
        },
        "131332":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "She works your cock back to attention and has her way with you, in her ass",
                "maid wants winry to eat out her ass/ or pussy"
            ],
            "content":"<div class=\"\"><div> <span>Winry's moaning loudly now, she notifies you that she is close to orgasm.<br>\r\nThe maid sits by, close but ready to do what she had come here to do, have sex. As the maid was watching your cock slide in and out of winry her hand was inside of her underwear, rubbing her pussy to the image of your cock sinking and rising through Winry’s folds.<br>\r\nAs you think back to how you thought the night was going to go you say a quick thank you to whatever god or gods were listening and turned your attention to not ejaculating your sperm until winry had been satisfied, which seemed close now. Especially when she suddenly let herself fall into your lap, stopping her wild ride, and screaming loudly as she came on your lap. Juices flowed down her pussy past you cock and onto your pants. As she sits there panting, you decide its your turn to come and start thrusting upward into her yet again, you can tell its somewhat painful to her after the massive orgasm, but you know she will thank you later.<br>\r\nFinally you come deep inside her vagina. As the orgasm subsides winry gets back into her seat for a break. the maid doesn’t like that idea and goes over to winry and starts cleaning her pussy with her tongue, making it all clean, she then moves onto you and also cleans you off, licking and sucking your cock till its glistening.<br>\r\nAfter the maid finishes she looks at you and winry, assessing your obvious states. What next?  <br>\r\n</span></div></div>",
            "created":1256014800,
            "id":778747,
            "title":"winry cums and the maid cleans both of you with..."
        },
        "132":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "she releives you of ass duty and lets you eat her pussy",
                "she lets you continue and asks you to shove your cock in",
                "she insists on eating your ass out"
            ],
            "content":"<div class=\"\"><div> <span>At this point. You have pissed winry off. You knew you should have warned her, but something about cuming in her mouth without her knowing when just made you irrational. So by now winry is on her feet and you can see the lines of anger on her face. Something others would miss, but your attention to detail is unmatched. You wait for her to say something, knowing what you say will be used against you. Finally she starts talking, something about being rude, not tapping her on the shoulder or letting her know. You apologize and ask what you can do for her to forgive you. The lines go away and something else replaces them, something that turns you on inside. You can truly tell, and then it hits you. It’s a cynical sort of look, something that means good for her but bad for you.<br>\r\n<br>\r\nWinry gets up off her knees, knowing by now what she wants you to do. She places her hand on your face, holding your chin, almost like she was going to kiss you, but something else was going on. She finally tells you.<br>\r\n\"You sir, are going to eat my ass out\". She says in one of her sexual tones. She turns and gets back on her knees, then lays herself out on all fours, ass sticking up in the air. You too sink to your knees, starring at her hole, you lean you head in closer, circling it, not willing to go deeper with your tongue just yet. Winry isn’t that patient. She moves back, forcing you to stick your tongue in deeper. By now it doesn’t matter to you, your into it, the feeling of her skin under your tongue is sensational, making you want more. By now you feel like your eating ice-cream and you just keep licking, loving it. What next? <br>\r\n</span></div></div>",
            "created":1263264900,
            "id":819072,
            "title":"shes mad that you didnt warn her and makes you ..."
        },
        "135":{
            "choices":[
                "(once awake) pick her up and shove it in her more times",
                "force her to suck ur dick",
                "kiss her ass and then shove it in"
            ],
            "content":"<div class=\"\"><div> <span>She wanted u too fuck her, she wanted it real bad. So u did it, ramming yourself in and out of her, repositioning yourself at different angles for different effects. you keep going and eventually cum, continuing your onslaught, you cum more and u couldn’t understand where the stamina came from but u kept going all day and through the night, with cum everywhere finally u give her 1 last load. You and she fall over and fall asleep in the shower with water still falling on you.</span></div></div>",
            "created":1273816860,
            "id":882958,
            "title":"She lets you screw her pussy, shes not even clo..."
        },
        "14":{
            "author_id":"ravad",
            "author_name":"Raith",
            "choices":[
                "A fellow army officer",
                "A State Alchemist",
                "A kid lusting after an older woman",
                "A superior officer lusting after a younger woman",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you want to sleep with Maria Ross, the motherly Second Lieutenant of the Amestris Army. Nice. <br>\r\n<br>\r\nBut who exactly are you?</span></div></span></div>",
            "created":1279317360,
            "id":919123,
            "title":"sleep with maria ross"
        },
        "15":{
            "author_id":"ravad",
            "author_name":"Raith",
            "choices":[
                "Going out",
                "You are Lust's prisoner",
                "Lust is your prisoner",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what's the scenario? <br>\r\n<br>\r\n1) You're going out with Lust<br>\r\n2) Lust has you captive<br>\r\n3) you have Lust captive</span></div></span></div>",
            "created":1282335060,
            "id":940167,
            "title":"have some fun with lust"
        },
        "152":{
            "author_id":"kwud",
            "author_name":"kwud",
            "choices":[
                "Lust has a whip",
                "Lust becomes inventive in her torture",
                "lust enjoys your body"
            ],
            "content":"<div class=\"\"><div> <span>You are a student of alchemy and have joined a secret brotherhood meant to capture and kill all homunculi. No matter how many homunculi you kill more pop up in another country and once those ones are defeated more pop up where they were before, it was tedious and you had more than 300 kills behind you. <br>\r\n<br>\r\nSitting in a bar you were inquiring about someone you had heard about. Apparently men of all ages went missing and some of them had been seen with here only hours before. The eyes of the visitors were all on you, you could feel them at your back, focused mostly on your giant sword, the same height as you with a gold trimmed green hilt. You go to order your food, \" ‘oy, barkeeper, ill take some vodka, and some information\". You say as you throw some money on the table. The barkeeper grabs a glass and pours your drink; you take this time to look through the patrons seated around you. Most were not focused on him anymore, but some, shady looking characters were still eyeing his sword with a glint in their eyes, probably some trouble a little later, oh well. <br>\r\n<br>\r\n\"here is your drink, what do you need to know?” Says the barkeeper as he scoops up your money, not bothering with change. \"There’s been someone around town, shady women character who may be connected with missing people\". He gives you some direction and soon you’re on your way. standing before a dark house, something out of a movie likely, you decide to walk in the front door, sword drawn you walk in. BAM, SMACK, TING, UGH.<br>\r\n<br>\r\nYou’re in the dark, your naked, and the airs cold on your bare skin. You hear laughing, and realize that you’re tied up spread eagle in the center of the room, suspended in mid air. And there she was, Lust.<br>\r\n<br>\r\n<br>\r\nWhat next?<br>\r\n</span></div></div>",
            "created":1282634520,
            "id":942650,
            "title":"You are Lust's prisoner"
        }
    },
    "info":{
        "author_id":"kwud",
        "author_name":"kwud",
        "brief_description":"Full metal alchemist hentai story",
        "created":1255320840,
        "description":"<td align=\"left\" class=\"norm\">This story is a hentai make of Full metal alchemist, be creative dont make really short chapters and go wild.<br>\r\n<br>\r\nmy only rule is that if your going to rate it, give me a reason for the rating you give <br>\r\nplease also note while rating that the story is not that long as of yet. other than that enjoy the GP for your review.</td>",
        "id":1607555,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1282650300,
        "modified":1282650300,
        "pretty_title":"Full Metal Hentai"
    }
}