{
    "chapters":{
        "1":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Goku",
                "Vegeta",
                "Gohan",
                "Trunks",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Starting off, which guy shrinks?</span></div></span></div>",
            "created":1321506000,
            "id":1224640,
            "title":"Time for CHOICES!!!"
        },
        "11":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Chichi",
                "Bulma ",
                "Android 18",
                "Princess Snake",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, who shrinks him?</span></div></span></div>",
            "created":1321592400,
            "id":1225267,
            "title":"Kakarot!"
        },
        "115":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Pan",
                "Bulla/Bra",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of the ladies of GT?</span></div></span></div>",
            "created":1321592400,
            "id":1225269,
            "title":"GT Babes"
        },
        "1151":{
            "choices":[
                "Child Goku",
                "Adult Goku"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay is Goku in his child body or is he back to being an adult?</span></div></span></div>",
            "created":1327554000,
            "id":1266047,
            "title":"Pan"
        },
        "11511":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "Goku is much weaker then he should be ",
                "Goku's strength still proportional to his size"
            ],
            "content":"<div class=\"\"><div> <span>It was a time of peace on earth. Pan was constantly upset that she couldn't get Goku in a duel feeling like she should be able to beat someone smaller then her with all the huge opponents she beat in the past. As that thought goes through her head she gets an idea and goes to capsule corp to \"barrow\" an invention from Bulma. When she gets it she goes to find Goku to challenge him to another duel. Pan get Goku to agree to a duel where she gets a \"little\" handicap and the loser will have to do the winners chores. <br>\r\n<br>\r\n\"So whats the handicap Pan\" Goku asks. <br>\r\n<br>\r\n\"Just close your eyes and wait a sec,\" She reply's.<br>\r\n<br>\r\nAs Goku closes his eyes Pan pulls out a shrink ray and shoots it at Goku. He laughs as it hits him obviously making him ticklish. Pan shrinks him down to about 8\" and tells him to look. Goku looks up to see Pan towering over him with one fist in her other hand. The duel begins...</span></div></div>",
            "created":1477112400,
            "id":2227203,
            "title":"The duel"
        },
        "115111":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "keep going",
                "make him clean her room at his size"
            ],
            "content":"<div class=\"\"><div> <span>\"Ready...Go\" Pan says as she stomps down on Goku. He barely avoids it using instant transmutation to get behind her and starts flying away. Pan sees him and dives over him punching Goku straight into the ground. Pan stands over him as he recovers.<br>\r\n<br>\r\n\"Come on little guy I'm not going to be doing all the attacking am I?\" Pan asks with her hands on her hips giving a small head lean.<br>\r\n<br>\r\nGoku gets up and quickly starts blasting off KI blasts as he flys in circles around her. At first Pan thought he was playing around with the weak blast that she could hardly feel but, then she notices the focus he has and can't help but tilt her head back to laugh. Goku sees this and starts to charge a Kamehameha blast and fires it at Pan's face.<br>\r\n<br>\r\n\"You should try harder then that shrimp,\" Pan says as she simply flicks the blast away. She then turns pointing her hand at him aiming one simple KI blast which sends Goku flying into the ground. She then steps on him grinding a little as she decides what to do next.</span></div></div>",
            "created":1477112400,
            "id":2227209,
            "title":"Goku is much weaker then he should be "
        },
        "1151111":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "shrink him again",
                "try the recharge (growth) button on herself"
            ],
            "content":"<div class=\"\"><div> <span>Pan stops grinding her foot on her grandpa and only when she stopped could she feel Goku trying to lift her. It was clear that Goku was now powerless against Pan so she looks around hoping for an idea of what she should do next. Then she sees the shrink ray and decides to go grab it. As soon as she takes a step Goku goes as fast as he can to flee from her she grabs the ray gun and suddenly vanishes, only to reappear above Goku. She lands with Goku helpless under her butt and starts looking at the gun.<br>\r\n<br>\r\nShe knew it took the energy out of objects and thats what makes them shrink but this was the first time she saw the meter saying it was 80% full and the recharge button which she thought puts the the energy back into an object. She decides to...</span></div></div>",
            "created":1477112400,
            "id":2227258,
            "title":"keep going"
        },
        "11511111":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "does",
                "runs away"
            ],
            "content":"<div class=\"\"><div> <span>Pan decides she may want to see what 100% would do to Goku but first scoots back and brings her feet to both sides of Goku and says, \"hey shrimp you better clean my shoes really good or you'll be a lot smaller.\" She points the gun causing Goku to start immediately. When he is done she looks them over to find its the first time in months that they shined. <br>\r\n<br>\r\n\"Not bad for a little guy,\" she says, \"But I still want to shrink you.\" She blasts him till the meter says 100% making Goku 1\" tall. She pinches him between her fingers so she can have a closer look when she hears a voice behind her.<br>\r\n<br>\r\n\"So this is where my ray gun went.\" <br>\r\n<br>\r\nPan turns around to see Bulma behind her in a tech suit that looks just like her space suit from Namek. She tells Pan to hand it over and Pan... </span></div></div>",
            "created":1477201680,
            "id":2227272,
            "title":"put to work"
        },
        "115111111":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "follow Bulma",
                "stay with Pan"
            ],
            "content":"<div class=\"\"><div> <span>Pan hands over the shrink ray to Bulma and turns away acting like she was getting in trouble for harmless fun. Bulma looks over the gun and sees its at 100% which she finds amazing considering she held entire mountains in her hand only using a percent or 2. She looks at Goku and realizes it also must absorb power levels. Bulma quickly turns the gun around and presses the return button. Bulma grows to 15ft tall reverting back to her 22 year body shape except bigger thighs and DD breasts. Bulma takes a moment to look over and enjoy her body before turning to Pan and giving her a little \"tip.\" A blast from the gun makes Pan grow to 7ft tall with a body matured to Videl's age when she meet Gohan.<br>\r\n<br>\r\n\"This is a good start,\" Bulma says, \"but I won't be happy till i get the chance to dominate Vegeta.\"<br>\r\n<br>\r\nBulma seems to vanish as she leaves using her new found speed. Pan picks up Goku and sets him in her palm.</span></div></div>",
            "created":1477261920,
            "id":2227516,
            "title":"does"
        },
        "11511112":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "goes super saiyan",
                "shrinks the other z-warriors "
            ],
            "content":"<div class=\"\"><div> <span>Pan points the gun at herself and presses the recharge button. She feels an amazing warmth all over her body and watches the environment shrink around her. As she grows her body also changes with her figure becoming more matured including her butt and boobs. Her muscles expand giving her a six pack and some biceps. She stops at bout 20 ft tall and decides it's a good time to get off Goku. Goku looks up to see Pan is now standing over 30 time his size.<br>\r\n<br>\r\n Pan decides to try her new strength and jumps forward punching a mountain. She expects to be able to make a hole at least half way through the mountain but her punch completely blows the mountain away. She looks at her fist saying \"Well i guess that is where all your Ki went grandpa.\" Pan now has Goku's power so she...</span></div></div>",
            "created":1477198800,
            "id":2227265,
            "title":"Pan fully charged"
        },
        "115111121":{
            "author_id":"dansaltsc",
            "author_name":"danni",
            "choices":[
                "Goku agrees.",
                "Goku disagrees! Not a smart idea!"
            ],
            "content":"<div class=\"\"><div> <span>She grins as she says \"Now.. Let's see what happens when I go.. SUPER SAIYAN!\" with a laugh.<br>\r\n<br>\r\nHer voice boomed for miles. She clenched her fists tight as she began to power up, Goku had to start backing away as fast as he could. Pan was growing again!<br>\r\n<br>\r\n\"Sweet!\" She yells as she shoots up to 60 ft. She began to stroke her now yellowed hair.<br>\r\n<br>\r\n\"Crap.. We're gonna need some way to stop her..\" Goku thought to himself, almost afraid of what she was capable of.<br>\r\n<br>\r\nShe grins and says \"Now.. How about a nice foot rub for your 60 ft goddess..\" with a smirk.</span></div></div>",
            "created":1540903440,
            "id":2570591,
            "title":"Super Saiyan Pan!"
        },
        "1151112":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "more chores (maybe redo desk smaller)",
                "trap him and find someone else to shrink"
            ],
            "content":"<div class=\"\"><div> <span>Pan decides it's time for Goku to pay up so she lifts her foot then delivers a hard punch knocking him out. She then places Goku in her pocket so none notices her bringing him home. When Pan gets to her room she takes out Goku and tosses him on the bed then plops down next to him. She watches till he starts to wake then she softly pokes him in the head. When he opens his eyes Pan tells him to get started cleaning. <br>\r\n<br>\r\nPan lays on her bed watching Goku clean her room till he finishes then, she moves over to the desk and tells him to land on it. When Goku lands Pan pulls out the shrink ray and shrinks him to half an inch. Then Pan knocks over her pen holder and throws her folders of school papers on the desk and demands that Goku does his job of cleaning her room. Goku gets to work, slowly since the shrink ray now made him only as strong as when he was originally a child. Pan watched him work as she supported her head with one hand. Pan loved the feeling of power she held over him and had the thought of just smashing him under her hand in the back of her mind the entire time.<br>\r\n<br>\r\nWhen Goku finish Pan's thanks was shown by flicking him into the side of the desk then holding him under her finger till she decides what to do next.</span></div></div>",
            "created":1478417640,
            "id":2233456,
            "title":"make him clean her room at his size"
        },
        "11511122":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "Pan keeps playing",
                "Gohan comes home"
            ],
            "content":"<div class=\"\"><div> <span>Pan holds Goku down as she thinks of what she wants to do but, nothing comes to mind so she takes her chain out of her pocket and ties Goku up then puts him back in her pocket. Pan walks out to go look around town for something to do. She walks into the living room where her mom Videl stops her. Videl tells Pan she needs to wash the dishes and stop ignoring her chores. Pan smiles as she walks up to Videl and causally shots her with the shrink ray. <br>\r\n<br>\r\nShe shrinks Videl to half her size then tells her mom, \"make me a snack then you can start cleaning the house for me.\" Videl thinks of resisting but when Pan see this she shoves Videl on her butt and points the shrink ray at her. \"You will just make the chores harder if you make me punish you.\" Pan says as she turns to go watch TV. She turns her head to add, \"I want you to make me some cookies.\"<br>\r\n<br>\r\nVidel gets to work on the cookies as Pan sits down and turns on the TV. To use the TV Videl needs to fly which she finds very hard with the energy drain. When Videl puts the cookies in the stove she turns to do the dishes and sees Pan infront of her with a stool. \"Here you can use the stool I need when I was as little as you.\" Pan teases. Pan puts down the stool and Videl stands on it and even then only comes up to Pan's chin. Pan then gives Videl a big hug, \"look how cute my little helper is.\" teasing what Videl did to her when Pan was little. Embarrassed Videl tries to pull away but Pan holds her there with almost no effort. \"Come on mom I could break out of your grip at this size.\" <br>\r\n<br>\r\nPan has her fun for a little longer before returning to the TV. Videl finishes the dishes then takes out the cookies and then goes to serve them to Pan. When she enters the room Pan sits up straight so Videl sees that Pan is still bigger sitting down. </span></div></div>",
            "created":1478470620,
            "id":2233664,
            "title":"bored and need new toys"
        },
        "115111221":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "Gets more toys to battle",
                "puts them away to do something else"
            ],
            "content":"<div class=\"\"><div> <span>Videl places the cookies on the table and turns around to see the shrink ray right in her face. Pan then shrinks her to a foot tall. Pan then reaches into her pocket and pulls out Goku and unties him before tossing him on the ground. Pan grabs a cookie and explains that she wants them both to fight for to entertain her. At 1st they try to resist but, when Pan waves the shrink ray Videl quickly tries to stomp on Goku he dodges and they began to fight. They are pretty evenly matched with the power drains and the size difference so they make a great show for Pan as she eats her moms cookies.<br>\r\n<br>\r\nSoon Goku's endurance runs out and Videl is named the victor. So Pan...</span></div></div>",
            "created":1479013020,
            "id":2236267,
            "title":"Pan keeps playing"
        },
        "12":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Bulma",
                "Bulla/Bra",
                "Chichi",
                "Android 18",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, who dares shrink the Prince of all Saiyans?</span></div></span></div>",
            "created":1321592400,
            "id":1225271,
            "title":"The Prince"
        },
        "121":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "Vegeta was 20 times weaker then her (shrink)",
                "Bulma was 20 times stronger then him (giantess)",
                "Vegeta got smaller and weaker every time he didn't listen to her"
            ],
            "content":"<div class=\"\"><div> <span>Bulma and Vegeta always had an interesting relationship mainly with Bulma living and working in the lab and Vegeta coming and going as he pleased. Although that was normally fine it sometimes left Bulma upset as she need to take care of their kid Trunks. It was one of those days that Vegeta was no where to be found leaving Bulma with Trunks when she had a deadline for a huge company project at the end of the day, and on top of that tomorrow was her birthday. Then about half way through the day, right when Bulma starts to wonder what it would be like if she got to go on crazy adventures like she use to and make Vegeta take care of the family, Goku comes by with an early gift for her she opens it to find all 7 dragon balls. This was perfect now all Bulma needed was to pick out the perfect wish for her problem. Goku watches Trunks to allow Bulma to complete the project and everything is settled when Vegeta gets back. Bulma summons the dragon and wishes.</span></div></div>",
            "created":1477266480,
            "id":2227543,
            "title":"Bulma"
        },
        "1213":{
            "author_id":"karganlord",
            "author_name":"Bombadilboy",
            "choices":[
                "Vegeta shows up at home late after training, hungry for dinner",
                "Vegeta doesn't come home that night at all, angering Bulma to an extreme",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"I wish for the power to shrink men and grow women as I choose! The power of a goddess!' Bulma yells to the levitating Shenron.<br>\r\n\"Your wish...is granted,\" the dragon replied, and his eyes began to glow red. Instantly, Bulma felt a massive increase in power all throughout her body, accompanied by the bodily figures and confidence to fit the role as she saw fit.<br>\r\nWith that, Shenron disappeared and the Dragon Balls scattered into the four winds, becoming inactive until next year. <br>\r\nBulma marveled at her new body until she remembered Vegeta, the very thought of which made her clench her fists in frustration normally. But now, all she did was grin evilly as she walked back inside their house to eagerly await her husband's return. </span></div></div>",
            "created":1486499580,
            "id":2274735,
            "title":"Bulma Puts Her Foot Down"
        },
        "13":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Bulma",
                "Chichi",
                "Videl",
                "Android 18",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shrinks him?</span></div></span></div>",
            "created":1321506000,
            "id":1224642,
            "title":"The half saiyan"
        },
        "134":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "Teen Gohan",
                "Adult Gohan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last question, which Gohan ?</span></div></span></div>",
            "created":1478639400,
            "id":2234457,
            "title":"Gohan shrunk by Android 18 ?"
        },
        "1341":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "18 decides to torture him",
                "18 goes inside Gohan's home and shrinks Chichi as well",
                "Gohan escapes her hand and try to fight her in ssj2"
            ],
            "content":"<div class=\"\"><div> <span>It's been 3 months since Cell was defeated, and 18 spent her time to find every old locations of dr Gero's labs to destroy the places. But in the last lab she went, she found something which got her attention : a prototype of gun able to shrink a human. According to the files, this project was supposed to be used only if 17 and 18 have failed in their task to kill Goku.But Dr Gero gave up on the project and never tested the weapon, since he thought that only the Android 19 would be enought to fullfill their mission.<br>\r\n<br>\r\n18 grabbed the gun and looked at it. \"<i> Interesting only if it works</i>\" she thought as she remembered that one of Goku's friend at Kami's lookout said that she will never be able to defeat Gohan. \" <i>hmmm..let's see if i really can't defeat Gohan now </i>\" 18 smiled at the thought of the fun she could have...So she kept the gun with her and flew away.<br>\r\n<br>\r\nThe android remembered where was Goku's house, and she was sure to find Gohan. What she didn't expect, was to see him standing outside, as if he was waiting for her. <br>\r\n<i>\"yeah he can sense my Ki now that i'm human...Never mind \"</i> she said to herself while landing in front of Gohan who looked suspicious.<br>\r\n<br>\r\n\" What are you doing there ? \" he asked.<br>\r\n<br>\r\n\" Just want to have some fun with you \" 18 replied while aiming the gun at Gohan and fired. Gohan then disappeared suddenly from 18's sight but the truth was that he only had shrunk to the size of an ant !<br>\r\n<br>\r\n\" What's the,,,,what did you do to me ?! \"  He yelled to the now giant android who quickly scooped him up in her huge hand. She smiled at him. The current most powerfull warrior on Earth was now hers.<br>\r\n<br>\r\nWhat happens now ?</span></div></div>",
            "created":1478643780,
            "id":2234485,
            "title":"Evil 18 is back"
        },
        "135":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Bulla/Bra",
                "Pan",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, then choose from among these!</span></div></span></div>",
            "created":1321506000,
            "id":1224644,
            "title":"More choices"
        },
        "1353":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Oh yeah!",
                "No thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>No? Then how about the sexy blue alien woman, Zangya, from the DBZ Movie \"Bojack Unbound\"?</span></div></span></div>",
            "created":1321506000,
            "id":1224647,
            "title":"Even more choices"
        },
        "13531":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "1 inch tall",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>After Bojack had been defeated by Gohan, Zangya decided to join the Z-Fighters and become good. Though her evil tendencies had not yet completely subsided. A plan was brewing in her pretty little head, and it involves our hero Gohan. She had snuck into the Briefs house Capsule Corp. and stolen Bulma's recently developed shrink ray. After she stole it, she called Gohan. \"Hey Gohan\" she said \"can you meet in the woods outside your house? I have something I want to show you\". \"Uh, sure...I guess\" Gohan replied slightly puzzled. \"Great! See you in a little bit\" she said. Later in the woods, Gohan meets up with Zangya. \"Hey, whats up Zangya? Is something wrong\"? He said a little concerned. \"Oh no, not at all, I just wanted to show you.....THIS\"! She said quickly pulling out the shrink ray and firing it. Before Gohan could react he was hit with the lazer. The question now is, what size does he shrink to?</span></div></div>",
            "created":1321506000,
            "id":1224662,
            "title":"The shrinking begins"
        },
        "135311":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Foot Fun?",
                "Nope"
            ],
            "content":"<div class=\"\"><div> <span>Before he knew what hit him, Gohan was a mere one inch tall. He looked around scanning his newly enlarged enviornment when suddenly he heard a loud *BOOM*. He looked <br>\r\n<br>\r\nto the direction of the noise to see a gigantic yellow boot in front of him. As he looked up he saw a giant leg connected to the foot, a giant waist connected to the leg, a well <br>\r\n<br>\r\ntoned stomach above the waist, a beluptuous and perky pair of breasts above that, and finally he saw Zangya's gigantic, gorgeous blue face. \"Zangya! What happened?! What's <br>\r\n<br>\r\ngoing on\"?! Gohan asked frantically. \"Awww\" said Zangya as she crouched down to get a better look at Gohan at his new miniscule size. \"You look so adorable\" she snickered. <br>\r\n<br>\r\nAs she crouched down Gohan saw just how small he really was as he got a close up view of Zangya's face. He could feel her warm breath as she exhaled, it was almost <br>\r\n<br>\r\noverwhelming. \"Why did you shrink me like this\"?! He inquired. \"I thought we were friends\"! \"Oh we are Gohan, we are, don't get the wrong idea\" she explained. \"I would never <br>\r\n<br>\r\npurposely hurt you\". \"Then why\"? Gohan asked. \"It's simple\" she said as she went to grab him. \"I just want to have a little fun\" she said giggling. Gohan tried to make an <br>\r\n<br>\r\nescape attemt and fly away, but quickly found out that at his new small stature his power had diminished as well as his size and he couldn't fly. Zangya capitalized on the <br>\r\n<br>\r\nopportunity during Gohan's confusion and wrapped him around her hand. \"Ha! Gotcha little one\" she said as she stood up lifting Gohan to her face. \"I think it's time we had a <br>\r\n<br>\r\nlittle *fun*\" she said winking at Gohan which sent a small chill down his spine. What type of \"fun\" is she referring to?</span></div></div>",
            "created":1321592400,
            "id":1224889,
            "title":"The Tiny Hero"
        },
        "1353111":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Wake her up",
                "Try to run"
            ],
            "content":"<div class=\"\"><div> <span>\"Alrighty Gohan\" said Zangya. \"For starters, I'll have you do something easy\". She said removing her boots. \"U-uh, l-like what\"? Gohan asked hesitantly, seeing Zangya taking <br>\r\n<br>\r\noff her socks now. \"Isn't it obvious\"? She replied placing her big sexy bare blue feet in front of Gohan with a *PLOP*. \"You're going to rub my feet silly\" she said giggling while <br>\r\n<br>\r\nflexing her toes. \"I was afraid you were going to say that\" Gohan replied taking a small step back.\"Oh c'mon, they don't even smell bad. PLEEAASSSEE\"? She asked giving <br>\r\n<br>\r\nGohan her best pouty face and puppy dog eyes. \"Ugh...\" he said. \"Do you promise to unshrink me after you've had your fun\"? He asked. \"Oh yeah, yeah, of course\" she replied <br>\r\n<br>\r\nnodding her head. \"Well...\" said Gohan as he took a few steps toward the gargantuan feet in front of him. He barely came up to Zangya's heel in height. 'This is supposed to be <br>\r\n<br>\r\neasy'? He thought to himself. \"Alright then, I'll do it\" Gohan agreed. \"Yay\"! Exclaimed Zangya as she flexed her toes some more in anticipation. \"Thank you, thank you, thank <br>\r\n<br>\r\nyou\" she continued. \"And who knows, if you do a good enough job I may give a little *reward* she said giving him a little wink and blowing him a kiss. This made Gohan <br>\r\n<br>\r\nblush \"Uh, okay then, I guess I better get started\" he said. He began rubbing her left heel and realized it was pretty soft considering she was a fighter. Her feet didn't really stink <br>\r\n<br>\r\ntoo badly either, which surprised him. Instead, he was greeted with the pleasant smell of strawberries and cream. 'It must be her lotion' he thought to himself. As he continued <br>\r\n<br>\r\nto rub her heel he began to add more and more presure. \"Mmmm, that's niiiccee\" said Zangya rolling her head back and relaxing. \"Glad you like it\" said Gohan \"but I can't reach <br>\r\n<br>\r\nany higher, can you roll onto your stomach so I can rub the rest of your feet\"? He asked. \"Sure\" she replied. \"After all, it wouldn't be much of a foot massage if you only rubbed <br>\r\n<br>\r\nmy heels\" she said smiling. Gohan returned the smile as she rolled onto her belly, folded her arms in front of her and rested her head. \"Continue\" she said closing her <br>\r\n<br>\r\neyes. \"Yes, your majesty\" Gohan said sarcastically as he walked up her left foot to her arch and began to rub. As he continued to rub vigirously he kept hearing small moans <br>\r\n<br>\r\nfrom Zangya indicating he was doing a good job. He began rubbing out all the wrinkles in her soles in an up and down motion. As he got to the ball of her left foot he switched it <br>\r\n<br>\r\nup and began to rub in a circular motion. \"Oooohhhh yeeeaahhh\" said Zangya as she was clearly getting a lot of pleasure and enjoyment out of her little foot treatment. After <br>\r\n<br>\r\nrubbing the ball of her foot for a while, he moved down to her toes, starting from smallest to biggest, massaging each one individually. \"Mmmmm, dont forget to rub inbetween <br>\r\n<br>\r\nthe toes too\" she said in a sleepy tone. \"Yes your heighness\" said Gohan as he began to rub between Zangya's big and middle toes. Once he was done with her left foot, he <br>\r\n<br>\r\nmoved on to the right one, giving it the same treatment. Starting at her heel, working his way down to her arch and sole, then to the ball of her foot, and then down to the toes. <br>\r\n<br>\r\nAs he finished rubbing her big toe he kissed it giving it a small peck to let her know he was finished. However, to his surprise, he heard snoring. \"Zzzzzz\". She was fast asleep. <br>\r\n<br>\r\nDoes Gohan try to wake Zangya, or does he try to run away.</span></div></div>",
            "created":1321592400,
            "id":1224923,
            "title":"Pretty Blue Feet <3"
        },
        "1353112":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Oh yeah!",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about some Big Ol' Blue Booty Fun?</span></div></span></div>",
            "created":1321592400,
            "id":1224892,
            "title":"Choice #2"
        },
        "13531122":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Yay Boobies!",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright then, how about some fun time with Zangya and her big, beluptuous, and perky tatas?</span></div></span></div>",
            "created":1321592400,
            "id":1224896,
            "title":"Tig Ol' Bitties"
        },
        "135311221":{
            "choices":[
                "Take the chance Gohan! sleep between her breasts!",
                "Don't do it Gohan, sleep on the ground!"
            ],
            "content":"<div class=\"\"><div> <span>\"What kind of fun did you have in mind, Z-Zangya?\" Gohan stuttered a bit, feeling nervous. Zangya had a sly (or mischievous, I dunno) smile on her face as she lifted Gohan towards her shirt collar. Gohan knew what she was gonna do and tried to get away, failing to do so. Zangya opened up her shirt collar, put Gohan between her breasts, and started squeezing them together, making Gohan feel embarrassed and blush a deep shade of red. When Zangya was done squeezing her boobs together, she took Gohan out, who was blushing a deep red, and Zangya knew what to say to embarrass him more. \"You liked it in there, huh Gohan?\" Gohan turned so red it wasn't even funny. \"I did li- I mean didn't like it, WAIT, I mean- Ah, I don't know what I mean..\" Gohan said while Zangya was about to burst out laughing. She ended up calming herself down, and stretched her arms out, ready to go take a nap. \"Whew, I'm tired.. Gohan, you tired as well?\" Zangya asked after yawning. \"Well, I'm kinda tired, but I can sta- WOAH!\" Gohan was cut off when Zangya picked him up, and still had that mischievous smile pn her face. \"Well, How about you sleep with me?\" Zangya asked with that mischievous smile still on her face. Gohan thought she wasn't going to take no for an answer, so he said yes. \"But where will I sleep?\" Gohan asked. \"Well, you can either sleep on the ground, or..\" Zangya then lifted Gohan to her chest. \"In between my breasts.\" \"Uh..\" Gohan was now blushing again. Where does he decide to sleep?</span></div></div>",
            "created":1328072400,
            "id":1269162,
            "title":"Yay Boobies!"
        },
        "135311222":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Woohoo!",
                "Try again..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hmmm, let's see then.....I got it! How about a little pussy playtime then?</span></div></span></div>",
            "created":1321592400,
            "id":1224901,
            "title":"Geez your picky"
        },
        "1353112221":{
            "choices":[
                "He comes back out of Zangya's Vagina",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"I know what we can do, Gohan!\" Zangya said, holding Gohan. \"And that is..?\" Gohan asked. He got his answer when he was thrown into Zangya's purse, and she started walking towards her home. Zangya walked to a cottage next to a lake. She then went inside, undressed herself, And got Gohan out, who was almost asleep, due to boredom. Zangya went into the bathroom's bathtub, laid in it, and waited for Gohan to wake up. It was almost ten minutes later when Gohan woke up, only to have his back faced away from Zangya. When he turned around, He bumped into something rather... Fleshy. What he had actually bumped into was Zangya's uncovered nipple! Gohan was shocked; He never expected her to act like this. \"Gohan...\" Zangya asked. \"What, Zangya?\" Gohan answered back. \"This is the 'thing' I said we were going to do.\" Zangya then proceeded to turn over, so her pussy was facing Gohan. \"Why are you doing that, Zangya?\" Gohan questioned, completely confused. \"Your a smart kid I'm pretty sure you can figure out what I want you to do.\" Zangya then stretched out her pussy so it looked like a walkway. \"Gohan, don't be shy, Just walk on in. I don't mind.\" Zangya said a little bit quietly. Gohan hesitated a bit before walking into Zangya's womanhood. It was wide enough to walked for about 1/2 an inch, then he had to get on his knees to go further. Later on he started crawling through her pussy, trying to make as little movements as possible, because Gohan didn't want to drown due to Zangya orgasming. \"It's alright to squirm a bit, Gohan. I could use some excitment.\" She said feeling him move deeper and deeper inside of her. He eventually made it to her Womb, but he was thinking he should come back out.</span></div></div>",
            "created":1328072400,
            "id":1269173,
            "title":"Trip into Zangya's Womanhood"
        },
        "1353112222":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "YES!",
                "Keep going...."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, then how about we have Gohan play mini dentist and explore inside Zangya's sexy mouth?</span></div></span></div>",
            "created":1321592400,
            "id":1224905,
            "title":"Mouth Fun?"
        },
        "13531122221":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Yes....For now",
                "Nope, He's sexy alien food"
            ],
            "content":"<div class=\"\"><div> <span>“Ah” said Zangya snapping her fingers. “I know exactly what I want you to do”. “And that would be”? <br>\r\n<br>\r\nGohan asked. “You'll see” she said winking at him as she reached into her pocket. “Here ya go” she <br>\r\n<br>\r\nsaid handing Gohan a miniature tooth brush. “Um, what am I supposed to do with this”? He asked. <br>\r\n<br>\r\n“You're a smart guy” she replied “You figure it out” opening her mouth wide and pointing to it. This <br>\r\n<br>\r\ngave Gohan plenty of indication as to what she wanted him to do and exactly where she wanted him to <br>\r\n<br>\r\ngo. “Aw, c'mon Zangya”! Gohan exclaimed. “What”! She retorted. “It's not like my breath stinks or <br>\r\n<br>\r\nanything” she said giving him a pouty face. “But what if I accidentally slip and fall down your throat or <br>\r\n<br>\r\nsomething”? He asked nervously. “Well, then you'll have to be extra careful then won't you”? She <br>\r\n<br>\r\nretorted. “You're not giving me choice are you”? He asked in a monotone voice. “Nope” she said with a <br>\r\n<br>\r\ngoofy grin. “Ugh....Let's just get this over with” he said. “Yay”! Zangya exclaimed. “I knew you'd <br>\r\n<br>\r\ncome around” she said as she opened her mouth and rolled out her tongue for Gohan. “Thanks for <br>\r\n<br>\r\nrolling out the red carpet” he said sarcastically causing her to smile. As he walked from the palm of her <br>\r\n<br>\r\nhand to her soft red tongue he could make out all the details in the aliens mouth from her pearly white <br>\r\n<br>\r\nteeth, to the roof of her mouth, to the back of her throat. Zangya could hear Gohan's squishy steps as he <br>\r\n<br>\r\nmade  his way onto her tongue. Once he was firmly on her tongue she retracted it inside her mouth <br>\r\n<br>\r\nkeeping it open so that Gohan could see what he was doing. “Ake ure you're extwa areful” (Make sure <br>\r\n<br>\r\nyou're extra careful) said Zangya “You don't have to worry about that” replied Gohan. “And try not to <br>\r\n<br>\r\ntalk too much, or I might slip and fall down your throat”. Zangya nodded and Gohan began brushing. <br>\r\n<br>\r\nHe started with the bottom left row of teeth and worked his way around. Before he started on the top <br>\r\n<br>\r\nrow he looked back to see the one place he definitely didn't want to end up. He saw Zangya's cavernous <br>\r\n<br>\r\nthroat and dangling uvula. 'I need to hurry up and finish this so I can get outta here' he thought. He <br>\r\n<br>\r\nquickly finished the top row of teeth and began scrubbing Zangya's tongue. Zangya suddenly felt a <br>\r\n<br>\r\nhuge tickling sensation in her mouth from Gohan's scrubbing. She tried the best she could to keep from <br>\r\n<br>\r\nbursting out laughing. Her face was beginning to turn red and she couldn't hold it in anymore. She <br>\r\n<br>\r\nbegan giggling hysterically. The vibrations of Zangya's giggling sent Gohan slipping and sliding all <br>\r\n<br>\r\naround her mouth. “Zangya! Stop or you might-”!!! He was interrupted as he was abruptly tossed to the <br>\r\n<br>\r\nback of Zangya's mouth and on reflex GULP Zangya swallowed Gohan without thinking during her <br>\r\n<br>\r\nlaughing fit. Suddenly, she turned stone faced when the realization hit her. She moved her hand to her <br>\r\n<br>\r\nneck to feel Gohan struggling down her throat and into her waiting belly. “GASP! Oh no, oh no, oh no, <br>\r\n<br>\r\nwhat am I gonna do”?! She asked herself frantically. Meanwhile, things aren't going too well from <br>\r\n<br>\r\nGohan's perspective. “Ugh” is all he could say as he was pushed downward from all sides by Zangya's <br>\r\n<br>\r\npowerful throat muscles. He could barely move at all. Then he was suddenly pushed against the <br>\r\n<br>\r\nopening to her stomach. It immediately opened up to accept it's newest inhabitant for his short stay. <br>\r\n<br>\r\nGohan is quickly plummeting to the bottom of Zangya's belly. But will he be okay?</span></div></div>",
            "created":1321592400,
            "id":1225135,
            "title":"In Zangya's Mouth"
        },
        "13532":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Oh yeah!",
                "No thanks, don't care for snake ladies"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Princess Snake? Lots of possibilities there....</span></div></span></div>",
            "created":1321592400,
            "id":1224977,
            "title":"More sexy blue women"
        },
        "135322":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Sure",
                "No way! I hate GT!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Oceanus Shenron of the Shadow Dragons? (From Dragonball GT)</span></div></span></div>",
            "created":1321592400,
            "id":1224979,
            "title":"Another Blue Lady"
        },
        "1353222":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Yeah",
                "NO! I said I hate GT!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, how about Marron, Krillin's daughter?</span></div></span></div>",
            "created":1321592400,
            "id":1224982,
            "title":"The blonde bombshell"
        },
        "13532222":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "Yes !",
                "No, this is not Dbz"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what about Towa, from Xenoverse ?</span></div></span></div>",
            "created":1475989200,
            "id":2221157,
            "title":"NO! I said I hate GT!"
        },
        "14":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Bulma",
                "Bulla/Bra",
                "Chichi",
                "Android 18",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shrinks our hero?</span></div></span></div>",
            "created":1321592400,
            "id":1225272,
            "title":"Hero of the Future"
        },
        "144":{
            "author_id":"251enon",
            "author_name":"152",
            "choices":[
                "Main timeline 18",
                "Future 18"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which version of 18?</span></div></span></div>",
            "created":1442811600,
            "id":2037758,
            "title":"Android 18"
        },
        "15":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Goten ",
                "Krillin",
                "Yamcha",
                "Tienshinhan",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then what about these guys?</span></div></span></div>",
            "created":1321592400,
            "id":1224973,
            "title":"Choices"
        },
        "151":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Chichi",
                "Bulma",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shrinks the half saiyan?</span></div></span></div>",
            "created":1321592400,
            "id":1225278,
            "title":"Goten Huh?"
        },
        "1511":{
            "choices":[
                "7 yr Goten",
                "GT age Goten"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay is Goten 7 or is he as old as he is in GT?</span></div></span></div>",
            "created":1327554000,
            "id":1266049,
            "title":"Chichi"
        },
        "1512":{
            "choices":[
                "7 yr Goten",
                "GT age Goten"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay is Goten 7 or is he as old as he is in GT?</span></div></span></div>",
            "created":1327554000,
            "id":1266051,
            "title":"Bulma"
        },
        "15121":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "Use him for her experiments to create a cure",
                "Goten deserves a punishment "
            ],
            "content":"<div class=\"\"><div> <span>It was a sunny day and Goten decided to go at Capsule corp to ask Trunks to look for the dragon balls so they could make a wish of their choice. As he arrived, he ran throught the corridors, meeting Vegeta who was training in a room, and Bulma in the lab room working on something. When he finally reached Trunk's room, he was not there. Goten then went back to ask Bulma where he could find Trunks, but she was too busy to pay attention and only replied : <i>\" I don't know where he is. Trunks is a big boy now i don't have time to be on his back ! \"</i><br>\r\n<br>\r\nBut Goten already forgot about him as he spotted a candy on Bulma's desk. A big candy. And she was not looking at him, so Goten decided to steal it before leaving the room.  <br>\r\n<br>\r\n<i>\" Never mind, see ya Bulma ! \"</i> he said with the candy already in mouth. Bulma turned back and realized what Goten just did. <br>\r\n<br>\r\n<i>\" WAIT come back there !! \"</i> She yelled. Goten, started to run as fast as he could throught the corridors, followed by Bulma.<br>\r\n<br>\r\n<i>\" DON'T EAT IT !! \"</i><br>\r\n<br>\r\nUnfortunately, it was too late. A few seconds later, Goten shrunk to the size of a bug, but he didn't realize it yet. In fact, while he kept running, he only saw the walls becoming bigger and bigger, not wondering why since he was too scared to be caught by Bulma. Suddenly, a huge boot landed in front of him blocking his path. That's when he looked above to see the giant face of a mad Bulma.<br>\r\n<br>\r\n\" I TOLD YOU, SILLY BOY ! \" She said.<br>\r\n<br>\r\n\" Bu..Bulma, why are you so biiiig ?! \" Goten asked in shock.<br>\r\n<br>\r\n\" It's a shrinking candy ! And too bad for you, i couldn't creat any reverse effect yet !! What am i going to do with you now ? \".  </span></div></div>",
            "created":1476334800,
            "id":2222854,
            "title":"7 yr Goten"
        },
        "1513":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Chichi",
                "Pan",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about Pan or Chichi?</span></div></span></div>",
            "created":1321592400,
            "id":1225279,
            "title":"More Sexy Choices"
        },
        "15131":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Absolutely!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Chi Chi is already used, so how about Android 18?</span></div></span></div>",
            "created":1443589200,
            "id":2041943,
            "title":"Replacement."
        },
        "152":{
            "choices":[
                "android 18",
                "maron",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who shrinks him?</span></div></span></div>",
            "created":1321592400,
            "id":1224994,
            "title":"the human with no nose"
        },
        "1523":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Bulma",
                "Chichi",
                "MOAR!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about these sexy ladies?</span></div></span></div>",
            "created":1321592400,
            "id":1225138,
            "title":"Oh the choices"
        },
        "15233":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Pan",
                "NO! I hate GT!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay then, how about the pretty lady of Dragonball GT?</span></div></span></div>",
            "created":1321592400,
            "id":1225140,
            "title":"GT Selection"
        },
        "152332":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Bulla/Bra",
                "NO! I said I hate GT!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about the blue haired bombshell of GT?</span></div></span></div>",
            "created":1321592400,
            "id":1225143,
            "title":"More GT choices"
        },
        "153":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Bulma",
                "Chichi",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who shrinks the master of the Wolf Fang Fist?</span></div></span></div>",
            "created":1321592400,
            "id":1225280,
            "title":"The Desert Bandit"
        },
        "1533":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Android 18",
                "Marron",
                "More please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about Android 18 or Marron? (18's daughter)</span></div></span></div>",
            "created":1321592400,
            "id":1225281,
            "title":"More To Choose From"
        },
        "154":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Launch",
                "Bulma",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who shrinks the master of the Tribeam?</span></div></span></div>",
            "created":1321592400,
            "id":1225282,
            "title":"The Triclops Eh?"
        },
        "1543":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Chichi",
                "Videl",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about these?</span></div></span></div>",
            "created":1321592400,
            "id":1225284,
            "title":"More Choices"
        },
        "155":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Tarble",
                "You!",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1321592400,
            "id":1224975,
            "title":"More choices"
        },
        "1552":{
            "author_id":"ajbomb333",
            "author_name":"AJBOMB",
            "choices":[
                "chi chi",
                "bulma",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who finds you<br>\r\n</span></div></span></div>",
            "created":1413003600,
            "id":1870077,
            "title":"You!"
        },
        "15523":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Launch",
                "Frieza! "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who finds you?</span></div></span></div>",
            "created":1432962000,
            "id":1985285,
            "title":"more"
        },
        "155231":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Launch Is ur pick?</span></div></span></div>",
            "created":1563134100,
            "id":2686728,
            "title":"Launch"
        },
        "1552312":{
            "author_id":"mariosonicfan4",
            "author_name":"Echo",
            "choices":[
                "Android 18",
                "Videl",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here some more girls.</span></div></span></div>",
            "created":1581539700,
            "id":2786480,
            "title":"Others."
        },
        "155232":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "\"Worship my feet\"",
                "\"Be my meal\""
            ],
            "content":"<div class=\"\"><div> <span>You awaken in a groggy daze, your eyes adjusting to the light as you come to. The last thing you remember is watching your favorite anime, Dragonball Z, when a bright light suddenly enveloped your TV and you passed out. That was all you remembered as you shook your head and noticed your surroundings. They look oddly familiar to you until you take a look out of one of the windows to see that you were floating in a spacecraft in the dark void of space. \"I though this place was familiar, this looks just like Frieza's ship! How the hell did I-\" You were cut off from your train of thought as you were suddenly surrounded by Frieza's men and they point blasters at you. So as not to cause an uproar you surrender holding your arms up and they soon cuff you and take you further into the bowels of the ship. Soon you are face to face with the tyrant himself, Frieza, who was in his final form. \"Who is this pitiful creature you bring before me\"? Frieza asks in a cold tone. \"A stowaway sir\" replies one of the men. \"A stowaway? Hm.....\" He looks you up and down, raising a curious brow at your unusual garb and mannerisms. You likewise look the tyrant in the eyes and feel a small chill creep up your spine. \"Leave us\" He says to his soldiers. \"I will deal with this one myself\". You gulp nervously as the troops leave Frieza's throne room. \"Now tell me how it is you managed to sneak aboard my ship?....\" You stammer slightly but then explain how you simply woke up here with no recollection as to how. \"Interesting\" he replies as his tail slowly swayed back and forth. \"And do you know who I am\"? He asks in a coy tone. \"O-of course\"! You reply and go along with it so as not to upset him. \"You are the mighty Lord Frieza, the most powerful being in the universe\"! You bow in order to add to his delight. \"Despite the circumstances it is an honor to even be in your presence\". He grins at your comment. \"I see my illustrious reputation precedes me. And from your words it sounds as though your loyalties do indeed lie with me\". He says standing over you with his arms folded. \"I am most certainly loyal to you mighty one\"! you reply in earnest to keep in his good graces. He smirks at your comment. \"Then, by all means, prove it....\"</span></div></div>",
            "created":1432962000,
            "id":1985292,
            "title":"Frieza! "
        },
        "1552321":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Time to Lick",
                "Shrink"
            ],
            "content":"<div class=\"\"><div> <span>\"H-How\"? You ask the might overlord. *He grins mischievously at your question, and raises his right foot, his three toes wiggling in the air. \"Kiss my feet\" He commands you. You stare at the sole of his powerful foot and watch as the three toes wiggle in anticipation, and you couldn't help but blush slightly seeing this, as you had a foot fetish yourself. Without wasting much time you comply. \"As you wish Lord Frieza\". You then lean in, your face mere inches from his foot and pucker your lips, planting a deep kiss on the sole of his foot. Frieza smiles at your compliance \"Good boy, you may be of use to me yet\" He then walks over and sits in his large throne and calls you over. You proceed to follow him to his throne. \"On your hands and knees....\" He states. You nod and get on your hands and knees as he commanded. Then, with a grin he holds up both of his large powerful feet in front of your face. \"Now worship my feet, like a good slave\". 'S-slave'? you think to yourself, 'suppose it's better than being dead'. \"As you command Lord Frieza\" you reply and proceed to keep kissing the surprisingly soft soles of his alien feet. \"Good, but don't forget my toes\" he says as he presses his toes against your lips. You nod and deeply kiss each of his toes, letting out a small blush. \"My my, what a cheeky boy. Don't think I haven't noticed\" he says using one of his feet to rub and prod at the crotch of your pants, feeling your hardened member. \"You're enjoying being at my feet aren't you slave\"? He asks in a condescending tone, a smile on his face with a hand under his chin. You blush even more in reply, letting out a tiny squeak like moan as his foot presses against your member. \"Y-yes Lord Frieza\" You admit to him. He chuckles in response as he continues to lightly rub against your pants. \"Fear not little slave, for who could possibly blame you? I AM the most revered and powerful being in the universe. It's only natural to be overwhelmed with your dsires when presented with such an opportunity as this\" He goes on with a small grin. \"Who knows, if you do a good enough job...\" He takes his feet and rubs them against your cheeks. \"I might even indulge you, so get to it slave\". Your eyes widen at his potential proposition and nod vigorously. \"At once Master Frieza\"! You then proceed to continue passionately kissing every inch of his luscious feet, the bulge in your pants growing evermore. \"Hm....'Master Frieza'?....I like it, henceforth that shall be what you call me, understood\"? You nod \"Yes Master Frieza\" He chuckles at your response and continues to enjoy the treatment.    </span></div></div>",
            "created":1432962000,
            "id":1985301,
            "title":"\"Worship my feet\""
        },
        "1553":{
            "author_id":"kkduser100",
            "author_name":"Raging Demon",
            "choices":[
                "Piccolo",
                "Roshi",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, okay, then how about the Super Namek Piccolo? Or perhaps the old perv Roshi?</span></div></span></div>",
            "created":1321592400,
            "id":1225275,
            "title":"CHOOSE!"
        },
        "15533":{
            "author_id":"thehobbit101",
            "author_name":"Bilbo Baggins",
            "choices":[
                "Oh yeah",
                "Stick to shrunken guys"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a female character shrinks instead</span></div></span></div>",
            "created":1476594000,
            "id":2224346,
            "title":"Nah"
        },
        "155331":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "Sure.",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about Bulma?</span></div></span></div>",
            "created":1565541060,
            "id":2700349,
            "title":"Oh yeah"
        },
        "155332":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "Mirai Trunks",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Mirai (future) Trunks ( from DBZ or even DBS ) ?</span></div></span></div>",
            "created":1478637660,
            "id":2234442,
            "title":"Shrunken guys selection"
        },
        "1553321":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "Mai (dbs)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shrinks him ?</span></div></span></div>",
            "created":1478637720,
            "id":2234444,
            "title":"Mirai Trunks"
        }
    },
    "info":{
        "author_id":"kkduser100",
        "author_name":"Raging Demon",
        "brief_description":"A story where the men of dbz are the shrunken playthings of the women.",
        "created":1321582260,
        "description":"<td align=\"left\" class=\"norm\">In this interactive, the men of Dragonball Z are shrunk down to size by the women. Pretty much anything is allowed except for male giants and no M/M stuff. Other than that, go nuts. Add please :)</td>",
        "id":1826714,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1581539700,
        "modified":1581539700,
        "pretty_title":"Dragonball Z Shrink Interavtive"
    }
}