{
    "chapters":{
        "1":{
            "author_id":"thebandgeek",
            "author_name":"I <3 BAND",
            "choices":[
                "grow",
                "shrink"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off, is it a giantess or a shrinking person?</span></div></span></div>",
            "created":1278651600,
            "id":914505,
            "title":"Giantess or shrinking?"
        },
        "11":{
            "author_id":"thebandgeek",
            "author_name":"I <3 BAND",
            "choices":[
                "Jade",
                "Trina",
                "Tori",
                "Cat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is growing?</span></div></span></div>",
            "created":1278651600,
            "id":914532,
            "title":"Giantess!"
        },
        "111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Makes herself bigger",
                "Goes to shrink someone"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jade was heading home from school when she saw a package outside of her house. She brought it inside and opened it to see a ray gun that can shrink or grow things. She tested it on a plant and it worked. She smiled devilishly as she</span></div></span></div>",
            "created":1520485200,
            "id":2462149,
            "title":"Jade"
        },
        "1111":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Make Tori 100 feet tall. If Jade can't perform, neither can Tori.",
                "Smash the school. No one gets in if Jade can't."
            ],
            "content":"<div class=\"\"><div> <span>\"Has anyone seen Jade today?\" Robbie asked, everyone shaking their heads or saying no.<br>\r\n<br>\r\n\"Maybe she's finally been arrested for her criminal behaviour.\" Beck joked before the ground began shaking in a rhythmic pattern.<br>\r\n<br>\r\nAs one, all five of them turned to see Jade walking up to them, towering over everything at 50 feet tall, even the top of her boots far above their heads.<br>\r\n<br>\r\n\"Hey guys.\" She smiled sadistically, bending down to them. \"Notice anything different about me?\"<br>\r\n<br>\r\n\"You have purple streaks in your hair.\" Cat answered.<br>\r\n<br>\r\nJade growled in frustration, the sound echoing through the area. \"Jade... what... what happened?\" Beck asked.<br>\r\n<br>\r\n\"I had a little growth spurt.\" She shrugged as she flipped her hair, giant strands falling onto the asphalt below. \"For years I've had to compete with the peons at this school. Watching Tori and all the... <i>little</i> usurpers like her taking my roles and praise.\" Jade stood back up to her full height, allowing everyone to take in her magnificent beauty and make another futile attempt to rationalize how insecure she was. \"Well now who's <i>victorious</i>? All the top spots are mine again!\" She roared victoriously.<br>\r\n<br>\r\n\"But you don't even fit in the door.\" Tori commented. \"You'd fall right through any stage. How... how is anyone supposed to interact with a 50 foot co-star? Just getting you a script would bankrupt the school, forget about sets and costumes.\"<br>\r\n<br>\r\n\"Uh...\" Jade said dumbly as she blinked a few times. In all honesty, she hadn't considered that.<br>\r\n<br>\r\nA rational person would at this point, shrink back to normal size. Jade however was not rational, and two insane ideas popped into her head.<br>\r\n<br>\r\nWhich one will Jade act on?</span></div></div>",
            "created":1549429200,
            "id":2613906,
            "title":"Attack of the 50 foot Jade"
        },
        "11111":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Make out",
                "Fight"
            ],
            "content":"<div class=\"\"><div> <span>\"You.\" Jade glared at she pointed at Tori. \"You knew this wouldn't work. You set me up.\"<br>\r\n<br>\r\n\"What?\" Tori asked, any fear of the giantess lost in the face of her warped logic.<br>\r\n<br>\r\nWith surprising speed for her size, Jade grabbed the ray gun out of her pocket and aimed it at the minuscule Latina. \"Let's see how you like it.\" The beam struck Tori causing her to steadily increase in size, until she soon matched Jade's 50 feet.<br>\r\n<br>\r\n\"HA!\" Jade smiled as she looked down to her boots. \"Now your precious princess can't perform either. What are you all to do?\" She pouted.<br>\r\n<br>\r\n\"Um... Jade. You might want to let go of the trigger.\" Andre said as he pointed to Tori.<br>\r\n<br>\r\nJade felt her jaw drop as Tori continued to grow, easily reaching 100 feet tall, the remains of her clothes all around her.<br>\r\n<br>\r\nWhen Jade stopped the beam, Tori stumbled backwards, naked as the day she was born, her gigantic ass slamming into Hollywood Arts yet only a brick fell off, landing right on Ryder Daniels' head and knocking him out.<br>\r\n<br>\r\n\"We can all say he deserved that.\" Tori shrugged as everyone stared at her beautiful body. Quite a few camera shutters could be heard going off.<br>\r\n<br>\r\n\"VEGA!\" Jade screamed as she turned the ray on herself, quickly doubling in size, the remains of her clothes ripped to shreds. Like Tori, she stumbled back from the size change, her bloated butt grazing a nearby skyscraper and causing it to instantly collapse into a pile of rubble.<br>\r\n<br>\r\nJade looked back to the crowd, Tori in particular seemed to be trying not to laugh. \"Ok so my butt's big. <b>SUE ME</b>!\" She roared as she stepped forward and up to Tori, the tension between them almost palpable, especially given that Tori still seemed to have a few inches on the goth.<br>\r\n<br>\r\nFor Beck, this was a moment he'd known would happen since Tori's first day. Either the two would make out, or they'd destroy each other.<br>\r\n<br>\r\nFrankly he was okay with either.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1549688400,
            "id":2615208,
            "title":"Attack of the 100 foot Tori"
        },
        "111112":{
            "author_id":"bposser79",
            "author_name":"Bp1023",
            "choices":[
                "Follow Trina tormenting her little sister ",
                "Follow jade and her new slaves "
            ],
            "content":"<div class=\"\"><div> <span>Jade is angry that Tori is now huge too.<br>\r\n<br>\r\n“Are you kidding me Vega why do you have to always steal my thunder” screamed jade <br>\r\n<br>\r\nShe starting fighting with tori then all of a sudden Jade was able to pull out the gun and as Tori ran towards jade she shot it shrinking Tori back down to size Tori then ran into the toe of jades boot<br>\r\n<br>\r\n“Hahahaha sorry little girl did my big boot hurt you” jade laughed as she bent down to look at her little friends again <br>\r\n<br>\r\nJade then states that she is going to have some fun she lowers her enormous hand scooping up her friends and bringning them to her face <br>\r\n<br>\r\n“Boo Hahaha wow I never realized how small you all where Hahahaha” said the giant teen<br>\r\n<br>\r\nJade then noticed someone else walking by her feet and it was Tori’s annoying big sister Trina<br>\r\n<br>\r\n“ omg Tori I have an absolutely evil idea watch this”  laughed Jade<br>\r\n<br>\r\nJade then Used the Ray to grow the annoying Trina up to her height <br>\r\n<br>\r\nTrina was amazed she was now one of the biggest stars in the world literally<br>\r\n<br>\r\n“Here Trina do you want your LITTLE sister” jade then plucked up the tiny Tori her friends tried to pull her back from jades fingers but she just laughed at there attempts,  and then dropped her in Trina’s large hand.. ok Trina you have fun I am going to have fun with the rest of these little pipsqueaks <br>\r\n<br>\r\nTrina and Tori watched as giant jade walked off with the rest of the teens in her fist<br>\r\n<br>\r\nWhat happened next </span></div></div>",
            "created":1551243600,
            "id":2624045,
            "title":"Fight"
        },
        "11112":{
            "author_id":"bposser79",
            "author_name":"Bp1023",
            "choices":[
                "Trina is the onlyone who understands. Grow her",
                "Torment her tiny new slaves "
            ],
            "content":"<div class=\"\"><div> <span>Realizing Tori was right Jade bent down and scooped up all her friends with her giant hand now in the palm of her hand she brought them to her billboard sized face.<br>\r\n<br>\r\n“Well if i cant act no one can”..  Just then jade lifted her giant leather boot and crushed the school with ease causing a small earthquake with her foot.<br>\r\n<br>\r\nJade brought her attention back to her Tiny victiams deciding what to do next <br>\r\n<br>\r\nJade let out an evil laugh and decided </span></div></div>",
            "created":1549515600,
            "id":2614297,
            "title":"Smash the school. No one gets in if Jade can"
        },
        "1112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Tori",
                "Cat",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does Jade shrink?</span></div></span></div>",
            "created":1520485200,
            "id":2462350,
            "title":"Goes to shrink someone"
        },
        "11121":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Tori's room",
                "Cat's room"
            ],
            "content":"<div class=\"\"><div> <span>Once upon a time, Jade West had been the top dog at Hollywood Arts. It didn't matter what a bitch she could be, her talent made her indispensable to every production.<br>\r\n<br>\r\nThen Tori Vega showed up.<br>\r\n<br>\r\nJust as talented, if not more so, as Jade was but working with Tori didn't have the side effect of wanting to put a bullet in your head.<br>\r\n<br>\r\nNow however, Jade had the power to put things right. Her plan was simple enough. Once last period gym let out, she'd corner Tori in the bathroom and make the Latina an inch tall before keeping her as a living stress ball.<br>\r\n<br>\r\nLike all of Jade's plans involving Tori, it was simple enough in concept and revealed far too much about the goth's crippling insecurities.<br>\r\n<br>\r\nWhen the time came, Jade made sure she and Tori were the last two in the locker room. As the Latina washed her face, Jade snuck up from behind, levelled her shrink ray, and fired.<br>\r\n<br>\r\nLike all of Jade's plans involving Tori however, Jade's overconfidence failed to take simple things into account. In this case, that by looking into a mirror, Tori could see what was behind her. And the same thing Jade had consistently forgotten in all of her cartoonish attempts to sabotage the Latina, Tori <i>always</i> won.<br>\r\n<br>\r\nWith barely a grunt of effort, the Latina spun out of the beam's path, the beam bouncing off the mirror and striking Jade's forehead.<br>\r\n<br>\r\nThe next thing Jade knew, the now building sized ray gun clattered to the floor next to her. Just as Jade shakily got to her foot, a minor earthquake knocked her over before a massive tanned hand grabbed the gun and two car sized fingers grabbed her by her shirt collar, lifting her upwards to a mountain sized eyeball. Tori chuckled. She didn't intend for it to sound evil, but given Jade's tiny size it sounded like a dark god.<br>\r\n<br>\r\n\"You could have used this gun for good, or at least to make moving easier, and you chose this.\" Tori smiled, shaking her head. \"Some advice, don't butt dial someone when you're planning to shrink them.\"<br>\r\n<br>\r\n\"What... what are you gonna do to me?\" Jade squeaked.<br>\r\n<br>\r\nTori's eyes travelled down to her crotch. Sticking the gun in her back pocket, Tori pulled on the waistband, exposing her lady parts.<br>\r\n<br>\r\n\"No! No! Tori please don't-\" And that was all Jade got out before she tumbled down Tori's panties and was slammed halfway inside the massive girl. As Jade struggled to get a massive pube out of her mouth, Tori began walking, shaking the foundations of Jade's prison.<br>\r\n<br>\r\nThe goth soon lost track of how much time had passed before she heard Tori's zipper and heard her discard her jeans. Jade stumbled as Tori sat down and reached into her underwear to seize her prisoner, the goth half-covered in pubic hair and Tori's juices. \"Ready for some fun Jade?\" Tori asked.<br>\r\n<br>\r\nOnce her eyes adjusted to the light, Jade saw she was in</span></div></div>",
            "created":1544850000,
            "id":2589592,
            "title":"Tori"
        },
        "111211":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Jade enjoys being Tori's sex slave",
                "Jade orgasms Tori to sleep"
            ],
            "content":"<div class=\"\"><div> <span>\"Jade.\" Tori said in a demanding tone.<br>\r\n<br>\r\n\"Forget it Vega. I'm not doing that!\" Jade glared back. Had Jade been clothed, or full-sized, the glare might have been enough to deter Tori. But given that Tori was a mountain over Jade (albeit a stark naked one), it was more amusing than anything else.<br>\r\n<br>\r\n\"I really don't see why not.\" Tori shrugged. \"It's perfectly reasonable given the circumstances.\"<br>\r\n<br>\r\nJade almost exploded from rage and indignation. \"I'm not going in there!\" She screamed, pointing at Tori's bare and dripping pussy.<br>\r\n<br>\r\nWith a sigh Tori let herself fall forward, her right breast pinning Jade firmly to the mattress. The minivan sized B-Cup was hard enough to keep Jade pinned down but soft enough that she wouldn't be crushed under its weight. Jade tried to punch the breast but she was far too weak (at any size) to physically hurt Tori.<br>\r\n<br>\r\n\"Cumming already Jade?\" Tori smirked as she felt liquid running across her breast. \"We haven't even started.\"<br>\r\n<br>\r\nJade's face went as red as Cat's hair. \"Fine you're sexy but I will not service you.\"<br>\r\n<br>\r\n\"You have three options here Jade. Be my little slave and hope I return you to normal size one day or I set you free into the world leaving you at the mercy of all the bugs and insects.\"<br>\r\n<br>\r\n\"And the third option?\"<br>\r\n<br>\r\nTori lowered her head down and opened her mouth revealing teeth as large as Jade herself which she roughly closed. \"Get the picture?\" Tori asked.<br>\r\n<br>\r\nJade nodded, easily persuaded. Tori sat back up, legs folded around Jade.<br>\r\n<br>\r\n\"Who knows?\" Tori asked as her massive hand clamped around Jade. \"You might even enjoy this. I know I will.\" With that, Tori rammed the little goth back inside her revelling in the ecstasy of the tiny body inside of her.</span></div></div>",
            "created":1551330000,
            "id":2624270,
            "title":"Tori's room"
        },
        "1112112":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Jade struggled to stand where she was. Tori's insides were slippery with her juices. She could feel sweat as the tunnel cooked her. The fleshy walls surrounding her suddenly squeezed down, pushing her further in. She pushed the walls around her and forced herself to stand. She tried to push backwards to get out of this hole, but it was shut tight; squeezing her each time she moved too much. Angered and fighting to get out of here, Jade suddenly kicked Tori's opening. Everything squeezed down tighter around her, her feet slipping in the juices, a ripple of giggles vibrated the walls around her.<br>\r\n<br>\r\nThe walls suddenly became smaller and the passage built up with more cum. It covered Jade's body, went up her nose, and flowed down her throat. It was suffocating how much there was, filling up the channel with the stuff. She could hear Tori's heartbeat, like a great thudding noise in her ears, the walls clenching with each thud, her warmth heating every part of her. She was being thrown around even more roughly, her face slamming into the end with more ferocity with each thrust. Suddenly the walls tightened, clenching around her, squeezing her face with wet flesh. A water fall of cum pushed into her, squishing her through Tori's tightened tunnel and out onto her bed. More of it fell on her, covering her completely. Jade knew even if she took a thousand showers, she'd never get the feeling off of her.<br>\r\n<br>\r\n\"Did it... did it work?\" Jade asked herself. Daring to look up, she saw Tori resting on her pillow, eyes closed and seemingly asleep. Unfortunately for Jade it didn't look like Tori was in quite as deep a sleep as she wanted and was liable to wake up at any moment.<br>\r\n<br>\r\n\"I gotta get outta here.\" Jade said in a determined tone as she made her way to Tori's right leg. At her size, the leg was essentially a slide down the bed, Tori's juices coating her allowing Jade to safely slide down.<br>\r\n<br>\r\nOn the floor, Jade briefly allowed herself to take in the sheer size of Tori's room before she had a look around for the ray gun. \"Should have know Tori wouldn't make it easy for me to get to.\" She muttered before she heard Tori moan. \"She's waking up.\" Jade gasped as she ran for the crack beneath Tori's door. Screw all the bugs and insects of the world, being eaten alive couldn't be worse than being Tori's slave.<br>\r\n<br>\r\nDoes Jade make it to the door before Tori wakes up?</span></div></div>",
            "created":1551330000,
            "id":2624278,
            "title":"Jade orgasms Tori to sleep"
        },
        "11121121":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Trina Vega",
                "Holly Vega"
            ],
            "content":"<div class=\"\"><div> <span>\"I did it.\" Jade gasped as she passed under the crack. \"I really did it.\"<br>\r\n<br>\r\nJade held her breath for a few moments, expecting to hear Tori's thunderous footsteps and see the titanic Latina come out any second now but only silence answered her. Either Tori was very slow to wake up or she was in deeper a sleep than she appeared to be.<br>\r\n<br>\r\n\"YES!\" Jade cheered after a while. \"I'm free! I'm naked, an inch tall, and covered in Tori's juices but I'm free! In hindsight, maybe I should have super sized myself or shrunk Cat. Guess I'll have to just wait her out and find the ray when she leaves.\"<br>\r\n<br>\r\nAs Jade pondered what to do, thunderous footsteps forced her onto her butt. \"What is this? Gigantic Vega woman knock Jade on her shapely ass day?\" She deadpanned as she stared up at the titanic figure of</span></div></div>",
            "created":1551934800,
            "id":2627384,
            "title":"Yes"
        },
        "11121122":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Tori makes herself bigger and continues to play with Jade",
                "Takes Jade to school"
            ],
            "content":"<div class=\"\"><div> <span>Jade ran as fast as she could which, considering she was an inch tall and dripping in vaginal fluids, was not fast at all. But the door was so close. Just a foot away.<br>\r\n<br>\r\nAnd after a minute of running it continued to be a foot away.<br>\r\n<br>\r\nWith a sense of dread, Jade turned back to see two massive fingers holding her feet firmly in place. And her heart sank when she realized the reason she hadn't heard Tori get off her bed was because the Latina hadn't had to. Tori was so big that her arm could reach Jade with no trouble.<br>\r\n<br>\r\nNone too kindly, Tori yanked on her arm and brought Jade in front of her holding in her place with her thumb. \"I'm very disappointed in you Jade. I thought by now you'd have learnt who the mistress was. Sadly I must punish you.\"<br>\r\n<br>\r\n\"You're... you're not gonna eat me are you?\" Jade squeaked looking up at Tori's train sized neck.<br>\r\n<br>\r\n\"Oh no.\" Tori smiled in a tone that didn't match the expression. \"I've got something much better in mind.\"</span></div></div>",
            "created":1551934800,
            "id":2627385,
            "title":"No"
        },
        "112":{
            "author_id":"thebandgeek",
            "author_name":"I <3 BAND",
            "choices":[
                "Blue liquid",
                "Red liquid"
            ],
            "content":"<div class=\"\"><div> <span>One day, Trina Vega was walking through the halls at Hollywood Arts. She was excited about her next one-woman show. As she passed by the gym, she noticed a backpack sitting open next to the door. She looked down at it. There was a SkyStore catalog and a bottle full of a mysterious blue liquid and a bottle full of a mysterious red liquid. Curiosity overwhelming her, she grabs the bottles and heads home.<br>\r\n<br>\r\nWhat does she test first?</span></div></div>",
            "created":1288069200,
            "id":982063,
            "title":"Trina"
        },
        "1122":{
            "author_id":"thebandgeek",
            "author_name":"I <3 BAND",
            "choices":[
                "Tori",
                "something else random"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does she test it on?</span></div></span></div>",
            "created":1288069200,
            "id":982064,
            "title":"Red liquid"
        },
        "11221":{
            "author_id":"thebandgeek",
            "author_name":"I <3 BAND",
            "choices":[
                "Bra",
                "Panties"
            ],
            "content":"<div class=\"\"><div> <span>Trina filled a cup with the weird red liquid. When Tori came home from school, Trina grabbed her and asked her if this 'juice' tasted alright to her. Tori tried it. \"It's a little bitter,\" she remarked. Then, unexpectedly, she begins to shrink, down, down, closer to the ground until she is 6 inches tall.<br>\r\n<br>\r\nTrina's mouth hung open, realizing the power she now had- if red was shrink, blue was grow! Imagine the fun she could have in Hollywood at 50 feet tall!<br>\r\n<br>\r\n\"Trina!\" Toria yelled. \"FIX ME NOW!!!!\"<br>\r\nTrina smiled at her puny little sister. \"I don't think so. That wouldn't give me a chance to play with you! But for now, where should I put you so that I don't accidentally lose or step on you....I know!\"<br>\r\n<br>\r\nWhere does she put Tori?</span></div></div>",
            "created":1288069200,
            "id":982067,
            "title":"Tori shrinks"
        },
        "112211":{
            "author_id":"thebandgeek",
            "author_name":"I <3 BAND",
            "choices":[
                "Shrink a bunch of people!",
                "Attack of the 50 ft Trina!"
            ],
            "content":"<div class=\"\"><div> <span>With a laugh Trina dropped Tori into her bra, giving her boobs a squeeze to make sure she was securely in place. Tori cried out in pain as she was smashed between her sister's now enormous breasts, prompting another laugh from Trina. <br>\r\n<br>\r\nTrina then pondered her next move. Either she could shrink a whole group of people and control them, or she could use the blue liquid to become a 50 foot woman, just like a monster movie from the 50s. What does she decide?</span></div></div>",
            "created":1373259600,
            "id":1625038,
            "title":"Bra"
        },
        "112212":{
            "author_id":"lightning06",
            "author_name":"lightning72",
            "choices":[
                "front",
                "back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which side</span></div></span></div>",
            "created":1302843600,
            "id":1088797,
            "title":"Panties"
        },
        "1122121":{
            "choices":[
                "Pussy",
                "Face?"
            ],
            "content":"<div class=\"\"><div> <span>The next thing she knew, Tori had been crammed into her older sister's panties, practically face to face with her pussy. Barely able to move due to her size, with itchy pubic hair in her face, she was far from comfortable in her new location. However, there was also little she could do about it, because of her size. Even if she could negotiate her way back out of her sister's panties, she'd just get caught, and likely end up somewhere worse.<br>\r\n<br>\r\nTori shuddered at the thought or somewhere worse, and just hoped it'd be over soon. Or, at the very least, in a new position. One that didn't involve her sister's clitoris rubbing against her head.<br>\r\n<br>\r\nHowever, her wish seemed to be answered in an unorthodox way when her foundations started shaking about. She figured Trina must've been running up stairs or something, because she was bouncing around inside her sister's panties, hitting Trina's pussy with a <i>squelch</i> each and every time. She was then jammed halfway inside of her sister when Trina landed on her back with a bouncing <i>thud.</i><br>\r\n<br>\r\n<i>'zzzzzzip'</i><br>\r\n<br>\r\n<i>'rustle, rustle'</i><br>\r\n<br>\r\n\"Hey again, sis!\"<br>\r\n<br>\r\nTori wrenched her face out of her sister's pussy to find blinding white light entering her 'dungeon', and Trina's face staring down at her from above.<br>\r\n<br>\r\n\"Wh-what the...\" Tori muttered, pulling a pube out of her mouth, \"What's going...\"<br>\r\n<br>\r\n\"We're gonna play!\" Trina answered simply, and next thing Tori knew, the panties were no longer surrounding her. How she took them off without Tori noticing, she didn't know, but she <i>did</i> know that she was sat between her older sister's thighs, at the apex of her dripping pussy.<br>\r\n<br>\r\nTori gulped.<br>\r\n<br>\r\nA hand clamped itself around Tori, and she flailed wildly as Trina brought her closer to her...</span></div></div>",
            "created":1424235600,
            "id":1936376,
            "title":"Front."
        },
        "11221211":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "She wasn’t happy, so she Immediately shove tori inside her pussy ",
                "She wasn’t happy but decided trick Tori into doing it! "
            ],
            "content":"<div class=\"\"><div> <span>“I know exactly what we going play!” Trina said with huge grin on her face as she lower Tori back toward her pussy. “We are going play with my pussy, you felt so good going inside of it, that I almost moan!” Trina said.<br>\r\n<br>\r\n“What no, I am not going pleasure you by touch or go inside your pussy!” Tori reply.<br>\r\n<br>\r\n(What did Trina do?)</span></div></div>",
            "created":1569474000,
            "id":2723759,
            "title":"Pussy"
        },
        "1122122":{
            "author_id":"shadowsweeper",
            "author_name":"AniFreak",
            "choices":[
                "Trina goes for a jog.",
                "Trina has some mexican!"
            ],
            "content":"<div class=\"\"><div> <span>\"You know, I remember that your friends always complained about my ass.\" Trina gave Tori a nasty look. Tori tries to think of a way out of this. In a panic she says \"Listen, Trina, we didn't mean to make fun of you, but come on you do have a pretty big butt.\" Tori frowns as she realizes that she made a huge mistake. \"What!\" Trina screams. Tori gets ready to expect the worst, but instead is greeted by a mischievous smile from Trina. \"Well, I think its pretty cute.\" Trina says with a pout \"Maybe you should spend a little more time with it!\" Trina begins to lower Tori down to her pants. \"Trina don't do this!\" Tori struggles and tries to get out of her sisters grip. Trina giggles \"Well maybe you should have thought of that before you started making fun of it!\" she pulls the back of her jeans and panties with her free hand and starts lowering Tori into the crevice called Trina's ass. \"Okay! I'm sorry! Your ass isn't big!\" Tori screams! Trina pulls Tori up to her face \"Really?\" Trina says with a little grin on her face \"Do you like my ass?\" Tori smiles, thinking that she found a way out of this \"I love it!\" Trina smiles \"Then you wouldn't mind spending time with!\" She tosses Tori into her panties and pulls them up tight, enjoying her little sister screams!</span></div></div>",
            "created":1320037200,
            "id":1215553,
            "title":"Trina's giant ass"
        },
        "11221222":{
            "author_id":"chaosmaster225",
            "author_name":"Vermillion",
            "choices":[
                "Trina goes after her friends for revenge as well.",
                "Trina accidently drinks the red liquid"
            ],
            "content":"<div class=\"\"><div> <span>Trina thought of the perfect thing to do now that she has Tori right in her asscrack. She ordered some mexican foods, which made her really gassy. \"What better time to be gassy then while your little sister is stuck in your ass?\" Trina says and laughs. She can still feel Tori trying to escape. \"I thought you loved my butt. Is my perfect ass too much for you at this size?\" Trina laughs again. This was a hellish situation for Tori. She was trapped between the two massive mounds of flesh that are Trina's asscheeks. They are keeping her in Trina's asscrack, right infront of her asshole. The smell was pretty bad. <br>\r\n<br>\r\nAs Trina was eating she felt the rumbling. The plan was working. Tori, also hearing this, had realized what was about to happen, and tries to escape but her asscheeks hold her in place. Tori gives up, loses all hope, and stares at Trina's asshole awaiting her stinky fate. Trina then farted a 7 second long fart. \"Oh my! That one was good. I better keep eating and stay fueled.\" Trina says with an evil smile. Tori laid there, shocked at the power of the stink of the fart. The smell was pure torture and made her weak. \"Trina must be eating Mexican.\" Tori thought. \"Why would do this to me?\" \"Do you love my butt's farts? I don't see how you couldn't. If you love an ass like mine you should love my farts just as much. I don't feel you struggling, so maybe you do love it!\" Trina says and sits there triumphantly as she continues to eat and fart on poor Tori. \"This will teach you to never call my cute ass big again!\" </span></div></div>",
            "created":1330318800,
            "id":1285100,
            "title":"Trina has some mexican!"
        },
        "112212221":{
            "author_id":"chaosmaster225",
            "author_name":"Vermillion",
            "choices":[
                "Cat",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Why stop here? I can easily do the same to Tori's friends, but who to get first?\" Trina says and thinks.</span></div></span></div>",
            "created":1330318800,
            "id":1285109,
            "title":"Trina goes after her friends for revenge as well."
        },
        "112212222":{
            "author_id":"chaosmaster225",
            "author_name":"Vermillion",
            "choices":[
                "Tori regains her size",
                "Someone comes in"
            ],
            "content":"<div class=\"\"><div> <span>Trina farts again. \"Ha! This is so fun.\" She grabs a drink and takes a sip. She put it down and then realizes her mistake. Actually looking at the bottles she sees that she drank the red liquid. \"No!\" Trina yells and begins to shrink. During the shrinking Tori manages to escape. Now they were both the same size. \"Why did you do that Trina!\" Tori yells. \"You called my cute ass big, then said you loved it!\" Trina said. \"And you still haven't learned your lesson!\" Trina then overpowers the weakened Tori and smothers her face with her giant ass. \"Now I willl gas you unconscious!\" She feels a big one. \"Good night Tori!\" She farts the biggest one yet, but Tori is still up. \"Come on! Pass out!\" Just then...</span></div></div>",
            "created":1330318800,
            "id":1285106,
            "title":"Trina accidently drinks the red liquid"
        },
        "1122122221":{
            "author_id":"giantlover1",
            "author_name":"giantlover",
            "choices":[
                "shove you up my ass",
                "make you smell my sweaty feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The potion wears off Tori and she goes back to normal size. Trina looks up shocked while Tori looks down evilly smiling. \"Trina you are so in for it! I'm going to....</span></div></span></div>",
            "created":1330318800,
            "id":1285118,
            "title":"Tori regains her size"
        },
        "11221222211":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Makes Trina kiss her ass.",
                "Go for a bike ride"
            ],
            "content":"<div class=\"\"><div> <span>Tori held Trina by her shirt collar, her tiny body dangling. She couldn't have been more than four feet off the ground but at six inches tall, it felt like thousands of feet.<br>\r\n<br>\r\n\"Tori,\" Trina laughed nervously, \"We joke around a lot, you and me. But it's all in good fun right?\"<br>\r\n<br>\r\nTori snorted humourlessly, the air slamming into Trina like a tornado before she began tossing her sister up and down, \"I've got about an hour or so before you return to normal. How best to enjoy being the <i>big</i> sister? Oh... I know.\" She smiled sadistically as she brought Trina right up to her face.<br>\r\n<br>\r\n\"I actually did enjoy my time spent in your ass. You should really experience what it's like yourself.\" Tori began, pulling down on her impossibly skinny jeans.<br>\r\n<br>\r\n\"Ugh, you can't even be original in your torture?\" Trina asked, her fear momentarily forgotten before her younger sister gave her a squeeze, just enough to remind her who was boss.<br>\r\n<br>\r\n\"Oh I'd enjoy it Trina.\" Tori chuckled lowering her sister down into her perfectly firm ass. \"It's the one time in history my ass is bigger than yours.\"<br>\r\n<br>\r\nWith that, Trina plummeted directly into her sister's panties, trapped in the same dark, smelly prison she'd trapped Tori in only an hour ago. In a tiny part of her mind not overwhelmed by fear, she had to concede it was odd to consider Tori's ass as being huge before she was violently slammed into her little sister's cheeks.<br>\r\n<br>\r\nOf course to Tori, it was just a little pat on the butt. Enough to securely fasten Trina into place.<br>\r\n<br>\r\nUnlike her sister, Tori didn't get gassy after Mexican foods. How best to enjoy Trina's predicament?</span></div></div>",
            "created":1549342800,
            "id":2613357,
            "title":"Tori's giant ass"
        },
        "1122122222":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "choices":[
                "Jade",
                "Cat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They then both hear thundering footsteps and a familiar voice calliong out bith of their names asking if anyone is home? They then see the tiatnic figure of...</span></div></span></div>",
            "created":1549602000,
            "id":2614487,
            "title":"Someone comes in"
        },
        "113":{
            "author_id":"them",
            "author_name":"theM",
            "choices":[
                "Grow herself",
                "One of her friends come",
                "YOU"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was another fine day at Hollywood arts. Tori was just walking around when from the corner of her eye she saw a gun. The gun said shrink or grow. She look at it in aw. She was thinking of all the uses she can have with that gun. </span></div></span></div>",
            "created":1318222800,
            "id":1204318,
            "title":"Tori"
        },
        "1131":{
            "author_id":"thebandgeek",
            "author_name":"I <3 BAND",
            "choices":[
                "Somebody entered the lobby",
                "Nothing. She figures out what to do."
            ],
            "content":"<div class=\"\"><div> <span>Tori thought of the endless possibilities that awaited her as a giantess. Without a second thought, she decided to use the gun on herself. She ran to the main lobby, which was deserted at the time because everyone else was in class. Perfect, she thought.<br>\r\n<br>\r\nShe took a deep breath, and pointed the device at herself. She pulled the trigger and instantly felt a bizarre tingling sensation. Then she noticed that everything was beginning to look smaller. It was working! She let out a triumphant laugh. She kept growing up and up, crouching down to avoid smashing through the building (for the time being; no sense causing destruction just yet ;) ) and felt the odd sensation stop. She estimated she was about 50 feet tall. For some odd reason, her clothes had stretched all the way out to still fit her, but she could see they were not going to last long before they ripped completely off. <br>\r\n<br>\r\nBefore Tori could decide what to do, though, what happened?</span></div></div>",
            "created":1369458000,
            "id":1596748,
            "title":"Grow herself"
        },
        "1132":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Trina",
                "Jade",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one of her friends?</span></div></span></div>",
            "created":1428037200,
            "id":1958210,
            "title":"One of her friends come"
        },
        "1133":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a male or female?</span></div></span></div>",
            "created":1534136400,
            "id":2533294,
            "title":"YOU"
        },
        "114":{
            "choices":[
                "eats Trina",
                "shrinks tori"
            ],
            "content":"<div class=\"\"><div> <span>Cat came running in Hollywood arts school with look of gleam in her face.\"Whats up Cat?\" said Tori.<br>\r\n\"I just bought the coolest thing ever at Sky store\"!!! she answered.<br>\r\n\"Sky Store?! Cat we told you not to buy anymore stuff there anymore and we ripped the catalog, where did u get another one?\" <br>\r\n\"From my backpack silly! Anyway here is newest thing I got!\" She pulled out a strange black and green gun which looked like a prop from a sci-fi movie.\"It's called a shrink ray!\" <br>\r\n\"CAT?! Are you crazy??!!!! What did you buy that for?!\" <br>\r\n\"I thought looked cool, here's let's try it out!\" <br>\r\n\"CAT,no!!\" <br>\r\n<br>\r\nCat shot a passing student to 3 inches. Ignoring Tori's protests, Cat picked him up. \"You see? Works like a charm.\" Then she dropped him into her mouth. \"Cat don't you-\" ~gulp~ <br>\r\n\"Mmm,he was good,want to try one?\"<br>\r\n\"No,of course not!\" Tori said, horrified. Just then Trina walked into the hallway. Cat shot her with the gun too. \"CAT STOP!\" Tori shouted. Cat ignored her and...</span></div></div>",
            "created":1280206800,
            "id":925594,
            "title":"Cat"
        },
        "1141":{
            "author_id":"them",
            "author_name":"theM",
            "choices":[
                "Shrink cat",
                "Tori grows",
                "Tori looks for someone else"
            ],
            "content":"<div class=\"\"><div> <span>\"Cat, I realise my sisters rely annoying and obnoxious, but I don't want to end her life\" said Tori <br>\r\n\"dont worry\" said cat \"this gun has a normal button, watch\"<br>\r\n   She fired the gun at her stumic and the boy, she swallowed whent back to the same position. And he just walked away unharmed.<br>\r\n\"cool\" said Tori \"so any thing I do with this gun can be fixed\"<br>\r\n\"yep\"<br>\r\n\"alright then,\" she said giving Trina an evil smile<br>\r\n\"listen Tori, even though I'll survive you better not\" said Trina \"I'll tell mom and dad\"<br>\r\n\"come on your going them that you got shrunk and that your little sister ate you\" said Tori \"how r u going to exspain that\"<br>\r\n\"Tori please don't\" she said<br>\r\n\"to bad\" said Tori placing her sister in her mouth. She sucks on her for a little wile till she finally shallows her.<br>\r\n\"she didn't raise half bad\" said Tori<br>\r\n<br>\r\n\"hey cat\" said Tori \"can, I borrow that for a few days then give it back to you\"<br>\r\n\"sure Tori\" she replied</span></div></div>",
            "created":1318222800,
            "id":1204326,
            "title":"eats hers sister"
        },
        "11411":{
            "author_id":"them",
            "author_name":"theM",
            "choices":[
                "Robbie",
                "A little boy about 2 years younger than her"
            ],
            "content":"<div class=\"\"><div> <span>Cat starts to shrink intill she 4 inches. She looks up surprised at what just happened, as Tori looks down at her evilly.<br>\r\n\"Tori why did you shrink me\" wined cat<br>\r\n\"Cause I can\" Tori smirked \"now for some fun\" <br>\r\n    She brought cat up to her face. Licked her lips. \"Time for some karma.\"<br>\r\n\"Tori no\"<br>\r\n\"yes cat, you'll survive\" Tori said \"you should fill me up\"<br>\r\n    She starts liking cat and she chews on her leg as cat screams and laughs.<br>\r\n\"Tori please no\" she scream<br>\r\n  To late Tori already shallower her whole. When she turned around to go to class she turned around to see some one was watching the whole thing<br>\r\n</span></div></div>",
            "created":1318222800,
            "id":1204355,
            "title":"Shrink cat"
        },
        "114111":{
            "author_id":"them",
            "author_name":"theM",
            "choices":[
                "She puts Robbie in her Bra Cup",
                "She puts Robbie in the front of her panties."
            ],
            "content":"<div class=\"\"><div> <span>First a sence of shock came over Tori. But then that shock turned into a wicked smile.<br>\r\n<br>\r\n\"Why, hello Robbie\" Tori walked slowly over to Robbie. Robbie slowly started backing away.<br>\r\n<br>\r\nRobbie's heart was pounding at a million miles per second. \"You-you you ate Cat,\"<br>\r\n<br>\r\n\"Why yes, I did\"  <br>\r\n<br>\r\n\"Why-why would you do that?\" Robbie was almost in tears.<br>\r\n<br>\r\n\"Because I can\"  Tori's tone was getting almost sadist. Robbie could tell that Tori loved the power she had. As Robbie's back hit the wall she grabbed both his arms and pinned them on the wall. Making him scared enough to submit to any threat she'd give. And give in to any of her wishes. \"Would you like to join her?\"<br>\r\n<br>\r\nRobbie burst out into tears. \"No-no-no, please no. I'll do anything you want.\"<br>\r\n<br>\r\nTori let go of his arms and he fell to the floor. Tori knelt down and patted him on the head like a dog. \"Good boy\"<br>\r\n<br>\r\n\"Can I please go?\"<br>\r\n<br>\r\nTori showed the boy at her mercy pity, but it was fake. \"Aw, sorry. I can't have you telling anyone my secrete now, can I?\" Tori took out the gun and fired it at the crying guy. Once Robbie was at 4 inches she picked him up and brought him to her face. \"Well, you said you'll do anything to not end up like Cat, so here's your chance to pleasure me.\"</span></div></div>",
            "created":1424235600,
            "id":1936417,
            "title":"Robbie"
        },
        "11412":{
            "author_id":"cooldude24",
            "author_name":"Dream-writer1992",
            "choices":[
                "50 Feet",
                "100 Feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How tall does she grow?</span></div></span></div>",
            "created":1360558800,
            "id":1530278,
            "title":"Tori grows"
        },
        "1142":{
            "choices":[
                "Shrink more people",
                "grow her self",
                "grow a differnet person"
            ],
            "content":"<div class=\"\"><div> <span>\"NO! im not eating my sister!\" Cat looks at tori and says \"Fine! Then how about this?!\" She shrinks tori down to three inches, and picks her up. How about you stay in here? She opens up her panties, and drops tori in. Tori is jumbled around inside Cat's underwear, skin, and pussy. \"CAT LET ME OUT!\" tori yells. \"No way tori! You're my new toy!\" She closes her pants, leaving tori in her underwear. \"Now what should i do?\" </span></div></div>",
            "created":1280898000,
            "id":930216,
            "title":"shrinks tori"
        },
        "11421":{
            "choices":[
                "Shrinks more people",
                "Goes home"
            ],
            "content":"<div class=\"\"><div> <span>Cat walks down the hallway, and sees Andre. she quickly shrinks him. She picks him up, and puts him in her backpack. She then sees Beck and Jade. She shrinks both of them, and jade starts yelling. \"PUT US BACK NOW!\" she yells. \"Aw, but jade! You're so cute this way!\" Cat gives jades breasts a little poke then says \"How about you join Tori?\" Cat opens her pants, and pulls out her panties. Tori looks up, and starts yelling for help. Cat tosses jade into her underwear, and shuts her panties. She then throws beck in with Andre. The bell rings, and cat has to go to class. She walks into her class, and sits down on one of the seats. When she sits down, Tori and Jade are shoved into Cat's ass. Cat notices, and squishes her butt around, and giggles as Tori and Jade scream. After class, Cat...</span></div></div>",
            "created":1280984400,
            "id":930343,
            "title":"Shrink more people"
        },
        "114212":{
            "choices":[
                "Fondles them both, playing with their bodies.",
                "Puts them in her mouth"
            ],
            "content":"<div class=\"\"><div> <span>After school, she walks home, squishing Tori and Jade as she walks. She giggles as they pound on her skin begging her to let them go. She gets home, and goes to her room, locking the door. She opens up her panties, and sits cross legged on her bed. She pulls the two tiny girls out, and strips them down to their underwear. She puts the two in between her legs. Tori tries to run, but Cat easily grabs her. \"Don't try to run Tori! You will be punished!\" She puts Tori down, and smiles at the two shivering in fear. She then.....</span></div></div>",
            "created":1283058000,
            "id":946826,
            "title":"Goes home"
        },
        "1142121":{
            "author_id":"orioles2012",
            "author_name":"wwe champion",
            "choices":[
                "makes them kiss",
                "other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cat picks up tori and starts fondling her boobs and tori starts to moan<br>\r\nCat then picks up jade and fondles her boobs and jade starts to moan<br>\r\nNext...</span></div></span></div>",
            "created":1338958800,
            "id":1353917,
            "title":"Fondles them both, playing with their bodies."
        },
        "11421211":{
            "author_id":"orioles2012",
            "author_name":"wwe champion",
            "choices":[
                "she crushed them with her bobs",
                "let them kiss"
            ],
            "content":"<div class=\"\"><div> <span>Cat told tori and jade to kiss and Tori said I don't want to kiss her<br>\r\n<br>\r\nJade said I will do it but what's the catch. Cat said if you don't kiss then I will crush you with<br>\r\nMy breasts. Cat forced tori near jade and then thay kissed<br>\r\nThen... </span></div></div>",
            "created":1339218000,
            "id":1356669,
            "title":"makes them kiss"
        },
        "114212111":{
            "author_id":"cooldude24",
            "author_name":"Dream-writer1992",
            "choices":[
                "She goes and get Beck and Andre and starts playing with them",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Cat then picked up Tori and Jade and placed them in her boobs. Tori yelled up to cat \"What do you think your doing?\"  Well, I'm not going to let you guys have all the fun. \"Cat says with a wink\" she then squeezes her boobs together, Both Tori and Jade are yelling for cat to stop, But Cat is having too much fun to listen to them, She then grows bored of it and takes Tori and Jade out and place them in her panties, Cat says, \"This is where you will stay when I don't feel like playing with you guys.\" and with that she snaps her pants shut leaving Tori and Jade inside.</span></div></div>",
            "created":1355893200,
            "id":1490890,
            "title":"she crushed them with her boobs"
        },
        "1142122":{
            "author_id":"nalarue",
            "author_name":"nalarue",
            "choices":[
                "Am Full",
                "was waiting a bit before eating you"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, don't you two look so cute down there, I would say cute enough to eat\" Cat said while licking her lips. Cat then grabs Tori, but instead of eating her puts her in her cleavage. \" I couldn't possibly eat both of you at the same time, so I put you there till I can get to you.\" She then grabs Jade and holds her over her open mouth,and says \" You were always so mean to me, even when I was being nice to you, so this is payback, Bye Bye jade\" With that she lets Jade go screaming into her mouth. \"MMMMH, you taste divine Jade.\" She says while tossing Jade around in her mouth and sucking on her like candy. \"Well, I've gotten all the flavor and fun I'm going to get out of you, so down you go.\" GULP and Cat swallowed Jade. \"OHHHH she tasted so great, I almost didn't want to swallow her.\" During this whole time Tori had been trying to escape Cat's cleavage, but to no avail. Cat then remembered that she had Tori as well, \"Oh Tori, you didn't think I'd forget about you did I, well I didn't It's just that I......\"</span></div></div>",
            "created":1369458000,
            "id":1596710,
            "title":"Puts them in her mouth"
        },
        "11422":{
            "author_id":"cheeselover100",
            "author_name":"Cheeselover100",
            "choices":[
                "Grow more",
                "Play with her now tiny friends"
            ],
            "content":"<div class=\"\"><div> <span>After stuffing the tiny sized Tori in her panties, Cat thought to herself\" Hmm, lets see what else this puppy can don\" she points it straight at her chest and set it to growth. As she fired she relished in the feel of pleasure surging through her body( could be from the growth, or the fact that tori was still in her, maybe even both) she held the trigger for a long time. Finally she let go after busting through the school( and her clothes). She looked around and estimated that she was around 100 ft tall, which is about 20x bigger then what she was at. Now she had another thing to think about... what to do</span></div></div>",
            "created":1462942800,
            "id":2146449,
            "title":"grow her self"
        },
        "114221":{
            "author_id":"cheeselover100",
            "author_name":"Cheeselover100",
            "choices":[
                "Grow even more",
                "Rampage"
            ],
            "content":"<div class=\"\"><div> <span>\" I guess it wouldn't be a bad idea to grow myself a little bit more\" Cat thought\" But first...\" She continues as she takes Tori out of her bra and sets her on a nearby rooftop\" Don't want you to grow any bigger\" Cat said to her tiny friend and then continued to grow herself to 500 ft, then she wanted to have more fun</span></div></div>",
            "created":1466139600,
            "id":2165554,
            "title":"Grow more"
        },
        "114222":{
            "author_id":"cheeselover100",
            "author_name":"Cheeselover100",
            "choices":[
                "Do a taste test",
                "Squish you"
            ],
            "content":"<div class=\"\"><div> <span>Cat takes Victoria out of her panties (or what's left of them) and holds her up to her face and inspected her, Victoria was about normal size now due to the growth, Cat then had a idea and set the tiny girl onto the palm of her hand, as Victoria looked up at her now massive friend, she started to back away in fear of what she could do to her, Cat simply just stared. After awhile of nothing, Victoria yelled\" Just put me down you sicko path\" This caused Cat to smile and leaned her face closer to her doll like friend\" You tell me to do something, just for that I think I sould__________\"</span></div></div>",
            "created":1463374800,
            "id":2148694,
            "title":"Play with her now tiny friends"
        },
        "1142221":{
            "author_id":"cheeselover100",
            "author_name":"Cheeselover100",
            "choices":[
                "Play with the city",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>After saying this Tori screams \"No\", as she is shoved into Cat's gaping mouth. Inside her mouth Cat can feel her friend pounding her tiny fists against the inside of her mouth, until she stopped. \"Wow\", Cat thought, \"this is boring,\" so she tilted her head back and felt Tori slide down her throat, thus ending her part of the story. And now Cat was bored again, what should she do now?<br>\r\n<br>\r\n<br>\r\n<br>\r\nP.s.(yes I did notice that the last part had a mistake, where it says sicko path it was supposed to be psychopath :l )</span></div></div>",
            "created":1464411600,
            "id":2155129,
            "title":"Do a taste test"
        },
        "12":{
            "author_id":"thebandgeek",
            "author_name":"I <3 BAND",
            "choices":[
                "Tori",
                "More choices (sorry I messed up when I initially did this and forgot this choice",
                "Robbie",
                "Cat",
                "Jade"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is going to shrink?</span></div></span></div>",
            "created":1278651600,
            "id":914531,
            "title":"shrink who?"
        },
        "121":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Home",
                "School for the preforming arts"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will she shrink.</span></div></span></div>",
            "created":1281157200,
            "id":932023,
            "title":"Tori"
        },
        "1211":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>Tori was fliping threw a Sky store cataloge that Cat gave her. This is so stupid she said to herself then she sall somthing that cought her eye a shrinking potion it was probubly just candy but for ten dollers she could aford to see it. The next day it arived the label sayed \"shrinking potion have an adventure in your own home!\" She took off the lid it smeld like strawberrys she drkank half the bottle it tasted so good she couldnt help hersef she drank the rest. For ten dollers she was satisfied she didnt expect tho shrink but then she started feeling woozy then she rapidly started shrinking but luckly her cloths were shrinking but she was a little exsited but she stoped at six inches wow this is so cool then a gint bare foot slamed down near her majing her fall. it was trina does she know aboughther tiny sister?</span></div></div>",
            "created":1281157200,
            "id":932042,
            "title":"Home"
        },
        "12112":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Trina",
                "Mom"
            ],
            "content":"<div class=\"\"><div> <span>Tori stared in aw at her sister she looked like a giant did she see her she looked up at her face she hadnt even noteced that she almost steped on her. \"Trina down here at your feet!\" but Trina didnt see her and sat down on the couch not too far even at her size. Who should she go too?</span></div></div>",
            "created":1281157200,
            "id":932099,
            "title":"no"
        },
        "121121":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "She sees a tiny Tori",
                "All she sees is a bug who needs to get steped on"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tori ran too her sisters feet and pounded on her toes then screamed as loud as she could. Then she looked up to hear one of the scaryst things \"ewww a bug.\" She lifted her foot over Tori \" no its me Tori! does she notice</span></div></span></div>",
            "created":1281157200,
            "id":932125,
            "title":"Trina"
        },
        "1211211":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "sure i'd love to help",
                "you look so cute like this"
            ],
            "content":"<div class=\"\"><div> <span>Tori sqreamed a loud sqream and fell to her knees and put her hands infrontof her face in a feble attempt to stop the foot. No! Tori cried with tears in her eyes \"what was that bugs cant talk, or cry?\" She pulled her foot back and looked down at her Tori! is that you YES ITS ME BUGS DONT TALK! she yelld in anger but your so tiny how did you get so small? I orderd a shrinking potion and it worked but I didn think it would work so I never orderd the growth potion so could you help its fun but id like to be able to grow if I need.</span></div></div>",
            "created":1281157200,
            "id":932163,
            "title":"She sees a tiny Tori"
        },
        "12112111":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "\"Why not invite Cat over? She'd be absolutely tickled to see me like this.\"",
                "\"We could play a game or watch a movie for a bit. Just hang out.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah fine, no problem. You know you can count on me,\" Trina said, her fingers wrapping around her miniature sister. Tori didn't like being held this way, it was demeaning and took away all of her mobility, but she was hardly in a place to complain. Trina stood to full height with her sister in hand, which gave Tori a terrible feeling of vertigo. <br>\r\n<br>\r\n\"Hey, at least the talent-to-size ratios are appropriate now!\" Trina said with a laugh, causing Tori to roll her eyes. At least Trina was being nice to her. Things could have gone very differently. <br>\r\n\"So what do I need to do so you can grow back to full height?\" Trina asked, with a genuine-seeming sense of concern. Trina smiled, despite the death-grip she was held in.<br>\r\n\"You need to find the Sky Store catalog and order the Growth Potion,\" Tori half-yelled up to her sister. Trina frowned at this, however.<br>\r\n\"Won't it take several days to get it, though?\" Trina asked the doll-like Tori. Tori yelled up \"Yeah,\" in reply, looking kind of bummed.<br>\r\n<br>\r\nTrina set Tori down on their dining room table while she filled out the order form. While her sister was busy with that, Tori looked around and really took in the size of it all. Now that she wasn't afraid for her life, it really was amazing. It was a real downer that she didn't have the option to return to full-size yet, though. Her surroundings were impressive, but nothing was more intimidating than her giant sister. It blew her away to be around another person. Trina held so much power over her that she might as well be a doll. Every slight movement from Trina humbled the tiny Tori. <br>\r\n<br>\r\n\"So what should we do with you now?\" Trina asked her, crossing her arms after fitting the order in an envelope. </span></div></div>",
            "created":1452315600,
            "id":2086590,
            "title":"Surprisingly Helpful Trina"
        },
        "121121111":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Tiny Cat",
                "The three go to Jade's room and find a tiny goth"
            ],
            "content":"<div class=\"\"><div> <span>A joyous squeal from Cat Valentine was deafening even at normal size, but now Tori had to clutch her ears as she was held in her titanic best friend's grip.<br>\r\n<br>\r\n\"Easy Cat, don't break her ears.\" Trina scolded, poised to grab her little sister (a term that had never been more accurate now that she thought about it) from the ditzy giantess at a moment's notice.<br>\r\n<br>\r\n\"I'm sorry Trina.\" Cat pouted briefly before she smiled again \"She's <i>so</i> cute.\" The redhead squealed before she began kissing Tori's six-inch frame.<br>\r\n<br>\r\n\"Ugh! Cat! Stop!\" Tori cried as pink lipstick was smeared over her whole body.<br>\r\n<br>\r\n\"Oh sorry.\" Cat blushed. \"I'll fix it.\" Unfortunately for Tori, \"fixing it\" in Cat's mind translated to running her tree sized tongue along Tori's little body leaving her drenched but free of lipstick.<br>\r\n<br>\r\n\"Ok you've had your fun.\" Trina cut in, her sisterly instincts unable to be ignored any longer, as she back took her miniature sibling, sticking her on the coffee table and doing her best to wipe her dry.<br>\r\n<br>\r\n\"Sorry.\" Cat blushed again as she sat next to Trina. \"Wait... how'd you get so tiny?\"<br>\r\n<br>\r\n\"That Sky Store shrink potion you showed me.\" Tori waved off. \"I ordered one. Didn't think it would work but-\" She shrugged helplessly.<br>\r\n<br>\r\n\"So... it's... it's my fault you're so tiny and helpless?\" Cat croaked, now on the verge of tears.<br>\r\n<br>\r\n\"No Cat, it's... <i>I</i> ordered the potion. I did this. And besides Trina's been taking care of me.\"<br>\r\n<br>\r\n\"Yeah I'm feeding her popcorn pieces.\" The elder Latina shrugged carelessly before she poked Tori's stomach, knocking her over. \"Look at her little buddha belly. Three bites did all that.\" Trina laughed despite Tori's miniature glare.<br>\r\n<br>\r\nBut all these words were lost on Cat who broke down crying, burying her head in Trina's shoulder.<br>\r\n<br>\r\n\"Hey Cat it's okay.\" Trina soothed with uncharacteristic comfort. \"Tori's fine. I won't let anything happen to her. When the growth potion gets here, she'll be back to normal. Everything's alright.\"<br>\r\n<br>\r\n\"No it's not!\" Cat snapped, surprising both Vega sisters. \"I have to-\"<br>\r\n<br>\r\n1) \"shrink myself down.\" Cat cried as she pulled out a second shrink potion and shrunk to Tori's size.<br>\r\n<br>\r\n2) \"find Jade. She hasn't been seen in days and I gave her a shrink potion.\"<br>\r\n</span></div></div>",
            "created":1554181200,
            "id":2638608,
            "title":"Cat comes over"
        },
        "1211211111":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Cat still shrinks herself.",
                "Cat accidentally shrinks Trina.",
                "Cat takes Tori home."
            ],
            "content":"<div class=\"\"><div> <span>Cat pulled a small bottle out of her backpack, filled with a red liquid. The bottle was identical to the empty one that had been placed on the coffee table after its contents shrunk Tori. <br>\r\n<br>\r\n\"I have to shrink myself down!\" Cat cried, feeling the only possible way to make up for what she did to Tori was to suffer through it with her. <br>\r\n<br>\r\nAs Cat started to twist the cap off, Trina grabbed the bottle and tried to wrestle it away from her.<br>\r\n<br>\r\n\"Cat, stop it! That won't help Tori!\" Trina said while struggling to pull the bottle away from the redhead.<br>\r\n<br>\r\n\"No! I deserve it! If Tori has to suffer being so itty bitty then I have to too!\" Cat replied, but then her aggression evaporated as she said, \"Oh hehe, a tutu, I bet Tori would look so cute in a little tutu.\" <br>\r\n<br>\r\nAs Cat was distracted with her sudden musing, Trina tore the bottle from Cat's hands. She seemed somewhat confused on Cat's change in demeanor, but from the handful of time's she's seen her sister's friends she's known Cat could be a bit ditzy.<br>\r\n<br>\r\nTori, down on the table, could only watch the mayhem above. She did shoot Cat a warning glance as the massive redhead stared at her with stars in her eyes, imagining her tiny friend in a tutu.<br>\r\n<br>\r\n\"No one else is shrinking!\" Trina yelled, storming over to the fridge and placing the red drink inside. \"I already have to babysit my little sister while she's tiny, but I'm not gonna turn into a full-blown daycare. Besides, I already sent the form for one growth potion, I'd need a new one to order another.\"<br>\r\n<br>\r\nCat looked sad while Trina shot down her perfectly reasonable idea, but her face perked up with a new idea.<br>\r\n<br>\r\nWhat's Cat's idea?<br>\r\n<br>\r\n1. Cat is determined. She'll act normal for now, but when Trina's back is turned, she's going to drink the shrinking potion so she can pay for her transgressions. <br>\r\n<br>\r\n2. Cat realizes Trina is right. She decides they should do something together, like watch a movie or play a game or something, to cheer Tori up. Unfortunately, during the activity, Cat gets drinks for everyone and accidentally gives Trina the shrinking potion, leaving Cat the only normal-sized one.<br>\r\n<br>\r\n3. Cat thinks of a way she can atone without shrinking herself. She offers to watch after Tori for Trina, which Trina happily agrees to because less work for her. Tori gets absolutely no say as Cat excitedly takes her home.</span></div></div>",
            "created":1585458000,
            "id":2809863,
            "title":"Cat's Idea Shot Down"
        },
        "12112111112":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Deposited into a backpack.",
                "Carried like dolls.",
                "A mile in Cat's shoes."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my gosh, I just had the best idea,\" Cat said with excitement. Trina only looked at her quizzically. \"We should watch a movie together! That will get this off Tori's mind for a bit.\"<br>\r\n<br>\r\nTrina shrugged and agreed. \"Sure, I'll find something to watch, you can get us drinks and popcorn.\" <br>\r\n<br>\r\nTrina grabbed her tiny sister from the coffee table and set her on the couch next to her as she flipped through available movies.<br>\r\n<br>\r\nMeanwhile Cat put popcorn in the microwave and started looking through the Vegas' fridge. \"What do you want?\" Cat called over to Trina.<br>\r\n<br>\r\n\"I have a drink in the dark blue cup in there. I usually add some fruit flavoring in it too, if you can find it,\" Trina called back.<br>\r\n<br>\r\nCat easily located the dark blue cup and set it on the counter. She did a quick scan of the fridge and the red bottle from before caught her eye. It did say on the label it tasted like strawberries, that's a fruit! <br>\r\n<br>\r\nCat poured the red liquid into Trina's drink, causing it to fill nearly to the brim. She then took the cap from the bottle and filled it with water for Tori, and got herself a water bottle. Cat brought the drinks to the coffee table, except for Tori's which she set in front of her tiny friend. Then Cat went back and brought them all popcorn.<br>\r\n<br>\r\nTrina took a few sips of her drink, and thought it tasted unusually good. The three sat down and watched the movie for a little bit, while Trina went through her drink pretty quickly.<br>\r\n<br>\r\nDuring a scene with no dialogue, Trina leaned over and asked Cat, \"Hey Cat, where did you find strawberry flavoring? It's really good, but I didn't think we had any.\" <br>\r\n<br>\r\nTori looked up at her sister in shock, immediately knowing what had happened. Timed perfectly, Trina quickly shrank in size on the couch, and within seconds she was the same size as her shrunken sister.<br>\r\n<br>\r\n\"Cat!\" Trina screamed, though her voice was much quieter comparatively now, \"what did you do!\" <br>\r\n<br>\r\n\"Oops, I forgot the strawberry flavoring was the shrink potion!\" Cat responded, upset. <br>\r\n<br>\r\n\"You <i>forgot?!</i>?\" Trina exclaimed in fury. <br>\r\n<br>\r\n\"I'm sorry!\" Cat  yelled back, her loud voice easily overpowering Trina's. At this point she seemed to grow defensive, as it was an honest mistake on her part.<br>\r\n<br>\r\nCat and Trina went back and forth for a minute, before Cat got frustrated and stomped her foot.<br>\r\n<br>\r\n\"Listen! I'll take you both home with me and I'll look after you,\" Cat said.<br>\r\n<br>\r\nHow does Cat plan to take the small sisters home with her?<br>\r\n<br>\r\n1. She dumps them both into her small pink backpack, not realizing she's not being careful at all with Tori and Trina.<br>\r\n<br>\r\n2. She carries them both home in her hands like dolls. Though, they could easily be dropped, or set down, or seen...<br>\r\n<br>\r\n3. Cat is angry with Trina, so she drops her in her shoe. Tori laughs at Trina, but Cat takes it the wrong way and gets offended, thinking Tori is making fun of her, so she puts Tori in her other shoe. They both have to survive the walk home in Cat's shoes, and hope the ditzy redhead remembers to take them out as soon as she gets home.</span></div></div>",
            "created":1585458000,
            "id":2809926,
            "title":"Cat's Mistake"
        },
        "12112112":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>\" No I think i'll keep you like this besides your soo cute!\" Tori was shoked she couldent beleve what she was hearing. \" Change me back now\" she yelled stomping her tiny foot Trina just lafught \" I dont think your in a position ton talk back your so tiny and helpless I could do any thin I want too you.\" she said knoking over Tori with her foot then she bent down and snached her 'little' sister up. Now I think you should learn your place With that she placed Tori on the round infrrount of her giant 'to Tori' sheos then sat on the couch \"now clean them\" Trina said \"No you cant make me!\" Tori yelld Trina stood to her full hight she towed over her even her bare feet dwarfed her.\" What was that\" \" so do you want me to start on the toe or heel first?\" Tori said esely perswaded \" Thats what I thought you said.\" After five minates Trina fell aslep ahould Tori run away.</span></div></div>",
            "created":1281243600,
            "id":932475,
            "title":"you look so cute like this"
        },
        "121121121":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Cat",
                "Jade"
            ],
            "content":"<div class=\"\"><div> <span>Tori started sneking away from her blisfuly unaware giantess sister then she crowled under the door. As soon as her tiny feet reached the side walk she ran as fast as she could at this size. But sudenly a giant sneker slamed infront of her whe looke up to see.</span></div></div>",
            "created":1281243600,
            "id":932476,
            "title":"yes"
        },
        "1211211211":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Cat goes to school and plays with the \"bug\" between her toes during class.",
                "Cat goes home and removes her shoes and socks, but forgets about the \"bug\""
            ],
            "content":"<div class=\"\"><div> <span>Tori looked up and saw a gigantic red haired girl. Literally scarlet-colored hair. \"Cat!\" Tori shouted with glee, \"she'll help me, she's a nice person.\" Cat was looking right at Tori. \"Hey little buggy!\" Cat exclaimed at Tori. \"Bug? Oh no! Cat thinks I'm a bug!\" Tori realized with fear. Cat leaned down and picked up the \"bug\". \"I love bugs! And they love me. Hey little buggy, wanna go home with me?\" Cat asked the bug, not expecting an answer. Tori was shouting at Cat, screaming her name, whatever, but Cat couldn't hear her. \"Oh no, I'm wearing a skirt, I don't have any pockets for you!\" Cat said. She thought for a moment, and decided where the bug would go. \"I'm sure you'll love it inside my shoe! You can party with my toes!\" Cat said playfully. \"What? CAT NO!\" Tori screamed as Cat leaned down and removed her right sneaker. She was about to place Tori in her sneaker then got a better idea. \"Ooh I know, I'll put you in between my toes!\" Cat said happily, thinking she was doing the bug a favor. Tori gasped with fear. Cat removed her sock and tucked Tori as far as possible between her big and second toes. She then put her foot to the ground and scrunched her toes, squishing Tori. \"Ooh, you feel so nice buggy. I LOVE having you there! Maybe you can stay there all day!\" Cat said, winking at her toes. Tori was in hell. Cat had a strong foot odor, and in between her toes it was even worse. Not to mention the torturous way Cat scrunched her body, pushing Tori right into her toe flesh face-first. Cat giggled, then grabbed her smelly sock and put it back on. Tori was incased in a slight darkness, and Cat's foot stench was multiplied by two. \"Ugh, I think she put her sock back on. Cat I swear if I ever get out of this situation I will kill you!\" Tori said, mad at Cat, even though she would never hurt Cat. Cat then put her foot back in her sneaker, wiggled her toes, then scrunched them a few times. Tori was incased in total darkness this time, and the foot odor was multiplied by a hundred. Then tori was being squished around between Cat's toes as Cat wiggled them. Then Tori was pushed face first into the toe flesh yet again twice, as Cat scrunched her toes. After about twenty minutes, Cat's foot sweat and dirt on her foot formed around Tori and glazed her in between Cat's toes.</span></div></div>",
            "created":1281330000,
            "id":933025,
            "title":"Cat"
        },
        "12112112111":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Finally, finally discovered.",
                "Forgotten.",
                "Cat's intense dance moves."
            ],
            "content":"<div class=\"\"><div> <span>Cat arrived at Hollywood Arts that morning, more excited than usual, which is saying a lot. She loves her school and she loves her friends, and most days are truly great. But today is even greater, because she made a new little bug friend that gets to stay with her all day.<br>\r\n<br>\r\nHer only disappointment today was that her friend Tori was absent. She texted her, but hasn't gotten a response yet. She figured Tori was probably sick and sleeping in, she'd get a reply later.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nTori suffered down in Cat's pink converse. She was covered in sweat, probably as much Cat's as her own. She was being squeezed from both sides, an immense amount of pressure from the two slick, fleshy walls on either side of her. And worst of all was the atmosphere, the smell. It was hot, Tori felt like she was burning up. It was humid, too. It was like the worst of humid Summer days down here, the kind where you felt like you swam as much as you walked through the air. And of course, to make the terrible combination as bad as possible, it reeked of sweat and feet. <br>\r\n<br>\r\nTori knew Cat had done a lot of walking today, and it was pretty hot outside, but she never could have imagined her small adorable friend could have such sweaty, smelly feet. Or that she would ever have to experience up close and so very, very personally. <br>\r\n<br>\r\nCat would never intentionally cause harm to one of her friends, but she wasn't the brightest bulb in the bunch and she could definitely be very playful. Tori just had the worst of luck, for Cat to think she was just a bug. Wait, how did Cat normally treat bugs? Tori would need to have a long conversation with her when this was all over.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nCat found that while her tiny bug friend was fun to play with during her fun classes, it was really, <i>really</i> fun to play with during her boring classes. She could scrunch her toes and feel it squirm between them. She loved the way that felt. She also liked to try her best to dislodge it from her toes, and see if she could capture it again. <br>\r\n<br>\r\nShe knew her bug friend was having even more fun than her. She was giving it a party, just like she promised. Cat was almost a little jealous, a party with giant toes sounded really silly...and fun! <br>\r\n<br>\r\nShe had to stifle her giggling during class, while she paid more attention to her imagination than anything the teacher was saying. She could picture her little bug in its own little club room, her shoe, doing complex and super fun dances with her toes. And the bug was so happy and grateful she invited it!<br>\r\n<br>\r\nCat was easily distracted, however. The moment anything else caught her attention, she would forget about the bug completely for a while. Usually she would remember in the next class, when the bug started to squirm a lot. But by the time she got to her dance class, she had completely forgotten about the bug for the rest of the day.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nTori had begun to pick up on the rhythm of her personal hell. She didn't know Cat's schedule perfectly, but she was getting somewhat used to how long Cat was in class. Time felt a lot different trapped in Cat's shoe. <br>\r\n<br>\r\nShe could tell which classes Cat liked better. When Cat was enjoying class, her toes moved more absent-mindedly, and her torment of Tori was very accidental. But when Cat was in a class she found boring, she played with Tori.<br>\r\n<br>\r\nTori liked the classes Cat didn't a lot more. When Cat got bored, her toes became much more purposeful and active. They moved and wiggled with intent. The massive digits worked to dislodge Tori from her prison.<br>\r\n<br>\r\nAt first, she was grateful. After all the walking in the morning, Tori thought she was glued in between Cat's toes with no escape. But with lots of effort and several minutes of toe wiggling, Cat had freed the miniature girl. But Tori came to learn being lightly crushed between two toes was safety. Because now that Tori was free, the toes wanted to play for real.<br>\r\n<br>\r\nTori had been well acquainted with Cat's big and second toes, but she had been lucky enough to not meet the rest. Now, Tori was in front of all five digits, each wiggling in excitement. She had no room to back up, as Cat's sock kept her extremely close. And so her toes had no trouble grabbing Tori's tiny body, and pounding into her, smashing her repeatedly underneath them.<br>\r\n<br>\r\nTori felt Cat's entire foot bob while the row of toes slammed into Tori's body, coating her in a new light sheen of sweat, and coating her back from the damp insole. Sometimes the toes slammed her, sometimes they grabbed her. Tori was scrunched in the arch under Cat's toes, she was scrunched between more sets of Cat's toes, she was even forced back to her original position between Cat's biggest toes, though of course not oriented the same.<br>\r\n<br>\r\nIt seemed as if Cat had a lot of particular fun with taking on the challenge of repeatedly freeing Tori from her toes, and then forcing her back between them. Through the process of doing this multiple times, through several classes, Tori learned that there was seemingly no limit to the amount of positions and orientations she could find herself in as she was crammed between Cat's toes. Her least favorites involved going face first, of course. Face first and upside down was one of the worst.<br>\r\n<br>\r\nBefore lunch, Cat had freed Tori from between her toes, but when the bell rang she walked to lunch before securing Tori again. This was the first time Tori had experienced walking while not secured, and it had terrible results.<br>\r\n<br>\r\nTori spent Cat's entire lunch with her face pressed into the wet interior of Cat's white sock, while her giant friend pressed down on her with the ball of her foot. But Tori's hair was free from the ball of Cat's foot, and unfortunately two of Cat's smaller toes had caught the majority of Tori's hair between them. Whenever Cat's toes would flex, or absent-mindedly wiggle or scrunch, Tori's hair would get pulled harshly and she would yell out in pain. But no one could hear her tiny yells of pain inside Cat's shoe. <br>\r\n<br>\r\nHow does the rest of Tori's day go?<br>\r\n<br>\r\n1. As well as it can, given the circumstances. Cat actually remembers to check on her bug after her dance class, which through circumstances leads to her finally learning her bug is actually Tori!<br>\r\n<br>\r\n2. Continually bad. Cat's completely forgot about her bug and goes through the rest of her school day without remembering the bug. The real problem being, she forgets at home, too.<br>\r\n<br>\r\n3. As poorly as possible. Tori doesn't survive Cat's dance class.</span></div></div>",
            "created":1585630800,
            "id":2811205,
            "title":"Tori the Tiny Truant"
        },
        "121121121111":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Cat puts Tori in her place.",
                "Cat sends Tori to the pit.",
                "Cat devours her rude friend."
            ],
            "content":"<div class=\"\"><div> <span>Cat entered the locker room with her classmates, happy to get out of her sweaty clothes. Most of her classmates were still breathing heavily, exhausted. Cat was very tired herself, it was an intense dance class. But she loved the class so she was still in a pretty good mood.<br>\r\n<br>\r\nWhile she was changing, she felt a small struggle between her toes. She had forgotten about her tiny bug! She quickly took off her shoe, and then her sock. Sitting on the bench, she put her foot up on her knee so she could inspect her toes. <br>\r\n<br>\r\nBetween her second and third toes, the small form of her bug friend struggled. Cat giggled, both at the slight tickling sensation of her bug and at its predicament. It seemed unable to get out from in between her toes, even though her foot was free.<br>\r\n<br>\r\n\"Hey little buggy, are you stuck?\" Cat asked, giggling. \"Dance class must have been really fun, if you were partying with my toes earlier than that must have been a rave!\" She wiggled her toes and laughed cutely at her little prisoner. \"Poor little buggy, you're so weak you can't even get away from my toes! Though I guess that's because you love them, they're your best friends,\" she said, adorably naive.<br>\r\n<br>\r\nCat reached down and swiped her index finger between her toes, dragging the bug out with it. It was kind of gross actually, her toes were really sweaty and the bug was absolutely <i>drenched</i> in her toe sweat. She brought her finger closer to her face to inspect her bug friend, and was shocked at what she saw.<br>\r\n<br>\r\nThe tiny bug that's been partying with her toes all day didn't look so much like a bug now that she got a really good look at it...From afar, at its size, it was hard to tell, it looked buggy enough. But close inspection revealed a humanoid shape...Cat squinted her eyes and brought the bug even closer, ignoring the sweaty foot smell radiating off of it.<br>\r\n<br>\r\nThis wasn't just a humanoid-looking bug, it was a person! And not just any person...<br>\r\n<br>\r\n\"Tori? Is that you?\" Cat asked, in genuine shock. The small girl on her finger was filthy, and soaking wet. Her hair was plastered to her body and she was coated in layers of grime. But yet something about this filthy tiny girl reminded Cat of her friend Tori.<br>\r\n<br>\r\n\"Cat! Finally, it's me! It's me Tori!\" the tiny girl yelled, confirming Cat's suspicion. It really was Tori. <br>\r\n<br>\r\nCat's mouth was agape with shock, and then she covered her mouth as she started to laugh. Tori looked up at Cat angrily and yelled, \"Cat! Why are you laughing, this is serious, I need help!\"<br>\r\n<br>\r\n\"Tori, you're covered in sweat from my toes,\" Cat barely managed to get out between giggles. Tori groaned.<br>\r\n<br>\r\n\"Ugh, Cat, I know, it's been so disgusting in your shoe all day...\" Tori said with a face of disgust.<br>\r\n<br>\r\n\"What's that supposed to mean?!\" Cat immediately shot back, clearly offended. Tori was well familiar with Cat's ability to suddenly take offense, so she tried to quickly diffuse before Cat got too angry.<br>\r\n<br>\r\n\"No, no Cat I didn't mean it like that! Everyone's feet stink, and who wouldn't sweat so much after a dance class like that!\" Tori said quickly. Cat's mouth dropped, and Tori could tell she was upset.<br>\r\n<br>\r\n\"Oh, so you're saying my feet stink and I sweat too much? Ugh!\" Cat replied angrily. Tori grew extremely worried. She knew Cat sometimes didn't see things the same way as other people. And from experience, she knew that from Cat's perspective, she basically just insulted her heavily, and Cat was pissed.<br>\r\n<br>\r\nHow does Cat take out her anger on Tori?<br>\r\n<br>\r\n1. Cat puts Tori back exactly where she was, and won't even consider removing her from her toes until the next morning. If Cat's feet are so awful, Tori will just need to acclimate to them.<br>\r\n<br>\r\n2. If Tori thinks Cat's feet are so awful, she'll just have to show Tori that it could be a lot worse. Cat keeps Tori in her armpit for the rest of the day.<br>\r\n<br>\r\n3. Cat is so mad at Tori, she gives into an urge that she was keeping down in the back of her head. She immediately washes Tori as best as she can and does what she secretly really, really wants to try. She eats Tori.</span></div></div>",
            "created":1591765200,
            "id":2849253,
            "title":"Tori Invokes Cat's Ire"
        },
        "1211211211113":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "content":"<div class=\"\"><div> <span>Tori can never understand Cat's logic when her mood flips on a dime like this. But she could tell she really pissed her giant redheaded friend off.<br>\r\n<br>\r\nCat's fingers closed in on Tori, and she began to walk towards the bathroom. Tori struggled in Cat's grip, but her petite fingers easily overpowered the tiny Latina. <br>\r\n<br>\r\nAfter what felt like a brisk walk from inside Cat's fist, Tori heard running water. Right as Cat's fingers finally opened up, Tori was assaulted by a torrent of freezing water, stronger than any waterfall she'd ever been under. Cat manhandled Tori the whole time, turning her body around in her fingers, washing her all over.<br>\r\n<br>\r\nTori was practically drowning, as she did not expect her sudden waterboarding. After choking on way too much water, the torment finally stopped. Cat brought the soaking wet Tori up to her face and inspected her. The expression on Cat's face was still not pleased, which concerned Tori quite a bit.<br>\r\n<br>\r\n\"Well Tori, you'll never have to deal with my horrible, horrible feet ever again, I bet that makes you <i>so</i> happy,\" Cat said with a biting, accusatory tone.<br>\r\n<br>\r\n\"Cat, you're overreacting, your feet-\" Tori tried to explain, but she was cut off by an aggravated screech from Cat.<br>\r\n<br>\r\n\"Ugh! You're so <i>rude</i>, Tori! I am not overreacting! I thought maybe it was too much for me to punish you, but clearly you don't understand not to insult a giant so I'm going to do it anyway,\" Cat said, quite upset. Tori's eyes practically bulged out of her head when she heard that. <br>\r\n<br>\r\nStill dripping, Tori picked herself up in Cat's palm and took a couple of steps forward. \"Cat, what do you mean, <i>punish</i> me?\" the tiny girl asked nervously.<br>\r\n<br>\r\n\"Oh, I'm going to eat you,\" Cat replied innocently.<br>\r\n<br>\r\n\"You're going to <i>what?!</i>\" Tori immediately shouted back angrily. \"Cat, that is insane, you can't do that!\"<br>\r\n<br>\r\nCat's expression darkened in frustration once more and she scowled at Tori. \"Stop telling me what to do, Tori! You're teeny tiny and I'm not so what I say goes. And I really want to try eating you, and you've been bad, so that's what's going to happen,\" Cat declared.<br>\r\n<br>\r\nTori tried to back away but she just bumped into Cat's fingers. \"Cat, please, you can't do this!\" Tori yelled, pleading for her life.<br>\r\n<br>\r\nCat's index finger and thumb closed around Tori's midriff, her index finger pressing into her back and her thumb pressing into her stomach. Cat brought the tiny girl between her fingers closer to her face, and rolled her eyes, as if Tori just said something really dumb.<br>\r\n<br>\r\n\"Of course I can, you're like, really small, you'll fit in my mouth easily,\" Cat said, with a slight laugh at the absurdity of what Tori suggested. Cat raised Tori over her head, and looked up at the minuscule girl in her grasp, taking in the sight of everything about her.<br>\r\n<br>\r\nFrom Tori's perspective, being brought above Cat's face was terrifying. Her huge, brown eyes studied her, not a hint of guilt in them. Gravity itself was willing Tori to be brought down to Cat's pink lips, which were currently turned in a slight smile.<br>\r\n<br>\r\nTori tried yelling more in protest, but Cat's smile grew wider, showing her white teeth, an innocuous gesture before but quite intimidating now. \"Sorry Tori, you had your chance, you should have just partied with my toes,\" Cat informed her, and then opened her mouth wide. <br>\r\n<br>\r\nBelow her, Tori saw Cat's huge pink lips part, revealing her perfect white teeth and a dark cavern further in. As her lips parted, more light filtered in and Tori could see glints of light reflected in the saliva coating Cat's teeth and the inside of her mouth. As well as the massive tongue waiting below, formerly hiding in Cat's mouth.<br>\r\n<br>\r\nTori could see the corners of Cat's mouth tug into a slight smile even though her mouth was open. She seemed quite excited about this, even though Tori was yelling in terror. <br>\r\n<br>\r\nCat's huge pink tongue moved forward, sticking out of her mouth and over her bottom lip, as if begging to taste Tori before she even fell in Cat's mouth. Cat even said, \"Aaaah.\" The tongue quickly retreated, however, and Cat's mouth closed in time for a quick giggle. Tori thought this was the moment Cat would reveal it was all just to scare her.<br>\r\n<br>\r\nBut then Cat's lips parted again, and Tori even watched a strand of saliva trail from her top front teeth to her tongue, and then breaking from being stretched too far. And just as it broke, Tori lost her sense of security as Cat's massive fingers loosened and gravity took control of Tori's fate.<br>\r\n<br>\r\nTori screamed as she fell between Cat's lips, landing squarely face-first onto the giant, bumped muscle that is Cat's tongue. Tori was hit with so many physical sensations at once she didn't have time to process them all.<br>\r\n<br>\r\nShe was already wet from water, but the entire front of her body was now coated in Cat's saliva. It was easy to tell the distinction, as Cat's saliva was much, much warmer than the cold water had been. It was also much stickier, and Tori could feel how her every moment left strands between her body and Cat's tongue.<br>\r\n<br>\r\nThe inside of Cat's mouth in general was much warmer than outside, and the humidity was off the charts. And it smelled like Cat's breath, which wasn't bad per se, but it was still human breath and the inside of a person's mouth, so it wasn't <i>not</i> bad either. <br>\r\n<br>\r\nRight at the moment of impact, Cat's lips began to close, and Tori was quickly sealed in the darkness of Cat's mouth. She was worried about going straight for Cat's throat, but gravity began to shift as Cat's head lowered. Tori was initially sliding down Cat's tongue, but soon found herself sliding back down, closer to the middle.<br>\r\n<br>\r\nAs Cat's mouth fully closed, the interior grew more and more cramped and Tori found her body squished between Cat's muscular tongue and the relatively hard roof of her mouth. There was a sense of suction as...well, as Cat began to suck on Tori, tasting her.<br>\r\n<br>\r\nThe entire time Tori was screaming, but she found she had to quickly stop, as she  wound up swallowing and choking on way too much of Cat's saliva. <br>\r\n<br>\r\nCat's tongue moved Tori around a bit, flipping her over and tasting her thoroughly. Tori could even hear a loud, vibrating \"Mmmmm\" from Cat, which shook the entire cavern around her and rattled her bones. <br>\r\n<br>\r\nTori tried to struggle, she wanted to find a way to escape or fight back, but it was useless. She was so small and weak, and Cat's mouth seemed as if it was made to easily manipulate her. Because it was. Tori was Cat's food, and Cat's mouth was adept at handling food.<br>\r\n<br>\r\nTori had just enough time to come to the depressing realization that in the grand scheme of things, she was just a snack for her friend, before she felt the tongue she struggled against begin to dip slightly. Before she could react, a wall of saliva rushed up from below and submerged her completely, washing her towards the back of the tongue.<br>\r\n<br>\r\nTori could not resist these motions, and soon she reached Cat's throat. The back of Cat's tongue shoved against Tori, dumping her and the pool of saliva she was trapped in into the throat, where the powerful throat muscles took over and began to force her downwards. Tori was squeezed and forced down the length of Cat's esophagus before finally being squeezed through an orifice and landing with a splash into her stomach. <br>\r\n<br>\r\nTori couldn't really stand very wall, as there was no rigid floor to speak of, just a malleable and slipper stomach lining, but she did her best to wade towards the nearest stomach wall and pound against it, screaming, as saliva rained down on her from above. She did not stop her struggle, even when her skin began to itch.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nOutside, Cat giggled to herself right after swallowing Tori. She laughed even more when she felt Tori's struggles inside her stomach. She had never eaten anything alive before, but she really liked swallowing Tori whole.<br>\r\n<br>\r\nNow that Tori was dealt with, Cat felt a little silly for getting so mad before, but figured what's done was done. Besides, she really enjoyed playing with Tori in her mouth, and she loved the sensation of gulping her down and feeling her struggle in her stomach. So in the end, it was worth it.<br>\r\n<br>\r\nThat day, Tori Vega was stuck as a sweaty foot bug for hours, and ended her day as nothing more than food for her ditzy redheaded best friend. <br>\r\n<br>\r\nCat Valentine went on to discover the shrinking potion in the Sky Mall catalogue. Assuming it was what shrunk Tori, she ordered a lot of it. Soon, the usually innocent Cat would shrink just about anyone whenever the mood struck her. At first, it was just anyone who had made her mad, and in her eyes, insulted her deeply. They got eaten pretty quickly.<br>\r\n<br>\r\nBut soon Cat started to use the shrinking liquid more and more. It wasn't even that expensive. Every boyfriend she had wound up shrunk. She only swallowed one right away, the rest got kept as pets for a while. Thanks to Tori, Cat discovered she liked keeping tiny people in her shoes, unfortunately for them. More than one shrunken victim wound up crushed or drowned during dance class.<br>\r\n<br>\r\nHowever Cat preferred to get rid of her tiny people by eating them, as it was her favorite thing to do with them. Over time, she began to shrink anyone for just about any reason. It wasn't unusual for her to shrink some random guy at school just because she was hungry, or felt playful and wanted him in her shoe, or bra. <br>\r\n<br>\r\nOne by one, she even shrunk her friends. Robbie was quickly devoured when Cat was hungry. Andre and Beck each spent the day in a bra cup before being kept as pets for a week. They were both eaten as well, but on different days. Trina spent an entire day under Cat's butt at school, where she expired during the last class due to suffocation. Jade was the only friend Cat never shrunk, though no one knows whether Jade could tell what Cat was doing or not.<br>\r\n<br>\r\nMany, many students at Hollywood Arts met their ends in belly of the petite redhead Cat Valentine, who ate them all without remorse.</span></div></div>",
            "created":1591851600,
            "id":2849471,
            "title":"Swallowed by Cat Valentine"
        },
        "12112112112":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "climb on th couch",
                "contact her through her ticklsh feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tori woke up in Cat\"s empty sheo at Cats house. She looked up on the couch and sall the redheaded giantess on the couch waching cartoons. Tori knew she had too get her atetion as she wouldnt last long on at Cats unaware feet.But how?</span></div></span></div>",
            "created":1286686800,
            "id":972833,
            "title":"Cat goes home and removes her shoes and socks, ..."
        },
        "121121121121":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You start to try to climb out of the shoe, but due to all of Cat's foot sweat, its slippery and difficult. Do you make it?</span></div></span></div>",
            "created":1293512400,
            "id":1024132,
            "title":"Can You Make It Out Of The Shoe First?"
        },
        "1211211211212":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Cat was just putting her shoes on.",
                "Cat remembered her pet bug and wanted to play with it."
            ],
            "content":"<div class=\"\"><div> <span>Tori tries to climb the interior of the shoe but it's too slippery and every time she tries she falls back to the moist insole. Tori is lightly coated in Cat's foot sweat, and tries not to puke from how gross it is. She spends several hours breathing in the scent of Cat's shoe, occasionally trying to escape again, with no luck. But then she looks out of the opening and sees familiar red hair. \"Cat!\" Tori shouts excitedly. </span></div></div>",
            "created":1342760400,
            "id":1383596,
            "title":"Too Slippery!"
        },
        "12112112112121":{
            "author_id":"giantess18",
            "author_name":"Haro-Haze",
            "choices":[
                "Jog",
                "My play"
            ],
            "content":"<div class=\"\"><div> <span>Tori yelled \"cat cat it me Tori\" but her hopes were quickly crushed as she saw cats disgusting sweaty and stinky bare foot over her shoe prison \"no cat please don't do this, not again\" Tori ran to the toe section of cat damp sweaty shoe and layed down<br>\r\nCat slipped on the shoe completely unaware that Tori was inside her barefoot came in contact with torus puny body which cat felt \"oh hey little bug guess your coming to _____ with me hahaha(laughing childishly)\"<br>\r\nTori was scared not only was she trapped in cats horrid shoe with her barefoot but it was only going to get worse<br>\r\nCat smiles \"ok let's go to______\"</span></div></div>",
            "created":1373346000,
            "id":1625301,
            "title":"Cat was just putting her shoes on."
        },
        "121121121121211":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "Cat lets her out",
                "Cat forgets about her.  "
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go for a little run,\" Cat said, and Torri screamed in frustration.  Each step was torturous.  With each step Torri was squeezed against her odorous toes, forced up against foul gunk and lint as she began to jog.  Torri hoped it would end, maybe she would slide under the sole and be crushed, but no such luck.  Cat was careful to keep her in her foul toes' grasp.  </span></div></div>",
            "created":1425531600,
            "id":1944278,
            "title":"Jog"
        },
        "1211211212":{
            "author_id":"shikamaru",
            "author_name":"Mr.Ninja",
            "choices":[
                "Down the hatch",
                "Jade has something else in plan."
            ],
            "content":"<div class=\"\"><div> <span>Jade looked down and saw Victoria. \" I knew that idea would work!\" Jade said as she picked Victoria up. Jade looked at Victoria and licked her lips. \"It is lunch time and I think you look yummy.\" \"No no no! Please don't!\" Victoria yelled.</span></div></div>",
            "created":1304744400,
            "id":1101874,
            "title":"Jade"
        },
        "12112112121":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Trina the doll",
                "Tori sits on Trina"
            ],
            "content":"<div class=\"\"><div> <span>But all of Tori's pleas fell on deaf ears. This was the moment Jade had been waiting for for over a year and half (yes, this exact scenario). At last her greatest rival would be gone forever and she'd be the top dog once again.<br>\r\n<br>\r\nJade opened her mouth showing Tori her mountainous teeth and tree sized tongue before she dropped the miniature girl into the abyss, swallowing a second afterwards and sending Tori deep into the bowels of the titanic goth.<br>\r\n<br>\r\n\"Hah.\" Jade smirked as she felt the Latina slide down her esophagus. \"I should eat more Latin food.\" She laughed. As Jade began to walk away however, she felt Tori stop moving. \"Oh trying to get out huh? Well we have something for that.\" Jade smirked as she reached for her water bottle.<br>\r\n<br>\r\nBefore Jade could take a sip however, she dropped the bottle, doubling over while clutching her stomach as she felt her insides be pounded on and bent out of shape. \"OW fuck! What the hell are you doing Tori?\"<br>\r\n<br>\r\nTypical Jade. Eating someone and then complaining about them fighting back.<br>\r\n<br>\r\nJade made another attempt to reach the water bottle only for her to start coughing up blood. Tori must have punctured an internal organ.<br>\r\n<br>\r\n\"How the hell is she doing this? She's six inches tall.\" And that was Jade's last thought before a full size Tori burst free from her body like the alien bursting free from John Hurt. And like John Hurt's character, Jade was completely dead. She would not be missed or mourned by anyone. In fact, the day she disappeared would come to be viewed as a holiday by all, especially her family.<br>\r\n<br>\r\n\"Ugh, yuck.\" Tori commented, rather cavalier about the whole experience, as Jade's internal fluids dripped off of her. \"Should probably get rid of this body. Still shrink potion only lasts an hour and... what's this?\"<br>\r\n<br>\r\nTori bent down to Jade's purse to find another shrink potion, no doubt a backup that Jade had planned to force feed Tori should things have not gone according to plan. Unscrewing the top, Tori allowed a drop to fall on Jade's bloodied corpse, shrinking it down to nothing. \"And the rest of this... well?\" Tori smirked looking back at her house.<br>\r\n<br>\r\nAn hour later, Trina Vega woke up, expecting to see her miniature sister cleaning her shoes on the floor. Trina let loose a yawn and stretched only to pause. \"That's not right.\" She commented. She never had this much room on her king size bed let alone the sofa. Looking around she paled as everything was fifty times its ordinary size, Trina herself now trapped in the crevice caused by her formerly super-sized ass.<br>\r\n<br>\r\n\"Hi Treen.\" Tori called up from above. Trina turned to see her little sister, now utterly gigantic in comparison to her, smiling down at her. \"Ready for some sisterly bonding?\"</span></div></div>",
            "created":1555304400,
            "id":2645018,
            "title":"Down the hatch"
        },
        "12112112122":{
            "author_id":"giantlover1",
            "author_name":"giantlover",
            "choices":[
                "Shoe",
                "Panties"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Should Jade put Tori in her shoe or the back of her panties?</span></div></span></div>",
            "created":1305349200,
            "id":1105581,
            "title":"Jade has something else in plan."
        },
        "121121121221":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Jades house",
                "at school"
            ],
            "content":"<div class=\"\"><div> <span>Jade held her by her shirt so her tiny body dangled. \"Lets see your too big to go in my shoe, but we can fix that.\" With that Jade took out a shrinking potion and brought her towards the vial. \" No wait please wait.\" but it was to late and Jade dunked her tiny head under the brew she pulled her out coughing and hacking up the vial substance from her lungs. Then she felt a too familar feeling come over her body and the giant Jade started getting bigger. <br>\r\n<br>\r\nTori continued to dwindle smaller and smaller in jades palm. Tori stopped at only an inch tall her mouth agape at the sheer size of Jades smirking face. \" There you look much better now ha ha.\" Jade then dropped Tori into her right sneaker she looked up out of the shoe at Jades smiling face \" have fun in there\" Tori stared in horror as Jades massive socked toes wiggled in excitement she ran to the toe section and was just small enough to not be touched by her foot. In the sheo it was dark, hot, and had a slight oder Tori just sat in the dark and cried. Twenty minuets later the shoe came off and she sall she was at</span></div></div>",
            "created":1307163600,
            "id":1119561,
            "title":"Shoe"
        },
        "1211211212211":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "playing",
                "torture"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before Tori could even get used to the light when Jade dumped her out on a giant plain that was her bed. \"Lets have some fun hmmm.\" Jade said all Tori could gulp in fear and imajene what was to come.</span></div></span></div>",
            "created":1307163600,
            "id":1119570,
            "title":"Jades house"
        },
        "12112112122112":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Micro Cat",
                "Big Cat"
            ],
            "content":"<div class=\"\"><div> <span>Tori winced as Jade's massive thumb pushed down on her little body.<br>\r\n<br>\r\n\"Beg me Vega.\" Jade said coldly. \"Beg me to stop.\"<br>\r\n<br>\r\n\"Please.\" Tori cried, hot tears streaming down her cheeks. \"What did I ever do to you?\"<br>\r\n<br>\r\n\"What?\" Jade snapped as she applied even more pressure, causing Tori to scream even louder. \"You stole my roles, you stole my confidence, and you're trying to steal Beck. I was everything and you made me nothing!\"<br>\r\n<br>\r\nTori should have known. \"I didn't steal anything.\" She managed. \"They gave the roles because they thought I was better suited for them. Beck's only a friend, I SWEAR!\"<br>\r\n<br>\r\n\"<i>Lies</i>!\" Jade screamed as she wrapped her fingers around Tori and hoisted her to eye level. \"All lies. You're here to thwart me.\"<br>\r\n<br>\r\n\"You're insane,\" Tori said, \"You always have been but this-\" Tori was cut off as Jade began to squeeze. Jade smiled as her arch rival was nearing death. \"Now it's my turn to make it shine. It's always been about me.\" Tori fought to stay awake but her vision soon began to black out.<br>\r\n<br>\r\nNow what happened next Tori didn't quite follow. One second she was near death, the next she fell face first onto Jade's bed. Through the pain she felt, she vaguely made out what sounded like a struggle, with Jade on the losing side, before she felt something large crash down next to her.<br>\r\n<br>\r\nWhen Tori opened her eyes, she was greeted to the sight of Jade's massive blue/green eye only it seemed dead. Hesitantly, Tori took a few steps forward and poked the eyeball a few times to no reaction. Unlikely as it seemed, the gigantic goth was dead.<br>\r\n<br>\r\nNew noises caused Tori to look up and see her gigantic sister. \"No.\" Tori said as she tried to hide in Jade's hair only for Trina's massive fingers to seize her and hoist her upwards. Tori thrashed about, rather like a hamster, but couldn't fight her sister's titanic grip. While Tori feared she would wind up somewhere degrading, she was instead cuddled up against Trina's soft cheek. It was then that Tori realized the noises, Trina was crying.<br>\r\n<br>\r\n\"Never scare me like that again.\" Trina said in a serious tone. \"I would kill myself if you died because of me.\"<br>\r\n<br>\r\n\"You made me a slave.\" Tori shot back.<br>\r\n<br>\r\n\"I was joking around!\" Trina snapped, sounding very insulted. \"You seriously think I wouldn't take care of you like this? For god's sake, I just strangled Jade to death for you.\"<br>\r\n<br>\r\nTori looked back to the dead goth. \"Oh... thanks. But I'm still stuck like this.\"<br>\r\n<br>\r\n\"Yeah I've been thinking about that. If Cat told you about the Shrink Potion, she probably knows something about it. Let's go.\" With that, Trina dropped Tori into her ample bosom. <br>\r\n<br>\r\n\"Trina!\"<br>\r\n<br>\r\n\"Oh come on, where else am I gonna keep you where you won't be crushed? I may be your sister and will always be there when you need me, but I'm still your sister and am gonna give you hell.\"<br>\r\n<br>\r\nTori rolled her eyes as she leaned against Trina's breasts. At least Trina was helping her. \"Mrs. West I killed your daughter!\" Trina cried as she walked out of the house. \"That's nice.\" Jade's disinterested mother cried back.<br>\r\n<br>\r\nA short car ride later, the two arrived at Cat's house. \"Door was unlocked, I'm sure that's fine.\" Trina muttered as she entered.<br>\r\n<br>\r\nPulling Tori out of her breasts, Trina held out her right hand so her little sister could stand. \"Which of these is Cat's room?\"<br>\r\n<br>\r\n\"Upstairs. Third door on the left.\" Tori said as she took in the sheer size of the house. Trina found the room quickly enough and entered \"Alright Cat. We have a...\" Trina trailed off.<br>\r\n<br>\r\n1) Cat is nowhere to be seen. When Tori and Trina look around for clues, Tori finds Cat, now a centimeter tall, making her less than half Tori's current size.<br>\r\n<br>\r\n2) Cat has been messing around with the growth potion and is now 15 feet tall, unable to move around very much, certainly too big to fit through her bedroom door.</span></div></div>",
            "created":1556773200,
            "id":2653900,
            "title":"Torture"
        },
        "121121121222":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Front of my pantie Tori go!",
                "Back of my pantie Tori go"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jade thought should I put Tori in front of my pantie or back of my pantie?</span></div></span></div>",
            "created":1451538000,
            "id":2082099,
            "title":"Panties"
        },
        "1211211212221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Takes Tori out to play a game",
                "Keeps Tori in her panties for self-pleasure"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"You'll do just fine in here.\" Jade said.<br>\r\n<br>\r\nJade pulls on front waistband of her panties and drops Tori inside with her vagina. She released the waistband and patted on her vagina with Tori in it. She then walks home and she</span></div></span></div>",
            "created":1489899600,
            "id":2291743,
            "title":"Front of my pantie Tori go!"
        },
        "121121122":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Trina plays with Tori with her feet.",
                "Trina puts her shoes on with Tori's head trapped between her toes still."
            ],
            "content":"<div class=\"\"><div> <span>Tori didn't run, because Trina didn't look like she was sleeping that heavily. Tori was about to start cleaning Trina's shoes, in hoping that her crazy giant sister would be happy with her when she woke up, but then Trina's foot moved on top of Tori. Tori's head was sticking out between her sister's smelly toes. Trina was still asleep. Tori groaned, because she wasn't sure how long she would be here, and her sister's feet smelled really bad. In her sleep Trina would occasionally scrunch her toes and force Tori's face directly into the slightly sweaty, very smelly toe flesh between her toes. Tori would squirm and struggle underneath Trina's giant foot, hoping Trina would either wake up or move her foot or something so she could escape.<br>\r\n<br>\r\nAfter about a thirty-minute nap, Trina finally woke up. \"Tori? Where are you?\" She asked, after not seeing her tiny sister on the floor cleaning  her shoes. Then she felt something squirming under her foot. She smiled, realizing what it was. She looked down at her right foot, and could see Tori's tiny head between her toes. She purposely scrunched her toes twice, and then said \"Well Tori if you wanted to spend time with my feet you could have just asked! I mean, I don't know why you'd want to because even I know they smell, but it's obvious you stuck your head between my toes for a reason.\" Trina wiggled her toes now, and couldn't hear Tori screaming.</span></div></div>",
            "created":1318568400,
            "id":1206315,
            "title":"Tori Stays"
        },
        "1211211221":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Trina only did this as a joke, and lets Tori stop.",
                "Trina makes sure Tori finishes cleaning both feet in their entirety. "
            ],
            "content":"<div class=\"\"><div> <span>Trina wiggled her toes, getting a good feel of her younger sister's plight between them.<br>\r\n<br>\r\n\"You know Tori, since you're already down there, you might as well do me a favor. You were supposed to be cleaning my shoes while I slept, but you barely did anything. So to make up for it, why don't you clean my feet, instead? You can start between my toes, of course,\" Trina said, without a hint of a joke. She almost appeared as if she thought this were the sensible course of action, given the circumstances.<br>\r\n<br>\r\nTori yelled, \"Are you serious?\" in response, but it appears Trina didn't quite hear her. Tori struggled to get out from under Trina's foot, but had no luck. The warm flesh held her in place all too well. Still, Tori refused to degrade herself to such a task. She would not lick anyone's feet, much less her very own sister's. She thought Trina was delusional for even considering the notion. <br>\r\n<br>\r\nTrina took notice of the fact that she didn't feel a tiny tongue cleaning in between her toes. She knew what she asked of her little sister would be shocking, so she was willing to give her time to swallow the monumental task before actually beginning. However, a few minutes passed, and she could feel Tori trying to squirm free, but still no licking. <br>\r\n<br>\r\nTrina sighed. \"Tori, you better get licking. Now.\" Trina squeezed Tori's minuscule head between her toes, with enough force that she was sure it would hurt, but still gently enough to prevent popping her sister.<br>\r\n<br>\r\nDown below, Tori heard her sister downright command her to begin the ungodly task, quickly followed by the gargantuan toes on either side of her head closing in. It happened so quickly, the sweaty toe flesh just collided with both sides of her face and entombed her, before wriggling around and rubbing dirt and sweat all over her. It was quite painful, and Tori worried whether or not Trina might accidentally kill her by using too much force. However, just as quickly as it began, the toes separated, though Tori could not get the way the toe flesh stuck to her face briefly before separating out of her mind.<br>\r\n<br>\r\nDefeated, Tori reluctantly stuck out her tongue and began to lick the skin between Trina's toes. Tori was beyond disgusted, and had no words for her shameful task. She would have to live the rest of her life knowing she knew what her sister's feet tasted like. Sweat, dirt, and a hint of something uniquely...just, feet. But of course, only in the worst way. Tori moaned as tears streamed down her face, but she continued her degrading task. When she looked up, she saw her titanic sister smiling down at her.</span></div></div>",
            "created":1485406800,
            "id":2269437,
            "title":"Sisterly Bonding"
        },
        "12112112212":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "New Things in Store",
                "Tori the Shoe Cleaner",
                "Epilogue - Tori the Foot Slave"
            ],
            "content":"<div class=\"\"><div> <span>Trina felt absolute catharsis. Ever since her baby sister got into Hollywood Arts, it seemed like the whole world had lost its collective mind. She was proud of Tori for getting into the prestigious school too, but ever since she started attending it seemed like everyone kept overlooking Trina in favor of her little sister.<br>\r\n<br>\r\nWhich just didn't make any sense. Tori was decent, but Trina had real <i>talent</i>. So why was everyone ignoring her and casting her sister in everything? Tori won everyone's praises and Trina's superior talent was completely disregarded.<br>\r\n<br>\r\nTrina's frustration and anger had built over time, and was part of the reason her and Tori bickered so often. Well that, and Tori was just sort of annoying.<br>\r\n<br>\r\nBut now, finally, Trina had catharsis. Her over-achieving, less talented brat of a sister foolishly shrunk herself and was now trapped on the floor under her foot licking it clean. And it felt <i>so good.</i> Literally speaking, her sister's tiny tongue removing the dirt and grime between her toes felt really good, and figuratively speaking, because things finally felt right. <br>\r\n<br>\r\nThe next hour passed in bliss for Trina, as she had to do little but occasionally instruct Tori which part of her foot to clean next. Other than that, she just felt more relaxed than she ever had in her life.<br>\r\n<br>\r\nDown below on the floor, however, was a very different story. While Trina was in heaven, Tori suffered in hell. <br>\r\n<br>\r\nThe tiny Latina kept waiting for her huge sister to tell her the cruel prank was over. Trina could be rather uncaring at times, so an inhumane prank didn't seem out of her wheelhouse. But every time Tori tried to quit or back away or stop in any way, Trina swatted at her with her massive toes or stopped her with a quick but light stomp and told her to get back to work.<br>\r\n<br>\r\nAfter the first several minutes, Tori finally began to accept that this was no prank. Trina really was making her clean her feet. And so Tori did. Through streams of tears and formerly unfathomable degradation, Tori kept running her tongue across the soft, tan feet of her titanic sister. <br>\r\n<br>\r\nHer tongue scraped every last bit of dirt and grime off of Trina's feet, of which there was not too terribly much. Trina's feet were far from filthy, but she had not showered yet today, and on such a small scale Tori was unfortunately able to clean much more thoroughly. <br>\r\n<br>\r\nOver the course of the next hour, Tori's tongue became quite dry over a dozen times. Every time this happened, she gave herself a moment to pause and allow her tongue to rest in her mouth to re-moisten. It also allowed her to taste everything on her tongue in much more detail, but this was an unwanted and very unintended side effect. After the first couple of times, Tori learned she did not earn a very long time to try and refresh her tongue, as Trina was fairly impatient. <br>\r\n<br>\r\nAs Tori came close to finishing her horrid job, she looked like an absolute mess. Her hair was matted with Trina's sweat, her face was covered in some of the grime from between Trina's toes, and minuscule flecks of sock lint and toe jam that would be imperceptible to anyone of normal size clung to the skin of her face.<br>\r\n<br>\r\nTrina smiled down at her teeny sister with satisfaction as she finally finished the job she had given her. Knowing Tori had never in her life cleaned anything with her tongue, especially not something so huge to her, Trina was fully impressed with the work she had done. <br>\r\n<br>\r\n\"You know Tori, I think I've found your calling. You're a <i>much</i> better foot cleaner than a singer,\" Trina praised. Tori simply looked up at her giant sister looming overhead with despair, tears forming in her eyes anew at her words.<br>\r\n<br>\r\nWhat comes next?<br>\r\n<br>\r\n1. Trina moves on to other things. Does she have more in store for Tori? Or maybe she wants to show her sister to someone? Either way, for now, Trina is done tormenting her sister with her feet.<br>\r\n<br>\r\n2. Trina slides her shoes towards Tori. She did a great job on her feet, but that doesn't change the fact that she still needs her shoes cleaned.<br>\r\n<br>\r\n3. Tori's new life. Trina meant what she said, she had found Tori's new calling. She keeps her sister tiny and never tells anyone. This will be an epilogue chapter.</span></div></div>",
            "created":1585371600,
            "id":2809238,
            "title":"Tori the Foot Cleaner"
        },
        "121121122122":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Tori's Break",
                "Tori Cleans Her Own Shoes",
                "Trina's Tiny Tori Cleaning Service"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, <i>little</i> sister,\" Trina said while using her foot to slide one of her ankle boots towards her sister, \"now that you've made my feet so clean, it's time to do what I asked in the first place. Clean my shoes.\"<br>\r\n<br>\r\nTori almost flinched as the giant shoe slid towards her, afraid it would topple over and crush her. Once it stopped moving and her fears of being squished by giant footwear abated, she stared up at Trina in disbelief. She just went through that torturous experience and Trina has <i>more</i> work for her?<br>\r\n<br>\r\nJust as she was about to level her complaint, Tori saw annoyance show on Trina's face, since her sister hadn't even begun yet. And out of the corner of her eye, she saw Trina's huge toes shift slightly. Her huge, car-sized toes. Perspective came back to smack Tori in the face. She couldn't afford to upset Trina right now.<br>\r\n<br>\r\nThe filthy, grime-coated tiny sister gave in and begin to lick away at the material of her big sister's shoes. <br>\r\n<br>\r\nThe highlight of Tori's day was how easy it was to clean the tops and sides of Trina's shoes, as they weren't very dirty to begin with. She ran her tongue over all of it for formality and to make sure Trina didn't accuse her of skipping it, but it wasn't very necessary.<br>\r\n<br>\r\nWhat Tori feared was the bottoms of the shoes. She didn't want to have to taste everywhere Trina had been while wearing these shoes, but it was inevitable. <br>\r\n<br>\r\nOnce Trina took notice of Tori cleaning all currently available surfaces of the shoes, she set each one on its side and instructed her to clean the soles. Tori sighed dejectedly, and began to lick at the sole. It tasted of rubber, dirt, and grass, mostly. It took Tori a while, but she eventually had the bottom of each shoe spotless. It was degrading and gross, but after cleaning her sister's bare feet, she felt like this was a step up. Not to mention the shoes weren't very worn, thankfully.<br>\r\n<br>\r\nTori felt good about finishing, but was surprised when Trina set the boots upright and picked her sister up between her fingers and brought her over the opening.<br>\r\n<br>\r\n\"Trina, what are you doing? I'm not going in your shoes!\" Tori shouted up at Trina.<br>\r\n<br>\r\n\"Of course you are, silly. How else will you clean the insides?\" Trina laughed in response, then released her sister from her grasp.<br>\r\n<br>\r\nTori couldn't respond before she was in freefall, only to slam into the heel of the shoe. She picked herself up and brushed herself off, looking further into the cavern ahead of her. The ground was a soft tan material, not too terribly worn but clearly never washed in the same way the outside sometimes was. Ahead of her, the inside of the shoe grew dimmer and dimmer, and above was where all light streamed, and she could see Trina sitting on the couch above, attention on her phone.<br>\r\n<br>\r\nTori soaked in her surrounding, then sat on the ground and cried for a good five minutes. How could her sister do all of this? Trina was a pain in the butt for sure, but there wasn't any real animosity in their relationship. They were bickering sisters, but underlying it there was love and sisterly affection.<br>\r\n<br>\r\nSo how did it come to this? Suddenly Trina's entitlement and resentment for Tori  seemed turned up to 11, and she looks like she has no qualms forcing Tori to do such demeaning, inhumane things for her. There should be no reason for Tori to have spent an hour becoming intimately familiar with the taste of Trina's feet, and yet...here she was. How horrible. And then her shoes. Will the nightmare ever end?<br>\r\n<br>\r\nTori considered the possibility that finding her shrunken has caused Trina to see her more as a...toy, than a person. She'd have to remind Trina of her humanity, so Trina could come to terms with her own cruelty and free Tori.<br>\r\n<br>\r\nIn the meantime, however, Tori set to work. On her hands and knees, she lapped away at the floor, the occasional tear falling from her face. She wouldn't know if she lapped up her own tears, as the ground itself had the slight taste of Trina's sweat.<br>\r\n<br>\r\nThe further Tori got into the shoe, the stronger the taste got. When she got Trina's attention to be placed in the other shoe, she was almost relieved to start at the heel. The taste of sweat was so much weaker there than the toe of her other shoe.<br>\r\n<br>\r\nAs Tori was getting closer to finishing, what was Trina thinking about doing next?<br>\r\n<br>\r\n1. Now that Tori has done all of her work, it's time for her break. Tori is done cleaning for the day.<br>\r\n<br>\r\n2. Tori is really good at this. In fact, Tori owns a pair of sandals Trina really likes...So Trina makes Tori clean <i>her own shoes</i> so Trina can wear them.<br>\r\n<br>\r\n3. Watching Tori work is giving Trina an idea...she could probably charge her friends to have Tori clean their shoes (and/or feet?) while they watch. They'd probably pay a lot, too. Though this could be risky, telling people about Tori.</span></div></div>",
            "created":1589346000,
            "id":2835091,
            "title":"Tori the Shoe Cleaner"
        },
        "1211211221223":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Cat rents Tori for the weekend",
                "Jade gets a turn",
                "Tori appeals to Cat"
            ],
            "content":"<div class=\"\"><div> <span>Just as Tori was finishing the inside of Trina's second shoe, there was a knock at their front door. Tori crawled out of the shoe and onto the plush carpet as Trina called out, \"It's open!\"<br>\r\n<br>\r\nOff in what looked like the far, far distance to Tori, their massive front door swung open, and in walked one of her best friends, Cat Valentine. The normally adorable and petite redhead looked like a peppy goddess striding across the surface of a planet from this angle. Yet all she was doing was walking into their living room.<br>\r\n<br>\r\nTori cowered in fear as Cat walked over her, not noticing her small body on the carpet. Cat's gray sneaker landed a mere twenty feet from Tori while she walked, the vibrations from the impact shaking Tori to her core. <br>\r\n<br>\r\nCat sat down on the couch, her feet not too far from where Trina's shoes lie.<br>\r\n<br>\r\n\"So what's up?\" Cat asked Trina.<br>\r\n<br>\r\n\"Look on the floor, near my shoes,\" Trina told her. <br>\r\n<br>\r\nCat turned her gaze towards the floor, and her eyes locked onto Tori almost instantly. But Tori was surprised to see her face turn to disgust.<br>\r\n<br>\r\n\"Oh gross, Trina there's a huge bug on your floor,\" Cat said, lifting her foot. Tori flinched in fear as Cat brought her sneaker over her.<br>\r\n<br>\r\n\"No Cat stop! Look again,\" Trina demanded. Cat's foot retreated, and the redhead leaned forward and looked more closely.<br>\r\n<br>\r\n\"Oh my gosh, is that <i>Tori?</i>\" Cat asked, incredulous. Tori felt her face flush red as Cat recognized her in her new pathetic state.<br>\r\n<br>\r\n\"Yup. She drank some shrinking liquid from the Sky Store and I found her like this,\" Trina informed her. Cat's jaw dropped and she looked at Tori in shock.<br>\r\n<br>\r\n\"Wow, she looks so cute! But why is she so...dirty?\" Cat asked, looking intently at Tori's condition.<br>\r\n<br>\r\n\"That's the best part. I had her clean my feet and shoes, and she did a really good job,\" Trina told her.<br>\r\n<br>\r\n\"That's so weird,\" Cat giggled at the idea. <br>\r\n<br>\r\n\"For twenty bucks, she'll clean yours too,\" Trina said. Tori could see the delight in Cat's eyes. Tori was mortified. Trina was gonna make her clean Cat's feet and shoes. But there was no way Cat would be so cruel, right?<br>\r\n<br>\r\n\"Deal!\" Cat said, immediately pulling out a twenty dollar bill. Trina instructed Tori to begin cleaning Cat's shoes. Cat squealed in excitement and set her heels on the ground in front of Tori, her soles facing her at a diagonal.<br>\r\n<br>\r\nTori, completely defeated, walked forward and began to thoroughly lick the rubber sole of Cat's sneaker. Cat gasped in shock.<br>\r\n<br>\r\n\"Oh my gosh, why is she licking my shoe?\" Cat asked Trina, concerned. Tori couldn't see Trina's face, as she was too busy licking Cat's sneaker, but she could hear the smirk in her voice.<br>\r\n<br>\r\n\"That's how she cleans. She's very good at it, and very thorough. Just wait until she gets to your feet, it feels incredible.\"<br>\r\n<br>\r\n\"She's going to <i>lick</i> my feet clean? Isn't that like, totally gross and humiliating for her?\" Cat asked, still concerned. Tori felt a glimmer of hope, that Cat might stick up for her.<br>\r\n<br>\r\n\"Well Cat, Tori's really tiny and we're bigger than her, so she has to do what we say. So if we say she has to clean our feet, and she has to use our tongue, then she has to. Besides, she already completely cleaned my feet and my shoes inside and out, so she must not hate it too much,\" Trina said, obviously manipulating the air-headed Cat. Unfortunately, Cat bought into it completely.<br>\r\n<br>\r\n\"That makes total sense! Okay, can she clean my feet first, I really want to see what it feels like!\" Cat said excitedly. Tori's heart dropped, as Cat's concern vanished so quickly. Now she seemed eager for the minuscule Latina to clean her feet. <br>\r\n<br>\r\nThe giant rubber sole retreated from Tori, and Cat removed her shoes. Tori was immediately hit by a wave of foot odor and warm air emanating from Cat's socked feet. Cat wiggled her socked toes, then tugged off her slightly off-color white socks, dropping them on either side of Tori.<br>\r\n<br>\r\nTori was grossed out enough by the stench of the giant socks on either side of her, but then Cat inched her toes closer to Tori and wiggled them intently while giggling.<br>\r\n<br>\r\n\"Go on Tori, clean my toes! You have to, because I'm a big scary giant,\" Cat threatened cutely. Well, it would be cutely if what she was demanding wasn't so degrading.<br>\r\n<br>\r\nCat's toes spread wide and inched even closer, inviting Tori in. Tori looked in disgust at the paler toes, seeing the flecks of sock lint and the light sheen of sweat in between Cat's toes. Tori guessed Cat had been walking in the LA heat.<br>\r\n<br>\r\nTori gave in and pressed her head in between Cat's big and second toes, licking intently at the sticky skin in between. <br>\r\n<br>\r\nCat began giggling uncontrollably. \"She's really doing it! She's cleaning my toes! And it feels amazing, she really is a foot cleaner,\" Cat declared.<br>\r\n<br>\r\nTori did her best to ignore her. She just kept her face buried between Cat's toes, vigorously licking away the salty sweat and grime and chewing and swallowing any dead skin or sock lint she came across.<br>\r\n<br>\r\nReflexively, Cat's toes closed in around Tori's head, applying a great deal of pressure from both sides and practically entombing Tori's head in sweaty toe flesh. Tori struggled from the pressure, but she dutifully continued her grueling task and taking big gulps of air whenever Cat's toes would relax.<br>\r\n<br>\r\nTori didn't think she could feel lower than she did while licking her own sister's feet clean. It was as degrading and humiliating and inhumane as she thought possible. But now her sister was renting out her service to one of her own best friends, Trina was literally receiving money for Cat getting to \"use\" Tori to clean her feet.<br>\r\n<br>\r\nIt was truly heart-breaking because Cat was so sweet and innocent, and yet Tori's small size made it too easy for her to overlook how cruel and disgusting this is.<br>\r\n<br>\r\nCat merely giggled and observed as Tori worked hard on her toes. When Tori really got her tongue deep between her toes, Cat would squeal with delight. <br>\r\n<br>\r\nOver the course of an hour, Cat really relaxed and let Tori work away at her feet. Tori, meanwhile, was completely coated in a whole new brand of foot sweat. She was disgusted to think that she was caked in three layers of sweat. Her own, a dried coating of Trina's foot sweat, and now a fresh coating of Cat's. Trina's wasn't as bad, but Cat had been outside a lot today and walked plenty so her feet were actually quite sweaty, something Tori was unfortunately remedying quite effectively.<br>\r\n<br>\r\nThe sweat, as gross and unfortunate as it was, was reasonable. Tori was absolutely taken aback by how much Cat's feet reeked. Cat always seemed so cute and pristine and clean, not to mention wearing open-toed shoes quite often. Yet on a day where she wore her sneakers, she must have built up a scent quite fast. It was, of course, strongest by her toes, which Tori spent and unfortunate amount of time with her face buried deep between. <br>\r\n<br>\r\nIt was almost a relief to finish Cat's toes, because cleaning her sole was much simpler. Still, a lot of foot licking, and not completely devoid of sweat. But here at least there was little to no sock lint she had to eat, nor nearly as much dead foot skin or concentrated grime to get rid of.<br>\r\n<br>\r\nAfter Tori finished Cat's feet, she looked like hell, but Cat seemed really happy. <br>\r\n<br>\r\n\"Wow, that was amazing. I wish I could have her do that every day,\" Cat said, in bliss.<br>\r\n<br>\r\n\"Every time you bring me twenty bucks you can experience it again,\" Trina reminded Cat. \"Not to mention she still has to do your shoes, too,\" Trina said, turning her gaze on Tori to not-so-subtly remind her.<br>\r\n<br>\r\nWhat happens next, while Tori starts on Cat's shoes?<br>\r\n<br>\r\n1. Cat asks Trina how much it would cost to rent Tori out for the weekend.<br>\r\n<br>\r\n2. Trina asks Cat to text Jade to come over so she can service her, too.<br>\r\n<br>\r\n3. Trina leaves the room for a bit, giving Tori a chance to plead with Cat to try and save her.</span></div></div>",
            "created":1592110800,
            "id":2851206,
            "title":"Tori Services Cat"
        },
        "121121122123":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "content":"<div class=\"\"><div> <span>Trina had made up her mind. She would be keeping Tori like this. She took her sister to her room and set her on the floor with the shoes she wanted her to clean. She instructed her puny sister to clean them in their entirety, inside and out, tops and bottoms. <br>\r\n<br>\r\nShe waited a few hours, until Tori had cleaned her shoes, to break the news to her. Tori was furious. She screamed, she threw a fit, she cursed Trina with every ounce of her spirit. When the little Latina saw that her sister was not bothered by her fury, she became desperate and switched to pleading and begging. Trina never wavered. <br>\r\n<br>\r\nWith access to Tori's phone, it was easy for Trina to fake Tori running away. Whenever questioned, all she had to do was cry and play dumb and no suspicion ever came her way. Soon it became as good as the truth. Everyone believed Tori was gone.<br>\r\n<br>\r\nAll the while, Trina was enjoying high school life. Her talent still wasn't being recognized, but at least it wasn't accompanied with the frustration of watching her bratty younger sister being chosen for all the things she didn't deserve with her subpar talent. <br>\r\n<br>\r\nAnd Tori's true fate, that only she and Trina knew, was that instead of becoming the pop star she dreamed of being, she became the shrunken foot slave to her talentless older sister. She cleaned Trina's feet every day after school, and after that she cleaned the shoes she wore that day. During school, Tori was trapped in Trina's footwear, doing her best to massage her sister's giant sweaty foot while she went about her day.<br>\r\n<br>\r\nAfter the first year, Tori's will finally began to break. She rarely disobeyed orders, she almost never tried to escape anymore, and she had even stopped complaining. She knew her place in life, and she began to dutifully serve her undeserving sister's feet. <br>\r\n<br>\r\nTrina's feet were her world now, and she was no longer a person. Her only job was to keep Trina's feet and shoes spotless, and she became very good at it. <br>\r\n<br>\r\nOne day, years later, while monotonously cleaning Trina's foot, Tori was lost in thought, as the task had become second nature to her. She often remembered details of her old life, as they kept her sane, even if she knew it was a reality she no longer had access to.<br>\r\n<br>\r\nBut on this day, Tori realized something that chilled her soul. She had forgotten her old friends' names. She was replaying a fuzzy memory in her head, but she could not name any of her friends anymore. What was the pink-haired one named? She had the easiest name, it was very simple! What was it? She could not remember. Was her hair pink? It was something like that, pink or purple or maybe even red. It was all so fuzzy to her. <br>\r\n<br>\r\nFor the first time in months, tears found their way down Tori's face. She connected once again to the emotions she had abandoned long ago. No one but her would know or care that in this moment, the tiny girl lapping up the salty sweat underneath her sister's third toe on her left foot was crying because she didn't remember the names of her best friends. No one would know that she was crying also because she realized she no longer thought Trina's sweat tasted disgusting. No one would know that she was crying because the only things she knew to compare the taste to anymore all came from Trina's feet or shoes.<br>\r\n<br>\r\nThe tiny Latina cried to herself as she carried out her task for the millionth time, remembering that she hated her life. And she cried because she could not change it and she knew that in a week she would be back to how she was an hour ago.<br>\r\n<br>\r\nTori Vega was not a pop star. Tori Vega was a foot slave. People forgot Tori Vega, but they remembered her owner, Trina Vega.<br>\r\n<br>\r\nThe end.</span></div></div>",
            "created":1585371600,
            "id":2809263,
            "title":"Epilogue - Tori the Foot Slave"
        },
        "1211212":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Trina's inspection led her to realize it was a Tiny Tori and not in fact a bug.",
                "First stomp didn't get it, better finish it off!"
            ],
            "content":"<div class=\"\"><div> <span>Without even a pause to indicate Tori had been heard by her titanic sister, the monolithic bare foot slammed down on her. Tori had no time to prepare or react, and thus was mercilessly smashed against the floor. Tori's world was pain and darkness, yet she was still aware of the texture of her sister's foot sitting on top of her. The smell too, which unfortunately was not a good one. <br>\r\n<br>\r\nTori could not believe how short-lived her miniaturized adventure had been. She had barely gotten a chance to experience the world at such a small size before being stomped on like a bug. She had a difficult time just realizing where she was, buried underneath Trina's foot. What an awful place to be, and an awful way to die. Crushed like a bug under the foot of her untalented sister, of all people.<br>\r\n<br>\r\nTrina finally lifted her foot, to inspect the bug she had squashed. Tori was thankfully still alive, but in terrible condition. The potion must have made her more resilient, but not nearly invulnerable. She felt like she could barely move. All she could do was lie on the floor and look up at her sister's foot -- and even farther, Trina's gigantic face itself, eyes squinting to inspect her. Tori just waited for the gross foot to come back down and end her.</span></div></div>",
            "created":1452315600,
            "id":2086576,
            "title":"A Bug Under Trina"
        },
        "12112122":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "content":"<div class=\"\"><div> <span>Tori's last thoughts were about how stupid she was for imbibing a substance purchased from the Sky Store, how her entire life went from a little odd to utterly bizarre and unreal in the span of about five minutes, and about how she couldn't believe of all the ways she would leave the world, it would be by being crushed by her big sister's stinky foot.<br>\r\n<br>\r\nTori could only be concerned that the end of her life was such a gross and weird way to die as she watched Trina's funky foot rush down upon her at what seemed like blinding speed.<br>\r\n<br>\r\n----<br>\r\n<br>\r\nTrina Vega was having a perfectly normal day. While walking through her living room, she saw an odd bug on the ground. It was so gross, and reflexively, she stomped on it. She lifted her foot away from it, to see if she got it. She could barely make out movement, so she ended it. Trina squished the disgusting bug under her foot, and then ran to the bathroom saying, \"Ew ew ew gross gross gross!\" She then washed her foot, and never thought of the event again.<br>\r\n<br>\r\nAfter all, all she did was squish some stupid bug.</span></div></div>",
            "created":1585544400,
            "id":2810520,
            "title":"Trina Squishes a Bug"
        },
        "1212":{
            "author_id":"shrinkandgrow",
            "author_name":"fihak icisuk",
            "choices":[
                "It was Jade",
                "It was Cat",
                "It was Trina"
            ],
            "content":"<div class=\"\"><div> <span> \"Stupid\" she said \"stupid stupid\" Tori knew Jade wasn't someone to trust, but who will even think about the possiblity of being shrunk? And now she was 3 inches tall standing on the inside of a boot in Jade's locker unable to get out. &lt;&lt;It's just a trick I wanna show you. It won't hurt&gt;&gt; \"fucking psychopat\" Tori thought. When I get out of here I swear I'll kill that bitch. Suddenly... Tori heard someone opening the locker door.</span></div></div>",
            "created":1445662800,
            "id":2052098,
            "title":"School for the preforming arts"
        },
        "12121":{
            "author_id":"shrinkandgrow",
            "author_name":"fihak icisuk",
            "choices":[
                "The stinky boots",
                "The crushing foot"
            ],
            "content":"<div class=\"\"><div> <span> Jade opened the locker door, a bright light entered the boot where Tori was. Tori could see Jade, that, was grabbing the boot, and without looking started sliding her foot in it.<br>\r\n \"Wait...\" Tori said \"Wait she isn't... Wait Jade... JADE!\" she screamed when the foot was right over her head, sorrounding her with a horrid smell. After a second that seemed a lot more, Jade lifted her foot out.<br>\r\n \"Uh, forgot you where there\" she said inexpressive \"I nearly crushed you, I came here just for a change of boots, you know, I always do, the ones I'm using are too sweaty and stinky and all.\"<br>\r\n \"Get me out you psychopath!\" Tori yelled<br>\r\n \"Mmm... No, but\" Jade smiled \"I could let you choose between staying in my sweaty boots, or being crushed in this ones, don't worry you won't die.\"<br>\r\n \"What about setting me free?\" Tori yelled<br>\r\n \"Where's the fun in that? Choose, or it will be even worse\" Jade licked her lips<br>\r\n Tori remained silent, thinking about it she chose</span></div></div>",
            "created":1451797200,
            "id":2083923,
            "title":"It was Jade"
        },
        "12122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "mouth",
                "bra",
                "panties"
            ],
            "content":"<div class=\"\"><div> <span>Tori noticed that the locker door is opening and the boot was being taken out. She was then dumped out of the boot and she sees that it was Cat that freed her.<br>\r\n<br>\r\n“Cat! Thank goodness! You found me!” Tori said with happiness.<br>\r\n<br>\r\n“Yeah. I saw what Jade did to you. Are you alright?” Cat asked with concern.<br>\r\n<br>\r\n“More or less. Listen, Cat. I need you to find Jade and get me back to my normal height.” Tori said.<br>\r\n<br>\r\n“Yeah. Uh. About that. Jade already skipped school about 20 minutes ago.” Cat said.<br>\r\n<br>\r\n“Aww man. So now what?” Tori complained.<br>\r\n<br>\r\n“I can take care of you for now. But first, I need to hide you for now. Promise me that you won’t be mad.” Cat said.<br>\r\n<br>\r\n“I was just in Jade’s smelly boot. I don’t think it matters at this point.” Tori said.<br>\r\n<br>\r\n“Okay.” Cat said as she puts Tori in her</span></div></div>",
            "created":1534222800,
            "id":2533530,
            "title":"It was Cat"
        },
        "121223":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which side do you prefer?</span></div></span></div>",
            "created":1534222800,
            "id":2533531,
            "title":"panties"
        },
        "122":{
            "author_id":"thebandgeek",
            "author_name":"I <3 BAND",
            "choices":[
                "Beck",
                "Sinjin",
                "Someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some more options!</span></div></span></div>",
            "created":1355979600,
            "id":1491931,
            "title":"More choices (sorry I messed up when I initiall..."
        },
        "1221":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Kiss Trina's ass",
                "Trina gets a call and Beck tries to run",
                "Tori arrives with a tiny Jade"
            ],
            "content":"<div class=\"\"><div> <span>It was a loud knock to his door that awoke Beck. Opening it, he was greeted by a somewhat frazzled Trina Vega.<br>\r\n<br>\r\n\"Trina? What's wrong?\" He asked. In response, the Latina snapped her fingers causing a bright flash of pink light which caused Beck to pass out.<br>\r\n<br>\r\nSome time later, Beck felt himself be prodded awake. \"Wakey, wakey little man.\" Trina called, her voice much louder and deeper than usual. Beck groggily opened his eyes to find Trina stark naked and towering above him.<br>\r\n<br>\r\n\"Trina? What... you... you're huge.\"<br>\r\n<br>\r\n\"No I'm not. Take a look.\" She smirked as she motioned to Beck's RV. \"You're <i>tiny</i>. And you're staying tiny until I say so.\"<br>\r\n<br>\r\n\"But... why?\"<br>\r\n<br>\r\nTrina glared at the three inch tall teen, \"You humiliated me after my little white lie about you asking me out. I'm owed compensation.\"<br>\r\n<br>\r\n\"Well in fairness, you were acting like a maniac with your crazy rumours. Oh shit.\" He muttered as the giantess's frown deepened before she smirked. Snapping her fingers, Trina disappeared in a pink light and reappeared in front of Beck atop his mini-fridge at two inches tall.<br>\r\n<br>\r\n\"What are you?\" Beck got out before his hands were roughly placed on Trina's plump ass. \"A witch. As is Tori but that's not important right now. You like big butts don't you? You're about to spend an extended period of time with mine.\"<br>\r\n<br>\r\nFrom the manic look in her eyes, Beck knew full well Trina was telling the truth. So he did the only rational thing he could think of. His hands still gripping Trina's big butt, Beck got on his knees and began kissing her vagina. \"Ooh that feels nice.\" Trina gasped as she backed away. \"So good to know you're eager to do this.\" With that, Trina snapped her fingers and grew back to her normal height, turning around to reveal her now meteor sized ass which slammed itself atop the mini-fridge with force equal to one.<br>\r\n<br>\r\nBeck soon found himself forced back against the wall as the giant, though admittedly sexy, ass advanced towards him. \"Now kiss it.\"<br>\r\n<br>\r\nTrina was willing to wait a while to allow Beck to process her request but she soon felt no lips gracing her luscious cheeks. \"I didn't want to have to do this but-\" Beck watched with morbid fascination as the monolithic ass-crack dilated before unleashing a powerful fart. \"Now get kissing.\" Trina demanded as Beck hacked and coughed.</span></div></div>",
            "created":1553835600,
            "id":2637069,
            "title":"Beck"
        },
        "1223":{
            "author_id":"thebandgeek",
            "author_name":"I <3 BAND",
            "choices":[
                "Trina",
                "Sikowitz",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of these two?</span></div></span></div>",
            "created":1355979600,
            "id":1491932,
            "title":"Someone else?"
        },
        "12233":{
            "author_id":"thebandgeek",
            "author_name":"I <3 BAND",
            "choices":[
                "Andre",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sorry, need one more option here:<br>\r\n<br>\r\nAndre, perhaps? Or your choice?</span></div></span></div>",
            "created":1373259600,
            "id":1625092,
            "title":"Reader's Choice"
        },
        "122331":{
            "author_id":"global.com",
            "author_name":"Nigel2002",
            "choices":[
                "Posey",
                "Trina"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Andre was walking around the school when all of a sudden he shrinks lucky all the students was in class but someone was coming his way it was</span></div></span></div>",
            "created":1553922000,
            "id":2637469,
            "title":"Andre"
        },
        "1223311":{
            "author_id":"global.com",
            "author_name":"Nigel2002",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>To his suprise it was posey she saw him picked him up and went to the girls restroom she them said “listen I kmow we’re not close friends yet but I feel close enough to ask you a personal question” andre asked why she then said “its just....its just that sometimes people say... they say my feet smell wierd... woild you smell my foot and tell me what you think?” With that she took off her shoe and raised her foot above andre and wiggled her toes but the bell ringed posey then said “looks like class is about to start looks like youre gonna have to smell and lick them in class” she put andre in the toe section of her shoe and said “here come my feet” she said while wiggling her toes above her she after that she went to class when she arrived she took her seat and and stated working “c’mon andre my feet are itchin for a lickin” she said as she wiggled her toes<br>\r\nDid andre lick her feet?</span></div></div>",
            "created":1554008400,
            "id":2637566,
            "title":"Posey"
        },
        "122332":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "yourself"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last option is <br>\r\nYourself</span></div></span></div>",
            "created":1408683600,
            "id":1845691,
            "title":"Reader's Choice"
        },
        "1223321":{
            "author_id":"bobjones98",
            "author_name":"bob jones",
            "choices":[
                "try to escape",
                "stay at their house"
            ],
            "content":"<div class=\"\"><div> <span>you are a new student at Hollywood arts when suddenly you are hit by a flashing beam and are knocked out cold.<br>\r\nwhen you wake up you see giants and giantesses everywhere.as you turn around you see tori, cat, jade and Trina all smirking evilly.<br>\r\nWhat should we do with him asked Trina?tori replied we will take him to our house where he will worship Trina's armpits,jade's breasts,cat's feet and my butt.<br>\r\n<br>\r\nwhen they arrive do you: </span></div></div>",
            "created":1455771600,
            "id":2105976,
            "title":"yourself"
        },
        "12233211":{
            "author_id":"bobjones98",
            "author_name":"bob jones",
            "choices":[
                "let him go",
                "fart torture time"
            ],
            "content":"<div class=\"\"><div> <span>you try to escape but are caught easily.well,well,well says tori,looks like we got a refusal from our slave so he is going to get to work a lot quicker now for 10 minutes each. <br>\r\n<br>\r\nSo slave,first you will worship trina's armpits so get to work whilst us three get ready.make sure you worship them nice and hard says tirna as her sweaty armpits nearly made him pass out as she had not cleaned them in weeks.<br>\r\nafter 10 minutes of sweaty armpits he got to work on jade's breasts which were not enjoyable and also sweaty from gym practice which nearly made him puke.then he started to worship cat's humongous and hot butt.cat sat on him and he had to make his way out and started worshipping, and after thta it was finally tori's turn to be worshipped and he worshipped her sweaty, stinky feet and passed out from the horrid smell.once it was all done do the four giantesses let him go or do they keep him for some giantess fart torture.</span></div></div>",
            "created":1455771600,
            "id":2105979,
            "title":"try to escape"
        },
        "122332112":{
            "author_id":"bobjones98",
            "author_name":"bob jones",
            "choices":[
                "stop there",
                "gain control"
            ],
            "content":"<div class=\"\"><div> <span>when he woke up,he saw the four girls towering over him when he asked,\"can i go now\"?Tory said\"silly boy,the fun's only just started\" as Trina came from behind and used some tape to tie him to the table in the living room. Tory said,\"guess what we have planned for you now\" and he could not guess so cat gave him the answer of fart torture time.<br>\r\n<br>\r\nHe looked at the four towers in shock and disbelief as they smiled at him and turned round so that all four of their butts were in sight and then jade mentioned\"we had lots of beans for lunch today,so enjoy\" as they let out so much farts that lasted for over 5 minutes definitely until tori came up with the idea,\"hey guys,what if we take our panties off,ten he'll be in for a surprise\",the others agreed as they all removed their panties showing their hot and sexy butts as they all lowered down and sat on him and rubbed their cheeks on him turn by turn and carried on until the next day as tori's parents were away in Canada.<br>\r\n<br>\r\nit was the time of the girls life but not so much for the now shrunken boy as he had passed out from all the farting and the butt rubbing and the girls then grinned at each other until tori suggested that why they should stop there and that they should shrink Robbie,beck,Andre and sinjin. <br>\r\n<br>\r\n<br>\r\n<br>\r\nso do the girls stop there or gain power over the other four boys<br>\r\n<br>\r\n</span></div></div>",
            "created":1455771600,
            "id":2105986,
            "title":"fart torture time"
        },
        "123":{
            "author_id":"thebandgeek",
            "author_name":"I <3 BAND",
            "choices":[
                "Trina picks Robbie up",
                "Trina puts Robbie on the floor"
            ],
            "content":"<div class=\"\"><div> <span>Robbie stopped by Tori's house one day to drop off a CD for Tori. However, Trina opened the door when he knocked. Alarmed, Robbie started to leave, but Trina pulled out a little ray gun and shot him with it. Robbie fell unconscious. A few hours later when he woke up, he realized two things. One was that he was on the couch. Another was that he was two inches tall! <br>\r\nJust as he thought that, the ground shook and into the room stomped Trina. She stood next to the couch and looked down at Robbie and smiled.</span></div></div>",
            "created":1279342800,
            "id":919453,
            "title":"Robbie shrinks!"
        },
        "1232":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "He musters some strength and ducks into Tori's room.",
                "He gives in to his fatigue and is caught by Trina.",
                "Someone else arrives to help Trina."
            ],
            "content":"<div class=\"\"><div> <span>Trina, still smiling, just picks Robbie up off the couch, and drops him to the ground. It wasn't too far of a fall for Robbie, but it still hurt him a bit. Robbie looked up at Trina who was towering over him. She still had a smile on her face, and it scared Robbie. Trina removed her shoes, and Robbie got a whiff of her feet. They smelled really bad. Robbie started gagging, and upon noticing this, Trina started to laugh. \"You're supposed to love everything about your Goddess! Including her body odors. So Robbie, I think you need to get a little more time with my feet to really appreciate them.\" Trina said down to the tiny Robbie. Trina raised her bare foot high above Robbie, but before she could bring it down he ran. Screaming and flailing his arms, Robbie ran away from the giant Trina, who claimed to be his Goddess. She stomped right after him, and if it weren't for his quick dodges and hiding, Trina would already have the poor shrunken teen sniffing her giant smelly feet.<br>\r\n<br>\r\nTrina chased Robbie all throughout her house. Robbie was exhausted.</span></div></div>",
            "created":1318568400,
            "id":1206152,
            "title":"Trina puts Robbie on the floor"
        },
        "12321":{
            "author_id":"olimar",
            "author_name":"Ninten",
            "choices":[
                "Hide somewhere in Tori's room",
                "Get Tori's attention!"
            ],
            "content":"<div class=\"\"><div> <span>Robbie quickly uses all his strength and ducks into Tori's room.<br>\r\n\"Let's just hope she doesn't mind...\" Robbie thought. When he got under the door he let out a sigh of relief, surely with Tori being such a nice person she can help him...or not...He looks up to see Tori calmly doing her hair on the other side of the room, humming to herself. What does Robbie do?</span></div></div>",
            "created":1357362000,
            "id":1502637,
            "title":"Tori's room"
        },
        "123211":{
            "author_id":"olimar",
            "author_name":"Ninten",
            "choices":[
                "Her bra and panties drawer",
                "Inside her shoes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does he hide?</span></div></span></div>",
            "created":1357362000,
            "id":1502645,
            "title":"Hide somewhere in Tori's room"
        },
        "1232111":{
            "author_id":"orioles2012",
            "author_name":"wwe champion",
            "choices":[
                "tori wakes up and puts on the bra hes in",
                "tori wakes up and doesnt put on the bra hes in"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Robbie climbs up toris dresser till he reaches the wide open drawer of her bra and panties. <br>\r\nHe climbs in and gets into toris bra...</span></div></span></div>",
            "created":1361077200,
            "id":1534082,
            "title":"Her bra and panties drawer"
        },
        "12321111":{
            "author_id":"nalarue",
            "author_name":"nalarue",
            "choices":[
                "Check it out",
                "It's nothing keep on walking"
            ],
            "content":"<div class=\"\"><div> <span>Tori got up from her nap, and went to over to her dresser to put on a bra since she didn't wear one while sleeping. Robbie looks up in horror at Tori's giant face as her hand comes down and grabs the bra he was hiding in. He tried desperately to get out but to no avail. Tori took her shirt off and then proceeded to put the bra on. Robbie was in her right cup and saw her breast coming straight at him, as he made contact he ended up a little off center. Then Tori clasped the bra, and said \"This bra feels a little funny\" so she started to adjust it  to make it more comfortable. Robbie started getting dragged all over her breast as she kept adjusting it. Finally she stopped with Robbie at the bottom of her bra. \"Ahh that's much better.\" She then put her shirt back on and grabs her purse and heads out the door. Every step she took slammed Robbie with the full force of her breast. As she headed outside  Robbie started trying to get her attention by punching her right breast. Tori was walking when she felt a poke under her right breast, she looks down and says\" I wonder what that it is.\" Does she check it out or dismiss it as nothing and keep on walking</span></div></div>",
            "created":1369112400,
            "id":1594394,
            "title":"tori wakes up and puts on the bra hes in"
        },
        "123211112":{
            "author_id":"olimar",
            "author_name":"Ninten",
            "choices":[
                "Yes, she takes out whatever was annoying her from her bra",
                "No, she goes on with her day at school, oblivious to Robbie's perverse intrusion"
            ],
            "content":"<div class=\"\"><div> <span>Sadly, Robbie was too small and weak to even leave any impact whatsoever on a teenage girl's breast. Tori simply shrugged off the slight sensation of Robbie punching her breast and kept walking. Tori's massive breasts jiggled and shook with every step, mashing the shrunken Robbie more and more into her beautiful boobs. Robbie could not feel anything but his friend's gigantic breast laying on top of him, and a layer of her bra fabric underneath him. How could his good friend not even notice his (albeit small) presence right below her heaving mammary? Tori kept on walking to her destination, unaware of her friend's plight. <br>\r\n<br>\r\nIt soon started getting hard to breathe in the limited space there was between the giantess' right breast flesh and the inner bra cup. Robbie couldn't handle it anymore and started to repeatedly punch and squeeze the giant girl's boob in a feeble attempt to get her attention. Robbie's vision filled with Tori's boob flesh and her wonderful smell overwhelmed his nostrils. But at the same time he was running out of air, and Robbie was starting to get soaked in Tori's breast sweat. Does Tori finally feel Robbie's punching and squeezing of her breast?</span></div></div>",
            "created":1369630800,
            "id":1598262,
            "title":"It's nothing keep on walking"
        },
        "1232111122":{
            "author_id":"olimar",
            "author_name":"Ninten",
            "choices":[
                "...Robbie is still stuck and is washed along with the rest of her body!",
                "...Robbie falls off her breast and onto the shower room floor!"
            ],
            "content":"<div class=\"\"><div> <span>Poor Robbie would be stuck underneath Tori's gigantic breast for the rest of the day, and there was nothing he could do about it. The fact that an entire (albeit somewhat weak and nerdy) man could be completely overshadowed and overpowered by a teenage girl's single boob was astounding. Even her nipple was larger than half of his puny body!<br>\r\n<br>\r\nAnyways, Tori went throughout her usual day, going to class, hanging out with friends, etc. Finally at the end of the day, Tori went home to rest...buuuut not before taking a refreshing shower, of course! <br>\r\n<br>\r\nAs Tori stepped into the bathroom and started taking off her clothes, Robbie was freed of his prison in her bra! But there was only one problem, he was now stuck to Tori's breast! Her sweat must have plastered him to her flesh! <br>\r\n<br>\r\nTori steps into the shower and...</span></div></div>",
            "created":1372827600,
            "id":1622266,
            "title":"No, she goes on with her day at school, oblivio..."
        },
        "12321111222":{
            "author_id":"secret000",
            "author_name":"secret",
            "choices":[
                "All of a sudden, Tori reaches between her legs.",
                "Tori looks down and notices him."
            ],
            "content":"<div class=\"\"><div> <span>Robbie falls all the way to the floor, managing just barely to catch her leg just before he hits the ground to slow himself. He slides off and across the floor, luckily unhurt.<br>\r\n<br>\r\nLooking up, a bit shaken, he sees Tori's bare feet standing in front of him, water sliding off. He pauses for a second, his eyes widen, then he slowly starts to look up.<br>\r\n<br>\r\nHis mouth drops open as he finds himself looking up at Tori standing there naked, water running down her body, as she washes herself. Her beauty is overwhelming. His eyes can't help but fixate between her legs.</span></div></div>",
            "created":1372914000,
            "id":1622360,
            "title":"...Robbie falls off her breast and onto the sho..."
        },
        "123211112221":{
            "author_id":"tag9",
            "author_name":"Tag9",
            "choices":[
                "On robbie (he gets stuck and scrubbed on hr body)",
                "Next to robbie (she spots him)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tori scrubbed her soap between her legs and she drops the soap and it lands</span></div></span></div>",
            "created":1452315600,
            "id":2086921,
            "title":"All of a sudden, Tori reaches between her legs."
        },
        "1232111122212":{
            "author_id":"them",
            "author_name":"theM",
            "choices":[
                "A loving smile (She wants to help)",
                "An evil grin (She wants to take advantage of him)"
            ],
            "content":"<div class=\"\"><div> <span><b>Robbie?!</b><br>\r\n<br>\r\nThe giant girl looks down on him, almost freaking out. The looked scared him, but he was so relieved to be noticed that he almost forgot her nakedness.<br>\r\n\"Thank god you found me!\"<br>\r\n<br>\r\n<b>WHAT ARE YOU DOING IN MY SHOWER?! </b><br>\r\n<br>\r\nThat was enough for him to remember where he was, as he dashfully turned around. \"Sorry, but I needed to get your attention somehow.\"<br>\r\n<br>\r\nTori looked to the tiny boy with some sympathy. She yet to decide how much. \"What happened to you?\"<br>\r\n<br>\r\nHe almost looked forgetfully before turning back around. \"Trina shrunk me\"<br>\r\n<br>\r\n\"Trina\" Of course it was her sister. \"I should've known she was behind this\" Well, she thinks to herself, I guess he had no choice here. \"Is that why you weren't at school today?\"<br>\r\n<br>\r\n\"Yeah\" He stated \"I waited all day for you to arrive to your room so I could get your attention.\" That second part was a lie, but he didn't want to tell her about being stuck in her bra.<br>\r\n<br>\r\n\"Okay\" She reassured him \"No harm, no foul I guess.\" She continued \"Let's just make sure my sister doesn't find you\"<br>\r\n<br>\r\nThank god she understood. He knew Tori would. If anyone, it'd be her. \"So what now?\"<br>\r\n<br>\r\nThat questioned formed a smile on Tori's face.</span></div></div>",
            "created":1463547600,
            "id":2149919,
            "title":"Next to robbie (she spots him)"
        },
        "12321111222121":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Shows Tori that she's shrunk the rest of their friends",
                "Tries to shrink Tori anyway"
            ],
            "content":"<div class=\"\"><div> <span>With surprising delicacy, Tori picked up her miniature friend and put him on the soap rack before she resumed washing herself.<br>\r\n<br>\r\n\"I'll just finish up here Rob.\" She said. \"My boobs get really sweaty on hot days like this.\"<br>\r\n<br>\r\n<i>\"Don't I know it.\"</i> He thought. For the first time all day however, he finally allowed his hand to travel down to his crotch and enjoy the massive Latina's utterly flawless body. If he remembered around the near-suffocation, he would be forever happy with the memory of Tori's minivan sized breast.<br>\r\n<br>\r\nBut all good things had to come to an end, and after she'd scrubbed her tight, gargantuan, butt Tori was clean, wrapping a towel around herself and carrying Robbie to her room. The little boy got yet another treat as Tori casually chucked her towel aside and revealed herself once again as she began shifting through her drawers. He half began to wonder if Tori was showing off on purpose.<br>\r\n<br>\r\nIn truth she was. It wasn't out of romance or seduction but rather pity for Tori knew, as everyone else did, that the odds of Robbie seeing a woman naked were slim indeed. Frankly, if it had been anyone else of the gang in her shower, Tori was sure she'd have lorded her size advantage above them (except maybe Cat) but Robbie was well... Robbie. He got tortured enough just existing and Tori felt compelled to throw him a bone (pun intended).<br>\r\n<br>\r\nAfter she'd thrown on sweats, she did her best to dry Robbie off before she stuffed him in her bra. \"Sorry Rob. Easiest way to go.\"<br>\r\n<br>\r\nAs Tori began walking to Trina's room, Robbie scooted to the right breast and began running his hands along what had once nearly killed him. \"So beautiful.\" He whispered before he heard a door be kicked down.<br>\r\n<br>\r\n\"TRINA! WHERE'S MY SHRINK RAY!?\" Tori screamed as she began rooting through Trina's drawers. \"I KNOW YOU TOOK IT!\"<br>\r\n<br>\r\n\"Why do you assume I took it?\" Her older sister asked innocently even as Tori ripped her dresser in two.<br>\r\n<br>\r\n\"I know you Treen. Now. Where. Is. It?\"<br>\r\n<br>\r\n\"Even if I do have it, what's to stop me using it on you?\"<br>\r\n<br>\r\n\"I built it. It won't work on me.\" Tori said smugly. \"Now give it to me or I'm telling everyone about the noodle incident.\"<br>\r\n<br>\r\nTrina flinched at the memory while Robbie became intrigued. Trina hesitantly got up and Robbie allowed the fires of hope to rise in his chest as he gave Tori's right breast a goodbye tap (which again, went unfelt by the virtual goddess). Trina reached under her bed and...</span></div></div>",
            "created":1549515600,
            "id":2614120,
            "title":"Helpful Tori"
        },
        "123211112221212":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "The failsafe shrinks Trina",
                "Nothing. The gun won't shrink Tori"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>With surprising speed, Trina turned back to face her younger sister with Tori's shrink ray in hand. Levelling it at Tori, she pulled the trigger.<br>\r\n<br>\r\nWhat happens next?</span></div></span></div>",
            "created":1549515600,
            "id":2614129,
            "title":"Tries to shrink Tori anyway"
        },
        "1232112":{
            "author_id":"nalarue",
            "author_name":"nalarue",
            "choices":[
                "She Drives",
                "Walking is good for you"
            ],
            "content":"<div class=\"\"><div> <span>Robbie decides to hop in Tori's flats that are lying in the floor. He gets in the right one, but he instantly regrets it as he hears Tori say \" If I'm going to the mall I need shoes, where are..Oh there they are.\" Robbie starts trying to scramble out of the shoe as he feels Tori's thunderous footsteps getting closer. But before he can get out a shadow comes over him, he looks up to see Tori's giant foot coming at him. Robbie heads to the end of the shoe, hoping that these are a little big for her. But as he runs out of room, Tori's foot catches up to him and pins him under her toes. \"Oh, these are so comfortable today\" says Tori as she unconsciously starts playing with Robbie, scrunching him with her toes. \" Well I better get going.\" Her first step was excruciating for Robbie, sending pain throughout his body. As she continues walking down the stairs, and out the door, Robbie is begging her to stop. Does she drive to the mall, or does she walk to it?</span></div></div>",
            "created":1369285200,
            "id":1595670,
            "title":"Inside her shoes"
        },
        "123212":{
            "author_id":"nalarue",
            "author_name":"nalarue",
            "choices":[
                "Get out of hair",
                "Still Tangled up"
            ],
            "content":"<div class=\"\"><div> <span>Robbie decide that at his size the best thing to do was try to get some help and Tori was a nice person, surely she would help him out. So he set off towards her while Tori was still brushing  her hair. Robbie finally reached Tori and looked up at her and said \"Man, she's huge how am I going to get her attention. But just at that moment Tori accidentally dropped the brush, and it landed on top of Robbie, but he was unhurt. \"Clumsy me\" said Tori as she reached down to grab her brush, with Robbie now attached. She started brushing her hair again and Robbie during this ended up tangled in her hair close to her ear. Then after all this time of brushing it she decided to just put it in a ponytail. As she starts to grab her hair to put it in the ponytail her hand is right next to Robbie. Does Robbie manage to get out of the hair on to her hand, or does he stay stuck?</span></div></div>",
            "created":1369285200,
            "id":1595634,
            "title":"Get Tori's attention!"
        },
        "1232121":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Tori's face is nothing but concern, she wants to hear out and help little Robbie",
                "Tori grows a devilish smile, she wants to have fun with the little creep"
            ],
            "content":"<div class=\"\"><div> <span>Coiled in sweetly-scented strands of the brunette's hair, Robbie desperately thrashes and struggles to escape. Alas, he is held fast but the giant strands of hair attached to the head of his dear friend, Tori. Tori's gigantic hand starts to pull her hair into a ponytail, and Robbie recognizes a chance to escape as her hand nears his position. Her thumb gets in position just below him, and he flails his arms out to grab it. Latching hold, her thumb tugs him free of the tangled masses of hair he was stuck in, albeit with a bit of difficulty and minor pain. Robbie hangs on for dear life as Tori goes through the motions of putting her hair in a ponytail. She finally finishes and lets her arm hang down at her side, while she inspects her hair in the mirror, making sure she did the ponytail right. Robbie, however, is not so much on her thumb as he is dangling from it. He would get into a better position, but he couldn't do a pull-up to save his life, so he's stuck dangling. <br>\r\nTori happens to feel his minuscule hands on her thumb and lifts her hand in front of her, fist clenched with her thumb sticking out, so Robbie dangles in front of her face. \"Ewww, a bug? That's sooooo totally gross!\" Tori says with disgust crossing her face. But she gets a closer look, and then Robbie saw a realization sweep across her features. \"No, wait, you're not a bug, you're...Robbie?\" Now her face is nothing but confusion. Robbie yells, \"Hey Tori! How's it hanging?\" as his face turns red and he hopes his gigantic friend will help him out of his odd predicament. </span></div></div>",
            "created":1393131600,
            "id":1750195,
            "title":"Noticed"
        },
        "1232122":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "It's morning on a weekday, she's heading to school",
                "It's the weekend, she wants to visit a friend"
            ],
            "content":"<div class=\"\"><div> <span>Tori's hand sweeps by, and Robbie makes a grab for one of her fingers...but fails. He barely managed to let his hand brush against hers--nothing she would feel, of course. Tori puts her hair into a ponytail, and in the process Robbie finds his hair prison becoming almost unbearably tight, since he's on the side of her head and not in the ponytail itself. Strand after beautiful, brunette strand ropes over Robbie and holds him in place. All the struggling the weak boy could produce could not free him from Tori's hair. Eventually Robbie gives up, not knowing how to escape. Tori goes about her business, eventually leaving her room. Trina approaches Tori, and asks her if she's seen anything \"weird\" around the house. Robbie becomes petrified, and hopes he is impossible for Trina to detect. He doesn't move a single muscle in hopes of not drawing attention to himself. Tori shakes her head, a motion that is very dizzying to poor Robbie, and then continues on her way. Robbie watches Trina as long as she is in view, and even though she was looking at Tori it didn't look like she had spotted him. Robbie counts his lucky stars as Tori leaves the house. But where is it Tori is going?</span></div></div>",
            "created":1393131600,
            "id":1750205,
            "title":"Tangled"
        },
        "12322":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Trina puts Robbie in her shoes and wears him around for a while",
                "Trina makes Robbie clean her shoes"
            ],
            "content":"<div class=\"\"><div> <span>Robbie finally became too tired and just collapsed. Trina approached his weak and struggling form. She grinned evilly as she noticed he was breathing heavy, and knew that if she planted her stinky foot on him he wouldn't be able to hold his breath and would have to smell it. Trina lowered her foot onto Robbie, and the poor little guy had to just breathe in the smell. Trina laughed and laughed. \"How do you like the smell of your Goddess's feet, little man?\" Robbie was too exhausted to respond, and all he could do was pant heavily. Trina let Robbie just smell her foot for a little while, then started rubbing her feet all over him. After only half an hour of this, Robbie smelled identical to Trina's smelly feet.</span></div></div>",
            "created":1320987600,
            "id":1221337,
            "title":"Caught"
        },
        "12323":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Cat",
                "Jade"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While Trina was chasing Robbie, the doorbell rang. She stopped, and walked to the door and opened it up. Standing outside was...</span></div></span></div>",
            "created":1352091600,
            "id":1461227,
            "title":"Someone else arrives to help Trina."
        },
        "123231":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Trina tells Cat about Robbie and asks her for help",
                "Trina decides it's best not to tell Cat, and keeps searching on her own"
            ],
            "content":"<div class=\"\"><div> <span>\"Hi Trina!\" Cat said, \"Is Tori home?\" Trina was a little annoyed, since she was busy trying to chase down the tiny Robbie. \"Ugh, she's taking a nap. You'll have to come back later.\" Cat looked at Trina sadly, then her face lit up. \"Well can I just chillax here until she wakes up? I'll just sit on your couch, watch TV, and be quiet! Promise!\" Cat said excitedly. Trina thought for a moment. She wants to catch Robbie, but Cat might be a help, not hindrance. Finally, she made a decision. \"Yeah alright, just sit on the couch and be quiet.\" Cat got halfway through yelling a \"Yay!\", before remembering that Tori was sleeping and that Trina would be annoyed, so she tuned it down to a whisper and then ran over and plopped on the couch. She flipped the TV on quiet, and started to watch. Trina closed the door, and walked over and stood in front of Cat. \"Listen, Cat...</span></div></div>",
            "created":1352091600,
            "id":1461238,
            "title":"Cat"
        },
        "1232311":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Cat keeps Robbie to herself and acts like she can't find him",
                "Cat tells Trina she found Robbie"
            ],
            "content":"<div class=\"\"><div> <span>\"Listen, Cat...I have a shrink ray, and Robbie stopped by earlier. I shrunk him, But he ran away, and I've been trying to catch him. Will you help?\" Cat looked shocked, but gleefully accepted. \"Alright, great! You look in here, and I'll check down the hall!\" Trina said, and then ran off down the hall, looking for Robbie. Cat started walking around Tori and Trina's house, searching for a tiny Robbie. Finally, she spots a little dot out of the corner of her eye. And sure enough, when she chased it down, it was a small Robbie. \"Aww, there's my little mouse!\" Cat said, ecstatic at finding Robbie. Robbie looked up at her and shrieked very unmanly. Cat reaches down and plucks Robbie up.</span></div></div>",
            "created":1352091600,
            "id":1461281,
            "title":"Trina tells Cat about Robbie and asks her for help"
        },
        "1232312":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Cat keeps tormenting Robbie with her feet",
                "Cat puts her shoes back on and tries to help Robbie"
            ],
            "content":"<div class=\"\"><div> <span>\"Listen, Cat..just sit right here and don't move. I'll be in the other room..and sometimes in here. Just ignore me, stay here, and watch TV.\" Trina says sternly to Cat. \"But what if I have to go pee?\" Cat asks, worried about her small bladder. \"Ugh!\" Trina screamed in annoyance, \"Of course you can use the bathroom! Just don't linger!\" Trina stormed off, back to her search for Robbie. Cat just sat there, kicked off her colorful sneakers, and aired out her pink, socked feet on the coffee table. After only five minutes, Cat saw something climb up onto the coffee table, run towards her feet, then fall. Cat was completely puzzled, but also very curious. So she leaned forward and took a closer look at this thing. She saw a little bug. But then she realized, it wasn't a bug! She gasped, as quietly as possible. This was a tiny person. She looked around, seeing if Trina had come back. Then she looked back at the tiny person. It started to stand up, and she recognized its mini afro. It was Robbie! \"Robbie?\" she said, confused. \"Cat! Cat help me-whoa..\" Robbie had started to say, before he started to stumble a bit. \"What's wrong little bug Robbie?\" she asked, legitimately concerned, but giggling a bit at her joke of calling Robbie a bug. \"Cat, your feet smell terrible!\" Robbie yelled, right next to them. Cat giggled and knocked Robbie over with her big toe. </span></div></div>",
            "created":1352091600,
            "id":1461255,
            "title":"Trina Searches On Her Own"
        },
        "12323121":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Show Trina what she found!",
                "Hide him, he's HER toy!"
            ],
            "content":"<div class=\"\"><div> <span>\"Nuh uuuuuh, you must smell terrible and be smelling yourself!\" Cat declares, finding it ridiculous that her feet would stink. She found it really funny when she knocked Robbie over using just her toe, so once he got up she did it again with a little giggle of delight. Robbie stood up once again, but this time tried to run away from Cat's feet. \"No little bug, come back!\" Cat screamed at Robbie, and pushed her foot forward, knocking him down. She then brought her foot around and dragged Robbie closer with it. Robbie was in a bad position, Cat had no idea how bad her feet smelled. He thought Trina's were bad, but Cat's were so much worse. The only difference between the two girls at this point was that Trina wanted to torment him on purpose, Cat just wanted to have fun. \"No running away!\" Cat said in what (Robbie hoped) was mock anger. She planted her pink sock-clad smelly toes on his back to keep him in place. \"Little bug Robbie, I just want to play. It's rude to run away!\" Cat said down to Robbie on the coffee table. Robbie struggled against the digits but was far too weak. \"Okay, okay!\" he conceded. Cat smiled with his compliance. <br>\r\n<br>\r\nThen Cat heard Trina coming down the hall, her voice ahead of her, \"Cat I thought I told you to be quiet?\" Cat panics, and isn't sure what to do with Robbie.</span></div></div>",
            "created":1393131600,
            "id":1750211,
            "title":"Cat keeps tormenting Robbie with her feet"
        },
        "123231211":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yeah!",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Trina!\" Cat said, \"I have something to show you!\"<br>\r\n<br>\r\n\"What is it?\" <br>\r\n<br>\r\nCat removed her toes from you, and said \"Look!\"<br>\r\n<br>\r\nTrina looked where Cat was looking,  and saw a tiny person. \"A tiny person? Cool!!\"<br>\r\n<br>\r\n\"Wanna help me torture him?\"</span></div></div>",
            "created":1515474000,
            "id":2438837,
            "title":"Show Trina what she found!"
        },
        "123231212":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Cat doesn't share Robbie with Tori either.",
                "Cat decides to share her find with Tori.",
                "Cat wants to prank Tori, so she sneaks off to Tori's room to hide Robbie."
            ],
            "content":"<div class=\"\"><div> <span>Hearing Trina coming, Cat panics and quickly sits up and grabs her shoe. <br>\r\n<br>\r\n\"In here!\" she whispers to her little Robbie bug. She takes her hand and scoops him into her sneaker before he can protest. Cat then hurriedly puts her shoes back on, squishing Robbie a fair bit.<br>\r\n<br>\r\n\"Cat I thought I told you to stay quiet. Were you talking to the TV again? We told you, they can't hear you,\" Trina said, annoyed. Cat laughed, and shook her head.<br>\r\n<br>\r\n\"I wasn't talking to the TV, I was talking to...\" then she paused, realizing she couldn't tell Trina about the little Robbie bug she found. \"Uh, I was talking to...myself. My Cat, aren't you so pretty today? And isn't it nice of Trina to let you hang out?\" Cat said, trying to save herself with her act. Trina, knowing Cat not to be the brightest bulb in the bunch, actually bought it.<br>\r\n<br>\r\n\"Whatever,\" she said, just about to leave again to go look for Robbie. Then she paused a moment, \"Hey Cat? Did you see anything...weird in here, while you were watching TV and talking to yourself?\"<br>\r\n<br>\r\n\"Me? See something weird? Noooo waaaay!\" Cat said, rather unconvincingly. However, due to her usual air of strangeness, Cat gets away with this too. Trina goes off into another room searching for Robbie.<br>\r\n<br>\r\n\"Phew, that was close,\" Cat said, actually talking to herself this time. Cat lifted her foot up on her lap and looked down at her shoe. She could feel Robbie squirming around under her foot. She giggled. \"Robbie that feels funny, are you trying to tickle me?\"<br>\r\n<br>\r\nWhile Cat giggled at Robbie's plight, Tori finally came downstairs. She wasn't really all that surprised to see one of her friends in her house unannounced. As long as it wasn't Sinjin. <br>\r\n<br>\r\n\"Hey Cat, what's up?\" Tori asked, while grabbing a bottle of water from the fridge.</span></div></div>",
            "created":1512622800,
            "id":2425117,
            "title":"Cat Doesn't Want to Share"
        },
        "124":{
            "author_id":"lightning06",
            "author_name":"lightning72",
            "choices":[
                "I've always wanted someone small to look after",
                "I have a secret lesbian side for you",
                "I want to keep you as a pet to look after"
            ],
            "content":"<div class=\"\"><div> <span>Cat was going on to the bathroom and she shrunk to 1 inch quickly and she did not know how it had happened. Suddenly Tori walked in to see the shrunken cat and gently picked her up.<br>\r\nTori: Cat are you OK?<br>\r\nCat: I'm fine but I'm really scared (crying noises)<br>\r\nTori: Don't cry Cat i'm here for you and their is something I can tell you to make you feel better.<br>\r\nCat: What?<br>\r\nTori: _____________________</span></div></div>",
            "created":1320728400,
            "id":1219938,
            "title":"Cat"
        },
        "1241":{
            "author_id":"olimar",
            "author_name":"Ninten",
            "choices":[
                "...Tori put her in her amazing cleavage",
                "...Tori put her in her heel, right next to her foot",
                "...Tori put her in her panties(front or back?)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Don't worry! I'll take great care of you!\" Tori said cheerfully.<br>\r\n\"Tori! Wait!\" said Cat, squirming in her hand. Then...</span></div></span></div>",
            "created":1357362000,
            "id":1502643,
            "title":"I've always wanted someone small to look after"
        },
        "12412":{
            "author_id":"shrinkandgrow",
            "author_name":"fihak icisuk",
            "choices":[
                "At Tori's house",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span> \"Tori get me out!\" Cat screamed from inside Tori's shoe. She was wearing her typical converse sneakers. Cat was sandwiched between the shoe and Tori's heel, surprised that she hadn't any broken bones yet. \"Tori get me out!\" she screamed \"your stinky foot stinks!\" she said in a childish tone. It stunk so much she felt sick \"I don't like it in here!\" she cried \"it smells bad! Get me out!\" an hour of complaining passed, and the shoe was kicked from Tori's foot. She was...</span></div></div>",
            "created":1446008400,
            "id":2053857,
            "title":"One foot cloaer"
        },
        "124122":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Nail salon",
                "Food court "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She was heading somewhere else, but where?</span></div></span></div>",
            "created":1515474000,
            "id":2438841,
            "title":"Somewhere else"
        },
        "12413":{
            "author_id":"ricardo2902",
            "author_name":"cool",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tori then pulled of her genes and opened her panties. Then she dropped the miniscule cat in. But in which side?</span></div></span></div>",
            "created":1365829200,
            "id":1570733,
            "title":"...Tori put her in her panties(front or back?)"
        },
        "124131":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Tori’s POV",
                "Cat’s POV"
            ],
            "content":"<div class=\"\"><div> <span>Tori dropped Cat inside her panties by the front before she pulls up her jeans and zips and buttons them up shut. Tori can feel Cat struggling against her pussy and she really liked that.<br>\r\n<br>\r\n“Relax, Cat. You’ll be just fine in there. Now just stay in there.” Tori said before she patted on her crotch outside of her jeans and just left.</span></div></div>",
            "created":1534222800,
            "id":2533524,
            "title":"Front"
        },
        "1242":{
            "choices":[
                "Continue with her boobs",
                "Move down",
                "Tori's pants"
            ],
            "content":"<div class=\"\"><div> <span>When tori says this, she brings cat closer to her face and says \"I mean how could anyone not want you, look at your body!\" cat smiles, and says \"I've always thought the same way about you, tori.\" Tori smiles, and reaches out towards cat's shirt. She easily rips it off her body, and tosses it aside, and brings her lips close to Cat's breasts. She puts her lips around Cat's chest, making Cat let out a small moan. Tori sucks and sucks, until cat's bra comes off, exposing her C breasts.</span></div></div>",
            "created":1321938000,
            "id":1227271,
            "title":"I have a secret lesbian side for you"
        },
        "12421":{
            "author_id":"orioles2012",
            "author_name":"wwe champion",
            "choices":[
                "she lets her out of her bra ",
                "she doesnt let her out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tori opens up her shirt and puts cat in her bra <br>\r\nShe let's go of her bra and closes her shirt<br>\r\nLater...</span></div></span></div>",
            "created":1338958800,
            "id":1353911,
            "title":"tori's bra"
        },
        "12423":{
            "author_id":"orioles2012",
            "author_name":"wwe champion",
            "choices":[
                "tori lets cat out",
                "she keeps her in her pants"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tori opens her pants and cat sees red panties.<br>\r\nTori picks up cat and puts her in her panties and let's go of her panties leaving cat in there and closes her pants<br>\r\nLater...</span></div></span></div>",
            "created":1338958800,
            "id":1353908,
            "title":"Tori's pants"
        },
        "124232":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Rub the spot Cat's in.",
                "Shoves Cat in her vagina."
            ],
            "content":"<div class=\"\"><div> <span>Tori feels Cat moving in her pants and loves it. She decided to keep her in her panties. Cat actually feels comfortable in there. She feels like she could stay in Tori's panties forever. Cat then give Tori's pushy some licks and Tori moaned a little. She then go home to her room and take her pants off. She then lay on her bed and</span></div></div>",
            "created":1469422800,
            "id":2186151,
            "title":"she keeps her in her pants"
        },
        "1243":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Her backpack.",
                "Her bra.",
                "Her shoe."
            ],
            "content":"<div class=\"\"><div> <span>Cat watched her massive Latina friend bite her lip with a slightly worried expression.<br>\r\n<br>\r\n\"Well, what is it?\" the redhead asked, standing in Tori's huge palm. Something about Tori's facial expression worried her. And with Tori's face being bigger than a billboard to the bite-sized Cat, it was pretty hard not to notice the subtler details in her expressions.<br>\r\n<br>\r\n\"I can look after you!\" Tori said, her face betraying that she wasn't being completely forthright. Cat, meanwhile, wiped some of the tears from her face and looked up at Tori, confused on why her friend seemed nervous.<br>\r\n<br>\r\n\"Well thanks...but why is your face being weird?\" Cat asked, cutting straight to the point, even if her word choice was odd. Tori did her best attempt at a pleading smile before answering.<br>\r\n<br>\r\n\"Oh, well, about that,\" Tori began, with an awkward laugh, \"yeah...it'd be cute to like, keep you, though. Like as a little pet. A pet Cat!\" She finished with an exciting tone, hoping to sell her idea. Cat response was a look of shock and offense.<br>\r\n<br>\r\n\"Tori!\" she complained. \"You can't just keep me! I'm a Cat, not a pet Cat!\"<br>\r\n<br>\r\nTori's eyebrows furrowed, before an idea sprang to mind.<br>\r\n<br>\r\n\"Well, cats are pets, right? And you're a Cat, and you're pet-sized, so...you kind of have to be my pet?\" Tori said, somewhat hopefully. She could see the gears turning in Cat's head. Her friend could be downright bipolar at times, flipping between pleasant and upset like a light switch. But she could also be kind of spacey, and hard to follow, but easy to trick if you knew what to say.<br>\r\n<br>\r\nCat didn't look pleased, but she nodded somewhat solemnly. \"You're right, that makes sense...\" she said. \"I guess I have to be your pet.\"<br>\r\n<br>\r\nTori gave Cat a huge smile. There was a part of her that felt really guilty, using one of her best friends like this. But she just couldn't deny the fact that the moment she saw Cat, tiny and helpless, she thought she was the cutest thing in the world. And Cat, with how ditzy and spaced-out she could be, was almost always like a pet friend. So the thought of actually getting to keep a miniature Cat as a real pet was frankly very appealing to Tori. It didn't help poor Cat that the surrealness of the situation made it feel very...unreal to Tori. In a way, she didn't really register how wrong what she was doing was, because it didn't feel like a real thing that could really happen. So the consequences of her decisions didn't feel real either.<br>\r\n<br>\r\nWhere does Tori keep Cat for the rest of the day?</span></div></div>",
            "created":1585544400,
            "id":2810497,
            "title":"Tori's Pet Cat"
        },
        "12431":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "choices":[
                "Tori takes care of her pet",
                "Tori's a bit neglectful...",
                "Val's Pet Life"
            ],
            "content":"<div class=\"\"><div> <span>Tori gave Cat a big smile and pet her with the tip of her finger. \"Don't worry Cat, I'll be a good owner, eventually you're going to love being my pet.\"<br>\r\n<br>\r\nCat pouted as her head was stroked by the giant tan finger. She had no doubt that she would be a cute pet, but she didn't like the thought of having an owner. <br>\r\n<br>\r\nWithout much warning, Tori opened up the flap on her brown shoulder bag and dumped Cat inside without taking care to be delicate. She let the flap fall closed and patted the side of her bag.<br>\r\n<br>\r\n\"I'll see you later, my cute little pet Cat,\" Tori said affectionately. She left the bathroom in quite the good mood. The impossible happened, and now she has the cutest pet imaginable. <br>\r\n<br>\r\nShe knew that Cat didn't want to be a pet, but since she's so small Tori figured it's better if she decides for her, and she decided Cat would be best off spending her life as Tori's pet. Besides, trying to find a way to return her to normal sounds like it would be really difficult and risky, not to mention would ruin her chances to have a cute little Cat pet. So really, this was for the best.<br>\r\n<br>\r\nCat meanwhile was quite grumpy, being so casually dumped into Tori's bag like a tube of lipstick. It was so claustrophobic in Tori's bag, she was being pressed between the inner material and a notebook. Her bag was clearly not intended to house people, just belongings. But then Cat sadly remembered she was one of Tori's belongings too. <br>\r\n<br>\r\nCat began to cry, in the lonely darkness of Tori's bag, as her environment swayed with her giant owner's steps. Her life got turned upside down in a matter of minutes. Cat was quite the happy person, but in the blink of an eye she no longer felt like a person and someone whom she used to refer to as a best friend she now has to refer to as an owner. <br>\r\n<br>\r\nOver the next few hours, Cat tried to cheer herself up by thinking of the positives of her new life. Tori would probably buy her a cute cage, after all. Maybe she could convince her to buy her a fun pink cage. And she thought hamsters looked like they enjoyed drinking from their weird water dispensers, so maybe it would be her new favorite way to drink water. And on top of that, she would surely look cuter than a hamster while drinking it. <br>\r\n<br>\r\nCat's time to think to herself was only occasionally interrupted by Tori pulled a book or something out of her bag. It really jostled Cat around every time, but at the very least Tori made sure to never drop a book right on top of her. Occasionally Tori would take an extra second to smile and wave at Cat before closing the bag. Cat always waved back sadly.<br>\r\n<br>\r\nThe day in Tori's bag was the longest day of Cat's life, but eventually Tori got home and pulled Cat out of her bag before setting her on top of the desk in her room. Her hair was a mess and her makeup was smudged in lots of places from all the jostling and rubbing inside the bag.<br>\r\n<br>\r\nTori gave Cat a huge smile, clearly excited. Cat tried her best to return a half-hearted smile.<br>\r\n<br>\r\n\"So Cat, first thing's first...I'm used to calling you Cat, but now that you're a pet that's a little more confusing, like when someone names their cat Bunny. Plus, it's only right that I get to name you since you're mine now. So all day I've been thinking about what to name you,\" Tori said, thoughtfully.<br>\r\n<br>\r\nCat tried to interject, \"But <i>Tori!</i> I already have a name, you can't just rename me!\" Tori laughed and rolled her eyes.<br>\r\n<br>\r\n\"Don't be silly, Cat. You're my pet now, of course I get to name you. I can do whatever I want with you,\" she giggled, finding Cat's protest so ridiculous. \"Anyway, you shouldn't be too bothered by your new name. Because I decided your old last name would work perfectly! So you'll be Valentine! And since you're mine, that makes your full name Valentine Vega. I might even call you 'Val,'\" Tori said with a smile.<br>\r\n<br>\r\nCat groaned and pouted. She was at the very least grateful that the name Tori chose was essentially just calling her by her last name. It could have been much worse, but still. She was none too happy with Tori naming her.<br>\r\n<br>\r\nTori ignored Cat's pouting. \"Anyway, my little Valentine, your new name was only the warm-up to the real surprise! I have your new home ready for you,\" Tori said cheerfully. Cat was surprised that Tori got her a cage so quickly. She hadn't even had time to request a color. Tori knew her well enough to know she would love a pink one, or even red like her hair, though.<br>\r\n<br>\r\nCat's hope for a correctly-colored cage was shattered as Tori reached out of sight below the desk and plopped a glass jar on the desk next to her. Cat stared at the jar in disbelief. It was much bigger than her, so she would comfortably fit inside, but...really?! A jar?! Jars are what you kept bugs in, not even pets! The offense was clear on her face, but Tori seemed to somehow not notice.<br>\r\n<br>\r\n\"Don't worry, I remembered to make holes in the lid. Here, let's get you inside your new home right away so you can get used to it!\" Tori said, unscrewing the lid. Cat almost tried to run away out of reflex when she saw Tori's hand heading towards her, but the giant hand was much faster. Cat was quickly enclosed in the giant fist, only her head and shoulders peeking out of the top. She felt like she was being handled like a doll. <br>\r\n<br>\r\nIt was a quick and sudden movement and then Cat felt a rush of air and dropping feeling before plunking on her butt at the bottom of the glass jar. She started to stand up, but quickly fell over as the jar moved. Outside the glass, all she could see was the skin of Tori's hand pressed against the jar while she held it. Tori had picked it up, and the reason why was immediately obvious, as the lid appeared overhead and was loudly screwed on, properly trapping Cat inside, though she already knew it was impossible to climb out even without it.<br>\r\n<br>\r\nThe jar was set back down on the desk, causing Cat to roll to the back from the impact. After collecting herself for a moment, she finally picked herself up and stood up. Outside the jar, Tori's giant face was quite close while she peered at Cat inside. Her face looked somewhat distorted from the rounded edges of the glass.<br>\r\n<br>\r\nCat walked forward and placed her hand against the thick glass, feeling truly stuck in here.<br>\r\n<br>\r\n\"You look so adorable in there!\" Tori exclaimed. Tori's voice was quite loud to Cat at this size in general, but the thick barrier of glass muffled a surprising amount of sound. It seemed like more of Tori's voice came through the holes in the lid, but from the sound bouncing in inside of the jar, Tori's voice almost sounded a bit tinny. Tinny and muffled in general. <br>\r\n<br>\r\n\"You're like a little fairy trapped in a jar, you're so adorable,\" Tori cooed. She pulled out her phone and took a pic. She then tapped on her screen several times, before turning her phone around and showing the screen to Cat through the glass.<br>\r\n<br>\r\nCat saw the pic of herself and it made tears well in her eyes. Tori thought she looked adorable, but Cat saw how sad and pathetic she looked trapped in the jar, her hair a mess and her expression like...well probably how a trapped fairy would look, actually. <br>\r\n<br>\r\nThen Cat noticed the pic wasn't full screen...because it was on a Slap page. Tori's Slap page. With the caption, \"Check out my new pet cat! ;)\" Cat was mortified, everyone at school could see her like this. <br>\r\n<br>\r\n\"Anyway, I'll let you get accustomed to your new home. I'm gonna go watch TV. See you later, Val!\" Tori said, getting up. She sauntered out of her room happily, not giving Cat another thought. She even flipped the light off on her way out. Thankfully, it was still light outside, so she wasn't in the complete dark.<br>\r\n<br>\r\nAnd just like that, Cat was tiny, alone, in the relative dark, trapped in a jar in her friend's room. No...her owner's room. <br>\r\n<br>\r\nCat curled up on the floor of the jar and sadly cried to herself. She hated the thought of being a pet from the beginning, but it's only getting worse and worse.<br>\r\n<br>\r\n<br>\r\nWhere do things go next?<br>\r\n<br>\r\n1. Tori lets Cat out a few hours later, to feed her and play with her.<br>\r\n<br>\r\n2. Tori is a bit forgetful and neglectful. She forgets to feed Cat, who hasn't eaten since breakfast, and goes to bed without letting Cat out of her jar for the rest of the day. Cat isn't let out until tomorrow.<br>\r\n<br>\r\n3. Timeskip epilogue, seeing how Cat's life as a pet turns out a year from now. </span></div></div>",
            "created":1590814800,
            "id":2843352,
            "title":"Cat's New Home"
        },
        "124313":{
            "author_id":"philiputian",
            "author_name":"Mr. Icarus",
            "content":"<div class=\"\"><div> <span><b>One Year Later...</b><br>\r\n<br>\r\nTori walked into her room after a long day of school. She dropped her bag down next to her desk and sat in her chair. On her desk is a mason jar decorated with \"Val\" in cute letters surrounded by little flowers on the glass near the top by the lid. The lid itself was decorated with hearts.<br>\r\n<br>\r\nInside the jar, her shrunken pet human Val crawled out of a black sock and looked up at Tori with pure glee.<br>\r\n<br>\r\n\"Aww, there's my itty bitty Valentine. Did you miss me?\" Tori said in a cutesy voice.<br>\r\n<br>\r\nVal nodded furiously with excitement and reached her hands and smacked against the glass a few times, her usual signal for wanting to be let out to see Tori. Tori giggled and unscrewed the lid, tipping the jar to the side until Val tumbled out.<br>\r\n<br>\r\nVal looked a little dazed for a second, but shook it off and stood up. Val's hair was brown, with faded red at the ends, and she wore a pink doll dress that was just a little too big for her. She had pink twine wrapped around her waist, sort of like a belt, keeping the dress on her. Even though Val was a tiny human, Tori didn't always bother dressing her anymore, but since she just had her friends over yesterday she made sure to dress her and hasn't taken it off yet. <br>\r\n<br>\r\nVal excitedly rushed over to Tori's hand and nuzzled against it, appreciating the warm skin of her owner. Tori giggled and pet Val with the tip of her finger. The tiny girl looked like she was in heaven.<br>\r\n<br>\r\n\"Aww, you really did miss me. What a good little girl,\" Tori cooed. She picked Val up and rubbed her against her cheek, because she was so darn cute. Tori's nose picked up a slight smell of body odor and wrinkled her nose. She set her back on her desk, and Val looked disappointed to not get more nuzzling.<br>\r\n<br>\r\n\"Whew, someone needs a bath!\" Tori said with a laugh. It had been about a week or so since her last bath, she thought.<br>\r\n<br>\r\n\"Poor little stinky girl, we'll get you a bath later, okay?\" Tori said affectionately. <br>\r\n<br>\r\n\"Okay!\" Val said back happily. She was well trained to not speak too much, but to reply with enthusiasm when she does. She didn't love baths, but she was just so happy to see her owner again after being without her all day right now she didn't care. Tori thought her little voice was so cute-sounding, especially when she replied so adorably.<br>\r\n<br>\r\n\"You want a treat?\" Tori asked. Val nodded very seriously, she loved treats, just like any pet. Tori took a bit of the cutesy tone out of her voice so she could issue proper commands. \"Okay, sit!\" she commanded.<br>\r\n<br>\r\nVal excitedly sat on the desk, cross-legged. Tori smiled.<br>\r\n<br>\r\n\"Good girl. Now, jump for me! Jump high!\"<br>\r\n<br>\r\nVal stood up as quickly as she could, bent her knees, and jumped as high as she could manage, looking up at Tori afterwards for approval.<br>\r\n<br>\r\n\"Aww, good girl! That was very high!\" Tori cooed. \"Alright, last one. Cartwheel!\"<br>\r\n<br>\r\nVal did a little cartwheel for Tori, which she was pretty good at because Tori loved making her do them. <br>\r\n<br>\r\n\"Perfect!\" Tori praised. She pulled open a drawer on her desk, stuck her hand inside, and presented to Val the underside of her outstretched index finger. Lying in the groove of her nail was a small carving of Bibble.<br>\r\n<br>\r\nVal happily grabbed the Bibble chunk and shoved it in her mouth, chewing and swallowing it in record time. Her face was pure bliss, and Tori laughed. <br>\r\n<br>\r\n\"You're such a good little girl, Val. I'm gonna go do some homework in the living room, okay? But before I go, give Mommy some love!\" Tori said, lowering her face to level with her desk, and puckering her lips. Val ran over and planted small kisses all over Tori's huge lips, and Tori giggled.<br>\r\n<br>\r\nTori was about to put Val back in her jar, but remembered something. The sock in her jar was several days old. Tori had figured out a long time ago that Val warmed up to her much faster when surrounded by her scent, and after a few months of that it was practically a requirement. Leaving a sock in her jar was perfect, the scent of her owner comforted Val while Tori was away, and it doubled as a sleeping bag.<br>\r\n<br>\r\nTori reached her hand in the jar and pulled out the black sock, tossing it into her hamper. She then reached under the desk, untied her shoes and kicked them off, then slipped off one of the gray socks she was wearing.<br>\r\n<br>\r\n\"You're lucky, it was pretty hot today so this one will really smell like me,\" Tori said, \"I bet it could last you all week!\" Val looked genuinely excited at the prospect as Tori tugged at the twine around her waist. Once the knot was free, Tori pulled Val from her dress and dropped her into the slightly damp gray sock. She shook the sock around a little bit, watching the lump in the toe of the sock squirm as she did so, and giggled. Then she dropped the sock into the jar and screwed the lid back on. <br>\r\n<br>\r\n\"I'll be back later, little Val. Then we'll take care of your bath!\" Tori said, getting up from her desk and leaving her room, switching the light off.<br>\r\n<br>\r\nVal, inside the sock in her jar, lightly wriggled in place, just feeling the material of the sock rub against her now nude body. She's naked more often than she wears clothes, so she's come to dislike having to wear clothes. Not to mention all the clothes she has to wear are ill-fitting doll dresses, which are made of uncomfortable materials unintended to be worn by living beings.<br>\r\n<br>\r\nShe loves the way Tori's socks feel against her skin, though moreso when they're dry, which this sock currently was not, exactly. She wasn't as upset when Tori left her alone now, especially with the strong scent of Tori all around her. It was a sweaty smell that burned her nose, with the sock being so fresh, but underlying it all, almost as an afterthought, she could definitely detect the unique scent of her owner. <br>\r\n<br>\r\nVal never really thinks of her old life anymore. She rarely remembers that her name used to be Catarina Valentine, and that she used to be a person of equal status as Tori. It was almost too much to think about if she tried. Tori is such a goddess-like figure to her now as her owner, it's hard to try to remember she used to be like her, and felt herself no different from Tori. <br>\r\n<br>\r\nEven when Tori brings her friends over and they play with her, Val has trouble recalling that they're more than Tori's friends, they used to be her friends too. <br>\r\n<br>\r\nVal is a good pet. She struggled to comply at first, she remembers she used to hate being a pet. It was so long ago now, though, she can't remember why. Now she does everything Tori asks, and is very obedient and affectionate and rarely acts out. She's happy, and wants for nothing more.<br>\r\n<br>\r\nIn fact, if Val was offered the chance to regrow and have her old life back, she would decline. She's happy now, and that old life she struggles to remember seemed so much more complicated. Not to mention, it would be much weirder to be Tori's pet while the same size as Tori. Plus she couldn't fit in Tori's socks anymore. And most importantly, Tori's her owner and wants her to be small, so that's what she wants too. She doesn't want to disappoint Tori because Tori's her whole world. <br>\r\n<br>\r\nValentine Vega is Tori's pet through and through. She is a human, but she is no longer a person.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nThis was just one way Cat's tale as Tori's pet could go. Follow the other paths to see how things might turn out differently. Maybe in the other paths, she'll be less obedient, or even escape! Or maybe, she'll be even more brainwashed, and serve Tori more diligently than you see here!</span></div></div>",
            "created":1590814800,
            "id":2843393,
            "title":"Val's Pet Life - Epilogue"
        },
        "125":{
            "choices":[
                "Jade",
                "Trina",
                "Beck or someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jade or Trina?</span></div></span></div>",
            "created":1310014800,
            "id":1142654,
            "title":"Who"
        },
        "1251":{
            "author_id":"lightning06",
            "author_name":"lightning72",
            "choices":[
                "tori",
                "trina",
                "cat"
            ],
            "content":"<div class=\"\"><div> <span>Jade was in hollywood arts at her locker and at a vending machine she saw a drink that said shrink your self. She thaught it was for exercising but she was poorly mistacken. She went to her thegirls locker room and drank some but then passed out when she was awake she was one inch tall so she paniced and ran into ______________</span></div></div>",
            "created":1311656400,
            "id":1155357,
            "title":"Jade"
        },
        "12511":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "climb Toris sneajers untell she stops",
                "climb up to her ear"
            ],
            "content":"<div class=\"\"><div> <span>She was still sitting down starstruck by the emmense size of Tori although in reality she was barely above five two. She quickly snaped out of this transe when Tori's bus sise foot started moveing towards her, she had tucked and rolled it was like running away from the statue of librity. She hadto get Tori's help, even if means swallowing her pride. But Tori was walking agen she had to act now.</span></div></div>",
            "created":1318136400,
            "id":1203816,
            "title":"tori"
        },
        "125111":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "on Toris bed",
                "a glass of water"
            ],
            "content":"<div class=\"\"><div> <span>She ran and grabbed her shoe strings and held on for dear life. Every step this massive girl took was the equilevent to a passenger plane. Holding on was both the hardest and most embarissing thing she had ever done so far. After thirty minutes of walking which seemd like an eternity Tori got home and walked up to her room. To Jade it was like a thirsty traveler finding an oasus in a long dead land, unfortunatly Tori kicked off her shoes seending her tiny hich-hicker free falling were she landed  </span></div></div>",
            "created":1318136400,
            "id":1203834,
            "title":"climb Tori's sneakers untell she stops"
        },
        "1251111":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Tori's massive head",
                "Tori's feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She fell onto the soft mattress breaking her fall like a trampoline. She stood to find herself standing infrount of </span></div></span></div>",
            "created":1344229200,
            "id":1398772,
            "title":"on Toris bed"
        },
        "12511112":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "make the long trek to her face ",
                "climb her sock"
            ],
            "content":"<div class=\"\"><div> <span>Jade stared up in shock at the monstrous feet in front of her with striped green and black socks. Jade finally snapped out of her trance from one of the feet slamming down almost crushing her, it was too dangerous to be around the giant girl unaware. She had to get her attention but how? </span></div></div>",
            "created":1344229200,
            "id":1398790,
            "title":"Tori's feet"
        },
        "125111122":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "sure I wont let my friends get stepped on ",
                "actually do you remember all those times you were mean to me? I do."
            ],
            "content":"<div class=\"\"><div> <span>Jade scaled the sock desprit to get some attention. It took her about ten minutes to climb her sole given the fact that she was only about an inch tall. She eventfully climbed on top of Tori's toes and began jumping and waving until Tori noticed the movement. \"Hey what is that? huh\" She noticed there was something strange about the thing on her toe so she placed it on her bed. <br>\r\n<br>\r\n    \"Jade is that you? Wow your sooo cute!\" Jade crossed her arms and glared at Tori for the comment \"Why are you tiny and why were you on my roe?\" Jade started from the beginning and was disturbed by how Tori laughed at her endevours and Tori couldn't help but love her new found power over Jade. \"So that's what I need to ask. Can you help me get big again?   </span></div></div>",
            "created":1344402000,
            "id":1400391,
            "title":"climb her sock"
        },
        "1251111222":{
            "author_id":"ermbackwards",
            "author_name":"E RM backwards",
            "choices":[
                "Keep you as a pet",
                "Let you grow (evil chuckle)"
            ],
            "content":"<div class=\"\"><div> <span>Jade gulped, while Tori smiled sinisterly \"Okay I may have been a bit mean,\" Jade began \"but you wouldn't hold that against me? Would you?\" Tori smiled, \"of course not,\" she said, Jade gulped and tried to back away, but Tori's hand shot out and grabbed hold of her, hoisting her into the air, till she was eye level with Tori. To Jade it seemed like she was thousands of feet up, she could see Tori's huge eye ball, Jade had never felt so afraid in her entire life.<br>\r\n<br>\r\n\"What are you going to do with me?\" Jade asked timidly. Tori smiled before replying...</span></div></div>",
            "created":1370322000,
            "id":1604347,
            "title":"actually do you remember all those times you we..."
        },
        "12511112222":{
            "author_id":"ermbackwards",
            "author_name":"E RM backwards",
            "choices":[
                "Play with her dolly",
                "Invite a friend"
            ],
            "content":"<div class=\"\"><div> <span>Jade stared at Tori, \"your going to let me get big?\" she asked, Tori nodded. Jade let out a sigh of relief, for a second there she had assumed Tori was going to take advantage of her lack of size and humiliate her, or worse. Tori listened to what Jade said about a drink making her shrink, she put Jade down in a glass jar and went off. After she had been gone a while, Jade started to worry Tori wasn't coming back, she looked around, at one inch she was far to small to escape the jar, and it as to smooth to fly out, she was a prisoner.<br>\r\n<br>\r\nJade gulped and lying down felt like she was going to cry, then the door opened and Tori walked in. She was carrying a bottle which said \"grow\", yes Tori had come through for her, she was safe. But what was all the other stuff Tori was carrying? Oh she could worry about that later, the important thing was she was going to get big again. Tori walked over, and took out a drop cylinder, putting it in the bottle she took out a small amount of the drink, \"here drink up,\" Tori said dropping a single drop of the juice on Jade. Jade tried to swallow as much as she could, but it was a very small drop.<br>\r\n<br>\r\nShe stood there for a second, only for her to start to grow again, yes she was returning to normal. Yes, she punched the air, wait she would get to big for the Jar, she had to get out, as she crossed four inches, Jade managed to climb out, she was about five inches now, it was a slow process, but she could wait. Only for it to stop. Jade stared in disbelief she was only five inches tall, and she had stopped growing. Tori smiled \"there now your big again we can have some fun together\" \"but I'm still tiny\" Jade cried, \"yes but much easier to see,\" Tori said, and then coldly answered \"and to punish.\"<br>\r\n<br>\r\nJade tried to run, but Tori grabbed her. She then began to undress Jade, splitting her macabre clothes, leaving her in her underwear. Jade tried to cover herself up, but Tori mealy laughed at her. She then took another drop, this time of water, and holding her on her side, dropped it on Jades head, she was drenched. Tori used a small cloth to clear her, and take all the make up off Jade. Jade screamed but no one heard her. Jade opened another bag and pulled out a dolls pink princess dress. Jades jaw dropped, surely Tori couldn't make her wear that? Tori thrust the dress at Jade.<br>\r\n<br>\r\n\"I'm not wearing that,\" she screamed, Tori frowned \"put on the dress,\" she said sternly, Jade wouldn't budge, \"put on the dress or I'll drop you in the goldfish bowl.\" Tori snapped. Submissively Jade placed the dress on, it was so tight and uncomfortable, why had she taken so much time mocking Tori for being a girly girl before? Tori took out another bottle, it was hair dye. Taking it she tipped Jade upside down, and dipped her hair in the bottle. Pulling it out, Jades lovely dark locks were died blonde.<br>\r\n<br>\r\nTori held up a mirror, Jade stared horrified as a blonde Barbie doll stared back at her? How had she fallen so far?<br>\r\n<br>\r\nNow Tori has her new doll, what's she going to do with it? </span></div></div>",
            "created":1370322000,
            "id":1604361,
            "title":"A new dolly"
        },
        "1251112":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Tori's lips",
                "towards a sink"
            ],
            "content":"<div class=\"\"><div> <span>Jade landed with a splash in the freezing cold water, she swam over to an ice cube and pulled herself onto it she looked back down she could see the water under her the depth equivalent to a good sized lake . She sat with her legs crossed under her to make it easier for her to fit on the ice cube shivering . She had to get out she could easily get hypothermia from any cold, what is cold for us turns deadly for Jade. She looked towards the edge of the glass thinking of her options until a shadow fell over her entire world. She looked up to see Tori's gigantic face hovering close to her making her almost pass out from fear. Then the glass starteed riseing heading towards</span></div></div>",
            "created":1344229200,
            "id":1398769,
            "title":"a glass of water"
        },
        "12511121":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Yes",
                "no.... RIP Jade"
            ],
            "content":"<div class=\"\"><div> <span>Tori brought the glass up to her mouth and began drinking it. Jade began jumping up and down waving her arms \"Tori don't drink the water your going to eat me, please look down I.. I don't want to die not like this please. Tori heard a squeaking noise and looked don at her water dose she see Jade. </span></div></div>",
            "created":1344229200,
            "id":1398781,
            "title":"Tori's lips"
        },
        "125111211":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "You will be my slave",
                "I'm not getting rid of you with just water!"
            ],
            "content":"<div class=\"\"><div> <span>Tori is drinking her water with no relent until she looks into the cup she is holding to see a tiny woman swimming in it! She spits the water she has in her mouth out in surprise, hitting Jade in the face with what seemed to be gallons of water. <br>\r\n<br>\r\n \"Jade, is that you?!\" Tori said in shock.<br>\r\n<br>\r\n \"Yes! Please help!\" Jade responded in utter fear as she tredded the water underneath her. Tori picks the tiny girl out of the cup and brings her to the counter where she drys her off. <br>\r\n<br>\r\n \"Well you see Jade,</span></div></div>",
            "created":1433394000,
            "id":1987936,
            "title":"Yes"
        },
        "1251112112":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Breakfast",
                "Dinner"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I wouldn't just eat you with water! A meal like you goes with </span></div></span></div>",
            "created":1433394000,
            "id":1987937,
            "title":"I'm not getting rid of you with just water!"
        },
        "12511121122":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Jade is digested",
                "jade somehow survived"
            ],
            "content":"<div class=\"\"><div> <span>\"I think that you would be a good dinner to a long day.\" Tori says to the tiny jade, who sits helpless on the counter. Tori then picks out a pan and makes casserole, where she adds an extra ingredient: Jade!<br>\r\n<br>\r\n Jade is helpless as the giant red fingertips of tori picks the tiny woman up and sets her in the casserole that is soon to be enjoyed by herself. She is shocked by the heat of the dinner, as tori takes out her salt and pepper, taunting the shrunken meal. Jade tries to scream for help but sounds of nothing but a mouse. Tori then takes the casserole and cuts a square around Jade, and places it on a plate. <br>\r\n<br>\r\n Tori gets settled at the kitchen table, where she has a glass of milk to engulf her food with. She takes periodic bites of the casserole around Jade, seemingly celebratory against her fallen prey. She has milk surrounding her mouth as she wipes it off and places the tongs of her fork underneath Jade, who is then raised to the luscious lips of Tori. Tori takes a slow lick at Jades body, getting as much flavor out of the woman as she possibly can, before opening her mouth and setting her meal in her maw. She sucks the casserole around the morsel, and swallows, while Jade attempts to make and escape. It all proved unsuccessfully as tori then lifted her tongue up like a slope, and took a final gulp, sending her schoolmate down her throat and into the cave known as her stomach.</span></div></div>",
            "created":1433394000,
            "id":1987942,
            "title":"Dinner"
        },
        "125111212":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jade watched as water poured into the cavern in front of her she began crying uncontrollably as she was pulled into the mouth. She grabbed a tooth but the current was to powerful and she was swallowed never to be heard from again. </span></div></span></div>",
            "created":1344229200,
            "id":1398783,
            "title":"no.... RIP Jade"
        },
        "12512":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Beck",
                "Tori"
            ],
            "content":"<div class=\"\"><div> <span>Trina Vega was a bigger girl than Jade. Always had been. She was older, slightly taller, more muscular, and wider across.<br>\r\n<br>\r\nNow though? Trina was a goddess compared to Jade's frame. A beautiful, stark naked, goddess. And judging by the twinkle in her eye as she looked down at what had ran into her bare foot, she was a particularly sadistic goddess.<br>\r\n<br>\r\n\"Well what do we have here?\" The massive Latina asked as she reached down. Dumbstruck by Trina's sheer size, Jade had no time to run and soon found herself hoisted upwards by her shirt collar and up to Trina's giant eyeball.<br>\r\n<br>\r\n\"So what happened here?\" The naked giantess asked coyly. Swallowing her pride, Jade recounted the events that led to her predicament. \"So can you <i>please</i> help me?\"<br>\r\n<br>\r\nTrina pretended to think about it. \"No.\" <br>\r\n<br>\r\n\"WHAT?!\" Jade screamed. \"You can't keep me like this!\"<br>\r\n<br>\r\n\"<i>Excuse me</i>?\" Trina asked, false offence dripping from her tone. \"What makes you think you can demand anything of me?\" With that, Trina opened her hand.<br>\r\n<br>\r\nJade plummeted towards the floor only for Trina to catch her and bring her back to eye level. \"Besides, it's my duty as a big sister to strike back at those who would hurt Tori.\"<br>\r\n<br>\r\nJade couldn't believe what she was hearing, \"<i>You</i> hurt Tori!\"<br>\r\n<br>\r\nTrina only scoffed, \"I'm her sister. It's my job to give her hell.\" Trina's face then brightened. \"You know, I remember you once mocked Tori's boobs.\"<br>\r\n<br>\r\n\"Well she is only a B.\" Jade defended.<br>\r\n<br>\r\n\"True, true.\" Trina nodded. \"But you're always acting like your chest is god's gift to the world. Maybe you should spend time with a real bosom.\"<br>\r\n<br>\r\nJade had only a second to process the statement before she was dropped into Trina's massive cleavage. The giantess gave her firm chest a squeeze, slamming her truck-sized D-cups into the tiny goth.<br>\r\n<br>\r\nAt a snail's pace, Trina began getting dressed, each article of clothing increasing Jade's feeling of hopelessness. When the Latina swaggered out, she ran into</span></div></div>",
            "created":1543294800,
            "id":2582615,
            "title":"Trina"
        },
        "12513":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Tori's teaching me ping pong. You'd fit nicely on the ball",
                "Take you home to play"
            ],
            "content":"<div class=\"\"><div> <span>\"Hi Jadey!\" Cat cried bringing up her foot before lowering it.<br>\r\n<br>\r\nStill gawking at Cat's sheer size, Jade was frozen on the ground, only regaining her senses when Cat's sneaker slammed down next to her. Seeing Cat was about to repeat the act, Jade tried to run only for the sneaker to again miss her by an inch. Wherever Jade tried to run, Cat was always there to block her escape.<br>\r\n<br>\r\n\"Now who's the shorty huh?\" Cat sassed before she bent down and picked up the doll-like girl, bringing her up to her face.<br>\r\n<br>\r\n\"Cat... you... you did this to me?\" The redheaded giantess nodded cheerfully. \"I had Robbie make the potion and left it for you to find.\"<br>\r\n<br>\r\n\"Why?\" Jade asked.<br>\r\n<br>\r\n\"Because you're a <i><b>meanie</b></i>!\" Cat screamed, covering Jade in spit. \"You cut off my hair, boss me around, and always mock my height. Well now who's short one?\" Cat smiled as she brought her fingers to Jade, stripping all her clothes off in one smooth motion.<br>\r\n<br>\r\n\"Now I get to decide what we're going to do.\" Cat smiled as she used two fingers to fondle Jade's (once) giant butt and vagina.<br>\r\n<br>\r\n\"What... what are you gonna do to me?\" Jade asked, fear overriding any sense of pleasure.</span></div></div>",
            "created":1549602000,
            "id":2614694,
            "title":"Cat"
        },
        "1252":{
            "choices":[
                "yes",
                "no",
                "something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Trina was busy practicing her lines for a play at school. She decided to take a break and get herself something to drink.<br>\r\nShe went to the fridge and grabbed the special herbal drink she had made earlier using the recipe she had gotten online.<br>\r\nShe drank the whole drink. As she was walking to the couch, she started feeling tingly. \"What's happening!\" she quickly <br>\r\nstarted shrinking(somehow her clothes were shrinking with her) getting smaller and smaller. She finally stopped at three<br>\r\ninches. \"Everything is gigantic!\" Suddenly, trina felt several earthquakes which knocked her off her feet. then a gigantic<br>\r\npair of barefeet stomped in front of her. She looked up and saw that it was her little sister tori, only much bigger. Does tori<br>\r\nsee her?</span></div></div>",
            "created":1310014800,
            "id":1142911,
            "title":"Trina"
        },
        "12521":{
            "author_id":"olimar",
            "author_name":"Ninten",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Tori help her sister?</span></div></span></div>",
            "created":1357362000,
            "id":1502647,
            "title":"Seen by Tori"
        },
        "125212":{
            "author_id":"ricardo2902",
            "author_name":"cool",
            "choices":[
                "Sit on her",
                "Play with her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>No, in fact she gets a wonderful idea.</span></div></span></div>",
            "created":1365829200,
            "id":1570761,
            "title":"No"
        },
        "12522":{
            "author_id":"ricardo2902",
            "author_name":"cool",
            "choices":[
                "Tori",
                "Mom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Luckily for Trina her sister didn't notice her. Trina jumped up and down but couldn't get her attention. Tori went over and sat on the couch, leaving Trina to decide who she wanted to get help from.<br>\r\n</span></div></span></div>",
            "created":1352782800,
            "id":1466825,
            "title":"no"
        },
        "125221":{
            "author_id":"elitelitter",
            "author_name":"EliteLitter",
            "choices":[
                "Sure. Sisters stick by each other.",
                "Sure. But first..."
            ],
            "content":"<div class=\"\"><div> <span>Swallowing her pride, Trina made her way to her gigantic little sister's bare feet. She'd prefer not to have Tori see her in a compromising situation, but with their parents out of town, Tori was her only option.<br>\r\n<br>\r\nManaging to hoist herself onto Tori's big left toe, Trina began jumping up and down, calling Tori's name.<br>\r\n<br>\r\nThe younger girl looked up from her PearPhone as she noticed something on her foot. Instinctively shaking it off, she bent down to see what it was.<br>\r\n<br>\r\n\"TRINA?!\" She gasped.<br>\r\n<br>\r\n\"Hey sistah sistah.\" The elder Vega waved awkwardly.<br>\r\n<br>\r\n\"Uh... ok... what... happened? Am I on acid?\" Tori asked.<br>\r\n<br>\r\n\"No,\" Trina waved off. \"It's... well,\" She blushed as she explained how she'd shrunk. Tori had to chuckle, enjoying her newfound power over her once freakishly strong sister.<br>\r\n<br>\r\n\"So can you please help me?\" Trina asked in her most humble tone.<br>\r\n<br>\r\nThe question brought a smile to Tori's face.</span></div></div>",
            "created":1549342800,
            "id":2613543,
            "title":"Tori"
        },
        "125222":{
            "author_id":"ricardo2902",
            "author_name":"cool",
            "choices":[
                "Help her",
                "Keep her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her mom was in the kitchen cooking. Trina walked over and got her moms attention. But what was she going to do to Trina?<br>\r\n</span></div></span></div>",
            "created":1352782800,
            "id":1466826,
            "title":"Mom"
        },
        "1252221":{
            "author_id":"ricardo2902",
            "author_name":"cool",
            "choices":[
                "Tori",
                "Jade and Cat"
            ],
            "content":"<div class=\"\"><div> <span>\"Mom you've got to help me\", stated Trina. \"Don't worry I will\" said her mom. Her mom then grabbed a bowl and filledit with warm water. \" I think you could use a hot tub to relax\", said her Mom. Trina didn't resist getting in the bowl, sighing the entire time. \" i'll be back soon\", concluded her mom as she left. Trina kept on relaxing until _______ stood above her looking hungry.</span></div></div>",
            "created":1352782800,
            "id":1466831,
            "title":"Help her"
        },
        "12522212":{
            "author_id":"ricardo2902",
            "author_name":"cool",
            "choices":[
                "My butt",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jade and Cat both looked down at Trina licking their lips. \"She is so small\" ,said Cat. \"Yeah!\" said Jade. \"She looks like she could fit very easily in...</span></div></span></div>",
            "created":1365829200,
            "id":1570755,
            "title":"Jade and Cat"
        },
        "125222122":{
            "author_id":"ricardo2902",
            "author_name":"cool",
            "choices":[
                "Your butt",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe she could go into..<br>\r\n</span></div></span></div>",
            "created":1365829200,
            "id":1570757,
            "title":"Other"
        },
        "1252221222":{
            "author_id":"ricardo2902",
            "author_name":"cool",
            "choices":[
                "Go into the front of my panties",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe she could<br>\r\n</span></div></span></div>",
            "created":1365829200,
            "id":1570758,
            "title":"Other"
        },
        "12522212222":{
            "author_id":"ricardo2902",
            "author_name":"cool",
            "choices":[
                "Yes",
                "Cat wants to eat her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I could eat her.</span></div></span></div>",
            "created":1365829200,
            "id":1570760,
            "title":"Other"
        },
        "125222122222":{
            "author_id":"trolboot",
            "author_name":"mr.T",
            "choices":[
                "she eats her.",
                "something else happens"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>does Cat really eat her or does something else happen?</span></div></span></div>",
            "created":1370235600,
            "id":1603143,
            "title":"Cat wants to eat her"
        },
        "1252221222221":{
            "author_id":"mikedaniels",
            "author_name":"Mikedaniels",
            "content":"<div class=\"\"><div> <span>Jade gets a mischievous look and tells Cat \"do it cat, swallow her whole.\" A terrified Trina hops out of her bath and slips and falls to the floor, casuing trina to become disoriented.<br>\r\nCat exclaims with a gleeful laugh and says \"Watch this\"<br>\r\nCat slips here right foot out of her stilleto heels and hovers it over Trina. Cat had her toenails painted white. Upon the removal of her shoe, Cat curled and uncurled her toes revealing beautifully wrinkled soles.<br>\r\nAfter hovering over Trina with her powerful bare sole for a bit, Cat proceeds to grab Trina in between her big and second toes. Trina, still disoriented, is not yet aware of what is happening. Cat lifts her foot up to her mouth and sucks Trina out from her toes. Trina finally starts to come to but it is too late as she is waking up in the warm crevasse of Cat's beautiful mouth. Cat plays with Trina in her mouth, swishing her back and forth. After doing this a couple of times, Cat draws the attention of Jade and points to her open mouth. Jade turns to see Trina on Cat's tongue, a faint scream could be heard. Then, in an instant, Cat flipped her tongue to the back of her throat, with her mouth still open, and let Trina slide down her powerful esophagus. A visible bulge could be followed down Cat's throat. Cat struggles to get Trina down however. Halfway through her giant gulp, Trina had become lodged in Cat's throat. Jade quickly runs over and begins massaging Cats throat and soon enough, Trina slipped down into the abyss of Cat's stomach. Cat and Jade sat on the couch to watch TV. A fully satisfied Cat would let out a giant burp a couple minutes later, signaling, Trina had been fully digested by Cat's powerful stomach.</span></div></div>",
            "created":1576126800,
            "id":2758654,
            "title":"she eats her."
        },
        "1253":{
            "author_id":"timbuk2815",
            "author_name":"Timbuk2815",
            "choices":[
                "Tori and Andre ",
                "Jade and Beck ",
                "Trina and Robbie"
            ],
            "content":"<div class=\"\"><div> <span>There is a new policy at Hollywood arts. All males must be shrunk during the duration of the school year. The girls remain their normal size and select one boy to become her slave. All males are shrunk to three inches in height including staff. With the schools permission the girls are allowed to punish the boys however they see fit. Which two sets of characters will you follow?</span></div></div>",
            "created":1409720400,
            "id":1851959,
            "title":"The boys have to shrink"
        },
        "12532":{
            "author_id":"timbuk2815",
            "author_name":"Timbuk2815",
            "choices":[
                "Bra",
                "High heels"
            ],
            "content":"<div class=\"\"><div> <span>Beck suddenly awoke to the opening of the purse that belonged to his mistress Jade. She had left him in it since Friday afternoon. Now it was Monday morning. Being confined to her purse was his punishment for disagreeing with her about the Hollywood arts shrinking policy. After having been without food or water for two days Beck had realized who was the boss. It was his girlfriend  Jade who he now had to call mistress. The gothic goddess's face appeared looking down at him with an evil grin. \"Are you ready to obey me slave?\" she asked. Beck looked up at his mistress and then held his head down with despair. \"Yes mistress\" he said unwillingly. \"Good\". she said smirkingly. \"Today I have a surprise for you.\" \"Your going to take a trip in my...</span></div></div>",
            "created":1409979600,
            "id":1853455,
            "title":"Jade and Beck "
        },
        "125322":{
            "author_id":"timbuk2815",
            "author_name":"Timbuk2815",
            "choices":[
                "Hump her foot",
                "Think about how to please her later"
            ],
            "content":"<div class=\"\"><div> <span>high heels\" she said with a evil smile. Beck saw his mistresses hand coming down into the purse. He tried to hide, but it was too late. The crawl-like nails of his powerful goddess grabbed his right leg. The sharp nail pinched his leg and he moaned in pain as she lifted him out of her purse. Then she brought the shrunken slave still hanging from her finger nails closer to her beautiful giantatic face. She smiled at Beck and said \"You so cute at his height.\" \"Jade\" Beck said in desperation. \"Your killing me.\" \"Sweetheart.\".she said \"I have been torturing you even when you were normal sized.\" Beck realized that she had a point. \"Come on.\" she said. \"You know deep down you want me to dominate you.\" Beck was still hanging upside down in the grip of his goddess finger nails. He looked at her beautiful face and knew that she was right. Deep inside he knew that he wanted her to dominate him. This made Beck aroused and he truly wanted to be Jade's slave. Jade said \"Whether you like being my slave or not your riding in my heel.\" She took off her right shoe and dropped Beck inside which made Beck land face down on the bottom of her shoe. Suddenly he felt a huge pressure against him. It was Jade's right foot. It smell awful, but at the same time he was so aroused by her domainace over him as Jade walked to Hollywood arts. He decided to...</span></div></div>",
            "created":1410066000,
            "id":1853818,
            "title":"High heels"
        },
        "1253221":{
            "author_id":"timbuk2815",
            "author_name":"Timbuk2815",
            "choices":[
                "Neck",
                "Balls"
            ],
            "content":"<div class=\"\"><div> <span>hump her foot. He did continued to hump her foot until she arrived at Hollywood arts. She took off her shoe and picked Beck up and dropped him on her desk. \"You have been a very naughty boy.\" Jade said. \"You need to learn how to control your urge to cum.\" \"Mistress.\" Beck replied. \"I can't do it because you arouse me so much.\" \"Well then slave.\" Jade said half heartedly. \"I guess you will have to wear this.\" She took a very tiny device from her purse and held it in front of Beck. \"Did you shrink my dog's shock collar?\" he asked. \"Yes slave.\" Jade said grinning. \"Since I own you, I'm afraid I'm going to have to make you wear it around your...</span></div></div>",
            "created":1410325200,
            "id":1855222,
            "title":"Hump her foot"
        },
        "12532212":{
            "author_id":"timbuk2815",
            "author_name":"Timbuk2815",
            "choices":[
                "Low",
                "High"
            ],
            "content":"<div class=\"\"><div> <span>balls. Beck looked up at his giant mistress in horror. \"Jade you can't do this to me.\" Beck protested. \"Don't worry slave.\" Jade said mockingly. \"All you have to do is obey my every word and I won't have to fry your balls off.\" \"Now slave.\" Jade continued. \"Take off your pants and put this around your balls.\" Beck obeyed her, dropped his pants and underwear and took the shock collar and put it around his balls. \"Good boy Beck.\" Jade said jokingly. \"Now I need to shock your balls to make sure it still works.\" she said. \"What intensity should I use?\" she asked herself aloud.</span></div></div>",
            "created":1410757200,
            "id":1857258,
            "title":"Balls"
        }
    },
    "info":{
        "author_id":"thebandgeek",
        "author_name":"I <3 BAND",
        "brief_description":"based on the tv show characters. I own no rights to the show, Dan Schneider+Nickelodeon do",
        "created":1278693060,
        "description":"<td align=\"left\" class=\"norm\">My first giantess story<br>\r\n<br>\r\nNo gay stuff like masturbating and that crap<br>\r\n<br>\r\nHave fun with it, no male giants either, no gore or gory descriptions<br>\r\n<br>\r\nENJOY!!<br>\r\n<br>\r\nOnce again, the creators of the show and Nickelodeon own all the rights to these characters and the show itself, while I am just a fan of it.<br>\r\n<br>\r\nAdded 1/19: PLEASE ADD!!!! I don't have the time, energy, or desire to write the whole thing!!! Please add yourself! I reserve the right to edit additions though.</td>",
        "id":1689206,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":0,
        "modified":1592161200,
        "pretty_title":"Victorious Giantess and Shrinking"
    }
}