{
    "chapters":{
        "1":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "#1",
                "#2",
                "#3",
                "#4",
                "#5"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nIn a kingdom where a queen rules the land.<br>\r\n<br>\r\nA young princess lives there. <br>\r\n<br>\r\nHer name is Alida<br>\r\n<br>\r\nFair, kind, beautiful. She is destined to become the leader of the great kingdom someday. She enjoys art, poetry, fancy clothing, and childish panties.<br>\r\n<br>\r\nAnd has a habit of \"accidentally\" putting herself if embarrassing situations.<br>\r\n<br>\r\nSome say that she doesn't even know it's happening. But in reality, she does it on purpose.<br>\r\n<br>\r\nShe loves the embarrassment, the humiliation, the exposure. Something to escape her everyday life of being royalty<br>\r\n<br>\r\nOften she leaves her dress in her room before attending important events, such as royal banquets. Thus leaving her in her often childish and embarrassing panties.<br>\r\n<br>\r\nNot only does she love it, but so do her subjects, seeing such a powerful and beautiful girl blushing and squealing in her childish panties is quite enjoyable.<br>\r\n<br>\r\nHowever, that's not her only tool for her personal humiliation. Wedgies, wetting, and many other things she practices. And she is constantly searching for more.<br>\r\n<br>\r\n<br>\r\nHer mother, Queen Sofia, knows of this personal pleasure, and thinks it's a great way of bonding with her subjects.  Often her mother helps out her daughter with public spankings or other humiliating punishments. Or if caught on a good day, she will join her daughter in the public acts of embarrassment.<br>\r\n<br>\r\nThis is where the story begins.<br>\r\n<br>\r\n----------------------------------------------<br>\r\n<br>\r\n\"Princess Alida, you need to get up!\" A motherly voice with a hint of annoyance cuts through the tranquil quiet of Alida's bedroom.<br>\r\n<br>\r\n\"Five more minutes.\" Alida groggily begs as she buries her face in her pillow.<br>\r\n<br>\r\n\"No, you will get up now, you are already late for the royal breakfast.\" Replies her maid with a frustrated sigh, as she grips the bottom of Alida's blanket. In one fierce tug, she wrentches the blanket free of Alida's grip, leaving the lazy princess fully exposed in her bra and panties. <br>\r\n<br>\r\n\"Alida, we've been over this. You are 18 and you are much too old to be wearing such childish panties.\" Her maid sighs as she discovers Alida's light purple panties with little teddy bears all over, along with her matching bra.<br>\r\n<br>\r\n\"I am a princess! I can wear what ever I wish!\" Alida replies, which gives her an idea for the royal breakfast. <br>\r\n<br>\r\n\"Hmmm, what embarrassing thing should I do this time.\" She thinks to herself, lightly blushing at the thought.<br>\r\n<br>\r\n#1: The usual, only showing up in her panties, and letting her D-cup boobs exposed to the world.<br>\r\n<br>\r\n#2: Perhaps some wedgies are in order, preferably big ones that will leave her butt sore for days on end.<br>\r\n<br>\r\n#3: Hmmm, I haven't used the bathroom since yesterday, perhaps I can use that to my advantage.<br>\r\n<br>\r\n#4: Who doesn't love seeing a grown-up girl showing up in a diaper.<br>\r\n<br>\r\n#5: Maybe we can save the humiliation for another time, and show up properly.<br>\r\n<br>\r\n</span></div></div>",
            "created":1422421200,
            "id":1924415,
            "title":"The story begins"
        },
        "11":{
            "author_id":"themysticone",
            "author_name":"Donald Mystic",
            "choices":[
                "Small Bikini Bra Pink With matching thong.For More Revealing Effect?",
                "Rubber Ducky Bra with matching Granny panties",
                "Perhaps fully nude?",
                "A pair of white panties with frilly rainbow colored trimming",
                "Same undies she's wearing right now"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She thought to herself \"Let it be the same old trick today... But first should I go change? Or are these are embarssing are enough?\"</span></div></span></div>",
            "created":1422766800,
            "id":1926464,
            "title":"#1"
        },
        "112":{
            "author_id":"themysticone",
            "author_name":"Donald Mystic",
            "choices":[
                "Pee Her Pants When She In The Kingdom",
                "Give herself a Wedgie",
                "Or Wardrobe Malfunction"
            ],
            "content":"<div class=\"\"><div> <span>She laughed to herself and thought, \"Lets go make people laugh.\"<br>\r\n<br>\r\nShe quickly switches panties, and went downstairs. She goes to sit down on her chair pretending that she didn't notice.  She began eating her meat and vegetable salad.  Her mother notices that men and girls are giving weird stares at her daughter.  After looking at her daughter. she does the Same As The Rest Of The Kingdom.Um ahem.The Mother Said.Yes Mother What Is It?,She Said Pretending Not To Know.Mother Signals Her Eyes Down To Her Bottom Half.The Princess Looks Down In Pretend Shock and Quickly Covers Herself Up,That When Some Of The Kingdom started to Giggle and Give Wolfcalls<br>\r\nThe Princess Quickly Ran Up The Stairs..<br>\r\n<br>\r\n<br>\r\n<br>\r\nThe Princess Began Giggling As The Plan Worked Now Her Next Humiliation Hmm What should it be?</span></div></div>",
            "created":1422766800,
            "id":1926466,
            "title":"Rubber Ducky Bra with matching Granny panties"
        },
        "1123":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "Wedgie the daylight a out of her poor butt",
                "Spank and tickle her until she wets herself ",
                "All of the above, or more!"
            ],
            "content":"<div class=\"\"><div> <span>She then quickly put on one of her favorite dresses, a pair of long, white tube socks, and a nice pair of black shoes, and proceeded back down stairs.  Instead of returning to the kitchen, however, she took a right and walked right out the front door.  It was a beautiful sunny day in the town square, full of commerce and bustling citizens. <br>\r\n<br>\r\nAlida sighed happily at the blooming success of the town and her kingdom, and walked out into the middle of the town square where the stocks were. As she walked down, many people gave her a friendly wave, to which she responded with a bright smile and wave in return. As soon as she reached the stocks, a small crowd had gathered.<br>\r\n<br>\r\nAlida grinned, and snagged her dress on a loose cobblestone as she walked. Within several steps, her dress gets yanked down, forcing her large boobs out on full display.  Alida squealed and blushed fiercly as she attempted to \"cover\" herself with her hands, somehow her perky nipples seemed to always thread right through her fingers. The crowd cheered with delight, as they watch the princess playfully struggle with her wardrobe malfunction.<br>\r\n<br>\r\nSuddenly her foot catches on a cobble, and she falls foreward, right into a stock. Locking her head and hands in place.<br>\r\n<br>\r\n(For those wondering what a stock was, it's one of those wooden locks that lock your hands and head in place used for public humiation as punishment for crime.)<br>\r\n<br>\r\nAlida gasps as she soon realizes the predicament she's in, her hands and head are bound, unable to cover her exposed breasts, and the rest of her dress is only hanging by a thread as well. There couldn't have been a more perfect opprotunity! Alida squirms and struggles, breaking what few threads left holding her dress up, and the dress falls to her ankles. The crowd roars with renewed laughter as her humiliating panties are on full display.<br>\r\n<br>\r\nAs Alida's blush deepens, someone in the crowd decides to...</span></div></div>",
            "created":1426050000,
            "id":1947143,
            "title":"Or Wardrobe Malfunction"
        },
        "11231":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "Samantha accepts the wager",
                "Samantha declines. And proceedes to wedgie Alida for offering that."
            ],
            "content":"<div class=\"\"><div> <span>Alida lets out a small gasp as she feels fingers creep into the inside of her granny panties. In one quick yank, the soft pink fabric cleaves up her poor butt, making her let out a small squeal.  She blushes fiercely as they take turns yanking on her undies, sending. The fabric deeper and deeper with every tug. Alida wiggles her butt and legs to make it look like she is attempting to escape, only to make the townsfolk pull harder and harder.  Eventually they stretch the fabric up over the stock, and they snap it over Alida's face to her chin, muffling her cute squeals of humiliation. <br>\r\n<br>\r\nHowever, this event finally catches the eye of the Captain of the Guard. A towering Amazon woman who hails from a family of equally large and equally skilled fighters that have defended the Royal Bloodline for generations. She has a beautiful yet fiercesome appearance, while she stands around 6'3 with the strength of a bear, yet despite her fearsome appearance and strength she always had a soft spot for those close to her. Namely Alida and the Queen.<br>\r\n<br>\r\n<br>\r\n\"Alright, alright. Break it up!\" She barks as she streamlines through the crowd, her heavy plate armor clinking heavily as she shoves them aside. \"You've had your fun.\" <br>\r\n<br>\r\nThe crowd quickly disperses leaving her and Alida alone. <br>\r\n<br>\r\n\"Aww, it was about to get fun.\" Alida complained. \"You always ruin my fun, Sammy.\"<br>\r\n<br>\r\nSamantha sighed, if anyone else were to call her by her nick name she would have knocked them into tomorrow. \"Come on, you know how I feel about your strange hobby.\" She said as she unhooked Alida's atomic wedgie. <br>\r\n<br>\r\n\"And you know how much I love to do it, and how I'm not gonna stop.\" Alida replied with a giggle.<br>\r\n<br>\r\nSamantha only grunted as she smashed her elbow down on the lock, breaking it clean off the stock, and she freed Alida from it.<br>\r\n<br>\r\n\"Oh come on Sammy, live a little, try just once spending a day only in your panties. You're always so boring.\" Alida groaned.<br>\r\n<br>\r\n\"Oh give me a little credit here, I'm the reason you and your mother stay safe in your castle. I don't have any time for fun and games.\" Samantha retorted while rolling her eyes.<br>\r\n<br>\r\n\"So you admit that streaking in your undies does sound like fun.\" Alida purred.<br>\r\n<br>\r\nSamantha's eyes widened as a small blush creeped on her face. \"O-of course not.\" She stammered as she attempted to avoid eyes contact. Suddenly she felt very self-conscious about how her armor felt. And she squirmed uncomfortably as she felt her pink panties with little light blue and white hearts all over bunch up under her armored grieves. The more she thought about it, the more uncomfortable it got.  Suddenly she noticed that they were wet with sweat after being in the hot armor, and how the tag with the name \"Sammy\" was suddenly becoming itchy. She discretely attempted to pick her wedgie, only to be stopped by the steel surrounding her like a second skin. Oh how she wanted it off<br>\r\n<br>\r\n\"Oh you totally wanna try it.\" Alida pressed on. \"How about a little wager?\" Alida then offered, hoping to gain her curiosity <br>\r\n<br>\r\n\"I'm listening,\" Samantha replied as she looked at Alida suspiciously through the corners of her eyes.<br>\r\n<br>\r\n\"If I go put some clothes on and remain decent for the rest of the day, you have to remain indecent for the day as well.\" Alida offered with excited eyes.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1430802000,
            "id":1974083,
            "title":"Wedgie the daylight a out of her poor butt"
        },
        "112311":{
            "choices":[
                "the other gaurds and townsfolk takes sams clothes and wedgie both of them as is",
                "they get to the castle and "
            ],
            "content":"<div class=\"\"><div> <span>\"alright if you put clothes on for the rest of the day ill spend the whole day in just my panties lets go change\" said Sammy \"no you got strip down now or no deal\" said Alida \"fine\" Sam says and strips to her panties.\"alright now we go to the castle to get you changed\"says sam</span></div></div>",
            "created":1508475600,
            "id":2403828,
            "title":"Samantha accepts the wager"
        },
        "112312":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "Alida got up to give her a revenge wedgie!",
                "The queen, who saw everything, comes to collect her daughter",
                "An innocent bystander comes to help the poor princess"
            ],
            "content":"<div class=\"\"><div> <span>Samantha looked livid. \"How dare you think I would do something so indecent?! I don't care whose daughter you are! You must be punished!\" She then turned Alida around and yanked furiously on her stretched undies! Alida squealed as her underwear invaded her butt like never before. Samantha had them stretched to her head at an instant. <br>\r\n<br>\r\n\"Oh Samantha, you're so strong! My undies are inside me!\" She screams in pain and pleasure. The fabric was now at the top of her head. Alida smiled, thinking that she was going to get another atomic, but she couldn't be more wrong.<br>\r\n<br>\r\nSamantha just pulled and pulled on the underpants. The cotton was in Alida's rectum at this point. \"I'm going to rip these right off of you!\" Samantha said, before pulling up again. This made Alida yell in agony. Her underpants were scraping her butt crack like a buzz saw. <br>\r\n<br>\r\nAfter a few agonizing minutes later, the panties began ripping. Samantha heard this and one last mighty pull, lifting the poor princess completely off the ground! She was screaming as her panties penetrated her like never before. This pull was to much for the undies and they ripped completely off, leaving Alida's butt naked and jiggling in the air. She lays her head faced down and ass up in embarrassment. <br>\r\n<br>\r\nSamantha observed the torn fabric in her hands. \"You should really learn to wipe yourself properly, like a real princess.\" She says before pointing out a massive skid mark in the seat of the panties. The princess was silent as she was in too much shame and pain to talk. As Samantha walked away......</span></div></div>",
            "created":1433653200,
            "id":1989035,
            "title":"Samantha declines. And proceedes to wedgie Alid..."
        },
        "11232":{
            "author_id":"directo789",
            "author_name":"blitzen",
            "choices":[
                "The queen out visiting her subjects",
                "Guards investigating the commotion"
            ],
            "content":"<div class=\"\"><div> <span>The townsfolk gathered round closer, laughing at Alida's misfortune, as the young princess squirmed and blushed at her embarrassing exposure. A bold young man strode up to her panty clad behind. Alida struggled in the stocks but in doing so kept thrusting her butt out suggestively, almost daring the man to mess with her. He didn't hesitate, gripping her waistband and wedging the undies firmly up her crack, exposing the pale flesh of her round buttocks. Another round of laughter and cheering rang out from the assembled crowd.<br>\r\n<br>\r\nThe young man then drew his hand back and delivered a hard spank to Alida's left buttcheek. She cried out in shock and pain, her butt bouncing from the impact. Then another spank to her right cheek, her flesh wobbled just as much. The crowd whooped and encouraged the man to continue, and he enthusiastically obliged. Smack, smack, smack rang out around the square as the princess' ass got a powerful spanking. At first Alida bit her lip and tried not to react to her public humiliation, but as the skin of her butt turned pink and then a deep red from the beating she couldn't help but let out yelps and squeals of pain.<br>\r\n<br>\r\nThe crowd grew as the princess' spanking went on, the townspeople greatly enjoying the royal girl's embarrassment. Alida's bare breasts were bouncing as she squirmed in her wooden prison, and the blush on her face matched the color of her ass. Soon more people began to crowd round her. They started to share out the spanking duty, two at a time, while others reached around her almost naked body and started to tickle her most vulnerable places. Alida's armpits, thighs and stomach were all being tickled by the roving hands of her subjects. Her body jerked and struggled instinctively, trying to escape the relentless tickle torture, while the urge to laugh overwhelmed her yelps of pain, and the princess cackled loudly.<br>\r\n<br>\r\n\"HAHAHAHA, no, HAHAHAHAHA, stop, please, HAHAHAHAHA, OUCH, I'm going to, HAHAHAHAHA, oh dear...\"<br>\r\n<br>\r\nAlida cringed as her body was overwhelmed by her tickling and spanking. She felt a trickle of warm liquid start to release from her nether regions, pooling at first in her wedged panties. Then she felt her pee soak through the taut fabric and run down her legs. The crowd hooted with gales of laughter at their poor humiliated princess peeing her pretty panties, which were now stained yellow.<br>\r\n<br>\r\nAlida felt complete shame and embarrassment at the way her body had capitulated to the tickling and spanking, but also the familiar tingle of excitement that went along with her humiliation. She whimpered and moaned as the spanking continued, the crowd now having decided her bottom needed to be punished for her public urination. Enterprising people were grabbing sticks to whip her round ass and even using books and tools to paddle her cheeks until they felt like they were on fire. As the minutes went by, welts and blisters started to form on her thoroughly roasted, purple buttocks, but there was nothing the princess could do to escape, trapped as she was in the stocks.<br>\r\n<br>\r\nAfter almost an hour of humiliating punishment, Alida heard the crowd start to quiet down, which meant someone was approaching...</span></div></div>",
            "created":1430888400,
            "id":1974610,
            "title":"Spank and tickle her until she wets herself "
        },
        "113":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "In the castle",
                "Stroll around town",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Alida thought of a really naughty idea! \"Maybe I can go completely naked! Nothing's more embarrassing than that!\" She settled on that and started to undress. <br>\r\n<br>\r\nShe first took off her cute teddy bear bra. Her giant d-cup boobs jiggled as she freed them of the cotton prison they were just in. Alida decided to have a little fun with herself. She grasped her own giant boobies. She squeezed then and tweaked her own nipples. She started to get hot and bothered. Her boobs were so soft and fun to play with. \"I have the best boobs in the kingdom! I don't care what my mom says, I got the better chest!\" <br>\r\n<br>\r\nShe then started to go for her other piece of clothing. Her teddy bear panties were slightly wedged up her butt crack. She loved that feeling so she decided to pull them up even more for a bit. Alida moaned in absolute pleasure and her panties started to get wet. \"This feels so good!\" Alida said aoud, not caring if anyone heard her. She sent her other hand near her pussy. She played around with her folds for a few minutes before she finally released a torrent of fluids into her undies. <br>\r\n<br>\r\nAfter her masturbation, she took her panties out of her butt crack and pulled them down her legs and off completely. Her glistening wet and shaven pussy was in full display and her beautiful bubble butt  jiggled as it was finally free. Alida looked herself in the mirror and gave herself as nice spank on the butt. \"You princess have the best body in history! And now everyone in will be able to enjoy it!\" <br>\r\n<br>\r\nWhere does she show her nude body?</span></div></div>",
            "created":1433566800,
            "id":1988583,
            "title":"Birthday Suit!"
        },
        "1131":{
            "author_id":"tickle-man",
            "author_name":"Tickle-Man",
            "choices":[
                "Does the Queen punish Princess Alida herself?",
                "Or is she so mad that she turns Princess Alida over to a punishment expert?"
            ],
            "content":"<div class=\"\"><div> <span>'<i>No need to go out when I have everything I need to get my butt nice and spanked is right here in the castle!</i>' Princess Alida thought to herself, '<i>Now, Mom is</i> usually <i>in the dining hall at this time of day. So...</i>'<br>\r\nAlida's bare feet padded through he castle as she strode confidently toward the dining hall. She flung the doors open....<br>\r\n...and froze...... her mind said '<i>uh-oh...</i>'<br>\r\nHer mother, Queen Sofia, <i>was</i> in the dining hall, all right.<br>\r\nAlong with dignitaries from the surrounding kingdoms. She had accidentally interrupted one of her mother's Alliance Banquets.<br>\r\nThis she hadn't counted on. As much as Alida liked putting herself in embarrassing situations, she wanted these situations to be under her <u><i>total control.</i></u> She hated when something <i>this</i> unexpected happened.<br>\r\nWithin seconds, the room erupted in a sea of angry voices, all directed at Queen Sofia. Alida made out words like \"outrage!\" and \"unbecoming a Princess!\"<br>\r\nPrincess Alida shrank back through the doors and stood against the wall beside the doorway. Her mother's face was as red as her's. Not from embarrassment, Queen Sofia was <span class=\"clred\"><i>livid!</i></span></span></div></div>",
            "created":1459573200,
            "id":2126605,
            "title":"Uh-Oh..."
        },
        "11312":{
            "author_id":"tickle-man",
            "author_name":"Tickle-Man",
            "choices":[
                "Should Master Payne continue with the Slapping Strap?",
                "Or does Master Payne have something ELSE in mind?"
            ],
            "content":"<div class=\"\"><div> <span>Once Queen Sofia calmed the dignitaries down, she left the dining hall to look for her daughter. She didn't have very far to look, because Alida was still standing in the corridor right outside the door.<br>\r\n***<br>\r\nThe furious Queen took her naked, troublemaking daughter downstairs to the torture chamber.<br>\r\nInside was the Queen-Appointed Punisher of Princess Alida, Master Payne. A stern-looking, though <i>hardly</i> an unattractive man.<br>\r\nMaster Payne saw Alida standing there in the nude and shuddered a bit with lust.<br>\r\n\"Master Payne!\" Queen Sofia said, \"Princess Alida has burst in, completely undressed, on one of my Alliance Banquets! I now leave her with you to be punished.\"<br>\r\nBefore leaving, the Queen turned to Master Payne and whispered, \"<i>Maybe it would be a good idea to give her the '<u>special</u>' treatment.</i>\"<br>\r\nBarely able to contain his excitement, Master Payne nodded as unemotionally as he could. And with that, Queen Sofia left her daughter in Master Payne's care.<br>\r\n\"So what did Mom say to you?\" Alida asked defiantly.<br>\r\n\"You'll find out soon enough,\" Master Payne responded harshly, then took Alida to her ordeal for the rest of the day.<br>\r\nIt was a modified chair. The back had been replaced with a T-cross and there were rests attached to the front of the seat to hold Alida's legs and feet, spread wide apart, up in the air in front of her. Along the length of these rests were straps for the thighs, knees, calves, and ankles.<br>\r\nSince he only had one client: Alida, all the bondage devices in here were custom-fitted to her measurements.<br>\r\nMaster Payne had Alida sit in the torture seat. He raised her unresisting arms up. He bent her arms and tied her elbows to the crossbeam, then tied her wrists together behind the upright post. Then he tied a third rope around the base of her biceps where her arms meet her shoulders. When he tightened the rope, it caused her shoulder blades to squeeze together, which also caused her naked boobies to push forward. Finally, he tied a rope around Alida's waist and bound it to the upright post.<br>\r\nThen it was time for her legs and feet. Master Payne took her left foot and brought it up to its corresponding leg and foot rest, where he wrapped the strap around her ankle. Then he did likewise with her right foot.<br>\r\nOnce both feet were secured, Master Payne looped and bucked the straps around her thighs, knees, and calves.<br>\r\nPrincess Alida was now quite helpless and exposed. but she wasn't too terribly worried. Sure, Master Payne had been ordered by the Queen to punish Alida for her indiscretion. He probably planned to use that leather strap to slap across the soles of her feet, across her breasts, and even slapping it on her pussy, as he liked to do.<br>\r\nHer mother knew about Master Payne's torture methods, of course, but allowed them. She would allow Master Payne to inflict any sort of torture on Princess Alida by way of punishment, as long as these tortures did <i>not</i> involve 1) doing any <i>lasting</i> damage to her, and 2) inserting his member into her sex.<br>\r\nThe Slapping Strap didn't really hurt, only stung a bit. That is until about 15 to 20 minutes into the torture. By then her slapped skin would be beet red and the Slapping Strap would feel like a barbed cat-o-nine-tails.<br>\r\nAnd Alida would have it no other way! She liked her sessions with Master Payne. No. She LOVED these sessions! She would even come down to have a punishment session with him even when she <i>hadn't</i> been particularly naughty (which wasn't often) She loved it when he stripped her of her gown and panties and tied her bent over a saw horse or tied down on all fours to a bondage platform to be spanked or paddled. She preferred spanks to paddlings, though. There was something about the skin-on-skin intimacy of a good spanking that Alida found absolutely tantalizing.<br>\r\nPity Master Payne was of such a low station. Otherwise, he would be her ideal lover.<br>\r\nMaster Payne went to his tool bench and brought out, as Alida had figured, the Slapping Strap. He held it folded in his two fists. Bringing his fists close together, he created a loop with the Slapping Strap. When he jerked his fists apart, the loop closed abruptly, creating a loud cracking sound that was oh-so delicious to Alida's ears.<br>\r\nMaster Payne brought the Slapping Strap over and started swatting it on the soft soles of Alida's feet. Each stroke shot up her legs and made her pussy tingle.<br>\r\nAfter a half hour on her feet, Master Payne moved up and whacked the Slapping Strap across Alida's naked boobies and nipples, causing her to moan orgasmically.<br>\r\nAnother half hour, then Master Payne began smacking the strap on her labia, and her moaning increased in volume.<br>\r\nAnd now the three places Master Payne has tormented are now a near-uniform shade of red. What should he do now?</span></div></div>",
            "created":1459573200,
            "id":2126635,
            "title":"Meet Master Payne"
        },
        "113122":{
            "author_id":"tickle-man",
            "author_name":"Tickle-Man",
            "choices":[
                "Feet?",
                "Boobies?"
            ],
            "content":"<div class=\"\"><div> <span>When the skin of Alida's soles, boobies and pussy had been properly prepped, Master Payne withdrew the Slapping Strap and retreated back to his tool bench, allowing time for the stinging feeling to sink into her skin.<br>\r\n\"Wait! That's it? Come on, Steffan [<i>which was his real name</i>]! Punish me some more!\" Alida begged.<br>\r\n\"Oh, your punishment is only just beginning, Highness,\" Master Payne responded ominously, \"That was just to sensitize your skin for the <i>real</i> torture yet to come.\"<br>\r\nMaster Payne picked up some items from the tool bench and turned back to Alida. \"There is no more excruciating, no more effective torture to inflict on a sexy, naked, helpless minx like you.... than TICKLING!\" As he said the last word, Master Payne whipped out a pair of stiff turkey feathers, twirling them menacingly in his fingers.<br>\r\nAlida's eyes widened! So <i>that's</i> what the Queen told him! She only ordered <i>this</i> punishment done to Alida when the Princess had <i>really</i> taken things too far! This was the torture Alida feared having done to her the most!<br>\r\nAnd it was the torture she <i>adored</i> having done to her the most, as well.<br>\r\nAt least twice a week, when Master Payne would leave his torture chamber, Alida would sneak down there, in the nude (or sometimes wearing nothing but a pair of high heels), and place herself in a position to be put into bondage, whether it be the foot stocks, the wall manacles, or the rack.<br>\r\nWhen Master Payne returned, he would find the Princess with her ankles in the bottom half of the stocks, or standing against the wall with her hands reaching up to the manacles, or with her wrists and ankles bound to the rack awaiting for the wheel to be turned to draw her body taut.<br>\r\nAnd each time, she would look at him seductively and say, \"I've been such a bad, bad girl. Please tickle me.\"<br>\r\nMaster Payne knew every ticklish spot on Alida's body quite intimately, and would have her pleading for mercy within seconds. Mercy which would never come. He would tickle and tickle and tickle her for hours and hours, even keeping a bottle of smelling salts on hand for when she passed out.<br>\r\n***<br>\r\nAnd now, Master Payne was about to apply his tickling ministrations on her again. And after that session with the Slapping Strap, her feet, boobies and pussy were going to be even more tickle-sensitive than usual.<br>\r\n\"Oh no! Not that!\" Alida begged, struggling rather unconvincingly in the torture seat, \"Please! A-hahahahahaha-anything but that!\"<br>\r\nAs Alida knew, her begging only egged Master Payne on with his tickling. With a look of total lust in his eyes, he brought the feathers over and began tickle-caressing them on her...</span></div></div>",
            "created":1459573200,
            "id":2126657,
            "title":"Time for the REAL Torture!"
        },
        "1133":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe a potential suitor is in town to meet Alida, and she wants to embarrass herself in front of him/her?</span></div></span></div>",
            "created":1433653200,
            "id":1989026,
            "title":"Love interest?"
        },
        "11331":{
            "author_id":"tripleb6",
            "author_name":"StarWars13",
            "choices":[
                "Eager princesses",
                "Interested princes"
            ],
            "content":"<div class=\"\"><div> <span>Alida had just finished admiring herself and was about to prepare for another round when her mother walked in to see a naked Alida pleasuring herself.<br>\r\n<br>\r\n\"Alida!\" she yelled, hardly able to control herself, \"are you aware what is happening today?!\" <br>\r\n<br>\r\n\"Oh mother, I'm sorry, I will put on a dress and be downstairs for...\"<br>\r\n<br>\r\n\"You, don't even know do you? Well there's no time, you'll have to meet your new <i>suitor</i> naked.\" Her mother told her.<br>\r\n<br>\r\n'A suitor?' she thought, 'this could be an opportunity for some fun!' she walked the royal stair case to see a line of...</span></div></div>",
            "created":1446526800,
            "id":2056525,
            "title":"The new Suitor"
        },
        "113311":{
            "author_id":"tripleb6",
            "author_name":"StarWars13",
            "choices":[
                "One of the first two",
                "Another possible princess-to-be"
            ],
            "content":"<div class=\"\"><div> <span>The rules of the kingdom had always been very open, so when asked what preferences she had for suitors, her number one request 'a girl' was granted. Alida now looked at her suitors, a line about ten long, full of princesses who eagerly looked at Alida's naked, moist body. A per<br>\r\n<br>\r\nThe first two princesses in line where like this;<br>\r\n<br>\r\nA perky redhead with a bubble butt that clearly showed her rainbow trimmed panties<br>\r\n<br>\r\nA sexy blonde who looked open to anything.</span></div></div>",
            "created":1446526800,
            "id":2056527,
            "title":"The lady suitor"
        },
        "1133111":{
            "author_id":"tripleb6",
            "author_name":"StarWars13",
            "choices":[
                "Adaire",
                "Jenny"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The redhead who's panties and butt showed well in her bright pink gown. (Adaire is her name)<br>\r\n<br>\r\nThe tall Blonde who's black lace thong showed from her low-hanging, low-cut blood red skirt (Her name is Jenny)</span></div></span></div>",
            "created":1446526800,
            "id":2056529,
            "title":"Princesses 1 and 2"
        },
        "11331111":{
            "author_id":"tripleb6",
            "author_name":"StarWars13",
            "choices":[
                "Put on a....",
                "bend down for your punishment."
            ],
            "content":"<div class=\"\"><div> <span>After scanning the crowd Alida noticed the redhead most of all, with a smile on her lips, intrigue in her eyes, and most importantly, rainbow panties poking out of her two piece dress.<br>\r\n<br>\r\n\"Hi, I'm Alida,\" she said excitedly. \"Do you want to go back to my room where we can... talk a little more?\"<br>\r\n<br>\r\n\"I would love to, and I'm Adaire by the way.\" The two girl excitedly rushed up to Alida's room upstairs. Adaire gasped as they entered the room, a large dresser with open drawers full of panties, of all kinds, from girlish panties, to very revealing thongs, to full on adult diapers, sat diagonally on one of the corners, on the other was a cream pink bed with large bed posts, perfect for a wedgie.<br>\r\n<br>\r\n\"So, what do you want to do?\" Alida asked<br>\r\n<br>\r\n\"I have an idea,\" Adaire said, \"Why dont you...</span></div></div>",
            "created":1446526800,
            "id":2056558,
            "title":"Fun times with Adaire"
        },
        "113311111":{
            "author_id":"tripleb6",
            "author_name":"StarWars13",
            "choices":[
                "Some kind of underwear",
                "A diaper"
            ],
            "content":"<div class=\"\"><div> <span>\"Why don't you-\" Adaire started<br>\r\n<br>\r\n\"wait, before you say anything, what would you call this, us?\"<br>\r\n<br>\r\n\"I am your suitor, aren't I?\" Alida smiled, at this response, knowing full well what it entitled. \"Anyway, why don't you put on...\"</span></div></div>",
            "created":1446526800,
            "id":2056593,
            "title":"What she gonna wear."
        },
        "1133111111":{
            "author_id":"lildude",
            "author_name":"Tyrone",
            "choices":[
                "Adaire's turn",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"...these teddy pair granny panties and I'll give you a hanging wedgie.\",said Adaire grinning widely fully aware of Alida's humiliation fetish. Alida happily put them on and turned around awaiting her wedgie. Adaire grabbed the grannies and rocketed them up poor Alida's ass getting them to the back of her head. She dragged Alida to one of her bed posts by her panties. She then got on a stool that was next to said bedpost and lifted Alida four feet off the ground and attached her panties to the bedpost leaving Alida suspended there. <br>\r\nWhat happens next?</span></div></div>",
            "created":1491627600,
            "id":2301938,
            "title":"Some kind of underwear"
        },
        "11331111111":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "The queen comes in shortly after",
                "The two girls hang until their panties rip"
            ],
            "content":"<div class=\"\"><div> <span>\"So what's next?\" asked Adaire<br>\r\n<br>\r\n\"Well, it only seems fair you join me in my pleasure. So, why don't you hang yourself up as well.\" said Alida as she began to enjoy her hanging wedgie.<br>\r\n<br>\r\n\"That's sounds like an excellent idea.\"<br>\r\n<br>\r\nAdaire maneuvered the stool that she used to stand on over to the other side of the bed and placed it in front of the post across form the hanging princess. Though Alida was surprised when her potential suitor stood on her tiptoes and draped the front of her rainbow colored panties over the post. Once she knew her panties were secured, Adaire kicked the stool out from under her and fell into the fabric, giving herself a massive frontal hanging wedgie, the fabric sliding through her lower lips with ease.<br>\r\n<br>\r\n\"MMMPPPHHH\" moaned Adaire as she wiggled around in her panties, trying to adjust to the wedgie.<br>\r\n<br>\r\n\"Well, it seems you share the same enjoyment in humiliation as me.\" said Alida \"I think this relationship will get along soothingly.\"<br>\r\n<br>\r\nAlida then reached over and grabbed Adaire's hand, sparking a smile on both girls' faces as they enjoyed their hanging wedgies together.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1514091600,
            "id":2432199,
            "title":"Adaire's turn"
        },
        "113311111111":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "The girls turn their wedgie into a game",
                "The girls a stuck until the Queen returns"
            ],
            "content":"<div class=\"\"><div> <span>A few minutes passed, when the Queen entered her daughter's chambers and wasn't at all surprised to see the two girls already in an embarrassing situation. To the girls though, it was all pleasurable.<br>\r\n<br>\r\n\"Well, I see you two are getting along well.\" said the Queen<br>\r\n<br>\r\n\"Indeed mother.\" said Alida with a smile on her face. \"Until further notice, there's to be no further offers for suitors. Though, I think we both agree that we may invite more to the future?\" asked Alida toward her hanging associate.<br>\r\n<br>\r\n\"Oh in the future defiantly.\" said Adaire \"Though for now I wouldn't mind if it was just the two of us.\"<br>\r\n<br>\r\nSmiling, the Queen responded \"Very well my dear. I'll let the kingdom know immediately. Later we will have a banquet to celebrate. Is there anything I could do personally now or later?\"<br>\r\n<br>\r\nThinking for a moment, Alida smilies and then motioned her mother forward and whispered in her ear. After a few seconds, the Queen straighten up and said, \"Of course. Anything for my daughter.\"<br>\r\n<br>\r\nThe Queen then proceeded to take both girls down from their hanging wedgies, Adaire made a sound of disappointment. \"Now don't worry Adaire, the next few minutes will be some you'll never forget.\" With that the Queen went and grabbed a Xl red thong from her daughters panty drawer. She held it opened and Alida stepped inside the red material and motioned for Adaire to follow. The girls now stood together inside the red thong, their fronts barely grazing each other with their current panties still in a natural wedgie.<br>\r\n<br>\r\nThe Queen then leaned down to whisper in Adaire's ear. \"Now, just relax and enjoy. If you're anything like my daughter I know you will.\"<br>\r\n<br>\r\nWith that she began to fulfill her daughter's request. The Queen then grabbed the back of Adaire's panties and began to tug them up her back, causing the material to glide through her lower lips and a moan to escape her lips. Due to the hanging wedgie it didn't take long for the panties to reach the back of her head, but suddenly the Queen let the fabric snap back in place causing Adaire to squeak in the action. The Queen then smirked and reached for the front of the rainbow material now and pulled it up Adaire's front. The girl moaned louder as the fabric made its journey back toward her face, when she gasped as the Queen now pulled the front of the panties over her head, giving Adaire a frontal atomic wedgie. The Queen didn't stop for a second, grabbing the back of her panties again as yanked them back up and now securing them over her forehead, now completing the double sided atomic.<br>\r\n<br>\r\nThe Queen smiled as Adaire moaned at the completion of her wedgie. \"Now just stand still while I deal with my daughter.\" said the Queen.<br>\r\n<br>\r\nThe next few minutes flew by and after some fabric pulling and many moans, gasps and squeals later, the Queen had successfully given her daughter her own double sided atomic wedgie. Alida was is heaven, seeing nothing but the stretched faces of cute teddy bears. Though she knew her mother wasn't done. The Queen then grabbed both sides of the thong that the two girls were standing in and heaved up with all her might. The fast pulling caused not only for the red fabric to quickly press into both girls nether regions and heightening the pleasure of their current wedgies but also made the girls press more into each other. The Queen easily got the stretchy thong to reach a good foot over the two girl's heads and brought the two ends together and tied the thong in a nice little bow. The Queen stood back to admire her work and smiled. The two girls were now secured in their respective double sided atomic in their ridiculous panties, while now being in a gift wrap wedgie. The red thong acted almost like the wrapping one would use of a present for the holidays. The two girls were besides themselves and were in heaven. The thong was now a tough line of fabric that pressed into the girls already pleasurable wedgies and the force of the gift wrap wedgie had brought the girls so close together that if they moved at all their breasts would slide against the others'<br>\r\n<br>\r\n\"Well, I hope you're satisfied girls. I'm going to make preparations for the banquet. Feel free to do as you please. I'll be back in a few hours to release you if you haven't by then.\" With that, the Queen exited her daughters chamber, leaving the two girls to enjoy their joined wedgie prison.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1514178000,
            "id":2432214,
            "title":"The queen comes in shortly after"
        },
        "1133111111111":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Adaire, after the princess yanked her front while pressing her g-spot",
                "Alida, after her suitor yanked her back and sharply tweaked her nipple"
            ],
            "content":"<div class=\"\"><div> <span>After a half an hour, the two girls were still in there joined wedgie. The girls tried to find a way out after a few minutes wanting to enjoy themselves further. The Queen though had tied the thong together very well and the two wedgie bound girls knew it would take an extreme amount of movement to coats the knot to become loose. It didn't help with their attempts as with every movement caused the fabric to grind against the girls' nether regions and the breasts to graze each other. It was then Alida had an idea.<br>\r\n<br>\r\n\"Hey can you here me?\" said Alida through her wedgie, hoping her suitor would hear her. \"I think I have an idea.\"<br>\r\n<br>\r\n\"Yeah, what?\" asked Adaire<br>\r\n<br>\r\n\"Look, we both know its going to take some serious movement to loosen the knot.\" Adiare nodded \"I can only think of one thing that might work. We have to cum. I know it sounds crazy, but if we both cum as hard as we can then there no way that the knot can't come undone. Either way, I know we'll enjoy it either way\" said Alida with a smile on her face<br>\r\n<br>\r\n\"Alright, let's do it. Though why don't we make it interesting. Instead of trying to make ourselves cum, lets try to make the other cum. First one to cum loses and has to get a wedgie from the winner of their choosing.\"<br>\r\n<br>\r\n\"Oh you're on.\"<br>\r\n<br>\r\nWith that, Alida got to work quickly, using her hands to reach and grab the thin line of rainbow fabric that traveled up Adaire's back and began to give hard tugs, the fabric forced more inside Adaire as she moaned in response. Adaire, not wanting to be shown up, began to pull the back of the princess's teddy panties, the fabric causing a burning sensation in Alida's rear and the pleasure to increase. After a few minutes, the girls stepped up their efforts. Alida had now began to finger her rainbow fabric wrapped suitor while still giving tugs to the front of the fabric, while Adaire had now begun to massage Alida's breasts, occasionally switching from one to the other and tweaking the nipple each time she switched. The girls could only moan at the other's actions, both wanting to make the other cum, the original objective completely forgotten. As both girls were nearly the edge, one of them made a move that quickly made the other cum.<br>\r\n<br>\r\nWho cummed and how?</span></div></div>",
            "created":1514178000,
            "id":2432216,
            "title":"The girls turn their wedgie into a game"
        },
        "11331111111111":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Wrap her in a cocoon wedgie",
                "Jock-lock/spanking"
            ],
            "content":"<div class=\"\"><div> <span>Adaire quickly found herself coming uncontrollably, as the princess and yanked the front of her rainbow panties harshly through her lower lips and pressed against her g-spot at just the right angle. Her orgasm caused her to shake so much that it resulted in the knot of the red thong to come undone and the two girls fell backwards, there individual double sided atomics still intact. Alida quickly got out of her wedgie to see the results of her victory. She smirked as she saw that Adaire was still experiencing her orgasm, the front of her panties becoming damper, some even leaking on the floor. Her new lover's body was tilted back, too tired or caught up in the overwhelming pleasure the princess couldn't tell. Adaire didn't even have the strength to even remove her wedgie.<br>\r\n<br>\r\nAlida, with a smirk still on her face, walked over to her panty wrapped suitor and peeled the fabric off Adaire's face. She was rewarded with her lover's face, completely red and out of breath.<br>\r\n<br>\r\n\"Well, looks like I win.\" said the princess with a smile on her face<br>\r\n<br>\r\n\"Y-Yeah. I guess you did.\" said Adaire still trying to catch her breath \"So, what will you do to me now?\"<br>\r\n<br>\r\nWhat will Alida do next?</span></div></div>",
            "created":1521176400,
            "id":2465138,
            "title":"Adaire, after the princess yanked her front whi..."
        },
        "113311111111111":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "The Queen comes in hours later to get them ready for the feast.",
                "Alida can't wait and decided to have some fun with her \"captive\""
            ],
            "content":"<div class=\"\"><div> <span>Alida thought for a moment, gazing at the fabric of Adaire's panties still in her hand. She noted how incredibly stretchy they looked and that gave her an idea.<br>\r\n<br>\r\nShe leaned in and kissed Adaire on the forehead before replying, \"Something special.\"<br>\r\n<br>\r\nThe princess then yanked the front of the rainbow fabric up, causing Adaire to give a ragged moan of pleasure. She then pulled the material up and over her lover's left shoulder before continuing to maneuver the fabric to her will. Adaire just stood in awe as the princess yanked her panties around her body, trapping her arms to her torso and binding her legs, leaving some gaps of skill. She moaned as Alida had to yank a few times to get the fabric to stretch, the rainbow-colored material forced more inside her lower lips. After a few minutes, Alida then the material over Adaire's face, the tension causing her head to bend slightly forward. Alida was far from done, however.<br>\r\n<br>\r\nShe spun Adaire around, exposing her wedgied backside before yanking on the back, bringing the soft waistband high in the air, a muffled moan coming from the bounded girl. The princess then repeated her process, maneuvering the fabric around the already wedgied girl, making sure not to cover the other girl's breasts. It didn't take too long as the material was severely stretched to then secured the fabric over the pantied forehead of Adiare.<br>\r\n<br>\r\nThe princess stepped back a bit to admire her handiwork at the cacoon wedgied Adaire. She smirked at seeing the growing wet spot at the front of the fabric, surprised that more was coming out. She then walked behind her wedgied lover and delivered a spanking to Adaire's rear, causing a muffled moan to come from the layers of fabric.<br>\r\n<br>\r\n\"Well, I see you enjoyed yourself,\" said Alida. A muffled moan responded. \"Good. Well, I think that's enough fun for now till the feast, time for a little rest.\"<br>\r\n<br>\r\nWith that, Alida carried her wedgied suitor into her bed. The princess played big spoon, cuddling into Adiare's back, reaching around to softly massage the other girl's breasts till the two slowly fell asleep.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1549383840,
            "id":2613327,
            "title":"Wrap her in a cocoon wedgie"
        },
        "1133111111111111":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Matching Atomic Wedgies",
                "Matching Bra Connections"
            ],
            "content":"<div class=\"\"><div> <span>The Queen entered her daughter's chambers, surprised at seeing her daughter and her new girlfriend in her bed. She approached the foot of the bed and was even more surprised to see her daughter grabbing what appeared to be Adaire's breasts while she was in a fully wrapped wedgie. The Queen shook out of her shock and nudged her daughter's shoulder, causing the princess to awake.<br>\r\n<br>\r\n\"Hm?\" Alida made a confused noise then noticed her mother. \"Oh hello, mother. Is it time for the least?\"<br>\r\n<br>\r\n\"Yes.\" said the Queen. \"I see that you two had some fun since I left.\"<br>\r\n<br>\r\nAlida nodded as she looked over at her bound girlfriend.<br>\r\n<br>\r\n\"Well, time to get her up and get you two ready for dinner.\"<br>\r\n<br>\r\nAfter a few minutes of waking Adaire and unraveling the rainbow panty imprisoned girl, the Queen sent in some staff to help the two get ready. After an hour of cleaning, picking the right attire and grooming, the princess and her girlfriend were ready for the evening. Adaire and the princess were wearing identical dresses that reached from their shoulders to their feet, but with the princess sporting a white colored one while Adaire was wearing one more beige. Underneath, the two had decided to wear some embarrassing undergarments, chosen by the other. The princess had selected a pair of pink panties with multicolored flowers on them with a matching bra for her lover, while Adaire picked some sky blue ones with ducks and a matching bra for Alida.<br>\r\n<br>\r\n\"Alright, we're ready.\" said the princess.<br>\r\n<br>\r\n\"Not quite,\" said the Queen as she stood in front of the two girls. \"I think there is still another touch we can add.\" she finished with an evil grin.<br>\r\n<br>\r\nWhat does the Queen have in mind?</span></div></div>",
            "created":1553618700,
            "id":2635152,
            "title":"The Queen comes in hours later to get them read..."
        },
        "11331111112":{
            "author_id":"lildude",
            "author_name":"Tyrone",
            "choices":[
                "Hang on her legs deepening the wedgie",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could Adaire do to Alida</span></div></span></div>",
            "created":1504846800,
            "id":2382206,
            "title":"Other"
        },
        "1133111112":{
            "author_id":"tripleb6",
            "author_name":"StarWars13",
            "choices":[
                "Put on a diaper as well",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\"A diaper, I don't think I've ever seen an adult wear one of those before\" Adaire said, trying (and failing) to hide her excitement at seeing Alida in such an embarrassing state.<br>\r\n<br>\r\n\"All right, but if I do that, then you have too...</span></div></div>",
            "created":1493269200,
            "id":2311659,
            "title":"A diaper"
        },
        "113311112":{
            "author_id":"kblade60",
            "author_name":"Katana Blade",
            "choices":[
                "Put her in a diaper and treat her like a baby!",
                "hanging wedgie time-out!"
            ],
            "content":"<div class=\"\"><div> <span>\"Bend over for a spanking.\" Adaire told her.<br>\r\n<br>\r\n\"W-what?!\" Alida asked, taking a step back and blushing madly.<br>\r\n<br>\r\n\"You showed up completely naked to meet me, your new suitor and a fellow princess. Such lack of proper manners CANNOT go unpunished. Now, bend over!\" Adaire ordered, grabbing Alida and bending her over the bed.<br>\r\n<br>\r\n\"Oh, you're so forceful! I like that.\" Alida said with a smirk.<br>\r\n<br>\r\n\"You won't like this!\" Adaire declared, raising her hand and bringing it down hard on Alida's right cheek.<br>\r\n<br>\r\n\"Aaah!\" Alida squealed in a mixture of pleasure and pain.<br>\r\n<br>\r\n\"What do you think of this!?\" Adaire demaded, smacking the other cheek just as hard.<br>\r\n<br>\r\n\"Oww! It hurts!\" Alida cried. It did hurt, but it was also arousing.<br>\r\n<br>\r\n\"I'm sure it does. And it's also embarrassing I'm sure. Well, that's exactly how I felt. I came to meet a fellow princess: nice, young, beautiful, well-mannered and well-behaved. But I show up and you haven't even taken the effort to dress or even clean yourself. I saw your tender areas. It was clear you'd been pleasuring yourself before this.\" Adaire told her, giving four swats to each cheek.<br>\r\n<br>\r\n\"Owie! I forgot about what today was. But I won't lie. I did enjoy being a tease.\" Alida said.<br>\r\n<br>\r\nWell, I'm certainly enjoying smacking your butt!\" Adaire declared, giving ten more spanks to each cheek.<br>\r\n<br>\r\n\"Kyaaaa! I'm so sorry! I promise I'll behave!\" Alida shrieked. Although, clearly she'd never behave. She wanted more of this.<br>\r\n<br>\r\n\"Oh, really? That's a shame. If you behaved, I'd have no reason to spank you!\" Adaire told her, pinching her butt.<br>\r\n<br>\r\n\"Eek! I'll be naughty whenever you want.\" Alida said.<br>\r\n<br>\r\n\"Good girl.\" Adaire said, letting her up and kissing her. \"But I need to make sure the lesson sinks in. Let's see here... What to do?\" Adaire wondered.</span></div></div>",
            "created":1590300120,
            "id":2840227,
            "title":"bend down for your punishment."
        },
        "12":{
            "author_id":"dudewitheyes89",
            "author_name":"LordwithEyes",
            "choices":[
                "...a few subjects start spanking her",
                "..her mother and a few othe people give her more wedgies",
                "...same as #1 and #2 but the queen gets spanked and wedgied too",
                "...nothing worse than \"accidently\" releasing your blader again",
                "...She decides to do this appropriately now"
            ],
            "content":"<div class=\"\"><div> <span>\"Perhaps some wedgies are in order for today\"thought Alida as she looks down the stairs and see a lone bed post sticking out near the bottom. \"Perfect!\" Alida thought as she slides down the stairs with nothing but her panties and bra.<br>\r\n<br>\r\nJust as she hoped her purple panties got stuck on the bedpost and as soon as she fell to the side the panties stretched higher up her bum. Soon the entire room erupts in laughter and wolf whistles and to add further humiliations Adila released her bladder and soon her panties are soaked.<br>\r\n<br>\r\nSoon the maids came by and helped Adila down, much to the disappointment of the crowd, but also accidently lifted the panties higher over her head into an atomic. As she walks over to the table with a soaking atomic wedgie...</span></div></div>",
            "created":1422766800,
            "id":1926552,
            "title":"Wedgies..."
        },
        "122":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "A girl chirps up from the crowd and gives up her undies",
                "A maid is required to give her panties to the princess ",
                "Nobody fesses up, and the queen takes off hers, and gives it to Alida"
            ],
            "content":"<div class=\"\"><div> <span>Before she could sit down, queen walks over.<br>\r\n<br>\r\nShe has a look of annoyance, but out of sight of her subjects, she gives Alida a playful wink.<br>\r\n<br>\r\n\"Perhaps my daughter should get a little more punishment for showing up so under clothed.\" The queen states.<br>\r\n<br>\r\nThe queen grips the front of Alida's panties and in one quick tug, yanks the soaked fabric up to her boobs.<br>\r\n<br>\r\nAlida lets out a shrill squeal as her panties cleave up her vag, making her legs weakened from pleasure. Suddenly her legs buckle from underneath her, sending all her weight into her frontal, increasing the pain and pleasure ten fold.<br>\r\n<br>\r\nThe queen smiles, and begins to bounce Alida's limp body up and down, sending her panties deeper and deeper with every bounce.  <br>\r\n<br>\r\nAfter several minutes of bouncing, feint ripping sounds could be heard from Alida's panties. The queen gives one final massive yank, tearing Alida's panties clean off.<br>\r\n<br>\r\nAll the mean while, Alida's was fighting to not lose herself to sheer pleasure, but after that one final bounce, she couldn't fight any longer, and as soon as she hit the floor, she stiffened up and shuddered, and completely orgasmed. <br>\r\n<br>\r\nAs Alida laid limply on the floor, her mother said \"I do believe she needs some new panties. Any offers?\" She asked the crowd.</span></div></div>",
            "created":1424408400,
            "id":1937576,
            "title":"..her mother and a few othe people give her mor..."
        },
        "1221":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "Have a wedgie war in Alida's room",
                "Get spanked together in public",
                "other embarassment options"
            ],
            "content":"<div class=\"\"><div> <span>\"She can use my undies, Your Highness!\" A pretty blonde girl with short hair came out of the crowd and took off her panties from under her skirt in front of the kingdom. She handed the queen her pink panties with a bunny printed on the butt of them. The queen then gave them to Alida to put on. Then there was a breeze that shot through and the girl's skirt blew up, revealing her white naked bubble butt  to everyone. She blushed instanainiously, but did nothing to put her skirt down. The queen noticed this and said to the girl, \" You like being humiliated, don't you?\" The blushing girl then answered, \"Yes, your majesty.\" The queen then asked, \"What's your name, girl?\" \"My name is Lucy,\" she answered. \"My daughter likes to behumiliated like you do, as you may have noticed.\" While her mother was talking to Lucy, Alida went up to her and asked, \"Hey, you want to be friends?\" Lucy's etes lit up and nodded her head. <br>\r\n<br>\r\nWhat do the new friends do now?</span></div></div>",
            "created":1424494800,
            "id":1937729,
            "title":"A girl chirps up from the crowd and gives up he..."
        },
        "12213":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "Epic hanging wedgie",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Queen Sofia got Lucy some new panties for Lucy and orders them to be hung up the town's flagpole?</span></div></span></div>",
            "created":1433566800,
            "id":1988637,
            "title":"other embarassment options"
        },
        "122131":{
            "author_id":"lildude",
            "author_name":"Tyrone",
            "choices":[
                "Panties rip after a week",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Queen Sofia: Get this girl some new panties and then hang my daughter and her on the town's flagpole by there panties. Everybody cheered at The queens request. A maid brought over a pair Teddy bear covered panties. Once Lucy got them on someone grabbed her and princess Alida by their panties and started giving them a bouncing wedgie all the way to the town's flagpole. They took down the flag and then attached her and princess Alida panties to the rope that usually holds the flag. Once they secured the rope to their panties the town's people started pulling on the other side of the rope hoisting them up the flagpole making their panties sink deeper into them. The town's people didn't stop pulling until the girls were all the way the top. Once they were done the crowed left the girl to their intense but still highly pleasurable hanging wedgie. They were just hanging there not knowing when they will get down.</span></div></div>",
            "created":1491454800,
            "id":2300705,
            "title":"Epic hanging wedgie"
        },
        "1221311":{
            "author_id":"hamandcheese",
            "author_name":"Adam Jiffy",
            "choices":[
                "\"...a dog gave me a wedgie?\"",
                "\"...I had to sneak home naked?\""
            ],
            "content":"<div class=\"\"><div> <span>About a week later, the girls were <b>still</b> stuck at the top of the pole. Since there was no telling how long they would be stuck up there, Alida decided that now would be a good time to get to know her new friend, Lucy.<br>\r\n\"So Lucy\", she said. \"Yes?\" Lucy responded.<br>\r\n\"I never thought that I'd ever meet someone who likes getting embarrassed as much as me. Have you always liked getting humiliated like this?\"<br>\r\n\"Well, it all started when I was about six years old...\", Lucy began.<br>\r\n<br>\r\n<i>\"My mom came home with a jump rope as a reward because I had been so good lately. I had always wanted one and I was so excited that I wanted to play with it right away. Mom came with me into our backyard, and I got ready to start jumping. But I forgot that the panties I was wearing were at least six months old and that the waistband was really loose. So when I halfway through \"January, February\", my panties slid down to my ankles!\"</i><br>\r\n<br>\r\n\"What design were they?\" Alida asked, interrupting.<br>\r\n\"White with butterflies\", Lucy answered.<br>\r\nAlida giggled. \"Nice. Sorry, I just had to know. Keep going\".<br>\r\n<br>\r\n<i>\"Anyway, my mom was laughing pretty hard while I pulled my undies back up. Both my parents have a good sense of humor towards my antics. Mom asked me if I wanted to get a better pair of underpants, but I was determined to finish that rhyme, no matter what. It took me twelve tries, but I finally finished it. Although at that point, I actually jumped out of my panties, tripped over the rope and my skirt flipped up, showing my naked butt to my mom\".</i><br>\r\n<br>\r\nAlida was laughing at Lucy's story when she finished. \"And ever since that day, I loved it whenever I got embarrassed. Of course, it helps that I'm a little accident prone\". \"Well, I'm glad we met, Lucy. I bet the two of us together could get into all sorts of situations\". Lucy smiled. \"I hope so\".<br>\r\nJust then, the girls heard a ripping sound. They looked back and saw that Lucy's panties (that Alida was still wearing) were about to give in. \"Oh! It looks like we're finally about to get down. Fortunately, this isn't my first time up here\". She scanned the ground for any villagers. She spotted a woman pulling a cart of hay. <i>\"Perfect!\"</i> she thought. \"Excuse me!\" she called. \"Our undies are about to go! Would you please leave that cart underneath us?\"<br>\r\n<br>\r\nAfter both girls were safely on the ground, they both realized they were really hungry. Aldia invited Lucy back to the castle for dinner and a sleepover. Lucy graciously accepted. After they ate and changed into their pajamas (which consisted of a new pair of bras and panties), Alida decided she wanted to hear another one of Lucy's embarrassing moments. Lucy said yes and then thought about which one to tell.<br>\r\n\"How about the time..?\"  <br>\r\n<br>\r\n</span></div></div>",
            "created":1494738000,
            "id":2319295,
            "title":"The Origins of Lucy"
        },
        "12213111":{
            "author_id":"hamandcheese",
            "author_name":"Adam Jiffy",
            "choices":[
                "The girls plan a surprise for breakfast the next morning",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"You were wedgied...by a <i>dog</i>?\" Alida asked astoundedly. <br>\r\n\"Believe it or not, yes. It happened like this...\"<br>\r\n<br>\r\n<i>\"I sometimes look after my neighbor's dog while they're away on vacation. He's a bulldog named Rusty, and even he looks tough, he's very friendly and playful. However, he had this bad habit of pulling on things. And this is where the trouble started. A couple of years ago, I had a bad habit of my own. Whenever I sat or laid down, my undies would stick out of my pants. My parents would try to break this little habit by tugging on them-just a little, not like a full wedgie-to let me know to tuck them back in. Well, one day after Rusty saw my mom tug my (bright orange) panties to let me know they were sticking out, he hopped up on top of me while I was lying on my stomach on our living room couch, he saw my undies and grabbed them with his mouth. I won't be forgetting the feeling of Rusty's face going in between my buttcrack any time soon, let me tell you... *ahem* Anyway, he started yanking and tugging my underwear hard and fast while I was yelling at him to let go. My mom couldn't help because she was too busy laughing. Eventually, I started laughing even though he was ripping my panties to pieces. When he finally tore them off completely, I was just laughing and laughing. I couldn't believe that actually happened to me. But in spite of that incident, I still loved Rusty and took him for a walk. And even though he had opportunities later, Rusty had never wedgied me since that day.\"</i><br>\r\n<br>\r\nAlida giggled. \"Wow, I never got a wedgie from an animal. I'm a little jealous, actually\".<br>\r\n\"Yeah, well, the first few minutes are no picnic\", Lucy said. And then she let out a big yawn. \"Man, I'm bushed. It'll be nice to sleep in a bed again after a week on that flagpole\". She crawled under the covers of the princess' bed. \"Goodnight, Alida\".<br>\r\n\"Goodnight, Lucy\", Alida said, joining her in bed. She turned out her lamp and the two girls drifted off to sleep.   </span></div></div>",
            "created":1551210300,
            "id":2623409,
            "title":"Naughty Dog"
        },
        "123":{
            "author_id":"justafanofit",
            "author_name":"ThatFanOutThere",
            "choices":[
                "She leaves to go and receive wedgies in town",
                "She decides to let some maids get their revenge for treating them poorly often.",
                "She invites some friends to have a \"good time\""
            ],
            "content":"<div class=\"\"><div> <span>Before Alida could sit down, her underwear still over her head, she felt her panties shoot up her rear once again, lifting her into the air, but leaning he forward, her face colliding with a plate of food. Two maids had come over and grabbed her panties as the lowest part possible, and began bouncing her above her seat.<br>\r\nAlissa yelped in surprise, pain, and pleasure as she wa given another wedgie. As she had one hand trying to hold the table to stop the wedgie from getting worse, her other hand wiped the food she had landed in off her face. She could hear snickering and chuckling from people all over the table, and would have lowered her head in embarrassment if it wasn't stuck with her ass in the atomic bouncing wedgie.<br>\r\nTalking could be hear behind her, and the next thing Alida knew, the people holding her panties stopped bouncing her and began to carry her away from the table. She then found herself sitting on her knees on the throne her parents gave her. Her face was to the back of the throne, and her backside to the crowd of people behind her, showing how painful her wedgie actually was. As Alida sat in her atomic wedgie, hands holding on to the arm rests, she felt another group of hand grab her panties. But instead of bouncing her again, they removed the panties from her head. She sighed as she felt the waistband left her forehead, but let out a shrill of surprise as the panties shot up her rear once again, going past her head. Alides knew where this was going, as she tilted her head up to see the hands lift her panties to the top of her tall throne where two hooks lie, and were put through both of her leg holes. Her mother had those hooks installed on her throne for purposes such as this. Her mother had hooks installed on her own throne as well, when she felt like having similar treatment to her daughter.<br>\r\nAlida turned her head to her parents' thrones, and had to do a double take as she saw her mother, the queen, in the same predicament as herself: wearing nothing but a bra and a pair of panties that shot up her ass and past her head to the hooks at the top her own throne, which was taller than Alida's. The princess didn't remember hearing her mother get placed mirror to her, that it came to a surprise to see her there so soon. The queen turned her head to look at her daughter and gave her a wink.<br>\r\nAlida didn't understand what her mother was doing, until she felt something long and hard smack her butt sharply. Alida let out a yelp as the paddle moved away from her ass, only to hit it again, and again, and again. To her side, the princess could see her mother recieving the same treatment. Mother joined daughter as the to let out sounds of pain and pleasure, both losing control of their bladders, as their subjects watched on.<br>\r\nLater that day...<br>\r\nAlida lied in her bed, her face in her pillow and her butt in the air as a maid applied ice to her wedgied region. After her hanging and spanking, she and her mother were passed around the room as their subjects gave them wedgie after wedgie. Alida could barely feel her lower regions from all they went through.<br>\r\n\"There you are, Princess Alida,\" she hears the maid say. \"Just stay like this for the next few hours, and you'll be able to sit down without feeling too much pain.\"<br>\r\n\"Thank you,\" Alida told the maid. \"You may leave now.\" The maid nodding, turning away and walking out the bedroom door. As Alida laid in recovery, she went over in her head how to humiliate herself next...</span></div></div>",
            "created":1424149200,
            "id":1935818,
            "title":"...same as #1 and #2 but the queen gets spanked..."
        },
        "1232":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "They spank her until she can't sit down for weeks",
                "Tie her to the tree at the town center naked, mooning the town",
                "more humiliations"
            ],
            "content":"<div class=\"\"><div> <span>A few hours later, Alida's butt crack was still raw from all of the wedgies she's gotten, but felt a lot better. While she was recovering, she thought of a way to humiliate herself again. Over the years, there were two maids that she was mean to and she decided to let them get some revenge on her. And by revenge she wants them to humiliate her in front of the whole kingdom....again. \"Maid! Can you bring Rose and Alice to me, please?' Alida called to her personal maid. \"Yes princess\" her maid, Vivian, says and rushes to gather the two girls.<br>\r\n<br>\r\nThe two maids, Rose and Alice, entered Alida's chambers. Rose was a tall, busty redhead with blue eyes. Rose used to be Alida's personal maid until she framed her for pranking the queen, which Alida did, for a joke. Alice was slightly taller than Rose and much more muscular. She had long black hair and green eyes. Alice was the palace's horse breaker, and got in an unfortunate incident where Alida rode her pony next to her and gave her a massive wedgie by attaching a rope to her undies.They were both wearing their signature skimpy maid outfits with very short skirts and revealing corsets. Alida looks at them and takes a deep breath before she speaks. \"As you both know, you two are not on very very good terms with me. I've made your lives miserable for a time and I think it's only fair that you get your revenge on me. And maybe after that, we can start fresh?\" She offered. The maids looked at each other and smiled evily. They nodded and walked towards Alida for her punishment.<br>\r\n<br>\r\nAlice took her place behind Alida and Rose stayed at the front of her, each maid taking the waistband of her white granny panties. Alida was so nervous, yet so excited as she was about to get a mega wedgie again. The maids yanked simultainously and the undies shot up into her with great force. Alice had amazing strength from working with horses so its only natural that she's an expert wedgie giver. She pulled the panties so far up into Alida, they felt like they were in her intestines! Alida was squealing in pleasure and pain as she was abused by her underwear again. The sensation in her front end was extreme as her virginity was threatened by her undies. Said undies didn't last very long as they ripped from both ends. Alida fell to the ground in euphoric pleasure and searing pain. The maids weren't done though. They were only getting started with this poor girl's humliation.<br>\r\n<br>\r\nWhat do they do next?</span></div></div>",
            "created":1425013200,
            "id":1941144,
            "title":"She decides to let some maids get their revenge..."
        },
        "12321":{
            "author_id":"sarannalove",
            "author_name":"Littlecookie",
            "choices":[
                "The townspeople spanked her and diaper her",
                "The maid took her back to the castle and diapered "
            ],
            "content":"<div class=\"\"><div> <span>Alice and Rose tied her up in their car and took her to the centre of the town <br>\r\nIn the centre of the town was a table, they set her on the table and put up a sign saying Spank Me<br>\r\n<br>\r\nThe townspeople asked \"Which position?\"<br>\r\nRose said \"whatever way you want but I recommend Diaper Position!!!<br>\r\n<br>\r\nThe townspeople tied her legs up and beginning to spank her<br>\r\n<br>\r\nSuddenly , a man came up and ripped all her clothes off and said , \"This princess should me spanked nake!!<br>\r\n<br>\r\nAnd he threw a pack of diapers to them , \"You might need them</span></div></div>",
            "created":1563101940,
            "id":2686572,
            "title":"They spank her until she can't sit down for..."
        },
        "12322":{
            "author_id":"devow",
            "author_name":"Sparrow",
            "choices":[
                "Hanging a sign above Alida telling everyone to spank her",
                "Leaving Alida alone with the crowd"
            ],
            "content":"<div class=\"\"><div> <span>Alida lay on the ground for a few seconds before the two maids gripped her arms an pulled the princess to her feet. Alice easily ripped Alida's bra off, exposing her D cup breasts. The two then began dragging the poor princess outside. <br>\r\n<br>\r\nAlida looked around as she was dragged along towards the center of town. She watched as many of the citizens began to laugh at her as she was pulled towards a large tree in the direct center of town. Alida didn't question the maids, probably because she already figured out their plan, as they pulled out a length of rope.<br>\r\n<br>\r\nThe maids then gripped Alida by the wrists and forced her arms around the tree, tying her wrists in place as they stepped back to admire their work. They both laughed at the nude princess, whose butt was facing outwards towards the crowd the was forming around Alida. The maids smirked to each other before...</span></div></div>",
            "created":1460610000,
            "id":2133103,
            "title":"Tie her to the tree at the town center naked, m..."
        },
        "123221":{
            "author_id":"cheesepo14",
            "author_name":"J_hicksta",
            "choices":[
                "Wedgie her thong off",
                "Unique her and make her twerk "
            ],
            "content":"<div class=\"\"><div> <span>\"PLEASE SPANK\"<br>\r\n<br>\r\nThe maids walked off giggling and turning around. The princess sat waiting. The townspeople pulled out paddles and took off their belts. They went ham on Alida's poor butt as her butt went from pale,to red,to purple. They pulled out a purple thong and put it on her. The townspeople</span></div></div>",
            "created":1465102800,
            "id":2159324,
            "title":"Hanging a sign above Alida telling everyone to ..."
        },
        "1232211":{
            "author_id":"cheesepo14",
            "author_name":"J_hicksta",
            "choices":[
                "Take her down and make her run through the streets",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Grab her purple thong. They tank it high in the air as she moans. They rip it clean off her body. They</span></div></span></div>",
            "created":1465102800,
            "id":2159402,
            "title":"Wedgie her thong off"
        },
        "12323":{
            "author_id":"cheesepo14",
            "author_name":"J_hicksta",
            "choices":[
                "They wedgie her until she can't walk for a day",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about</span></div></span></div>",
            "created":1465102800,
            "id":2159401,
            "title":"more humiliations"
        },
        "1233":{
            "choices":[
                "The ambush works (the queen is humiliated)",
                "The queen is on to them (the girls are humiliated)",
                "something else?"
            ],
            "content":"<div class=\"\"><div> <span>Alida invited her friend's, lucy(a cute 18 year old blonde) and sarah(a fiery redhead) over to have fun with the queen. hey Alida what are we gonna do you said we were going to get to see the queen humiliated her friends said. yeah here's the plan she said and then whispered to her friends. she had a maid tell her mom that she need to see her right away and then the girls got in position to ambush the queen</span></div></div>",
            "created":1508475600,
            "id":2403808,
            "title":"She invites some friends to 'play' with the queen"
        },
        "12331":{
            "choices":[
                "wedgie and spank her?",
                "some other humiliation?"
            ],
            "content":"<div class=\"\"><div> <span>The queen walks into her daughters dark room, \"Alida where are yoaaah\" she scream as she is quickly tackled stripped to her underware and has both her arms and legs handcuffed the light switches on and the queen sees her daughter and the two girls smiling evily at her. \"what should we do to her first?\" asks Sarah</span></div></div>",
            "created":1508475600,
            "id":2403811,
            "title":"The ambush works (the queen is humiliated)"
        },
        "123311":{
            "choices":[
                "\"we'll let you go if you agree to do a dare for each of us\" says Alida",
                "they let her go (maybe she wants revenge?)"
            ],
            "content":"<div class=\"\"><div> <span>\"yeah lets wedgie and spank her\" Alida gets behind her mom and starts pulling hard on her childish teddy bear granny panties trying towards her head \"ha nice panties mom\" Sarah starts spanking the queen\"nice ass your highness\" she says. The queen is screaming for them to stop as Lucy gropes her breast. \"Lucy help me get these over her head\" says Alida. Lucy starts helping and they are able to get it over her head putting her in an atomic. They each take turns spamking her and pulling on her panties. \"ok girls\" the queen says with a red face and now even redder tush \"you had your fun now can you please let me go\" \"hmm maybe...\"says Alida.</span></div></div>",
            "created":1508475600,
            "id":2403815,
            "title":"wedgie and spank her?"
        },
        "1233111":{
            "choices":[
                "Lucy \"you need to masturbate for us\"",
                "Sarah, dare is readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"ok ill do the dares, what are they\" says the queen feeling defeated and seeing no other way out. \"well one of you can go first\" says Alida \"so whos first?\"</span></div></span></div>",
            "created":1508475600,
            "id":2403817,
            "title":"\"we'll let you go if you agree to do a ..."
        },
        "12331111":{
            "choices":[
                "1: public humiliation",
                "2: please the girls including her own daughter"
            ],
            "content":"<div class=\"\"><div> <span>Lucy takes off the queens bra and slides her panties down her legs and says \"ok your highness your going to masturbate for us, sense your already wet from this anyways\" the queen notices this herself and blushes but decides its better to get it over with. She starts fingering herself as they all watch her it amkes her super embarrassed and maybe a little turned on to have them watching her do something so private and after awhile she has a huge climax. \"ok now you get to dare her Sarah\" says Alida. Sarah says i let you pick out of two dares wich you want to do\" 1: you can go out in the town still handcuffed and wearing nothing but your panties    with a gag in your mouth and see what your subjects reaction will be? or 2: you can eat out each of us starting with your daughter the princess?</span></div></div>",
            "created":1508475600,
            "id":2403819,
            "title":"Lucy \"you need to masturbate for us\""
        },
        "123311111":{
            "choices":[
                "townsfolk take advantage of the queen and make her do many humiliating things",
                "the royal gaurds intervene and put the three girls in that position instead "
            ],
            "content":"<div class=\"\"><div> <span>she agrees to go into the town bound and gagged in only her panties as its better then having to do such a thing to her own daughter. shes walking through the town with the girls at her sides as townsfolk comment on the queens current state some saying she must like humiliation just like her daughter and then someone asked Alida \"princess why is your mother doing something like this?\" thinking on her feet and seeing an opening to worsen her mothers humiliation Alida replied \" the four of us had a bet and the loser had to be like this in town for 3 hours and allow you townsfolk to do and or make her do anything and everthing you want to her during that period and my mom just happened to be the loser\"</span></div></div>",
            "created":1508475600,
            "id":2403823,
            "title":"1: public humiliation"
        },
        "1233111111":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Some wedgie foreplay with all three girls",
                "Wedgie bondage with only Alida"
            ],
            "content":"<div class=\"\"><div> <span>The next few hours were complete an utter torture for the queen. The townsfolk took compete advantage of the queen's vulnerable state and made the queen do an array of humiliating things, all of which were hilarious to the three young girls. The first hour consisted of each villager giving the queen a wedgie of their choosing. Some merely gave a hard tug of the queens embarrassing underwear, others pulled at the front, but mostly gave the queen unique wedgies that made her cry into her gag. From atomic, squeaky clean, bouncing, dragging, messy, gang wedgie, etc. By the end of it all, the fabric had some how not ripped but instead stretched to it seemed the Queen had a parachute coming out of her dress.<br>\r\n<br>\r\nThis situation is what lead to the second hour of her humiliation. The villagers then decided to play a game of tug of war, using none other than the queens panties. After the first few minutes of preparation, the game began. The front and back waistband were threaded through iron rings that had been attached to two different trees, the back going through the ring on the left tree and the from ton the other. The villagers would pull their respective fabric through until there was a winner. Who was that decided? Simple. The queen acted as the halfway marker and which ever tree she'd tough first that side would win. The Queen was in agony the entire time. After the first few pulls from both sides, she was hoisted in the air in a tandem wedgie and the constant back and forth of the fabric on her lower half made for a miserably squeaky clean. After an hour though, their was no winner as the queen had stayed in the same spot for the entire game.<br>\r\n<br>\r\nThe last hour was the worst however. Alida thought that since there was no winner, that both teams should share in a victory. The queen then found herself in a cocoon wedgie, the ridiculously long fabric wrapped around her body at least 20 times, before she was hoisted up and planted on a firm branch keeping her in place. The townsfolk then began to give the queen a smack on her plump rear, enticing a squeal from the panty masked leader. After the last person of the 200 person kingdom had delivered a loud smack to the hanging queen, the hour was up. The queen was left with a dark cherry red backside, the mask of fabric slightly wet as the queen had cried after the first 20 hits to her backside. Alida, Sarah and Lucy all smiled as the Queen hanged by her wedgie.<br>\r\n<br>\r\n\"Ok mom.\" said Alida \"You're almost done, now it's my dare. You got two choices. Which will it be?\"<br>\r\n<br>\r\nWhat does the Queen choose?</span></div></div>",
            "created":1514610000,
            "id":2434325,
            "title":"townsfolk take advantage of the queen and make ..."
        },
        "12331111112":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "content":"<div class=\"\"><div> <span>\"Well, it's been fun girls but I think I'm going to call it a day.\" said Alida<br>\r\n<br>\r\n\"Yeah same here.\" said Sarah<br>\r\n<br>\r\n\"Yeah, it's be great, but if I don't get back by sundown my mother will tan my hind.\" said Lucy<br>\r\n<br>\r\n\"Well, see you guys.\" said Alida as her two friends left the castle<br>\r\n<br>\r\nAlida smiled as she went back up to her room. She enjoyed the time she spent today with her friends embarrassing her mother. Speaking of which. AS Alida made it back to her chambers and got ready to dress for the evening, she heard a faint moan come from her closet. Alida smiled and walked over to the closet door. She opened the door to reveal none other than the Queen herself in quite the predicament. You see, after the Queen agreed to the bondage with only her daughter, Alida had dragged her mother to her room and gave her the most creative wedgie she could think of. She had first blindfolded and gagged her mother so she could not see or draw attention to herself. Alida than had her mother get on the floor on her knees and gave her mother a double sided atomic wedgie. But she was far from done. She then gave the Queen a jock-lock wedgie, while still being in the double atomic. She got her mother's long legs through the massively stretched fabric and tied her ankles together, ensuring that she wouldn't go anywhere. She then carried her mother with some difficulty to her closet, where she tied a rope through the front leg holes and places her mother on a stool for positioning. After a looping of the rope through the hook in her closet (Alida would use it sometimes for her own enjoyment), tying the rope to the strong handle to make sure the rope was taunt and a kick of a chair later, the Queen then found herself in a double atomic/jock-lock/frontal hanging wedgie combo that her daughter named \"The Helpless Wedgie.\" Alida then told her mother she'd be back after she finished hanging out with her friends. That was 4 hours ago.<br>\r\n<br>\r\n\"Well, it seems your still where I left you.\" said Alida with a smirk. She then gave her mother a slight push, causing the Queen to sway and moan more. Alida then looked at the front of her mother's panties and grinned at the massive wet spot.<br>\r\n<br>\r\n\"Well, it seems you've enjoyed yourself.\" said Alida \"Then I guess you'll be happy to know that you'll be staying in this for a little while longer.\"<br>\r\n<br>\r\nMMMPPPHHH!!!\" a muffled scream came from the Queen.<br>\r\n<br>\r\n\"What? I never said I'd let you go once I came back. See you in the morning mom.\"<br>\r\n<br>\r\nWith that, Alida shut the door, ignoring her mother's muffled cries and went to bed. She knew that in the morning there'd be repercussions for her actions, but honestly she couldn't wait. Heck, she wouldn't be surprised if her mother did the same thing to her that she's in know. But that's a story for another day.</span></div></div>",
            "created":1521608400,
            "id":2467327,
            "title":"Wedgie bondage with only Alida"
        },
        "125":{
            "author_id":"colinand10",
            "author_name":"Ctbomd",
            "choices":[
                "Wedgie me"
            ],
            "content":"<div class=\"\"><div> <span>She sits down taking her panties off her head,” ehm I’m so thankful that I was able to bring some entertainment to you all,” Alida, and everyone else, starts eating. After breakfast was over everyone left, except Alida and her mom,” my little girl since your 18 now I decided to give you personal butler, and you will get to meet him now, come in young man,” instantly a boy around Alidas age came in wearing a butler suit, he had dyed bright yellow hair, and green eyes,” hello mam,” he said bowing with a hand over his heart, Alida replied,” hello there how are you,” he gave a thumbs up Alidas mom spoke up,” he will do whatever you ask him to do unless what you ask is against the law, I also told him everything about you,” Alida suddenly realize,” ooohh so that’s why he’s not surprised to see me in my panties,”,” yes now I’ll leave you to get to know him,” Alidas mom left to do her stuff,” I should have introduced myself I’m Jack Alvie, so what do you want to do.”</span></div></div>",
            "created":1547874000,
            "id":2605022,
            "title":"...She decides to do this appropriately now"
        },
        "1251":{
            "author_id":"colinand10",
            "author_name":"Ctbomd",
            "choices":[
                "Spank me in public ",
                "Give me a flag pole wedgie"
            ],
            "content":"<div class=\"\"><div> <span>Jack wasn’t even surprised and just went behind her, grabbed her panties, and just yanked lifting her off the ground, and moaned loving every second and harder he pulled getting her panties above her head, and snapped them over hernose like they were before,” oh that was a good one,” Alida said arousment in her voice,” now I want you to-</span></div></div>",
            "created":1547874000,
            "id":2605030,
            "title":"“Wedgie me”"
        },
        "12512":{
            "author_id":"colinand10",
            "author_name":"Ctbomd",
            "content":"<div class=\"\"><div> <span>Jack again wasn’t shocked, he grabbed her hand, and brought her outside to the flag pole,” you sure about this,” he asked having her panties on the hook,” Alida smiled,” yay I want to taste my panties,” her Butler smiled, and shrugged,” okay then,” and pulled her to the top. People turned laughed at her, and she loved it. After 10  minutes of hanging she said,” okay I’d like to get down now,” her butler brought her down,” have fun up there miss,” he asked,”oh yes I can now taste me panties, and I love it, and I love you for helping, she then kissed Jack on the cheek,” if you want as a reward you can wedgie me, and feel my butt all you want.</span></div></div>",
            "created":1548046800,
            "id":2605582,
            "title":"Give me a flag pole wedgie"
        },
        "13":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "#1",
                "#2",
                "#3",
                "#4",
                "#5"
            ],
            "content":"<div class=\"\"><div> <span>Alida squeals as she feels a pang in her bladder, and she quickly clamps both of her hands on her crotch. <br>\r\n<br>\r\n\"Could you fetch me one of my short dresses, preferably a white one?\" Alida asks her maid as she squirms in desperation.  Her maid nods her head and grabs a white sun dress that has a habit of becoming see-through when wet.<br>\r\n<br>\r\nAlida quickly pulls it over her, not even bothering to put on a bra, and she walks to the door with one hand firmly gripping her crotch at all times.  Slowly but surely, she makes her way down the royal staircase, and into the dining room, where her mother and several other guests are currently eating.<br>\r\n<br>\r\n\"So nice of you to join us.\" The queen calmly says, \"Are you ready for the big news?\" <br>\r\n<br>\r\nAlida nods her head as she sits down, her dress gets hiked up a bit, giving everyone a good view of her upskirt.<br>\r\n<br>\r\n\"We have just finished building a magnificent ship, and is currently waiting in the docks for her maiden voyage, the Captain has asked humbly If we were to join her in the voyage.\" The queen states with a grin.<br>\r\n<br>\r\n\"It would be my honor.\" The Captain humbly says as she gives a bow to the queen.  She was a breath-taking woman, tall, curvaceous, fit, and clad in a pure white sailor outfit to represent her status in the chain of command.  She wore her long brown hair in a simple yet elegant braid down the straight of her back, and her uniform left little to the imagination. Alida giggles quietly as she could easily make out panty lines sporting from her pants. Yet Alida could make out a tone of pride within her voice, as if she thought she were better than everyone else.<br>\r\n<br>\r\nAlida stands up and is about to reply, yet she is cut off as the queen adds \"Just think about it, miles and miles of water, nothing but water.\"<br>\r\n<br>\r\nThat was the exact thing she needed to say to release the flood gates.  Alida subconsciously closes her eyes and relaxes her bladder, and pee floods through her fingers and soaks her dress and panties.  Alida let out a small gasp as she blushes furiously, for her pee began to make her dress completely see-through.  After several moments of absolute silence from the shock.<br>\r\n<br>\r\nThe queen giggles and says \"I'll take that as a yes.\"<br>\r\n<br>\r\n<br>\r\nTime passes on and the ship has long since set sail, to be accurate a few days. And Alida is bored out of her mind, she's already humiliated herself in many different situations and has already stolen the pants of every crew member to show off their panties. Except for one woman, the Captain.<br>\r\n<br>\r\nOh this will be a challenge for her. For she is in her private quarters for most of the time, yet Alida is feeling lucky today. And she embarks over to the room. After narrowly dodging several crew women, she makes it to the door and puts her ear up to it to listen through it. Sure enough, she hears the Captain's breath. And she slowly opens up the door to find...<br>\r\n<br>\r\n#1:  The Captain, bound and massively wedgied in a humiliating manor, yet it seems there is a mark of Pirates imprinted on her right cheek.<br>\r\n<br>\r\n#2:  The Captain clad only in a pair of panties, facing away from the door and bent over while rummaging through her drawers.<br>\r\n<br>\r\n#3:  The Captain who was waiting for Alida.  It's an ambush!<br>\r\n<br>\r\n#4:  Awkward situation involving her mother and the Captain<br>\r\n<br>\r\n#5:  Just the Captain, sleeping peacefully in her bed, snuggling a little teddy bear. Completely vulnerable I should add.<br>\r\n</span></div></div>",
            "created":1426482000,
            "id":1949227,
            "title":"#3"
        },
        "131":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "\"Ehh, sure, I'll need the help.\"",
                "\"Naw I'll just leave you here, I can take care of it!\""
            ],
            "content":"<div class=\"\"><div> <span>\"MMMPH!\" The Captain groans through her gag as she is straddled over her bed.  Alida gasps in surprise as she examines the Captain further.<br>\r\n<br>\r\n Her hands and feet are tied to each end of her bed, making her body facing down on the bed and spread out.  Yet that's not the worst of it. She has been stripped down to only a pair of baby blue panties with frilly white trimming around the leg holes and waistband, and are currently yanked up and snapped over her nose in a fierce atomic wedgie. On her right buttcheek there is a skull and crossbones written in black ink. A rope is threaded through the middle of her undies as is pulling up hard and is forcing her butt up in the air, allowing Alida to examine further. Alida giggles as she finds that a large dildo is currently shoved deep up the Captain's ass, only being pressed deeper with her massive wedgie.  Alida then notices her undies are quite dark at her crotch, and she prods her crotch with two of her fingers. Alida grins as she feels the Captain dripping with pleasure. And she rubs up and down, making the Captain squeak in surprise, and she lets out a soft moan through her gag as her legs go loose.<br>\r\n<br>\r\nAlida rubs harder and harder. Getting more and more moans from the Captain, and right as she feels that the Captain is about to explode in pleasure, she arubtly stops, getting a groan of annoyance from the Captain. Alida walks up to the Captain's head and sees her name written on the tag of her panties \"Elizabeth.\" Alida giggles \"Elizabeth, I wanna hear you beg for this.\" Alida orders as she removes the gag. The Captain blushes, for not only has her name been known, but she knows exactly who's doing this, even if she can't see her.<br>\r\n<br>\r\n\"Quick! Warn the others! There are pirates on this ship!\" Elizabeth exclaims as she struggles at her bindings. <br>\r\n<br>\r\n\"No, not yet, let's get finished here first.\" Alida purrs as she walks back behind Elizabeth. Gripping the middle of Elizabeth's panties she yanks up hard. Getting a girly squeal from Elizabeth. \"Now beg.\"<br>\r\n<br>\r\n\"P-please, make me cum.\" Elizabeth begs. <br>\r\n<br>\r\n\"That's more like it.\" Alida giggles as she begins to play with the dildo.  Elizabeth let's out a shrill moan as the dildo is quickly pulled out and thrusted back in, making her buck her hips against her wedgie and bindings.  Alida continues her toying as Elizabeth's moans get louder and louder. Suddenly Elizabeth's eyes close and she goes completely limp, and she fully orgasms, filling her undies with cum<br>\r\n<br>\r\nAfter a few moments of stillness Elizabeth finally says \"Now that's over with, could you let me out so we can deal with the Pirates?\"</span></div></div>",
            "created":1427086800,
            "id":1953024,
            "title":"#1"
        },
        "1311":{
            "choices":[
                "They see the crew being humiliated",
                "They get grabbed",
                "Elizabeth becomes desperate to pee"
            ],
            "content":"<div class=\"\"><div> <span>Alida smiles and pulls the sex toy out, and undoes the bindings. Elizabeth weakly crawled out of bed. Her panties were a sopping mess, and were forming a camel toe. <br>\r\n<br>\r\n\"J-just give me a minute.\" Elizabeth takes a moment to rifle through her drawer. To her horror, the pirates had stolen all of her clothes save her panties. Blushing, she took off her ruined blue panties, and put on a pair of pink panties with similar white trimming. Alida becomes curious and leans in closer. <br>\r\n<br>\r\n\"What cute trimming!\" Playfully, she runs her hands the trimming, flicking them back and forth. Elizabeth blushes as the princess plays with her underwear. \"Princess please!\" She pleads as Alida takes a minute to fondle her panties. <br>\r\n<br>\r\n\"There so cute though!\" She stops as Elizabeth puts on a bra, pink with the same trimming. \"I didn't know you wore such cute panties!\" <br>\r\n<br>\r\n\"It was laundry day.\" Elizabeth bashfully answers. Both Captain and Princess start moving out of the cabin and towards the deck. Elizabeth is having trouble walking, her previous humiliation has made her weak in the legs. Alisa enjoys watching the older woman moan and try to keep upright. \"Oh, I think I need to pee too!\" Elizabeth whines as she jams her hands between her legs. <br>\r\n<br>\r\n\"There's no time for the toilet.\" Secretly, Alida wants her to wet herself, and can feel her bladder start to fill too. Slowly, they make their way to the main deck...</span></div></div>",
            "created":1445835600,
            "id":2053051,
            "title":"\"Ehh, sure, I'll need the help.\""
        },
        "13112":{
            "choices":[
                "They arrive at the maze",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, Alida feels a hand grab the back of her panties. Elizabeth squeals as more hands grab her body. Alida feels herself getting jerked back by her underwear. The female pirates enjoy pulling the two captives back down the deck towards their captain. <br>\r\n<br>\r\n\"Well well well, we missed two.\" Scarlet smirks at the two wiggling women. She looks at Elizabeth, \"You got out? Nice panties...I would love to wedgie you again until you peed.\" <br>\r\n<br>\r\n\"W...where are you taking us?\" Elizabeth fearfully asks, trying to avoid flooding her panties. Alida watches but says nothing; she really enjoyed getting pulled around by her underwear. It was a new kind of embarrassment. <br>\r\n<br>\r\nScarlet smiles, \"Humiliation Island my dear Captain.\" She strokes Elizabeth's cheeks(both kinds). The ship rocks for a moment. <br>\r\n<br>\r\n\"Ah, we're here. Come, I want you to try the Humiliation Maze.\" The pirates start dragging the crew off the ship, into the jungle. </span></div></div>",
            "created":1446181200,
            "id":2054579,
            "title":"They get grabbed"
        },
        "1312":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "Fight back against Scarlet!",
                "Give in to Scarlet and let her pirates win",
                "Time to flaunt her panty covered butt and wedgie herself for everyone"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I can take care of myself.\" Alida giggles as she adjusts the ropes so that Elizabeth is sitting upright, the corner of the bed post digging squarely into her vag, and her heels pressing hard on her dildo. Alida pulls on her hand ropes to pull Elizabeth's arms over her head.<br>\r\n<br>\r\n\"W-wait. You're not leaving me like this, right?\" Elizabeth asks, squirming around a bit, only making the corner of the bed dig deeper.  \"Please, h-have mer---\" she gets cut off as Alida puts her gag back on.  Alida laughs and steps back to admire her improvements. Elizabeth is quivering from both humiliation and pleasure, and something else. Yet Alida notices her perky nipples have been completely untouched. Time to change that!  Alida found two large clothes pins in Elizabeth's dresser, and firmly clamps one of them on her right nipple. Elizabeth lets out a loud, shrill squeal in surprise as suddenly her nipple gets pinched. Alida grind and puts the second one on her other nipple, and Elizabeth lets out a low groan, unable to hold back her bladder. She blushes a dark Crimson as pee floods through her panties and hisses as it trickles down the bed post.<br>\r\n<br>\r\n\"I'll come back when I take care of the Pirates.\" Alida says over her shoulder as she walks out the door, yet Elizabeth is too distracted to notice her leaving.<br>\r\n<br>\r\nAs soon as Alida stepped out, the first thing she noticed was that the boat was deathly silent, there was no sound of gulls up on the crows nest, nor the sound of banter between sailors. Only the howling wind could be heard, and a gust of wind blows up Alida's skirt, showing off a pair of yellow panties with little ponies printed all over, and with frilly purple trimming around the waistband and legholes. Alida noticed that her skirt made noise when it billowed in the wind, so to remove all sound, she removed her skirt and shirt so that all was left was her undies and a pair of frilly white socks that reached the mid of her thighs. <br>\r\n<br>\r\nQuietly she crawled through a porthole of the ship, she felt she was about to pop through, yet as soon as her hips reached the hole, she was stuck.  <br>\r\n<br>\r\n\"Help!\" Alida called out as she squirmed against her wooden prison. \"I'm stuck!\" <br>\r\n<br>\r\n\"Well well, what do we have here?\" A malicious voice sounded from behind her, Alida gasped as she felt a slender hand grip the back of her panties. In one quick tug the soft yellow fabric dissappeared and shot up Alida's cute butt.  Alida lets out a squeal as she feels her undies dig deep up her ass, and she squirms harder. Yet a pair of hands grabs her by her legs and pulls her out. As soon as she regains her senses, she realizes she is at the feet of a towering woman. She looks up and sees she is in the presence of the dreaded Captain Scarlet.<br>\r\n<br>\r\n\"Heh, you must be the queens little girl.\" Scarlet laughed as she lifts Alida into the air by the back of her undies with one arm. \"You must want to see her, right?\" She asks coldly. \"Please. 'Your Highness' allow me to bring you to her.\" Scarlet mocked as she carried Alida to the main hall of the ship. <br>\r\n<br>\r\nAlida gasped as she realized how bad the situation really was, all the sailors were stripped to their panties and are bound with thick ropes, and pirates are swarming all over the place. But that wasn't the worst of it, her mother was at the other end of the room, she hanging by her feet upside down. Her dress has flipped over and is covering her entire upper body, yet is fully exposing a pair of light pink panties with little darker pink hearts all over. Two weights attached with rope are tied to the front and back of her panties and are dangling several inches off the floor, pulling immensely on the queens panties.  Alida knew from the start how much pain the queen was in. And she called out to her.<br>\r\n<br>\r\n\"A-Alida?\" The queen responded softly. \"D-don't look\". She begged as she had finnally lost control of her bladder, pee dripped down and ran up the queen, soaking her panties and her dress thoroughly with her own urine.  The crowd of pirates roared with laughter, as the queen was utterly humiliated, one of the Pirates gripped her dripping dress and tore it away, exposing the queens shimmering, naked body and her crimson face, tears dripping down from her pain and embarrassment.<br>\r\n<br>\r\n\"Get a good look girly, you're gonna be next after her.\" Scarlet laughed. Alida never got a good look at her, and she examined the fearsome pirate. She was aboslutely stunning. Her scarlet red hair was tied into two neat braids that reached the back of her thighs. She wore a navy coat that had a deep V to expose a lot of cleavage of her large bosom and a pair of pale yellow britches that clung loosely to her large 'pirates booty' (sorry, I've been holding that pun in for while) and was wearing a pair of knee high brown leather boots.  Yet something caught Alida's eye, a frilly pink hem just barely peeked from out of her britches. And Scarlet was too distracted as she watched her fellow pirates paddle your mothers butt.  Now is the perfect opprotunity.</span></div></div>",
            "created":1427259600,
            "id":1953978,
            "title":"\"Naw I'll just leave you here, I can ta..."
        },
        "13121":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "They happily leave, now with a now pathetic wedgie girl by the name of Scarlet",
                "They see Alida as the new captain, will she accept this new role?"
            ],
            "content":"<div class=\"\"><div> <span>Filled with absolute rage, Alida quickly grips the sides of Scarlets pantaloons, and yanks them down to her ankles. Everyone in the room goes completely silent in shock. Then a roar of laughter explodes from the crew as they find that their captain is wearing a pair of incredibly embarrassing undies. Clinging tightly to her was a pair of light pink panties, there was incredibly frilly pink trimming all around the waistband and legholes, and tiny little teddy bear faces are printed all over the pink fabric, along with two large red hearts with the word \"Princess\" written inside on her butt and crotch. Instantly Scarlet's face turns as red as her hair as she is abosultly lost for words.<br>\r\n<br>\r\n\"Nice undies, Princess!\"<br>\r\n<br>\r\n\"What are you, four years old?!\" Her crew mocked.<br>\r\n<br>\r\n\"N-no, they arnt mi---EEEP!\" Scarlet squealed as she bent over to pull her pants back up, yet she is cut off as Alida yanked fiercly on the back of her panties, making her lose her balance and fall forward, making her hang by the back of her panties.<br>\r\n<br>\r\n\"Really? Because the name on your tag says otherwise.\" Alida giggles as she pulls harder to show off the tag, creating a new uproar of laughter.  Scarlet's eyes roll to the back of her head as she pathetically clings to her crotch in hopes of stopping the pain. And then her first mate walks forward. She is a tall, beautiful, dark skinned woman, and is several inches taller than Scarlet herself. <br>\r\n<br>\r\n\"Here, lemme take her.\" She purred happily as she takes Scarlets waistband and heaves up harshly. Scarlet lets out a squeal that is soon muffled as her face gets buried in her first mates vag, her arms wrap abound and squeeze the woman's large buttcheeks.  <br>\r\n<br>\r\n\"Alright girls, let's have some fun.\" Her first mate said with a grin as she holds Scarlet in that position while the other crew women begin to swarm. Almost instantly Scarlet's coat gets torn off, letting her large boobs free, while at the same time, several girls have fetched paddles and began to paddle their captains butt until they can get the same color as her hair.<br>\r\n<br>\r\nScarlet lets out muffled moans of pain and humiliation as her poor butt keeps getting assaulted, and suddenly she lets out a shriek as her nipples get painfully twisted In two massive titty twisters.  Her first mate laughs as she begins to bounce her up and down, sending the pink fabric deeper and deeper up her ass with every bounce.<br>\r\n <br>\r\nSuddenly Scarlet lets out a low groan as she grips tightly to her first mates' cheeks. Her first make signals everyone to stop, and as they do, a small patter of liquid drips down Scarlets legs, the patter grows into a full stream as she fully wets herself. Everyone is absolutely silent until she finishes. <br>\r\n<br>\r\n\"Ha, I can't believe it, the little girl pissed herself too.\" One of the Pirates laughed, soon everyone joins in. The first mate then yanks up harshly on the front of Scarlet's now dripping panties, and snaps them into a frontal atomic.<br>\r\n<br>\r\nAlida felt happy now that revenge has been served. Yet there is still one pressing matter, the rest of the pirates.</span></div></div>",
            "created":1427778000,
            "id":1956671,
            "title":"Fight back against Scarlet!"
        },
        "132":{
            "choices":[
                "Grabbed the woman's panties",
                "Squeals as the Captain turned around",
                "Had a sudden, desperate urge to pee"
            ],
            "content":"<div class=\"\"><div> <span>Alida could not believe her luck. There was the captain, bent over and facing away from her. She is wearing a tight pair of panties, colored like the navel ensign that flew over the ship. The princess could make out the outline of the Captain's bra. She seemed to be going through her drawers, maybe finding more clothes to wear. <br>\r\n<br>\r\n<i>Now's my chance!</i> As quietly as she could, Alida crept towards the captain. She longed to grab the older woman's panties, and yank them. Or better yet, pull the woman around by her panties, helpless and embarrassed. The princess came up slowly behind the captain and... </span></div></div>",
            "created":1445749200,
            "id":2052522,
            "title":"#2"
        },
        "1322":{
            "choices":[
                "Alida makes it to the door",
                "She gets grabbed by her panties!"
            ],
            "content":"<div class=\"\"><div> <span>\"Ah!\"<br>\r\n<br>\r\nAlida jumps up in surprise as the Captain turns around and looks at her with a devilish smile on her face. <br>\r\n<br>\r\n\"I figured you would try to give me a wedgie my dear princess.\"<br>\r\n<br>\r\nGiggling, Alida started to hop on her feet in both a sign of nervousness and excitement. The captain grinned as she moved closer to the princess. \"Your mother said I could discipline you!\"<br>\r\n<br>\r\nAt this, Alida jumped out and ran for the door, but the captain was faster and blocked her path. Alida started to run around the room while the captain started to chase her. <br>\r\n<br>\r\n\"I'm gonna catch you!\"</span></div></div>",
            "created":1491454800,
            "id":2300742,
            "title":"Squeals as the Captain turned around"
        },
        "13222":{
            "author_id":"lildude",
            "author_name":"Tyrone",
            "choices":[
                "Happy for her daughter",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>She felt two hands grab her panties she turns head toward the captain or Elizabeth and acting as scared as she could said, \"Oh please don't give me a wedgie, I promise to be a good girl from now on.\" Elizabeth just smirked and said, \"Sorry but when you try to wedgie me you have to be punished with a wedgie and a spanking.\" With out anymore words she rocketed Alida's panties up her poor butt getting them to the back of her head. \"Let's see if e can get them over your pretty face, Your Majesty.\", mocked Elizabeth. Elizabeth pulled the panties further up until they were two feet above Alida's head. Then Elizabeth pulled the panties downward hooking them under Alida's chin making her moan in pleasure. Elizabeth grinned and said,\"Alright time for a spanking with a paddle.\" When she mentioned a paddle Alida got more wet then she already was. Elizabeth dragged Alida behind her desk where Elizabeth sat on the chair behind it before pulling Alida across her lap. She then grabbed the paddle by her desk that she keeps in case one of her crew-mates get of line. \"Alright I'm going to give you 100 spanks.\", Elizabeth said looking at the big, bouncy, pale ass of the princess. *SLAP*SLAP*SLAP*SLAP*SLAP*SPANK*SPANK*SPANK*SPANK*SPANK*SPANK*SPANK*SPANK*SPANK* SPANK*SPANK*SPANK*SPANK*SPANK*SPANK*<br>\r\nSPANK*SPANK*SPANK*SPANK*SPANK* The first 25 spanks were hard and painful but still pleasurable none the less. The next 25 were soft love taps. Then it went back to hard and painful.And finally ended as soft love taps. Elizabeth softly rubbed Alida's burning bottom cooing into her ear saying sweet nothings to the girl she fell in love with on site. Elizabeth,\"Um Alida I have something to tell you, I fell in love with you the moment I saw you will you be my girlfriend? Alida moved the waistband to under her nose and said, \"I would love to.\" Elizabeth smiled and sat Alida up in her lap and kissed her square on the lips.<br>\r\nHow did the queen feel about this when they told her?</span></div></div>",
            "created":1491454800,
            "id":2300818,
            "title":"She gets grabbed by her panties!"
        },
        "1323":{
            "author_id":"delly74",
            "author_name":"Delly74",
            "choices":[
                "Suddenly, the crew comes in and sees her",
                "The captain begins to laugh at her",
                "Alida pulls out her camera and takes a pic of the captain in her underwear"
            ],
            "content":"<div class=\"\"><div> <span>Princess Alida feels a sudden surge of desperation, and she lets out a large spurt of wee in her panties. Her hands leap to her crotch and she holds on tight. Alida wants to humiliate herself, but the captain isn't looking. She decides to purposefully let out a large leak. <br>\r\n<br>\r\nAs she relaxes and pisses herself a bit, a soft pittering sound can be heard on the ground as a long stream of urine trickles from her. The captain whirls around, still clad only in her panties. Alida whines softly, trying hard to halt the flow. But it is too late. The floodgates open, and Alida sets herself fully.<br>\r\n<br>\r\n</span></div></div>",
            "created":1496898000,
            "id":2333136,
            "title":"Had a sudden, desperate urge to pee"
        },
        "133":{
            "author_id":"superguy6060",
            "author_name":"Superguy6060",
            "choices":[
                "The captain hanging wedgies Alida from the top of the mast for the crew to see.",
                "The queen enters the room and sees the situation.",
                "Alida distracts the captain and attempts revenge"
            ],
            "content":"<div class=\"\"><div> <span>Alida stealthily opens the door and slowly creeps inside the room. Since it was night time, she assumed that the captain was asleep and an easy target to prank. She silently creeps into the center of the room and is confused to see that the captain doesn't appear to be in the room.<br>\r\n\"Looking for me?\" a voice behind Alida asks sarcastically. Alida freezes, before she can turn around she is lifted into the air by her rainbow panties. Alida turned her head to see the captain smirk cockily at her. \"your mother told me about your little embarrassment fetish\", the captain said as she started to bounce Alida up and down, drawing a few quite moans from her, \"so i decided to see if she was being serious and it looks like she was\". Alida could only hang in the air by her panties whilst the captain bounced her but even if she could do something, right now she wouldn't have, she was in pure ecstasy. Her enjoyment only grew when the captain pulled down Alida's pants and started to spank and squeeze the girls butt causing Alida to moan louder. After a couple of minutes Alida's butt was now a bright shade of red and her panties were to the back of her head. The captain turned Alida around, still keeping a hold of her panties, and smiled even more when she saw the girls face. The girl was now sweating, eyes nearly closed due to how much she was enjoying her time with the captain.<br>\r\n\"Pl... Please keep going\" Alida whispered in hoarse voice.<br>\r\n\"Don't worry, ill keep going for three very important reasons\" the Captain smirked. She then quickly moved her hand up to one of Alida's boobs and grabbed the center through her top. She then gave a sharp turn, giving Alida a surprise titty twister which caused her to at first yelp but start moaning again soon after. \"Reason number one, that was for messing with my crew\" she said as she finished twisting a couple of seconds later. She then leaned over to her work desk and grabbed an open bottle of water she was going to drink before but didn't get chance because she heard Alida approach. She lifted the bottle to Alida's open mouth and forced her to chug the whole thing. Less than two minutes later the water had its affect and Alida couldn't stop the stream of pee that flowed out of her and soaked her panties and legs. \"reason number two, that's for trying to ambush me\". The captain then laid Alida on the floor but kept pulling on her panties, soon snapping them over her nose, trapping Alida in an atomic wedgie. The captain smiled as she watched the humiliated girl moan and squirm on the floor, obviously having the time of her life. Through the captains enjoyment however, a thought kept crossing her mind. Sure she had fun getting the mischievous girl back but the rest of the crew didn't get any revenge and deserved it more since they had all been pantsed by the girl. \"Hey Alida\" the captain asked, an evil thought crossing her mind \"do you know much about sails?\"</span></div></div>",
            "created":1427086800,
            "id":1952877,
            "title":"#3"
        },
        "1331":{
            "author_id":"hamandcheese",
            "author_name":"Adam Jiffy",
            "choices":[
                "Alida takes a bath while the crew watches.",
                "The crew takes turns spanking Alida."
            ],
            "content":"<div class=\"\"><div> <span>The captain undid Alida's atomic wedgie and the princess took a moment to catch her breath. \"Well Captain, to answer your question, I don't know anything about sails. Why do you ask?\" <br>\r\nThe captain smiled evilly. \"Oh, I was just curious,\" she said sarcastically. \"Say, why don't I teach you?\" <br>\r\nWhile she was talking, Alida was digging her panties out of her butt. \"That's a kind of strange offer. Are you up to something?\" she asked.<br>\r\n\"Oh, I would never do that, Alida,\" the captain said.<br>\r\nIt didn't take a genius to see the captain was lying through her teeth, but on the other hand, if the captain <i>did</i> have a plan to embarrass Alida, there was no way she was going to turn it down. <br>\r\n\"Alright Captain,\" Alida said, \"I'd like to learn about sails.\"<br>\r\nThe captain had a wide grin on her face. \"Wonderful. Let's start now!\" she said, taking the princess by the arm.<br>\r\n\"Wait!\" the princess protested, \"shouldn't I put my pants back on?\"<br>\r\n\"You won't be needing them,\" the captain smiled.<br>\r\n<br>\r\nThe captain guided the now pantless Alida across the deck. Aside from a few snickers, none of the crew laughed at her, which was somewhat disappointing to Alida.<br>\r\nSo either they were all laughed out after the princess humiliated herself so many times, or they were still mad about getting pantsed by her.<br>\r\nWhen they reached the main mast, the boson blew her whistle. \"Captain on deck!\" she declared.<br>\r\nIn no time, the whole crew- and Queen Sofia- had gathered.<br>\r\n\"Attention, crew!\" she announced. \"I have recently learned that all of you have had your pants stolen by Princess Alida.\"<br>\r\n\"Alida!\" the queen scolded.<br>\r\n\"Sorry, mother,\" Alida apologized.<br>\r\n\"Don't worry, Your Majesty. I've come up with an excellent punishment for your daughter, and now she's going to take it like a big girl. Isn't that right, princess?\"<br>\r\nAlida nodded, still completely unaware of what the captain planned to do to her.<br>\r\nAlright then\", the captain said, \"so first, I'm going to hang the princess by her underpants on top of the mast!\"<br>\r\nAlida gasped. Could she really do that?<br>\r\n\"But first\", the captain continued, \"I need to get her up there.\"<br>\r\nWith that, she took a nearby rope and tied it in a tight knot between the leg holes of Alida's panties. When she was finished, she tugged the top to make sure it was secure. As annoyed as she was at Alida, she didn't want her to fall and get hurt.<br>\r\nWhen the rope was secure, the captain called out \"Raise the sails!\" <br>\r\nAs the sails raised, the rope attached to Alida's panties shot up her butt again.<br>\r\n\"Ooohhhhh!\" she yelled in a mix of surprise and pleasure.<br>\r\nThe rope lifted the princess to the crow's nest, where she saw the captain again.<br>\r\n\"How did you get up here so fast?\" Alida asked.<br>\r\nThe captain laughed. \"When you've been on boats as long as I have, you learn the fastest way to any point on board. Now then, let's get you on top of this ship!\" She undid the rope in Alida's underwear and almost immediately hung her on the mast. The princess moaned as the rocking of the ship sent her wedgie deeper and deeper. The captain smiled as she cupped the princess's chin in her hand.<br>\r\n\"Don't worry, Your Highness. You'll only be up here for an hour or so.\" <br>\r\nAnd with that, the captain climbed down, leaving Alida to her punishment.        </span></div></div>",
            "created":1481086800,
            "id":2246934,
            "title":"Raise the Jolly Princess!"
        },
        "13312":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Messy wedgie",
                "Special wedgie"
            ],
            "content":"<div class=\"\"><div> <span>An hour had passed since Alida was hanged from the mast by her panties and she was loving it. The fabric digging into her caused to press into her lower lips beautifully and caused her to experience a huge amount of pleasure. In addition, each time the ship rocked with the tide, it caused the princess to be forced into the wedgie more and more, the fabric making a revealing cameltoe. Luckily, no one could see this or her the heiresses moans being so high up and the tide washing away any sounds that escaped Alida's lips. After the first 20 minutes, Alida had to close her eyes to help prevent from climaxing to early, wanting to enjoy the wedgie for as long as possible. The beautiful view of the open sea was making the wedgie even more enjoyable that she knew would cause her release to come to quick. However, the princess soon found out that closing her eyes didn't help either. By not seeing anything, the feeling of the wedgie was no heightened and made the young princess moan even more.<br>\r\n<br>\r\nTime flew by, as Alida remained to keep her eyes closed. She was now trying to almost push herself into the rainbow-colored fabric, closer to her release as she was now craving it. The young princess was so distracted with her endeavors that she didn't notice the captain had climbed back up to the to pof the mast.<br>\r\n<br>\r\n\"Well, it seems you're enjoying yourself.\" said the Captain<br>\r\n<br>\r\nAlida opened her eyes hearing the Captain next to her. Alida blushed and turned her gaze down to the deck.<br>\r\n<br>\r\n\"So what if I am?\" said Alida<br>\r\n<br>\r\n\"Well, if that be the case, we need to might need to change that. After all this is supposed to be a punishment.\" said the Captain<br>\r\n<br>\r\n\"Oh, really\" said Alida \" What pray tell do you have in mind, Captain?\"<br>\r\n<br>\r\n\"You'll find out soon enough\" said the Captain \" and please, call me Elizabeth.\"<br>\r\n<br>\r\nElizabeth then pulled something from behind her back, a rusty hook attached to one of the many pulleys on the ship. The princess recognized it as one of the pulleys that was used to maneuver huge amounts of cargo on and off the ship. How Alida didn't see it earlier she had no idea. Using her strength and skills she learned over the years on ships, Elizabeth maneuvered the princess off the mast and secured her now to the hook, the panties sinking deep in the hook and causing the princess to squeal into the new position she was in.<br>\r\n<br>\r\n\"Ah, there\" said Elizabeth \"Now just hang on tight and don't go anywhere.\"<br>\r\n<br>\r\nElizabeth climbed back down and left Alida to wonder what the captain had in mind. Her answer soon came as she was starting to descend, the pulley lowering her back to the deck. Alida thought the captain would lower her all the way, but was proven wrong as she was kept a good 3 feet off the ground. The crew became aware of this and gathered around, wondering to know what the captain had planned for Alida.<br>\r\n<br>\r\n\"Alright crew\" said Elizabeth \"Dinner is ready below deck, but beforehand, I thought each of you should share in the princess's punishment. So, form a line and gave the princess a good squat on the behind. Once you do, you can go down to eat.\"<br>\r\n<br>\r\nAlida couldn't believe what she heard leave Elizabeth's lips. A spanking from the entire crew? Alida looked around and a brief smirk appeared on her face that went unnoticed by the all women crew. Alida thinking that this won't be as bad as she thought, Alida began to relax into the hanging wedgie and waited in joy for her spanking to start. Alida though was proven wrong after the first swat, as a tall blond reared her hand back and delivered a loud {/i}, causing the princess to sway forward.<br>\r\n<br>\r\n\"EEEEKKKK!!!\" Squealed Alida, not expecting this kind of strength from Elizabeth's crew as the captain caught the rope holding the princess and stopping the sway all together. This caused the panties to dig harshly into Alida's front so much she made to stop herself from moaning. Elizabeth inspected the young girls backside, smirking at the faint red hand print now decorating Alida's bum.<br>\r\n<br>\r\n\"Nicely done.\" said Elizabeth \"You can go eat now. How's next.\"<br>\r\n<br>\r\nAs the blond left to go to the lower deck to eat and the next women stepped up, Alida knew see has in for a harsh ride. The next few minutes consisted of what seemed like a never ending cycle for Alida. A hard smack would be delivered to her backside, causing her to lung forward and press into her wedgie more and then on the return would be stopped immediately by Elizabeth causing the fabric to dig more into the princess's nether regions. Each spank was different, varying in strength, which cheek was smacked and how far Alida would swing forward. One member of the crew, a strong muscular black-haired women had spanked Alida's bum with so much force, it caused her to swing where if the panties broke would have caused the heiress to go overboard. Fortunately, the rainbow colored panties held up for the entire session. After the last member of the 30 person crew had delivered her spank to Alida and joined the rest down in the lower deck, Alida was left with a cherry red backside, a few tears dripping down her eyes, but had enjoyed the entire thing. It was at this moment, the Queen had came up behind her daughter and spoke.<br>\r\n<br>\r\n\"Well, I hope you've learned your lesson sweetheart.\" said the Queen \"The captain has informed me that she has one more addition to you punishment and then it will conclude. Though, I know you to well Alida. I know that you've enjoyed yourself. I'm happy for you daughter. You remind me so much when I was your age.\"<br>\r\n<br>\r\nSurprised with what her mother said, Alida replied \"You mean, you like this as well.\"<br>\r\n<br>\r\n\"Of course dear, right now I'm wearing a bra-connection wedgie done by the Captain herself. You aren't the only one who loves the feeling of fabric up their backside. So please, enjoy yourself and understand that I couldn't resist.\"<br>\r\n<br>\r\nBefore Alida could ask what her mother meant, the Queen delivered a smack herself to her daughter's backside, causing Alida to sway forward once agin, this time she continued to sway as Elizabeth stood aside to watch the events unfold. The Queen then made her way down to join the crew and Elizabeth now stood in front of the princess.<br>\r\n<br>\r\n\"Ok you majesty,\" said Elizabeth \"I think you 'punishment' is almost finished. Like your mother said you have only one more thing to do before your done for the day and being the nice person I am, you can choose. You can either join me, the crew and your mother in the dining room to enjoy the meal, but you have to eat it out of your panties in a messy wedgie or you can be given put in a special wedgie until I get back from eating.\"<br>\r\n<br>\r\nWhich will Alida choose?</span></div></div>",
            "created":1513573200,
            "id":2429809,
            "title":"The crew takes turns spanking Alida."
        },
        "133122":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Alida joins the crew to eat. More wedgie afterward",
                "Elizabeth lets her down under one condition."
            ],
            "content":"<div class=\"\"><div> <span>Curious about the special wedgie and not wanting to feel food in her panties Alida replied, \"I'm curious. I'll take your special wedgie, providing it's not going to hurt in any way.\" Alida finished as she reached around to feel her backside, feeling the heat from her now cherry red skin.<br>\r\n<br>\r\n\"Oh don't worry princess,\" Elizabeth said \"your mother would kill me if a harmed you severely in anyway. No, this will be all pleasure for you. First things first, time to get you in position.\"<br>\r\n<br>\r\nElizabeth then strolled over to the ropes that operated the pulley Alida was connected to. Alida soon began to rise once again, soon finding herself back next to the top of the mast. Elizabeth quickly climbed up to meet the princess, who was supporting a frown on her face.<br>\r\n<br>\r\n\"Really another wedgie up here?\" said Alida \"Gotta say, I was expecting more.\"<br>\r\n<br>\r\nAlida then became nervous when she noticed the smirk on Elizabeth's face.<br>\r\n<br>\r\n\"Oh trust me Alida,\" said Elizabeth \"this will be much different then before.<br>\r\n<br>\r\nBefore Alida could respond, Elizabeth gripped the front of Alida's panties and drove the fabric upward and now firmly planted the rainbow-colored fabric into Alida's lower lips. Alida moaned at the new found pleasure, bringing a smile on Elizabeth's face as she continued her plan. She then maneuvered the front of Alida's panties over the top of the mast, securing Alida in a front hanging wedgie. Alida was beside herself as she couldn't believe the pleasure she was feeling. The front of her panties pressing inside her created a huge serge of pleasure, that completely masked out any plan she was feeling. In addition, the rocking of the waves recreated the same sensation the young heiress felt before, only better. Elizabeth was glad the princess was enjoying herself, but knew she needed to finish what she started. As, Alida had closed her eyes due to the unexpected pleasure, Elizabeth spoke softly in the princess's ear.<br>\r\n<br>\r\n\"See, I knew you'd enjoy this.\" said Elizabeth\" I'm almost finished. You might want to open you eyes if you want to see the rainbow.\"<br>\r\n<br>\r\nWith that, Elizabeth grabbed the back of Alida's panties and drove the fabric into the princess's fabric once again. Alida's eyes shot open and she gasped at the sudden invasion in her backside. She quickly realized what Elizabeth meant, as the rainbow fabric was quickly secured over the young girl's chin, surrounding the girl's vision in nothing but rainbow colored fabric. Elizabeth leaned back and admired her work. The princess in a frontal hanging/ atomic wedgie was a sight to behold and while she heard the loudest moan ever leave Alida's lips, the sound muffled by the panty mask, the girl hadn't cum.<br>\r\n<br>\r\n\"Well, there you go princess.\" said Elizabeth \"I hope you enjoy yourself. I'm going to eat now. I should be back within another hour or so. Those girls know how to pass the time with stories and I'm sure your mother would have plenty to tell about you.\"<br>\r\n<br>\r\nAnd with that, Elizabeth delivered a quick spank to Alida's emphasized behind, enticing another moan from the girl and made her descent down to the deck and made her way down to have her meal with her crew. After being left alone, Alida began to grasp the complexity of her situation. She was currently in a frontal hanging/atomic wedgie, one that she somehow never thought of giving herself before, and such on top the mast of a ship, left alone as the captain, crew and her mother went to eat. While she did fear other ships passing and afraid the panties might rip, sending her to crash on the wooden deck, located a good 30 feet below her, Alida couldn't possibly care at this moment. The pressure of the wedgie was giving her an amount of pleasure that it was driving her mad. And with each sway of the tide, it caused the girl to swing left and right and be somehow driven even more into the fabric that had fully penetrated her lower lips. Alida moaned into the fabric covering her face, not caring if someone on the ship heard her, she was far to busy enjoying herself.<br>\r\n<br>\r\nTime seemed to go slow for Alida as she lost count for how long she had been hung on top the mast in this wedgie, her release so close but felt so far away. Alida tried to think of someway to her peak when the answer came via nature of the sea. As the ship hit a larger dip in the tide, it caused Alida to swing forward into the mast, the young girls body being pressed against the hard wood. As the ship steadied itself, Alida was driven up slightly against the mast, the hard surface rubbing against Alida in a incredible way that made her moan briefly. It then gave Alida an idea. Alida then began to move her legs back and forth, causing her to be sway back and forth in a her panty swing. When she felt the wood of the mast, Alida wrapped her legs around the mast, her lower lips pressing against the oak wood. Alida then began to grind as much as she could into the wedgie, additionally rubbing herself against the hard wood and bring pressure that was just what she needed. The sea also seemed to want to help, as she dip caused the ship to rub against her more, causing the girl to moan and grind even more. It wasn't until her ministrations caused her to rub against her g-spot on the oak wood that caused Alida to find her release. Alida then lost the feeling in her legs as she climaxed, thrashing into the rainbow fabric the surrounded her body. She rode out her climax as the ship continued to rock and create more pleasure during her release.<br>\r\n<br>\r\nAfter a few minutes, Alida had finally finished cumming. The young girl now laying limp in her wedgie, a now very noticeable wet spot decorating the front of the fabric. If Alida had any of her senses useful at this time, she may have felt the presence of Elizabeth now back at the top of the mast. After leaving Alida in her wedgie, the female captain simply grabbed her meal from the mess hall and left, telling the crew and queen that she'd enjoy her meal in the peace and quiet of her quarters. In reality, Elizabeth had brought her meal with her as she went back up to the top of the mast and watched Alida enjoy her wedgie, using the surrounding ropes like a bench for the female captain. She was surprised to see Alida enjoy her wedgie as much as she did, especially when she began to find against the mast. When Alida finally climaxed, the captain sat shocked, never seeing someone cum that hard in her live. She was initially concerned in the young princess after she finished her release, until she her a moan come from the heiress, indicating she was ok.<br>\r\n<br>\r\nSighing, Elizabeth thought to herself, <i>Man she is like her mother. I remember her when she was Alida's age, embarrassing herself in front of the kingdom. I even remember pulling the Queen's panties a few times when we were younger. Ah, good times. Luckily these two will be around for the next few weeks. Oh all the fun I'll have with Alida, maybe even the queen too. </i><br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1513573200,
            "id":2429832,
            "title":"Special wedgie"
        },
        "1331222":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "She keeps the wedgie in.",
                "She takes the wedgie out."
            ],
            "content":"<div class=\"\"><div> <span>After Alida came down from her wedgie high, she was still in complete bliss. The wedgie in her backside and lower lips still giving her remnants of pleasure as she laid limp in her frontal hanging atomic. She was still unaware that Elizabeth had been watching the entire time. She soon was aware however when the fabric of her atomic was peeled of her face, keeping her in the frontal atomic.<br>\r\n<br>\r\n\"Well, it was good to see you enjoying yourself.\" said Elizabeth<br>\r\n<br>\r\nSmiling, Alida replied \"I gotta say, this was a brilliant idea.\"<br>\r\n<br>\r\n\"Glad you like it, cause I have a proposition for. Originally, I was just going to keep you up here until the crew was done and then you can, but I'd think you'd prefer a hot meal. So, I'm willing to let you down now if you allow me to wedgie and humiliate you everyday until the trip is over. Sometimes it'll be in front of the crew and your mother, other times it'll be just you and me. What do you say?\"<br>\r\n<br>\r\nAlida knew her answer without even thinking. She knew that if Elizabeth could think of creative ideas like this, she'd be enjoying herself every day.<br>\r\n<br>\r\n\"Alright deal.\" said Alida<br>\r\n<br>\r\n\"Excellent, now let's get you down to eat.\"<br>\r\n<br>\r\nElizabeth then grabbed the front of the rainbow colored material and hoisted the princess of the mast, causing Alida to moan due to the new pleasure. Elizabeth then made her way down to the deck, the princess's panties still in her grasp. She smiled as she step down caused a tug that would make the princess squeal or moan in the action. Once they got on deck, Alida dug the wedgie out of her front lips, fixed her dress and began to make her way to the stairs that led to the lower decks. She was stopped halfway by Elizabeth who grabbed her shoulder and leaned down to whisper in her ear.<br>\r\n<br>\r\n\"Now don't think that just because your off the mast means that I won't have a little fun.\"<br>\r\n<br>\r\nWithin a minute, Elizabeth had given the princess a bra connection wedgie. Alida squirmed in adjusting to the wedgie as Elizabeth spoke.<br>\r\n<br>\r\n\"Now, keep that in through dinner and I might just give you a reward. If you don't there will be consequences.\"<br>\r\n<br>\r\nWith that, Elizabeth turned her back to back to the mess hall, Alida quickly behind her.<br>\r\n<br>\r\nWhat does Alida do? </span></div></div>",
            "created":1515301200,
            "id":2437966,
            "title":"Elizabeth lets her down under one condition."
        },
        "13312221":{
            "author_id":"hamandcheese",
            "author_name":"Adam Jiffy",
            "choices":[
                "Got stuck in the mud naked?",
                "Peed yourself in the village square?"
            ],
            "content":"<div class=\"\"><div> <span>Because she didn't want to give Elizabeth more reason to punish her further (and also because she wanted to see what the captain had planned as a \"reward\"), Alida decided to leave her wedgie as it was. <br>\r\nElizabeth entered the mess hall, followed by Alida. It was your standard dining room with a long table in the center. There were a few dozen chairs on the sides, and a big fancy chair in front for Captain Elizabeth. Alida's mother, Queen Sophia, was sitting in the seat closest to the captain's on the left side. The was an empty seat next to her that Alida assumed was for her. She waltzed awkwardly to it and sat down. Elizabeth took her seat after. She then addressed her crew, holding a goblet in her hand as she spoke. <br>\r\n\"Well, my loyal crew mates, since our dear princess was so well-behaved during her punishment, I've decided to let her down early on the condition that she becomes my personal plaything\". <br>\r\n\"What?\" the queen asked, raising an eyebrow.<br>\r\n\"She wants to wedgie and humiliate me for the rest of the voyage\", Alida explained.<br>\r\n\"Ohhhhh...Very well. Just remember to play it safe\", the queen said with her approval.<br>\r\n\"Of course, Your Majesty. Now then, I hope you're hungry, Alida, because Julia is the finest chef we've ever had\".<br>\r\n<br>\r\nAfter Alida finished her meal of Cornish game hen, mashed potatoes, and grape juice, she began to chat with the crew. First, she apologized for embarrassing them by stealing their pants, saying she only did it to have fun (and because she was bored), not because she was being mean. The crew accepted her apology, noting they paid her back by taking part in her \"punishment\". Now, the crew wanted to hear more about her \"adventures\". A brown-haired crew member named Gina wanted to know about one that happened a month ago.<br>\r\n\"Is it true that you once lost your dress at the Royal Ball?\"<br>\r\nAlida smiled and laughed as she remembered.<br>\r\n\"Oh yes, I remember. Believe it or not, it was a genuine accident. The white dress was rigged to come apart when tugged in a certain spot. But I've had it for so long that I'd forgotten about that. So, when the prince from the Remora kingdom swung me around, he accidentally pulled my dress off, leaving me standing in the middle of the ballroom in my white undies with red hearts. And that was how I spent the rest of the evening. It turned that my underwear was the perfect ice breaker\".<br>\r\nThe crew laughed, and another crew member (a blonde one) wanted to hear another story.<br>\r\n\"What about the time you...?\"   <br>\r\n </span></div></div>",
            "created":1521090000,
            "id":2464902,
            "title":"She keeps the wedgie in."
        },
        "133122211":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Alida tells more stories.",
                "Skip to after dinner."
            ],
            "content":"<div class=\"\"><div> <span>\"That was a total case of misfortune,\" said Alida<br>\r\n<br>\r\n\"How you figure that?\" said the blond crew member.<br>\r\n<br>\r\n\"Well, it just started out as a normal day.\" started Alida \"I had just walked outside in my dress when I wanted to stroll around the village. I was feeling a bit frisky that day as I was wearing nothing underneath the dress. So, as I get down the stairs of the castle, I tripped, causing my dress to catch a loose branch near one of the trees and have it ripped clean off my body. Then as fate would have it, I dive face first in a huge pile of mud. It covered me from head to toe, luckily covering all of my delicate areas.\"<br>\r\n<br>\r\nThe whole crew laughed as well as the Queen and Elizabeth when the captain spoke, \"That is some awful luck.\"<br>\r\n<br>\r\n\"Oh that's just the beginning.\" said Alida \"As I was trying to wipe the mud off my eyes to see, my body started to become rigged as the mud seemed to dry very quickly. The outer walls were in need of some repair, so the workers had been out using concrete to repair them. I guess the mixture they had been using must have fallen in the mud because before I knew it, I was stiff like the statue in the village square. Took nearly two hours for my mother to notice my disappearance and the guards to free me from my filthy prison finally.\"<br>\r\n<br>\r\nThe crew engulfed in laughter again, as Elizabeth smiled in knowing that these next few days with the princess were going to be truly fun.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1526965200,
            "id":2497004,
            "title":"Got stuck in the mud naked?"
        },
        "1331222112":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Spanking or Tickling",
                "Pleasure"
            ],
            "content":"<div class=\"\"><div> <span>After an hour or so, the crew had finished their meals and went to their chambers to sleep. The Queen had the same idea and wished her daughter and the captain a good night. Elizabeth though was not finished with the princess yet. After everyone left, she told the princess to meet in her quarters for a little more fun, instructing the young heiress to put on a new pair of panties, the current panties being far stretched out from today's activities.<br>\r\n<br>\r\nAlida made her way to the captain's chambers, sporting a new pair of panties that she hoped the captain would like. She stopped at the entrance to Elizabeth's chamber before knocking on the wooden door.<br>\r\n<br>\r\n\"Come in.\" Alida heard from the other side.<br>\r\n<br>\r\nThe princess opened the door to find Elizabeth sitting at her desk, looking over what appeared to be a map of some kind. The captain looked up and smiled at the princess.<br>\r\n<br>\r\n\"Good you're here,\" said Elizabeth \"I just finished looking over the map to charter a course to our next stop. Now for our fun, come here.\" said the captain as she beckoned over Alida.<br>\r\n<br>\r\nBlushing, the young princess followed the captain's orders and stood instructed, right in front of her desk under one of the ships support beams. The captain then made a twirling motion with her fingers, Alida understanding and spun around. Alida grew nervous as she heard the captain step around her desk, but also eager to know what Elizabeth had in mind. She then felt the captain's presence behind her and felt Elizabeth's breath on her neck.<br>\r\n<br>\r\n\"Let's see what I'm working with,\" said Elizabeth<br>\r\n<br>\r\nBefore Alida could respond, the captain pulled the princess's dress up and off her body, revealing the pair of sky-blue panties with ships on them and a matching blue bra. Alida's face turned even redder as she heard the captain laugh behind her.<br>\r\n<br>\r\n\"Oh, I love these.\" said the captain \"This is going to be fun. Now, arms behind your back.\"<br>\r\n<br>\r\nAlida followed the captain's instructions and felt a thin rope secured on her wrists before a second rope tied around her ankles. She tested her new bonds to find herself unable to break free, but feeling a bit turned on by the restraint. The captain then stepped around and knelt down to face the princess before speaking.<br>\r\n<br>\r\n\"Not too tight?\" Elizabeth asked. Alida nodded \"Good, just wanted to add a few things before continuing.\" The captain then unclipped the young princess's bra, revealing her B-cup breasts. This, in turn, made Alida blush even more from embarrassment.<br>\r\n<br>\r\n\"Oh, don't be shy.\" said the Captain \"It's just you and me. I thought about gagging you as well, but I want to make sure everything is fine. Now for some fun.\"<br>\r\n<br>\r\nElizabeth then reached over the princess's shoulders and gripped the back of her panties before heaving them upward, causing the light blue fabric to invade Alida's rear and press against her front quickly. Alida squealed in the returning sensation, the panties rapidly reaching their limit at her upper back. Noticing this, Elizabeth then stood up fully, bringing the fabric and princess higher, causing Alida to now be a foot off the ground. Before she could say anything, Alida quickly found herself moaning as Elizabeth began to bounce the princess in her panties, stretching the blue fabric even more and sinking her deeper into her wedgie. Elizabeth grew a smirk on her face as she bounced the princess, eager to have her idea come to pass. After a minute or two, the blue fabric stretched far enough to complete her plan. Bringing the blue material up to the ceiling above them, the captain threaded the blue cotton over the top of the support beam before bringing it in front of Alida's face and secured it on her chin. Elizabeth then stepped back to admire her work. She had achieved Alida in an atomic hanging wedgie by her panties, completely bound and unable to break free till she saw fit. Alida, on the other hand, was in complete pleasure, the wedgie now fully secured made her inner's heat up, as she felt her lower lips begin to make the front of her panties slightly damp. She moaned and wiggled a bit in her wedgie to get accommodated as Elizabeth stepped to her side to speak.<br>\r\n<br>\r\n\"So, what do you think?\" she asked the princess.<br>\r\n<br>\r\n\"It feels amazing.\" said Alida \"I've had a few hanging wedgies in the past, but never one this creative.<br>\r\n<br>\r\n\"Oh good.\" said the captain \"Cause the fun is just getting started.\"<br>\r\n<br>\r\nWhat does Elizabeth do next?</span></div></div>",
            "created":1534827600,
            "id":2536610,
            "title":"Skip to after dinner."
        },
        "13312221121":{
            "author_id":"lildude",
            "author_name":"Tyrone",
            "choices":[
                "Spanking",
                "Tickling"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one spanking or tickling?</span></div></span></div>",
            "created":1542949200,
            "id":2581014,
            "title":"Spanking or Tickling"
        },
        "133122211211":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "The captain makes the princess's ass red",
                "Alida finds her climax before having a red ass"
            ],
            "content":"<div class=\"\"><div> <span>With the princess indisposed of, Elizabeth reached back under her desk and retrieved one of her favorite tools, a thick wooden paddle that said \"WELCOME TO THE CREW\" on it. She held the paddle off to the side of Alida's face, the princess gulping, blushed and lost for words.<br>\r\n<br>\r\n\"You know, this paddle is a bit of a tradition on this ship.\" said Elizabeth \"Every time I get a new member on this ship, they get a whack from every member on the ship with this her paddle. Since your part of the royal family, I would never do it with fear of execution. With you, I'm willing to make an exception. So, seeing as your 'initiation' is a bit overdue, I figured paddling you till your ass is red as your blushed face will suffice. However, I do ave a rule with this ceremony: if you happen to climax during this, I'll end it.\"<br>\r\n<br>\r\nWith that, Elizabeth reeled the paddle back and delivered a loud <i>SMACK</i> to the hanging princess's backside. Alida cried out as the impact caused her to swing in her wedgie, the blue fabric grinding against her lower lips and penetrating her ass further. As she swung back, Elizabeth didn't hesitate as she brought the paddle down on her ass again. This pattern continued for what seemed like forever for the princess, desperately trying to find release to end the suffering to her ass. Unfortunately due to her arms being bounded, the best she could do was grind against the blue fabric invading her lower lips.<br>\r\n<br>\r\n\"You know,\" <i>SMACK</i> \"you're lasting\" <i>SMACK</i> \"a lot longer\" <i>SMACK</i> \"than some\" <i>SMACK</i> \"of the other\" <i>SMACK</i> \"crew members.\" said Elizabeth in between spanks. \"Usually\" <i>SMACK</i> \"a member of my crew\" <i>SMACK</i> \"doesn't normally\" <i>SMACK</i> \"last this long\" <i>SMACK</i> \"before they climax\" <i>SMACK</i> \"and most of the time\" <i>SMACK</i> \"they aren't in your predicament.\" <i>SMACK</i> \"I guess\" <i>SMACK</i> \"you just have a lot\" <i>SMACK</i> \"of tolerance\" <i>SMACK</i> \"to this kind of mixture\" <i>SMACK</i> \"of pain\" <i>SMACK</i> \"pleasure\" <i>SMACK</i> \"and humiliation.\" <i>SMACK</i> \"More fun for me.\" <i>SMACK</i><br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1551806040,
            "id":2626679,
            "title":"Spanking"
        },
        "1331222112111":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Make the princess climax ",
                "Kiss her ass "
            ],
            "content":"<div class=\"\"><div> <span>After 15 minutes of nonstop spanking, Elizabeth finally ran out of energy to continue her spankings. As she rested the paddle back where she got it, she looked back at the princess and smiled at seeing the once pale flesh now a slight crimson red. Elizabeth was more surprised that the princess hadn't cried once or even orgasmed, something that none of her crew had done before. Elizabeth walked over the the hanging princess and smiled as the princess still sported a bright red face and sweat beaded down her face.<br>\r\n<br>\r\n\"Not bad your highness. I must say no one has ever lasted like you did.\" said the captain.<br>\r\n<br>\r\nAlida barely found the energy to respond.<br>\r\n<br>\r\n\"T-Thank you captain. Are we finished?\"<br>\r\n<br>\r\nElizabeth smirked at the princess's question.<br>\r\n<br>\r\n\"No. Not yet. I still have another idea or two for you before the night ends. The first of which is to reward you.\"<br>\r\n<br>\r\n\"For what?\" asked the princess<br>\r\n<br>\r\n\"Why for being the only person to ever not beg me to stop their initiation or climax during it.\" answered Elizabeth \"And I think I know just how to do that.\"<br>\r\n<br>\r\nWhat does the captain do?</span></div></div>",
            "created":1567039320,
            "id":2709405,
            "title":"The captain makes the princess's ass red"
        },
        "13312221121111":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Let the princess down and take her to her bed",
                "Leave her to hang and go to sleep"
            ],
            "content":"<div class=\"\"><div> <span>\"I feel that you deserve a reward that I think is long overdue.\" said Elizabeth<br>\r\n<br>\r\nAlida was confused at first, before quickly getting the idea as the captain latched her lips onto the princess's left tit and quickly began sucking as she also began to grope her rear. Alida moaned as Elizabeth quickly began to raise the princess' pleasure with her efforts. The captain continued her endeavors, occasionally switching from sucking Alida's left tit to her right and throwing in a few smacks to the hanging princess's rear. Alida had turned into a panting mess, surprisingly not releasing yet.<br>\r\n<br>\r\n\"C-Captain,\" Alida called out hoarsely, \"If you wish to make me climax, you'll have to try harder.\"<br>\r\n<br>\r\nElizabeth looked up at the princess, smirking while still sucking on the tit in her mouth. She then began to finger the princess lower lips, shoving two fingers past the fabric covering her pussy while simultaneously using her thumb to rub her clit. Alida screamed as the new actions caused her pleasure to skyrocket, the feeling on release now suddenly on the horizon as she quivered in the panties. Elizabeth continued this for a few more minutes, the princess near the tipping point as sweat now began to build as she now was slightly dripping with cum. Elizabeth sensing this, reached around to the line of fabric going up Alida's rear and pulled on the taunt fabric, sending the panties more into the princess' rear with enough force to cause her climax. Elizabeth removed her finger and stepped back, watching the princess ride out her orgasm, a smirk firmly planted on her face.<br>\r\n<br>\r\nAfter five minutes of orgasm, Alida went limp, a pool of cum now on the wooden floor. Elizabeth walked over to the princess and whispered in her ear.<br>\r\n<br>\r\n\"So, how did you like your reward?\"<br>\r\n<br>\r\n\"I-It w-was amazing.\" Alida replied out of breath.<br>\r\n<br>\r\nElizabeth smiled and gave the princess a kiss on her cheek.<br>\r\n<br>\r\n\"Good. I think that will be all for today. Now the only question is, what to do with you?\"<br>\r\n<br>\r\nWhat does the captain do?</span></div></div>",
            "created":1590713520,
            "id":2842387,
            "title":"Make the princess climax "
        },
        "135":{
            "author_id":"seangreaser",
            "author_name":"Wedgie-giver",
            "choices":[
                "Thong",
                "Granny panties",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The captain was in her pajamas when her pants were pulled off ( what panties does the captain have on)</span></div></span></div>",
            "created":1466744400,
            "id":2169817,
            "title":"#5"
        },
        "1353":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "panties with childish characters on them",
                "she's actually wearing a diaper",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what other kind of panties does the captain have on?</span></div></span></div>",
            "created":1501995600,
            "id":2365889,
            "title":"Other"
        },
        "13532":{
            "author_id":"seangreaser00",
            "author_name":"Wedgiemaster456",
            "choices":[
                "Hell yeah!",
                "It's dry as the desert "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it used or not</span></div></span></div>",
            "created":1561698960,
            "id":2679670,
            "title":"she's actually wearing a diaper"
        },
        "14":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "Take the laxatives",
                "No, go down for breakfast as she is"
            ],
            "content":"<div class=\"\"><div> <span>\"Oooooooohhh! I know! How about I put on a nice diaper? I deserve some pampering. Hehehe!\" Alissa thinks to herself.<br>\r\n<br>\r\nThe princess opens on of her drawers and gazes at the collection of fluffy adult diapers. She got them because she went through a bed wetting phase. She's still kinda into it, but she left the diapers in storage for a while. She decided that it was time to uncover them!<br>\r\n<br>\r\nShe chose a fluffy pink diaper that was designed to take a massive \"load\" so to speak. That was why she liked them so much. When she put on the diaper, she discovered that it was a little tight. She looked at the waistband, which had her name on it, and found out that the diaper was two sizes too small. She didn't mind though. She liked the major natural wedgie she was getting. She wiggled we half-exposed butt around to try and deepen the wedgie. <br>\r\n<br>\r\nWhen he finished we little wedgie dance, she noticed something that was in the place of where he diaper used to be in her drawer. It was none other than a bottle of laxatives. She had a pooping problem when she was a child and kept them in this drawer when her problem was solved. \"Hmm, should I have a little fun with these today?\" Alida asked herself while taking the bottle in her hand.<br>\r\n<br>\r\n What does she do?</span></div></div>",
            "created":1428814800,
            "id":1963325,
            "title":"#4"
        },
        "141":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "She farted loudly!",
                "A maid gives her a wedgie!",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Alida chose to take the laxatives. She popped open the bottle and ate five of the chewable laxatives. \"I had a big dinner last night so this should be fun!\" Alida said to herself. She but the poop pills away and put in a short dress, a very very short dress. The bulky diaper was completely visible. Alida stared at herself in the mirror with a blush. She then proceeded to head downstairs for breakfast.<br>\r\n<br>\r\nThe sounds of laughter rang through the halls of the castle as princess Alida walked to the banquet area. She blushed a dark red as the entire castle population saw her in nothing in a big diaper and a dress that did nothing to cover it. As she approached the large dining table, her mother shook her head at her. \"Oh, Alida. To never cease to amaze me.\" She says sarcastically. The princess took this as a compliment. \"Thank you Mama,\" she replied.<br>\r\n<br>\r\nJust as she was about to sit down and enjoy her breakfast, something happened....</span></div></div>",
            "created":1431234000,
            "id":1976294,
            "title":"Take the laxatives"
        },
        "1411":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "There she blows!",
                "Her momma spanks her"
            ],
            "content":"<div class=\"\"><div> <span>The sound was loud, the smell was noxious and it all came from Alida's sweet behind! The laxatives have already taken some effect on the princess's poor bowels and caused her to let out a loud and deadly fart! Those who were not shocked by what they heard were covering their noses from the stench that came out of that booty!<br>\r\n<br>\r\nAlida was beyond embarrassed. He face was even more red than it already was. Her hands were on her stomach. \"Oh my! Excuse me!\" She cried out shamefully. She could hardly believe such a sound came out of her. And neither could her mother. <br>\r\n<br>\r\n\"Young lady! You were raised better than passing gas like a cow in such a place! I believe you need to be punished!\" Alida's eyes lit up! She loved it when her mother punished her. It meant that she would be either spanked , wedgied, or both.<br>\r\n<br>\r\nBefore she could fake complaint about her punishment, she felt something churn in her bowels. The gates were about to open, so to speak! <br>\r\n<br>\r\nWhat happens next? Does she lose control of her bowels? <br>\r\n<br>\r\nOr does her mother punish her first, by spanking the heck out of her poor tushy?</span></div></div>",
            "created":1431752400,
            "id":1978799,
            "title":"She farted loudly!"
        },
        "14111":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "The queen herself",
                "One of the maids",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>She lost control of her bowels and she let loose, right in front of her mother and the staff! The people watching didnt think such sounds could come from such a small figure, but boy were they wrong! Alida's butt let loose multiple loud, wet and smelly farts. She could already feel her diaper getting messy just from the gas.<br>\r\n<br>\r\nThen the main course had started. A giant sloppy mess of diarrhea had erupted into the diaper. The mess was so wet and squishy to Alida, but she couldn't help but shudder in pleasure and relief.  Her butt inside of the diaper was getting covered in her mess and it wasnt stopping anytime soon. The diaper already began sagging to where her butt crack was exposed and the diaper was open. <br>\r\n<br>\r\nThe bystanders were suffering as the room was being enveloped in a horrendous stench that was centered on the princess. After 5 straight minutes of gas and poop, Alida's butt finally ceased and the diarrhea ended. The poop princess was beyond embarrassed. She blushed a new kind of red. She was standing in front of everyone she knew with a huge mess in her diaper, which was revealing her butt crack from the massive weight inside of it. <br>\r\n<br>\r\nThe queen, her miter came up to the princess with her fingers plugging her nose. The stench was too much for her. \"Well, you've certainly made a mess of yourself, haven't you my daughter?\" Her majesty scolded. Alida was too embarrassed to speak, not that she minded the embarrassment. \"You need to be changed immediately!\" The queen said.<br>\r\n<br>\r\nWho changed her?</span></div></div>",
            "created":1432875600,
            "id":1984838,
            "title":"There she blows!"
        },
        "141112":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "On the table ",
                "Back in Alida's room "
            ],
            "content":"<div class=\"\"><div> <span>\"Caroline!\" The queen bellowed. A second later, a young woman who was about in her thirties came forward. She had long black hair and blue eyes. She was also very busty, in the front and the back. She stepped up next to the queen.<br>\r\n<br>\r\n\"Yes your majesty?\" She asked. \"I need you to change my daughter's diaper. I have work tondo today and cannot be bothered with her stench any longer.\" The other maids felt sorry for Caroline, but the truth was that she didn't mind. She had been changing Alida's diapers when she was a baby and she felt happy doing it. It also have her an opportunity to tease the young girl.<br>\r\n<br>\r\n\"Yes your majesty.\" She bowed. With that, the queen left the room and went on to doing her work. Meanwhile, the room still stunk from Alida's big mess. She walked over to the embarrassed girl. \"Well look what we have here! A little girl with a messy diaper!\" She teased. This caused the princess to continue blushing. Caroline went up to the back waistband if the diaper to check the damage. She pulled the waistband back and looked inside.<br>\r\n<br>\r\nShe immediately snapped it back and covered her nose. \"PU! I always knew you had a stinky bottom, but this is record breaking!\" She exclaimed. \"You definitely need a change, but where should we change you? Right here and now on the table, with everyone watching, or back in your room?\" Alida looked around and saw that the other maids were still there and giggling. Being changed in front if them would be incredibly embarrassing. <br>\r\n<br>\r\nWhat was the decision? <br>\r\n<br>\r\n</span></div></div>",
            "created":1433566800,
            "id":1988539,
            "title":"One of the maids"
        },
        "141113":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe the queen changed her mind? Maybe she wants Alida to stay in the messy diaper for the while day as punishment?</span></div></span></div>",
            "created":1432875600,
            "id":1984839,
            "title":"Other"
        },
        "1411131":{
            "author_id":"crazypanda00",
            "author_name":"crazypanda00",
            "choices":[
                "Stand up and loudly announce what happened",
                "Quickly try to run away"
            ],
            "content":"<div class=\"\"><div> <span>\"You know what? Nevermind.\" The queen stood up and turned.<br>\r\n\"You'll stay in that all day, and should anyone ask, you'll show them your mess. Understood?\" With a quick glare she left.<br>\r\nYou burn with embarrassment in your seat. <br>\r\nWhat do you do next?</span></div></div>",
            "created":1453698000,
            "id":2094041,
            "title":"Yes"
        },
        "1412":{
            "author_id":"lucadoop",
            "author_name":"Doop",
            "choices":[
                "The laxatives kick in",
                "The maid spanks her"
            ],
            "content":"<div class=\"\"><div> <span>A maid, feeling tired of Alida's weird stunts and foolishness, snuck behind the unsuspecting princess and gripped the waistband of her already too small diaper. <br>\r\nAlisa noticed this immediately and bit her lip. <br>\r\nHowever she couldn't tell how hard the maid would pull; and she pulled hard. <br>\r\nYAAANK. <br>\r\nThe diaper nearly ripped and Alida made an O shape with her mouth. But they pulled through, long enough for the man to reach the bottom of her chin as everyone watched in amazement. Just as. Everything was seemingly over...</span></div></div>",
            "created":1481086800,
            "id":2247044,
            "title":"A maid gives her a wedgie!"
        },
        "1413":{
            "author_id":"skywatch",
            "author_name":"Sky Watch",
            "choices":[
                "Her mom decides to embarrass her in a way only a mother could.(baby treatment)",
                "Her mom decides she needs some bad discipline now.(Spanks and other punishments)",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While in a diaper with everyone looking, the Queen was giving her daughter a stranger look.<br>\r\n <br>\r\nWhat could happen to Alida today?</span></div></span></div>",
            "created":1436850000,
            "id":2007898,
            "title":"Just what else can occur with the diaper princess "
        },
        "14131":{
            "author_id":"skywatch",
            "author_name":"Sky Watch",
            "choices":[
                "The laxative take effect and she makes a mess in her diaper. With wetness soon.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait Alida, I can tell this cannot suit you.\" The queen tells her daughter.<br>\r\n<br>\r\nAlida was confused 'Eh what does she mean? I wore a diaper not to long ago, where is she going with this?' She thought to herself.<br>\r\n<br>\r\n\"No my little princess, I'm afraid that chair does not suit you, in fact this breakfast needs to be done in a way that fits you right now.\" The Queen said with a sly voice \"Everyone, please hold you forks and spins, me and the maids will have to quickly prepare the right breakfast for my daughter.\" She says this and leaves the dinning hall with the maids, of which also took Alida chair before she sat down.<br>\r\n<br>\r\nAlida just stood in front of the table, thinking she may know what her mom's up to and wondering when she is going to be effected by that laxative.<br>\r\n<br>\r\nAlida's  mother shows up with the maids \"Sorry for the delay everyone, I have returned with the essentials for my little princess.\" She said as a maid puts a high chair right where Alida's seat use to be, many people laughs at this. The queen picks up her daughter as the tray is removed and puts her in the high chair. With the tray back in place her mother puts down a bowl of cereal with milk in it, Alida's mother whispers in her daughter's ear. \"I trust you took a laxative along with your diaper,so I thougt I would complete the mix with a special something in the milk of this cereal.\" She told her daughter with a mischievous smile.<br>\r\n<br>\r\nAlida felt she could not move her hands in her chair, it's kinda tight on her. Hearing what her mother added to the cereal, she couldn't help but blush even more yet smile at what her mother is doing, she loves having a mother willing to play her games with her. <br>\r\n<br>\r\nAlider's mother dips the spoon in the bowl \"I may not eat now, my princess must have her breakfast first, but place everyone else enjoy your meal.\" She says as she spoonfeeds her daughter, who chops down her food with no hesitation. Everyone enjoys breakfast but what happens to Alider? </span></div></div>",
            "created":1436850000,
            "id":2007907,
            "title":"Her mom decides to embarrass her in a way only ..."
        },
        "15":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "Kaila continues to wedgie Alida",
                "The tides turn, and Kaila begins to have her panties pulled",
                "They decide to begin to humiliate the queen",
                "\"What else can you do with your magic?\" Alida asks",
                "The two girls go into town for some public humiliation."
            ],
            "content":"<div class=\"\"><div> <span>\"Perhaps not this morning.\" Alida spoke softly to herself, and she immediently began to get dressed.  Her maid holds up a light purple dress that was the same color of Alida's panties and awaited her approval.  Alida grins and nods her head as she slips in over her head. As the corset is about to get tightened to her body, she pulls up her panties so they reach up to her breasts.  Alida lets out a light squeal as her maid tightens the strings of the corset, locking the dress on, and sealing her panties in a permanent wedgie.<br>\r\n<br>\r\n\"Lift your dress so I may put on your socks.\" Her maid says. Alida nods her head and lifts it up, giggling and showing off how deeply her panties are imbedded. Her maid chuckles and rolls her eyes, and slides on two thigh-high tube socks to go with her dress, and then places on her shoes for her.<br>\r\n<br>\r\nAlias stands up and walks to the door, yet her walk is more of a awkward waltz, for her undies dig deep in both her ass and womanhood. Slowly but surely, she makes her way to the dining room.<br>\r\n<br>\r\nShe is surprised that there are only two people eating breakfast this morning, one being her mother, and the other being a girl that looks to be her age with long brown hair and small freckles dotting her nose and cheeks. Her body is cloaked in a dark blue robe.<br>\r\n<br>\r\n\"Hello mother, who is this?\" Alida asks curiously.<br>\r\n<br>\r\n\"Ah, so good of you to arrive, and fully clothed I might add.\" The queen giggles, \"This is Kaila, your new tutor. She is a master Mage of the magic council who had asked to live in out fair kingdom.\"<br>\r\n<br>\r\n\"A master Mage?\" Alida asks confused, \"she looks much too young do be a Mage of such high stature.\"<br>\r\n<br>\r\n\"Looks can be deceiving.\" Kaila suddenly states as she stands up. Suddenly her magic makes her age change, her body grows taller and her breasts and hips fill out. The threads of her robe tighten and pop as they are constricted to the new form. Then Kaila snaps her fingers, and her aging stops, and then reverses, shrinking her back down until she stops at the age she was just moments before.<br>\r\n<br>\r\n\"Age doesn't bind me anymore.\" She says with a grin, and she sits back down.<br>\r\n<br>\r\nThe queen smiles, \"Well, I have business to attend to, so if you do not mind, I must take my leave.\" She says as she stands up and bows to Kaila. And she walks out of the kitchen.<br>\r\n<br>\r\nKaila smiles and stands up and bekons Alida to come over.<br>\r\n<br>\r\nAlina nods her head and begins to walk over, but suddenly she feels a cool breeze in an unexpected place. She looks down and gasps, for her dress has suddenly dissappeared, leaving her only in her underwear and socks. She blushes and meekly attempts to cover herself.<br>\r\n<br>\r\nKaila laughs, \"There is no need for modesty, I know of your little secret.\" She says as the back of Alida's panties suddenly yank her into the air, giving her a massive hanging wedgie. \"Because I have that same secret as well.\" She adds as she steps forward, purposefully stepping on her already weakened robe, and tearing it off. Leaving her in nothing but a pair of hot pink panties with little white hearts all over.<br>\r\n<br>\r\nAlida smiles broadly as she gets an eyeful of Kaila's adorable panties. \"You and I are going to have tons of fun.\" She says with a smile.</span></div></div>",
            "created":1423717200,
            "id":1932239,
            "title":"#5"
        },
        "151":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "Kaila wants a wedgie now",
                "Alida wants more humiliation",
                "A maid wants to join in on the fun "
            ],
            "content":"<div class=\"\"><div> <span>Kaila laughs as she hoists Alida by her panties. Alida's face is contorted in pain, embarrassment, and pleasure. The Mage decides to use her magic to bounce Alida and worsen her wedgie. Alida's panties started going deeper and deeper into her butt with every bounce, not that she was complaining. Sh was loving how far into her the panties were going. <br>\r\n<br>\r\n\"Oh please! Give me more!\" The princess shouts in ecstcy. The Mage happily obliges. She chants a spell that increases her strength dramatically. Sh let's Alida fall to the floor, her panties all stretched out. Before she could complain, the wizard reaches for the stretched undies and yanks them up with her now superhuman strength. <br>\r\n<br>\r\nThe panties rocket into Alida's poor butt! They shoot into her butthole with such speed and friction to make Alida lose her mind in pleasure! Unknowingly to the both of them, she wets herself. This added to the humiliation factor of her mega wedgie, just the way she liked.<br>\r\n<br>\r\nThe Mage decided to finish this awe-inspiring wedgie. She pulled the stretched fabric up and over the princesses head. She secured the undies over her nose, completing the atomic wedgie. Alida was losing her mind in pleasure. She was trapped in her own panties and was forced to smell her own butt.<br>\r\n<br>\r\nKaila laughed as she saw th princess in such a humiliating state. How does that wedgie feel, princess?\" She says giggling. The princess answers, \"it feels amazing. And I can smell my own butt through the panties!\" <br>\r\n<br>\r\nThis made the Mage laugh even more. \"You better hope you don't have skid marks!\" <br>\r\n<br>\r\nAfter that they both started laughing. What happens next?</span></div></div>",
            "created":1431838800,
            "id":1979222,
            "title":"Kaila continues to wedgie Alida"
        },
        "1511":{
            "author_id":"zzyzxslayer",
            "author_name":"zzyzxstorm",
            "choices":[
                "Alida joins her on a hook",
                "The queen comes back and punishes Alida",
                "They go onto their actually lesson"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright Princess, you had your fun. Now I think I deserve some retribution for placing you in such an embarrassing situation.\" Kaila says in a sultry tone, making it very clear she wants what she just did to Alida done to her. Understanding her instantly and feeling like she did owe this poor Mage some relief after that show. That doesn't mean she wasn't going to drag it out as long as possible. <br>\r\n<br>\r\n\"Excuse me? I can't quiet tell what you want from me? Be a little more explicit my dear teacher.\" She taunts <br>\r\n<br>\r\n\"... Alida please give me a wedgie?\" said Kaila slightly blushing at having to ask. <br>\r\n<br>\r\nAlida speeds behind her a grasps the back of her panties, smirks and says, \"Of course,\" then yanks them as high as she can make them go. Kaila moans as she feels the fabric ride up her ass. Her ass spills out and Alida gives it a few smacks enjoying the jiggle. Alida then gets to idea to bring her over to a hook on the wall, so she drags Kaila over there, hearing her moan in pain as she is given an enormous wedgie. When the reach the hook, Alida takes her underwear and hangs her there, then spins her around to get at her butt. <br>\r\n<br>\r\n\"How are you doing?\" <br>\r\n<br>\r\n\"This is the best I've felt in a looong time\" moaned Kaila in response. Alida smirked then pulled her feet down and let go, then pulled her down and let go, again and again until she saw some pee dribble down her leg. Alida giggled and Kaila blushed.<br>\r\n<br>\r\nWhat do they do next?</span></div></div>",
            "created":1446354000,
            "id":2055738,
            "title":"Kaila wants a wedgie now"
        },
        "15111":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "She is hanged on the hook, still in her cocoon wedgie by the leg holes.",
                "Kaila unravels her panties, then hangs her up somewhere."
            ],
            "content":"<div class=\"\"><div> <span>\"So, what now?\" Alida asks.<br>\r\n<br>\r\n\"Well, I think it's only far that you join me up here, don't you think so?\" Kaila suggests.<br>\r\n<br>\r\n\"Oh, that sounds a splendid idea.\" the princess says.<br>\r\n<br>\r\n\"Excellent, though I think you deserve a reward for the pleasure you've given me first.\" Kaila says, as she starts chanting an unknown language.<br>\r\n<br>\r\nSuddenly before the princess could ask the magi what she meant, the back of the princess's purple panties quickly rose up again, invading the heiress's backside once again. Alida squeals as her panties begin their climb back up the her back, quickly reaching the back of her head as they were still stretchy from the earlier treatment. The panties then reached over the princess's head and went down to her chin within seconds, the front of the panties pressing in making Alida experience a cameltoe at the same time.<br>\r\n<br>\r\n\"MMMMMMPHH!!\" Alida moans as the panties reach past her face, her noises muffled by the fabric in front of her face.<br>\r\n<br>\r\n\"Seems your enjoying yourself,\" Kaila says \"Well were just getting started. I'd tell you to ready yourself, but I highly doubt that will help.\"<br>\r\n<br>\r\nKaila then begins chanting again. The princess then squeals again, as now the front her panties now climb up with such force, the young princess's legs nearly give out. The material quickly reaches Alida's lips where the fabric slips inside and her teeth bit down against her will, holding the panties in place.<br>\r\n<br>\r\n\"There, that should keep the noises to a minimal as I finish.\" said Kaila.<br>\r\n<br>\r\n<i>What else could she possibly have in store</i>, Alida wondered.<br>\r\n<br>\r\nHer question was quickly answered, as the back of her panties that were now above the fabric covering her lips, continued its journey south. Kaila knew exactly what she was doing. The spell she was casting wasn't only controlling the princess's childish panties, but also enchanting them to be unbelievably stretchy and impossible to rip. The purple fabric continued its journey downward towards Alida's feminine areas. Once there, the fabric simply went between the princess's legs and started it's climb back up once again. The princess was in a state of utter bliss, as she felt the second layer of fabric press against her in the most intimate of ways, though she had enough strength to keep her feet steady, wanting to make the pleasure last as long as possible.<br>\r\n<br>\r\n\"Don't worry my dear,\" Kaila says \"I won't make you suffer, the spell will keep going till you surrender.\"<br>\r\n<br>\r\nFor the next few minutes the purple fabric continued to stretch its way up and around the princess's body. Alida felt nothing but pleasure during the whole experience and while she wanted it to last, her body could not hold on. As the fabric made its way through the princess's legs for the fifth rotation, the young heiress squealed as loud as she could, the sound greatly muffled due to the layers of fabric around her. The princess then dropped to the floor, the panties finally securing themselves on her cocooned head and a noticeable wet spot of the front of the purple fabric quickly formed, bringing a smile to Kaila's eyes, as she still dangles from her panties by the hook.<br>\r\n<br>\r\n\"Well, it seems you enjoyed that more than I thought,\" said Kaila \"Well, I guess it's time for you to join me up here now.\"<br>\r\n<br>\r\nHow is the princess put on the hook?</span></div></div>",
            "created":1513227600,
            "id":2428240,
            "title":"Alida joins her on a hook"
        },
        "151112":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Kaila's plan backfires",
                "Someone walks in"
            ],
            "content":"<div class=\"\"><div> <span>Kaila used her magic to pick up the wedgie wrapped princess and began to unravel the purple fabric from the princess. Once the fabric was completely undone, the back of the now laid on the floor after being stretched so far. The magic on Alida's mouth also wore off, as she let go of the panties in her mouth and took deep breaths to compose herself. She looked like a mess, red in the face and sweat on her brow, the front of the panties still inside her lower lips and her panties now resembled more of a parachute. Kaila took notice of the back of the heiress's panties and thought of a new idea. She looked around the room and smiled as she spotted the chandelier on the ceiling. The glass chandelier looked magnificent with the gold material it was constructed out of, but the mage was more focused on the two hooks that proved from the bottom.<br>\r\n<br>\r\n\"You know what. I think I have a better idea.\" said Kaila and began chanting once again.<br>\r\n<br>\r\nBefore Alida could even brace herself, she found herself raised into the air by the back of her panties. She squealed as the fabric once again invaded her backside as Kaila continued to raise the princess up higher until the leg holes of her panties had secured themselves over the hooks and then dropped her in place. The hooks were parallel with the room so it allowed for the princess to face the mage in her hanging wedgie and her panties were stretched so much that she was at face level with the mage in her own hanging wedgie, both only a few feet off the ground.<br>\r\n<br>\r\n\"D-Doesn't this seem like enough?\" said Alida squirming in her new wedgie.<br>\r\n<br>\r\n\"Hhhmmpphh\" hummed Kaila in thought \"No, but this is.\"<br>\r\n<br>\r\nKaila then unleashed a huge gust of wind that caused the chandelier to swing and take the princess with her. The princess began to squeal and moan as she was now in a pendulum wedgie, the fabric pressing now only pressing more in her still tender backside, but began to invade her front again as well. The princess may not have weighed much, but it was enough for physics to do it's job and keep the pendulum swaying for a good minute or so, which was when the mage would unleash more wind to start the process all over again. And the beauty was the the spell Kaila put over the purple fabric was still in effect meaning the panties wouldn't rip and continue to stretch. Kaila was going to enjoy herself until she felt like stopping.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1514869200,
            "id":2435858,
            "title":"Kaila unravels her panties, then hangs her up s..."
        },
        "1511121":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Agree",
                "Deny and face the consequences "
            ],
            "content":"<div class=\"\"><div> <span>What Kaila didn't know is that her efforts in pushing the chandelier more to cause the princess to swing more in her wedgie, also caused her to come closer and closer to the hanging mage. Alida, however, did notice this and used it to her some payback. As the chandelier swung, Alida got close enough to Kailua to grab the front of the mage's black panties. As the chandelier came back for the return, both the princess and Kailia did as well, her panties ripped from the hook they were on and now the mage found herself in a painfully pleasurable frontal hanging wedgie.<br>\r\n<br>\r\n\"AHHH!\" Kailia screamed as the fabric burrowed deeper in her nether regions. \"Princess release me.\"<br>\r\n<br>\r\n\"Not until you let me down.\" said Alida<br>\r\n<br>\r\nWhat does Kailia do?</span></div></div>",
            "created":1524114000,
            "id":2481561,
            "title":"Kaila's plan backfires"
        },
        "15111212":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Kaila get the princess down",
                "Alida's panties unexpectedly rip"
            ],
            "content":"<div class=\"\"><div> <span>\"NO!\" yelled Kaila, even as her panties dug harshly into her rear and front.<br>\r\n<br>\r\n\"Alright then, you asked for it.\" said Alida<br>\r\n<br>\r\nAlida then started to bounce the mage by her panties, causing her to squeal with each decent. Her panties lodged themselves in her lower lips, causing a mix of pain and pleasure. At the same time, Kaila's spell kept the chandelier moving, causing her to sink more into the material. Alida smirked as she continued to bounce the mage, even if she was still in some pain from her own wedgie. It didn't take long for the continued momentum of the chandelier and the bouncing wedgie to cause the mage to cum in her panties, the black fabric now becoming more damp along with her pee.<br>\r\n<br>\r\n\"Well, what do you say now?\" said Alida<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1525842000,
            "id":2490649,
            "title":"Deny and face the consequences "
        },
        "151112121":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "They get stopped along the way",
                "They make it to Alida's chambers for more fun."
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, Alright!!\" said Kaila \"I'll get you down, just please stop bouncing.\"<br>\r\n<br>\r\nAlida stopped bouncing the mage by her panties, and the mage sighed in relief. She then used her magic to remove the princess's panties from the chandelier and lowered her to the ground. After removing their wedgies, the two realized how much of a wreak they were. Sweat beating off both their foreheads, hair in a wreak and their panties were stretched beyond reason.<br>\r\n<br>\r\n\"Um, why don't we go to my room and recollect ourselves,\" said Alida<br>\r\n<br>\r\n\"I think that would be appropriate,\" said Kaila<br>\r\n<br>\r\nThe two then made their way to the princess's chambers, their panties skidding the floor behind them as they went.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1532408400,
            "id":2524289,
            "title":"Kaila get the princess down"
        },
        "1511121211":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "The Queen",
                "Olivia, the general of the queen's army"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who do the two run in to?</span></div></span></div>",
            "created":1551379980,
            "id":2624399,
            "title":"They get stopped along the way"
        },
        "15111212112":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Wrap them together in a joined cocoon wedgie before taking them to her room",
                "She's busy. So put them in a centaur wedgie and send them on their way"
            ],
            "content":"<div class=\"\"><div> <span>The two made their way through the corridors of the castle, their panties like loose capes escaping from the back of their pants, desperately trying to make it back to the princess's chambers before being spotted in their situation. As the two turned the final hallway that leads to Alida's room, their luck finally ran out when a voice spoke from behind. <br>\r\n<br>\r\n\"Well, what do we have here?\"<br>\r\n<br>\r\nAlida and Kalia turned around to the source of the voice. Alida's faced paled as she saw her mother's second and command and general of the kingdom's army Olivia standing before them. Olivia is a gorgeous woman, even by the kingdom's standards. 6'2, slim but muscled built, DD cup, wearing the kingdom's armor and carrying her sword at her hip. Olivia walked up to the two girls before crouching to look the two in the eyes.<br>\r\n<br>\r\n\"Seems today's my lucky day.\" said Olivia \"Two lovely ladies with underwear capes just itching to pull.\"<br>\r\n<br>\r\nKalia looked at Alida \"Alida who is this?\"<br>\r\n<br>\r\nGasping in a fake offense, Olivia spoke \"Oh Alida you haven't told your little friend about me. Well, I guess cause she is new I'll make the introductions. I'm Olivia, the Queen's right hand. We know each other very well. Not only through her mother but I'm also the first person to discover the princess's little humiliation kink.\"<br>\r\n<br>\r\nKalia whipped her head to the princess, finding the other girl blushing red. It was true, Olivia was the first person to learn of the princess's kink. It was when Alida was much younger, ten she thinks it was. Alida was in her room, entertaining herself by trying to give herself an atomic wedgie. She didn't notice Olivia enter the room before hearing her gasp behind her. After a few minutes of explanation, Olivia told the princess that she wouldn't tell anyone. However, that didn't stop her from having some fun. What followed was a two-hour marathon of wedgies, spanking and other humiliating tasks that Alida enjoyed every moment. It eventually ended with Olivia hanging the princess in her closet by her panties, bound so she couldn't escape and left her till dinner, four hours later.<br>\r\n<br>\r\n\"But enough with the introductions. On to business, turn around. Both of you.\"<br>\r\n<br>\r\nAlida turned her back to Olivia without questioning what's to come.<br>\r\n<br>\r\nKalia hesitated, however.<br>\r\n<br>\r\n\"Just do what she says.\" said the princess \"Trust me, she won't make you taste your underwear if you comply.\"<br>\r\n<br>\r\nWith a gulp, Kalia followed Alida's example, and the two had their backs turned to Olivia.<br>\r\n<br>\r\nTime seemed to slow down for the two, wondering what will happen next. Their questions quickly answered as they felt their panties gripped. The two squealed as they were somehow hoisted in the air the fabric quickly reinvading their asses. Olivia laughed as she then started to bounce the two girls, causing their butts and boobs to jiggle, loving the sounds and slights before her.<br>\r\n<br>\r\nWhat does Olivia do?</span></div></div>",
            "created":1551382680,
            "id":2624417,
            "title":"Olivia, the general of the queen's army"
        },
        "151112121122":{
            "author_id":"dudewitheyes89",
            "author_name":"LordwithEyes",
            "choices":[
                "Some maids find the pair and they have some fun! ",
                "Olivia returns after exiting the dungeons! "
            ],
            "content":"<div class=\"\"><div> <span>“Well pups, I’m in a bit of a hurry right now, there’s some troublemakers down in the dungeons that I need to take care of. So enjoy this!” She swiftly stretched Alida’s panties up her butt and snapped it under her chin, trapping the princess in a smelly panty mask. <br>\r\n<br>\r\nShe forced Kalia onto her knees and brought a dazed Alida in front of her, shoving the mage’s face into her butt before stretching her panties high above her head! The panties already suffering lots of abuse was able to climb up her back easily and past her head, to rest upon Alida’s own forehead! She stepped back, giggled at her handiwork, and shoved Karia’s waistband a little lower, snapping it under the princess’s nose so that she could smell two butts instead! The princess grimaced as her nose was overloaded and she stumbled around, Kalia struggling to keep up as she was forced to smell Alida’s butt at its source! <br>\r\n<br>\r\nStill, the two got used to their predicament steadily enough that they could move in tandem, occasionally being stopped by a wall. By that point Alida grew used to the smell, even liking it in a way as she navigated the halls hoping to find help. </span></div></div>",
            "created":1551396360,
            "id":2624524,
            "title":"She's busy. So put them in a centaur wedgie..."
        },
        "1511121211221":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Alida and Kalia eventually wake and make it to the princess's room",
                "Olivia comes back and finds them"
            ],
            "content":"<div class=\"\"><div> <span>The two were almost to the princess's chambers when Alida accidentally bumped into something.<br>\r\n<br>\r\n\"Well ain't this a surprise. Ain't it, Rosy.\"<br>\r\n<br>\r\nIf her face were visible, Kalia would have been pale. She only knew one person in the kingdom that went by \"Rosy.\"  Rose, a tall busty redhead that used to be her personal maid, until she was punished for pulling a prank on the queen, that Alida framed her for. She was sentenced to hanging on the kingdom's flag pole by her stretchy and embarrassing panties that hadn't ripped after six hours. That meant the owner of the voice was Alice, another maid who was slightly taller than Rose but just as a buff. Alice always has had a beef with the princess since the day she pranked her by attaching a rope to her panties and sent her dragging from the back of a horse. The two were sporting their usual maid attire, short skimpy maid outfits they barely covered their rears and cleavage, making their equal C cups almost bursting out of their shirts.<br>\r\n<br>\r\n\"Yeah, looks like the princess had a run in with Olivia. And this must be the friend we heard that she had over,\" said Rose as she delivered a smack to Kalia's backside.<br>\r\n<br>\r\nKalia moaned and stumbled forward, causing Alida to practically shove herself into Alice.<br>\r\n<br>\r\n\"Wow, looks like this horse wants some attention,\" Alice said cockily.<br>\r\n<br>\r\n\"Well, it would be cruel to not have a bit of fun and give it what it wants,\" Rose answered.<br>\r\n<br>\r\nWithout warning, Rose wrapped her arm the waist of the bounded mage and began to deliver spank after spank to Kalia's exposed rear. Alice also began her fun by grabbing the princess's exposed breasts and began to grope and twist them violently causing Alida's nipples to quickly harden. Kalia moaned as her rear continued to be assaulted, which vibrated against the princess's rear which made the princess feel even more pleasure from her nipples being manipulated.<br>\r\n<br>\r\n\"Looks like someone's enjoying themselves,\" said Rose smirking as she continued to assault the mage's rear. \"Don't take this too personally, it's mostly her fault. I haven't had the ability to get her back for framing me for that prank. I was up on that flagpole for so long, my legs fell asleep. You were just collateral.\"<br>\r\n<br>\r\n\"Yeah, not to mention that stunt you pulled with the horses. I could taste my own underwear after that what you did. It took them an hour to get the horse to stop long enough to detach my panties from the rope.\" Alice said angerly. \"Wonder if I can make you taste them with this.\"<br>\r\n<br>\r\nAlice then grabbed the front of the princess's purple panties and yanked them hard enough the drive them straight into her lower lips. Alida moaned as her pleasure continued, her panties feeling like they were splitting in two.<br>\r\n<br>\r\n\"Sounds like she likes it,\" said Rose. \"Wonder if you can make similar noises I wonder?\"<br>\r\n<br>\r\nRose then began to use her fingers and rub Kalia's clit, making the mage moan even louder into the princess's rear. the maids continued this for what seemed like forever until...<br>\r\n<br>\r\n\"Well, this has been fun, but we better wrap this up before someone sees,\" Alice said. She then looked at Rose and they both nodded.<br>\r\n<br>\r\nThe two maids then went into overdrive. Rose deliver rapid smacks to Kaila rear when vigioursly rubbing her clit. Alice forgot about the princess's boobs and began to tug the purple fabric more and more, causing it to strech to ridiculos lenghts. This rapid feeling of pleasure and pain was to much for the centuared girls and they eventually climaxed into thier panties. The pleasure too much to handle that thier legs gave out on them. Alida feel into the parachute that was now the front of her panties and Alice simply wrapped them around to the back of her head. Rose and Alice stepped back to marvel at their work. Alida now sported three layers of fabric in her face, while Kaila was now practically shoved into the princess's rear, her own now sporting a redish hue. The girls were lifeless, having passed out from thier climaxes, the fronts of their panties now considerably darker. Alice and Rose then walked away, leaving the two in the middle of the hallway in the state they left them, needing to get back to work.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1558639620,
            "id":2663207,
            "title":"Some maids find the pair and they have some fun! "
        },
        "1513":{
            "author_id":"hamandcheese",
            "author_name":"Adam Jiffy",
            "choices":[
                "Wind magic (blowing her clothes off)",
                "Size magic (getting too big/small for clothes)"
            ],
            "content":"<div class=\"\"><div> <span>As their laughter died down, they suddenly heard quiet giggling. Alida stopped and looked around. \"Kaila, did you hear that?\" The mage stopped laughing and listened. \"Hear what, princess?\" Alida kept looking. \"I thought I heard someone laughing at me\". Alida turned to the right and saw a maid with brown hair, green eyes, and round, frame-less glasses peeking out from behind the corner. The maid gasped and hid when the princess saw her. Alida decided to approach her to find out why she was watching her.<br>\r\n<br>\r\nThe maid in question was named Susan. She was in charge of the washing, so she knew about Alida's collection of panties better than anyone. She often watched the princess' acts of embarrassment in secret because she found them to be cute. Susan herself was quite shy and would never want something like that to happen to her. But that all changed two summers ago during a vacation with the royal family. The queen, Alida, and several staff members went to a tropical beach and Alida wanted to prank one of the maids (not anyone in particular) with an altered one-piece suit. By pure blind luck, it was Susan who took the swimsuit and dove into the ocean. The suit was designed to dissolve in water, so the shy maid was left stark naked in front of everyone. She was utterly humiliated at first, but later on, she felt a strange sense of pleasure when she thought back on it, even being somewhat aroused. And from that day forward, Susan began to admire the princess from afar, wishing with all her heart that someday, she could take part in Alida's mischief as well.<br>\r\n<br>\r\nWhen Alida caught up to Susan (Kaila followed close behind), the maid was trying to quietly slip away. \"Excuse me\", Alida asked. Susan gasped and froze when she was caught. \"Were you watching me just now?\" Susan turned around and the princess and mage saw that her cheeks were bright red. \"I wasn't doing it to spy on you, Your Highness. I was watching you because...well...\" \"Yes?\" said Alida. The maid shuffled her feet uncomfortably. \"I like it when you embarrass yourself and I wanted to join in on your stunts for the longest time!\" she blurted out quickly. The maid then covered her mouth and went even redder. The room went quiet for a minute. And then Alida smiled. \"Well, if you wanted to join me, all you had to do was ask.\" Susan uncovered her mouth. \"Really?\" Alida nodded. \"Of course. The more, the merrier, I always say! By the way, I don't think I know your name.\" The maid curtsied. \"My name is Susan. I am in charge of the castle's laundry.\" Alida took her hand. \"Well Susan, why don't you come on over and we'll cook up a nice little event for you?\"<br>\r\n<br>\r\nThis wasn't Alida's first time embarrassing a maid. She had done everything from pulling down their skirts to putting diuretics in their teacups. And everything in between. But since Susan was the first one to say that she admired her, Alida decided that she deserved something special. And since she had a master mage with her, Alida figured she could use magic to embarrass her. The princess whispered something to Kaila. The master mage nodded in agreement. Alida approached Susan with a not-even-subtle grin on her face. \"Susan, would you like to help Kaila demonstrate some of her magic for me?\" Susan had seen enough of Alida's stunts to know when she was acting. But she wasn't about to turn down an offer to join the merry-making. \"Sure, Your Highness. How can I help?\" Alida pointed to a spot in the middle of the room. \"Oh, all you have to do is stand right there and Kaila will do the rest\", she said, giggling a little bit.<br>\r\n<br>\r\nSusan did so, and turned to ask the master mage a question. \"What kind of magic will you be doing?\" <br>\r\n<br>\r\n </span></div></div>",
            "created":1493269200,
            "id":2311605,
            "title":"Susan, the laundry maid"
        },
        "153":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "The two girls humiliate her further",
                "The two girls let her be ",
                "Suddenly, the invisibility wears off!"
            ],
            "content":"<div class=\"\"><div> <span>\"You know, I think my mother needs a little humiliation.\" Alida says with a grin. Kaila's eyes sparky with joy and she lowers Alida to the ground. Alida doesn't even bother picking her undies and asks. \"Do you know a spell of invisibility?\"<br>\r\n<br>\r\n\"You're really asking a master mage if she knows invisibility?\" Kaila asks rolling her eyes. \"That's the easiest trick in the book!\" And she snaps her fingers, rendering the two girls invisible.<br>\r\n<br>\r\n\"Perfect.\" Alida says with a grin, \"now let's find mom.\" The two girls aimlessly wander the halls of the castle, but they don't find her anywhere.  Yet they hear the roar of a crown and they investigate. Outside the main gates there is the Queen giving a speech to the crowd. <br>\r\n<br>\r\n\"How could I have forgotten, today was the big day for her.\" Alida says face palming. \"There couldn't have been a more prefect opprotunity.\"<br>\r\n<br>\r\nThe queen's dress was extravagant, it held do her form perfectly while retaining a sense of dignity and power within its woven golden silk. The dress was a tube top, and there was no sign of a bra hidden underneath. Kaila used this to her advantage, for she had already snuck up behind the queen and had gently gripped the sides of the upper half of her dress.<br>\r\n<br>\r\nBefore the queen could react, Kaila yanked the thin fabric down, unleashing the queen's massive boobs.  The queen gasps in surprise and blushes deeply, attempting to cover her exposed boobs with her arms. But before she can do that, Kaila begins to massage her massive boobs, rubbing her perky nipples over and over again, making her moan and go slack.<br>\r\n<br>\r\nAlida takes this as her sign to join the fun, and she grabs the rest of her dress and yanks it down to the ground, showing off a humiliating pair of white panties with little bunny rabbits all over and with large frilly lining.  Alida giggles as she reads her mothers name written in black ink. <br>\r\n<br>\r\nThe crowd roars in laughter as the queen in utterly humiliated, yet Alida feels the front of her mother's panties, and her fingers begin to drip with wetness. Alida giggles and yanks up fiercly on the front of her mother's panties, making her let out a sharp squeal in response.</span></div></div>",
            "created":1424062800,
            "id":1935176,
            "title":"They decide to begin to humiliate the queen"
        },
        "1531":{
            "author_id":"addhouston",
            "author_name":"Addhouston",
            "choices":[
                "Return to the castle hours later",
                "Alida does a act with an invisible kalida "
            ],
            "content":"<div class=\"\"><div> <span>Following alida's lead. Kaila used her magic like before to yank the back of the queens white panties giving her a massive super wedgie in front of the crowd.<br>\r\n<br>\r\n\" Please! Ah! Don't look.\" The queen said as she was on display like art as the kingdom saw her in the air hanging by her undies. The queen was dripping wet as fluid ran down her leg giving the kingdom a good view of her camel toe as well as her enjoyment of it. Kalia decided to finish it as the the queens undies traveled further and further up her back, bouncing her in mid air as her boobs jiggle.. The queen opened her eyes as her vision was now white with bunnies as her undies snapped her her eyes, reeling her head back.<br>\r\n<br>\r\n\" AAAAAHHHHHH!\" Kalia left her magic be as the queen would be boucning in the air for a while as her and alida went to see what more mayhem they can cause with their little disappear trick.<br>\r\n<br>\r\nWhat now? </span></div></div>",
            "created":1545195600,
            "id":2591065,
            "title":"The two girls humiliate her further"
        },
        "154":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "Alida continues to wedgie Kaila",
                "Kaila begins to teach Alida Magic ",
                "Suddenly the queen walks in only in her panties!"
            ],
            "content":"<div class=\"\"><div> <span>\"So what other magics do you know?\" Alida asks as inbetween light moans from her painful and pleasureful wedgie.<br>\r\n<br>\r\n\"Well I have mastered time magic, a magic where I can alter the age of myself. I also know telepathy, mind control, telekinesis, summoning, and illusion craft.\" She states.<br>\r\n<br>\r\n\"Could you show me more of your time magic, I would love to see more demonstrations.\" Alida asks.<br>\r\n<br>\r\n\"Certainly.\" Kaila replies with a smile as she lowers Alida back to the ground. \"Hold my panties for me, would you?\" She asks as she has Alida grab the sides of her panties. Kaila closes her eyes and focuses, and she begins to age in reverse, her body shrinking, and her panties growing loose around her. <br>\r\n<br>\r\n\"See?\" Kaila asks as her voice is much higher pitched. \"My mind stays the same, yet my body changes.\" <br>\r\n<br>\r\nAlida grins, and suddenly yanks up on the sides of Kaila's panties, easily lifting her small body into the air.<br>\r\n<br>\r\nKaila let's out a girly squeal as her panties cleave through her ass, and her legs kick out in surprise, deepening the massive wedgie. She squirms for a bit in writhing pleasure, then she lets out a gasp as Alida hears the patter of liquid hitting the floor.  Alida giggles as she sees Kaila blushing furiously as pee dribbles down her legs an onto the floor.<br>\r\n<br>\r\n\"Hmmm, you're so cute in this form, I hope you stay like this.\" Alida happily says as she begins to bounce Kaila up and down like a yo-yo.<br>\r\n<br>\r\n\"I-it's f-fine with m-me!\" Kaila says as she feels the ruffles of her panties dig deeper and deeper into her with every bounce.<br>\r\n<br>\r\n</span></div></div>",
            "created":1423717200,
            "id":1932269,
            "title":"\"What else can you do with your magic?\"..."
        },
        "1542":{
            "author_id":"baking",
            "author_name":"Bo",
            "choices":[
                "Mind control",
                "Summoning",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where to start?</span></div></span></div>",
            "created":1425272400,
            "id":1942722,
            "title":"Kaila begins to teach Alida Magic "
        },
        "15421":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "Humiliation fest continues uninterrupted.",
                "Kaila's pleasure suddenly breakes the mental bond between then two"
            ],
            "content":"<div class=\"\"><div> <span>\"You said mind control, yes? Show me how it's done.\" Alida asked as she let Kaila back down. Kaila nodded her head as she pried her panties from her sensitive buttcheeks and they went in search of a test subject. As they journeyed through the corridors, they finally stumbled up the head maid, Victoria. Victoria was known for being a strict woman without any sense of fun. \"Perfect.\" Alida giggled<br>\r\n<br>\r\nKaila focused her mind and soon a telepathic link was created between the two girls. Suddenly Victoria stopped what she was doing, and assumes the exact standing position Kaila was in. <br>\r\n<br>\r\n\"My mind control is very similar to a voodoo doll, whatever I do or feel, they do the same. Watch.\" Kaila explained as she raised her right arm. Sure enough, Victoria raised her right arm in the exact motion. Then Kaila grinned, and worked her hands infront of her boobs as if she were undoing buttons. Sure enough,  Victoria was undoing the buttons of her black blouse. Kaila giggles as she grabbed her pretend shirt and ripped it open, forcing Victoria to tear hers off, letting her DD cup boobs free.<br>\r\n<br>\r\n\"So anything that happens to you happens to her?\" Alida asked.<br>\r\n<br>\r\n\"That's right, anything at all.\" Kaila replied.<br>\r\n<br>\r\nSuddenly Alida crouched behind Kaila and did a motion that looked like she was pantsing her. As soon as she did that, Victoria's frilly black and white skirt shot to her ankles, leaving her standing in a pair of light pink panties with incredibly frilly white trimming. Alida giggles, then grips the front of Kaila's undies. Without giving Kaila a second to react, she yanks up on her panties, making Kaila moan loudly and sending her panties deep up her vag. At the same time, Victoria let out a mimicked moan as her panties magically shot up in the air.<br>\r\n<br>\r\nWhile Alida still had the advantage, she brought one hand up to Kaila's breast and began massaging it, and with her other hand, she snaked it down to Kaila's already wedgied vag, and began to tease it by rubbing it up and down gently.<br>\r\n<br>\r\nKaila moans loudly as she blushes heavily, yet she succumbs to the pleasure and begins to massage her other boob, making Victoria copy the exact motion, blush, and pleasure from it.<br>\r\n<br>\r\nSuddenly...</span></div></div>",
            "created":1425358800,
            "id":1942999,
            "title":"Mind control"
        },
        "154211":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Kaila uses a different mind control technique on Alida",
                "Alida now gives her try at mind control, Kaila using it to her advantage."
            ],
            "content":"<div class=\"\"><div> <span>\"Wow, I gotta say I'm really impressed with your control over Victoria.\" said Alida as she continued to pleasure the mage, pressing harder into her clit and now tweaking the Kaila's hardened nipple. This caused the mage to moan and Victoria let out a similar one.<br>\r\n<br>\r\n\"T-Thank you Alida.\" said Kaila nearly able to find the strength to speak. \"It's always nice to be complimented one ones gift.\"<br>\r\n<br>\r\n\"Now problem, now let's see just how much this mind control can be taken to.\" said Alida with a smirk on her face.<br>\r\n<br>\r\nBefore Alida could ask what she meant, she let out a large moan as the princess had switched her grip now back to the front of Kaila's panties and continued to yank them upward, bringing the fabric more into the lower lips of the master mage. At the same time, Victoria's pink panties were raised to the same respected height as Alida's and gave out an identical moan. Alida wondered for a moment whether or not the head maid even knew what was happening and simply couldn't do anything about it. Curious as she was, Alida continued to tug Kaila's panties and asked, \"Hey, does Victoria have any idea what's happening right now?\"<br>\r\n<br>\r\nKaila opened her eyes, having closed them to concentrate on the pleasure she was feeling and responded. \"Yes and no. Right now she's trapped within her own mind, but she is aware of what's happening. So, while she knows what's going on, there's nothing she can do to stop it.\"<br>\r\n<br>\r\nSmiling, Alida replied, \"Well, that's good to know. I'd hate for her not able to at least witness what's happening to her. Why don't we give her something to really remember, shall we.\"<br>\r\n<br>\r\nAlida then yanked harshly on Alida's panties and brought the black panties up and over Kaila's head and secured them, giving the master mage and atomic melvin. The same had happened with Victoria, her own pink panties had enveloped her own face, putting her in the same position as Kaila. The two women then moaned loudly, the sound filling the corridor. Kaila then feel on her knees due to the pleasure she was feeling, causing Victoria to do the same. Kaila then tries to scratch the fabric off her head, Victoria doing the same, when both women were stopped by the princess grabbing the mage's hands.<br>\r\n<br>\r\n\"Ah, ah, ah. Not yet, I want to test a theory. I'm sure you will enjoy it.\"<br>\r\n<br>\r\nAlida then pushed Kaila down until both women were now belly first on the floor. Kaila was curious as to what the princess had in mind. Her question was answered when the back of her panties now shot up her backside, causing the same to happen to Victoria and unleashing a loud squeal from both women. Alida then began to yank the back of the black panties up the mage's back, resulting in moans and gasps to come from the two panty masked women. It didn't take long for Alida to get the fabric of the panties high enough to finish her task. She then grabbed the front of Kaila's panty clad head and tilted it back, causing the fabric to be pushed more inside the mage and making her moan. The princess then pulled the back waistband and secured it on Kaila's forehead giving her a double sided atomic wedgie. The tightness of the fabric had caused the mades head to tilt back, her back arching as she now looked like a human bow, the panties acting like the drawstring. Smiling, Alida looked back at Victoria and saw that the mage still didn't break the mind control, as Victoria was in the same situation as Kaila, her body now enveloped in the light pink fabric.<br>\r\n<br>\r\nFake pouting, Alida said, \"Hmm, not the result I was looking for.\" Alida then smirked \"I guess i'll just have to keep going till I get what I want. I am a princess after all.\"<br>\r\n<br>\r\nKaila wondered what more could the young heiress want as she felt herself being brought up on her knees. She tried to feel what was going on when she suddenly felt fingers press against her clit and a hand start to grope her breast. Kaila gasped then moaned in the pleasure, hearing similar sounds coming from the head maid. It was then she understood what the princess wanted to see. Alida continued her work, rubbing her fingers across Kaila's lower lips and massaged her breasts, switching from the left to the right, causing Kaila to moan louder and Victoria to do the same. After a minute of so passed, Kaila started to grind into the wedgied fabric in her lower lips, feeling her release soon approaching. Alida noticing this, decided to end the mage's torture. She then gripped the line of fabric that came out the front of her lips and pulled hard upward driving the fabric into her to the point Kaila felt like she was being impaled. At the same time, Alida had also taken the mage's left nipple in her fingers and tweaked them harshly adding even more pleasure.<br>\r\n<br>\r\nIt was then that Kaila couldn't hold on anymore, the princess successfully pushed her off her orgasmic cliff. Kaila then moaned so loud, the princess wouldn't be surprised if someone else heard it and began to climax, thrashing around in her wedgie and her arms flailing around out of control. Alida took a quick look back and saw Victoria's body was doing the exact same thing. Once Kaila had finally finished orgasming, she simply played back into her knees, to tired to do anything else. This caused the wedgie to emphasize the mage's front and show off the indistinguishable cum stain on the fabric in her lower lips, some of it starting to seep on the floor. Victoria was in the same situation, sporting the same wet patch as the mage, who somehow had not broken the mind connection throughout her orgasm. Alida had to wonder if Victoria's climax was a result of her own body's doing or due to the mind control. Though she honestly didn't care.<br>\r\n<br>\r\nWith a smile on her face, proud of her work Alida spoke.<br>\r\n<br>\r\n\"Well I guess that was an excellent demonstration of your mind control. What's next.</span></div></div>",
            "created":1513832400,
            "id":2431217,
            "title":"Humiliation fest continues uninterrupted."
        },
        "1542111":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Give her a squeaky clean",
                "Give her an atomic, followed by a spanking"
            ],
            "content":"<div class=\"\"><div> <span>After getting the wedgie off her head, Kaila responded. \"Well, since I've shown you the basics, why not demonstrate a more advanced technique.<br>\r\n<br>\r\nWith a smirk on her face, the mage quickly began to chant. Alida had no idea what the mage was up to but quickly became aware of her body becoming stiff. After a few moments, Kaila stopped her chanting and the princess was completely immobile.<br>\r\n<br>\r\n\"W-What's going on?\" said Alida as she tried to free herself form the mage's magic<br>\r\n<br>\r\nKaila stood up and began to make her way to the princess and spoke \"Like I said I'm demonstrating a different technique. This one is a little trickier and requires more concentration but had better results. Now all I have to do is think what i want you to do, and no actions will result upon myself.\"<br>\r\n<br>\r\nAs Kaila was still making her way around her prey, Alida's body acted on it's own and began to play with herself. Her hands began to play with her breasts, sparking a gasp followed by a moan from Alida. It felt strange, her body feeling herself up but without her own will. it somehow made it that much more pleasurable. She was so caught up in pleasure that she didn't see Kaila walk behind her. She soon realized as she quickly found her panties yanked up her backside once again. Kaila had brought the princess on her toes as she continued to commend the princess's body, now having her finger tweak her nipples causing Alida to moan louder.<br>\r\n<br>\r\n\"K-Kaila, p-please more.\" Alida begged.<br>\r\n<br>\r\nWhat does the mage do?</span></div></div>",
            "created":1517979600,
            "id":2450367,
            "title":"Kaila uses a different mind control technique o..."
        },
        "15421112":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Alida's pleasuring",
                "Kaila's Spanking"
            ],
            "content":"<div class=\"\"><div> <span>Kaila smiled, eager to fulfill the princess' request and proceeded to tug the rainbow panties up and over Alida's head. Alida gasped as her panties now covered her face, the rainbow fabric secured under her chin and moaned in pleasure as the mage continued to make her body play with her nipples. Alida smirked in her efforts. Then she noticed how the panties caused the princess's dress to ride up a bit, exposing the bottom of her slightly pale rear.<br>\r\n<br>\r\n\"You know Alida,\" said the mage \"Your bum is looking a bit pale. Why down I think that for you.\"<br>\r\n<br>\r\nBefore Alida could muffled a response, Kaila used her mind control to ben the princess over and used her hands to bring the bottom of the dress to he center of Alida's back, fully exposing her wedgied rear. Kaila wasted no time, as she began to deliver sharp smacks to the princess's cheeks, alternating from one to the other or swatting in the very middle. Alida found herself in heaven. The wedgie created a huge magnet of pleasure and each swat was like a jolt of electricity, enticing her to moan, squeal or gasp with each hit. Whether it was Kaila controlling her or her own endeavors, she quickly found her left hand leaving her left breast and it gripped the front of her panties. Alida's left hand then began to tug the panties upward and into her lower lips. The princess nearly collapsed in the new wave of pleasure, finding herself now grinding into the front fabric, wondering what would finally cause her release that she could feel on the horizon.<br>\r\n<br>\r\nWhat causes her release?</span></div></div>",
            "created":1524546000,
            "id":2483859,
            "title":"Give her an atomic, followed by a spanking"
        },
        "154211121":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Kaila continues demonstrating mind control",
                "They move on to a different magic lesson"
            ],
            "content":"<div class=\"\"><div> <span>Within a few moments, Alida couldn't hold in her pleasure any longer. With one final tug on the front of her panties and a tweak on her right nipple, Alida screamed into her panties that covered her face as her orgasmic barrier finally collapsed. Kaila stepped back and watched in shock and amazement as the princess fell to her knees, ass in the air and face hitting the ground as she climaxed violently. The young girl spasmed in her wedgie, the fabric somehow still staying over her face, her breasts touching the hard stone floor, no doubt scraping on her nipples to create a unique sensation. Ten whole minutes passed before Alida finally stopped squirming from her release. Kaila now worried for the princess unhooked her panties from her chin and they snapped back against her rear, causing Alida to moan in pleasure from the slight pain.<br>\r\n<br>\r\n\"Alright princess, I think that's enough for a bit.\" said Kaila \"What's say I take you back to your chambers to rest and change your panties before our next lesson?\"<br>\r\n<br>\r\nAlida only nodded and hummed in response. Kaila then smiled and grabbed the back of the princess's panties again and used them to hoist Alida off the ground by only a few inches. The princess moaned in the returning pleasure as Kaila carried the princess to her room, each step causing Alida to bounce in her panties, creating even more joy. By the time the two made it to the princess's chamber, Alida had come for the second time. The mage then laid the princess on her bed and left her to rest, planning to go back in a few hours to teach Alida more magic.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1528434000,
            "id":2504599,
            "title":"Alida's pleasuring"
        },
        "1542111212":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Time manipulation",
                "Summonings"
            ],
            "content":"<div class=\"\"><div> <span>After a few hours rest, we find Alida and the mage in the princess's chambers. After having some time to rest and a brief shower, Alida was now redressed in a light blue dress, sporting a pair of pink panties with yellow crowns on them and a pale blue bra.<br>\r\n<br>\r\n\"Alright Kalia,\" said the princess \"what is our next lesson?\"<br>\r\n<br>\r\n\"Well,\" said the mage \"I have thought about it, and I have come up with two different methods to choose from, either time manipulation or summoning spells. Which would you like to do?\"<br>\r\n<br>\r\nWhich does the princess choose?</span></div></div>",
            "created":1545195600,
            "id":2590942,
            "title":"They move on to a different magic lesson"
        },
        "15421112121":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Unfreeze time",
                "The mage isn't finished just yet"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I'd like to start with manipulating time,\" said Alida \"Maybe do summonings another day.\"<br>\r\n<br>\r\n\"Excellent choice,\" said Kaila smiling. \"I think we will stick to just freezing time to start, moving time forward can be a bit tricky for beginners.\"<br>\r\n<br>\r\n\"Alright, so where do we start?\" asked Alida.<br>\r\n<br>\r\n\"How about now.\" said the mage.<br>\r\n<br>\r\nThe princess nodded before she and Kalia moved to the center of the princess's large chambers. The two faced each other before Kalia spoke.<br>\r\n<br>\r\n\"Ok, so to understand stopping time is pretty easy. For you, I have a charm that'll allow you to use a spell to freeze time temporarily. For me, I can use my own powers to make time freeze for as long as I wish. The whole world becomes completely still, unable to move, speak or feel. The real trick is to try and stay focused, or the spell will stop and to also make sure you have enough strength to stop the spell yourself. The incredible thing about time freezing is that everything seems almost weightless and effortless. You can move things with ease, and while it might have seemed like ages to do, you've done it in a mere second.\"<br>\r\n<br>\r\n\"Wow,\" said the princess fascinated \"Can you show me some?\"<br>\r\n<br>\r\nGrinning widely, Kalia responded, \"I think I can give a demonstration.\"<br>\r\n<br>\r\nClosing her eyes, Kalia focused her powers. She felt her energy surge through her, and she heard the world around her. Birds chirped, the winds blew, and the distant footsteps outside the door to princess's chambers. Suddenly, all that stopped and the mage opened her eyes. Kalia smiled as she saw the princess in her frozen state, knowing her spell had worked. The mage felt her powers continue to keep the spell stable but knew she couldn't do it forever. Not wanting to waste time, Kalia made her way over to the princess. Kalia took a brief look at the princess's condition, walking around her like a lion taunting its prey, while sweeping her hand now and then on Alida's body, specifically the underside of her breasts and a quick swipe in between her open legs. Having her fun, Kalia removed the princess's dress with some difficulty and threw the discarded clothing aside, stopping in mid-air.<br>\r\n<br>\r\nKalia giggles at the princess's choice of attire and then got to work. Kalia first unclips the princess's bra and lets it fall to the floor, Alida's breasts still upright as still stuck in time. Going to Alida's front, the mage begins to play with the time petrified princess's jugs, groping them while twisting and pulling on the suspended nipples. While Alida may not be able to feel the effects of her manipulations at the moment, Kalia knew that once she stopped her spell they'd be fully erect and the princess would feel everything she did instantly. Having her fun with her breasts, Kalia then focused her attention on Alida's lower lips. The mage slipped her hand in the princess's panties and got to work, rubbing the paralyzed girl's little bundle of nerves while sliding in a finger to play with her lower lips, occasionally curling them to rub the princess's g-spot. The entire time the princess remained still.<br>\r\n<br>\r\nAfter about five minutes, Kalia decided to finish her work with a little wedgie fun. Before she continued though, she remembered how much of a screamer the princess was earlier and knew with all the pleasure Alida would feel all at once; others would surely hear and spoil her fun that she wanted to have later or worse upset the queen. After searching, Kalia found the princess's underwear drawer and found a pair of basic white panties to use. Though as she walked back toward her paralyzed victim, she felt her wetness from the twos previous events on her panties. Suddenly, the mage had a different idea. Kalia removed her panties and replaced them with the ones of the princess. She then pulled the princess's mouth open and shoved her own slightly damp panties into Alida's mouth. After closing how much she could of Alida's mouth, the black fabric a bit significant to all fit in, Kalia then gripped the back of the pink fabric and pulled. With time still, the pink material moved with ease up and over the princess's head before being secured under Alida's chin. Kalia stepped back for a moment to admire her work as the princess stood still, in an utterly humiliating position just waiting to be snapped back into reality.<br>\r\n<br>\r\nWhat does Kalia do next?</span></div></div>",
            "created":1545195600,
            "id":2590971,
            "title":"Time manipulation"
        },
        "154211121211":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "Kalia, retribution for earlier",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Kalia decided that she couldn't wait any longer. With a snap of her fingers, the mage deactivated her spell and time resumed.<br>\r\n<br>\r\n\"MPPPHHH!!!\" came from the panty faced princess as she now felt the effects of the mage's work. The wedgie pulling her head back with force as the fabric was still taut, her nipples hardened instantly, and her lower lips suddenly began to gush with the pleasure of what felt like two orgasms at the same time. Alida's legs gave out from underneath her, and she toppled to the wooden floor, the full force or her climax making her shake with pleasure, mixed with a bit of pain from her backside. As she moaned, she felt the slight taste of saltiness on her tongue, quickly realizing something was in her mouth but could care less at this point. She continued to climax in her wedgied state for roughly 15 minutes, all while Kalia watched in satisfaction of a job well done. After another 10 minutes to let her relax and get her breathing in check, the mage walked over to the princess and maneuvered her onto her knees, a puddle of cum underneath the panty faced princess. Kalia then removed the fabric from Alida's face and pulled the black undies from the princess's mouth, sweat on her face and beat red with pleasure.<br>\r\n<br>\r\n\"So, what did you think of my demonstration?\" Kalia asked with a smirk on her face.<br>\r\n<br>\r\nCatching her breath, Alida responded.<br>\r\n<br>\r\n\"A-Amazing.\" she said, \"It felt like I've pleasured for what seemed like an hour in an instant.\"<br>\r\n<br>\r\n\"That's the effectiveness of time.\" said Kalia \"You see, if your body can't protest can try to will itself to not give in to the pleasure, then everything is that much more powerful. For me, it was about 10 minutes of manipulating you, but to you, it was like a blink of an eye. Now as a gift for being my test dummy, I believe a reward is in order.\"<br>\r\n<br>\r\nKalia then conjured a necklace with a green gem on the end of it and placed it around the princess's neck.<br>\r\n<br>\r\n\"This charm will allow you to manipulate time until you can conjure magic on your own. To activate it, think of time like ice to stop time and to deactivate the charm, think of time as water.\"<br>\r\n<br>\r\nLooking down at the charm, the princess responded: \"Seems easy enough.\"<br>\r\n<br>\r\n\"Well the charm is for beginners, and it's not that powerful. At best you might have 15 minutes of power in that charm in one sitting; after that, you have to let it recharge for about an hour. So, how do you want to test it first?\"<br>\r\n<br>\r\nWho does the princess test the charm on?</span></div></div>",
            "created":1552423560,
            "id":2629511,
            "title":"Unfreeze time"
        },
        "1542111212111":{
            "author_id":"dessaudd",
            "author_name":"AuThor1Ty",
            "choices":[
                "The two mess with the Queen",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>The plastered a grin on her face before closing her eyes and concentrated. Kalia knew what the princess was attempting to do but was too late to stop her as Alida used the charm to stop time. Alida opened her eyes to see the mage frozen in time, one arm slightly extended and the other at her side, the pair of white panties still in hand. Alida first undid her wedgie, but still kept the fabric wedged between her ass as she approached the frozen mage. She first rid Kalia of her black dress, revealing her exposed breasts and slit as she wore no panties. The princess then noticed the pair of panties in the mage's hand, quickly taking them and slipping them on her new friend. As an added bonus, she also inserted the mage's previous black panties in her mouth as she did to her moments ago.<br>\r\n<br>\r\n\"Alright let's have some fun.\" Alida said with an evil smirk<br>\r\n<br>\r\nWhat followed next could only be described as a wedgie hell for Kalia, if she weren't frozen to feel it. The princess first hung the mage from the coat hooks in her room, before pulling down on Kalia's legs as hard as she could to make the wedgie as taunt as possible. She then took down the mage and gave her a squeaky clean wedgie non stop for 5 minutes, knowing the amount of pain and pleasure it would bring. The final step took a bit of effort and maneuverability, but eventually Alida was able to wrap the bend the mage's arms and legs inward enough to wrap her entire body in the white fabric making the mage a literal wedgied ball of fabric. The princess then bounced the mage around her room and most of the castle before finally shooting her in one of the waste baskets. It was at that moment that the charm wore off and Kalia felt the full extent of her wedgies. She came immediately through the pleasure, soaking the white fabric around her till her lower half was completely soaked. Alida simply looked down at the balled up mage and smiled.<br>\r\n<br>\r\n\"Well that was fun.\" said the princess \"What say  I get you out and then we have some more fun.\"<br>\r\n<br>\r\nAlida heard a faint reply, and started to unravel the mage.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1568843760,
            "id":2720303,
            "title":"Kalia, retribution for earlier"
        },
        "15422":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "\"Let's summon lissana\"",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>\"You mentioned summoning. What can you summon?\" Alida asked curiously<br>\r\n<br>\r\nKaila's face brightened up exitedly with a grin. \"Oh I can summon a whole lot of things. My two favorite are Lissana, my personal maid spirit, and Crimson, my humiliation Succubus.\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1433394000,
            "id":1987952,
            "title":"Summoning"
        },
        "154221":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "Lisanna shows off her wedgie skills to the poor princess",
                "Lisanna punishes her in a different way",
                "Maybe Lisanna wants to be punished instead?"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's summon Lisanna. I want to see what a wizard's maid would look like.\" Alida says with excitement. Kaila smiles and says, \"Good choice! She's really nice and completely obedient. She loves serving me.\" <br>\r\n<br>\r\nShe then waved her hand and a magic circle appeared next tithe two girls. A shining light flashed and then quickly disappeared along with the magic circle. Remaining was a petite young maid. She had short silver hair with beautiful blue eyes. She was wearing a simple maid outfit where the skirt ended around her mid-thighs. She had white stockings on and white fingerless gloves. Her hair was tied in cute little pig tail on the back of her head. <br>\r\n<br>\r\nWhile her outfit made her look cute, it also made her look even sexier. She didnt have a lot of definition up top due to her A-cup breasts, but down below was a different story. She had a pear-shaped figure, which meant that the biggest part of her was her sexy bubble butt. Lisanna was proud if this butt and often flaunts it around other people and other spirits. Kaila didnt mind this one bit as she enjoyed watching we maid shake her cute sexy tushy. <br>\r\n<br>\r\n\"Hello mistress! How may I serve you today?\" She said cheerfully with a smile on her face. Kaila answers, \"Hello, Lisanna! I have a new friend here and she like to be out in embarrassing situations. I suppose you can help with that?\" Alida starts to get nervous with excitement, not knowing what's about to happen to her. \"Certainly mistress!\" Lisanna replied. What happens next?</span></div></div>",
            "created":1434344400,
            "id":1993027,
            "title":"\"Let's summon lissana\""
        },
        "1542213":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "Kaila",
                "Princess Alida",
                "Both of them"
            ],
            "content":"<div class=\"\"><div> <span>While the other two girls had their backs turned, the cute and sexy maid got down on her hands and knees and stuck her butt out toward the couple. The turned and saw the Lisanna shaking her butt in front of them. <br>\r\n<br>\r\n\"Actually mistress, can I have some wedgies before I help you and your friend? I've been such a bad girl and need to be punished for it!\" She begs lustfully. The other two girls from evily and nod toward the begging maid. <br>\r\n<br>\r\n\"Alright, Lisanna. You'll get your wedgie. In fact, you're gonna get a wedgie so big, you're gonna need special magical surgery to remove it from your butt!\" Kaila said sadistically. The maid shivered in anticipation. <br>\r\n<br>\r\nWho is gonna give Lisanna the wedgie she deserves?</span></div></div>",
            "created":1435381200,
            "id":1999979,
            "title":"Maybe Lisanna wants to be punished instead?"
        },
        "15422131":{
            "author_id":"baking",
            "author_name":"Bo",
            "choices":[
                "Normal",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of wedgie is  Kaila giving her servent?</span></div></span></div>",
            "created":1435554000,
            "id":2000821,
            "title":"Kaila"
        },
        "154221312":{
            "author_id":"addhouston",
            "author_name":"Addhouston",
            "choices":[
                "Atomic super wedgie",
                "mega bounce wedgie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about something extreme </span></div></span></div>",
            "created":1545195600,
            "id":2591073,
            "title":"More"
        },
        "1542213121":{
            "author_id":"addhouston",
            "author_name":"Addhouston",
            "choices":[
                "Have lissanna humiliate alida ",
                "alida wants the same treatment that lisanna got"
            ],
            "content":"<div class=\"\"><div> <span>Kaila got her magic ready as lissanna as her ass towards her. She lifted up her skirt to see her choice of underwear which is yellow panties with and upside down smiley face on it. <br>\r\n<br>\r\n\" Shake that butt for me maid.\" Kalia demanded her maid. <br>\r\n<br>\r\n\" yes mistress.\" Lissanna then twerked her behind for her mistress as alida was about to witness first hand what her magic can do to an unsuspecting fool. <br>\r\n<br>\r\n\" Now say up!\" She used her magic and yanked up her maids undies super high giving her the mother of all wedgies. <br>\r\n<br>\r\n\" AAAHHHHHHHHHHHH!\" lisanna screamed in pleasure as her undies invaded part in her that she thought that they would never reach. \" I can- Feel it!!!\" <br>\r\n<br>\r\n\" Good because we're just getting started.\" her magic became stronger as her panties were stretched higher into the air lifting the maid off the ground as her feet dangled. She bounced lisanna as alida had her eyed widen and her jaw dropped to the intensity of the wedgie she was getting. The cotton going into places, Her ass jiggling, her boobs swaying. \" Spread those legs more.\" <br>\r\n<br>\r\n\" yes mis- AAAAHHHHHHHH!\" lisannaspread her legs as the two got the few of her dripping wedged vag as her super wedgie kept going.<br>\r\n<br>\r\n\" Now spread those cheeks also.\" Lissanna moved her hands to spread her booty cheeks as kalia magic grew making it even more intense, stretching her panties even further. <br>\r\n<br>\r\n\" AAAAAAAAAAHHHHHHHHHHHHHHHHH!\" lisanna screamed like a siren. Alida was now being a little envious as she groped her own ass cheeks.<br>\r\n<br>\r\n\" Now my maid. Sing me a little song about how much you love wedgies.\" <br>\r\n<br>\r\n\" yes mistress.\" She said as her wedgie kept going and bouncing her. \" Wedgies, wedgies. How i like to receive. Wedgies, wedgies make my undies into my new hat. Wedgies, wedgie dangle my undies to make me squeal.\" Her undies were now big enough to cover a hole field so kaila decided to finish it.<br>\r\n<br>\r\n\" Now say you love your wedgie.\" <br>\r\n<br>\r\n\" I love my wedgie!\" She screamed to the whole world as kaila used her magic to make her undewear tight and back to its original making the back lash super tight as it snapped over her face. \"MMMMMMMMMMMMMMMMMM!\" She had the most blissful orgasm ever as she was settled on the ground, the floor dripping with her cum. Lisanna then turned around to face her mistress as she moved the waistband onto her nose. \" Thank you mistress.\" She said hunch over in and intense atomic wedgie. <br>\r\n<br>\r\n\" Now alida should we get started or do you want the same treatment as my maid.\" <br>\r\n<br>\r\nNow what.   </span></div></div>",
            "created":1545282000,
            "id":2591078,
            "title":"Atomic super wedgie"
        },
        "154222":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "\"Let's try Crimson\"",
                "More(make up some more summons!)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hmmm, I want more options.\" Alida said with curiousity</span></div></span></div>",
            "created":1433394000,
            "id":1987953,
            "title":"More"
        },
        "1542221":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "Crimson's fun is over, and it's her turn to humiliate Crimson ",
                "The queen decided to intervain, and helps poor Alida out"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's try Crimson.\" Alida said with an adventurous grin.<br>\r\n<br>\r\n\"Alright, but be warned, she's really good at her job.\" Kaila replied as she sat on the ground. Crossing her legs and raising her hands just above her shoulders, a ring of Magic formed infront of her. Suddenly an explosion of purple most expells from the circle. Once it dissipates, a tall, woman in a pair of lacy black panties and with only black tape covering her DD-cup boobs appeared. She looked like a normal person, except for the slight red tinge to her skin, and cute, almost cartoonish bat wing sproutig out of her back.<br>\r\n<br>\r\n\"Yo, you called miss?\" Crimson spoke flatly, almost out of boredom.<br>\r\n<br>\r\n\"Yes Crimson, I have a fun task for you.\" Kaila replied with a cheeky grin. \"I want you to do your best and humiliate Alida through the day. But, you have to do it at random times to keep her off guard. Does that sound like fun?\" <br>\r\n<br>\r\nCrimson walked up to Alida, and checked her from head to toe. Then she cracked a grin and nodded her head. With a snap of her fingers, she dissappeared.<br>\r\n<br>\r\nKaila giggled \"Alright, she's only going to get you when you during your most vulnerable moments, she has a knack for getting you when you least expect it. Now run along and get some clothes on. I'm going to spectate this.\" She then snapped her fingers and dissappeared as well. <br>\r\n<br>\r\nFor several moments, aloda stood there awkwardly, unsure of what to do. Suddenly a servant walked into the room. \"Princess, hurry and get some clothes on, your speech is about to begin.\"<br>\r\n<br>\r\nAlida remembered about her speech and nodded her head. And immediently went up to her room to get a new dress on.<br>\r\n<br>\r\nSeveral minutes later she leaves her room wearing an elegant light green dress. The length of the dress reached just to her knees, so she wore a pair of thigh high tube socks along with a pair of fancy black shoes.  Her shoes echoed through the hallway as she hurried to the courtyard where the speech was to be held.<br>\r\n<br>\r\nAs she reached the door, she could hear the buzz of excitement from the crowd outside. She slowly opened the doors and waved politely to the crowd.<br>\r\n<br>\r\nAs she reached the podium, the crowd grew quiet. She smiled and cleared her throat.<br>\r\n<br>\r\n\"People of New Haraan, it is with great pride that I must point out, the growing prosperity of our glorious kingdom.\" Alida spoke with a strong voice.<br>\r\n<br>\r\nThe crowd erupted in a cheer, too which Alida raised her hand to quiet them down again.<br>\r\n<br>\r\nHowever, she could not put her hand back down.<br>\r\n<br>\r\nAlida looked quizzically at her non-responsive hand. And it seemed to gain a mind of its own. Slowly it worked its way closer to herself. And in one quick motion, it grabbed hard onto her own boob. Alida let out a gasp as she suddenly began to fondle herself.<br>\r\n<br>\r\nA small blush crept onto her face as she fought to repress a moan as her hand teased her boob and pinched her nipple through the soft fabric.<br>\r\n<br>\r\nThe crowd murmured in confusion, as they were not sure what their princess was doing. Suddenly Alida's left hand also came to life, and it snaked its way under Alida's dress.<br>\r\n<br>\r\nAlida gasped as she felt her fingers wrap around the front of the waistband of her undies. <br>\r\n<br>\r\n\"Oh no.\" She whispered to herself. And she let out a loud squeal as her hand ha led up the front of her panties, showing off to the world a pair of light pink panties with frilly white trimming. On the crotch of her panties was a large teddy bear face that was firmly dug deep up her clit.  She let out a soft moan as she was forced to pull harder and harder on the front of her panties, accidentally knocking the podium over, allowing a better view of her wedgied vag.<br>\r\n<br>\r\nAs her left hand was teasing her vag without mercy, her right hand decided to let her boobs free, and it yanked down the fabric that was covering her boobs, showing off Her erect nipples.<br>\r\n<br>\r\n\"D-don't look.\" Alida begged, getting absolutely aroused from the humiliation. The crowd ignored her as they erupted in a roar of laughter. <br>\r\n<br>\r\nAlida fell to her knees, now her right hand fingering her wedgied clit, dripping with arousal. Alida moaned loudly as she fingered herself harder and harder. Her childish panties digging deeper and deeper. Suddenly Crimson appeared behind her, yet it appears that only Alida can see her.<br>\r\n<br>\r\n\"Please, stop.\" Alida begged for mercy. To which Crimson only shook her head. Gripping the back of her undies, she yanked Alida up into the air, producing a cute squeal out of the humiliated princess. Her legs quivered as her undies dug deep into everywhere. Her hands decided to go for her boobs, and we're go flog her without mercy. Crimson set Alida down with her butt facing the crowd. And she pulled Alida's soaked panties down to her knees.<br>\r\n<br>\r\n\"What are you d-doing?\" Alida asked as she twisted her own nipples hard. In crimson's hand was a large rod with little rounded spikes all over. She only giggled evilly.<br>\r\n<br>\r\n\"No! Not up the-EEEP!\" Alida shrieked as Crimson thrusted the rod deep up Alida's ass<br>\r\n<br>\r\nThe crowd continued to riot with laughter as Alida suffered to her pleasureful humiliation. Alida blushed as she spread her legs, and a soft hiss was heard, a stream of pee squirted out of her, her blush turning beet red.<br>\r\n<br>\r\n\"I'm, I'm gonna-\" Alida moaned as her eyes rolled to the back of her head. She suddenly came right infront of the crowd, creaming the floor underneath her. She panted heavily from exhaustion and laid on the ground, freed from Crimson's spell</span></div></div>",
            "created":1433394000,
            "id":1987968,
            "title":"\"Let's try Crimson\""
        },
        "1542222":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "Elastica",
                "Marina",
                "Other summons"
            ],
            "content":"<div class=\"\"><div> <span>\"I actually have a couple of more things I can summon!\" Kaila said. Alida got curious. \"What are they?\" She asked. \"Well there is Elastica, the wedgie demon. Trust me she lives up to her name.\" Kaila winces and rubs her butt, remembering the last time she called Elastica. <br>\r\n<br>\r\n\"Also, there is Marina, a spirit I have that causes incontinence to other people. When she's around, kiss your bladder and bowel control goodbye!\"<br>\r\n<br>\r\nBoth of these creatures interst Alida. Which one does she choose? </span></div></div>",
            "created":1433566800,
            "id":1988532,
            "title":"More(make up some more summons!)"
        },
        "15422221":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "Send her out in public and shoot her undies up her butt in an atomic",
                "Shrink her undies while she's in public, giving her a permanent wedgie",
                "Other options "
            ],
            "content":"<div class=\"\"><div> <span>Alida was curious to know what this wedgie spirt could do. She did love wedgies after all. \"Let's do Elastica!\" She says excitedly. Kaila smiled at the princess's choice. She made a circle made iout of pure energy. A glow appeared that was almost blinding. Then the flow stopped and a figure stood in its place. <br>\r\n<br>\r\nA woman stood before the two girls. She had long black hair that went down to her butt, blue eyes and a beautiful complexion. She had a sexy hourglass figure that was covered by a pair of black leather pants and a black sports bra. She had matching boots on. To add to her style, she had a sash around her chest that was decorated with the remains of woman's panties. The destroyed undies varied in style, cut and color. They were also covered in sweat, blood and skid marks. Alida  looked at this woman in wonder. \"She must be one hell of a wedgie giver!\" Alida thought.<br>\r\n<br>\r\nKaila stepped toward her. \"Hello, Elastica. It's been a while.\" She greets. The sport didn't reasons right away. She paused for a second and looked around for her surroundings. She then sniffed the air. \"Ah! I love the smell of wedgieable panties!\" She says. She then looks toward the two girls. \"I see I have my next victim.\" She says, gesturing to Aida. Alida blushed and clenched her butt in excitement. \"Yes, she is.\" Kaila answered. She turned Alida around and lifted her dress up, exposing her embarrassing panties. <br>\r\n<br>\r\nElastica smiled evilly. \"What a nice specimen!\" She said, rubbing the princess's butt, causing her to moan. \"I'm gonna have fun with you, girly!\" She said sadistically. \"One more thing,\" Kaila interjects. \"She likes to be publicly humiliated. You can use that to torture her.\" She suggested. Elastica smiled and nodded. <br>\r\n<br>\r\nWhat does she do?</span></div></div>",
            "created":1438059600,
            "id":2013650,
            "title":"Elastica"
        },
        "154222211":{
            "author_id":"baking",
            "author_name":"Bo",
            "choices":[
                "panties",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what kind of underwear is she wearing?</span></div></span></div>",
            "created":1468472400,
            "id":2180160,
            "title":"Send her out in public and shoot her undies up ..."
        },
        "1542222111":{
            "author_id":"lildude",
            "author_name":"Tyrone",
            "choices":[
                "Rubber ducky printed",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What design?</span></div></span></div>",
            "created":1491627600,
            "id":2301940,
            "title":"panties"
        },
        "15422221111":{
            "author_id":"lildude",
            "author_name":"Tyrone",
            "choices":[
                "Her mother comes to collect her",
                "Kaila summoned Disiplina to spank Alida in pubic"
            ],
            "content":"<div class=\"\"><div> <span>Kaila sent Alida out into town and once she left, Kaila told Elastica to follow her while invisible. Elastica turned invisible and followed behind Alida deciding to give the poor girl an atomic. Once Alida was in the middle of town Elastica lifted the back of her dress and laughed a bit at Alida's rubber ducky panties before grabbing Alida's panties and yanking up making Alida let out a loud squeal that got everyone's attention. Everybody started to laugh at the princess' predicament. Elastica then stretched the panties out to four feet above Alida's head and then pulled them over Alida's face hooking it undeer her chin. Elastica then lets go of the panties making Alida fall face first with her ass raised to the sky. Elastica then disappears completely leaving Alida with her ass exposed to the crowd of citizens who were either wolf whistling or something else.<br>\r\nWhat else happens to Alida?</span></div></div>",
            "created":1491627600,
            "id":2301947,
            "title":"Rubber ducky printed"
        },
        "154222211112":{
            "author_id":"lildude",
            "author_name":"Tyrone",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she summon her or not?</span></div></span></div>",
            "created":1499922000,
            "id":2352460,
            "title":"Kaila summoned Disiplina to spank Alida in pubic"
        },
        "15422223":{
            "author_id":"fairytail96",
            "author_name":"FairyTail96",
            "choices":[
                "Disiplina the Punisher",
                "Pheromonia, the sex goddess",
                "Other summons"
            ],
            "content":"<div class=\"\"><div> <span>\"I have a couple of other spirits! One is named Disiplina, the punisher! She spanks pretty much anyone she wants to and not does she do a good job! I couldn't sit for a month the last time I summoned her!\" Kaila said, rubbing her butt. \"There's also Pheromonia! She's a spirit who controls a person's sexual arousal! I bet she would be pretty embarrassing to be around in public!\" She suggested.<br>\r\n<br>\r\nWho does she choose? </span></div></div>",
            "created":1433653200,
            "id":1989030,
            "title":"Other summons"
        },
        "15423":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "Let's go foreward, I wanna see myself as the queen",
                "Let's go back, what was my mother like as a princess?"
            ],
            "content":"<div class=\"\"><div> <span>Alida thinks to herself for a moment, suddenly she gets an idea, \"Hey, you can control time, do you think you can send us either forwards or back in time?\" <br>\r\n<br>\r\n\"Pffft, easily.\" Kaila scoffed, \"which do you wanna do, go forward or backwards?\"</span></div></div>",
            "created":1443848400,
            "id":2043270,
            "title":"More"
        },
        "154232":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "Kaila suddenly teleports them somewhere humiliating for Sophia ",
                "The girls stay and watch her mess herself "
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go back, I wanna see what my mom was like when she was young.\" Alida replies, slightly trembling in anticipation.  Her expectations are non other than her mother being the rebel just as her daughter is now.<br>\r\n<br>\r\n\"Alright, let's go.\" Kaila replies with a grin as she snaps her fingers, which a large spark illuminates from her fingers, blinding Alida.<br>\r\n<br>\r\nOnce her vision clears, she finds herself alongside Kaila, yet it seems nothing has changed.<br>\r\n<br>\r\n\"Did it work?\" Alida asks curiously<br>\r\n<br>\r\n\"Of course, let's go find your 15 year old mother.\" Kaila grins, you see Kaila has already been at this time period, and knows exactly what the queen was like back in her day, and wanted Kaila to experience it for herself.<br>\r\n<br>\r\nThe two girls aimlessly wander through the castle in search of Alida's mother. Suddenly a young yet stern voice sounds from behind them. <br>\r\n<br>\r\n\"How lewd! Where are your clothes?\" <br>\r\n<br>\r\nAlida and Kaila turn around and find a teenage girl, wearing a light blue dress that reached down to the floor, she also has a pair of long white gloves that reach past her elbows, and a sparkling golden tiara upon her beautiful brown hair that she wore in a simple yet elegant braid down her back, the exact braid that Alida has her hair in every day.<br>\r\n<br>\r\n\"Well? Answer your princess. Why are you only in your panties?\" She asked again<br>\r\n<br>\r\n\"This is my mom? She is so lame.\" Alida whispered to Kaila, which made Kaila giggle rather loudly, making the young queen's face go red with frustration.<br>\r\n<br>\r\nShe huffed and turned around and began to walk away and get someone to remove them from her castle.<br>\r\n<br>\r\nBut before she got too far, she felt a small tug from the back of her dress<br>\r\n<br>\r\n\"Wha-\" she gets cut off as her dress gets flipped up over her head from all sides, both Alida and Kaila giggling loudly as they yank up on her dress from both sides.<br>\r\n<br>\r\nShe squeals loudly as she blushes fiercely. \"What are you doing?!\" She squeaks as her light pink panties with frilly white trimming around the leg holes and waistband and with little sparkles and a large unicorn on the butt are put on full display.  But te two girls don't reply as they pull the dress higher, exposing her matching bra, yet keeping her arms and head trapped under the blue fabric.  Then Kaila uses her magic to tie the dress in a permanent knot above her head.<br>\r\n<br>\r\n\"R-release me at once.\" She ordered with a shaky voice as she shambles in a random direction with her thighs clamped together and her knees buckled in hopes of hiding her embarrassing panties.<br>\r\n<br>\r\n\"Oh how lewd. You have your undies on full display.\" Alida mocks as she watches her mother struggle in her humiliating position.<br>\r\n<br>\r\n\"I-I... EEP!\" She yelps as suddenly Alida grabs the frilly waistband of her undies and yanks up fiercely, forcing the soft pink fabric in between her precious butt cheeks. The force of the wedgie knocks her off balance and makes her fall to her knees, forcing her childish panties even deeper than before.<br>\r\n<br>\r\n<br>\r\n\"Hey, I think now would be a good time to try out a new kind of medicine I've been tinkering with.\" Kaila giggles as she snaps her fingers, a large green pill suddenly appearing in her hands.  \"A new kind of laxative.\" She adds with an evil giggle.<br>\r\n<br>\r\n\"But we don't have any water for her to drink.\" Alida replies.<br>\r\n<br>\r\n\"Don't worry, it's a suppository.\" Kaila only answers. She grips the waistband of her undies and pulls it to her knees, eliciting a small, cute squeal out of the flustered princess.  Her bare bottom squirming about as she struggles from her dress.  <br>\r\n<br>\r\n\"How dare you pull down my-EEEK!\" She screeches as Kaila shoves the pill up her undefended asshole.  She falls to her knees from the sudden penetration, squirming frantically. Kaila then quickly pulls her undies back up into place.<br>\r\n<br>\r\n\"Alright, three... Two... One.\" Kaila counts down. Right on queue there was a loud rumble in young Sophia's bowels.<br>\r\n<br>\r\n\"Oh no.\" Sophia whimpered as she clamped her knees together, hoping to stop what was about to be unleashed.<br>\r\n<br>\r\n</span></div></div>",
            "created":1443848400,
            "id":2043271,
            "title":"Let's go back, what was my mother like as a..."
        },
        "1542321":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "#1",
                "#2"
            ],
            "content":"<div class=\"\"><div> <span>Kaila suddenly snaps her fingers, not only do both Alida and Kaila turn invisible, but the three girls suddenly teleport to the dining room.  Alida and Kaila land perfectly at the side of the room, overviewing the table, where as Sophia lands, only in her panties, right in front of her mother, her vag landing in the meal her mother was currently eating, and her butt right in the queen's face. The queen, Alida's grandmother Victoria, looked much like her own mother in the present time, she wore a pure white dress that looked as if it were the white cap of a crashing wave, on her head she wore a glorious crown, the same crown that has been passed down through her line for generation. Her dress however looks to be slightly transparent, if you look hard enough, you can just make out a pair of baby blue panties with little cartoonish flowers printed all over.<br>\r\n<br>\r\nSophia lets out a small whimper as she unintentionally releases her bowels. Her panties suddenly sagging down from the sudden scat filling them. She opens her eyes and lets out a small yet mortified gasp upon realizing that she was in front of people, this sudden attention makes her control anything, making her begin to flood her panties with pee.<br>\r\n<br>\r\nShe begins to cry tears of humiliation as she uncontrollably messes her panties. Her pee dribbled down her legs and onto her mother's lap, who at the moment is surprisingly passive about the whole situation.<br>\r\n<br>\r\nThe queen waits until her daughter is finished, then calmly says \"Are you done yet?\" <br>\r\n<br>\r\nSophia turns around and gasps, the color of her face turning to a deep scarlet, now learning that she had humiliated herself right ontop of her mother. <br>\r\n<br>\r\n\"It seems my daughter hasn't grown out of diapers, fetch me one please.\" She says as she snaps her fingers. One of the maids nods her head quickly and grabs one quickly. <br>\r\n<br>\r\nSophia's face drains of all color as she realizes what her mom is about to do. \"P-please, not in front of all these people.\" She begs pathetically. The queen ignores her, and quickly lays the sniffling princess on her back, and pulls off her messy panties. The maid quickly returns, and hands a thick fabric diaper that is light pink with little sheep printed all over to the queen, who in turn begins to put it on her crying daughter. <br>\r\n<br>\r\n\"Hmm, this isn't enough.\" The queen murmurs to herself as she inspects her humiliated daughter.<br>\r\n<br>\r\n#1:  She sends her up to her room, and proceeds to be wedgied by an invisible Alida<br>\r\n<br>\r\n#2:  Victoria decides to humiliate her daughter further </span></div></div>",
            "created":1443848400,
            "id":2043285,
            "title":"Kaila suddenly teleports them somewhere humilia..."
        },
        "15423212":{
            "author_id":"skywatch",
            "author_name":"Sky Watch",
            "choices":[
                "Attempt to get Sophia in more embearassing situations.",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>Queen Victoria thought a bit and then snaps her fingers, a maid approches her and Victoria whispers in her ear. <br>\r\n<br>\r\nSophia looks scared by this. \"M-mother, don't you think I have been embearass enough\" she said, blushing.<br>\r\n<br>\r\nHer mother shock her head. \"No honey, I cannot just allow you to just get away with... Appearing in front of me and everyone else, using your panties as a toilet.\"The queen says, a bit confused on how it happened but she could guess later. \"Now Sophia honey you know I love you and I do believe a royalty should not be afraid of embearss sing themselves but I have limits and that such thing is wrong... I can live with it being in front of us all but the least you can do is not ruin a meal with it...\" Victora said, as a maid put a new plate with food on the same plate where her old plate was, which was thrown away.<br>\r\n<br>\r\n\"But moher, these two girls they-\" <br>\r\n<br>\r\n\"I don't want to hear it, no excuses or you will be punished more then you already are,my diapered daughter.\" The mother says as a maid comes back with a large bag of ice and a paddle. \"Now lean on the table honey.\" She tells her daughter.<br>\r\n<br>\r\nSophia does just that, wanting her punishment to be over with.<br>\r\n<br>\r\n\"Now this is called \"The Fire and Ice Treatment'  simply put our star maid, Angie, will use her paddle on you while I drop one cube of her per smack.\" She says as she takes the bag of ice. \"Ohhh I hope I put it on just the right spots\" she says sarcastically, knowing the ice will not help her at all. She resumes her seriou voice. \"Now because I love you and I think you couldn't take too much for your first time, I will give you a low number of 50 spanks.\" She says, holding back a smile. <br>\r\n<br>\r\nSophia eyes widen, not wanting to take this she looks at her mother. \"Please mother, don't be so hard on me.\" She begs, wanting to escape the embearssment.<br>\r\n<br>\r\n\"Honey this is for your own good but I do think I can make this easier one way.\" She snaps her finger again and a maid walks next to Sophia and shoves a pacifier into her mouth, which has strings attached as the maids ties them behind her head. \"Good now without any further interruptions, we shall begin.\" She says, moving her diaper so her butts is revered.<br>\r\n<br>\r\nSMACK drops cube, SMACK drops cube SMACK drops cube.<br>\r\n<br>\r\nIt only just started  and Sophia was struggling as she was spanks by her maid with her mother dropping one cube each hot but for some reason it landed on her back, on her, no where where she wants it too.<br>\r\n<br>\r\nSMACK drops cube, SMACK drops cube, SMACK drops cube, SMACK drops cube, SMACK drops cube, SMACK drops cube, SMACK drops cube, SMACK drops cube, SMACK drops cube, SMACK drops cube, SMACK drops cube, SMACK drops cube-<br>\r\n<br>\r\n\"Wow, I didn't know Grandma loved to humiliate mom like this.\" Alida said, surprised<br>\r\n<br>\r\n\"Your mom will get use to it, one day though she humiliates your grandmother and finds the fun in doing so.\" Kaila said, laughing at that event. <br>\r\n<br>\r\n\"So my love for humiliation runs in the family? Cool!\" Alida says, loving her family more.<br>\r\n<br>\r\nAs Sophia spanking was ending, she sees people were laughing at the event. Her face is red from crying but with this laughtor, she probably won't forget her humiliation today. As she stands up, her mother stops her.<br>\r\n<br>\r\n\"Wait.\" She says as she drags the remainders of ice to her panties, dragging the down to her crotch. \"Ok you can get up and roam free, I still demand you keep your diaper on until I see fit.\" Victora demanded.<br>\r\n<br>\r\n\"Can I at least get another dress? Please?\" Sophia begs.<br>\r\n<br>\r\n\"I don't know how you lost your old one but I see no reason you shouldn't get a new one. You may.\" The Queen says and hugs her daughter. \"Now I still love you honey and just think you overreact a bit to this, stop crying.\" She says as Sophia hugs back. After they break up she gives her daughter a stern look. \"Don't think I won't punish you for your behavior again, no pooping in my meals anymore.\" She tells her and walks away. <br>\r\n<br>\r\nSophia walks to her room, annoyed at the girls who did this. <br>\r\n<br>\r\n\"So what should we do now?\" Alida asked. The girls then...</span></div></div>",
            "created":1444194000,
            "id":2044887,
            "title":"The Fire and Ice Treatment."
        },
        "154232122":{
            "author_id":"awsomeanator1",
            "author_name":"Awesomeanator",
            "choices":[
                "Sophia can't help but use her diaper as its true purpose in front of everyone",
                "The crowd of people continue to humiliate her in a variety of different ways"
            ],
            "content":"<div class=\"\"><div> <span>\"How dare those two girls do this to me?\" Sofia asks herself with a grumble as she awkwardly waddles towards her room. Her blush continues to burn on her face as those who pass by her in the hallways get quite the view of the humiliated girl.<br>\r\n<br>\r\n\"I mean, who could possibly wedgie a princess? Who do they think they are?\" She prattles on as she finally reaches her door. Quickly she opens it up and steps inside.<br>\r\n<br>\r\nLetting out a sigh as she close the door, she quickly takes off the humiliating diaper, and quickly makes her way to her panty drawer. After moments of thinking, she decides to pull on a pair of white panties with a large pink teddy bear printed on the butt, along with large pink frills along the leg holes and waistband.  As she pulls them on, her fingers brush the tag, revealing that her name is written in black ink on it, as a reminder in case the underwear is lost, and it is known who to return it too.  Sofia blushed as she remembered multiple occasions of which she had lost her undies in the castle, and the humiliating retrieval of said underwear.<br>\r\n<br>\r\nJust as Sofia was clasping on a matching bra, she remembered her mother's warning, and looked back down at the fluffy diaper she was previously wearing.<br>\r\n<br>\r\n\"W-well if I have it on under my dress, nobody will notice, right?\" She asks herself, hoping for reassurance. She quietly re-straps the diaper on over her panties, and after taking a few more steps to get used to the awkward posture she says. \"Well it is quite soft...\"<br>\r\n<br>\r\nShe then grabbed a light blue sleeveless dress that reached just past her knees, and another pair of thigh high tube socks, and put them on.<br>\r\n<br>\r\n\"Now, let's go out to the market, I'm sure Allison is waiting for me down there.\" Sofia said to herself as she walked out of her room and back down the stairs.<br>\r\n<br>\r\n<br>\r\nAs she made her way out to the market, a thread from her dress had gotten snagged on the door she was leaving, which in turn began to slowly unravel her dress.<br>\r\n<br>\r\nSofia happily walked through the town market, humming a little tune to herself, and people around her began to snicker at her. She ignores them however, simply thinking that it was not directed at her, however her dress had already unraveled enough so that her fluffy diaper is fully uncovered, and some underboob is showing now. She continues to walk, and the laughing gets louder and louder, and she is still as confused as ever <br>\r\n<br>\r\n\"Ha ha! Get a load of the baby princess!\" Someone finally randomly shouts, getting a the crowd of people to roar in laughter. Sophia gasps as she looks down, instantly her face turning to a deep red.<br>\r\n<br>\r\n\"I-I'm not a b-baby!\" She stammers as small tears form in her eyes as she pathetically attempts to cover her humiliating diaper. She falls down on her hands and knees, her face on the ground hoping that it would help cover herself, however her butt is now up in the air and vunerable.<br>\r\n<br>\r\n\"P-please don't loo-Hng!\" She squealed as she felt someone reach into her diaper and tug on her undies. <br>\r\n<br>\r\n\"She even has her name on her cute widdle teddy bear undies.\" The same girl who yanked on her undies mocked, pulling the pink waistband up high.  Sophia let's out another squeal as she feels the soft cotton digging deeper and deeper up her ass as the wedgie progresses. She pulls even harder, lifting the padded princess off the ground by only her panties<br>\r\n<br>\r\n\"S-stop, these are my favorite undies.\" She begs as tears of humiliation for on her eyes, her begin falls on deaf ears however as the waistband gets snapped over her nose, locking her undies in a painful atomic wedgie.<br>\r\n<br>\r\nThe crowd of people laugh like crazy as they watch the poor girl crawl around like a child, her humiliating panties over her face like a mask, and her whimpering from the pain and embarrassment <br>\r\n</span></div></div>",
            "created":1456635600,
            "id":2110884,
            "title":"Something else..."
        }
    },
    "info":{
        "author_id":"awsomeanator1",
        "author_name":"Awesomeanator",
        "brief_description":"A story about a beautiful princess with a humiliation filled life",
        "created":1368405660,
        "description":"<td align=\"left\" class=\"norm\">This is a story about a young princess who loves to be humiliated.  <br>\r\n<br>\r\nUse any method of humiliation as wanted, simply no gore and vore.<br>\r\n<br>\r\nFeel free to contribute, but when you do, try and make the addition at least <u>two</u> paragraphs.<br>\r\n</td>",
        "id":1933140,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1590713520,
        "modified":1590713520,
        "pretty_title":"Tales of an Embarassed Princess"
    }
}