{
    "chapters":{
        "1":{
            "author_id":"maxesmol2",
            "author_name":"maxesmol2",
            "choices":[
                "Continue!"
            ],
            "content":"<div class=\"\"><div> <span>Thursday was like any other day for Brandon. It was mid-season, early October, which meant that after his gravy of a class schedule was over, he would have a couple hours to pack in the carbs and protein before round one of practice. Most of the freshmen and sophomores all still ate in the common areas, primarily because, by convention, all of them still stayed in dorms. It wasn’t until their junior year that he’d be joining the rest of the jocks in one frat house or another. That in turn meant more chances to hook up, as it was seriously hard to sneak in a pretty (or drunk) girl into an all-male dorm. <br>\r\n<br>\r\nAt least it’s only cold potatoes and mystery green vegan mash today, Brandon thought inwardly as he dropped his full tray on an empty table. Thursday was also the only day he didn’t manage to match his schedule with the other jocks. Trey – the defensive captain – as well as the rest of the defense filled up nearly one entire class of basic Economics before Brandon could get his request in. This meant that while Brandon was trying to choke down what’s been in the steam tray for a couple hours, everyone else was snoozing in one of the classroom buildings. <br>\r\n<br>\r\nIt would have been nice to have someone to complain to about the food – someone who might empathize with the general lack-of-effort given by the cafeteria crew. However, because he kept mostly within his clique (with the exception of the occasional hottie he tried to woo), he really had nobody to share his disgust with. To the left were a group of not-attractive-enough-to-keep-his-notice girls clucking away about some rudimentary politics. Behind him were the future business leaders of . . wherever. To the right . . . well, it was definitely a motley bunch. Freshmen, Brandon decided. All of them short, wearing outfits that ranged from rockstar drummer to emo-Mac-fanatic to motocross rider, and all of them were enamored with something they were playing with at the table. That something looked like a vaporizer with a couple spark plugs at the tip. Whatever it was, the young trio decided it was more interesting than what was on their plates, as nothing appeared to have been touched. <br>\r\n<br>\r\nRookie mistake, Brandon thought. If they don’t take a bite soon . . . On cue, the mild hum of conversation in the cafeteria jolted to a near roar as the rest of the defense came pounding in. The group Brandon was watching had quickly stashed what they were playing with in a backpack and stowed the backpack underneath the table. It’s then that they each, individually, caught Brandon’s curious gaze. The air hung with the kind of tension that hinted the football player was intruding on their privacy. He tried a lopsided smile just as Trey, the 6’5” 250 shaved-bald Senior and soon-to-be-drafted linebacker slammed his fist on Brandon’s table, jumping the single tray into the air and shooting that green sludge over its owner’s shirt. <br>\r\n<br>\r\nTrey couldn’t contain his laughter. One uncomfortably strong arm hooked around Brandon’s neck, hauling him in for a jockular but-not-too-close hug. <br>\r\n<br>\r\n“Oh, man! I could have totally YouTubed that! You, me, we could be stars!” bellowed the senior. <br>\r\n<br>\r\nYour sense of humor is perilously poor, as always, Brandon mused to himself. Just as shirts started to get too close, Brandon was shoved nearly off the table as Trey tried to distance the two. The rest of the group was filling out all the adjoining tables now and Brandon decided it was time to discreetly remove himself from the group. Another big hand on his shoulder shoved him back down in his seat as one of those monstrous offensive linemen squeezed his way into the opening next to him. Too late. One of the fatter O-linemen was piling into a seat across from him, unabashedly sticking his finger into some of the gunk left on Brandon’s tray and slurping it off his fingers. <br>\r\n<br>\r\nWith his mouth full of the slop, the big guy’s gaze met with Brandon’s, trading a look of disgust from across the table for a sheepish caught-in-the-act expression. Rolling his eyes, Brandon pushed the rest of the tray to the too-hungry-for-his-own-good blob across from him and casually looked to where the trio of freshmen sat. Conversation was at an absolute uproar and the more sane types were trying to quietly file out. As he expected, some of the defensive second-stringers were praying like crows on a dead carcass, tearing through the untouched freshmen’s meals while those three just tried to get out with the rest of their stuff intact. <br>\r\n<br>\r\nWith everyone else on his bench now distracted with talk about chicks, money, and football, Brandon managed to push himself away and slink away from his seat. He made it to one of the large garbage cans and was starting to push the solids still on his shirt off when one of the three he’d been curious about, dressed in a red and white motocross jacked, blue jeans, and all of 5’7” sidled up to Brandon offered an apologetic smile. Glancing up from the napkin dispenser, the free-ride sophomore noticed a large splotch of slightly melted jell-o on the shorter teen’s shirt. <br>\r\n<br>\r\n“I see they got you too,” Brandon mused, pointing a finger at the obvious-as-day stain. Looking down, the younger of the two shrugged and inspected the damage. <br>\r\n<br>\r\n“At least it was just the t-shirt. Say, I never got your name. I see you around from time to time,” answered the freshman. “I’m Chester.” It looked to Brandon like it took a fair amount of courage just to get the words out, but Chester surprisingly managed to raise a hand to offer a shake. Deciding that any amount of courage should be rewarded, Brandon gingerly took the gentle hand in his own and gave it a squeeze. <br>\r\n<br>\r\n“Brandon. And, unfortunately, I’m with those guys and I still get nailed.” Chester looked mildly surprised. An inner turmoil was playing through his face as the young freshman’s hand finally and seemingly reluctantly broke from the grip of the other. It seemed as if the younger freshman was coming to some sort of difficult decision and, letting out a breath he didn’t realize he was holding, he straightened his shoulders and pushed out his chest. <br>\r\n<br>\r\n“Would you like to go out for some coffee or . . maybe a drink sometime?” <br>\r\n<br>\r\nIt wasn’t a question Brandon was expecting, and the surprise on his face was evident as his brow lifted. The linebacker didn’t catch his own surprise in time and Chester quickly looked away, his shoulders slumping and his weight rocking back to his heels. <br>\r\n<br>\r\n“No I . . I mean, don’t get me wrong,” Brandon hurried and stumbled through as Chester’s confidence was being visibly shattered with each syllable. “I mean, hey. I don’t have a problem with . . . with you . . I mean. Your kind. I just don’t swing that way.” <br>\r\n<br>\r\nChester was visibly twitching, looking like someone who was desperate for any kind of escape. Brandon tried to give him a reassuring smile and patted on the shoulder to let him know that, hey, don’t feel bad about it, but it didn’t seem to provide much reassurance. Of course, it didn’t help that now two of the taller D-line core were making their ponderously heavy way towards Brandon and Chester; the conversation wasn’t likely to end well. <br>\r\n<br>\r\nOut of the corner of his eye, Brandon spotted two jocks trying to keep the other two freshmen that were at the table with Chester pinned inside a revolving door. Brandon’s hand quickly gripped Chester’s shoulder and he started walking the motocross rider towards the other two, taking a few steps with him before letting go and giving him a gentle but urgent push. <br>\r\n<br>\r\n“You better go help your friends. Maybe run some interference so they can get out,” Brandon suggested hurriedly. He didn’t get a chance to say “Goodbye” or “We could still be buddies” before the two tall D-linemen were on him. <br>\r\n<br>\r\n“What was that about?” barked one. “Yea. Were they mad about their little friends there?” mocked the other. <br>\r\n<br>\r\n“No. No. He just . . wanted some coffee,” Brandon muttered. The expressions on the other two instantly changed from mild interest, to shock, and then what could only be described as delighted evil. <br>\r\n<br>\r\n“Did he just ask YOU out?” spat out the taller of the D-linemen – Vincent, Brandon guessed. <br>\r\n<br>\r\n“Look, it was just innocent. Leave it alone,” Brandon returned, giving him a warning glare. But the two defensemen would have none of it and each of them laughed. The sound of their own laughter kept amplifying and magnifying until Trey and a few of his friends came over to find out what was so funny. Once Vincent finished the story, Trey put on a more sinister look. <br>\r\n<br>\r\n“Oh we have to get ‘em. And this time, we’ll be sure to Youtube it all,” Trey proclaimed. <br>\r\n<br>\r\nBrandon tried to explain everything, convince everyone it wasn’t a good idea, that it was just someone trying to hook up. He tried to convince the defensive captain that they should let it go, that he didn’t want to be a part of it all, but in the end, with threats of hazing and sabotage on the field, Brandon reluctantly agreed to their plan. He felt terrible about it, but he didn’t want to spend the rest of his time in college being mocked or shunned by the few people he related to. And besides – he could have a very bright future in the pros afterwards. He didn’t stand a chance going against the Captain, and reluctantly he finally came around. <br>\r\n<br>\r\nI’m going to regret this. Brandon repeated that thought over and over before falling asleep. </span></div></div>",
            "created":1382802360,
            "id":1684441,
            "title":"The Beginning"
        },
        "11":{
            "author_id":"maxesmol2",
            "author_name":"maxesmol2",
            "choices":[
                "Cheser didn't know what had happened",
                "Chester knew exactly what had happened"
            ],
            "content":"<div class=\"\"><div> <span>The plan was simple, albeit cruel. After managing to convince a resident advisor with a bag of weed that the team needed the freshman’s full name, the defense set up its trap. Over email (and with the entire defense BCC’d so that they could see he was sticking to the plan), Brandon stated that he had a change of heart, that they should get to know each other, and that he was new to this whole thing but he was willing to try everything. They agreed that they would meet for a drink after the next game, where the rest of the Defense would be waiting to tie up the “queer” and give him a hazing -- something involving making the kid walk home naked with shaving cream slathered on his butt. <br>\r\n<br>\r\nWhat the team didn’t know was that Brandon was planning on sabotaging the whole thing. He played his part – he sent the emails and BCC’d the team. But after each email, from a private email account, he would send Chester a warning to stay away, telling him of the whole plan, and to just play along long enough over email until they all finally got tired of the ruse and gave up. Brandon was starting to get nervous, however, as none of his private emails were being responded to. He had to assume Chester was receiving them, but as gameday was closing in, Brandon was growing more restless. <br>\r\n<br>\r\nThe game came and went. The team won, though if you asked him, Brandon couldn’t tell you the score. His mind was on tonight, and he could tell from the conversation in the locker room that he wasn’t the only one. One of the linemen had come up to Brandon to show him the shaving cream, smearing a little on his hand to demonstrate how it will look. Others were laughing and plotting for future hazing – as if there would be another chance. One would be enough, and Brandon doubted he’d ever hear from or see the poor kid again. <br>\r\n<br>\r\nThe coach came in and gave his gameday speech. Brandon tuned it out, quietly slipping out of his pads and into his regular hoody and jeans combo. After the coaches left, the rest of the team started to break up, half of them retreating to the showers while the rest started changed out of their clothes. Because it is a college of some respect, the locker room is closed off to reporters or outside personnel after the coach’s speech. The wide-swinging doors are always locked from the inside by one of the teammates and players would file out at their leisure by pushing the swinging door, then letting it close and lock automatically behind them. <br>\r\n<br>\r\nDuring the game, the locker room would also be closed off to outside personnel, which is why Brandon was looking curiously at a box that had been haphazardly left under one of the sprawling benches. It wasn’t a sports equipment bag, nor was it a backpack. Rather, it was a silver metallic case with a black handle. The cornerback that sat next to him was already in the shower, but his bag was in the open and clearly packed. To the left was a fire extinguisher. The possibilities were becoming slim in a hurry. <br>\r\n<br>\r\nWith a nudge from his foot, Brandon gently kicked the case out into the open and started undoing the latches. Aware that this wasn’t probably the brightest idea, but too curious to turn back now before someone else noticed and had the same idea, Brandon slowly tilted the latch open. Inside, much to his surprise was the same strange but unidentifiable object the three freshmen were all fawning over at the cafeteria just two days ago. <br>\r\n<br>\r\nOnly this time it seemed to be turned on. <br>\r\n<br>\r\nThe device started making a hum that it wasn’t making before, giving Brandon the impression that it was spooling up some sort of turbine. In fact, the spark plug-like things were rotating in a circle and were starting to emit some sort of bluish-green electricity. As Brandon was getting ready to slap the lid shut on it, Trey, who had been in the middle of changing and now only wore a jock strap, was standing over Brandon and the box and had a similarly curious look to him. <br>\r\n<br>\r\n“The hell is that?” demanded Trey as he reached down to poke a finger at it. And like a kid learning not to touch a red-hot burner for the first time, a spark snuck out and zapped Trey’s hand, which he instinctively yanked backwards and shook in the air. <br>\r\n<br>\r\nThe pain dissipated quickly as Brandon gave a concerned, though mildly scornful look back at the other jock. “How should I know? It’s not mine.” Whatever it was, it was starting to get angry and quick. Red light beams started shooting out in random patterns, bouncing off the walls as if they were made of a mirrored surface. It was starting to look like a New Years rave in the locker room as different colored beams continued to fire in a indiscriminate pattern. The bouncing rays of light even made it into the shower, where some of the football players could be heard yelping in surprise and shouting at the rest of the crew to hold the party until they were out. <br>\r\n<br>\r\nAnd that’s when everything went to hell. A bright light gleamed from the core of the device as the spark-plug like extensions started fanning out wider. The light grew too bright to look at directly. The shouting was getting louder – at least, it should have been. Everyone was getting more excited but nobody could see what was going on. The entire room was aglow with that radiant light; eyes were stinging yet everything was eerily quiet. And with a snap, the device turned off. <br>\r\n<br>\r\nBrandon couldn’t see for a while after that. He thought he heard a knock at the door, but it was so distant and faint that it sounded more like a rumble from an approaching storm. As everything started to get back into focus, the horrible reality of the effects the device had became terribly apparent. Like something out of a dream, Brandon was no longer standing in a cramped locker room. He was standing instead what looked to be a tall warehouse, but with the same familiar features of the locker room. As his eyes dropped back down, everything was still in their familiar places, except in much greater detail and in much larger proportion. <br>\r\n<br>\r\nHe wasn’t the only one. Dozens of confused football players were jogging across the floor of the now-enormous locker room, all of them starting to gather in tiny groups. Brandon tried to shout into the loud confusion to calm everyone down, but it was no use. Mass hysteria had started to build. Off in the distance he could hear what sounded like a locomotive slamming into a series of rail cars to link up. As he turned his attention to see what was generating that sound, Brandon’s jaw dropped. Standing in full motocross gear, as if he’d just suited up for a race, were the features of someone Brandon couldn’t get out of his head. <br>\r\n<br>\r\nChester had arrived. <br>\r\n<br>\r\nWith his riding helmet in his gloved hand, a cool but confident grin tugging at the corners of his mouth, Chester slowly strode in. How he got in was anybody’s guess, but one thing WAS clear – he got Brandon’s emails. There would be no rendezvous at the bar. The circle of jocks nearest the door – some of the skilled offensive players, Brandon could see – was starting to back away from the looming giant as he strode slowly and with purpose towards them. Each of those armored boot-steps thudded and echoed in Brandon’s ears. In just a couple steps he had made it to them. Judging by the height of those boots, each of those half-clothed jocks couldn’t be more than two or three inches tall. One – Mack, who apparently hadn’t been in on the whole charade that the defense was and had no idea who Chester could be – was valiantly waving his arms to try and get Chester’s attention. He was babbling something – probably asking for help – and it was clear Chester’s bright green eyes were picking up the efforts. Everyone else was slowly backing away from Mack, each of them perhaps having heard rumors. That didn’t stop Mack, though. </span></div></div>",
            "created":1382802600,
            "id":1684443,
            "title":"Athletes plan goes wrong!"
        },
        "112":{
            "author_id":"maxesmol2",
            "author_name":"maxesmol2",
            "choices":[
                "Chester showed them his \"little\" monster",
                "Chester took them, into his helmet"
            ],
            "content":"<div class=\"\"><div> <span>It didn’t stop Chester, either, who swung the toe of his white armored Alpine Star and stepped casually down on top of the desperate player. Weight settled down quickly and, with a sickening crunch, Brandon and most of the team watched in horror as their best receiver was squashed like nothing more than an ant. Rolling his weight forward, Chester twisted his booted foot left and right, smearing the former receiver’s remains on the black sole of his boot, leaving a streak in the tile. The message was clear. The rest now ran. <br>\r\n<br>\r\nIt didn’t do them much good as each of Chester’s purposeful strides caught one or two of them under those impressive boots, leaving little red stains in the tile with every step. The entire circle that had come together had fallen apart. Now that he had everyone’s attention, Chester seemed content to slowly herd them towards the shower. It wouldn’t do them much good – the tiled lip entrance to the shower room was a full foot off the ground to prevent water from flooding into the locker room if the showered drains were clogged. The reality hit Brandon in mid-stride as he found himself blindly following his panicked cohorts, caught up in the mob-mentality of the situation. <br>\r\n<br>\r\nEach clopping, thundering THOOM of those booted steps shook the ground with a tremor similar to the choreographed march of a massive army charging the battlefield. A shadow fell like a cloak over the group huddled in a corner. A couple hard-as-nails football players openly sobbed, some yelled defiantly, and others futilely clawed at the entrance to the shower room, where there was no other exit. Both tremendous boots thudded to a halt, forming an outward V with only a small gap between the heels and near the toes, daring one to escape. The small, fresh bloodstains visible on the white armor and black boot soles warned those who felt even the slightest twinge of courage. <br>\r\n<br>\r\nSlowly leaning forward on the balls of his feet, the leather and plastic creaking as weight shifted forward, Chester hunkered down on his heels. The white and red leather armored pants he wore grew tight on his thighs as his knees jutted out. For the first time, Brandon could spot an enormous python-like bulge pushing down one of Chester’s thighs and it was clear he was getting . . . excited. </span></div></div>",
            "created":1382803860,
            "id":1684450,
            "title":"Motorcyclist's revenge"
        },
        "1122":{
            "author_id":"maxesmol2",
            "author_name":"maxesmol2",
            "choices":[
                "Chester went to his house",
                "Chester went to motorcycle track"
            ],
            "content":"<div class=\"\"><div> <span>Wordlessly a crimson-and-white leather gloved hand reached into the crowd and started grabbing up each of the now-tiny jocks. Each one was carefully inspected – inspected for what, Brandon couldn’t tell – he was just trying to hide in the crowd. And each, one at a time, was dropped into the empty helmet. He could hear a few yelps and a few shouts as those powerful fingers seized one man after another, pulling them free, turning it about and staring at the tiny man’s face before dropping him unceremoniously onto the growing pile inside. <br>\r\n<br>\r\nAs the crowd thinned, Brandon’s heart started to pound. It’s now or never he decided, and quickly he bolted for it. Chester’s eyes tracked Brandon but the towering teen didn’t make a move, still intent on gathering his quarry as Brandon hustled past those heels and into the open. His lungs stung from the effort and, after a couple hundred yards at full sprint, his energy quickly depleted. Like everyone else, his stamina had been almost entirely spent on the football field and he just couldn’t keep up this kind of effort for long. Fortunately for him, he seemed to drift out of Chester’s interest. As he made it about a third of the way to the tall swinging doors, Brandon had to stop and lean against a football cleat to catch his breath, the grass and mud still fresh as it clung to the spikes at the bottom. <br>\r\n<br>\r\nAs Brandon turned to watch his comrades, he noticed that Trey had been seized up next. Chester’s expression changed suddenly. He had a murderous look to him that bordered on wicked. That gloved fist had the linebacker in his clutches, arms poking out over gloved knuckles while the rest of his body was engulfed. Trey’s expression started to change too as that leather fist started to squeeze. Muscles bunched up under Chester’s leather riding jacket and the little man in his hand was starting to howl. A gloved thumb lifted and pressed squarely to Trey’s mouth, silencing him and pushing his head backwards, straining his neck painfully. Muscles tensed again and what sounded like rice krispies meeting milk emanated from that grip. Chester’s grip unfurled and what was left of the crumpled defensive captain’s body fell to the ground with a wet-sounding splat. <br>\r\n<br>\r\nBrandon thought ht was going to be sick. Giving his helmet a little shake, as if testing the weight inside, Chester apparently came to the decision that he had enough. Standing back up to his full height, he then made quick work with the leftovers. One booted foot raised and quickly stepped down on each of the rest huddled in the corner, taking great care to make sure each one was pulverized. Lifting his head, Chester then walked casually into the shower room to finish the job. Brandon could hear the screams that were silenced by each rumbling booted step. While the giant was occupied and out of the room, Brandon made another run for it, this time jogging towards his own locker, looking for anything to hide in. <br>\r\n<br>\r\nBrandon passed by that silver case that had started this whole debacle and saw a concave discarded foam knee pad that had somehow popped out of a pair of football pants. There was just enough room for him to wedge his way underneath, and just in time. From under the opening he had wiggled through, he could see Chester was done exacting vengeance in the shower room and was making his way back into the locker room. Those white boots walked right towards Brandon, leaving little red splotches that slowly faded with each new step. Surely he can’t see me, Brandon thought in mid-panic, listening to his heart race through his ears. Each terrible footstep was louder than the last and was the only thing the frightened jock could sense. It was then he realized it wasn’t him the behemoth was after – those armored feet stopped in front of the silver case and a hand grabbed it up. <br>\r\n<br>\r\nRisking a glance out from underneath, Brandon snuck just enough of his face out to see that Chester was removing the device from the case and was now actively filling it with the contents of his helmet. Dozens of football players were dropped inside. Fortunately for them, the foam padding inside lessened their fall. It was only when one of their jock-friends fell on top of them did they feel discomfort. And then the lid closed. <br>\r\n<br>\r\nWhat could he possibly want with all of them? Why didn’t he just finish us all off? Brandon thought along these lines for several long heartbeats and didn’t realize until it was too late that Chester had discovered him. As much good as it would have done him, Brandon thought as he quickly yanked himself back inside the makeshift cave. With careful and almost mocking slowness, one of those vast white boots scooted forwards along the ground and wedged underneath the opening of that knee pad. Slowly the toe lifted, brushing against the little jock and revealing Brandon as the kneepad was rolled off. The impressive and looming footwear then eased itself next to the terrified linebacker, settling down without making a sound. <br>\r\n<br>\r\nBrandon froze, heart still pounding, adrenaline flowing and urging him to run. But he knew it was useless – if Chester wanted him to be squashed like the others, he would just do it. Instead, the towering teen just examined him from above, a thousand different thoughts and expressions flickering in his eyes. A grin touched those lips, but it wasn’t as cruel or wicked as it had been before. But Chester definitely looked . . . pleased. Crouching down on those heels again, Chester gingerly reached towards a frozen-in-his-own-fear micro-stud, those gloved fingers slowly surrounding him. He was surprised at the gentle nature of the way he was held, as Brandon thought for sure he would share the same fate as the others. Instead, with an almost reassuring squeeze, the now almost comfortable leather grip carefully lifted Brandon to that clean-shaven face. <br>\r\n<br>\r\nAnd for the first time, the titan spoke with a booming voice that rattled Brandon’s ribs. <br>\r\n<br>\r\n- I couldn’t make our ‘date’. Prior obligations, you see. But let’s skip the drink and I’ll just take you over to my place instead. <br>\r\n<br>\r\nBrandon couldn’t speak. His mouth worked and his tongue dried up as he tried to protest or appease or do something. Chester took great amusement in the tongue-tied football player’s expression. An unseen hand was busily working at something Brandon couldn’t immediately see, but just as quickly became apparent. That fist craned lower. The zipper on those tight pants was already pulled all the way down, and Brandon got a good face-to-cock look at the sucker stuffed in a pair of black, glittering boxers. He wasn’t sure if it was just his size, or if the short stud was actually packing a monster this whole time. Probably both, Brandon thought as he hung there in the giant’s grip. <br>\r\n<br>\r\nWithout time to get the coordination to get the words out of his throat, Brandon soon found himself drifting forward. The scent from the young buck was pervasive and flooded the jock’s head, overwhelming all of his senses. As the waistband was pulled forward, it only got more potent. That would be the least of his worries, however, as Brandon was summarily squeezed up against the long rod that was crammed into those too-tight pants, torso pinned against the flaccid tip before everything was quickly closed around him. Darkness set in and Chester rumbled something – he heard the words ‘hold’ and ‘tight’ – and the little jock decided he’d better concentrate and keep his hands around the steadily beating organ. <br>\r\n<br>\r\nAnd just like that, they were off. Each heavy step shook Brandon and squeezed him just that much tighter against the rider’s cock, the flesh going from warm to hot as all the heat was kept well-insulated. Everything suddenly grew impossibly strained and Brandon got the impression that the giant had just thrown a leg over a seat to straddle. A loud rumbling quaked all around him with just a kick of one of those boots. The monster was on a motorbike, that much was certain. Possibly a crotch-rocket, but whatever it was it was loud.<br>\r\n<br>\r\nMinutes passed like days, but at least he had the comfort of knowing he wouldn’t die. At least not yet. He’d be in the giant’s lair, next, and if the swelling flesh against his chest was any indication, it was going to be a long night . . . . </span></div></div>",
            "created":1382804040,
            "id":1684452,
            "title":"Make a new \"Friend\""
        },
        "11222":{
            "author_id":"maxesmol2",
            "author_name":"maxesmol2",
            "choices":[
                "he had fun with you...",
                "he had fun with you and the rest of your team..."
            ],
            "content":"<div class=\"\"><div> <span>the vibration of the motorbike shaked your little body against the huge cock's head. the leather pants was tight and pressed the cock againts Chester's thigh, with you between them. the sweat and scent from the young buck invaded your little nose, and the sound of the motor was insupportable. finally, few minutes later, the motor had turned off and Chester was walking, with you hanging of his cock. he stopped and talked with somebody.<br>\r\n<br>\r\n- take care from them, Dom. And you must check my bike later. but first I have to make something, have fun while.<br>\r\n<br>\r\nChester said and then, he walked again. when he stopped, you heard as he locked up a door and then he sit again over his bike. the pressure grew up inside the pants, and was hot inside too. but then, you heard as a zip was opened and a gloved hand took you out from the leather pants. the first thing that you noticed was the smell. over the leather and sweat's smell you could smell gas and grease, as a mechanic shop. you were on Chester's hand, the gloved palm was warm and soft. but you were still terrified. this young man had killed the half of your football team, smashing them under his motorcyclist's boot. you looked up and saw his naughty face. his hair was long and untidy, blonde dark, and a short beard of the same color grew under his mouth, making him seem older. you noticed this a some other things that you didn't noticed when you saw him the first time.<br>\r\n<br>\r\nhis dark green eyes was watching you. you didn't know what to do. the silence was long, and you tried to keep balance as the gloved of leather was smooth under your naked feet. then you noticed that you was naked too! you couldn't dress when you was in the looker room because you was looking for that curse box!  you tried to cover your little and erected dick,  at the time that chester said:<br>\r\n<br>\r\n- so, you enjoy your time with chester junior, not?<br>\r\n- not! this it's not what you think!<br>\r\n- on the contrary, little brandon, your little member say that it's exactly what I am thinking.<br>\r\n<br>\r\nand them he looked for your little dick with the other hand. he holded your little arms easily and with the other hand he started to rub your little cock. first, you could feel one gloved  fingertip chafing your little cock head fastly for a few seconds. that was great! the huge finger touched just your peehole, but the sensation was amazing. then, you felt as two huge fingertips covered by leather started to squeeze slowly all your little member. a huge finger was holding your arms over your head and pressed your face too, so you could smell the intense smell from leather mixed with the sweat and some metalic smell while Chester squeeze your little cock like if it was a little peanut.<br>\r\n<br>\r\n- the leather feel good against your little dick, doesn't it?  <br>\r\n<br>\r\nbut you didn't say anything because his gloved finger was pressing your face strongly. but he was right, the leather was great against naked body and your member. and the huge force that the fingers behind the leather applied against your dick made you feel weak and exuberant. just when you was about to ejaculate, Chester took off his fingers from your little cock. you hated him for that.<br>\r\n<br>\r\n- I have something that I would like to share with you, little brandon.<br>\r\n<br>\r\nyou heard as Chester looked for that thing between some others next to you.<br>\r\n<br>\r\n- yeah, here it is! <br>\r\n<br>\r\nhe said at the moment that you felt a huge and smooth thing against your crotch and part from your butt. <br>\r\n<br>\r\n- so, little brandom, I have had a lot of good time with this so I hope that you do too.<br>\r\n<br>\r\nthen, the thing started to vibrate and chester was pressing it against your crotch. fastly, few seconds happened and the thing get warm before that you let free your cum, but chester kept the vibrator against your little cock until your last drop of cum was out from your little balls. that was the biggest load that you had ejaculated ever. then, Chester put you on the bike's seat, between his legs covered by leather's pants. you could felt the bike motor's warmth, trough the leather seat, and you know that some of the warmth come from Chester's butt. you looked up and saw what was the thing that chester used to make you end. that was the hugest dildo that you ever seen. thick as a coke can and at least one foot large. gloved Chester's fingers wielded the huge sex toy and you could see some cum's drops on the tip from the huge thing. then, Chester scraped some of your cum with his gloved finger tip and licked it, while he saw you naughtily. then, he put the huge dildo on the table next to the bike and he crossed his arms.<br>\r\n<br>\r\n- then, Am I still looking like a monster?<br>\r\n- Of course! You made this of me! and you killed my friends! what kind of monster are you?<br>\r\n- I just gave them what they deserved. but you tried to warn me, you aren't like them, because that I let you live. but you can't understand that, so I can't grow you back. also, you are cute! I can keep you like my little pet boyfriend. <br>\r\n- what? I'm even not gay!<br>\r\n- but you little dick says something else.<br>\r\n<br>\r\nYou look down and saw about what Chester was talking. your little cock was erected again.<br>\r\n<br>\r\n- i'm... I just have a... fetish... a leather fetish.<br>\r\n- Well, that's right! I have a lot of leather things from my suits of biker. you would like to be with me.<br>\r\n<br>\r\nhe said while he rub your little cock with his huge gloved finger. but you saparated fastly and run to the front of the seat, between his knees.<br>\r\n<br>\r\n- you can't make me horny whenever you want! I'm a human!<br>\r\n- yes, you are a little ungrateful human. I would could leave you in the looker room and some other would could find you and make bad things with you.<br>\r\n- anyone is better that you! nobody would make me their sex toy!<br>\r\n- hmmmm... a new sex toy, that's sounds good.<br>\r\n<br>\r\nand then you was noticed that didn't matter anything that you could say, you wasn't going to get rid of Chester and your new size. then, you looked down and cried of frustration. while you cried, chester stood there, sit and looking your pathetic form between his knees. few minutes later, mourn you stopped and looked the seat. you noticed that in the middle of the seat there was a line with marks and numbers.<br>\r\n<br>\r\n- it's a tape measure<br>\r\n<br>\r\nChester sais, looking down to me. <br>\r\n<br>\r\n- Some races, there are girls that notice my gifted bulge. so, if they approach, I don't need tell them how large is my dong, they can see it right here. let see how large are you.<br>\r\n<br>\r\nthen, chester took you and extended your little body against the leather seat. the 0 mark was just under Chester's Balls, so your feet could touch the leather of the pants and felt the weight and the warmth that emanate from Chester's crotch.<br>\r\n<br>\r\n- a little less than 3 inches, little brandom. now, do you want to know how large is Chester junior?<br>\r\n<br>\r\nbut you didn't have time even to say anything, as Chester introduced his hand in his zip and took something from there. You had hung from the huge cock head of this rider, but not even that could prepare you for that you saw in that moment. the longest dong that you ever saw before. it was middle hard and was so long as Chester's forearm, including his hand and his middle finger. was pale white and the warmth that emanated from it was intense. you had to move for not be crushed by the long phallus. when the dong was recumbent against the leather seat, you was near the huge dick's base.<br>\r\n<br>\r\n- You can't see the magic number from there. walk to the tip, little brandon.<br>\r\n<br>\r\nall sign of inhibiting was erased from your mind at the moment that Chester show you his huge dong. you walked slowly next to the dick, and your hand rubbed the dick's warm skin while you walked toward the cock head. chester started to moan slowly when you did that. the smell was intense! the musk and the precum smell flooded the air around you, between Chester legs. the leather seat was heating by the warmth that emanated from the cock. when you come to the dick's tip, you could see a precum's puddle and the long foreskin that fall over the leather, and covered the number that mark the dick's length. <br>\r\n<br>\r\n- tell me little brandon, how large is my dick?<br>\r\n<br>\r\nyour little hands took the flaccid skin of the foreskin soaked of the precum and you  thrown from it. chester moaned deeply. trough a thick puddle of precum you could see the number that was just under the cock head tip.<br>\r\n<br>\r\n- 16...<br>\r\n- I can't hear you little brandon.<br>\r\n- 16 inches.<br>\r\n- that's right little brandon, and still isn't totally hard.<br>\r\n<br>\r\nthen, Chester took you up from the seat and he...</span></div></div>",
            "created":1382837820,
            "id":1684628,
            "title":"Time to know each..."
        }
    },
    "info":{
        "author_id":"maxesmol2",
        "author_name":"maxesmol2",
        "brief_description":"when you friends circle is so closed, maybe the \"new people\"  would find forms to meet you",
        "created":1382800800,
        "description":"<td align=\"left\" class=\"norm\">This another story from Coiled Fist that I loved when I read. But for some reason, the original author didn't make another chapters. So, I give it you here, and if you want, write new chapters!<br>\r\n<br>\r\nCliques (<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.coiledfist.org/article.php?story=buck_cliques01\" target=\"_blank\">http://www.coiledfist.org/article.php?story=buck_cliques01</a>)<br>\r\n<br>\r\nIn every school in the history of schools there have been cliques. In high school, there might be the jocks, the nerds, the intellectuals, the a/v nerds, the fashionable, and the hippies. In college it’s no different – you have the student council, the various sports guys, and the emo-tellectuals. For Brandon, his friends were pretty much picked from the start. He had a full ride to State courtesy of his ability to throw his two-hundred and thirty-five pound bulk around at 4.3 speed. That meant that his friends would be sharing the showers, dorm rooms, and practice field with him.<br>\r\n<br>\r\nWhat the brown-eyed, brown-haired, 6’3” stud didn’t know is that maybe if he had paid a little more attention to the other cliques, maybe he’d still be in football. Maybe he would have graduated. Maybe he even would have had a future . . . . </td>",
        "id":1960029,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1382837820,
        "modified":1382837820,
        "pretty_title":"Cliques "
    }
}