{
    "chapters":{
        "1":{
            "author_id":"chairman",
            "author_name":"ChairmanOfTheBored",
            "choices":[
                "He just grows slowly over time.",
                "Using the muscles at all causes tiny growth every time.",
                "He gets bigger every time he cums.",
                "He gets bigger whenever someone fantasizes about him.",
                "Author's choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While the growth itself is caused by magic, it has a catalyst.  What is that?</span></div></span></div>",
            "created":1359513600,
            "id":1519952,
            "title":"What exacerbates the growth?"
        },
        "12":{
            "author_id":"chairman",
            "author_name":"ChairmanOfTheBored",
            "choices":[
                "It's Saturday, go to the skate park and test this body out.",
                "It's Monday, go to school.",
                "It's Saturday, go to the mall.",
                "It's Monday, skip school, hang out with bad crowd.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Tom was sick of being such a little wimp.  He always felt so inadequate in the locker room, jealous of the jocks blatantly showing off for eachother, so he saved up his money a bought a set of weights second-hand.  He'd been using them for weeks and wasn't seeing as results, but decidedly chose not to give up quite yet.<br>\r\n<br>\r\nHe piled thirty pounds onto the bar to bench press, and the second his hands touched the bar, he felt really relieved.  He knocked out rep after rep like never before, and wasn't even feeling tired.  Over the course of two hours he piled more and more weight onto the bar every few minutes without ever stopping for more than a couple seconds, until he was using all his weights, a hundred pounds, and still had yet to feel the burn.  Eventually, he got bored, and sat up, and glanced in the mirror, to find, where Tom was sitting before, now sat a swimmer who modeled underwear in his off time with a suspiciously Tom-like face.<br>\r\n<br>\r\nHe immediately popped the biggest boner ever, and spent the next few hours flexing in front of the mirror (making him a little bit larger too) and fell asleep with a smile on his face.<br>\r\n<br>\r\nWhat's Tom gonna do tomorrow?</span></div></div>",
            "created":1359514500,
            "id":1519964,
            "title":"Using the muscles at all causes tiny growth eve..."
        },
        "121":{
            "author_id":"chairman",
            "author_name":"ChairmanOfTheBored",
            "choices":[
                "Skate park restroom.",
                "Someone's house.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Tom was feeling more confident than ever before, cocky even.  He skated to the park (which made his legs a little firmer) in just a pair of shorts, now a size too small, and scanned the crowd until he spied a cute blonde guy in a tight tank top and a snap back.  He was average height (same as Tom) and somewhat muscular.  He was talking with a pretty girl who seemed really enamored with him.  He flexed his arm and she grabbed it and giggled.  Just after, Tom walked up and separated the two.  He had no idea what he was doing, as if operating on autopilot.  If it had been anyone else, blondie would have punched them right in their fat ugly mug, but Tom made him feel quite intimidated.  Then he gripped the boy hard and kissed him for about twenty seconds.  A few seconds in, blondie's eyes rolled back into his head and he went limp in Tom's arms.  It felt like Tom's tongue was filling his whole mouth.  <i> Oh god, what is happening, what am I doing </i> they both thought.  Then, a big wet spot showed up halfway down the right side of his shorts and slowly trailed down.  Little white droplets fell and hit the ground or got caught in his leg hair.  At this point, the girl was pretty upset and slowly backed off to drape herself over another guy's shoulders.<br>\r\n<br>\r\nBlondie was infatuated and started following Tom around like a puppy, so he decided, fuck it, and went through the same procedure with a really jacked ginger with almost no body fat who was a foot taller than him, and a skinny kid with medium length black hair, who was a few inches shorter than Blondie.  Tom didn't bother to ask their names, so they will henceforth be referred to as Blondie, Ron, and Emo Faggot, respectively.<br>\r\n<br>\r\nWhere are they gonna go?</span></div></div>",
            "created":1359515160,
            "id":1519975,
            "title":"It's Saturday, go to the skate park and tes..."
        },
        "125":{
            "author_id":"noktalok",
            "author_name":"Noktalok",
            "choices":[
                "He decides to workout even more, with just his own equipment.",
                "He goes to the gym to workout or buys some heavier equipment.",
                "He discovers that he grows slightly when he comes as well."
            ],
            "content":"<div class=\"\"><div> <span>Tom woke up early the next day, getting up and walking to the bathroom while still somewhat sleepy. A few minutes later he suddenly remembered what had happened the last day as he looked at himself in the mirror. He looked amazing compared to just a couple of days ago, making him pop a boner at himself again, which he now realized also looked slightly bigger than he was used to. He still felt amazing, he wasn't even sore from his two hour workout yesterday, so he decided to try working out again and see if it would still work this time or if it was a one-off thing.<br>\r\n<br>\r\nHe decided to just load all his weights onto his bar immediately to get the most out of it and started to lift it on his bench. Just like yesterday he could pump out rep after rep without any issue, his muscles slightly swelling each and every time, but not enough for him to notice for every rep. It did seem that the increased weight sped up the process though, and after just an hour of working out he looked like an amateur bodybuilder, he wasn't huge yet or anything. but the jocks certainly couldn't make him feel inadequate anymore, he was probably bigger than most, if not all, of them now.<br>\r\n<br>\r\nTom decided to take a short break, just because he was getting bored and he had yet to eat breakfast anyway, but decided to go back to working out again when he was done. It might be boring to workout, but the results were so much worth it while this worked for him, and what if it stopped? He had to make sure he exploited it while he could if it was temporary, he was so happy to no longer be scrawny.<br>\r\n<br>\r\nHe lied down on the bench and started to lift again, the bar still loaded from his last workout, and started pumping the bar like crazy. Lifting the bar, even with all his weights, was barely a challenge anymore, he would have to get something heavier, or go to the gym if necessary. While working out this time he suddenly felt the tip of cock feeling a bit colder and looked down towards it. It had started to slowly creep out of his shorts, and he was still soft! He had to see this closer so he put down the bar and looked at the mirror. He now more resembled an actual bodybuilder than an amateur, and his cock was starting to rise up, dragging the bottom of his shorts up, it looked huge.<br>\r\n<br>\r\nTom grabbed a measuring tape, he <b>had</b> to know how big it had gotten. He gasped when he read his measurements. His fully hard cock had become a massive 16-inch rod just from his small workouts. It's girth had increased to a massively thick 10 inches around and his balls had swelled to baseball sizes. This was simply too much for Tom and he had to take some time to masturbate while flexing for himself and admiring his own genitals.<br>\r\n</span></div></div>",
            "created":1498464240,
            "id":2342864,
            "title":"It's Sunday. He decides to try working out again."
        },
        "13":{
            "author_id":"zepar666",
            "author_name":"zepar666",
            "choices":[
                "Ask the demon to stay around and help you get bigger.",
                "Go to show off your new size and find yourself humans to have fun with.",
                "You don’t need anyone you do what you want."
            ],
            "content":"<div class=\"\"><div> <span>“GOD DAMN IM HORNY!” Tom thought to himself as he woke up from being so horny. He pulled out his phone and started jerking off when a demon appeared before him.<br>\r\n<br>\r\nTom jumped back in his bed covering himself. “Wha- what the fuck are you?!”<br>\r\n<br>\r\nThe demon which chose to take on a rather sexy form Tom thought had not moved an inch since Tom spotted him and until he spoke Tom wasn’t sure if he was asleep or not. <br>\r\n<br>\r\n“Insignificant speck! How dare you address me with such a tongue! You’re lucky I’m here on a purpose or I’d simply destroy you.” The demon hissed but even though Tom took him seriously thought his voice was very seductive.<br>\r\n<br>\r\n“My bad dude.” Tom apologized sincerely. “I just didn’t expect to have anyone or I suppose in your case anything in my room while I was..um...well you know. Anyways is there a reason you’re here?”<br>\r\n<br>\r\nThe demon looked at Tom. He was completely helpless and fragile. Why was he even here? He was a superior being after all. “My name is Asmodeus: I’m the demon of lust.” The demon said “and I’m here because you’re one hot human.” Asmodeus walked over to toms bed seductively and sat next to where Tom was laying. The demon was quite bigger than Tom: was around 9 or 10 feet tall with horns that made him another foot taller.<br>\r\n<br>\r\n“Thanks dawg. You’re looking hot yourself” Tom said as he tried carressing the demons face and playing with his horns. Which was when Asmodeus kissed him.<br>\r\n<br>\r\nThey made out for a while before Asmodeus spoke while rubbing his crotch. “I normally don’t go for humans but I like you...but I won’t be having a partner or Slave of mine being so weak! I’m sure you’ve noticed you’re really horny today...that’s gonna be a new part of you.”<br>\r\n<br>\r\nTom looked confused “What did you do to me?”<br>\r\n<br>\r\n“I gave you a gift...every time you cum you’re going to grow!” Asmodeus kissed Tom again biting his lip this time.<br>\r\n<br>\r\nTom was enjoying this. He thought the demon was hot and here he was being seduced by the same demon and being given a gift. That’s when he broke away. “So will I be able to be bigger than you? I kinda like being the tall one..”<br>\r\n<br>\r\nAsmodeus laughed very evilly. “Oh you’ll be bigger alright a lot bigger.”<br>\r\n<br>\r\n“And all I have to do is cum?” Tom asked. <br>\r\n<br>\r\nAsmodeus nodded to an excited Tom jumping into his lap and kissing him almost as a thank you as Asmodeus kept jerking Tom off. Tom came and grew to an astounding seven feet.</span></div></div>",
            "created":1536810420,
            "id":2546957,
            "title":"He gets bigger every time he cums."
        },
        "15":{
            "author_id":"chairman",
            "author_name":"ChairmanOfTheBored",
            "choices":[
                "Other.",
                "Other.",
                "Other.",
                "Other.",
                "And finally, other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's where you can write about choices not listed in the previous section.</span></div></span></div>",
            "created":1359513660,
            "id":1519956,
            "title":"Author's choice."
        }
    },
    "info":{
        "author_id":"chairman",
        "author_name":"ChairmanOfTheBored",
        "brief_description":"A gay skater boy wakes up to find his muscles growing larger.  Please add!",
        "created":1359513240,
        "description":"<td align=\"left\" class=\"norm\">Tom is a gay teenage skater with medium length black/grey hair who wishes he wasn't so scrawny.  One morning, he wakes up to find that for whatever reason, his muscles and cock are growing, and over time, he basically becomes the bodily incarnation of sex.</td>",
        "id":1916253,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1536810420,
        "modified":1536810420,
        "pretty_title":"Skater Boy Growth Spurt"
    }
}