{
    "chapters":{
        "1":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Dimential ripe in space/time.",
                "Journey",
                "Transported",
                "\"Died\" some how",
                "wish to challage himself"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How did Naruto get to the Yugioh Universe?</span></div></span></div>",
            "created":1328739540,
            "id":1273052,
            "title":"How?"
        },
        "11":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "First anime",
                "Second anime",
                "GX",
                "5Ds",
                "Zexal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where in the Yugioh Time line is he?</span></div></span></div>",
            "created":1328739780,
            "id":1273054,
            "title":"where?"
        },
        "115":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "The Next day.",
                "That night",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">It was two months after the War ended and Naruto was walking and thinking. Just then the sky opened up. It then several twisters formed and started a vacum like wind which started to suck up several indivuals, Including Naruto. Hey was is the big idea? Naruto said. There must be something I can do. <br>\r\nKuruma, the Nine-tails Fox then said. Naruto it is too late to save the ones already in the rift but if our power goes through then it should close.<br>\r\nIn that case. Naruto then Entered the Tailed beast chakra form and flashed into the rift. The moment he got in the rift shut. Naruto woke up in an alleyway.<br>\r\nOkay where am I? As Naruto was getting up he noticed something in his hand. It was a Rectangler box. What is this. He opened it to find cards. Cards?  Kurama can you hear me?<br>\r\nYes. He said more then that. Naruto then turned around and show Kurama but he was smaller then he use to be. How are you here? Naruto asked. Don't know but from the fact that I am can't touch anything I'd say that You are the only one that can see me. Well first thing we need to do is find out more about this place. Naruto then headed for the Library.<br>\r\nOnce there he started his research. Okay I understand how things work here now I just need a place to stay. How am I going to do that? Naruto was walking thinking when he suddenally collabed. When he woke up he found he was laying in a bed. Oh your up. Naruto turned his head towards the voice and saw an old lady. That is good.<br>\r\nWhere am I? And how did I get here? <br>\r\nMy Grandson and his friends found you on the street and brought you here. she said. <br>\r\nWhat is your name Mrs...<br>\r\nHaru Tsukumo.<br>\r\nGranny Tsukumo. My name is Naruto Uzumaki. It is nice to meet you. <br>\r\nYou too. Are you up to eating. <br>\r\nYeah, I am. Naruto then got up. Let's go. Haru then lead him to the table Where Naruto sat down. Once there he saw three others. One was a young woman with reddish hair and a strick of red. The other two were younger kids. One girl and one boy. The girl had green hair and the boy had black hare with red hightlights. Well go your up. The boy said. You were out for a while. If your up to it let have a duel.<br>\r\nYuma, He just got up he is in no condition to duel you. The younger girl said.<br>\r\nOh Tori. The boy named Yuma said. <br>\r\nFood ready. Haru said. <br>\r\nYuma was about to reach for food when Haru yelled at him. Yuma, we have a guest.<br>\r\nRight. Sorry. <br>\r\nIt is okay. Itadakimasu. With that we ate. After dinner I got up to leave.  When Yuma stoped me.<br>\r\nWhere are you going?<br>\r\nI don't know. Truth is that I don't have a place to live or even a way to get money.<br>\r\nI have an idea. Haru said. You can stay here. <br>\r\nThanks but I don't wish to be a bother.<br>\r\nNot at all. Yuma said. But first. How about a duel. <br>\r\nOkay. But how about tommorow, I am tired and need to rest.<br>\r\nAlright then. Yuma said.</span></span></div></div>",
            "created":1341784800,
            "id":1374217,
            "title":"Zexal"
        },
        "1151":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Later that day",
                "Later that day",
                "Later that day"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">The next day came and Naruto and Yuma were getting ready for there duel. You ready? Yuma asked.<br>\r\nAs ready as I can be. Naruto said. <br>\r\nLet's duel.<br>\r\nNaruto: 4000<br>\r\nYuma: 4000<br>\r\nI will go first. Yuma said. I draw. I summon Gogogo Golem in attack mode. Just then a Giant stone man appeared with one red eye. Attack: 1800.<br>\r\nMan that is a strong monster. Naruto said. I am doomed already.<br>\r\nSince it is the first turn I can't attack. Yuma said. Hearing that gave Naruto some relief. So I set one card face down and end my turn.<br>\r\nOkay my move. I draw. Naruto looked at his hand. What can I do? Naruto asked himself. Well here goes nothing. I summon this monster. Naruto then played a monster. It appeared as a Human-like creature with red armor and longish brown hair. <br>\r\nGential Giant Shinobi<br>\r\nAttack: 1700<br>\r\nDefence: 1400<br>\r\nWhy would you summon a monster in attack mode weaker then mine. Yuma asked.<br>\r\nI did. Oh man. I set this two cards face down and end my turn.<br>\r\nMy move I draw. Now Gogogo Golem attack. <br>\r\nThis is bad. Naruto said. What to do? <br>\r\nUse one of your face downs. Kurama said.<br>\r\nOkay but which one. It was too late as Naruto's monster was destroyed.<br>\r\nNaruto: 3900<br>\r\nNaruto, Tell me something. this wouldn't be your first duel would it? Yuma asked.<br>\r\nIs it that clear. Naruto said rubbing the back of his head. Yeah it is.<br>\r\nHow is it that you never dueled before?<br>\r\nI don't think you would believe me but here it goes. I am from another dimentional of space and time, one without this game. I was sucked in to this place and when I awake This deck was next to me. <br>\r\nIf you never dueled then why did you accept my challage?<br>\r\nI promised you that I would duel you and I never go back on my word. Now I wish to see if i can do better. <br>\r\nAlright then Your move.<br>\r\nI draw. I summon this monster. A man in a green body suit and what looked like a black bowl cut appeared.<br>\r\nFist Fighter Shinobi.<br>\r\nAttack: 1900<br>\r\nDefence: 1800<br>\r\nNext I activate this card. Spell Card, Monster Reborn. So I bring Gential Giant Shinobi back to the field.<br>\r\nNow I attack with Fight Fighter Shinobi. Attack with Leaf Huricane.<br>\r\nI activate Attack Invulnerability. And I choose to make it that Gogogo Golem can not be destroyed.<br>\r\nYuma: 3900<br>\r\nOf course I still take the damage.<br>\r\nI end my turn. Naruto said.<br>\r\nMy move. I draw. <br>\r\nYuma, I don't want you to hold back. Give me your best.<br>\r\nOkay then I summon Gagaga Magician in attack mode. With that a human appeared wearing a coned hat and cloak both black with orange flames.<br>\r\nAttack: 1500<br>\r\nNext I overlay my Gogogo Golem and my Gagaga Magician, to XYZ summon. With that the monsters turned into orbs of light and enter a void that opened. Then the void disappeared and stood there was a monster with two orbs flying around it. Gagaga Gunman. A man with two strangle metal things in his hands (guns) <br>\r\nAttack: 1500<br>\r\nBut That monster has the same attack as that magician. Naruto said. I don't get it.<br>\r\nIt is called a special effect. And for XYZ monsters you have to detach on overlay unite to use it. Now I attack and detach an overlay unite to use Gunman's effect. While in attack mode I can increase his attack by 1000 Gunsman attack: 1500 &lt; 2500... and decrease one of your monsters by 500. I will do it on Fist Fighter Shinobi.<br>\r\nAttack: 1900 &gt; 1400.<br>\r\nNow I attack. I activate my face downs. First a Counter Trap called Failed Assignment. and Second Replacment Technque.<br>\r\nYou can't do that. Yuma said. Really? You can.<br>\r\nThis confused Naruto. Then it hit him but he contiued his turn. Replacment Technque negates your attack but me sending the top card of my deck to the grave. Naruto did that. Next Since your attack was negated by a card effect Failed Assignment will deal damage to you by half the attack of your monster. <br>\r\nYuma: 2650.<br>\r\nI set one card face down and end my turn.<br>\r\nSo now it is my turn Naruto said. I draw. Naruto looked at the card and then smiled. I can't believe it. This is the card I need. I summon This monster. Dopple Gainer Shinobi.<br>\r\nWith that a man with a orange and black jacket appeared.<br>\r\nDopple Gainer Shinobi<br>\r\nAttack: 1500<br>\r\nDefence: 1000<br>\r\nAnd now I activate his special appealty. Just then Two more Dopple Gainer Shinobi appeared. I get to summon a Dopple Gainer Token for every monster zone unoccupied by me.<br>\r\nDopple Gainer Token X 2<br>\r\nAttack: 1500<br>\r\nDefence: 1000<br>\r\nThey have the same attack points as the original. Yuma said.<br>\r\nBut there is more. Naruto then took a deep breath. I now Overlay Dopple Gainer Shinobi, Fist Fighter Shinobi, and Gential Giant Shinobi. To Xyz summon. Blazer Chakra Shinobi.<br>\r\nWith that a man with a red cloak and yellow energy around him appeared.<br>\r\nBlazer Chakra Shinobi<br>\r\nAttack: 3000<br>\r\nDefence: 3000<br>\r\nThat is alot. Yuma said. Oh no, What to do. <br>\r\nI activate his summon effect. I add all monster cards in my graveyard to Blazer Chakra as Overlay matrial. Naruto looked to his graveyard. Protective Madien Kunoichi. Naruto then took a good look at that card. Hinata. Okay now I can activate one of his effects by detaching an overlay unit I can prevent the activation of spell and traps until the end of the turn.<br>\r\nThis is bad. <br>\r\nNext, Since I retain Protective Madien Kunoichi as on overlay unit I can negate the effect of one monster. I choose your Gunsman. Now attack.  <br>\r\nYuma: 1150<br>\r\nYou are lucky. As I can't attack with my Dopple Gainer Tokens. So I set one card and end my turn.<br>\r\nMy move I draw. I summon Bull Blader, Attack: 1600. Next I summon Kagegokage. attack 1100. Next I overlay Bull Blader and Kagegokage to Xyz summon, Number 39: Utopia.<br>\r\nJust then a gold and white angel appeared. Attack: 2500.<br>\r\nA Number monster? Naruto wondered. <br>\r\nNow I attack.<br>\r\nWhy that?<br>\r\nI use Utopia's effect to negate then activate from my hand Double or Nothing So I can attack again with double the attack. Attack: 5000 <br>\r\nAttack.<br>\r\nThe attack hit.<br>\r\nNaruto: 1900.<br>\r\nHow is that? Yuma asked.<br>\r\nNice going. Naruto said. I active my facedown, Battle Ready. I can special summon a level four or lower monster from my graveyard. I summon Dopple Gainer Shinobi. <br>\r\nI end my turn. Yuma stated. Naruto, Unless you pull out a good move then you are going down. <br>\r\nI am not going to let a thing like your Utopia stop me. Naruto said.<br>\r\nSo show me what you got. Yuma said.<br>\r\nAlright here I go I draw. Naruto draw his card and then looked at it. It card. There is no way for me to use it.<br>\r\nYes there is. Kurama said.<br>\r\nNaruto leaned his head towards where Kurama is. What do you mean? Naruto whispered.<br>\r\nI show the text of Dopple Gainer Shinobi. This card...<br>\r\nMeanwhile with Yuma. What could Naruto be thinking about Astral?<br>\r\nI don't now but what ever it is it must involve that Dopple Gainer Shinobi. A white entity said to Yuma. But we must be careful.<br>\r\nReally I can do that? Naruto said out loud.<br>\r\nBack with Naruto. Okay Yuma I active an effect of Dopple Gainer Shinobi. By sending the top card of my deck to the grave Dopple Gainer can act as two monsters...<br>\r\nOh man That means he can Xyz summon a new monster. Yuma said. <br>\r\nNext I tribute my Dopple Gainer Shinobi treated as two, To summon Golden Flash Shinobi. With that a man in a white cape with red flames on it with golden blond hair appeared.<br>\r\nGolden Flash Shinobi<br>\r\nAttack: 2500<br>\r\nDefence: 2000<br>\r\nA tribute summon but why? Astral asked.<br>\r\nIf you are wondering Yuma I will explain. You see Golden Flash, has an effect that can help me win this duel but first I needed something else. Just then Dopple Gainer Shinobi appeared again.<br>\r\nWhy is Dopple Gainer, back? Yuma asked.<br>\r\nAs long as my life points are less then 2000, Battle Ready can be used to revive a monster until your next turn. So I now send then top card of my deck to the grave so to treat Dopple Gainer as two monsters. Now I Xyz summon a monster using My Dopple Gainer as matrial. Now behold as I summon... Sage Chakra Shinobi. Just then a man wearing a red cape with black flames on it appeared.<br>\r\nSage Chakra Shinobi<br>\r\nAttack: 2400<br>\r\nDefence: 2600<br>\r\nOnly 2400 attack. Astral said. What is he planning?<br>\r\nNext I active Sage Chakra's summon effect effect I can take the top three cards from my deck and place them on Sage Chakra as overlay Matiral. Now for every Overylay unit Sage Chakra gaines 200 more attack per unit.<br>\r\nAttack: 2400&gt;3400<br>\r\n3400 attack. Astral said. Yuma watch out.<br>\r\nIt is okay. Yuma said. <br>\r\nNow Sage Chakra attack.<br>\r\nI activate Utopia's effect and negate your attack. Yuma said. <br>\r\nJust like I wanted it. Naruto said. I attack With Golden Flash Shinobi and use his effect. Golden Flash headed straight for Utopia . Utopia tryed to swing it's blade. It seemed to hit but Naruto's life points remained the same.<br>\r\nWhat happened. Yuma asked. Golden Flash Shinobi appeared behind Yuma and took a knife and slashed before returning to Naruto. But how.<br>\r\nGolden Flash Shinobi, can attack my opponent's life points directly. But His attack is halven to do so.<br>\r\nYuma: 0<br>\r\nNaruto: WINS<br>\r\nJust then reality returned to normal. <br>\r\nThat was intence. Yuma said.<br>\r\nI know. But I think I can do better. Naruto said.<br>\r\nThen let's duel again.<br>\r\nAnother time K?<br>\r\nOk.<br>\r\nGood. Naruto said with a smile.<br>\r\nMan I have to go. Yuma said. I'm going to be late.<br>\r\nWonder why he is in a hurry?</span></span></div></div>",
            "created":1342014240,
            "id":1376246,
            "title":"The Next day."
        },
        "11511":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Random person.",
                "Random Person"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">After your duel with Yuma, you headed out for a walk. You found yout way to a park and was taking with Kurama in your head. Naruto, What is on your mind? Kurama asked.<br>\r\nIt's nothing, just. What happened to our world. Naruto said. I don't know what to do?<br>\r\nSame here. Kurama said. <br>\r\nNaruto then looked out word and noticed some kids running and playing. They look so happy. Naruto said to himself. I fell as if I can relax. But I can't.<br>\r\nRight. Kurama said. Also there is something that I am intrested in.  Naruto looked to Kurama. What about? he asked.<br>\r\nYuma was taking to someone while we were dueling. the fox said.<br>\r\nThen does that mean that Yuma is like me.<br>\r\nNo I don't think so. Kurama said. I did sence a presence other then Yuma's but the source is unknown.<br>\r\nis that so. Naruto asked. Well now reason to sweat.<br>\r\nYou are going to see Yuma now, aren't you. Kurama said.<br>\r\nNo, need. He is here. Just then Yuma appeared with his friends. <br>\r\nYuma then introduced them to naruto. Guy's this is Naruto, Naruto, these are my friends. Tori, pointed to the girl from last night, Brock, pointing to a heafty buy in an orange shirt, Caswall, pointing to a boy with a bowl cut, Cathy, pointing to a girl with gray hair and glasses and looked like she was a cat girl, and This is Flip, Pointing to a younger boy with a small bowler hat on. Nice to met you. They each said. <br>\r\nYou all to. Naruto said. <br>\r\nSo I hear you beat Yuma. Brock said. That is big.<br>\r\nWhy is that? Naruto asked.<br>\r\nYuma is the winner of the Heartland Carnival. Naruto was confused.<br>\r\nThat is a tournament that was hosted by Mr. Heartland. You read about it remember. Kurama said. <br>\r\nRight, why is that important.<br>\r\nIt is important because all the strongest duelists were there.<br>\r\nWHat ever. Naruto said.  I have to go know. Just then he felt somthing. He then turned around and ran off. Hey were are you going. Yuma asked. I fell it. Naruto said.<br>\r\nWhat is that all about. They then all followed him. once there they found that there was someone there. </span></span></div></div>",
            "created":1349286120,
            "id":1439550,
            "title":"Later that day"
        },
        "115111":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>To the others this was just a normal duel between two men but to Naruto it was more. One one side was a man that looked to be around twenty. His field was had three monsters that had 2400, 1300, and 2100 attack points respectively and had two face downs. \"You are a fool to think you can beat me.\" <br>\r\n\"Twenty\": 3500.<br>\r\nHis opponent is what got Naruto's attention. He was wearing a cloak but a dark feeling was coming from him. His field was empty.<br>\r\n\"Cloak\" 100.<br>\r\n\"With only 100 life points you are not going to win.\" The man said.<br>\r\n\"My move, I draw.\" The cloaked man said.<br>\r\n\"That voice.\" Naruto said.<br>\r\n\"I summon Ebon Winged Slasher.\" Level 4 Atk. 1300 Def. 900.  With that a human like monster with sharp black wings appeared. \"Next I activate it's effect.\" Just then two more appeared. \"Next with this three monsters I build the overlay network.\" The three Ebon Winged Slasher turned into light and then came together into a vortex. \"I excess summon, Ebon Cloak Avenger.\" Rank 4 Atk. 2350. Def. 1800. A cloaked man with a red eye appeared. \"Now I activate the spell card, Collateral Damage. With this card If an XYZ monster attacks I can destroy monsters my opponent control equal to the numbers of overlay units attached to my monster.\" Just then all of the man's monsters were destroyed. \"Next I activate equip spell, Blade of V. This sword allows me to attack and as I attack I can destroy all other spell and traps on the field and then increase the attack of my monster by 500 for each.\" Atk. 2350 -&gt; 3350. \"Attack.\" the monster attacked.<br>\r\n\"Twenty\": 3500 -&gt; 150.<br>\r\n\"Next, I activate it's effect and inflict damage equal to the damage inflicted to you as more damage.\"<br>\r\n\"Twenty\": 150 -&gt; 0<br>\r\n\"That is game.\" The cloaked man said as the duel ended and then started past them and Naruto noticed him.<br>\r\n\"Is that you? Sasuke?\" Naruto asked himself.</span></div></div>",
            "created":1363174680,
            "id":1549217,
            "title":"Random person."
        },
        "1152":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Naruto was a good sport about losing",
                "Naruto was a bad sport about losing",
                "Just then suddenly"
            ],
            "content":"<div class=\"\"><div> <span>That night Naruto was in his mindscape with Kurama tring desperately to learn how to play the game. \"UUHHGG!! Why dose this need to be so complicated!?\" Naruto yelled out in anger. Kurama Laughing uncontrollably couldn't respond. \"Oh haha its just so funny to you of coarse. Why don't you try to help me?\" Naruto asked feeling frustrated. Kurama managed to retain his laughter to answer the question \"How am I suppost to understand this game kit? It is true that I have vast knowledge about many things but I only came to this world as soon as you.\" \"Well isn't that perfect? Whatever I think I got the basics down, I'm going to bed.\"<br>\r\n<br>\r\nThe next morning---<br>\r\n<br>\r\n        Naruto awoke with a groan. He was still trying to swallow all the information that he forced in his head yesterday. He got up took a shower and went to the kitchen. At breakfast with the Tsukumos he and Yuma finally got around to that duel. \"Alright Naruto I remade my deck last night just for this.\" Yuma said eagerly. \"Okay well I'll do my best\" Naruto said as he put on his his duel disk and duel gazer. \"Alright, DUEL DISK GO!\" Yuma said as he through the screen piece up into the air and caught it on his are. \"Duel gazer on!\" Naruto simply put on his duel disk not seeing the point to Yuma's little trick. <br>\r\nDUEL START!!<br>\r\n<br>\r\nNaruto was amazed as reality shifted around him. \"Alright I go first!\" Yuma said \"Draw! I summon Gogogo Golem in def mode!\" A giant sideways cards appeared from nowhere and a blue humaniod crature that looked like it was made of rocks and had one eye appeared knelling on top of it. \"Now I set two cards face down and end my turn.\" Yuma as two face down cards appeared on the field. \"Okay my move I draw!\" Naruto said doing so. \"I summon Doubles!\" two human looking creatures appeared covered completely in bandages witch connected them and wearing brown trench coats and hats. Atk 900 Def 1200 level 3. \"Why would you summon that monster?\" Yuma asked \"Because\" Naruto replied \"If I overlay a dark attributed monster with doubles I can use him as both materials! And thats just what I intend to do! I overlay Doubles to XYZ summon!\" The bandages connecting the two human like creatures breaks each one of them turns into a purple light and a whirlpool of energy appears on the floor. The two lights go into and in a flash a new monster is there \"Meet, Dark Fox Blak\". A black fox about the size of a truck with three tails Atk2100 Def 1700. \"Now Blak attack Gogogo Golem!\" Naruto shouts the fox brings down its massive claws into the rock creature but it doesn't break. \"What?\" Naruto asked shocked that his attack failed \"Once per turn Gogogo Golem can escape destruction by battle!\" Yuma said \"Oh...well I place one card face down and end my turn\" Naruto said sounding disappointed \"Okay my move! I draw! I summon Ganbaba Knight!\" An armored man holding two shields appeared. \"Now I overlay Gogogo Golem and Ganbara Knight to XYZ summon Number 39: Utopia!\" Utopia was Glowing more then usual, but no one seemed to notice \"Now Utopia Attack Blak!\" Utopia Brought its mighty sword down upon the fox but right when the blade was about to make contact \"I Activate my trap card! XYZ Battle Brake!\" Naruto yelled getting excited \"This trap card negates an attack on a XYZ monster I control. but since the attack was done by a XYZ monster all Xyz Materials on both of them are detached as well!\" a large gust pushed through the room and all XYZ materials foating around vanished with it. \"Aw man. I end my turn.\" Yuma said \"Alright here I go! Draw! Nows the time where I turn the tide! Believe it! I sacrifice Blak and summon Hyper Shinobi!\" Blak vanishes and a man in an all black ninja suit appears Atk ? def 2000 \"Why is his attack a question mark?\" Yuma asked \"Give it a second.\" Naruto said. then Hyper Shinobi's Atk changed from ? to 3100. \"What!? How did it get so powerful?\" Yuma asked looking panicked. \"Hyper Shinobi's attack is equil to the monster used as tribute plus 1000! Now I activate the spell card Fissure!\" A giant hole Appeared in the ground and utopia fell in and was destroyed.\"Utopia!\" Yuma yelled out \"Now Hyper Shinobi attack Yuma directly!\" Hyper Shinobi rushed at Yuma at extream speed but then \"I activate my trap! Bye Bye Damage! This will Negate your attack and deal twice as much damage to you as it would have to me!\" Yuma said. Naruto Replied \"Wow thats really Over powered.\" \"I Know Wright?\" Narutos life points droped to zero instantly. \"That was fun duel. lets do it again some time.\" Yuma said as reality shifted back to normal.</span></div></div>",
            "created":1425265320,
            "id":1942136,
            "title":"That night"
        },
        "12":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "first anime",
                "second anime",
                "gx",
                "5Ds",
                "Zexal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where in the Yugioh Time line is he?</span></div></span></div>",
            "created":1328740020,
            "id":1273057,
            "title":"Where?"
        },
        "13":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "first anime",
                "second anime",
                "Gx",
                "5ds",
                "zexal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where in the Yugioh Time line is he?</span></div></span></div>",
            "created":1328740080,
            "id":1273059,
            "title":"Where?"
        },
        "14":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "First anime",
                "Second anime",
                "GX",
                "5Ds",
                "Zexal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where in the Yugioh Time line is he?</span></div></span></div>",
            "created":1328740080,
            "id":1273060,
            "title":"Where?"
        },
        "15":{
            "author_id":"ninjaman90",
            "author_name":"MasterDickmanto",
            "choices":[
                "first anime",
                "Second anime",
                "GX",
                "5Ds",
                "Zexal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where in the Yugioh Time line is he?</span></div></span></div>",
            "created":1328740140,
            "id":1273062,
            "title":"Where?"
        }
    },
    "info":{
        "author_id":"ninjaman90",
        "author_name":"MasterDickmanto",
        "brief_description":"What would be like if Naruto somehow found himself in the Yugioh Universe?",
        "created":1328739360,
        "description":"<td align=\"left\" class=\"norm\"><span style=\"line-height:2.0;\">What would it be like if Naruto some how got sent to the Yugioh Universe. What happens if Naruto becames a duelist and strives to became one of the top duelists in the world.<br>\r\nFor the second anime, Gx, and 5Ds:<br>\r\n<br>\r\nThe events written must but set at anime end but before the next series.<br>\r\n<br>\r\nThere are a few rules with the Naruto characters<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\n1. Naruto characters are the only ones to have OC decks.<br>\r\n2. Naruto's deck may have Synchro's or XYZ's but only if he is in the 5Ds and/or Zexal universe.<br>\r\n3. While Naruto is hard to defeat he is not unbeatable.<br>\r\n4. Naruto can not have key cards as other characters.<br>\r\n5. Kurama (the nine tails fox) is good and gives advise outside of duels.<br>\r\n6. No cross-pairings.<br>\r\n7. Other characters from the Naruto anime can be added.<br>\r\n8. No full Fox decks for Naruto. A few cards like this but no full decks for Naruto.<br>\r\n<br>\r\nOther then that have fun.</span></td>",
        "id":1846924,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1425265320,
        "modified":1425265320,
        "pretty_title":"Naruto: Ninja Duelist"
    }
}