{
    "chapters":{
        "1":{
            "author_id":"wgboy1",
            "author_name":"Fatboy",
            "choices":[
                "Create your character!"
            ],
            "content":"<div class=\"\"><div> <span>The year is 78 AD, the height of the roman empire. Emperor Trajan rules the empire. You are a Roman Centurion, commanding a Cohort of 800 Legionaries. But what do you look like? What kind of a person are you? Where were you born? How did you live as a citizen of the empire? Or did you work your way out of slavery in a man's villa?</span></div></div>",
            "created":1341482220,
            "id":1372239,
            "title":"Beginnings are a delicate time."
        },
        "11":{
            "author_id":"wgboy1",
            "author_name":"Fatboy",
            "choices":[
                "Benvinius Varian, Roman Noble",
                "Darius Barranius, Poor Citizen of Rome",
                "Biocrotes Euoda, Former Greek Slave",
                "Diparitus Sardinus, Roman Senator",
                "Custom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who exactly are you?</span></div></span></div>",
            "created":1341556680,
            "id":1372729,
            "title":"Choose already!"
        },
        "114":{
            "author_id":"wgboy1",
            "author_name":"Fatboy",
            "choices":[
                "Inside the camp...",
                "Fast forward to the trek through the Alps."
            ],
            "content":"<div class=\"\"><div> <span>Diparitus was born to the incredibly rich Sardinus family, politicians ever since the kings were overthrown. His ancestor helped pass the vote to attack carthage. Another helped murder caesar, on the senate floor.His Grandfather aided Octavian Caesar after his takeover. Diparitus had inherited the position of senator, but he had to serve in the roman army for a year. He was raised in his Etrurian Villa, In what is now tuscany. His father, Sepiritus Sardinus was well known amidst the senate members, he established a policy of feeding the poor with excess wheat porridge from Villa harvests. Diparitus used his contacts to earn himself a position as centurion, over 800 men. But he has yet to overcome his hubris, for he thinks hismelf invincible.<br>\r\n_________________________________________________________<br>\r\n<br>\r\nHe marched with the rest of the cohort, along the cobbled road. Titanic-sized mountains loomed in the distance. Every soldier knew what they were. The Alps had been Italy's greatest advantage: They weakened hannibal as he marched into italy, as to prepare him for Zama, his ultimate defeat. The Gauls dared not to pass it, or they'd be subject to raining javelins. Through these, Caesar's legions marched as they prepared to conquer gaul. He wondered if he would be amongst the names of men who marched through these beasts of mountains. He saw a plume of smoke rising ahead of them, peaking wooden tips above the pines. 'A Fort.' He thought. 'Our destination.' He heard horse hooves, beating upon the trodden road. 'That'll be the general.' he thought, raising his gladius. \"COMPANY,HALT!\" he called, in his loudest voice. The cohort halted, as an enterouge of 45 men approached on horse. One man, to the far left of the group had a massive horsehair plume coming from his helmet, a red cape billowing behind him. The General sighed, looking amidst the men, and turned to an aide at his side. The aide said something in return. The general nodded. He then turned to the column of men. \"Legion of Rome! Welcome to Fort Tarquinii! Here, we prepare men for their journey over the alps! And we have quite a challenge to do indeed! Emperor Trajan, blessed be his name, has issued the order to attack a hostile tribe of Germanics! You have heard things of these men, about how they can cleave a man into five pieces with one blow! About how they chop down trees with their bare hands! About how their chest hair serves as their armor, it's so thick! But! These rumors about them are NOTHING compared to us! We are romans! If we command a path to open through an ocean, a road will appear! If we tell the mountains to crumble, they collapse like a dead man! Arrows tremble before us, and refuse to even make contact! Walls can not save barbarian scum from the romans! So don't fear these damn germans! They  mightbe fierce, but they're just men. Men can die!\" The general basked in the massive cheering erupting from the cohorts. He and his enterouge then rode away, and Diparitus yelled. \"COMPANY! AD-VANCE!\" The Legion advanced, the entirety of the wooden wall coming into view.</span></div></div>",
            "created":1341558180,
            "id":1372738,
            "title":"Camping beneath the Titans."
        },
        "1141":{
            "author_id":"wgboy1",
            "author_name":"Fatboy",
            "choices":[
                "Exercise in the room; Fitness keeps the centurion well in battle!",
                "Study tactics with other officers in the mess hall; Knowledge is power.",
                "Walk along the walls, One must be ever vigilant."
            ],
            "content":"<div class=\"\"><div> <span>The fort's gate was massive, spanning at least 20 feet. A centurion stood atop the gate, and he barked out an order. The gates were thrown open.<br>\r\nThe fort was filled with wooden buildings on the far sides, equipment sheds in front of them, and tents nearest to the central path through the fort. Legionaries marched about, maintaining their equipment. Slaves marched through another gate to the east, past a sign labeled 'MINES'. Lashes resounded throughout the sorrowful line of mud-slathered men. Many of them had a look of grave disdain upon their faces. But this did not concern Diparitus. He simply kept watch over his cohort, their armor rattling and clanking as they marched.<br>\r\n_______________________________________________________________________<br>\r\n<br>\r\nThey halted near the center, and several officers approached them, sorting them out into the various barracks. The cohort was stationed in the tents to the left. The higher-ranked soldiers were stationed in the wooden buildings. The centurion silently thanked jupiter that he had a friend pay for his entry as a centurion. He marched into the barracks, it had a crackling fireplace at the very end of the hall, and freshly-made straw-mattressed beds in the quarters. Slaves were hurried about, scuttling to and fro. The centurion walked for what seemed an eternity, until he found a door with no-one's name on it. He shrugged, and walked inside. A slave scurried after he shut the door, and a hammer was pounding on the door. After he set down his pole of equipment, and assorted it throughout the room, he looked outside. His name appeared thus on the door:<br>\r\n'CENTURIO DIPARITUS'<br>\r\n<br>\r\n'Strange, my name on a door.' he thought. He thought on what to do as he stood in his room.</span></div></div>",
            "created":1341815760,
            "id":1374581,
            "title":"Arrival in the fort."
        }
    },
    "info":{
        "author_id":"wgboy1",
        "author_name":"Fatboy",
        "brief_description":"You're a centurion in ancient rome, but you have dreams.\r\n",
        "created":1341481920,
        "description":"<td align=\"left\" class=\"norm\">Hello, everyone, and welcome to my story. I created this, inspired by someone who created a story that involved a roman general and senators. I cannot for the life of me remember what it was called, but, anyways, on with the story!<br>\r\nRULES:<br>\r\n1. Be historically accurate. No watches, Clocks, Guns, or anything that the Ancient Romans would not have. <br>\r\n2. Try to be gramatically correct with what you write. I don't want to see 'N dn dey shuuts de rrows tords da brbrins LOL'<br>\r\n3. If you need any information, message me personally.<br>\r\n4. BE CREATIVE! I don't want to limit your imaginations.<br>\r\n<br>\r\nFeel free to be as explicit with your material as you wish, just don't stagnate the story.</td>",
        "id":1877771,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1341815760,
        "modified":1341815760,
        "pretty_title":"Ambition"
    }
}