{
    "chapters":{
        "1":{
            "author_id":"zinkro",
            "author_name":"zinkro",
            "choices":[
                "Go back to sleep. You don't have to get up",
                "Go out to find your roommate ",
                " Go out for your morning jog",
                "Walk downstairs and see about getting the paper",
                "Go upstairs to visit the upper neighbors"
            ],
            "content":"<div class=\"\"><div> <span>You wake up to the sound of a loud noise. Must be one of the neighbors and you're not sure which one it is. Though you have a general idea of each neighbor you don't know all of them. As you get up from your small bed, you let out a sigh. You wonder how you as a human have survived in this world of massive anthros. Most humans would've been stomped under paws, eaten, or endured other lousy fates but you got lucky. You found this apartment for shelter. Sure you have to share it with a sheep girl since you're too small to pay the rent yourself but there's always gotta be a compromise.<br>\r\n<br>\r\nYou remember how dangerous and chaotic this apartment could be. Some of the neighbors can be dangerous in multiple ways. And worse others are indifferent to you meaning they will allow horrible things to happen to you. Your self esteem has no doubt taken a hit.<br>\r\n<br>\r\nYou wonder where your roommate could be.<br>\r\n<br>\r\nYou let out another sigh. Well, it's the beginning of the day. What do you do?</span></div></div>",
            "created":1576038000,
            "id":2758067,
            "title":"The Beginning"
        }
    },
    "info":{
        "author_id":"zinkro",
        "author_name":"zinkro",
        "brief_description":"Can a human survive in a building full of giantess anthros?",
        "created":1552582680,
        "description":"<td align=\"left\" class=\"norm\">Let's start with the rules:<br>\r\n<br>\r\n- No fat females or weight gain<br>\r\n- No odor, bad smells, or sweat<br>\r\n- No scat, fart, pee, toilet stuff<br>\r\n- No gay stuff<br>\r\n- Leave other routes open just in case.<br>\r\n<br>\r\nTry to have good/decent grammar and try to be descriptive. Chapters that are poorly written or overly short or purely nonsensical will just be deleted.<br>\r\n<br>\r\nYou are RT a young human male who is trying to survive in this world where giantess anthros reign supreme. Humans are only a few inches tall compared to the anthros and despite being capable of finding work have no rights so the anthros can do whatever they like. You've managed to find a place on the second floor at the Anthro Arms apartment building. But the possibility of danger still exists, every apartment houses an anthro giantess and they have mixed feelings towards you. Some of these ladies hate humans, others are indifferent to them, others see humans as pets, others see humans as slaves, some view humans as something to eat, while others are gentle, etc. And they all have different types of jobs, some of these anthro ladies work as educators, in law enforcement, hospitals, etc.<br>\r\n<br>\r\nTara Wool - Your roommate a sheep anthro. The conditions of you living in the apartment was that you share a room with someone and lucky for you this sheep girl gave you a good first impression not needing to look at anyone else starting by the fact that she's not likely to eat you so you chose her quickly. Despite being roommates you don't know much about Tara besides that she works as a writer and that's because of her shy personality. She also has a great figure in general.<br>\r\n<br>\r\nZira Stripes - Great looks don't mean anything if the personality is no good. Zira is a tigress as well as your landlady and she hates humans, seeing them as a nuisance. You are amazed that she allowed you to live here. She has warned you that in case you cause problems there would be consequences.<br>\r\n<br>\r\nYou can add more female characters that inhabit the building's multiple floors. And even add new females if the main lead ends up somehow accompanying the females to their place of work.</td>",
        "id":2185362,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1576039200,
        "modified":1576039200,
        "pretty_title":"Anthro Arms"
    }
}